{
  "title": "Captive chimpanzee takes down a drone: tool use toward a flying object",
  "url": "https://openalex.org/W1276242696",
  "year": 2015,
  "authors": [
    {
      "id": null,
      "name": "van Hooff, Jan A. R. A. M.",
      "affiliations": [
        "J.M. Burgerscentrum"
      ]
    },
    {
      "id": null,
      "name": "Lukkenaar, Bas",
      "affiliations": [
        "J.M. Burgerscentrum"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1998536569",
    "https://openalex.org/W2100674550",
    "https://openalex.org/W2095747539",
    "https://openalex.org/W796238542",
    "https://openalex.org/W2063770628",
    "https://openalex.org/W2111492132",
    "https://openalex.org/W2015931708",
    "https://openalex.org/W4230658767",
    "https://openalex.org/W4255514518",
    "https://openalex.org/W2033421187",
    "https://openalex.org/W2044631452",
    "https://openalex.org/W2079931018",
    "https://openalex.org/W2019383977",
    "https://openalex.org/W1644240647",
    "https://openalex.org/W2065522559",
    "https://openalex.org/W1970852128",
    "https://openalex.org/W2025902933",
    "https://openalex.org/W2497508487",
    "https://openalex.org/W2001431842",
    "https://openalex.org/W636238115"
  ],
  "abstract": "On 10 April 2015, a Dutch TV crew was filming at the Royal Burgers Zoo in Arnhem, The Netherlands. It was the intention to film the chimpanzees in the enclosure from close-by and from above with the means of a drone. When the drone came a bit closer to the chimpanzees, a female individual made two sweeps with a branch that she held in one hand. The second one was successful and downed the drone. The use of the stick in this context was a unique action. It seemed deliberate given the decision to collect it and carry it to a place where the drone might be attacked. This episode adds to the indications that chimpanzees engage in forward planning of tool-use acts.",
  "full_text": "NEWS AND PERSPECTIVES\nCaptive chimpanzee takes down a drone: tool use toward a ﬂying\nobject\nJan A. R. A. M. van Hooff 1 • Bas Lukkenaar 1\nReceived: 15 June 2015 / Accepted: 4 August 2015 / Published online: 3 September 2015\n/C211The Author(s) 2015. This article is published with open access at Springerlink.com\nAbstract On 10 April 2015, a Dutch TV crew was ﬁlming\nat the Royal Burgers Zoo in Arnhem, The Netherlands. It\nwas the intention to ﬁlm the chimpanzees in the enclosure\nfrom close-by and from above with the means of a drone.\nWhen the drone came a bit closer to the chimpanzees, a\nfemale individual made two sweeps with a branch that she\nheld in one hand. The second one was successful and\ndowned the drone. The use of the stick in this context was a\nunique action. It seemed deliberate given the decision to\ncollect it and carry it to a place where the drone might be\nattacked. This episode adds to the indications that chim-\npanzees engage in forward planning of tool-use acts.\nKeywords Chimpanzee /C1Tool use /C1Drone /C1Weapon use\nIntroduction\nOn 10 April 2015, video recordings were made at the Royal\nBurgers Zoo in Arnhem, The Netherlands, for a docu-\nmentary. The ﬁlming was done with a camera-equipped\ndrone to obtain aerial scenes of the animals and their\nenclosures. Also the chimpanzees were to be ﬁlmed from\nunusual angles. This inadvertently resulted in a remarkable\nexample of tool use by one of the chimpanzees housed in\nthis zoo colony, namely the use of a stick to ‘‘attack’’ and\ntake down the drone.\nSpontaneous and adaptive use of tools, in particular sticks,\nis abundant in this colony. Sticks of different sizes and shapes,\nlogs, stones, etc., occur naturally in the area. Different arti-\nﬁcial objects, such as boxes and rags, are introduced into the\narea occasionally. There has never been any explicit teaching\nof tool use, although the animals have had ample opportunity\nto watch humans handling all kind of implements.\nTakeshita and van Hooff ( 2001) identiﬁed 13 types of\ntool use in this colony. The animals appeared to choose the\nsize, shape, and weight of the tools with a particular use in\nmind. The tools are applied ﬂexibly in a variety of ways.\nThus, suitable objects are used as bowls, ladles, and cups to\nscoop up and carry water. Appropriate beams, trunks or logs\nare set up as stools or erected as ladders to get to places out\nof reach. Slender, long branches are chosen to rake in\nobjects ﬂoating in the moat that surrounds the colony’s\nisland. These are also used to ﬂail fresh leaves from over-\nhead branches of living trees protected by electriﬁed wire\nfrom chimpanzees attempting to climb them. Short, sturdier\nsticks are thrown straight upward with force to hit loose\nfresh foliage from overhanging branches. Heavy pieces of\nwood and stones are chosen as throwing weapons, as hap-\npened, for instance, during an experiment in which a stuffed\nlion was suddenly revealed on the outer side of the moat\nsurrounding the ﬁeld. This has been nicely documented in\nBert Haanstra’s (1984) documentary ﬁlm about the Arnhem\nZoo colony, ‘‘The Family of Chimps ,’’ which also shows\nvarious other ﬂexible uses of tools in this colony.\nMethods\nRoyal Burgers Zoo in Arnhem, The Netherlands, is known\nfor its chimpanzee community, which was founded in\n1971. At the time it was noteworthy because it was a\nElectronic supplementary material The online version of this\narticle (doi: 10.1007/s10329-015-0482-2) contains supplementary\nmaterial, which is available to authorized users.\n& Jan A. R. A. M. van Hooff\njaramvanhooff@gmail.com\n1 Royal Burgers Zoo, Antoon van Hooffplein 1,\n6816 SH Arnhem, The Netherlands\n123\nPrimates (2015) 56:289–292\nDOI 10.1007/s10329-015-0482-2\nsuccessful attempt to keep a social group of considerable\nsize and near to natural composition in captivity. The\ncolony lives in a spacious enclosure of about 0.7 ha sur-\nrounded by a water-ﬁlled moat. It is a sloped ﬁeld, partly\nsandy, partly grassy, with shrubs and large trees. The latter\nare protected against the destructive habits of the chim-\npanzees by electriﬁed wire. However, a small number of\ntrees had been sacriﬁced to the chimpanzees’ appetite for\nfresh green leaves and bark. These trees had gradually died\nand have been integrated into high climbing scaffolding\nwith ropes and swings. Descriptions of the area and the\nmanagement can be found in van Hooff ( 1973) and Adang\net al. ( 1987). This multimale multifemale colony has\nbecome renowned for the studies of social behavior that\nhave been conducted there, e.g., on ‘‘political’’ scheming\nand coalition formation, especially of the adult males (de\nWaal, 1982).\nIt was the camera crew’s intention to ﬁlm the enclosure\nand the chimpanzees from close-by and from above by\nmeans of a drone-mounted camera. The recordings were\nmeant to be used for a public relations (PR) documentary.\nThe episode was not set up as a scientiﬁc experiment.\nThere was no systematic behavior recording during the\ntrial with the drone. The team present on the occasion\nshared what they saw from their memory immediately\nafterwards. The information was gathered by a zoo ofﬁ-\ncial who supervised the event, the second author Bas\nLukkenaar.\nThe stick that was used to hit the drone was a willow\ntwig of about 180 cm length. There are often willow twigs\nlying around. These are remnants of willow branches that\nhave been given to the chimpanzees as a feeding pastime.\nThe chimpanzees like to peel off the bark and eat the soft\ninner lining. The remnants of the branches are not removed\nafter they have been stripped of their bark but are left in the\nﬁeld to play with.\nResults and discussion\nA trial run was made without recordings being made.\nWhen the drone took off from the ground and made some\nmaneuvers near and over the area, its visual appearance\nand humming noise caused some excitement initially. At\nthis stage all chimpanzees were still on the ground. Some\nwere seen to grab a willow branch, and four of them were\nseen to climb the scaffolding on the side where the drone\nwas hovering, holding a branch. At this stage the signif-\nicance of what was happening was not obvious to the\nteam.\nThen a ﬂight was made with the camera live. This ﬂight\nstarted from outside the enclosure to make a survey shot\nof the area. The camera drone slowly entered the\n‘‘airspace’’ above the apes at a height of ten to ﬁfteen\nmeters. By this time the chimpanzees were quiet again.\nSubsequently the operator closed in on two individuals\nthat had settled at a height of about 5 m on the side of the\nscaffolding where the drone was and had been. These were\nthe female Tushi, born in the colony in 1992, and the\nfemale Raimee, born in 1999. Tushi moved towards the\nend of a beam in the direction of the hovering drone. The\noperator of the drone had clearly underestimated the sig-\nniﬁcance of the fact that both individuals had carried with\nthem a long twig when they climbed the scaffolding. This\nis not a frequently observed behavior of these chim-\npanzees. When the drone came close, Tushi made two\nlong sweeps with her branch, which she held in her left\nhand. The second one was successful and brought the\ndrone down (Fig. 1). The drone was broken, but the\ncamera continued ﬁlming. Apart from subsequent lengthy\nand motionless exposures of the sky and overhead bran-\nches, the camera also caught some footage of inquisitive\nfaces of chimpanzees as they inspected and moved this\nstrange contraption (see: https://www.youtube.com/watch?\nv=Z_zw8h4epQM; Online Resource 1). Initially the apes\napproached the motionless drone with caution, touching\nand moving it using short sticks. There followed some\nhandling, dragging, and throwing about of the object, after\nwhich all of the chimpanzees lost interest. The identity of\nthe individuals that handled the drone was not established,\nbecause by then the team was caught up with the measures\ntaken to rescue the drone.\nThe sequence of events is highly suggestive of an\ninterpretation of the use of the stick as a planned, deliberate\nFig. 1 A female chimpanzee named Tushi used a stick to ‘ ‘attack’’\nthe drone. Behind her Raimee is also sitting with a long stick\n290 Primates (2015) 56:289–292\n123\naction to ‘‘attack’’ the drone (agonistically motivated) or\n‘‘ﬁnd out about’’ the drone (curiosity motivated), given the\ndecision to collect the stick and take it to a place where the\ndrone might come within reach. However, another expla-\nnation cannot be fully excluded, i.e., that the chimpanzees\ngrabbed a stick in a defensive ‘‘reﬂex’’ when the drone\nappeared. They then accidentally kept it when they climbed\nthe scaffolding. Subsequently one individual, Tushi, found\nherself in a situation where the proximity of the drone\nreleased once more a defensive reﬂex to lash out. This two-\nstage reﬂex explanation may be cognitively more parsi-\nmonious, but it certainly is not simpler. The fact that Tushi\nmoved towards an exposed position on the side where the\ndrone was hovering and stayed there favors the ﬁrst\ninterpretation, as does her facial expression. There is a\nmomentaneous grimace just before and during the act of\nstriking. The face is tense, the teeth are bared, but there is\nno retraction of the mouth corners as in a ‘‘fear’’ face,\nwhich would have suggested that it is an agonistically\nmotivated reﬂex. The precise coincidence of the facial\ngrimace with the strike suggests that it is a concomitant of\nan assertive and determined exertion of force, homologous\nto what humans do in comparable situations.\nBoth in the wild and in (semi)captive settings, chim-\npanzees regularly use tools in a variety of motivationally\nand functionally different contexts (e.g., McGrew 1992,\n2004; Boesch 2013). Thus, they regularly incorporate\nbranches into their intimidation displays. Also, use of\nsticks or clubs as handheld weapons or projectiles has been\nreported from the wild (e.g., Goodall 1986). In early and\nremarkable experiments conducted by Adriaan Kortlandt in\nthe 1970s (for a ﬁlm see Kortlandt 1993), he confronted a\ngroup of chimpanzees with a stuffed leopard that was made\nto suddenly appear from under a hide. The chimpanzees\nspontaneously took large pieces of wood that Kortlandt had\nthrown around in the area beforehand and used them as\nclubs when attacking and destroying the leopard. A similar\nexperiment, done at Arnhem Zoo, was ﬁlmed by Haanstra\n(1984). Boesch ( 1995) mentioned the use of clubs as\nweapons also in the natural situation against a live leopard.\nThe adaptation of sticks and their use as spears by West\nAfrican chimpanzees to hunt galagos is also remarkable\n(Pruetz and Bertolani 2007). However, despite a superﬁcial\nresemblance to the former behaviors, the motivational and\nfunctional context of this form of tool use is different from\nthat of weapon use. It is not motivated by agonistic ten-\ndencies. It is a method to procure food and as such is\ncomparable to the use of twigs or sticks in capturing ter-\nmites or ants.\nTool use of primates, especially chimpanzees (McGrew\n2004) and orangutans (van Schaik et al. 2003), is both\nvariable and often population speciﬁc. A similar variety is\nfound in the Arnhem captive chimpanzee population\n(Takeshita and van Hooff 2001). Some tool-use behaviors\nrecorded there have rarely if at all been seen in the wild.\nArnhem chimpanzees may deter or tease others by\nthrowing handfuls of loose sand in their face (Adang\n1984). This habit was popular in the 1980s, but has\nsubsequently all but died out. Another example is the use\nof rags in a solitary game resembling blind man’s buff\nand during a playful ‘‘peek-a-boo’’ interaction in which\none individual hides its face under a towel. At Arnhem\nZoo, both the necessity (the wish to get to otherwise\nunaccessible places) and the ‘‘ecological’’ opportunities\n(both the availability of incentives and of suitable objects)\nclearly inﬂuence the development of these behaviors (cf.\nKoops et al. 2014). These observations and the present\nepisode add to the growing evidence about the cultural\nﬂexibility that chimpanzees show and their ability to\nengage in forward planning of speciﬁc acts and general\nactivities (e.g., Janmaat et al. 2014; Osvath 2009; Mulc-\nahy and Call 2006).\nOpen Access This article is distributed under the terms of the\nCreative Commons Attribution 4.0 International License ( http://crea\ntivecommons.org/licenses/by/4.0/), which permits unrestricted use,\ndistribution, and reproduction in any medium, provided you give\nappropriate credit to the original author(s) and the source, provide a\nlink to the Creative Commons license, and indicate if changes were\nmade.\nReferences\nAdang OMJ (1984) Teasing in young chimpanzees. Behaviour\n88:98–122\nAdang OMJ, Wensing JAB, van Hooff JARAM (1987) The Arnhem\nZoo colony of chimpanzees: development and management\ntechniques. Int Zoo Ybk 26:236–248\nBoesch C (1995) Innovation in wild chimpanzees ( Pan troglodytes ).\nInt J Primatol 16:1–16\nBoesch C (2013) Ecology and cognition of tool use in chimpanzees.\nIn: Sanz C (ed) Tool use in animals—cognition and ecology.\nCambridge University Press, Cambridge, pp 21–47\nde Waal FBM (1982) Chimpanzee politics, power and sexamong\napes. Jonathan Cape, London\nGoodall J (1986) The chimpanzees of Gombe: patterns of behavior.\nHarvard University Press, Cambridge\nHaanstra B (1984) The family of chimps. http://www.ovguide.com/\nthe-family-of-chimps-9202a8c04000641f800000001f72e61c\nHicks TC, Fouts R, Fouts D (2005) Chimpanzee ( Pan troglodytes )\ntool use in the Ngotto Forest, Central African Republic. Am J\nPrimatol 65:221–237\nJanmaat K, Polansky L, Ban SD, Boesch C (2014) Wild chimpanzees\nplan their breakfast time, type, and location. Proc Natl Acad Sci\n111(46):16343–16348. doi: 10.1073/pnas.1407524111\nKoops K, Visalberghi E, van Schaik CP (2014) The ecology of\nprimate material culture. Biol Lett 11:20140508. doi: 10.1098/\nrsbl.2014.0508\nKortlandt A (1993) Chimpanzees in the wild. Film, Wisconsin Reg.\nPrim. Res. Ctr. Library. Also on: https://www.youtube.com/\nwatch?v=bKpZUsRJWBg\nPrimates (2015) 56:289–292 291\n123\nMcGrew WC (1992) Chimpanzee material culture: implications for\nhuman evolution. Cambridge University Press, Cambridge\nMcGrew WC (2004) The cultured chimpanzee: reﬂections on cultural\nprimatology. Cambridge University Press, Cambridge\nMulcahy NJ, Call J (2006) Apes save tools for future use. Science\n312:1038\nOsvath M (2009) Spontaneous planning for future stone throwing by\na male chimpanzee. Curr Biol 19:190–191\nPruetz JD, Bertolani P (2007) Savanna chimpanzees ( Pan troglodytes\nverus) hunt with tools. Curr Biol 17:412–417\nTakeshita H, van Hooff JARAM (2001) Tool use by chimpanzees\n(Pan troglodytes ) of the Arnhem Zoo community. In: Mat-\nsuzawa T (ed) Primate origins of human cognition and behavior.\nSpringer, Tokyo, pp 519–536\nvan Hooff JARAM (1973) The Arnhem Zoo chimpanzee consortium:\nan attempt to create an ecologically and socially acceptable\nhabitat. Int Zoo Ybk 13:195–205\nvan Schaik CP, Ancrenaz M, Borgen G, Galdikas B, Knott CD,\nSingleton I, Suzuki A, Utami SS, Merrill M (2003) Orangutan\ncultures and the evolution of material culture. Science 299:102–105\n292 Primates (2015) 56:289–292\n123",
  "topic": "Drone",
  "concepts": [
    {
      "name": "Drone",
      "score": 0.9453275203704834
    },
    {
      "name": "Animal ecology",
      "score": 0.8369718790054321
    },
    {
      "name": "Crew",
      "score": 0.6113864779472351
    },
    {
      "name": "Context (archaeology)",
      "score": 0.59236079454422
    },
    {
      "name": "Aeronautics",
      "score": 0.535269021987915
    },
    {
      "name": "Object (grammar)",
      "score": 0.49249181151390076
    },
    {
      "name": "Action (physics)",
      "score": 0.49085384607315063
    },
    {
      "name": "Communication",
      "score": 0.4279331564903259
    },
    {
      "name": "Psychology",
      "score": 0.28721851110458374
    },
    {
      "name": "Computer science",
      "score": 0.27891287207603455
    },
    {
      "name": "Geography",
      "score": 0.25231656432151794
    },
    {
      "name": "Artificial intelligence",
      "score": 0.22121164202690125
    },
    {
      "name": "Ecology",
      "score": 0.18562033772468567
    },
    {
      "name": "Engineering",
      "score": 0.167237788438797
    },
    {
      "name": "Archaeology",
      "score": 0.12190422415733337
    },
    {
      "name": "Biology",
      "score": 0.11089971661567688
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    },
    {
      "name": "Physics",
      "score": 0.0
    },
    {
      "name": "Genetics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I4210134898",
      "name": "J.M. Burgerscentrum",
      "country": "NL"
    }
  ],
  "cited_by": 66
}