{
  "title": "Superconducting Transformer Design and Construction",
  "url": "https://openalex.org/W128830652",
  "year": 2020,
  "authors": [
    {
      "id": null,
      "name": "Chew, En Phin",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2095546684",
    "https://openalex.org/W157265036",
    "https://openalex.org/W2504192945",
    "https://openalex.org/W2021030805",
    "https://openalex.org/W1989349114",
    "https://openalex.org/W625272755",
    "https://openalex.org/W2146457264",
    "https://openalex.org/W2165964158",
    "https://openalex.org/W1549195150",
    "https://openalex.org/W2080542560",
    "https://openalex.org/W1589343046",
    "https://openalex.org/W3022780580",
    "https://openalex.org/W2296977922",
    "https://openalex.org/W2011624552",
    "https://openalex.org/W2014437371",
    "https://openalex.org/W2225530434",
    "https://openalex.org/W2146051148",
    "https://openalex.org/W1523379781",
    "https://openalex.org/W2067256547"
  ],
  "abstract": "This thesis first outlines the testing undertaken on a partial core superconducting transformer under open circuit, short circuit, full load and endurance test conditions. During the endurance test, a failure occurred after 1 minute and 35 seconds. During the failure, voltage dipping and rapid liquid nitrogen boil off was observed. This prompted a failure investigation which concluded that the lack of cooling in the windings was the most probable cause to the failure. Full core transformer and superconductor theories are then introduced. A copper winding transformer model, based on a Steinmetz equivalent circuit and a reverse design method, is described. A superconductor loss model which outlines the different types of losses experienced under AC conditions is used to determine the resistance of the windings in the Steinmetz equivalent circuit. This resistance changes with the magnitude of current and the strength of the magnetic field that is present in the gaps between each layer of the windings. An alternative leakage flux model is then presented, where the flux is modelled based on the combination of the reluctance of the core and the air surrounding the windings. Based on these theories, an iterative algorithm to calculate the resistance of the superconductor is developed. A new design of a 15kVA single phase full core superconducting transformer, operating in liquid nitrogen, is presented. The issues with building the superconducting transformer are outlined. First, a copper mockup of the superconducting transformer was designed where the mockup would have the same tape and winding dimensions as the superconducting transformer, which means the same core can be used for two different sets of windings. This led to designing a core that could be easily taken apart as well as reassembled. Construction of the core, the copper windings and the superconductor windings ensued. The process of cutting the core laminations, insulating the copper and superconductor tapes, and making the steel fasteners and terminations are described. The copper mockup and superconducting transformers was then tested under open circuit, short circuit, different load and endurance conditions at both liquid nitrogen and room temperatures. These test results were then compared with the those from two models. The comparison showed a significant inaccuracy in the reactances in the models. This introduced a correction factor into the superconductor model which ii made it more accurate. However, further work is required to explain and quantify the correction factors for the copper transformer model under different load conditions.",
  "full_text": null,
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.5290913581848145
    },
    {
      "name": "Electrical engineering",
      "score": 0.3777627944946289
    },
    {
      "name": "Computer science",
      "score": 0.3474445641040802
    },
    {
      "name": "Engineering",
      "score": 0.3405121862888336
    },
    {
      "name": "Voltage",
      "score": 0.11579421162605286
    }
  ]
}