{
  "title": "Modeling and Protection of Phase Shifting Transformers",
  "url": "https://openalex.org/W162288880",
  "year": 2013,
  "authors": [
    {
      "id": "https://openalex.org/A5086037920",
      "name": "Umar Khan",
      "affiliations": [
        null
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1581684273",
    "https://openalex.org/W1535749512",
    "https://openalex.org/W2031121098",
    "https://openalex.org/W2782603476",
    "https://openalex.org/W2041010714",
    "https://openalex.org/W2126869393",
    "https://openalex.org/W2108125817",
    "https://openalex.org/W1985366341",
    "https://openalex.org/W1978285438",
    "https://openalex.org/W2030903719",
    "https://openalex.org/W1975409523",
    "https://openalex.org/W2112869998",
    "https://openalex.org/W2105502312",
    "https://openalex.org/W2164519446",
    "https://openalex.org/W2106021242",
    "https://openalex.org/W2129211420",
    "https://openalex.org/W2054520146",
    "https://openalex.org/W1489718105",
    "https://openalex.org/W2171570328",
    "https://openalex.org/W2118204229",
    "https://openalex.org/W2135825995",
    "https://openalex.org/W1500530370",
    "https://openalex.org/W1531117044",
    "https://openalex.org/W2098123818",
    "https://openalex.org/W1667098114",
    "https://openalex.org/W2115282234",
    "https://openalex.org/W2169863061",
    "https://openalex.org/W1624675529"
  ],
  "abstract": "This thesis is mainly focused on the development of (i) phase shifting transformers (PSTs) mathematical and simulation models that can be used for the short-circuit and protection studies, and (ii) new phase shifting transformers protection methods that provide more secure and sensitive solutions than the standard current differential protection.\\nThe first part of this thesis describes and presents the modeling of the single-core standard-delta, and two-core symmetrical and asymmetrical PST for protection and short-circuit studies. The models already available for such types of PSTs have limitations and require detailed test report data from the manufacturers. However, winding test data at each tap position is seldom available from the manufacturers. Moreover, they are confined to the balanced system conditions. The proposed modeling approach is based on the development of positive, negative and zero-sequence networks. Derived mathematical relations are further used to develop the relations of winding terminal voltages, currents and impedances as a function of tap position. Accuracy of the presented models is verified mathematically with the manufacturer’s test report data. Furthermore, electromagnetic transients program (EMTP) modeling, in commercially available simulation tools such as PSCAD/EMTDC and RTDS, is done in order to further verify the proposed models. The proposed modeling approach does not rely on the availability of the manufacturer test report data and only requires the nameplate information. It can also be used for both balanced and unbalanced system conditions.\\nThe second part of the thesis presents two protection principles: (a) electromagnetic differential protection, and (b) directional comparison-based protection. The main motive behind the development of new protection principles is to develop a solution that is more secure, sensitive and offers high-speed protection. Correct implementation of these techniques for the protection of various kinds of PSTs comes across various problems and hence leads us to the proposed solution of those issues. Both techniques solve the problems of conventional challenges such as magnetizing inrush current, core saturation, non-standard phase shift, external fault with current transformer (CT) saturation, etc. The electromagnetic differential protection principle can only be applied to the PST it represents and it requires tap position tracking. A directional comparison-based approach can be applied to any kind of PST without tracking the tap position.",
  "full_text": null,
  "topic": "Emtp",
  "concepts": [
    {
      "name": "Emtp",
      "score": 0.8658630847930908
    },
    {
      "name": "Transformer",
      "score": 0.6913551092147827
    },
    {
      "name": "Differential protection",
      "score": 0.5761074423789978
    },
    {
      "name": "Engineering",
      "score": 0.5235628485679626
    },
    {
      "name": "Test data",
      "score": 0.4370962083339691
    },
    {
      "name": "Electronic engineering",
      "score": 0.41063395142555237
    },
    {
      "name": "Voltage",
      "score": 0.3789781332015991
    },
    {
      "name": "Computer science",
      "score": 0.3503970503807068
    },
    {
      "name": "Electrical engineering",
      "score": 0.28550368547439575
    },
    {
      "name": "Electric power system",
      "score": 0.15435445308685303
    },
    {
      "name": "Software engineering",
      "score": 0.0
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    },
    {
      "name": "Power (physics)",
      "score": 0.0
    },
    {
      "name": "Physics",
      "score": 0.0
    }
  ]
}