{
  "title": "Tool Use Traditions in Nonhuman Primates: The Case of Tufted Capuchin Monkeys",
  "url": "https://openalex.org/W1778925810",
  "year": 2015,
  "authors": [
    {
      "id": "https://openalex.org/A1820359726",
      "name": "Eduardo B. Ottoni",
      "affiliations": [
        "Universidade de São Paulo"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W6701036859",
    "https://openalex.org/W2136080516",
    "https://openalex.org/W2151090187",
    "https://openalex.org/W6980851464",
    "https://openalex.org/W2008925121",
    "https://openalex.org/W2003785870",
    "https://openalex.org/W2128164387",
    "https://openalex.org/W2163898225",
    "https://openalex.org/W1996557982",
    "https://openalex.org/W2088467367",
    "https://openalex.org/W1991831937",
    "https://openalex.org/W6623128628",
    "https://openalex.org/W2084327975",
    "https://openalex.org/W2050958156",
    "https://openalex.org/W2063335285",
    "https://openalex.org/W6619225063",
    "https://openalex.org/W2118364407",
    "https://openalex.org/W2016116899",
    "https://openalex.org/W2017028201",
    "https://openalex.org/W1567352255",
    "https://openalex.org/W2110836139",
    "https://openalex.org/W2140752169",
    "https://openalex.org/W2062309893",
    "https://openalex.org/W4232097924",
    "https://openalex.org/W2166200991",
    "https://openalex.org/W1626477358",
    "https://openalex.org/W2105401821",
    "https://openalex.org/W2014418963",
    "https://openalex.org/W6672186209",
    "https://openalex.org/W2157893431",
    "https://openalex.org/W2109105580",
    "https://openalex.org/W4390151384",
    "https://openalex.org/W2101513866",
    "https://openalex.org/W1995446585",
    "https://openalex.org/W2008789149",
    "https://openalex.org/W2128618837",
    "https://openalex.org/W2102989749",
    "https://openalex.org/W6632094203",
    "https://openalex.org/W1737831871",
    "https://openalex.org/W1970852128",
    "https://openalex.org/W6604754522",
    "https://openalex.org/W2145266567",
    "https://openalex.org/W1579613406",
    "https://openalex.org/W1595947437",
    "https://openalex.org/W2168733974",
    "https://openalex.org/W2027167945",
    "https://openalex.org/W2013182144",
    "https://openalex.org/W6720287197",
    "https://openalex.org/W6670497723",
    "https://openalex.org/W1970458629",
    "https://openalex.org/W6959456255",
    "https://openalex.org/W2010819628",
    "https://openalex.org/W2165316214",
    "https://openalex.org/W2029763286",
    "https://openalex.org/W2075280405",
    "https://openalex.org/W7015761883",
    "https://openalex.org/W2050018036",
    "https://openalex.org/W2011493779",
    "https://openalex.org/W1520036242",
    "https://openalex.org/W2044346301",
    "https://openalex.org/W2084448403",
    "https://openalex.org/W2102959966",
    "https://openalex.org/W6679295420",
    "https://openalex.org/W1999060075",
    "https://openalex.org/W2495436861",
    "https://openalex.org/W1644240647",
    "https://openalex.org/W1974440902",
    "https://openalex.org/W2085042836",
    "https://openalex.org/W2005090796",
    "https://openalex.org/W2912609182",
    "https://openalex.org/W2063543540",
    "https://openalex.org/W2164672532",
    "https://openalex.org/W2054872783",
    "https://openalex.org/W2025763017",
    "https://openalex.org/W2122056322",
    "https://openalex.org/W1795671969",
    "https://openalex.org/W2029937289",
    "https://openalex.org/W1511374502",
    "https://openalex.org/W117920181",
    "https://openalex.org/W4249956778",
    "https://openalex.org/W1811781384",
    "https://openalex.org/W616983487",
    "https://openalex.org/W830738046",
    "https://openalex.org/W2293564984",
    "https://openalex.org/W2127458740",
    "https://openalex.org/W2316411717",
    "https://openalex.org/W2324959332",
    "https://openalex.org/W2085529605",
    "https://openalex.org/W2154236780",
    "https://openalex.org/W2117694354",
    "https://openalex.org/W1596193583",
    "https://openalex.org/W2468422566",
    "https://openalex.org/W2046813029",
    "https://openalex.org/W2163056986",
    "https://openalex.org/W2312410022",
    "https://openalex.org/W1538363244"
  ],
  "abstract": "Tool use was once a major defining feature of “human nature”. If the findings about the spontaneous use of tools by wild chimpanzees (Pan troglodytes) forced us to rethink traditional views on the “unique and exclusive” character of human technological abilities, the discovery of similar behaviors in a few monkey species – one Old World monkey (Macaca fascicularis), and one genus of New World monkeys (Sapajus spp) – leads us to broader questions, focusing our attention not on phylogenetic proximity, but, rather, on the cognitive, ecological and social conditions and mechanisms fostering the emergence of tool use and behavioral traditions. The use of tools does not imply any particular underlying cognitive mechanisms: In most cases, it involves a single, “species-typical” behavior, which may look quite “hard-wired”. Even among tool-using birds, the development of such abilities seems to rely mostly on individual learning, building on innate predispositions. In the case of nonhuman primates’ toolkits, however, there is growing evidence of behavioral variation that cannot be explained just by genetic differences between populations, nor by different environmental pressures and affordances, suggesting the results of socially biased learning. The comparative approach, by itself, cannot provide hard evidence of behavioral traditions: Developmental studies, as well as field experiments, are helping to unravel the cultural nature of primate tool use. Although human culture (cumulative, symbolic) may depend on special cognitive features, such as “Theory of Mind”, enabling shared intentions, imitation, and purposeful teaching, simpler mechanisms, such as “stimulus enhancement”, can support the establishment of behavioral traditions. Moreover, the lasting changes in the environment produced by some forms of tool use can be seen as instances of “niche construction” optimizing naive observers’ learning opportunities.",
  "full_text": " 22 \nHuman Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40 Theoretical Review  TOOL USE TRADITIONS IN NONHUMAN PRIMATES: THE CASE OF TUFTED CAPUCHIN MONKEYS   Eduardo B. Ottoni Instituto de Psicologia, Universidade de São Paulo, Av. Prof. Mello Moraes 1721, Cidade Universitária, São Paulo, Brasil. eduardo.ottoni@gmail.com   ABSTRACT Tool use was once a major defining feature of \"human nature\". If the findings about the spontaneous use of tools by wild chimpanzees (Pan troglodytes) forced us to rethink traditional views on the “unique and exclusive” character of human technological abilities, the discovery of similar behaviors in a few monkey species - one Old World monkey (Macaca fascicularis), and one genus of New World monkeys (Sapajus spp) - leads us to broader questions, focusing our attention not on phylogenetic proximity, but, rather, on the cognitive, ecological and social conditions and mechanisms fostering the emergence of tool use and behavioral traditions. The use of tools does not imply any particular underlying cognitive mechanisms: In most cases, it involves a single, \"species-typical\" behavior, which may look quite \"hard-wired\". Even among tool-using birds, the development of such abilities seems to rely mostly on individual learning, building on innate predispositions. In the case of nonhuman primates' toolkits, however, there is growing evidence of behavioral variation that cannot be explained just by genetic differences between populations, nor by different environmental pressures and affordances, suggesting the results of socially biased learning. The comparative approach, by itself, cannot provide hard evidence of behavioral traditions: Developmental studies, as well as field experiments, are helping to unravel the cultural nature of primate tool use. Although human culture (cumulative, symbolic) may depend on special cognitive features, such as \"Theory of Mind\", enabling shared intentions, imitation, and purposeful teaching, simpler mechanisms, such as \"stimulus enhancement\", can support the establishment of behavioral traditions. Moreover, the lasting changes in the environment produced by some forms of tool use can be seen as instances of \"niche construction\" optimizing naive observers' learning opportunities.  Keywords: tools, foraging, socially biased learning, behavioral traditions, culture ___________________________________________________________________ \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 23 \nINTRODUCTION Tool use was once seen as a defining feature of our species: “Man, the toolmaker” (Oakley, 1949). Nevertheless, depending on the breadth of the adopted definition, the occurrence of animal tool use may vary, from rare to widespread. Animal behavior researchers usually adhere to Beck’s classical definition of tool use as “the external employment of an unattached object to alter more efficiently the form, position, or condition of another object, another organism, or the user itself, when the user holds and directly manipulates the tool during or prior to use and is responsible for the proper and effective orientation of the tool” (Beck, 1980, cited by its updated edition: Shumaker, Walkrup & Beck, 2011, 5).  Alcock’s (1972) similar definition, (based on Goodall’s, 1971), referred to the manipulation of an inanimate object, not internally manufactured, which thus excluded things like spider webs. Under these definitions, nests, bowerbirds’ bowers, and beaver dams are “constructions” (a particular form of “associative tool use”). St. Amant & Horton (2008), in the other hand, expanded the concept of tool to include the mediation of the information exchange between organism and environment (and not only changes in physical properties of objects). Tool use does not necessarily imply complex cognition, nor even, necessarily, much learning – it can result from stereotyped and generalized, species-specific behaviors, such as the quartz stones’ rings in Ariadna spiders’ traps (Henschel, 1995), quite distinct from the creative tool-aided problem solving by captive apes (Köhler, 1925).  Published reports of simple forms of tool use include, among other species, bottlenose dolphin, Asian elephants, otter, beaver, Egyptian vulture, woodpecker finch, and even octopus – not to mention those about captives in many taxa. Recent literature has highlighted the use of tools by New Caledonian crows (Corvus moneduloides), that produce leaf petiole “hooks” and Pandanus leaf probes to extract insect larvae from tree holes (Hunt & Gray, 20041). Although there is some variation across wild populations in these behaviors2, laboratory studies (Weir et al., 2002) have shown a strong “innate” disposition to the use of probe tools by New Caledonian crows – as happened in our study on tool use by hyacinth macaws (Borsari & Ottoni, 2005). On the other hand, tool use by a few species of nonhuman primates strongly suggests a critical role for individual innovation and socially biased learning.   TOOL USE BY GREAT APES At the time we found spontaneous use of tools by a semi-captive group of capuchin monkeys, customary and diversified tool use by non-humans in the wild seemed restricted to chimpanzees. \n\t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  1 For a comparison between New Caledonian crows’ and chimpanzees’ tools, see McGrew, 2013. 2 See also Madden (2008), for evidence of “cultural” features on bower design and decoration by bowerbirds.\t\r  \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 24 \nTool use in problem solving by captive chimpanzees has been extensively observed in a variety of contexts, since the studies of Koehler (1925/1976) and Yerkes (1943) in the 1920s. Captives frequently use objects to reach or climb towards out-of-reach items, and simple object manipulation is quite frequent in any environmental context that allows it.  Tool use by wild chimpanzees (stone-aided nutcracking) was first reported by Savage & Wyman (1844), but it was more than a century later when long-term field studies revealed a variety of technical skills - and a lot of inter-population variation. Wild chimpanzees modify and use as tools a wide range of objects, mostly while foraging (e.g., nutcracking with wooden or stone “hammers” and “anvils”, termite- and ant-fishing with stick probes, leaf-sponging for water), but also in communicative (including courtship, like the “leaf-clipping” by Mahale and Taï males), bodily care, or other contexts  (Whiten et al. 1999).  Leaf-sponging to access water from tree holes or pools is widespread; digging tools to access insect nests, plants’ underground storage organs (Hernandez-Aguilar et al. 2007), or water have been reported in Gombe and other sites.  The customary use of percussive tools for nutcracking is common in Western Africa (though techniques and materials vary) but absent elsewhere in Africa, although nuts and stones are also available (McGrew et al., 1997). In Taï (and other sites), wooden or stone “hammers” are usually employed to crack Coula and Panda nuts; some populations crack these nuts with heavy stone “hammers” and stone or wooden “anvils”, others crack softer palm nuts with smaller stone tools. At Bossou, apes also employ hard, stiff petioles to extract soft apical meristem from palm trees through “pestle pounding”. In an experimentally induced context, Bossou chimpanzees used a “meta-tool” - a small stone as a wedge to level an “anvil” stone (Matsuzawa, Humle, & Sugiyama, 2011). Stick probes are customarily used in termite or army ant fishing by many populations (but are absent in others). Termite fishing may involve the associative use of a thicker stick (to perforate the termite nests’ walls) and a thinner one, with a brush-shaped tip for fishing retrieval. Army-ant fishers usually employ one of two techniques, “pull-through” (gathering the ants from the stick with a hand; Gombe, Bossou) or “direct mouthing” (Taï, Bossou). Sticks and twigs are also used to probe honeybee nests, to extract water from holes or marrow from monkey bones, or to dig for roots and tubers (Whiten et al. 1999). Tools may be manufactured by chimpanzees in a variety of situations, by detachment, reshaping, or by the combination of parts (as did Koehler’s subjects to produce a longer reaching tool, by joining two sticks). Sequential use of tools was induced in many laboratory settings; it can also be seen in the termite-fishing probe sets or in the combination of stone percussors and stick probes to access a nut’s endosperm. The most typical tool composite is constituted by the wooden or stone “hammers” and “anvils” employed in nutcracking3. On the other hand, the use of tools is not frequently observed in wild bonobos (Pan paniscus), their manipulative performance in the lab (including the preparation and use of lithic blades; Schick et al., 1999) or in other captivity contexts (Gruber et al., 2010) \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  3 See, for instance, Sanz, Call, and Boesch (2013). \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 25 \nnotwithstanding. Recently, Furuichi and colleagues (2015) reported 13 types of tool use behaviors in the Wamba bonobo population; only one, though, was performed for feeding purposes (leaf sponges to drink water)4, in contrast to wild chimpanzees, which tool use repertoire is mostly aimed at feeding. Captive gorillas (Gorilla gorilla) may use objects to solve tasks, and perform structurally complex behavioral sequences in their manipulation of defended food items such as nettle leaves, but reports of tool use in the wild are extremely rare (and unimpressive), such as the use of a branch as a walking stick or stabilizer (Breuer et al., 2005), or the throwing of grass and branches in display contexts (Wittiger & Sunderland-Groves, 2007). The case of orangutans (Pongo pygmaeus) is particularly interesting, considering their performance in laboratory experiments, as well as the dexterity of ex-captives in rehabilitation facilities, imitating tool use by human caretakers (Russon & Galdikas, 1993). Captive orangutans may combine objects to reach far items or transport water in their mouths to fill a tube and raise a floating peanut into reach; a rehabilitant female was observed trying to start a fire, and another, untying and using a boat; other reports include digging, probing, and pounding with objects. In the wild, though, only in a few populations, under particular socio-ecological conditions, in especially gregarious and tolerant social contexts (which strongly argues for its socially biased learning), customary tool use has been observed: in swamp sites like Suaq Balinbing, on Sumatra, and Gunung Palung on Borneo, wild orangutans use probing tools (absent in other swamp populations) to extract honey from bee nests, or (in some Sumatran populations only, absent in Borneo) to pry open and remove irritating hairs from Neesia fruits (van Schaik et al., 2003).   TOOL USE BY OLD WORLD MONKEYS Apart from a few anecdotal reports, the only Old World species where spontaneous and customary use of tools has been observed in the wild are long-tailed macaques (Macaca fascicularis), who use stones and shells to detach or break oysters, gastropods, crabs, and fruits (Malaivijitnond et al., 2007), employing axe- or pounding-hammering techniques, and selecting properly shaped stones for each task (Gumert et al., 2009).   TOOL USE BY NEW WORD MONKEYS: THE TUFTED CAPUCHINS Tufted capuchin monkeys (Sapajus spp – formerly, Cebus spp) are the only known customary tool users among New World monkeys. They have a broad distribution, from the north of South America to southern Brazil, Paraguay and northern Argentina. Tufted capuchins live in multi-male, multi-female groups ranging from 3 to more than 50 \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  4 Most observed events of bonobo tool use had social, self-grooming/stimulation, and comfort/protection functions (Furuichi et al., op.cit.). \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 26 \nindividuals, have longer and socially more active infancies than other, similar-sized New World species (Fragaszy et al., 2004b), and exhibit a relative brain size close to that of great apes. They are generalist and opportunistic foragers, with a highly diverse diet that varies from fruit and other plant parts to animal prey like arthropods, eggs, and small vertebrates. The latter sometimes require complex search, capture, and processing techniques, whose contexts of acquisition are frequently suggestive of socially influenced learning. The manipulatory skills of capuchin monkeys are long known: Charles Darwin’s grandfather Erasmus described the stone-aided nutcracking by an old captive (1794, cited by Visalberghi, 1990), and anecdotes about captives in zoos abound - but experimental studies started in the 1980s, with Westergaard, Fragaszy, and Visalberghi (see Fragaszy et al., 2004b).  First studies of a semi-free group The spontaneous use of tools by tufted capuchin monkeys was first reported in semi-free groups inhabiting urban parks in Southern Brazil. Our preliminary study in the Tietê Ecological Park (TEP; Guarulhos, São Paulo state, Brazil), in 1995, showed that monkeys in one such group did something very “chimp-like”: using stones as ‘hammers’ to crack small Syagrus palm nuts to eat their endosperm (and the occasional beetle larvae ‘bonus’) (Ottoni & Mannu, 2001). There was no information available on these monkeys’ previous life histories, so we could not rule out the possibility of an artifact of their interaction with humans, either in the park or before it, but indirect (Languth & Alonso, 1997) or anecdotal (Fernandes, 1991) evidence from the wild, though scarce, suggested otherwise.   Ontogeny of tool use in tufted capuchin monkeys The behavioral convergences between Sapajus and Pan (Visalberghi & McGrew, 1997) are not restricted to tool use, but are also found in aspects of their social lives, like food sharing, and tolerance towards the young. Our “descriptive” phase in the research with the semi-free TEP group was followed by a developmental study (Resende et al., 2008), which revealed the importance of both infants’ curiosity and exploration, on the one hand, and of older individuals’ (especially males) tolerance to their proximity and scrounging, on the other, for the ontogeny of tool use. Typically, most adults and older juveniles use tools (though frequency and proficiency vary), but it takes about 3 years for a young monkey to become proficient in nutcracking. Young infants frequently manipulate objects, including stones, by striking them against a substrate. One-year-olds often attempt to crack nuts, but the proper coordination of movements and positioning of nuts, ‘hammer’ stones, and ‘anvils’ (hard and level substrates) is usually not reached until their third year. From an early age, however, infants show extreme interest in nutcracking by older individuals. The role of mothers as models is much less pronounced than in chimpanzees, as males are more active nutcrackers, but infants and younger juveniles’ close observation is highly tolerated by older juveniles or adult males, and some scrounging is allowed. We propose that scrounging, as a proximate \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 27 \nmotivation, optimizes the conditions for the social learning of tool use for nutcracking5. This implies that simple cognitive processes, such as operant conditioning, can optimize the conditions for socially biased learning that can give rise to behavioral traditions.  Mapping Occurrence of Tool Use by Wild Tufted Capuchin Monkeys There are virtually no reports of tool use by the white-faced capuchin monkeys (Cebus capucinus) in Central America, nor from free-ranging populations of the South American non-tufted (‘gracile’) capuchin species (Cebus spp). Among the tufted (“robust”) capuchins (Sapajus spp), long-term studies in the wild were done, until recently, with forest-dwelling populations of S. apella or S. nigritus. These provided us with reliable negative evidence of customary tool use, although individuals of these species may be very dexterous in tool-aided problem-solving tasks in the laboratory (Westergaard & Fragaszy, 1987; Visalberghi, 1990). The earliest systematic reports of tool use by wild groups came from our studies with two populations of S. libidinosus in northeastern Brazil (Piauí State), one in Fazenda Boa Vista (FBV; Fragaszy et al., 2004a), the other in the Serra da Capivara National Park (PNSC; Moura & Lee, 2004; Mannu & Ottoni, 2009). Later surveys in other areas in central-western Brazil (Mendes et al., 2015) showed that, for savannah-dwelling populations, the use of tools to crack open encapsulated food (Ottoni & Izar, 2008) is the rule, not the exception. The PNSC population exhibits an “enhanced” tool kit: stones are used not only as percussive tools to crack hard or encapsulated food, but also as digging tools (as percussors to loosen the soil or as “hoes” to extract it) to access roots, tubers, or invertebrate nests. Wooden sticks are used to probe for water, insects, or to dislodge small vertebrate prey from tree trunks’ holes or rock crevices. As observed among chimpanzees, probe use by tufted capuchins frequently involves some preparation or modification steps: sticks are not only detached from trees and cut to a proper length, but, if necessary, leaves or side branches are trimmed, and tips, thinned (Mannu & Ottoni, 2009). Curiously, and for reasons so far obscure, an extreme gender bias exists: capuchin probe use is an almost exclusively male activity (Falótico & Ottoni, 2014). A broader tool kit favors the occurrence of more complex behavioral patterns such as the use of “secondary tools” (tools used to produce other tools), as in the case of breaking free a quartz pebble embedded in sandstone (later used as a percussor) using another, smaller stone, or the “sequential use” of stone percussors and stick probes to access insect nests in rotten tree trunks or prey (especially lizards) hidden in rock crevices. \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  5 Findings in the TEP study indicated an active, non-random choice of observational targets. In groups where stone-aided nutcracking is already well established, young observers can follow a simple rule of thumb, and their curiosity is usually focused in the food-related activity of dominant males. But when there was a range of potential “observational targets” available, differing more in tool use proficiency than in rank, observers seemed to select the most “profitable” targets, preferentially watching the more skilled nut crackers (Ottoni et al., 2005), probably because such selective attention was likely to enhance scrounging payoffs (incidentally enhancing also the opportunities for social learning). \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 28 \nThe frequent and diversified use of stones as tools in the PNSC has probably facilitated the appearance of a peculiar form of tool-mediated sexual display by some females in estrus. In the Pedra Furada group, they toss small pebbles at the dominant male whose attention they are pursuing (Falótico & Ottoni, 2013).6  Explaining Differences in Tool Kits across Populations If the degree of terrestriality can explain the differences in the use of percussive tools between tufted capuchins in savannah and forest environments, it does not seem to explain sufficiently the rarity of the use of probe tools. Probe use does not leave such conspicuous traces as stone-aided digging or nutcracking, and so it is probably underreported, but, so far, it has been observed outside the PNSC in only one wild group of S. flavius, by Souto et al. (2011). It has never been recorded in FBV groups, which is the only other wild S. libidinosus savannah population with enough direct observation time to allow conclusions about its absence. There is so far no clear explanation for the more diversified tool kits of PNSC groups. The abundance of quartz pebbles (as compared to their low availability in FBV) could be a relevant factor. More importantly, perhaps, their atypically large group sizes (with some of them numbering more than 50 individuals, about twice the size of FBV groups, or three times that of typical forest groups) may enhance the opportunities for both innovation and the diffusion of tool-aided foraging techniques and other behavioral traditions.  Sociality and Social Biases on Learning Coussi-Corbel & Fragaszy (1995) proposed that the typical inter-individual distances tolerated in a given species (which will vary according to age, kin, and rank relationships) determine the level of behavioral detail that can be socially transmitted. Similarly, van Schaik et al. (1999) hypothesized that, for species relying on extractive foraging, and exhibiting a fair degree of motor and cognitive dexterity, the cultural dissemination of complex food-processing techniques – tool use in particular – would depend on the degree of tolerance among individuals, which determines the extent to which potential “apprentices” have access to the activity of the more experienced “manipulators”. They also suggested that the emergence of tool use traditions might be possible even among New World primate species, given the above-mentioned ecological, genetic, and social preconditions – a prediction fulfilled by the findings about tufted capuchin monkeys.  Kummer & Goodall (1985) pointed out the greater opportunity for less socially constrained individuals (such as those who forage alone or in smaller groups) to exhibit innovative behaviors. This is the case of sub-adult or young adult capuchin males, who are less tolerated by the adult males. Tufted capuchin monkeys’ society, thus, can represent a virtuous “equilibrium” between these factors, facilitating both innovation and socially mediated learning. \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  6 Nutcracking might also play a role as a male sexual display (Boinski 2004; Moura & Lee 2010). \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 29 \nEvolution of Tool Use in Tufted Capuchin Monkeys From the beginning of our field studies, the available evidence clearly indicated that the degree of activity on the ground was a better predictor of customary [stone] tool use (Visalberghi et al., 2005) than food availability. Spagnoletti et al. (2012) compared the seasonal variations in food resources and nutcracking activity by FBV monkeys, to pit the “necessity hypothesis” (defended items as fallback food during scarcity times) against the “opportunity hypothesis” (tool use maintained by repeated exposures to appropriate ecological conditions, such as preferred but defended food resources). Nutcracking was not affected by provisioning, nor correlated with the availability of fruit and invertebrates, favoring the latter hypothesis: monkeys cracked nuts when these resources were available. Necessity may not hold as a predictor of the use of tools to access encapsulated food in present savannah populations, but it is a likely candidate as an ultimate explanation for the evolutionary origins of tool use by tufted capuchin monkeys. The Cenozoic was characterized by severe climate fluctuations. Warmer periods alternated with glacial cycles, associated with drier weather, and these cycles were accompanied by cycles of expansion and retraction of the Amazon forest and of the wetter types of savannah. These climate changes are thought to have prompted drastic evolutionary changes in South American fauna: speciation processes affecting populations isolated by forest fragmentation are at the core of a major theoretical model to explain Amazon biodiversity, the “Refuge Theory”, and may help to explain the sudden diversification of New World primate species (Zachos et al., 2001, cited by Schrago, 2007). There is only scarce fossil evidence on the evolution of Platyrrhines - and it is virtually lacking for capuchin monkeys (Cebus/Sapajus), with no candidate fossils older than 4000 years. Discrepancies exist among estimates from molecular methods: the most recent analyses of genetic data led Lynch Alfaro et al. (2012) to conclude that, isolated from their Amazon ancestors, tufted capuchins originated either in the Atlantic Forest or further inland, in savannah areas (which are now the cerrado and the caatinga), and in the last 750,000 years expanded out across the cerrado and back into the Amazon Forest. Wright et al. (2008) suggested that the use of tools to crack palm nuts was the selective agent responsible for “robust” capuchins’ relatively short hind limbs and massive forelimbs. The occupation of drier environments may, at times, have exposed tufted capuchins to more extreme conditions than those currently observed in other savannah areas and under which the consumption of encapsulated food may have started – as we hypothesize – out of necessity rather than out of opportunity, alone.  However, even if adults (adult males at least, in the case of harder nuts) have the necessary cognitive and motor skills - and strength - to use stone tools to crack open palm nuts, that, in itself, would be only part of the solution to food scarcity. There is a ‘life history’ catch: it takes years until young monkeys acquire the skills and strength to process these items by themselves, so, when other, more easily accessible resources are not available, youngsters weaned long ago still have to be fed. Under these conditions, tolerated scrounging by infants and younger juveniles would be a key component in this \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 30 \n‘technological’ solution to the scarcity of unprotected food, which also optimizes the opportunities for the socially biased learning of tool-aided foraging.  Experimental Field Studies of Tool Selection, Transport, and Use In all long-term study sites with tool-using populations (TEP, FBV, and SCNP), initial observation-only phases were followed by a combination of observational and experimental studies. Most of these, so far, have dealt with individual performances in terms of foraging optimization through the sequential organization of behavior, and percussive tool selection and transport (Falótico, 2006, Visalberghi et al., 2009; Fragaszy et al., 2010; Spagnoletti et al., 2011; Massaro et al., 2012; Ottoni & Corat, 2013). Generally speaking, these studies have shown that tufted capuchin monkeys select appropriate (percussive) tools in a plastic manner, according to variables such as nut hardness, weight of available (potential) “hammers” and transport distances to the “anvils” (which are often rock outcrops, as opposed to the chimpanzees’ frequently unattached and movable stone “anvils”). Field experiments may also be employed to investigate the cultural nature of tool use.   TOOL USE AND SOCIALLY BIASED LEARNING Social Learning, Culture and Behavioral Traditions in Nonhuman Animals The important adaptive role of social learning, even among non-human animals, already was explicit in the works of Darwin and Wallace (and Romanes), and became hard empirical science more than half a century ago, with research on birdsong learning. The notion of “animal cultures”, though, remains a contentious matter, mostly due to issues of definition. At one extreme, many cultural anthropologists adhere to variants of Tylor’s definition of culture (1871, cited by Hutchins, 1995, 353) as “that complex whole which includes knowledge, belief, art, morals, law, custom, and any other capabilities and habits acquired by man as a member of society” (being something acquired by man was part of the definition). At the other end of the spectrum, many scholars equate culture to social learning or social information transfer in general. Even among primatologists and anthropologists studying social learning in nonhuman primates under an evolutionary framework, there is some terminological disagreement: Perry (2011), for instance, refrained from labeling the conventional, group-specific social rituals of white-faced capuchin monkeys (Cebus capucinus) “cultural,” considering that “culture” involves more than geographically variable traits, or even social learning – including things like “group identity,” symbolically linked to socially learned traits, and “social norms”, so she favored the term “traditions”, which allows for a more ‘operational’ definition: “a tradition is a behavioral practice that is relatively enduring…, that is shared among two or more members of a group, and that depends in part on socially aided learning for its generation in new practitioners.” (Fragaszy & Perry, 2003, 12). Nonetheless, as McGrew \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 31 \n(2003) noted, “tradition” suggests vertical transmission (as well as “relative endurance”), and cultural transmission also may include short-lasting, horizontally transmitted “fads.” Another related issue are the cognitive underpinnings of culture. Tomasello (1999) believes that non-human “culture” is a product of simpler social learning processes, such as “stimulus enhancement” (socially biased learning about environmental features), while imitation in humans allows copying fidelity, and, consequently, the emergence of cumulative culture. Underlying human complex imitation, for him, are the capacities for “joint attention” and “shared intentionality” – which require the possession of a “Theory of Mind”.  In Tomasello’s and other, like-minded approaches, (Boyd & Richerson, 1985; Galef, 1992) human culture is usually associated with teaching (Thornton & Raihani, 2008). Many animals alter their behavior to facilitate learning by the young, which has been labeled “scaffolding” or “functional teaching” (Caro & Hauser, 1992). Human teaching, though, may constitute a unique adaptation enabling social learning by communication (especially useful for things like conventions, arbitrary referential symbols, or cognitively opaque skills), a “natural pedagogy” (Csibra & Gergely, 2011).  One long held view is that culture depends on language (see, for instance, Washburn & Benedict, 1979). The extent and limits of non-human primate capacities in terms of understanding of intentionality, referentiality, and symbol-using are still unclear, but, if we are willing to drop the ‘symbolic’ part of the definition, “communicative language may be a sufficient condition for culture, but not a necessary one” (McGrew, 2003, 54) 7. The purported uniqueness of human symbolic culture does not preclude the occurrence of simpler but analogous processes of individual innovation, learning biased by social influences (through reinforcement, stimulus enhancement, goal emulation, or functional teaching), and the establishment of behavioral traditions among non-humans.  Cultural Primatology Though Japanese primatologists had long before proposed the existence of cultural processes in non-human primates (Imanishi, 1952,cited by Huffman, 1996; Nishida, 1987), it took some decades more until the dichotomous Western view on the relationship between Nature and Culture made room for an evolutionary approach to social information transfer in non-human animals.  However, even Imanishi did not use the Japanese word for culture; instead, he used a neologism based on the English word, and the early studies on Japanese monkeys’ socially learned behaviors usually employed terms like sub- or protoculture. The notion of “cultured apes” flourished as a consequence of the comparative studies on the behavioral variation between wild chimpanzee populations. A prevalence of tool-related behaviors among the reported cultural variants justified the “restrained” reference to “chimpanzee material culture” (McGrew, 1992). A few years later, Whiten et al. (1999) meta-analysis (“cultures in chimpanzees”) mapped the occurrence of 65 behavioral patterns (not restricted to the use of tools) throughout the natural distribution range of \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  7 For an analysis of the common features of chimpanzees and humans, and a discussion on the scope of cultural phenomena in our last common ancestors, see Whiten, 2011. \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 32 \nchimpanzees. To uphold explanations for intergroup differences and intragroup similarities based on the social information transfer, this comparative study tried to sort out behavioral variation explainable by genetic differences, or by particular environmental pressures and affordances. The idea of cultural traditions among hominoids gained further strength after the discovery of the use of tools by a few populations of orangutans (Pongo pygmaeus; van Schaik et al., 1996), since tool use by wild groups was observed only under very particular conditions of gregariousness and social tolerance. Fragaszy and Perry (2003), however, pointed out that the “comparative” approach cannot prove nor disprove claims that any given behavior constitutes a tradition – and not only because it is prone to “false negatives” or “false positives” (see, for instance, Humle & Matsuzawa, 2002). More importantly, the method of exclusion does not take into account the critical evidence to label any given behavior as traditional: an effective role of social influences in its acquisition by naïve individuals. These social influences are usually hard to measure in naturalistic settings, and herein lies the importance of the controlled conditions provided by laboratory or semi-free populations, as well as the integration of different approaches, from developmental studies to experiments in the lab and in the field, and of taking advantage of recently developed statistical techniques to examine processes of social diffusion of new behaviors, such as NBDA (Network-Based Diffusion Analysis; Franz & Nunn, 2009), in association with “Option Bias” methods (Kendal et al., 2009).  Developmental studies can be very useful to unravel the mechanisms underlying tool use (Meulman et al 2013). The slow and gradual emergence of tool use competence in tufted capuchin monkeys (Resende et al., 2008) and chimpanzees (Matsuzawa et al., 2011), for instance, and the apparently critical roles of individual practice and exposure to social cues strongly support the inference of a key role for socially biased learning. The overall spatial and temporal patterns revealed by comparative studies, the above-mentioned caveats notwithstanding, can be useful in many ways. Firstly, they tell us which behaviors are species-typical versus which are rare or observed only in particular populations: this information can guide our investigatory strategies. Secondly, these patterns can help us to identify correlations between behavioral characters and prominent genetic or ecological factors (van Schaik, 2003). Sometimes, they can also help in the detection of telltale clues of socially influenced behaviors, such as behavioral discontinuities associated with geographical barriers preventing intergroup diffusion (Whiten et al., 1999; van Schaik et al., 2003).  Biro and colleagues (2003) highlighted the usefulness of combining approaches (comparative, ontogenetic, and experimental) in the study of cultural innovation and transmission processes by non-human primates in the wild8. \n\t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  8 For a review on field experiments on social learning in animals, see Reader and Biro, 2010. \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 33 \nGruber, Clay, and Zuberbühler (2009) compared the performances of two neighboring chimpanzee communities with distinct “tool-kits” in an experimental honey-dipping task: only the habitual probe users of Kanyawara produced probes to solve it, while a few Sonso individuals produced leaf-sponges, present in their community repertoire, evidencing their reliance on cultural knowledge.  Experimental Field Studies on Social Learning by Tufted Capuchin Monkeys The differences between the tool kits of the populations in our two field sites in Piauí (FBV and SCNP, about 350 km distant from each other) - inspired an experiment similar to Gruber and colleagues’. To test the hypothesis that tool-aided problem solving would be facilitated or constrained by local tool use traditions, we exposed one group in each site to a task involving the extraction of molasses from a box with holes. As predicted, the males in SCNP (customary probe users) readily solved the problem producing stick probes, while the monkeys from the FBV group, who customarily crack hard palm nuts with stone tools – but do not use probes - did not. On the other hand, our prediction that FBV monkeys would try to solve the problem using stone tools was not confirmed. Some individuals from SCNP, though, did carry stones to the problem boxes and tried to use them (to break the box), which suggests us that the broader scope of stone tools’ use in the SCNP population made it more easily generalizable to the new context (Ottoni & Cardoso, 2014). Also, by exposing two habituated groups in the SCNP to a “two-option” food dispenser (with a different option “seeded” in each group), and employing analytical techniques such as NBDA, TADA, and OADA  (Time/Order of Acquisition Diffusion-Analysis), we aim to examine the effects of their social dynamics in the diffusion of novel tool use behaviors (Coelho, Kendal, & Ottoni, in preparation). Future surveys and long-term studies of new populations (in similar versus more distinct environments) may help us to further evaluate the apparent uniqueness of the SCNP capuchin monkeys’ tool kit.   CONCLUSION: WHAT IS SPECIAL ABOUT TOOL USE? Although human culture (cumulative, symbolic) may depend on special cognitive features, such as a \"Theory of Mind\", enabling shared intentions, imitation, and purposeful teaching, simpler mechanisms like \"stimulus enhancement\" can support the establishment of behavioral traditions. Lasting changes in the environment produced by some forms of tool use can be seen as instances of \"niche construction\" optimizing naïve observers' learning opportunities (Fragaszy et al., 2013). The persistence of tools in the environment (beyond the behavior of its user) increases the opportunities of learning through “stimulus enhancement”. In addition, from the researchers’ point-of-view, behavioral patterns involving the use of objects as tools, though evidently more prone to biases related to environmental constraints \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 34 \nand affordances, usually have the useful qualities of being quantifiable in their costs and benefits, and of leaving physical remnants that are recoverable and measurable.  Moreover, the long-term persistence of stone tools may have relevant consequences not only for potential conspecific apprentices, but, on a much broader time scale, also for animal behavior research. The discovery of 4300 year-old lithic tools used by chimpanzees opened the possibility of applying archaeological techniques in the search of evidence on the evolutionary histories of nonhuman primate tool use (Haslam et al., 2009). For the species of customary lithic tool users, chimpanzee, long-tailed macaque, and bearded capuchin monkeys, this goal is the aim of the ongoing “Primate Archaeology Project” (http://primarch.arch.ox.ac.uk). Furthermore, growing knowledge of features of nonhuman primates’ stone tools may ultimately help in the identification of evidence of rudimentary lithic tool use by early hominins.   ACKNOWLEDGEMENTS The author would like to thank Dr. William McGrew and an anonymous reviewer for their valuable comments and suggestions to the final version of the manuscript, as well as the Brazilian funding agencies which made our research on capuchin monkeys’ tool use possible (FAPESP, CNPq, CAPES).   REFERENCES Alcock, J. (1972). The evolution of the use of tools by feeding animals. Evolution, 26, 464–473. Retrieved from http://www.jstor.org/stable/2407020 Biro, D., Inoue-Nakamura, N., Tonooka, R., Yamakoshi, G., Sousa, C., & Matsuzawa, T. (2003). Cultural innovation and transmission of tool use in wild chimpanzees: Evidence from field experiments. Animal Cognition, 6, 213–223. doi:10.1007/s10071-003-0183-x Boinski, S. (2004). The beats of different drummers: Percussion as sexual signalling among brown capuchins at Raleighvallen, Suriname. Folia Primatologica, 75 (Supp.), 238. Borsari, A., & Ottoni, E. B. (2005). Preliminary observations of tool use in captive hyacinth macaws (Anodorhynchus hyacinthinus). Animal Cognition, 8, 48–52. doi: 10.1007/s10071-004-0221-3 Boyd, R., & Richerson, P. (1985). Culture and the evolutionary process. Chicago: Chicago University Press. Breuer, T., Ndoundou-Hockemba, M., & Fishlock, V. (2005). First observation of tool use in wild gorillas. PLoS Biol 3(11): e380. doi: 10.1371/journal.pbio.0030380 Caro T. M., & Hauser, M. D. (1992). Is there teaching in non-human animals? Quarterly Review of Biology, 67, 151-174. Retrieved from http://www.jstor.org/stable/2831436 Coussi-Korbel, S., & Fragaszy, D. M. (1995). On the relation between social dynamics and social learning. Animal Behaviour, 50, 1441–1553. doi:10.1016/0003-3472(95)80001-8 \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 35 \nCsibra, G., & Gergely, C. (2011). Natural pedagogy as evolutionary adaptation. Philosophical Transactions of the Royal Society B, 366, 1149–1157. doi:10.1098/rstb.2010.0319 Falótico, T. (2006). Estudo experimental do uso de ferramentas para quebra de frutos encapsulados por macacos-prego (Cebus apella) em semiliberdade. Unpublished Master’s Thesis, Institute of Psychology, University of São Paulo, xii+105 pp. Falótico, T., & Ottoni, E. B. (2013). Stone throwing as a sexual display in wild female bearded capuchin monkeys, Sapajus libidinosus. PLoS ONE, 8(11), e79535. doi:10.1371/journal.pone.0079535. Falótico, T., & Ottoni, E. B. (2014). Sexual bias in probe tool manufacture and use by wild bearded capuchin monkeys. Behavioural Processes, 108, 117–122. doi: 10.1016/j.beproc.2014.09.036 Fernandes, M. E. B. (1991). Tool use and predation of oysters (Crassostrea rhizophorae) by a tufted capuchin, Cebus apella apella, in brackish water mangrove swamp. Primates, 32(4), 529-531. doi: 10.1007/BF02381944 Fragaszy, D. M., & Perry, S. (2003). Towards a biology of traditions. In: D.M. Fragaszy & S. Perry (Eds.), The biology of traditions: models and evidence (p. 1–32). Cambridge, UK: Cambridge University Press. Fragaszy, D. M., Biro, D., Eshchar, Y., Humle, T., Izar, P.,  Resende, B., & Visalberghi, E. (2013). The fourth dimension of tool use: temporally enduring artefacts aid primates learning to use tools. Philosophical Transactions of the Royal Society B, 368. doi: 10.1098/rstb.2012.0410 Fragaszy, D. M., Greenberg, R., Visalberghi, E., Ottoni, E. B., Izar,  P., & Liu, Q.  (2010). How wild bearded capuchin monkeys select stones and nuts to minimize the number of strikes per nut cracked. Animal Behaviour, 80, 205-214. doi:10.1016/j.anbehav.2010.04.018 Fragaszy, D. M., Izar, P., Visalberghi, E., Ottoni, E. B., & Oliveira, M. (2004a) Wild capuchin monkeys use anvils and stone pounding tools. American Journal of Primatology, 64, 359–366. doi: 10.1002/ajp.20085 Fragaszy, D. M., Visalberghi, E., & Fedigan, L.M. (2004b). The complete capuchin: the biology of the genus Cebus. Cambridge, UK: Cambridge University Press. Franz, M., & Nunn, C. L. (2009). Network-based diffusion analysis: a new method for detecting social learning. Philosophical Transactions of the Royal Society B, 276, 1829-1836. doi: 10.1098/rspb.2008.1824 Furuichi, T., Sanz, C.,; Koops, K., Sakamaki, T., Ryu, H., Tokuyama, N., & Morgan, D. (2015). Why do wild bonobos not use tools like chimpanzees do? Behaviour, 152(3-4), 425 - 460. doi:10.1163/1568539X-00003226 Galef, B. G., Jr. (1992). The question of animal culture. Human Nature, 3, 157-178. doi: 10.1007/BF02692251 Goodall, J. (1971). Tool-using in primates and other vertebrates. Advances in the Study of Behavior, 3, 195-249. doi:10.1016/S0065-3454(08)60157-6 \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 36 \nGruber, T., Clay, Z., & Zuberbühler, K. (2010). A comparison of bonobo and chimpanzee tool use: evidence for a female bias in the Pan lineage. Animal Behaviour, 80, 1023 – 1033. doi: 10.1016/j.anbehav.2010.09.005 Gruber, T., Muller, M.N., Strimling, P., Wrangham, R., & Zuberbühler, K. (2009). Wild chimpanzees rely on cultural knowledge to solve an experimental honey acquisition task. Current Biology, 19, 1806–1810. doi: 10.1016/j.cub.2009.08.060 Gumert, M. D., Kluck, M., & Malaivijitnond, S. (2009). The physical characteristics and usage patterns of stone axe and pounding hammers used by long-tailed macaques in the Andaman Sea region of Thailand. American Journal of Primatology, 71, 594–608. doi: 10.1002/ajp.20694 Haslam, M., Hernandez-Aguilar, A., Ling, V., Carvalho, S., de la Torre, I., DeStefano, A., ... Warren, R. (2009). Primate archaeology. Nature, 460, 339–344. doi:10.1038/nature08188 Henschel, J. R. (1995). Tool use by spiders: stone selection and placement by corolla spiders Ariadna (Segestriidae) of the Namib Desert. Ethology, 101, 187-199. doi: 10.1111/j.1439-0310.1995.tb00357.x Hernandez-Aguilar, A., Moore, J. and Pickering, T.R. (2007) Savanna chimpanzees use tools to harvest the underground storage organs of plants. Proceedings of the National Academy of Sciences, USA, 104, 19210–19213. doi: 10.1073/pnas.0707929104 Huffman, M. A. (1996). Acquisition of innovative cultural behaviors in non-human primates: A case study of stone handling, a socially transmitted behavior in Japanese macaques. In: B.G. Galef & C. Heyes (Eds.), Social learning in animals: the roots of culture (pp. 267–289). Orlando, FL: Academic Press. Humle, T., & Matsuzawa, T. (2002). Ant-dipping among the chimpanzees of Bossou, Guinea, and some comparisons with other sites. American Journal of Primatology, 58, 133–148. doi: 10.1002/ajp.10055 Hunt, G. R., & Gray, R. D. (2004). Direct observations of pandanus-tool manufacture and use by a New Caledonian crow (Corvus moneduloides). Animal Cognition, 7, 114–120. doi: 10.1007/s10071-003-0200-0 Hutchins, E. (1995). Cognition in the wild. Cambridge, MA: MIT Press. Kendal, R. L., Kendal, J.R., Hoppitt, W., & Laland, K.N. (2009). Identifying Social learning in animal populations: a new ‘option-bias’ method. PLoS ONE, 4(8), e6541. doi:10.1371/journal.pone.0006541 Köhler, W. (1925/1976). The mentality of apes [Translated by E. Winter from the 2nd revised edition,1927]. New York: Liveright. Kummer, H., & Goodall, J. (1985). Conditions of innovative behaviour in primates. Philosophical Transactions of the Royal Society B, 308, 203–214. doi: 10.1098/rstb.1985.0020 Langguth, A., & Alonso, C. (1997). Capuchin monkeys in the Caatinga: tool use and food habits during drought. Neotropical Primates, 5(3), 77-78. Lynch Alfaro, J. W., Boubli, J. P., Olson, L. E., Di Fiore, A., Wilson, B., Gutiérrez-Espeleta, … Alfaro, M.E. (2012). Explosive Pleistocene range expansion leads to widespread Amazonian \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 37 \nsympathy between robust and gracile capuchin monkeys. Journal of Biogeography, 39, 272–288. doi: 10.1111/j.1365-2699.2011.02609.x Madden, J. R. (2008). Do bowerbirds exhibit culture? Animal Cognition, 11, 1–12. doi: 10.1007/s10071-007-0092-5 Malaivijitnond, S., Lekprayoon, C., Tandavanittj, N., Panha, S., Cheewatham, C., & Hamada, Y. (2007). Stone-tool usage by Thai long-tailed macaques (Macaca fascicularis). American Journal of Primatology, 69, 227–233. doi: 10.1002/ajp.20342 Mannu, M., & Ottoni, E. B. (2009). The enhanced tool-kit of two groups of wild bearded capuchin monkeys in the Caatinga: Tool making, associative use, and secondary tools. American Journal of Primatology, 71, 242–251. doi: 10.1002/ajp.20642 Massaro, L., Liu, Q., Visalberghi, E., & Fragaszy, D. (2012). Wild bearded capuchin (Sapajus libidinosus) select hammer tools on the basis of both stone mass and distance from the anvil. Animal Cognition, 15, 1065–1074. doi: 10.1007/s10071-012-0530-x Matsuzawa, T., Humle, T., & Sugiyama, Y. (Eds.) (2011). The chimpanzees of Bossou and Nimba. Tokyo: Springer. Matsuzawa, T., Biro, D., Humle, T., Inoue-Nakamura, N., Tonooka, R., & Yamakoshi, G. (2001). Emergence of culture in wild chimpanzees: education by master-apprenticeship. In T. Matsuzawa (Ed.), Primate origins of human cognition and behavior (pp. 557–574). Tokyo: Springer. McGrew, W.C. (1992). Chimpanzee material culture: implications for human evolution. Cambridge: Cambridge University Press. McGrew, W. C. (2003). Ten dispatches from the chimpanzee culture wars. In: F.B.M. de Waal & P.L. Tyack (Eds.), Animal social complexity: intelligence, culture, and individualized societies (pp. 419–439). Cambridge, MA: Harvard University Press. McGrew, W. C. (2013). Is primate tool use special? Chimpanzees and New Caledonian crow compared. Philosophical Transactions of the Royal Society, B, 368:20120422. doi: 10.1098/rstb.2012.0422 McGrew, W. C., Ham, R. M., White, L. J. T., Tutin, C. E. G., & Fernandez, M. (1997). Why don’t chimpanzees in Gabon crack nuts? International Journal of Primatology, 18, 353-374. doi: 10.1023/A:1026382316131 Mendes, F. D. C., Cardoso, R. M., Ottoni, E. B., Izar, P., Villar, D. N. A., & Marquezan, R. F. (2015). Diversity of nutcracking tool sites used by Sapajus libidinosus in Brazilian cerrado. American Journal of Primatology, online. doi: 10.1002/ajp.22373 Meulman, E. J. M., Seed, A. M., & Mann, N. (2013). If at first you don’t succeed… Studies of ontogeny shed light on the cognitive demands of habitual tool use. Philosophical Transactions of the Royal Society B, 368, 20130050. doi: 10.1098/rstb.2013.0050 Moura, A. C. A. & Lee, P. (2010). Wild capuchins show male-biased feeding tool use. International Journal of Primatology, 31, 457–470. doi: 10.1007/s10764-010-9406-6 \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 38 \nMoura, A. C. A., & Lee, P. (2004). Capuchin stone tool use in caatinga dry forest. Science, 306, 1909. doi: 10.1126/science.1102558 Nishida, T. (1987). Local traditions and cultural transmission. In: B. B. Smuts, D. L. Cheney, D. L. Seyfarth, R. W. Wrangham, & T. T. Struhsaker (Eds.), Primate societies (pp. 462–474). Chicago: University of Chicago Press. Oakley, K. P. (1949). Man the toolmaker. London: British Museum. Ottoni, E. B., & Cardoso, R. M. (2014). Tool use traditions’ effects on problem-solving in two wild bearded capuchin monkey (Sapajus libidinosus) populations. Abstracts of the XXVth Congress of the International Primatological Society, 404. Ottoni, E. B., & Izar, P. (2008). Capuchin monkey tool use: overview and implications. Evolutionary Anthropology, 17, 171–178. doi: 10.1002/evan.20185 Ottoni, E. B., & Mannu, M. (2001). Semifree-ranging tufted capuchins (Cebus apella) spontaneously use tools to crack open nuts. International Journal of Primatology, 22, 347–358. doi:10.1023/A%3A1010747426841 Ottoni, E. B., Resende, B. D., & Izar, P. (2005). Watching the best nutcrackers: What capuchin monkeys (Cebus apella) know about others’ tool using skills. Animal Cognition, 8, 215–219. doi: 10.1007/s10071-004-0245-8 Perry, S. (2011). Social traditions and social learning in capuchin monkeys (Cebus). Philosophical Transactions of the Royal Society B, 366, 988–996. doi: 10.1098/rstb.2010.0317 Reader, S., & Biro, D. (2010). Experimental identification of social learning in wild animals. Learning & Behavior, 38(3), 265-283. doi:10.3758/LB.38.3.265 Resende, B. D., Ottoni, E. B., & Fragaszy, D. M. (2008). Ontogeny of manipulative behavior and nut-cracking in young tufted capuchin monkeys (Cebus apella): A perception–action perspective. Developmental Science, 11, 812–824. doi: 10.1111/j.1467-7687.2008.00731.x Russon, A. E., & Galdikas, B. M. F. (1993). Imitation in ex-captive orangutans. Journal of Comparative Psychology, 107, 147–161. doi: 0.1037/0735-7036.107.2.147 Sanz, C., Call, J., & Boesch, C. (Eds.) (2013). Tool use in animals: cognition and ecology. Cambridge, UK: Cambridge University Press. Savage, T. S., & Wyman, J. (1944). Observations on the external characters and habits of the Troglodytes niger. Boston Journal of Natural History, IV(4), 362-386. Schick, K. D., Toth, N., Garufi, G., Savage-Rumbaugh, E. S., Rumbaugh, D., & Sevcik, R. (1999). Continuing investigations into the stone tool-making and tool-using capabilities of a bonobo (Pan paniscus). Journal of Archaeological Science, 26, 821–832.  Schrago, C. G. (2007). On the time scale of New World primate diversification. American Journal of Physical Anthropology, 132, 344–354. doi: 10.1002/ajpa.20459 Shumaker, R. W., Walkup, K. R., & Beck, B. B. (2011). Animal tool behavior: the use and manufacture of tools by animals. Baltimore, ML: Johns Hopkins University Press.  \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 39 \nSouto, A., Bione, C. B. C., Bastos, M., Bezerra, B. M., Fragaszy, D., & Schiel, N. (2011). Critically endangered blonde capuchins fish for termites and use new techniques to accomplish the task. Biology Letters, 7, 532–535. doi: 10.1098/rsbl.2011.0034 Spagnoletti, N., Visalberghi, E., Verderane, M.  P., Ottoni, E. B., Izar, P., & Fragaszy, D. (2012). Stone tool use in wild bearded capuchin monkeys (Cebus libidinosus): Is it a strategy to overcome food scarcity? Animal Behaviour, 83 1285-1294. doi:10.1016/j.anbehav.2012.03.002 St. Amant, R., & Horton, T. E. (2008). Revisiting the definition of animal tool use. Animal Behaviour, 75, 1199–1208. doi:10.1016/j.anbehav.2007.09.028 Tomasello, M. (1999). The cultural origins of human cognition. Cambridge, MA: Harvard University Press. Thornton, A., & Raihani, N. J. (2008). The evolution of teaching. Animal Behaviour, 75, 1823-1836. doi:10.1016/j.anbehav.2007.12.014 van Schaik, C. P. (2003). Local traditions in orangutans and chimpanzees: social learning and social tolerance. In: D. M. Fragaszy, & S. Perry (Eds.), The biology of traditions: models and evidence (pp. 297–328). Cambridge, MA: Cambridge University Press. van Schaik, C. P., Ancrenaz, M., Borgen, G., Galdikas, B., Knott, C. D., Singleton, … Merril, M. (2003). Orangutan cultures and the evolution of material culture. Science, 299, 102–105. doi: 10.1126/science.1078004 van Schaik, C. P., Deaner, R. O., & Merrill, M. Y. (1999). The conditions for tool use in primates: Implications for the evolution of material culture. Journal of Human Evolution, 36, 719–741. doi:10.1006/jhev.1999.0304 van Schaik, C. P., Fox, E. A., & Sitompul, A. F. (1996). Manufacture and use of tools in wild Sumatran orangutans: Implications for human evolution. Naturwissenschaften, 83, 186–188. doi: 10.1007/BF01143062 Visalberghi, E. (1990). Tool use in Cebus. Folia Primatologica, 54, 146–154. doi:10.1159/000156438 Visalberghi, E., & McGrew, W. C. (1997). Cebus meets Pan. International Journal of Primatology, 18, 677–681. doi: 10.1023/A:1026387628001 Visalberghi, E., Fragaszy, D. M., Izar, P., & Ottoni, E. B. (2005). Terrestriality and tool use. Science, 308, 951. doi: 10.1126/science.308.5724.951c Washburn, S. L., & Benedict, B. (1979). Non-human primate culture. Man, 14,163-164. http://www.jstor.org/stable/2801649 Weir, A. A. S., Chappell, J., & Kacelnik, A. (2002). Shaping of hooks in New Caledonian crows. Science, 297, 281. doi:10.1126/science.1073433 Westergaard, G. C., & Fragaszy, D. M. (1987). The manufacture and use of tools by capuchin monkeys (Cebus apella). Journal of Comparative Psychology, 101, 159–168. doi: 10.1037/0735-7036.101.2.159 \nOttoni, E.B.: Tool Use Traditions in Nonhuman Primates Human Ethology Bulletin – Proc. of the XXII. ISHE Conference (2015): 22-40\t\r  \t\r  \n 40 \nWittiger, L., &  Sunderland-Groves, J.L. (2007). Tool use during display behavior in wild Cross River gorillas. American Journal of Primatology, 69,1307–1311. doi: 10.1002/ajp.20436 Whiten, A. (2011). The scope of culture in chimpanzees, humans and ancestral apes. Philosophical Transactions of the Royal Society B, 366, 997–1007. doi:10.1098/rstb.2010.0334 Whiten, A., Goodall, J., McGrew, W. C., Nishida, T., Reynolds, V., Sugiyama, … Boesch, C. (1999). Cultures in chimpanzees. Nature, 399, 682–685. doi:10.1038/21415 Wright, B. W., Wright, K. A., Chalk, J., Verderane, M., Fragaszy, D., Visalberghi, E., … Vinyard, C. (2009). Fallback foraging as a way of life: using dietary toughness to compare the fallback signal among capuchins and implications for interpreting morphological variation. American Journal of Physical Anthropology, 140, 687-699. DOI 10.1002/ajpa.21116. Yerkes, R. M. (1943). Chimpanzees: a laboratory colony. New Haven, Yale University Press.  ",
  "topic": "Affordance",
  "concepts": [
    {
      "name": "Affordance",
      "score": 0.5984370708465576
    },
    {
      "name": "Imitation",
      "score": 0.5873260498046875
    },
    {
      "name": "Psychology",
      "score": 0.5612283945083618
    },
    {
      "name": "Troglodytes",
      "score": 0.5564068555831909
    },
    {
      "name": "Cognition",
      "score": 0.5422177910804749
    },
    {
      "name": "Primate",
      "score": 0.5319675803184509
    },
    {
      "name": "Cognitive psychology",
      "score": 0.4873293340206146
    },
    {
      "name": "Non-human",
      "score": 0.46594226360321045
    },
    {
      "name": "Comparative cognition",
      "score": 0.461275577545166
    },
    {
      "name": "Theory of mind",
      "score": 0.4603310823440552
    },
    {
      "name": "Cognitive science",
      "score": 0.43928760290145874
    },
    {
      "name": "Social psychology",
      "score": 0.30548709630966187
    },
    {
      "name": "Biology",
      "score": 0.22164702415466309
    },
    {
      "name": "Ecology",
      "score": 0.2150234878063202
    },
    {
      "name": "Neuroscience",
      "score": 0.16894584894180298
    },
    {
      "name": "Epistemology",
      "score": 0.16524618864059448
    },
    {
      "name": "Philosophy",
      "score": 0.0
    }
  ]
}