{
    "title": "Assessing Mitochondrial DNA Variation and Copy Number in Lymphocytes of ~2,000 Sardinians Using Tailored Sequencing Analysis Tools",
    "url": "https://openalex.org/W1792718864",
    "year": 2015,
    "authors": [
        {
            "id": "https://openalex.org/A5006474256",
            "name": "Jun Ding",
            "affiliations": [
                "National Institutes of Health"
            ]
        },
        {
            "id": "https://openalex.org/A5024002385",
            "name": "Carlo Sidore",
            "affiliations": [
                "University of Sassari"
            ]
        },
        {
            "id": "https://openalex.org/A5101414201",
            "name": "Thomas Bütler",
            "affiliations": [
                "National Institutes of Health"
            ]
        },
        {
            "id": "https://openalex.org/A5113903218",
            "name": "Mary Kate Wing",
            "affiliations": [
                "University of Michigan"
            ]
        },
        {
            "id": "https://openalex.org/A5108080230",
            "name": "Yong Qian",
            "affiliations": [
                "National Institutes of Health"
            ]
        },
        {
            "id": "https://openalex.org/A5041494330",
            "name": "Osorio Meirelles",
            "affiliations": [
                "National Institutes of Health"
            ]
        },
        {
            "id": "https://openalex.org/A5014263171",
            "name": "Fabio Busonero",
            "affiliations": [
                "University of Michigan"
            ]
        },
        {
            "id": "https://openalex.org/A5057653412",
            "name": "Lam C. Tsoi",
            "affiliations": [
                "University of Michigan"
            ]
        },
        {
            "id": "https://openalex.org/A5034327821",
            "name": "Andrea Maschio",
            "affiliations": [
                "University of Michigan"
            ]
        },
        {
            "id": "https://openalex.org/A5030573407",
            "name": "Andrea Angius",
            "affiliations": [
                "Institute of Genetic and Biomedical Research"
            ]
        },
        {
            "id": "https://openalex.org/A5009996821",
            "name": "Hyun Min Kang",
            "affiliations": [
                "University of Michigan"
            ]
        },
        {
            "id": "https://openalex.org/A5018612024",
            "name": "Ramaiah Nagaraja",
            "affiliations": [
                "National Institutes of Health"
            ]
        },
        {
            "id": "https://openalex.org/A5044270806",
            "name": "Francesco Cucca",
            "affiliations": [
                "University of Sassari"
            ]
        },
        {
            "id": "https://openalex.org/A5105617974",
            "name": "Gonçalo çR Abecasis",
            "affiliations": [
                "University of Michigan"
            ]
        },
        {
            "id": "https://openalex.org/A5079340049",
            "name": "David Schlessinger",
            "affiliations": [
                "National Institutes of Health"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2167436883",
        "https://openalex.org/W2068568687",
        "https://openalex.org/W2036140173",
        "https://openalex.org/W2171777347",
        "https://openalex.org/W2147575903",
        "https://openalex.org/W2168133698",
        "https://openalex.org/W2139224067",
        "https://openalex.org/W2165348349",
        "https://openalex.org/W2148080180",
        "https://openalex.org/W1963558685",
        "https://openalex.org/W2005520835",
        "https://openalex.org/W2065498957",
        "https://openalex.org/W2020439255",
        "https://openalex.org/W1984068087",
        "https://openalex.org/W2108234281",
        "https://openalex.org/W2171701092",
        "https://openalex.org/W2139988285",
        "https://openalex.org/W2040151712",
        "https://openalex.org/W1963987106",
        "https://openalex.org/W1996813968",
        "https://openalex.org/W2057356450",
        "https://openalex.org/W2138601221",
        "https://openalex.org/W2086764744",
        "https://openalex.org/W1968302884",
        "https://openalex.org/W2080171212",
        "https://openalex.org/W1970703807",
        "https://openalex.org/W2007495581",
        "https://openalex.org/W1976775780",
        "https://openalex.org/W2885727518",
        "https://openalex.org/W1968788272"
    ],
    "abstract": "DNA sequencing identifies common and rare genetic variants for association studies, but studies typically focus on variants in nuclear DNA and ignore the mitochondrial genome. In fact, analyzing variants in mitochondrial DNA (mtDNA) sequences presents special problems, which we resolve here with a general solution for the analysis of mtDNA in next-generation sequencing studies. The new program package comprises 1) an algorithm designed to identify mtDNA variants (i.e., homoplasmies and heteroplasmies), incorporating sequencing error rates at each base in a likelihood calculation and allowing allele fractions at a variant site to differ across individuals; and 2) an estimation of mtDNA copy number in a cell directly from whole-genome sequencing data. We also apply the methods to DNA sequence from lymphocytes of ~2,000 SardiNIA Project participants. As expected, mothers and offspring share all homoplasmies but a lesser proportion of heteroplasmies. Both homoplasmies and heteroplasmies show 5-fold higher transition/transversion ratios than variants in nuclear DNA. Also, heteroplasmy increases with age, though on average only ~1 heteroplasmy reaches the 4% level between ages 20 and 90. In addition, we find that mtDNA copy number averages ~110 copies/lymphocyte and is ~54% heritable, implying substantial genetic regulation of the level of mtDNA. Copy numbers also decrease modestly but significantly with age, and females on average have significantly more copies than males. The mtDNA copy numbers are significantly associated with waist circumference (p-value = 0.0031) and waist-hip ratio (p-value = 2.4×10-5), but not with body mass index, indicating an association with central fat distribution. To our knowledge, this is the largest population analysis to date of mtDNA dynamics, revealing the age-imposed increase in heteroplasmy, the relatively high heritability of copy number, and the association of copy number with metabolic traits.",
    "full_text": "RESEARCH ARTICLE\nAssessing Mitochondrial DNA Variation and\nCopy Number in Lymphocytes of ~2,000\nSardinians Using Tailored Sequencing\nAnalysis Tools\nJun Ding1*, Carlo Sidore2,3,4, Thomas J. Butler1, Mary Kate Wing2, Yong Qian1,\nOsorio Meirelles1, Fabio Busonero2,3, Lam C. Tsoi2, Andrea Maschio2,3, Andrea Angius3,\nHyun Min Kang2, Ramaiah Nagaraja1, Francesco Cucca3,4, Gonçalo R. Abecasis2,\nDavid Schlessinger1*\n1 Laboratory of Genetics, National Institute on Aging, NIH, Baltimore, Maryland,2 Department of\nBiostatistics and Center for Statistical Genetics, University of Michigan, Ann Arbor, Michigan,3 Istituto di\nRicerca Genetica e Biomedica, Consiglio Nazionale delle Ricerche, Monserrato, Cagliari, Italy,4 Università\ndegli Studi di Sassari, Sassari, Italy\n* jun.ding@nih.gov (JD); SchlessingerD@grc.nia.nih.gov (DS)\nAbstract\nDNA sequencing identifies common and rare genetic variants for association studies,\nbut studies typically focus on variants in nuclear DNA and ignore the mitochondrial genome.\nIn fact, analyzing variants in mitochondrial DNA (mtDNA) sequences presents special\nproblems, which we resolve here with a general solution for the analysis of mtDNA in next-\ngeneration sequencing studies. The new program package comprises 1) an algorithm\ndesigned to identify mtDNA variants (i.e., homoplasmies and heteroplasmies), incorporating\nsequencing error rates at each base in a likelihood calculation and allowing allele fractions at\na variant site to differ across individuals; and 2) an estimation of mtDNA copy number in a cell\ndirectly from whole-genome sequencing data. We also apply the methods to DNA sequence\nfrom lymphocytes of ~2,000 SardiNIA Project participants. As expected, mothers and off-\nspring share all homoplasmies but a lesser proportion of heteroplasmies. Both homoplasmies\nand heteroplasmies show 5-fold higher transition/transversion ratios than variants in nuclear\nDNA. Also, heteroplasmy increases with age, though on average only ~1 heteroplasmy\nreaches the 4% level between ages 20 and 90. In addition, we find that mtDNA copy number\naverages ~110 copies/lymphocyte and is ~54% heritable, implying substantial genetic regula-\ntion of the level of mtDNA. Copy numbers also decrease modestly but significantly with age,\nand females on average have significantly more copies than males. The mtDNA copy num-\nbers are significantly associated with waist circumference (p-value = 0.0031) and waist-hip\nratio (p-value = 2.4×10\n-5), but not with body mass index, indicating an association with central\nfat distribution. To our knowledge, this is the largest population analysis to date of mtDNA\ndynamics, revealing the age-imposed increase in heteroplasmy, the relatively high heritability\nof copy number, and the association of copy number with metabolic traits.\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 1/1 8\nOPEN ACCESS\nCitation: Ding J, Sidore C, Butler TJ, Wing MK, Qian\nY , Meirelles O, et al. (2015) Assessing Mitochondrial\nDNA Variation and Copy Number in Lymphocytes of\n~2,000 Sardinians Using Tailored Sequencing\nAnalysis Tools. PLoS Genet 11(7): e1005306.\ndoi:10.1371/journal.pgen.1005306\nEditor: Greg Gibson, Georgia Institute of Technology,\nUNITED STATES\nReceived: December 14, 2014\nAccepted: May 28, 2015\nPublished: July 14, 2015\nCopyright: This is an open access article, free of all\ncopyright, and may be freely reproduced, distributed,\ntransmitted, modified, built upon, or otherwise used\nby anyone for any lawful purpose. The work is made\navailable under theCreative Commons CC0public\ndomain dedication.\nData Availability Statement:The sequencing data\nare available under the SardiNIA Medical Sequencing\nDiscovery Project, dbGaP Study Accession:\nphs000313.v3.p2.\nFunding: This study was funded in part by the\nNational Institutes of Health (National Institute on\nAging, National Heart Lung and Blood Institute, and\nNational Human Genome Research Institute). This\nresearch was supported by National Human Genome\nResearch Institute grants HG005581, HG005552,\nHG006513, HG007089, HG007022, and HG007089;\nby National Heart Lung and Blood Institute grant\nAuthor Summary\nWe present a new program that provides a general solution for the analysis of variation of\nmtDNA (the small circular genome in mitochondria, separate from the DNA in the\nnucleus). This is needed because many large-scale genetic studies are using new DNA\nsequencing technologies to help assess genetic variation and its effects on disease, but the\nmitochondrial genome is often ignored because it exists in many copies in a cell, compli-\ncating analyses. Our approach both identifies variants on mitochondrial genome and esti-\nmates mtDNA copy number. Applying the programs to DNA sequence from ~2,000\nSardiNIA project participants, we show that heteroplasmies (mtDNA variants with more\nthan one allele at a DNA site) increase with age, and that copy number is relatively highly\nheritable and is correlated with metabolic traits, particularly central fat levels. The pro-\ngram package can facilitate comprehensive mtDNA analysis from any whole-genome\nsequencing data, with an increase in the understanding of mtDNA dynamics and its\npotential role in aging and metabolism.\nIntroduction\nAs the“cellular power plant”, each mitochondrion encodes some of its constituent proteins in\nresident mitochondrial DNA (mtDNA). Human mtDNA is a circular molecule of 16,569\nbases, and mutations that have become fixed in the sequence of every mtDNA may cause sev-\neral genetic diseases. Accumulation of variants during growth has been suggested to have an\nimportant role in aging and cancer[1–3]. However, although the degree to which mtDNA var-\nies heritably and somatically has been much discussed, it has not been analyzed on a popula-\ntion basis.\nModern high-throughput sequencing facilitates systematic identification of common and\nrare DNA variants, including many associated with complex diseases and quantitative traits\n[4,5]. To extend comparable sequence analysis to mtDNA, an important step in the analysis\npipeline must be modified. Variant identification for nuclear DNA using sequencing data has\nbeen greatly refined, typically using a likelihood-based model to combine information from\nsequence reads and predict the genotype with the highest posterior probability at a site[6,7].\nBut mtDNA analysis is one of a number of instances (seeDiscussion) in which scoring allelic\nvariation is more complicated, because there are more than the three discrete genotype states\nfound in nuclear DNA. Instead of having two copies of each autosome (chromosomes 1–22),\nhuman cells have 100–10,000 separate copies of mtDNA, and different copies of mtDNA may\ndiffer in DNA sequence at any base. Thus, the conventional nuclear DNA variant caller must\nbe adapted to identify mtDNA variants.\nWe describe an algorithm specifically tailored to identify mtDNA variants from sequencing\ndata, and apply it to 2,077 participants in the SardiNIA project[8]. We analyze both homoplas-\nmies (conventionally defined as variants affecting all of the mtDNA copies within a cell com-\npared to a standard sequence) and heteroplasmies (defined as the presence of a mixture of\nmore than one type of mtDNA within a cell). We examine transition/transversion ratios, cod-\ning vs. noncoding changes, and changes with age.\nAnalyses are extended with a method to assess mtDNA copy number. Copy number is a\ncritical determinant of mitochondrial function and has been proposed as a potential biomarker\nfor disease. For example, studies have shown that elevated mtDNA copy number is associated\nwith cancer risk[9,10]. Given that there are two copies of autosomal DNA in a cell, our method\ninfers mtDNA copy numbers based on the observed ratios of sequence coverages between\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 2/1 8\nHL117626; by the Intramural Research Program of\nthe NIH, National Institute on Aging, with contracts\nN01-AG-1-2109 and HHSN271201100005C; and by\nSardinian Autonomous Region (L.R. no. 7/2009)\ngrant cRP3-154. The funders had no role in study\ndesign, data collection and analysis, decision to\npublish, or preparation of the manuscript.\nCompeting Interests:The authors have declared\nthat no competing interests exist.\nmtDNA and autosomal DNA. We estimate the heritability of copy number and show its corre-\nlations with gender, age, and waist circumference and waist-hip ratio.\nMaterials and Methods\nEthics statement\nAll participants gave written informed consent, with protocols approved by institutional review\nboard of the National Institute on Aging (04-AG-N317).\nmtDNA variant caller\nRecent analyses of mtDNA variants[11,12] have taken an approach that determines homoplas-\nmic and heteroplasmic sites directly based on allele counts of sequence reads. This approach\ndoes not account for error rates in sequence reads, and hence potentially results in both false\npositive and false negative variant calls. We propose a likelihood-based model that takes into\naccount the sequencing error rate at each base in each sequence read. The algorithm builds on\nthe conventional autosomal DNA variant callers[6,7], but is modified to allow for allele frac-\ntions (i.e., heteroplasmic levels) at a variant site to vary across individuals.\nLikelihood-based model. We aim to predict the genotype at each mtDNA position, one\nindividual at a time; therefore, the subscripts indicating mtDNA position and individual are\nsuppressed for simplicity. At each mtDNA base position, we useG to denote one individual’s\ngenotype. In theory,G can take 15 possible values {A, C, G, T, A/C, A/G, A/T, C/G, C/T, G/T,\nA/C/G, A/C/T, A/G/T, C/G/T, A/C/G/T}. IfG takes one of the first four possible genotypes\n(with a single allele), it is by definition called a homoplasmy. However, by convention, if the\ngenotype is the same as the standard reference allele, it is not counted as a homoplasmy. The\nremaining 11 possible genotypes are called heteroplasmies. We estimate the posterior probabil-\nity of having a certain genotypeG given all the observed sequence reads:\nPðGjreadsÞ/ PðreadsjGÞ/C2 PðGÞð 1Þ\nwhere P(G|reads) is the posterior probability,P(reads|G) is called“genotype likelihood”, andP\n(G) is the prior probability of genotypeG, which can be assigned by researchers. We can then\nassign the genotype with highest posterior probability to the site for the individual. So the key\nis to estimate 15 genotype likelihoods:P(reads|G).\nAssuming the mtDNA site of interest is covered by N sequence reads, we use r\ni to denote\nthe called base from read i (i = 1, 2,... , N) and ei to denote the corresponding sequencing error\nrate of that base for read i, which can be estimated from the corresponding Phred-like base\nquality score Qi (ei ¼ 10/C0Qi=10).\nWe assume that each sequence read represents an independent random sampling from the\nmultiple copies of mtDNA in a cell, and therefore a genotype likelihood can be estimated by:\nPðreadsjGÞ¼\nYN\ni¼1 PðrijGÞð 2Þ\nWhen G has only one allele (i.e.G 2 {A, C, G, T}), P(ri|G) can be directly estimated while con-\nsidering the base error rate:\nPðrijGÞ¼\n1 /C0 ei; if ri ¼ G\nei\n3 ; if ri 6¼ G\n8\n<\n:\nBecause a cell has multiple copies of mtDNA and each individual can have different frac-\ntions for the alleles, whenG has more than one allele (i.e.G 2 {A/C, A/G, A/T, C/G, C/T, G/T,\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 3/1 8\nA/C/G, A/C/T, A/G/T, C/G/T, A/C/G/T}), we need to introduce allele fractions as unknown\nparameters of interest to be estimated by maximum likelihood. For example, whenG has two\nalleles G1 and G2, G1, G2 2 {A, C, G, T}, we denote byf1 and f2 the allele fractions ofG1 and G2\nfor the individual, respectively. Then:\nPðrijGÞ¼\nð1 /C0 eiÞ/C2f1 þ ei\n3 /C2f2; if ri ¼ G1\nð1 /C0 eiÞ/C2f2 þ ei\n3 /C2f1; if ri ¼ G2\nei\n3 ; if ri 6¼ G1; ri 6¼ G2\n8\n>>>>\n><\n>>>>>\n:\nBecause f\n1+f2 = 1, we effectively have a single unknown parameter in the above equation.\nSimilarly, we can derive the corresponding formulas whenG has three or four alleles with\nmore allele fractions as unknown parameters (seeS1 Text).\nWe next consider all the reads covering the mtDNA site of interest and update the genotype\nlikelihoods as a function of allele fractions usingEq 2. WhenG has more than one allele, we\nmaximize the genotype likelihood functions using allele fractions as parameters (the Simplex\nmethod for maximization is implemented in our variant calling algorithm). We then use maxi-\nmized genotype likelihood to estimate posterior probabilities inEq 1.\nWe note that a similar idea was recently proposed by Ye et al.[13] to identify mtDNA het-\neroplasmies in sequences from 1000 Genomes Project participants. Our publicly available soft-\nware package was developed independently and further accounts for the circularity of the\nmtDNA genome (see below) and identifies both homoplasmies and heteroplasmies.\nAccounting for the circularity of the mtDNA genome.Even though mtDNA has a circu-\nlar genome, current studies investigating the mtDNA variation from sequencing data employ a\nlinear genome as reference to align sequence reads. Typically, researchers use the revised Cam-\nbridge Reference Sequence (rCRS, Gene Bank number NC_012920) as the“mtDNA reference”,\nwith a“breakpoint” introduced in the replication control region to“start” at position 1 and\n“end” at position 16,569. As a result, sequence reads that link the two“ends” (i.e., those that\ncover the artificial breakpoint in the circular genome) are not aligned and are discarded. Con-\nsequently, the variant caller uses an incomplete set of reads to identify variants. We propose a\n“double alignment” strategy, using two linear reference genomes in sequence read alignment\n(S1 Fig). The conventional rCRS is the reference for the first sequence alignment, and variants\nare then identified only in the internal region of the genome (e.g., from position 4,000 to posi-\ntion 12,000), skipping the two artificial ends of the rCRS. A“shifted” rCRS reference is then\ncreated by making a breakpoint in the middle of the circular sequence (position 8,000); the\n“shifted” rCRS thus starts at the original position 8,000 and ends at the original position 7,999\n(S1 Fig). The sequence alignment is then repeated using the shifted rCRS as reference. Intui-\ntively, one could simply align the whole-genome sequence reads to the human nuclear genome\nplus the shifted rCRS reference, but we propose a more efficient approach that combines the\nunmapped reads and reads mapped to rCRS reference from the first alignment, and then uses\nthem as the input reads for the second alignment. This approach guarantees that all the reads\ncovering the original break point are included in the analysis. We then use the variant caller to\ncall variants between original positions 1 to 4,000 and between 12,000 to 16,569. Variant calling\nin these two regions is not affected by the breakpoint at position 8,000. Finally, we combine the\ntwo sets of called variants from the two alignments to obtain a complete set of variants for the\nwhole mtDNA genome. The pipeline for the“double alignment” procedure is outlined inFig 1.\nWhen the“double alignment” strategy was applied in our SardiNIA data set, the most signifi-\ncant read depth increase was observed in the 100 bp region on each side of the breakpoint, with\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 4/1 8\nFig 1. Analysis pipeline to identify mtDNA variants includes aligning sequence reads to the whole genome reference (including mtDNA rCRS\nreference); extracting mtDNA reads; combining mapped and unmapped reads to do a second alignment to the shifted rCRS reference; applying\nthe mtDNA variant caller separately to the reads mapped to the two linear mtDNA reference genomes; and combining the two sets of called\nmtDNA variants.\ndoi:10.1371/journal.pgen.1005306.g001\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 5/1 8\na 2.1-fold increase (or raw coverage increase of 114X) in average depth (seeS1 Textfor more\ndiscussion on the coverage).\nInferring mtDNA variation from whole-genome sequence\nThe mtDNA variant caller was applied to whole-genome sequence data of 2,077 individuals\nselected among 6,921 participants in the“SardiNIA” study of the genetics of quantitative traits\nin the Sardinian founder population [8]. The details on the selection of individuals to be\nsequenced are inS1 Text.\nSequence data were generated at the University of Michigan Medical School Core Sequenc-\ning Lab. DNA was extracted by a standard salting-out method from whole blood samples after\na red blood cell lysing step. Libraries were generated from 3–5 μg of genomic DNA using\nsample preparation kits from Illumina and New England Biolabs. Paired-end sequence reads\n(typically, 100 to 120 bp in length) were generated with Illumina Genome Analyzer IIx and\nIllumina HiSeq 2000 instruments. Samples were sequenced to an average depth of 4.2X.\nReads were aligned to the human reference genome (GRCh37 assembly with decoy\nsequences, as available in the 1000 Genomes Project ftp site,ftp://ftp.1000genomes.ebi.ac.uk)\nusing BWA (version 0.5.9), allowing at most 5 differences (mismatches or gaps), and trimming\nread tails with average base quality<15. After alignment, base qualities were recalibrated and\nduplicate reads were flagged and excluded from analysis. We reviewed summary metrics gener-\nated using QPLOT and verifyBamId for each aligned sample, to remove samples with low\nsequencing depth, poor coverage of regions with high or low GC content, or evidence for sam-\nple contamination.\nWe then extracted from all sequence reads those that were uniquely mapped to the mtDNA\nreference genome by bwa with a mapping quality score/C2120 (i.e., the theoretical probability of\nwrong alignment/C201%). The mtDNA variant caller was applied only to these mtDNA reads.\nFig 1outlines the pipeline for aligning sequence reads to the whole genome reference, extract-\ning mtDNA reads, and applying the mtDNA variant caller taking into account the circularity\nof the mtDNA genome.\nIn implementing the likelihood-based model to identify mtDNA variants, we also applied\nquality control filters to help avoid the inclusion of false variants because of sequencing errors.\nAt a position of interest in mtDNA, we considered only reads with base sequencing error rate\n/C201% (i.e., recalibrated base quality score/C2120). We also applied sequencing depth filters: we\nrequired an overall mtDNA median depth> 100 for an individual to be included in the analy-\nsis; and at each base of interest for variant calling, we required a raw depth/C2140 and a depth\n/C2110 after base quality score filtering at 20. To call a heteroplasmy, we further required that 1)\nall alleles of the called genotype are observed at least once in both forward and reverse strand\nsequence reads, and 2) the minor allele fraction (MAF) for an individual is/C214%. The MAF\nthreshold was chosen based on simulations in which we mimicked the SardiNIA sequencing\nexperiments and simulated similar coverage data with reads of comparable quality scores (see\nS1 Textfor details). An MAF threshold of 4% corresponded to an empirical false discovery rate\n(i.e., the proportion of false heteroplasmies among all identified heteroplasmies) of 2%. We\nalso used data from a deeply sequenced parent-child trio (~80-fold average coverage for\nnuclear DNA and ~6,000-fold average coverage for mtDNA) to evaluate the accuracy of variant\ncalling for the same three individuals from the low-pass sequencing data. Using the results\nfrom deep-sequencing data as gold standards, we confirmed all the heteroplasmies identified in\nthe three individuals by our variant caller with the 4% MAF cut-off (We found no false nega-\ntives in the child or the mother of the trio, but did see one false negative in the father). By con-\ntrast, if we lowered the MAF cut-off to a less stringent threshold of 1.6%, we observed an\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 6/1 8\naverage false discovery rate of 30%. Looking at deep sequencing data from a few individuals\ncould not provide a definite guideline about the MAF cut-off, but supports well the choice of a\n4% MAF cut-off for this dataset.\nWe have also considered the possibility that nuclear copies of parts of mtDNA sequence\n(i.e., nuclear mitochondrial DNA, or NUMTs) might be the source of false positives for hetero-\nplasmies. In our analysis, as mentioned above, we included only reads that were uniquely\nmapped to mtDNA. With further analyses on sampled individual cases, we found that any\nrepresentation of NUMTs is minimal, and should therefore not restrict the utility of the\nmethod (SeeS1 Textfor a detailed discussion).\nWe used publicly available online software HaploGrep (http://haplogrep.uibk.ac.at/) to clas-\nsify SardiNIA individuals into different haplogroups based on mtDNA, and ANNOVAR[14]\nto annotate the called variants on mtDNA and assess whether homoplasmies and heteroplas-\nmies show different distributions in functional categories.\nEstimating mtDNA copy number from sequencing data\nAssuming autosomal and mtDNA are handled and sequenced with no significant differences,\naverage sequencing coverage should be proportional to DNA copy number for autosomal and\nmtDNA:\nmtDNA average coverage\nmtDNA copy number per cell¼ autosomal DNA average coverage\nautosomal DNA copy number per cell\nAs a proof of principle, we looked at the average depth of coverage across the 22 autosomal\nchromosomes for 100 randomly selected individuals and observed that as expected, sequencing\ndepth was largely flat across 22 chromosomes for each individual (S2 Fig).\nBecause there are two copies of autosomal DNA in a cell, we could infer the mtDNA copy\nnumber by:\nmtDNA copy number per cell¼\nmtDNA average coverage\nautosomal DNA average coverage/C22 ð3Þ\nWe used SAMtools (http://samtools.sourceforge.net/) to obtain the coverage of each base in\nthe genome from the aligned bam[15] files. The average coverages for autosomal DNA and\nmtDNA were then calculated accordingly.\nWe applied our computational method to the same whole-genome sequencing data from\n2,077 Sardinians and estimated mtDNA copy number for each sample. We also used a Nova-\nQUANT Human Mitochondrial to Nuclear DNA Ratio Kit (EMD Chemicals Inc.) to validate a\nrandom group of 18 samples experimentally by qPCR (seeS1 Textfor more details). We tested\nfor age and gender effects on the mtDNA copy number, and also assessed any association of\nmtDNA copy number with eleven quantitative traits collected for the cohort that include 5\nanthropometric traits (height, weight, BMI, waist circumference, and waist-hip ratio), 2 frailty\ntraits (walking speed and grip strength), and 4 lipid traits (HDL-cholesterol, LDL-cholesterol,\ntotal cholesterol, and triglycerides). In addition, POLY software (http://www.sph.umich.edu/\ncsg/chen/public/software/poly/) was used to estimate the heritability of mtDNA copy number\nbased on the known family structure in the SardiNIA cohort.\nWe note that a similar framework has been suggested by Chu and colleagues[16] to estimate\ncopy number. However, their method identified only reads mapped to mtDNA and counted all\nthe remaining reads as mapped to nuclear DNA. As a result, it would include unmappable\nreads in calculations and would thus overestimate the nuclear DNA sequence coverage. Fur-\nthermore, in calculating the effective length of human genome, their method did not exclude\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 7/1 8\nthe regions in the nuclear DNA that could not be covered by sequencing. Our computational\nmethod avoids those pitfalls and hence should provide more accurate copy number estimates.\nHere we also validate the method with Q-PCR and implement it to estimate mtDNA copy\nnumber in a large-scale population study.\nURLs\nSoftware programs implementing our methods are freely available athttp://lgsun.irp.nia.nih.\ngov/hsgu/software/mitoAnalyzer/index.html.\nResults\nNature of variants and accumulation of heteroplasmies with age\nApplying our mtDNA variant calling program to the cohort of 2,077 Sardinians, we identified\nan overall average of 22.2 homoplasmies and 0.73 heteroplasmies per individual.S1 Tableand\nS2 Table provide complete lists of homoplasmies and heteroplasmies, respectively.S3 Fig\nshows histograms of the numbers of homoplasmies and heteroplasmies per individual. The\ndistribution of the number of homoplasmies per individual was bimodal. One group showed\nrelatively fewer homoplasmies (mode of 11), whereas the other had a mode of 32. Compared to\nthe current reference phylogenetic tree, the two modes represented different European hap-\nlogroups. The former fell into the HV subgroup (the mitochondrial reference genome sequence\nrCRS also belongs to this subgroup, accounting for the smaller number of homoplasmies) and\nthe latter was predominantly correlated with several other clades, including J, T and K sub-\ngroups. Looking at the sharing of the mtDNA variants among the 2,077 individuals, we\nobserved significantly higher sharing of homoplasmies than heteroplasmies (Fig 2). For exam-\nple, 10% of homoplasmies were shared by more than 100 individuals and 2% of homoplasmies\nwere shared by more than 500. By contrast, only ~1% of heteroplasmies were shared by more\nthan 20 individuals.\nFor both homoplasmies and heteroplasmies, we further investigated numbers of transition\nand transversion base changes (Fig 3). The transition/transversion ratio was greater than 10 for\nboth homoplasmies and heteroplasmies, which is far higher than the ratio of 2.1 in human\nnuclear DNA (2.19 in the sequenced Sardinians; seeDiscussion). Homoplasmies and hetero-\nplasmies showed very similar patterns of base changes (Fig 3; seeDiscussion).\nUsing ANNOVAR to annotate the identified variants, we grouped them into four functional\ncategories: 1) intergenic; 2) structural RNA(rRNA and tRNA)-encoding; 3) synonymous pro-\ntein-coding; and 4) non-synonymous protein-coding. As shown inFig 4, compared to hetero-\nplasmies, homoplasmies are less likely to be RNA-encoding or non-synonymous (chi-square\ntest p-value = 3×10\n−13), consistent with the notion that heteroplasmies represent new muta-\ntions and that natural selection makes it challenging for deleterious variants to become fixed as\nhomoplasmies.\nTo assess any age effect on the number of mtDNA variants, we used a Poisson loglinear\nmodel to test the association between the number of variants and age among unrelated individ-\nuals (seeS1 Textfor the procedure to select unrelated individuals from the whole cohort). We\nobserved no relationship between age and the number of homoplasmies (S4 Fig). By contrast,\nwith a minor allele fraction threshold of 4%, we observed a significant increasing trend of the\nnumber of heteroplasmies with age (p-value = 6.2×10−5). The increasing slope is small, yielding\nan average increase of ~1 heteroplasmy between ages 20 and 90 (Fig 5), but the slope increased\nand became more significant when we repeated the analyses with MAF thresholds of 1.6% and\n3% (Fig 5; p-values equal to 1.1×10−15 and 2.7×10−11, respectively). When lowering the MAF\nthreshold, one expects to include more true heteroplasmies together with more false positives.\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 8/1 8\nHowever, false heteroplasmies have no likely relationship with age, whereas the additional\ntrue heteroplasmies will strengthen the trend. On the other hand, when we raised the MAF\nthreshold to 5% and 6% (i.e., applying more stringent thresholds), the trend remained but p-\nvalues were less significant (8.9×10\n−4 and 0.017, respectively). Thus, given the minor allele frac-\ntion thresholds applied, there is appreciable accumulation of heteroplasmies with age (see\nDiscussion).\nInheritance of mtDNA variants\nWe used 333 parent-child trios included in the cohort to investigate the sharing of mtDNA var-\niants between parents and their children and to assess features of the inheritance pattern of\nmtDNA variants. Children and their mothers share essentially all homoplasmies. We observed\n7,273 homoplasmic sites in 333 children, among which 7,238 (99.5%) were also observed in\ntheir mothers (Table 1). At the same time, 2,940 (40.4%) homoplasmies were also observed in\ntheir fathers. This observation is not incompatible with maternal inheritance, because many\nhomoplasmies are shared across the Sardinian population, and thus children and their fathers\ncould share many by chance. This is further supported by the observation that fathers also\nshared ~40% of mothers’homoplasmies (Table 1). Concerning heteroplasmies, we observed\n207 heteroplasmic sites in 333 children, among which 66 (31.9%) were observed in their moth-\ners and 1 (0.4%) was observed in their fathers. These results indicate that children inherit a\nFig 2. Sharing of mtDNA variants among 2,077 SardiNIA sequencing project participants.\ndoi:10.1371/journal.pgen.1005306.g002\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 9/1 8\nFig 3. Two classes of base changes for homoplasmies and heteroplasmies.\ndoi:10.1371/journal.pgen.1005306.g003\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 10 / 18\nproportion of heteroplasmies from their mothers, whereas new heteroplasmies arise both in\ntheir own and in their mothers’lymphocytes during life. The sharing of a single heteroplasmy\nbetween a child and its father could well have occurred by chance or may represent rare true\npatrilineal transmission. Further discussion on the inheritance of heteroplasmies can be found\nin S1 Text.\nEstimates of mtDNA copy number\nEstimating mtDNA copy number for each sample, we observed a range from 50 to 350, with\nmost individuals between 75 and 150 (with mean of 111.5 and standard deviation of 25.0; his-\ntogram inS5 Fig). To assess copy number by a standard biochemical assay for comparison, we\ncarried out Q-PCR experimental validation for 18 randomly chosen samples. The Q-PCR mea-\nsures have considerable intrinsic variability of their own; but taking an average of two experi-\nments, the computational estimates and experimental measurements shared a similar range\n(scatterplot inS6 Fig), with a correlation of 0.82.\nCorrelations of copy number with gender, age, and waist and waist-hip\nratio\nWe observed a significant gender effect on mtDNA copy number: on average, females have 6.7\n(6.2%) more copies of mtDNA than males (p-value = 1.6×10−9). After adjusting for gender and\nFig 4. Distribution of homoplasmies and heteroplasmies in four functional categories.\ndoi:10.1371/journal.pgen.1005306.g004\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 11 / 18\naverage sequencing coverage, the estimated mtDNA copy number decreases significantly with\nage (p-value = 2.7×10−6, with an expected 1.5 copy number decrease for every 10 years of age\nincrease, S7 Fig).\nWhen testing the association of mtDNA copy number with a set of 11 quantitative traits,\nafter adjusting for age, gender, and average sequencing coverage, we observed that mtDNA\ncopy number is significantly associated with waist circumference (p-value = 0.0031; after\nadjusting for multiple tests, Bonferroni-corrected p-value = 0.034) and waist-hip ratio (p-\nFig 5. The effect of age on the number of heteroplasmies in the unrelated SardiNIA sequencing\nproject participants.The number of heteroplasmies increases with age with different (colored) minor allele\nfraction (MAF) thresholds. Each line plots the expected number of heteroplasmies based on the Poisson\nloglinear model against age at an MAF threshold; while the points represent the observed mean number of\nheteroplasmies in each age group (<40, 40– 50, 50– 60, 60– 70, 70– 80, >80).\ndoi:10.1371/journal.pgen.1005306.g005\nTable 1. The sharing of mtDNA variants in parent-child trios.\nComparing child with parents Comparing mother with father\n# families # variants in Child # shared with mother # shared with father # variants in mother # shared with father\nHomoplasmies 333 7273 7238 (99.5%) 2940 (40.4%) 7266 2937 (40.4%)\nHeteroplasmies 333 207 66 (31.9%) 1 (0.4%) 206 0 (0%)\ndoi:10.1371/journal.pgen.1005306.t001\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 12 / 18\nvalue = 2.4×10−5; Bonferroni-corrected p-value = 2.6×10−4), but not with BMI (p-value = 0.42)\nor two frailty-related traits (walking speed, p-value = 0.32; grip strength, p-value = 0.11). We\nalso estimated the heritability of mtDNA copy number as 54%, implying strong genetic regula-\ntion of mtDNA level.\nDiscussion\nmtDNA sequence variation\nThe method presented here improves mtDNA variant calling in two ways. First, it directly\nmodels sequencing error rates (i.e., uncertainty) in likelihood calculations, and therefore more\naccurately identifies mtDNA variants and estimates minor allele fractions of heteroplasmies in\nindividuals. Second, the pipeline is adapted to the circular mtDNA genome, aligning sequenc-\ning reads to two linear mtDNA reference genomes by a“double-alignment”strategy. This strat-\negy greatly increases the coverage in the hypervariable“junction” region— very important, for\nexample, for phylogenetic studies— that otherwise would have very poor coverage, and can also\nbe useful in aligning sequence reads of other circular genomes.\nRecently, several pioneering studies have also used next-generation sequencing technologies\nto assess mtDNA heteroplasmies. These include several studies applying deep sequencing to\namplified mtDNA [11,12,17,18] and others performing whole-genome sequencing and then\nextracting mtDNA sequence reads [4,13]. Most of these studies used a set of filters to account\nfor sequencing errors and technical artifacts in heteroplasmy identification, which generally\nincluded number of mismatches, mapping quality, base quality, minimum depth, double\nstrand validation, and minor allele fraction (MAF).S3 Tablecompares criteria for calling het-\neroplasmy among these studies and ours.\nNot surprisingly, depending on the sequencing coverage, different studies applied different\nMAF thresholds in calling heteroplasmies, which makes a direct comparison of results impossi-\nble. To do a fair comparison, we applied to five studies a common MAF threshold of 10%— the\nmaximum threshold used in any of the studies. In our study, at least one heteroplasmy is\nobserved in 21.8% of individuals. This is very comparable to the value of 24.4% found by Li\nand colleagues [12] in 133 individuals sequenced with a mean coverage of 85X, and to 23.1%\nobserved by Rebolledo-Jaramillo and colleagues [18] after sequencing amplified mtDNA from\n39 mother-child pairs to 20,000-fold coverage with additional steps to exclude PCR and\nsequencing errors. In addition, their high-quality data showed that on average one person pos-\nsessed about 1 heteroplasmy with MAF> 1%, which is in good agreement with our findings of\nan average of 0.73 heteroplasmies per person with MAF> 4% based on direct sequencing of\ntotal DNA.\nBy contrast, we note that the 1000 Genomes Pilot Project sequenced 163 individuals and\nfound that 45% possessed heteroplasmies with an MAF cut-off at 10% [4]. Similarly, Ye et al.\n[13] found the prevalence of heteroplasmy to be 44.4% in the full 1,085 member cohort of\n1000 Genomes Project. And a sixth study sequenced 40 HapMap individuals and found 65%\npossessing heteroplasmies with an MAF cut-off at 9% [19]. As a possible explanation of the dif-\nference in heteroplasmy prevalence between the two sets of studies, it is suggestive that the first\nthree studies (including ours) used DNA samples extracted directly from cells or tissues,\nwhereas the second set of three studies used DNA samples from transformed (lymphoblastoid)\ncell lines. Heteroplasmies could thus arise during the expansion of cell lines in culture; and if\nso, it may be prudent to assess mtDNA content level and heteroplasmies from untransformed\ncells.\nThe extent of recovery of alleles in the Sardinian cohort at ~180-fold average coverage (see\nbelow) is robust enough to infer some other salient characteristics of mtDNA variation. The\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 13 / 18\nanalyses indicate that the inheritance pattern of mtDNA variants can be explained by maternal\ninheritance of homoplasmies and a portion of heteroplasmies, with further heteroplasmic sites\narising during life in both children and mothers up to the time of cross-sectional sampling of\nthe cohort. This is consistent with observations from deep sequencing data for two CEPH fami-\nlies[11]. By looking at 333 trios, our study showed that 31.9% of heteroplasmies in children\nwere inherited from their mothers, consistent with the study of Rebolledo-Jaramillo et al. [18],\nwho found an inherited proportion of heteroplasmies (with MAF> 1%) of 28.9% and 27.7% in\nblood and buccal cells, respectively (results inferred from their Supplementary Materials).\nConsidering the nature of the allelic variants, the transition/transversion ratios for homo-\nplasmies and heteroplasmies are both about 10, about 5-fold higher than the ratio observed in\nhuman nuclear DNA (~2.1). This is consistent with the transition/transversion ratio estimated\nfor mitochondrial mutations occurring at a frequency/C201%[20], and is also consistent with the\nhypothesis that misincorporation by DNA polymerase gamma and the deamination of nucleo-\ntides are major sources of the base changes[20]. Homoplasmies and heteroplasmies share simi-\nlar distributions among the different types of base change (Fig 3), indicating that the\nmechanism creating base changes is likely to be the same for homoplasmies and heteroplas-\nmies. In addition, compared to homoplasmies, heteroplasmies are enriched at RNA encoding\nand non-synonymous protein-coding sites, consistent with new mutations being more likely to\nbe detrimental than those that survive selection during fixation.\nAs for the much-discussed possibility that heteroplasmies may accumulate with age, we did\nobserve a significant trend. To the best of our knowledge, this is the first direct analysis relating\nmtDNA variant number with age in a large-scale population study [We note that Rebolledo-\nJaramillo et al.[18] compared 39 mother-child pairs and show a similar positive association in\nmothers but not in children, perhaps because the children were too young or the sample size\nwas too small]. However, estimation of the true rate of increase requires further identification\nof lower-level heteroplasmies. As mentioned above, to recognize true heteroplasmies against a\nbackground of sequencing errors, we applied a conservative minor allele fraction threshold in\ncalling heteroplasmic sites and required that the minor and major alleles are observed from\nboth forward and reverse strands. These filters were necessitated by the level of average\nmtDNA coverage in each sample. The filters could be relaxed in several ways–for example, by\nincreasing read coverage by deep sequencing of total DNA. As another example, Rebolledo-Jar-\namillo et al.[18] lowered the heteroplasmy threshold to 1% by analyzing mtDNA purified and\namplified before sequencing. That approach, however, requires additional experimental proce-\ndures and eliminates the possibility of the simultaneous determination of mtDNA copy num-\nber. Additional approaches could use family structures to expand available reads or sequence\nDNA from single cells, which would assess only 100–1,000 mtDNA molecules, instead of that\nnumber augmented by millions of copies from all the cells in a lymphocyte sample. The algo-\nrithm could extend the power of analysis using other study designs as well. In particular, longi-\ntudinal analysis of a study cohort would be informative, but would require repeated sampling\nover time.\nSeveral approaches could also improve the variant calling algorithm itself. Calling variants\nby considering multiple individuals jointly or by considering linkage disequilibrium (LD)\nstructure among variants would probably add little to variant calling accuracy, because we\nobserved that heteroplasmies are rarely shared among individuals (Fig 2). But extensions that\ndetect insertions and deletions (i.e., indels, etc.) as well as single base variants could provide a\nmore complete catalogue of variation.\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 14 / 18\nmtDNA copy numbers and their dynamics\nIn assessing mtDNA copy number based on the sequencing coverage ratio between mtDNA\nand autosomal DNA, we assume that no significant differences are generated between reads of\nmtDNA and autosomal DNA during the sequencing and processing steps that include genomic\nDNA fragmentation, adapter ligation, PCR amplification, sequencing, and sequence align-\nment/mapping. The relatively high correlation with Q-PCR measurements supports this\nassumption, and the relatively high heritability of copy number (54%) is also in accord with the\nreliability of the estimates.\nWe were thus encouraged to use inferred mtDNA copy number in further analyses. We\nobserved that females on average have slightly but significantly higher mtDNA copy numbers\nthan males (6.7 more copies), and the average mtDNA copy number decreases with age, con-\nsistent with general decline of cellular energy metabolism during aging and with observations\nof other researchers in independent cohorts [21]. We note that lymphocytes, the cells studied\nhere, have characteristically low levels of cytoplasm, and the average number of mtDNA mole-\ncules per cell is relatively low (average of 111.5) compared to what may be expected in actively\ngrowing cells. In fact, further applications of our method to data from the 1000 Genomes Proj-\nect, which sequenced DNA from transformed lymphocytes, observed an average number of\nmtDNA copies that is ~6-fold greater (work in progress). This is consistent with the increased\nmtDNA copy number associated with augmented risk of several types of cancer[9,10].\nThe correlations of mtDNA copy number with waist circumference and waist-hip ratio, but\nnot with BMI (nor in further assessments, with height or lipid levels;Table 2), are intriguing.\nThe findings hint that mtDNA copy number may also be relatively associated with central obe-\nsity and body fat distribution, though further study is needed to find the basis for the\ncorrelation.\nThe relatively high heritability of copy number (54%) is also suggestive. Future analyses,\nincluding genome-wide association studies, should identify genetic factors underlying this sub-\nstantial heritability.\nFuture applications\nAlthough our variant calling algorithm was designed to identify mtDNA variants from\nsequencing data, its potential utility can easily extend to other instances of comparable\nTable 2. The effect of mtDNA copy number on a set of anthropometric, frailty, and lipid traits.\nTraits Testing the effect of copy number\nEffect* t value p-value\nHeight 0.0025 0.44 0.66\nWeight -0.0059 -0.55 0.58\nBMI -0.0032 -0.80 0.42\nWaist -0.0296 -2.96 0.0031\nWaist-hip ratio -0.00028 -4.24 0.000024\nWalking speed -0.00022 -1.00 0.32\nGrip strength 0.0130 1.60 0.11\nHDL-cholesterol -0.0099 -0.75 0.46\nLDL-cholesterol -0.0082 -0.25 0.80\n*Effect is the slope of the linear regression model, which corresponds to the expected mean change of the\ntrait per one unit increase of the mtDNA copy number. The regression models also include age, sex, and\nmean nuclear DNA sequence coverage as covariates.\ndoi:10.1371/journal.pgen.1005306.t002\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 15 / 18\nsequence heterogeneity. For example, such allelic heterogeneity is a major characteristic of can-\ncer, where mutations are expected to occur in only a subset of the sequenced cells because of\ntumor heterogeneity. Our method could be implemented to detect somatic mutations in cancer\ncells with allele fractions ranging between 0 and 1 (a similar framework has recently been pro-\nposed[22]). As another example, although the extent of RNA editing is unclear[23–27], the\nmethod has the potential to study RNA editing from sequencing data and infer the editing level\n— another parameter that ranges between 0 and 1. The method could also be adapted to the\nanalysis of cell-free fetal DNA in maternal plasma (i.e. a non-invasive way to sequence human\nfetus[28]), where an important step is to estimate the proportion that is fetal in origin in DNA\nisolated from maternal plasma during pregnancy.\nOverall, our study with ~2,000 individuals is the largest population-scale study of mtDNA\nvariation thus far, and the application of the two mtDNA analysis tools to the SardiNIA study\nindicates that when whole-genome sequencing data are available, a set of analyses on mtDNA\nvariants and copy numbers can be performed with no additional experimental cost. Many pop-\nulation studies collecting large-scale sequencing data could thus extend the analyses of genetic\nfactors affecting mtDNA levels, their inheritance, and their relation to aging and disease.\nSupporting Information\nS1 Fig. The“double alignment” strategy using two linear reference genomes to account for\nthe circularity of the mtDNA genome in sequence read alignments.Variants are called in\nthe blue region of each linear reference genome.\n(PDF)\nS2 Fig. Average sequencing coverages across 22 autosomal chromosomes for 100 randomly\nselected Sardinians.\n(PDF)\nS3 Fig. Distributions of the numbers of homoplasmies and heteroplasmies per individual.\n(PDF)\nS4 Fig. The effect of age on the number of homoplasmies in SardiNIA sequencing project\nparticipants (based on a Poission regression model).\n(PDF)\nS5 Fig. Distribution of the estimated mtDNA copy numbers in ~2,000 Sardinians.\n(PDF)\nS6 Fig. Scatterplot of computational and experimental estimates of mtDNA copy numbers\nfor 18 randomly selected samples (correlation coefficient: 0.82).\n(PDF)\nS7 Fig. The estimated mtDNA copy numbers decrease with age.\n(PDF)\nS8 Fig. Sequencing depth across the mtDNA genome for 10 randomly selected individuals.\n(PDF)\nS9 Fig. The scatterplot of alternative allele fractions (AAF) of inherited heteroplasmies in\nchildren and their mothers.\n(PDF)\nS10 Fig. Histograms of MAFs in children for inherited and non-inherited heteroplasmies.\n(PDF)\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 16 / 18\nS1 Table. A list of homoplasmies identified in the Sardinian cohort.\n(XLSX)\nS2 Table. A list of heteroplasmies identified in the Sardinian cohort.\n(XLSX)\nS3 Table. Comparison of criteria for calling heteroplasmy among multiple studies.\n(XLSX)\nS4 Table. A list of heteroplasmies shared by children and their mothers in 333 trios.\n(XLSX)\nS5 Table. Results from mapping reads supporting heteroplasmies to NUMTs.\n(DOCX)\nS1 Text. Supplementary materials and methods.\n(DOCX)\nAcknowledgments\nWe thank all the volunteers of the SardiNIA project who generously participated in the study\nand made this research possible. We are grateful to the two anonymous reviewers and the Sec-\ntion Editor for their insightful and constructive comments and suggestions, which have led to\nchanges that significantly improved the manuscript. We note that the mtDNA variant calling\nmethod was first presented at the 62nd Annual Meeting of The American Society of Human\nGenetics on November 9, 2012 in San Francisco, CA (Abstract #276).\nAuthor Contributions\nConceived and designed the experiments: JD FC GRA DS. Performed the experiments: FB AM\nAA RN FC GRA. Analyzed the data: JD CS TJB YQ OM. Contributed reagents/materials/anal-\nysis tools: MKW LCT HMK. Wrote the paper: JD CS RN FC GRA DS.\nReferences\n1. Chinnery PF, Samuels DC, Elson J, Turnbull DM. Accumulation of mitochondrial DNA mutations in age-\ning, cancer, and mitochondrial disease: is there a common mechanism? The Lancet. 2002; 360: 1323–\n1325. doi:10.1016/S0140-6736(02)11310-9\n2. Wallace DC. Mitochondrial genetics: a paradigm for aging and degenerative diseases? Science. 1992;\n256: 628– 632. doi:10.1126/science.1533953 PMID: 1533953\n3. Wallace DC. Mitochondrial DNA sequence variation in human evolution and disease. Proc Natl Acad\nSci. 1994; 91: 8739– 8746. PMID:8090716\n4. Consortium T 1000 GP. A map of human genome variation from population-scale sequencing. Nature.\n2010; 467: 1061– 1073. doi:10.1038/nature09534 PMID: 20981092\n5. Yi X, Liang Y, Huerta-Sanchez E, Jin X, Cuo ZXP, Pool JE, et al. Sequencing of 50 human exomes\nreveals adaptation to high altitude. Science. 2010; 329: 75– 78. doi:10.1126/science.1190371 PMID:\n20595611\n6. DePristo MA, Banks E, Poplin R, Garimella KV, Maguire JR, Hartl C, et al. A framework for variation dis-\ncovery and genotyping using next-generation DNA sequencing data. Nat Genet. 2011; 43: 491– 498.\ndoi: 10.1038/ng.806 PMID: 21478889\n7. Li Y, Sidore C, Kang HM, Boehnke M, Abecasis GR. Low-coverage sequencing: Implications for design\nof complex trait association studies. Genome Res. 2011; 21: 940– 951. doi:10.1101/gr.117259.110\nPMID: 21460063\n8. Pilia G, Chen W-M, Scuteri A, Orrú M, Albai G, Dei M, et al. Heritability of Cardiovascular and Personal-\nity Traits in 6,148 Sardinians. PLoS Genet. 2006; 2: e132. doi:10.1371/journal.pgen.0020132 PMID:\n16934002\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 17 / 18\n9. Lan Q, Lim U, Liu C-S, Weinstein SJ, Chanock S, Bonner MR, et al. A prospective study of mitochon-\ndrial DNA copy number and risk of non-Hodgkin lymphoma. Blood. 2008; 112: 4247– 4249. doi:10.\n1182/blood-2008-05-157974 PMID: 18711000\n10. Thyagarajan B, Wang R, Nelson H, Barcelo H, Koh W-P, Yuan J-M. Mitochondrial DNA Copy Number\nIs Associated with Breast Cancer Risk. PLoS ONE. 2013; 8: e65968. doi:10.1371/journal.pone.\n0065968 PMID: 23776581\n11. He Y, Wu J, Dressman DC, Iacobuzio-Donahue C, Markowitz SD, Velculescu VE, et al. Heteroplasmic\nmitochondrial DNA mutations in normal and tumour cells. Nature. 2010; 464: 610– 614. doi:10.1038/\nnature08802 PMID: 20200521\n12. Li M, Schönberg A, Schaefer M, Schroeder R, Nasidze I, Stoneking M. Detecting Heteroplasmy from\nHigh-Throughput Sequencing of Complete Human Mitochondrial DNA Genomes. Am J Hum Genet.\n2010; 87: 237– 249. doi:10.1016/j.ajhg.2010.07.014 PMID: 20696290\n13. Ye K, Lu J, Ma F, Keinan A, Gu Z. Extensive pathogenicity of mitochondrial heteroplasmy in healthy\nhuman individuals. Proc Natl Acad Sci. 2014; 111: 10654– 10659. doi:10.1073/pnas.1403521111\nPMID: 25002485\n14. Wang K, Li M, Hakonarson H. ANNOVAR: functional annotation of genetic variants from high-through-\nput sequencing data. Nucleic Acids Res. 2010; 38: e164– e164. doi:10.1093/nar/gkq603 PMID:\n20601685\n15. Li H, Handsaker B, Wysoker A, Fennell T, Ruan J, Homer N, et al. The Sequence Alignment/Map for-\nmat and SAMtools. Bioinformatics. 2009; 25: 2078– 2079. doi:10.1093/bioinformatics/btp352 PMID:\n19505943\n16. Chu H-T, Hsiao WW, Tsao TT, Chang C-M, Liu Y-W, Fan C-C, et al. Quantitative assessment of mito-\nchondrial DNA copies from whole genome sequencing. BMC Genomics. 2012; 13: S5. doi:10.1186/\n1471-2164-13-S7-S5\n17. Goto H, Dickins B, Afgan E, Paul IM, Taylor J, Makova KD, et al. Dynamics of mitochondrial hetero-\nplasmy in three families investigated via a repeatable re-sequencing study. Genome Biol. 2011; 12:\nR59. doi:10.1186/gb-2011-12-6-r59 PMID: 21699709\n18. Rebolledo-Jaramillo B, Su MS-W, Stoler N, McElhoe JA, Dickins B, Blankenberg D, et al. Maternal age\neffect and severe germ-line bottleneck in the inheritance of human mitochondrial DNA. Proc Natl Acad\nSci. 2014; 111: 15474– 15479. doi:10.1073/pnas.1409328111 PMID: 25313049\n19. Sosa MX, Sivakumar IKA, Maragh S, Veeramachaneni V, Hariharan R, Parulekar M, et al. Next-Gener-\nation Sequencing of Human Mitochondrial Reference Genomes Uncovers High Heteroplasmy Fre-\nquency. PLoS Comput Biol. 2012; 8: e1002737. doi:10.1371/journal.pcbi.1002737 PMID: 23133345\n20. Kennedy SR, Salk JJ, Schmitt MW, Loeb LA. Ultra-Sensitive Sequencing Reveals an Age-Related\nIncrease in Somatic Mitochondrial Mutations That Are Inconsistent with Oxidative Damage. PLoS\nGenet. 2013; 9: e1003794. doi:10.1371/journal.pgen.1003794 PMID: 24086148\n21. Ashar FN, Moes A, Moore AZ, Grove ML, Chaves PHM, Coresh J, et al. Association of mitochondrial\nDNA levels with frailty and all-cause mortality. J Mol Med. 2014; 1– 10. doi:10.1007/s00109-014-1233-\n3\n22. Cibulskis K, Lawrence MS, Carter SL, Sivachenko A, Jaffe D, Sougnez C, et al. Sensitive detection of\nsomatic point mutations in impure and heterogeneous cancer samples. Nat Biotechnol. 2013; 31: 213–\n219. doi:10.1038/nbt.2514 PMID: 23396013\n23. Kleinman CL, Majewski J. Comment on“Widespread RNA and DNA Sequence Differences in the\nHuman Transcriptome.” Science. 2012; 335: 1302– 1302. doi:10.1126/science.1209658\n24. Li M, Wang IX, Li Y, Bruzel A, Richards AL, Toung JM, et al. Widespread RNA and DNA Sequence Dif-\nferences in the Human Transcriptome. Science. 2011; 333: 53– 58. doi:10.1126/science.1207018\nPMID: 21596952\n25. Li M, Wang IX, Cheung VG. Response to Comments on“Widespread RNA and DNA Sequence Differ-\nences in the Human Transcriptome.” Science. 2012; 335: 1302– 1302. doi:10.1126/science.1210419\n26. Lin W, Piskol R, Tan MH, Li JB. Comment on“Widespread RNA and DNA Sequence Differences in the\nHuman Transcriptome.” Science. 2012; 335: 1302– 1302. doi:10.1126/science.1210624\n27. Pickrell JK, Gilad Y, Pritchard JK. Comment on“Widespread RNA and DNA Sequence Differences in\nthe Human Transcriptome.” Science. 2012; 335: 1302– 1302. doi:10.1126/science.1210484\n28. Kitzman JO, Snyder MW, Ventura M, Lewis AP, Qiu R, Simmons LE, et al. Noninvasive Whole-\nGenome Sequencing of a Human Fetus. Sci Transl Med. 2012; 4: 137ra76– 137ra76. doi:10.1126/\nscitranslmed.3004323 PMID: 22674554\nmtDNA Analysis with Next-Generation Sequencing Data\nPLOS Genetics | DOI:10.1371/journal.pgen.1005306 July 14, 2015 18 / 18"
}