{
  "title": "Transformer Incipient Fault Prediction Using Combined Artificial Neural Network and Various Particle Swarm Optimisation Techniques",
  "url": "https://openalex.org/W1840715785",
  "year": 2015,
  "authors": [
    {
      "id": null,
      "name": "Illias, Hazlee Azil",
      "affiliations": [
        "University of Malaya"
      ]
    },
    {
      "id": null,
      "name": "Chai, Xin Rui",
      "affiliations": [
        "University of Malaya"
      ]
    },
    {
      "id": "https://openalex.org/A2798996836",
      "name": "Abu Bakar Ab. Halim",
      "affiliations": [
        "University of Malaya"
      ]
    },
    {
      "id": "https://openalex.org/A2742946761",
      "name": "Mokhlis Hazlie",
      "affiliations": [
        "University of Malaya"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2118329299",
    "https://openalex.org/W650597496",
    "https://openalex.org/W1564945538",
    "https://openalex.org/W2126857563",
    "https://openalex.org/W2163214087",
    "https://openalex.org/W2545219709",
    "https://openalex.org/W2037112966",
    "https://openalex.org/W2027885909",
    "https://openalex.org/W2028916149",
    "https://openalex.org/W2006209764",
    "https://openalex.org/W2523306681",
    "https://openalex.org/W2171004421",
    "https://openalex.org/W2067172807",
    "https://openalex.org/W1968882100",
    "https://openalex.org/W1975051102",
    "https://openalex.org/W2067554665",
    "https://openalex.org/W2047834011",
    "https://openalex.org/W2158905410",
    "https://openalex.org/W2147750877",
    "https://openalex.org/W2137347856",
    "https://openalex.org/W2112393069",
    "https://openalex.org/W2124273711",
    "https://openalex.org/W2165496236",
    "https://openalex.org/W2118737963",
    "https://openalex.org/W1522616042",
    "https://openalex.org/W2163729603",
    "https://openalex.org/W2110896980",
    "https://openalex.org/W2006331972",
    "https://openalex.org/W2534521428",
    "https://openalex.org/W3146850311",
    "https://openalex.org/W4240924624",
    "https://openalex.org/W2357682534",
    "https://openalex.org/W2546735227",
    "https://openalex.org/W2044184083",
    "https://openalex.org/W4248342355",
    "https://openalex.org/W4229547276"
  ],
  "abstract": "It is important to predict the incipient fault in transformer oil accurately so that the maintenance of transformer oil can be performed correctly, reducing the cost of maintenance and minimise the error. Dissolved gas analysis (DGA) has been widely used to predict the incipient fault in power transformers. However, sometimes the existing DGA methods yield inaccurate prediction of the incipient fault in transformer oil because each method is only suitable for certain conditions. Many previous works have reported on the use of intelligence methods to predict the transformer faults. However, it is believed that the accuracy of the previously proposed methods can still be improved. Since artificial neural network (ANN) and particle swarm optimisation (PSO) techniques have never been used in the previously reported work, this work proposes a combination of ANN and various PSO techniques to predict the transformer incipient fault. The advantages of PSO are simplicity and easy implementation. The effectiveness of various PSO techniques in combination with ANN is validated by comparison with the results from the actual fault diagnosis, an existing diagnosis method and ANN alone. Comparison of the results from the proposed methods with the previously reported work was also performed to show the improvement of the proposed methods. It was found that the proposed ANN-Evolutionary PSO method yields the highest percentage of correct identification for transformer fault type than the existing diagnosis method and previously reported works.",
  "full_text": "RESEARCH ARTICLE\nTransformer Incipient Fault Prediction Using\nCombined Artificial Neural Network and\nVarious Particle Swarm Optimisation\nTechniques\nHazlee Azil Illias1☯*, Xin Rui Chai1☯, Ab Halim Abu Bakar2☯, Hazlie Mokhlis1☯\n1 Department of Electrical Engineering, Faculty of Engineering, University of Malaya, 50603 Kuala Lumpur,\nMalaysia, 2 UM Power Energy Dedicated Advanced Centre (UMPEDAC), Level 4, Wisma R&D UM,\nUniversity of Malaya, Jalan Pantai Baharu, 59990 Kuala Lumpur, Malaysia\n☯ These authors contributed equally to this work.\n* h.illias@um.edu.my\nAbstract\nIt is important to predict the incipient fault in transformer oil accurately so that the mainte-\nnance of transformer oil can be performed correctly, reducing the cost of maintenance and\nminimise the error. Dissolved gas analysis (DGA) has been widely used to predict the incipi-\nent fault in power transformers. However, sometimes the existing DGA methods yield inac-\ncurate prediction of the incipient fault in transformer oil because each method is only\nsuitable for certain conditions. Many previous works have reported on the use of intelligence\nmethods to predict the transformer faults. However, it is believed that the accuracy of the\npreviously proposed methods can still be improved. Since artificial neural network (ANN)\nand particle swarm optimisation (PSO) techniques have never been used in the previously\nreported work, this work proposes a combination of ANN and various PSO techniques to\npredict the transformer incipient fault. The advantages of PSO are simplicity and easy\nimplementation. The effectiveness of various PSO techniques in combination with ANN is\nvalidated by comparison with the results from the actual fault diagnosis, an existing diagno-\nsis method and ANN alone. Comparison of the results from the proposed methods with the\npreviously reported work was also performed to show the improvement of the proposed\nmethods. It was found that the proposed ANN-Evolutionary PSO method yields the highest\npercentage of correct identification for transformer fault type than the existing diagnosis\nmethod and previously reported works.\nIntroduction\nPower transformer is one of the important equipment in power systems since the transformer\nis vital to step-up or step-down the voltage and isolation of the electrical power. Thus, trans-\nformer breakdown may interrupt the power systems. The transformer fault leads to the\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 1/1 6\na11111\nOPEN ACCESS\nCitation: Illias HA, Chai XR, Abu Bakar AH, Mokhlis\nH (2015) Transformer Incipient Fault Prediction Using\nCombined Artificial Neural Network and Various\nParticle Swarm Optimisation Techniques. PLoS ONE\n10(6): e0129363. doi:10.1371/journal.pone.0129363\nAcademic Editor:Daqing Li, Beihang University,\nCHINA\nReceived: February 9, 2015\nAccepted: May 7, 2015\nPublished: June 23, 2015\nCopyright: © 2015 Illias et al. This is an open access\narticle distributed under the terms of theCreative\nCommons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any\nmedium, provided the original author and source are\ncredited.\nData Availability Statement:All relevant data are\nwithin the paper.\nFunding: This work was supported by a High Impact\nResearch (HIR) grant: H-16001-D00048, Malaysian\nMinistry of Higher Education, HAI. The funders had\nno role in study design, data collection and analysis,\ndecision to publish, or preparation of the manuscript.\nFundamental Research Grant Scheme (FRGS) grant:\nFP026-2012A, Malaysian Ministry of Higher\nEducation, HAI, \"The funders had no role in study\ndesign, data collection and analysis, decision to\npublish, or preparation of the manuscript.\"\nelectrical and thermal stresses, which will eventually cause the breakdown of insulating materi-\nals and the release of gaseous decomposition products respectively. Corona, sparking, arcing\nand overheating are subject to fault related gases released including hydrogen (H2), methane\n(CH4), acetylene (C2H2), ethylene (C2H4), ethane (C2H6) and carbon monoxide (CO) [1, 2].\nThus, transformer maintenance is very important and proper monitoring on the trans-\nformer condition will help to avoid the breakdown of transformer. Transformer oil condition\nmonitoring is one of the fundamental methods in maintaining power transformers. The oil test\ntypes can be categorised into physical, chemical, electrical and environment type. Among all\nthe tests, the chemical test, dissolved gas analysis (DGA) is commonly used which diagnose the\nfaults based on certain ratio of dissolved gas in oil sample [3]. The existing methods of DGA\nare key gas method, Doenernberg’s ratio method, Roger’s ratio method and IEC method.\nDGA methods involve processing data of the transformer oil sample and fault recognition\nthrough annalist experience and ability. However, the main problems with the existing DGA\nmethods are it relies heavily on the experts and the actual site testing has shown that different\nDGA methods lead to different fault type. Hence, research on reliable techniques to diagnose\nthe transformer fault is actively ongoing.\nSince the past, there have been many works conducted on the applications of artificial intel-\nligence and optimisation in condition monitoring on power system components and fault diag-\nnosis, including transformer incipient fault diagnosis [4– 10]. These include artificial neural\nnetwork (ANN), fuzzy logic, rough set theory, support vector machine (SVM) and genetic\nprogramming.\nOne of the most widely used artificial intelligence methods in transformer fault prediction is\nartificial neural network (ANN) [1, 11, 12]. ANN is widely used due to it can learn from the\ntraining data directly and the complexity of computation in ANN is less. It is also adaptive,\nable to handle various nonlinear relationships and can generalize solutions for a new data set\n[13]. ANN directly implements the association process of inputs, where for transformer incipi-\nent fault prediction, it is the gas concentration and the outputs or fault type. Hence, physical\nmodel and a predefined correspondence function are not required. However, the convergence\nis slow and sometimes oscillation occurs. Also, the parameters of the ANN, such as the number\nof neuron and hidden layer, must be properly chosen in order to obtain the best performance\nof the network.\nMany researches have been performed on the use of ANN in DGA methods to facilitate the\ndetection of transformer incipient fault [11, 14]. The input and output from the DGA results of\ntransformer oil were used to train a neural network and identify the fault type from the trained\nnetwork. Although the use of ANN in transformer incipient fault detection seems to be reason-\nable, the chosen ANN parameters might not yield the best accuracy of the network output.\nIn one of the previous works, ANN was combined with the knowledge based of expert sys-\ntem for transformer fault diagnosis from DGA analysis [4]. The combination of both methods\nyields better performance than each method being used individually. This is due to the combi-\nnation of the ANN and expert system takes advantage of superior features of each method and\nallows them to dominate different fault diagnosis. The usage of fuzzy logic has shown that the\nfault type of transformer can be obtained efficiently [15]. Fuzzy logic was applied as practical\nrepresentation of the relationship between the gas content levels and fault type and with fuzzy\nmembership functions. A combination of three fuzzy methods shows that the accuracy of the\nmethod is higher than a single fuzzy system in identifying the transformer fault type.\nCombination of Artificial Immune System (AIS) and ANN was proposed in [7] to assess the\ntransformer fault type based on DGA analysis. The AIS was used to determine the centers of\nthe Radial Basis Function Neural Network (RBFNN). It was shown that the combination\nof AIS and RBFNN yields better transformer diagnosis accuracy than random selection and\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 2/1 6\nCompeting Interests:The authors have declared\nthat no competing interests exist.\nk-means clustering in determining the RBFNN hidden centers. Other neural network applica-\ntion has also been employed to improve the diagnostic accuracy of power transformer fault\nclassification based on DGA analysis. Bootstrap and genetic programming (GP) feature extrac-\ntion were combined with ANN and KNN classifiers [5]. The bootstrap eliminated the less fault\ntype samples in the DGA data. Then, the features of the DGA data extracted with GP were\nused as the inputs in ANN and KNN classifiers. It was reported that bootstrap and GP com-\nbined with KNN yields a higher accuracy of transformer fault classification.\nGenetic wavelets network (GWN) was proposed to enhance the existing DGA methods for\ntransformer incipient fault identification [8]. The method combined genetic algorithm (GA),\nwavelet and ANN. GA was used to determine the optimal parameters of GWNs to achieve the\nbest diagnostic DGA model. The wavelet transform property and the decomposed data feature\nextracted important information from the input data. It was reported that the proposed GWN\nmethod yields the best classification for the transformer fault identification compared to with-\nout wavelet transform.\nSelf-organizing polynomial networks (SOPN) was proposed as an intelligent decision mak-\ning for the transformer fault diagnosis [9]. In this technique, the problem is heuristically for-\nmulated into a hierarchical architecture with several layers of simple low-order polynomial\nfunctional nodes. The networks handled the complicated and uncertain relationships of DGA\ndata from transformer oil samples. The work reported that the proposed method yields far\nsuperior performance than the conventional DGA and ANN classification methods.\nAlthough many previous works have reported on the use of intelligence methods to predict\nthe transformer oil faults, it is believed that the accuracy of the previously proposed methods\ncan still be improved. Since artificial neural network (ANN) and particle swarm optimisation\n(PSO) techniques have never been reported in the previous literature, a combination of ANN\nand various PSO techniques to predict the transformer incipient fault are proposed in this\nwork. The advantages of PSO are simplicity and easy implementation. In this work, the possi-\nbility of using various particle swarm optimisation (PSO) techniques with ANN in identifying\nthe transformer incipient fault is explored.\nPSO is an evolutionary algorithm that is widely implemented in optimisation problems\n[16– 19]. The thought process behind the algorithm was inspired by the social behaviour of ani-\nmals, such as bird flocking or fish schooling [20– 23]. PSO is a population based search algo-\nrithm characterized as conceptually simple, easy to implement, computationally efficient, rapid\nconvergence and has the ability to avoid the local minima in a successful way. Hence, these\ncharacteristics are advantageous to complex optimisation problems which use huge number of\nparameters and have difficulty in obtaining the analytical solutions.\nIn this work, the PSO optimisation methods used are conventional PSO method, iteration\nPSO (IPSO) and evolutionary PSO (EPSO) method. The percentage of correct prediction of\ntransformer incipient fault from the proposed methods was compared with each other and also\nwith the methods which use only ANN technique and the existing DGA technique. The results\nfrom the proposed methods were also compared with the previously reported work to show\nthe improvement of the proposed methods. Hence, the best type of PSO method combined\nwith ANN could be identified, which may improve the transformer incipient fault diagnosis.\nThis paper is presented as follows. In section 2, the implementation of ANN is described.\nSection 3 explains various methods of PSO used in this work. They include PSO, iteration PSO\n(IPSO) and evolutionary PSO (EPSO). Section 4 discusses all results obtained from each\nmethod. The section includes results from the application of various PSO techniques and\nANN, ANN alone and an existing DGA method in predicting the transformer incipient fault.\nFinally, section 5 summarises all findings obtained from this work.\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 3/1 6\nArtificial Neural Network (ANN)\nANN is a computational model to imitate the biological neural networks, which consists of inter-\nconnected neurons in order to compute the output from the input. ANN is widely used due to its\nability to interpolate and extrapolate from the experience of analysing the data and able to reveal\nhighly nonlinear input-output relationship [24]. Since the condition of electrical systems changes,\nANN can adapt itself to new state and put the new state into new training [25]. Hence, ANN is a\ngood approach to compute the relationship, which is difficult to describe explicitly. In this work,\nthe neural network was developed in MATLAB programming language.\nInput and output data\nIn designing ANN, the selection of input, output and network topology is subject to perfor-\nmance of the ANN model [26]. The data of the gas compositions with respect to the incipient\ntransformer fault were obtained from the actual data of an electrical utility. The design of ANN\ncan be divided into two stages; the training and testing. The flowchart of the development of\nANN is shown inFig 1. Table 1shows some of the actual data of incipient transformer fault\nfrom an electrical utility that were used in this work.\nTraining Stage\nFirstly, the input data and target data are imported into the network. The gas composition was\nset as the input and the transformer incipient fault was set as the target. In this work, 100 input\ndata consist of 6 types of gases were used while the fault, which was used as output can be clas-\nsified into no fault, thermal fault, low intensity and high intensity. These data were categorised\ninto training, validation and testing sets. The training set was 70% of total 100 data and 15%\neach for validation and test data.\nIn the training stage, a backpropagation algorithm is a generalised delta rule for feed-for-\nward network with multiple of layers. This is due to its possibility to compute the gradient of\neach layer iteratively by using chain rule [27]. Generally, a sigmoid activation function is used\nbecause of its nonlinearity and compatibility with feed-forward backpropagation-learning\nalgorithm to perform better. In this work, the Lavenberg-Marquart (LM) is used as the training\nfunction since it is fast, simple and robust algorithm. Thus, feed-forward backpropagation-\nlearning algorithm was set as the network type for ANN architecture of this work.\nBy tuning the number of hidden layers, number of neurons and transfer function, the best\nparameters for ANN were selected with the highest accuracy, which equals to,R. A three-layer\nnetwork which consists of two hidden layers and one output layer was used in this work. Although\none hidden layer is enough for nonlinear mapping, a network with two hidden layer is the optimal\nin iteration number, accuracy and complexity compared to the network with one and three hidden\nlayers. Moreover, three-layer network can over c o m et h ep r o b l e mo fs l o wr a t eo ft r a i n i n g .\nIn developing the best ANN, the learning rate (LR) and momentum cost (MC) were varied\nfrom 0 to 0.9 to obtain the optimised value of LR and MC [28]. Since all parameter were varied\nheuristically, the problem of underfitting and overfitting network could occur. Overfitting\noccurs when the network is capable to memorise the network but cannot generalise the new\ndata for network. To overcome the overfitting problem, early stopping technique was applied\nto develop better performance. The stop criterion is determined by comparing the mean square\nerror of the training data while training with the data with a certain limit.\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 4/1 6\nFig 1. Flowchart of ANN algorithm.\ndoi:10.1371/journal.pone.0129363.g001\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 5/1 6\nTable 1. Some actual data of incipient transformer fault from an electrical utility.\nH2 CH4 C2H2 C2H4 C2H6 CO Fault Type\n4566 671 683643 434322 45482 2001 High intensity discharge\n2323 782 545454 342233 4343 4545 High intensity discharge\n2118 844 540711 449264 4443 4535 High intensity discharge\n2285 706 546779 435718 4303 4235 High intensity discharge\n2238 826 537988 335279 4008 4472 High intensity discharge\n2373 817 669150 447061 4284 4807 High intensity discharge\n2394 754 673175 360327 4049 4964 High intensity discharge\n2423 765 535231 305712 4266 4523 High intensity discharge\n2127 825 595394 369165 4456 4931 High intensity discharge\n2400 774 647129 315114 4462 4274 High intensity discharge\n9750 720 40 11 220 951 Low intensity discharge\n9619 780 38 9 220 904 Low intensity discharge\n9693 702 38 10 198 928 Low intensity discharge\n9439 700 35 10 233 902 Low intensity discharge\n9201 744 40 12 226 935 Low intensity discharge\n9704 719 39 11 208 982 Low intensity discharge\n9823 707 39 8 231 965 Low intensity discharge\n9531 744 36 8 220 993 Low intensity discharge\n9840 788 37 9 225 991 Low intensity discharge\n9032 785 36 12 219 939 Low intensity discharge\n3872 6008 2 21315 4772 6811 Thermal fault\n4390 5843 3 21102 4474 6894 Thermal fault\n3883 5578 2 24716 4797 6947 Thermal fault\n4304 6135 5 24999 4508 6648 Thermal fault\n4410 5750 5 24560 4630 6988 Thermal fault\n3908 5587 5 20537 4315 6658 Thermal fault\n3660 5862 2 20487 4590 6715 Thermal fault\n3923 6273 5 22803 4624 6759 Thermal fault\n4077 6036 2 23232 4469 6710 Thermal fault\n4133 5902 4 20449 4608 6772 Thermal fault\n4051 5507 3 22825 4330 6599 Thermal fault\n4262 5856 2 22286 4689 6825 Thermal fault\n200 1000 800 200 875 40 No fault\n0 100 3.22 90 0 100 No fault\n0 0 0 0 0 0 No fault\n0 0 100 0 150 40000 No fault\n600 400 280 400 250 300 No fault\n600 450 300 800 400 300 No fault\n300 50 14 1000 389 65 No fault\n487297 271385 179851 459845 333624 97074 No fault\n388824 138072 483923 56377 336625 211156 No fault\n308142 449556 190961 464427 256989 202072 No fault\n441916 269710 7045 478904 116994 313584 No fault\n362425 253480 104585 388782 404053 348857 No fault\n138560 199740 245667 459335 189531 281963 No fault\n362881 260366 218083 144747 239282 209 No fault\n206 998 323 709 83 345 No fault\n(Continued)\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 6/1 6\nTesting Stage\nTo test the trained network, a new set of data was simulated. The output of the new data set\nwas simulated using the trained ANN. The best trained network shows that the simulated out-\nput agrees well with the target output. A regression coefficient,R is used to determine the per-\nformance of the trained network.\nParticle Swarm Optimisation (PSO)\nPSO is a computational optimised technique which was invented by Kennedy and Eberthart in\n1995 with the concept of bird flocking and fish schooling behaviour [29]. An optimisation\nproblem can be formulated as a flock of birds fly across an area seeking for spot with abundant\nfood. To find the optimised value, ANN is a time-consuming and difficult on computational\nprocess due to its heuristic characteristic. Hence, PSO is a better approach to find the optimised\nLR and MC values in ANN. In this work, MATLAB programming language was used to exe-\ncute various PSO algorithms.\nIn PSO, the population-based search is used to achieve the optimised objective function.\nFirstly, the potential solution known as particles is initialised randomly and explores in a\ndimension, d search region. With the strategy of each particle updates its velocity and position,\nthe particle swarm will move nearer to the region with higher object value. The flowchart of\nPSO technique is shown inFig 2. The steps in PSO are explained as follows [30]:\nTable 1. (Continued)\nH2 CH4 C2H2 C2H4 C2H6 CO Fault Type\n953 737 464 39 465 657 No fault\n523 438 217 697 769 55 No fault\n230 367 664 777 375 632 No fault\n513 677 693 980 176 18 No fault\n98 38 1 3 0 7 No fault\n11 12 22 78 31 32 No fault\n140 1 76 97 35 24 No fault\n38 48 25 72 90 31 No fault\n0 44 62 73 22 7 No fault\n3 3 85 37 40 2481 No fault\n7746 2016 6945 1443 7806 3307 No fault\n1642 976 6804 6685 6790 1882 No fault\n1585 4829 2572 1839 186 3231 No fault\n7722 5145 1712 6242 1730 2973 No fault\n7919 6490 1697 4115 3548 4910 No fault\n7487 4463 2511 6973 2605 6531 No fault\n2456 1381 7237 5040 4641 7365 No fault\n5884 4880 2293 4776 2489 5147 No fault\n2443 3422 6394 3000 7852 1797 No fault\n4395 5201 2121 6788 6933 149 No fault\n7613 1120 3393 4751 3363 2494 No fault\n2366 1031 7025 108 5909 5272 No fault\n5054 4144 6974 7020 4174 6354 No fault\ndoi:10.1371/journal.pone.0129363.t001\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 7/1 6\nStep 1: Initialisation\nThe swarm is initialised by setting the position and the velocity of particles randomly.\nStep 2: Evaluate fitness function\nThe fitness value for each particle with updated position and velocity is calculated.\nStep 3: Updatepbestj\nid and gbestj\nid\nThe fitness value of each particle is compared with personal best,pbestj\nid. If the new fitness value\nis better than thepbestj\nid, this value will be set aspbestj\nid and the current position of particle,Xj\nid.\nAmong the entire particle, the best fitness value will be set asgbestj\nid or global best value.\nStep 4: Update velocity and position\nThe velocity and position of all particles are updated using\nVid\njþ1 ¼ wVid\nj þ c1r1ðpbestid\nj /C0 Xid\njÞþ c2r2ðgbestid\nj /C0 Xid\njÞð 1Þ\nXid\njþ1 ¼ Xid\nj þ Vid\njþ1 ð2Þ\nwhere\nFig 2. Flowchart of PSO technique.\ndoi:10.1371/journal.pone.0129363.g002\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 8/1 6\nVid\njþ1 = updated velocity of particle i in dimensiond search region\nVid\nj = velocity of particlei at iterationj\nXid\njþ1 = updated position of particlei in dimensiond search region\nXid\nj = position of particlei at iterationj\nc1, c2 = acceleration factors\nr1, r2 = random constant between 0 and 1\nw = inertia weight\n¼ wmax /C0 wmax /C0 wmin\niterationmax\n/C18/C19\nðiterationÞ\nwmax = maximum weight\nwmin = minimum weight\nStep 5: Meet the end condition\nSteps 2– 4 are repeated until the stopping criterion is fulfilled such that the best fitness value is\nachieved or the number of iteration has been reached to its maximum. In this work,c1 and c2\nwere both set as 0.7,wmax and wmin were set as 0.9 and 0.4 the iteration was set as 100. These\nare the common values used in most of the PSO algorithms.\nIteration particle swarm optimisation (IPSO)\nPSO is easy to trap in the local minimum. Thus, improved PSO algorithm has been suggested\nfor better performance, called as iteration PSO (IPSO) [31]. In IPSO, the best iteration,I\nj\nbest,d is\nemployed to improve the basic PSO performance in term of accuracy. The equation for the\nvelocity inEq (1)is modified as follows [32]:\nVid\njþ1 ¼ wVid\nj þ c1r1ðpbestid\nj /C0 Xid\njÞþ c2r2ðgbestid\nj /C0 Xid\njÞþ c3r3ðIbest;d\nj /C0 Xid\njÞð 3Þ\nwhere\nIbest;d\nj = bestﬁtness value which obtained by any particle in iterationj\nc3 = weight of stochastic acceleration term to attract each particle towardIbest;d\nj\nc3 ¼ c1½1 /C0 expð/C0 c1 /C2ð iterationÞÞ/C138 ð 4Þ\nEvolutionary Particle Swarm Optimisation (EPSO)\nEPSO is an optimisation technique which combines the concept of evolutionary strategies and\nPSO. The main advantage of EPSO is that the search of particle would not be focused on the\nregion of global best fitness value, but the optimum may be in the neighbourhood if the optimal\nvalue has not been found. The concept of duplication, mutation and reproduction is employed\nin EPSO. For duplication, each particle is duplicated. Next, each particle with mutated weight\nw\n/C3 will reproduce an offspring by abiding the particle movement rule. The equation for the\nvelocity inEq (1)is modified as follows [33]:\nVid\njþ1 ¼ wi0\n/C3 Vid\nj þ wi1\n/C3 ðpbestid\nj /C0 Xid\njÞþ wi2\n/C3 ðgbestid\n/C3 /C0 Xid\njÞð 5Þ\nwhere\ngbestid\n/C3 ¼ gbestid\nj þ t0Nð0; 1Þ is the mutated global best position\nwik\n/C3 ¼ wik þ tNð0; 1Þ is the mutated weight\nτ and τ’= learning parameter\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 9/1 6\nN(0,1) = a random variable with Gaussian distribution with 0 mean and variance of 1\nIn this work,τ and τ’were varied from 0.1 to 0.9 until the best output from the ANN was\nachieved. It was found that the most suitable value for bothτ and τ’is 0.3.\nDiagnosis Results\nFault prediction using IEC 60599 method\n100 data were used in this work and classified into electrical fault, thermal fault and no fault\nwith 32 cases, 16 cases and 50 cases respectively. IEC 60599 method was used to predict the fault\nby using the gas ratio. The results are tabulated inTable 2. Comparing the indicated fault with\nthe actual fault occurred, IEC 60599 achieve 70% correct prediction of the transformer fault.\nFault prediction using ANN alone\nThe simulations were performed by using different number of hidden layer, number of neu-\nrons, learning rate (LR) and momentum constant (MC) in the ANN. The process of finding\nthe best ANN model is as follows:\n1. Variation of number of neurons in hidden layer (HL).Before determining the param-\neters of LR and MC, typical values of LR and MC were used as 0.05 and 0.95 respectively. The\ntraining function and learning function used were Lavenberg-Marquart (TRAINLM) and Gra-\ndient Descent with momentum weight and bias learning function (LEARNGDM). The number\nof neurons in HL1 was increased from 2 to 20 with a step of 2 by keeping other parameters con-\nstant. The transfer functions of HL1 and HL 2 were logsig-logsig while the transfer function for\noutput layer was pure-linear (PURELIN).\nThe next stage was increasing the number of neurons in HL2 from 2 to 20 with a step of 2\nby keeping other parameters constant. 100 set of data with different number of neurons in HL1\nand HL2 were tested. The ANN model with the highestR value was selected as shown in\nTable 3. The number of neurons for HL1 and HL2 was selected as 4 and 10 respectively since\nTable 2. Comparison of the indicated result by IEC 60599 with the actual result.\nFault type Actual fault IEC 60599 method\nElectrical Fault 32 31\nThermal Fault 16 15\nNo fault 50 24\nCorrect prediction (%) 100% 70%\ndoi:10.1371/journal.pone.0129363.t002\nTable 3. Properties of the selected ANN using default LR and MC.\nANN parameters Type/Value\nTraining Function TRAINLM\nLearning Function LEARNGDM\nNumber of Neurons in HL1 4\nNumber of Neurons in HL2 10\nTransfer function Logsig-logsig\nLR 0.05\nMC 0.95\nR 0.9451\n% of correct fault prediction 94%\ndoi:10.1371/journal.pone.0129363.t003\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 10 / 16\nhigher number of neurons than these values do not yield any further improvement in the net-\nwork performance.\n2. Variation of LR and MC values.By keeping MC constant, the value of LR was\nincreased from 0 to 0.9 with a step of 0.01. For each LR, the value of MC was increased from 0\nto 0.9 with a step of 0.1. The outcome from this neural network is shown inTable 4.\nFault prediction using ANN with Particle Swarm Optimisation (PSO)\nIn order to find the optimised value of LR and MC in ANN, PSO was employed. Since there\nare two parameters need to be optimised, LR and MC were defined asparticle1 and particle2\nrespectively in the PSO. Using PSO, the optimised result for LR, MC and the best position were\nobtained. The simulation process of PSO was run for 20 times to test the robustness of the\nmethod. Next, the ANN was trained with the data obtained from the PSO. The results from the\nANN-PSO method are shown inTable 5.\nFault prediction using ANN combined with iteration PSO (IPSO)\nThe ANN model was also combined with IPSO. The IPSO technique was used to obtain the\noptimised values of LR and MC. Similar process as ANN-PSO method was repeated for\nANN-IPSO method. The optimised value of LR and MC,R value and the percentage of correct\nfault prediction obtained from this method are shown inTable 6.\nTable 4. The properties of selected ANN after tuning LR and MC.\nANN parameters Type/Value\nTraining Function TRAINLM\nLearning Function LEARNGDM\nNumber of Neurons in HL1 4\nNumber of Neurons in HL2 10\nTransfer function Logsig-logsig\nLR 0.01\nMC 0.9\nR 0.9505\n% of correct fault prediction 95%\ndoi:10.1371/journal.pone.0129363.t004\nTable 5. Properties of the selected ANN combined with PSO.\nANN parameters Type/Value\nTraining Function TRAINLM\nLearning Function LEARNGDM\nNumber of Neurons in HL1 4\nNumber of Neurons in HL2 10\nTransfer function Logsig-logsig\nLR 0.09\nMC 0.5579\nR 0.9578\n% of correct fault prediction 96%\ndoi:10.1371/journal.pone.0129363.t005\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 11 / 16\nFault prediction using ANN combined with evolutionary PSO (EPSO)\nThe ANN model was also combined with EPSO. The EPSO technique was used to obtain the\noptimised values of LR and MC. Similar process as ANN-PSO method was repeated for\nANN-EPSO. The results obtained from the ANN-EPSO method are shown inTable 7.\nComparison between ANN, ANN-PSO, ANN-IPSO and ANN-EPSO\nmethods\nIn order to identify the best technique to predict the transformer incipient fault, the ANN\nalone, ANN combined with PSO, IPSO and EPSO techniques were compared in terms ofR\nvalue, percentage of correct fault prediction and convergence rate. FromTable 8, it can be seen\nclearly that the ANN-EPSO technique yields the highestR value and percentage of correct fault\nprediction, followed by the ANN-IPSO technique, ANN-PSO technique and finally the ANN\nonly. All of these methods yield higher correct prediction of transformer incipient fault than\nthe existing DGA method, which is IEC method.R value for the ANN alone is the least because\nANN is heuristic in nature. In EPSO technique, the value of LR and MC obtained underwent\nduplication, mutation and reproduction. Thus, ANN with EPSO yields the best results in iden-\ntifying the transformer incipient fault compared to ANN, ANN-PSO and ANN-IPSO\ntechniques.\nThe proposed methods were also compared with the existing methods that have been\nreported in literature.Table 9summarises the comparison results. From this table, it can be\nseen that the proposed ANN-EPSO yields the highest percentage of correct transformer\nTable 6. Properties of the selected ANN combined with IPSO.\nANN parameters Type/Value\nTraining Function TRAINLM\nLearning Function LEARNGDM\nNumber of Neurons in HL1 4\nNumber of Neurons in HL2 10\nTransfer function Logsig-logsig\nLR 0.09\nMC 0.6806\nR 0.9644\n% of correct fault prediction 97%\ndoi:10.1371/journal.pone.0129363.t006\nTable 7. The properties of selected ANN combined with EPSO.\nANN parameters Type/Value\nTraining Function TRAINLM\nLearning Function LEARNGDM\nNumber of Neurons in HL1 4\nNumber of Neurons in HL2 10\nTransfer function Logsig-logsig\nLR 0.09\nMC 0.2429\nR 0.9769\n% of correct fault prediction 98%\ndoi:10.1371/journal.pone.0129363.t007\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 12 / 16\nidentification. Although EPSO is simple and easy to be implemented, it yields the best result\nwhen combined with ANN. In EPSO, the search of particle would not be focused on the region\nof global best fitness value, but the optimum value may be in the neighbourhood if the optimal\nvalue is not found.\nA graph of the best position against iteration for ANN with each PSO technique is shown in\nFig 3. From this figure, it can be seen that the convergence rate of EPSO is the fastest, followed\nby the IPSO and PSO.Fig 4shows a closer view ofFig 3at the convergence zone. From this fig-\nure, PSO, IPSO and EPSO converged to the best position at -0.46625. The iteration where each\nmethod converges to the best position is shown inTable 8.\nConclusions\nIn transformer incipient fault recognition, the relationship between gas type and fault is non-\nlinear. This causes problem in the convergence rate and oscillation in artificial neural network\n(ANN). The parameters of the ANN must also be properly tuned in order to obtain the best\nperformance of the network. To overcome these problems, in this work, a method of combina-\ntion of artificial neural network (ANN) and various particle swarm optimisation (PSO) tech-\nniques to predict transformer incipient fault has been successfully proposed. In this method,\nthe ANN was used to identify the transformer incipient fault and various techniques of PSO\nwere applied to optimise the performance of the ANN. The performance of various PSO tech-\nniques in combination with ANN was compared with the existing DGA method, ANN alone\nand previously reported work to identify the best method for transformer incipient fault\nTable 8. Comparison of the results between different techniques.\nParameters ANN ANN-PSO ANN-IPSO ANN-EPSO\nLR 0.01 0.09 0.09 0.09\nMC 0.9 0.5579 0.6806 0.2429\nR 0.9505 0.9578 0.9644 0.9769\n% of correct prediction 95% 96% 97% 98%\nConvergence (iteration) -3 8 2 0 1 1\ndoi:10.1371/journal.pone.0129363.t008\nTable 9. Comparison of the proposed methods with previous methods.\nMethod Accuracy (%)\nANN 95\nANN-PSO 96\nANN-IPSO 97\nANN-EPSO 98\nANNEPS [4] 90.95\nEPANN [28] 95\nFuzzy Logic [15] 89\nImmune Neural Network [7] 86.3\nRough Set Theory [6] 81.25\nGP-KNN [5] 92.11\nSupport Vector Machine (SVM) [10] 92\nGenetic wavelets network (GWN) [8] 96.19\nSelf-organizing polynomial network (SOPN) [9] 97.68\ndoi:10.1371/journal.pone.0129363.t009\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 13 / 16\nprediction. It was found that the method of combination of ANN with evolutionary PSO\n(EPSO) yields the best performance in the transformer fault prediction compared to the exist-\ning DGA method and previously reported works. Hence, this method can be proposed as one\nof the solutions in the field diagnosis of transformer incipient fault.\nFig 3. Best position vs. iteration for PSO, IPSO and EPSO techniques.\ndoi:10.1371/journal.pone.0129363.g003\nFig 4. Best position vs. iteration for PSO, IPSO and EPSO techniques (closer view).\ndoi:10.1371/journal.pone.0129363.g004\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 14 / 16\nAcknowledgments\nThe authors thank the Malaysian Ministry of Education and University of Malaya, Malaysia\nfor supporting this work through HIR research grant (grant no.: H-16001-D00048).\nAuthor Contributions\nConceived and designed the experiments: HAI XRC AHAB HM. Performed the experiments:\nHAI XRC AHAB HM. Analyzed the data: HAI XRC AHAB HM. Contributed reagents/materi-\nals/analysis tools: HAI XRC AHAB HM. Wrote the paper: HAI XRC AHAB HM. Checked\nEnglish language: HAI AHAB HM.\nReferences\n1. Zhang Y, Ding X, Liu Y, Griffin PJ. An artificial neural network approach to transformer fault diagnosis.\nIEEE Transactions on Power Delivery. 1996; 11: 1836–1841.\n2. IEEE Guide for the Interpretation of Gases Generated in Oil-Immersed Transformers. IEEE Std\nC57.104–2008 (Revision of IEEE Std C57.104–1991). 20091–36.\n3. Siva Sarma DVSS, Kalyani GNS. ANN approach for condition monitoring of power transformers using\nDGA. IEEE Region 10 Conference. 2004: 444–447 Vol. 3.\n4. Zhenyuan W, Yilu L, Griffin PJ. A combined ANN and expert system tool for transformer fault diagnosis.\nIEEE Power Engineering Society Winter Meeting. 2000: 1261–1269 vol.2.\n5. Shintemirov A, Tang W, Wu QH. Power Transformer Fault Classification Based on Dissolved Gas Anal-\nysis by Implementing Bootstrap and Genetic Programming. IEEE Transactions on Systems, Man, and\nCybernetics, Part C: Applications and Reviews. 2009; 39: 69–79.\n6. Setiawan NA, Sarjiya, Adhiarga Z. Power transformer incipient faults diagnosis using Dissolved Gas\nAnalysis and Rough Set. International Conference on Condition Monitoring and Diagnosis. 2012: 950–\n953.\n7. Malabanan DR, Nerves AC. Power transformer condition assessment using an immune neural network\napproach to Dissolved Gas Analysis. IEEE Region 10 Conference. 2014: 1–6.\n8. Huang YC. Fault identification of power transformers using genetic-based wavelet networks. IEE Pro-\nceedings-Science, Measurement and Technology. 2003; 150: 25–29. PMID:16468926\n9. Hong-Tzer Y, Yann-Chang H. Intelligent decision support for diagnosis of incipient transformer faults\nusing self-organizing polynomial networks. IEEE Transactions on Power Systems. 1998; 13: 946–952.\n10. Mehta AK, Sharma RN, Chauhan S, Saho S. Transformer diagnostics under dissolved gas analysis\nusing Support Vector Machine. International Conference on Power, Energy and Control. 2013: 181–\n186.\n11. Bhattacharya SK, Smith RE, Haskew TA. A neural network approach to transformer fault diagnosis\nusing dissolved gas analysis data. North America Power Symposium. 1993\n12. Yang HT, Huang YC. Intelligent decision support for diagnosis of incipient transformer faults using self-\norganizing polynomial networks. IEEE Transactions on Power Delivery. 1998; 13: 946–952.\n13. Hammestrom P. Neural networks at work. IEEE Spectrum. 1993\n14. Ding X, Yao E, Liu Y, Griffin PJ. ANN based transformer fault diagnosis using gas-in-oil analysis. North\nAmerica Power Symposium. 1994\n15. Ahmed MR, Geliel MA, Khalil A. Power transformer fault diagnosis using fuzzy logic technique based\non dissolved gas analysis. Mediterranean Conference on Control & Automation. 2013: 584–589.\n16. Garg H, Rani M. An approach for reliability analysis of industrial systems using PSO and IFS technique.\nISA Transactions. 2013; 52: 701–710. doi:10.1016/j.isatra.2013.06.010 PMID: 23867122\n17. Hsu C-C, Lin G-Y. Digital redesign of uncertain interval systems based on time-response resemblance\nvia particle swarm optimization. ISA Transactions. 2009; 48: 264–272. doi:10.1016/j.isatra.2009.01.\n008 PMID: 19254796\n18. Poultangari I, Shahnazi R, Sheikhan M. RBF neural network based PI pitch controller for a class of 5-\nMW wind turbines using particle swarm optimization algorithm. ISA Transactions. 2012; 51: 641–648.\ndoi: 10.1016/j.isatra.2012.06.001 PMID: 22738782\n19. Wu P, Gao L, Zou D, Li S. An improved particle swarm optimization algorithm for reliability problems.\nISA Transactions. 2011; 50: 71–81. doi:10.1016/j.isatra.2010.08.005 PMID: 20850737\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 15 / 16\n20. Liu C, Du W-B, Wang W-X. Particle Swarm Optimization with Scale-Free Interactions. PLoS ONE.\n2014; 9: e97822. doi:10.1371/journal.pone.0097822 PMID: 24859007\n21. Andras P. A Bayesian Interpretation of the Particle Swarm Optimization and Its Kernel Extension. PLoS\nONE. 2012; 7: e48710. doi:10.1371/journal.pone.0048710 PMID: 23144937\n22. Zhang J, Zhang C, Chu T, Perc M. Resolution of the Stochastic Strategy Spatial Prisoner's Dilemma by\nMeans of Particle Swarm Optimization. PLoS ONE. 2011; 6: e21787. doi:10.1371/journal.pone.\n0021787 PMID: 21760906\n23. Hamadneh N, Khan WA, Sathasivam S, Ong HC. Design Optimization of Pin Fin Geometry Using Parti-\ncle Swarm Optimization Algorithm. PLoS ONE. 2013; 8: e66080. doi:10.1371/journal.pone.0066080\nPMID: 23741525\n24. Zhenyuan W, Yilu L, Griffin PJ. A combined ANN and expert system tool for transformer fault diagnosis.\nIEEE Power Engineering Society Winter Meeting, 2000. 2000: 1261–1269 vol.2.\n25. Gracia J, Mazon AJ, Zamora I. Best ANN structures for fault location in single-and double-circuit trans-\nmission lines. IEEE Transactions on Power Delivery. 2005; 20: 2389–2395.\n26. Seifeddine S, Khmais B, Abdelkader C. Power transformer fault diagnosis based on dissolved gas anal-\nysis by artificial neural network. International Conference on Renewable Energies and Vehicular Tech-\nnology. 2012: 230–236.\n27. Guardado JL, Naredo JL, Moreno P, Fuerte CR. A comparative study of neural network efficiency in\npower transformers diagnosis using dissolved gas analysis. IEEE Transactions on Power Delivery.\n2001; 16: 643–647.\n28. Zakaria F, Johari D, Musirin I. Optimized Artificial Neural Network for the detection of incipient faults in\npower transformer. IEEE International Power Engineering and Optimization Conference. 2014: 635–\n640.\n29. Weidong J, Keqi W. An improved particle swarm optimization algorithm. International Conference on\nComputer Science and Network Technology. 2011: 585–589.\n30. Xiaoxia W, Tao W, Bingshu W. Hybrid PSO-BP Based Probabilistic Neural Network for Power Trans-\nformer Fault Diagnosis. Second International Symposium on Intelligent Information Technology Appli-\ncation, 2008. IITA '08. 2008: 545–549.\n31. Changxin L, Chunjuan O, Ping Z, Weidong T. An Adaptive Fuzzy Weight PSO Algorithm. International\nConference on Genetic and Evolutionary Computing. 2010: 8–10.\n32. Abdullah MN, Bakar AHA, Rahim NA, Jamian JJ, Aman MM. Economic dispatch with valve point effect\nusing iteration particle swarm optimization. International Universities Power Engineering Conference\n(UPEC). 2012: 1–6.\n33. Miranda V, Fonseca N. EPSO-evolutionary particle swarm optimization, a new algorithm with applica-\ntions in power systems. Asia Pacific. IEEE/PES Transmission and Distribution Conference and Exhibi-\ntion. 2002: 745–750 vol.2.\nTransformer Fault Prediction Using Combined ANN and Various PSO\nPLOS ONE | DOI:10.1371/journal.pone.0129363 June 23, 2015 16 / 16",
  "topic": "Dissolved gas analysis",
  "concepts": [
    {
      "name": "Dissolved gas analysis",
      "score": 0.8208913803100586
    },
    {
      "name": "Particle swarm optimization",
      "score": 0.7826538681983948
    },
    {
      "name": "Transformer",
      "score": 0.7103104591369629
    },
    {
      "name": "Artificial neural network",
      "score": 0.6829455494880676
    },
    {
      "name": "Transformer oil",
      "score": 0.6128141283988953
    },
    {
      "name": "Computer science",
      "score": 0.5256722569465637
    },
    {
      "name": "Artificial intelligence",
      "score": 0.38340750336647034
    },
    {
      "name": "Reliability engineering",
      "score": 0.35189637541770935
    },
    {
      "name": "Engineering",
      "score": 0.3493890166282654
    },
    {
      "name": "Machine learning",
      "score": 0.32932811975479126
    },
    {
      "name": "Voltage",
      "score": 0.06743913888931274
    },
    {
      "name": "Electrical engineering",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I33849332",
      "name": "University of Malaya",
      "country": "MY"
    }
  ],
  "cited_by": 71
}