{
  "title": "Analysis of the Green Power Transition on Optimal Power Transformer Designs",
  "url": "https://openalex.org/W1900085664",
  "year": 2015,
  "authors": [
    {
      "id": "https://openalex.org/A2070353217",
      "name": "Tamás Orosz",
      "affiliations": [
        "Budapest University of Technology and Economics"
      ]
    },
    {
      "id": "https://openalex.org/A1584315617",
      "name": "Péter Sőrés",
      "affiliations": [
        "Budapest University of Technology and Economics"
      ]
    },
    {
      "id": "https://openalex.org/A18858157",
      "name": "David Raisz",
      "affiliations": [
        "Budapest University of Technology and Economics"
      ]
    },
    {
      "id": "https://openalex.org/A2641648603",
      "name": "Ádám Z. Tamus",
      "affiliations": [
        "Budapest University of Technology and Economics"
      ]
    },
    {
      "id": "https://openalex.org/A2070353217",
      "name": "Tamás Orosz",
      "affiliations": [
        "Budapest Institute",
        "Budapest University of Technology and Economics"
      ]
    },
    {
      "id": "https://openalex.org/A1584315617",
      "name": "Péter Sőrés",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A18858157",
      "name": "David Raisz",
      "affiliations": [
        "Budapest Institute",
        "Budapest University of Technology and Economics"
      ]
    },
    {
      "id": "https://openalex.org/A2641648603",
      "name": "Ádám Z. Tamus",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W1966003487",
    "https://openalex.org/W6903490896",
    "https://openalex.org/W2075577335",
    "https://openalex.org/W2171048418",
    "https://openalex.org/W6665018949",
    "https://openalex.org/W2017520193",
    "https://openalex.org/W580330820",
    "https://openalex.org/W6689051861",
    "https://openalex.org/W7020169982",
    "https://openalex.org/W6635765892",
    "https://openalex.org/W1534222693",
    "https://openalex.org/W2114261978",
    "https://openalex.org/W6632266859",
    "https://openalex.org/W6616737711",
    "https://openalex.org/W2296319761",
    "https://openalex.org/W2222122796",
    "https://openalex.org/W2076055903",
    "https://openalex.org/W2301746362",
    "https://openalex.org/W4300472719",
    "https://openalex.org/W579558559",
    "https://openalex.org/W1598638350",
    "https://openalex.org/W1538580185"
  ],
  "abstract": "The main intent of the power transformer design optimization in the tendering stage is to find those mechanical and electrical parameters, which minimize the machines' total cost of the ownership by reducing the different power losses and the manufacturing costs. To find the optimal transformer design parameters and make them harmonize with the economic constraints is a labour intensive task, because these quantities are linked with complex trade-off and physical functions. The capitalization of the load and no-load losses facilitate this process. The focus of this paper is to examine the sensitivity of the design parameters from the capitalization factors. Three different scenarios are presented and analysed in this paper, where the transformers are connected to various stochastic or schedulable green power generation resources. This paper presents the optimal transformer design's dependency from the various scenarios of different green power generation resources.",
  "full_text": "125\nPeriod. Polytech. Elec. Eng. Comp. Sci. T. Orosz, P. Sőrés, D. Raisz, Á. Z. Tamus\nAnalysis of the Green Power \nTransition on Optimal Power \nTransformer Designs\nTamás Orosz1, Péter Sőrés 1*, Dávid Raisz 1, Ádám Z. Tamus1\nReceived 21 July 2015; accepted after revision 21 August 2015\nAbstract\nThe main intent of the power transformer design optimization \nin the tendering stage is to find those mechanical and elec-\ntrical parameters, which minimize the machines’ total cost of \nthe ownership by reducing the different power losses and the \nmanufacturing costs. To find the optimal transformer design \nparameters and make them harmonize with the economic \nconstraints is a labour intensive task, because these quanti-\nties are linked with complex trade-off and physical functions. \nThe capitalization of the load and no-load losses facilitate this \nprocess. The focus of this paper is to examine the sensitiv-\nity of the design parameters from the capitalization factors. \nThree different scenarios are presented and analysed in this \npaper, where the transformers are connected to various sto-\nchastic or schedulable green power generation resources. This \npaper presents the optimal transformer design’ s dependency \nfrom the various scenarios of different green power generation \nresources.\nKeywords\nGeometric programming, lifetime cost optimization, power \ntransformer, renewable energy sources\n1 Introduction\nIn the current market conditions, network operators, indus-\ntrial consumers and power plant capacity installers are pressed \nto reduce the total real running costs of their equipment. There-\nfore the transformer manufacturing industry is continuously \ntargeting to further reduce costs and improve the efficiency of \ntheir products, which ongoing progress have become the key \nto survival in a global market. They have to satisfy not only \nthe high quality technical standards and specifications for noise \nreduction but the additional requirements to meet global and \nnational commitments such as managing emissions of green-\nhouse gases in conformance with various protocols, as well. \n The capitalization of the load and no-load losses is an effec-\ntive method to take into consideration the lifetime operating \ncosts of an asset. The calculation of these factors are based on \nnot only the technological parameters, but on the financial con-\nditions as well. The optimal design parameters of an electrical \nmachine, are highly influenced by the capital recovery factor of \nthe investment. [1-3]\nThe power transformer design optimization is a complex \ntask, because an electric machine may be visualized as the site \nof several superimposed fields, namely an electric field, mag-\nnetic field, field of mechanical forces, field of conductive heat \netc. [4] Moreover, to find not only a technologically correct but \neconomical design, the transformer designer has to harmonize \nthese contradictory physical constraints with the economic con-\nditions simultaneously. These economic constraints are the fol-\nlowing: cost of the power losses, manufacturing, transportation \nand operating costs. The optimal investment shall deliver a solu-\ntion with the minimum long-term total cost of ownership to the \ntransformer holder. Therefore the design of the electrical distri-\nbution machinery and the selection of equipment are becoming \neven more complex, as multiple criteria have to be evaluated.  \n The widely used capitalization technique is made it possible \nto handle the designing process with an exact mathemati-\ncal method to find the most economical power transformer \noffer. The calculation method of these capitalization factors \nis although thoroughly described in the current academic \nliterature, mostly in the case of distribution transformers \n1 Department of Electric Power Engineering, \nBudapest University of Techology and Economics \nH-1521 Budapest, P.O.B. 91, Hungary\n* Corresponding author, e-mail: sores.peter@vet.bme.hu\n59(3), pp. 125-131, 2015\nDOI: 10.3311/PPee.8583\nCreative Commons Attribution b\nresearch article\nPPPeriodica Polytechnica\nElectrical Engineering \nand Computer Science\n126\nAnalysis of the Green Power Transition on Optimal Power Transformer Designs 2015 59 3\n(e.g. [1], [2]). All of these papers – known by the authors – are \ndescribing a method, which tested on usually only a few pos-\nsibilities of pre-manufactured design offers. In this paper the \nauthors are presenting a novel approach to fully optimize the \ndefining parameters of the active part of the power transformers \nbased on the calculated capitalization factors.\nThe design term, in its broadest sense, means that it’s \nentails the translation of specifications into information which \ndescribes the apparatus in the necessary detail and perfor -\nmance [4]. A simplified analytical model is sufficient to use \nin the investigated tender design case. In this research, a new \nmeta-heuristic solution based transformer optimization method \nis used to calculate the optimal transformer parameters. The \napplied optimization method combines the geometric program-\nming with the method of branch and bound to solve this non-\nlinear optimization problem. The application used for this cal-\nculation was specially developed for this research task. \nThe remainder of the paper is structured as follows. Chap-\nter 2 briefly details the calculation of the transformers’ total \noperation cost by determining the loss capitalization factors. \nChapter 3 demonstrates the applied design optimization algo-\nrithm that seeks a minimum capitalized cost solution by setting \nthe transformer’s geometric and electric parameters to the opti-\nmum. The software uses geometric programming optimization \nwhich formalism guarantees that the global optimum point is \ndetermined by an efficient and reliable computing process [5], \n[6], [7]. In the next section, the effects of multiple scenarios \nregarding the financial cost of losses are examined. Differ -\nent transformer designs are presented, each being the optimal \nchoice for a given set of capitalization factors. The contribu-\ntion of this method is that the different investment options can \nbe compared more thoroughly with the theoretically optimal \ntransformer design. Chapter 5 summarizes the paper and pro-\nvides suggestions for further research.\n2 Capitalization Factors\n2.1 Loss valuation by capitalization\nFor a sound investment decision regarding a power trans-\nformer the applied methodology should include a thorough enu-\nmeration of losses along with the detailed upfront investment \nexpenses. That is because the total cost of energy consumed by \nthe operation of the transformer can range up to five times the \ninitial cost of equipment. Thus the total life cycle cost of the \ntransformer has to be evaluated including a loss estimation and \nthe capitalization of future expenses to present price level to \nhave a solid basis of investment decision for accurately com-\npare different transformer offers, designs. The capitalization \nfactors are calculated by adding the discounted cost of energy \nlosses throughout the lifetime of the equipment to the direct \npurchase price (PP). Installation and maintenance cost can be \nomitted, if essentially similar designs are compared (e.g. same \ncooling method). However (as we can see in Chapter 4) other \ncharacteristics of the final optimal transformer design generally \ndiffer by a quite a substantial factor. This distinct operating cost \nstructure can be assessed by the calculation of no-load and load \ncost factors. Actual properties of operation, mostly the load \nfactor of utilization plays a significant role on the amount of \nlosses in a given transformer. Therefore a separated calculation \nof no-load loss (P\nNLL) and load loss (P LL) is reasonable, so the \ntotal cost of ownership (TCO) is expressed as [6]:\nTCOP PK PK Pnlll l=+ ⋅+ ⋅12\nwhere  K1  and  K 2  are the capitalization factors of no-load and \nload loss, respectively, in [€/kW] dimension. The value of these \nfactors are not only setting the absolute value of  K\n1  and  K2  for \nvarious transformer designs but the  K 1/K2  ratio is also a cru-\ncial input parameter for the design optimization. Nevertheless the \nhereby presented approach for the calculation of total cost only \naims to give a proper method to compare different equipment, but \nnot to result a full budgeting plan for the investment financing.\n2.2 Calculation of the Loss Capitalization Factors\nThe most important variable regarding the life-time cost \nassessment is the discount rate (r ). The applicable number for \nthis can be set by the finance cost (weighted average cost of \ncapital) or by the recognized rate or return for a regulated entity. \nThe accounting analogue of the expected operation lifetime of \nthe equipment, the book-life (T) dictates the time horizon of the \nanalysis of future operational cost. The capital recovery factor \n(CRF) shows the sum of the future expenses in annual pay-\nments of present-day currency. This factor can be deduced from \nprinciples regarding compounding interest, as follows:\nCR F r\nr\nT\n= −+ −11 ()\nEnergy cost (EC) gives the conversion rate between the \nphysical and the financial losses of the operation. The trans-\nformer losses also have to be delivered to the connection point. \nThe cost of this additionally needed grid capacity is represented \nby an annualized charge per kW of maximum demand (IC). \nThe IEEE standard for capitalization calculation can be fitted \nfor distribution transformers [8]. However, with the modifica-\ntion of these equations regarding the demand and loading fac-\ntors a suitable calculation can be obtained for the various load \nprofiles of connecting transformers for distinct dispatchable \nand intermittent primary energy based resources. Demand fac-\ntor is assumed to be 1, i.e. the nominal rating of the connecting \ntransformer equals to the peak output of the various generat-\ning units. Instead of using approximating formula specified in \nload-loss factor (LLF) can be obtained directly from the repre-\nsentative load profile curve: \nLLF T\npt dtptT\n2\n2\n1= ()\n\n\n\n\n()\n∞\n∫ max\n(1)\n(2)\n(3)\n127\nPeriod. Polytech. Elec. Eng. Comp. Sci. T. Orosz, P. Sőrés, D. Raisz, Á. Z. Tamus\nThe capitalization factors are the results of the loss cost \nevaluation which sum of two terms. The first one is the annual-\nized cost of maintaining the additional grid capacity, which is \nrequired to deliver the loss power. The second one is the cost of \nthe energy lost (both to core and copper losses). No-load losses \nare always occurring on an energized transformer, mainly due \nto the hysteresis and eddy losses. Equation (3) details the calcu-\nlation of the capitalized no-load losses (in €/kW):\nKC RF IC hE C1 87 6=⋅ +⋅() .\nThe formula for capitalized load-loss cost has a very similar \nform, but the effect of the variable utilization shall be considered:\nKC RF IC LLF hE C2 87 6=⋅ +⋅ ⋅() .\nThe load profile essentially determine  K1/K2  ratio which will \nbe the basic input data for the transformer design optimization. \nTherefore for the different intermittent and base load energy \nsources a diverse set of transformers proves to be optimal. Nev-\nertheless, the contribution of LLF is weighted by EC in the final \nmagnitude of  K\n2 . So neither the cost of required electricity (EC) \nnor the cost of power (IC) can be neglected (the dimensions for \nthese parameters are €/MWh and €/kW/a, respectively).\n2.3 Details of the Analysed Scenarios\nThe usually investigated range of the annual discount rate \nis about 5 to 10% p.a. In our series of analysis we have cal-\nculated with r = 8%, as in, while the lifetime basis (T ) used in \ndepreciation is 25 years. The calculation focuses on the cost of \nlosses for a medium to high voltage transformer connection of \nrenewable power plants. Capacity cost of delivering the power \nlosses to the transformer is estimated by the large consumers’ \npayment to procure peak capacity from the distribution system \noperator. In Hungary, this tariff is fixed to about 5 €/kW/a for a \nhigh voltage point of common coupling [9].\nThe energy cost is uniformly charged for all consumed elec-\ntricity, so this holds to the losses of the power transformer, as \nwell. Therefore the EC equals to the all-in cost of energy for this \ntype of system users. This includes wholesale electricity and the \nenergy-based transmission tariffs. In the Central and South East-\nern European (CSEE) region altogether it is cca. 75 €/MWh [10].\nFinally, regarding the parameters of the load profile full-\nyear statistics are used for the renewable electricity sources. \nLoad loss parameters for wind turbines, the load factor (LF  \n= 0.24) and the load-loss factor (LLF = 0.12) is derived from \ntotal wind power time series as the idiosynchoricity of its indi-\nvidual generators are more than 0.95. [11] Similar holds for \nthe photovoltaic power in-feed in Amprion’s area (LF = 0.15, \nLLF = 0.07). Using this aggregated measure of generation pro-\nfiles still appreciates the utilization of a connection transformer \nof a single renewable power plant. [12] As biomass based gen-\neration can be scheduled, the analysis considered an average \nmaintenance outage from the year-on constant base production \nwith LF = 0.9 and LLF = 0.88. The resulting  K\n1  no-load loss \ncapitalization factor is 7066 €/kW for all generation types. K 2   \nfactors are 925 €/kW, 565 €/kW, 6230 €/kW for wind, PV and \nbiomass based resources, respectively.\n3 The Transformer Design Optimization Method\nA geometric programming based optimization method is \nused for the determination of the cost optimal transformer. \nThis optimization model is calculates with reduced details of \ndata, which is enough for a tender design. This model takes \ninto consideration only the transformers’ active part, which \nconsists of the winding and the iron core. The other parts (the \ntank, the quality of the insulating oil, the structural components \nand other accessories) are not calculated exactly in the tender \ndesign stage, the optimization method takes into considera-\ntion these factors by empirical constants. This method is also \napplied to the height of primary and regulation windings.\nThe resulting offer design needs to satisfy the other require-\nments required by the applied standards (i.e. IEC-60076 series, \nGOST, IEEE), technical specifications and by the customers’ \nneed, as well.\n3.1 The Geometric Programming Approach with the \nMethod of Branch and Bound\nThe applied optimization method is based on the Geomet-\nric Programming (GP) formalism. The usage of this method \nhas several advantages: guarantees that the obtained solution \nis the global minimum, solved efficiently by the novel solution \nalgorithms. The GP is a branch of the non-linear optimization \nproblems given in the following form [13- 16]:\nmi nimi ze s ubject to:f\nfx im\ngx jo\ni\nj\n0\n11\n11\n{}\n() ≤=\n() ==\n,, ,,\n,, ,,\n\n\nwhere  x=(x1, x2, … xn)  is a vector containing the optimization \nvariables,  fi(x) is a posynomial constraint inequality,  gj(x)  is a \nmonomial constraint equality function. All elements of x  must \nbe positive. The monomial function g(x) expressed as:\ngx =c xx xgn\nn\n() ⋅⋅ ⋅12\n12αα α ,\nwhere  cg  R,  αi  R  and  cg > 0.\nA posynomial is a linear combination of monomials:\nfx =c xx xk\nk=\nK\nn\nnk\n() ⋅∑\n1\n12\n1αα αk2 k .⋅ \nIn the case of power transformers the short-circuit imped-\nance is an essential design parameter, but in case of the core-\nform transformers it cannot be formulated in the above shown \nmonomial or posynomial form. To solve this problem the solu-\ntion algorithm is mixing the method of GP with the method of \nbranch and bound (B&B). [17]\n(4)\n(5)\n(6)\n(7)\n(8)\n128\nAnalysis of the Green Power Transition on Optimal Power Transformer Designs 2015 59 3\nThe (B&B) algorithm is a general method of finding opti-\nmal solutions for a large set of problems (detailed description \ncan be found in [13]). Although it is often categorized as a \nmetaheuristic, it can provide an optimality criterion as well as \nother quite advantageous features such as manageable solution \npools and flexible tuning. B&Bs main application area lies in \nthe field of discrete and combinatorial programming, but its use \nis far from exclusive [14].\nFig. 1 Schematic view of the leakage field calculations and\nthe design variables in the transformer’s working window. \n3.2 The Geometric Programming Approach with the \nMethod of Branch and Bound\nIn the optimization model we take into consideration the \nactive part of the transformer, because its dimensions determines \nthe total cost of the equipment ( Table 1). This original active \npart model extended with the dimensions of the transformer tank \nwhich is already capable to take into consideration the limitations \nof the outer dimensions and the mass of the tank. The active part \nmodel contains three windings: the realized transformer model \nin Fig. 1. In the example transformer, the high voltage winding \nregulated with an on-load tap changer. [18]\nThe objective function of the transformer (f\n0) model is the \npreviously showed capitalized cost of the transformer, which \ninvolves the manufacturing cost and the cost of the calculated \nlosses,\nfK PK PC Mnlll l\nk\nn\nkk01 2\n0\n=⋅ +⋅ +⋅\n=\n∑ .\nwhere Ck is the specific cost of the kth material of the transform-\ners’ active part in €/kg and Mk is the mass of the kth material in kg. \nThe manufacturing cost of the core is calculated simply as the \nproduct of the core mass and the unit price of the applied electri-\ncal steel. The core weight calculated from the built-in three leg-\nged, three phase transformer core model (Fig. 2) which geometry \nis expressed by the model variables. The Epstein-curve of the \ncore material can be approximated with a posynomial function, \nso the no-load loss of the transformer can be calculated very \naccurately with the product of the specific electrical steel loss, \nthe core mass, and a technology specific building factor.\nThe mass of the windings is calculated from the winding \ngeometry, with the copper filling factor. This factor is estimated \nwith reasonable precision, from the manufacturer’s database. \nThe value of this filling factor is depends on the voltage level, \nthe power and the type of the winding. It simplifies the wind-\ning model, because it can takes into consideration the different \nwinding types with reasonable precision.\nFrom the windings’ copper mass, the DC losses are easily \ncalculated. The precise calculation of stray losses needs \nTable 1 Set of design variables in the optimization model\nQuantity Dimension Variable\nLoad loss [kW] Pll\nNo-load loss [kW] Pnll\nMain insulation distance [mm] g\nWidth of the working window [mm] s\nCore induction [T] B\nCore mass [kg] MC\nTank length [mm] A\nTank width [mm] B\nTank height [mm] C\nWinding thickness\nsecondary [mm] ts\nprimary [mm] tp\nregulating [mm] tr\nWinding height secondary [mm] hs\nCurrent density\nsecondary [A/mm2] js\nprimary [A/mm2] jp\nregulating [A/mm2] jr\nMean radius\nsecondary [mm] Rs\nprimary [mm] Rp\nregulating [mm] Rr\n(9)\nFig. 2 Schematic view of the three phase three legged transformer core. “WH” \nmeans the window height, “LP” means the leg pitch and “D” is the leg diameter.\n \n129\nPeriod. Polytech. Elec. Eng. Comp. Sci. T. Orosz, P. Sőrés, D. Raisz, Á. Z. Tamus\nadvanced numerical or analytical methods. [17, 19, 20] In the \noptimization algorithm an analytical formula is used to estimate \nthe optimal eddy losses in the windings, and an empirical factor \nis used to take into consideration the other stray losses, which \nis generated in the structural components. \nThe transformer tank dimensions calculated from the outer \ndimensions of the active part and the insulating parameters. \nLimiting the outer dimensions has high importance, because \nthe cost increment of the transportation are non-linear regard-\ning the growing outer dimensions (e.g. structure gauge and \nmass limit of conventional road or railway shipping). The \nfinancial burden of the logistics can quickly outgrow what we \nhave won by the softer limitations.\n4 Results and Discussion\n4.1 General aspects of the transformer selection\nA 40 MV A power transformer is selected for the analysis. The \ndatasheet of the power transformer is presented in Table 2, the \ntransformer layout is in accordance to the previously presented \noptimization model and IEC-60076 standard. We assumed that \nthe transformer is ONAN (oil natural, air natural) cooled, so we \nset the upper limit of the winding current density to 3 A /mm\n2 \nbecause of cooling considerations.\nThe insulation distances selection based on the BIL and AC \nvoltage test prescription, according the presented methods in \n[17, 19] and [20]. The low voltage winding is assumed as a layer \ntype winding, built-from CTC cable, to reduce the eddy current \nlosses and maximize the copper filling factor in the winding. The \nhigh voltage winding is assumed as a disc winding, built from \nradial twin or radial triple and twin conductors. We prescribed a \nminimal thickness, 10 mm for the regulating winding to increase \nthe mechanical stability of this winding. The maximum flux den-\nsity in the leg and the yokes are limited considering the trans-\nformer noise and the allowed maximum over-voltages.\nFig. 3 Schematic view of the optimized transformer working \nwindow in the case of wind power generation.\n4.2 Result of the Optimization\nThe results are shown in the Table 3, that for all considered \nscenarios the cost of no-load losses are substantially high, there-\nfore the optimal flux density is only 1.4 T. That is essentially \nmeans the transformer has a huge iron core with low flux den-\nsity which reduces the transformer noise. Figure 3 illustrates the \noptimal working window for the wind scenario. Also, the turn \nvoltage is high in the given designs. Since the utilization fac-\ntors are different in the three scenarios the cost and the optimal \nTable 2 Datasheet and the Assumed Winding Types/Filling\nFactors of the Optimized Transformer\nParameter Dimension Value\nNominal power [MV A] 40\nFrequency [Hz] 50\nConnection group [-] YNd11\nPhase nr. [#] 3\nCore-secondary insulation distance [mm] 20\nMain gap [mm] 37\nEnd insulation [mm] 180\nPhase distance [mm] 37\nOLTC diameter [mm] 530\nShort-circuit impedance [%] 12\nCore\nNr. of legs [#] 3\nBmax [T] 1.7\nFilling factor [%] 90\nMaterial tyoe [-] M1H\nMaterial price [€/kg] 3.5\nSecondary\nWinding\nLine voltage [kV] 33\nFilling factor [%] 70\nWinding/material type [-] helical/CTC\nInsulated material price [€/kg] 8\nPrimary\nWinding\nLine voltage [kV] 120\nBIL [kV] 550\nAC [kV] 230\nFilling factor [%] 65\nWinding/material type [-] disc/twin\nInsulated material price [€/kg] 7\nRegulation \nWinding\nType [-]\nde-energized \nOLTC\nFilling factor [%] 40\nWinding/material type [-]\nmulti-start/single \nconductor\nInsulated material price [€/kg] 8\n130\nAnalysis of the Green Power Transition on Optimal Power Transformer Designs 2015 59 3\ndesign of the transformers also varies. The results are shown \nthat in case of photovoltaic and wind power generation in a \nregular investment environment the optimal transformer design \nhas small no-load losses and high load losses. In contrary, a \nbiomass type generating resource requires a more expensive \nequipment that has a relatively low load losses. Therefore the \noptimal configuration for this green energy source has a larger \nsize and a substantially heavier iron core, about almost twice as \nthe 22 tons for PV and wind power plants.\n5 Conclusion\nIn this paper the calculation of transformer loss capitaliza-\ntion is presented and used for choosing the optimal transformer \ndesign. A geometric programming based optimization method \nis shortly presented in this article which is applied to compare \nthe effect of the K\n1, K 2 parameters on the active part model. \nThe ratio of these factors fundamentally determines the main \nparameters of the transformer’s active part. In contrast of other \npublished research on capitalization cost calculation which \nonly takes into consideration such transformer designs which \nare already in series production, in this research the transformer \ndesigns are the outcome.\nMoreover a geometric programming based optimization \nis shortly introduced that enables comparing different trans-\nformer design regarding the outer measurements and the cop-\nper and iron masses. Three scenarios regarding the green power \ngeneration are considered for the calculation of the optimal \ntransformer offer. The presented photovoltaic, wind and bio-\nmass technologies have fundamentally different characteristics \nregarding the capitalization factors.\nBecause of the utilization factors are different in each cases \nthe optimal transformer design also varies. The results showed \nthat in the case of the photovoltaic and wind power generation \nin a regular investment environment the optimal transformer \ndesign has small no-load losses and high load losses. That is \nessentially means the transformer has a large iron core with low \nflux density which reduces the transformer noise. The copper \namount in the windings are low, so the current densities are rel-\natively high. In contrast of these scenarios the optimal design \nin the case of biomass power generation, which has an almost \nunitary utilization factor, the high efficiency of the transformer \nis the fundamental property of the final equipment, resulting in \nrelatively large copper masses.\nIn the future the research will be extended to include the \nvarious cooling methods that can be applied in a transformer \nthat essentially influence the final optimal configuration of the \nactive part. With the inclusion of the cost of the transformer oil \ninto the optimization model one can assess the use of biode-\ngradable, alternative dielectric fluids that could be adequate in \nlight of the novel environmental regulations.\nAlso, the property of intermittency can be exploited in a \nmore sophisticated way by allowing the frequent overloading \nof the connecting transformer. That is an already known design \nrequirement in railway traction transformers, therefore the adap-\ntation of these design types to the connection of variable PV and \nwind generation can easily prove to be a promising approach.\nTable 3 Calculation results of the active part for each green \npower generation scenarios with different K 1/K2 ratios\nWind PV Biomass\nK1 €/kW 7066 7066 7066\nK2 €/kW 926 565 6225\nCore\nDiameter mm 631 636 752\nFlux density T 1.4 1.4 1.4\nMass ton 22.2 22 38.5\nTurn V oltage V 89.6 89 126\nSecondary Winding\nMean diameter mm 671 676 792\nWinding height mm 1300 1242 1460\nWinding width mm 57 57 96\nTurn number # 213 214 151\nCurrent density A/mm\n2 3 3 1\nPrimary Winding\nMean diameter mm 860 865 1101\nWinding height mm 1274 1217 1431\nWinding width mm 80 68 142\nTurn number # 773 779 550\nCurrent density A/mm2 2 3 1\nRegulating \nMean diameter mm 1094 1076 1459\nWinding height mm 1105 1056 1241\nWinding width mm 10 10 10\nCurrent density A/mm2 3 3 2\nLosses\nLoad loss kW 147.9 170 49.7\nNo-load loss kW 19.2 18 32.2\nCosts\nCopper k€ 59.2 52.4 138.4\nCore k€ 66.6 66 115.5\nCapitalization k€ 272.6 223.2 536.9\nTCO k€ 398.4 341.6 790.8\n131\nPeriod. Polytech. Elec. Eng. Comp. Sci. T. Orosz, P. Sőrés, D. Raisz, Á. Z. Tamus\nReferences\n[1] Georgilakis, P. S. \"Environmental cost of distribution transformer \nlosses.\" Applied Energy. 88 (9). pp. 3146-3155. 2011.\n DOI: 10.1016/j.apenergy.2010.12.021\n[2] Corhodzic, S., Kalam, A. \"Assessment of distribution transformers using \nloss capitalization formulae.\" Journal of Electrical and Electronics \nEngineering Australia. 20 (1). pp. 43-48. 2000.\n[3] Sores, P., Orosz, T., Vajda, I. \"Lifetime cost sensitivity assessment on \noptimal core-form power transformer design.\" CRF. 11 (1). p. 2. 2014.\n DOI: 10.13140/2.1.1161.2169\n[4] Abetti, P. A., Cuthbertson, W. J., Williams, S. B. \"Philosophy of applying \ndigital computers to the design of electric apparatus.\" American Institute \nof Electrical Engineers, Part I: Communication and Electronics, Transac-\ntions of the. 77 (3). pp. 367-379. 1958. DOI: 10.1109/TCE.1958.6372814\n[5] Boyd, S., Kim, S.-J., Vandenberghe, L., Hassibi, A. \"A tutorial on geo-\nmetric programming.\" Optimization and Engineering. 8 (1). pp. 67-127. \n2007. DOI: 10.1007/s11081-007-9001-7\n[6] Boyd, S., Vandenberghe, L. \"Convex Optimization.\" Cambridge Univer -\nsity Press, 2004.\n[7] Orosz, T., Vajda, I. \"Design optimization with geometric programming for \ncore type large power transformers.\" Electrical, Control and Communica-\ntion Engineering. 6 (1). pp. 13-18. 2014. DOI: 10.2478/ecce-2014-0012\n[8] \"IEEE Loss Evaluation Guide for Power Transformers and Reactors.\" In: \nIEEE Std C57.120-1991. 1992. DOI: 10.1109/IEEESTD.1992.114388\n[9] \"MEKH Hungarian Energy and Public Utility Regulatory Authority. \nSystem usage tariffs from 1st jan. 2015.\" 2015. [Online]. Available from: \nhttp://mekh.hu/download/f/d0/00000/rendszerhasznalati_dijtetelek_2015_\njanuar.xlsx [Accessed: 01 April 2015].\n[10] Nagy, Z. \"Hungarian Chapter of International Federation of Industrial \nEnergy Consumers (IFIEC). Power market situation for end-users in the \ncee, see and cis sub-regions in the end of 2013.\" 2013. [Online]. Avail-\nable from: http://www.ief.hu/hu/villamos-tagozat/piaci-%C3%A1rak\n [Accessed: 09 April 2015].\n[11] \"MA VIR TSO. Hungarian power system actual data: Wind production,\n 2015.\" [Online]. Available from: http://www.mavir.hu/web/mavir-en/\nwind-production [Accessed: 03 May 2015].\n[12] \"Amprion TSO. Grid data - photovolatic infeed.\" 2015. [Online]. Availa-\nble from: http://www.amprion.net/en/grid-data [Accessed: 10 May 2015].\n[13] Achterberg, T. \"Constraint Integer Programming.\" Ph.D. Thesis. Tech-\nnische Universität Berlin. 2007. URL: http://opus.kobv.de/tuberlin/voll-\ntexte/2007/1611/\n[14] Liberti, L. \"Introduction to Global Optimization.\" 2008, [Online]. Available \nfrom: http://www.lix.polytechnique.fr/~liberti/teaching/globalopt-lima.pdf \n[Accessed: 13 January 2015] \n[15] Andersen, M. S., Dahl, J., Vandenberghe, L. \"Cvxopt: A python package \nfor convex optimization.\" version 1.1. 6. Available at: cvxopt.org, 2013.\n[16] Duffin, R. J., Peterson, E. L., Zener, C. \"Geometric programming: theory \nand application.\" Wiley, New York, 1967.\n[17] Del Vecchio, R. M., Poulin, B., Feghali, P. T., Shah, D. M., Ahuja, R. \n\"Transformer design principles: with applications to core-form power \ntransformers.\" CRC press, 2010.\n[18] Jabr, R. A. \"Application of geometric programming to transformer \ndesign. Magnetics.\" IEEE Transactions on Magnetics. 41 (11). pp. 4261-\n4269. 2005. DOI: 10.1109/TMAG.2005.856921\n[19] Karsai, K., Kerenyi, D., Kiss, L. \"Large power transformers.\" 1987.\n[20] Kulkarni, S. V ., Khaparde, S. A. \"Transformer engineering: design and \npractice.\" V ol. 25. CRC Press, 2004.",
  "topic": "Power (physics)",
  "concepts": [
    {
      "name": "Power (physics)",
      "score": 0.46594560146331787
    },
    {
      "name": "Transformer",
      "score": 0.44928738474845886
    },
    {
      "name": "Power analysis",
      "score": 0.4381946623325348
    },
    {
      "name": "Electrical engineering",
      "score": 0.43671658635139465
    },
    {
      "name": "Environmental science",
      "score": 0.32019054889678955
    },
    {
      "name": "Engineering",
      "score": 0.2212170958518982
    },
    {
      "name": "Physics",
      "score": 0.1807776689529419
    },
    {
      "name": "Voltage",
      "score": 0.10525083541870117
    },
    {
      "name": "Thermodynamics",
      "score": 0.0647989809513092
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I29770179",
      "name": "Budapest University of Technology and Economics",
      "country": "HU"
    }
  ]
}