{
  "title": "Estimation of geomagnetically induced currents based on the measurement data of a transformer in a Japanese power network and geoelectric field observations",
  "url": "https://openalex.org/W1931949604",
  "year": 2015,
  "authors": [
    {
      "id": "https://openalex.org/A2068571791",
      "name": "Shinichi Watari",
      "affiliations": [
        "National Institute of Information and Communications Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2068571791",
      "name": "Shinichi Watari",
      "affiliations": [
        "National Institute of Information and Communications Technology"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2093350343",
    "https://openalex.org/W2019382975",
    "https://openalex.org/W2145343495",
    "https://openalex.org/W2125286920",
    "https://openalex.org/W2045644521",
    "https://openalex.org/W2007555017",
    "https://openalex.org/W2005139972",
    "https://openalex.org/W1512652263",
    "https://openalex.org/W1555245194",
    "https://openalex.org/W1597180206",
    "https://openalex.org/W135959694",
    "https://openalex.org/W2027160349",
    "https://openalex.org/W2116617591",
    "https://openalex.org/W2142928217",
    "https://openalex.org/W1529425827",
    "https://openalex.org/W2089469104",
    "https://openalex.org/W1825915314",
    "https://openalex.org/W1528048831",
    "https://openalex.org/W2147449780",
    "https://openalex.org/W1991191639",
    "https://openalex.org/W2102402070",
    "https://openalex.org/W36099691",
    "https://openalex.org/W1524732306",
    "https://openalex.org/W1602272225",
    "https://openalex.org/W176311859",
    "https://openalex.org/W1885411294",
    "https://openalex.org/W1972825071",
    "https://openalex.org/W2113631033",
    "https://openalex.org/W1885266593"
  ],
  "abstract": "Geomagnetically induced currents (GICs) have the potential to cause electric power blackouts. Hence, it is important to study the effects of GICs produced by intense geomagnetic storms. The measurements of GICs were conducted at the Memanbetsu substation, Hokkaido, between December 2005 and March 2008. We obtain the complementary cumulative distribution function (CCDF) of the measured GICs and the empirical equation to estimate GICs using the GIC data and geoelectric field observation data. GICs associated with the past intense geomagnetic storms, e.g., the March 13–15 storm and the October 29–30, 2003 storm, are estimated.",
  "full_text": "FULL PAPER Open Access\nEstimation of geomagnetically induced\ncurrents based on the measurement data\nof a transformer in a Japanese power\nnetwork and geoelectric field observations\nShinichi Watari\nAbstract\nGeomagnetically induced currents (GICs) have the potential to cause electric power blackouts. Hence, it is important to\nstudy the effects of GICs produced by intense geomagnetic storms. The measurements of GICs were conducted at the\nMemanbetsu substation, Hokkaido, between December 2005 and March 2008. We obtain the complementary\ncumulative distribution function (CCDF) of the measured GICs and the empirical equation to estimate GICs using the\nGIC data and geoelectric field observation data. GICs associated with the past intense geomagnetic storms, e.g., the\nMarch 13–15 storm and the October 29 –30, 2003 storm, are estimated.\nKeywords: Geomagnetically induced current (GIC); Geomagnetic storm; Geoelectric fields; Space weather\nBackground\nThe effects of geomagnetically induced currents (GICs)\non electric power grids have been observed since the\n1940s (Boteler 2001). An electric power blackout\noccurred in Quebec, Canada, during the March 13 – 15,\n1989 storm (Boteler et al. 1989; Kappenman 1989; Boteler\n2001). In southern Sweden, the GIC caused an electric\npower blackout on October 30, 2003 (Kappenman 2005).\nThe occurrence of strong GICs is often associated with\nstrong auroral electrojet currents at geomagnetically\nhigh latitudes (Thomson et al. 2011; Pulkkinen et al.\n2012). Japan is located at a geomagnetically lower lati-\ntude compared to its geographical latitude. It is believed\nthat the possibility of power grid problems caused by\nGICs is lower because of the country ’s location at geo-\nmagnetically low latitude. However, it was reported that\nlong distance telegraph lines between Tokyo and the re-\ngions outside Tokyo (the Tokyo-Yokkaichi line, the\nTokyo-Matsumoto line, the Tokyo-Ogasawara line, the\nTokyo-Guam line, and so on) were affected by GICs\ncaused by a geomagnetic storm on September 25, 1909\nin Japan (Uchida 1909). Kappenman (2004) noted that\nlarge GICs are produced by geomagnetic disturbances\ndriven by the intensification of the ring and magneto-\npause currents at low latitudes. Gaunt and Coetzee\n(2007) reported damage to transformers caused by GICs\nin South Africa as a result of series of intense geomag-\nnetic storms between the end of October and the begin-\nning of November in 2003. The geomagnetic latitude of\nSouth Africa is similar to that of Japan. This suggests a\npossibility of GIC effects in countries with lower geo-\nmagnetic latitudes such as Japan if an extremely large\ngeomagnetic storm, such as the Carrington storm on\nSeptember 1 – 2, 1859, occurs (Watari et al. 2001; Tsuru-\ntani et al. 2003; Committee on the Societal and Eco-\nnomic Impacts of Severe Space Weather Events 2008;\nThe working group on extreme solar weather of the\nRoyal Academy of Engineering 2013). Pulkkinen et al.\n(2012) and Bernabeu (2013) made studies on extreme\n100-year geoelectric field scenarios. In Spain located in\nlow geomagnetic latitude, Torta et al. (2014) studied the\neffect of GICs on the Spanish high-voltage power\nnetwork.\nIn a Japanese power network, GIC measurements were\nconducted between December 2005 and March 2008 as\npart of the close collaboration among National Institute\nof Information and Communications Technology (NICT),\nCorrespondence: watari@nict.go.jp\nNational Institute of Information and Communications Technology, 4-2-1\nNukuikita, Koganei, Tokyo 184-8795, Japan\n© 2015 Watari. This is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://\ncreativecommons.org/licenses/by/4.0), which permits unrestricted use, distribution, and reproduction in any medium, provided\nthe original work is properly credited.\nWatari Earth, Planets and Space  (2015) 67:77 \nDOI 10.1186/s40623-015-0253-8\nHokkaido Electric Power Co., and Solar-Terrestrial Envir-\nonment Laboratory (STEL) at Nagoya University (Watari\net al. 2009). We obtained the empirical equations of GICs\nusing the GIC measurement data and geoelectric field\ndata and estimated GICs associated with the past intense\ngeomagnetic storms.\nMethods\nData\nUsing a current clump meter, we measured the electrical\ncurrent of a grounded neutral point of a transformer at\nthe Memanbetsu substation of the Hokkaido Power Co.\nbetween December 2005 and March 2008. The trans-\nformer is an ordinal three-phase transformer and is\nconnected to the 187-kV line from the Ashoro power\nstation as shown in Fig. 1. Both ends of the line are\ngrounded and the Memanbetsu substation is an end point\nof this line. There is no branch between Memanbetsu and\nAshoro. The line is in a south-west direction (approxi-\nmately 40° west-wards from the north-south direction)\nand the length of the line is approximately 100 km. To\nanalyze the 1-s GIC data, we used 1-s geomagnetic field\ndata and the 1-s and 1-min geoelectric field data at the\nMemanbetsu Observatory, Japan Meteorological Agency\n(JMA), near the substation. The 1-hour geomagnetic field\ndata since 1958 are also used for a statistical analysis. The\ngeoelectric fields are measured by potential difference be-\ntween two electrodes separately buried in the ground.\nFig. 1 Configuration of 187-kV power line of GIC measurements\nTable 1 Large GIC events measured between December 2005 and March 2008\nNumber Date and time (UT) Max. GIC of 1-s data (A) Geomagnetic disturbances at Memanbetsu\n1 14 December 2006 at 23:55 3.85 SC storm (max. ΔH = 272 nT)\n2 10 November 2006 around 10:04 2.23 Gradual storm (max. ΔH = 143 nT)\n3 23 May 2007 at 10:40 1.81 Positive bay\n4 30 November 2006 around 09:09 1.75 Gradual storm (max. ΔH = 108 nT)\n5 9 July 2006 at 21:39 1.59 Sudden impulse\n6 14 April 2006 around 10:15 1.58 Gradual storm (max. ΔH = 157 nT)\n7 19 August 2006 around 14:22 1.52 Gradual storm (max. ΔH = 103 nT)\nSC sudden commencement\nWatari Earth, Planets and Space  (2015) 67:77 Page 2 of 12\nMean values of the data sets are subtracted to remove the\noffsets of the geoelectric field data in this paper.\nResults and discussion\nObserved GICs in Hokkaido\nTable 1 presents a list of the large GICs observed during\nthe period of our GIC measurements with geomagnetic\ndisturbances observed at the Memanbetsu Observatory.\nThe GIC events in Table 1 are associated with geomag-\nnetic storms with the exception of two events, a positive\nbay and a sudden impulse (SI) event. GICs associated\nwith positive bays, auroral activities in high latitude, are\noften observed in our measurements (Watari et al.\n2009). We show two examples of observed GICs at the\nMemanbetsu substation associated with the geomagnetic\nstorms with variations of geomagnetic fields at the\nMemanbetsu Observatory.\nFigure 2 shows the GIC event associated with a geo-\nmagnetic storm on December 14 – 15, 2006. This geo-\nmagnetic storm was caused by a full halo coronal mass\nejection (CME) on December 13, 2006. Magnetic and\ngeoelectric fields observed at the Memanbetsu Observa-\ntory are also shown with the GIC data. According to this\nfigure, temporal variations of By, east-west component\nof geomagnetic fields, show a good correlation with\nthe measured GIC data. The maximum 1-s GIC value\nof 3.85 A is measured during the main phase of the\nstorm.\nFigure 3 shows the GICs and geomagnetic fields of the\nNovember 9 – 11, 2006 storm. This storm was caused by\nhigh-speed solar wind from a coronal hole and started\ngradually. As shown in Fig. 3, the maximum 1-s GIC\nvalue of 2.23 A measured around 10:00 UT associated\nwith a large variation of By component of geomagnetic\nFig. 2 GIC associated with the geomagnetic storm on December 14 –15, 2006 ( top panel ) and geomagnetic field observation (Bx ( second panel ),\nBy ( third panel ), and Bz ( bottom panel )) at the Memanbetsu Observatory\nWatari Earth, Planets and Space  (2015) 67:77 Page 3 of 12\nfields during the storm. Several spikes of the GIC data in\nFigs. 2 and 3 are artificial noises.\nProbability occurrence of GICs and electric field\nobservation\nThere are several methods to estimate the probability\nof occurrence of the extreme space weather events\n(Hapgood 2011; Love 2012; Riley 2012; Kataoka 2013).\nHere, we used a method shown by Riley (2012) and\nKataoka (2013) to estimate the probability of occur-\nrence of the events exceeding some critical value. Prob-\nability of an event of magnitude equal to or greater\nthan some critical values xcrit is expressed below.\nPx ≥xcritðÞ ¼\nZ∞\nxcrit\npx\n0\n/C16/C17\ndx0 ð1Þ\nThis is called the complementary cumulative distribu-\ntion function (CCDF). If the probability of occurrence,\np(x) follows a power law distribution:\npxðÞ ¼ Cx−α ð2Þ\nEquation 1 is expressed by the equation below.\nPx ≥xcritðÞ ¼ C\nα−1 x−αþ1\ncrit ð3Þ\nwhere α and C are some fixed values.\nThe Poisson distribution is applicable for the probabil-\nity of occurrence of one or more events equal to or\ngreater than xcrit during some time Δt assuming the\nevents occur independently of one another. The prob-\nability of in Δt is given by the equation below.\nFig. 3 GIC associated with the geomagnetic storm on November 9 –10, 2006 ( top panel ) and geomagnetic field observation (Bx ( second panel ), By\n(third panel ), and Bz ( bottom panel )) at the Memanbetsu Observatory\nWatari Earth, Planets and Space  (2015) 67:77 Page 4 of 12\nPx ≥xcrit; t ¼ ΔtðÞ ¼ 1−e−NΔt\nτ Px ≥xcritðÞ ð4Þ\nwhere N is the number of events in the data set and τ is\nthe total time span of the data set.\nFigure 4 shows occurrence number of 1-min averaged\nvalues of the GIC data between December 2005 and\nMarch 2008 and the CCDF of the values equal to or\ngreater than GIC values of the horizontal axes. Two\ndashed lines show 95 % confidence interval. There is a\npower law relation for the value equal to or greater than\n0.5 A (see the vertical dotted line in Fig. 4). Hence, N\nbecomes the number of events equal to or greater than\n0.5 A. The exponent value of α of 5.11 and the value of\nC of 0.0030 are obtained by using the data in Fig. 4. We\ncan calculate the probability using Eq. 3. For example,\nthe probability with 95 % confidence interval of GIC\nvalue equal to or greater than 10 A is 5.8 × 10 −8 [3.5 ×\n10−10,9 . 5×1 0 −6]. The probability of GIC ≥ 100 A is\n4.5 × 10 −12 [2.6 × 10 −14,7 . 8×1 0 −10]. According to\nE q .4 ,t h ep r o b a b i l i t i e sw i t h9 5%c o n f i d e n c ei n t e r v a l\nof GIC ≥ 10 A in 50 and 100 years are 0.67 [0.0067,\n1.0] and 0.89 [0.013, 1.0], respectively. And the prob-\nabilities of GIC ≥ 100 A in 50 and 100 years are 8.7 ×\n10−5 [5.0 × 10 −7,1 . 4×1 0 −2] and 1.7 × 10 −4 [1.0 × 10 −6,\n2.9 × 10 −2], respectively.\nIntense GICs are produced by large geoelectric fields.\nHence, we study the 1-min geoelectric field data at the\nMemanbetsu Observatory near the substation between\n1987 and 2014. Table 2 shows dates and geomagnetic\ndisturbances when the largest geoelectric fields more\nthan or equal to 0.1 V/km are observed. They are ob-\nserved or associated with intense geomagnetic storms as\nshown in Table 2. Figure 5 shows the occurrence num-\nber and the CCDF of the values equal to or greater than\ngeoelectric field values of horizontal axes. There is a\npower law relation for the value equal to or greater than\nFig. 4 Occurrence number of 1-min averaged values of GICs and the CCDF of the values equal to or greater than 0.1 A. The dashed lines in the\nright panel show 95 % confidence interval of the fitting ( solid line )\nTable 2 Largest geoelectric fields observed between 1958 and 2014 at the Memanbetsu Observatory\nNumber Date and time (UT) Max. |E| of 1-min data (V/km) Geomagnetic disturbances at Memanbetsu\n1 13 March 1989 at 21:58 0.184 SC storm (max. ΔH = 747 nT)\n2 8 November 1991 at 22:17 0.137 SC storm (max. ΔH = 392 nT)\n3 29 October 2003 at 19:54 0.123 SC storm (max. ΔH = 513 nT)\n4 30 October 2003 at 19:54 0.120 SC storm (max. ΔH = 467 nT)\n5 14 March 1989 at 00:03 0.115 SC storm (max. ΔH = 747 nT)\n6 15 July 2000 at 21:36 0.115 SC storm (max. ΔH = 520 nT)\n7 24 March 1991 at 04:02 0.115 SC storm (max. Δ > 467 nT)\n8 6 November 2001 at 02:02 0.104 SC storm (max. ΔH = 338 nT)\nSC sudden commencement\nWatari Earth, Planets and Space  (2015) 67:77 Page 5 of 12\n0.03 V/km (see the vertical dotted line in Fig. 5) and N\nis the number of data equal to or greater than 0.003 V/\nkm. The exponent value of α of 4.98 and the value of C\nof 2.11 × 10 −9 are obtained by using the data in Fig. 5.\nThe probability with 95 % confidence interval of geoelectric\nfields |E| equal to or greater than 1.0 V/km is 5.3 × 10 −10\n[4.9 × 10 −12,5 . 7×1 0 −8]a n dt h a to f| E | ≥ 5.0 V/km is 8.7 ×\n10−13 [8.1 × 10 −15,9 . 3×1 0 −11]. Using Eq. 4, the probabil-\nities of |E| ≥ 1.0 V/km in 50 and 100 years are 1.2 × 10 −2\n[1.1 × 10 −4,7 . 3×1 0 −1] and 2.4 × 10 −2 [2.3 × 10 −4,9 . 3×\nFig. 5 Occurrence number of 1-min values of geoelectric field data between 1987 and 2014 at the Memanbetsu Observatory and the CCDF of\nthe values equal to or greater than 0.001 V/km. The dashed lines in the right panel show 95 % confidence interval of the fitting ( solid line )\nFig. 6 Occurrence number of absolute values of difference of 1-hour values of horizontal component of Memanbetsu geomagnetic field data between\n1958 and 2013 and the CCDF of the values equal to or greater than 10 nT/hour. The dashed lines in the right panel show 95 % confidence interval of\nthe fitting ( solid line)\nWatari Earth, Planets and Space  (2015) 67:77 Page 6 of 12\n10−1], respectively. The probabilities of |E| ≥ 5.0 V/km in\n50 and 100 years are 2.0 × 10 −5 [1.9 × 10 −7,2 . 2×1 0 −3]\nand 4.0 × 10 −5 [3.7 × 10 −7,4 . 3×1 0 −3], respectively.\nOne-hour geomagnetic field data of Memanbetsu Ob-\nservatory are available since 1958. Figure 6 shows occur-\nrence number and the CCDF of the values equal to or\nabsolute values | ΔH| of difference of 1 hour values of\nhorizontal component of Memanbetsu geomagnetic field\ngreater than values of horizontal axes. There is a power\nlaw relation for the value equal to or greater than 20\nnT/hour (see the vertical dotted line in Fig. 6). N is the\nnumber of data equal to or greater than 20 nT/hour.\nThe exponent value of α of 4.45 and the value of C of\n3.90 × 10 3 are obtained by using the data in Fig. 6. The\nprobability with 95 % confidence interval of | ΔH| equal\nto or greater than 500 nT/hour is 5.41 × 10 −7[5.4 × 10 −9,\n5.5 × 10 −4]. Using Eq. 4, the probabilities of | ΔH| ≥ 500\nnT/hour in 50 and 100 years are 1.9 × 10 −2 [2.1 × 10 −3,\n1.0] and 3.5 × 10 −1 [4.3 × 10 −3, 1.0], respectively.\nEstimation of GIC and discussion\nAccording to Pulkkinen et al. (2007) and Torta et al.\n(2012), GIC at a site by geoelectric field is modeled by\nthe equation\nFig. 7 Geoelectric fields observed at the Memanbetsu Observatory with the GIC data of the December 14 –15, 2006 storm. Angle is 0° for the\nnorth and increases clockwise. Block lines and crosses show the 1-min data, and red lines and dots in the figure show the 1-s data. The blue line is\nthe estimated GIC using the 1-min geoelectric field data\nWatari Earth, Planets and Space  (2015) 67:77 Page 7 of 12\nGIC tðÞ¼ aEx tðÞþ bEy tðÞ þ ε tðÞ ð 5Þ\nwhere Ex and Ey are the horizontal components of the\nlocal geoelectric field and a and b are the site-dependent\nsystem parameters. ε(t) is the noise term.\nThe values of a and b are given by the equations\na ¼\n< GICEy >< ExEy > − < GICEx >< E2\ny >\n< ExEy>2− < E2\nx >< E2\ny > ð6Þ\nb ¼ < GICEx >< ExEy > − < GICEy >< E2\nx >\n< ExEy>2− < E2\nx >< E2\ny > ð7Þ\nwhere < . > denotes the expectation taken over different\nrealizations of the process.\nFigure 7 shows geoelectric fields observed at the Meman-\nbetsu Observatory with the GIC data of the December 14 –\n15, 2006 storm. In Fig. 7, north is 0° and angle increases\nclockwise. The black lines and crosses show 1-min data and\nthe red lines and dots show 1- s data. By applying the Eqs. 6\nand 7 to the 1-min data in Fig. 7, values of a and b are ob-\ntained as 38.1 and −7.4 A km/V, respectively. The blue line\nof Fig. 7 shows the estimated GIC using Eq. 5. The esti-\nmated value of GIC is approximately half of the observed\nvalue around the maximum of GIC in Fig. 7. Ogawa (2002)\nnoted that it is necessary to consider a gain factor between\nthe electric field at a site and the regional electric field. The\ngain factor is assumed to be 1 in the analysis of this paper.\nFigure 8 shows the 1-s geoelectric field values associated\nwith the GIC values shown in Table 1. According to this\nfigure, the GIC of the December 14 – 15, 2006 event, 3.85 A,\nis larger comparing with other events.\nVertical component of geomagnetic variation at a site\nis expressed by linear combination of the two horizontal\nFig. 8 One-s geoelectric field values associated GIC values shown\nin Table 1\nFig. 9 Values of Parkinson arrow ( −Re(α), −Re(β)) for several frequencies calculated for Memanbetsu geomagnetic filed data shown in Fig. 2\nWatari Earth, Planets and Space  (2015) 67:77 Page 8 of 12\ncomponents as the equation below (Rikitake and Yokoyama\n1953; Gregori and Lanzerotti 1980).\nΔBz ¼ αΔBx þ βΔBy ð8Þ\nParkinson arrow, ( −Re(α), − Re(β)) obtained by Eq. 8 is\nused for analysis of an underground conductivity anom-\naly. The arrow points direction of conductive layer.\nFigure 9 shows the values of Parkinson arrow for several\nfrequencies calculated by using geomagnetic field data of\nMemanbetsu shown in Fig. 2. According to this figure,\nParkinson arrow points eastward. This suggests existence\nof conductive layer in east of Memanbetsu. Uyeshima\net al. (2001) suggested a significant coast effect in eastern\nHokkaido based on the observation by the network-\nmagnetotelluric (network-MT) method. Consideration of\nunderground conductivity is necessary to understand the\nmeasured GIC data as a future work.\nWe calculated GICs of the March 13 – 15, 1989 storm\nand the October 29 – 30, 2003 storm using Eq. 5.\nFig. 10 One-min geoelectric field data observed at the Memanbetsu Observatory of the March 13 –15, 1989 storm and the estimated GIC using\nthe 1-min geoelectric field data\nWatari Earth, Planets and Space  (2015) 67:77 Page 9 of 12\nFigures 10 and 11 show the electric field data and the\nestimated GICs using Eq. 5 with the values of a and b ob-\ntained from the December 14 – 15, 2006 event. According\nto our result, the expected maximum absolute values of\nGICs are approximately 6.2 and 4.2 A, respectively.\nAs another approach, GIC is estimated by the\nequation below (Boteler et al. 1994) for an equiva-\nlent circuit of a three-phase electric power line\nearthed on both ends shown in Fig. 12 when the\nsame earthing resistance, Rs(Ω) and the winding\nresistance of the transformers Rw(Ω)a r ea s s u m e d\nfor both ends.\nGIC ¼ E∥L\nrLþ2Rw\n3 þ 2Rs\n¼ E∥\nr\n3 þ 2Rw\n3L þ 2Rs\nL\nð9Þ\nwhere E∥ (V/km) is the uniform electric field parallel to\na power line, r (Ω/km) is the power line resistance per\nunit length, and L (km) is length of the power line. GIC\nFig. 11 Geoelectric fields observed at the Memanbetsu Observatory of the October 29 –30, 2003 storm and the estimated GIC using the 1-min\ngeoelectric field data. The black lines and crosses show the 1-min data and the red lines and dots in the figure show the 1-s data\nWatari Earth, Planets and Space  (2015) 67:77 Page 10 of 12\nis proportional to electric fields as shown Eq. 9. For the\nsufficiently long power line, Eq. 9 becomes\nGICe\n3\nr E∥ ð10Þ\nEquation 10 gives an upper limit of GIC by E∥.I fw e\nassume that r is 0.05 Ω /km for 187-kV power lines, RS\nis 0.1 Ω, Rw is 0.1 Ω, and L is 100 km, Eq. 9 becomes\nGIC ¼ E∥\n0:05\n3 þ 0:2\n300 þ 0:2\n100\n≅51:7E∥ ð11Þ\nWe can estimate GIC using E∥ as shown in the Eq. 11.\nAccording to the result from Eqs. 5, 6, and 7, GIC is also\ncalculated using Eq. 12.\nGIC ¼\nﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃ\na2 þ b2\np\nE∥≅38:8E∥ ð12Þ\nUsing a DC power source as a proxy of GICs, Takasu\net al. (1994) performed experiments on DC excitation\nfor scale models with linear dimensions that were one\nthird to one half of those of actual power transformers.\nDistortion of wave forms of AC currents was observed\nby the applied DC currents of several tens ampere to the\nscale models. A maximum temperature rise of approxi-\nmately 110 °C was measured in the case of the core plate\nand the core support made by magnetic steel for a GIC\nlevel of approximately 200 A for three phases. From\nEq. 12, the geoelectric field parallel to the power line, E∥\nof 5.2 V/km, is necessary for the GIC level of 200 A. We\nneed further studies on GIC levels affecting the power\ngrids to know an effective level of geoelectric fields.\nConclusions\nWe studied the GIC data measured at the Memanbetsu sub-\nstation, Hokkaido, using the geoelectric and geomagnetic\nfield data observed at the Memanbetsu Observatory, JMA,\nand obtained the empirical equation to estimate GICs associ-\nated with the past intense geomagnetic storms. GICs associ-\nated with the March 13 – 15, 1989 storm and the October\n29– 30, 2003 storm were estimated by using the Eq. 8. Esti-\nmated maximum absolute values of the GICs are approxi-\nmately 6.4 and 4.2 A, respectively. Our estimation seems to\nbe approximately half of the observed values according to\nthe December 14– 1 5 ,2 0 0 6e v e n ts h o w ni nF i g .7 .I ti sn e c e s -\nsary to consider the effect of regional underground conduct-\nivity for the estimation as a future work. The CCDF of the\nGIC data is calculated. According to it, the probabilities of\nextremely large values of the GIC seem to be low. However,\nit is based on the measurement of approximately 2 years and\nthere is a large uncertainty. We need more long-term data as\nnoted by Hapgood (2011).\nCompeting interests\nThe author declares that he has no competing interests.\nAcknowledgements\nThe GIC measurements in Hokkaido, Japan, were conducted as part of the\nclose collaboration among NICT, Hokkaido Electric Power Co., and STEL at\nNagoya University. We would like to thank the Hokkaido Electric Power Co.\nfor the GIC measurements at the Memanbetsu substation. We thank the\nKakiok3a Magnetic Observatory, JMA, for providing us with geomagnetic and\ngeoelectric field data and the lists of magnetic storms at the Memanbetsu\nObservatory. Finally, we wish to acknowledge the anonymous reviewers and\nthe editor, Dr. Ikuko Fujii, for their valuable comments and suggestions.\nReceived: 26 October 2014 Accepted: 19 May 2015\nReferences\nBernabeu EE (2013) Modeling geomagnetically induced currents in Dominoin\nVirginia power using extreme 100-year geoelectric field scenarios — part1.\nIEEE Trans Power Delivery 28(1):516 –23. doi:10.1109/TPWRD.2012.2224141\nBoteler DH (2001) Space weather effects on power systems. In: Song P, Singer H,\nSiscoe G (eds) Space weather. AGU, Washington D.C. ISBN 0-87590-984-1\nBoteler DH, Shier RM, Watanabe T, Horita RE (1989) Effects of geomagnetically\ninduced currents in the B. C. Hydro 500 kV system. IEEE Trans Power Systems\n4(1):818–23\nBoteler DH, Bui-Van Q, Lemay J (1994) Directional sensitivity to geomagnetically\ninduced currents of the Hydoro-Quebec 735 kV power system. IEEE Trans\nPower Delivery 9(4):1963 –71\nCommittee on the Societal and Economic Impacts of Severe Space Weather\nEvents (2008) Severe space weather events — understanding societal and\neconomic impacts: workshop reports. The National Academies Press,\nWashington D.C. ISBN 0-309-12770-X\nGaunt CT, Coetzee G (2007) Transformer failure in regions incorrectly considered\nto have low GIC-risk. Paper presented at IEEE Power Tech 2007, Lausanne,\nSwitzerland\nGregori GP, Lanzerotti LJ (1980) Geomagnetic depth sounding by induction\narrow representation: a review. Reviews Geophys Space Phys 18(1):203 –9\nHapgood MA (2011) Towards a scientific understanding of the risk from extreme\nspace weather. Adv Space Res 47:2059 –72. doi:10.1016/j.asr.2010.02.007\nKappenman JG (1989) Effects of geomagnetic disturbances on power systems.\nIEEE Power Eng Rev 9(10):15 –20\nKappenman JG (2004) Effects of space weather on technology infrastructure. In:\nDaglis IA (ed) Space weather and the vulnerability of electric power grids.\nKluwer Academic Publishers, NATO Science Series, pp 257–99. ISBN 1-4020-2747-8\nKappenman JG (2005) An overview of the impulsive geomagnetic field\ndisturbances and power grid impacts associated with the violent sun-earth\nconnection events of 29 –31 October 2003 and a comparative evaluation\nwith other contemporary storms. Space Weather 3:S08C01. 10.1029/\n2004SW000128\nFig. 12 Equivalent circuit of the power line\nWatari Earth, Planets and Space  (2015) 67:77 Page 11 of 12\nKataoka R (2013) Probability of occurrence of extreme magnetic storms. Space\nWeather 11:1 –5. doi:10.1002/swe.20044\nLove JJ (2012) Credible occurrence probabilities for extreme geophysical events:\nearthquakes, volcanic eruption, magnetic storms. Geophys Res Lett 39,\nL10301. doi:10.1029/2012GL051431\nOgawa Y (2002) On two-dimensional modeling of magnetotelluric field data.\nSurv Geophys 23(2 –3):251–73. doi:10.1023/A:1015021006018\nPulkkinen A, Pirjola R, Viljanen A (2007) Determination of ground conductivity\nand system parameters for optimal modeling of geomagnetically induced\ncurrent flow in technological systems. Earth Planets Space 59:999 –1006\nPulkkinen A, Bernabeu E, Eichner J, Beggan C, Thomson AWP (2012) Generation\nof 100-year geomagnetically induced current scenarios. Space Weather 10,\nS04003. doi:10.1029/2011SW000750\nRikitake T, Yokoyama I (1953) Anomalous relations between H and Z\ncomponents of transient geomagnetic variations. J Geomagn Geoelec\n5(3):59–65\nRiley P (2012) On the probability of occurrence of extreme space weather. Space\nWeather 10, S02012. doi:10.1029/2011SW000734\nTakasu N, Oshi T, Miyashita F, Saito S, Fujiwara Y (1994) An experimental analysis\nof excitation of transformers by geomagnetically induced currents. IEEE Trans\nPower Delivery 9(2):1173 –9\nThe working group on extreme solar weather of the Royal Academy of\nEngineering (2013) Extreme space weather: impacts on engineered systems\nand infrastructure. Royal Academy of Engineering, London. ISBN 1-903496-95-0\nThomson A, Reay S, Dawson E (2011) Quantifying extreme behavior in\ngeomagnetic activity. Space Weather 9, S10001. doi:10.1029/2011SW000696\nTorta JM, Serrano L, Regue JR, Sanchez AM (2012) Geomagnetically induced\ncurrents in a power grid of northeastern Spain. Space Weather 10, S06002.\ndoi:10.1029/2012SW000793\nTorta JM, Marsal S, Quintana M (2014) Assessing the hazard from\ngeomagnetically induced currents to the entire high-voltage power network\nin Spain. Earth Planets Space 66:87. doi:10.1186/1880-5981-66-87\nTsurutani BT, Gonzalez WD, Lakhina GS, Alex S (2003) The extreme magnetic\nstorm of 1 –2 September 1859. J Geophys Res 108(A7):1268. 10.1029/\n2002JA009504\nUchida T (1909) Earth current on 25 September 1909. J Inst Electrical Eng Japan\n29(255):701–21 (in Japanese)\nUyeshima M, Utada H, Nishida Y (2001) Network-magnetotelluric method and its\nfirst results in central and eastern Hokkaido, NE Japan. Geophys J Int 146:1 –19\nWatari S, Kunitake M, Watanabe T (2001) The Bastille day (14 July 2000) event in\nhistorical large sun-earth connection events. Sol Phys 204:423 –36\nWatari S, Kunitake M, Kitamura K, Hori T, Kikuchi T, Shiokawa K, Nishitani N,\nKataoka R, Kamide Y, Aso T, Watanabe Y, Tsuneta Y (2009) Measurements of\ngeomagnetically induced current in a power grid in Hokkaido, Japan. Space\nWeather 7, S03002. doi:10.1029/2008SW000417\nSubmit your manuscript to a \njournal and beneﬁ t from:\n7 Convenient online submission\n7 Rigorous peer review\n7 Immediate publication on acceptance\n7 Open access: articles freely available online\n7 High visibility within the ﬁ  eld\n7 Retaining the copyright to your article\n    Submit your next manuscript at 7 springeropen.com\nWatari Earth, Planets and Space  (2015) 67:77 Page 12 of 12",
  "topic": "Geomagnetically induced current",
  "concepts": [
    {
      "name": "Geomagnetically induced current",
      "score": 0.9317468404769897
    },
    {
      "name": "Geomagnetic storm",
      "score": 0.7689266204833984
    },
    {
      "name": "Earth's magnetic field",
      "score": 0.6033342480659485
    },
    {
      "name": "Storm",
      "score": 0.5971975326538086
    },
    {
      "name": "Meteorology",
      "score": 0.5124835968017578
    },
    {
      "name": "Cumulative distribution function",
      "score": 0.48858126997947693
    },
    {
      "name": "Transformer",
      "score": 0.47691962122917175
    },
    {
      "name": "Environmental science",
      "score": 0.4201088547706604
    },
    {
      "name": "Geology",
      "score": 0.40982314944267273
    },
    {
      "name": "Geophysics",
      "score": 0.3272644281387329
    },
    {
      "name": "Probability density function",
      "score": 0.19680044054985046
    },
    {
      "name": "Voltage",
      "score": 0.1786334216594696
    },
    {
      "name": "Magnetic field",
      "score": 0.1671619713306427
    },
    {
      "name": "Physics",
      "score": 0.15713709592819214
    },
    {
      "name": "Engineering",
      "score": 0.10802718997001648
    },
    {
      "name": "Statistics",
      "score": 0.1070697009563446
    },
    {
      "name": "Mathematics",
      "score": 0.09012055397033691
    },
    {
      "name": "Electrical engineering",
      "score": 0.0885097086429596
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I90023481",
      "name": "National Institute of Information and Communications Technology",
      "country": "JP"
    }
  ]
}