{
  "title": "Experimental resource pulses influence social-network dynamics and the potential for information flow in tool-using crows",
  "url": "https://openalex.org/W1941790528",
  "year": 2015,
  "authors": [
    {
      "id": "https://openalex.org/A1988102022",
      "name": "James J. H. St Clair",
      "affiliations": [
        "University of Oxford"
      ]
    },
    {
      "id": "https://openalex.org/A2088996565",
      "name": "Zackory T. Burns",
      "affiliations": [
        "University of Oxford"
      ]
    },
    {
      "id": "https://openalex.org/A2463084846",
      "name": "Elaine M. Bettaney",
      "affiliations": [
        "University of Bath"
      ]
    },
    {
      "id": "https://openalex.org/A2305850428",
      "name": "Michael B. Morrissey",
      "affiliations": [
        "University of St Andrews"
      ]
    },
    {
      "id": "https://openalex.org/A2078901015",
      "name": "Brian Otis",
      "affiliations": [
        "University of Washington"
      ]
    },
    {
      "id": "https://openalex.org/A1976179876",
      "name": "Thomas B. Ryder",
      "affiliations": [
        "Smithsonian Conservation Biology Institute",
        "National Zoological Park"
      ]
    },
    {
      "id": "https://openalex.org/A2099349361",
      "name": "Robert C. Fleischer",
      "affiliations": [
        "Smithsonian Conservation Biology Institute",
        "National Zoological Park"
      ]
    },
    {
      "id": "https://openalex.org/A2102324767",
      "name": "Richard James",
      "affiliations": [
        "University of Bath"
      ]
    },
    {
      "id": "https://openalex.org/A1892171549",
      "name": "Christian Rutz",
      "affiliations": [
        "University of Oxford"
      ]
    },
    {
      "id": "https://openalex.org/A1988102022",
      "name": "James J. H. St Clair",
      "affiliations": [
        "University of Oxford"
      ]
    },
    {
      "id": "https://openalex.org/A2088996565",
      "name": "Zackory T. Burns",
      "affiliations": [
        "University of Oxford"
      ]
    },
    {
      "id": "https://openalex.org/A2463084846",
      "name": "Elaine M. Bettaney",
      "affiliations": [
        "University of Bath"
      ]
    },
    {
      "id": "https://openalex.org/A2305850428",
      "name": "Michael B. Morrissey",
      "affiliations": [
        "University of St Andrews"
      ]
    },
    {
      "id": "https://openalex.org/A2078901015",
      "name": "Brian Otis",
      "affiliations": [
        "University of Washington"
      ]
    },
    {
      "id": "https://openalex.org/A1976179876",
      "name": "Thomas B. Ryder",
      "affiliations": [
        "Smithsonian Conservation Biology Institute",
        "National Zoological Park"
      ]
    },
    {
      "id": "https://openalex.org/A2099349361",
      "name": "Robert C. Fleischer",
      "affiliations": [
        "Smithsonian Conservation Biology Institute",
        "National Zoological Park"
      ]
    },
    {
      "id": "https://openalex.org/A2102324767",
      "name": "Richard James",
      "affiliations": [
        "University of Bath"
      ]
    },
    {
      "id": "https://openalex.org/A1892171549",
      "name": "Christian Rutz",
      "affiliations": [
        "University of Oxford"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2080452089",
    "https://openalex.org/W2040136601",
    "https://openalex.org/W2137840984",
    "https://openalex.org/W1501800495",
    "https://openalex.org/W1904537313",
    "https://openalex.org/W2015025231",
    "https://openalex.org/W2143538093",
    "https://openalex.org/W2014686052",
    "https://openalex.org/W4298314905",
    "https://openalex.org/W2027867812",
    "https://openalex.org/W1982300822",
    "https://openalex.org/W2166692930",
    "https://openalex.org/W2084787964",
    "https://openalex.org/W2024987570",
    "https://openalex.org/W1982707930",
    "https://openalex.org/W2116565636",
    "https://openalex.org/W2128318833",
    "https://openalex.org/W2147742276",
    "https://openalex.org/W2031308645",
    "https://openalex.org/W2033193852",
    "https://openalex.org/W2148296161",
    "https://openalex.org/W2137191865",
    "https://openalex.org/W1971375046",
    "https://openalex.org/W2148812893",
    "https://openalex.org/W4236926346",
    "https://openalex.org/W2003785870",
    "https://openalex.org/W1596193583",
    "https://openalex.org/W4242115228",
    "https://openalex.org/W2164531437",
    "https://openalex.org/W2036143660",
    "https://openalex.org/W2100902084",
    "https://openalex.org/W1971459665",
    "https://openalex.org/W2029763286",
    "https://openalex.org/W2134029507",
    "https://openalex.org/W1989260668",
    "https://openalex.org/W2174827248",
    "https://openalex.org/W1980449587",
    "https://openalex.org/W2156934441",
    "https://openalex.org/W2098061972",
    "https://openalex.org/W2329689473",
    "https://openalex.org/W1973214225",
    "https://openalex.org/W2153807118",
    "https://openalex.org/W2103576559",
    "https://openalex.org/W2084709977",
    "https://openalex.org/W2059310896",
    "https://openalex.org/W2031157934",
    "https://openalex.org/W1963565197",
    "https://openalex.org/W11392245",
    "https://openalex.org/W2030833256",
    "https://openalex.org/W1906551997",
    "https://openalex.org/W3174993126",
    "https://openalex.org/W1918407117",
    "https://openalex.org/W40327798"
  ],
  "abstract": null,
  "full_text": "ARTICLE\nReceived 22 Sep 2014| Accepted 16 Apr 2015| Published 3 Nov 2015\nExperimental resource pulses inﬂuence\nsocial-network dynamics and the potential\nfor information ﬂow in tool-using crows\nJames J.H. St Clair1,w,*, Zackory T. Burns1,*, Elaine M. Bettaney2, Michael B. Morrissey3, Brian Otis4,\nThomas B. Ryder5, Robert C. Fleischer5, Richard James2 & Christian Rutz1,w\nSocial-network dynamics have profound consequences for biological processes such as\ninformation ﬂow, but are notoriously difﬁcult to measure in the wild. We used novel trans-\nceiver technology to chart association patterns across 19 days in a wild population of the New\nCaledonian crow—a tool-using species that may socially learn, and culturally accumulate,\ntool-related information. T o examine the causes and consequences of changing network\ntopology, we manipulated the environmental availability of the crows’ preferred tool-\nextracted prey, and simulated, in silico, the diffusion of information across ﬁeld-recorded\ntime-ordered networks. Here we show that network structure responds quickly to environ-\nmental change and that novel information can potentially spread rapidly within multi-family\ncommunities, especially when tool-use opportunities are plentiful. At the same time, we\nreport surprisingly limited social contact between neighbouring crow communities. Such\nscale dependence in information-ﬂow dynamics is likely to inﬂuence the evolution and\nmaintenance of material cultures.\nDOI: 10.1038/ncomms8197 OPEN\n1 Department of Zoology, University of Oxford, Oxford OX1 3PS, UK.2 Department of Physics and Centre for Networks and Collective Behaviour, University of\nBath, Bath BA2 7AY, UK.3 School of Biology, Centre for Biological Diversity, University of St Andrews, St Andrews KY16 9TH, UK.4 Department of Electrical\nEngineering, University of Washington, Seattle, Washington 98195-3770, USA.5 Smithsonian Conservation Biology Institute, National Zoological Park,\nWashington, DC 20013-7012, USA.w Present address: School of Biology, Centre for Biological Diversity, University of St Andrews, St Andrews KY16 9TH, UK.\n* These authors contributed equally to this work. Correspondence and requests for materials should be addressed to J.J.H.S.C.\n(email: jsc20@st-andrews.ac.uk) or to R.J. (email: r.james@bath.ac.uk) or to C.R. (email: christian.rutz@st-andrews.ac.uk).\nNATURE COMMUNICATIONS| 6:7197 | DOI: 10.1038/ncomms8197 | www.nature.com/naturecommunications 1\n& 2015 Macmillan Publishers Limited. All rights reserved.\nN\new Caledonian crowsCorvus moneduloides(hereafter ‘NC\ncrows’ or ‘crows’) use a range of twig and leaf tool types to\nextract embedded prey1 (Fig. 1a,b). Earlier research has\nhighlighted the possibility that NC crows may socially learn at\nleast some of their tool-related skills, leading to increasingly\ncomplex tool technologies and geographically distinct material\n‘cultures’, but this has not been formally tested 2–4. The\nemergence and maintenance of cultural variation depend not\nonly on the mode of social transmission, but also on the dynamic\nstructure of the network across which information ﬂows5–8. This\nis because the sequence, frequency and proximity of social\nencounters determine which individuals are in a position\nto transmit or learn information at any given time and, by\nextension, the speed and pathways of diffusion5. It is extremely\nchallenging, however, to collect such ﬁne-scale, time-ordered data\nfrom free-ranging animal populations, especially in inaccessible\nhabitats9,10. We used a ‘reality mining’ approach10–12 to record\nassociations in a wild NC crow population, combining cutting-\nedge tracking technology, large-scale ﬁeld experiments and\ncomputer simulations.\nUsing self-developed wireless sensor network (WSN) technol-\nogy (‘Encounternet’13,14), we charted association patterns and\nspace use of a population of 33 free-ranging NC crows, of known\ngenetic relatedness, during a 19-day study period. Birds were\nﬁtted with miniature (ca. 10 g) transceiver tags that transmitted\nID-coded radio pulses every 20 s, while receiving and logging\nsignals from other nearby tags, producing detailed records of the\ntime, proximity and duration of crow encounters. Meanwhile,\nan array of 45 ﬁxed receivers (‘basestations’; Fig. 1c) monitored\nroaming tags, and wirelessly downloaded their logged association\ndata. This technology enabled us to map social-network\ndynamics: directly (that is, encounters were not inferred\npost hocfrom group membership data); continuously (in contrast\nto some other technologies15, logging of encounters can occur\nwhen subjects are out of range of ﬁxed receivers); remotely and\nautonomously (eliminating disturbance by human observers); at\nunprecedented temporal resolution (in the order of minutes);\nover a biologically relevant range of bird-to-bird distances (in the\norder of metres); and in near real time (each day’s association\ndata could be retrieved and analysed overnight).\nThe distributions of animals in space, and thus their possible\nassociation networks, are likely to be strongly affected by the\ndistribution of key resources9,16,17. To examine the inﬂuence of\nchanges in local resource abundance on network dynamics, we\nmanipulated the environmental availability of an important crow\nfood source, following a simple baseline–experiment–reversal\ndesign. Speciﬁcally, we mimicked natural resource gluts that\noccur when decaying candlenut treesAleurites moluccanafall and\nbreak open (‘tree-fall events’; Fig. 1a), exposing the burrows of\nhighly nutritious longhorn beetle larvae Agrianome fairmairei,\nwhich crows dexterously extract with stick tools18–20 (Fig. 1b).\nFinally, to examine the potential consequences of the observed\nnetwork dynamics for the spread of information by social\nlearning, we used our empirical association data to simulate the\ndiffusion of information across networks recorded under these\ndifferent conditions. Our analyses reveal that the potential for\ninformation ﬂow responds rapidly and heterogeneously to\nchanges in resource availability—dynamics that are likely to\ninﬂuence the capacity of crow networks to support cultural\nvariation.\nResults\nStructure of the undisturbed social network. Our system yielded\na total of 177,102 daytime association logs. Unless stated other-\nwise, our analyses are based on a subsample of logs with a high\nmean signal strength (n ¼ 4,268 logs of RSSImeanZ15, classiﬁed\nas 1,820 discrete encounters), representing encounters during\nwhich crows are likely to have been close enough to observe each\nother’s tool-oriented behaviour (see Methods). A static (time-\naggregated) network for the initial 7-day perturbation-free\n‘baseline’ period (‘B’) exhibited clear assortment by capture site\n(Fig. 1c,d; Newman’s assortativity r ¼ 0.8318; sr ¼ 0.042)21,\nevidently forming a northern community (20 birds) and a\nsmaller southern one (13 birds). Tag pulses received by the\nbasestation array conﬁrmed that community membership and\nspace use were strongly linked (Fig. 1c). Association patterns\nduring each baseline day were signiﬁcantly correlated with genetic\nrelatedness because of a tendency for ﬁrst-order related dyads to\nspend more time in close proximity than more distantly related\nones (daily Pearson correlations:r ranging from 0.415 to 0.564,\nn ¼ 7 days, with all Po0.03)22. Each community contained\nseveral well-connected dyads or triads, usually comprising\ngenetically unrelated adult male–female dyads (presumably\nbonded pairs), and/or related adult–juvenile pairs13.\n500−\n50−\n5−\n0.5−\ncd\na b\n10\n11\n19\n22\n29\n32\n35\n38\n40\n42\n47\n49\n54\n56\n58\n59\n61\n66\n67\n68\n71\n72\n73 74\n75\n76\n77\n78\n79\n80\n81\n84\n85\nTime (min)\nca.1 cm\n1\n2\n3\n4\nFigure 1 | Space use and association network of a wild, undisturbed\npopulation of New Caledonian crows.(a) A wing-tagged crow observes\nanother individual using a stick tool at a natural tree-fall site, where\nthe burrows of longhorn beetle larvae have become exposed (photo:\nJ. Troscianko). (b) A beetle larva (ca. 60 mm in length) bites the tip of a\nresearcher-held ‘tool’. (c) T opological map of the study site (10 m elevation\ncontours; 1,000 m grid), showing the location of crow traps (numbered\ncrosses; traps were removed before the study), ﬁxed receivers\n(‘basestations’; ﬁlled circles) and experimental ‘tree falls’ during E1 (red\ntriangle) and E2 (red squares) periods. Spatial segregation of crow\ncommunities, as inferred from tag signals received by basestations over the\nbaseline period, is shown by kernel density plots (blue plot based on pulses\nfrom birds in the northern community; green plot for the southern\ncommunity). (d) Association network of both crow communities over the\nsame time period. Short-range associations are shown in colours\ncorresponding to the time (in minutes) spent in association (note logged\nscale), while more distant associations are shown in uniform grey. Sex is\nindicated by node shape (female, circle; male, square), age by node colour\n(juvenile, pink; immature, grey; adult, black) and trap location by node\nboundary colour (northern community, blue; southern community, green).\nARTICLE NATURE COMMUNICATIONS | DOI: 10.1038/ncomms8197\n2 NATURE COMMUNICATIONS| 6:7197 | DOI: 10.1038/ncomms8197 | www.nature.com/naturecommunications\n& 2015 Macmillan Publishers Limited. All rights reserved.\nEffects of experimental resource provisioning. Nightly retrieval\nand analysis of association data allowed us to conﬁrm that the\nnetwork was in a stable state before experimental manipulations\ncommenced (Fig. 2a–c). We ﬁrst recreated a tree-fall event\nat a position approximately midway between the core regions\noccupied by the northern and southern communities (Fig. 1c).\nInterestingly, this experiment (‘E1’) failed to induce signiﬁcant\ntopological changes in daily time-aggregated networks during its\n3-day duration (Fig. 2a–c). Tag signals logged by a nearby base-\nstation revealed that two subjects approached the experimental\n0\n1\n2\n3\n4\n5\nk\n0\n1\n2\n3\n4\n5\n6\nd \n0.0\n0.2\n0.4\n0.6\n0.8f\n2\n4\n6\n8\n10\ni\n1 2 3 4 5 6 7 8 9 1 01 11 21 31 41 51 61 71 81 9Day:\nSource\nReceiver\n0.0\n1.0\np transfer\nSource\nReceiver\nBaseline 'B'\nnatural conditions\nExperiment 1 'E1'\nbetween-community\nprey glut\nExperiment 2 'E2'\nwithin-community\nprey gluts\nReversal 'R'\nnatural conditions\n−\n−\n−\n−\nTime (min)\n500\n50\n5\n0.5\nFigure 2 | Effects of experimentally manipulated tool-use opportunities on the structure, dynamics and information-ﬂow potential of a social network\nof wild New Caledonian crows.(a) Association networks based on 3-day subsamples (for visual comparison) for all four experimental periods. (b)T h e\nmean degree (k) of daily networks for the whole population (black), and separately, for the northern (blue) and southern community (green) only. (c)T h e\nmean of the total time spent in close association (d) by individual crows on each day, scaled to baseline levels for ease of comparison. (d) Proportion of\ntime spent in close association that was with ﬁrst-order genetic relatives (f). (e) The mean daily indomain size (i) from simulations of social information\nﬂow across dynamic networks. (f,g) Matrices summarizing information-ﬂow simulations on time-ordered 3-day association networks (same as ina). Cell\ncolours correspond to the probability that information passes from one crow (arranged along they axis) to another (x axis) during each experimental\nperiod. Nodes are ordered according to either community membership (f), or genetic relatedness (g); in (g), cells corresponding to 1st-order related\nindividuals are enclosed in white boxes.\nNATURE COMMUNICATIONS | DOI: 10.1038/ncomms8197 ARTICLE\nNATURE COMMUNICATIONS| 6:7197 | DOI: 10.1038/ncomms8197 | www.nature.com/naturecommunications 3\n& 2015 Macmillan Publishers Limited. All rights reserved.\nsite to withinca. 10 m, but neither bird landed on the provided\nlogs, and no other tagged birds were recruited, highlighting a\nsurprising degree of community segregation (Fig. 1c,d). In\ncontrast, a second experiment (‘E2’) of community-central tree\nfalls (Supplementary Fig. 1), implemented following reversal of\nE1, elicited strong responses at both within-community and\nwhole-network levels. Node-based metrics—mean degree (k) and\ntotal time spent in associations ( d)—increased markedly\n(over three- and twofold, respectively) during the 4-day E2\nexperimental period, relative to preceding periods [ k ¼ 1.09\n(range: 0.97–1.45) for the seven B days versus 3.48 (2.06–3.88)\nfor the four E2 days, Wilcoxon rank-sum test W ¼ 0,\nP ¼ 0.010, estimated difference ¼ 2.26, 95% conﬁdence interval\n(CI) ¼ 0.97–2.79; d ¼ 0.89 min (0.73–1.71) for the seven B days\nversus 2.31 min (1.16–2.77) for the four E2 days, Wilcoxon\nrank-sum testW ¼ 2, P ¼ 0.024, estimated difference¼ 1.21, 95%\nCI ¼ 0.26–1.88], suggesting that a novel network state had been\nachieved (Fig. 2a–c).\nExperimental resource provision during E2 increased network\nconnectivity in two ways. First, within each community and\nacross the population as a whole, novel edges formed among\nhitherto non-associating birds (54 novel dyadic associations\noccurred population-wide during E2, beyond the 73 recorded\nduring the preceding 10 days; Supplementary Fig. 2). Second,\ndyads that had previously associated tended to increase their\nassociation time. These processes occurred differentially in the\ntwo communities: the predominant response in the northern\ncommunity was the formation of new associations, while the\nsouthern one responded largely with the strengthening of existing\nbonds (Fig. 2b,c). At the population level, these changes produced\na signiﬁcant reduction in genetic assortativity, with values off—\nthe proportion of time spent in close encounters that was with\nﬁrst-order kin—falling to a median of 0.31 (0.219–0.414) during\nthe four E2 days, from 0.48 (0.415–0.564) during the 7 days of\nperiod B (Wilcoxon rank-sum testW ¼ 28, P ¼ 0.006, estimated\ndifference ¼ 0.18, 95% CI¼ 0.07–0.28; Fig. 2d). Taken together,\nthese results imply a marked increase in the number and strength\nof horizontal and oblique transmission pathways, across which\ntool-related and other social information could potentially ‘jump’\nbetween non-family lineages.\nWhile the aggregation of association data into a series of\nstatic networks allows convenient comparison of network\nproperties within and between different experimental periods,\nthis ‘snapshot’ approach can mask important biological patterns,\nsuch as how information might spread\n23,24. We were able to\nexamine dynamic changes in crow association patterns minute-\nby-minute (Supplementary Fig. 3). These ﬁne-scale analyses\nrevealed that our population’s response to the E2 resource glut\nwas largely due to brief (ca. 1 h long) periods of intense early-\nmorning association (in contrast to B and E1 days), consistent\nwith aggregation at resource patches and dispersal following\nsatiation or prey depletion. This lack of effective resource\ndefence by dominant birds, and apparently high level of\ntolerance to unrelated conspeciﬁcs at prime foraging sites, is\nunexpected and contrasts with the results of an earlier study that\ntracked NC crows sporadically by means of conventional radio-\ntelemetry25. In primate societies, a similarly ‘egalitarian’ social\ncontext of tool-assisted foraging provides abundant opportunities\nfor social learning, through observation, co-action or interaction\nwith freshly discarded tools 26, and is thought to be key to\nmaintaining and accumulating cultural information27–29.\nSimulated information ﬂow on time-ordered networks .T o\nexplore how our observed dynamic networks could support\ninformation ﬂow, we implemented simulations following the\nbasic rationale of ‘susceptible infectious’ compartment models of\ndisease transmission30. In each simulation run, one crow was\nchosen to be the source of a novel piece of information at the start\nof a day; all others were naive. Information could only spread\nfrom an informed to a naive individual if they had a close-range\nencounter on that day. All informed crows remained informed,\nand could therefore act as potential spreaders, for the rest of the\nday. At the end of the day, informed crows were listed. In\nsubsequent runs, each crow in turn was chosen as the ‘seed’ for\nthe daily information ﬂow, which again could only occur during\nthe observed encounters between crows on the chosen day. To\nmeasure simulated information spread during a day, we counted\nthe number of seeds from which each crow could have received\ninformation (that is, its ‘indomain’), which gives similar counts to\nthe ‘outdomain’, the number of crows ultimately informed by\neach seed. As information transfer was modelled stochastically\n(see Methods), we repeated the simulation 1,000 times for each\nseed on each day.\nAs all empirically recorded daily networks contained both\nstrongly connected individuals and more weakly connected or\nisolated ones, it follows that indomains (and outdomains) should\nvary according to which crow was the seed individual on a given\nday. We did indeed ﬁnd substantial variation in our simulations:\nfor example, depending on the seed chosen, outdomains\naveraged over B days ranged from 1 to 3.7 crows, and from\n1 to 11.5 crows for E2 days. To allow conclusions about network\nproperties across all nodes, we averaged indomain size over all\ncrows and replicates to produce the measure i, the mean\nindomain size of a given group of crows on a given day, which\nserves as a proxy for the information-carrying capacity of the\nobserved network. As might be expected,i was sensitive to the\nrate of information transfer within encounters (see Methods), but\nvaried little between days during the baseline (B) and the ﬁrst\nexperimental period (E1) (Fig. 2e). Critically, the mean indomain\nsize increased dramatically in response to E2 tree-fall events, with\ncrows in a position to receive information from over ﬁve times as\nmany possible seed crows on E2 days than on B days [Fig. 2e–g;\nmedian i ¼ 5.95 (3.09–6.74) for the four E2 days versus 1.05\n(0.83–2.08) for the seven B days, Wilcoxon rank-sum testW ¼ 0,\nP ¼ 0.006, estimated difference ¼ 4.65, 95% CI ¼ 2.05–5.70].\nThese ﬁndings suggest that variation in resource distribution\nis a key driver of the information-ﬂow properties of NC crow\nsocial networks.\nReversibility of experimental effects. Following removal of E2\ntree-fall stimuli after four days, we continued to monitor network\ntopology for ﬁve more days to probe the persistence of experi-\nmental effects. In this perturbation-free reversal period (‘R’), most\naspects of network structure tended to return to baseline levels\n(Fig. 2). This pattern of reversal supports the causal effect of our\nE2 experiment on network topology and illustrates the speed with\nwhich association networks can track changing environmental\nconditions. Some metrics during the reversal period differed from\ntheir pre-manipulation levels [d ¼ 1.46 min (1.36–1.99) for the\nﬁve R days versus 0.89 min (0.73–1.71) for the seven B days,\nWilcoxon rank-sum test W ¼ 4, P ¼ 0.030, estimated\ndifference ¼ 0.57, 95% CI¼ 0.08–1.03; f ¼ 0.61 (0.544–0.627) for\nthe ﬁve R days versus 0.483 (0.414–0.564) for the seven B days,\nWilcoxon rank-sum test W ¼ 2, P ¼ 0.010, estimated\ndifference ¼ 0.12, 95% CI ¼ 0.05–0.18; Fig. 2, Supplementary\nFig. 7]. Although the difference in the mean durationd\nbetween B\nand R could be due to temporal autocorrelation between\nexperimental and post-experimental periods, we note that such a\n‘lag’ did not prevent the rapid expression of experimental effects\nduring E2, and thatf (the proportion of time in association that\nARTICLE NATURE COMMUNICATIONS | DOI: 10.1038/ncomms8197\n4 NATURE COMMUNICATIONS| 6:7197 | DOI: 10.1038/ncomms8197 | www.nature.com/naturecommunications\n& 2015 Macmillan Publishers Limited. All rights reserved.\nwas spent with kin) was actually signiﬁcantly higher during R\nthan during any previous period. Taken together, these ﬁndings\nimply that some behavioural drivers of network topology may be\nsensitive to both the current and the past distribution of prey\nresources.\nDiscussion\nAssociation network dynamics are profoundly linked to evolu-\ntionary and ecological processes through effects on predation\nrisk\n31, disease transmission 24,32, reproductive opportunities 33,\ncosts and beneﬁts of cooperative behaviour34, and (as here) the\nopportunity for social information exchange8,15,34. Until now,\nsuch dynamics have been extremely difﬁcult to investigate in wild\nanimal populations. Our study demonstrates that, while NC crow\nsocial structure is inﬂuenced by genetic relatedness, close and\nprotracted associations between unrelated birds provide abundant\nopportunities for social information exchange between lineages.\nMajor experimentally-induced increases in information-ﬂow\npotential suggest that clumped prey resources, as are known to\noccur naturally when beetle-infested trees topple and break\nopen18,20 (Fig. 1a), may accelerate the diffusion of tool-related\nknowledge in NC crow communities.\nIt is worth stressing that changes in whole-network properties\nwere recorded within hours of both the start and end of the E2\nperiod, a timescale that would have been impossible to resolve\nusing alternative methods of observation 10. We expect that\nadvances in WSN technology will allow the collection of ever\nlarger, richer and better-resolved social-network datasets,\nfrom a growing range of study animals and environments. As\nwe have shown, such methods facilitate experimental\nmanipulation of entire social networks of free-ranging\nanimals and allow responses to be recorded with unprecedented\ntemporal resolution. Obvious applications include further\nﬁeld-experimental investigations of the environmental causes,\nand functional consequences, of social-network dynamics.\nImportantly, our simulation-based approach allows emergent\nproperties such as information-ﬂow potential to be integrated\nacross repeat runs with all possible ‘seed’ individuals, averaging\nout stochastic and inter-individual variation. This method should\ncomplement traditional ﬁeld-diffusion experiments, which track\nthe effects of ‘one-shot’ seeding of novel information by training a\nsmall number of pre-selected demonstrators as a critical test of\ndiffusion by social learning\n35. Our ﬁndings should inform the\ndesign and interpretation of such ﬁeld-diffusion studies, which\noften use localized food sources as opportunities for subjects to\nexpress and (socially) learn novel behaviours, or to attract\nindividuals in order to infer social bonds between them 35.\nIn both cases, estimates of the probability, speed and routes\nof information exchange may be strongly inﬂuenced by\nexperimentally elicited levels of aggregation that may, for some\nstudy species, be highly unusual.\nIn NC crows, naturalistic tree-fall manipulations markedly\nincreased the potential for information ﬂow within communities,\nwhile at the same time we found very low rates of association\nbetween communities centred only a few hundred metres apart\n(Figs 1c,d and 2f). This pattern suggests a modular social\nstructure6 in which between-community information ﬂow is\nlikely to occur over disproportionately slow timescales, mediated\nby population-dynamic processes such as natal or breeding\ndispersal36. Empirical studies suggest that reduced information\nﬂow between social groups can facilitate cultural divergence37,38,\nin much the same way that restricted gene ﬂow between\npopulations permits genetic divergence. It is thus possible\nthat the observed scale dependence in information-ﬂow\ndynamics facilitates the evolution and maintenance of tool-\nrelated variation.\nMethods\nStudy site and subject attributes. We conducted our study from 2 October to 15\nNovember 2011 in a lowland dry-forest study site on the central west coast of\nGrand Terre island, New Caledonia (Gouaro-De´va, 21/C1763304000 S, 165/C1761900000 E;\nFig. 1c). The resident crow population had been undisturbed by research activ-\nity4,18,39 for ca. 2 years before the current study. From 2 to 21 October, 42 crows\nwere trapped using meat-baited whoosh nets40, deployed at four different locations\n(Fig. 1c). At two sites, capture rates diminished over the course of trapping, while\nthe other two sites produced only one crow each (Supplementary Fig. 5). We\nestimate that these 42 birds constitute over 80% of the local crow population during\nour study period. We note that these crows are likely to be a nonrandom sample, as\nneophobic individuals that were wary of approaching trapsites (and may also have\navoided our experimental manipulations) are less likely to have been included. All\ntrapped crows were blood-sampled (for molecular sexing\n41), allocated to age\ncategories (according to gape colouration, which changes as individuals\nmature\n20,42), weighed, measured and tagged, with the exception of an adult male,\nwhich had an injured wing and was released immediately. We genotyped\nindividuals at 12 polymorphic loci36 and used Kinship to generate a binarized\nmatrix G of ﬁrst-order relatedness43,44. Following best-practice guidelines for\nbiologging studies45, backpack-mounted tags (including braided nylon weak-link\nharnesses; Sirtrack, NZ) totalled less than 5% of the recipient’s body mass in all\ncases13. For summary information on subjects and their tags, see Supplementary\nTable 1.\nSystem overview. ‘Encounternet’ is a fully digital animal-tracking system that\nuses advanced WSN technology; a detailed description of hardware components\nand basic functionality has been provided elsewhere13,14. Brieﬂy, in this ﬁrst full-\nscale deployment of a proximity-enabled Encounternet system, crow-mounted\ntransceiver tags were programmed to emit regular ID-coded radio pulses (see\n‘Software settings’), while recording pulses from all other tags within reception\nrange. Tag-to-tag encounters were written to ‘logs’, which were stored in the on-\nboard memory of each participating tag. Logs included the identities of the sending\nand receiving tags, time data from on-board clocks and a ‘received signal strength\nindicator’ (RSSI) summary of received radio pulses, which allowedpost hoc\ninference about the proximity of associating birds (see ‘Estimating bird-to-bird\ndistance from signal strength’). When a tag containing stored logs came within\ncommunication range of a ﬁxed receiver (‘basestation’), 45 of which were arrayed\nacross our study site (Fig. 1c), all logs were transferred wirelessly from tag to\nbasestation, and automatically cleared from tag memory following successful\nupload. Basestations also directly recorded the time and sender-ID of all radio\npulses from tags within reception range, providing useful spatial context for the\nassociation dataset (Fig. 1c). Finally, hand-held transceivers (‘masternodes’) were\nused by ﬁeldworkers to wirelessly download logs from tags and basestations, and to\nperform software adjustments, such as routine synchronization of the on-board\nclocks of all tags.\nBasestation array and tag detection\n. We deployed a higher density of base-\nstations in areas of preferred crow habitat, in order to maximize data retrieval from\nroaming tags (Fig. 1c). At night (see ‘Experimental schedule’) we visited each\nbasestation in turn, using masternodes to download the encounter logs accumu-\nlated during the preceding daylight period. Basestations in areas of high crow\ndensity typically recorded thousands of logs over a 24 h period, while units posi-\ntioned at the far north and south of the main study valley acquired few (if any)\ndata, suggesting that the array was appropriately widespread to monitor our study\npopulation\n13. The maximum number of encounter logs recorded on any crow-\nborne tag was 885, while the maximum number recorded on any basestation was\n58,645, substantially below the memory capacity of tags and basestations\nrespectively, implying that our system was never memory-limited. Every night\nbefore programmed tag-shutdown at 20:00 (starting no earlier than 18:45; see\n‘Software settings’), we remotely contacted tags on roosting birds using\nmasternodes, to ensure clock synchronization. Of our 41 deployed tags, four\napparently failed to transmit, as they were never detected by other tags,\nbasestations or masternodes, even during regular, wide-ranging searches outside\nthe core study area. A further four tags either ceased transmitting, or developed\nirremediable on-board clock issues during the study (on average 8.0±1.6 days after\ndata collection had commenced), and were excluded from all analyses. Of the\nremaining 33 tags, 26 delivered immediately useable data, while the on-board\nclocks of the other seven had drifted, or spontaneously reset at least once during\ndeployment, which necessitatedpost hoc adjustment of logged times (see ‘Data\nprocessing’).\nExperimental schedule\n. From the time that traps were permanently removed\nfrom the study area (21 October 2011) until data collection ceased, ﬁeldworkers\nonly entered the study site during the crows’ inactive roosting period (range:\n18:45–05:00) to ensure that the social network under investigation was minimally\ndisturbed. Tags switched on synchronously at 04:00 on 27 October 2011 (see\n‘Software settings’), after a 5-day standby period during which the birds could\nhabituate to their tags, and the population could recover from our trapping\nactivities. After initial switch-on, tags operated on a 16/8 h on–off duty cycle\nNATURE COMMUNICATIONS | DOI: 10.1038/ncomms8197 ARTICLE\nNATURE COMMUNICATIONS| 6:7197 | DOI: 10.1038/ncomms8197 | www.nature.com/naturecommunications 5\n& 2015 Macmillan Publishers Limited. All rights reserved.\n(see ‘Software settings’ below). Data were collected over 19 consecutive days,\ndivided into four experimental time periods: a 7-day perturbation-free ‘baseline’\ncontrol period (‘B’); a 3-day experimental period with a simulated tree fall in the\ncentre of the main study valley, approximately midway between the two crow\ncommunities (‘E1’); a 4-day experimental period with a simulated tree fall close\nto the geographical centre of each crow community (‘E2’); and a 5-day post-\nexperimental reversal period (‘R’), replicating baseline conditions. Each tree-fall\nsimulation (E1, 1 site; E2, 2 sites; Fig. 1c) consisted ofca. 150 kg of decaying\ncandlenut timber transported to the experimental sites and collected into a pile as\nthough an infested tree had freshly fallen\n46 (Supplementary Fig. 1). This timber was\n‘salted’ each night with longhorn beetle larvae, which were collected elsewhere and\nplaced carefully into existing beetle burrows and crevices19. For logistical reasons,\nthe E1 stimulus was covered with a tarpaulin at the end of the E1 period, while both\nE2 stimuli were physically removed from the study site at the end of the E2 period.\nAs with all data collection and system maintenance, experimental stimuli were\npositioned and removed at night, to avoid crow disturbance.\nSoftware settings\n. We programmed tags to optimize system performance\nwithin the constraints imposed by their memory and battery capacity. Following\nthe initial standby period (see above), tags operated on a 16/8 h on–off duty cycle,\nstarting at 04:00 each morning (68.4±0.7 min before sunrise) and shutting down\nevery evening at 20:00 (112.1±0.7 min after sunset). Tags were programmed\nto emit a single radio pulse (433 MHz) every 20 s. Since on-board memory may\nhave been insufﬁcient to record every single received radio pulse individually, tags\nwere programmed to dynamically calculate the mean received signal strength\n(RSSImean) for pulse sequences during sustained encounters, and to record this\nvalue in a log, together with the identities of transmitting and receiving tags, the\nstart- and stop-time of the pulse sequence (Tstart and Tstop), and the power of the\nweakest (RSSImin) and strongest (RSSImax) received radio pulses. The receiving\ntag closed the log when either (i) no pulse was received from the transmitting tag\nfor six consecutive pulse intervals (in our study, 6/C2 20 s¼ 120 s); or (ii)t h e\nencounter reached a threshold of 15 received pulses (in either case, Tstop would\nequal the time of the last received pulse). For encounters that exceeded 15 pulses,\nfresh logs were initiated sequentially for as long as the encounter continued\n(for example, a 12-min encounter would generate a series of three separate logs,\nof 5, 5 and 2 min, respectively). Condition (i) above was designed to allow for\naccidentally missed pulses, occurring (for example) because of temporary\nobstructions between transmitting and receiving tags. Condition (ii)w a s\nimplemented to reduce information loss through averaging over the course of\nprotracted encounters and caused logs to record a maximum duration (Tstop\nminus Tstart) of 300 s in the case that 15 consecutive 20-s pulses were received. As\ncondition (i) effectively allowed six consecutive missed pulses during the course\nof an encounter, however, it was possible for encounter logs to last for longer\nthan 300 s\n14.\nEstimating bird-to-bird distance from signal strength. ‘Proximity loggers’,\nincluding our Encounternet transceiver tags, record the strength of received\nradio signals (RSSI; see above), from which the distance between tags (and hence\nanimals) is later estimated. Such inference is possible because radio signals\nattenuate predictably with distance from their source. Before deploying our\nsystem, we experimentally explored the effects of distance and several nuisance\nvariables (habitat structure; height of tags above ground; relative alignment of\ntransmitting and receiving tag antennae) on RSSI (reported in full elsewhere\n14).\nThe resulting statistical model allowed us—given some assumptions about the\nmovement of crows (for example, that relative antenna angles were sampled\nrandomly) and their habitat preferences and activity proﬁles (as characterized in\nprevious years with crow-mounted, miniature video cameras\n47)—to establish an\nRSSI threshold value, with which we could identify relatively close encounters,\nduring which crows may have observed each other. While RSSImax (see above)\nprovides a convenient tool for preliminary analyses13, high values may be\ngenerated by ﬂeeting passes of birds, rather than by protracted social encounters.\nTo address this problem, we ﬁltered our raw dataset using RSSImean values\ninstead, which are computed by averaging RSSI across series of consecutively\nreceived pulses (see above) and therefore contain considerably more information.\nThis averaging process has two noteworthy consequences. First, the RSSImean of\nmany encounters (in particular, very short ones) will be reduced by weaker pulses\nduring the approach and separation periods of associating individuals; therefore,\nwe will have discarded a number of encounter segments in which crow pairs came\nwithin close proximity at least part of the time. Second, because animals are\nunlikely to be stationary throughout an encounter, their distance of closest\napproach will generally be much lower than the recorded RSSImean suggests. To\nobtain a dataset for our network and diffusion analyses comprising predominantly\nof close encounters, during which social learning through close observation could\nhave taken place, we applied a ﬁltering threshold of RSSImeanZ15. Our calibration\nanalyses suggest that a single-pulse RSSI of 15 will correspond to an inter-crow\ndistance ofr4.7 m in 50% of cases, andr11.3 m in 95% of cases\n14. These distance\nestimates are likely to be highly conservative: of all logs with RSSImeanZ15,\nwe found that the median RSSImax value was 37, indicating that dyads generally\nspent part of their encounter in much closer proximity than the RSSImean value\nsuggests.\nData processing. Before analysis, we conducted a quality-control exercise48,i n\nwhich: (i) incomplete, corrupt or duplicate logs were removed; (ii) data from tags\nthat failed temporarily or wholly during the 19-day deployment period were\ndiscarded; (iii) the timing of encounter logs was compared visually between each\ntag in a given dyad, to identify offsets that might indicate clock-drift issues; and\n(iv) post hoc time adjustments were made to logs of seven tags with faulty clocks.\nStep (iii) was omitted for one tag (ID no. 35), which was actively transmitting\nthroughout the deployment, but which failed to upload any logs to basestations, so\nthat its encounters were recorded only by its social partners’ tags rather than by\nboth participating tags. Time adjustments in step (iv) were based on tag clock\nreadings, which we had recorded from each tag at known times using the\nmasternode on an approximately nightly basis (see above). These adjustments were\nalso facilitated by the basestation array, which recorded the activity schedule of the\naffected tags, as well as by unaffected tags, which reliably logged the time of\nencounters with affected tags. For social-network analyses and graphs, we\nsubsampled tag-to-tag logs according to their RSSImean values in order to include\nonly encounter segments where crows remained within a given distance of each\nother on average (see above; Supplementary Fig. 6a,b). Because each encounter\nbetween tagged birds is effectively recorded twice (once by each participating tag),\nit is necessary to reconcile between-tag discrepancies in RSSI and start- and stop\ntimes. Such discrepancies can arise from phase offsets in pulse patterns between\ntags, from minor clock asynchronies, and from between-tag power differences\nlikely associated with small variations in power cells, ampliﬁer circuits and\nantennae\n14,49; we reconciled such log pairs by accepting the earliest start time and\nthe latest stop time. Finally, because protracted encounters generated a series ofca.\n5-min long logs (see above), we considered logs that started within 23 s of each\nother (marginally over a single-pulse interval; see above) to be contiguous and\namalgamated them to form a single encounter record\n50 (Supplementary Fig. 6c).\nNetwork analyses. Node layout for network graphs was the same in all ﬁgures\nand was achieved by spring-embedding, with minor manual adjustments to\nimprove legibility. ‘Close’ associations are indicated by edges coloured according to\nthe summed duration of associations with an RSSImeanZ15 (see above) logged\nduring the period of interest (Fig. 1d, 7 days; Fig. 2a, 3-day subsamples to allow\ncomparison). More distant spatial associations (RSSImeanZ0) are indicated by\ngrey edges. To produce time-series plots (Fig. 2b–d), we used daily aggregated\nassociations, stored in a matrix D of the total (daily) duration of pairwise\nencounters with RSSImeanZ15 (see above). We computed each metric (k, d and f,\nsee below) on each of the 19 consecutive study days, ﬁrst for all 33 crows, and then\nseparately for the northern and southern communities (here each community was\ntreated as an ‘isolated’ group with its own duration matrix D). The degree of a crow\non a given day is the number of other tagged crows it encountered (at the speciﬁed\nRSSImean level); for crow j, it is simply the count of non-zero elements in row j of\nmatrix D. This number, averaged over all crows (n ¼ 33, 20 or 13), gives the mean\ndaily degree (k). The mean duration of encounters (d) is the average, over all\npossible crow dyads, of the daily duration of encounters, computed as the average\nof the off-diagonal elements of D. Encounter durations among crows in the\nsouthern community were substantially longer than in the northern one on\naverage; therefore, for the purposes of visualization (Fig. 2c), the mean duration\nwas scaled by the average value in the ﬁrst seven baseline days (1.07 min for all\ncrows, 0.55 min for the northern and 5.79 min for the southern community).\nMolecular analysis of crows’ blood samples (see ‘Study site and subject attributes’)\ngenerated a binarized matrix G of ﬁrst-order relatedness\n36. We used two\napproaches to explore the role of relatedness in shaping daily association networks.\nThe ﬁrst was to correlate the association matrix for all crows for each day of the\nbaseline period (days 1–7) with matrix G. We used standard Mantel matrix\ncorrelation tests for this, with the Pearson correlation coefﬁcient as the test statistic.\nTo test the hypothesis that the correlation coefﬁcient was greater than expected by\nchance, we used a stratiﬁed node permutation test in which node labels of crows\nfrom the northern community (and from the southern community) were shufﬂed\nonly among themselves\n51. The second approach (shown in Fig. 2d) examined\nchanges in the fraction of daily encounter durations that occurred between pairs of\nﬁrst-order related crows (f). If all non-zero entries in matrix D align with non-zero\nentries in G,f ¼ 1.\nInformation-ﬂow simulations. The potential ﬂow of social information across\nnetworks was investigated through a series of daily simulations (Fig. 2e–g; for\ndetails, see main text). In each simulation, a single crow was seeded with a\nhypothetical piece of information at the start of the day. The information could\npass from ‘informed’ to ‘naive’ crows during encounters between them, simulating\nthe spread of information through the population. Within the time window of each\nencounter, the transmission process was modelled to be stochastic, with a constant\nprobability per unit time, characterized by the mean time for information transfer\n(l). We setl at 5 min, reﬂecting the modal duration of empirically observed\nencounters. Each crow in turn was chosen as the information seed. Our measure of\ninformation ﬂow is the size of the ‘indomain’; for crow j, this is the number of seed\ncrows from which crow j could have received the hypothetical piece of information\nby day’s end. We ran 1,000 simulations per starting crow per day and plotted the\ndaily indomain size averaged over the 1,000 simulations and over all crows, those\nin the northern community, and those in the southern one (i; Fig. 2e). Varyingl\nARTICLE NATURE COMMUNICATIONS | DOI: 10.1038/ncomms8197\n6 NATURE COMMUNICATIONS| 6:7197 | DOI: 10.1038/ncomms8197 | www.nature.com/naturecommunications\n& 2015 Macmillan Publishers Limited. All rights reserved.\nby±3 min caused the average all-crow indomain (i) to vary in size by less than one\ncrow. For more detailed analyses of indomain effects (Fig. 2f,g), we plotted matrices\nthat summarize data from the same contiguous 3-day blocks (B, E1, E2 and R) that\nhad been used to construct network graphs (Fig. 2a). Each cell in the matrix panels\nwas coloured according to the probability of simulated information passing from\nthe starting crow (arranged along they axis) to another crow (x axis), averaged over\nall runs on all days used in the relevant 3-day period (the only difference between\npanels f and g is the ordering of the crows; for details, see ﬁgure caption). Wilcoxon\nrank-sum tests were used to compare values of daily network metrics between\nexperimental time periods; to illustrate effects, the medians are presented, together\nwith the full data range, and the estimated effect size (the median of the difference\nbetween a sample from the ﬁrst group and a sample from the second) with its 95%\nconﬁdence interval. Finally, because the maximum distance at which individuals\nare considered to be ‘in association’ will inﬂuence the results of social-network\nanalyses, we generated descriptive metrics for each experimental period using a\nrange of RSSImean threshold values (RSSImeanZ13, 14, 16 and 17), demon-\nstrating that the described results remained qualitatively unchanged\n(Supplementary Fig. 7).\nReferences\n1. Hunt, G. R. Manufacture and use of hook-tools by New Caledonian crows.\nNature 379, 249–251 (1996).\n2. Hunt, G. R. & Gray, R. D. Diversiﬁcation and cumulative evolution in New\nCaledonian crow tool manufacture.Proc. R. Soc. B270, 867–874 (2003).\n3. Kenward, B., Rutz, C., Weir, A. A. S. & Kacelnik, A. Development of tool use in\nNew Caledonian crows: inherited action patterns and social inﬂuences.Anim.\nBehav. 72, 1329–1343 (2006).\n4. Bluff, L. A., Kacelnik, A. & Rutz, C. Vocal culture in New Caledonian crows\nCorvus moneduloides. Biol. J. Linn. Soc.101, 767–776 (2010).\n5. Blonder, B., Wey, T. W., Dornhaus, A., James, R. & Sih, A. Temporal dynamics\nand network analysis.Methods Ecol. Evol.3, 958–972 (2012).\n6. Whitehead, H. & Lusseau, D. Animal social networks as substrate for cultural\nbehavioural diversity. J. Theor. Biol.294, 19–28 (2012).\n7. Pinter-Wollman, N. et al. The dynamics of animal social networks: analytical,\nconceptual, and theoretical advances.Behav. Ecol. 25, 242–255 (2014).\n8. Mann, J., Stanton, M. A., Patterson, E. M., Bienenstock, E. J. & Singh, L. O.\nSocial networks reveal cultural behaviour in tool-using dolphins.Nat.\nCommun. 3, 980 (2012).\n9. Croft, D. P., James, R. & Krause, J.Exploring Animal Social Networks\n(Princeton University Press, 2008).\n10. Krause, J.et al. Reality mining of animal social systems.Trends Ecol. Evol.28,\n541–551 (2013).\n11. Gonzalez, M. C., Hidalgo, C. A. & Barabasi, A.-L. Understanding individual\nhuman mobility patterns.Nature 453, 779–782 (2008).\n12. Eagle, N., Pentland, A. & Lazer, D. Inferring friendship network structure by\nusing mobile phone data.Proc. Natl Acad. Sci. USA106, 15274–15278 (2009).\n13. Rutz, C.et al.Automated mapping of social networks in wild birds.Curr. Biol.\n22, R669–R671 (2012).\n14. Rutz, C.et al. Calibrating animal-borne proximity loggers.Methods Ecol. Evol.\ndoi:10.1111/2041-210X.12370 (2015).\n15. Aplin, L. M.et al.Experimentally induced innovations lead to persistent culture\nvia conformity in wild birds.Nature 518, 538–541 (2014).\n16. Fretwell, S. D. & Lucas, H. L. On territorial behavior and other factors\ninﬂuencing habitat distribution in birds.Acta Theor. 19, 16–36 (1969).\n17. de Silva, S., Ranjeewa, A. & Kryazhimskiy, S. The dynamics of social networks\namong female Asian elephants.BMC Ecol. 11, 17 (2011).\n18. Bluff, L. A., Troscianko, J., Weir, A. A. S., Kacelnik, A. & Rutz, C. Tool use by\nwild New Caledonian crowsCorvus moneduloides at natural foraging sites.\nProc. R Soc. B277, 1377–1385 (2010).\n19. Hunt, G. R. Tool use by the New Caledonian crowCorvus moneduloides to\nobtain Cerambycidae from dead wood.Emu 100, 109–114 (2000).\n20. Rutz, C.et al.The ecological signiﬁcance of tool use in New Caledonian crows.\nScience 329, 1523–1526 (2010).\n21. Newman, M. E. Mixing patterns in networks.Phys. Rev. E67, 026126 (2003).\n22. Archie, E. A., Moss, C. J. & Alberts, S. C. The ties that bind: genetic relatedness\npredicts the ﬁssion and fusion of social groups in wild African elephants.Proc.\nR Soc. B273, 513–522 (2006).\n23. Sih, A. & Wey, T. W. Dynamic feedbacks on dynamic networks: on the\nimportance of considering real-time rewiring—comment on Pinter-Wollman\net al. Behav. Ecol. 25, 258–259 (2013).\n24. Fefferman, N. H. & Ng, K. L. How disease models in static networks can fail to\napproximate disease in dynamic networks.Phys. Rev. E76, 031919 (2007).\n25. Holzhaider, J. C.et al. The social structure of New Caledonian crows.Anim.\nBehav. 81, 83–92 (2011).\n26. Hoppitt, W. & Laland, K. N.Social Learning: An Introduction to Mechanisms,\nMethods, and Models(Princeton University Press, 2013).\n27. Coussi-Korbel, S. & Fragaszy, D. M. On the relation between social dynamics\nand social learning.Anim. Behav. 50, 1441–1453 (1995).\n28. Sanz, C. M. & Morgan, D. B. inTool use in Animals: Cognition and Ecology.\n(eds Sanz, C. M., Call, J. & Boesch, C.) Ch. 8 (Cambridge University Press,\n2013).\n29. Van Schaik, C. P. inThe Biology of Traditions: Models and Evidence. (eds\nFragaszy, D. & Perry, S. Ch. 11, 297–328 (Cambridge University Press, 2008).\n30. Hamer, W. H. The Milroy lectures on epidemic disease in England: the\nevidence of variability and of persistency of type.Lancet 167, 655–662 (1906).\n31. Morrell, L. J., Ruxton, G. D. & James, R. The temporal selﬁsh herd: predation\nrisk while aggregations form.Proc. R Soc. B278, 605–612 (2011).\n32. Chen, S.et al. Highly dynamic animal contact network and implications on\ndisease transmission. Sci. Rep. 4, 4472 (2014).\n33. Oh, K. P. & Badyaev, A. V. Structure of social networks in a passerine bird:\nconsequences for sexual selection and the evolution of mating strategies.Am.\nNat. 176, E80–E89 (2010).\n34. Flack, J. C., Girvan, M., de Waal, F. B. M. & Krakauer, D. C. Policing stabilizes\nconstruction of social niches in primates.Nature 439, 426–429 (2006).\n35. Reader, S. M. & Biro, D. Experimental identiﬁcation of social learning in wild\nanimals. Learn Behav. 38, 265–283 (2010).\n36. Rutz, C., Ryder, T. B. & Fleischer, R. C. Restricted gene ﬂow and ﬁne-scale\npopulation structuring in tool using New Caledonian crows.\nNaturwissenschaften 99, 313–320 (2012).\n37. Cavalli-Sforza, L. L. & Wang, S.-Y. Spatial distance and lexical replacement.\nLanguage 62, 38–55 (1986).\n38. MacDougall-Shackleton, E. A. & MacDougall-\nShackleton, S. A. Cultural and\ngenetic evolution in mountain white-crowned sparrows: song dialects are\nassociated with population structure.Evolution 55, 2568–2575 (2001).\n39. Rutz, C., Bluff, L. A., Weir, A. A. S. & Kacelnik, A. Video cameras on wild birds.\nScience 318, 765 (2007).\n40. Kenward, B., Rutz, C., Weir, A. A. S., Chappell, J. & Kacelnik, A. Morphology\nand sexual dimorphism of the New Caledonian crowCorvus moneduloides,\nwith notes on its behaviour and ecology.Ibis 146, 652–660 (2004).\n41. Grifﬁths, R., Double, M. C., Orr, K. & Dawson, R. J. G. A DNA test to sex most\nbirds. Mol. Ecol. 7, 1071–1075 (1998).\n42. Heinrich, B. & Marzluff, J. Age and mouth colour in common ravens.Condor\n94, 549–550 (1992).\n43. Queller, D. C. & Goodnight, K. F. Estimating relatedness using genetic markers.\nEvolution 43, 258–275 (1989).\n44. Goodnight, K. F. & Queller, D. C. Computer software for performing likelihood\ntests of pedigree relationship using genetic markers.Mol. Ecol. 8, 1231–1234\n(1999).\n45. Bridge, E. S.et al. Technology on the move: recent and forthcoming\ninnovations for tracking migratory birds.Bioscience 61, 689–698 (2011).\n46. Rutz, C. & St Clair, J. J. H. The evolutionary origins and ecological context of\ntool use in New Caledonian crows.Behav. Processes 89, 153–165 (2012).\n47. Rutz, C. & Troscianko, J. Programmable, miniature video-loggers for\ndeployment on wild birds and other wildlife.Methods Ecol. Evol.4, 114–122\n(2013).\n48. Watson-Haigh, N. S., O’Neill, C. J. & Kadarmideen, H. N. Proximity loggers:\ndata handling and classiﬁcation for quality control.IEEE Sensors J.12,\n1611–1617 (2012).\n49. Boyland, N., James, R., Mlynski, D., Madden, J. & Croft, D. Spatial proximity\nloggers for recording animal social networks: consequences of inter-logger\nvariation in performance.Behav. Ecol. Sociobiol.67, 1877–1890 (2013).\n50. Drewe, J. A.et al. Performance of proximity loggers in recording intra- and\ninter-species interactions: a laboratory and ﬁeld-based validation study.PLoS\nONE 7, e39068 (2012).\n51. Oksanen, J. F.et al. vegan: Community Ecology Package. R package version\n2.0-10 (2013).\nAcknowledgements\nWe thank: T. Mennesson, J.-E. Lombardet and C. Lambert for facilitating ﬁeldwork; the\nProvince Sud and SEM Mwe Ara for invaluable logistical support in New Caledonia;\nJ. Burt for help adapting the Encounternet hard and software for this project, and for\nassistance with ﬁeldwork; Jayson Bowen for contributions to system development; C.\nAnagnostou and S.M.H. Ismar for ﬁeld assistance; W. Loo and C.G.M. Paxton for help\nwith R code; and J. Troscianko for permission to use his crow photograph. The project\nwas approved by the University of Oxford’s local ethical review committee, carried out\nwith the permission of the DENV, Province Sud, New Caledonia (permits 1341-2010/\nARR/DENV and 1886-2011/ARR/DENV), and funded by the Biotechnology and Bio-\nlogical Sciences Research Council (David Phillips Fellowship to C.R.: grant numbers BB/\nG023913/1 and /2), with contributions for genetic analyses by the Smithsonian Con-\nservation Biology Institute’s Center for Conservation and Evolutionary Genetics.\nAuthor contributions\nC.R. conceived, planned and lead the study, and secured funding; B.O. developed\nEncounternet hard and software, which was adapted for this project by C.R. and J.J.H.S.C.;\nC.R. and J.J.H.S.C. planned and supervised the ﬁeldwork of C.R., J.J.H.S.C. and Z.T.B.;\nNATURE COMMUNICATIONS | DOI: 10.1038/ncomms8197 ARTICLE\nNATURE COMMUNICATIONS| 6:7197 | DOI: 10.1038/ncomms8197 | www.nature.com/naturecommunications 7\n& 2015 Macmillan Publishers Limited. All rights reserved.\nZ.T.B. managed and quality-checked data, with support from R.J., E.M.B., J.J.H.S.C. and\nC.R.; R.J., C.R. and J.J.H.S.C. planned and supervised analyses, which were implemented by\nZ.T.B., E.M.B., R.J., and J.J.H.S.C.; M.B.M., R.J., J.J.H.S.C., Z.T.B. and C.R. conducted\ncalibration analyses; R.C.F. and T.B.R. performed molecular genetic and kinship analyses;\nJ.J.H.S.C. prepared ﬁgures with contributions from Z.T.B. and E.M.B.; J.J.H.S.C. and C.R.\nwrote the manuscript, to which R.J., E.M.B. and T.B.R. contributed sections.\nAdditional information\nSupplementary Information accompanies this paper at http://www.nature.com/\nnaturecommunications\nCompeting ﬁnancial interests:B.O. is exploiting Encounternet technology commer-\ncially. The remaining authors declare no competing ﬁnancial interests.\nReprints and permissioninformation is available online at http://npg.nature.com/\nreprintsandpermissions/\nHow to cite this article:St Clair, J. J. H.et al. Experimental resource pulses inﬂuence\nsocial-network dynamics and the potential for information ﬂow in tool-using crows.\nNat. Commun. 6:7197 doi: 10.1038/ncomms8197 (2015).\nThis work is licensed under a Creative Commons Attribution 4.0\nInternational License. The images or other third party material in this\narticle are included in the article’s Creative Commons license, unless indicated otherwise\nin the credit line; if the material is not included under the Creative Commons license,\nusers will need to obtain permission from the license holder to reproduce the material.\nTo view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/\nARTICLE NATURE COMMUNICATIONS | DOI: 10.1038/ncomms8197\n8 NATURE COMMUNICATIONS| 6:7197 | DOI: 10.1038/ncomms8197 | www.nature.com/naturecommunications\n& 2015 Macmillan Publishers Limited. All rights reserved.",
  "topic": "Information flow",
  "concepts": [
    {
      "name": "Information flow",
      "score": 0.6756916642189026
    },
    {
      "name": "Computer science",
      "score": 0.5952949523925781
    },
    {
      "name": "Resource (disambiguation)",
      "score": 0.5087085366249084
    },
    {
      "name": "Network dynamics",
      "score": 0.4994361400604248
    },
    {
      "name": "Field (mathematics)",
      "score": 0.4971661865711212
    },
    {
      "name": "Social network (sociolinguistics)",
      "score": 0.4742262065410614
    },
    {
      "name": "Population",
      "score": 0.4719376266002655
    },
    {
      "name": "Data science",
      "score": 0.4698311984539032
    },
    {
      "name": "Scale (ratio)",
      "score": 0.4402565658092499
    },
    {
      "name": "Dynamics (music)",
      "score": 0.4233972728252411
    },
    {
      "name": "Ecology",
      "score": 0.33805108070373535
    },
    {
      "name": "Geography",
      "score": 0.2117222547531128
    },
    {
      "name": "Biology",
      "score": 0.20714673399925232
    },
    {
      "name": "Computer network",
      "score": 0.11747381091117859
    },
    {
      "name": "World Wide Web",
      "score": 0.1143656075000763
    },
    {
      "name": "Cartography",
      "score": 0.11385658383369446
    },
    {
      "name": "Physics",
      "score": 0.10557839274406433
    },
    {
      "name": "Mathematics",
      "score": 0.0973290205001831
    },
    {
      "name": "Pure mathematics",
      "score": 0.0
    },
    {
      "name": "Sociology",
      "score": 0.0
    },
    {
      "name": "Demography",
      "score": 0.0
    },
    {
      "name": "Social media",
      "score": 0.0
    },
    {
      "name": "Discrete mathematics",
      "score": 0.0
    },
    {
      "name": "Linguistics",
      "score": 0.0
    },
    {
      "name": "Philosophy",
      "score": 0.0
    },
    {
      "name": "Acoustics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I40120149",
      "name": "University of Oxford",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I51601045",
      "name": "University of Bath",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I16835326",
      "name": "University of St Andrews",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I201448701",
      "name": "University of Washington",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I4210113136",
      "name": "National Zoological Park",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I2800056074",
      "name": "Smithsonian Conservation Biology Institute",
      "country": "US"
    }
  ],
  "cited_by": 58
}