{
  "title": "The Representation of Tool Use in Humans and Monkeys: Common and Uniquely Human Features",
  "url": "https://openalex.org/W1968024137",
  "year": 2009,
  "authors": [
    {
      "id": "https://openalex.org/A1938312807",
      "name": "R. Peeters",
      "affiliations": [
        "Universitair Ziekenhuis Leuven"
      ]
    },
    {
      "id": "https://openalex.org/A2095919132",
      "name": "L. Simone",
      "affiliations": [
        "KU Leuven",
        "University of Parma"
      ]
    },
    {
      "id": "https://openalex.org/A1974796038",
      "name": "K. Nelissen",
      "affiliations": [
        "KU Leuven"
      ]
    },
    {
      "id": "https://openalex.org/A2790866884",
      "name": "M Fabbri Destro",
      "affiliations": [
        "University of Parma"
      ]
    },
    {
      "id": "https://openalex.org/A3052053188",
      "name": "W. Vanduffel",
      "affiliations": [
        "KU Leuven",
        "Athinoula A. Martinos Center for Biomedical Imaging"
      ]
    },
    {
      "id": "https://openalex.org/A2437384506",
      "name": "Rizzolatti G",
      "affiliations": [
        "University of Parma"
      ]
    },
    {
      "id": "https://openalex.org/A2212968057",
      "name": "G. A. Orban",
      "affiliations": [
        "KU Leuven"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2091879643",
    "https://openalex.org/W1983041910",
    "https://openalex.org/W2052148080",
    "https://openalex.org/W1983261403",
    "https://openalex.org/W2089770764",
    "https://openalex.org/W1970287153",
    "https://openalex.org/W2131471636",
    "https://openalex.org/W2006535382",
    "https://openalex.org/W2077116199",
    "https://openalex.org/W1928736390",
    "https://openalex.org/W2135331973",
    "https://openalex.org/W2103364093",
    "https://openalex.org/W2074102722",
    "https://openalex.org/W2010266246",
    "https://openalex.org/W2165168955",
    "https://openalex.org/W1854011899",
    "https://openalex.org/W1991032987",
    "https://openalex.org/W2110884735",
    "https://openalex.org/W2084336412",
    "https://openalex.org/W2156130986",
    "https://openalex.org/W2059982399",
    "https://openalex.org/W2116649573",
    "https://openalex.org/W2057957247",
    "https://openalex.org/W2102453924",
    "https://openalex.org/W1976135595",
    "https://openalex.org/W2047861270",
    "https://openalex.org/W1988082972",
    "https://openalex.org/W2106344985",
    "https://openalex.org/W2157297401",
    "https://openalex.org/W1965248225",
    "https://openalex.org/W2109891996",
    "https://openalex.org/W2119233587",
    "https://openalex.org/W4239598308",
    "https://openalex.org/W2168620332",
    "https://openalex.org/W2074660036",
    "https://openalex.org/W2076576536",
    "https://openalex.org/W2152670257",
    "https://openalex.org/W2073833650",
    "https://openalex.org/W1978154168",
    "https://openalex.org/W2131354767",
    "https://openalex.org/W2113589953",
    "https://openalex.org/W2160349805",
    "https://openalex.org/W1975752615",
    "https://openalex.org/W2011636436",
    "https://openalex.org/W2131171772",
    "https://openalex.org/W2005915081",
    "https://openalex.org/W2129553141",
    "https://openalex.org/W2156051121",
    "https://openalex.org/W2144573398",
    "https://openalex.org/W2040374424",
    "https://openalex.org/W2013182144",
    "https://openalex.org/W1984912141",
    "https://openalex.org/W2034620111",
    "https://openalex.org/W2056658067",
    "https://openalex.org/W2074925586",
    "https://openalex.org/W2002430082",
    "https://openalex.org/W2023209753",
    "https://openalex.org/W2118450042",
    "https://openalex.org/W3022532439",
    "https://openalex.org/W1542177381",
    "https://openalex.org/W2148729920",
    "https://openalex.org/W2166170813",
    "https://openalex.org/W2036216439",
    "https://openalex.org/W2017399141",
    "https://openalex.org/W1982679729",
    "https://openalex.org/W2137383485",
    "https://openalex.org/W2106266851",
    "https://openalex.org/W2171713723",
    "https://openalex.org/W2102133930",
    "https://openalex.org/W2006675081",
    "https://openalex.org/W2007991423",
    "https://openalex.org/W2092508545",
    "https://openalex.org/W2060618445",
    "https://openalex.org/W2145789764",
    "https://openalex.org/W2131697587",
    "https://openalex.org/W2069453047",
    "https://openalex.org/W2138173706",
    "https://openalex.org/W2110344324",
    "https://openalex.org/W2053212631",
    "https://openalex.org/W2017482818",
    "https://openalex.org/W1795671969",
    "https://openalex.org/W1556223197",
    "https://openalex.org/W573229406",
    "https://openalex.org/W2079238969",
    "https://openalex.org/W3127623214",
    "https://openalex.org/W2013158677",
    "https://openalex.org/W1631057552",
    "https://openalex.org/W3129465862"
  ],
  "abstract": "Though other species of primates also use tools, humans appear unique in their capacity to understand the causal relationship between tools and the result of their use. In a comparative fMRI study, we scanned a large cohort of human volunteers and untrained monkeys, as well as two monkeys trained to use tools, while they observed hand actions and actions performed using simple tools. In both species, the observation of an action, regardless of how performed, activated occipitotemporal, intraparietal, and ventral premotor cortex, bilaterally. In humans, the observation of actions done with simple tools yielded an additional, specific activation of a rostral sector of the left inferior parietal lobule (IPL). This latter site was considered human-specific, as it was not observed in monkey IPL for any of the tool videos presented, even after monkeys had become proficient in using a rake or pliers through extensive training. In conclusion, while the observation of a grasping hand activated similar regions in humans and monkeys, an additional specific sector of IPL devoted to tool use has evolved in Homo sapiens , although tool-specific neurons might reside in the monkey grasping regions. These results shed new light on the changes of the hominid brain during evolution.",
  "full_text": "Behavioral/Systems/Cognitive\nThe Representation of Tool Use in Humans and Monkeys:\nCommon and Uniquely Human Features\nR. Peeters,1* L. Simone,2,3* K. Nelissen,2* M. Fabbri-Destro,3 W. Vanduffel,2,4 G. Rizzolatti,3 and G. A. Orban2\n1Division of Radiology, Universitair Ziekenhuis Gasthuisberg, and2Laboratorium voor Neuro- en Psychofysiologie, Katholieke Universiteit Leuven Medical\nSchool, 3000 Leuven, Belgium,3Departimento di Neuroscienze, Universita di Parma, 43100 Parma, Italy, and4Athinoula A. Martinos Center for Biomedical\nImaging, Charlestown, Massachusetts 02129\nThough other species of primates also use tools, humans appear unique in their capacity to understand the causal relationship between\ntools and the result of their use. In a comparative fMRI study, we scanned a large cohort of human volunteers and untrained monkeys, as\nwell as two monkeys trained to use tools, while they observed hand actions and actions performed using simple tools. In both species, the\nobservation of an action, regardless of how performed, activated occipitotemporal, intraparietal, and ventral premotor cortex, bilaterally.\nIn humans, the observation of actions done with simple tools yielded an additional, specific activation of a rostral sector of the left inferior\nparietal lobule (IPL). This latter site was considered human-specific, as it was not observed in monkey IPL for any of the tool videos\npresented, even after monkeys had become proficient in using a rake or pliers through extensive training. In conclusion, while the\nobservation of a grasping hand activated similar regions in humans and monkeys, an additional specific sector of IPL devoted to tool use\nhas evolved inHomo sapiens,although tool-specific neurons might reside in the monkey grasping regions. These results shed new light on\nthe changes of the hominid brain during evolution.\nIntroduction\nTools are mechanical implements that allow individuals to\nachieve goals that otherwise would be difficult or impossible to\nreach. Tool use has long been considered a uniquely human char-\nacteristic (Oakley, 1956), dating back 2.5 Mi years (Ambrose,\n2001). However, there is now general agreement that chimpan-\nzees also use tools, in captivity (Kohler, 1927) as well as in the wild\n(Beck, 1980; Whiten et al., 1999). Except for Cebus monkeys\n(Visalberghi and Trinca, 1989; Moura and Lee, 2004), most mon-\nkeys, including macaques, vervets, tamarins, marmosets, and le-\nmurs, use tools only after training (Natale et al., 1988; Hauser,\n1997; Santos et al., 2005, 2006; Spaulding and Hauser, 2005).\nWhile it is clear that the use of tools by humans reflects an under-\nstanding of the causal relationship between the tool and the ac-\ntion goals (Johnson-Frey, 2003), this is far less true for apes. The\navailable evidence (Visalberghi and Limongelli, 1994; Povinelli,\n2000; Mulcahy and Call, 2006; Martin-Ordas et al., 2008) indi-\ncates that chimpanzees may have some causal understanding of a\ntrap, for instance [introduced by Visalberghi and Limongelli\n(1994)], but lack the ability to establish analogical relationships\nbetween perceptually disparate but functionally equivalent tasks\n(Martin-Ordas et al., 2008; Penn et al., 2008).\nIs this capacity to understand tools mediated by an evolution-\narily new neural substrate peculiar to humans? Since primates in\ngeneral exhibit the same level of understanding of tool use,\nwhether they use them spontaneously or only after training, it has\nbeen suggested that primates rely on domain-general rather than\ndomain-specific knowledge (Santos et al., 2006). Only humans\nshould therefore possess specialized neuronal mechanisms allow-\ning them to understand the functional properties of tools, a spe-\ncies difference that should apply to all tools, both simple and\ncomplex. On the other hand, the finding that the training induces\nthe appearance of bimodal visuo-tactile properties in parietal\nneurons (Iriki et al., 1996), has led to the suggestion that the use\nof simple tools might rely on similar mechanisms in both species\n(Maravita and Iriki, 2004). According to this hypothesis only the\nuse of more complex tools requires special neuronal mechanisms\ntypical of humans (Johnson-Frey, 2004; Frey, 2008). Thus it is\nunclear whether or not the neuronal mechanisms involved in the\nuse of simple tools, such as a rake, are similar in humans and\nmonkeys. The present series of experiments was designed to de-\ncide between these two alternatives.\nUnlike previous studies that used static images of tools as\nstimuli (for review, see Lewis, 2006), we used video-clips present-\ning actions performed with different implements. Indeed dy-\nnamic stimuli seemed more appropriate to the study of the\nmechanisms involved in comprehending the functional proper-\nties of tools than mere static images. The stimuli were presented\nto both humans and monkeys while being scanned and their\nrespective functional activation patterns were compared. Because\nReceived April 30, 2009; revised Aug. 5, 2009; accepted Aug. 6, 2009.\nThis work was supported by Grants Neurobotics (European Union), Fonds Wettenschappelijk onderzoek G151.04,\nGOA 2005/18, EF/05/014, IUAP 6/29, and ASI and by a grant from Ministero dell’Istruzione, dell’Universita` e della\nRicerca. The Laboratoire Guerbet (Roissy, France) provided the contrast agent (Sinerem). We are indebted to C.\nFransen, A. Coeman, P. Kayenberg, G. Meulemans, W. Depuydt, and M. Depaep for help with the experiments and to\nS. Raiguel, R. Vogels, R. Vandenberghe, D. Van Essen, G. Humphreys, B. Blin, and J. Call for comments on an earlier\nmanuscript version.\n*R.P., L.S., and K.N. contributed equally to this work.\nCorrespondence should be addressed to G. A. Orban, Laboratorium voor Neuro- en Psychofysiologie,\nKatholieke Universiteit Leuven Medical School, Herestraat 49, bus 1021, 3000 Leuven, Belgium. E-mail:\nguy.orban@med.kuleuven.be.\nDOI:10.1523/JNEUROSCI.2040-09.2009\nCopyright © 2009 Society for Neuroscience 0270-6474/09/2911523-17$15.00/0\nThe Journal of Neuroscience, September 16, 2009• 29(37):11523–11539 • 11523\nnaive monkeys differ from humans not only as a species, but also\nin their expertise with tools, in the final experiment we scanned\nmonkeys that were able to use two tools proficiently, a rake and\npliers.\nMaterials and Methods\nSubjects. Forty-seven right-handed human volunteers (27 of whom were\nfemales) with a mean age of 23.7/H110064.0 years (range 18 –32 years) partic-\nipated in the study. Experiment 1 was performed on 20 volunteers (mean\nage, 22.4 /H110062.8 years, 12 females). Twenty-one volunteers (mean age,\n24.6 /H110063.9 years; 13 females), 8 of whom had also participated in exper-\niment 1, took part in experiment 2. Experiment 3 was performed on 8\nvolunteers (mean age, 21.6/H110064.1 years; 5 females), of whom 6 were naive\nindividuals, while 2 also had participated in Experiment 2. Eight volun-\nteers (mean age 24.4/H110065 years; 3 females) participated in experiment 4.\nAll of these had also taken part in experiment 2. Six volunteers partici-\npated in control experiment 1 (mean age, 23.3/H110063.4 years; 4 females) 3 of\nwhom were naive individuals, while 3 had also participated in experi-\nment 1 and/or 2. Finally, 7 volunteers were scanned in control experi-\nment 2 (mean age, 24.7/H110064.7 years; 4 females). Of these, 5 were naive,\nwhile 2 had participated in experiments 1 and/or 2.\nNo participant reported a history of neurological disease or was taking\npsycho- or vasoactive medication. Participants were informed about the\nexperimental procedures and provided written informed consent. The\nstudy design was approved by the local Ethics Committee of Biomedical\nResearch at K. U. Leuven and performed in accordance with the ethical\nstandards laid down in the 1964 Declaration of Helsinki. Subjects lay in a\nsupine position and viewed the screen trough a 45 degrees tilted mirror.\nThey were instructed to maintain fixation during scanning. The eye po-\nsition was monitored at 60 Hz during all fMRI scanning sessions using\nthe ASL 5000/LRO eye tracker system positioned at the back of the mag-\nnet (Applied Science Laboratories) to track pupil position and corneal\nreflection. These eye traces were analyzed to determine the number of\nsaccades per minute. Across all experiments participants averaged 8 –12\nsaccades per minute in the various conditions. In no experiment did this\nnumber, averaged over subjects, differ significantly among conditions\n( p /H110220.05).\nFive (M1, M5, M6, M13, M14, one female) rhesus monkeys (3– 6 kg,\n4 –7 years of age) were also scanned. Two monkeys participated in exper-\niment 5 (M1, M5), three in experiments 6 – 8 (M6, M13, M14) and two in\nexperiment 9 (M13, M14). These animals had participated only in exper-\niments in which they were passive with respect to visual (M1, M5, M6) or\nto visual and auditory stimuli (M13, M14). Hence they were trained only\non the fixation task and the high acuity task (Vanduffel et al., 2001) used\nto calibrate the eye movement recordings. All animal care and experi-\nmental procedures met the national and European guidelines and were\napproved by the ethical committee of the K. U. Leuven Medical School.\nThe details of the surgical procedures, training of monkeys, image acqui-\nsition, eye monitoring and statistical analysis of monkeys scans have been\ndescribed previously (Vanduffel et al., 2001; Fize et al., 2003; Nelissen et\nal., 2005), and will be described only briefly here. Monkeys sat in a sphinx\nposition in a plastic monkey chair directly facing the screen. A plastic\nheadpost is attached to the skull using C&B Metabond adhesive cement\n(Parkell) together with Palacos R/H11001G bone cement and/H1101115 ceramic\nscrews (Thomas Recording). Throughout the training and testing ses-\nsions, the monkey’s head is restrained by attaching the implanted head-\npost to the magnet compatible monkey chair (for details, see Vanduffel et\nal., 2001). Thus, during the tests, the monkeys were able to move all body\nparts except their head. It is important to note, however, that body move-\nments are usually infrequent when the monkeys perform a task, be it a\nfixation task, during the scanning. A receive-only surface coil was posi-\ntioned just above the head. During training the monkeys were required to\nmaintain fixation within a 2/H110032° window centered on a red dot (0.35/H11003\n0.35°) in the center of the screen. Eye position was monitored at 60 Hz\nthrough pupil position and corneal reflection. During scanning the fix-\nation window was slightly elongated in the vertical direction to 3°, to\naccommodate an occasional artifact on the vertical eye trace induced by\nthe scanning sequence. The monkeys were rewarded (fruit juice) for\nmaintaining their gaze within the fixation window for long periods (up to\n6 s), while stimuli were projected in the background. With this strategy\nmonkeys made 7–20 saccades per minute, each monkey exhibiting a\nrelatively stable number of saccades over the different sessions/runs:\n7/min for M13, 9/min for M6, 11/min for M14, 13/min for M1 and\n20/min for M5. Thus most monkeys were close to the human average in\nthis regard and made about one saccade every 6 s. In no experiment was\nthe number of saccades made by individual subjects significantly differ-\nent between the experimental conditions.\nBefore each scanning session, a contrast agent, monocrystalline iron\noxide nanoparticle (MION), was injected into the monkey femoral/sa-\nFigure 1. Results of experiment 1.A, Cortical regions activated (colored red to yellow) by the\nobservation of hand grasping actions relative to their static controls, rendered on lateral views\nof the standard (MNI) human brain.B, Cortical regions activated in the contrast observation of\nmechanical hand actions compared with their static control.C, Cortical regions more active\nduring the observation of grasping performed with a mechanical implement than during the\nobservation of the same action by a hand, each relative to its static control. All three contrasts:\nrandom effects analysis,n /H1100520, p /H110210.001 uncorrected. Inclusive masking of the contrasts in\nA and B with the contrast action observation minus fixation, as used in the monkey (Fig. 7) did\nnot alter the activation pattern. The purple arrow indicates the activation in aSMG. Insets show\nframes from hand actions and mechanical arm actions.\n11524 • J. Neurosci., September 16, 2009• 29(37):11523–11539 Peeters et al. • Observation of Tool Use in Humans and Monkeys\nphenous vein (4 –11 mg/kg). In later experiments the same contrast\nagent, produced under a different name (Sinerem) was used. Use of the\ncontrast agent improved both the contrast-noise ratio (by approximately\nfivefold) and the spatial selectivity of the magnetic resonance (MR) signal\nchanges, compared with blood oxygenation level-dependent (BOLD)\nmeasurements (Vanduffel et al., 2001; Leite et al., 2002). While BOLD\nmeasurements depend on blood volume, blood flow, and oxygen extraction,\nMION measurements depend only on blood volume (Mandeville and\nMarota, 1999). For the sake of clarity, the polarity of the MION MR signal\nchanges, which are negative for increased blood volumes, was inverted.\nVisual stimuli.Visual stimuli were projected onto a transparent screen in\nfront of the subject using a Barco 6400i (for humans) or 6300 (for monkeys)\nliquid crystal display projector (1024/H11003768 pixels; 60 Hz). Optical path\nlength between the eyes and the stimulus measured 36 cm (54 cm for mon-\nkeys). All tests included a simple fixation condition as a baseline condition in\nwhich only the fixation target (red dot) was shown on an empty screen.\nIn experiment 1, we displayed videos (13 by 11.5° in humans, 16 by 13°\nin monkeys) showing either a human hand grasping objects (“hand ac-\ntion” supplemental Movie S1, available at www.jneurosci.org as supple-\nmental material) or a mechanical hand grasping the same objects\n(“mechanical hand action” supplemental Movie S2, available at www.\njneurosci.org as supplemental material). A male, female or a mechanical\nhand grasped and picked up a candy (precision grip) or a ball (whole\nhand grasp). Themechanical hand (three fingers, Fig. 1B), was moved\ntoward to object by a human operator (invisible), while the grasping\nwas computer controlled. Our mechanical hand action video is thus\nclearly different from that of (Tai et al., 2004). This description sup-\nplements that of (Nelissen et al., 2005) where the same videos were\ndescribed as robot hand action. One action cycle (grasping and pick-\ning up) lasted 3.3 s and 7 (11 in monkey) randomly selected cycles\nwere presented in a block of 24 s (36 s in monkey). Static single frames\n(24 s duration, 36 s in monkey) and scrambled video sequences (sup-\nplemental Movie S3, available at www.jneurosci.org as supplemental\nmaterial), obtained by phase scrambling each of the frames of the\nsequence, were used as controls. Human hand and mechanical hand\nruns were tested separately and typically included action, static,\nscramble and fixation repeated three times (twice in the monkey),\nwith 3 different runs/orders of conditions.\nIn experiment 2, we presented within the same run videos (same size as\nin experiment 1) showing either a human hand grasping objects (same as\nin experiment 1, goal-directed action) or a screwdriver held by a human\nhand and used to pick up objects (supplemental Movie S4, available at\nwww.jneurosci.org as supplemental material). As a control, a static (re-\nfreshed each 3.3 s) single frame of the action videos was used. A typical\nTable 1. Activation sites for observation hand action (experiment 1)\nMNI coordinates t value\nxyz Hand action—static hand Hand action—scrambled Shape localizer Motion localizer\nL MT/ V5 /H1100244 /H1100274 2 9.00 10.51 27.06 20.24\nL MTG /H1100262 /H1100260 6 6.04 6.94 n.s. (4.44)\nL ITG /H1100248 /H1100252 /H1100220 6.31 11.09 16.96 n.s.\nR MT/V5 50 /H1100268 2 7.59 6.87 18.52 23.17\nR STS 56 /H1100252 12 6.10 6.95 n.s. (5.07)\nR STG 64 /H1100242 24 5.10 5.17 n.s. n.s.\nR OTS 60 /H1100252 /H110028 5.65 6.06 7.24 (4.03)\nR ITG 48 /H1100252 /H1100224 7.67 8.53 15.78 n.s.\nR Ant ITG 40 /H1100236 /H1100228 5.47 5.48 14.56 n.s.\nL VIPS /H1100232 /H1100280 24 5.65 7.41 10.37 8.28\nL SPL /H1100218 /H1100268 58 5.39 7.02 9.42 (4.89)\nL DIPSM /H1100232 /H1100256 62 8.50 9.73 13.28 11.59\nL DIPSA /H1100242 /H1100248 62 8.24 10.59 10.44 8.30\nL phAIP /H1100238 /H1100232 42 5.37 5.84 5.81 n.s.\nR DIPSM 28 /H1100254 58 6.21 7.25 10.40 7.18\nL Pre CG /H1100228 /H1100210 56 5.68 5.13 n.s. 6.41\nL Pre CG /H1100236 /H110024 54 5.53 6.11 n.s. (4.77)\nR Pre CG 38 2 50 6.24 5.46 n.s. n.s.\nL Cer /H110026 /H1100280 /H1100236 7.37 6.91 6.11 (4.81)\nR Cer 6 /H1100280 /H1100238 6.52 6.93 (4.56) (3.97)\nNumbers indicate significant (p /H110210.05, corrected)t values; numbers between parentheses indicatet values reachingp /H110210.001, uncorrected, but notp /H110210.05, corrected. n.s., Nonsignificant; L, left; R, right.\nTable 2. Interaction sites for observation of mechanical hand action (experiment 1)\nNumber vox (conj. 0.001)\nMNI coordinates\nt value\nMech. hand action— human hand action\n(relat. static control)\nMech. hand action—static\nmech. hand Shape localizer Motion localizerxyz\nL IOG 151 /H1100242 /H1100288 /H110024 4.37 5.81 30.91 (3.89)\nL V3A* 151 /H1100230 /H1100296 18 3.69 6.96 15.38 12.80\nL IOG 151 /H1100250 /H1100278 /H110022 4.20 14.28 36.19 17.68\nL Fus post 383 /H1100226 /H1100284 /H1100216 4.96 10.24 (4.27) 9.93\nL Fus Mid 34 /H1100226 /H1100256 /H1100214 4.20 6.51 10.38 n.s.\nR MT/V5 404 50 /H1100270 /H110022 3.80 12.27 29.24 23.17\nR IOG 404 46 /H1100286 0 6.42 10.30 36.39 7.07\nR Fus post 110 24 /H1100286 /H1100218 4.07 7.52 n.s. 8.90\nR Fus post 110 30 /H1100270 /H1100220 3.85 7.37 10.26 (4.82)\nR DIPSM 4 30 /H1100252 70 3.43 8.34 6.67 9.25\nL SPL 25 /H1100242 /H1100246 64 4.08 13.25 8.56 7.30\nL IPL BA40 117 /H1100258 /H1100230 46 3.80 7.92 n.s. n.s.\nL postcent S 117 /H1100260 /H1100218 28 3.89 7.21 n.s. n.s.\nNumbers indicate significantt values for interaction (p /H110210.001, uncorrected); for other numbers, see Table 1. n.s., Nonsignificant; L, left; R, right; post, posterior; postcentr, postcentral; vox, voxels; relat, relative to.\nPeeters et al.• Observation of Tool Use in Humans and Monkeys J. Neurosci., September 16, 2009 • 29(37):11523–11539 • 11525\nhand and tool action run included actions performed with a screwdriver,\ngoal-directed hand actions, other actions irrelevant to the present\nexperiment, their respective static controls, and fixation(Nelissen et\nal., 2005), with the same sequence repeated twice (once for the monkey)\nand 5 different runs/order of conditions.\nIn experiments 3 and 4 we used the same 2/H110032 factorial design (tool\naction, hand action and their static controls) as in experiment 2, but\nreplaced the screwdriver by a rake (experiment 3, supplemental Movie\nS5, available at www.jneurosci.org as supplemental material) or pliers\n(experiment 4, supplemental Movie S6, available at www.jneurosci.org as\nsupplemental material) and the corresponding hand actions consisted of\ndragging (experiment 3) or grasping actions (experiment 4).\nIn one control experiment we included 2 factorial designs, one with the\nscrewdriver presented in the standard manner i.e., with the action per-\nformed mainly in the right visual field, the second with the videos mir-\nrored so that the actions were now presented mainly in the left visual\nfield. In the second control experiment, the four conditions of the facto-\nrial design using the screwdriver were extended to include two conditions\nin which the hand or the hand holding the screwdriver were translating\nwithin the display (supplemental Movies S7, 8, available at www.\njneurosci.org as supplemental material) rather than appearing as station-\nary, plus two additional conditions in which the hand and screwdriver\nactions were presented without the object, goal of the action.\nIn addition for 40 subjects, 23 of whom participated in one of the four\nexperiments or one of the two control experiments, we presented a time\nseries including moving and static randomly textured patterns (7° diam-\neter) conditions to localize hMT/V5/H11001and other motion-sensitive re-\ngions (Sunaert et al., 1999) and two time series containing intact and\nscrambled grayscale images and drawings of objects along with fixation\nas conditions to localize shape-sensitive regions (Kourtzi and Kanwisher,\n2000; Denys et al., 2004a).\nIn experiments 5– 8, the exact stimuli presented to humans in experi-\nments 1– 4 (grasping performed by a mechanical hand, using a screw-\ndriver to seize objects, a rake to drag objects, and pliers to seize objects\nand corresponding hand actions) were presented to monkey subjects\nwhich were scanned in several daily sessions. Two monkeys (M1, M5)\nparticipated in experiment 5 in which, as for humans, hand action and\nmechanical arm videos were tested in separate runs. Three monkeys (M6,\nM13, M14) participated in experiments 6 – 8. In these experiments hand\nand tool actions were presented in the same runs and runs with different\ntools were interleaved in the daily sessions. Finally, two monkeys (M13,\nM14), which had participated in experiments 6 – 8, were trained (see\nbelow) to use the rake and, after a series of scanning sessions, were also\ntrained to use pliers and scanned a third time. In these scanning sessions\nruns with different tools were again interleaved.\nTraining of monkeys to use tools (experiment 9).Monkeys were trained\nto use two tools: rake and pliers. Both tools were custom built. Both\nwere 25 cm in length; the rake-head was 10 cm wide and the pliers\nopened to 5 cm. For the training sessions, monkeys sat in an MR-\ncompatible primate chair positioned on a table, on which the tool and\nthe pieces of food were presented. These pieces were located 34 – 40\ncm from the shoulders of the monkey, out of reach with its hands. The\nmonkeys were trained to use the tools with their right hands. After a famil-\niarization phase the training proceeded in steps: touching the tool, lifting the\ntool, directing the tool toward the food position, and retrieving of the food by\n4\nFigure 2. The left hemisphere interaction sites in the four experiments.A, Cortical regions\nmore active (colored red to yellow) during the observation of grasping performed with a mechanical\nimplement than during the observation of the same action done by hand, each relative to its static\ncontrol, rendered on lateral views of the left hemisphere of standard (MNI) human brain (experiment\n1, n /H1100520, random effects analysis).B, Cortical regions active in the contrast observation of screw-\ndriver versus hand actions, relative to their static controls (experiment 2,n /H1100521, random effects\nanalysis).C, SPMs showing significant voxels in the interaction observation of rake vs hand actions\n(experiment 3,n /H110058, fixed effects analysis), relative to their static control.D, Same for experiment 4\n(observation of actions with pliers,n /H110058, fixed effects). In all four interactions threshold isp /H110210.001\nuncorrected.E, Conjunction of the interactions in the four experiments; threshold for each interaction\np /H110210.005 uncorrected, yielding the core of aSMG. Purple arrows indicate left aSMG.\n11526 • J. Neurosci., September 16, 2009• 29(37):11523–11539 Peeters et al. • Observation of Tool Use in Humans and Monkeys\nretraction of the arm. While training the monkey to use the rake was rela-\ntively easy, the use of pliers required more training, largely because the pres-\nsure needed to close the pliers had to be applied at the right moment and\nmaintained until the food was retrieved.\nTool use can be considered as a behavioral\nchain, i.e., a series of related motor acts each of\nwhich provides the cue for the next one in the\nseries, with the last motor act producing rein-\nforcement. Training was therefore performed\nby applying a procedure that reinforced the\nsuccessive elements of the chosen behavior.\nThe experimenter started with the first step\nof the chain: training the monkey to touch\nthe tool. Once the monkey could perform\nthat step satisfactorily, the experimenter\ntrained the monkeys to perform the next mo-\ntor acts (handling and lifting the tool) and\nreinforced their effort. When the monkeys\nmastered the succession of these elements,\nthe experimenter added the final elements in\nthe chain.\nTo assess the level of skill reached by the\nmonkeys to use the rake and the pliers, a\nseries of behavioral tests and an analysis of\nthe movement kinematics were performed at\nthe end of each of these two training phases.\nThe monkeys were tested in three consecu-\ntive sessions of 75 trials. Each trial started\nwith the food pellet placed on the table out of\nanimal’s reach, while the tool was placed\nwithin reach. The food pellets were placed in\nfive different positions: one directly in front\nof the monkey, the other four at angles of 45°\nor 22, 5° from the central position (Ishibashi\net al., 2000). The tools were placed in two\ndifferent positions: in front of the monkey\nwhen the food was presented laterally and on\nhis right side when the food was presented in\nfront of it. The trials corresponding to the\nfive food positions were presented in a ran-\ndom order, and 15 trials of each type were\nadministered. In any of the five different\nfood positions the monkey had to move its\nelbow and forearm in a lateral direction, to\nobtain the food reward. Each trial started\nwhen the monkey made contact with the tool\nand finished when the food was retrieved,\nwhen the monkey stopped trying to retrieve\nthe food, or when the food had been dis-\nplaced by the monkey to a point beyond the\nreach with the tool. After food and tool\nplacement, the monkey had 30 s to use the\ntool, otherwise the trial would be considered\nincorrect. Although after training the monkeys completed these stan-\ndard trials in much shorter time, a constant time criterion was main-\ntained during training, testing in standard trials, and testing in special\nFigure 3. The anterior supramarginal gyrus interaction site. A, Flattened view of the left hemisphere (human PALS\natlas). Green areas show activations in the contrast hand action minus static control (p /H110210.001, experiment 1, same data\nas Fig. 1A). Blue and red outlines show the regions where the interactions tool versus hand, relative to their controls, were\nsignificant ( p /H110210.001) in experiments 1 and 2 respectively (same data as Fig. 2A,B). White lines indicate areas V1-3,\nyellow dot hMT/V5/H11001. B, Enlarged view of the data shown inside the black square inA. Only interaction sites in the vicinity\nof anterior SMG are shown. Brown and yellow outlines show the regions where the interactions tool actions versus hand\nactions, relative to their controls, were significant (p /H110210.001) in experiments 3 and 4 respectively. Blue and red outlines\nas inA. Black voxels indicate the conjunction of the four interactions (eachp /H110210.005). Blue ellipses indicate from left to\nright putative human AIP (phAIP), the dorsal IPS anterior (DIPSA) region and the dorsal IPS medial (DIPSM) region.C–F ,\nActivity profiles of the core of the left aSMG region (black voxels inB) in experiments 1– 4. All eight pairedt tests were\nsignificant (see Materials and Methods):p /H110210.0001 for both tests inC (interaction and direct comparison of actions),p /H11021\n0.001 for both tests inD, p /H110210.01 for both tests inE and p /H110210.05 for both tests inF.\nTable 3. Interaction sites for observation of screwdriver action (experiment 2)\nNumber vox\n(conj. 0.0001)\nNumber vox\n(conj. 0.001)\nMNI coordinates\nt value\nAction screwdriver— hand action\n(relat. static control)\nScrewdriver action—static\nscrewdriver\nShape\nlocalizer\nMotion\nlocalizerxyz\nL IOG 1 13 /H1100244 /H1100282 /H110024 4.31 7.71 13.65 8.40\nR IOG 4 48 /H1100274 /H110028 3.62 6.60 14.08 9.12\nR ITG post 4 52 42 /H1100262 /H110026 4.28 7.59 9.08 7.14\nL DIPSM 21 /H1100232 /H1100258 58 3.73 6.77 9.95 6.44\nL DIPSA 18 539 /H1100242 /H1100242 56 4.96 9.21 7.30 5.21\nL IFG 15 /H1100254 4 30 3.64 7.2 5.16 (3.56)\nL IPL BA40 76 539 /H1100252 /H1100226 34 5.04 9.08 (4.09) (3.37)\nL postcent S 76 539 /H1100260 /H1100220 26 4.65 8.94 n.s. n.s.\nNumbers of voxels in the activation site are indicated for two thresholds of the interaction.p /H110210.001 andp /H110210.0001, uncorrected;t values as in Table 2. n.s., Nonsignificant; L, left; R, right; post, posterior; postcentr, postcentral;\nconj, conjunction; relat, relative to; vox, voxels.\nPeeters et al.• Observation of Tool Use in Humans and Monkeys J. Neurosci., September 16, 2009 • 29(37):11523–11539 • 11527\ntrials (see below). The training lasted 3– 4\nweeks for the rake and 4 (M13) to 6 (M14)\nweeks for the pliers. The interval between the\ntwo training epochs lasted 1 month. Mon-\nkeys reached /H1101195% correct in the standard\ntrials, except M14 for the pliers (76%).\nIn addition to these standard trials, two\nother types of trials were administered dur-\ning testing. First, some irrelevant ring- or\nspherically shaped objects were presented at\nrandom 10 times in the course of the session.\nSince monkeys immediately stopped trying\nto use these objects, this testing was per-\nformed only in the first session. Second in 30\ntrials, interspersed among the standard tri-\nals, the tool was presented to the monkey not\nin its standard upright position but rotated\n90° in either direction or turned 180°. In the\nfirst session, the monkeys failed to grasp the\ntool in these trials, but from the second ses-\nsion on they understood that they had to\nturn the tool to retrieve the food pellet and\nwere able to so in the 30 s allowed. Therefore,\nwe report the percentage correct for the later\nsessions. For the rake, the percent correct\nwas 95% and 85% for M13 and M14 respec-\ntively, but for the pliers only M13 reached\n95% correct, whereas M14 never learned to\nuse the rotated pliers.\nTo analyze the kinematics of the actions of\nthe monkeys when using tools, all trials of the\nthree testing sessions were captured by a digital\nvideo camera and markers attached to the\ntools: one at middle of the rake-head and two\non the arms of the pliers 3 cm from the tip. The\nimages thus recorded were sent to a personal\ncomputer, where a two dimensional motion\nanalysis of the trajectories and the speed along\nthese trajectories was performed.\nfMRI scanning.The human MRI images were acquired in a 3-T Intera\nMR scanner (Philips, Best), using a 6 element SENSE head coil (MRI\nDevices). A functional time series consisted of whole brain BOLD\nweighted field-echo echoplanar images (FE-EPI) with TR/TE/H110053000/30\nms, field of view/H11005200 mm, acquisition matrix/H1100580 /H1100380 (reconstructed\nto 128/H11003128), SENSE reduction factor/H110052, slice thickness/H110052.5 mm,\ninterslice gap /H110050.3 mm, acquiring 50 horizontal slices covering the\nentire brain. In each experiment, 5–9 time series (runs) were acquired per\nsubject in a single session, yielding a total of 1920 volumes/condition in\nexperiment 1, 2688 volumes/condition in experiment 2, 576 volumes/\ncondition inexperiment 3, 1152 volumes/condition in experiment 4,\n384 and 504 volumes/condition in the control experiments, whereas\n4320 and 4260 volumes/condition were acquired in the shape local-\nizer and the motion localizer tests respectively. At the end of each\nscanning session a three-dimensional high resolution T1-weighted\nanatomical image [repetition time (TR)/echo time (TE) /H110059.68/4.6\nms, inversion time /H110051100 ms, field of view/H11005250 mm, matrix /H11005\n256 /H11003256, slice thickness /H110051.2 mm, 182 slices, SENSE factor/H110052)\nwas acquired.\nThe monkey MRI images were acquired in a 1.5-T Sonata MR scanner\n(Siemens, Erlangen, Germany) using a surface coil. Each functional time\nseries consisted of gradient-echo echoplanar whole-brain images (1.5 T;\nTR, 2.4 s; TE, 27 ms; 32 sagittal slices, 2/H110032 /H110032 mm voxels). In total, 2160\nvolumes/condition were analyzed in experiment 5 and 1440 volumes/\ncondition in experiments 6 – 8. For each subject, a T1-weighted anatom-\nical (three-dimensional magnetization prepared rapid acquisition\ngradient echo, MPRAGE) volume (1/H110031 /H110031 mm voxels) was acquired\nunder anesthesia in a separate session.\nAnalysis of human data.Data were analyzed with the Statistical Param-\neter Mapping package, SPM2 (Wellcome Department of Cognitive Neu-\nrology, London, UK), implemented in Matlab 6.5 (The MathWorks).\nPreprocessing of the data was identical in all human experiments. For\neach subject, motion correction was performed by realignment of all the\nfunctional EPI volumes to the first volume of the first time series and a\nmean image of the realigned volumes was created. This mean image was\ncoregistered to the anatomical T1-weighted image. Both the anatomical\nimage and the mean EPI were warped to a standard reference system\n(Talairach and Tournoux, 1988), bynormalizing both to their respec-\nFigure 4. Right SMG.A, Symmetrical ROI of aSMG core in right hemisphere.B–E , Activity profiles of this ROI in experiments\n1– 4. In none of the experiments did either pairedt test reach significance in this ROI.\nTable 4. Conjunction of interactions for mechanical hand and the three tool actions\nNumber vox\n(conj. 0.001)\nNumber vox\n(conj. 0.005)\nMNI coordinates\nExperiments\nConjunction\nHand action—static hand\n(experiment 1)\nShape\nlocalizer\nMotion\nlocalizerxyz\nL IOG 3 39 /H1100249 /H1100280 /H110024 3.80 7.81 9.72 9.27\nR IOG 7 65 47 /H1100275 /H110027 4.13 5.73 12.57 9.89\nL IPL BA40 8 75 /H1100260 /H1100221 31 3.63 n.s n.s. n.s.\nNumber of voxels in the activation site are indicated for two thresholds of the interaction.p /H110210.001 andp /H110210.005 uncorrected;t values as in Table 2. n.s., Nonsignificant; L, left; R, right; conj, conjunction; vox, voxels.\n11528 • J. Neurosci., September 16, 2009• 29(37):11523–11539 Peeters et al. • Observation of Tool Use in Humans and Monkeys\ntive template image [Montreal Neurological Institute (MNI)]. Subse-\nquently, the derived normalization parameters, were applied to all\nEPI volumes, which were subsampled to a voxel size of 2/H110032 /H110032m m\nand smoothed with a Gaussian kernel of 10 mm FWHM. Statistical\nanalyses was performed using the General Linear Model (Friston et\nal., 1995a,b), by modeling each condition using a delayed boxcar\nfunction and by convolving this with the hemodynamic response\nfunction. Global signal intensity was normalized and an appropriate\nhigh-pass temporal filter (two times the stimulus period) was applied\nto remove low-frequency drifts independent of the stimulus-induced\nsignal changes.\nIn the first two experiments, the first level contrasts for the different\naction types (human hand, mechanical hand and tool) versus their re-\nspective controls were calculated for every individual subject. These con-\ntrast images were subjected to a second level, random-effects ANOVA\nanalysis. The interactions were investigated by subtracting hand action\nminus its control from mechanical hand action minus its control or from\naction with screwdriver minus its control. These interactions were con-\njoined with the main effect of actions compared with their static controls.\nIn the other experiments (experiments 3, 4, and the two control experi-\nments) based on fewer subjects, a fixed-effects group analysis was per-\nformed. For each contrast, significant MR signal changes were assessed\nusing T-score maps. Thresholds were set atp /H110210.001 uncorrected for the\ninteraction effects. As a final analysis we performed a conjunction of the\ninteraction effects in the four different experiments (each atp /H110210.001 or\np /H110210.005 level). This conjunction was itself conjoined with the single\neffects of mechanical hand or tool action in the same experiments. A\nthreshold ofp /H110210.05 familywise error corrected for multiple compari-\nsons was used for the single effects of hand actions compared with their\nstatic or scrambled controls, and for the shape and motion localizers. For\ndescriptive purposes in tables and in figures we use a lower level:p /H11021\n0.001 uncorrected. This is a conservative choice that avoids underestima-\ntion of the extent of cortex activated by observation of biological hand\nactions.\nActivity profiles plotting the MR percentage signal changes compared\nwith fixation were obtained for the various experiments. These profiles\nwere calculated for the different regions of interest (ROIs) defined by\nconjunctions of contrasts. The profiles were calculated from the single\nsubject data by averaging all the voxels in a ROI. The first two data points\nof a run were not taken into account to compensate for the hemodynamic\ndelay of the BOLD response. In all profiles the SE of the mean was\ndetermined across the different subjects.\nAnalysis of monkey data.Data were analyzed using statistical paramet-\nric map (SPM5) and Match software. Only those runs in which the mon-\nkeys maintained fixation within the window for/H1102285% of the time and in\nwhich no significant differences in the numbers of saccades between\nconditions occurred. In these analyses, realign-\nment parameters, as well as eye movement\ntraces, were included as covariates of no inter-\nest to remove eye movement and brain motion\nartifacts. The fMRI data of the monkeys were\nrealigned and nonrigidly coregistered with the\nanatomical volumes of the template brain\n[M12, same as subject MM1 in the study by\nEkstrom et al. (2008)] using the Match soft-\nware (Chef d’Hotel et al., 2002). The algorithm\ncomputes a dense deformation field by compo-\nsition of small displacements minimizing a lo-\ncal correlation criterion. Regularization of the\ndeformation field is obtained by low-pass fil-\ntering. The quality of the registration can be\nappreciated in the study by Nelissen et al.\n(2005), their supplemental Fig. S6. The func-\ntional volumes were then subsampled to 1\nmm\n3 and smoothed with an isotropic Gauss-\nian kernel [full-width at half-height, 1.5 mm].\nGroup analyses were performed with an\nequal number of volumes per monkey, supple-\nmented with single subject analysis. The level\nof significance was set for the interactions at\np /H110210.001 uncorrected for multiple comparisons, as for humans. For all\nexperiments a fixed effect analysis was performed, except for experiment\n5, in which we emulated a random effect analysis by calculating first level\ncontrast images for each set of two runs for a single monkey. The single\neffects of hand action observation were thresholded at p /H110210.05\ncorrected.\nIn addition, four ROIs were defined directly onto the MR anatom-\nical images of M12, corresponding to the four architectonic subdivi-\nsions of IPL: PF, PFG, PG and Opt, as defined by (Gregoriou et al.,\n2006). Of these four IPL regions, mirror neurons are most prevalent\nin area PFG (Fogassi et al., 2005; Rozzi et al., 2008). The ROIs in-\ncluded 89 voxels in PF, 70 in PFG, 137 in PG, and 84 in Opt of the left\nhemisphere. Numbers were very similar for the right hemisphere.\nPercentage MR signal changes, relative to fixation baseline, in these\nROIs were calculated from the group or single subject data. The SE is\ncalculated across runs in single subject profiles and in group profiles.\nThe data of the first two scans of a block were omitted to take into\naccount the hemodynamic delay.\nFrom the activity profiles, we derived the magnitude of the inter-\naction given by the equation: percentage signal change (SC) in tool\naction minus percentage SC in static tool minus percentage SC in\nhand action plus percentage SC in static hand. The SEs of the individ-\nual conditions were relatively similar. Since the SEs are indicated only\nfor illustrative purposes, we therefore assumed equal SEs in the four\nconditions and can then set the SE of the interaction magnitude to\ntwice the average of the SEs in the four conditions. To test the selec-\ntivity of an activity profile for tool actions two paired t tests were\nperformed. One compared the difference between tool action and its\nstatic control to the difference between hand actions and their static\ncontrol. The second directly compared the tool actions to the hand\nactions. Comparisons were made across subjects for the human ROIs\nand across runs for the individual monkey subjects. While the first\ntest ensured that a significant interaction was present in the ROI, the\nsecond ensured that this interaction was due to a difference in the\nexperimental conditions, rather than a difference between the static\ncontrol conditions. For both tests, and in both species, the level of\nsignificance was set atp /H110210.05 corrected for multiple comparisons.\nSurface-based maps. The human fMRI data were mapped onto the\nhuman PALS atlas (Van Essen, 2005) surface in SPM–Talairach space, for\nboth the right and left hemisphere using a volume to surface tool in Caret\n(Van Essen et al., 2001). Anatomical landmarks were taken from the\nCaret database and local maxima were inserted as nodes on these flat-\ntened cortical maps in Caret. The monkey fMRI data, registered onto the\nanatomy of M12, were mapped onto the macaque M12 atlas (Durand et\nal., 2007) using the same tool in Caret. The localization of visual regions\nFigure 5. Control experiments. A, Activity profiles of left aSMG in the first control experiment: actions presented in left\nvisual field instead of right visual field (6 subjects); both pairedt tests for the interaction and direct comparison of actions\n(see Materials and Methods) reachedp /H110210.05. B, Activity profiles of left aSMG in the second control experiment: actions\nand static controls in right visual field with gliding (translation of static frame) controls and tool action with no object\nadded (7 subjects). In both cases the profiles are those of the 5 voxels of the aSMG ROI (used as an a priori prediction) in\nwhich the interaction with the screwdriver reachedp /H110210.01 in those particular subjects. InB, the interaction of the tool\naction with the gliding (translation) and static conditions was significant (paired t test, p /H110210.01), as was the direct\ncomparison of actions ( p /H110210.001).\nPeeters et al.• Observation of Tool Use in Humans and Monkeys J. Neurosci., September 16, 2009 • 29(37):11523–11539 • 11529\n(V1-3) was taken from Caret for humans and\nfrom (Fize et al., 2003) formonkeys. Area hMT/\nV5/H11001was localized in 40 human subjects tested\nwith the motion localizer (Sunaert et al., 1999)\nand monkey MT/V5 was taken from (Nelissen et\nal., 2006). The ellipses in the human flatmaps for\nphAIP, DIPSA and DIPSM (see Fig. 3) were taken\nfrom Georgieva et al. (2009).\nCaret and the PALS atlas are available at\nhttp://www.nitrc.org/projects/caret/ and http://\nsumsdb.wustl.edu/sums/directory.do?id /H11005\n636032&dir_name/H11005ATLAS_DATA_SETS and\nhttp://sumsdb.wustl.edu/sums/humanpalsmore.\ndo for both hemispheres.\nResults\nHuman fMRI experiments\nIn the first experiment, 20 volunteers were\npresented with video-clips showing either\nhuman or mechanical hands grasping ob-\njects. Dynamic scrambled videos and\nstatic pictures were used as controls. The\nresults showed that during the observa-\ntion of human hand actions, compared\nwith their static controls, fMRI signal in-\ncreased in occipitotemporal visual areas,\nin the anterior part of the intraparietal sul-\ncus (IPS) and adjacent inferior parietal\nlobule (IPL), and in premotor cortex plus\nthe adjacent inferior frontal gyrus, bilater-\nally as well as the cerebellum (Fig. 1A,\nTable 1). Observation of actions per-\nformed by a mechanical hand, compared\nwith their static control, activated a circuit\nsimilar to that activated during hand ac-\ntion observation (Fig. 1B), although the\nparietal activation in the left hemisphere\nappears to be more extensive than that for\nthe biological hand. Any difference be-\ntween the two contrasts is revealed di-\nrectly by the interaction between the\nfactor type of action (biological versus ar-\ntificial) and the factor type of condition\n(action versus controls). These interac-\ntion sites, which show a significant signal\nincrease in the contrast observation of me-\nchanical versus human hand actions, rela-\ntive to their static controls, were located\n(Fig. 1C) in the occipitotemporal region bi-\nlaterally and, dorsally, in the parietal lobe,\npredominantly of the left hemisphere (Ta-\nble 2). A substantial activation site was lo-\ncated in the rostroventral part of left IPL\nconvexity, extending into the posterior bank\nof postcentral sulcus[left anterior supramar-\nginal gyrus (aSMG)](Fig. 1C, arrow).\nFigure 6. Human IOG interaction sites.A, Flatmap of the left hemisphere (human PALS atlas). Green areas show activations in\nthe contrast observation of hand action minus static control (p /H110210.001, experiment 1). Blue and red outlines show the regions\nwhere the interactions tool versus hand, relative to their controls, were significant in experiments 1 and 2 respectively (p /H11021\n0.001). White lines indicate areas V1-3; yellow dot, hMT/V5/H11001; numbers indicate regions as listed in supplemental Tables S2 and\nS3, available at www.jneurosci.org as supplemental material; black square, part shown inB. B, C, Part of flatmaps of left andright\nhemispheres of the human PALS atlas showing the regions corresponding to the conjunction of the interactions for the 3\ntools (white voxels), to the interaction for the mechanical hand (blue outlines), and the conjunction of the four interactions\n(black voxels). These latter voxels, located in IOG,reflect the overlap between two largely distinct regions, probably induced by the\n4\nsmoothing and the averaging across many subjects; green\nvoxels same as inA. D–K , Activity profiles of left (D, F, H, J) and\nright (E, G, I, K) IOG regions yielded by the conjunction analysis\nof experiments 1– 4 (black voxels inB, C). The larger percent-\nage signal changes in these IOG regions compared with those\nin IPL (Figs. 3, 5) underscore their visual nature.\n11530 • J. Neurosci., September 16, 2009• 29(37):11523–11539 Peeters et al. • Observation of Tool Use in Humans and Monkeys\nIn experiment 2, following the design of experiment 1, we\npresented 21 volunteers with video-clips showing hand actions\nand actions in which a tool (a screwdriver) was used to pick up an\nobject. Because of its atypical use, the screwdriver was, most\nlikely, seen by the monkey as a stick used to pickup an object.\nTools used in a more standard way were tested in experiments 3\nand 4. Confirming experiment 1, the contrast tool use versus\nhand grasping, both relative to their static controls, revealed a\nsignal increase in the left parietal lobe (Fig. 2B). While some of\nthese interaction sites were within the hand grasping circuit,\nthree-quarter of the voxels were located outside, in the left aSMG\n(Table 3). Figure 3A uses the projection of the activation pattern\nonto a flattened hemisphere to show the overlap of the interac-\ntions for mechanical hand (blue outlines) and tool actions (red\noutlines) within the aSMG.\nIn experiments 3 and 4 we assessed the generality of these\nfindings, using the same experimental design of experiment 2,\nbut replacing the screwdriver with two other tools (rake and pli-\ners). The results confirmed those of experiment 2: interaction\nsites included left aSMG (Fig. 2 C,D).\nSince a significant tool versus hand action\ninteraction was observed in aSMG in all\nfour experiments, we performed a con-\njunction analysis of these interactions.\nThis analysis yielded (Fig. 2E, Table 4) the\naSMG site and two inferior occipital gyrus\n(IOG) sites. Figure 3B illustrates the loca-\ntion on a flat-map of the 75 (black) voxels\nyielded by the conjunction analysis which\ndefine the core of the aSMG region. This\ncore activation is located (59% overlap) in\ncyto-architectonically defined area PFt of\nCaspers et al. (2006). Its activity profiles\n(Fig. 3C–F) clearly indicate that in each of\nthe four experiments the interaction was\nsignificant and was due to a significant dif-\nference between the action conditions,\nrather than between the control conditions.\nFurthermore, the magnitude of the interac-\ntion for the observation of screwdriver ac-\ntions was intermediate between that for\nobservation of rake and pliers actions.\nHence, it is unlikely that the aSMG is a re-\ngion devoted to seeing unusual uses of tools.\nIn contrast to left aSMG, no activation\nwas found for a symmetrical ROI in the\nright hemisphere during observation of\neither hand or tool actions and neither\nwere any of the interactions significant\n(Fig. 4). Further control experiments re-\nvealed that the interaction in the left\naSMG was not related to the lateralization\nof the visual stimulus presentation: pre-\nsentation of videos with action predomi-\nnantly in the left rather than the right\nvisual field yielded a similar interaction\n(Fig. 5A). Nor was the interaction in left\naSMG due to mere stimulus translation.\nRather, it resulted from the observation of\ngoal-directed action performed with a\nmechanical device, vanishing when the\ngoal of the action was omitted from the\nvideos (Fig. 5B).\nWhile the mechanical arm interaction site overlapped the in-\nteraction sites for the 3 tools (screwdriver, rake and pliers) in left\naSMG (Fig. 3B), this was not the case in the two IOG conjunction\nregions (Fig. 6). In IOG the interaction sites common to the 3\ntools (Fig. 6B,C, white voxels) were located chiefly anterior to the\nmechanical arm interaction sites (blue outlines), with a few in-\ntervening voxels in common, corresponding to the conjunction\nregions (black voxels). This explains the functional heterogeneity\nof these conjunction regions indicated by their activity profiles\n(Fig. 6, compareD,E with F–K). A further difference between the\naSMG and IOG conjunction sites is that the latter are clearly\nvisual in nature being both shape and motion sensitive, while the\naSMG lacks these simple sensitivities (Table 4). This analysis of\nthe IOG conjunction sites shows that they differ considerably\nfrom the left aSMG core.\nNaive monkey fMRI experiments\nExperiments 1– 4, performed in humans, were replicated in five\nmonkeys (M1, M5, M6, M13, M14,experiments 5– 8), using the\nFigure 7. Results of experiment 5.A–C , Folded left and right hemispheres (A) and flatmaps (B, C) of left and right hemisphere\nof monkey template (M12) brain (Caret software) showing cortical regions activated (n /H110052, fixed effects,p /H110210.05 corrected,\nexperiment 5) in the subtraction observation of hand action minus static hand (A, B) and observation of mechanical hand action\nminus static mechanical hand (C). Both subtractions were masked inclusively with the contrast action observation minus fixation.\nBlack outlines, PF, PFG, PG and Opt; outlines of visual regions (V1-3, MT/V5) are also indicated. Color bars indicate T-scores. See also\nsupplemental Figure S1, available at www.jneurosci.org as supplemental material.\nPeeters et al.• Observation of Tool Use in Humans and Monkeys J. Neurosci., September 16, 2009 • 29(37):11523–11539 • 11531\nfMRI technique previously described\n(Vanduffel et al., 2001;Leite et al., 2002).\nCortical regions activated in the contrast\nobservation of hand action compared\nwith its static control, and in the contrast\nmechanical hand action observation com-\npared with its static control are shown in\nFigure 7,A,B and C, respectively. The ac-\ntivation pattern included occipitotempo-\nral regions, premotor and inferior frontal\nregions, and parietal regions, as in hu-\nmans (Fig. 1A,B). For both contrasts the\nactivation in parietal cortex was located\nmainly in the lateral bank of the IPS (sup-\nplemental Fig. S1, available at www.\njneurosci.org as supplemental material).\nThe strongest activation was located in\nthe anterior, shape-sensitive part of lat-\neral intraparietal area (LIP) (Durand et\nal., 2007), with extension into posterior\nAIP and posterior LIP. It is noteworthy\nthat the parietal activation was asymmet-\nric, being stronger in the left than in the\nright hemisphere, an observation which\nalso applied to the human parietal cortex\n(see Fig. 1B). It is likely that this asymmet-\nric activation reflected an asymmetry in\nthe action stimuli, in which most motion\noccurred in the right visual field. Alterna-\ntively, it may reflect the use of the right\nhand in the videos (Shmuelof and Zo-\nhary, 2006). No activation was observed\nin any of the four areas of monkey IPL:\nPF, PFG, PG or Opt (Gregoriou et al.,\n2006).\nAs expected from Figure 7, no signifi-\ncant interaction between the use of me-\nchanical implements and hand actions,\nrelative to their static controls, was ob-\nserved in monkey IPL in experiment 5\n(Figs. 8A,9 A), or in any of the three other\nexperiments (Fig. 8B–D,9 B–D). Figures 8\nand 9 illustrate the tool action vs hand ac-\ntion interaction sites observed in experi-\nments 5– 8 on the flattened left and right\nhemispheres respectively (A–D: blue, red,\nbrown and yellow areas respectively). Sig-\nnificant interactions were, however, ob-\nserved in visual areas of the monkey,\npredominantly in TEO, sometimes ex-\ntending into the superior temporal sulcus\n(STS) or V4, and to a lesser degree in early\nvisual areas, probably reflecting low level\nvisual or shape differences between the\nvideos.\nNo significant interaction was ob-\nserved in monkey IPL using the voxel-\nbased analysis, with the sole exception of\nleft area PG in experiment 7 (Fig. 8C, rake\naction). Thus, to ascertain whether there\nis indeed a monkey parietal sector specific\nto tool action observation, we performed\nan additional ROI analysis of anatomi-\nFigure 8. Interaction sites in the monkey. A–D , Monkey cortical regions activated during the observation of hand\ngrasping action relative to their static controls (green voxels, fixed effect,p /H110210.05 corrected, experiment 5, same data as\nin Fig. 7B). Data plotted on flatmaps of the M12 left hemisphere. The voxels more active (fixed effect,p /H110210.001) in the\ncontrast tool versus hand actions relative to their static controls (experiments 5– 8) are shown in blue (A, mechanical\nhand), red (B, screwdriver), brown (C, rake), and yellow (D, pliers). ROIs as in Figure 7.\nFigure 9. Interaction sites in the monkey.A–D , Flatmaps of the right hemisphere of monkey template (M12) brain (Caret\nsoftware) showing regions significant (fixed effects,p /H110210.05 corrected) in the interaction in experiments 5– 8 (same color\ncode as in Fig. 8,n /H110052 in experiments 5 andn /H110053 in experiments 6 – 8). ROIs as in Figure 7.\n11532 • J. Neurosci., September 16, 2009• 29(37):11523–11539 Peeters et al. • Observation of Tool Use in Humans and Monkeys\ncally defined areas PF, PFG [where hand mirror neurons have\nbeen reported in single neuron studies; (Fogassi et al., 2005; Rozzi\net al., 2008)], and PG of the left hemisphere. The results are\nshown in Fig. 10A,B. Since the interaction differs from subject to\nsubject (Fig. 10A), we calculated the magnitude of the interaction\nfor each tool-subject combination by the formula (b /H11002a) /H11002(d /H11002\nc), in whichb and a are the MR signals in tool and hand action\nconditions respectively andd and c the signals in the correspond-\ning static control conditions. The statistical analysis of tool-hand\ninteractions, relative to their static controls, showed that out of 33\nparietal interactions calculated, only two, PFG for rake in M14\nand PG for pliers in M13, reached significance with the two\npaired t tests used in the analysis of human aSMG (Fig. 10B). This\nis close to chance, which predicts 1/20 false positives.\nTo investigate the similarity between the occipitotemporal in-\nteraction sites of the monkey and the human IOG interaction\nsites, we also investigated the interactions for the tools separately\nfrom that for the mechanical arm. In monkeys the interaction site\ncommon to the three tools (Fig. 11A, white voxels) was located in\nTEO, in front of the mechanical arm interaction site (blue out-\nlines), which involve predominantly V4, extending into posterior\nTEO. This arrangement is similar to that observed in humans if\none takes into account that the human data are averages over\nmany more subjects and are smoothed more than the monkey\ndata. In the TEO regions the interaction for the three tools arose\nmainly from a reduced response to static tools (Fig. 11B), as was\nthe case in humans. Thus, the monkey oc-\ncipitotemporal interaction sites bear close\nsimilarity to the interaction sites observed\nin human IOG.\nTrained monkey fMRI experiments\nThe negative results obtained in the five\nmonkeys that we tested might reflect the\nfact that macaque monkeys do not nor-\nmally use tools or do so only rarely. Thus,\nto assess whether the activation observed\nin humans in the rostral part of IPL might\nbe the neural substrate of the capacity to\nunderstand tool use, we trained in exper-\niment 9 two monkeys (M13 and M14) to\nuse a rake, and later pliers, to retrieve\nfood. Both animals learned to use these\ntools proficiently (supplemental Movies\nS9 –10, available at www.jneurosci.org as\nsupplemental material) and were able to\nretrieve food positioned in 5 different lo-\ncations in front of them. M13 and M14\nreached 95 and 94% successful trials when\nusing the rake and 97 and 76% when using\nthe pliers, respectively. They were able to\nuse tools even if these implements were\npresented rotated 180 or 90° (supplemen-\ntal Movies S11–13, available at www.\njneurosci.org as supplemental material),\nexcept for M14 when tested with turned\npliers (see Materials and Methods). Fi-\nnally, the analysis of the action kinematics\n(Fig. 12) revealed stable motion trajecto-\nries with both tools for all food positions.\nFigure 12,A and E, illustrate the trajec-\ntories of the rake head when the monkey\nplaced the rake beyond the piece of food\nand then pulled the rake back to retrieve the piece of food. For the\ncentral food position (olive curves) a different starting position\nwas used, somewhat more to the right than that used for all other\nfood positions. Even though there were differences between\nmonkeys, with M13 always using the left side of the rake to pull\nthe food pellet back and M14 switching sides, the trajectories for\nboth monkeys were extremely stable. The variance was quite\nsmall, especially in the direction directly in front of the monkey.\nThe speed diagrams (Fig. 12B,F) also show a very consistent\npattern across trials: both monkeys moved more quickly in the\nfirst phase and then more slowly in the later, pulling phase for the\nmore peripheral food position (red curves).\nFigure 12,C and G, illustrate the trajectories of the two tips of\nthe pliers for the initial phase of movement toward the food.\nTrajectories are similar in the two animals and again show re-\nmarkably little variance. The corresponding speed diagrams are\nalso very constant, with the movements for the more peripheral\nposition being systematically slower. Notice that M13, who mas-\ntered the use of tools slightly better than M14, consistently moved\nthe tools more slowly than the other monkey: maximum speeds\nwere lower and total duration of the action longer.\nMonkeys 13 and 14 were scanned before tool use training,\nafter learning to use the rake, and a third time after learning to use\nthe pliers, with interleaved runs for the different tools. The inter-\naction patterns were remarkably similar before and after training\n(Fig. 13), except for the presence of a clearly enhanced interaction\nFigure 10. ROI analysis of monkey IPL.A, Activity profiles in PFG (ROI analysis, experiment 7).B, Magnitude of the interaction\n(b /H11002d /H11002a /H11001c) in PF, PFG and PG for different tools and monkeys. Stars indicate significant interactions. Notice that the larger\npercentage signal change in the monkey reflects the use of contrast agent enhanced fMRI (see Materials and Methods).\nPeeters et al.• Observation of Tool Use in Humans and Monkeys J. Neurosci., September 16, 2009 • 29(37):11523–11539 • 11533\nbetween the observation of pliers action\nversus that of hand action after pliers\ntraining (Fig 13B). Yet, no voxels with sig-\nnificant interactions were observed in ei-\nther PF or PFG, the anterior sectors of\nmonkey IPL, for any of the tools after the\ntrainings. This voxel-based analysis was\ncomplemented by a ROI analysis of left\nPF, PFG and PG similar to that performed\nin the naive animals. This analysis (Fig.\n14) failed to reveal any significant post-\ntraining interaction: in none of the ROIs\ndid the interaction reach significance for\nthe observation of actions with the tool,\nwhich the monkey had learned to use in\nthe training just preceding the scanning.\nOverall, only three out of the 54 (2/H110033 /H11003\n3 /H110033) tests performed in the two trained\nanimals yielded a statistically significant\ninteraction: two tests before training, al-\nready mentioned above, and an interac-\ntion for the rake in M13 after training with\nthe pliers. This small proportion (3/54) is\nagain close to the predicted chance occur-\nrence of 1/20 false positives.\nThis analysis clearly indicates that even\nafter prolonged training there is no evi-\ndence for a tool-related region in the\nmonkey comparable to human aSMG. Yet\nFigure 13 indicates that the tool vs hand\ninteraction increases in the IPS, with\ntraining, especially training of pliers, and\nmight include some parts of the hand ac-\ntion observation circuit. Supplemental\nFigure S2, available at www.jneurosci.org\nas supplemental material, shows that these interactions are weak\nin the anterior part of LIP, the most responsive part of the hand\naction observation circuit. In fact the interaction is weaker than\nthat observed in the human DIPSM, which is a plausible homolog\nof anterior LIP (Durand et al., 2009). Furthermore, factors other\nthan tool-action specific mechanisms might account for what-\never weak interaction present in the parietal regions of the mon-\nkey active during hand action observation. Given the similarity of\ngrasping with the fingers and with the tip of the pliers, the latter\ntype of grasping might have been more clearly understood after\ntraining and became therefore a more efficient stimulus. Alterna-\ntively, because of its difficulty, observing the use of pliers might\nhave elicited a stronger attentional modulation of the MR activa-\ntion compared with hand grasping. However, it is also fair to state\nthat even if no interaction is observed in the fMRI, it remains\npossible that some parts of the lateral bank of monkey IPS house\nsmall proportions of neurons similar to those present in human\naSMG. Such neurons would escape detection if the proportions\nare small, because of the coarseness of fMRI (Joly et al., 2009).\nThe proportion has to be small, because parietal neurons respon-\nsive to viewing of hand actions would respond to both hand and\ntool action observation and the presence of additional tool-\naction specific neurons would create an interaction signal in the\nfMRI, which was weak (supplemental Fig. S2, available at www.\njneurosci.org as supplemental material). Finally, we cannot ex-\nclude that the training has induced neuronal changes (Hihara et\nal., 2006) resulting in the recruitment of additional parietal areas\nby the observation of tool action. This possibility of an expansion\nof the hand action observation circuit after training will be the\ntopic a later publication.\nDiscussion\nThe present results show that in both humans and monkeys, the\nobservation of grasping actions performed with simple tools ac-\ntivates a parieto-frontal circuit also active during the observation\nand execution of hand grasping movements (Binkofski et al.,\n1999; Ehrsson et al., 2000; Buccino et al., 2001; Gre`zes et al., 2003;\nManthey et al., 2003; Gazzola et al., 2007) (see also Rizzolatti and\nCraighero, 2004). More importantly, however, in humans the\nobservation of actions performed with these simple mechanical\ndevices also activates a specific sector of the IPL, the aSMG. No\nequivalent tool-action specific activation was observed in mon-\nkey IPL, even after extensive training.\nThe human aSMG activation found in the present study is\ndistinct from the parietal activation sites observed during the\nstatic presentation of tool images (Chao and Martin, 2000;\nKellenbach et al., 2003; Creem-Regehr and Lee, 2005) in poste-\nrior IPL, i.e., in the regions active during the observation of hand\ngrasping. A possible explanation is that static pictures of tools, or\neven their translational motion (Beauchamp et al., 2002), acti-\nvated the representations of how those tools are grasped as ob-\njects rather than the cognitive aspects related to their actual use.\nThis view is supported by the study of Valyear et al. (2007) that\ndescribes an area, just posterior to left AIP, selectively activated\nduring tool naming. In agreement with our findings, these au-\nthors explicitly posit that two left parietal regions are specialized\nFigure 11. Occipitotemporal interaction sites in the monkey.A, Flatmap of left hemisphere of monkey 12 (template brain)\nshowing the regions activated (fixed effect,p /H110210.001) in the contrast viewing hand action minus viewing static hand (green\nvoxels, experiment 5) and in the interaction for the mechanical hand actions (blue outlines, experiment 5) as well as the voxels\ncommon to the interactions for the 3 tools (white voxels, experiments 6 – 8); ROIs as in Figure 7.B, Activity profiles of the local\nmaximum and 6 surrounding voxels in TEO (white area inA) in experiments 6 – 8. Again, the larger percentage signal changes in\nthe monkey reflect the use of contrast enhanced fMRI (Denys et al., 2004b) using the V1 activation as common reference estimated\nthe percentage signal changes with MION to average/H110112.5-fold those obtained with BOLD at 3T. A similar factor applies here when\ncomparing to the data of Figure 6, taking into account the larger number of human subjects from whom data are averaged.\n11534 • J. Neurosci., September 16, 2009• 29(37):11523–11539 Peeters et al. • Observation of Tool Use in Humans and Monkeys\nfor tool use: a region they describe behind AIP, involved in the\nplanning of skillful grasping of tools, and a more anterior region\nin the SMG related to the association of hand actions with the\nfunctional use of the tool. More generally, left aSMG site is lo-\ncated rostrally compared with the SMG regions involved in\naudio-visual phonological processing (Calvert and Campbell,\n2003; Miller and D’Esposito, 2005; Hasson et al., 2007; Skipper et\nal., 2007). Similarly, action verbs compared with abstract verbs\nactivate left area SII in the parietal operculum, rostral and ventral\nto the present aSMG site (Ru¨schemeyer et al., 2007). The left\naSMG region is therefore outside the linguistic network (see\nHickok and Poeppel, 2007) and its activation cannot be attrib-\nuted to verbalization. Finally, there is little\nevidence that left aSMG would be in-\nvolved in understanding causal relation-\nships in general. Split-brain studies have\nindicated that the left and right hemi-\nspheres are involved in causal inference\nand causal dynamic perception respec-\ntively (Roser et al., 2005). Yet the parietal\nregions recruited by viewing causal versus\nnoncausal displays are all located more\ncaudally than the aSMG (Blakemore et al.,\n2001; Fugelsang et al., 2005).\nThere is no direct evidence concerning\nthe motor properties of aSMG. However,\nit has been reported that SMG is activated\nduring preparation for (Johnson-Frey et\nal., 2005) and pantomimes of tool use\n(Moll et al., 2000; Rumiati et al., 2004;\nJohnson-Frey et al., 2005) (for review see\nLewis, 2006; Kro´ liczak and Frey, 2009) as\nwell as during the manipulation of virtual\ntools (Lewis et al., 2005). It is, therefore,\nplausible that aSMG constitutes a node\nwhere the observation of tool use is\nmatched to their use. Thus, as hand action\nobservation triggers the parieto-frontal\nhand grasping circuit, the particular type\nof movements required to operate tools\nappears to activate in addition aSMG\nwhich codes specific motor programs for\ntool use. This view is supported by the ac-\ntivation of aSMG by the sounds of tool use\n(Lewis et al., 2005).\nNegative findings, as those obtained\nhere for monkey IPL, are difficult to inter-\npret in functional imaging studies. In the\nmonkey experiments, however, we used a\ncontrast agent increasing the contrast-to-\nnoise ratio fivefold (Vanduffel et al.,\n2001). Furthermore, we used a ROI ap-\nproach which is more sensitive than an\nwhole-brain analysis (Nelissen et al.,\n2005), and we had precise indications\nabout the ROI locations (Fogassi et al.,\n2005; Rozzi et al., 2008). The similarity\nbetween the interaction in human IOG\nand monkey TEO/V4 regions indicates\nthat our fMRI technique in the monkey is\nsufficiently sensitive. Observations were\nmade in 5 monkeys, presenting actions\nperformed with several tools, and re-\npeated after training to use tools. The performance levels and the\nkinematic analyses clearly indicate that the two monkeys were\nwell trained to use the rake and pliers. Hence, the evidence for a\nspecies difference related to IPL activation by observation of tool\naction appears to be conclusive, although it is fair to state that the\ntraining of our monkeys was relatively short compared with the\nextensive human experience with tools. It is unclear how\nlonger training, with more tools, would alter the results. It is\nalso fair to note that since monkey intraparietal regions re-\nsponded to observation of both hand and tool actions, we\ncannot exclude that these regions house small numbers of\ntool-action specific neurons that escape detection by fMRI\nFigure 12. Effects of training in M13 and M14: kinematic analysis.A, C, E, G, Tool trajectories (mean/H110061 SD) for reaching and\nretrieving food of trained monkeys. Black squares: starting points. Colored squares: food position (5 directions:/H1100245 to/H1100145°). A,\nE, Trajectories using rake M13 and M14. A marker was attached at the middle of the rake-head. The left starting point was used for\nall directions except that straight ahead.C, G, Trajectories using pliers (M14). Markers attached on the arms of the pliers, 3 cm from\nthe tip.B, D, F, H, Mean (/H110061 SD) speed-time diagrams for two trajectories (/H110022.5° and/H1100145°). Rake, M13 and M14 (B, F); pliers,\nM13 and M14 (D, H).\nPeeters et al.• Observation of Tool Use in Humans and Monkeys J. Neurosci., September 16, 2009 • 29(37):11523–11539 • 11535\n(see Results and supplemental Fig. S2, available at www.\njneurosci.org as supplemental material).\nThe homology between human and monkey parietal lobe is\nunder dispute. Brodmann (1909) suggested that the homologues\nof two main cytoarchitectonics subdivisions of monkey posterior\nparietal lobe (areas 5 and 7) are both located in the human supe-\nrior parietal lobule and that human IPL (areas 40 and 39) is an\nevolutionary new region. However, this view is difficult to accept\ncompletely given that the intraparietal sulcus is an ancient sulcus,\nalready present in prosimians (see Foerster, 1936). Hence, recent\nliterature has adopted also for the monkey the nomenclature of\n(Von Economo, 1929), naming the monkey IPL areas with the\nsame terms as in humans: PF and PG (Von Bonin and Bailey,\n1947; Pandya and Seltzer, 1982).\nThe present findings suggest that while the IPL sector\naround the intraparietal sulcus is functionally similar (as far as\nhand manipulation is concerned) in monkeys and humans,\nthe rostral part of IPL is a new human brain area that does not\nexist in monkeys. We propose that this region proper to hu-\nmans underlies a specific way of understanding tool actions.\nWhile the grasping circuit treats actions done with a tool as\nequivalent to hands grasping objects, aSMG codes the tool\nactions in terms of causal relationships between the intended\nuse of the tool and the results obtained by using it. This capac-\nity, whether specific to tools or more general, represents a\nfundamental evolutionary cognitive leap that greatly enlarged\nthe motor repertoire of humans and, therefore, their capacity\nto interact with the environment.\nThe fact that monkeys learned to use simple tools such as a\nrake or pliers (Iriki et al., 1996; Ishibashi et al., 2000; Umilta` et al.,\n2008) does not necessarily imply an understanding of the abstract\nrelationship between tools and the goal that can be achieved by\nusing them. The rake, or the pliers, might simply become, with\ntraining, a prolongation of the arm, as shown by the response\nproperties of neurons recorded from the medial wall of the IPS of\nthese trained monkeys (Iriki et al., 1996; Hihara et al., 2006).\nHence, monkeys can rely on the hand grasping circuit to handle\nthe tool (Obayashi et al., 2001), although this circuit may include\nsome neuronal elements providing some primitive representa-\ntion of causal relationships.\nMacaques separated from the ancestors of humans/H1102230 mil-\nlion years ago. Recent findings concerning the development of\ntool use during hominid evolution allow us to speculate about the\nmoment at which the parietal region related to tool use emerged.\nThe earliest evidence for hominid tool technology are the sharp-\nedged flakes of the Oldowan industrial complex [2.5 million years\nago (Susman, 1994; Roche et al., 1999)]. During the Acheulian\nindustrial complex, dating back/H110111.5 Ma (Asfaw et al., 1992),\nlarge cutting tools were manufactured byHomo erectusand pos-\nsibly Homo ergaster. Their diversity (handaxes, cleavers, picks)\nsuggest that these early humans had the capacity to represent the\ncausal relationship between tool use and the results obtained with\nit. Thus the emergence of a new functional area in rostral IPL may\nhave occurred at least 1.5 million years ago (Ambrose, 2001). It\nmay have emerged even earlier, during the Oldowan industrial\ncomplex or when apes diverged from monkeys. Apes use tools\nreadily (Whiten et al., 1999) and modify herb stems to make them\na more efficient tool, which implies that they have a template of\nFigure 13. Effects of training: voxel-based analysis.A–C , SPMs showing significant interac-\ntion (n /H110052, fixed effects,p /H110210.001) tool action versus hand action observation, relative to\ntheir static control, for rake (A), pliers (B) and screwdriver (C) observation before training, after\n4\nrake training, and after pliers training. The significant voxels (orange-yellow) are overlaid on\nflatmaps of the left hemisphere of monkey M12.\n11536 • J. Neurosci., September 16, 2009• 29(37):11523–11539 Peeters et al. • Observation of Tool Use in Humans and Monkeys\nthe tool form (Sanz et al., 2009). Causal understanding of tool\nuse, however, may require more than a template as it implies the\nintegration of visual information into specialized motor sche-\nmata (Povinelli, 2000; Martin-Ordas et al., 2008).\nIn conclusion, the description of a region in the human brain,\nthe aSMG, specifically related to tool use sheds new light on the\nneural basis of an evolutionary new function typical ofHomo\nsapiens. Neurons specifically related to tool use might already be\npresent in monkeys dispersed in the hand action circuit and\nhence not be detectable by the fMRI. The appearance, however, in\nhumans of a new functional area, in which neurons with similar\nproperties may interact, could have enabled the appearance of\nnew cognitive functions that a less structured organization could\nhardly mediate.\nReferences\nAmbrose SH (2001) Paleolithic technology and human evolution. Science\n291:1748 –1753.\nAsfaw B, Beyene Y, Suwa G, Walter RC, White TD, WoldeGabriel G, Yemane\nT (1992) The earliest Acheulean from Konso-Gardula. Nature 360:\n732–735.\nBeauchamp MS, Lee KE, Haxby JV, Martin A (2002)Parallel visual motion\nprocessing streams for manipulable objects and human movements. Neuron\n34:149 –159.\nBeck BB (1980) Animal tool behaviour. New York: Garland STPM.\nBinkofski F, Buccino G, Posse S, Seitz RJ, Rizzolatti G, Freund H (1999) A\nfronto-parietal circuit for object manipulation in man: evidence from an\nfMRI-study. Eur J Neurosci 11:3276 –3286.\nBlakemore SJ, Fonlupt P, Pachot-Clouard M, Darmon C, Boyer P, Meltzoff\nAN, Segebarth C, Decety J (2001) How the brain perceives causality: an\nevent-related fMRI study. Neuroreport 12:3741–3746.\nBrodmann K (1909) Vergleichende lokalisationslehre der Grosshirnrinde.\nLeipzig, Germany: Johann Ambrosius Barth.\nBuccino G, Binkofski F, Fink GR, Fadiga L, Fogassi L, Gallese V, Seitz RJ,\nZilles K, Rizzolatti G, Freund HJ (2001) Action observation activates\npremotor and parietal areas in a somato-\ntopic manner: anfMRI study. Eur J Neurosci\n13:400 – 404.\nCalvert GA, Campbell R (2003) Reading speech\nfrom still and moving faces: the neural sub-\nstrates of visible speech. J Cogn Neurosci\n15:57–70.\nCaspers S, Geyer S, Schleicher A, Mohlberg H,\nAmunts K, Zilles K (2006) Thehuman infe-\nrior parietal cortex: cytoarchitectonic parcella-\ntion and interindividual variability. Neuroimage\n33:430 – 448.\nChao LL, Martin A (2000) Representation of\nmanipulable man-made objects in the dorsal\nstream. Neuroimage 12:478 – 484.\nChef d’Hotel C, Hermosillo G, Faugeras O\n(2002) Flows of diffeomorphisms for multi-\nmodal image registration. Proc IEEE Int Symp\nBiomed Imag 7– 8:753–756.\nCreem-Regehr SH, Lee JN (2005) Neural repre-\nsentations of graspable objects: are tools spe-\ncial? Brain Res Cogn Brain Res 22:457– 469.\nDenys K, Vanduffel W, Fize D, Nelissen K,\nPeuskens H, Van Essen D, Orban GA (2004a)\nThe processing of visual shape in the cerebral\ncortex of human and nonhuman primates: a\nfunctional magnetic resonance imaging study.\nJ Neurosci 24:2551–2565.\nDenys K, Vanduffel W, Fize D, Nelissen K,\nSawamura H, Georgieva S, Vogels R, Van\nEssen D, Orban GA (2004b) Visual activa-\ntion in prefrontal cortex is stronger in mon-\nkeys than in humans. J Cogn Neurosci\n16:1505–1516.\nDurand JB, Nelissen K, Joly O, Wardak C, Todd\nJT, Norman JF, Janssen P, Vanduffel W, Or-\nban GA (2007) Anterior regions of monkey parietal cortex process vi-\nsual 3D shape. Neuron 55:493–505.\nDurand JB, Peeters R, Norman JF, Todd JT, Orban GA (2009) Parietal re-\ngions processing visual 3D shape extracted from disparity. Neuroimage\n46:1114 –1126.\nEhrsson HH, Fagergren A, Jonsson T, Westling G, Johansson RS, Forssberg H\n(2000) Cortical activity in precision- versus power-grip tasks: an fMRI\nstudy. J Neurophysiol 83:528 –536.\nEkstrom LB, Roelfsema PR, Arsenault JT, Bonmassar G, Vanduffel W (2008)\nBottom-up dependent gating of frontal signals in early visual cortex. Sci-\nence 321:414 – 417.\nFize D, Vanduffel W, Nelissen K, Denys K, Chef d’Hotel C, Faugeras O, Orban\nGA (2003) The retinotopic organization of primate dorsal V4 and sur-\nrounding areas: a functional magnetic resonance imaging study in awake\nmonkeys. J Neurosci 23:7395–7406.\nFoerster O (1936) Motorische Felder und Bahnen. In: Handbuch der Neu-\nrologie IV (Bumke H, Foerster O, eds), pp 49 –56. Berlin: Springer.\nFogassi L, Ferrari PF, Gesierich B, Rozzi S, Chersi F, Rizzolatti G (2005)\nParietal lobe: from action organization to intention understanding. Science\n308:662– 667.\nFrey SH (2008) Tool use, communicative gesture and cerebral asymmetries\nin the modern human brain. Philos Trans R Soc Lond B Biol Sci\n363:1951–1957.\nFriston KJ, Holmes AP, Poline JB, Grasby PJ, Williams SC, Frackowiak RS,\nTurner R (1995a) Analysis of fMRI time-series revisited. Neuroimage\n2:45–53.\nFriston K, Holmes A, Worsley K, Poline J, Frith C, Frackowiak R (1995b)\nStatistical parametric maps in functional imaging: a general linear ap-\nproach. Hum Brain Mapp 2:189 –210.\nFugelsang JA, Roser ME, Corballis PM, Gazzaniga MS, Dunbar KN (2005)\nBrain mechanisms underlying perceptual causality. Brain Res Cogn Brain\nRes 24:41– 47.\nGazzola V, Rizzolatti G, Wicker B, Keysers C (2007) The anthropomorphic\nbrain: The mirror neuron system responds to human and robotic actions.\nNeuroimage 35:1674 –1684.\nGeorgieva S, Peeters R, Kolster H, Todd JT, Orban GA (2009) The process-\nFigure 14. ROI analysis of the magnitude of the interaction (see Fig. 10 for definition) after training.A–C , Interaction magni-\ntude is plotted as a function of epoch for the two subjects (M13, M14) in each of the three ROIs (PF, PFG, and PG) for rake action\nobservation (A), the pliers action observation (B) and the screwdriver action observation (C). Significant values (both pairedt tests\np /H110210.05 corrected for multiple comparisons) are indicated by stars. Runs fromA–C were tested interleaved at each epoch.\nPeeters et al.• Observation of Tool Use in Humans and Monkeys J. Neurosci., September 16, 2009 • 29(37):11523–11539 • 11537\ning of three-dimensional shape from disparity in the human brain. J Neu-\nrosci 29:727–742.\nGregoriou GG, Borra E, Matelli M, Luppino G (2006) Architectonic orga-\nnization of the inferior parietal convexity of the macaque monkey.\nJ Comp Neurol 496:422– 451.\nGre`zes J, Armony JL, Rowe J, Passingham RE (2003) Activations related to\n“mirror” and “canonical” neurones in the human brain: an fMRI study.\nNeuroimage 18:928 –937.\nHasson U, Skipper JI, Nusbaum HC, Small SL (2007) Abstract coding of\naudiovisual speech: beyond sensory representation. Neuron 56:\n1116 –1126.\nHauser MD (1997) Artifactual kinds and functional design features: what a\nprimate understands without language. Cognition 64:285–308.\nHickok G, Poeppel D (2007) The cortical organization of speech processing.\nNat Rev Neurosci 8:393– 402.\nHihara S, Notoya T, Tanaka M, Ichinose S, Ojima H, Obayashi S, Fujii N, Iriki\nA (2006) Extension of corticocortical afferents into the anterior bank of\nthe intraparietal sulcus by tool-use training in adult monkeys. Neuropsy-\nchologia 44:2636 –2646.\nIriki A, Tanaka M, Iwamura Y (1996) Coding of modified body schema\nduring tool use by macaque postcentral neurones. Neuroreport\n7:2325–2330.\nIshibashi H, Hihara S, Iriki A (2000) Acquisition and development of mon-\nkey tool-use: behavioral and kinematic analyses. Can J Physiol Pharmacol\n78:958 –966.\nJastorff J, Orban GA (2009) Human functional magnetic resonance imaging\nreveals separation and integration of shape and motion cues in biological\nmotion processing. J Neurosci 29:7315–7329.\nJohnson-Frey SH (2003) What’s so special about human tool use? Neuron\n39:201–204.\nJohnson-Frey SH (2004) The neural bases of complex tool use in humans.\nTrends Cogn Sci 8:71–78.\nJohnson-Frey SH, Newman-Norlund R, Grafton ST (2005) A distributed\nleft hemisphere network active during planning of everyday tool use skills.\nCereb Cortex 15:681– 695.\nJoly O, Vanduffel W, Orban GA (2009) The monkey ventral premotor cor-\ntex processes 3D shape from disparity. Neuroimage 47:262–272.\nKellenbach ML, Brett M, Patterson K (2003) Actions speak louder than\nfunctions: the importance of manipulability and action in tool represen-\ntation. J Cogn Neurosci 15:30 – 46.\nKohler W (1927) The mentality of apes. London: Humanities.\nKourtzi Z, Kanwisher N (2000) Cortical regions involved in perceiving ob-\nject shape. J Neurosci 20:3310 –3318.\nKro´ liczak G, Frey SH (2009) A common network in the left cerebral hemi-\nsphere represents planning of tool use pantomimes and familiar intran-\nsitive gestures at the hand-independent level. Cereb Cortex, in press.\nLeite FP, Tsao D, Vanduffel W, Fize D, Sasaki Y, Wald LL, Dale AM, Kwong\nKK, Orban GA, Rosen BR, Tootell RB, Mandeville JB (2002) Repeated\nfMRI using iron oxide contrast agent in awake, behaving macaques at 3\ntesla. Neuroimage 16:283–294.\nLewis JW (2006) Cortical networks related to human use of tools. Neuro-\nscientist 12:211–231.\nLewis JW, Brefczynski JA, Phinney RE, Janik JJ, DeYoe EA (2005) Distinct\ncortical pathways for processing tool versus animal sounds. J Neurosci\n25:5148 –5158.\nMandeville JB, Marota JJ (1999) Vascular filters of functional MRI: spatial\nlocalization using BOLD and CBV contrast. Magn Reson Med\n42:591–598.\nManthey S, Schubotz RI, von Cramon DY (2003) Premotor cortex in ob-\nserving erroneous action: an fMRI study. Brain Res Cogn Brain Res\n15:296 –307.\nMaravita A, Iriki A (2004) Tools for the body (schema). Trends Cogn Sci\n8:79 – 86.\nMartin-Ordas G, Call J, Colmenares F (2008) Tubes, tables and traps: great\napes solve two functionally equivalent trap tasks but show no evidence of\ntransfer across tasks. Anim Cogn 11:423– 430.\nMiller LM, D’Esposito M (2005) Perceptual fusion and stimulus coinci-\ndence in the cross-modal integration of speech. J Neurosci 25:5884 –5893.\nMoll J, de Oliveira-Souza R, Passman LJ, Cunha FC, Souza-Lima F, An-\ndreiuolo PA (2000) Functional MRI correlates of real and imagined\ntool-use pantomimes. Neurology 54:1331–1336.\nMoura AC, Lee PC (2004) Capuchin stone tool use in Caatinga dry forest.\nScience 306:1909.\nMulcahy NJ, Call J (2006) How great apes perform on a modified trap-tube\ntask. Anim Cogn 9:193–199.\nNatale F, Poti P, Spinozzi G (1988) Development of tool use in a macaque\nand a gorilla. Primates 29:413– 416.\nNelissen K, Luppino G, Vanduffel W, Rizzolatti G, Orban GA (2005) Ob-\nserving others: multiple action representation in the frontal lobe. Science\n310:332–336.\nNelissen K, Vanduffel W, Orban GA (2006) Charting the lower superior\ntemporal region, a new motion-sensitive region in monkey superior tem-\nporal sulcus. J Neurosci 26:5929 –5947.\nOakley KP (1956) Man the tool-maker. London: British Museum.\nObayashi S, Suhara T, Kawabe K, Okauchi T, Maeda J, Akine Y, Onoe H, Iriki\nA (2001) Functional brain mapping of monkey tool use. Neuroimage\n14:853– 861.\nPandya DN, Seltzer B (1982) Intrinsic connections and architectonics of\nposterior parietal cortex in the rhesus monkey. J Comp Neurol\n204:196 –210.\nPenn DC, Holyoak KJ, Povinelli DJ (2008) Darwin’s mistake: explaining the\ndiscontinuity between human and nonhuman minds. Behav Brain Sci\n31:109 –130.\nPovinelli DJ (2000) Folk physics for apes: the chimpanzee’s theory of how\nthe world works. London: Oxford UP.\nRizzolatti G, Craighero L (2004) The mirror-neuron system. Annu Rev\nNeurosci 27:169 –192.\nRoche H, Delagnes A, Brugal JP, Feibel C, Kibunjia M, Mourre V, Texier PJ\n(1999) Early hominid stone tool production and technical skill 2.34 Myr\nago in West Turkana, Kenya. Nature 399:57– 60.\nRoser ME, Fugelsang JA, Dunbar KN, Corballis PM, Gazzaniga MS (2005)\nDissociating processes supporting causal perception and causal inference\nin the brain. Neuropsychology 19:591– 602.\nRozzi S, Ferrari PF, Bonini L, Rizzolatti G, Fogassi L (2008) Functional or-\nganization of inferior parietal lobule convexity in the macaque monkey:\nelectrophysiological characterization of motor, sensory and mirror re-\nsponses and their correlation with cytoarchitectonic areas. Eur J Neurosci\n28:1569 –1588.\nRumiati RI, Weiss PH, Shallice T, Ottoboni G, Noth J, Zilles K, Fink GR\n(2004) Neural basis of pantomiming the use of visually presented objects.\nNeuroimage 21:1224 –1231.\nRu¨schemeyer SA, Brass M, Friederici AD (2007) Comprehending prehend-\ning: neural correlates of processing verbs with motor stems. J Cogn Neu-\nrosci 19:855– 865.\nSantos LR, Rosati A, Sproul C, Spaulding B, Hauser MD (2005) Means-\nmeans-end tool choice in cotton-top tamarins (Saguinus oedipus): finding\nthe limits on primates’ knowledge of tools. Anim Cogn 8:236 –246.\nSantos LR, Pearson HM, Spaepen GM, Tsao F, Hauser MD (2006) Probing\nthe limits of tool competence: experiments with two non-tool-using spe-\ncies (Cercopithecus aethiopsand Saguinus oedipus). Anim Cogn 9:94 –109.\nSanz C, Call J, Morgan D (2009) Design complexity in termite-fishing tools\nof chimpanzees (Pan troglodytes). Biol Lett 5:293–296.\nShmuelof L, Zohary E (2006) A mirror representation of others’ actions in\nthe human anterior parietal cortex. J Neurosci 26:9736 –9742.\nSkipper JI, van Wassenhove V, Nusbaum HC, Small SL (2007) Hearing lips\nand seeing voices: how cortical areas supporting speech production me-\ndiate audiovisual speech perception. Cereb Cortex 17:2387–2399.\nSpaulding B, Hauser MD (2005) What experience is required for acquiring\ntool competence: experiments with two Callitrichids. Anim Behav\n70:517–526.\nSunaert S, Van Hecke P, Marchal G, Orban GA (1999) Motion-responsive\nregions of the human brain. Exp Brain Res 127:355–370.\nSusman RL (1994) Fossil evidence for early hominid tool use. Science\n265:1570 –1573.\nTai YF, Scherfler C, Brooks DJ, Sawamoto N, Castiello U (2004) The human\npremotor cortex is ‘mirror’ only for biological actions. Curr Biol\n14:117–120.\nTalairach J, Tournoux P (1988) Co-planar stereotaxic atlas of the human\nbrain. New York: Thieme.\nUmilta` MA, Escola L, Intskirveli I, Grammont F, Rochat M, Caruana F,\nJezzini A, Gallese V, Rizzolatti G (2008) When pliers become fingers in\nthe monkey motor system. Proc Natl Acad Sci U S A 105:2209 –2213.\n11538\n• J. Neurosci., September 16, 2009• 29(37):11523–11539 Peeters et al. • Observation of Tool Use in Humans and Monkeys\nValyear KF, Cavina-Pratesi C, Stiglick AJ, Culham JC (2007) Does tool-\nrelated fMRI activity within the intraparietal sulcus reflect the plan to\ngrasp? Neuroimage 36 [Suppl 2]:T94 –T108.\nVanduffel W, Fize D, Mandeville JB, Nelissen K, Van Hecke P, Rosen BR,\nTootell RB, Orban GA (2001) Visual motion processing investigated us-\ning contrast agent-enhanced fMRI in awake behaving monkeys. Neuron\n32:565–577.\nVan Essen DC (2005) A population-average, landmark- and surface-based\n(PALS) atlas of human cerebral cortex. Neuroimage 28:635– 662.\nVan Essen DC, Drury HA, Dickson J, Harwell J, Hanlon D, Anderson CH\n(2001) An integrated software suite for surface-based analyses of cerebral\ncortex. J Am Med Inform Assoc 8:443– 459.\nVisalberghi E, Limongelli L (1994) Lack of comprehension of cause-effect\nrelations in tool-using capuchin monkeys (Cebus apella). J Comp Psychol\n108:15–22.\nVisalberghi E, Trinca L (1989) Tool use in capuchin monkeys: distinguish-\ning between performing and understanding. Primates 30:511–521.\nVon Bonin G, Bailey P (1947) The neocortex ofMacaca mulatta. Urbana, IL:\nUniversity of Illinois.\nVon Economo C (1929) The cytoarchitectonics of the human cerebral cor-\ntex (translated by S. Parker). Oxford: Humprey-Milford.\nWhiten A, Goodall J, McGrew WC, Nishida T, Reynolds V, Sugiyama Y, Tutin\nCE, Wrangham RW, Boesch C (1999) Cultures in chimpanzees. Nature\n399:682– 685.\nPeeters et al.• Observation of Tool Use in Humans and Monkeys J. Neurosci., September 16, 2009\n• 29(37):11523–11539 • 11539",
  "topic": "Inferior parietal lobule",
  "concepts": [
    {
      "name": "Inferior parietal lobule",
      "score": 0.7349990606307983
    },
    {
      "name": "Macaque",
      "score": 0.7185201048851013
    },
    {
      "name": "Neuroscience",
      "score": 0.6085154414176941
    },
    {
      "name": "Homo sapiens",
      "score": 0.5958444476127625
    },
    {
      "name": "Premotor cortex",
      "score": 0.5474265217781067
    },
    {
      "name": "Psychology",
      "score": 0.4580404460430145
    },
    {
      "name": "Primate",
      "score": 0.4328409731388092
    },
    {
      "name": "Intraparietal sulcus",
      "score": 0.4187897741794586
    },
    {
      "name": "Biology",
      "score": 0.31708088517189026
    },
    {
      "name": "Functional magnetic resonance imaging",
      "score": 0.2842293977737427
    },
    {
      "name": "Anatomy",
      "score": 0.15099167823791504
    },
    {
      "name": "Dorsum",
      "score": 0.12012898921966553
    },
    {
      "name": "Geography",
      "score": 0.07149893045425415
    },
    {
      "name": "Archaeology",
      "score": 0.0
    }
  ]
}