{
  "title": "On the Use of Variance per Genotype as a Tool to Identify Quantitative Trait Interaction Effects: A Report from the Women's Genome Health Study",
  "url": "https://openalex.org/W1977636169",
  "year": 2010,
  "authors": [
    {
      "id": "https://openalex.org/A5054423486",
      "name": "Guillaume Paré",
      "affiliations": [
        "McMaster University",
        "Population Health Research Institute",
        "Brigham and Women's Hospital"
      ]
    },
    {
      "id": "https://openalex.org/A5084857746",
      "name": "Nancy R. Cook",
      "affiliations": [
        "Brigham and Women's Hospital"
      ]
    },
    {
      "id": "https://openalex.org/A5091595592",
      "name": "Paul M. Ridker",
      "affiliations": [
        "Brigham and Women's Hospital"
      ]
    },
    {
      "id": "https://openalex.org/A5013920089",
      "name": "Daniel I. Chasman",
      "affiliations": [
        "Brigham and Women's Hospital"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2125858955",
    "https://openalex.org/W1981723690",
    "https://openalex.org/W2083944388",
    "https://openalex.org/W2009969871",
    "https://openalex.org/W2070831222",
    "https://openalex.org/W2054883878",
    "https://openalex.org/W1980175560",
    "https://openalex.org/W2090713084",
    "https://openalex.org/W2143970281",
    "https://openalex.org/W2085739707",
    "https://openalex.org/W2154532816",
    "https://openalex.org/W2143543035",
    "https://openalex.org/W2138597449",
    "https://openalex.org/W1994656203",
    "https://openalex.org/W2116451646",
    "https://openalex.org/W2104657159",
    "https://openalex.org/W2007272726",
    "https://openalex.org/W2130171029",
    "https://openalex.org/W2084960007",
    "https://openalex.org/W1975184169",
    "https://openalex.org/W2097816832",
    "https://openalex.org/W2017511982",
    "https://openalex.org/W2123116855",
    "https://openalex.org/W2172068406",
    "https://openalex.org/W4285719527",
    "https://openalex.org/W2016274652"
  ],
  "abstract": "Testing for genetic effects on mean values of a quantitative trait has been a very successful strategy. However, most studies to date have not explored genetic effects on the variance of quantitative traits as a relevant consequence of genetic variation. In this report, we demonstrate that, under plausible scenarios of genetic interaction, the variance of a quantitative trait is expected to differ among the three possible genotypes of a biallelic SNP. Leveraging this observation with Levene's test of equality of variance, we propose a novel method to prioritize SNPs for subsequent gene-gene and gene-environment testing. This method has the advantageous characteristic that the interacting covariate need not be known or measured for a SNP to be prioritized. Using simulations, we show that this method has increased power over exhaustive search under certain conditions. We further investigate the utility of variance per genotype by examining data from the Women's Genome Health Study. Using this dataset, we identify new interactions between the LEPR SNP rs12753193 and body mass index in the prediction of C-reactive protein levels, between the ICAM1 SNP rs1799969 and smoking in the prediction of soluble ICAM-1 levels, and between the PNPLA3 SNP rs738409 and body mass index in the prediction of soluble ICAM-1 levels. These results demonstrate the utility of our approach and provide novel genetic insight into the relationship among obesity, smoking, and inflammation.",
  "full_text": "On the Use of Variance per Genotype as a Tool to\nIdentify Quantitative Trait Interaction Effects: A Report\nfrom the Women’s Genome Health Study\nGuillaume Pare´1,2*, Nancy R. Cook2, Paul M. Ridker2, Daniel I. Chasman2\n1 Department of Pathology and Molecular Medicine, Population Genomics Program, McMaster University, Hamilton, Canada,2 Department of Preventive Medicine,\nBrigham and Women’s Hospital, Boston, Massachusetts, United States of America\nAbstract\nTesting for genetic effects on mean values of a quantitative trait has been a very successful strategy. However, most studies\nto date have not explored genetic effects on the variance of quantitative traits as a relevant consequence of genetic\nvariation. In this report, we demonstrate that, under plausible scenarios of genetic interaction, the variance of a quantitative\ntrait is expected to differ among the three possible genotypes of a biallelic SNP. Leveraging this observation with Levene’s\ntest of equality of variance, we propose a novel method to prioritize SNPs for subsequent gene–gene and gene–\nenvironment testing. This method has the advantageous characteristic that the interacting covariate need not be known or\nmeasured for a SNP to be prioritized. Using simulations, we show that this method has increased power over exhaustive\nsearch under certain conditions. We further investigate the utility of variance per genotype by examining data from the\nWomen’s Genome Health Study. Using this dataset, we identify new interactions between theLEPR SNP rs12753193 and\nbody mass index in the prediction of C-reactive protein levels, between theICAM1 SNP rs1799969 and smoking in the\nprediction of soluble ICAM-1 levels, and between thePNPLA3 SNP rs738409 and body mass index in the prediction of\nsoluble ICAM-1 levels. These results demonstrate the utility of our approach and provide novel genetic insight into the\nrelationship among obesity, smoking, and inflammation.\nCitation: Pare´ G, Cook NR, Ridker PM, Chasman DI (2010) On the Use of Variance per Genotype as a Tool to Identify Quantitative Trait Interaction Effects: A Report\nfrom the Women’s Genome Health Study. PLoS Genet 6(6): e1000981. doi:10.1371/journal.pgen.1000981\nEditor: John D. Storey, Princeton University, United States of America\nReceived November 17, 2009;Accepted May 10, 2010;Published June 17, 2010\nCopyright: /C2232010 Pare´ et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted\nuse, distribution, and reproduction in any medium, provided the original author and source are credited.\nFunding: This study was supported by grants from the National Heart, Lung, and Blood Institute and the National Cancer Institute (Bethesda, MD, USA; grants HL080467,\nHL043851, and CA047988), the Donald W. Reynolds Foundation (Las Vegas, NV, USA), the Doris Duke Charitable Foundation (New York, NY, USA), and the Fondation\nLeducq (Paris, France), with collaborative scientific and genotyping support provided by Amgen Inc (Thousand Oaks, CA, USA). GP is supported by a scholarship from the\nFRSQ. Open access publication costs were defrayed by the Ontario Genomics Institute Genomics Publication Fund. The sponsors and funders did not haveany role in the\ndesign and conduct of the study, in the collection, analysis, and interpretation of the data, and in the preparation, review, or approval of the manuscript.\nCompeting Interests: The authors have declared that no competing interests exist.\n* E-mail: pareg@mcmaster.ca\nIntroduction\nMost genetic association studies have so far emphasized the\neffect of SNPs on mean values of a trait of interest. While this\napproach has been widely successful in identifying genetic\ndeterminants of quantitative traits, it does not make use of\ndifferences in the variance of these traits per genotype, which may\nreflect an alternative mode of genetic influence and signify\nbiological relevance. Several scenarios can result in the variance\nof a quantitative trait being different when individuals are stratified\nby SNP genotype (or any other genetic variation) in cross-sectional\ndesigns. For examples, such difference could be ascribed to\nincreased variation over time among individuals of a given\ngenotype, increased variation in the homeostatic set-point of a trait\n(without increased variation over time), or an interaction effect\nwith another SNP or exposure. This latter possibility is particularly\nattractive since information on variance per genotype could thus\nbe leveraged to reduce the dimensionality of interaction analysis\nby prioritizing SNPs for further interaction testing.\nSeveral methods have been developed to address the statistical\nchallenge of assessing the degree and nature of interaction between\ntwo or more genetic loci [1–4]. While these offer invaluable\ninsight, most do not address the main problem pertaining to\ninteraction testing in the context of whole genome association\nstudies: the multiple hypothesis testing incurred when searching\nfor interactions between hundreds of thousands of genetic variants.\nIn theory, excluding unlikely interactions on ana priori basis will\nresult in a lower number of false positives tests and increased\npower. Current data reduction methods use evidence of co-\nadaptation between loci to restrict the search space [5] or specify a\nminimum marginal effect to select a subset of SNPs for interaction\ntesting [6–8]. This latter method is based on the assumption that\ninteracting SNPs will show at least a moderate effect on the trait of\ninterest. While this premise might be valid in most cases, it need\nnot be, as has been observed [2,9,10]. Furthermore, even when\nrestricting the search for interaction to SNPs with marginal effect\nP-values lower than 0.1, as has been suggested [7], a sizeable\nnumber of hypotheses will have to be tested. Thus there is a need\nfor novel methods to identify SNPs likely to be involved in gene-\ngene and gene-environment interactions. Murcray et al. [11]\nrecently proposed a two-step approach to test for gene-environ-\nment interactions in genome-wide association studies. In the\ncontext of dichotomous outcomes, this method first tests for gene-\nenvironment association, followed by conventional interaction\nPLoS Genetics | www.plosgenetics.org 1 June 2010 | Volume 6 | Issue 6 | e1000981\ntesting of the subset of markers with significant association in the\ncombined case-control sample.\nIn this report, we first derive expressions for the variance\naccording to SNP genotype under models of genetic interactions\nand demonstrate that the variance of a quantitative trait will differ\nbetween the three possible genotypes of a biallelic SNP in the\npresence of genetic interactions. Building on these derivations, we\nthen simulate data to explore contexts where testing for inequality\nof variance between genotypes could be used to prioritize SNPs for\nfurther interaction testing. Leveraging these observations, we\npropose a novel method to prioritize SNPs for gene-gene and\ngene-environment interaction, ‘‘variance prioritization’’. Variance\nprioritization entails two steps. In the first step, Levene’s test of\nequality of variance is used to prioritize SNPs for further\ninteraction testing. In the second step, prioritized SNPs are tested\nfor interaction effects against environmental covariates or other\nSNPs using linear regression. We use data from the Women’s\nGenome Health Study (WGHS) on two inflammation markers, C-\nreactive protein and soluble ICAM-1, to test whether (1) there is\nempirical confirmation of SNPs demonstrating inequality of\nvariance between genotypes and (2) whether such SNPs show\nevidence of either gene-environment or gene-gene interactions.\nMethods\nEthics statement\nAll analyses were performed with approval of the institutional\nreview board of the Brigham and Women’s Hospital. All members of\nthe WGHS cohort were participants in the WHS who provided an\nadequate baseline blood sample for plasma and DNA analysis and\nwho gave consent for blood-based analyses and long-term follow-up.\nVariance of a quantitative trait by genotype in the\npresence of an interaction effect\nConsider a biallelic SNP G with minor allele frequency p and in\nHardy-Weinberg equilibrium. Without loss of generality and\nassuming an additive genetic effect of G on a quantitative trait of\ninterest, G can be encoded as -2p, 1-2p, or 2-2p such that mean\ngenotype equals zero. Assume that there is an additive interaction\nbetween G and a covariate C (with mean equal to zero, variance\nequal to one, and uncorrelated to G) such that the quantitative\ntrait Y for the ith individual is represented as:\ny\ni~b0zb1gizb2cizb3gicizei ð1Þ\nWhere b0, b1, b2, andb3 represent constants for the intercept, the\nmarginal effect of G, the marginal effect of C, and the interaction\nof G and C, respectively. It is assumed the outcome is standardized\nso it has unit variance conditional on G and C, that is, the error\nterm e\ni,N(0,1). The variance in Y conditional on genotype of G\ncan be written as:\nVar(YDG~g)~Var(b0zb1gzb2Czb3gCze)\n~0z0zVar(b2C)zVar(b3gC)z2Cov(b2C,b3gC)z1\n~b2\n2zb2\n3g2z2b2b3gz1\n~(b2zb3g)2z1\nð2Þ\nWhere coefficients represent true rather than estimated effects.\nThus, the variance of Y will differ by genotype group (g) when\nb3?0. Importantly, the variance does not depend on the marginal\neffect of G on Y (i.e.b1). Furthermore, as we did not specify the\ndistribution form of the interacting covariate C, Equation 3 can be\ngeneralized to different types of interaction such as dichotomous\nenvironmental exposures, continuous environmental exposures or\nthe three genotype classes of a biallelic SNP. The total variance of\nY is given by:\nVar(Y)~Var(b\n1Gzb2Czb3GCze)\n~Var(b1G)zVar(b2C)zVar(b3GC)z1\nz2Cov(b1G,b2C)z2Cov(b1G,b3GC)z2Cov(b2C,b3GC)\n~2p(1{p)b2\n1zb2\n2zb2\n3Var(GC)z1\n~2p(1{p)b2\n1zb2\n2zb2\n3Var(G)Var(C)z1\n~2p(1{p)b2\n1zb2\n2z2b2\n3p(1{p)z1\nð3Þ\nWhere the three covariance terms are zero because of the assum-\nption of G and C independence. It results from equation (3) that\nthe proportion of total variance attributable to the marginal effect\nof the covariate (i.e.b\n2) can be defined as:\nb2\n2\n2p(1{p)b2\n1zb2\n2z2p(1{p)b2\n3z1\nð4Þ\nSimilarly, the proportion of total variance attributable to the SNP-\ncovariate interaction (i.e.b3) can be defined as:\n2b2\n3p(1{p)\n2p(1{p)b2\n1zb2\n2z2p(1{p)b2\n3z1\nð5Þ\nLevene’s test for equality of variance\nLevene’s test [12] is used to test if k samples have equal\nvariances and is less sensitive to deviation from normality than the\nAuthor Summary\nFinding gene–gene and gene–environment interactions is\na major challenge in genetics. In this report, we propose a\nnovel method to help detect these interactions. This\nmethod works by first identifying a subset of genetic\nvariants more likely to be involved in genetic interactions\nand then testing these variants for interaction effects.\nUsing this method, we were able to identify three\npreviously unknown genetic interactions. The first interac-\ntion involves a measure of body fat and a genetic variant\nof the LEPR gene in the prediction of C-reactive protein\nconcentration, a marker of inflammation. The second\ninteraction involves the same measure of body fat and a\ngenetic variant of the PNPLA3 gene in the prediction of\nICAM-1 levels, also a marker of inflammation. These results\nare significant because bothLEPR and PNPLA3 are linked to\nthe biological response to increased body fat, and\ninflammation itself is known to be increased in obesity\nand is thought to contribute to its adverse health effect.\nFinally, a third interaction was identified between a genetic\nvariant of theICAM1 gene and smoking in the prediction\nof ICAM-1 levels. The ICAM1 gene encodes ICAM-1 itself\nand smoking is known to be an important determinant of\nICAM-1 concentrations.\nUsing Variance per Genotype to Detect Interactions\nPLoS Genetics | www.plosgenetics.org 2 June 2010 | Volume 6 | Issue 6 | e1000981\nalternative Bartlett test [13]. Indeed, use of Bartlett test with\nempirical data led to marked inflation of type I error and was not\npursued further (data not shown). The Levene test assesses the null\nhypothesis that the population variances are equal:\nH0: s1~s2~:::~sk\nHa: si=sj for at least one pair (i,j).\nGiven a variableY with sample of sizeN divided intok subgroups,\nwhere Ni is the sample size of theith subgroup, the Levene test\nstatistic is defined as:\nW~ (N{k) Pk\ni~1 Ni( /C22ZZi: {/C22ZZ:: )2\n(k{1) Pk\ni~1\nPNi\nj~1 (Zij{/C22ZZi: )2\nWhere Zij~DYij{/C22YYi: D with Yij the value of Y for thejth observation\nof theith subgroup, /C22YYi: the mean of theith subgroup, /C22ZZi: are the\ngroup means of theZij and /C22ZZ:: is the overall mean of theZij.\nThe Levene test rejects the hypothesis that the variances are\nequal if:\nWwF(a,k{1,N{k)\nWhere F(a,k{1,N{k) is the upper critical value of the F distribution\nwith k21 andN2k degrees of freedom at a significance level ofa.\nSimulations of interaction effects\nWe used simulations to estimate the power of Levene’s test to\ndetect differences in variance of a quantitative trait between\nindividuals of differing genotypes. We first simulated the case of a\nSNP (denoted SNP\n1) interacting with a covariate (denoted C1)i n\ndetermining the value of a quantitative trait (denoted Y; see\nFigure 1). We assumed the main effect of SNP1 to be null in all\nsimulations because it is expected to affect neither the within\ngenotype variance (see Equation 2) nor the power to detect the\ninteraction. For simplicity, only results from the additive genetic\nmodel (assuming an additive contribution of each minor allele; see\nEquation 1) are shown but similar conclusions can be derived from\nmore general models of association. Under a range of models for\nthe main effect of C\n1 (on the quantitative trait), allelic frequency of\nSNP1, and interaction between SNP1 and C1, we tested the power\nof Levene’s test to reject the null hypothesis that the variance of Y\ndoes not vary between subsets of individuals with differing\ngenotypes (of SNP\n1). In all simulations, the quantitative trait was\nassumed to have a normally distributed error term with mean\nequal to zero and variance equal to 1. The covariate was normally\ndistributed with mean equal to zero and variance equal to 1.\nInteractions are expected to be modest at best and simulations\nwere therefore restricted to interaction effects explaining up to 1%\nof the quantitative trait’s total variance. Each condition was\nsimulated 1,000 times using 15,000 individuals unless otherwise\nspecified. In a second set of simulations, we tested the power of\nLevene’s test of equality of variance to detect SNP-SNP\ninteractions. These simulations are based on a model similar to\nthe one previously introduced, with the exception that the\nnormally distributed covariate (C\n1) is replaced by a second,\nindependent, SNP (denoted SNP2). To simplify simulations, both\nSNPs were assigned the same allelic frequency as well as the same\nmain effect (i.e. SNP-Y association). Varying the strength of the\nSNP\n1- SNP2 interaction, we simulated each condition 1,000 times\nusing 15,000 individuals unless otherwise specified.\nVariance prioritization\nLeveraging two observations that (1) the signature of a SNP-\ncovariate interaction may be inequality of variance between SNP\nFigure 1. Model of interaction.\ndoi:10.1371/journal.pgen.1000981.g001\nUsing Variance per Genotype to Detect Interactions\nPLoS Genetics | www.plosgenetics.org 3 June 2010 | Volume 6 | Issue 6 | e1000981\ngenotypes and (2) a test for inequality of variance is independent of\na subsequent direct test of interaction, we propose a novel method\nto prioritize SNPs for gene-gene and gene-environment interac-\ntion, termed ‘‘variance prioritization’’. This prioritization proce-\ndure first applies Levene’s test of variance equality to selects SNPs\nbelow a pre-specified threshold and then tests these ‘‘prioritized’’\nSNPs for gene-environment or gene-gene interaction using\nstandard linear regression models (see Figure 2), with Bonferroni\ncorrection only for the number statistical tests prioritized in the\nfirst step. Using simulation models, we explored the power of\nvariance prioritization and compared it to an exhaustive search for\ninteraction, without prior prioritization, followed by Bonferroni\ncorrection for multiple hypothesis testing.\nIndependence of variance per genotype from estimates of\ninteraction effects under the null of no interaction is important\nbecause the validity of the method rests on having correct type I\nerror. A proof of independence between variance per genotype\nand estimation of interaction effect under the null of no interaction\nis presented in Text S1 and Figure S1.\nWGHS participants\nThe study population was derived from the Women’s Genome\nHealth Study (WGHS) [14]. Briefly, participants in the WGHS\ninclude American women from the Women’s Health Study (WHS)\nwith no prior history of cardiovascular disease, cancer, or other\nmajor chronic illness who also provided a baseline blood sample at\nthe time of study enrollment from which genomic DNA was\nextracted [15]. Individuals with self-reported diabetes at enroll-\nment (or with glycated hemoglobin.7%) or taking lipid lowering\nmedication were excluded from analysis.\nAll baseline blood samples underwent measurement for high-\nsensitivity CRP (hsCRP) via a validated immunoturbidometric\nmethod (Denka Seiken, Tokyo, Japan). CRP is an inflammatory\nbiomarker with strong prognostic value for development of\nmetabolic syndrome, diabetes, myocardial infarction, and stroke.\nLog-transformed CRP levels were used in all analyses. Soluble\nICAM-1 is an inflammatory marker that has been associated with\nseveral common diseases such as diabetes, heart disease, stroke\nand malaria. Circulating plasma sICAM-1 concentrations were\ndetermined using a commercial ELISA assay (R&D Systems,\nMinneapolis, Minn.) The environmental factors tested for\ninteraction included self-reported body mass index, menopause\nstatus, hormone replacement therapy use, smoking, age and\nexercise, expressed as quintiles of total energy expenditure spent\nfrom all recreational activities.\nGenotyping\nDNA samples were genotyped with the Infinium II technology\nfrom Illumina. Either the HumanHap300 Duo-Plus chip or the\ncombination of the HumanHap300 Duo and I-Select chips were\nused. In either case, the custom content was identical and\nconsisted of candidate SNPs chosen without regard to allele\nfrequency to increase coverage of genetic variation with impact on\nbiological function including metabolism, inflammation or cardio-\nvascular diseases. Genotyping at 318,237 HumanHap300 Duo\nSNPs and 45,571 custom content SNPs was attempted, for a total\nof 363,808 SNPs. Genetic context for all annotations are derived\nfrom human genome build 36.1 and dbSNP build 126.\nSNPs with call rates,90% were excluded from further analysis.\nLikewise, all samples with percentage of missing genotypes higher\nthan 2% were removed. Among retained samples, SNPs were further\nevaluated for deviation from Hardy-Weinberg equilibrium using an\nexact method and were excluded when the P-value was lower than\n10\n26. SNPs with minor allele frequency.1% in Caucasians were\nused for analysis. 339,596 SNPs were left after quality control. All\nstatistical analyses were done with R, unless specified otherwise. All\nanalyses were performed on individuals of self-reported Caucasian\nancestry, with confirmation using a principal component analysis. A\ntotal of 21,799 individuals were included in our final dataset.\nResults\nBuilding on the theoretical observation that the within genotype\nvariance of a quantitative trait will vary when a genetic interaction\nFigure 2. The variance prioritization procedure.\ndoi:10.1371/journal.pgen.1000981.g002\nUsing Variance per Genotype to Detect Interactions\nPLoS Genetics | www.plosgenetics.org 4 June 2010 | Volume 6 | Issue 6 | e1000981\nis present, we explored the power of Levene’s test of equality of\nvariance to detect interactions. We first tested the power of\nLevene’s test to detect a SNP (denoted SNP\n1) interacting with a\nsingle covariate, C1 (see Figure 1). As shown in Figure 3, the power\nof Levene’s test to identify a SNP as interacting with a covariate\nwas modest in most situations. For example, when the interaction\neffect explained 0.4% of the variance of a quantitative trait, the\nallelic frequency was 0.2 and the covariate was associated with the\nquantitative trait withb\n2 = 0.3 (explaining 8.2% of the variance;\nsee Figure 3B), the power of Levene’s test to identify a SNP as\n‘‘interacting’’ at P,0.05 was 82.5% whereas the power of linear\nregression to identify the interaction at P,1.5610\n27 was 99.6%.\nIn other words, even after accounting for 340,000 tests using\nBonferroni correction, testing for gene-environment interactions\nwith linear regression was more powerful than testing for\ninequality of variance between genotypes at nominal significance.\nNevertheless, as can be observed in Figure 3, there were\nsituations involving small interaction effects explaining less than\n0.4% of the variance for which a nominally significant Levene’s\ntest was more powerful than linear regression testing (after\nmultiple hypothesis correction). Because SNP effects on variance\nper genotype is independent of the estimates of interaction effects,\nvariance prioritization could provide a method for decreasing the\nmultiple testing burden in these situations, with ensuing increased\npower. To test the power of variance prioritization for small\ninteraction effects, we performed further simulations in which we\nvaried Levene’s test P-value threshold used to prioritize SNPs for\ninteraction testing (see Figure 4). For these simulations, we used\nFigure 3. Power to detect a SNP–covariate interaction effect as function of the proportion of variance explained by the interaction.\nEach condition was simulated 1,000 times with 15,000 individuals according to the model shown in Figure 1. MAF refers to the minor allele frequency\nof SNP1 and b2 refers to theb coefficient of the C1-Y association. In all cases, SNP1 had no marginal effect (i.e.b1 = 0). Upper panel: Power to identify\nSNP1 as an ‘‘interacting’’ SNP using Levene’s test with a P-value threshold of 0.05 (black), 0.01 (red) and 1.561027 (green; to account for 340,000 tests\nusing Bonferroni correction). Also shown is the power to detect the interaction itself with a linear regression interaction P-value cut-off of 1.561027\n(blue). Lower panel: The variance per genotype is illustrated as a function of the fraction of the total variance of the quantitative trait explained by the\ninteraction. The homozygous major allele genotype is drawn in black, the heterozygous genotype in red and the homozygous minor allele genotype\nin green.\ndoi:10.1371/journal.pgen.1000981.g003\nUsing Variance per Genotype to Detect Interactions\nPLoS Genetics | www.plosgenetics.org 5 June 2010 | Volume 6 | Issue 6 | e1000981\nFigure 4. Power of variance prioritization as function of the Levene’s test P-value prioritization threshold.Each condition was\nsimulated 2,000 times with 15,000 individuals. For each condition, the Levene’s test P-value threshold was varied from 0 to 1 and the power of\nvariance prioritization calculated after accounting for multiple testing (assuming 340,000 SNPs were initially tested), as illustrated by black lines. SNP-\ncovariate interactions were simulated in (A–D). In the case of SNP-covariate interactions, all prioritized SNPs were tested for interaction with the\ncovariate. Red lines represent the power to detect the interaction with linear regression when correcting for all 340,000 tested SNPs (P,1.5610\n27). In\nUsing Variance per Genotype to Detect Interactions\nPLoS Genetics | www.plosgenetics.org 6 June 2010 | Volume 6 | Issue 6 | e1000981\nthe same parameters as in Figure 3B (Figure 4A and 4B) and\nFigure 3D (Figure 4C and 4D), fixingb 3 such that the interaction\nexplained 0.1% or 0.15% of total variance. We subsequently\ninterrogated the prioritized SNPs for interaction effects using\nlinear regression and applied a Bonferroni correction assuming\n340,000 SNPs were initially tested (ex.: if Levene’s test P-value cut-\noff is 0.01 then upon further interaction testing a SNP will be\ndeemed significant if its interaction P-value is ,0.05/\n(0.016340,000)). We then compared the results of variance\nprioritization with a ‘‘conventional’’ method correcting for\n340,000 tests. Each condition was simulated 2,000 times. As\nillustrated in Figure 4A–4D, variance prioritization was more\npowerful than conventional methods to detect gene-environment\ninteractions, with the increase in power dependent on the Levene’s\ntest P-value threshold used. In almost all cases, the power was at\nleast equal to performing an exhaustive search for gene-\nenvironment interactions with all 340,000 SNPs.\nSimilar simulations were performed for SNP-SNP interactions\n(see Figure 5, and Figure 4E–4H). For simplicity, the allelic\nfrequency of both SNPs and their main effect on the quantitative\ntrait was set to be equal. To account for all possible pairwise SNP-\nSNP interactions between 340,000 SNPs, the ‘‘conventional’’ P-\nvalue threshold was set at 4.3610\n213. Figure 5 illustrates the\npower that either SNP will have a Levene’s test P-value lower than\nthe pre-specified cut-off, and compares it to the power to detect\nthe interaction by exhaustive linear regression testing. Once again,\n(A,B), the minor allele frequency was set at 0.2, the covariate-Y regression coefficient (i.e.b2) at 0.3, andb3 was chosen such that the proportion of\nvariance explained by the interaction was 0.1% and 0.15%, respectively. These conditions match those of Figure 3B. In (C,D), the minor allele\nfrequency was set at 0.1, the covariate-Y regression coefficient (i.e.b\n2) at 0.7, andb3 was chosen such that the proportion of variance explained by the\ninteraction was 0.1% and 0.15%, respectively. These conditions match those of Figure 3D. SNP–SNP interactions were simulated in (E–H). As in\nFigure 5, the allelic frequency of both SNPs was set to be equal, as well as the SNP-Y regression coefficient (i.e.b1 and b2). For SNP–SNP interactions,\nall prioritized SNPs were tested against all SNPs (not limited to prioritized ones). Red lines represent the power to detect the interaction with linear\nregression when correcting for all pairwise interactions between 340,000 SNPs (P,4.3610213). In (E,F), the minor allele frequency was set at 0.1, the\nSNP-Y regression coefficient at 0.4, andb3 was chosen such that the proportion of variance explained by the interaction was 0.2% and 0.25%,\nrespectively. These conditions match those of Figure 5A. In (G,H), the minor allele frequency was set at 0.2, the SNP-Y regression coefficient at 0.1,and\nb3 was chosen such that the proportion of variance explained by the interaction was 0.2% and 0.25%, respectively. These conditions match those of\nFigure 5B.\ndoi:10.1371/journal.pgen.1000981.g004\nFigure 5. Power to detect a SNP–SNP interaction effect as function of the proportion of variance explained by the interaction.Each\ncondition was simulated 1,000 times with 15,000 individuals. For simplicity, both SNPs were assigned the same allelic frequency (MAF) as well as the\nsame SNP-Yb coefficient (i.e.b\n1 = b2). Upper panel: Power to identify either SNP1 or SNP2 as an ‘‘interacting’’ SNP using Levene’s test with a P-value\nthreshold of 0.05 (black), 0.01 (red) and 1.561027 (green; to account for 340,000 tests using Bonferroni correction). Also shown is the power to detect\nthe interaction itself with a linear regression interaction P-value cut-off of 4.3610213 (blue; chosen to account for all possible pairwise interactions\nbetween 340,000 SNPs). Lower panel: The variance per genotype is illustrated as a function of the fraction of the total variance of the quantitative\ntrait explained by the interaction. The homozygous major allele genotype is drawn in black, the heterozygous genotype in red and the homozygous\nminor allele genotype in green.\ndoi:10.1371/journal.pgen.1000981.g005\nUsing Variance per Genotype to Detect Interactions\nPLoS Genetics | www.plosgenetics.org 7 June 2010 | Volume 6 | Issue 6 | e1000981\nthe power to detect either SNP with a nominally significant\nLevene’s test was higher than the power to identify the SNP-SNP\ninteraction using exhaustive linear regression testing when the\ninteraction effect was weak, providing the basis for prioritization of\nSNPs with Levene’s test. Results of variance prioritization are\nshown in Figure 4E and 4F and Figure 4G and 4H, matching the\nconditions of Figure 5A and 5B, respectively, and fixing B\n3 such\nthat 0.2% or 0.25% of the variance was explained by the\ninteraction. In these simulations, all SNPs with Levene’s test P-\nvalue lower than the specified threshold were prioritized and tested\nfor interaction against all other SNPs, prioritized or not (with\nappropriate correction for multiple hypothesis testing). This\napproach was shown (by simulations) to be more powerful than\ntesting for pairwise interactions between Levene’s test prioritized\nSNPs only, which was underpowered as compared to an\nexhaustive search (data not shown). As illustrated in Figure 4E,\nthe power of variance prioritization was superior to exhaustive\nsearch under specific conditions. For example, when a Levene’s P-\nvalue lower than 0.1 was chosen as the prioritization threshold, the\npower of variance prioritization was 9.05% as compared to 7.30%\nwhen testing all possible pairwise interactions between 340,000\nSNPs. However, variance prioritization was associated with\ndecreased power in certain conditions, as illustrated in Figure 4G\nand 4H.\nTo empirically test whether some SNPs exhibit inequality of\nvariance between genotypes and whether these effects might be\ndue to interactions, we applied Levene’s test of equality of variance\nto ongoing genome scans of two inflammatory markers, C-reactive\nprotein (CRP) and soluble ICAM-1 (sICAM-1). Only SNPs with\ngenome-wide significant Levene’s P-value were selected for\nsubsequent study in order to ensure they represent true positives.\nFrom the analysis of our sample of 21,799 women, 23 SNPs had a\nLevene’s test P-value lower than 1.5610\n27 for CRP (all clustering\nnear theLEPR gene on chromosome 1). Because theLEPR SNPs\nare in linkage disequilibrium, only rs12753193 will be further\nconsidered since it had the most significant Levene’s test P-value.\nTwo SNPs, the PNPLA3 SNP rs738409 and the ICAM1 SNP\nrs1799969, had genome-wide significant Levene’s test P-value for\nsICAM-1 (see Figure 6 and Table S1). To further characterize\nthese SNPs, we then tested all pairwise interactions with the\n339,595 remaining SNPs as well as environmental covariates,\nusing linear regression. No SNP-SNP interaction was observed\nafter correction for multiple hypothesis testing. Three SNP-\nenvironment interactions were significant after correction for\nmultiple hypothesis testing (P ,0.05/(3 SNPs 66 traits); see\nTable 1). The LEPR SNP rs12753193 interacted with BMI in\nthe prediction of CRP levels (P = 7.2610\n210), the ICAM1 SNP\nrs1799969 interacted with smoking status in the prediction of\nsICAM1 levels (P = 4.8610\n29) and the PNPLA3 SNP rs738409\ninteracted with BMI in the prediction of sICAM1 levels\n(P = 1.6610\n27).\nWe sought to determine the contribution of the three\ninteractions to Levene’s test of inequality of variance. While\nLevene’s test P-value was 1.6 610229 for the LEPR SNP\nrs12753193 in the CRP analysis, the P-value was 9.1610221 after\nadjustment for the interaction for BMI. Similarly, Levene’s test P-\nvalues were 2.1 610\n29 for the ICAM1 SNP rs1799969 and\n1.9610210 for the PNPLA3 SNP rs738409 in the sICAM-1\nanalysis but were slightly less significant after adjustment for the\nintraction with BMI and smoking status, respectively, at 3.3610\n29\nand 1.661027. Overall, these interactions explained 0.18% of\nCRP total variance, and 0.16% and 0.13% of sICAM-1 total\nvariance for the ICAM1 and PNPLA3 interactions, respectively.\nNeither the LEPR SNP rs12753193 nor the PNPLA3 SNP\nrs738409 was associated with BMI (P.0.05). The ICAM1 SNP\nrs1799969 was not associated with smoking status (P.0.05). These\ndata collectively suggest that individual interactions are likely to\nhave modest effects, and that additional covariates and/or SNPs\nmight interact with the validated SNP.\nDiscussion\nGenetic effects on the variance of quantitative traits have been\nlargely ignored so far in the genetic analysis. As shown in this\nreport, differences in the variance per genotype can reflect\ninteraction effects and these differences can be leveraged to\nFigure 6. Quantile–quantile plots.Illustrated in (A) is the quantile-quantile plot of Levene’s test of inequality of variance P-values applied to log-\nCRP for 339,596 SNPs in our set of 21,799 individuals. Illustrated in (B) is the quantile-quantile plot of Levene’s test P-values applied to sICAM-1 inthe\nsame set of individuals.\ndoi:10.1371/journal.pgen.1000981.g006\nUsing Variance per Genotype to Detect Interactions\nPLoS Genetics | www.plosgenetics.org 8 June 2010 | Volume 6 | Issue 6 | e1000981\nprioritize SNPs for interaction testing. The proposed method,\nvariance prioritization, presents the distinct advantage that it does\nnot rely on the marginal effect of SNPs on the means to prioritize\nthem. Importantly, it can be used in combination with\nprioritization based on marginal effects (on the means) if it is\nassumed all interacting SNPs have a main effect on the trait of\ninterest. In such case, combining variance prioritization to\nprioritization based on a pre-defined marginal effect P-value\nprovides the greatest power as compared to each procedure\nindividually, if the assumption that interacting SNPs have main\neffects is true (data not shown). Another interesting property of this\nmethod is the fact that the interacting covariate need not be\nmeasured or even known to arouse suspicion of an interaction\neffect, perhaps leading to novel biological insight.\nThe goal of any genetic prioritization method is to form a subset\nof genetic variants enriched for the effect of interest. Variance\nprioritization results in substantial reduction in multiple hypothesis\ncorrection and hence increases power by using the information\nembedded within the variance per genotype, which we showed is\nindependent from subsequent interaction testing. In this case, a\nfrequentist approach was adopted since prior knowledge on the\nnature of the contribution of genetic interactions to complex traits\nis currently scarce. Our simulations have shown that the optimal\nLevene’s test P-value threshold for variance prioritization will\ndepend upon the allelic frequency, sample size, association of the\ncovariate with the quantitative trait, and expected strength of the\ninteraction. In most cases, all of these parameters can be directly\nobserved with the exception of the interaction strength. The\noptimal threshold can therefore be empirically selected through\nsimulations when the potentially interacting covariate (or SNP) is\ncharacterized and the expected interaction effect size defined.\nInequality of variance between genotypes could be the result of\nfactors other than interactions, such as increased variability.\nFurthermore, the heteroscedacity of variances also depends on an\nassumption of homogeneity of variances within genotype, which\ncould be violated if variances tend to be proportional to means.\nThis might reflect an inappropriate choice of scale for the\nphenotype and a variance-stabilizing transform like the log or\nsquare root might then be indicated. Linkage disequilibrium with\nvariants of large effect sizes could also theoretically lead to\ninequality of variance between genotypes. Conversely, non-\nadditive interactions or SNPs with a multiplicity of interactions\nmay not result in deviation of Levene’s test. Failure to prioritize\n‘‘interacting’’ SNPs or prioritization of ‘‘non-interacting’’ SNPs\ncan theoretically lead to decreased statistical power but should not\nlead to inflated type I error since the first step is a screening test\nfollowed by confirmatory analysis. While care was taken to\nsimulate models with plausible effect sizes (i.e. explaining less than\n1% of total variance), the scenarios described in this report\nundoubtedly represent simplified situations. Nevertheless, these\nsimulations suggest that variance prioritization has increased\npower to detect genetic interactions of very modest strength in\nsituations where conventional methods perform poorly.\nGenetic effects on variance in an empirical dataset led to the\nidentification of three novel interactions. Given the strength of the\nobserved interactions, they would have also been identified with\ntraditional methods. The significance of these results resides in (1)\nthe existence of SNPs with inequality of variance between\ngenotypes at genome-wide significance and (2) the presence of\nbiologically plausible interactions between these SNPs and\nenvironmental factors. The first interaction involved the leptin\nreceptor SNP rs12753193 in the prediction of CRP. Leptin is a\nprotein synthesized and secreted by the adipose tissue whose main\nfunction is to regulate appetite trough interaction with the leptin\nreceptor in the hypothalamus [16]. As such, leptin levels are\ndirectly proportional to BMI and patients deficient in either leptin\nor leptin receptor are characterized by marked obesity [17].\nInterestingly, LEPR is also expressed by the liver, the source of\ncirculating plasma CRP, and physiological concentrations of leptin\nstimulate expression of CRP in primary hepatocytes [18]. This\nmight explain why only a small fraction of the inequality of\nvariance between theLEPR SNP rs12753193 genotypes was due\nto the interaction with BMI: the statistical interaction may only\ncapture a small fraction of the underlying biological interaction\nbetween leptin levels and its receptor.\nThe LEPR SNP rs12753193 is known to be associated with\nCRP concentration at a genome-wide level [19]. The minor allele\nof rs12753193 (i.e. ‘‘G’’) is associated with lower levels of CRP and\nwas shown in this report to be associated with a greater effect of\nBMI on CRP concentrations. This confirms the soundness of using\nmarginal effects of SNPs to select a subset for interaction testing.\nNo other SNP with genome-wide significance for CRP showed\nevidence of inequality of variance between genotypes (excluding\nSNPs in linkage disequilibrium with rs12753193).\nThe second interaction observed involved the ICAM1 SNP\nrs1799969 in the prediction of sICAM-1 levels. The latter SNP is a\ncoding non-synonymous SNP (G241R) known to be associated\nwith sICAM-1 levels [20–22] and was shown in this report to\ninteract with smoking status. Smoking is a very strong determinant\nof sICAM-1 levels (explaining up to 13% of sICAM-1 total\nvariance) and was associated with a stronger effect of rs1799969 in\nWGHS. Interestingly, an interaction between another ICAM1\nnon-synonymous SNP (rs5498, r\n2 = 0.17 with rs1799969) and\nsmoking was recently described with regards to susceptibility to\ncoronary artery disease [23].\nThe third interaction identified involved the PNPLA3 SNP\nrs738409 in the prediction of sICAM-1. PNPLA3 encodes a\nprotein of unknown function that belongs to the patatin-like\nTable 1.Gene–environment interactions.\nTrait\nInteracting\nSNP MAF Chr\nPosition\n(Kb)\nNearest\nGene Type Covariable\nVariance of\nA1A1* (N)\nVariance of\nA1A2* (N)\nVariance of\nA2A2* (N)\nLevene’s\nP-value\nInteraction\nP-value\nCRP\nrs12753193 0.38 1 65942.3 LEPR - BMI 1.27 (8491) 1.47 (10126) 1.68 (3167) 1.6E-29 7.2E-10\nsICAM-1\nrs1799969 0.11 19 10255.8 ICAM1 Missense Smoking 6621 (17063) 5316 (4421) 4104 (300) 2.1E-09 4.8E-09\nrs738409 0.22 22 42656.1 PNPLA3 Missense BMI 6087 (13098) 6743 (6965) 9205 (1110) 1.9E-10 1.6E-07\n*A1A1: Homozygous Major Allele; A1A2: Heterozygous; A2A2: Homozygous Minor Allele.\ndoi:10.1371/journal.pgen.1000981.t001\nUsing Variance per Genotype to Detect Interactions\nPLoS Genetics | www.plosgenetics.org 9 June 2010 | Volume 6 | Issue 6 | e1000981\nphospholipase family. The methionine allele of the missense\nPNPLA3 SNP rs738409 (Ile148Met) has recently been associated\nwith increased hepatic fat levels, hepatic inflammation and plasma\nlevels of liver enzymes (traits often linked to insulin resistance and\nobesity) [24]. Interestingly, that same variant has been associated\nwith insulin secretion in response to oral glucose tolerance test\n[25]. Levels of the inflammatory marker sICAM-1 are known to\nbe correlated with insulin resistance and obesity [26]. Consistent\nwith this literature, the methionine allele was associated with\nsICAM-1 itself (P = 2.2610\n27; Beta = 4.9 ng/mL per minor allele)\nwhile being associated with a greater effect of BMI on sICAM-1\nlevels.\nIn this report, we demonstrated that the presence of gene-gene\nor gene-environment interactions can result in changes in variance\nof a quantitative trait per genotype and that these changes can be\nexploited to prioritize SNPs for interaction testing. We used this\nproperty of quantitative trait interactions on a real dataset and\ndiscovered three new, biologically relevant, interactions. Variance\nprioritization presents two advantages over other methods. First, it\ndoes not depend on the marginal effect of SNPs on the means.\nSecond, it can identify SNPs likely to be involved in an interaction\neven when the interacting genetic or environmental covariate(s) is\nnot measured. For instance, had BMI or smoking status not been\nassessed in the WGHS, theLEPR SNP rs12753193, the ICAM1\nSNP rs1799969 and thePNPLA3 SNP rs738409 would still have\nbeen selected as candidates for interaction effects, perhaps leading\nto novel biological hypotheses.\nSupporting Information\nFigure S1 (A) QQ-plot of interaction P values in the presence of\ninequality of variance between genotypes (95% CI). (B) QQ-plot of\ninteraction P values when selecting SNPs with Leneve’s P,0.05\n(95% CI).\nFound at: doi:10.1371/journal.pgen.1000981.s001 (0.61 MB\nTIF)\nTable S1 SNPs with Levene’s test of inequality of variance P-\nvalue lower than 1.561027 from the analysis of C-reactive protein\nand soluble ICAM-1 in 21,799 women from the WGHS.\nFound at: doi:10.1371/journal.pgen.1000981.s002 (0.07 MB\nDOC)\nText S1 Proof of independence between variance per genotype\nand estimation of interaction effect under the null of no\ninteraction.\nFound at: doi:10.1371/journal.pgen.1000981.s003 (0.07 MB\nDOC)\nAcknowledgments\nWe thank the study research team and the women who have participated\nin the study.\nAuthor Contributions\nConceived and designed the experiments: GP. Performed the experiments:\nGP. Analyzed the data: GP. Contributed reagents/materials/analysis tools:\nGP PMR DIC. Wrote the paper: GP NRC PMR DIC.\nReferences\n1. Cordell HJ (2002) Epistasis: what it means, what it doesn’t mean, and statistical\nmethods to detect it in humans. Hum Mol Genet 11: 2463–2468.\n2. Nelson MR, Kardia SL, Ferrell RE, Sing CF (2001) A combinatorial\npartitioning method to identify multilocus genotypic partitions that predict\nquantitative trait variation. Genome Res 11: 458–470.\n3. Ritchie MD, Hahn LW, Moore JH (2003) Power of multifactor dimensionality\nreduction for detecting gene-gene interactions in the presence of genotyping\nerror, missing data, phenocopy, and genetic heterogeneity. Genet Epidemiol 24:\n150–157.\n4. Ritchie MD, White BC, Parker JS, Hahn LW, Moore JH (2003) Optimization of\nneural network architecture using genetic programming improves detection and\nmodeling of gene-gene interactions in studies of human diseases. BMC\nBioinformatics 4: 28.\n5. Bochdanovits Z, Sondervan D, Perillous S, van Beijsterveldt T, Boomsma D,\net al. (2008) Genome-wide prediction of functional gene-gene interactions\ninferred from patterns of genetic differentiation in mice and men. PLoS ONE 3:\ne1593. doi:10.1371/journal.pone.0001593.\n6. Millstein J, Conti DV, Gilliland FD, Gauderman WJ (2006) A testing framework\nfor identifying susceptibility genes in the presence of epistasis. Am J Hum Genet\n78: 15–27.\n7. Marchini J, Donnelly P, Cardon LR (2005) Genome-wide strategies for detecting\nmultiple loci that influence complex diseases. Nat Genet 37: 413–417.\n8. Evans DM, Marchini J, Morris AP, Cardon LR (2006) Two-stage two-locus\nmodels in genome-wide association. PLoS Genet 2: e157. doi:10.1371/\njournal.pgen.0020157.\n9. Putt W, Palmen J, Nicaud V, Tregouet DA, Tahri-Daizadeh N, et al. (2004)\nVariation in USF1 shows haplotype effects, gene : gene and gene : environment\nassociations with glucose and lipid parameters in the European Atherosclerosis\nResearch Study II. Hum Mol Genet 13: 1587–1597.\n10. Cho YM, Ritchie MD, Moore JH, Park JY, Lee KU, et al. (2004) Multifactor-\ndimensionality reduction shows a two-locus interaction associated with Type 2\ndiabetes mellitus. Diabetologia 47: 549–554.\n11. Murcray CE, Lewinger JP, Gauderman WJ (2009) Gene-environment\ninteraction in genome-wide association studies. Am J Epidemiol 169: 219–226.\n12. Levene H Contributions to Probability and Statistics: Essays in Honor of Harold\nHotelling; Olkin et al., editor: Stanford University Press.\n13. NIST/SEMATECH e-Handbook of Statistical Methods.\n14. Ridker PM, Chasman DI, Zee RY, Parker A, Rose L, et al. (2008) Rationale,\ndesign, and methodology of the Women’s Genome Health Study: a genome-\nwide association study of more than 25,000 initially healthy american women.\nClin Chem 54: 249–255.\n15. Ridker PM, Cook NR, Lee IM, Gordon D, Gaziano JM, et al. (2005) A\nrandomized trial of low-dose aspirin in the primary prevention of cardiovascular\ndisease in women. N Engl J Med 352: 1293–1304.\n16. Louis GW, Myers MG, Jr. (2007) The role of leptin in the regulation of\nneuroendocrine function and CNS development. Rev Endocr Metab Disord 8:\n85–94.\n17. Farooqi S, O’Rahilly S (2006) Genetics of obesity in humans. Endocr Rev 27:\n710–718.\n18. Chen K, Li F, Li J, Cai H, Strom S, et al. (2006) Induction of leptin resistance\nthrough direct interaction of C-reactive protein with leptin. Nat Med 12:\n425–432.\n19. Ridker PM, Pare G, Parker A, Zee RY, Danik JS, et al. (2008) Loci related to\nmetabolic-syndrome pathways including LEPR,HNF1A, IL6R, and GCKR\nassociate with plasma C-reactive protein: the Women’s Genome Health Study.\nAm J Hum Genet 82: 1185–1192.\n20. Pare G, Chasman DI, Kellogg M, Zee RY, Rifai N, et al. (2008) Novel\nassociation of ABO histo-blood group antigen with soluble ICAM-1: results of a\ngenome-wide association study of 6,578 women. PLoS Genet 4: e1000118.\ndoi:10.1371/journal.pgen.1000118.\n21. Ponthieux A, Lambert D, Herbeth B, Droesch S, Pfister M, et al. (2003)\nAssociation between Gly241Arg ICAM-1 gene polymorphism and serum\nsICAM-1 concentration in the Stanislas cohort. Eur J Hum Genet 11: 679–686.\n22. Puthothu B, Krueger M, Bernhardt M, Heinzmann A (2006) ICAM1 amino-\nacid variant K469E is associated with paediatric bronchial asthma and elevated\nsICAM1 levels. Genes Immun 7: 322–326.\n23. Sarecka-Hujar B, Zak I, Krauze J (2009) Interactions between rs5498\npolymorphism in the ICAM1 gene and traditional risk factors influence\nsusceptibility to coronary artery disease. Clin Exp Med 9: 117–124.\n24. Romeo S, Kozlitina J, Xing C, Pertsemlidis A, Cox D, et al. (2008) Genetic\nvariation in PNPLA3 confers susceptibility to nonalcoholic fatty liver disease.\nNat Genet 40: 1461–1465.\n25. Johansson LE, Lindblad U, Larsson CA, Rastam L, Ridderstrale M (2008)\nPolymorphisms in the adiponutrin gene are associated with increased insulin\nsecretion and obesity. Eur J Endocrinol 159: 577–583.\n26. Song Y, Manson JE, Tinker L, Rifai N, Cook NR, et al. (2007) Circulating levels\nof endothelial adhesion molecules and risk of diabetes in an ethnically diverse\ncohort of women. Diabetes 56: 1898–1904.\nUsing Variance per Genotype to Detect Interactions\nPLoS Genetics | www.plosgenetics.org 10 June 2010 | Volume 6 | Issue 6 | e1000981",
  "topic": "Trait",
  "concepts": [
    {
      "name": "Trait",
      "score": 0.754176676273346
    },
    {
      "name": "Biology",
      "score": 0.7278477549552917
    },
    {
      "name": "Quantitative trait locus",
      "score": 0.7094478607177734
    },
    {
      "name": "SNP",
      "score": 0.6943598985671997
    },
    {
      "name": "Single-nucleotide polymorphism",
      "score": 0.5924457907676697
    },
    {
      "name": "Genotype",
      "score": 0.5593650341033936
    },
    {
      "name": "Genetics",
      "score": 0.5337582230567932
    },
    {
      "name": "Genome-wide association study",
      "score": 0.4976024925708771
    },
    {
      "name": "Variance (accounting)",
      "score": 0.4891541302204132
    },
    {
      "name": "Genetic variation",
      "score": 0.4823824465274811
    },
    {
      "name": "Gene–environment interaction",
      "score": 0.46294817328453064
    },
    {
      "name": "Covariate",
      "score": 0.44921472668647766
    },
    {
      "name": "Computational biology",
      "score": 0.3717520833015442
    },
    {
      "name": "Gene",
      "score": 0.35442477464675903
    },
    {
      "name": "Statistics",
      "score": 0.2555305063724518
    },
    {
      "name": "Computer science",
      "score": 0.1273578405380249
    },
    {
      "name": "Mathematics",
      "score": 0.08982393145561218
    },
    {
      "name": "Programming language",
      "score": 0.0
    },
    {
      "name": "Accounting",
      "score": 0.0
    },
    {
      "name": "Business",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I98251732",
      "name": "McMaster University",
      "country": "CA"
    },
    {
      "id": "https://openalex.org/I2802834092",
      "name": "Population Health Research Institute",
      "country": "CA"
    },
    {
      "id": "https://openalex.org/I1283280774",
      "name": "Brigham and Women's Hospital",
      "country": "US"
    }
  ]
}