{
  "title": "Transformer son identité professionnelle : impact d’un programme deformation continue de soignants en éducation thérapeutique du patient",
  "url": "https://openalex.org/W1982786075",
  "year": 2008,
  "authors": [
    {
      "id": "https://openalex.org/A5062663916",
      "name": "Aline Lasserre Moutet",
      "affiliations": [
        "University of Geneva"
      ]
    },
    {
      "id": "https://openalex.org/A5043141260",
      "name": "Juliette Dupuis",
      "affiliations": [
        "University of Geneva"
      ]
    },
    {
      "id": "https://openalex.org/A5036301295",
      "name": "Monique Chambouleyron",
      "affiliations": [
        "University of Geneva"
      ]
    },
    {
      "id": "https://openalex.org/A5103553656",
      "name": "Grégoire Lagger",
      "affiliations": [
        "University of Geneva"
      ]
    },
    {
      "id": "https://openalex.org/A5107923495",
      "name": "Alain Golay",
      "affiliations": [
        "University of Geneva"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2061916314"
  ],
  "abstract": "\\n \\nContexte : Le Diplôme de formation continue en éducation thérapeutique du patient (DiFEP) décerné par la\\nFaculté de Médecine de l’Université de Genève a été créé en 1998 pour encourager la développement des compétences des soignants\\ndans l’accompagnement des personnes vivant avec une maladie chronique. Selon nous, l’Education Thérapeutique du\\nPatient (ETP) remet profondément en question le rapport soignant-soigné et incite le soignant à faire évoluer son identité professionnelle.\\nBut : Cette étude a pour objectif d’évaluer l’impact du DiFEP sur la transformation de l’identité professionnelle des\\nsoignants. \\nMéthode : Un questionnaire a été adressé aux 49 soignants diplômés ; 28 questionnaires nous ont été retournés\\n(57 %). \\nRésultats : Les résultats montrent que 65 % des soignants ont tout à fait évolué dans leur perception du rôle du patient\\ndans son traitement : de profane, celui-ci devient partenaire de soin ; 53 % des soignants témoignent d’une importante évolution\\nde leur perception de leur rôle : la relation thérapeutique est maintenant considérée comme un soin à part entière. Enfin,\\n44 % des soignants occupent de nouvelles responsabilités en lien direct avec l’éducation thérapeutique du patient au sein de leurs\\ninstitutions. \\nConclusion : La formation continue est donc l’occasion de transformations qui ont une portée identitaire. Les formateurs\\ndoivent se préoccuper non seulement des connaissances qu’ils transmettent mais aussi d’accompagner ces transformations\\nidentitaires.\\n",
  "full_text": "Pédagogie Médicale\nREVUE INTERNATIONALE FRANCOPHONE D’ÉDUCATION MÉDICALE\nRecherche et Perspectives\n83REVUE INTERNATIONALE FRANCOPHONE DʼÉDUCATION MÉDICALE\nT ransformer son identité professionnelle : impact d’un programme de\nformation continue de soignants en éducation thérapeutique du patient\nChanging professional identity : the impact of a programme for continuing education for\nhealth care practitioners in the field of therapeutic patient education\nRésumé Contexte : Le Diplôme de formation continue en éducation thérapeutique du patient (DiFEP) décerné par la\nFaculté de Médecine de l’Université de Genève a été créé en 1998 pour encourager la développement des compétences des soi-\ngnants dans l’accompagnement des personnes vivant avec une maladie chronique. Selon nous, l’Education Thérapeutique du\nPatient (ETP) remet profondément en question le rapport soignant-soigné et incite le soignant à faire évoluer son identité pro-\nfessionnelle. But :Cette étude a pour objectif d’évaluer l’impact du DiFEP sur la transformation de l’identité professionnelle des\nsoignants. Méthode : Un questionnaire a été adressé aux 49 soignants diplômés ; 28 questionnaires nous ont été retournés\n(57 %). Résultats : Les résultats montrent que 65 % des soignants ont tout à fait évolué dans leur perception du rôle du patient\ndans son traitement : de profane, celui-ci devient partenaire de soin ; 53 % des soignants témoignent d’une importante évolu-\ntion de leur perception de leur rôle : la relation thérapeutique est maintenant considérée comme un soin à part entière. Enfin,\n44 % des soignants occupent de nouvelles responsabilités en lien direct avec l’éducation thérapeutique du patient au sein de leurs\ninstitutions. Conclusion : La formation continue est donc l’occasion de transformations qui ont une portée identitaire. Les for-\nmateurs doivent se préoccuper non seulement des connaissances qu’ils transmettent mais aussi d’accompagner ces transformations\nidentitaires.\nMots-clés Education thérapeutique du patient ; formation des soignants ; identité professionnelle ;\nrelation thérapeutique.\nAbstract Context: The Diploma for Continuing Education in Therapeutic Patient Education (DiFEP), awarded by the\nFaculty of Medicine of the University of Geneva, was created since 1998 in order to promote the development of Health Care\nPractitioners (HCP) competences related to the accompaniment of chronically ill-patients. According to our point of view, the-\nrapeutic patient education deeply questions the relationship between the patient and the HCP and it prompts the HCP to bring\nabout some changes in his professional identity. Objectives:: The objective of this study is to evaluate the impact of the DiFEP\non the HCP’s professional identity transformation. Method: : A questionnaire was sent to 49 certified HCP; 28 questionnaires\nwere completed (57%).Results: : The results have showed that 65% of HCP have completely changed their perception regar-\nding the role of the patient in his treatment: from layman, the patient becomes a partner in his treatment. 53% of HCP have\nindicated an important evolution in their perception about their role: the therapeutic relation is now considered as a treatment\nin itself. Finally, 44% of HCP occupy new positions directly linked to therapeutic patient education in their institution.\nConclusion: Continuing education is therefore an opportunity for HCP professional identity transformation. Trainers must not\nonly be preoccupied by the importance of knowledge transmission, but they also must pass on these professional identity transfor-\nmations. \nKey words Therapeutic Patient Education; T raining of HCP; professional identity; therapeutic relationship.\nPédagogie Médicale 2008;9:83-93\nAline LASSERRE MOUTET1, Juliette DUPUIS2, Monique CHAMBOULEYRON1,\nGrégoire LAGGER1, Alain GOLAY1\n1- Service d’enseignement thérapeutique pour les maladies chroniques (SETMC), Faculté de Médecine, Université de Genève.\n2- Faculté de Psychologie et des Sciences de l’Education, Université de Genève.\nCorrespondance : Aline Lasserre Moutet, Service d’enseignement thérapeutique pour les maladies chroniques (SETMC) - \nHôpitaux universitaires de Genève - 24 rue Micheli-du-Crest - 1211 Genève 14, Suisse. Téléphone : 00 41 22 372 97 08. \nMailto:aline.lasserre@hcuge.ch.\nArticle disponible sur le site http://www.pedagogie-medicale.org ou http://dx.doi.org/10.1051/pmed:2008007\nRecherche et Perspectives\n84 PÉDAGOGIE MÉDICALE - Mai 2008 - Volume 9 - Numéro 2\nIntroduction\nDepuis une dizaine d’années, les programmes de forma-\ntion continue en éducation thérapeutique du patient se\ndéveloppent un peu partout en Europe. Ils font suite à la\npublication en 1998 d’un rapport de l’Organisation mon-\ndiale de la santé\n1, qui souligne la plus-value des pratiques\nd’éducation thérapeutique dans l’accompagnement des\npersonnes vivant avec une maladie chronique et propose\ndes recommandations pour la mise en œuvre de pro-\ngrammes de formation pour les soignants. C’est dans ce\ncontexte que l’Université de Genève a soutenu la création,\nau sein de la Faculté de médecine, d’un diplôme de forma-\ntion continue en éducation thérapeutique du patient\n(DiFEP). Dès le commencement, l’équipe pédagogique\ndu DiFEP s’est préoccupée de soutenir une réflexion sur\nl’identité du soignant spécialisé dans l’accompagnement\ndes patients chroniques. Loin d’être une boîte à outils\npour soignants démunis, l’éducation thérapeutique remet\nprofondément en question le rapport soignant-soigné\n2.\nElle invite le soignant à s’interroger sur son expertise, son\npouvoir et la légitimité de ses interventions en regard de\nl’autodétermination du patient.\nLe concept d’éducation du patient a émergé dans la pen-\nsée médicale au cours des années 1970 pour aider la per-\nsonne vivant avec une maladie chronique à mieux gérer sa\nmaladie et son traitement. Pendant longtemps, les pra-\ntiques éducatives sont restées surtout informatives : l’ob-\njectif était de transmettre au patient les connaissances sur\nla maladie, dont il aurait besoin pour se traiter au quoti-\ndien. L ’expert-soignant partageait ses connaissances avec le\npatient-profane. Au vu des résultats décevants et au\ncontact des sciences sociales, particulièrement des sciences\nde l’éducation, les pratiques éducatives se sont ensuite\naxées plus spécifiquement sur les comportements de trai-\ntement. La personne vivant avec une maladie chronique a,\ndès lors, été considérée comme un apprenant potentiel et\nla notion d’activité de l’apprenant a été valorisée dans tous\nles programmes d’éducation thérapeutique. Pour mieux\ngérer son traitement, il était dorénavant acquis que le\npatient devait acquérir des compétences\n3. En se centrant\nsur les comportements de traitement, les soignants ont\naussi découvert l’expérience du patient, ses croyances et ses\npeurs. Ils sont restés des experts tentant d’appréhender\nl’expérience du patient de manière positive, essayant donc\nde le considérer lui aussi comme un expert.\nL ’élargissement de l’éducation thérapeutique à des mala-\ndies chroniques comme l’obésité a ensuite élargi encore\nl’approche éducative. Les notions de changement et de\nmotivation ont pris une grande ampleur en regard de la\ncomplexité de la maladie\n4. Dans certains cas, les soignants\nont dû reconnaître, parfois douloureusement, leur propre\nimpuissance à motiver les patients à adopter des compor-\ntements plus adéquats pour leur santé. Ils ont été jusqu’à\nremettre en question leur expertise, permettant ainsi à une\nnouvelle forme du rapport soignant-soigné d’émerger : le\npartenariat de soin. Les soignants accompagnant des per-\nsonnes vivant avec des maladies chroniques sont,\naujourd’hui plus qu’hier, soucieux de les soutenir dans un\nprocessus d’autodétermination. Il s’agit alors d’aider la\npersonne à mobiliser ses ressources pour parvenir à inté-\ngrer la maladie et le traitement dans sa vie ; la clinique des\nmalades chroniques nous rappelle ainsi que « l’enjeu de\nleur processus d’adaptation psychosociale à la maladie est\nde se sentir suffisamment en bonne santé pour mener une\nvie qui soit la plus proche possible de la représentation\nqu’elles se font d’une vie “normale”»\n5. Nous sommes loin\nde la finalité de la compliance, aujourd’hui encore visée\npar un grand nombre de soignants. Aussi le partenariat de\nsoin repose-t-il sur le principe de la collaboration entre\npatients et soignants et sur la cocréation du projet théra-\npeutique dans le cadre d’un réel partenariat. Résolument\nfondée sur le respect, cette nouvelle figure du soin se carac-\ntérise principalement par « la sauvegarde des conditions\nd’existence et d’interaction des subjectivités au sein même\nd’une relation par essence asymétrique »\n6.\nDans les parcours professionnels, la formation initiale\nfonctionne comme un vecteur de construction profession-\nnelle. La formation continue aborde les mêmes champs de\nprofessionnalité mais offre de nouvelles perspectives qui\nengendrent des ébranlements identitaires et des remises en\nquestion\n7. Pouvant être conçue comme un complément à\nla formation initiale et comme une occasion de structurer\nles apprentissages expérientiels, la formation continue\nmodifie, au travers de nouveaux apports, la construction\nglobale de l’édifice personnel. L ’investigation de l’identité\nprofessionnelle a donc pour but de repérer les transforma-\ntions principales ayant eu lieu au cours de la formation. Si\nl’on convient que l’accompagnement des personnes vivant\navec une maladie chronique transforme le rapport entre le\nsoignant et le soigné, nous faisons l’hypothèse que le soi-\ngnant se formant à l’éducation thérapeutique dans le cadre\ndu DiFEP va évoluer dans les perceptions qu’il a, à la fois\ndu rôle du patient dans sa prise en charge et de son propre\nrôle. Nous nous intéressons à cette évolution et à la\nmanière avec laquelle les soignants décrivent le rapport\nsoignant-soigné à l’issue des trois années de la formation.\nPour que la transformation de leur identité professionnelle\npuisse véritablement s’opérer, il est nécessaire que les \nPédagogie Médicale\nREVUE INTERNATIONALE FRANCOPHONE D’ÉDUCATION MÉDICALE\nTransformer son identité professionnelle…\n85REVUE INTERNATIONALE FRANCOPHONE DʼÉDUCATION MÉDICALE\nsoignants formés soient reconnus par leurs pairs et leurs\ninstitutions. En effet, le fait de se reconnaître une identité\nprofessionnelle dépend de la nature des relations de pou-\nvoir dans l’espace de travail et de la place qu’y occupent la\npersonne et son groupe d’appartenance\n8. Nous nous\nsommes donc aussi intéressés à l’évolution des soignants\ndans leurs parcours professionnels après leur passage dans\nnotre formation. Nous considérons cet élément comme\nun indicateur de la reconnaissance institutionnelle des\npratiques d’éducation thérapeutique et de l’accueil qui est\nfait par ces mêmes institutions à la remise en question du\nrapport soignant-soigné. Notre étude a donc pour objectif\nd’évaluer l’impact du diplôme de formation continue en\néducation thérapeutique du patient sur la transformation\nde l’identité professionnelle des soignants ayant suivi le\nprogramme.\nMatériel et méthodes\nCaractéristiques et principes pédagogiques du diplôme\nde formation continue en éducation thérapeutique du\npatient (DiFED)\nLe DiFEP est un programme de formation continue en\ncours d’emploi. Au moment de l’étude, il comporte huit\nmodules de cinq jours répartis sur deux ans et deux\nmodules de trois jours au cours de la troisième année. Les\nmodules des deux premières années sont centrés sur les\nhuit compétences principales du soignant-éducateur :\nconnaître les caractéristiques de la maladie chronique et\ndu suivi à long terme et s’interroger sur son rôle profes-\nsionnel ; comprendre le patient pour mieux situer ses\nbesoins ; planifier une séquence éducative qui tient\ncompte des besoins et ressources du patient ; utiliser des\nstratégies pédagogiques adaptées aux différents contextes\néducatifs -individuel et groupe- ; évaluer l’éducation thé-\nrapeutique pour améliorer les compétences ; planifier un\nprojet d’éducation thérapeutique du patient ; renforcer la\nmotivation du patient à commencer et poursuivre son\nprojet d’éducation thérapeutique ; et gérer dynamique-\nment le suivi à long terme et s’interroger sur son rôle pro-\nfessionnel. La dernière année est centrée sur la mise en\nœuvre sur le terrain du projet de recherche-action en édu-\ncation thérapeutique que le participant aura conçu à l’aide\nd’un tuteur dès le début de sa formation.\nPréoccupés de permettre aux participants d’être acteurs de\nleur apprentissage, des modalités pédagogiques interac-\ntives et diversifiées sont proposées : groupes de travail,\nétudes de situation, mises en situation, ateliers d’expres-\nsion créatrice, etc. Elles sont rendues possibles par le nom-\nbre restreint de participants de chaque promotion (entre\n12 et 15 personnes). Au cours de la première année, plu-\nsieurs jours sont exclusivement consacrés au développe-\nment de compétences relationnelles (connaissances psy-\nchologiques et compétences de communication). Ce socle\npermet ensuite d’aborder la pédagogie et ses outils en res-\ntant centré sur le patient et ses besoins. Notre souci est de\ntravailler à une constante articulation entre la maîtrise\nnécessaire d’outils éducatifs et la réflexion critique sur les\nprincipes de l’éducation thérapeutique du patient, à savoir\nl’autonomie, le partenariat et le soutien à la transforma-\ntion du patient. C’est en effet au niveau de ces principes\nque la question de la transformation identitaire se pose.\nL ’adoption d’un modèle global d’approche des problèmes\nde santé par les professionnels\n9 les oblige à faire évoluer\nleurs représentations du rôle du patient et de leur propre\nrôle dans la relation de soins. Il nous semble que c’est à\ncette condition seulement qu’autonomie et partenariat se\ntraduiront concrètement dans les soins. L ’accompagnement\npersonnalisé de chaque participant par un membre de\nl’équipe pédagogique vise à soutenir le développement de\ncette posture dans la clinique.\nCe diplôme de formation continue offre, par ailleurs, la\npossibilité à tous les participants d’élaborer et de réaliser\nsur leur lieu de travail un projet de recherche-action dans\nle domaine de l’éducation thérapeutique du patient.\nChacun devra analyser les caractéristiques de son contexte\nde travail et les besoins spécifiques des patients et soi-\ngnants concernés, et créer un programme éducatif sur\nmesure.\nEnfin, le dispositif est conçu pour promouvoir l’autono-\nmie de l’apprenant. En sus des modalités pédagogiques\ninteractives et de l’accompagnement individualisé du pro-\njet de recherche-action, les responsables de formation veil-\nlent à rendre les évaluations transparentes et formatives\n(coconstruction ou mise à disposition des critères d’éva-\nluation, propositions de réajustements) et à tenir à la dis-\nposition des participants toutes les ressources nécessaires\npour qu’ils puissent résoudre leurs problèmes d’ordre\npédagogique ou institutionnel.\nProtocole de l’étude conduite auprès des participants \ndu DiFED\nEntretiens préalables\nDans un premier temps, quatre entretiens semi-structurés\nont été menés avec quatre soignants tirés au sort ayant\nobtenu le DiFEP . Les thèmes principaux étaient les sui-\nvants : apprentissages effectués au cours de la formation,\ntransfert de ces apprentissages dans la pratique et défini-\ntion du rôle de spécialiste en éducation thérapeutique.\nRecherche et Perspectives\n86 PÉDAGOGIE MÉDICALE - Mai 2008 - Volume 9 - Numéro 2\nFigure 1 :\nEvolution des perceptions du rôle du patient dans sa prise en charge\nConstruction du questionnaire et exploitation des réponses\nUn questionnaire a été développé à partir de ces thèmes et\ndu cadre théorique. Ce questionnaire explore :\n- trois dimensions en utilisant des questions fermées avec\ndes échelles de Likert de 1 (pas du tout) à 6 (tout à fait) :\nl’évolution de la perception qu’a le soignant du rôle du\npatient dans sa prise en charge, l’évolution de la percep-\ntion qu’a le soignant de son propre rôle et l’évolution du\nsoignant dans son contexte professionnel. Des questions\nouvertes permettent d’enrichir notre compréhension des\ntrois dimensions. Les données qualitatives ont été traitées\npar analyse de contenu thématique Les catégories d’ana-\nlyse ont été proposées par le premier auteur. Une\nrecherche de consensus s’est effectuée avec le second\nauteur ;\n- l’atteinte des objectifs spécifiques du programme et la\nmise en lumière des éléments qui contribuent à ce résultat,\négalement par le biais de questions fermées et de questions\nouvertes.\nT est du questionnaire\nQuatre autres participants ont été tirés au sort parmi ceux\nayant obtenu le DiFEP et le questionnaire leur a été sou-\nmis. Le temps requis pour le remplir a été relevé :\nmoyenne 41 minutes (34-49 mn). Un entretien a été\nconduit avec ces quatre participants de manière à vérifier\nla compréhension aux questions posées.\nPopulation questionnée\nUne version papier du questionnaire a été envoyée à \n49 soignants, ce qui correspond au nombre de personnes\ndiplômées au moment de la recherche ; 28 questionnaires\nont été retournés intégralement complétés (57 %). Ainsi,\nmalgré une relance téléphonique, 21 participants n’ont\npas répondu au questionnaire. Aucune indication n’est\ndisponible concernant ces non-réponses, ni le manque de\ntemps, ni l’éventuelle moindre importance accordée par\nles non répondants au DiFEP et à son impact dans leur\npratique clinique.\nLe tableau 1 présente les caractéristiques des 28 soignants\nrépondants, totalement représentatives de notre popula-\ntion générale des 49 soignants interrogés (homogénéité\ndes sous-groupes).\nRésultats\nLe patient partenaire de soin\nA l’issue de leur formation, 18 soignants (65 %) recon-\nnaissent que la formation les a tout à fait aidés à évoluer\ndans leur perception du rôle du patient dans sa prise en\ncharge, quatre soignants beaucoup (14 %), quatre soi-\ngnants passablement (14 %) et deux très peu (7 %)\n(figure 1).\nTableau 1 :\nCaractéristiques des répondants au questionnaire de l’étude\nAge Sexe Profession\n44 ans en moyenne\n+/- 6 ans\n20 femmes\n8 hommes\n12 infirmières, 9 médecins\n2 diététiciennes, 2 physiothérapeutes\n1 pharmacienne, 1 art-thérapeute\n1 psychologue\nNombre de réponses\nEvolution (1 = pas du tout, 6 = tout à fait)\nPédagogie Médicale\nREVUE INTERNATIONALE FRANCOPHONE D’ÉDUCATION MÉDICALE\nTransformer son identité professionnelle…\n87REVUE INTERNATIONALE FRANCOPHONE DʼÉDUCATION MÉDICALE\nLes questions ouvertes permettent d’affiner notre com-\npréhension du rapport soignant-patient vu par les soi-\ngnants formés au DiFEP . Les expressions utilisées par les\nsoignants au terme de leur formation pour décrire le\nrôle du patient dans sa maladie et son traitement ont été\nregroupées par thèmes ; elles sont présentées dans le\ntableau 2 . Les catégories d’analyse émergent donc du\ndiscours des participants ainsi que de l’évolution histo-\nrique du rapport soignant-soigné décrite et référencée\nci-dessus où l’on voyait qu’aux trois époques - années 70\ncentrées sur l’information du malade ; années 80 et 90\npréoccupées par l’acquisition par le patient de compé-\ntences d’autogestion de la maladie et du traitement ; et\nplus dernièrement élargissement de la notion de compé-\ntence au soutien à l’autodétermination du patient - \ncorrespondait une nouvelle figure du rapport soignant-\nsoigné. L ’analyse révèle donc trois modalités possibles\ndu rapport soignant-soigné : « expert-profane »,\n« expert-expert » et « partenaires de soin ».\nTableau 2 :\nExpressions utilisées par les soignants pour décrire le rôle du patient \ndans sa prise en charge et leur classement en fonction des trois modalités relationnelles\nPartenaires de soin Expert-expert Expert-profane\n« central, primordial » (6)\n« acteur » (6)\n« c’est lui qui guide le médecin » (5)\n« responsable » (5)\n« partenaire » (5)\n« il va à son rythme » (4)\n« il prend les décisions » (4)\n« expert » (2) aucune\nEntre parenthèses figure le nombre d’occurrences de chaque expression dans le discours\nPour approfondir encore cette thématique du rôle du\npatient dans sa prise en charge, nous avons questionné les\nsoignants sur leurs réactions et attitudes à l’égard d’un\npatient non-compliant. Leurs réponses enrichissent notre\ncompréhension du « partenariat de soin » comme figure\némergente du rapport soignant-soigné (tableau 3).\nCes éléments qualitatifs nous permettent de mieux appré-\nhender la manière avec laquelle les soignants se représen-\ntent le rôle du patient dans la prise en charge de sa mala-\ndie et de son traitement. Nous constatons qu’ils ont non\nseulement pleinement intégré les enjeux que représente le\nchangement pour un patient, mais qu’ils se sont aussi\ninterrogés sur leur responsabilité à l’égard des difficultés\ndu patient. Enfin, nous faisons l’hypothèse que ces soi-\ngnants sont aujourd’hui plus capables d’accueillir le\npatient là où il est : « Le changement apparaît lorsqu’un\nsujet devient ce qu’il est, non lorsqu’il essaie de devenir ce\nqu’il n’est pas. Le changement n’apparaîtra pas sous l’effet\nd’une quelconque tentative coercitive du sujet lui-même\nou d’un autrui qui voudrait le changer »\n10 .\nLe soignant facilitateur de l’apprentissage du patient\nA l’issue de leur formation, 15 soignants (53 %) déclarent\navoir tout à fait évolué dans leur perception de leur propre\nrôle, huit soignants beaucoup (29 %), quatre soignants\npassablement (14 %) et un, un peu (4 %) (figure 2).\nPour en savoir plus sur ce thème, nous avons interrogé les\nsoignants sur leurs valeurs professionnelles au terme de la\nformation. Les répondants proposent différentes réponses\nregroupées en quatre thèmes au moment de l’analyse : \n« renforcement de mon écoute », « humilité de mon rôle »,\n« être au service des patients » et « éviter le jugement »\n(tableau 4). Les valeurs sont des règles de conduite ou des\nlois jugées conformes à un idéal auquel on se réfère. Elles\névoluent en fonction de nos expériences de vie et donnent\ndu sens à nos pratiques quotidiennes.\nRecherche et Perspectives\n88 PÉDAGOGIE MÉDICALE - Mai 2008 - Volume 9 - Numéro 2\nTableau 3 :\nTermes utilisés par les soignants pour décrire leurs réactions et attitudes\nà l’égard d’un patient non-compliant\n « je me pose des questions sur la prescription » (5)\n « je comprend mieux ses difficultés » (7)\n « je l’accepte avec sa non-observance » (6)\n « je l’invite à s’exprimer sur ses difficultés » (5)\n « je renégocie les objectifs » (4)\n « je mets en valeur ses ressources » (2)\n « je garde espoir dans sa capacité de mieux faire (1)\n « je laisse passer du temps en saisissant chaque opportunité pour lui permettre d’apprendre (1)\nEntre parenthèses figure le nombre d’occurrences de chaque expression dans le discours\nTableau 4 :\nLes valeurs professionnelles des soignants à propos de leur rôle au terme de la formation\n « renforcer mon écoute » (6)\n « humilité de mon rôle » (5)\n « être au service du patient » (5)\n « éviter le jugement » (4)\nEntre parenthèses figure le nombre d’occurrences de chaque expression dans le discours\nFigure 2 :\nEvolution des perceptions du rôle soignant\nNombre de réponses\nEvolution (1 = pas du tout, 6 = tout à fait)\nPédagogie Médicale\nREVUE INTERNATIONALE FRANCOPHONE D’ÉDUCATION MÉDICALE\nTransformer son identité professionnelle…\n89REVUE INTERNATIONALE FRANCOPHONE DʼÉDUCATION MÉDICALE\nEnfin, nous avons demandé aux soignants de préciser ce\nqui leur semblait thérapeutique dans l’éducation théra-\npeutique du patient. Nous avons classé leurs réponses en\nfonction des trois modalités relationnelles du rapport soi-\ngnant-soigné déjà proposées (tableau 5).\nLes réponses à la question « Dans quelle mesure la forma-\ntion DiFEP vous a permis de transformer votre identité\nprofessionnelle ? » confirment les deux dimensions de\nl’identité professionnelle (identité pour soi et identité\npour autrui) et suggèrent un processus de transformation\nidentitaire : huit personnes soulignent leur nouveau rôle\nd’accompagnement des patients, six se sentent davantage\ncapables de se positionner devant leurs pairs, trois ont\nobtenus de la reconnaissance de leurs pairs, deux expéri-\nmentent une confirmation du décalage déjà éprouvé avant\nla formation, une personne sait qu’il s’est passé quelque\nchose sans pouvoir aisément le nommer et trois ne voient\npas de changement.\nTableau 5 :\nTermes utilisés par les soignants pour décrire ce qui est thérapeutique \ndans leur approche du patient\nPartenaires de soin Expert-expert Expert-profane\n« la relation entre deux personnes » (7)\n« l’intérêt qu’on a pour la personne » (5)\n« le soutien du patient \ndans sa prise de décision » (4)\n« la prise en charge pluri-\ndisciplinaire » (2)\naucun\nEntre parenthèses figure le nombre d’occurrences de chaque expression dans le discours\nEvolution des soignants dans leur contexte professionnel\nPour savoir comment les institutions de soins valorisent\nla spécialisation en éducation thérapeutique du patient,\nnous nous sommes intéressés à l’évolution des parcours\nprofessionnels des soignants. Au terme de la formation, \n12 soignants (44,4 %) parmi les 28 ayant répondu au\nquestionnaire occupent de nouvelles responsabilités au\nsein de leurs institutions -principalement en tant que\nspécialistes en éducation thérapeutique du patient ou\ncoordinateurs de projets éducatifs- ; cependant six seu-\nlement (22,2 %) occupent de nouvelles fonctions valo-\nrisées financièrement. Sur ces six soignants, deux ont\nquitté leur lieu de travail pour occuper ces nouvelles\nfonctions (7,4 %). Après trois années de formation, 15\nsoignants (55,5 %) n’ont pas obtenu de reconnaissance\ninstitutionnelle de leur formation (figure 3).\nMalgré ces freins institutionnels, nous notons que 26 des\n28 soignants interrogés sont restés dans leur institution,\nœuvrant encore aujourd’hui au développement de projets\nen éducation thérapeutique du patient.\nModalités pédagogiques du diplôme\nLe tableau 6 résume l’appréciation par les répondants de\nl’impact sur leur apprentissage des principales interven-\ntions ou modalités pédagogiques utilisées au cours du\nDiFEP . De nombreux point forts et quelques limites sont\nainsi exprimés.\nDiscussion\nLimite des résultats quantitatifs\nSeuls 28 questionnaires sur 49 ont été rendus malgré\nune relance téléphonique. Comme dit précédemment,\nle nombre réduit de réponses au questionnaire peut être\ncompris de différentes manières : investissement impor-\ntant pour le remplir (questions ouvertes et temps\nrequis), moindre importance accordée par certains par-\nticipants à la portée de la formation DiFEP dans leur\npratique clinique, voire déception pour d’autres de ne\npas avoir pu bénéficier d’une promotion institution-\nnelle grâce à la formation. \nPour confirmer ces hypothèses, il serait nécessaire d’avoir\ndes entretiens approfondis avec les non-répondants ; par\nailleurs, il nous semblerait également pertinent à ce stade\nde mieux connaître les motifs d’engagement en formation\ndes participants du DiFEP .\nRecherche et Perspectives\n90 PÉDAGOGIE MÉDICALE - Mai 2008 - Volume 9 - Numéro 2\nFigure 3 :\nEvolution du contexte professionnel des soignants\nNombre de réponses\nEvolution (1 = pas du tout, 6 = tout à fait)\nTableau 6 :\nAppréciation par les répondants de l’impact sur leur apprentissage des principales inter-\nventions ou modalités pédagogiques utilisées au cours du DiFEP\nPas du tout T rès peu Un peu Passablement Beaucoup T out à fait\nMétaplan 0 2 2 4 8 12\nRéflexion en groupe 0 0 0 6 8 14\nEtude de situation 0 0 1 7 14 6\nAnalyse de vidéos 1 0 0 8 15 4\nConférences d’experts 1 2 2 7 15 2\nT ravaux de validation des modules 0 1 7 6 8 6\nConception et mise en œuvre du\nprojet éducatif\n1 0 1 3 9 12\nAteliers d’expression créatrice 4 3 2 8 4 7\nEchanges avec les autres partici-\npants\n0 2 1 4 2 19\nAccompagnement par le référent 1 2 5 3 10 7\nDiFEP : diplôme de formation continue en éducation thérapeutique du patient\nPédagogie Médicale\nREVUE INTERNATIONALE FRANCOPHONE D’ÉDUCATION MÉDICALE\nTransformer son identité professionnelle…\n91REVUE INTERNATIONALE FRANCOPHONE DʼÉDUCATION MÉDICALE\nLimite des résultats qualitatifs\nT ous les répondants n’ont pas répondu systématiquement\nà chaque question ouverte. T outefois, la validation des\ncatégories d’analyse est limitée puisque seul un consensus\nentre les deux premiers auteurs a été élaboré ; pour satis-\nfaire l’exigence de triangulation, importante au regard du\ncritère de crédibilité en recherche qualitative, il aurait été\nenrichissant de concevoir une validation externe et/ou une\nvalidation auprès des répondants eux-mêmes.\nCompte tenu des limites de l’étude évoquées ci-dessus, ce\ntravail est une étude préliminaire exploratoire qui permet\nde dégager des pistes de recherches à approfondir ultérieu-\nrement par d’autres travaux.\nLa formation continue en éducation thérapeutique \ndu patient : une transformation identitaire\nEn tenant compte des limites évoquées, notre étude met\nen évidence que la plupart des participants du DiFEP\nayant participé à l’étude ont évolué dans leur identité pro-\nfessionnelle au cours des trois ans de leur formation. On\nappelle « identité professionnelle » un ensemble de valeurs,\nde normes et procédures qui fondent les représentations\ncollectives d’un groupe et guident la pratique profession-\nnelle. Elles donnent aux personnes le sentiment d’apparte-\nnir à un groupe professionnel distinct. L ’identité profes-\nsionnelle se construit sur la base de l’identification aux\npairs. Le fait de se reconnaître une identité professionnelle\ndépend de la reconnaissance ou de la non-reconnaissance\ndes savoirs, compétences et des images de soi\n8. Nos résul-\ntats soutiennent l’idée que les soignants ont évolué dans\nleurs valeurs, leurs perceptions du rôle du patient et de\nleur rôle vers une modalité du rapport soignant-soigné\nque nous avons appelée « partenariat de soin ». Le soi-\ngnant spécialiste en ETP saura élargir sa compréhension\ndu patient pour l’accueillir totalement et formuler un pro-\njet éducatif sur mesure. La relation entre les deux parte-\nnaires devient le socle sur lequel se construit le projet édu-\ncatif. L ’éducation thérapeutique du patient est intégrée\nfortement dans les soins, rendant peu pertinente la déléga-\ntion de l’acte éducatif à d’autres professionnels.\nSi un nombre important de participants du DiFEP n’ont\npas attendu de commencer leur formation pour s’interro-\nger sur le rapport soignant-soigné, nos résultats nous\ninforment néanmoins sur le rôle de catalyseur joué par\nune formation de ce type. Il est en effet bien connu que la\nformation continue vient plus souvent soutenir et orienter\ndes réflexions déjà entreprises que déclencher de nouvelles\nvocations. Mais pour que l’adulte s’engage dans un pro-\ncessus de remise en jeu de ses comportements et des repré-\nsentations qui sont supposées les interpréter, il faut que les\nconvictions qu’il a érigées en raisons d’être pour rendre\ncompte de son expérience soient ébranlées\n11. C’est ce qui\narrive aux soignants se formant au DiFEP : ils ont pour la\nplupart expérimenté l’insuffisance de leurs compétences\ndans l’accompagnement des personnes vivant avec une\nmaladie chronique ou vécu un décalage trop grand entre\nleur vision du soin et leurs pratiques effectives. Enfin,\nl’élargissement des pratiques d’éducation thérapeutique à\ndes maladies chroniques comme l’obésité a dans certains\ncas obligé les soignants à reconnaître leur propre impuis-\nsance à les accompagner. Cette reconnaissance de l’im-\npuissance du soignant est un moment clé dans la transfor-\nmation de son identité professionnelle. Dans une étude\npréliminaire, nous avions d’ailleurs mis en évidence que ce\nsentiment d’incompétence pouvait être à l’origine d’un\nprojet de formation continue en ETP\n12. Une étude plus\napprofondie portant sur les motifs d’engagement en for-\nmation des participants du DiFEP permettrait de mieux\nappréhender cette question.\nLe DiFEP : une pédagogie participative centrée sur \nle projet individuel\nLe tableau 6 présente les éléments qui contribuent à \nl’apprentissage des participants au cours de leur forma-\ntion. Il met en évidence, entre autres, deux résultats a\npriori contradictoires, à savoir l’importance qu’ils accor-\ndent à la rencontre et au partage avec les autres partici-\npants, et l’utilité et la pertinence de l’accompagnement à\nla conception et à la mise en œuvre du projet éducatif. Si\nnotre dispositif de formation reste classique dans sa forme\n– milieu d’apprentissage fermé et guidance majoritaire-\nment externe –, les efforts mis en œuvre pour favoriser\nl’interactivité sont reconnus par les participants comme\nun des points forts de la formation. Il est d’ailleurs possi-\nble que les échanges entre participants soient un des élé-\nments qui favorise la transformation identitaire : le DiFEP\nest un lieu où l’on rencontre d’autres soignants confrontés\naux mêmes difficultés avec les patients et aux mêmes\nenjeux institutionnels. Cette identification avec d’autres\nrenforce la légitimité de chacun à se positionner autre-\nment vis-à-vis des autres, patients et institutions.\nA l’inverse, l’accompagnement du projet éducatif a pour\nobjectifs d’individualiser le parcours de formation et de\nfaciliter le transfert des apprentissages. En soulignant son\nimportance dans leur apprentissage, les répondants au\nquestionnaire justifient les efforts entrepris par l’équipe de\nformation pour que les principes éducatifs défendus au\ncours de la formation ne restent pas lettre morte.\nConclusion\nLa formation en ETP telle que nous la proposons au\nRecherche et Perspectives\n92 PÉDAGOGIE MÉDICALE - Mai 2008 - Volume 9 - Numéro 2\nDiFEP a donc pour objectif général de permettre aux soi-\ngnants d’aider les patients à mieux gérer leur maladie et\nleur traitement. L ’évolution des pratiques éducatives et\nl’élargissement de l’éducation thérapeutique à de nou-\nvelles maladies chroniques remettent régulièrement en\nquestion les termes du rapport soignant-soigné. Les parti-\ncipants du DiFEP le disent ; il est question pour eux de\nredonner une place de choix au patient au sein de la rela-\ntion thérapeutique, quitte à perdre du pouvoir. Amenés à\nrepenser différemment leur propre rôle dans l’accompa-\ngnement des personnes vivant avec une maladie chro-\nnique, ils doivent alors réinventer une posture qui à la fois\nintègre la transformation de leurs valeurs professionnelles,\net respecte la vision qu’ils ont de leur responsabilité profes-\nsionnelle de soignant. Cette nouvelle posture demande un\nréel investissement et de multiples ajustements.\nL ’émergence du patient sujet de sa santé peut se faire dans\nle cadre de la relation de soins à condition que le soignant-\néducateur accepte de se laisser toucher en tant que per-\nsonne par la personne qui est en face de lui\n13. On ne peut,\nen effet, entreprendre d’éduquer sans accepter d’entrer\nsoi-même dans un processus de transformation. Les\napports de la pédagogie, de la psychologie et de la sociolo-\ngie sont utilisés pour soutenir cette transformation et\noffrir des outils pour rendre opératoire cette nouvelle\nconception du rapport soignant-soigné qui vise à soutenir\nl’autodétermination du patient.\nLa formation continue est souvent l’occasion de transfor-\nmations qui ont une portée identitaire\n14. Les formateurs\nsont de plus en plus appelés à faciliter le chemin de la prise\nen charge personnelle de la formation continue. Aussi doi-\nvent-ils se préoccuper non seulement des connaissances\nqu’ils transmettent mais surtout d’accompagner les trans-\nformations de l’identité professionnelle ayant lieu au cours\ndes formations en éducation thérapeutique du patient.\nContributions\nAline Lasserre Moutet a interprété les résultats et\nrédigé les versions successives du manuscrit. Juliette\nDupuis a conçu le protocole de recherche et effectué\nle recueil de données. Monique Chambouleyron,\nGrégoire Lagger et Alain Golay ont participé aux\nrelectures du manuscrit.\n93REVUE INTERNATIONALE FRANCOPHONE DʼÉDUCATION MÉDICALE\nPédagogie Médicale\nREVUE INTERNATIONALE FRANCOPHONE D’ÉDUCATION MÉDICALE\nTransformer son identité professionnelle…\nRéférences\n1. WHO Regional Office for Europe. Therapeutic Patient\nEducation. Continuing education programmes for\nhealthcare providers in the field of prevention of chronic\ndiseases. Report of a WHO Working Group, 1998.\n2. Assal JP . Traitement des maladies de longue durée : de\nla phase aiguë au stade de la chronicité. Une autre ges-\ntion de la maladie, un autre processus de la prise en\ncharge. Encycl Med Chir 1996;25-005-A-10.\n3. Gagnayre R, d’Ivernois JF . Mettre en œuvre l’éducation\nthérapeutique du patient. AdSP 2001;36:11-3.\n4. Sommer J, Gache P , Golay A. L ’enseignement théra-\npeutique et la motivation du malade. In: Richard C et\nLussier MT (Eds). La communication professionnelle\nen santé. Québec : ERPI, 2005:655-92.\n5. Aujoulat I. Du patient objet des soins au patient sujet\nde sa santé : le rôle de l’éducation dans la relation de\nsoins. Soins infirmiers et Douleur 2008 (à paraître).\n6. Pirard V . Qu’est-ce qu’un soin ? Pour une pragmatique\nnon vertueuse des relations de soin. Revue Esprit\n2006;321:80-94.\n7. T ozzi M, Etienne R. Quelle identité professionnelle\npour notre métier ? Montpellier : CRDP , 2001.\n8. Dubar C. La socialisation : construction des identités\nsociales et professionnelles. Paris : Armand Colin,\n1998.\n9. Deccache A, Lavendhomme E. Information et éduca-\ntion du patient. Des fondements aux méthodes.\nBruxelles : Editions De Boeck Université, 1989.\n10. Beisser A. La théorie paradoxale du changement.\nBordeaux : Editions L ’exprimerie – IFGT , 1996\n11. De Villers G. Identification et formation. In :\nBourgeois E (Ed). L ’adulte en formation. Regards\npluriels. Bruxelles : Editions De Boeck Université,\n1996.\n12. Lasserre A. Du modèle aux repères. Essai de compré-\nhension du processus de formation de médecins prati-\nquant dans le champ de la maladie chronique.\nMémoire de licence FAPSE. Genève : Documents de\nl’Université de Genève, 1996.\n13. Aujoulat I, d’Hoore W , Deccache A. Patient empo-\nwerment in theory and practice: Polysemy or caco-\nphony? Patient Education and Counselling\n2007;66;13-20.\n14. Dominicé P . La compétence d’apprendre à l’âge\nadulte. In: Les origines biographiques de la compé-\ntence d’apprendre. Cahiers de la Section des Sciences\nde l’Education de l’Université de Genève 1998;87;1-\n21.\nManuscrit reçu le 20 novembre 2007 ; commentaires éditoriaux formulés aux auteurs le 29 février 2008 et le 27 mars\n2008 ; accepté pour publication le 28 mars 2008.",
  "topic": "Humanities",
  "concepts": [
    {
      "name": "Humanities",
      "score": 0.6246598362922668
    },
    {
      "name": "Political science",
      "score": 0.5459283590316772
    },
    {
      "name": "Philosophy",
      "score": 0.26158028841018677
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I114457229",
      "name": "University of Geneva",
      "country": "CH"
    }
  ],
  "cited_by": 20
}