{
  "title": "Dynamic Causal Modeling of Subcortical Connectivity of Language",
  "url": "https://openalex.org/W1991606582",
  "year": 2011,
  "authors": [
    {
      "id": "https://openalex.org/A2106228836",
      "name": "Olivier David",
      "affiliations": [
        "Inserm",
        "Grenoble Institute of Neurosciences"
      ]
    },
    {
      "id": "https://openalex.org/A2088056087",
      "name": "Burkhard Maess",
      "affiliations": [
        "Max Planck Institute for Human Cognitive and Brain Sciences"
      ]
    },
    {
      "id": "https://openalex.org/A1976051358",
      "name": "Korinna Eckstein",
      "affiliations": [
        "Max Planck Institute for Human Cognitive and Brain Sciences"
      ]
    },
    {
      "id": "https://openalex.org/A320532414",
      "name": "Angela D. Friederici",
      "affiliations": [
        "Max Planck Institute for Human Cognitive and Brain Sciences"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2155358120",
    "https://openalex.org/W2057487346",
    "https://openalex.org/W2115606700",
    "https://openalex.org/W1971452505",
    "https://openalex.org/W2053773581",
    "https://openalex.org/W2126096425",
    "https://openalex.org/W2123258018",
    "https://openalex.org/W2153705299",
    "https://openalex.org/W2000504966",
    "https://openalex.org/W2119345145",
    "https://openalex.org/W2099737129",
    "https://openalex.org/W2127958135",
    "https://openalex.org/W2096375888",
    "https://openalex.org/W2165642563",
    "https://openalex.org/W2011454762",
    "https://openalex.org/W2164051460",
    "https://openalex.org/W1998661899",
    "https://openalex.org/W1965248225",
    "https://openalex.org/W2012206457",
    "https://openalex.org/W2006017444",
    "https://openalex.org/W1517832139",
    "https://openalex.org/W2328486292",
    "https://openalex.org/W2073440276",
    "https://openalex.org/W2008964102",
    "https://openalex.org/W2086468443",
    "https://openalex.org/W1998151455",
    "https://openalex.org/W2117309763",
    "https://openalex.org/W2067172013",
    "https://openalex.org/W2135173838",
    "https://openalex.org/W2042482891",
    "https://openalex.org/W2128863839",
    "https://openalex.org/W1977630746",
    "https://openalex.org/W1982358246",
    "https://openalex.org/W4285719527",
    "https://openalex.org/W2026919784"
  ],
  "abstract": "Subcortical–cortical interactions in the language network were investigated using dynamic causal modeling of magnetoencephalographic data recorded during auditory comprehension. Participants heard sentences that either were correct or contained violations. Sentences containing violations had syntactic or prosodic violations or both. We show that a hidden source, modeling magnetically silent deep nuclei, is required to explain the data best. This is in line with recent brain imaging studies and intracranial recordings suggesting an involvement of subcortical structures in language processing. Here, the processing of syntactic and prosodic violations elicited a global increase in the amplitude of evoked responses, both at the cortical and subcortical levels. As estimated by Bayesian model averaging, this was accompanied by various changes in cortical-cortical and subcortical–cortical connectivity. The most consistent findings in relation to violations were a decrease of reentrant inputs to Heschl's gyrus (HG) and of transcallosal lateral connections. These results suggest that in conditions where one hemisphere detects a violation, possibly via fast thalamocortical (HG) loops, the intercallosal connectivity is reduced to allow independent processing of syntax (left hemisphere) and of prosody (right hemisphere). This study is the first demonstration in cognitive neuroscience that subcortical–cortical loops can be empirically investigated using noninvasive electrophysiological recordings.",
  "full_text": "Brief Communications\nDynamic Causal Modeling of Subcortical Connectivity of\nLanguage\nOlivier David,1 Burkhard Maess,2 Korinna Eckstein,2 and Angela D. Friederici2\n1Grenoble Institut des Neuroscience, INSERM U 836, 38042 Grenoble, France, and2Department of Neuropsychology, Max Planck Institute for Human\nCognitive and Brain Sciences, 04103 Leipzig, Germany\nSubcortical– cortical interactions in the language network were investigated using dynamic causal modeling of magnetoencephalo-\ngraphic data recorded during auditory comprehension. Participants heard sentences that either were correct or contained violations.\nSentences containing violations had syntactic or prosodic violations or both. We show that a hidden source, modeling magnetically silent\ndeep nuclei, is required to explain the data best. This is in line with recent brain imaging studies and intracranial recordings suggesting\nan involvement of subcortical structures in language processing. Here, the processing of syntactic and prosodic violations elicited a global\nincrease in the amplitude of evoked responses, both at the cortical and subcortical levels. As estimated by Bayesian model averaging, this\nwas accompanied by various changes in cortical-cortical and subcortical– cortical connectivity. The most consistent findings in relation\nto violations were a decrease of reentrant inputs to Heschl’s gyrus (HG) and of transcallosal lateral connections. These results suggest that\nin conditions where one hemisphere detects a violation, possibly via fast thalamocortical (HG) loops, the intercallosal connectivity is\nreduced to allow independent processing of syntax (left hemisphere) and of prosody (right hemisphere). This study is the first demon-\nstration in cognitive neuroscience that subcortical– cortical loops can be empirically investigated using noninvasive electrophysiological\nrecordings.\nIntroduction\nThe neural basis of language comprehension, taken to com-\nprise Broca’s area in the left inferior frontal gyrus (IFG) and\nWernicke’s area in the left superior temporal gyrus (STG), has\nbeen modeled mostly without considering deeper, subcortical\nstructures (Friederici, 2002; Hickok and Poeppel, 2007). An\nexception is the study by Ullman (2004), which considers the\ninvolvement of the basal ganglia (BG). From patient studies\n(Raymer et al., 1997; Metz-Lutz et al., 2000) and functional\nmagnetic resonance imaging (fMRI) studies (Fiebach et al.,\n2004; Mestres-Misse´ et al., 2008), it is clear that subcortical\nstructures such as the BG and the thalamus also play a crucial\nrole in language processing. The BG and the thalamus interact\nwith cortical regions through many loops, including prefron-\ntal, premotor, parietal, and temporal cortices (Crosson et al.,\n1997). While the role of the caudate as part of the BG is seen in\nlanguage control (Crinion et al., 2006), intracranial record-\nings have identified the thalamus as being engaged in the\ndetection of syntactic and semantic violations in spoken sen-\ntences (Wahl et al., 2008). This suggests that an adequate\nmodel of language comprehension should consider subcorti-\ncal contributions.\nIn electroencephalography (EEG) or magnetoencephalogra-\nphy (MEG), it is impossible to reconstruct the allocation, orien-\ntation and—without taking into account interactions between\nbrain regions—activity of a source that has no direct impact on\nthe scalp sensors (i.e., most deep brain structures). Here, we\nprofit from the latest advances in the modeling of MEG evoked\nresponses using neural mass models to estimate the activity, to-\npology, and effective connectivity of corticosubcortical loops\nduring auditory speech comprehension.\nDynamic causal modeling (DCM) for MEG evoked responses\n(Kiebel et al., 2006) uses interacting neuronal populations to re-\nproduce the activity of brain regions. Neuronal current densities\nare projected into the MEG channel space using a source and a\nhead model. This combined model is then inverted to reconstruct\nbrain dynamics with biological constraints explaining the mea-\nsurement. Most importantly here, we investigate the feasibility of\nthe DCM method to estimate hidden source activity. First, using\nsimulations, we show that DCM distinguishes correctly between\nsituations where no hidden source was present and situations\nwhere a hidden source relayed relevant information between cor-\ntical regions. DCM can thus be used to detect the presence of\nhidden sources. Second, we study actual MEG evoked responses\nduring language processing with DCMs that either include an\nassumed hidden source or not. The hidden source is assumed to\ncorrespond to the thalamus and the respective thalamocortical\nloops based on data from intracranial recordings with similar\nlanguage material (Wahl et al., 2008). Using model comparison\nwith the MEG data, we demonstrate that a deep source is a crucial\npart within the language network, probably as a moderator be-\ntween the other cortical regions.\nReceived July 2, 2010; revised Nov. 29, 2010; accepted Jan. 2, 2011.\nO.D. was funded by Agence Nationale pour la Recherche (ANR-09-EMER-006). We thank Yvonne Wolff for care-\nfully acquiring the data.\nCorrespondence should be addressed to Prof. Dr. Angela D. Friederici, Department of Neuropsychology, Max\nPlanck Institute for Human Cognitive and Brain Sciences, Stephanstrasse 1a, 04103 Leipzig, Germany. E-mail:\nangelafr@cbs.mpg.de.\nDOI:10.1523/JNEUROSCI.3433-10.2011\nCopyright © 2011 the authors 0270-6474/11/312712-06$15.00/0\n2712 • The Journal of Neuroscience, February 16, 2011• 31(7):2712–2717\nMaterials and Methods\nStimuli. The study involved four crucial experimental conditions cross-\ning the factors syntax and prosody: (1) CC, prosody correct and syntax\ncorrect; (2) CS, prosody correct and syntax incorrect; (3) PC, prosody\nincorrect and syntax correct; and (4) PS, prosody incorrect and syntax\nincorrect. Each condition contained 48 sentences. Each sentence con-\nsisted of a proper name (e.g.,Maria) and the verbweiß [knows] compris-\ning the matrix clause. Then, a subordinate clause was attached that was\nalways introduced by the complementizerdass [that] and followed by the\nsubject (e.g.,der Rentner[the pensioner]) of the subordinate clause. The\npenultimate constituent of the subordinate clause was always a preposi-\ntional phrase (PP) consisting of a preposition (e.g.,im [in the]) and the\ncritical word (e.g.,Alter [seniority]), followed by the verb of the subor-\ndinate clause (e.g.,kra¨nkelt [ails]) at clause-final position. German words\nthat are ambiguous regarding word category until their ending (either\nverbal suffix or nominal suffix) served as critical words. A nominal suffix\n(suffix -r) was highly expected due to the preceding preposition (im [in\nthe]) (requiring a noun) and a frequency-based bias of the critical word\nstems toward the usage as a noun. Nevertheless, given that there was an\nequal probability of occurrence for both suffix types in the present ex-\nperiment, a final successful determination of word category could not be\nachieved until the suffix of the critical word was encountered. Therefore,\nat the suffix, the critical word was disambiguated toward being a noun\n(e.g., marked by the suffix-r), making a syntactically correct continua-\ntion of the PP (syntax correct), or toward being an inflected verb (e.g.,\nsuffix -rt), which would lead to a word category violation (syntax incor-\nrect) because a preposition must be followed by a noun.\nTo avoid possible strategic effects resulting from the fact that the oc-\ncurrence of the critical stem with verb suffix always coincided with a\nsyntactical error in the two experimental conditions, we included two\nsyntactically congruent filler conditions in which the critical word stem\noccurred together with a verb suffix in the correct context (e.g., filler 1:\nMaria weiß, dass der Rentner im Rollstuhl altert. [Maria knows that the\npensioner in the wheelchair grows old.], filler 2:Maria weiß, dass der\nRentner altert. [Maria knows that the pensioner grows old.]). All critical\nwords were disyllabic, carrying the default (trochaic) stress pattern. Both\nfiller conditions were naturally recorded. To create the sentences for the\nfour experimental conditions, we recorded the required words in differ-\nent source sentences (for details, see Eckstein and Friederici, 2006). The\nsame splicing procedure was used to create the correct and incorrect\nsentences to avoid a general effect of the splicing itself. The first part of the\nsentence (e.g., Maria weiß, dass der Rentner im[Maria knows that the\npensioner in the]) preceding the critical region as well as the sentence-\nfinal verb (e.g.,kra¨nkelt. [ails.]) was identical for all four experimental\nconditions. The number of splicing points and their positions were also\nidentical between the four experimental conditions.\nFor the acoustic characterization of the stimuli, we decided to examine\nfundamental frequency and word durations for each sentence and con-\ndition; see Eckstein and Friederici (2006) for details. Descriptively, the\nf0-contour for critical words in the prosodically correct conditions\nmarked for sentence continuation (CC and CS) showed a rise–fall pat-\ntern (see supplemental Fig. S1, available at www.jneurosci.org as supple-\nmental material). Prosodic violations (PC and PS) showed the reverse\nfall–rise pattern.\nParticipants. We tested 11 participants (mean age 26 years; range from\n20 to 31 years of age; four women) after they had given informed consent.\nAll were right handed and reported no neurological, hearing, or language\nimpairments. Participants were paid 7€/h. Participants listened to the\nsentences and had to judge the grammaticality of each of them via button\npress. A picture with a smiley and a sad face was presented 1500 ms after\nthe end of the sentence. Participants had to press the button on the side\ncorresponding to the smiley if sentences were correct and the other but-\nton for incorrect sentences. Assignment of the location of the smiley was\nrandom, with the happy face occurring equally often on the left- and\nright-hand sides.\nMEG data recording.Measurements were conducted using a Vectorview\nMEG device (Elekta-Neuromag). Data were first cleaned of interfer-\nence and transformed into a fixed head position via MaxMove-\nSoftware Elekta-Neuromag. Trial-based epochs exceeding 80\n/H9262V\n(electrooculogram), 4 pT (MEG), or 200 fT/cm amplitude variation\nwithin the epoch from/H11002200 to 800 ms were excluded from further\nanalysis. Subsequently, data were bandpass filtered from 0.8 to 5 Hz.\nAverages time locked to the onset of the suffix of the critical word were\ncomputed for each subject and the four conditions.\nDCM specification. Elaborating on the work of Wahl et al. (2008),\nwe studied language processing DCMs that either include or do not\ninclude a deep source possibly representing the thalamus and the\nrespective corticosubcortical loops (Fig. 1). The cortical areas consid-\nered are Heschl’s gyrus (HG, primary auditory cortex), the mid-to-\nanterior STG, and the opercular structure in the IFG, because they\nwere identified using a cortically distributed source reconstruction\n(Maess et al., 2010) (see supplemental Fig. S2, available at www.\njneurosci.org as supplemental material). As a control of DCM model\ncomplexity that may facilitate data fitting when a hidden source is\nused, we also investigated the consequence on model evidence of\nusing an additional cortical source that was not primarily identified\nusing source reconstruction instead of the deep source. We used the\nanterior cingulate cortex (CG) for that purpose.\nThe cortical interconnections were based on the following findings:\n(1) a large number of sentence comprehension studies specified the in-\nferior portion of the pars opercularis/frontal operculum (FOP) and STG\nbilaterally to be involved in the processing of syntactic violations (Fried-\nerici, 2002); (2) structural and effective connectivity data have demon-\nstrated that HG connects to the lateral planum polare and the STG as well\nas to the planum temporale and the posterior STG (Upadhyay et al.,\n2008) and the STG connects to the FOP (Friederici et al., 2006). The\nrespective areas (HG, STG, FOP) of the left hemisphere (LH) and right\nhemisphere (RH) are connected via the corpus callosum (Huang et al.,\n2005), which was shown to be responsible for the functional interplay of\nthe two hemispheres during auditory sentence comprehension (Fried-\nerici et al., 2007).\nDCM analyses focused on slow evoked components, occurring be-\ntween 0 and 500 ms peristimulus time, which compose the ELAN wave-\nform as suggested by data from Wahl et al. (2008). Six regions were\nmodeled using an equivalent current dipole (ECD) a priori positioned\nusing the following MNI coordinates: Heschl’s gyrus [/H1100648, /H110029, 7]; an-\nterior superior temporal gyrus [/H1100635, 0, 3]; and frontal operculum [/H1100654,\n16, /H110024]. The hidden source was simply modeled using an ECD, posi-\ntioned at [0, 0, 0] so that it did not project to the scalp assuming a\nspherical head model. Alternatively, as a control of DCM overfitting, the\nhidden source was replaced by the CG [0, 36, 28]. Regions were intercon-\nnected with forward, backward, and lateral connections as described by\nDavid et al. (2005, 2006).\nOther DCM parameters were as follows: eight modes for data selec-\ntion, one discrete cosine transform (DCT) component to remove slow\ndrift, Hanning windowing to remove the effect of very late responses, a\ndownsampling of 2 to speed up computations, no constraint of symme-\ntry on the orientation of ECDs, and no modulation of intrinsic connec-\ntions. DCM parameters were fitted on the four conditions at once (CC,\nCS, PC, PS). Differences between conditions were obtained by allowing\nall extrinsic connections to be modulated. Extrinsic connections were\nmodified between the different models but respected some basic features\n(Fig. 2): (1) All models were LH–RH symmetric, and the auditory stim-\nulus input was entered on HG, which was at the bottom of the hierarchy.\nEarlier stages on the auditory pathway [e.g., the inferior colliculus and\nmedial geniculate nuclei (MGN) (Hackett, 2011)] were covered by the\nmodel parameters of the extrinsic input on HG; (2) STG and FOP were\nsecond and third in the cortical hierarchy, respectively, as embodied\nusing forward and backward connections; (3) HG, STG, and FOP were\nlaterally connected assuming transcallosal communication between cor-\nresponding regions in the two hemispheres; and (4) the deep source,\nwhich embodies reentrant cortical–subcortical loops that take place after\nthe first flow of information passing through the MGN and HG, was\narbitrarily assumed between HG and the STG in the hierarchy.\nModel evidence at the group and family level was estimated using a\nrandom effects analysis of the negative free energy obtained for every\nsubject and model (Stephan et al., 2009; Penny et al., 2010). Family\nDavid et al.• DCM of a Language Network J. Neurosci., February 16, 2011 • 31(7):2712–2717 • 2713\nlevel inference removes uncertainty about\naspects of model structure other than the\ncharacteristic of interest. We used five fami-\nlies (Fig. 1): models without the deep source\n(No deep), models with the deep source dif-\nferentiated according to the lateral connec-\ntions (HG, STG, and FOP), and models with\nthe anterior cingulate cortex (CG). Extrinsic\nconnectivity parameters of the winning fam-\nilies were estimated at the group level using\nBayesian model averaging (BMA) (Penny et\nal., 2010).\nDCM simulations.Monte Carlo simulations\nwere performed with scalp data to demonstrate\nthe possibility of detecting the presence of a\nhidden source involved in the brain network\nhaving generated those data. The head position\n(306 channels, Elekta-Neuromag system) of a\nsubject taken at random was used for simula-\ntions. The first step consisted of generating\nscalp data. Two sources were positioned ran-\ndomly in the brain and the associated forward\nmodel was computed using a spherical head\nmodel. One example of the sources together\nwith their corresponding time courses is dis-\nplayed in Figure 2A. Cortical sources are la-\nbeled as A (blue) and B (red) and an additional\nhidden relay source as H (green).\nThe dynamics of the sources were created\nusing the neural model of DCM assuming for-\nward and backward connections between sub-\nsequent sources following two configurations:\n(1) a simple model only composed of the two\nmeasurable sources; (2) an augmented model\ncontaining a hidden (deep) source between the\ntwo measurable sources located at random. For\neach model, scalp data were obtained by inte-\ngrating the differential equations of the corre-\nsponding neuronal models, with parameter\nvalues chosen randomly (using the prior mean\nvalue plus a random component of maximum\nvalue equal to 50% of the prior variance). Fifty\nrealizations were considered for the Monte\nCarlo simulations.\nIn the second step, synthetic scalp data (gen-\nerated with and without a hidden source) were\nadjusted under two assumptions: using a DCM\ncomposed of the two measurable sources (A\nand B), or using a DCM that contained the\nadditional hidden source (H). Each model was\nthe true model for only one set of scalp data.\nFor each condition, fixed effect model posterior\nprobability (Stephan et al., 2009) was computed\nto assess the possibility of DCM inference to ac-\ncurately detect the presence or absence of the hid-\nden source.\nResults\nBehavioral data\nOverall, performance on the task was highly accurate, with all\nparticipants having an average response rate of/H1102290% correct on\nthe trials. Data from trials in which participants gave incorrect\nresponses were not excluded from analysis.\nDCM simulations\nWe found that models including the deep source recover the tem-\nporal time series almost perfectly. It should be noted that even the\ntime course of the hidden source was correctly estimated when ap-\npropriately assumed. In contrast, the cortical time courses were\nrather poorly recoveredwhen the hidden source is wrongly as-\nsumed to be absent.Additionally, the value of the negative free\nenergy, an approximation of the log evidence of each model, was\nhigher for the true model, the one with the hidden source.\nModel posterior evidence computed on randomly generated\ndata (Monte Carlo simulations) shows clearly that, in principle, it\nis possible to correctly detect the presence or the absence of the\nhidden source (Fig. 2B).\nFigure 1. Schematic overview of the 22 models tested, distributed into five families (rows). The first family includes the six\ncortical regions but no deep source. Other model families are characterized by the interhemispheric connection, which is between\nthe left and right counterparts of one of three cortical regions: HG, STG, or FOP. The family CG is used as a control. It is an STG family\nassuming an anterior cingulate region instead of the deep source.\n2714 • J. Neurosci., February 16, 2011• 31(7):2712–2717 David et al. • DCM of a Language Network\nDCM modeling of language data\nThe competing DCMs differed in the topology of subcortical–\ncortical loops and in their direct interhemispheric connections\n(Fig. 1). Comparing model exceedance probability of all 22 mod-\nels and of all five families tested, we found clear evidence of the\npresence of a hidden source whatever the cortical connectivity\n(Fig. 3A,B). Indeed, exceedance probability summed over the\nthree families with the deep source (HG, STG, FOP) was/H110220.95.\nModels 1– 6 and their “No deep” family only reached very low\nvalues of exceedance probability. As an empirical demonstration\nof the actual presence of a deep source, the evidence of family CG\nincluding an anterior cingulate source was well below the evi-\ndence of the other families having the deep source (HG, STG,\nFOP)—see Figure 3B. The profile of exceedance probability be-\ntween HG, STG, and FOP families may indicate that transcallosal\nconnectivity at a higher level in the cortical hierarchy is more\nappropriate to explain the data. However, the three best models,\nwhich represented 86% of exceedance probability, belonged to\neach of those three families (model 10: HG, model 11: STG,\nmodel 15: FOP)—see Figure 3C. This suggests that it was not\npossible to distinguish between HG, STG, and FOP. Therefore,\nthese families were considered winning families and were in-\ncluded in BMA of connectivity parameters.\nMean brain evoked responses were computed by averaging\nover subjects and winning families (Fig. 4A). These mean evoked\nresponses showed increased amplitude in response to violations,\nfrom 100 ms peristimulus time onwards in almost all conditions\nand locations. Specifically, syntactic violations appeared to have\nmore impact than prosodic violations on subcortical activity. The\nlink between amplitude (Fig. 4A) and connectivity (Fig. 4B)\nmodulations, however, was difficult to assess because of hetero-\ngeneous connectivity over conditions. The most consistent find-\ning in relation to violations was a decrease in cortical (no\nviolation: 1.41; violation: 1.13) and subcortical (no violation:\n2.35; violation: 1.14) reentrant connectivity to HG. Transcallosal\nlateral connections were also modulated and showed a global\ndecrease in connectivity whenever a violation was detected (no\nviolation: 0.71; violation: 0.36). The difference in conditional\nmodulation of connectivity between the correct and the other\nthree experimental conditions is displayed in Figure 4C.\nDiscussion\nThis study is important for two reasons. First, from a method-\nological point of view, we have shown that hidden neural activity\n(i.e., activity that is not recordable using noninvasive methods)\ncan be recovered using parameter estimation of biophysical mod-\nels of brain networks (dynamic causal modeling) (David et al.,\n2005, 2006). Second, the present data allow us to make specific\ninferences on subcortical– cortical connectivity during auditory\nlanguage processing.\nThe ability to record deep brain structures in EEG or MEG has\nbeen a matter of debate, and several studies have suggested that\nthalamic activity is actually be recordable in MEG or EEG (Tes-\nche, 1996; Gross et al., 2002; Attal et al., 2007). When comparing\nintracerebral and scalp data, it is nonetheless clear that scalp re-\ncordings do not capture the activity of deep structures well (Ray\net al., 2007; Dalal et al., 2009). Here, we made the radical assump-\ntion that deep structures (e.g., thalamus) were not recorded (i.e.,\ntheir activity did not project to the scalp), and we proposed to\nFigure 2. A, Generative model for simulations to investigate the influence of the hidden\nsource (H) and two measurable sources (A and B). Locations of A and B were varied randomly.B,\nResults of Monte Carlo simulations testing two model families: with and without a deep (hid-\nden) source (H). Monte Carlo simulations demonstrated that independent of the location and\nthe distance between the visible sources, the model posterior probability provides stable infor-\nmation whether or not inclusion of a hidden source constitutes a better model.\nFigure 3. Bayesian model selection based on exceedance probabilities for different scenar-\nios. A, Comparison of the models 19 –22 (STG including CG) versus models 11–14 (STG including\ndeep). Note that there is just a minor exceedance probability for the models including CG.B,\nComparison of all model families investigated: no deep source, deep source/H11001transcallosal\nconnection between left and right counterparts of HG, STG, or FOP, and finally CG/H11001transcallosal\nconnection between the two counterparts of STG. Note that the three winning families together (all\nincluding the deep source) have 95% exceedance probability.C, Exceedance probabilities for each\nmodel separately. Note that the three best models together pass an exceedance probability of 85%.\nDavid et al.• DCM of a Language Network J. Neurosci., February 16, 2011 • 31(7):2712–2717 • 2715\nindirectly estimate depth activity by the\nmeans of biophysical modeling of neuro-\nnal connections.\nDynamic causal modeling allows the\nestimation of neuronal parameters (con-\nnectivity and time constants) from EEG\nor MEG evoked responses (David et al.,\n2006). Using a Bayesian framework, it is\npossible to make inferences on estimated\nparameters, and most importantly, to\ncompare different models on the basis of\ntheir evidence, which combines the good-\nness of fit to the data of model dynamics\nand model complexity. The simple idea\nwe tested to investigate the presumed in-\nfluence of deep nuclei was to compare\nmodels with or without a hidden (i.e.,\ndeep) source. Because a model with a deep\nsource is more complex than a model\nwithout, given the same number of cor-\ntical sources, it is selected as a better\nmodel only if it allows the better\nreproduction of recorded scalp data\nthrough the modulation of brain dy-\nnamics by the means ofsubcortical/cor-\ntical connections. Using a simulation (Fig.\n2A,B), we demonstrated the face validity\nand potential value of this new method of\nmodeling the sources of MEG or EEG\ndata. This approach is in fact radically new\nand opens avenues for the noninvasive\nstudy of thalamocortical loops under\nphysiological and pathological condi-\ntions. We applied it to investigate the\npossible role of the thalamus and basal\nganglia during the processing of syntac-\ntic and prosodic violations in auditory\nsentence comprehension.\nOverall, our MEG DCM results sug-\ngest the involvement of a deep source in\nlanguage processing. Although DCM does\nnot provide a definitive answer here, this\ndeep source very likely represents the thal-\namus, as intracranial recordings in a study\nusing partly similar material indicated in-\ncreased thalamic responses to syntactic\nviolations in an earlier time window\n(Wahl et al., 2008). Here, the particular\nmodulations in connection strength\nsuggest different networks react as a\nfunction of syntactic and prosodic in-\nformation. Syntactic information, which is known to be pro-\ncessed in the left hemisphere (Friederici, 2002; Hagoort, 2005;\nHickok and Poeppel, 2007), indeed leads to increased re-\nsponses in the left STG and FOP, but also in the right FOP and\nin the deep source. Prosodic information is known to be pro-\ncessed in the right hemisphere (Meyer et al., 2004). Not sur-\nprisingly, we observed that prosodic violations involved right-\nsided modulation of cortical activity but also elicited an\nincrease in subcortical activity, but this was weaker than the\none evoked by syntactic violations.\nIn terms of connectivity patterns, contextual modulations are\ncomplex. A consistent feature is a decrease in cortical and sub-\ncortical reentrant inputs to HG whenever a violation is detected.\nGiven that the syntactic violations investigated in the present\nstudy are reflected in the EEG and MEG experiments as an early\neffect whose dipolar activity is located in the superior temporal\ngyrus anterior to HG (Kno¨sche et al., 1999; Friederici et al., 2000)\nor in close vicinity to it (Herrmann et al., 2009), the reentrant\nloop between HG and the deep source suggests that the informa-\ntion from the secondary auditory cortex is referred to the deep\nnuclei for further processing, which affects high- and low-level\ncortical processing. This is backed up by cortical and intracranial\nrecording data indicating that the cortical effect precedes the re-\nspective effect in the thalamus (Wahl et al., 2008).\nFigure 4. Time courses and connectivities of winning model families.A, Mean time courses of the winning families (all models\nthat included a deep source).B, Bayesian model averages including models of the winning families (HG, STG, FOP): mean connec-\ntivity between all regions. Note the stronger connection (dark red) from the deep source to the cortical region (LHG)—right upper\ncorner of the CC square. Blue means lowest connectivity. The redundant and nonexisting connections are displayed in gray. The\npanels display the values for the different conditions CC, CS, PC, and PS, respectively. Direction of connectivity is indicated in the\nCC-CC panel of partC: “from” is displayed at the top/bottom and “to” on the left/right.C, Bayesian model averages based on models\nof the winning families (HG, STG, FOP): difference in the mean connectivity between all regions to the condition CC. Note that green\nmeans difference equals zero. The redundant and nonexisting connections are displayed in gray. The upper left panel displays the\nvalues for condition CC-CC, the upper right panel— condition CS-CC, the lower left panel— condition PC-CC, and the lower right\npanel— condition PS-CC.\n2716 • J. Neurosci., February 16, 2011• 31(7):2712–2717 David et al. • DCM of a Language Network\nIn addition, we observed a global decrease in transcallosal\nconnections in relation to violations, particularly at the level of\nHG and FOP. The decrease for the interhemispheric connection\nbetween the FOP, HG, and STG sources is in line with the as-\nsumption that during normal auditory language processing, both\nhemispheres work in parallel, with the left hemisphere being pri-\nmarily responsible for syntactic and lexical–semantic processes\nand the right hemisphere for prosodic processes. In conditions\nwhere one hemisphere detects a violation, possibly via fast thalamo-\ncortical (HG) loops, the intercallosal connectivity is reduced to allow\nindependent processing of syntax and of prosody.\nTo sum up, these results can be interpreted within the theory\nof predictive coding (Friston, 2005, Friston and Kiebel, 2009).\nDuring language learning, both hemispheres acquire prior repre-\nsentations of syntactic and prosodic information. In the presence\nof syntactic or prosodic violations in a given sentence, after early\nauditory stimulus processing in HG, thalamus, and STG/FOP,\nerror signals are send back by means of decreased reentrant con-\nnectivity to HG and decreased transcallosal connectivity. These\nerror signals may serve the purpose to process this sentence using\nprior representations of language to repair syntactic or prosodic\nstructures if possible, most likely by dissociating both processes\nto a certain extent. Overall, our MEG DCM results are highly\nsuggestive of where increased thalamic responses to language vi-\nolations were measured using intracranial recordings (Wahl et\nal., 2008). DCM was thus successful in demonstrating that the\nthalamus is a crucial part within the language network, probably\nas a moderator between the other cortical regions. As a result, our\nstudy opens new avenues for studying the role of subcortical\nstructures in human cognition.\nReferences\nAttal Y, Bhattacharjee M, Yelnik J, Cottereau B, Lefe`vre J, Okada Y, Bardinet E,\nChupin M, Baillet S (2007) Modeling and detecting deep brain activity with\nMEG and EEG. Conf Proc IEEE Eng Med Biol Soc 2007:4937– 4940.\nCrinion J, Turner R, Grogan A, Hanakawa T, Noppeney U, Devlin JT, Aso T,\nUrayama S, Fukuyama H, Stockton K, Usui K, Green DW, Price CJ\n(2006) Language control in the bilingual brain. Science 312:1537–1540.\nCrosson B, Zawacki T, Brinson G, Lu L, Sadek JR (1997) Models of subcor-\ntical functions in language: current status. J Neurolinguist 10:277–300.\nDalal SS, Baillet S, Adam C, Ducorps A, Schwartz D, Jerbi K, Bertrand O, Garnero\nL, Martinerie J, Lachaux JP (2009) Simultaneous MEG and intracranial\nEEG recordings during attentive reading. Neuroimage 45:1289 –1304.\nDavid O, Harrison L, Friston KJ (2005) Modelling event-related responses\nin the brain. Neuroimage 25:756 –770.\nDavid O, Kiebel SJ, Harrison LM, Mattout J, Kilner JM, Friston KJ (2006)\nDynamic causal modeling of evoked responses in EEG and MEG. Neuro-\nimage 30:1255–1272.\nEckstein K, Friederici AD (2006) It’s early: event-related potential evidence\nfor initial interaction of syntax and prosody in speech comprehension. J\nCogn Neurosci 18:1696 –1711.\nFiebach CJ, Vos SH, Friederici AD (2004) Neural correlates of syntactic am-\nbiguity in sentence comprehension for low and high span readers. J Cogn\nNeurosci 16:1562–1575.\nFriederici AD (2002) Towards a neural basis of auditory sentence process-\ning. Trends Cogn Sci 6:78 – 84.\nFriederici AD, Wang Y, Herrmann CS, Maess B, Oertel U (2000) Localiza-\ntion of early syntactic processes in frontal and temporal cortical areas: A\nmagnetoencephalographic study. Hum Brain Mapp 11:1–11.\nFriederici AD, Bahlmann J, Heim S, Schubotz RI, Anwander A (2006) The\nbrain differentiates human and non-human grammars: functional localiza-\ntion and structural connectivity. Proc Natl Acad Sci U S A 103:2458 –2463.\nFriederici AD, von Cramon DY, Kotz SA (2007) Role of the corpus callosum\nin speech comprehension: interfacing syntax and prosody. Neuron\n53:135–145.\nFriston K (2005) A theory of cortical responses. Philos Trans R Soc Lond B\nBiol Sci 360:815– 836.\nFriston K, Kiebel S (2009) Predictive coding under the free-energy princi-\nple. Philos Trans R Soc Lond B Biol Sci 364:1211–1221.\nGross J, Timmermann L, Kujala J, Dirks M, Schmitz F, Salmelin R, Schnitzler\nA (2002) The neural basis of intermittent motor control in humans.\nProc Natl Acad Sci U S A 99:2299 –2302.\nHackett TA (2011) Information flow in the auditory cortical network. Hear\nRes 271:133–146.\nHagoort P (2005) On Broca, brain, and binding: a new framework. Trends\nCogn Sci 9:416 – 423.\nHerrmann B, Maess B, Hasting AS, Friederici AD (2009) Localization of the\nsyntactic mismatch negativity in the temporal cortex: an MEG study.\nNeuroimage 48:590 – 600.\nHickok G, Poeppel D (2007) Opinion—the cortical organization of speech\nprocessing. Nat Rev Neurosci 8:393– 402.\nHuang H, Zhang J, Jiang H, Wakana S, Poetscher L, Miller MI, van Zijl PCM,\nHillis AE, Wytik R, Mori S (2005) DTI tractography based parcellation\nof white matter: application to the mid-sagittal morphology of corpus\ncallosum. Neuroimage 26:195–205.\nKiebel SJ, David O, Friston KJ (2006) Dynamic causal modelling of evoked\nresponses in EEG/MEG with lead field parameterization. Neuroimage\n30:1273–1284.\nKno¨sche TR, Maess B, Friederici AD (1999) Processing of syntactic infor-\nmation monitored by brain surface current density mapping based on\nMEG. Brain Topography 12:75– 87.\nMaess B, David O, Eckstein K, Friederici AD (2010) Investigating language\nprocessing of syntax and prosody via dynamic causal modelling (DCM)\non MEG data. Conference Abstract: Biomag 2010 —17th International\nConference on Biomagnetism. doi: 10.3389/conf.fnins.2010.06.00208.\nMestres-Misse´A ,C a`mara E, Rodriguez-Fornells A, Rotte M, Mu¨nte TF\n(2008) Functional neuroanatomy of meaning acquisition from context. J\nCogn Neurosci 20:2153–2166.\nMetz-Lutz MN, Namer IJ, Gounot D, Kleitz C, Armspach JP, Kehrli P (2000)\nLanguage functional neuro-imaging changes following focal left thalamic\ninfarction. Neuroreport 11:2907–2912.\nMeyer M, Steinhauer K, Alter K, Friederici AD, von Cramon DY (2004)\nBrain activity varies with modulation of dynamic pitch variance in sen-\ntence melody. Brain Lang 89:277–289.\nPenny WD, Stephan KE, Daunizeau J, Rosa MJ, Friston KJ, Schofield TM, Leff\nAP (2010) Comparing families of dynamic causal models. PLoS Com-\nput Biol 6:e1000709.\nRay A, Tao JX, Hawes-Ebersole SM, Ebersole JS (2007) Localizing value of\nscalp EEG spikes: a simultaneous scalp and intracranial study. Clin Neu-\nrophysiol 118:69 –79.\nRaymer AM, Moberg P, Crosson B, Nadeau S, Rothi LJG (1997) Lexical-\nsemantic deficits in two patients with dominant thalamic infarction. Neu-\nropsychologia 35:211–219.\nStephan KE, Penny WD, Daunizeau J, Moran RJ, Friston KJ (2009) Bayesian\nmodel selection for group studies. Neuroimage 46:1004 –1017.\nTesche CD (1996) Non-invasive imaging of neuronal population dynamics\nin human thalamus. Brain Res 729:253–258.\nUllman MT (2004) Contributions of memory circuits to language: the de-\nclarative/procedural model. Cognition 92:231–270.\nUpadhyay J, Silver A, Knaus TA, Lindgren KA, Ducros M, Kim DS, Tager-\nFlusberg H (2008) Effective and structural connectivity in the human\nauditory cortex. J Neurosci 28:3341–3349.\nWahl M, Marzinzik F, Friederici AD, Hahne A, Kupsch A, Schneider GH,\nSaddy D, Curio G, Klostermann F (2008) The role of the human thala-\nmus in syntactic language processing. Neuron 59:695–707.\nDavid et al.• DCM of a Language Network J. Neurosci., February 16, 2011\n• 31(7):2712–2717 • 2717",
  "topic": "Magnetoencephalography",
  "concepts": [
    {
      "name": "Magnetoencephalography",
      "score": 0.6004226803779602
    },
    {
      "name": "Psychology",
      "score": 0.5919784903526306
    },
    {
      "name": "Neuroscience",
      "score": 0.5594689249992371
    },
    {
      "name": "Syntax",
      "score": 0.5288342833518982
    },
    {
      "name": "Lateralization of brain function",
      "score": 0.47827112674713135
    },
    {
      "name": "Neuroimaging",
      "score": 0.4389592409133911
    },
    {
      "name": "Cognitive psychology",
      "score": 0.3241724967956543
    },
    {
      "name": "Electroencephalography",
      "score": 0.32105183601379395
    },
    {
      "name": "Computer science",
      "score": 0.2575620710849762
    },
    {
      "name": "Artificial intelligence",
      "score": 0.2085997760295868
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I154526488",
      "name": "Inserm",
      "country": "FR"
    },
    {
      "id": "https://openalex.org/I4210130445",
      "name": "Max Planck Institute for Human Cognitive and Brain Sciences",
      "country": "DE"
    },
    {
      "id": "https://openalex.org/I149899117",
      "name": "Max Planck Society",
      "country": "DE"
    }
  ],
  "cited_by": 61
}