{
    "title": "HTS toroidal helical transformer",
    "url": "https://openalex.org/W1996791930",
    "year": 2008,
    "authors": [
        {
            "id": "https://openalex.org/A5084218952",
            "name": "B. Grzesik",
            "affiliations": [
                "Silesian University of Technology"
            ]
        },
        {
            "id": "https://openalex.org/A5025573848",
            "name": "T. Janowski",
            "affiliations": [
                "Lublin University of Technology"
            ]
        },
        {
            "id": "https://openalex.org/A5071340466",
            "name": "Mariusz Stępień",
            "affiliations": [
                "Silesian University of Technology"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2161989326",
        "https://openalex.org/W2104993425",
        "https://openalex.org/W2098428996",
        "https://openalex.org/W2016592144",
        "https://openalex.org/W2142834858",
        "https://openalex.org/W4243679070",
        "https://openalex.org/W2137861350"
    ],
    "abstract": "The paper describes novel HTS toroidal transformer with helical windings, operating at 50 Hz. The turns of outer winding are parallel to turns of inner one. This arrangement of windings results in the same length and shape of each turn. The latter ensures homogeneous distribution of flux density. The magnetic core, in turn, improves coupling between windings, giving at the same time homogeneous magnetic flux distribution in windings. Proposed shape of windings reduces perpendicular component of flux density in HTS wires. It allows for the best possible utilisation of the HTS wire. The transformer has the magnetic core cooled with LN2. The transformer has turn-to-turn ratio 1:1 as it is designed for modular system. Its windings are made of Bi2Sr2Co2Cu3Ox wire. Material of magnetic core has accepted power losses in LN2. The magnetic core is also kept in ambient temperature. Thorough analysis of proposed HTS transformer will be carried out using Finite Element Method (FEM) and measurements resulting in critical current, rated power density and rated efficiency. The circuit model of the transformer is also given.",
    "full_text": null
}