{
  "title": "The embodied mind extended: using words as social tools",
  "url": "https://openalex.org/W1994644020",
  "year": 2013,
  "authors": [
    {
      "id": "https://openalex.org/A5020756269",
      "name": "Anna M. Borghi",
      "affiliations": [
        "Institute of Cognitive Sciences and Technologies",
        "National Research Council",
        "University of Bologna"
      ]
    },
    {
      "id": "https://openalex.org/A5028233104",
      "name": "Claudia Scorolli",
      "affiliations": [
        "University of Bologna"
      ]
    },
    {
      "id": "https://openalex.org/A5060335674",
      "name": "Daniele Caligiore",
      "affiliations": [
        "Institute of Cognitive Sciences and Technologies",
        "National Research Council"
      ]
    },
    {
      "id": "https://openalex.org/A5076711458",
      "name": "Gianluca Baldassarre",
      "affiliations": [
        "Institute of Cognitive Sciences and Technologies",
        "National Research Council"
      ]
    },
    {
      "id": "https://openalex.org/A5080794777",
      "name": "Luca Tummolini",
      "affiliations": [
        "Institute of Cognitive Sciences and Technologies",
        "National Research Council"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2106873067",
    "https://openalex.org/W1963479539",
    "https://openalex.org/W6681789030",
    "https://openalex.org/W6634761788",
    "https://openalex.org/W6682557594",
    "https://openalex.org/W6809085903",
    "https://openalex.org/W2002528399",
    "https://openalex.org/W6750597426",
    "https://openalex.org/W6660217409",
    "https://openalex.org/W6674980145",
    "https://openalex.org/W6658918856",
    "https://openalex.org/W7064035234",
    "https://openalex.org/W1041562435",
    "https://openalex.org/W22232698",
    "https://openalex.org/W2060348782",
    "https://openalex.org/W1483678486",
    "https://openalex.org/W2108877330",
    "https://openalex.org/W7018974130",
    "https://openalex.org/W6634341290",
    "https://openalex.org/W2027243898",
    "https://openalex.org/W2049167508",
    "https://openalex.org/W2077116199",
    "https://openalex.org/W6808960795",
    "https://openalex.org/W2060163163",
    "https://openalex.org/W2055473086",
    "https://openalex.org/W1499697689",
    "https://openalex.org/W7030180902",
    "https://openalex.org/W6814614955",
    "https://openalex.org/W6613669250",
    "https://openalex.org/W6845709182",
    "https://openalex.org/W6806779783",
    "https://openalex.org/W2003931737",
    "https://openalex.org/W1757048528",
    "https://openalex.org/W2006558860",
    "https://openalex.org/W2001851614",
    "https://openalex.org/W2127765148",
    "https://openalex.org/W2011216281",
    "https://openalex.org/W1967933442",
    "https://openalex.org/W6671225910",
    "https://openalex.org/W2156130986",
    "https://openalex.org/W2135446648",
    "https://openalex.org/W6607341179",
    "https://openalex.org/W2083212326",
    "https://openalex.org/W2020267784",
    "https://openalex.org/W2117352571",
    "https://openalex.org/W2131686791",
    "https://openalex.org/W6979730953",
    "https://openalex.org/W2035090004",
    "https://openalex.org/W1164301483",
    "https://openalex.org/W2149981795",
    "https://openalex.org/W6672186209",
    "https://openalex.org/W2108286615",
    "https://openalex.org/W1972292569",
    "https://openalex.org/W6636702136",
    "https://openalex.org/W2152670257",
    "https://openalex.org/W6629952374",
    "https://openalex.org/W6679885670",
    "https://openalex.org/W6820167821",
    "https://openalex.org/W6676359093",
    "https://openalex.org/W2066410035",
    "https://openalex.org/W6679200893",
    "https://openalex.org/W2096255693",
    "https://openalex.org/W6684201099",
    "https://openalex.org/W2114392683",
    "https://openalex.org/W2021947606",
    "https://openalex.org/W6678817696",
    "https://openalex.org/W1964989911",
    "https://openalex.org/W2143445032",
    "https://openalex.org/W2008698320",
    "https://openalex.org/W2127184008",
    "https://openalex.org/W1567866491",
    "https://openalex.org/W2132320420",
    "https://openalex.org/W2106337195",
    "https://openalex.org/W2078871384",
    "https://openalex.org/W6813539642",
    "https://openalex.org/W2046510061",
    "https://openalex.org/W6809579147",
    "https://openalex.org/W6794425202",
    "https://openalex.org/W6683040141",
    "https://openalex.org/W2076148330",
    "https://openalex.org/W1981410850",
    "https://openalex.org/W1989248721",
    "https://openalex.org/W6654789306",
    "https://openalex.org/W2037141354",
    "https://openalex.org/W2145789764",
    "https://openalex.org/W2114258480",
    "https://openalex.org/W6635139342",
    "https://openalex.org/W2136260269",
    "https://openalex.org/W6656400168",
    "https://openalex.org/W2151958671",
    "https://openalex.org/W2798927680",
    "https://openalex.org/W2133485962",
    "https://openalex.org/W2018089515",
    "https://openalex.org/W2078783323",
    "https://openalex.org/W2143968490",
    "https://openalex.org/W1993771541",
    "https://openalex.org/W2108700041",
    "https://openalex.org/W1498883201",
    "https://openalex.org/W3022532439",
    "https://openalex.org/W2100015356",
    "https://openalex.org/W2030868400",
    "https://openalex.org/W1488029108",
    "https://openalex.org/W2165116114",
    "https://openalex.org/W393180982",
    "https://openalex.org/W182350312",
    "https://openalex.org/W2035507551",
    "https://openalex.org/W2158574777",
    "https://openalex.org/W1552415422",
    "https://openalex.org/W2098456436",
    "https://openalex.org/W4214569687",
    "https://openalex.org/W2081981374",
    "https://openalex.org/W2017251524",
    "https://openalex.org/W2506596633",
    "https://openalex.org/W2017060242",
    "https://openalex.org/W2487318725",
    "https://openalex.org/W1964761116",
    "https://openalex.org/W1584697775",
    "https://openalex.org/W2023015865",
    "https://openalex.org/W2026282443",
    "https://openalex.org/W3157616603",
    "https://openalex.org/W4211199450",
    "https://openalex.org/W1626120957",
    "https://openalex.org/W1580236838",
    "https://openalex.org/W2150375089",
    "https://openalex.org/W1970838624",
    "https://openalex.org/W2085529605",
    "https://openalex.org/W2001553306",
    "https://openalex.org/W2081871895",
    "https://openalex.org/W2111977473",
    "https://openalex.org/W4388366214",
    "https://openalex.org/W2166362087",
    "https://openalex.org/W2013139273",
    "https://openalex.org/W4232288974",
    "https://openalex.org/W2952142252",
    "https://openalex.org/W2052612358",
    "https://openalex.org/W4298655789",
    "https://openalex.org/W258590859",
    "https://openalex.org/W1576632330",
    "https://openalex.org/W2033940434",
    "https://openalex.org/W1499896189",
    "https://openalex.org/W2119233587",
    "https://openalex.org/W2062405188",
    "https://openalex.org/W2039251807",
    "https://openalex.org/W2126637080",
    "https://openalex.org/W1983578042",
    "https://openalex.org/W2045096279",
    "https://openalex.org/W2145557079",
    "https://openalex.org/W2129553141"
  ],
  "abstract": "The extended mind view and the embodied-grounded view of cognition and language are typically considered as rather independent perspectives. In this paper we propose a possible integration of the two views and support it proposing the idea of \"Words As social Tools\" (WAT). In this respect, we will propose that words, also due to their social and public character, can be conceived as quasi-external devices that extend our cognition. Moreover, words function like tools in that they enlarge the bodily space of action thus modifying our sense of body. To support our proposal, we review the relevant literature on tool-use and on words as tools and report recent evidence indicating that word use leads to an extension of space close to the body. In addition, we outline a model of the neural processes that may underpin bodily space extension via word use and may reflect possible effects on cognition of the use of words as external means. We also discuss how reconciling the two perspectives can help to overcome the limitations they encounter if considered independently.",
  "full_text": "“fpsyg-04-00214” — 2013/4/30 — 13:00 — page1—# 1\nHYPOTHESIS AND THEORY ARTICLE\npublished: 01 May 2013\ndoi: 10.3389/fpsyg.2013.00214\nThe embodied mind extended: using words as social tools\nAnna M. Borghi1,2*, Claudia Scorolli1, Daniele Caligiore2, Gianluca Baldassarre2 and Luca T ummolini2\n1 EMbodied COgnition Lab, Department of Psychology, University of Bologna, Bologna, Italy\n2 Institute of Cognitive Sciences and T echnologies, National Research Council, Rome, Italy\nEdited by:\nFrançois Osiurak, Laboratoire d’Etude\ndes Mécanismes Cognitifs (EMC EA\n3082), France\nReviewed by:\nMartin H. Fischer, University of\nPotsdam, Germany\nFrank Garcea, University of Rochester,\nUSA\n*Correspondence:\nAnna M. Borghi, EMbodied COgnition\nLab, Department of Psychology,\nUniversity of Bologna, Viale Berti\nPichat, 5, 40127 Bologna, Italy.\ne-mail: anna.borghi@gmail.com\nThe extended mind view and the embodied-grounded view of cognition and language\nare typically considered as rather independent perspectives. In this paper we propose a\npossible integration of the two views and support it proposing the idea of “Words As social\nT ools” (WAT). In this respect, we will propose that words, also due to their social and\npublic character, can be conceived as quasi-external devices that extend our cognition.\nMoreover, words function like tools in that they enlarge the bodily space of action thus\nmodifying our sense of body. T o support our proposal, we review the relevant literature\non tool-use and on words as tools and report recent evidence indicating that word use\nleads to an extension of space close to the body. In addition, we outline a model of the\nneural processes that may underpin bodily space extension via word use and may reﬂect\npossible effects on cognition of the use of words as external means. We also discuss how\nreconciling the two perspectives can help to overcome the limitations they encounter if\nconsidered independently.\nKeywords: embodied cognition, extended cognition, tool-use, words as tools, language comprehension, social\ncognition, body schema, incorporation\nINTRODUCTION\nThe embodied-grounded (EG) view and the extended mind (EM)\nview of cognition and language are typically considered as rather\nindependent perspectives. Aim of this paper is to show how the\ntwo views can be integrated considering the case of words in their\nrelationship with the bodily space. Speciﬁcally, we will propose\nthat words are a very peculiar kind of tool.\nAccording to embodied views of cognition, cognitive processes\nare constrained by our body, that is, human-like cognition can-\nnot occur independently of a human-like body. In the embodied\nview, cognition is not for knowing; rather, “cognition is for action”\n(Wilson, 2002). Proponents of grounded views make a similar\nargument but posit that the involvement of the body is not exhaus-\ntive of cognition, which is grounded in many ways ( Barsalou,\n2008). In fact, while initially the label “embodied” was used in\na more comprehensive way, in the recent literature a slight distinc-\ntion between embodied and grounded approaches, and between\nthe terms “embodied” and “grounded, ” is emerging (seePezzulo\net al., 2011; Fischer, 2012; Myachykov et al., in press). According\nto this view cognition can be grounded in multiple ways. These\ninclude not only bodily states, but also situations, actions, etc.\n(Barsalou, 2008;Pezzulo et al., 2011). In the following, we will use\nthe term embodied and grounded cognition (EG) to refer to both\napproaches, since the distinction is not relevant for the proposal\nwe will advance.\nWhen it comes to language processing, EG views argue that lan-\nguage is grounded in perception and action systems (for reviews:\nWillems and Hagoort, 2007; Fischer and Zwaan, 2008; Gallese,\n2008; T oni et al., 2008; Jirak et al., 2010;Borghi and Pecher, 2011,\n2012; Glenberg and Gallese, 2012). Comprehending language\nwould imply activating a simulation, consisting in a re-enactment\nof the previous interaction with objects, situations, etc., to which\nlinguistic expressions refer.\nIn the last years another perspective on cognition, the EM\nview, is gaining credit, in particular in philosophy. The under-\nlying idea, initially promoted by Clark and Chalmers (1998),i s\nthat the human mind is not wholly in our head/brain, but it\nis rather distributed in our brain, body, and external devices.\nThese external devices (e.g., computers) have the power to\ncomplement and augment our internal cognitive processes (see\nWilson, 2010).\nIn this paper, we will ﬁrst discuss some general limitations\nof EG and EM views, then address some more speciﬁc limits of\nthese views in understanding the role of language. W e will then\nsuggest that words can be understood as social tools, and explain\nwhy, in our opinion, this approach helps to reconcile EG and\nEM views of cognition and to overcome their limitations. Finally,\nwe will discuss experimental evidence to support the W ords as\nsocial T ools (W A T) proposal and we will outline a computational\nmodel to specify the neural mechanisms that might underlie the\naforementioned processes.\nEMBODIED-GROUNDED AND EXTENDED VIEWS\nEven though we favor an EG approach to cognition, we hold that\nEG theories have some problems (for critiques to aspects of the\nembodied approach, see Borghi and Cimatti, 2009, 2010; Chat-\nterjee, 2010; van Elk et al., 2010; Wilson and Golonka, 2013). W e\nwill consider ﬁrst some problems characterizing the EG approach\nin general, and then we will focus on the limitations of the EG\napproach to language, in particular to language comprehension.\nW e will focus on content issues and not on methodological prob-\nlems, as for example the problem of the lack of precise and\nunidirectional predictions, which in our opinion can be solved\nwith a more extensive use of computational models (see for dis-\ncussions on this problem Borghi et al., 2010; Chersi et al., 2010;\nWillems and Franken, 2012). Notice that our critiques might not\nwww.frontiersin.org May 2013| Volume 4| Article 214 | 1\n“fpsyg-04-00214” — 2013/4/30 — 13:00 — pag e2—# 2\nBorghi et al. Words as social tools\nnecessarily concern all versions of EG views, which are sometimes\nrather different (see Goldman and de Vignemont, 2009, for an\nanalysis of this). One major problem of EG views is the high risk\nof adopting the view that Clark (2008) has called “brainbound.”\nIn this view, human cognition directly depends on neural activ-\nity, with the mind being modeled as inner and neurally realized.\nThis position does not accept the idea that cognition might be\ndistributed and extended beyond bodily borders. The brainbound\nview is not convincing for a simple reason, as explained by Noe\n(2009): “the subject of experience is not a bit of your body. Y ou are\nnot your brain. The brain, rather, is part of what you are” (pp. 7).\nIn our opinion many versions of the EG view are too brainbound:\nthey emphasize too much the role of the brain with respect to the\nbody. This might seem paradoxical for an embodied approach:\nobviously no embodied view doesfully neglect the importance of\nthe body, but many EG approaches ascribe a too relevant role to the\nbrain compared to the whole body, at the same time neglecting the\npossible role of body extensions. Similar critiques are expressed by\nWilson and Golonka (2013)who claim: “The major problem with\nthis research is that it again assumes all the hard work is done in\nthe head, with perception and action merely tweaking the result.”\n(Wilson and Golonka, 2013, p. 11). van Elk et al. (2010)further\ndeepen this point, arguing that in cognitive neuroscience embod-\nied approaches are still cognitivist. W e report their own words:\n“In cognitive neuroscience the notion that concepts are embodied\nprimarily means that there is a correspondence between the brain\nactivations associated with processing the referent of a concept and\nthe processing of the concept itself. For instance, seeing a car and\nthinking or reading about a car involves the activation in compa-\nrable visual areas. Thus, the dispute between modal and amodal\ntheories of language comprehension is basically a discussion about\nthe representational vehicle of concepts (i.e., whether the repre-\nsentational vehicle of concepts is shared with neural resources\nused for perception and action). Both modal and amodal theories\nof language thus share a cognitivist notion of cognition in terms\nof discrete internal representations of the world” (van Elk et al.,\n2010, p. 3).\nThe second problem with many EG theories is that they do\nnot sufﬁciently consider and emphasize the fact that the sense of\nbody might be plastically rearranged. Body boundaries are treated\nas rather static while some studies have revealed that they are\nﬂexible and can be modiﬁed, for example through the use of tools,\nchanging with our sense of body (see for example the special issue\non the sense of body byT essari et al., 2010). W e will further address\nthis problem in the rest of the paper.\nWhen they deal with language, one major limit of EG views\nis that language is mainly conceived in its referential aspects. This\nway of conceiving language relies on the classical notion that know-\ning the meaning of a word is knowing what it refers to. Accordingly,\nthe meaning of a word like “hammer” consists in the re-enactment\nof past multimodal experiences with the word referent, i.e. ham-\nmers. For example, according to the indexical theory (Glenberg\nand Robertson, 2000) words would index their referents in the\nworld, which would be represented in terms of perceptual symbols\n(Barsalou, 1999). This referential view of language has a number\nof merits. First, it provided the instruments to contrast the propo-\nsitional view, which was dominant in psychology and cognitive\nsciences (see Lakoff, 2012, for a description of the times before\nthe idea of embodied cognition). In this view concepts and word\nmeanings were seen as the product of a transduction process from\nsensorimotor to abstract knowledge. Knowledge would be rep-\nresented in terms of amodal symbols only arbitrarily related to\ntheir referents, organized through syntactic combinatorial rules\n(e.g., Fodor, 1975; Pylyshyn, 1984). More recent non-embodied\nviews posit that word meaning is a consequence of the statisti-\ncal distribution of words in language (for an inﬂuential version,\nsee Landauer and Dumais, 1997). However, today the necessity to\ncontrast the statistical and the embodied view is not so critical,\nand conciliatory approaches have been proposed (see for example\nAndrews et al., in press).\nSecond, the inﬂuential research program based on these\npremises has inspired many studies, which have led to important\nand sophisticated experimental results (for reviews seeBarsalou,\n2008; Fischer and Zwaan, 2008; Gallese, 2008; T oni et al., 2008;\nJirak et al., 2010; Borghi and Pecher, 2011, 2012). However, an\nembodied referential view is probably not sufﬁcient to provide a\nthorough account of word meaning.\nWhile in psychology and cognitive science the propositional\nview has dominated for a long time and the referential view was\nintroduced by EG theorists as an alternative to it, in philosophy\nthe referential view of language has been widely criticized since\nat least the seminal work of Wittgenstein (1953;s e e Noe, 2009\nfor a contemporary statement): the most widespread view in phi-\nlosophy holds that, for example, we can speak about fawns even\nif we have never seen them since we can rely on the expertise of\nour community. W ords are compositional and we can access the\nmeaning of words of which we do not know or cannot see the ref-\nerent thanks to the expertise of other members of our community.\nAs Noe (2009) nicely argues, “meaning depends on the practice”\n(p. 90), and being able to use words corresponds to knowing what\nthey mean.\nCuriously, while philosophical examinations have gravitated\ntoward treating the practical nature of meaning, the referential\nview is still the predominant one in EG cognition theories. This\nhas probably been due to the desire, on the part of EG propo-\nnents, to contrast the traditional propositional view, according\nto which words are arbitrarily linked to their referents. EG pro-\nponents have assumed that it was necessary to demonstrate that\nwords are grounded, as their referents activate perception and\nmotor systems.\nBeyond the limit of the focus on referentiality, in our view the\nEG view of language has two further limitations given that it has\nneglected two other important aspects of words. The ﬁrst concerns\nthe social and public nature of words, the second the fact that\nwords can be instruments for action. W ords are social and public\nbecause, since they are a heritage of our speakers’ community,\nto be effective they require someone else’s presence, implicit or\nnot. Indeed, speaking implies performing complementary actions\nin coordination with someone else (Clark, 1996). W ords can be\ninstruments for action since their use allows humans to modify\nthe current state of the world, as it happens during tool-use. This\npoint will be further developed in the course of the paper.\nIf EG approaches often tacitly assume a brainbound view of\ncognition, the most vigorous attack to this view derives from the\nFrontiers in Psychology| Cognition May 2013| Volume 4| Article 214 | 2\n“fpsyg-04-00214” — 2013/4/30 — 13:00 — pag e3—# 3\nBorghi et al. Words as social tools\nidea that cognition is not limited to the boundaries of body/skull\nbut is extended. In other words, “minds like ours emerge from this\ncolorful ﬂux as surprisingly seamless wholes: adaptively potent\nmashups extruded from a dizzying motley of heterogeneous ele-\nments and processes” (Clark, 2008, p. 219). According to the EM\nview, tools complement our mental abilities: for example, a diary\ncomplements our memory. As a consequence of this relationship\nbetween brain-body system and external tools, our mind would\nbe distributed (Hutchins, 1995) across a variety of bodily parts\nand non-bodily devices (Clark, 2003; Thompson and Stapleton,\n2009). One potential limitation of EM views, and possibly one of\nthe reasons why they have encountered resistance, is their appeal to\nfunctionalism (Kiverstein and Clark, 2009) which might conﬂict\nwith the assumptions of an embodied view of cognition (but see\nClark, 2008, for a different position, which does not put the two\napproaches in contrast).\nThe EM approach holds a peculiar view of the relation between\nwords and cognition. W ords themselves are considered as external\ndevices and as cognitive tools capable of augmenting our com-\nputational abilities ( Clark, 1998). This view (e.g., Clark, 1998)\nhas its roots in the seminal work ofVygotsky (1962) who under-\nlined the role played by inner language and its scaffolding function\nsupporting actions. However, in our opinion, one of the most\ninteresting aspects of Vygotsky’s notion of inner language is that\nit involves the internalization of a phenomenon which is ini-\ntially (and inherently) social and public and which augments our\ncomputational abilities. Such a social and public component is,\nhowever, underappreciated in the EM approach, which instead\nunderlines the importance of language for developing thought\nand computational abilities.\nHere we propose that EG and EM views can, and should, be\nintegrated. Such integration will overcome their respective limi-\ntations when dealing with language: the limited focus of the EG\nview on the referential aspect of words and the neglect of the social\ndimension of words in the EM view.\nTHE INCORPORATION OF PHYSICAL TOOLS\nEven if it does not pertain to language, one line of research that\nmay suggest how EG and EM views can be reconciled comes from\nrecent work on the recoding of bodily space after tool-use. Below\nwe will brieﬂy review the behavioral, neural and computational\nliterature on this topic and will then try to highlight why it is\nrelevant for us.\nSince Iriki’s seminal work with monkeys (e.g.,Iriki et al., 1996),\nneuroscientiﬁc studies with humans have revealed that active tool-\nuse can change the representation of space, in particular inducing\nan extension of the near space (Berlucchi and Aglioti, 1997; Berti\nand Frassinetti, 2000; Maravita and Iriki, 2004; Farnè et al., 2005;\nOsiurak et al., 2012).\nThe neural mechanisms underlying the extension of body rep-\nresentation caused by the use of a tool have not yet been identiﬁed\n(Magosso et al., 2010; Stout and Chaminade, 2012). Recently, some\nattempts mainly using computational modeling approaches have\nbeen proposed with the aim of identifying such mechanisms. Each\nproposed model sheds light on some important aspect underlying\nthe phenomena. Ursino et al. (2007) and Magosso et al. (2010),\nfor example, point out the involvement of visual-tactile cortical\nregions serving the representation of action affordances and action\noutcomes (including the parietal cortex, PC, and the pre-motor\ncortex, PMC) and Hebbian associative mechanisms to shape the\nbody representation after using a tool. In particular,Ursino et al.\n(2007) claim that the enlargement of the peripersonal space after\ntool-use depends on an expansion of the visual receptive ﬁeld of\nparietal bimodal neurons due to a strengthening of visual synapses\nthrough Hebbian mechanisms. In the same line the model pro-\nposed by Magosso et al. (2010)shows how different tool-use tasks\nlead to different re-sizing effects of the peri-hand space. The model\nalso predicts that, after tool-use, a far visual stimulus acts as a near\none, independently of whether the tool is present or absent in the\nsubject’s hand. The authors validate this prediction by anin-vivo\nexperiment. Other models focus on the role of sub-cortical areas\n(such as the cerebellum, seeArbib et al., 2009, and Imamizu and\nKawato, 2012) in learning and storing internal models of body\nand environment after the use of a tool. Other ones suggest that\nmemory processes are responsible for the dynamical aspects of\ntool-use during tool-body assimilation ( Nabeshima et al., 2007;\nNishide et al., 2009).\nAn open issue in the literature on bodily extension concerns\nwhether the characteristic recoding of spatial perception also\ndetermines a change the body schema. W e will brieﬂy focus\non this discussion since it is important for our view of lan-\nguage. One interesting distinction is between bodily extension\ndetermined by successful tool-use and incorporation following\nsuccessful prosthesis-use. According to De Preester and T sakiris\n(2009), tool-use does not determine changes in the sense of body-\nownership, but only in motor and perceptual capacities (Botvinick,\n2004). A crucial difference is the experience of completion: a non-\ncorporeal object can be incorporated if it replaces something that\noriginally was present, and now is missing. If the object cannot be\nassimilated to the pre-existing body-model (T sakiris, 2010), true\nincorporation cannot occur. Beyond incorporation and use, there\nmight be different degrees of relationship between ourselves and\nthe objects. Some objects are perceived as external, while other\nobjects provoke effects in our own sense of body. However, even\nobjects perceived as completely external evoke motor responses\n(affordances), if they are close enough to our own body (Costantini\net al., 2011b; Ambrosini et al., 2012; for a comprehensive review on\naffordances see Thill et al., 2013).\nThe same distinction between incorporation and use can also\nbe applied to language. The question we will address in the fol-\nlowing pages was initially proposed byClark (2008, p. 39) in the\nfollowing formulation: “Could anything like this notion of incor-\nporation (rather than mere use)... get a grip in the more ethereal\ndomain of mind and cognition?” W e will show how the notion of\nincorporation can be applied to the “ethereal” domain of language.\nHere words, and in particular their public and social dimensions,\ncome into play.\nWORDS AS SOCIAL TOOLS: THE CASE OF SPACE\nThe idea that words can be conceived as tools is not completely\nnew. BeyondWittgenstein (1953), it has been proposed by a num-\nber of authors ( Clark, 1998 ; Borghi and Cimatti, 2009 , 2010,\n2012; Mirolli and Parisi, 2009, 2011; T ylèn et al., 2010). However,\ndifferent aspects of this idea have been stressed.\nwww.frontiersin.org May 2013| Volume 4| Article 214 | 3\n“fpsyg-04-00214” — 2013/4/30 — 13:00 — pag e4—# 4\nBorghi et al. Words as social tools\nIn Philosophical Researches, Wittgenstein (1953)highlighted the\nfact that words can have different and multiple functions, as tools\nin a toolbox. Clark (1998) spoke of the “magic” of words: words\nare external artefacts endowed with the power to augment and\ncomplement our computational abilities. According to him, while\nemphasis has been put on the communicative aspects of language,\nits computational role has been neglected, with the possible excep-\ntion of Vygotsky who has underlined the role played by inner\nlanguage and scaffolding to direct our actions.\nThe view we will present is slightly different. W e agree that\nthe computational role of inner language, intended as a guide for\naction, has not been considered enough. However, we intend to\nstress the role of other aspects of words that, despite the novel burst\nof interest for social neuroscience, have been neglected: the social\nand public role words possess. In order to be effective, words do\nnot only need to refer correctly to objects or situations in the world.\nLanguage is also a powerful instrument for joint action. W ords are\ntools, as they allow for the mental manipulation of information\n(Malt and W olff, 2010). This in an individual and private use, as\nsome authors have underlined. However, words have a peculiarity:\nto manipulate inner information we take advantage of a device\nthat is social and public in its nature. For this reason we claim\nthat words are “social tools.” Speciﬁcally, in this paper we will\nconsider a special case of similarity between words as social tools\nand physical tools, concerning the relationship between space and\nbody.\nW ords and physical tools share an important feature: both can\nbe used to accomplish goals via external means, respectively, other\npeople and objects, resulting in a change of the current state of\nthe world (Glenberg and Gallese, 2012) and in an extension of\nour capabilities. Consider the case of words as tools that can be\nused to reach for something. W e can reach objects with a physical\ntool (e.g., a rake), but also by asking somebody to bring them to\nus. Thus, in certain contexts the same goal can be reached either\nthrough tools, or through words. In some cases, words are even\nmore powerful than tools. For example, they might allow us to\nreach very distant objects.\nHowever, words work as tools only under the condition that\nother people collaborate. Even if our proposal is in debt with\nthe pragmatics literature (e.g., Levinson, 1983) and with Austin\n(1962)’s idea that we do things with words, here we intend to\nmake a distinction between advancing a request for an object and\nperforming an action with a tool. These two activities share many\nsimilarities, but are also clearly different. An action with an instru-\nment can be planned but fail, for example due to problems of the\ninstrument, etc. Similarly, a request can be disattended, either\nbecause of problems in its formulation, or due to disruptions in\ncommunication, or scarce compliance on the side of the addressee.\nBut people can decide to use tools to reach a goal on their own,\nwithout the presence of other individuals. This is not possible with\nwords. The referent of a word can be found, but if other individ-\nuals do not provide a support, i.e., if the social dimension implied\nin word use is absent, the request will not succeed. Thus words\nare a peculiar kind of instrument: they work effectively only if\nother people are available and respond positively to our implicit\nor explicit request. What counts is the dynamic interaction they are\nable to promote (seeCooke et al., 2013, on team cognition). When\nperforming activities which require coordination, such as lifting\nvery heavy objects, we need to possess the sophisticated ability to\nunderstand others’ action plans, others’ willingness to collaborate,\netc. (Marsh et al., 2009). Similarly, this ability should be present\nduring language use as well, otherwise words, even if referentially\ncorrect, are not effective. In this respect, words constitute a bridge\nbetween ourselves, the environment and the others.\nHere we propose that words and tools share a further similar-\nity: we consider the possibility that when we use words to reach\nfor something, word use expands the near space, modifying the\nrepresentation of the relationship between our own body and the\nobjects in space, similarly to what happens after tool use. The argu-\nment behind this hypothesis is the following: if words are similar\nto tools, then their use should lead to an extension of the bodily\nspace, as it happens with real tools.\nOne could object that words and tools are substantially differ-\nent, since tools are physical things in the world that we use with\nour bodies while words are not. W e understand the objection, but\nthe perspective we endorse is radically different: according to W A T\n(e.g., Borghi and Cimatti, 2009, 2012) not only tools but words\nas well can be considered as physical things. They are expressed\nthrough our bodies, be they spoken or written, and once pro-\nnounced or written they have a material and public existence,\nsimilarly to tools (Wittgenstein, 1953; Clark, 1998).\nNow consider the relationship between words and body accord-\ning to EG theories and the relationship between words and mind\naccording to the EM view. EG theorists demonstrated that compre-\nhending words activates the motor system. EM theorists propose\nthat, as tools extend our body schema, “language extends our\ncapacities for thought and therefore can be treated as extending\nour mind schema” (Noe, 2009). In fact, it has been shown that\nlanguage modiﬁes cognition, for example inﬂuencing perception\nand categorization (W olff and Malt, 2010), in a ﬂexible manner\n(Lupyan, 2012). But so far nobody has shown that word use might\nrecode our bodily space with respect to objects, as it happens for\nphysical tools. Notice that the parallel between words and tools is\nnot only abstract and metaphorical; in contrast, we formulate the\nprecise prediction, to be tested experimentally, that both words\nand physical tools have a speciﬁc effect on cognition, i.e., that their\nuse determines an expansion of the bodily space representations.\nDemonstrating this would imply to apply the notion of incorpo-\nration to the “ethereal” domain of language. At the same time, it\ncould help reconcile the EG and the EM view.\nWORDS AS SOCIAL TOOLS AND SPACE: EXPERIMENTAL\nEVIDENCE AND A MODEL\nEXPERIMENTAL EVIDENCE\nRecent experimental evidence supports the idea that words can be\nconsidered as tools that extend the bodily space.\nScorolli et al.(2011; submitted) andScorolli and Borghi (2012)\ndemonstrated with a kinematics study that word use modiﬁes spa-\ntial perception. Participants, children and adults, observed objects\nlocated in the peripersonal, extrapersonal or far and “border”\nspace. For operational reasons we deﬁned “peripersonal, ” or “near, ”\nas the space reachable extending the arm (but see the discussion\non the problems of this deﬁnition due to the plasticity of the\nnear space made by Longo and Lourenco, 2006; Lourenco and\nFrontiers in Psychology| Cognition May 2013| Volume 4| Article 214 | 4\n“fpsyg-04-00214” — 2013/4/30 — 13:00 — pag e5—# 5\nBorghi et al. Words as social tools\nLongo, 2009), “extrapersonal, ” or “far, ” as the non-reachable space,\nand “border” as the space reachable extending the arm and the\nback. Before and after training, subjects were asked to produce\nexplicit verbal estimations on objects’ distances, or to throw a\ntoy-car toward objects’ locations. During the training phase par-\nticipants had to reach and grasp the “right” object and to put it in a\nbox provided by different shaped holes. If the right object was too\nfar, they could use a tool (a rake), press a button or use a linguistic\nlabel, pronouncing the object noun; all instruments were effec-\ntive in reaching the goal. W e introduced the button since we were\ninterested in comparing the rake and the button, i.e., two instru-\nments that, differently from words, do not imply a social context\nto be used. While participants hold the rake in their hands, the\nbutton has an arbitrary relation to the object, similarly to a word:\nonce pressed, the object appears. In the last years, few studies have\nshown that even arbitrary relationships with a target can mod-\nify the perception of peripersonal space.Davoli et al. (2012)have\nshown that remote interactions with a target, for example illumi-\nnating the target object with a laser pointer, caused an extension\nof the perceived space. In the same vein, Bassolino et al. (2010)\ndemonstrated that frequent use of a computer mouse determined\na spatial extension. The difference between a button, i.e., a device\nthat is arbitrary linked to the object to be reached, and a word is\nthat the last one implies a social dimension.\nThe results of the study revealed that after training, even if the\nverbal estimations changed slightly, the car was thrown signiﬁ-\ncantly closer than before the training. This indicated an extension\nof the reachable space, not modulated by the instrument kind.\nAs other studies on extended body, this work suggests that the\ndistinction between near and far space is plastic and ﬂexible. How-\never, here the extension was brought about not only by physical\ntools but by immaterial ones as well, i.e. by words. The social\ndimension implicit in words made this possible: pronouncing an\nobject name implies evoking somebody else performing a comple-\nmentary action, helping us reach a distant object. Thus words, like\ntools, help us act in the world and inﬂuence our way of representing\nbodily space with respect to objects (Gianelli et al., 2013). How-\never, with words, our operational space becomes larger because of\nthe presence of others. Even if we propose that the social dimen-\nsion is intrinsic in word use per se, we predict that the results\nwill be stronger, i.e. the spatial extension with words will be more\nmarked, in presence of another person. In particular, this exten-\nsion should be particularly marked if the other person is close to\nthe object, is looking directly at the participant and demonstrates\nthrough gestures and posture to be open to the interaction (see\nInnocenti et al., 2012; Scorolli et al., 2012). W e predict, instead,\nthat if the other person is not close to the object, and the body\nposture and the facial expression of the other are not expressing\ncompliance, the effects of words will be reduced, given that the\nrequest is less likely to be attended. In sum,Scorolli et al. (2011;\nsubmitted) have shown that words alone are effective in modifying\nthe bodily space. However, we predict that their effect will be more\nmarked in a context in which the social dimension is emphasized,\nthanks to the real presence of another person.\nThese results are complementary with those obtained by\nCostantini et al. (2011b). Previous evidence demonstrated that\nobjects afford actions only when presented in the peripersonal\nspace e.g., Costantini et al. (2011a). The novelty of the study by\nCostantini et al. (2011b)consisted in showing that when the object\nwas outside subject’s reaching space but within an avatar’s reach-\ning space, it evoked affordances as well. According to the authors,\nthis indicates that an interpersonal body representation is formed\nin which one’s own arm reaching space is mapped with that of\nothers’ . Notice that an avatar might evoke the presence of another\nperson, but the effects it produces might not be as strong as those\nelicited by the presence of a real other.\nHowever, these ﬁndings together with those by Scorolli et al.\n(2011; submitted) andScorolli and Borghi (2012), in which words\nrefer only implicitly to the presence of another person, suggest that\nthe subject’s representation of reaching space is actually extended.\nImportantly, in the study by Scorolli et al. (2011; submitted) the\nother person plays a complementary role as he/she is implicitly\nevoked to perform an action one cannot perform alone (Newman-\nNorlund et al., 2007).\nIn sum: it has been suggested that active tool-use determines\na progressive incorporation of the tool within the body schema\n(Iriki et al., 1996; Povinelli et al., 2010). The analogous extension\nof the operational space found after the rake, the button and the\nword use suggests that the reaching space extension is not due to\nthe possibility of the tool to be integrated into the body schema,\nbut to the goal-directed character of the action ( Hommel et al.,\n2001; Massen and Prinz, 2009 ). However, some issues remain\nopen.\nThe studies discussed so far indicate that words, similarly to\nreal tools, determine a plastic modiﬁcation of the reaching space,\neven if they cannot be integrated into the body schema as tools\ndo. However, the evidence we reported concerns concrete words,\nand speciﬁcally words with speciﬁcreferents endowed with a pre-\ncise spatial location. One could ask whether the claim that words\nare tools can be generalized, i.e., whether other kinds of words\ncan determine variations in the bodily space. Even if we are not\naware of any evidence, we can speculate that even words like “the”\nor like “freedom, ” which do not have a speciﬁc concrete counter-\npart, can expand our near space (for work on mapping between\ndemonstratives such as “this” and “that” and near and far space,\nsee Coventry et al., 2008, 2012; Bonﬁglioli et al., 2009). As we say\nsomething to somebody else through words we somehow create\na novel, shared space. This should happen with each word, as\neach word is pronounced to be heard by somebody else. However,\nwhile we reported evidence showing that concrete words expand\nthe peripersonal space, the possibility that this is true for other\nkinds of words is currently a speculation, and further research is\nneeded in order to demonstrate it.\nA further question one could raise is the following: do intransi-\ntive gestures as well induce an extension of the near space, similarly\nto tools? Indeed, for communicative gestures to succeed, we need\nthat others are available and ready to collaborate, as it happens with\nwords. Compared to gestures, however, words have a number of\nadvantages: (a) they are typically more speciﬁc than gestures (e.g.,\nI can point to an object I would like to receive, but the context\nmight not help you to identify the precise object: this potential\nproblem can be easily solved using the appropriate word); (b) they\nare arbitrarily related to their referents, and this allows more free-\ndom of action; (c) also thanks to b, they are less tightly anchored\nwww.frontiersin.org May 2013| Volume 4| Article 214 | 5\n“fpsyg-04-00214” — 2013/4/30 — 13:00 — pag e6—# 6\nBorghi et al. Words as social tools\nto a speciﬁc context and situation. Normally gestures coexist with\nwords, even if they can have a separate meaning (McNeill, 2000;\nKendon, 2004). Furthermore, it has been shown that gestures\ndo not develop imitating others, but emerge in an autonomous\nway and are integrated in speech, probably because they facilitate\nthinking (Bates, 1976; Capirci et al., 1996; Iverson and Goldin-\nMeadow, 1998). On this basis we can advance the prediction that\ncombinations of gestures and words would increase the effect with\nrespect to words alone. As to the sign language, where gestures\ndirectly substitute words, we predict a similar effect as the one\nobtained with words. But consider the case in which gestures\nare not coupled with words but used as substitutes for them. In\nthis case our predictions are not so straightforward, and further\nresearch is needed to investigate this important issue (for relevant\nwork, see De Stefani et al., under review).\nTOWARD A COMPUTATIONAL MODEL OF WORDS AS SOCIAL TOOLS\nAlthough the models reviewed in the Section “The incorporation\nof physical tools” give important insights on the brain mechanisms\nunderlying the adaptation of body representation after using a\ntool, they do not deal with the question of the possible neu-\nral mechanisms underlying the processes of words as tools. T o\naddress this problem, it is crucial to consider three key aspects\nnot yet considered by previous models: (a) the brain has a hierar-\nchically (soft)modular organization (Meunier et al., 2010; Houk,\n2011; b) such organization pivots on anticipatory/goal-based rep-\nresentations of actions at multiple levels (Hamilton and Grafton,\n2008; c) words are grounded on the same (or contiguous) neural\nrepresentations sub-serving action (for reviews, seeMartin, 2007;\nJirak et al., 2010).\nA bio-inspired neural architecture based on these points is\nsketched in Figure 1. The overall model architecture is built on\nthe model of Caligiore et al. (2010), capturing important aspects\nof hierarchical brain organization. Even if the model proposed\nhere is not computationally implemented, the discussion of its\ndesign features allows us to unveil important aspects overlooked\nby current models on tool-body assimilation. These aspects could\nbe important to investigate the neural mechanisms underlying the\nnotion of words as social tools.\nFigure 1A represents the fact that the vision of an object in the\nperipersonal space evokes several potential affordances (encoded\nby the neurons of PC) and actions (encoded by the neurons\nof PMC) selected based on BG and local competitions ( Cisek,\n2007). Importantly, some neurons of these areas represent affor-\ndances and actions in terms of expected outcomes (Hamilton and\nGrafton, 2008) or goals (“distal goals, ”Umiltà et al., 2008), such as\n“reaching the object, ” rather than in terms of detailed movement\ncommands encoded in the motor cortex (MC). The pre-frontal\ncortex (PFC), which encodes the agent’s ultimate goals based on\nthe internal and external context, exerts a top-down biasing effect\non the formation of proximal goals and on the selection of differ-\nent affordances and actions taking place in the PC and PMC and\nultimately leading to perform speciﬁc movements (MC).\nThe mechanisms of affordance and action selection based\non goals are crucial to explain the modulation of neural\nrepresentations when a tool is used to reach far objects. The key\nidea is that the neurons of PC/PMC encoding affordances and\nactions in terms of expected effects can allow the abstraction of the\nspeciﬁc aspects of actions pertaining to the use of the limb or the\ntool. For example, Figure 1B shows that, when using a tool to\nFIGURE 1| A model of tool-body assimilation.In the model, the visual\ncortex (VC) performs basic visual processing; the parietal cortex (PC) extracts\naffordances based on body/world relations and encodes abstract action goals;\nthe pre-motor cortex (PMC) prepares actions based on more speciﬁc action\ngoals; the pre-frontal cortex (PFC) encodes the agent’ s ultimate goals based\non context and internal homeostatic regulations, and on this basis contributes\nto form action goals in the PMC and the PC; cortico-cerebellar (Cer) loops\nsimulate body-world, dynamics; cortico-basal ganglia (BG) loops underlie\naction and affordance selection processes.(A–C) represent a possible\nprogression of development of representations from body actions, to\ntool-mediated actions and words-as-tool actions, all relying on the same\nmacro brain areas and on partially overlapping local neural modules (cell\nassemblies). Multiple PC-PMC arrows represent multiple affordance-action\noptions and the black arrow the most active within these.\nFrontiers in Psychology| Cognition May 2013| Volume 4| Article 214 | 6\n“fpsyg-04-00214” — 2013/4/30 — 13:00 — pag e7—# 7\nBorghi et al. Words as social tools\nreach the object, PC neurons might encode the salient features of\nboth the target and the tool while PMC neurons might encode\nthe “reach the target” goal: as these representations have many fea-\ntures in common (same object and context, similar effect, similar\nattentional focus on the object, etc.) with those activated when\nreaching without a tool, the neural populations encoding them\nmight strongly overlap and form Hebbian associations. These\nmight lead to change the representations related to space.\nThe effects of words as tool on space representation might be\ndue to these mechanisms and to the fact that words are grounded in\nthe same neural structures underlying perception and action (Cali-\ngiore et al., 2010). Figure 1Cshows this with an example where the\nobject is in the extrapersonal space but another person is close to\nit. In this case, the use of a phono-articulation of a word (e.g., the\nname of the target directed at a caregiver in childhood) might pro-\nduce the same outcome of a direct reach. This and the similarities\nof context, intentions, target, or even (failed) reaching movement,\nmight cause an overlap and association between the space-related\nrepresentations active in the two conditions. The fact that heard\nwords may further compact sensorimotor representations (Mirolli\nand Parisi, 2009 ) would strengthen this process. This might\nwarp all representations of space incorporating “reachability”\ninformation and lead to effects such as those observed in our study.\nPossible alternatives to our view could refer to the fact\nthat the neural basis for language comprehension and tool-use\nmight to some extent differ. As it is well known, the ventral\nstream plays a major role for semantics and language process-\ning, whereas the dorsal stream is crucial for action preparation\nand execution (e.g., Chao and Martin, 2000; Johnson-Frey et al.,\n2005), processes very important for tool-use. There is also clear\nevidence of dissociations between language and praxis in neu-\nropsychological patients (e.g., Buxbaum et al., 2001; Humphreys\nand Forde, 2001).\nW e do not think that our proposal is really weakened by these\narguments, for at least two reasons. First, recent literature has\nsmoothened the distinction between ventral and dorsal streams\n(see for example Goodale and W estwood, 2004). Some authors\nhave shown the many interactions between the two routes (Gallese\net al., 1999). Furthermore, a sub-distinction between a dorso-\ndorsal and a dorso-ventral route has been proposed (e.g.,Rizzolatti\nand Matelli, 2003). Accordingly, words referring to action would\nbe processed in the dorso-ventral rather than in the ventral stream\n(see proposals by Binkofski and Buxbaum, in press; Borghi and\nRiggio, 2009; Marino et al., 2013).\nMore generally, our aim is to show that in some conditions\nwords can change some of our internal brain representations as is\ndone by tools (for an analysis of shared brain mechanisms between\ncomplex tool-use and language, seeFrey, 2008), but not that the\ncaused changes are identical in the two conditions.\nAt a more basic level, here we do not intend to argue that\nlanguage use equals tool-use in all respects. In line with theories\nof reuse (e.g.,Anderson, 2010) we think that language is grounded\nin the sensorimotor system, but that, being at a higher abstraction\nlevel, modiﬁcations and constraints are introduced (for developing\nthis argument, seeBorghi, 2012). In synthesis, our aim is to show\nthat words are tools, but they are not only tools.\nCONCLUSION\nW ords are ﬁrst encountered as objects. They are peculiar objects,\nthough, because they implicitly refer to a social and public dimen-\nsion and because they are immaterial ones. Later they become\ninternalized (Vygotsky, 1962). The capability to use (inner) lan-\nguage modiﬁes our internal processes; language is a powerful\nmeans to reconﬁgure our mental abilities and capability of con-\ntrol. Therefore words help us in “self-engineering” ourselves, to\nperform better in our ecological niche. But when we produce\nthem, words are also objects outside from us. Differently from\nthe physical tools that, when used, recode the spatial relationship\nbetween our body and the world, words are part of the ethereal\nworld of cognition. Even if they are immaterial, we have sug-\ngested that words are both extended and embodied. They are both\nextended and embodied because their use determines a remap-\nping of the relationships between our body, the objects and the\nspace.\nThe evidence that EG theorists have collected shows that words\nare embodied and grounded in our sensorimotor system. However,\nso far EG research has been exceedingly focused on words’ refer-\nents and on how their meaning is represented in the brain, while\nneglecting what can be achieved through words. Seeing words\nas tools that extend our near space allow us to overcome these\nlimitations.\nAt the same time, EM theorists have shown that words can be\nused as tools that augment our computational potentialities, and\nthat meaning is not limited to what is represented in the brain.\nHowever, the EM perspective has insufﬁciently explored the social\nand public role words play. As we have shown, the remapping of the\nbodily space we found with words is granted by the fact that words\nimply the presence of others: somehow our own space becomes\nlarger as it incorporates the space of others. These implied others\ncomplement our abilities, and we call them into play by means of\nwords.\nIn sum, we think that the idea that words work as social\ntools that extend our near space can help combining two very\npromising and sophisticated perspectives, the EG and the EM\nviews.\nW e agree withClark (2008)when he invites us “to cease to unre-\nﬂectively privilege the inner, the biological, the neural.”(p. 218).\nAccepting this invitation does not imply avoiding to ascribe value\nto the inner, the biological, the neural. In contrast, it permits the\ncombination of an EG and an extended perspective on cognition\nin which the mind emerges “at the productive interface of brain,\nbody, and social and material world.” T reating words as social tools\nhighlights exactly this.\nACKNOWLEDGMENTS\nFunds: ROSSI project (Emergence of communication in Robots\nthrough Sensorimotor and Social Interaction (Grant agreement\nn. 216125) to Anna Borghi, Claudia Scorolli and Daniele Cali-\ngiore, MIUR funds to Anna Borghi, IM-CLeV eRproject “Intrinsi-\ncally_Motivated_Cumulative_Learning_V ersatile_Robots, ” grant\nagreement No. ICT-IP-231722) to Daniele Caligiore and\nGianlucaBaldassarre, and SINTELNET FET-OPEN CA (grant\nagreement No. 286370) to Luca T ummolini.\nwww.frontiersin.org May 2013| Volume 4| Article 214 | 7\n“fpsyg-04-00214” — 2013/4/30 — 13:00 — pag e8—# 8\nBorghi et al. Words as social tools\nREFERENCES\nAmbrosini, E., Scorolli, C., Borghi, A.\nM., and Costantini, M. (2012). Which\nbody for embodied cognition? Affor-\ndance and language within actual and\nperceived reaching space. Conscious.\nCogn. 21, 1551–1557.\nAnderson, M. L. (2010). Neural reuse as\na fundamental organizational princi-\nple of the brain.Behav. Brain Sci.33,\n245–266.\nAndrews, M., Frank, S., and Vigliocco,\nG. (in press). Reconciling embodied\nand distributional accounts of mean-\ning in language.To p. Co g n . S c i .\nArbib, M. A., Bonaiuto, J. B.,\nJacobs, S., and Frey, S. H. (2009).\nT ool use and the distalization of\nthe end-effector. Psychol. Res. 73,\n441–462.\nAustin, J. L. (1962). How to Do Things\nwith Words. Oxford: Oxford Univer-\nsity Press.\nBarsalou, L. W . (1999). Perceptual sym-\nbol systems. Behav. Brain Sci. 22,\n577–609.\nBarsalou, L. W . (2008). Grounded\ncognition. A n n u .R e v .P s y c h o l .59,\n617–645.\nBassolino, M., Serino, A., Ubaldi, S., and\nLàdavas, E. (2010). Everyday use of\nthe computer mouse extends periper-\nsonal space representation.Neuropsy-\nchologia 48, 803–811.\nBates, E. (1976).Language and Context.\nNew Y ork: Academic Press.\nBerlucchi, G., and Aglioti, S. (1997). The\nbody in the brain: neural bases of cor-\nporeal awareness.Trends Neurosci.20,\n560–564.\nBerti, A., and Frassinetti, F . (2000).\nWhen far becomes near: remapping\nof space by tool use.J. Cogn. Neurosci.\n12 , 415–420.\nBinkofski, F ., and Buxbaum, L. J. (in\npress). T wo action systems in the\nhuman brain. Brain Lang.\nBonﬁglioli, C., Finocchiaro, C.,\nGesierich, B., Rositani, F ., and\nV escovi, M. (2009). A kinematic\napproach to the conceptual represen-\ntation of this and that.Cognition 111,\n270–274.\nBorghi, A. M. (2012). “ Action lan-\nguage comprehension, affordances\nand goals, ” in Language and Action\nin Cognitive Neuroscience: Contem-\nporary T opics in Cognitive Neuro-\nscience Series, eds Y . Coello, and A.\nBartolo (London: Psychology Press),\n125–143.\nBorghi, A. M., Caligiore, D., and\nScorolli, C. (2010). “Objects, words,\nand actions. Some reasons why\nembodied models are badly needed in\ncognitive psychology, ” inApplications\nof Mathematics in Models, Artiﬁcial\nNeural Networks and Arts: Mathe-\nmatics and Society, eds V . Capecchi,\nM. Buscema, P . Cantucci, and B.\nD’Amore (Berlin: Springer).\nBorghi, A. M., and Cimatti, F . (2009).\n“W ords as tools and the problem of\nabstract words meanings, ” inProceed-\nings of the 31st Annual Conference\nof the Cognitive Science Society ,e d s\nN. T aatgen, and H. van Rijn (Ams-\nterdam: Cognitive Science Society),\n2304–2309.\nBorghi, A. M., and Cimatti, F . (2010).\nEmbodied cognition and beyond:\nacting and sensing the body. Neu-\nropsychologia 48, 763–773.\nBorghi, A. M., and Cimatti, F . (2012).\nW ords are not just words: the social\nacquisition of abstract words.RIFL 5,\n22–37.\nBorghi, A. M., and Pecher, D.\n(2011). Introduction to the special\ntopic embodied and grounded cog-\nnition. Front. Psychol. 2:187. doi:\n10.3389/fpsyg.2011.00187\nBorghi, A. M., and Pecher, D. (eds).\n(2012). Embodied and Grounded Cog-\nnition. Lousanne: Frontiers.\nBorghi, A. M., and Riggio, L. (2009).\nSentence comprehension and simula-\ntion of objects temporary, canonical\nand stable affordances. Brain Res.\n1253, 117–128.\nBotvinick, M. (2004). Probing the neu-\nral basis of body ownership. Science\n305, 782–783.\nBuxbaum, L. J., V eramonti, T ., and\nSchwarz, M. F . (2001). Function\nand manipulation too knowledge in\napraxia: knowing “What for” but not\n“how” .Neurocase 6, 83–97.\nCaligiore, D., Borghi, A. M., Parisi, D.,\nand Baldassarre, G. (2010). TRoP-\nICALS: a computational embod-\nied neuroscience model of compat-\nibility effects. Psychol. Rev. 117,\n1188–1228.\nCapirci, O., Iverson, J. M., Pizzuto,\nE., and V olterra, V . (1996). Gestures\nand words during the transition to\ntwo-word speech. J. Child Lang. 23,\n645–673.\nChao, L. L., and Martin, A. (2000).\nRepresentation of manipulable man-\nmade objects in the dorsal stream.\nNeuroimage 12, 478–484.\nChatterjee, A. (2010). Disembodying\ncognition. Lang. Cogn.2, 79–116.\nChersi, F ., Thill, S., Ziemke, T ., and\nBorghi, A. M. (2010). Sentence pro-\ncessing: linking language to motor\nchains. Front. Neurorobot. 4:4. doi:\n10.3389/fnbot.2010.00004\nCisek, P . (2007). Cortical mecha-\nnisms of action selection: the affor-\ndance competition hypothesis. Phi-\nlos. Trans. R. Soc. Lond. B Biol. Sci.\n362, 1585–1599.\nClark, A. (1998). “Magic words: how\nlanguage augments human compu-\ntation, ” in Language and Thought:\nInterdisciplinary Themes ,e d s P .\nCarruthers, and J. Boucher (Cam-\nbridge: Cambridge University Press).\nClark, A. (2003).Natural-Born Cyborgs:\nMinds, T echnologies and the Future\nof Human Intelligence .N e w Y o r k :\nOxford University Press.\nClark, A. (2008). Supersizing the mind.\nEmbodiment, action, and cognitive\nextension. Oxford: Oxford University\nPress.\nClark, A., and Chalmers, D. (1998). The\nextended mind. Analysis 58, 7–19.\nClark, H. H. (1996). Using language.\nCambridge: Cambridge University\nPress.\nCooke, N. J., Gorman, J. C., Myers, C.\nW ., and Duran, J. L. (2013). T eam\ncognition. Cogn. Sci. 37, 255–285.\nCostantini, M., Ambrosini, E., Scorolli,\nC., and Borghi, A. M. (2011a). When\nobjects are close to me: affordances in\nthe peripersonal space.Psychon. Bull.\nRev. 18, 302–308.\nCostantini, M., Committeri, G., and\nSinigaglia, C. (2011b). Ready both\nto your and to my hands: map-\nping the action space of others.PLoS\nONE 6:e17923. doi: 10.1371/jour-\nnal.pone.0017923\nCoventry, K., Grifﬁths, D., and Hamil-\nton, C. (2012). Language and the per-\nceptual parameters affecting the rep-\nresentation of space. Embodied and\nsituated language processing, ESLP\n2012, Newcastle upon T yne.\nCoventry, K. R., V aldés, B., Castillo,\nA., and Guijarro-Fuentes, P . (2008).\nLanguage within your reach: near-far\nperceptual space and spatial demon-\nstratives. Cognition 108, 889–895.\nDavoli, C. C., Brockmole, J. R., and Witt,\nJ. K. (2012). Compressing perceived\ndistance with remote tool-use: real,\nimagined, and remembered. J. Exp.\nPsychol. Hum. Percept. Perform. 38,\n80–89.\nDe Preester, D., and T sakiris, M.\n(2009). Body-extension versus body-\nincorporation: is there a need for a\nbody-model? Phenomenol. Cogn. Sci.\n8, 307–319.\nFarnè, A., Iriki, A., and Làdavas, E.\n(2005). Shaping multisensory action-\nspace with tools: evidence from\npatients with cross-modal extinction.\nNeuropsychologia 43, 238–248.\nFischer, M. H. (2012). A hierarchical\nview of grounded, embodied, and\nsituated numerical cognition. Cogn.\nProcess. 13, 161–164.\nFischer, M. H., and Zwaan, R. (2008).\nEmbodied language: a review of the\nrole of the motor system in language\ncomprehension. Q. J. Exp. Psychol.61,\n825–850.\nFodor, J. A. (1975). The Language of\nThought. Cambridge: Harvard Uni-\nversity Press.\nFrey, S. H. (2008). T ool use, commu-\nnicative gesture and cerebral asym-\nmetries in the modern human brain.\nPhilos. Trans. R. Soc. Lond. B Biol. Sci.\n363, 1951–1957.\nGallese, V . (2008). Mirror neurons and\nthe social nature of language: the\nneural exploitation hypothesis. Soc.\nNeurosci. 3, 317–333.\nGallese, V ., Craighero, L., Fadiga, L.,\nand Fogassi, L. (1999). Perception\nthrough action.Psyche 5, Available at:\nhttp://psyche.cs.monash.edu.au/v5\n/psyche-5-21-gallese.html\nGianelli, C., Scorolli, C., and Borghi, A.\nM. (2013). Acting in perspective: the\nrole of body and of language as social\ntools. Psychol. Res.77, 40–52.\nGlenberg, A. M., and Gallese, V .\n(2012). Action-based language: a the-\nory of language acquisition, compre-\nhension, and production. Cortex 48,\n905–922.\nGlenberg, A. M., and Robertson, D.\nA. (2000). Symbol grounding and\nmeaning: a comparison of high-\ndimensional and embodied theories\nof meaning. J. Mem. Lang. 43,\n379–401.\nGoldman, A., and de Vignemont, F .\n(2009). Is social cognition embodied?\nTrends Cogn. Sci.13, 154–159.\nGoodale, M. A., and W estwood, D. A.\n(2004). An evolving view of duplex\nvision: separate but interacting cor-\ntical pathways for perception and\naction. Curr. Opin. Neurobiol. 14,\n203–211.\nHamilton, A. F . C., and Grafton, S.\nT . (2008). Action outcomes are rep-\nresented in human inferior fron-\ntoparietal cortex. Cereb. Cortex 18,\n1160–1168.\nHommel, B., Müsseler, J., Ascher-\nsleben, G., and Prinz, W . (2001).\nThe theory of event coding (TEC): a\nframework for perception and action\nplanning. Behav. Brain Sci. 24,\n849–878.\nHouk, J. C. (2011). “ Action selection\nand reﬁnement in subcortical loops\nthrough basal ganglia and cerebel-\nlum, ” in Modelling Natural Action\nSelection, eds A. Seth, J. Bryson, and\nT . Prescott (Cambridge: Cambridge\nUniversity Press), 176–207.\nHumphreys, G. W ., and Forde, E. M.\n(2001). Hierarchies, similarity, and\ninteractivity in object recognition:\n“category-speciﬁc” neuropsychologi-\ncal deﬁcits. Behav. Brain Sci. 24,\n453–476.\nHutchins, E. (1995). Cognition in the\nWild. Cambridge: MIT Press.\nImamizu, H., and Kawato, M.\n(2012). Cerebellar internal mod-\nels: implications for the dexter-\nous use of tools. Cerebellum 11,\n325–335.\nFrontiers in Psychology| Cognition May 2013| Volume 4| Article 214 | 8\n“fpsyg-04-00214” — 2013/4/30 — 13:00 — pag e9—# 9\nBorghi et al. Words as social tools\nInnocenti, A., De Stefani, E., Bernardi,\nN. F ., Campione, G. C., and Gen-\ntilucci, M. (2012). Gaze direction\nand request gesture in social inter-\nactions. PLoS ONE 7:e36390. doi:\n10.1371/journal.pone.0036390.\nIriki, A., T anaka, M., and Iwamura,\nY . (1996). Coding of modiﬁed body\nschema during tool use by macaque\npostcentral neurons. Neuroreport 7,\n2325–2330.\nIverson, J. M., and Goldin-Meadow,\nS. (1998). Why people ges-\nture when they speak. Nature\n396, 228.\nJirak, D., Menz, M., Buccino, G., Borghi,\nA. M., and Binkofski, F . (2010).\nGrasping language. A short story on\nembodiment. Conscious. Cogn. 19,\n711–720.\nJohnson-Frey, S. H., Newman-Norlund,\nR., and Grafton, S. T . (2005). A\ndistributed left hemisphere network\nactive during planning of everyday\ntool use skills. Cereb. Cortex 15,\n681–695.\nKendon, A. (2004). Gesture: Visi-\nble Action as Utterance. Cambridge:\nCambridge University Press.\nKiverstein, J., and Clark, A. (2009).\nIntroduction: mind embodied,\nembedded, enacted: one church or\nmany? To p o i28, 1–7.\nLakoff, G. (2012). Explaining embodied\ncognition results. T opics Cogn. Sci.4,\n773–785.\nLandauer, T ., and Dumais, S. (1997).\nA solutions to Plato’s problem: the\nlatent semantic analyis theory of\nacquisition, induction and represen-\ntation of knowledge. Psychol. Rev.\n104, 211–240.\nLevinson, S. C. (1983). Pragmatics.\nCambridge: Cambridge University\nPress.\nLongo, M. R., and Lourenco, S. F .\n(2006). On the nature of near space.\nEffects of tool use and the transi-\ntion to far space.Neuropsychologia 44,\n977–981.\nLourenco, S. F ., and Longo, M. R.\n(2009). The plasticity of near space:\nevidence for contraction. Cognition\n112, 451–456.\nLupyan, G. (2012). Linguistically\nmodulated perception and cogni-\ntion: the label-feedback hypothesis.\nFront. Psychol. 3:54. doi: 10.3389/\nfpsyg.2012.00054\nMagosso, E., Ursino, M., Di Pellegrino,\nG., Làdavas, E., and Serino, A. (2010).\nNeural bases of peri-hand space\nplasticity through tool-use: insights\nfrom a combined computational-\nexperimental approach. Neuropsy-\nchologia 48, 812–830.\nMalt, B. C., and W olff, S. (2010).Words\nand the Mind: How Words Capture\nNew Experience. New Y ork: Oxford\nUniversity Press.\nMaravita, A., and Iriki, A. (2004). T ools\nfor the body (schema). Trends Cogn.\nSci. 8, 79–86.\nMarino, B., Gough, P . M., Gallese,\nV ., Riggio, L., and Buccino, G.\n(2013). How the motor system han-\ndles nouns: a behavioural study.Psy-\nchol. Res.77, 64–73.\nMarsh, K. L., Richardson, M. J., and\nSchmidt, R. C. (2009). Social connec-\ntion through joint action and inter-\npersonal coordination. T opics Cogn.\nSci. 1, 320–339.\nMartin, A. (2007). The representation\nof object concepts in the brain.Annu.\nRev. Psychol.58, 25–45.\nMassen, C., and Prinz, W . (2009). Move-\nments, actions and tool-use actions:\nan ideomotor approach to imitation.\nPhilos. Trans. R. Soc. B Biol. Sci.364,\n2349–2358.\nMcNeill, D. (2000). Language and ges-\nture: Window into thought and action.\nCambridge: Cambridge University\nPress.\nMeunier, D., Lambiotte, R., and Bull-\nmore, E. T . (2010). Modular and\nhierarchically modular organization\nof brain networks. Front. Neurosci.\n4:200. doi: 10.3389/fnins.2010.00200\nMirolli, M., and Parisi, D. (2009).\nLanguage as a cognitive tool. Minds\nMach. 19, 517–528.\nMirolli, M., and Parisi, D. (2011).\nT owards a Vygotskian cognitive\nrobotics: the role of language as a\ncognitive tool. New Ideas Psychol.29,\n298–311.\nMyachykov, A., Scheepers, C., Fischer,\nM. H., and Kessler, K. (in press).\nTEST: a tropic, embodied, and sit-\nuated theory of cognition. T opics\nCogn. Sci.\nNabeshima, C., Kuniyoshi, Y ., and\nLungarella, M. (2007). “T owards\na model for tool-body assimila-\ntion and adaptive tool-use, ” in2007\nIEEE 6th International Conference on\nDevelopment and Learning, London,\n288–293.\nNewman-Norlund, R. D., van Schie,\nH. T ., van Zuijlen, A. M., and\nBekkering, H. (2007). The mirror\nneuron system is more active dur-\ning complementary compared with\nimitative action. Nat. Neurosci. 10,\n817–818.\nNishide, S., Nakagawa, T ., Ogata,\nT ., T ani, J., T akahashi, T ., and\nOkuno, H. G. (2009). “Model-\ning T ool-Body Assimilation using\nSecond-order Recurrent Neural Net-\nwork, ” in Proceedings of IEEE/RSJ\nInternational Conference on Intelligent\nRobots and Systems, (IROS-2009) ,\n5376–5381.\nNoe, A. (2009).Out of Our Heads: Why\nY ou Are Not Y our Brain, and Other\nLessons from the Biology of Conscious-\nness. New Y ork: Hill and W ang.\nOsiurak, F ., Morgado, N., and\nPalluel-Germain, R. (2012). T ool\nuse and perceived distance: when\nunreachable becomes spontaneously\nreachable. Exp. Brain Res. 218,\n331–339.\nPezzulo, G., Barsalou, L. W ., Can-\ngelosi, A., Fischer, M. H., McRae,\nK., and Spivey, M. J. (2011). The\nmechanics of embodiment: A dialog\non embodiment and computational\nmodeling. Front. Psychol. 2:5. doi:\n10.3389/fpsyg.2011.00005\nPovinelli, D. J., Reaux, J. E., and Frey,\nS. H. (2010). Chimpanzees’ context-\ndependent tool use provides evidence\nfor separable representations of hand\nand tool even during active use within\nperipersonal space. Neuropsychologia\n48, 243–247.\nPylyshyn, Z. W . (1984). Computa-\ntion and Cognition.Cambridge: MIT\nPress.\nRizzolatti, G., and Matelli, M. (2003).\nT wo different streams form the dor-\nsal visual system: anatomy and\nfunctions. Exp. Brain Res. 153,\n146–157.\nScorolli, C., and Borghi, A. M. (2012).\nW ords as tools: an extended view.\nKinematics evidence. The Fifth Inter-\nnational Conference on Cognitive Sci-\nence, Kaliningrad, Russia, June 19-23.\nT alk in the symposium “Neurocogni-\ntive Mechanisms of Human Linguistic\nBehaviour.”\nScorolli, C., Daprati, E., Nico, D.,\nand Borghi, A. M. (2011). Catching\nobjects through words. 17th Meeting\nof the European Society for Cogni-\ntive Psychology, ESCOP 2011 ,S a n\nSebastian.\nScorolli, C., Miatton, M., Wheaton,\nL. A., and Borghi, A. M. (2012).\nWhen a glass calls: anatomy of\na toast. Cognitive Process. Special\nIssue, 13, S69–S70. (Heidelberg:\nSpringer)\nStout, D., and Chaminade, T . (2012).\nStone tools, language and the brain\nin human evolution.Philos. Trans. R.\nSoc. Lond. B Biol. Sci.367, 75–87.\nT essari, A., T sakiris, M., Borghi, A. M.,\nand Serino, A. (2010). The sense of\nbody: a multidisciplinary approach\nto body representation. Introduc-\ntion to the special number on The\nsense of body. Neuropsychologia 48,\n643–644.\nThill, S., Caligiore, D., Borghi,\nA. M., Ziemke, T ., and Baldas-\nsarre, G. (2013). Theories and\ncomputational models of affordance\nand mirror systems: an integrative\nreview. Neurosci. Biobehav. Rev. 37,\n491–521.\nThompson, V ., and Stapleton, M.\n(2009). Making sense of sense-\nmaking: reﬂections on enactive and\nextended mind theories. To p o i28,\n23–30.\nT oni, I., de Lange, F . P ., Noordzij, M.\nL., and Hagoort, P . (2008). Language\nbeyond action. J. Physiol. Paris 102,\n71–79.\nT sakiris, M. (2010). My body in\nthe brain: a neurocognitive model\nof body-ownership. Neuropsycholo-\ngia 48, 703–712.\nT ylèn, K., W eed, E., W allentin, M.,\nRoepstorff, A., and Frith, C. D.\n(2010). Language as a tool for\ninteracting minds. Mind Lang. 25,\n3–29.\nUmiltà, M. A., Escola, L., Intskirveli,\nI., Grammont, F ., Rochat, M., Caru-\nana, F ., et al. (2008). When pliers\nbecome ﬁngers in the monkey motor\nsystem. Proc. Natl. Acad. Sci. U.S.A.\n105, 2209–2213.\nUrsino, M., Zavaglia, M., Magosso,\nE., Serino, A., and Di Pellegrino,\nG. (2007). A neural network model\nof multisensory representation of\nperipersonal space: effect of tool use.\nConference Proceedings of the Interna-\ntional Conference of IEEE Engineering\nin Medicine and Biology Society, 2007,\n2735–2739.\nvan Elk, M., Slors, M., and Bekker-\ning, H. (2010). Embodied language\nunderstanding requires an enactivist\nparadigm of cognition. Front. Psy-\nchol. 1:234. doi: 10.3389/fpsyg.2010.\n00234\nVygotsky, L. S. (1962). Thought and\nLanguage. Cambridge: MIT Press.\nWillems, R. M., and Franken, J. C.\n(2012). Embodied cognition: tak-\ning the next step. Front. Psy-\nchol. 3:582. doi: 10.3389/fpsyg.2012.\n00582.\nWillems, R. M., and Hagoort, P .\n(2007). Neural evidence for the inter-\nplay between language, gesture and\naction: a review. Brain Lang. 101,\n278–289.\nWilson, A. D., and Golonka, S.\n(2013). Embodied cognition is not\nwhat you think it is. Front. Psy-\nchol. 4:58. doi: 10.3389/fpsyg.2013.\n00058\nWilson, M. (2002). Six views on embod-\nied cognition. Psychon. Bull. Rev. 9,\n625–636.\nWilson, M. (2010). The re-tooled\nmind: how culture re-engineers cog-\nnition. Soc. Cogn. Affect. Neurosci.5,\n180–187.\nWittgenstein, L. (1953). Philosoph-\nical Investigations: The German\nT ext, with a Revised English\nwww.frontiersin.org May 2013| Volume 4| Article 214 | 9\n“fpsyg-04-00214” — 2013/4/30 — 13:00 — page 10 — #10\nBorghi et al. Words as social tools\nTranslation. Oxford: Blackwell Pub-\nlishing (translated by Anscombe,\nG. E. M., 2001).\nW olff, P ., and Malt, B. (2010).\n“The language-thought interface. An\nintroduction, ” in Words and the\nMind: How Words Capture Human\nExperience, eds B. Malt, and P .\nW olf (Oxford: Oxford University\nPress), 3–15.\nConflict of Interest Statement: The\nauthors declare that the research was\nconducted in the absence of any\ncommercial or ﬁnancial relationships\nthat could be construed as a potential\nconﬂict of interest.\nReceived: 30 January 2013; paper\npending published: 28 February 2013;\naccepted: 08 April 2013; published online:\n01 May 2013.\nCitation: Borghi AM, Scorolli C, Cali-\ngiore D, Baldassarre G and T ummolini\nL (2013) The embodied mind extended:\nusing words as social tools. Front. Psychol.\n4:214. doi: 10.3389/fpsyg.2013.00214\nThis article was submitted to Frontiers\nin Cognition, a specialty of Frontiers in\nPsychology.\nCopyright © 2013 Borghi, Scorolli, Cali-\ngiore, Baldassarre and T ummolini. This is\nan open-access article distributed under\nthe terms of the Creative Commons\nAttribution License, which permits use,\ndistribution and reproduction in other\nforums, provided the original authors and\nsource are credited and subject to any\ncopyright notices concerning any third-\nparty graphics etc.\nFrontiers in Psychology| Cognition May 2013| Volume 4| Article 214 | 10",
  "topic": "Embodied cognition",
  "concepts": [
    {
      "name": "Embodied cognition",
      "score": 0.8678619861602783
    },
    {
      "name": "Psychology",
      "score": 0.7398717999458313
    },
    {
      "name": "Theory of mind",
      "score": 0.6393886804580688
    },
    {
      "name": "Cognition",
      "score": 0.5589872598648071
    },
    {
      "name": "Social cognition",
      "score": 0.543369710445404
    },
    {
      "name": "Cognitive psychology",
      "score": 0.5281389355659485
    },
    {
      "name": "Cognitive science",
      "score": 0.4941432774066925
    },
    {
      "name": "Socially distributed cognition",
      "score": 0.4617149829864502
    },
    {
      "name": "Social psychology",
      "score": 0.343967467546463
    },
    {
      "name": "Epistemology",
      "score": 0.2442328929901123
    },
    {
      "name": "Neuroscience",
      "score": 0.11815464496612549
    },
    {
      "name": "Philosophy",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I4210166865",
      "name": "Institute of Cognitive Sciences and Technologies",
      "country": "IT"
    },
    {
      "id": "https://openalex.org/I4210155236",
      "name": "National Research Council",
      "country": "IT"
    },
    {
      "id": "https://openalex.org/I9360294",
      "name": "University of Bologna",
      "country": "IT"
    }
  ],
  "cited_by": 79
}