{
  "title": "DESIGN AND TEST OF A NEW HIGH-CURRENT ELECTRONIC CURRENT TRANSFORMER WITH A ROGOWSKI COIL",
  "url": "https://openalex.org/W1990238521",
  "year": 2014,
  "authors": [
    {
      "id": "https://openalex.org/A5100447306",
      "name": "Ming Zhang",
      "affiliations": [
        "Wuhan Textile University"
      ]
    },
    {
      "id": "https://openalex.org/A5005727198",
      "name": "Kaicheng Li",
      "affiliations": [
        "Huazhong University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5100717589",
      "name": "Shunfan He",
      "affiliations": [
        "Huazhong University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5100691332",
      "name": "Jun Wang",
      "affiliations": [
        "Wuhan Textile University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2160980024",
    "https://openalex.org/W2130292341",
    "https://openalex.org/W2114256252",
    "https://openalex.org/W1982102002",
    "https://openalex.org/W2156002823",
    "https://openalex.org/W2129890926",
    "https://openalex.org/W2166028527",
    "https://openalex.org/W1985643312",
    "https://openalex.org/W2029587253",
    "https://openalex.org/W2103069022",
    "https://openalex.org/W2112757639",
    "https://openalex.org/W2114555874",
    "https://openalex.org/W2151217028",
    "https://openalex.org/W2171992165",
    "https://openalex.org/W2099397757",
    "https://openalex.org/W1985779749",
    "https://openalex.org/W1965544240",
    "https://openalex.org/W2079071820"
  ],
  "abstract": "Abstract This paper describes the design and test of a new high-current electronic current transformer based on a Rogowski coil. For better performances, electronic current transformers are used to replace conventional electro-magnetic inductive current transformers based on ferromagnetic cores and windings to measure high-current on the high voltage distribution grids. The design of a new high-current electronic current transformer is described in this paper. The principal schemes of the prototype and partial evaluation results are presented. Through relative tests it is known that the prototype has a wide dynamic range and frequency band, and it can allow high accuracy measurements.",
  "full_text": " \nMetrol. Meas. Syst., Vol. XXI (2014), No. 1, pp. 121–132. \n \n___________________________________________________ ___________________________________________________ ___________________________________________________ ____________________________ \nArticle history: received on Jun. 20, 2013; accepted on  Dec. 04, 2013; available online on Mar. 15, 2014; DOI: 10.2478/mms-2014-0012. \n \n \n \nMETROLOGY A/glyph1197D MEASUREME/glyph1197T SYSTEMS \nIndex 330930, ISS/glyph1197 0860-8229 \nwww.metrology.pg.gda.pl \n                                                                         \n \nDESIG/glyph1197 A/glyph1197D TEST OF A /glyph1197EW HIGH-CURRE/glyph1197T ELECTRO/glyph1197IC \nCURRE/glyph1197T \nTRA/glyph1197SFORMER WITH A ROGOWSKI COIL \n \nMing Zhang  1)  ,  Kaicheng Li 2) , Shunfan He 2)  , Jun Wang  1)  \n \n1) Wuhan Textile University, School of Electronic and Electrical Engineer ing, Wuhan 430074, Hubei Province, China,\n(/envelopeback zhangming@wtu.edu.cn ) \n2) Huazhong University of Science and Technology, School of Electrical a nd Electronic Engineering, \nWuhan 430074, Hubei Province, \nChina \n \nAbstract \nThis paper describes the design and test of a new high-current electronic current t\nransformer based on \na Rogowski coil. For better performances, electronic current transformers are used to replace conventional \nelectro-magnetic inductive current   transformers based on ferromagnetic cores and windings to measure \nhigh-current  on the high voltage distribution grids. The design of a new high-current electronic current \ntransformer is described in this paper. The principal schemes of the prototype and partial evaluation results are \npresented. Through relative tests it is known that  the prototype has a wide dynamic range and freq uency band, \nand it can allow high accuracy measurements. \nKey words: Rogowski coil, high-current, electronic current transformer, electrical measurements. \n \n© 2014 Polish Academy of Sciences. All rights reserved \n \n1. Introduction  \n \n \nTraditional current  transformers (CTs) with a ferromagnetic core have been widely used in \npower systems because of their perfect technologies and high reliability. However,  in many \napplications the use of traditional CTs can be limited by electrical characteristics.  If transient \nnon-sinusoidal primary  high current is present on the conductor being measured,                         \nthe ferromagnetic core can become magnetically saturated, and the distorted secondary \nsignals will bring many difficulties to measurement and protection in power systems.  \nMoreover, the CTs must  be degaussed to remove any residual field before they can be used \nagain. \nCompared with the traditional CTs, Rogowski coil current transducers (RCCTs)  have \nmany merits because  the absence of a ferromagnetic core virtually eliminates circuit loading \nand saturation concerns. Therefore, these transducers have been researched and designed to \nreplace the traditional CTs [1–5]. They have an excellent transient response capability. \nMoreover, Rogowski coils can produce a safe low voltage (LV) output eliminating the \nhazards associated with misalignment and open secondary windings. In addition the variety  \nof diameters and current ranges available allows the user to carry only one lightweight probe \nfor a wide range of applications. So their use has increased very recently in applications                \nof   power  electronics [6], relay protection, and power quality measurements [7] or transients \n[8 −10]. \n \nM. Zhang ,  K. Li , S. He, J. Wang : DESIGKglyphFJO AKglyphFJOD TEST OF A KglyphFJOEW HIGH-CURREKglyphFJOT ELECTROKglyphFJOIC CURREKglyphFJOT TRAKglyphFJOSFORMER …  \n \nAt present electronic current transformers (ECTs) with a Rogowski coil have been \ndeveloped, which  bring simple insulation structures and excellent dynamic performances to \nelectronic instrument transformers [11]. In this paper, a new high-current  ECT  with  \nRogowski coil  is designed. In order to simplify  the design of the equipment,  the  designed \nECT consists of two parts: a high-voltage (HV) side unit and power supply unit.  It is a key \ntechnology in application the optical transmission as the communication interface is used \nbetween the HV side unit and merging unit (MU). Relative tests will be carried out to reveal \nthe merits of the designed ECT:  high accuracy, good transient performance  ect. \n \n2. Electronic Current Transformer Design   \n \n2.1. Rogowski coil current transducer \n \nThe Rogowski coil  is  a coil  distributed uniformly in a non magnetic core  that surrounds  \nthe conductor  carrying  the current to be measured, as indicated in Fig. 1. The sensing coil \nconsists of the wire group wound and internal return wire loop in the opposite direction.               \nThis arrangement ensures excellent suppression of external magnetic fields [12 −14]. \n \nh\nb\na\n \n \nFig. 1. Dimensions of the Rogowski coil. \n \nIf the current varies with time,  a magnetic flux is produced in the coil and applying  \nFaraday´s law of electromagnetic induction to the circuit of  Fig. 1, we can obtain a voltage \ndefined by  \ndt\ntdiMt e ) (-) (= ,    (1)  \n  \nwhere M is the mutual inductance. The coil detects a voltage signal proportional to the \nchange in the current passing through this conductor.  \n \n \nMetrol. Meas. Syst., Vol. XXI (2014), No. 1, pp. 121–132. \n \nTable 1.  Dimensions of the Rogowski coil. \n \n \nRogowski coil dimensions   Specifications \nInner diameter  a   105 mm \nOuter diameter  b   135 mm \nSection dimension of the core \nch × 1015× mm \nDiameter of the wire φ   0.25 mm \nNumber of turns  N 1470 \n  \n \nThe construction  of  a Rogowski coil presents some difficulties, because for  having  some \naccuracy we need that the turns be equally distributed along the core and the return wire go \nback concentrically to avoid the external fields produced by external currents near the coil. \nFor a toroidal coil having a circular cross  section in Fig.1, the coil parameters can be \nanalyzed and calculated.  The dimensions of the Rogowski coil are given in Table 1.                    \nAs shown in Fig. 2, we have built a Rogowski coil of 1470  turns of wire of 0.25 mm \ndiameter. The coil with \nµH21  mutual inductance and Ω49  resistance is implemented to \ndetect the current change with time. \n \n \n \nFig. 2.  Physical aspect of the Rogowski coil. \n \n \n \n \n \nM. Zhang ,  K. Li , S. He, J. Wang : DESIGKglyphFJO AKglyphFJOD TEST OF A KglyphFJOEW HIGH-CURREKglyphFJOT ELECTROKglyphFJOIC CURREKglyphFJOT TRAKglyphFJOSFORMER …  \n \nThe designed current transducer is expected to work in a HV environment and therefore \nthe sensing part has to be galvanically separated from the signal processing part of the ECT. \nIn this paper, the HV RCCT  head  mainly consists of a Rogowski coil, HV side circuit board \nand power supply module, as shown in Fig. 3. \n \n \n \n \nFig. 3.  Scenograph of the HV RCCT head:                                                                                                                       \n1-conductor, 2-circuit board room,3-power source room,                                                                                                  \n4-tank, 5-coil room, 6-insulation sleeving.  \n \n \n \n2.2. Electronic  Current Transformer Design \n \nOptical fibers are well suited for transmission in HV environments by virtue of their all \ndielectric construction. They are highly resistant to electrical break-down and electromagnetic \ninterference. Due to the working HV environment, the ECT is designed as two standalone \nunits mutually interconnected only via the optical fiber. The principal diagram of the ECT              \nis shown in Fig.4. The real-time data is sampled at the HV side unit and transferred through \nthe optical fiber to the MU. \n \nMetrol. Meas. Syst., Vol. XXI (2014), No. 1, pp. 121–132. \n \nSignal \nConditioning \nRogowski \nCoil A / D\nConverter CPU E/O\nConverter \nHigh Voltage \nBus \nHigh Voltage Side Unit \nOptical \n  Fiber \nSmall CT \nRectifier Voltage \nRegulator \nPower \nOutput \nE/O\nConverter \nPower Supply Unit \nLow  Voltage \nUnit Laser \n Module Optical \n  Fiber \nSpare Power Supply  \nTo MU \n \nFig. 4. Schematic diagram of the ECT with a Rogowski coil. \n \n \nAs shown in Fig.4, the HV side unit mainly includes front-end signal conditioning, an AD \nconverter and microcontroller modules. Including an integrator, amplifier, low-pass filter, \nphase shift circuit, the signal conditioning  module  is designed  using operational amplifiers  \nwith  the appropriate bandwidth, as shown in Fig.5.  For obtaining the original current wave \nshape we need to integrate  the signal at  the output  of  the Rogowski coil.  The output                  \nis connected to an integrator and amplifier in order to provide an output signal that is \nproportional to the current in the primary conductor. Moreover, a 2-nd order low-pass filter \ncan remove high frequency components which could result in aliasing and increased noise. \nAnd the phase shift circuit  can compensate the phase error of the front-end circuit.                    \nThis design ensures accuracy and dynamics of the whole current  measurement chain \ndetermined principally by the parameters of the circuit. \n \n \n \n \nFig. 5. Electronic circuit of  the signal conditioning module. \n  \n \nM. Zhang ,  K. Li , S. He, J. Wang : DESIGKglyphFJO AKglyphFJOD TEST OF A KglyphFJOEW HIGH-CURREKglyphFJOT ELECTROKglyphFJOIC CURREKglyphFJOT TRAKglyphFJOSFORMER …  \n \nFor high accuracy and low power consumption, a MSP430F2419 is chosen to be the \nmicrocontroller, and an AD7685 is chosen for analog-to-digital (A/D) conversion. After \nreceiving the trigger pulse,  the CPU reads the data from A/D conversion through a serial \nperipheral interface (SPI), and then sends the data to the MU through a fiber optic transceiver \nHFBR-1414 (E/O converter).  In order to reduce the number of the optical fibers needed                \nfor the transfer of data into  the MU, the data is Manchester  encoded.  A HV side unit circuit \nboard  of the ECT was designed, as shown in Fig. 6.   \n \n \nFig. 6. The HV side unit circuit board  of the ECT. \n \n \nIn the HV side unit, the integrator is located at the ground voltage level, so the electric \npower for ICs will be supplied directly from the small CT. However, this method of power \nsupply may interrupt continuous measurement in case of power system malfunctions.                   \nAs shown in Fig. 4,  a second optical fiber is used to power the HV side unit. This fiber is fed \nby a laser emitter located on the LV side. The laser beam energy is converted into electrical \nenergy in the HV side unit by means of a high- efficiency photovoltaic cell. \n \n3. Testing \n \n3.1.  Test of the designed RCCT \n \nIn order to individually verify  the designed RCCT, its accuracy can be measured in a large \nrange of currents by comparing it with the standard CT with an accuracy of class ± 0.02% .               \nThe ratio error  \nε  is defined as [15] \nr s p \np\n-(%) 100 , K I I \nIε = ×     (2)  \n  \nwhere rK is the rated transformation ratio, pI  is the root-mean-square (RMS) value of the \nactual primary current, sI  is the RMS value of secondary current. The general definition for \nphase displacement is  \n \nMetrol. Meas. Syst., Vol. XXI (2014), No. 1, pp. 121–132. \n \ns p (rad) - , ϕ ϕ ϕ =  \n \n   (3) \n  \nwhere φ  is the phase displacement, pφ  is the primary phase displacement, sφ is the secondary \nphase displacement. \nIn the actual test, each data point was continuously sampled 20 times. The average \nmeasuring errors are shown in Fig.7  when the current changes within 5 ~ 120% of the rated \ncurrent (50 ~1200A). As shown in Fig.7, the result shows that the designed RCCT with  the \nintegrator is perfectly meeting the requirement of class ±0.2% accuracy. But when the \nprimary current is below 20% of the rated current, the output of the RCCT may be influenced \nby the low signal-to-noise ratio. Hence, the amplifier circuit and filter circuit are needed to \nadjust   the output of the RCCT. \n \n \n(a)                                                                                     (b) \nFig. 7. (a) The normalized ratio error results of the designed RCCT  tests.                                                                      \n(b) The normalized  phase error results of the designed RCCT tests. \n \n \nIn fact, the DC components of transient currents may lead to deep saturation of the \nferromagnetic core. Therefore, it will make the secondary output signal of the traditional             \nCT distorted and disproportional to the primary current. But when compared with \n                          \na ferromagnetic core sensor, Rogowski coils have no disadvantages like material saturation \ncaused by high transient currents. So, it is desirable to design an available and feasible high \ntransient current sensor . \n \n \nM. Zhang ,  K. Li , S. He, J. Wang : DESIGKglyphFJO AKglyphFJOD TEST OF A KglyphFJOEW HIGH-CURREKglyphFJOT ELECTROKglyphFJOIC CURREKglyphFJOT TRAKglyphFJOSFORMER …  \n \n                          \n  \nFig. 8．Circuit connection for transient performance tests. \n \nThe transient performance of ECT mainly lies on that of the RCCT. With respect to the \nability of the designed RCCT to detect transient currents, an experimental platform for \ndynamic simulation is set up as shown in Fig.8. A shunt ( µΩ100 ), a CT (with class                     \n0.2 accuracy) and the designed RCCT were connected in series. The short-circuit current                \nof a generator was used to provide the transient current. In order to transfer the secondary \ncurrent of CT and RCCT into a voltage signal, a Ω1  standard resistor and integrator were \nconnected in the secondary circuit, respectively. Then, the output voltage waveforms of the \ntest are recorded by the digital fault recorder, as shown in Fig.9. \nThe shunt has excellent transient performance and its output  seems to be absolutely \nproportional to the high transient current with DC components. So  the shunt is used as                \nthe criterion in the test. Fig.9 shows that the designed RCCT has excellent dynamic \nperformances similar to the shunt, while the conventional CT has been saturated  clearly by \nDC components and cannot reflect the transient current. \n \n(a)                                                                                     (b) \n \nFig. 9. (a) Waveforms of the CT and shunt. (b)Waveforms of the RCCT and shunt. \n \n \n \n \nMetrol. Meas. Syst., Vol. XXI (2014), No. 1, pp. 121–132. \n \n3.2. The test of the designed ECT   \n \n \n \nFig. 10. Block diagram of the testing setup for verification of the ECT.   \n \nAccording to IEC60044-8, we have set up a test platform which is specified to estimate the  \nmeasuring accuracy of the designed ECT.  The block diagram of the test platform is shown in \nFig.10 and the photos of the experimental setup are shown in Fig.11. It contains a reference \nchannel, the tested channel and a testing device. The reference channel includes the standard \nCT (with class 0.02 accuracy), a sampling resistor (Ω1 with class ± 0.012%  accuracy), and an \n218  digital multimeter (Agilent 3458A for analog-to-digital conversion). In the reference \nchannel, the standard CT would provide an output current, and then through the standard \nresistor, Agilent's  digital multimeter with data acquisition cards can  provide the digital signal  \nand ensure high accuracy. The tested channel includes the RCCT, HV side unit and MU. In \nthe tested channel, the data from the RCCT  is sampled  in the HV side unit, then  the \nsampling  results are sent by  the  optical  fiber  to  the MU. The data received from  the \nreference and  tested channels  is sent to the industrial personal computer (IPC), which has the \nPCI-GPIB  (General Purpose Interface Bus) Card and Ethernet interface. Using a self-\ndeveloped  clock synchronization card, the IPC transmits synchronous pulses to achieve \nsynchronization                   of data acquisition.  Then, the testing device based on the IPC \nbegins receiving 10 cycles of data  from the two  channels and stores them in order. Finally, \nthe calculations of the ratio error and phase error about two sets of data are made by using the \nFFT algorithm. For the testing  device,  Labview is used as the unified software platform for  \ncomputing,  storage,  calling, and displaying on the IPC, which provides a convenient way for \nthe present test system[16−19].  \n \n \nM. Zhang ,  K. Li , S. He, J. Wang : DESIGKglyphFJO AKglyphFJOD TEST OF A KglyphFJOEW HIGH-CURREKglyphFJOT ELECTROKglyphFJOIC CURREKglyphFJOT TRAKglyphFJOSFORMER …  \n \n \n(a)                      (b)  \n \nFig. 11. (a) Photo of the experimental setup of the standard CT and high-current generator.                                          \n(b) Photo of the experimental setup  of the test platform. \n \nAs  it  is  well  known, actual power signals are not ideal. They can be  considered  as  the  \nsum  of  a  series  of  different components superimposed over a fundamental component, and \nthe amplitude of a harmonic is generally a few percent of that of the fundamental or smaller. \nWith asynchronous sampling of the power signal,  the application of the FFT algorithm for \nfundamental component spectral analysis will lead to inaccuracies due to the leakage effect, \nresulting in great ratio error of the test system. At the same time the spectral analysis \nprecision of the harmonic components may also drop. In order to improve the resolution                \nof spectral analysis, an improved algorithm based on combining the Hanning windowed \ninterpolated FFT is proposed in this paper.  An appropriate window function and interpolation \nalgorithm can improve the calculation accuracy of FFT. It is insensitive to high frequency \ninterference and frequency fluctuations of the measured signal. So, it has good stability and \nreliability [20]. \nIn the actual test, 20 samples in each data point are adopted in the error calculation \nprocedures. The test results are shown in Table 2 with a primary rated current of 1000A. \nAccording to IEC60044-8, current at 1%, 5%, 20%, 100%, 120% of the rated current must \nmeet the accuracy requirements. Table 2 shows that the ratio error and phase error of the \ndesigned ECT  are small and within the 0.2 S Class limit. So, the designed ECT can meet the \naccuracy requirements of  0.2 S Class standard. \n \n \n \n \n \n \nMetrol. Meas. Syst., Vol. XXI (2014), No. 1, pp. 121–132. \n \nTable 2. The ratio error and phase error of the designed ECT after averaging. \n \nPercentage of rated voltage Real percentage of rated voltage Ratio error (%) Phase error  （'） \n1% \n0.8% 0.18 14 \n0.98% 0.17 13 \n1.1% 0.19 10 \n5% \n5.1% 0.13 9 \n4.9% 0.10 7 \n5.2% 0.12 5 \n20% \n21% 0.1 3 \n19% 0.09 3 \n22% 0.08 2 \n100% \n99% 0.04 1 \n101% 0.04 0 \n98% 0.06 1 \n120% \n118% 0.03 0 \n120% 0.04 1 \n122% 0.02 1 \n \n \n4. Conclusions  \n \nA new high-current ECT with a Rogowski coil is presented in this paper. Galvanic \nseparation of the HV side and  LV side was achieved by using optical fibers for data and \npower transfer. So, the designed ECT can give good performance to meet the engineering \ndemand  for  measuring  the HV high-current. And the software realization with Labview \nshows low design costs and a short development cycle.  \nWe have tested the designed ECT in order to improve its behavior and accuracy. It was \ncharacterized at 1%, 5%, 20%, 100%, 120% of the rated current by ratio error  and phase error \nin two subranges. The designed ECT has achieved a high measurement accuracy, which \nmeets  the  requirement of 0.2 S Class ECT. \nThe designed ECT can deal with both analog and digital signal outputs. It is not only \nsuitable for existing conventional meters, but also can be fitted to digital meters with \nappropriate improvements. It has the following advantages: inherent electrical isolation; \ncompact and light-weight construction,  reduced installation and engineering costs,  improved \npersonal safety and good transient performance. \n \nAcknowledgments \nThis work was supported by Natural Science Foundation of China grants 51077058 and \n51277080. \n  \n \n \n \n \nM. Zhang ,  K. Li , S. He, J. Wang : DESIGKglyphFJO AKglyphFJOD TEST OF A KglyphFJOEW HIGH-CURREKglyphFJOT ELECTROKglyphFJOIC CURREKglyphFJOT TRAKglyphFJOSFORMER …  \n \nReferences \n \n[1]  Chen, Q.;  Li, H.; Huang, B.;  Dou, Q. (2007). Rogowski sensor for plasma current measurement in J-\nTEXT. IEEE Sensors J. , 9(3), 293 −296.  \n[2]  Chen, Q.;  Li, H.; Huang, B. (2010). An innovative combined electronic instrument transformer applied in \nhigh voltage lines. Measurement , 43(7), 960 −965.  \n[3]  Chiampi, M.; Crotti, G.; Morando, A. (2011). Evaluation of flexible Rogowski coil performances  in power \nfrequency applications.   IEEE Trans. Instrum. Meas. , 60(3), 854 −862.   \n[4]  Cataliotti, A.;  Cara, D. D.; Emanuel, E. A.;  Nuccio, S.; Tinè, G. (2011). Characterization and error \ncompensation of a Rogowski coil in the presence of harmonics. IEEE Trans. Instrum. Meas ., 60(4),                       \n1175 −1181.  \n[5]  Djokic, V. B.; Ramboz, D. J.;  Destefan, E. D. (2011). To what extent can the current amplitude linearity           \nof Rogowski coils be verified.  IEEE Trans. Instrum. Meas. , 60(7), 2409 −2414.   \n[6]  Kang, M. (1999). Analysis and design of electronic transformers for electric power distribution system. \nIEEE Trans. Power Electron. ,14 (6), 1133 −1141.   \n[7]   Faifer, M.; Toscani, S.; Ottoboni, R. (2011). Electronic combined transformer for power-quality \nmeasurements in high-voltage systems. IEEE Trans. Instrum. Meas. , 60(6), 2007 −2013. \n[8]  Liu, Y.; Lin, F.; Zhang, Q.; Zhong, H. (2011). Design and construction of a Rogowski coil for measuring \nwide pulsed current. IEEE Sensors J. , 11(1), 123 −130.   \n[9]  Zhang, Z.S.; Xiao, D.M.; Li, Y. (2009). Rogowski air coil sensor technique for on-line partial discharge \nmeasurement of power cables.   IET  Sci., Meas.  Technol.  , 3(3), 187 −196.  \n[10]  Poncelas, O.; Rosero, A. J.; Cusidó, J.; Ortega, A. J.;  Romeral, L. (2009). Motor fault detection using                   \na Rogowski sensor without an integrator.  IEEE Trans. Power Electron.  , 56(10), 4062 −4070.   \n[11]  Abdi-Jalebi, E.; McMahon, R. (2007). High-performance low-cost Rogowski transducers and \naccompanying circuitry. IEEE Trans. Instrum. Meas. , 56(3), 753 −759. \n[12]  Ramboz, D. J. (1996). Machinable Rogowski coil, design, and  calibration. IEEE Trans. Instrum. Meas. , \n45(2), 511 −515. \n[13]  Ferkovic, L.; Ilic, D.;  Malaric, R. (2009). Mutual inductance of a precise Rogowski coil in  dependence              \nof the position of primary conductor.  IEEE Trans. Instrum. Meas. , 58(1), 122 −128.  \n[14]  Marracci, M.; Tellini, B.; Zappacosta, C.; Robles, G. (2011).  Critical parameters for mutual inductance \nbetween  Rogowski coil and primary conductor.  IEEE Trans. Instrum. Meas. , 60(2), 625 −632.   \n[15]  IEC60044-8 (2002). Instrument Transformer-part 8, Electronic Current Transformers .  International \nElectrotechnical Commission: Geneva, Switzerland. \n[16]  Suomalainen, E.P.; Hallstrom, K.J. (2009).  Onsite calibration of a current transformer  using a Rogowski \ncoil. IEEE Trans. Instrum. Meas. , 58(4), 1054 −1058.  \n[17]  Brandolini, A.; Faifer, M.; Ottoboni, R. (2009). A simple method for calibration for the  traditional and \nelectronic measurement current and voltage transformers. IEEE Trans. Instrum. Meas. , 58(5), 1345 −1353.  \n[18]  Draxler, K.; Styblikova, R.; Hlavacek, J.;  Prochazka, R. (2011). Calibration of Rogowski coils with  an \nintegrator at high currents.  IEEE Trans. Instrum. Meas. , 60(7), 2434 −2438.  \n[19]  Pan, F.; Chen, R.; Xiao, Y.; Sun, W. (2012). Electronic voltage and current transformers testing device. \nSensors , 12(1), 1042 −1051. \n[20]  Zhang,M.;    Li,K.; Hu  , Y. (2011). A high efficient compression scheme  for power quality applications. \nIEEE Trans. Instrum. Meas. , 60(6), 1976 −1985. ",
  "topic": "Rogowski coil",
  "concepts": [
    {
      "name": "Rogowski coil",
      "score": 0.9892784357070923
    },
    {
      "name": "Current transformer",
      "score": 0.7890084981918335
    },
    {
      "name": "Electromagnetic coil",
      "score": 0.6733137369155884
    },
    {
      "name": "Electrical engineering",
      "score": 0.6469321846961975
    },
    {
      "name": "Transformer",
      "score": 0.5643545389175415
    },
    {
      "name": "Engineering",
      "score": 0.46454834938049316
    },
    {
      "name": "Electronic engineering",
      "score": 0.460070937871933
    },
    {
      "name": "Distribution transformer",
      "score": 0.45040422677993774
    },
    {
      "name": "Current (fluid)",
      "score": 0.44954627752304077
    },
    {
      "name": "Voltage",
      "score": 0.4423598349094391
    },
    {
      "name": "Coil tap",
      "score": 0.42805105447769165
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I4210119942",
      "name": "Wuhan Textile University",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I47720641",
      "name": "Huazhong University of Science and Technology",
      "country": "CN"
    }
  ]
}