{
  "title": "Transformer partial discharge monitoring based on optical fiber sensing",
  "url": "https://openalex.org/W1993609452",
  "year": 2014,
  "authors": [
    {
      "id": "https://openalex.org/A5100366656",
      "name": "Kun Wang",
      "affiliations": [
        "Wuhan University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5101645855",
      "name": "Xinglin Tong",
      "affiliations": [
        "Wuhan University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5101772528",
      "name": "Xiaolong Zhu",
      "affiliations": [
        "Wuhan University of Technology"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2373599752",
    "https://openalex.org/W2054297362",
    "https://openalex.org/W2061073098",
    "https://openalex.org/W7019802508",
    "https://openalex.org/W1990747918",
    "https://openalex.org/W2496306568",
    "https://openalex.org/W201398431"
  ],
  "abstract": "The power transformer is the most important equipment of the high voltage power grid, however, some traditional methods of online partial discharge monitoring have some limitations. Based on many advantages of the optical fiber sensing technology, we have done some research on fiber optics Fabry-Perot (FP) sensing which can be useful for the transformer on online partial discharge monitoring. This research aimed at improving the reliability of power system safety monitoring. We have done some work as follows: designing a set for fiber optics FP sensor preparation, according to the fabrication procedure strictly making out the sensors, building a reasonable signal demodulation system for fiber optics FP sensing, doing a preliminary analysis about online partial discharge signal monitoring, including the research on different discharge intensities with the same measuring distance and different measuring distances with the same discharge intensity, and then making a detailed analysis of the experimental results.",
  "full_text": "PHOTONIC SENSORS / Vol. 4, No. 2, 2014: 137–141 \nTransformer Partial Discharge Monitoring \nBased on Optical Fiber Sensing \nKun WANG, Xinglin TONG*, and Xiaolong ZHU \nNational Engineering Laboratory for Fiber Optic Sensing Technology, Wuhan University of Technology, Wuhan, \n430070, China \n*Corresponding author: Xinglin TONG      E- mail: 273047432@qq.com \n \nAbstract: The power transformer is the most important equipment of the high voltage power grid, \nhowever, some traditional  methods of online partial discharge monitoring have some limitations. \nBased on many advantages of the optical fiber sensing technology, we  have done some research on \nfiber optics Fabry -Perot (FP) sensing which can be useful for the transformer on online partial \ndischarge monitoring. This research aimed at  improving the  reliability of power s ystem safety \nmonitoring. We have done some work as follows:  designing a set for fiber optics FP sensor \npreparation, according to the fabrication procedure strictly making out the sensors, building a \nreasonable signal demodulation system for fiber optics FP  sensing, doing a preliminary analysis \nabout online partial discharge signal monitoring, including the research on different discharge \nintensities with the same measuring distance  and different measuring distance s with the same \ndischarge intensity, and then making a detailed analysis of the experimental results. \nKeywords: Partial discharge, fiber FP sensor, diaphragm effective reflectivity \nCitation: Kun WANG, Xinglin TONG, and Xiaolong ZHU , “Transformer Partial Discharge Monitoring Based on Optical Fiber \nSensing,” Photonic Sensors, 2014, 4(2): 137–141. \n \n1. Introduction \nLarge amounts of data show that the \ndeterioration of transformer insulation is the most \nimportant reason of the fault. At present, the \nelectricity sector adapts the regular maintenance \nsystem to prevent and eliminate the breakdown of \nthe transformer. Although the normal operation of \nthe power system has played a certain role, in the \nmaintenance period, interruption of power is needed, \nthe arduous work takes a long time, and the repair \nprocess may cause damage to the transformer. These \nhave fully demonstrated the limitations of the \noff-line maintenance method. \nThe transformer is the basic equipment which \nensures the normal operation of the grid system and \nreliability of the power supply.  Once the faulty \nhappens, it will lead to  widespread blackouts that \nlargely influence people’s daily life and normal \nelectricity use of productive operation, causing the \nenormous economic loss es. According to a large \nnumber of statistics [1–3], the major cause of  \ntransformer insulation deterioration is partial \ndischarge. Obviously, the partial discharge comes to \nbe an important sign of deterioration of transformer \ninsulation characteristics. With an online monitoring \nsystem of the transformer, we can know the \noperation status timely, detect the partial discharge, \ndetermine a definite location of the insulation defect \narea, and then repair the transformer promptly. Thus, \nthe research o n the  partial discharge online \nmonitoring system in this paper is significant and \nReceived: 10 January 2014 / Revised version: 27 February 2014 \n© The Author(s) 2014. This article is published with open access at Springerlink.com \nDOI: 10.1007/s13320-014-0181-4 \nArticle type: Regular \n                                                                                             Photonic Sensors 138 \nvaluable. \nAt present, in order to maintain the excellent \ninsulation characteristics, power transformers are \nalways full of transformer oil inside and equipped \nwith insulation materials such as paperboard. Such \ndesign is proved to have the nice mechanical \nproperty and electrical strength, but it still has some \ninherent flaws of inside materials because of the \ncomplexity of the manufacturing process. For \nexample, insulation materials have cracks and \nbubbles, or suspended particle and metal burr in \ntransformer oil, and all such flaws would lead to the \npartial discharge of the transformer. \nThus, an important symbol of the transformer \ninsulation deterioration is the partial discharge. So, \nthe on -line monitoring of the transformer will be \nable to reflect the opera ting conditions of the \ntransformer in real time, detect the partial discharge \nphenomenon and location insulation defects district, \nrepair the transformer timely and effectively. \nStudying the online partial discharge monitoring  has \nthe important significance and value. \nCurrently, among the methods of partial \ndischarge online monitoring  [4–6 ], we mainly use d \npiezoelectric and capacitive sensors to detect signals \nwhich can be easily interfered by electromagnetic \nsignals. With the advantage of anti -electromagnetic \ninterference, the optical fiber sensing technology can \nmake up for the defects of piezoelectric and \ncapacitive sensors.  Meanwhile, in terms of the \ninsulation advantage of  the sensing technology, it \nwill become the main transformer safety testing \ntechnology. \nNowadays, the fiber optic acoustic emission \nsensing technology to monitor the partial discharge \nsignal has become a research hot spot [7]. \n2. Sensors and sensor systems \nAs shown in Fig.  1, in the p reparation process, \nwe should firstly bond the quartz diaphragm and \nquartz sleeve together and then do the same thing to \nthe quartz ferrule and fiber. Secondly, we should \nplace the casing structure and mortise structure in \nthe jib precisely. What is more, by adjusting the jig, \nwe could get the required cavity length and the \nfringe contrast and then bond the casing structure \nand mortise structure together. Finally, the \nproduction process of the sensor was completed. \n \nFig. 1 Flow chart of the preparation technology of the fiber \nsensor (FP). \nIn the third process as shown in Fig.  1, we \naccessed the f iber pigtail into the optical path, \nconnected the broadband source  of the super \ncontinuum light emission diode  (SLED) and \nspectrometer, an d made the instant observation of \nthe interference spectrum . When we got some fixed \ninterference spectrum, we fixed the sensor and got \nthe spectrum which is shown in Fig.  2. According to \nthe analysis of the spectrum in Fig.  2, we could \nfinally get the cavity length and fringe contrast ratio \nthrough calculation. \n \nFig. 2 I nterference spectrum  of the s ensor (t he cavity was \nabout 60 μm). \nAs shown in Fig.  3, we firstly connected the \nsensor into one port of the coupler and found the \noptimal work wavelength through the optical power \nmeter; we changed the wavelength to the best \nKun WANG et al.: Transformer Partial Discharge Monitoring Based on Optical Fiber Sensing 139 \nworking point of the sensor and connected another \nport of the  coupler; then, we connected the \ndemodulator into the last port of the coupler; finally, \nwe connected the digital oscilloscope into the \ndemodulator. \nDuring the experiment, we established the \ndemodulation system  which can be seen in Fig.  2. \nInstead of measuring the partial discharge signal \ndirectly, we used discharge electrode tip discharge \nsignals to generate the partial discharge . Actually, \ntransformer partial discharge signals were \ntransmitted by oil that made the slow signal \nattenuation. In comparison , t he partial generated \nsignal was transmitted by air that made the quick \nultrasonic attenuation. \n \nFig. 3 Pictorial diagram of the s ensor demodulation system  \nof the fiber sensor (FP). \n3. Results and discussion \n3.1 Analysis and exper iments of different \ndischarge intensities with the same sensing \ndistance \nIn Table 1, the peak voltage can be qualitatively \ndescribed as the signal intensity of the signal source, \nindicating that the higher of the peak voltage is, the \nstronger signal given by the signal source is. The \npeak frequency can be used to describe the thickness \nof the quartz diaphragm sensor. The amplitude of the \npeak frequency can be used to describe the actual \ndetected attenuation time of the sensor. During the \nattenuation process  of the peak voltage from the \nrelatively high position to zero, the higher amplitude \nmeans the longer actually detected attenuation time \nand the slower tendency of attenuation. \nAccording to the data in T able 1: (1) the peak \nvoltage decreases according to t he descending order \nof the discharge signal (2000  V, 420 V , and 400  V), \nfor example, when the peak voltage reaches 2000  V,  \nthe discharge signal serves to be  most significant, \nwhich is consistent with  the theoretical analysis ;   \n(2) at the vicinity of 350  kHz, three groups of peak \nfrequencies tend to be relatively similar, showing \nthat the variable quantity of  the cavity length (the \nphase of Δd) is limited to an interval of (–π/2, π/2). \nTable 1  Parameters of signal characteristic s of the sensor \nwith different discharge intensities. \nDischarge signal 400V 420V 2000V \nPeak voltage (V) 0.14 0.196 0.284 \nPeak frequency (kHz) 348 352 348 \nAmplitude (V) 77.1 40.5 81.1 \n \n3.2 Experiment and analysis of the same intensity \ndischarge with different sensing distances \nDuring this experiment, we used the 2000 -V \ndischarge signal as the signal source and the sensor \nwith the cavity length 50 μm and contrast ratio 10 dB \nto detect the ultrasonic signal excited by signal \nsource. The measured discharge signal waveforms \nwith different sensing distances are shown in Fig. 4. \nAccording to Fig.  5(c), when the sensing \ndistance is 15  mm, after Fourier transformation, the \nmeasured data can reach the same peak frequency \n(320 kHz) as in Figs.  5(a) and 5(b). The reason can \nbe explained that when the sensing distance is above \n15 mm, there is the serious attenuation of the \ndischarge signal. As a result, the received signal \nbecomes weak, and the signal distorts because the  \ndetected signal is superimposed on the noise, and the \nerrors appear in the Fast Fourier Transform (FFT) \nanalysis of data. \nAccording to the experimental result s, the \ndischarge intensity, peak frequency , and amplit ude \nof the measured signal have the negative correlation \nwith sensing distances. The sensing distances and \npeak voltages, sensing distances, and the amplitudes \nof response frequenc ies are separately plotted in \nFigs. 6(a) and 6(b). \n                                                                                             Photonic Sensors 140 \n \n  \n  \n       (a) Discharge signal of 400 V                (b) Discharge signal of 420 V            (c) Discharge signal of 2000 V \nFig. 4 Spectrogram of the partial discharge signal under three different voltages. \n \n  \n  \n(a) Measured signal at 5 mm             (b) Measured signal at 10  mm            (c) Measured signal at 15  mm \nFig. 5 Spectrogram of the partial discharge signal with three different sensing distances. \n \n(a)Sensing distance and peak voltage \n \n(b)Sensing distance and vibration amplitude \nFig. 6 Relationship between the sensing distance and signal \npeak voltage. \nAs shown in Figs. 6(a) and 6(b), with an increase \nin the sensing distance, the strength of the received \nsignal decays very fast, when the sensing distance \nsurpasses 10  mm, the measured signal becomes not \nobvious. In order to further improve the sensing \ndistance, we have enhanced the sensitivity of the \nsensor. \n4. Conclusions \nThe power transformer is a very important \nequipment in the grid operating system, while the \nexisting transformer partial discharge monito ring \nmethod has some limitations. Based on many \nadvantages of  the optical fiber sensing technology, \nwe d id some research on fiber optics FP sensing , \nwhich could be used to monitor partial discharge and \ncould do a positive work on improving the reliability \nof power system safety monitoring. \nDue to the limitation of the laboratory, we only \nmade the preliminary research and discussion. There \nare still many flaws in the production method: \nstabilization and sensitivity of the sensor, and then \nthe further job includes two parts: \n(1) I mprove the preparation technology of the \nsensor: organic glue, which is used in the \npreparation of the fiber FP sensor in this paper, has \nthe immense influence on the consistency cavity \nKun WANG et al.: Transformer Partial Discharge Monitoring Based on Optical Fiber Sensing 141 \nlength and temperature stability of the sensor. In \norder to improve the consistency and stability, we \ncan consider using the laser welding technology to \nmake preparation. \n(2) Improve the sensitivity of the sensor: the \nfiber FP sensor in this paper can only detect the \nsignal in a close distance and has a poor sensitivity. \nIn order to improve the sensitivity of the sensor to \ndetect the remote signal without adding its size, we \ncan consider using the thinner -walled tube or \ndiaphragm which is smaller than young modulus \nmaterials to make the sensor. \nAcknowledgment \nThis work was supported by the National \nNatural Science Foundation of China (Grant No. \n51275373) and the Key Project of National Natural \nScience Foundation of China (Grant No. 50830230). \n \nOpen Access  This article is distributed under the terms \nof th e Creative Commons Attribution License which \npermits any use, distribution, and reproduction in any \nmedium, provided the original author(s) and source are \ncredited. \nReferences \n[1] J. Tang, Y. OuYang, M. Fan, X. Zhang, and Y. Liu, \n“System using fluorescent f iber for partial discharge \ndetection in transformer ,” High Voltage Engineering , \n2011, 37(5): 1129–1135. \n[2] J. Tang, J . Zhou, X . Zhang, and F. Liu,  “ A \ntransformer partial discharge measurement system \nbased on fluorescent fiber,” Energies, 2012, 5(5): \n1490–1502. \n[3] G. C. Stone, “A perspective on online partial \ndischarge monitoring for assessment of the condition \nof rotating machine stator winding insulation,”  IEEE \nof Electrical Insulation Magazine, 2012, 28(5): 8–13. \n[4] L. Bao, “ Introduction to the on- line transformer PD \ndetection technology,” Southern Power System \nTechnology, 2009, 2(6): 81–83. \n[5] N. D. Jacob, W . M. Mcdermid, and B. Kordi , \n“On-line monitoring of partial discharges in a  HVDC \nstation environment ,” IEEE Transactions on  \nDielectrics and Elec trical Insulation , 2012, 19(3): \n925–935. \n[6] D. Wen, G. Wu, L. Zhou, J. Liu, P. Du, and Y. Liu, \n“Present status and outlook of PD online monitoring \nsystem in power transformer, ” Electric Age, 2010, 7: \n74–77. \n[7] D. Xiao, J. Yang, X. Xu, et al., “Fiber optical sensors \nfor partial discharge m onitoring in power \ntransformers,” Electrical Equipment, 2004(3): 16–18. \n \n ",
  "topic": "Partial discharge",
  "concepts": [
    {
      "name": "Partial discharge",
      "score": 0.9027665257453918
    },
    {
      "name": "Transformer",
      "score": 0.6415331363677979
    },
    {
      "name": "Demodulation",
      "score": 0.63544762134552
    },
    {
      "name": "Optical fiber",
      "score": 0.6236838102340698
    },
    {
      "name": "Fiber optic sensor",
      "score": 0.5302673578262329
    },
    {
      "name": "Electronic engineering",
      "score": 0.4273785352706909
    },
    {
      "name": "Electrical engineering",
      "score": 0.39993226528167725
    },
    {
      "name": "Computer science",
      "score": 0.39479461312294006
    },
    {
      "name": "Engineering",
      "score": 0.357481449842453
    },
    {
      "name": "Voltage",
      "score": 0.3313677906990051
    },
    {
      "name": "Telecommunications",
      "score": 0.2507067322731018
    },
    {
      "name": "Channel (broadcasting)",
      "score": 0.0
    }
  ]
}