{
    "title": "Aspects of Transformer Fires in Brazil",
    "url": "https://openalex.org/W1996648178",
    "year": 2012,
    "authors": [
        {
            "id": "https://openalex.org/A5070256878",
            "name": "Dayse Duarte",
            "affiliations": [
                "Universidade Federal de Pernambuco"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2009741899",
        "https://openalex.org/W2027147460"
    ],
    "abstract": "For the last 20 years blackouts have been included in the list of major disasters that includes storms, hurricanes, earthquakes and floods. Therefore consumers have become increasingly aware of fires and explosions involving oil-filled transformers located in power plants or substations. Owing to several fires in transformers, the summer of 1997 became known to the people of Rio de Janeiro, Brazil, as the The Summer of Blackouts. The losses incurred by a blackout are not merely financial. In fact, the loss of operational utility by fire represents only a minor part of the total overall cost in terms of energy availability, human loss and organizational reputation. The costs resulting from the lack of fire risk management in the electrical power industry are no longer acceptable to Brazilian society. The objective of this paper is to address important aspects of transformer fire risk in the context of the Brazil. The aim is to help engineers recognize the implications of decisions concerning the operation of transformers over their life cycles.",
    "full_text": "Open Journal of Safety Science and Technology, 2012, 2, 63-74 \nhttp://dx.doi.org/10.4236/ojsst.2012.23009 Published Online September 2012 (http://www.SciRP.org/journal/ojsst) \nAspects of Transformer Fires in Brazil \nDayse Duarte \nDepartamento de Engenharia de Mecânica, Universidade Federal de Pernambuco, Recife, Brazil \nEmail: duarte@ufpe.br \n \nReceived April 13, 2012; revised May 16, 2012; accepted May 28, 2012 \nABSTRACT \nFor the last 20 years blackouts have been included in the list of major disasters that includes storms, hurricanes, earth- \nquakes and floods. Therefore consumers have become increas ingly aware of fires and explosions involving oil-filled \ntransformers located in power plants or substations. Owing to several fires in transformers, the summer of 1997 became \nknown to the people of Rio de Janeiro, Brazil, as the The Summer of Blackouts. The losses incurred by a blackout are \nnot merely financial. In fact, the loss of operational utility by fire represents only a minor part of the total overall cost in \nterms of energy availability, human loss and organizational reputation. The costs resulting from the lack of fire risk \nmanagement in the electrical power industry are no longer acceptable to Brazilian society. The objective of this paper is \nto address important aspects of transformer fire risk in the context of the Brazil. The aim is  to help engineers recognize \nthe implications of decisions concerning the operation of transformers over their life cycles. \n \nKeywords: Transformer; Fire; Performance; Globalized Economy \n1. Introduction \nTransformers are crucial not only to power system per- \nformance and reliability of supply, but also to persons \n(i.e. employees and third parties) and property located in \ntheir immediate vicinity, in the event of a failure result- \ning in a fire or explosion. A transformer failure can some- \ntimes have serious consequences on the environment due \nto the discharge of dielectri c fluid. These consequences \nare a function of location ( i.e. proximity to waterways, \nwhether indoors, etc.) and the presence of passive meas- \nures, such as rock-filled pits. The direct impact of a trans- \nformer failure can jeopardize the image of the electricity \ncompany. The technical complexities, high capital cost \nand long life expectancy pose unique decision-making \nchallenges to engineers and managers who are responsi- \nble for the safe operation and maintenance of transform- \ners on a day-to-day basis. \nAs globalization has had a si gnificant impact on trans- \nformer manufacture over the last 25 years, this paper has \nbeen designed to help engineers understand the failure \nmechanism of transformers and the consequences thereof.  \n2. The Brazilian Experience of Transformer \nFires \nBrazil has an installed capacity of about 94,000 MW. \nMost of this energy comes from hydroelectric power \nplants, accounting for around 81,000 MW. Demand in \nBrazil is approximately 60,000 MW and there are ap- \nproximately 75,000 km of transmission lines. Trans- \nformer capacity is currently about 171 GVA, and in the \nnext eight years it will increase by 50%. \nIn the fire design of our substations, the usual focus is \ncompliance with national and international codes and \nstandards. Although during construction the plans and \nspecifications are duly followed, what is rarely done is a \nconsidered harmonization of fire defenses by trained and \nskilled fire safety professionals in order to provide iden- \ntifiable performance criteria: damage indicators and goals \nbased on those involved in the project design, construc- \ntion, operation and maintenance, considering both the \norganizational viewpoint as well as outside needs and \ndesires. Meanwhile, differences in opinion concerning \ncode interpretation and the understanding of fire and fire \ndefense behavior by engineering design teams lead to \nvery different performances among substations. The vast \ninventory of existing substations that have been con- \nstructed under different codes and conditions enables us \nto recognize the fire risk variability that exists in the \nelectrical power industry. Even  though the design theme \nand organization may produce a substation compliant \nwith codes, standards and good practice, these credentials \ndo not assure safety from fire. The prevailing assumption \namong many employees, regulators and the organiza- \ntional culture has been that fi re safety can be achieved \nthrough a combination of common sense and enforce- \nment of prescriptive codes and standards. These methods \nshould suffice in a simple  workplace producing simple \nC\no p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \nD. DUARTE 64 \nand \nunchanging products. However, today’s power plants \nand substations are highly complex and constantly chang- \ning, requiring a more effective approach to fire safety.  \nIt is not difficult to identify substations or hydroelec- \ntric power plants in which, despite both active and pas- \nsive fire protection barriers, a fire has caused extensive \ndestruction. In Figure 1 , an autotransformer of 150 \nMVA protected by a spray system caught fire as a result \nof a bushing failure. The spray system did not operate \nwhen the fire began. Due to the oil leakage through the \nbase of the bushing, this delay caused the fire to spread. \nNFPA 15 describes water spray design for transformers. \nEven if suppression systems are available, there are many \nuncertainties concerning their success or failure in con- \ntrolling the fire. The questions that arise include: Can \nwater be discharged from the spray system? Can water \nextinguish the fire? Water will be discharged from the \nspray system if all water supply valves are open, but \nwhen the sensor fuses, will enough water reach the spray \nhead? Moreover, the violent nature of a transformer fire \ncould render an automatic spray system useless. Al- \nthough this has happened on a number of occasions, the \nautomatic spray system survived the explosion and was \ncredited with controlling the fire, limiting damage and \nminimizing system downtime. As the system in which \nthe transformer is inserted has a dynamic behavior, the \nvarious fire scenarios are subject to many uncertainties. \nTraditional fire defenses provide a tool kit for protect- \ning the substation. Their installation and maintenance \nhave an important influence on substation performance in \nthe event of a fire (see Sec tion 4). Evaluations should \ninvolve an understanding of individual component (mi- \ncro) behavior and an interactive (macro) behavior of the \ncomplete electrical system.  \nFigure 2 shows the result of a transformer fire which \nrendered the substation unavailable and left about one \nmillion people without ener gy, because the structures \nthat supported the overhead bus collapsed. \nFigure 3 , a fire in a generato r step-up transformer \nspread to other units due to poor design of the fire wall \n \n \nFigure 1. Escalation of a transformer fire. \nand the rock-filled pits. Rock -filled pits are a passive \ncontrol measure against soil contamination in the event \nof a major transformer oil leak and fire. As well as a \nflowing liquid fire, it is also important to prevent a Boil- \ning Liquid Expanding Vapor Explosion (BLEVE). A \nrock-filled pit should use clean rocks of a certain size and \nextend to a defined depth in order to ensure that the flow \nof burning oil through the rock layer is sufficiently fast to \ncool the oil and extinguish the pool fire. \n \n \nFigure 2. Collapse of overhead bus due to a fire. \n \n \nFigure 3. A transformer fire caused by bushing failure. \nC o p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \nD. DUARTE 65\nA transformer in a 500 kV substation was operating \nunder normal conditions when the spray system was ac- \ntivated by a false alarm. As the sprinkler head was placed \nfacing the bushing instead of the transformer tanker, an \nexternal arc was created whic h caused the rupture of the \nbushing and led to a fire. NFPA 15 states that nozzles \nmust be positioned in such a way that the water spray \nenvelope does not directly impinge on the energized \nbushing. The Brazilian experience shows without doubt \nthat installation control is crucial. \nThree transformers caught fire in a substation. Only \none of the transformers was protected by a spray system, \nwhilst the other two were not. The protected transfor- \nmer’s spray system controlled the fire and the impact was \nminimized, i.e. the transformer was repaired. One of the \nunprotected transformers caught fire on a day of heavy \nrain and the other on a hot summer day (the ambient \ntemperature was around 30 ˚C). The heavy rain protected \nthe first unprotected transformer and it could be repaired. \nBut the other unprotected transformer, which caught fire \nin summer, did not survive. \nThe location of a transformer in the context of a power \nplant may affect its mission and business objectives if a \nfire occurs. Some organizations ignore the fire risk in the \nhope that such an unfortun ate event will not happen. \nOthers assume that if a fire  does occur, the decision on \nwhat to do will be taken at the time. Figure 4 shows the \ntransformer location in the context of a power plant: if a \ntransformer fire occurred in this case, the combustible \nproducts could flow into the turbine inlet system. \nTransformer fires have resulted in unacceptable con- \nsequences for companies and society as a whole, such as: \n1) A bushing failure resulted in fragments of bushing \nceramic being propelled beyond the perimeter of the sub- \nstation, thereby putting people and buildings at risk. \n2) A transformer explosion created a blast pressure \nthat impacted adjacent properties and structures. The blast \nwaves also destroyed the fire protection measures around \nthe transformer (such as the water spray system). \n \n \nFigure 4. Detail of a power plant layout. \n3) An insulating oil-pool fire caused ignition of com- \nbustible structures inside and outside the installation pe- \nrimeter. \n4) A transformer oil-spill fi re spread because suitable \noil containment was not installed. The resulting spill fire \nimpacted other equipment and structures both within the \nsubstation and outside the perimeter. \n5) Examples of transforme r oil-pool fires impacting \nstructures and equipment: \n5.1) The heat flux from a transformer fire ignited ex- \nposed combustible surfaces. It also caused the failure of \nceramic bushings on adjacent equipment as fireproof \nwalls were not installed.  \n5.2) Radiation from the fire exposed the steel overhead \nbus structure to temperatures well above the yield tem- \nperature, causing failure. \n5.3) An insulating oil pool fire created a very large fire \nplume. Due to high wind speeds, the fire plume tilted \nsignificantly and exposed ad jacent equipment, buildings \nand other structures, as well as causing significant soot \ndeposits in the downwind plume area (Figure 5). \nProperly designed installation and maintenance of both \npassive protection and active barriers can mitigate the \nimpacts of a transformer fire. The next paragraph pro- \nvides an overview of philosophies applied to dealing \nwith fires in Brazil. Depending on the company’s safety \nculture, it may adopt one, two or all of these approaches.  \nFire prevention  philosophy requires the selection of \nmaterials and design features  that will prevent or lower \nthe risk of transformer fire. Using natural ester as a di- \nelectric, for example. \n \n \nFigure 5. Fire plume from a reactor fire. \nC o p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \nD. DUARTE 66 \nFire pr\notection philosophies are measures that are \nincorporated into the transformer environment to miti- \ngate or reduce fire hazards. These measures should in- \nclude: \n1) Life Safety. The occupant should be able to leave \nthe location where the transformer is installed without \nbeing subject to hazardous  or unbearable conditions, \nsuch as thermal exposure, carbon monoxide, carbon di- \noxide, smoke and other gases. Firefighters should also be \nable to rescue occupants and prevent the fire spreading. \n2) Passive Measures. Static measures that are designed \nto control the spread of fire and withstand the effects of \nfire, such as firewalls and rock-filled pits. \n3) Active Measures. Automatic fire protection meas- \nures that warn the occupants of the existence of fire, and \nextinguish or control the fire. These measures are de- \nsigned to automatically extinguish or control a fire at its \nearliest stage, without risking or sacrificing property. The \nbenefits of these systems have been accepted by authori- \nties and insurance companies. \n4) Manual Measures. Include items such as the various \ntypes of fire extinguishers, fire hydrants, hose station, etc. \nrequiring active participation by company staff or the fire \ndepartment. \nIf fire prevention and fire protection measures are not \nincorporated, it is expected that the local fire department \nor company fire brigade will have to fight the fire manu- \nally. The transformer fire will be extinguished and the \nfire department will have contributed to this outcome. \nThe success of this event is not that the fire will eventu- \nally be put out, but whether the fire department will ex- \ntinguish the transformer oil-pool fire before it spreads. \nWhat is the probability that the fire department will pre- \nvent the fire spreading to other areas or involve other \nequipment? The fire suppression philosophy can have a \nsignificant impact if a fire occurs. A fire may have a very \nlow cost initially, but may result in significant losses of \nassets, revenue and customer services. \nFire recovery should provide measures to recover the \ntransformer and its surroundings in the event of a catas- \ntrophic fire. There are companies that have an inventory \nof transformers. It is highly recommended for specific \nand critical scenarios to guara ntee the operational conti- \nnuity of the system. \n3. Transformer Fire and Installation Layout \nMany transformers have been fitted with water-spray \nsystems to combat the effects of fire, but these systems \nonly serve to limit collateral damage in the substation \nand cannot prevent initial fire. The fire safety aspects of \nthe installation are also neglected at the design stage. Fire \nrisk analysis of the layout of several substations has un- \nequivocally shown that, when there is some fire protec- \ntion, its effectiveness is questionable, because it was in- \ntroduced in isolation from the rest of the system (as will \nbe shown in the following paragraphs). Figure 6 shows \ndetails of the layout of a 230/69 kV substation. This sub- \nstation was initially designed, constructed and operated \nfor some years without firewalls. Firewalls were con- \nstructed at a later stage, probably because a transformer \nfire in another substation without firewalls destroyed the \ntransformer adjacent to the one on fire. As firewalls exist \nto protect adjacent transformers in the event of one \ncatching fire or exploding, firewall failure may result in \nthe loss of additional transformers. Although the fire- \nwalls were designed to resist fire for 4 hours, studies \nconducted by Duarte et al. [1] showed that they can start \nto collapse after just one hour. In Figure 7, the grey area \nshows that the structural integrity of the firewall was \ncompromised, since compressive and tensile stress ex- \nceeded the values of 150 kg/cm\n2 and 15 kg/cm 2 respec- \ntively. \n \n \nFigure 6. Detail of substation layout. \n \n \nFigure 7. Von Mises tension test on firewall after 60 min- \nutes. \nC o p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \nD. DUARTE 67\nWhy did the engineers who designed the firewall be- \nlieve it had a fire resistance of more than 4 hours? They \ndid not take into account the energy released by a fire or \nexplosion. They did not ask the following question: what \nwill the energy release be if a fire or explosion occurs in \none of the transformers? The answer involves the quanti- \nfication of the physical phenomena involved in a fire or \nexplosion. What is surprising is that the design team \nthought that all the transmission transformers were pro- \ntected against a possible fire. About a hundred firewalls \nof the same design were constructed in other substations \nof the transmission network managed by this company. \nHowever, since the transmi ssion transformer specifica- \ntions are not the same for th e entire network, the energy \nreleased during a fire or explosion differs among trans- \nformers in operation. The energy release depends on such \nthings as the transformer capacity, distance between the \ntransformer and the firewall, type of fire resulting from \nthe transformer failure, oil ch aracteristics, wind velocity \nand direction. As a result, so me of the firewalls of this \nparticular transmission network are over-dimensioned \nand others under-dimensioned.  \nFor the substation shown in  Figure 6, it is also impor- \ntant to note the relay houses. Some of the protection, \nbypass and control circuits that control the transformers \nand other substation equipment are installed in the relay \nhouse. In this particular substation there are two relay \nhouses whose structure is masonry with glass windows. \nA structural thermal performance simulation of one of \nthe relay houses during a transformer pool-fire was car- \nried out using the finite elements method. The distance \nbetween the transformer and the relay house was 3.50 \nmeters. Ninety minutes after the fire started, the wall \ntemperature distribution showed some wall temperatures \nto be above 300˚C. Although such high temperatures can \ncause wall failure, the structural integrity of the walls, \npillars and beams was maintained for 117 minutes after \nthe fire started. 45 minutes afte r the fire started, the glass \nwindows would break, so there would be a rapid increase \nin the gas temperature inside the relay house. The heat \nimpact would cause irreversible damage to the electronic \npanels. Analysis of gas temperature distribution inside \nthe house showed that temperatures higher than 70 ˚C \nwould be reached in approximately 30 minutes. \nEventually a substation fire will be put out and either \nthe company fire brigade or local fire department will \nhave contributed to this outcome. The success of this \nevent is not whether the fire is extinguished; the question \nis not the overall probability of the fire being controlled, \nbut rather the probability of the fire being controlled \nwhen it is 1 kW, 5 kW, 10 kW, 50 kW...n kW. The suc- \ncess of the event is to control the fire before it causes \nfurther impact on the operational continuity of the sub- \nstation. An inappropriate lay out in the event of a fire \n(Figures 4 and 6) can spread the impact to other parts of \nthe substation. The time necessary to re-integrate the \nsubstation into the network will thus increase, even \nwithout considering the othe r costs involved. The com- \npatibility of the substation layout with fire behavior is \nimportant to understanding the substation’s post-fire op- \nerational continuity. \n4. Fire Protection Evaluation \nElectricity is taken for granted and it is only when the \nlights go out and our daily routines seem to go into slow \nmotion that we suddenly become aware of our depend- \nence on power plants, transmission lines and substations. \nConsumers have become more aware of an increase in \nfires and explosions involving oil-filled equipment. The \nrecognition of the fire hazard, the risks involved and ap- \npropriate fire protection and mitigation measures are \nsome of the key considerations for the design and opera- \ntion of new or existing hydroelectric power plants and \nsubstations. \nThere is a wide range of types and causes of fires that \ncan occur in power plants or substations. The types of \nfires depend on the equipment, the systems used in the \nstation and the layout. Energi zed electrical cables with a \ncombustible insulation and jacketing can be a major haz- \nard because they are a combination of fuel supply and \nignition source. A cable failure can result in sufficient \nheat to ignite the cable insulation, which may continue to \nburn and produce great heat and large quantities of toxic \nsmoke. \nSome of the specific components encountered in a \nsubstation that are fire haza rds are oil-insulated trans- \nformers and circuit-breakers, hydrogen cooled synchro- \nnous condensers and standby diesel generator buildings. \nA control or relay house can contain potential hazards \nsuch as batteries and charging systems, combustible \nwaste, exposed combustible constructions, switchyard \ncable openings that have no t been fire-stopped, offices, \nemergency generators and other noncritical facilities. \nFires in indoor substations are also caused by some of \nthe same substation-related hazards found in switchyards \nand control rooms. The basic problem with a major fire \nin indoor substations is that the building will contain the \nblast pressure, heat and smoke, which can result in blast \nand thermal damage to the building’s structure as well as \nsmoke damage to other equipment i.e. corrosion damage. \nThe hazard created by mineral oil-insulated equipment \nsuch as transformers, reactors or circuit breakers is that \nthe oil is a significant fuel supply that can be ignited by \nan electrical failure within the equipment. Infiltration of \nwater, failure of core insulation, exterior leakage currents \nand tap-changer failure are some of the causes of arcing \nwithin the mineral insulating oil that can result in a fire. \nThis arcing can produce breakdown gases such as acety-\nC o p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \nD. DUARTE 68 \nl\nene and hydrogen. Depending on the type of failure and \nits severity, the gases can build up sufficient pressure to \ncause tanks or bushings to fail or rupture. Once the tank \nor bushing fails there is a probability that a fire or explo- \nsion will occur. A possible explosion could cause blast \ndamage. The resulting oil spill fire could spread to form a \nlarge pool of fire, depending on the volume of oil, spill \ncontainment, slope of the surrounding area, and the type \nof surrounding ground cover. Thermal radiation and \nconvective heating from the oil spill fire can also damage \nsurrounding structures and structures above the fire area. \nOil-insulated equipment is the main source of substa- \ntion fire [1]. Transformer oils are typical Class III B liq- \nuids. According to FM Global Data Sheet 5 - 4 and \nNFPA 325, the flash point of transformer oil is 146 ˚C - \n300˚C. The form of fire protection for oil-insulated \ntransformers depends on the size and importance of the \ntransformer. For example, a single transformer under \n10,000 kVA can probably be protected by portable ex- \ntinguishers. A single transformer over 10,000 kVA \nshould have hydrant protection. Single transformers over \n100,000 kVA should have a fixed automatic water spray \nsystem. Multiple transformers over 10,000 kVA should \nalso be separated by 8 m of open space and/or noncom- \nbustible barriers between the units or be protected by a \nfixed water spray system. \nTransformers are typically o il-cooled, and the applica- \ntion of a water spray to a transformer oil spill or fire can \ncontrol or extinguish the fire by emulsification of the oil \n(Figure 8). When water and oil (immiscible liquids) are \nagitated together and one of the liquids is dispersed \nthroughout the other, this causes a cooling effect on the \noil surface, preventing the release of flammable vapor. \n \n \nFigure 8. Water spray system. \nOn the other hand, if water is unavailable, a dry \nchemical system should be considered as a suitable al- \nternative, especially if the transformer is in an enclosure. \nAlthough dry chemical system s are effective for extin- \nguishing oil fires, their limited capacity generally make \nthem a second choice to water.  If the transformer is lo- \ncated outdoors, the system should be designed to operate \nsuccessfully against adverse winds. A fixed carbon diox- \nide system is usually of questionable value outdoors ow- \ning to wind effects. Although foam is effective on flam- \nmable liquid fires, it may act as conductor of electricity, \nand should therefore not be used on or near energized \nequipment. \nFire suppression of a non-sprinkler-protected trans- \nformer is completely dependent on passive barriers, such \nas separation space, fire-resistant walls and enclosures \nthat confine the oil in the event of oil leakage or tank \nrupture. On the other hand, if an automatic fire suppres- \nsion system is present, its reliability to act successfully \ndepends on project design, installation and maintenance \n(Figure 9 ). The project design describes manufacturing \nquality control of all water- spray components (water- \nspray nozzles, pipes and tubes, joining of pipes and fit- \ntings, hangers, control valves, etc.). NFPA 15 describes \nwater spray protection design for transformers. Installa- \ntion is related to the quality control of the construction \nprocess, whilst the success of system operation also de- \npends on long-term maintenance. If maintenance of the \nsystem is not a priority, the reliability will deteriorate and \nits operational level will worsen. After successful instal- \nlation, only event actuation can change over time. \nThe concept of fire design is an essential part of every \nfire component evaluation, because it affects fire defense \nperformance. The fire design identifies the rate of heat- \n \n \nFigure 9. Reliability of the water-spray system. \nC o p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \nD. DUARTE 69\nrelease, the speed of fire grow th for a series of scenarios, \nand the incident energy on a target. The fire design can \nbe estimated using the fire and explosion models avail- \nable in the literature. The vulnerability models provide an \nestimate of the effects of the physical phenomena on the \nreceptors (i.e.  people, structures/building and environ- \nment). \nA water-spray system usually involves heat-actuated \ndetectors operating an auto matic mechanical flooding \nvalve that supplies water to projectors (i.e. spray nozzles) \narranged over and around the unit being protected. When \nthe activated detectors call for water, a number of system \ncomponents must function in order to deliver the water to \nthe projectors. The application of the agent is an expres- \nsion of the success or failure of water flowing through \nvalves to the projectors. It is essential to have an ade- \nquate pressure and flow rate. The expected performance \nof the water spray system can be evaluated based on in- \nformation about its reliability and operational effective- \nness, as shown in Figures 10 and 11. \n \n \nFigure 10. Evaluation of water-spray system. \n \n \nFigure 11. Success or failure of the agent application. \nThe efficient design of fire safety for an installation \ndepends on obtaining answers to the following questions: \nWhat can go wrong? How will the installation safety \nbarriers (i.e. preventive and protective measures) react to \na fire or explosion? What will be the consequences if the \nbarriers fail? The first question consists of a systematic \nidentification of the initiating events as well as the com- \nbined sequences of events that can lead to a fire or ex- \nplosion. In other words, what has not been identified \ncannot be assessed or mitigated. The following para- \ngraphs present several fire scenarios. \n5. Transformer Fire Scenarios \nTransformers are generally highly reliable and failures \nare rare. Although most transf ormer faults do not lead to \na fire or explosion, some combinations of latent faults \nmay result in a catastrophic transformer fire. Cooper [2] \nand Medina [3] examined a nu mber of case histories and \nconcluded that the following circumstances could lead a \ntransformer fire and explosion. \n1) Failure of inter-turn insulation in the main windings, \nprobably as a result of overheating due to obstruction in \noil circulation; mechanical damage during manufacture; \nmoisture penetration between turns; overheating due to \novervoltage or overload; and relative movement between \nturns. \n2) Insulation failure between winding and transformer \ntanker caused by aging or deterioration of insulation, or \nmoisture entry into oil. \n3) Failure of magnetic circuit, leading to excessive \neddy currents in the core. \n4) External causes, such as rapidly fluctuating load, \nsteep-fronted surge voltage and external short circuit on \nthe secondary side. \n5) Miscellaneous faults: failure at connections or bush- \ning; inadequate design or a design unsuited to the service \nfor which the transformer was installed; inadequate spring \ntension on tap-charger contact springs; ignition of vapor \nabove the oil level; and inadequate maintenance. \nAccording to Ronningen [4], if an arcing fault occurs \nwithin the transforme r, ejection of oil aerosol can occur, \npossibly accompanied by a ph ysical explosion of the \ntransformer tanker ( Figure 12). If the oil is ignitable, a \nserious fire or a vapor/mist explosion can happen. When \nan arc occurs in ignitable oil, hydrogen and acetylene are \nthe main gases produced. By contrast, breakdown of oil \ndue to excessive conductor temperature yields mostly \nethane, ethylene and methane, with smaller amounts of \nhydrogen. Benton [5] suggests the following sequence of \nevents leading up to a transformer explosion: \n A heavy overload degrades the oil sufficiently to \ncause a fairly high leakage current. \n The leakage current further degrades the insulation  \nC o p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \nD. DUARTE 70 \n \nFigure 12. Sequence of event th at can lead to transformer \nexplosion (adapted from Ronningen [4]). \n \n(i.e. oil, paper or wood) and eventually leads to a \nturn-to-turn or layer-to-layer fault. \n The fault becomes large enou gh to cause the primary \nfused cutout to operate. \n Upon re-fusing and re-closing the cutout, the trans- \nformer insulation fully breaks down, drawing a very \nlarge arc fault current. \n The energy released from th e arc gasifies the trans- \nformer oil, primarily into hydrogen and methane.  \n Rapid pressure building from the gasification causes \nthe transformer cover to be blown off. \n The combustible escaping gases ignite either due to \nremaining arc energy or due to sparking associated \nwith rapid metal breakage. \nAs pressure relief devices are generally effective only \nfor slowly rising overpressure events, they do not prevent \nserious explosions. A transformer explosion can be al- \nmost guaranteed to occur if oil maintenance is neglected. \nOil degrades over time due to heat, moisture, arcing from \non line tap changing and partial discharges. Oil-filled \ntransformers are commonly equipped with a Buchholz \nrelay, which in principle is the transformer’s first line of \ndefense against an explosion. \nThe São Francisco Hydroelectric Company (CHESF) \nhas an installed capacity of more than 10,000 MW. It \ncarried out a survey involving approximately 5000 trans- \nstates in Northeast Brazil. CHESF was particularly inter- \nested in studying the transformer failure mechanism of \nlarger transformers in service. The failures had their ori- \ngins in the core, windings, transformer protection com- \nponents, tap changes and bushings [6]. \nThe intrinsic protection system inclu\nformers with a voltage of no less than 69 kV in eight \ndes all accessory \npr\nechanical wear, \nlo\nmely \ndi\notection devices i.e. gas relay, oil and winding tem- \nperature sensors, pressure relief devices in the trans- \nformer tank and the tap changer protection relay. The \nmain causes of failure are due to environmental condi- \ntions such as moisture, rain, sunlight and pollution, which \ncould cause the degradation of micro-switch insulation. \nAccessory protection devices should be properly housed \nto prevent environmental damage [3,6]. \nTap-changer failures are the result of m\nw dielectric strength or maintenance failure [3,6]. \nThe main causes for bushing failures are extre\nfficult to determine. The ba sic obstacle lies in the fact \nthat the explosion leaves little to trace the origin of the \nfault and provide a reliable di agnosis. The main cause of \nbushing failure is poor sealing and the resulting reduction \nof supportability due to contamination by oxygen (oxida- \ntion) and humidity (hydrolysis). Sealing failure occurs \ndue to degradation of seals or corrosion. Other causes \nthat should be considered are the bad connection of a \ncapacitive tap, storage in the horizontal position for a \nlong period, pollution effects on porcelain, overheating \nand very fast transient overvoltages [7]. Figure 13 shows \nbushing failure due to insulation degradation resulting \nfrom manufacturing defects. If a bushing fails, oil is ex- \npelled. If there is a rupture at the oil end of the bushing \nhousing, oil from the transformer will feed a fire and the \nfire will spread to the main tank. Some bushing failure \ncauses are represented in detail in Figure 14. Figure 15 \nshows how a bushing failure can result in a transformer \nfire. \n \n \nFigure 13. Bushing failure caused by degradation of it insu- \nlation. \nC o p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \nD. DUARTE \nC o p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \n71\n \ng\nlayers \n \nFigure 14. Probable causes of bushing failure. \n \nThe scenario represented by the pat\n13\nario represented by the path 0-2 shows that a \ntra\nd by the path 0-1-4 shows that \nev\nesented by the path 0-1-3-6 shows \nth\nthe transformer is below its upper limit, the transformer \n \n addition the current required by \nth\nank is located far from the bushing, even if \nth\nt, even if the bushing fails, \nex\nthe tank being near the bushing. \nh 0-1-3-5-7-9-11- fire will not take place. \n shows that a transformer fire could be the result of the \nfollowing event sequence: after the bushing failure, it \nexplodes and catches fire; the current required by the \ntransformer is above its upper  limit; the main tank does \nnot withstand the internal pressure; the hole in the tank is \nlocated near the bushing; a nd so an ignition source is \npresent.  \nThe scen\nnsformer fire w ill not take place if the bushing does \nnot explode after it fails. \nThe scenario represente\nen after the bushing failure and the explosion, the \ntransformer fire will not happen if the bushing explosion \ndoes not start a fire. \nThe scenario repr\nat as a result of a bushing failure there could be an ex- \nplosion followed by a fire, but if the current required by \nThe scenario represented by the path 0-1-3-5-8 shows \nthat as a result of the bushing failure there is an explosion \nfollowed by a fire, and in\ne transformer is above it upper limit, but as the tank \nwithstands the internal pressure, the transformer fire will \nnot happen. \nThe scenario represented by the path 0-1-3-5-7-10 in- \ndicates that a transformer fire could be avoided if the \nhole in the t\ne bushing fails, explodes and catches fire as well as if \neither the current required by the transformer is above its \nupper limit or the tank fails.  \nThe scenario represented by the path 0-1-3-5-7-9-12 \nindicates that the transformer fire will not happen if there \nare no ignition sources presen\nplodes and catches fire, the current required by the \ntransformer is above it upper li mit, as well as the hole in \nD. DUARTE 72 \n \n \nFigure 15. Bushing failure. \n \nPower plants and substations have been around for \nquite some time, so ample engineering experi\nnd the public is familiar with their equipment and \nst\nhe loss arising from a fire is rarely easy and \ncan indeed \nverge on the impossible due to the knowledge \navailable and technological limitations. It may appear \nstimate the replacement costs of substation \nequipment or other adjacent structures which have been \npara- \n has \nence exists si\nmple to e\na\nructures (i.e. tran\nsformer, circuit breaker, transmission \nlines, etc.). There is also a substantial economic incentive \nto prevent accidents. In spite of mature technology, good \nmanagement, and incentives to keep the plant or substa- \ntion from blowing up, uncontrollable fire rages within \nthem on occasion, killing oper ators and causing substan- \ntial losses. Traditionally, expected damages can be esti- \nmated by studying loss histories, i.e . by compiling the \namounts incurred by previous events. However, loss ex- \npectancy (measured in dollars) will also depend on the \nsubstation layout and fire protection technology. The \nobjective of the next section is to analysis the physical \nimpact of a transformer fire on the company mission and \nobjectives. \n6. Potential Loss from Transformer Fire \nEstimating t\ndamaged or destroyed, but this is frequently a com\ntively minor part of the total loss incurred. If a fire\nbeen serious enough to cause a blackout, the social cost \nwill be a significant component of the overall cost. \nMoreover, the Brazilian Electrical System Regulatory \nAgency (ANEEL) has emphasi zed that electrical power \norganizations (including power plants, transmission and \ndistribution systems) should be heavily penalized when- \never they cannot provide electricity to their consumers. \nANEEL will also penalize power utilities if a transmis- \nsion line, a transformer or any other piece of equipment \nis not available. Such penalties could compromise the \ncompany’s economic health and reputation. \nThe exploitation of fixed assets (such as equipment, \nproperty, etc.), human resources and information or \nknowledge will yield cash flow. The business will usu- \nally also draw benefit from the organization’s reputation, \ngoodwill and physical environment. A transformer fire \nwill have an impact on most of these elements. \nC o p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \nD. DUARTE 73\nA transformer fire or explosion could cause extensive \ndamage to fixed assets of either the substation or other \npl\nrmer fire \nor\ne unavailability of the transformer and gas tur- \nbi\n could affect the water table. In order to prevent \nso\nal cost of a transformer \nfir\n of business. \nSin\nce 1995 FURNAS has b een observing an increase \n \ndu of operation. \nants \nnearby as a result of the impact of thermal and \nblast waves. In addition, a transformer could be installed \nunderground, such as at Itaipu Power Plant. Another im- \nportant undesirable effect asso ciated with fire, explosion \nand the projection of fragments is the domino effect. Un- \nder certain conditions it is possible that a transfo\n explosion may extend to other equipment adjacent to \nthe substation, creating a major chain accident with far- \nreaching consequences. Atten tion should be given not \nonly to the health risk, but also to the resistance of other \nequipment and structures to certain levels of thermal ra- \ndiation. \nA step-up transformer fire could put a natural gas \nthermoelectric power plant ou t of action for an extended \nperiod of time, the production loss resulting in a signifi- \ncant reduction in cash flow to the plant owners. This \nsituation may be exacerbated by having to acquire alter- \nnative supplies to meet cont ractual commitments or by \nhaving to pay penalties such as those imposed by ANEEL, \ndue to th\nne. \nPoor mechanical design of the transformer could cause \noil leakage (Figure 16), leading to oil contamination and \nthus to transformer fire. Additionally, a failure in the \nmaintenance of an oil-filled transformer could result in a \npool fire, spray fire or Boiling Liquid Expanding Vapor \nExplosion (BLEVE). The principal environmental impact \nwould probably be the discharge of oil into the soil, \nwhich\nil contamination in the ev ent of a major leak, rock- \nfilled pits should collect the oil. \nWhat are the costs of a bad reputation? While a power \nplant will directly suffer from  a transformer fire, other \ncompanies could be adversely affected by the impaired \npublic perception of the electricity industry as a whole. \nThe reputation of the power generation, transmission and \ndistribution industries will generally be established by \ntheir poorer performers. \nAlthough establishing the actu\ne can be difficult, there is no doubt that there is a large \nbill to be paid. The organization will usually look first to \ntheir insurer for compensation, and claims settlements \nmay well cover a large part of the losses. However, it is \nimportant to understand the nature of insurance: it will \nnot cover the losses resulting from a poor reputation or \nthe penalties for interruption\n7. Brazilian Transformer Failure versus the \nGlobalized Economy \nFURNAS Centrais Elétricas  has an installed capacity of \n10,050 MW. It represents 10 % of all electrical energy \nproduced in Brazil. The utility is responsible for supply-\ning energy to the most developed region of Brazil and \nabout 50% of Brazilian homes. \nin the failure rate of new transformers and reactors, either\nring acceptance tests or in the first year \nAlthough these failures have not been catastrophic, they \nhave resulted in equipment becoming unavailable [8]. \nThe failure analysis pointed out deficiencies in the \nmanufacturing process and dielectric design. For exam- \nple, oil leakage from the main tank was observed to be a \nresult of poor welding leading to the contamination of the \nmineral oil ( Figure 16). This could have caused a trans- \nformer fire or explosion. \nIn other words, the investigation carried out by FUR- \nNAS showed that the main cause of failure in new trans- \nformers during operation had originated from the active \ncomponents (including core, winding, etc.) and the \nbushing. Both the costs and the time attributed to trans- \nformer active component failure are normally much \nhigher than those resulting from failure of intrinsic pro- \ntection devices, tap changers  and bushing. All failures \nare undesirable and a cause  of concern to both the elec- \ntrical power industry and transformer manufacturers. \nRepair cost and time depend on the affected component. \nThe Gross Domestic Product (GDP) of any country is \nproportional to its demand for electrical power. In Brazil, \nbefore the 1990s, it was only the Government that in- \nvested in the electrical po wer market. Moreover, the \ngovernment has not been investing in power plants and \ndistribution utilities for some time, despite electricity \nconsumption having increased over the years. As a result, \naging transformers are often overloaded. As the govern- \nment could not approach the challenge of investing in the \nindustry alone, it decided to deregulate the Brazilian \nmarket. As a result, new private utilities were created as \nwell as Public Limited Companies (PLCs) entering the \nBrazilian Market. \nThe National Regulatory Agency of the Brazilian \nElectrical Power System (ANEEL) has been pushing \n \n \nFigure 16. Oil leakage will pr obably cause oil contamina- \ntion. \nC o p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \nD. DUARTE \nC o p y r i g h t  ©  2 0 1 2  S c i R e s .                                                                                 OJSST \n74 \nthe new stakeholders to optimize the lead time for the \ndesign and construction of new facilities. On the other \nhand, the globalized economy has been putting pressure \non manufacturers to reduce their costs. This may be \nachieved by reducing manufacture time through better \ntools or manufacturing processes, as well as sophisticated \nsoftware and better materials.  \nOperating conditions have become more severe in re- \ncent years, and transformers have to operate in conditions \nof very fast transient or resonant voltage surges. These \ntransient conditions may be the result of switching in the \npower system. Meanwhile, as manufacturing tools have \nbeen improving, there has been  the tendency to reduce \n components, tap changers or bushing to compete \n8.\nt is im- \n that it is standards and codes—rather \nsional—that will assume responsibil- \nromise the organization’s economic \nhe\n by ANEEL), the implementation of \npe\nractions between the various subsystems, and \nth\n[3] M. Medina, “Falhas em Tr\nansformadores de Potência: \nnálise, Definições, Causas e \ntion of UNIFEI, Itajubá-Brasil, \n Choice of Protec- \ntion,” Ph.D. Dissertation, No rges Tekniske Hogskole, \nTrondheim, 199\n[5] R. E. Benton cing Faults Cause \n \nte, “A Performance Overview about Fire Risk \n75. doi:10.1016/j.jlp.2003.09.007\nth\ne safety factor of the transformer’s intrinsic protection, \nactive\non the globalized market. In other words, manufacturers \nhave been reducing transformer safety margins, as their \nintention is to meet only the minimum requirements of \nthe valid standards. Moreover, there are some indications \nthat standardized acceptance tests (type and routine tests) \ndo not reflect operational conditions in the field. \n Conclusions \nThere is a tendency in Brazil, particularly in the reports \nfollowing disasters, for a detailed range of prescriptive \nmeasures to be laid down to  ensure the disaster never \nhappens again. Many of these recommendations tend to \nbecome embodied in good practice, which has helped to \nreduce losses. There is no doubt that the use of standards \nand codes in the form of good practice helps to avoid \nhazards of which few people are even aware. The thought \nprocess for fire-related decisions is heavily influenced by \nexperience and interpretation of codes and standards. In \nother words, prescriptive fire regulations developed by \nconsensus committees may be described as a compilation \nof good practices with a weak technical basis. I\nportant to recognize\nthan a design profes\nity for fire safety. \nGood practice or regulatory practices in no way pro- \nvide a measurement of the level of fire safety in a com- \nplex system, such as an elec trical installation in a hy- \ndroelectric power plant or substation. An effective ap- \nproach to fire safety is therefore needed to deal with the \ncomplexities and changes that exist in the electrical \npower industry.  \nThe need to improve safety performance and, indi- \nrectly, fire prevention in Brazilian electrical power or- \nganizations, is partially driven by ANEEL. It has empha- \nsized that the electrical po wer organizations (including \npower plants, transmission and distribution systems) \nshould be heavily fined whenever they cannot provide \nelectrical energy to their cons umers. These fines, if ap- \nplied, could comp\nalth. \nIt is clear that addressing organizations’ error-inducing \nconditions is as important as focusing on the human and \ntechnical causes of accidents (failures). Despite these \nsignificant changes in the approach to safety and fire \nsafety already evident in the Brazilian electrical power \nindustry (induced\nrformance analysis that recognizes the multifaceted \napproach to fire safety is still a long way off. \nFire safety still tends to be analyzed in isolation: con- \nventional approaches to fire safety do not appear to be \ntaking the overall system, organizational culture or the \nexternal organizational environment into account. In \nother words, the electrical po wer organizations in Brazil \nhave a prescriptive approach to fire. They do not assess \nthe inte\neir impact on the system’s overall performance. \n9. Acknowledgements \nI am deeply indebted to Medina Pena, Carlos Campos \nand Messias Oliveira for thei r wisdom and support at the \nfinal stage of developing of this study. \nREFERENCES \n[1] Duarte, et al ., “Technical Report on Fire in Substations \nprepared by the Laboratory of Technology Risks of Fed- \neral University of Pernambuco,” RISCTEC-UFPE, Centro \nde Tecnologia, Cidade Universitária, Pernambuco, 1999. \n[2] W. F. Cooper and D. A. D. J ones, “Electrical Safety En- \ngineering,” 3rd Edition, Butterworth-Heinemann, Oxford, \n1993.  \nUma Contribuição para A\nSoluções,” Master Disserta\n2003. \n[4] T. Ronningen, “Internal Faults  in Oil-Filled Distribution \nTransformer: Fault Mechanis ms and\n3. \n and D. Ristu ccia, “Ar\nTransformer Failures,” Electrical World, Vol. 179, 1973, \npp. 44-45. \n[6] M. Medina, C. A. Mohallen and D. Duarte, “Failure of \nPower Transformer: A Contribution on Its Analysis and\nReduction,” Proceedings of the Tenth Meeting of CIGRÉ \nfor Latine America\n— X ERLAC, Argentina, 18-22 May 2003. \n[7] D. Duar\nManagement in the Brazilian  Hydroelectric Generating \nPlants and Transmission Network,” Journal of Loss Pre-\nvention in the Process Industries , Vol. 17, No. 1, 2004, \npp. 65-\n  \n[8] G. Bastos, “An Analysis of the Increase on Transformer \nFailure Rate Phenomena and Measures Taken to Improve \nTransformers Reliability,” Proceedings of the CIGRE Bi- \nenal, Paris, 2006. \n "
}