{
  "title": "Disability Measurement for Lymphatic Filariasis: A Review of Generic Tools Used within Morbidity Management Programs",
  "url": "https://openalex.org/W2002367336",
  "year": 2012,
  "authors": [
    {
      "id": null,
      "name": "Zeldenryk, L",
      "affiliations": [
        "James Cook University"
      ]
    },
    {
      "id": null,
      "name": "Gordon, Susan J",
      "affiliations": [
        "James Cook University"
      ]
    },
    {
      "id": "https://openalex.org/A4286930661",
      "name": "Gray, M.",
      "affiliations": [
        "University of the Sunshine Coast"
      ]
    },
    {
      "id": null,
      "name": "Speare, R",
      "affiliations": [
        "James Cook University"
      ]
    },
    {
      "id": null,
      "name": "Melrose, W",
      "affiliations": [
        "James Cook University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2003904220",
    "https://openalex.org/W2037695913",
    "https://openalex.org/W1997581821",
    "https://openalex.org/W2077408098",
    "https://openalex.org/W2028280803",
    "https://openalex.org/W2000442960",
    "https://openalex.org/W2153037374",
    "https://openalex.org/W1598135475",
    "https://openalex.org/W2105528413",
    "https://openalex.org/W2320953778",
    "https://openalex.org/W1992459200",
    "https://openalex.org/W2107185157",
    "https://openalex.org/W2089257354",
    "https://openalex.org/W1997249866",
    "https://openalex.org/W640949316",
    "https://openalex.org/W2171556940",
    "https://openalex.org/W1996736319",
    "https://openalex.org/W2035285195",
    "https://openalex.org/W2110353284",
    "https://openalex.org/W2019398887",
    "https://openalex.org/W2102767036",
    "https://openalex.org/W2790863688",
    "https://openalex.org/W1977704394",
    "https://openalex.org/W1971566604",
    "https://openalex.org/W1979270297",
    "https://openalex.org/W2143486997",
    "https://openalex.org/W1996418284",
    "https://openalex.org/W2168780197",
    "https://openalex.org/W2109935313",
    "https://openalex.org/W2086386689",
    "https://openalex.org/W2081229766",
    "https://openalex.org/W2004682279"
  ],
  "abstract": "Lymphatic filariasis (LF)-related disability affects 40 million people globally, making LF the leading cause of physical disability in the world. Despite this, there is limited research into how the impacts of LF-related disability are best measured. This article identifies the tools currently being used to measure LF-related disability and reviews their applicability against the known impacts of LF. The findings from the review show that the generic disability tools currently used by LF programs fail to measure the majority of known impacts of LF-related disability. The findings from the review support the development of an LF-specific disability measurement tool and raise doubt about the suitability of generic disability tools to assess disability related to neglected tropical diseases (NTDs) globally.",
  "full_text": "Review\nDisability Measurement for Lymphatic Filariasis: A\nReview of Generic Tools Used within Morbidity\nManagement Programs\nLynne Zeldenryk1*, Susan Gordon1, Marion Gray2, Richard Speare1, Wayne Melrose1\n1 School of Public Health, Tropical Medicine and Rehabilitation Sciences, James Cook University, Douglas, Queensland, Australia,2 Occupational Therapy, University of the\nSunshine Coast, Sippy Downs, Queensland, Australia\nAbstract: Lymphatic filariasis (LF)-related disability af-\nfects 40 million people globally, making LF the leading\ncause of physical disability in the world. Despite this, there\nis limited research into how the impacts of LF-related\ndisability are best measured. This article identifies the\ntools currently being used to measure LF-related disability\nand reviews their applicability against the known impacts\nof LF. The findings from the review show that the generic\ndisability tools currently used by LF programs fail to\nmeasure the majority of known impacts of LF-related\ndisability. The findings from the review support the\ndevelopment of an LF-specific disability measurement\ntool and raise doubt about the suitability of generic\ndisability tools to assess disability related to neglected\ntropical diseases (NTDs) globally.\nBackground\nLymphatic filariasis (LF) is caused by three filarial nematodes:\nBrugia malayi, Brugia timori, and most commonly,Wucheria bancrofti[1].\nGlobally 120 million people have LF and 1.34 billion people are at\nrisk within endemic regions (65% within South-East Asia, 30% in the\nAfrican region, and the remaining in other tropical regions) [2].\nIt is estimated that 40 million people are chronically disabled by\nLF, making LF the leading cause of physical disability in the world\n[3]. In the chronic stages, LF can cause severe lymphoedema of limbs\nand genitalia, scrotal hydrocele, rheumatic, and respiratory problems\n[4]. Lymphoedema affects approximately 15 million people, whilst\nscrotal hydrocele affects approximately 25 million men globally [2].\nThe Global Program to Eliminate Lymphatic Filariasis\n(GPELF) recently released their progress report for 2000–2009\n[2]. The report summarized the work of the GPELF’s first decade,\nwhich was focused on implementing mass drug administration\n(MDA) across all LF endemic regions. The report acknowledged\nthat whilst MDA programmes have been particularly successful in\nreducing infection within communities, efforts to reduce morbidity\nassociated with LF remain lacking. Currently, only 26 of the 81\nendemic countries have morbidity programs [2]. These programs\nfocus on hygiene, skin care, hydrocele surgery, and exercises [5].\nThe GPELF plan for 2010–2020 highlights the need for the\nestablishment of morbidity management programs in all endemic\nregions. In particular, the plan identifies the need for the\ndevelopment of metrics to monitor and report on the outcomes\nof these programs [2].\nGlobally, the approach to disability measurement has shifted\nover the past two decades. Previously, disability and the impact of\ndisease were conceptualized using a medical model. Measures of\nmortality, years living with impairment [6], or in the case of LF,\nthe stage and type of impairment [2] reflected a purely medical\nmodel to health measurement. However, in recent years, the\nconcept of health and wellness has expanded. Disability is now\nconceptualised not as the presence of an illness or impairment but\nrather as the relationship between the disease/illness/impairment,\nthe persons functioning within daily activities/social roles, and the\nsocial, cultural, and physical environments that enable or limit an\nindividual’s ability to participate fully in his or her community and\ndaily lives [7]. As a result, global disability measurement tools have\nbeen developed to measure these broad concepts.\nWithin the LF community, a number of generic disability tools\nhave been recommended and trialled. These include The\nInternational Classification of Functioning, Disability and Health\n(ICF) [8], the WHO Disability Assessment Schedule (WHODAS)\n(J.M. Fox, personal communication, 2012) [9,10], and the WHO\nQuality of Life Tools (WHOQOL and WHOQOL-Bref) [11].\nThese generic tools are suggested to be necessary and appropriate\nmeasures of disability impact for LF as they have been developed\nand validated internationally (allowing for multi-country surveys)\nand would allow comparison of findings against other diseases\n(allowing for the GPELF to potentially raise the awareness of the\nimpacts of LF globally) [8].\nHowever, others have advocated for the development of an LF-\nspecific disability measurement tool, arguing that an LF-specific\ntool would be more sensitive to the clinical features of LF and for\ndetecting small changes in function that occur with disease\nprogression [12]. Further, it has been argued that an LF-specific\ntool would allow greater sensitivity in the assessment of outcomes\nof GPELF interventions, particularly for patients in chronic stages\nof the disease where the physical impacts are irreversible and\nquality of life rather than cure becomes the aim of intervention\n[11].\nCitation: Zeldenryk L, Gordon S, Gray M, Speare R, Melrose W (2012) Disability\nMeasurement for Lymphatic Filariasis: A Review of Generic Tools Used within\nMorbidity Management Programs. PLoS Negl Trop Dis 6(9): e1768. doi:10.1371/\njournal.pntd.0001768\nEditor: Patrick J. Lammie, Centers for Disease Control and Prevention, United\nStates of America\nPublished September 27, 2012\nCopyright: /C2232012 Zeldenryk et al. This is an open-access article distributed\nunder the terms of the Creative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any medium, provided the\noriginal author and source are credited.\nFunding: The first author has received funding for this study through the\nAustralian Government Australian Postgraduate Award Scheme. The funders had\nno role in study design, data collection and analysis, decision to publish, or\npreparation of the manuscript.\nCompeting Interests: The authors have declared that no competing interests\nexist.\n* E-mail: lynne.zeldenryk@jcu.edu.au\nPLOS Neglected Tropical Diseases | www.plosntds.org 1 September 2012 | Volume 6 | Issue 9 | e1768\nTable 1.Matrix of domains and issues of LF-related disability as identified in the literature.\nDomains Issues\nAhorlu\n1999 [28]\nAhorlu\n2001 [29]\nBabu\n2009 [30]\nBandyopadhyay\n1996 [31]\nCoreil\n1998 [32]\nGyapong\n2000 [33]\nPerera\n2007 [34]\nPerson\n2006 [35]\nPerson\n2007 [36]\nPerson\n2008 [37]\nPerson\n2009 [38]\nSuma\n2003 [39] Total\nClinical Manifestation; Hydrocele, H, Lymphoedema, L H H, L H L L H L L L L L L\nPsychological Depression ! ! ! !!!! 7\nFeelings of shame/\nhumiliation\n!! ! ! ! ! 6\nLow self-esteem/inferiority !! ! 3\nFeeling unattractive/poor\nbody image\n!! ! ! 3\nAbility to cope/strategies !! ! ! 4\nGrief/loss of former self !! ! 2\nFear !! ! ! ! ! 6\nWishing they were dead !! 2\nEmbarrassment !! ! ! ! 5\nFeeling isolated !! ! 3\nHopelessness !! 2\nFrustration ! ! 2\nFeeling inadequate ! 1\nFeeling like a burden ! 1\nActivities Sexual functioning !!! ! 4\nWork !!! ! !! ! ! ! 9\nMobility !! ! 3\nChildcare !! 2\nDomestic chores !! ! 3\nCatch transport/cycling etc. ! ! 2\nWork agitates condition !! ! 3\nSelf-care ! ! 2\nSleep ! 1\nParticipation Marriageability !! !\nPersonal relationships !!! ! !! ! ! ! 9\nAttend social events !! ! ! ! ! ! 7\nAbility to go to school !! ! ! 4\nEnvironmental Teasing !! ! ! ! 5\nAvoided by others ! !!! 4\nLF reduced social status !! ! ! ! ! 6\nStigma within family ! !! ! ! 5\nStigma within community !!! ! !! ! ! ! 8\nPLOS Neglected Tropical Diseases | www.plosntds.org 2 September 2012 | Volume 6 | Issue 9 | e1768\nIn order to determine if current generic tools are suitable for\ndisability measurement within LF programs, this article aims to\nsummarize the reported issues of LF-related disability and review\ngeneric tools being used for LF measurement for relevance to these\nknown issues of LF disability.\nMethods\nA database search of MEDLINE, CINAHL, Scopus, and\nProQuest databases was conducted to identify disability measure-\nment tools that had been used to measure LF-related disability.\nKeywords used in the search (both separately and in Boolean\ncombination) included but was not limited to: ‘‘lymphatic filariasis,’’\n‘‘elephantiasis,’’ ‘‘lymphoedema,’’ ‘‘lymphocele,’’ ‘‘hydrocele,’’ ‘‘dis-\nability,’’ ‘‘rehabilitation,’’ ‘‘morbidity,’’ ‘‘evaluation,’’ ‘‘measure-\nment,’’ ‘‘assessment,’’ ‘‘monitoring,’’ ‘‘severity of illness,’’ ‘‘exami-\nnation,’’ and ‘‘health screening.’’ Grey literature was also reviewed.\nInclusion criteria were as follows: (a) the tools measured the\nexperience of disability from a patient perspective and (b) the tools\nmeasured the lived experience or impacts of LF-related disability\nrather than solely the physical or medical attributes of the disease.\nExclusion criteria were as follows: (a) tools that measured the\nclinicians’ perspective of disabilityrather than the patients’, (b) tools\nthat measured solely medical issues of LF-related disability rather\nthan the impact/experience of living with LF-related disability, and\n(c) survey instruments were specific to study rather than psycho-\nmetrically tested generic disability tools for generic disability\nmeasurement. From the search, 12 studies were identified that\nhad used generic disability measures, of which five were excluded as\nthey were non-standardized, self-developed research questionnaires\nrather than psychometrically tested generic disability instruments.\nThe questions included in each tool used for LF measurement\nwere reviewed against the key issues of LF-related disability as\nreported in the literature (see Table 1). These known issues are\ntaken from a previous critical review of the qualitative research\ninto the experiences of people living with LF-related disability\n[13]. Issues of LF-related disability were included in the review if\nthey were found to be central to the experience of LF-related\ndisability in two or more studies. Key issues that were only\nidentified within one study were not included in the review, as it\nwas hypothesized that these issues may have been relevant to the\ncontext of the single study, rather than a key issue of LF-related\ndisability within other regions/populations. Content analysis of\nthe key issues was then completed by the research team to\nidentify broad themes, referred to as ‘‘domains’’ within this study.\nFindings\nIssues of LF-Related Disability\nThe most commonly reported issues relevant to LF-related\ndisability were impact of LF on work (nine studies), stigma\nsurrounding LF within local communities (nine studies), impact\non personal relationships (nine studies), depression (seven studies),\nimpact of LF on social events (seven studies), feelings of shame/\nhumiliation experienced by LF patients (six studies), fear (six\nstudies), and reduced social status (six studies) (see Table 1). Least\ncommonly reported issues (reported in one study only) relevant to\nLF-related disability were feelings of inadequacy, feeling like a\nburden, sleeping problems, location of treatment, stigma within\nthe school system, access to appropriate foot-care, un-hygienic\nhome conditions, and un-hygienic work conditions.\nTable 1.Cont.\nDomains Issues\nAhorlu\n1999 [28]\nAhorlu\n2001 [29]\nBabu\n2009 [30]\nBandyopadhyay\n1996 [31]\nCoreil\n1998 [32]\nGyapong\n2000 [33]\nPerera\n2007 [34]\nPerson\n2006 [35]\nPerson\n2007 [36]\nPerson\n2008 [37]\nPerson\n2009 [38]\nSuma\n2003 [39] Total\nFamilies as carers !! ! 3\nChild generates income ! 1\nTreatment availability !! ! 3\nExpense of treatment !! ! 3\nLocation of treatment ! 1\nStigma within health system !! 2\nStigma within school system ! 1\nAppropriate foot care ! 1\nAccess to support groups !! ! 3\nHygienic home conditions ! 1\nHygienic work conditions ! 1\nPersonal Poverty !! ! ! 4\nEducation status !! ! 3\nPain !! ! ! ! 5\ndoi:10.1371/journal.pntd.0001768.t001\nPLOS Neglected Tropical Diseases | www.plosntds.org 3 September 2012 | Volume 6 | Issue 9 | e1768\nTable 2.Items of generic tools as they relate to domains and issues of LF-related disability.\nDomain Items 7D5L [40] DLQI [41] WHODAS II 36 [42] ICF Checklist [43] WHOQOL-100 [44] WHOQOL BREF [45]\nPsychological Depression Anxiety/depression item\nFeelings of shame/humiliation\nLow self-esteem/inferiority\nFeeling unattractive/poor body image Items 9, 30, 41 Item 11\nAbility to cope/strategies\nGrief/loss of former self\nFear\nEmbarrassment Item 2\nFeeling isolated Item 32\nFrustration\nGeneral items D6.5 Emotions &\nFlashcard #1\nb152 Emotions 26 negative feelings\n% of psychological domain covered 10% 10% 0% 0% 20% 10%\nDaily Activities Sexual functioning Item 9 Item D4.5 Item b640 Items 33, 34 Item 21\nWork Usual activity item Item 7 Items A5, D5.7–5.12,\nD5.14\nItem d850 Items 89–91 Item 18\nMobility Mobility item Items D2.1–D2.5 Items d4, b710,\nS720–s760\nItems 93–96 Item 15\nChildcare Usual activity item Item D5.1\nDomestic chores Usual activity item Item 3 Items D5.1–D5.6 Item d6\nCatch transport/cycling etc. Mobility item Item d470 Item 23 Item 25\nWork agitates condition\nSelf-care Self-care item Items D3.1–D3.4 Item d5\nGeneral items 12 routine activities 17 daily activities\n% of activity domain covered 75% 37.5% 75% 75% 50% 50%\nParticipation Personal relationships Social participation item Item 8 Items D4.1–D4.4 Items d7 (7 items) Items 44–45 Items 20,22\nAttend social events Social participation item Item 5 Items D6.1–D6.2 Item d910\nAbility to go to school Item 7 Items D7.5–D5.12 Item d820\n% of participation domain covered 66.60% 100% 100% 100% 33.30% 33.30%\nEnvironmental factors Teasing\nAvoided by others\nLF reduced social status Item e460\nStigma within family Item D6.3 Item e410\nStigma within community Item D6.3 Item e460\nFamilies as carers\nTreatment availability Item e580\nPLOS Neglected Tropical Diseases | www.plosntds.org 4 September 2012 | Volume 6 | Issue 9 | e1768\nDisability Measurement Tools Currently Used for LF\nMorbidity Measurement\nThree tools have been previously used to measure LF-related\ndisability: The seven domains five levels (7D5L) instrument, which\nis a seven-item, extended form of the European Quality of Life\nInstrument (EuroQol 5D3L) [14,15]; The Dermatology Life\nQuality Index (DLQI) [16–19], a 10-item tool designed to\nmeasure the impact of skin disease on quality of life (QOL); and\nThe ICF checklist [8], a multi-item checklist based on the WHO\nICF social model of health [8,20].\nAnother three tools have either been advocated for use in LF\nmeasurements or have been used for LF disability surveys but have\nnot been formally published [9]. These are the WHO Quality of\nLife tool (WHOQOL), a hundred-item QOL measurement\n[11,21]; the WHOQOL Bref [11,22], which is a shortened (26-\nitem) version of the WHOQOL tool; and the WHO Disability\nAssessment Schedule (WHODAS) [9,10,23], a 36-item disability\nmeasurement tool.\nRelevance of Generic Tools to LF-Related Disability Issues\nThe 34 issues reported by people living with LF-related\ndisability were compared against the items from each of the six\ndisability measurement tools (see Table 2). Some items within the\ntools measure broad concepts (i.e., ‘‘usual activity’’ item of the\n7D5L tool) that relate to a range of issues within the activity\ndomain (however did not specifically represent any of the separate\nissues). Of the 34 issues reported to be relevant for people living\nwith LF, 11 would not be identified by any of the current\nmeasurement tools (feelings of shame/humiliation, low self-\nesteem/feeling of inferiority, ability of cope, grief, fear, frustration,\nwork agitates condition, teasing by others, avoided by others,\nfamilies becoming carers, and lack of access to support groups).\nContent analysis revealed five broad domains that the issues\nencompassed. These were psychological impacts, impact on daily\nactivities, impact on participation, and the influence of environ-\nmental factors and personal factors. In total, the domains that\nwould most comprehensively be assessed by the tools items were\nfound to be daily activities (tools covered 37.5%–75% of issues),\nparticipation (tools covered 33%–100% of issues), and personal\nfactors (tools covered 33%–100% of issues). More poorly\nmeasured by the tools were psychological issues (tools covered\n0%–20% of issues) and environmental factors (tools covered 0%–\n60% of issues) relevant to LF-related disability.\nThe ICF checklist was found to have items that captured the\nmost issues (50%), followed by the WHODAS 36 (47%). However,\nneither of these tools included any items that would identify the 10\nspecific issues included within the psychological domain. The\nother tools had very few items that would identify issues related to\nLF disability: 7D5L (29%), WHO-QOL 100 (28%), DLQI (24%),\nand WHOQOL Bref (22%).\nDiscussion\nThe research that informs our knowledge of the impact of LF-\nrelated disability is limited and still emerging [13]. However, key\nissues of LF-related disability have been found across studies\nwithin multiple countries, suggesting that these issues are relevant\nand common to LF patients globally. The findings reveal that the\ngreatest number of issues/impacts of LF-related disability falls\nwithin the environmental and psychological domains—two areas\nof need where GPELF has failed to develop intervention strategies.\nWhilst the GPELF continues to identify prevention and alleviation\nof disability as a key second pillar of the program [24], there is\nlimited movement and financial support within the program to\nTable 2.Cont.\nDomain Items 7D5L [40] DLQI [41] WHODAS II 36 [42] ICF Checklist [43] WHOQOL-100 [44] WHOQOL BREF [45]\nExpense of treatment Item D6.6 Item e580\nStigma within health system Item e450\nAccess to support groups\nGeneral items Item D6.7 38 medical access, 44\nsupport from others\n% of environmental domain covered 0% 0% 30% 60% 10% 0%\nPersonal Poverty Item D6.6, D5.13 Item d870 Items 19, 47 Item 12\nEducation status Item A3 Item a5\nPain Pain/discomfort item Item 1 Flashcard #1 Item b280 Items 2, 25 Item 3\n% of personal domain covered 33.30% 33.30% 100% 100% 66.60% 66.60%\nTotal # of LF issues covered by tool 10 8 17 18 10 8\n% of LF issues covered by tool 29% 24% 47% 50% 28% 22%\ndoi:10.1371/journal.pntd.0001768.t002\nPLOS Neglected Tropical Diseases | www.plosntds.org 5 September 2012 | Volume 6 | Issue 9 | e1768\ndevelop substantial rehabilitation programmes that (a) support\nmental health and well-being, (b) minimize barriers from stigma\nthrough advocacy work, (c) provide adequate intervention for\nthose living with chronic LF to prevent further disease progression,\nand (d) assist in re-engagement with daily activities and life roles\nthat are important for patients both physically, mentally, and\nsocially.\nThis review identified that the tools currently being used to\nmeasure LF-related disability are inadequate. This review revealed\n34 issues across five domains that are consistently reported by\npeople living with LF-related disability. Of the six measurement\ntools (four generic, two specific) that have been used to measure\nLF-related disability, only one measurement tool (ICF Checklist\n[8]) included 50% of relevant issues, whilst others covered between\n22% and 47% of the known issues of LF-related disability. Hence,\ncurrent disability measurement tools used within the field fail to\nmeasure at least half of the known impacts of LF-related disability.\nImportantly, the majority of tools do not measure the most\ncommonly reported issues of LF-related disability. The most\ncommonly reported psychological issues, feelings of shame/\nhumiliation, low self-esteem, and fear are not measured by any\ntools. Likewise, the most commonly reported environmental issues\nare not well measured by the tools; teasing is not measured by any\ntool, whilst the impact on social status is captured by one tool and\nstigma within family and stigma within communities are measured\nwithin two tools. However, impact of LF on work and personal\nrelationships, two of the most commonly reported impacts of LF,\nare measured by all tools.\nWhilst generic disability tools have been developed to capture\nsocial and functional impacts of disease, the tools reviewed in this\narticle were inadequate to measure the majority of the known\nimpacts of LF. Indeed other authors have reported that generic\ntools often do not capture disease-specific aspects and are\ninsensitive to detecting key changes in patient status making them\npoor outcome measurement tools for disease-specific studies [25–\n27]. Generic tools, such as the ICF, WHOQOL, and WHODAS,\nwhilst useful for comparison studies between diseases, will not\neffectively measure the impacts of LF and outcomes of GPELF\nprograms. If they are the only tools used by public health planners\nto capture the impact of LF, they are likely to underestimate the\ntrue impacts of LF globally and be poor measures of the success of\nGPELF programs within LF endemic regions.\nConclusion\nThe ability to measure LF disability progression and the impact\nof interventions over time in a standardized manner is essential for\nthe GPELF. The development of an LF-specific disability\nassessment tool, relevant for LF impact and the contexts and\ncultures of LF endemic areas, is vital for accurate GPELF\nreporting and measurement. A focus on the second pillar of the\nGPELF program, morbidity management, is increasingly required\nas MDA programs finish. Valid and reliable information about\npatient and community needs and the measurement of outcomes\nof the second pillar of the GPELF program are required to ensure\nbest management for the prevention and alleviation of LF-related\ndisability.\nReferences\n1. Streit T, Lafontant JG (2008) Eliminating lymphatic filariasis: a view from the\nfield. Ann N Y Acad Sci 1136: 53–63.\n2. World Health Organization (2010) WHO global programme to eliminate\nlymphatic filariasis progress report for 2000–2009 and strategic plan 2010–2020.\nGeneva: World Health Organization.\n3. World Health Organization (1992) Informal consultation on evaluation of\nmorbidity in lymphatic filariasis. Document WHO/TDR/FIL/923. Geneva:\nWorld Health Organization.\n4. Melrose W (2002) Lymphatic filariasis: new insights into an old disease.\nInt J Parasitol 32: 947–960.\n5. Dreyer G, Addiss D, Dreyer P, Noroes J (2002) Basic lymphoedema\nmanagement: treatment and prevetion of problems associated with lymphatic\nfilariasis. Hollis, NH: Hollis Publishing.\n6. Mont D (2007) Measuring health and disability. Lancet 369: 1658–1663.\n7. World Health Organization, World Bank (2011) World report on disability.\nMalta: World Health Organization.\n8. World Health Organisation (2003) Global programme to eliminate lymphatic\nfilariasis annual report on lymphatic filariasis 2003. Geneva: World Health\nOrganization.\n9. Geyer MJ, Brantus P, Macdonald J, Kelly N (2007) The working group on the\nintegration of wound-lymphedema management accross diseases in resource\npoor settings: meeting report. Geneva: Handicap International.\n10. Girois S, Brantus P, Mackenzie C (2007) Lymphatic filariasis disability\nprevention for field managers. Ghana: Noguchi Institute.\n11. Kumari AK, Krishnamoorthy K, Harichandrakumar K, Das L (2007) Health\nrelated quality of life, an appropriate indicator to assess the impact of morbidity\nmanagement and disability prevention activities towards elimination of\nlymphatic filariasis. Filaria J 6: 8.\n5 Key Papers in the Field\n1. Kumari AK, Krishnamoorthy K, Harichandrakumar K, Das L\n(2007) Health Related Quality of Life, an appropriate\nindicator to assess the impact of morbidity management\nand disability prevention activities towards elimination of\nlymphatic filariasis. Filaria J 6: 8.\n2. Babu B, Nayak A, Rath K, Kerketta A (2006) Use of the\ndermatology quality of life index in filarial lymphoedema\npatients. Trans Roy Soc Trop Med Hyg 100: 258–263.\n3. Chandrasena T, Premaratna R, Muthugala M, Pathmes-\nwaran A, de Silva N (2007) Modified Dermatology Life\nQuality Index as a measure of quality of life in patients\nwith filarial lymphoedema. Trans Roy Soc Trop Med Hyg\n101: 245–249.\n4. Harichandrakumar K, Krishnamoorthy K, Kumari A, Das L\n(2006) Health status of lymphatic filariasis assessed from\npatients using seven domains five levels (7D5L) instru-\nment. Acta Trop 99: 137–143.\n5. McPherson T (2003) Impact on the quality of life of\nlymphoedema patients following introduction of a\nhygiene and skin care regimen in a Guyanese community\nendemic for lymphatic filariasis: a preliminary clinical\nintervention study. Filaria J 2: 1.\nKey Learning Points\n1. Current generic disability measurement tools used within\nthe LF field fail to adequately measure the known\nimpacts of LF-related disability.\n2. In particular, current tools fail to adequately measure\npsychological and environmental factors relevant to the\nlived experience of LF-related disability.\n3. There remains a need for an LF-specific quality of life/\ndisability measurement tool to be developed to ade-\nquately measure the impact of LF-related disability for\nindividuals and communities.\nPLOS Neglected Tropical Diseases | www.plosntds.org 6 September 2012 | Volume 6 | Issue 9 | e1768\n12. Krishna Kumari A, Krishnamoorthy K, Harichandrakumar K, Das L (2007)\nHealth related quality of life, and appropriate indicator to assess the impact of\nmorbidity management and disability prevention activities towards elimination\nof lymphatic filariasis. Filaria J 6: 8.\n13. Zeldenryk LM, Gray M, Speare R, Gordon S, Melrose W (2011) The emerging\nstory of disability associated with lymphatic filariasis: a critical review. PLoS\nNegl Trop Dis 5: e1366. doi:10.1371/journal.pntd.0001366\n14. Harichandrakumar K, Krishnamoorthy K, Kumari A, Das L (2006) Health\nstatus of lymphatic filariasis assessed from patients using seven domains five\nlevels (7D5L) instrument. Acta Trop 99: 137–143.\n15. Krishna Kumari A, Harichandrakumar K, Das L, Krishnamoorthy K (2005)\nPhysical and psychosocial burden due to lymphatic filariasis as perceived by\npatients and medical experts. Trop Med Int Health 10: 567–573.\n16. Chandrasena T, Premaratna R, Muthugala M, Pathmeswaran A, de Silva N\n(2007) Modified Dermatology Life Quality Index as a measure of quality of life\nin patients with filarial lymphoedema. Trans Roy Soc Trop Med Hyg 101: 245–\n249.\n17. Babu B, Nayak A, Rath K, Kerketta A (2006) Use of the dermatology quality of\nlife index in filarial lymphoedema patients. Trans Roy Soc Trop Med Hyg 100:\n258–263.\n18. McPherson T (2003) Impact on the quality of life of lymphoedema patients\nfollowing introduction of a hygiene and skin care regimen in a Guyanese\ncommunity endemic for lymphatic filariasis: a preliminary clinical intervention\nstudy. Filaria J 2: 1.\n19. Yahathugoda T, Wickramasinghe D, Weerasooriya M, Samarawickrama W\n(2005) Lymphoedema and its management in cases of lymphatic filariasis: the\ncurrent situation in three suburbs of Matara, Sri Lanka, before the introduction\nof a morbidity-control programme. Ann Trop Med Parasitol 99: 501–510.\n20. World Health Organisation (2002) Towards a common language for\nfunctioning, disability and health: ICF international classification of functioning,\ndisabilty and health. Geneva: World Health Organization.\n21. TheWHOQOL Group (1998) The World Health Organization quality of life\nassessment (WHOQOL): development and general psychometric properties. Soc\nSci Med 46: 1569–1585.\n22. Skevington SM, Lotfy M, O’Connell KA (2004) The World Health\nOrganization’s WHOQOL-BREF quality of life assessment: psychometric\nproperties and results of the international field trial. A report from the\nWHOQOL group. Qual Life Res 13: 299–310.\n23. World Health Organization (2000) World Health Organization disability\nassessment schedule WHODAS II: phase 2 field trials health services research\n36-item interviewer administered. Geneva: World Health Organization.\n24. World Health Organization (2012) Lymphatic filariasis policy–global pro-\ngramme to eliminate lymphatic filariasis. Geneva: World Health Organization\n25. Fayers PM, Machin D (2007) Quality of life: the assessment, analysis and\ninterpretation of patient-reported outcomes. West Sussex: John Wiley & Sons.\n26. Streiner DL, Norman GR (2008) Health Measurement Scales: a practical guide\nto their development and use. Oxford: Oxford University Press.\n27. Bradley C, Todd C, Gorton T, Symonds E, Martin A, et al. (1999) The\ndevelopment of an individualized questionnaire measure of percieved impact of\ndiabetes on quality of life: the ADDQoL. Qual Life Res 8: 79–91.\n28. Ahorlu C, Dunyo S, Koram K, Nkrumah F, Aagaard-Hansen J, et al. (1999)\nLymphatic filariasis related perceptions and practices on the coast of Ghana:\nimplications for prevention and control. Acta Trop 73: 251–264.\n29. Ahorlu CK, Dunyo SK, Asamoah G, Simonsen PE (2001) Consequences of\nhydrocele and the benefits of hydrocelectomy: a qualitative study in lymphatic\nfilariasis endemic communities on the coast of Ghana. Acta Tropica 80: 215–\n221.\n30. Babu BV, Mishra S, Nayak AN (2009) Marriage, sex, and hydrocele: an\nethnographic study on the effect of filarial hydrocele on conjugal life and\nmarriageability from Orissa, India. PLoS Negl Trop Dis 3: e414. doi:10.1371/\njournal.pntd.0000414\n31. Bandyopadhyay L (1996) Lymphatic filariasis and the women of India. Soc Sci\nMed 42: 1401–1410.\n32. Coreil J, Mayard G, Louis-Charles J, Addiss D (1998) Filarial elephantiasis\namong Haitian women: social context and behavioural factors in treatment.\nTrop Med Int Health 3: 467–473.\n33. Gyapong M, Gyapong J, Weiss M, Tanner M (2000) The burden of hydrocele\non men in Northern Ghana. Acta Tropica 77: 287–294.\n34. Perera M, Whitehead M, Molyneux D, Weerasooriya M, Gunatilleke G (2007)\nNeglected patients with a neglected disease? a qualitative study of lymphatic\nfilariasis. PLoS Negl Trop Dis 1: e128. doi:10.1371/journal.pntd.0000128\n35. Person B, Addiss D, Bartholomew LK, Meijer C, Pou V, et al. (2006) Health-\nseeking behaviors and self-care practices of Dominican women with lymphoe-\ndema of the leg: implications for lymphoedema management programs. Filaria J\n5: 13.\n36. Person B, Bartholomew LK, Addiss D, van den Borne B (2007) Disrupted social\nconnectedness among Dominican women with chronic filarial lymphedema.\nPatient Educ Couns 68: 279–286.\n37. Person B, Addiss D, Bartholomew LK, Meijer C, Pou V, et al. (2008) Can it be\nthat god does not remember me? A qualitative study on the psychological\ndistress, suffering, and coping of Dominican women with chronic filarial\nlymphedema and elephantiasis of the leg. Health Care Women Int 29: 349–365.\n38. Person B, Bartholomew LK, Gyapong M, Addiss DG, van den Borne B (2009)\nHealth-related stigma among women with lymphatic filariasis from the\nDominican Republic and Ghana. Soc Sci Med 68: 30–38.\n39. Suma T, Shenoy R, Kumaraswami V (2003) A qualitative study of the\nperceptions, practices and socio-psychological suffering related to chronic\nbrugian filariasis in Kerala, southern India. Ann Trop Med Parasitol 97: 839–\n845.\n40. Harichandrakumar KT, Krishnamoorthy K, Kumari AK, Das LK (2006)\nHealth status of lymphatic filariasis assessed from patients using seven domains\nfive levels (7D5L) instrument. Acta Tropica 99: 137–143.\n41. Finlay A, Khan G (1992) Dermatology Life Quality Index. Cardiff University\nDepartment of Dermatology. Available: http://www.dermatology.org.uk. Ac-\ncessed 27 2012.\n42. World Health Organization (2010) WHODAS 2.0 36-item version, interviewer\nadministered. Geneva: World Health Organization.\n43. World Health Organization (2003) ICF checklist: version 2.1a, clinician form for\ninternational classification of functioning, disability and health. Geneva: World\nHealth Organization\n44. World Health Organization (1998) WHOQOL user manual. Division of mental\nhealth and prevention of substance abuse. Geneva: World Health Organization.\n45. World Health Organization (2003) The World Health Organization Quality of\nLife (WHOQOL)-BREF. Division of Mental health and Prevention of\nSubstance Abuse. Geneva: World Health Organization.\nPLOS Neglected Tropical Diseases | www.plosntds.org 7 September 2012 | Volume 6 | Issue 9 | e1768",
  "topic": "Lymphatic filariasis",
  "concepts": [
    {
      "name": "Lymphatic filariasis",
      "score": 0.91074538230896
    },
    {
      "name": "Neglected tropical diseases",
      "score": 0.5893383622169495
    },
    {
      "name": "Physical disability",
      "score": 0.5699108839035034
    },
    {
      "name": "Medical model of disability",
      "score": 0.5458555221557617
    },
    {
      "name": "Medicine",
      "score": 0.5141130089759827
    },
    {
      "name": "Intellectual disability",
      "score": 0.45314085483551025
    },
    {
      "name": "Gerontology",
      "score": 0.3478066325187683
    },
    {
      "name": "Filariasis",
      "score": 0.32092833518981934
    },
    {
      "name": "Physical therapy",
      "score": 0.24064144492149353
    },
    {
      "name": "Pathology",
      "score": 0.19121748208999634
    },
    {
      "name": "Public health",
      "score": 0.12134766578674316
    },
    {
      "name": "Psychiatry",
      "score": 0.10839760303497314
    },
    {
      "name": "Immunology",
      "score": 0.07451501488685608
    },
    {
      "name": "Helminths",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I86467917",
      "name": "James Cook University",
      "country": "AU"
    },
    {
      "id": "https://openalex.org/I174025329",
      "name": "University of the Sunshine Coast",
      "country": "AU"
    }
  ]
}