{
  "title": "GenomicScape: An Easy-to-Use Web Tool for Gene Expression Data Analysis. Application to Investigate the Molecular Events in the Differentiation of B Cells into Plasma Cells",
  "url": "https://openalex.org/W2018822911",
  "year": 2015,
  "authors": [
    {
      "id": "https://openalex.org/A5064971178",
      "name": "Alboukadel Kassambara",
      "affiliations": [
        "Centre Hospitalier Universitaire de Montpellier",
        "Inserm"
      ]
    },
    {
      "id": "https://openalex.org/A5105779380",
      "name": "Thierry Rème",
      "affiliations": [
        "Centre Hospitalier Universitaire de Montpellier",
        "Inserm"
      ]
    },
    {
      "id": "https://openalex.org/A5113585802",
      "name": "Michel Jourdan",
      "affiliations": [
        "Inserm"
      ]
    },
    {
      "id": "https://openalex.org/A5067324677",
      "name": "Thierry Fest",
      "affiliations": [
        "Inserm"
      ]
    },
    {
      "id": "https://openalex.org/A5007067641",
      "name": "Dirk Hose",
      "affiliations": [
        "Heidelberg University",
        "National Center for Tumor Diseases",
        "University Hospital Heidelberg"
      ]
    },
    {
      "id": "https://openalex.org/A5015523345",
      "name": "Karin Tarte",
      "affiliations": [
        "Inserm"
      ]
    },
    {
      "id": "https://openalex.org/A5113616826",
      "name": "Bernard Klein",
      "affiliations": [
        "Centre Hospitalier Universitaire de Montpellier",
        "Inserm",
        "Université de Montpellier"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2095109339",
    "https://openalex.org/W2120095131",
    "https://openalex.org/W2052360985",
    "https://openalex.org/W1835395435",
    "https://openalex.org/W2170136419",
    "https://openalex.org/W1508120038",
    "https://openalex.org/W2084409347",
    "https://openalex.org/W2156221438",
    "https://openalex.org/W2133322087",
    "https://openalex.org/W1996645740",
    "https://openalex.org/W2130528267"
  ],
  "abstract": "DNA microarrays have considerably helped to improve the understanding of biological processes and diseases. Large amounts of publicly available microarray data are accumulating, but are poorly exploited due to a lack of easy-to-use bioinformatics resources. The aim of this study is to build a free and convenient data-mining web site (www.genomicscape.com). GenomicScape allows mining dataset from various microarray platforms, identifying genes differentially expressed between populations, clustering populations, visualizing expression profiles of large sets of genes, and exporting results and figures. We show how easily GenomicScape makes it possible to construct a molecular atlas of the B cell differentiation using publicly available transcriptome data of naïve B cells, centroblasts, centrocytes, memory B cells, preplasmablasts, plasmablasts, early plasma cells and bone marrow plasma cells. Genes overexpressed in each population and the pathways encoded by these genes are provided as well as how the populations cluster together. All the analyses, tables and figures can be easily done and exported using GenomicScape and this B cell to plasma cell atlas is freely available online. Beyond this B cell to plasma cell atlas, the molecular characteristics of any biological process can be easily and freely investigated by uploading the corresponding transcriptome files into GenomicScape.",
  "full_text": "RESEARCH ARTICLE\nGenomicScape: An Easy-to-Use Web Tool for\nGene Expression Data Analysis. Application\nto Investigate the Molecular Events in the\nDifferentiation of B Cells into Plasma Cells\nAlboukadel Kassambara1,2, Thierry Rème1,2, Michel Jourdan1, Thierry Fest3, Dirk Hose4,\nKarin Tarte3, Bernard Klein1,2,5*\n1 U1040, INSERM, Montpellier, France,2 Department of Biological Hematology, CHU Montpellier,\nMontpellier, France,3 U917, INSERM, Rennes, France,4 Medizinische Klinik V, Universitätsklinikum\nHeidelberg and Nationales Centrum für Tumorerkrankungen, Heidelberg, Germany,5 UFR Médecine,\nUniversité MONTPELLIER 1, Montpellier, France\n* bernard.klein@inserm.fr\nAbstract\nDNA microarrays have considerably helped to improve the understanding of biological pro-\ncesses and diseases. Large amounts of publicly available microarray data are accumulat-\ning, but are poorly exploited due to a lack of easy-to-use bioinformatics resources. The aim\nof this study is to build a free and convenient data-mining web site (www.genomicscape.\ncom). GenomicScape allows mining dataset from various microarray platforms, identifying\ngenes differentially expressed between populations, clustering populations, visualizing ex-\npression profiles of large sets of genes, and exporting results and figures. We show how\neasily GenomicScape makes it possible to construct a molecular atlas of the B cell differen-\ntiation using publicly available transcriptome data of naïve B cells, centroblasts, centro-\ncytes, memory B cells, preplasmablasts, plasmablasts, early plasma cells and bone\nmarrow plasma cells. Genes overexpressed in each population and the pathways encoded\nby these genes are provided as well as how the populations cluster together. All the analy-\nses, tables and figures can be easily done and exported using GenomicScape and this\nB cell to plasma cell atlas is freely available online. Beyond this B cell to plasma cell atlas,\nthe molecular characteristics of any biological process can be easily and freely investigated\nby uploading the corresponding transcriptome files into GenomicScape.\nAuthor Summary\nThe use of DNA microarrays has emerged as a powerful tool for biomedical research to\nunderstand complex biological processes and diseases, generating large amounts of public-\nly available data. Most of these data remain unused by scientific community due to the\nlack of easy-to-use bioinformatics resources to analyze them. Here we present GenomicS-\ncape (www.genomicscape.com), a free online data-mining platform to identify quickly\nPLOS Computational Biology | DOI:10.1371/journal.pcbi.1004077 January 29, 2015 1 / 10\na11111\nOPEN ACCESS\nCitation: Kassambara A, Rème T, Jourdan M, Fest T,\nHose D, Tarte K, et al. (2015) GenomicScape: An\nEasy-to-Use Web Tool for Gene Expression Data\nAnalysis. Application to Investigate the Molecular\nEvents in the Differentiation of B Cells into Plasma\nCells. PLoS Comput Biol 11(1): e1004077.\ndoi:10.1371/journal.pcbi.1004077\nEditor: Satoru Miyano, University of Tokyo, JAPAN\nReceived: September 15, 2014\nAccepted: December 7, 2014\nPublished: January 29, 2015\nCopyright: © 2015 Kassambara et al. This is an\nopen access article distributed under the terms of the\nCreative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any\nmedium, provided the original author and source are\ncredited.\nData Availability Statement:All relevant data are\nwithin the paper and its Supporting Information files.\nFunding: This work was supported by grants from\nUniversity Hospital of Montpellier (CEP-IRB), from\nARC (SL220110603450, Paris France), and the\nEuropean Community (FP7-OVERMYR). The\nfunders had no role in study design, data collection\nand analysis, decision to publish, or preparation of\nthe manuscript.\nCompeting Interests:The authors have declared\nthat no competing interests exist.\nmolecular changes during any biological process. As an example, we used GenomicScape\nto build a comprehensive and accessible molecular atlas of human B cell differentiation,\nwhich will be of great interest for immunologists to further understand normal and malig-\nnant B cell differentiation.\nIntroduction\nGenome-wide expression profile analysis with DNA microarrays has emerged as a powerful\ntool for biomedical research generating a huge amount of publicly available data. Unfortunate-\nly, the majority of these data are poorly used due to the lack of easy-to-use and open access bio-\ninformatics tools to extract and visualize the most prominent information. Although statistical\nprogramming frameworks like R and Bioconductor projects provide free bioinformatics pack-\nages to analyze the data, they are difficult to use for untrained biologists or physicians, which\nlimits the investigation of the large amounts of publicly available data. Based on our long-\nlasting experience of mining high throughput data to explore the biology of normal and malig-\nnant plasma cells [1–5], we have developed the current easy-to-use GenomicScape web tool\n(www.genomicscape.com), which allows to quickly analyze the molecular changes during a bi-\nological process such as cell differentiation or disease progression. As an illustration, we report\nhere, the molecular portrait of human B cell differentiation using GenomicScape. The knowl-\nedge of the differentiation of B cells into plasma cells (PCs) has greatly improved, mostly using\nanimal models [6], but this process is less known in humans because of the difficulty to access\nlymphoid organs and to mimic in vitro this in-vivo process involving multistep cell trafficking,\ncell interactions and activations. In this study, we took advantage of our previous works about\ngerminal center (GC) B cells and plasma cells [3, 5, 7, 8] with the generation of publicly avail-\nable transcriptome data of human naïve B cells (NBCs), centroblasts (CBs), centrocytes (CCs),\nmemory B cells (MBCs), preplasmablasts (prePBs), plasmablasts (PBs), early plasma cells\n(EPCs) and bone marrow plasma cells (BMPCs). We show here how Genomicscape allows eas-\nily building an open access Atlas of the gene expression profiles of human naïve B cells to ma-\nture plasma cells, without any knowledge in bioinformatics. Additionally, all the analyses and\nfigures of the manuscript can be prepared easily using GenomicScape. The current analysis\nand web atlas creation can be extended to any biological process given high throughput micro-\narray data are uploaded into GenomicScape.\nResults\nSupervised analysis of the gene expression profiling of naïve B cells,\ncentroblasts, centrocytes, memory B cells, preplasmablasts,\nplasmablasts, early plasma cells, and mature plasma cells\nPublicly available gene expression data of the 8 B cell to plasma cell populations were GCRMA\nnormalized and grouped in a“Human B cells to plasma cells GCRMA” GenomicScape file avail-\nable athttp://www.genomicscape.com/microarray/browsedata.php?acc=GS-DT-2.R u n n i n g\na SAM analysis using GenomicScape SAM tool (seeS1 File) and starting from 10000 unique\ngenes with the highest standard deviation (SD), 9303 unique genes were differentially expressed\nbetween the 8 B cell to plasma cell populations (SAM multiclass analysis, unpaired Wilcoxon\nstatistics, fold change/C212, 300 permutations, FDR = 0%). When different probe sets interrogated\na same gene, the probe set with the highest standard deviation (SD) was selected. The list of\n9303 genes is available athttp://www.genomicscape.com/microarray/nbtopc.phpand in\nAn Easy-to-Use Web Tool for Gene Expression Data Analysis\nPLOS Computational Biology | DOI:10.1371/journal.pcbi.1004077 January 29, 2015 2 / 10\nS1 Table. Of these 9303 genes, 1740 have a SAM contrast higher in NBCs compared to the other\nremaining populations, 1049 in CBs, 990 in CCs, 1384 in MBCs, 1969 in PrePBs, 618 in PBs,\n808 in EPCs, and 745 in BMPCs. A heatmap of the top10 genes with the highest SAM contrast\nin each population is shown inFig. 1. These gene lists specific for a population can be obtained\nonline athttp://www.genomicscape.com/microarray/nbtopc.phpby clicking the cell population\npicture in the associated scheme or the name of the population below the web table. This SAM\nmulticlass supervised analysis identifies some genes, which are overexpressed in 2 or more popu-\nlations (Fig. 1). Genes of the 9303 gene list, which are differentially expressed between 2 popula-\ntions, can be identified with the“SAM” tool (http://genomicscape.com/microarray/webSam.\nphp). The method is explained inS1 Fileand S1 Fig. displays the top 20 genes differentially ex-\npressed between NBCs and MBCs, CBs and CCs, prePBs and PBs, PBs and EPCs and EPCs and\nBMPCs. The detailed gene lists can be computed easily followingS1 File. The molecular path-\nways encoded by the 9303 differentially expressed genes were analyzed with Reactome functional\ninteraction cytoscape plugin (S2 Table) and the top pathways are shown inFig. 2.P a t h w a y se n -\nriched in NBCs are T cell receptor signaling pathway, toll-like receptors cascades and BCR sig-\nnalling pathway; in CBs cell cycle, signaling by Aurora kinases and FOXM1 transcription factor\nnetwork; in CCs mitochondrial protein import and BCR signaling pathway; in MBCs TCR\nsignaling and TGF-β; in PrePBs DNA replication, DNA repair and metabolism; in PBs protein\nFig 1. Heatmap of the top10 genes overexpressed in each of the 8 B cell to plasma cell\nsubpopulations. The names of the top10 genes overexpressed in each cell population compared to the\nothers are indicated on the right. Each population is highlighted by a color assigned by default by\nGenomicScape. The red and blue colors on the heatmap indicate over-expressed and under-expressed\ngenes respectively and the color intensity specifies the expression level.\ndoi:10.1371/journal.pcbi.1004077.g001\nAn Easy-to-Use Web Tool for Gene Expression Data Analysis\nPLOS Computational Biology | DOI:10.1371/journal.pcbi.1004077 January 29, 2015 3 / 10\nprocessing and export, and N-Glycan biosynthesis; in EPCs class I MHC mediated antigen pro-\ncessing and presentation, and interferon alpha/beta signaling; and in BMPCs beta1 integrin cell\nsurface interactions and extracellular matrix organization proteins (Fig. 2and S2 Table).\nPrincipal component analysis of genes differentially expressed\nbetween naïve B cells, centroblasts, centrocytes, memory B cells,\npreplasmablasts, plasmablasts, early plasma cells, and mature\nplasma cells\nUsing these 9303 unique genes, a principal component analysis (PCA), performed with Geno-\nmicScape PCA tool (S1 File), classifies the 8 populations into 8 distinct groups.Fig. 3shows the\n3D visualization of this PCA, in which each sample is plotted in the space formed by the first\n3 principal components. Actually, the 8 populations can be grouped into 5 major clusters:\na B-cell cluster including NBCs and MBCs, a GC cluster comprising CBs and CCs, a PB cluster\nformed by PBs and EPCs, a PrePB cluster including only PrePBs located between the GC and\nPB clusters, and a mature PC cluster grouping BMPCs. In order to identify genes driving the\ntransition between 2 clusters of cell populations, a SAM analysis (unpaired Wilcoxon statistics,\nfold change/C212, 300 permutations, FDR = 0%) was performed after merging the cell popula-\ntions belonging to a same PCA cluster. The merging of the populations was done with Geno-\nmicScape (S1 File) and the top100 genes driving the transition between two clusters are listed\nin S3 Table. A majority of the top100 genes differentially expressed between BC and GC clus-\nters encodes for proteins involved in cell cycle includingCCNB1, CDK1, AURKA, BIRC5,\nCDC20, ZWINT, TYMS, CCNB2, KIF2Cand BUB1. Genes coding for cell communication sig-\nnals includingEMP1, TNFRSF1B, CD226, IGF1, IL2RA, PDGFRA, VEGFAand TNFRSF8 drive\nthe transition from the GC to the PrePB clusters. The transition from the PrePB to the PB clus-\nters is positively correlated with genes coding for cell communication signals (ITGA6, CD38,\nSDC1, PECAM1, TNFSF8, CAV1and COL24A1) and negatively with genes coding cell cycle\nand DNA replication (POLE2, ORC1, CDC45, MCM10, MCM4and CDCA7)( S3 Table). Genes\nFig 2. Molecular pathways enriched in the 8 B cell to plasma cell subpopulations.The molecular\npathways encoded by the 9303 genes differentially expressed between the 8 cell populations were analyzed\nwith Reactome software and the 2-3 most significant pathways for each population shown.\ndoi:10.1371/journal.pcbi.1004077.g002\nAn Easy-to-Use Web Tool for Gene Expression Data Analysis\nPLOS Computational Biology | DOI:10.1371/journal.pcbi.1004077 January 29, 2015 4 / 10\ncoding for transcription factors and cell communication signals (KLF4, CXCL12, ITGA8,\nVCAM1, SULF2and IGFBP7) drive the transition of the PB to PC clusters.\nVisualization of genes differentially expressed between the 8 B cell and\nplasma cell populations\nA limitation of large lists of genes is the extraction of the prominent information. GenomicS-\ncape makes it easy to visualize the expression of set of genes (up to 10000) in the 8 B and plas-\nma cell populations and to export the figures (seeS1 File). This is illustrated inFig. 4, which\nprovides the expression of genes coding for remarkable B cell (CD19, CD20, CD22, CD24,\nCD83, HLA-DR, CXCR5, CCR7) or plasma cell surface markers (CD38, CD31, CD138, ITGA4,\nITGA8, ICAM2, CCR2, CCR10), and inFig. 5showing the expression of genes coding for\ntranscription factors controlling B cell or plasma cell identities (PAX5, BCL6, EBF1, IRF8,\nBACH2, CIITA, SPIB, LMO2, ID3, PRDM4, ETS1, MAFK, IRF4, PRDM1/BLIMP1, XBP1). In\naddition, GenomicScape makes it possible to easily determine genes coexpressed with a given\ngene (S1 File) and provides links with the usual bioinformatics databases, Reactome, and\nGene ontology.\nFig 3. Principal component analysis of the gene expression profiles of the 8 B cell to plasma cell\nsubpopulations. Using SAM multiclass analysis, 9303 unique genes were significantly differentially\nexpressed between the 8 cell populations (fold change/C212 and FDR = 0%). These genes classified the\n8 populations into 8 distinct groups using principal component analysis and these 8 populations could be\ngrouped into 5 major clusters: a B-cell cluster including NBCs and MBCs, a GC cluster CBs and CCs, a PB\ncluster PBs, EPCs, a PrePB cluster including PrePBs only being located between GC and PB clusters, and\na mature PC cluster comprising BMPCs. The figure is the 3D plotting of the samples along the first 3 principal\ncomponents accounting for 36.1%, 25.7% and 14% of the variance respectively. The 5 clusters comprising\nthe populations are shown by colored clouds.\ndoi:10.1371/journal.pcbi.1004077.g003\nAn Easy-to-Use Web Tool for Gene Expression Data Analysis\nPLOS Computational Biology | DOI:10.1371/journal.pcbi.1004077 January 29, 2015 5 / 10\nDiscussion\nThe aim of this study is to provide a free and convenient data-mining web site, which makes it\npossible to build a molecular atlas of the B cell differentiation (http://genomicscape.com/\nmicroarray/nbtopc.php) using publicly available transcriptome data of naïve B cells, centro-\nblasts, centrocytes, memory B cells, preplasmablasts, plasmablasts, early plasma cells and bone\nmarrow plasma cells without any knowledge in bioinformatics. Such an extensive description\nof the molecular portrait of the human B cell to plasma cell differentiation has not been re-\nported yet. 9303 unique genes are differentially expressed between the 8 populations of human\nB cells to plasma cells differentiation using a SAM supervised analysis. Using principal compo-\nnent analysis, the 8 populations can be grouped into five major clusters: a B-cell cluster (NBCs\nand MBCs), a Germinal Center cluster (CBs and CCs), a Preplasmablast cluster (prePBs), a\nPlasmablast cluster (PBs, EPCs) and a mature plasma cell cluster (BMPCs).\nFig 4. Visualization of genes coding for B cell or plasma cell surface markers.Gene expression was assayed using Affymetrix U133 plus 2.0\nmicroarrays and data are the unlogged GCRMA-normalized expression signal of each gene in the 8 B cell to plasma cell populations. Data are the\nexpression profiles of genes coding for B cell or plasma cell surface markers obtained with GenomicScape (seeS1 File)\ndoi:10.1371/journal.pcbi.1004077.g004\nAn Easy-to-Use Web Tool for Gene Expression Data Analysis\nPLOS Computational Biology | DOI:10.1371/journal.pcbi.1004077 January 29, 2015 6 / 10\nMost of the genes whose expression positively drives the transition from B-cell to Germinal Cen-\nter clusters are genes coding for proteins implicated in cell cycle (CCNB1, CDK1, AURKA, BIRC5,\nCDC20, ZWINT, TYMS, CCNB2, KIF2Cand BUB1) as expected given the cell cycling status of CBs\nand CCs whereas NBCs and MBCs are quiescent. Expression of genes coding for proteins involved\nin cell communication signals (E M P 1 ,T N F R S F 1 B ,C D 2 2 6 ,I G F 1 ,I L 2 R A ,P D G F R A ,V E G F Aand\nTNFRSF8)drives the transition of the Germinal Centerto Preplasmablast clusters. The transition\nfrom PrePB to PB clusters is negatively correlated with the expression of genes coding for actors of\nDNA replication and cell cycle (ORC1, RFC3, DEPDC1B, CDC45, MCM4, MCM10and CDCA7),\nwhich is hardly surprising given the high proliferation rate in preplasmablasts compared to plasma-\nblasts [5]. PrePB to PB transition is positively correlated with the expression of genes coding for cell\ncommunication signals, immunoglobulin (Ig) synthesis, transport and metabolism. Genes coding\nfor PECAM1 (the ligand of the well-known plasma cell marker CD38) or for syndecan-1 were also\nfound. BMPCs form a distinct cluster compared to in vitro-generated PBs and EPCs, these last two\npopulations being tightly grouped in a PB cluster.Actually, in-vitro generated PBs and EPCs have\na phenotype close to that of peripheral blood PBs and early PCs, which have to home to bone\nFig 5. Visualization of the genes coding for B cell or plasma cell transcription factors.See the legend ofFig. 4. Data are the expression profiles of\ngenes coding for transcription factors controlling B cell or plasma cell identities obtained with GenomicScape.\ndoi:10.1371/journal.pcbi.1004077.g005\nAn Easy-to-Use Web Tool for Gene Expression Data Analysis\nPLOS Computational Biology | DOI:10.1371/journal.pcbi.1004077 January 29, 2015 7 / 10\nmarrow or mucosa to survive and further differentiate [3, 9] .B M P C sa r em a t u r eP C sa se v i d e n c e d\nby a high expression of genes encoding for cell transporters and metabolism, indicating a need to im-\nport a lot of nutrients and produce energy in order to synthetize high levels of Ig. They also overex-\npressed genes coding for cell communication signals in agreement with their close requirement of\nbone marrow environment to survive. This“Naïve B cell to Plasma cell” Atlas allows the user to\nquickly visualize online whether a given protein or pathway could be involved in the process of\nB cell to plasma cell differentiation. It should be useful for further understanding this differentiation,\nand in particular the abnormalities of these processes in B and plasma cell neoplasias. Of note, recent\nstudies have reported gene expression profiling of human plasma cells purified from the bone mar-\nrow or spleen or of in-vitro generated plasma cells using Affymetrix or Illumina microarray plat-\nforms [10, 11]. These publicly-available microarray data are available from GenomicScape, which\ncan mine microarray data from various platforms. The current analysis can be easily extended to\nthese other studies. In particular, the current genes differentially expressed between B and PC popu-\nlations could efficiently classify the B and PC plasma cell populations reported in the study by Cocco\net al. [10] using Illumina microarrays (seeS1 File). In summary, GenomicScape is a flexible and free\nplatform to easily extract biological informationfrom genome-wide gene expression data. Additional\ntools for microarray data mining can be implemented, using the same aim: speed and easiness.\nBesides the current atlas of the transcriptome of the B cell to plasma differentiation, GenomicScape\nshould be useful to stimulate the use of publicly available microarray data and lead to further under-\nstanding of normal and abnormal biological processes.\nMaterials and Methods\nOverview of GenomicScape\nGenomicScape (http://www.genomicscape.com) allows users to easily visualize and analyze\npublicly available gene expression data, and to explore the landscape of gene annotation re-\nsources for genes of interest. The goal of this ongoing effort is to make available public microar-\nray data and an easy-to-use web tool to quickly analyze them. To date, 50 publicly available\ngene/ncRNA expression datasets from over 5000 microarray experiments performed on differ-\nent cell types and obtained with Affymetrix, Illumina or Agilent platforms have been uploaded\ninto GenomicScape, which allows the user to readily extract information from these data. Stan-\ndard tools to mine microarray data have been implemented on GenomicScape and a user guide\nis provided inS1 File. Briefly, the“Expression/Coexpression Report” tool allows the user to\nsearch for a gene using name or other identifiers, to visualize its expression profile in cell\npopulations/tissues and to find genes whose expression in various samples are correlated to\nthat of a given gene. The SAM tool uses the Significance Analysis of Microarrays (SAM) algo-\nrithms to identify genes differentially expressed between groups of samples (http://statweb.\nstanford.edu/~tibs/SAM/). To get a quick overview of the biological value of these genes, their\nexpression and functional annotation can be visualized and exported by clicking their gene\nidentifier. A heat map of the expression values of top-ranked genes across different sample\ngroups can be generated and exported. The Principal Component Analysis (PCA) tool makes\nit possible to find how samples can group together using metric correlations, without making\nany assumption (unsupervised clustering). The PCA tool provides 2D and 3D visualizations of\nthe samples plotted along the first 2 or 3 principal components. Sample colors are assigned by\ndefault or can be chosen by the user and tables and figures can be exported.\nGenomicScape software architecture\nGenomicScape uses a MySQL database (version 5.1) for storing microarray data and gene an-\nnotations from usual databases (predominantly NCBI and Ensembl). The application core\nAn Easy-to-Use Web Tool for Gene Expression Data Analysis\nPLOS Computational Biology | DOI:10.1371/journal.pcbi.1004077 January 29, 2015 8 / 10\nfunctionality, was developed with PHP version 5.3 utilizing R (http://www.r-project.org/) and\nBioconductor (http://www.bioconductor.org/) scripts for data-mining. The web interface is im-\nplemented with PHPBOOST web framework and uses jQWidgets javascript library.\nCell populations and gene expression data\nPeripheral blood cells from healthy volunteers were purchased from the French Blood Center\n(Etablissement Français du Sang Pyrénnées Méditérannée, Toulouse, France). After removal of\nCD2+ cells using anti-CD2 magnetic beads (Invitrogen, Cergy Pontoise, France), CD19+CD27+\nMBCs and CD19+CD27- NBCs were sorted with a multicolor fluorescence FACSAria device\nwith a purity/C2195%. CBs, CCs and BMPCs were purified from tonsils or bone marrow of\nhuman individuals and phenotypically characterized as indicated [4, 12]. PrePBs, PBs, and EPCs\nwere generated using a 3-step in vitro model starting from peripheral blood MBCs as reported\n[3, 5]. Whole genome gene expression profiling (GEP) of purified NBCs, CBs, CCs, MBCs,\nPrePBs, PBs, EPCs and bone marrow PCs (BMPCs) were obtained using Affymetrix U133\n2.0 plus array (Affymetrix, Santa Clara, CA) in the Microarray platform of IRB (http://irb.\nmontp.inserm.fr/en/index.php?page=Plateau&IdEquipe=6) using the same methodologies for\nprobe amplification and microarray hybridization avoiding batch effect. GEP are publicly avail-\nable from GEO database (http://www.ncbi.nlm.nih.gov/geo/,C B sa n dC C s :G S E 1 5 2 7 1[4]) or\nfrom ArrayExpress database (http://www.ebi.ac.uk/arrayexpress/,B M P C s :E - M E X P - 2 3 6 0[12],\nNBCs, MBCs, PrePBs, PBs and EPCs: E-MTAB-1771, E-MEXP-2360 and E-MEXP-3034 [3, 5].\nData analysis\nThe publicly available data of these 8 B cell to plasma cell populations (38 samples) were nor-\nmalized using GCRMA algorithm. They were grouped in a“Human B cells to plasma cells\nGCRMA” file under GenomicScape accession number GS-DT-2 available athttp://www.\ngenomicscape.com/microarray/browsedata.php?acc=GS-DT-2. Genes whose expression is dif-\nferentially expressed between the 8 B cell to plasma cell populations were identified using Gen-\nomicScape SAM tool (http://genomicscape.com/microarray/webSam.php). The list of\ndifferentially expressed genes was used to perform a PCA analysis (http://genomicscape.com/\nmicroarray/pca.php). The molecular pathways, encoded by the genes differentially expressed\nbetween the naïve B cell to mature plasma cell subpopulations, were pointed out using reac-\ntome FI (Functional Interaction) cytoscape plugin (http://wiki.reactome.org/index.php/\nReactome_FI_Cytoscape_Plugin). Pathways significantly enriched in a given cell subpopula-\ntions with a FDR< 0.001 are selected.\nSupporting Information\nS1 File. User manual of GenomicScape.\n(DOCX)\nS1 Fig. Top 20 genes differentially expressed between NBCs and MBCs, CBs and CCs,\nprePBs and PBs, PBs and EPCs and EPCs and BMPCs.Data are the result of SAM analysis\n(two class unpaired, Wilcoxon test, FDR = 0, fold change/C21, permutation = 300).\n(PDF)\nS1 Table. Genes differentially expressed between naïve B cells (NBCs), centroblasts (CBs),\ncentrocytes (CCs), memory B cells (MBCs), preplasmablasts (PrePBs), plasmablasts (PBs),\nearly plasma cells (EPCs), and bone marrow plasma cell (BMPCs).Data are the SAM multi-\nclass expression contrasts of each gene in a given cell subpopulation compared to the others.\n(XLS)\nAn Easy-to-Use Web Tool for Gene Expression Data Analysis\nPLOS Computational Biology | DOI:10.1371/journal.pcbi.1004077 January 29, 2015 9 / 10\nS2 Table. Reactome molecular pathways overexpressed by each of the 8 B cell to plasma cell\nsubpopulations. The molecular pathways encoded by the 9303 differentially expressed genes\nwere analyzed with Reactome functional interaction cytoscape plugin. Pathways significantly\nenriched in a given cell subpopulations with a FDR< 0.001 are selected.\n(XLS)\nS3 Table. Genes driving the transition between 2 clusters of cell populations.In order to\nidentify genes driving the transition between 2 clusters of cell populations, a SAM analysis\n(unpaired Wilcoxon statistics, fold change/C212, 300 permutations, FDR = 0%) was performed\nafter merging the cell populations belonging to a same PCA cluster. The top100 genes driving\nthe transition between two clusters are listed.\n(XLS)\nAuthor Contributions\nConceived and designed the experiments: AK BK. Performed the experiments: AK MJ TF DH\nKT. Analyzed the data: TR. Wrote the paper: AK BK MJ TF KT.\nReferences\n1. Tarte K, Zhan F, De Vos J, Klein B, Shaughnessy J Jr. (2003) Gene expression profiling of plasma cells\nand plasmablasts: toward a better understanding of the late stages of B-cell differentiation. Blood 102:\n592–600. doi:10.1182/blood-2002-10-3161 PMID: 12663452\n2. Reme T, Hose D, De Vos J, Vassal A, Poulain PO, et al. (2008) A new method for class prediction\nbased on signed-rank algorithms applied to Affymetrix microarray experiments. BMC Bioinformatics 9:\n16. doi:10.1186/1471-2105-9-16 PMID: 18190711\n3. Jourdan M, Caraux A, De Vos J, Fiol G, Larroque M, et al. (2009) An in vitro model of differentiation of\nmemory B cells into plasmablasts and plasma cells including detailed phenotypic and molecular char-\nacterization. Blood 114: 5173–5181. doi:10.1182/blood-2009-07-235960 PMID: 19846886\n4. Caron G, Le Gallou S, Lamy T, Tarte K, Fest T (2009) CXCR4 expression functionally discriminates\ncentroblasts versus centrocytes within human germinal center B cells. J Immunol 182: 7595–7602.\ndoi: 10.4049/jimmunol.0804272 PMID: 19494283\n5. Jourdan M, Caraux A, Caron G, Robert N, Fiol G, et al. (2011) Characterization of a transitional preplas-\nmablast population in the process of human B cell to plasma cell differentiation. J Immunol 187:\n3931–3941. doi:10.4049/jimmunol.1101230 PMID: 21918187\n6. Shlomchik MJ, Weisel F (2012) Germinal center selection and the development of memory B and\nplasma cells. Immunol Rev 247: 52–63. doi:10.1111/j.1600-065X.2012.01124.x PMID: 22500831\n7. Caron G, Le Gallou S, Lamy T, Tarte K, Fest T (2009) CXCR4 Expression Functionally Discriminates\nCentroblasts versus Centrocytes within Human Germinal Center B Cells. J Immunol 182: 7595–7602.\ndoi: 10.4049/jimmunol.0804272 PMID: 19494283\n8. Jourdan M, Cren M, Robert N, Bollore K, Fest T, et al. (2014) IL-6 supports the generation of human\nlong-lived plasma cells in combination with either APRIL or stromal cell-soluble factors. Leukemia.\n9. Caraux A, Klein B, Paiva B, Bret C, Schmitz A, et al. (2010) Circulating human B and plasma cells.\nAge-associated changes in counts and detailed characterization of circulating normal CD138- and\nCD138+ plasma cells. Haematologica 95: 1016–1020. doi:10.3324/haematol.2009.018689 PMID:\n20081059\n10. Cocco M, Stephenson S, Care MA, Newton D, Barnes NA, et al. (2012) In vitro generation of long-lived\nhuman plasma cells. J Immunol 189: 5773–5785. doi:10.4049/jimmunol.1103720 PMID: 23162129\n11. Mahevas M, Patin P, Huetz F, Descatoire M, Cagnard N, et al. (2013) B cell depletion in immune throm-\nbocytopenia reveals splenic long-lived plasma cells. J Clin Invest 123: 432–442. doi:10.1172/\nJCI65689 PMID: 23241960\n12. Moreaux J, Cremer FW, Reme T, Raab M, Mahtouk K, et al. (2005) The level of TACI gene expression\nin myeloma cells is associated with a signature of microenvironment dependence versus a plasmablas-\ntic signature. Blood 106: 1021–1030. doi:10.1182/blood-2004-11-4512 PMID: 15827134\nAn Easy-to-Use Web Tool for Gene Expression Data Analysis\nPLOS Computational Biology | DOI:10.1371/journal.pcbi.1004077 January 29, 2015 10 / 10",
  "topic": "Transcriptome",
  "concepts": [
    {
      "name": "Transcriptome",
      "score": 0.6411770582199097
    },
    {
      "name": "DNA microarray",
      "score": 0.5910424590110779
    },
    {
      "name": "Biology",
      "score": 0.5616426467895508
    },
    {
      "name": "Computational biology",
      "score": 0.5541505217552185
    },
    {
      "name": "Population",
      "score": 0.4956322908401489
    },
    {
      "name": "Gene expression profiling",
      "score": 0.48324689269065857
    },
    {
      "name": "Upload",
      "score": 0.4775591492652893
    },
    {
      "name": "Gene",
      "score": 0.4425565004348755
    },
    {
      "name": "Gene expression",
      "score": 0.3693504333496094
    },
    {
      "name": "Bioinformatics",
      "score": 0.3673788905143738
    },
    {
      "name": "Computer science",
      "score": 0.30907952785491943
    },
    {
      "name": "Genetics",
      "score": 0.30335038900375366
    },
    {
      "name": "World Wide Web",
      "score": 0.16664692759513855
    },
    {
      "name": "Sociology",
      "score": 0.0
    },
    {
      "name": "Demography",
      "score": 0.0
    }
  ],
  "cited_by": 144
}