{
  "title": "Optimal passive filter design for effective utilization of cables and transformers under non-sinusoidal conditions",
  "url": "https://openalex.org/W2013825110",
  "year": 2014,
  "authors": [
    {
      "id": "https://openalex.org/A5039226970",
      "name": "Shady H. E. Abdel Aleem",
      "affiliations": [
        "Cairo Higher Institute"
      ]
    },
    {
      "id": "https://openalex.org/A5051689173",
      "name": "Murat E. Balci",
      "affiliations": [
        "Balıkesir University"
      ]
    },
    {
      "id": "https://openalex.org/A5033512118",
      "name": "Ahmed F. Zobaa",
      "affiliations": [
        "Brunel University of London"
      ]
    },
    {
      "id": "https://openalex.org/A5045612797",
      "name": "Selçuk Sakar",
      "affiliations": [
        "Gediz University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2017682104",
    "https://openalex.org/W2125317883",
    "https://openalex.org/W1981541097",
    "https://openalex.org/W2101098506",
    "https://openalex.org/W2138644128",
    "https://openalex.org/W2148839020",
    "https://openalex.org/W2041548053",
    "https://openalex.org/W2065318612",
    "https://openalex.org/W2044861123",
    "https://openalex.org/W2034581804",
    "https://openalex.org/W2118109367",
    "https://openalex.org/W3082853820",
    "https://openalex.org/W2104066641",
    "https://openalex.org/W2119540305",
    "https://openalex.org/W2097085142",
    "https://openalex.org/W2063515758",
    "https://openalex.org/W2158259250",
    "https://openalex.org/W241921033",
    "https://openalex.org/W3145093659"
  ],
  "abstract": "Transformers and cables have overheating and reduced loading capabilities under non-sinusoidal conditions due to the fact that their losses increases with not only rms value but also frequency of the load current. In this paper, it is aimed to employ passive filters for effective utilization of the cables and transformers in the harmonically contaminated power systems. To attain this goal, an optimal passive filter design approach is provided to maximize the power factor definition, which takes into account frequency-dependent losses of the power transmission and distribution equipment, under non-sinusoidal conditions. The obtained simulation results show that the proposed approach has a considerable advantage on the reduction of the total transmission loss and the transformer loading capability under non-sinusoidal conditions when compared to the traditional optimal filter design approach, which aims to maximize classical power factor definition. On the other hand, for the simulated system cases, both approaches lead to almost the same current carrying (or loading) capability value of the cables. © 2014 IEEE.",
  "full_text": "Optimal Passive Filter Design for Effective Utilization \nof Cables and Transformers under Non-sinusoidal \nConditions  \n \n \n \n \nAbstract— Transformers and cables have overheating and \nreduced loading capabilities under non-sinusoidal conditions \ndue to the fact that their losses increases with not only rms value \nbut also frequency of the load current. In this paper, it is aimed \nto employ passive filters for the effective utilization of the cables \nand transformers in the non-sinusoidal power systems. To attain \nthis goal, an optimal passive filter design approach is provided \nto maximize the power factor definition, which takes into \naccount frequency-dependent losses of the power transmission \nand distribution equipment, fo r the harmonically polluted \nsystems. Obtained simulation results shows that the proposed \napproach has a considerable advantage on the reduction of the \ntotal transmission losses and the transformer’s loading \ncapability under non-sinusoidal conditions when compared to \nthe traditional optimal filter design approach, which aims to \nmaximize classical power factor definition. On the other hand, \nfor the simulated system cases, both approaches lead to almost \nthe same current carrying capability value of the cables. \nIndex Terms —Cable ampacity, C-type filters, harmonic \ndistortion, non-sinusoidal conditions, optimal design. \nI. INTRODUCTION  \nresent day’s power systems invariably have nonlinear \nloads, which inject harmonics into the system and give \nrise to nonsinusoidal voltages and currents. Accordingly, \nin the literature, considerable interests have been focused on \nthe adverse effects of the harmonics on the power distribution \nequipment such as cables [1]-[4] and transformers [5]-[9]. It \nis seen from these studies that due to the fact that the \nresistances of the cables and the transformer windings \nincrease with the frequency, they have excessive losses even \nif the rms value of the harmonically distorted load currents \nare lower than their sinusoidal rated currents. Therefore, \ncurrent harmonics cause the reduction of their useful life. To \navoid this problem, cables and transformers should be derated \nunder non-sinusoidal current conditions [4], [9]. Derating \nfactor (maximum permissible current carrying or loading \ncapability) can basically be explained as the ratio between the \nnon-sinusoidal load current’s rms value, which causes the \nrated loss of the equipment (transformer or cable), and the \nequipment’s rated sinusoidal current. \nPower factor is conventionally used as an indicator of how \neffectively are utilized the power transmission and \ndistribution equipment in the power systems [10] . \nAccordingly, maximization of the classical power factor ( PF) \nis traditionally handled for optimal passive filter design in the \nliterature [11]-[13]. However, [15] clearly interprets that \nmaximization of classical power factor definition, which is \ncalculated by regarding active power  and classical apparent \npower, does not provide the minimum loss condition of a \npower system having transmission lines with frequency-\ndependent resistances under nonsinusoidal conditions.  \nThis study aims to employ passive filters for effective \nutilization of the transformers and cables, of which the losses \nare considerably frequency-dependent, under non-sinusoidal \nconditions. To achieve this aim, an optimal passive filter \ndesign approach is developed to maximize the power factor \nexpression [15], which considers frequency dependent loss of \nthe power system equipment, in non-sinusoidal power \nsystems. The proposed approach can be applied to any kind \nof passive filters such as single-tuned and high pass filters. In \naddition, the C-type filter is used for the demonstration of the \nproposed approach since it provides good filtering \nperformance and reduced fundamental frequency loss when \ncompared to other types of the filters [13]. \nThis paper is organized as follows, on which the present \ncontext forms Section I as an introduction to the work. \nSection II is devoted to the modeling of the studied system. \nSection III gives the problem formulations of the proposed \napproach based on the maximization of the power factor \ndefined in [15] and the traditional design approach based on \nShady H. E. Abdel Aleem, \nMember, IEEE \n15th of May Higher  \nInstitute of Engineering \nCairo, Egypt \n engyshady@ieee.org \nMurat E. Balci,          \nMember, IEEE \nBalikesir University  \nBalikesir, Turkey  \nmbalci@balikesir.edu.tr \nAhmed F. Zobaa,          \nSenior Member, IEEE \nSchool of Engineering and \nDesign, Brunel University, \nUB8 3PH Uxbridge, U.K    \nazobaa@ieee.org \nSelcuk Sakar,           \nGediz University  \nIzmir, Turkey  \nselcuk.sakar@gediz.edu.tr \nP\nThis work is supported by Turkish Republic  Ministry of Science, Industry\nand Technology and BEST Transformers Co. under the project number o f\n01008.STZ.2011 - 2. \nmaximization of classical power factor. The numerical results \nobtained with two optimal design approaches are discussed in \nSection IV. The conclusion is presented in Section V.  \nII. M\nODELING OF THE STUDIED SYSTEM \nOne-line diagram of the studied system, which is \nconsidered in various works [11]- Error! Reference source \nnot found., [16], has a consumer with three-phase linear and \nnon-linear loads, the consumer’s transformer & cable, which \ncarry energy from PCC to the loads and a C-type filter \nconnected to load bus, as shown in Fig. 1. It should be \nmentioned that some of the linear loads are individually \ncompensated with a basic capacitor.   \n \nFig. 1: One-line diagram of the studied system. \nTo write the current, voltage and power expressions for \nthe system, its single-phase equivalent circuit given in Fig. 2 \ncan be derived since the system is balanced. As shown in this \nfigure, a linear impedance ( L LR jhX ) and a constant current \nsource per harmonic ( LhI  ) denote the linear and non-linear \nload model parameters [17], which are referred to the primary \nside of the transformer, where h is the harmonic number. The \nreferred hth harmonic impedance of the individual \ncompensation capacitor, which is preinstalled in the \nconsumer side, is denoted by CijXh . Utility side is \nmodelled as Thevenin equivalent voltage source ( ShV ) and \nThevenin equivalent impedance ( ShZ ) for each harmonic \norder. By regarding the skin effect, the hth harmonic \nresistance ( RSh) of the supply line (Thevenin equivalent) \nimpedance and the hth harmonic resistance (RCBh) of the cable \nimpedance ( CBhZ ) can be written as Sh SR Rh and \nCBCBhR Rh  where RS and RCB are the fundamental \nharmonic ac resistances of the supply lines and cables, \nrespectively. In addition, the hth harmonic inductive \nreactances of the supply lines and cables can be expressed as \nSh SXh X and CBh CBXh X , respectively. Note that \ncapacitance of the short overhead lines and all cables can be \nneglected for the harmonic analysis [17]. \nWith respect to [17], the consumer’s transformer is \npractically modelled using its hth harmonic short-circuit \nimpedance, which is referred to its primary side: \nTRh TRh TR jZ Rh X                                                             (1) \nwhere XTR is the winding’s fundamental harmonic inductive \nreactance and RTRh denotes the winding’s hth harmonic \nresistance. RTRh consists of two parts such as the winding’s dc \nresistance ( RTRdc) and the winding’s equivalent resistance \ncorresponding to the eddy-current loss (RTRec) [5], [6]:  \nTRh TRdc TRec\n2RRh R                                                          (2) \nFig. 3 shows that single-phase circuit representation of the \nC-type filter. It consists of the main capacitor ( XCF1) in series \nwith a parallel connection of series inductor ( XLF)-capacitor \n(XCF2) branch and damping resistor ( RF). Its hth harmonic \nimpedance referred to the primary side of the consumer \ntransformer can be found as; \n \n\n\n\n2\nFF2 CF1\nFh 2\nFF\n2\nFFCF1\n2\nFF\nj1\nj\nj1\nj1\nj\nj1\nRX hXZa h hR X h\nRX hX     h hR X h\n    \n   \n                       (3) \nwhere a is the ratio of primary and secondary voltages of the \ntransformer. \n \nFig. 3: Single-phase circuit of the C-type filter. \nAccording to the above mentioned modeling issues, for \nhth harmonic number, the line current, PCC voltage and the \nload bus voltage, which is referred to the transformer’s \nprimary side, can easily be expressed by means of \nsuperposition principle: \nSh FLh\nh Lh\nSh CBh TRh FLh Sh CBh TRh FLh\nVZI IZZ Z Z ZZ Z Z\n      (4) \n  ,    h Sh h Sh Lh Sh h Sh CBh TRhVV I Z V V I Z Z Z               (5) \nwhere FLhZ  is the parallel equivalent of the load’s hth \nharmonic impedance, the individual compensation capacitor’s \nreactance and the C-type filter’s hth harmonic impedance, \nwhich are referred to the transformer’s primary side. Note \nthat FLhZ  can be calculated as; \n1\n11\nFLh\nFh L L Ci\nhZj ZR j h X X\n\n    \n                                    (6) \nHere it should be mentioned that subscript (_) denotes phasor \nvalues of the respective voltage, current and impedances.  \nFig. 2: Single-phase equivalent circuit of the studied system \n \nThus, by using the voltage and current harmonics found \nfrom (4) and (5), the expressions of the THDV and THDI \nmeasured at PCC can be written as follows: \n22\n22\n11\n100 , 100\nhhhh VI\nTHDV THDI VI\n       (7) \nIn addition, the displacement power factor ( DPF) and \nclassical power factor ( PF) measured at the load bus and the \ntotal transmission loss (ΔPTotal) can be expressed as \n\n11 11\n2 211\ncoscos  , \nLh h h\nhL\nL Lhh\nhh\nVIPV I PDPF PFSV I S VI\n   \n\n\n    (8) \n23Total h Lineh\nh\nPI R                                                             (9) \nwhere RLineh is hth harmonic total line resistance \n( Lineh Sh CBh TRhR RR R  ). \nOn the other hand, with respect to the apparent power \ndefinition presented in [15]; \n2 2\n33 Lineh\nee e L h h\nhh Lineh\nRRSV I V I RR\n   \n               (10) \nthe power factor at the load bus can be calculated as: \n2 2\ncosLh h h\nh\ne\ne\nLineh\nLh h\nhh Lineh\nVIPPF S RR VIRR\n\n\n  \n\n\n\n                (11) \nwhere R is a reference resistance, which can practically be \nassumed as any value.  \nFinally, regarding [2] and [9], for the cables and the \ntransformer employed in the studied system, derating factor \nvalues (or the maximum permissible rms current values in \npercent of the rated current) can respectively be calculated \nwith the expressions given below: \n\n0.52\n2\n%1 1 0 0 CBh h\nCB\nh CB Base\nRIDF RI\n\n\n       \n for cables   (12) \n \n\nEC R\nTR\nHL EC R\n1p u%1 0 01p u\nΔPDF F ΔP\n\n\n   for transformer    (13) \nIn (12), IBase is the base current that should be considered as \nfundamental harmonic component of the load current, and in \n(13), FHL denotes the harmonic loss factor, of which \nexpression can be written as; \n22\n2 hh\nHL\n11hh\nIIFh II\n   \n \n                                            (14) \nThe proposed optimal filter design approach based on \nmaximization of PFe and the traditional optimal filter design \napproach based on the maximization of PF will be formulated \nand solved regarding the above mentioned model of the \ntypical industrial power system in the next sections. \nIII.\n PROBLEM FORMULATIONS OF THE TRADITIONAL AND  \nTHE PROPOSED OPTIMAL DESIGN APPROACHES \nThe problem formulations of the traditional and the \nproposed optimal filter design approaches are presented in \nthis section.  \nA.  Traditional design approach  \nPF is traditionally used as an indicator of how effectively \nare utilized the power transmission and distribution \nequipment in the power systems. Accordingly, maximization \nof PF has widely been considered as an objective for optimal \ndesign of the passive harmonic filters [11]-\nError! Reference \nsource not found. . In addition to that, in Error! Reference \nsource not found. , the DPF, THDV and THDI limitations \nrecommended by IEEE std. 519-1992 [18] are regarded as \nthree constraints of the traditional optimal design approach. \nTherefore, according to the traditional approach based on the \nmaximization of the classical power factor ( PF), optimal \ndesign problem of the C-type filter can be formulated as \nfollows: \nMaximize\n FC F 1F,,PF R X X                                 (15) \nsubjected to: \n FC F 1F, , THDVTHDV R X X  Max                      (16) \n FC F 1F, , THDITHDI R X X  Max                        (17) \n FC F 1F95% , , 100%DPF R X X                       (18) \nwhere:  Equation (15) and Equations (16)-(18) are the \nobjective function and inequality constraints of the problem \nformulation, respectively. In the inequality constraints, \nMaxTHDI and MaxTHDV are the maximum allowable THDI \nand THDV values, which are stated in IEEE standard 519.  \nB.  Proposed design approach \nAs mentioned before, the proposed approach handles \nmaximization of PFe as an objective for the optimal filter \ndesign problem. Thus, by regarding the inequality constraints \ngiven in eq. (16)-(18), the problem formulation of the \nproposed design approach can be written as; \nMaximize  eFC F 1F,,PF R X X                            (19) \nsubjected to: \nThe inequality constraints given in (16)-(18) \nAbove detailed optimal filter design problems are solved \nvia FORTRAN feasible sequential quadratic programming \n(FFSQP) [19]. FFSQP was successfully employed to design \nthe optimal passive filters in several studies [16], Error! \nReference source not found. , [20]. Readers could refer to \n[16] and [19] for detailed information about the optimal filter \ndesign algorithm based on FFSQP. \nIV. NUMERICAL RESULTS \nIn this section, the proposed and traditional optimal filter \ndesign approaches are numerically evaluated for two cases \n(Case 1 and 2) of the studied system with the cable types \n[22], which are detailed in Table I. These cable lines have the \nsame lengths and current carrying capabilities (for sinusoidal \ncurrent condition) such as 0.1 km and 640 A, respectively. \nFundamental frequency supply voltage and short-circuit \npower of two simulated cases are predetermined as 6350 V \n(line-to-line) and 800 MVA. For the studied system’s single-\nphase equivalent circuit, the impedance parameters of the \nsource and load sides are R\nS = 0.0038 Ω, XS = 0.0506 Ω, LR = \n4.00 Ω, LX = 4.05 Ω and CiX  = 100.00 Ω. The system consists \nof a star-star connected consumer transformer with the \nnameplate ratings such as 7 MVA and 6300 V/ 400 V. The \ntransformer’s winding impedance parameters are               \nR\nTRdc = 0.026 Ω, RTRec = 0.006 Ω and XTR = 0.221 Ω. The \nvoltage source harmonics and the current source harmonics \nreferred to the primary side of the transformer are presented \nin Table II.  \nTABLE I \nPROPERTIES OF CABLE TYPES SIMULATED IN STUDIED SYSTEM \nCases Cable Type RCB \n(Ω/km) \nXCB \n(Ω/km) \n1 \n6.35 kV, Trefoil formation,  \nPVC insulated, \nUnarmoured, Single core copper wire  \n240 mm2 cross sectional area \n0.098 0.1037 \n2 \n6.35 kV, Flat spaced formation, PVC \ninsulated, Unarmoured, Single core \naluminium wire, 240 mm2 cross \nsectional area \n0.161 0.1634 \n \nTABLE II \nVOLTAGE SOURCE HARMONICS AND CURRENT SOURCE \nHARMONICS REFERRED TO TRANSFORMER’S PRIMARY SIDE \nh  Sh VV   Lh AI  \n5 55.00 0   75.00 5 45    \n7 40.00 0   65.00 7 45    \n11 35.00 0   55.00 11 45    \n13 30.00 0   40.00 13 45    \n17, 19, 23, 25 25.00 0   15.00 45 h    \n29, 31, 35, 37 12.50 0   10.00 45 h   \n41, 43, 47, 49 7.50 0   7.50 45 h   \nFor both cases of the uncompensated system, THDV and \nTHDI measured at the PCC, power quantities measured at the \nload bus, normalized value of the total transmission loss \n(∆PTotalN) and loading capabilities ( DFCB and DFTR) of the \ncable and transformer can be seen in Table III. The \nnormalized total loss is found by regarding its value under the \nsinusoidal rated current (640 A). Table III shows that for \nCase 1 and 2, the active power values ( P) drawn by the loads \nare about 4.5 MW. For Case 1, THDV, THDI, PF, PF\ne, S and \nSe are 3.812%, 25.686%, 69.022%, 48.783%, 6.586 MVA and         \n9.319 MVA, respectively. On the other hand, for Case 2, \nTHDV, THDI, PF, PFe, S and Se have the values as 3.824%, \n25.840%, 68.927%, 50.011%, 6.574MVA and 9.060 MVA, \nrespectively. Under Case 1 and 2, the transformer has \ndramatically reduced loading capabilities (DF\nTR) around 64%. \nIn addition, the cables have reduced current carrying \ncapacities ( DFCB) about 91%. The normalized value of the \ntotal transmission loss (∆PTotalN) has considerably high values \nas 1.887 and 1.789 in Case 1 and 2 of the uncompensated \nsystem, respectively.  \nTABLE III \nPOWER QUALITY INDICES, POWER QUANTITIES, LOSSES AND \nDERATTING FACTORS FOR TWO CASES OF UNCOMPANSATED \nSYSTEM \n Case 1 Case 2 \nP (MW) 4.546 4.531 \nS (MVA) 6.586 6.574 \nSe (MVA) 9.319 9.060 \nDFTR (%) 64.106 63.94 \nDFCB (%) 91.111 91.014 \nTHDV (%) 3.812 3.824 \nTHDI (%) 25.686 25.840 \nPF (%) 69.022 68.927 \nPFe (%) 48.783 50.011 \n∆PTotalN 1.887 1.789 \n \nFor both cases of the system, two different optimal filter \ndesigns are provided with respect to the proposed and the \ntraditional approaches. The obtained results are presented in \nTable IV and Table V. It can be seen from these tables that \nfor Case 1 and 2, the traditional approach attains higher PF \nvalues as 98.964% and 98.982% than the proposed one. Since \nthe proposed approach aims to provide maximum PF\ne values \n(89.611% and 90.625%), it achieves considerably lower \n∆P\nTotalN values as 0.621 and 0.606 than the traditional \napproach. Both approaches achieve DPF values higher than \n99%. \nFor Case 1, the proposed approach provides higher DFTR \nvalue (88.573%) than the traditional approach achieving DFTR \nvalue as 85.036%. In addition, for Case 2, proposed one gives \nhigher DFTR value (88.727%) when compared to the \ntraditional one having DFTR= 85.471%. On the other hand, \nunder the conditions of Case 1 and 2, both approaches result \nin almost the same DFCB values just above 97%.  \nFinally, for Case 1 and 2, the THDV values achieved by \nthe proposed approach (around 2.67%) are slightly lower than \nthe THDV values achieved by the traditional approach              \n(around 2.71%). The THDI values observed for the proposed \napproach (nearly 14.5%) is larger than the THDI values \nobserved for the traditional one (nearly 13%) in the simulated \ncases of the system. At this point, it should be mentioned that \nboth approaches meet the THDV and THDI limits \nrecommended by IEEE std. 519. \n \nTABLE IV \nTHE RESULTS OBTAINED WITH THE PROPOSED APPROACH \n Case 1 Case 2 \nCF1X  (Ω) 7.675 7.750 \nFX  (Ω) 0.326 0.329 \nFR (Ω) 2.886 2.914 \nDFTR (%) 88.573 88.727 \nDFCB (%) 97.314 97.379 \nTHDV (%) 2.674 2.675 \nTHDI (%) 14.525 14.347 \nDPF (%) 99.240 99.359 \nPF (%) 98.190 98.325 \nPFe (%) 89.611 90.625 \n∆PTotalN 0.621 0.606 \n \nTABLE V \nTHE RESULTS OBTAİNED BY THE TRADITIONAL APPROACH  \n Case 1 Case 2 \nCF1X  (Ω) 8.575 8.575 \nFX  (Ω) 0.389 0.389 \nFR (Ω) 5.047 4.914 \nDFTR (%) 85.036 85.471 \nDFCB (%) 97.514 97.569 \nTHDV (%) 2.714 2.715 \nTHDI (%) 13.081 12.960 \nDPF (%) 99.991 99.991 \nPF (%) 98.964 98.982 \nPFe (%) 87.635 89.008 \n∆PTotalN 0.643 0.622 \n \nV. CONCLUSION \nAn optimal passive filter design approach is developed to \nmaximize the power factor expression, which takes into \naccount frequency-dependent losses of the power \ntransmission and distribution equipment, under non-\nsinusoidal conditions. Presented simulation results clearly \nclarify that the proposed approach has a considerable \nadvantage on the reduction of the total transmission losses \nand the transformer’s loading capability under non-sinusoidal \nconditions when compared to the traditional optimal filter \ndesign approach, which aims to maximize classical power \nfactor definition. On the other hand, for the simulated system \ncases, both approaches lead to almost the same current \ncarrying capability value of the cables. \nVI.\n REFERENCES \n[1] A.P.S. Meliopoulos, M.A.Jr. Martin, “Calculation of secondary cable \nlosses and ampacity in the presence of harmonics,” IEEE Trans. on  \nPower Deliv., Vol. 7, No. 2, pp.451-459, Apr. 1992. \n[2] A. Hiranandani, “Calculation of cabl e ampacities including the effects \nof harmonics”, IEEE Trans. on Industry Appl. Mag.,  Vol. 4, No. 2, pp. \n42 – 51, Mar./Apr. 1998. \n[3] C. Demoulias, D.P. Labridis, P. S. Dokopoulos, K. Gouramanis, \n“Ampacity of low-voltage power cables under nonsinusoidal currents”, \nIEEE Trans. on Power Deliv., Vol. 22, No. 1, pp. 584 – 594, Jan. 2007. \n[4] C. Demoulias, D.P. Labridis, P. Dokopoulos, K. Gouramanis, \n“Influence of metallic trays on the ac resistance and ampacity of low-\nvoltage cables under non-sinusoidal currents”, Electric Pow. Syst. Res.,  \nVol. 78, No. 5, pp. 883-896, May 2008. \n[5] D. Yildirim, E.F. Fuchs, “Measured transformer derating and \ncomparison with harmonic loss factor (FHL) approach”, IEEE Trans. \non Power Del., Vol. 15, No. 1, pp. 186-191, Jan. 2000. \n[6] E.F. Fuchs, D. Yildirim, W.M. Grady, “Measurement of eddy-current \nloss coefficient PEC-R, derating of single-phase transformers, and \ncomparison with K-factor approach”, IEEE Trans. on Power Del. , Vol. \n15, No. 1, pp. 148-154, Jan. 2000. \n[7] E.F. Fuchs, D. Lin, J. Martynaitis, “Measurement of three-phase \ntransformer derating and reactive power demand under nonlinear \nloading conditions”, IEEE Trans. on Power Del. , Vol. 21, No. 2, pp. \n665-672, Apr. 2006. \n[8] M.A.S. Masoum, P. S. Moses, A.S. Masoum, “Derating of asymmetric \nthree-phase transformers serving unbalanced nonlinear loads”, IEEE \nTrans. on Power Del., Vol. 23, No.4, pp. 2033-2041, Oct. 2008. \n[9] IEEE Recommended Practice for Establishing Transformer Capability \nWhen Supplying Nonsinusoidal Load  Currents, ANSI/IEEE Standard \nC.57.110-2008，2008. \n[10] M.E. Balci, A.E. Emanuel, “Appar ent power definitions: a comparison \nstudy”, IREE Journal, Vol. 6, No. 6, pp. 2713-2722, Nov. 2011. \n[11] M.M. Abdel Aziz , E.E. Abou El-Zahab, A.M. Ibrahim and A.F. Zobaa, \n“LC compensators for power factor correction of nonlinear loads”, \nIEEE Trans. Power Del., Vol. 19, No. 1, pp.331-336, Jan. 2004. \n[12] M. M. A Aziz, A. F. Zobaa, A. M. Ibrahim, A. M. A. Monem, “Effect \nof time variation of system impedance and voltage harmonics on LC \ncompensation for nonlinear loads,” IEE Proc. - Electric Power Appl.,  \nVol.153, No.4, p.p. 619-624, Jul. 2006. \n[13] M.T. Al-Mathana, A.F. Zobaa and S. H. E. Abdel Aleem, “Economical \ndesign of multiple-arm passive harmonic filters for an industrial firm – \ncase study,” in 15th Int. Conf. Harmonics and Quality of Power , \nICHQP’12, Hong Kong, China, Jun. 17–20, 2012, pp. 438–444. \n[14] A.B. Nassif, W. Xu and W. Freitas, “An investigation on the selection \nof filter topologies for passive filter applications”, IEEE Trans. on \nPower Deliv., Vol. 24, No. 3, pp. 1710-1718, Jul. 2009. \n[15] S.J. Jeon, “Non-sinusoidal power theory in a power system having \ntransmission lines with freq uency-dependent resistances,” IET Gener., \nTrans. & Distr., Vol. 1, No. 2, pp.331,339, Mar. 2007. \n[16] S.H.E. Abdel Aleem, A.F. Zobaa, M. M. Abdel Aziz, “Optimal C-type \npassive filter based on minimization of the voltage harmonic distortion \nfor nonlinear loads,” IEEE Trans. on Ind. Electron. , Vol. 59, No. 1, pp. \n281-289, Jan. 2012. \n[17] S.J. Ranade, W. Xu, “An overview of harmonics modeling and \nsimulation, Tutorial on Harmon ics Modeling and Simulation”, IEEE \nPower Eng. Soc. Conf., TP-125-0, pp. 1–7, 1998. \n[18] IEEE Recommended Practices and Requirements for Harmonic Control \nin Electrical Power Systems, IEEE 519, 1992. \n[19] J.L. Zhou, A.L. Tits, and C.T. Lawrence, User’s guide for FFSQP \nversion 3.7: A FORTRAN code fo r solving optimization problems, \npossibly minimax, with general inequality constraints and linear \nequality constraints, generating feasible iterates, TR-92-107r5, Inst. for \nSystems Research, University of Maryland, College Park, MD20742, \nUSA, 1997. \n[20] A.F. Zobaa, M.M. Abdel-Aziz, and S.H. E. Abdel Aleem, \"Comparison \nof shunt-passive and series-passive filters for DC drive loads,\" Elec. \nPow. Com.& Syst., vol. 38, no. 3, pp. 275–291, Mar. 2010. \n[21] A.F. Zobaa and S.H. E. Abdel Aleem, “A New Approach for Harmonic \nDistortion Minimization in Power Systems Supplying Nonlinear \nLoads,” IEEE Trans. on Ind. Informatics, in press. \n[22] Caledonian Cables Co., “Medium voltages cables catalogue”, \naccessible online from http://www.caledoniancables.co.uk/DdFls/MV/\nMedium%20Voltage%20Cables.pdf. ",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.6962312459945679
    },
    {
      "name": "Overheating (electricity)",
      "score": 0.548620343208313
    },
    {
      "name": "Power factor",
      "score": 0.5085996389389038
    },
    {
      "name": "Distribution transformer",
      "score": 0.4815954864025116
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.4406481385231018
    },
    {
      "name": "Computer science",
      "score": 0.4104114770889282
    },
    {
      "name": "Electronic engineering",
      "score": 0.4065695106983185
    },
    {
      "name": "Engineering",
      "score": 0.40447989106178284
    },
    {
      "name": "Electrical engineering",
      "score": 0.2536930441856384
    },
    {
      "name": "Voltage",
      "score": 0.20270046591758728
    },
    {
      "name": "Artificial intelligence",
      "score": 0.0
    },
    {
      "name": "Control (management)",
      "score": 0.0
    }
  ]
}