{
    "title": "Sex determination in beetles: Production of all male progeny by Parental RNAi knockdown of transformer",
    "url": "https://openalex.org/W2018628396",
    "year": 2012,
    "authors": [
        {
            "id": "https://openalex.org/A2318432409",
            "name": "Jayendra Nath Shukla",
            "affiliations": [
                "University of Kentucky"
            ]
        },
        {
            "id": "https://openalex.org/A1993859831",
            "name": "Subba Reddy Palli",
            "affiliations": [
                "University of Kentucky"
            ]
        },
        {
            "id": "https://openalex.org/A2318432409",
            "name": "Jayendra Nath Shukla",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1993859831",
            "name": "Subba Reddy Palli",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W4238157037",
        "https://openalex.org/W1990335021",
        "https://openalex.org/W2093759866",
        "https://openalex.org/W2090632804",
        "https://openalex.org/W2083704076",
        "https://openalex.org/W2108418904",
        "https://openalex.org/W2082827942",
        "https://openalex.org/W2150209160",
        "https://openalex.org/W2024099406",
        "https://openalex.org/W2070749230",
        "https://openalex.org/W2138421255",
        "https://openalex.org/W1968217820",
        "https://openalex.org/W2023994991",
        "https://openalex.org/W2155896486",
        "https://openalex.org/W1828744665",
        "https://openalex.org/W2169549878",
        "https://openalex.org/W1990068727",
        "https://openalex.org/W1999265573",
        "https://openalex.org/W2044522020",
        "https://openalex.org/W2075983980",
        "https://openalex.org/W2060723832",
        "https://openalex.org/W2163963918",
        "https://openalex.org/W2026108361",
        "https://openalex.org/W2000479887",
        "https://openalex.org/W2031320371",
        "https://openalex.org/W2034397445",
        "https://openalex.org/W2009208217",
        "https://openalex.org/W1965538482",
        "https://openalex.org/W2113962028",
        "https://openalex.org/W2133616621",
        "https://openalex.org/W2140282079",
        "https://openalex.org/W2147342818",
        "https://openalex.org/W2049894216",
        "https://openalex.org/W2082972569",
        "https://openalex.org/W2010780353",
        "https://openalex.org/W2083960095",
        "https://openalex.org/W2158096004",
        "https://openalex.org/W2058816652",
        "https://openalex.org/W2076241630",
        "https://openalex.org/W2030062521",
        "https://openalex.org/W2071953124",
        "https://openalex.org/W2177836807",
        "https://openalex.org/W2169580261",
        "https://openalex.org/W1969462345",
        "https://openalex.org/W2045504523",
        "https://openalex.org/W2157227311",
        "https://openalex.org/W1850206157",
        "https://openalex.org/W1952412864",
        "https://openalex.org/W1993484192",
        "https://openalex.org/W2123145399",
        "https://openalex.org/W2098434952",
        "https://openalex.org/W1983011178",
        "https://openalex.org/W1969077437",
        "https://openalex.org/W2107277218",
        "https://openalex.org/W2113996555"
    ],
    "abstract": null,
    "full_text": "Sex determination in beetles: Production\nof all male progeny by Parental RNAi\nknockdown of transformer\nJayendra Nath Shukla & Subba Reddy Palli\nDepartment of Entomology, College of Agriculture, University of Kentucky, Lexington, KY 40546, United States of America.\nSex in insects is determined by a cascade of regulators ultimately controlling sex-specific splicing of a\ntranscription factor, Doublesex (Dsx). We recently identified homolog ofdsx in the red flour beetle,\nTribolium castaneum (Tcdsx).Here, we report on the identification and characterization of a regulator of\nTcdsx splicing inT. castaneum. Two male-specific and one female-specific isoforms ofT. castaneum\ntransformer (Tctra) were identified. RNA interference-aided knockdown ofTctra in pupa or adults caused a\nchange in sex from females to males by diverting the splicing ofTcdsx pre-mRNA to male-specific isoform.\nAll the pupa and adults developed fromTctra dsRNA injected final instar larvae showed male-specific\nsexually dimorphic structures.Tctra parental RNAi caused an elimination of females from the progeny\nresulting in production of all male progeny. Transformer parental RNAi could be used to produce all male\npopulation for use in pest control though sterile male release methods.\nG\neneration of two sexes (male and female) is an essential and universal phenomenon among animals to\nreproduce and maintain their existence1. In spite of being such a widespread developmental process,\ndifferent strategies have been adopted by different organisms to accomplish the same goal2. Insects are no\nexception; a myriad of mechanisms are found in insects for their sex determination3–5. The homologue of\ndoublesex (dsx), the bottom most gene of the sex determination cascade inDrosophila melanogaster, has been\ncharacterized in several insect species belonging to the orders Diptera, Lepidoptera and Hymenoptera6. In most of\nthe insect species examined, the pre-mRNA ofdsx sex-specifically splices to produce one female- and one male-\nspecific RNAs, most likely generating one female- and one male-specific Dsx proteins. Thedsx pre-mRNAs of\nMusca domestica7, Apis mellifera8, Bombyx mori9,10 and Aedes aegypti11 are spliced to produce more than two\nisoforms.\nAlthough the information about the sex-specific splicing regulators ofdsx pre-mRNA has increased during\nrecent years3, not many studies have been performed to characterize the nature of sex-determining signals. An\ninitial signal, at very early stage during the embryonic development, is required to initiate the sex determination\ncascade; in the absence of this signal the opposite sex develops in a default mode12.I nD. melanogasterthe initial\nsex-determining signal, provided by the X:A ratio13 or the dose of X-linked genes (X-Signaling Element, XSE) in\nfemales activates the transcription of an autosomal genesex-lethal (sxl) from its early promoter14–16. Sxl, through\nan auto regulatory feedback mechanism regulates the sex-specific splicing of its pre-mRNA in turn leading to the\nproduction of functional Sxl protein throughout the life13,17. On the other hand, males which are deprived of the\ninitial pulse of Sxl protein, due to insufficient level of XSEs, accomplish the splicing ofsxl pre-mRNA in a default\nmode which produces nonfunctional truncated protein. Sxl protein in females, maintains the splicing oftrans-\nformer (tra) pre-mRNA18,19, leading to the production of functional Tra protein which in association with Tra2\nmodulates the splicing ofdsx pre-mRNA in female mode;dsx pre-mRNA splices in a default mode in males in the\nabsence of functional Tra protein20,21. Therefore, in drosophilids XSEs are responsible for producing the initial\nsex-determining signal by inducing the production of Sxl protein. In medfly,Ceratitis capitata,the initial male sex\ndetermination signal comes from Y chromosome and in the absence of this signal, in XX embryos the maternal\nsupply of CcTra, the Tra homologue ofC. capitatainitiates female sex determination pathway22,23.I nA. mellifera,\nthe initial sex-determining signal is provided, in females, by the heterozygous state of a gene ‘‘complementary sex-\ndetermining (csd) locus’’24,25 but this female-determining signal is maintained by a protein produced by the\nfeminizer (fem) gene26 which is an ortholog oftra25. C. capitata, Lucilia cuprina and Nasonia vitripennis has\nbeen reported to exploit the maternal supply oftra as a female-determining signal27–29.\nSUBJECT AREAS:\nZOOLOGY\nDEVELOPMENTAL BIOLOGY\nBIOTECHNOLOGY\nMOLECULAR BIOLOGY\nReceived\n19 July 2012\nAccepted\n10 August 2012\nPublished\n24 August 2012\nCorrespondence and\nrequests for materials\nshould be addressed to\nS.R.P. (rpalli@email.\nuky.edu)\nSCIENTIFIC REPORTS | 2 : 602 | DOI: 10.1038/srep00602 1\nBeetles belonging to order Coleoptera of class Insecta, include one\nfourth of all animal species described and many of them are major\npests. Not much is known about the molecular mechanisms of sex\ndetermination in this group of insects. Recently, we identifieddsx\nhomologue in the red flour beetle,T. castaneum. Tcdsx gene codes for\nthree female-specific and one male-specific isoforms. RNA interfer-\nence-aided knockdown ofTcdsx isoforms revealed isoform-specific\nfunctions ofTcdsx in T. castaneum(Shukla and Palli, in preparation).\nHere, we report on the identification and characterization of the\nsplicing regulator of Tcdsx pre-mRNA, Transformer ( TcTra).\nKnockdown ofTctra induced a change in sex from females to males\nby diverting the splicing ofTcdsx pre-mRNA into male-specific iso-\nform. We have also identified several putative Tra/Tra2 binding sites\nin the female-specific exon and adjacent introns ofTcdsx (Shukla and\nPalli, in preparation). Also, parental RNAi-aided knockdown of\nTctra caused an elimination of females from the progeny.Tctra\nparental RNAi could be employed to produce all male populations\nfor use in control of insect pests.\nResults\nIdentification of T. castaneum Tra/Feminizer. To identify pro-\ntein responsible for the sex-specific splicing ofTcdsx pre-mRNA,\nwe searched (tblastn) the NCBI and the Beetlebase using the\nknown splicing regulators of dsx pre-mRNA,Transformer (Tra)\nprotein (P11596) of Drosophila melanogaster 20,21, BmPSI (P-\nelement somatic inhibitor) protein ofBombyx mori (BAF91871)30\nand Feminizer protein ofApis mellifera (NP_001128300.1)26,a sa\nquery. Two homologous sequences fromT. castaneumLOC660887\nand LOC100142574 related to PSI and Feminizer respectively were\nidentified. dsRNA specific to these genes were injected in male and\nfemale pupae and the knockdown efficiency and splicing status of\nTcdsx and Tctra were assayed using RT-PCR at 5 days after dsRNA\ninjections. Injection of dsRNA of TcPSI did not affectTcdsx splicing\npattern; the Tcdsx isoforms detected are identical to the isoforms\ndetected in the control insects injected withmalE dsRNA (data not\nshown). In contrast, injection ofTctra dsRNA affectedTcdsx splicing\n(details are shown in the next section). Based on this RNAi data, we\nselected Tctra as the candidate protein involved in regulation of\nTcdsx splicing and characterizedTctra further.\nCharacterization of Tctra. Comparison of deduced amino acid\nsequence of TcTra with the related sequences in the databases\nshowed that this is similar to Tra/Fem identified from other insects\ntherefore; T. castaneumhomologue of Tra/Fem has been named as\nT. castaneum transformer (Tctra). RT-PCR was performed using\nsex-specific cDNAs and primers specific to the ends of Tctra\nORF (Fig. 1A). A single band of 927 bp and two bands of 1033\nand 1130 bp were amplified when female and male cDNAs re-\nspectively, were used as templates (Fig. 1B). Sequencing of these\nsex-specific PCR products and aligning of sequences with the\ncorresponding genomic DNA sequence (AAJJ01000782) identified\na complete Tctra ORF. Due to the sex-specific alternative splicing\nof Tctra pre-mRNA, male Tctra mRNAs contain several in-frame\nstop codons leading to the production of truncated non-functional\nprotein (Fig. 1A). Putative auto regulation domain, Arg/Ser domain\nand proline rich region were identified in the deduced amino acid\nsequence ofTctra based on their similarity with those present in Tra/\nFem homologs cloned from other insects (Fig. 1S). Sex-specific\nisoform DNA sequences and the deduced amino acid sequences of\nTctrahave been submitted to the GenBank (Accession no. forTctra-f,\nTctra-m1 and Tctra-m2 are JQ857102, JQ857104 and JQ857103,\nrespectively). The transformer 2 (tra2) gene has been annotated in\nthe T. castaneum(XM_963457.2) genome. As reported for other insects,\ntra2 of T. castaneum(Tctra2) expresses in a non sex-specific manner,\nbut we have not performed the detail analysis ofTctra2.\nThe tra genes of several insects have been reported to contain\nmultiple putative Tra/Tra2 binding sites within the male specific\nexons and the flanking introns29,31-33. The tra of these species also\ncontain sequences similar to intronic splicing suppressor sequence\n(ISS) and RBP1 binding sites. On the basis of sequence similarity of\nFigure 1| (A) Schematic representation of isoforms ofTctra pre-mRNA showing the primer positions and region used for the preparation of dsRNA.\nBoxes show exons and lines show introns and the numbers in the exons show sizes (bp). Common regions are shown in blue and male-specific regions are\nshown in red color. Green horizontal bar shows the region used to prepareTctra dsRNA. Black dots represent the presence of stop codons in male-specific\nexons. Arrows represent the primer locations. Location of putative Tra/Tra2 binding sites are marked using green and yellow vertical lines. RBP1 binding\nsites are shown using red vertical lines. ISS sites are shown by black triangles. Primers shown as F and female-specific R were used for quantifying female-\nspecific isoform. Primers shown as male-specific F and R2 were used for quantifying male-specific isoforms. (B) Gel picture showing the amplicons\ngenerated by PCR using sex-specific c-DNA as templates and F and R1 primers ofTctra.\nwww.nature.com/ scientificreports\nSCIENTIFIC REPORTS | 2 : 602 | DOI: 10.1038/srep00602 2\nputative Tra/Tra2 binding sites from these insects, they were grouped\ninto two types, ATCAA type and CAAT type where these nucleotides\nare found to be 100% conserved (Fig. 2S). The sequences belonging to\nATCAA group have five nucleotides upstream and two nucleotides\ndownstream to ATCAA sequence with different degeneracies, prob-\nably depending on the insect species (Fig. 2S). The sequences belong-\ning to CAAT group contain four nucleotides upstream and five\nnucleotides downstream to CAAT sequence with different degen-\neracy. We searched for the presence of Tra/Tra2 binding sites, ISS\nsequence (CAAGG/A) and putative RBP1 binding sequences (Type\nA: DCADCTTTA and Type B: ATCYNNA) in theTctra gene. Ten\nputative Tra/Tra2 binding sequences, four similar to ATCAA type\nand six similar to CAAT type were found in the male-specific exons\nand the adjacent intron sequences (Fig. 1A and Fig. 3S). Three putat-\nive RBP1 binding sites ATA(T)A(T)CTTTA, and four ISS sites\n(Fig. 1A and Fig. 3S ) were also detected inTctra DNA. The presence\nof multiple putative Tra/Tra2 binding sites, ISS sequences and RBP1\nbinding sites in the male-specific exon and the adjacent intron of\nTctra suggest the possibility of autoregulation ofTctra splicing.\nTctra RNAi experiments. To verify the predicted function ofTctra\nas a splice regulator ofTcdsx pre-mRNA, dsRNA targetingTctra was\ninjected into newly ecdysed adults and the total RNA isolated on the\n5th day after injections were used to assayTcdsx and Tctra mRNAs. In\nqRT-PCR analysis efficient knockdown ofTctra in both female and\nmale insects tested was observed (data not shown). Interestingly, the\nmale-specific Tcdsx isoform was detected in all the female insects\ninjected withTctra dsRNA (Fig. 2A). Also, both female- and male-\nspecific isoforms ofTctra were detected in all theTctra RNAi females\n(Fig. 2B). In contrast, all the male insects injected withTctra dsRNA\nshowed no change in the splicing pattern ofTcdsx and Tctra; only\nmale isoform of Tcdsx and Tctra were detected (Fig. 2A & 2B).\nSimilarly, male-specific isoform of Tcdsx and both male- and\nfemale-specific isoforms of Tctra were detected in Tctra dsRNA\ninjected females and no change in splicing ofTcdsx and Tctra in\nmales was observed when the Tctra dsRNA was injected into\n48 hr-old adults (Figs. 2C&D) or newly ecdysed pupae (Figs. 2E&F).\nThe ovaries dissected from theTctra RNAi adults on the 7th day\npost-adult ecdysis (PAE) showed significantly different morphology\ncompared to the ovaries dissected from the control females injected\nwith malE dsRNA (Figs. 2G&H). The ovaries from RNAi insects\nshowed lobes similar to the lobes present in testes and these ovaries\nshowed no signs of oocyte development (Fig. 2H). Besides,Tctra\nRNAi females mated with normal males did not produce even a\nsingle egg (Table 1).Tctra RNAi males, on the other hand, developed\nnormal testes (Fig. 2J) similar to the testis observed in males injected\nwith malE dsRNA (Fig. 2I). Also, females mated withTctra RNAi\nmales produced equal number of eggs as that of females mated with\nmales injected withmalE dsRNA (Table 1). These data suggest that\nTctra is required for production of female-specific isoforms ofTcdsx\nthat regulate female reproduction.\nExpression of Tctra during larval stage is required for develop-\nment of pupal and adult sexually dimorphic structures. Pupal and\nFigure 2| Sex-specific splicing ofTcdsx (AC&E) andTctra (BD&F) inTctra or malEdsRNA injected insects.Tctra or malE dsRNAs were injected into\nnewly emerged (A&B), 48 hr-old adults (C&D) or newly ecdysed pupa (E&F). RNAs were isolated on 5th day after injections and the mRNA ofTcdsx and\nTctra were detected by resolving RT-PCR products on agarose gel. Female and male adults were injected withTctra or malE dsRNAs soon after adult\nemergence. The ovaries (G&H) or testes (I&J) from malE (G&I) orTctra (H&J) dsRNA injected insects were dissected on 7th day after adult emergence,\nstained with acridine orange and photographed using a fluorescent microscope.\nwww.nature.com/ scientificreports\nSCIENTIFIC REPORTS | 2 : 602 | DOI: 10.1038/srep00602 3\nadult stages of T. castaneum show sexually dimorphic struc-\ntures which make it easy to separate males from females, unam-\nbiguously. Papillae, two finger-like structures just anterior to the\nurogomphi, can be used to separate female pupae (Fig. 3A) from\nthe male pupae (Fig. 3B), since the male papillae are much smaller\nand look like fingertip rather than fingers (http://www.ars.usda.gov/\nResearch/docs.htm?docid512892). Males (Fig. 3D), during the adult\nstage show a small patch of short bristles on the inner side of the first\npair of legs (1/3 distance from the base) whereas these bristles are\nabsent in the females (Fig. 3C, http://www.ars.usda.gov/Research/\ndocs.htm?docid512892). In spite of the splicing of Tcdsx pre-\nmRNA to male isoform (Tcdsxm, Fig. 2E), splicing ofTctra to both\nmale- and female-specific isoforms (Fig. 2F) and the change in the\novaries into testis-ike lobes (Fig. 2H) in female adults developed from\nthe Tctra RNAi pupae, no changes in the sexually dimorphic\nstructures was observed during the pupal or adult stages and these\nstructures inTctra RNAi insects are similar to the untreated insects\n(Fig. 3A–D). To determine whether the development of these\nsexually dimorphic structures depend on the presence of Tctra\nduring larval stages,Tctra dsRNA was injected into newly molted\n4th,5 th and 6th instar larvae. None of the pupa developed fromTctra\ndsRNA injected larvae showed the female-specific papillae and about\n50% of the pupae developed from control larvae injected withmalE\ndsRNA showed female-specific papillae (Table 2). In addition, all\nthe adults developed fromTctra dsRNA injected larvae showed the\nmale-specific bristles (Table 2, Fig. 3E & 3F). About half of the adults\nFigure 3| Tctra RNAi induced changes in sexual dimorphism during pupal and adult stages.Female (red arrow-A) and male (blue arrow-B) pupae\nshow characteristic papillae. Control females (C) do not show bristle seen on the ventral side of 1st pair of legs in males (D). Enlargements of the region of\nleg showing the presence (in male) or absence (in female) of bristles are shown in the panel above each picture. All the adults developed fromTctra dsRNA\ninjected larvae showed male-specific sex patch (E&F). About 50% of adults emerged fromTctra RNAi larvae did not develop properly (G & H dorsal and\nventral view, respectively) and died day 2 PAE. The rest of the adults developed normally (I & J dorsal and ventral view, respectively). K. Multiplex PCR\nwith Y-specific and non sex-specific primers34 amplifies two bands in males whereas only one band in females. About 50% of adults (deformed) developed\nfrom Tctra RNAi larvae that showed male phenotype amplified a single band similar to that detected in control females. The rest of the 50% adults showed\ntwo bands characteristic of males (normal). L. Genetic males, either frommalE RNAi or fromTctra RNAi larvae showed male-specificTcdsx isoform\n(Tcdsxm). The genetic females developed fromTctra RNAi larvae (deformed) also showedTcdsxm isoform in RT–PCR analysis using sex-specificTcdsx\nprimers. M. Genetic males, either frommalE RNAi or fromTctra RNAi larvae showed male-specificTctra (Tctra-m). The genetic females (masculinized\ndeformed adults), developed fromTctra RNAi larvae showed bothTctra-m and Tctra-f in RT–PCR analysis using sex-specificTctra primers.\nTable 1| Effect ofTctra knockdown on the number of eggs laid/\nmating pair\nMating\npair\nControl\nfemale X\nControl male\nknockdown\nfemale X\nknockdown male\nControl\nfemale X\nknockdown male\nknockdown\nfemale X\nControl male\n1 70 0 63 0\n2 65 0 68 0\n3 68 0 65 0\n4 72 0 70 0\n5 67 0 68 0\n6 68 0 71 0\nwww.nature.com/ scientificreports\nSCIENTIFIC REPORTS | 2 : 602 | DOI: 10.1038/srep00602 4\ndeveloped from Tctra dsRNA injected larvae were deformed\n(Fig. 3G&H) and the other half are normal (Fig. 3I&J).\nMultiplex PCR using Y-specific and non sex-specific primers34\nthat amplifies two bands in males and one band in females was\nemployed to identify genetic males and females using the genomic\nDNA isolated from theTctra dsRNA injected insects as well as two\nmale and two female untreated control insects. Approximately, 50%\nof adults developed fromTctra RNAi larvae were genetic females\n(since there was no amplification of Y-specific region in genomic\nPCR, (Fig. 3K) but showed male phenotypes; absence of female\npapillae during the pupal stage whereas, the presence of male-specific\nbristles during the adult stage (Fig. 3E). Strikingly, these converted\nmales (genetic females) did not develop normally and showed\ndeformities in development of wing and other appendages\n(Fig. 3G&H) and died on day 2 PAE. Male-specific isoform of\nTcdsx (Fig. 3L) and both female- and male-specific isoforms of\nTctra (Fig. 3M) were detected in these genetic females that showed\nmale phenotypes. The other half of the adults developed fromTctra\nRNAi larvae are genetic males (Fig. 3K), developed similar to the\nuntreated control insects and showed male-specific isoforms of\nTcdsx (Fig. 3L) andTctra (Fig. 3M). These data showed that express-\nion of Tctra during final instar larval stage is a prerequisite for\ndevelopment of pupal and adult sexually dimorphic structures.\nTctra is maternally transferred. The expression of sex-specific\nisoforms ofTctra during the embryonic development was analyzed\nusing qRT-PCR. cDNAs prepared from the RNA isolated from the\nstaged embryos were used as templates to perform PCR using\nprimers specific to female or male isoforms ofTctra. As shown in\nFigure 4A, higher levels of female-specific Tctra mRNA when\ncompared to the levels of male-specific isoform were detected in\nboth fertilized and unfertilized eggs collected during early stages of\nembryonic development. Interestingly, the mRNA levels of male-\nspecific isoform of Tctra are very low to undetectable in both\nfertilized and unfertilized eggs during the early stages of embryonic\ndevelopment (Fig. 4A). qRT-PCR analysis ofTctra mRNA levels in\nstaged eggs showed that a peak of female-specific isoform ofTctra is\ndetected at 12–13 hr after egg laying (Fig. 4B) while a peak of male-\nspecific isoform of Tctra is detected at 18–23 hr after egg laying\n(Fig. 4C). The presence of female-specific isoform ofTctra in the\nunfertilized eggs suggests that this mRNA may be maternally\ntransferred.\nTctra dsRNA injected females produce only male progeny. We\nemployed parental RNAi that works well inT. castaneum35,36 to\ntarget maternally transferredTctra mRNA. Tctra or malE dsRNA\nwere injected into female adults on the 5th day PAE; 24 hr after\ninjections the females were mated with un-injected virgin males.\nFive malE or Tctra dsRNA injected females and five untreated\nmales were placed in separate cups for mating and the larvae\nhatched from the eggs laid by malE or Tctra dsRNA injected\nfemales were counted on 20th day after initiation of mating. When\ncompared to the malE dsRNA injected females, Tctra dsRNA\ninjected females produced fewer larvae (Table 3). All the pupae\nTable 2| Effect ofTctra knockdown in the larvae on the development of sex-specific phenotypes in pupae and adults\nNo of pupa No of adults adults survived 2 days PAE\ndsRNA injected Larval instar No of larvae injected No of survivors Female Male Female Male Female Male\nmalE 4th 20 17 10 7 10 7 10 7\n5th 20 18 8 10 8 10 8 10\n6th 20 20 8 12 8 12 8 12\nTctra 4th 20 18 0 18 0 18 - 10\n5th 20 18 0 18 0 18 - 9\n6th 20 20 0 20 0 20 - 9\nFigure 4| (A) Relative expression of female (Tctraf) and male-specific\n(Tctram) isoforms ofTctra in unfertilized (0–12 hr after egg laying\n(unmated females laid fewer eggs therefore, 12 hr collection was necessary\nto obtain enough eggs) and fertilized eggs (0–5 hr after egg laying). Eggs\nlaid over 0–12 hr period by unmated females and 0–5 hr period by mated\nfemales were collected, total RNA was isolated and the mRNA levels of\nfemale- and male-specific isoforms ofTctra were quantified by qRT-PCR.\nHigher levels of female-specificTctra mRNA were detected in both\nfertilized and unfertilized eggs. (B &C) Relative change in the expression of\nfemale-specific isoform (B) and male-specific isoform (C) ofTctra during\nthe embryonic development. Eggs laid by mated females over an hour\nperiod were collected and incubated at 30uC. Samples were collected at\n2 hr intervals until 12 hr after egg laying. Similarly, eggs laid by mated\nfemales over 5 hr period were collected and incubated at 30uC. Samples\nwere collected at 12 hr intervals until hatching. Total RNA was isolated and\nthe mRNA levels of female- and male-specific isoforms ofTctra were\nquantified by qRT-PCR. A peak of female-specific isoform ofTctra is\ndetected at 12–13 hr after egg laying and a peak of male-specific isoform of\nTctra is detected at 18–23 hr after egg laying.\nwww.nature.com/ scientificreports\nSCIENTIFIC REPORTS | 2 : 602 | DOI: 10.1038/srep00602 5\nand adults developed from the larvae hatched from the eggs laid by\nthe Tctra dsRNA injected females developed into males (evident by\nthe presence of sexually dimorphic structures during pupal and adult\nstages). When all these males were mated with un-injected virgin\nfemales, the number of eggs produced in a week period by each\nfemale mated with male developed from Tctra RNAi insects is\nsimilar to the eggs laid by females mated with normal males\n(shown in supplementary Table 1S). Analysis of the genetic sex of\nall the males developed from eggs laid byTctra RNAi females showed\nthat only three out of 34 tested are genetic females and the rest of\nthem are genetic males (Fig. 5A, Table 3). These genetic females and\ngenetic males (along with control females and males) were analyzed\nfor the presence of sex-specific isoform ofTctra and Tcdsx. Genetic\nmales showed usual male-specific isoforms of Tcdsx and Tctra\n(similar to untreated control males) but genetic females developed\nfrom eggs laid byTctra RNAi females showed male isoform ofTcdsx\n(Fig. 5B) and both female and male isoforms ofTctra (Fig. 5C). The\novaries dissected from female adults injected with Tctra dsRNA\nshowed smaller oocytes (Fig. 5E&F) when compared to the ovaries\ndissected from malE injected adults (Fig. 5G&H). Parental RNAi of\nTctra showed the requirement of Tctra during early stages of\nembryonic development of XX females.\nDiscussion\nThe order Coleoptera contains the largest group of insects37 and the\nred flour beetle,T. castaneum is an excellent model for this group\nbecause RNAi works efficiently and systemic and the genome of this\ninsect has been sequenced38. We recently identified dsx homolog\nfrom T. castaneum (Tcdsx) which codes for three female-specific\nand one male-specific isoforms. The functions ofTcdsx isoforms in\nsex determination and maintenance were also investigated employ-\ning RNAi (Shukla and Palli, in preparation). In this paper, we report\nthe identification and functional characterization of splicing regu-\nlator of theTcdsx pre-mRNA, Tctra. Searches ofTribolium genome\nsequence using Tra/Fem sequences previously identified in dipteran\nand hymenopteran insects identifiedTctra. Further analysis ofTctra\nsequences revealed that the pre-mRNA ofTctra is sex-specifically\nspliced into one female- and two male-specific isoforms. Only female\nisoform codes for protein containing autoregulation, Arg/Ser and\nproline rich domains conserved in Tra/Fem proteins identified in\nother insects (Fig. 1A, Supplementary Fig. 1S39). Interestingly, Tra/\nTra2 binding sequences, RBP1 binding site and ISS are also present in\nTctra (Supplementary Figs. 2S&3S).\nKnockdown in the expression of gene coding forTctra led to the\nconversion of genetic females to males. This change is seen in soma\n(disappearance of female papillae during the pupal stage and appear-\nance of male-specific bristles inTctra knockdown female adults)\nwhen Tctra dsRNA injections were performed during the larval\nstages. Changes in germ line tissues were observed when Tctra\ndsRNA was injected during the larval, pupal or adult stages. There-\nfore, Tctra appears to regulate both germ cell and soma sex deter-\nmination and maintenance, the differences observed could be due to\nthe temporal differences in development of structures studied.\nSimilar case of female-specific regulation of germline and soma, by\nfeminizer, has been reported in honey bees26.\nWhen parental RNAi was used by injectingTctra dsRNA into\nadult females to silence the expression of the gene coding forTctra\nduring early embryogenesis, all the larvae hatched from eggs laid by\nRNAi females were males. The number of eggs laid byTctra RNAi\nfemales was significantly lower compared to the number of eggs laid\nby the malE RNAi control females. AfterTctra dsRNA injections,\noogenesis and fertilization may have proceeded in these females in a\nnormal fashion untilTctra knockdown took place. Later, afterTctra\nknockdown, both oogenesis and fertilization would have been affec-\nted. Consistent with this, we found a reduction in size and arrest in\nmaturation of oocytes inTctra RNAi females compared to the con-\ntrol females at 20 days after injection of dsRNA (Fig. 5G&H). Since\nTable 3| Sex ratio of the progeny developed from the eggs laid by females injected withTctra dsRNA\ndsRNA No of adults injected No of survivors No of progenies (larvae) No of females (pupa or adults) No of males (pupa or adults)\nmalE 5 female and 5 male All 240 130 110\nTctra 5 female and 5 male All 34 0 34 (31 genetic males 13 genetic females)\nFigure 5| Parental RNAi ofTctra affects splicing of bothTcdsx and Tctra\npre-mRNA. (A) Multiplex PCR with Y-specific and non sex-specific\nprimers amplifies two bands in males whereas only one band in females.\nAbout 9% of adults developed from eggs laid by females injected withTctra\ndsRNA showed male phenotype during the pupal stage (the presence of\nmale papillae) and the adult stage (the presence of male-specific bristles)\namplified a single band similar to that detected in control females. All the\nother adults (,91%) were genetic males since two bands (as in control\nmales) were detected. (B) Genetic males developed from eggs laid by either\nmalE or Tctra dsRNA injected females showed male-specificTcdsx isoform\n(Tcdsxm). The rare genetic females (escapers), developed fromTctra\ndsRNA injected females, also showedTcdsxm isoforms. (C) Genetic males\ndeveloped from eggs laid by eithermalE or Tctra dsRNA injected females\nshowed male-specificTctra (Tctra-m). The genetic females (masculinized)\ndeveloped from eggs laid byTctra RNAi females showed bothTctram and\nTctraf isoforms. (D) Amplification product ofrp49 shown as a control.\n(E)–(H) The ovaries fromTctra (E&F) ormalE (G&H) dsRNA injected\nadults were dissected on 20th day after injection of dsRNA, stained with\nacridine orange and photographed using a fluorescent microscope. F&H\nshow higher magnification image of a single ovariole.\nwww.nature.com/ scientificreports\nSCIENTIFIC REPORTS | 2 : 602 | DOI: 10.1038/srep00602 6\nTctra dsRNA was injected into 5th day PAE females, the oocytes that\nmatured already40,41 would have been developed, fertilized and laid\nby RNAi females. These data show the requirement of TcTra (and\nTcDsxF) for maintenance of female sex even in the sexually mature\nadults. Testing the genetic sex of the adults developed from the eggs\nlaid by the RNAi females showed only 3 out of 34 insects to be genetic\nfemales (Table. 3). TheTctra dsRNA injected into the females may\nhave resulted in a reduction in the amount ofTctra mRNA trans-\nferred to egg. Alternatively, the Tctra dsRNA injected into the\nfemales may have been transferred to the eggs along withTctra\ntranscript and the dsRNA cleaved and degraded the maternally sup-\nplied Tctra transcript. It is also possible that the knockdown in the\nexpression ofTctra may have occurred both in the mother as well as\nin the embryo after transfer of both mRNA and dsRNA. In either\ncase, the end result is the presence of too low levels ofTctra during\nthe initiation of sex determination cascade. Interestingly, the three\ngenetic females (in the progenies ofTctra parental RNAi parents)\nwere masculinized and produced sperm, successfully mated with\nfemales and the mated females produced approximately the same\nnumber of eggs as the females mated with normal males.\nIn D. melanogaster, through the process of dosage compensation,\nthe genes in X-chromosome are hyper-activated, in males, by a group\nof proteins (forming ‘‘dosage compensation complex’’) equalizing\nthe overall amount of X-linked gene products in females (2X) and\nmales (1X)42–44. The dosage compensation complex is not formed in\nfemales, deficient in Msl2 (Male-specific Lethal-2) protein (a key\ncomponent of dosage compensation complex); Sxl protein (present\nonly in females) suppresses the translation ofmsl2 mRNA by binding\nto its UTR sequences45. Highly skewed sex ratio in the adults\ndeveloped from the eggs laid byTctra RNAi females is likely due\nto the mis-regulation of dosage compensation gene(s). Over express-\nion of X- linked genes inTctra RNAi females may have caused\nlethality. The presence ofTcdsxm isoform was detected in all the 3\nmasculinized genetic females. These genetic females (converted to\nfunctional males due to parentalTctra RNAi) would have escaped\nthe zygotic death probably because of the presence of TcTra (protein)\nabove the threshold level to inhibit the activation of dosage com-\npensation pathway (and hence no death of genetically masculinized\nfemales) but likely, below the levels required to execute the splicing of\nTcdsx pre-mRNA into female mode. This argument is supported by\nthe previous work on theD. melanogasterrecessive mutants for the\nvirlizer (vir) gene (regulator ofsxl pre-mRNA splicing) which causes\nfemale-specific zygotic lethality in the embryonic stage and mascu-\nlinizes the escapers46. Similarly, D. melanogaster mutant, sans-filee\n(snf1621), a splicing regulator ofsxl pre-mRNA, reduces the zygotic\ndose of Sxl to one copy number resulting into female-specific lethal\nmaternal effect and a dominant masculinizing zygotic effect 47.\nConsistent with this, we found the reduced amount of female-specific\nTctra isoforms in masculinized genetic females developed from eggs\nlaid byTctra RNAi females, compared to control females (Fig. 5C).\nThe escapers (genetic females) were converted to males that are\nfertile since virgin females mated with these males laid eggs that\nsuccessfully developed into larvae. Detailed studies on the dosage\ncompensation mechanisms in insects have only been done in dipter-\nans48. Studies on the insects belonging to the orders Hymenoptera\nand Lepidoptera suggest the absence of global dosage compensation\nmechanism in these insects49,50. Further, the existence of dosage com-\npensation in coleopterans is completely a black box since no study on\nthis aspect has been performed in any insect belonging to this order.\nTctra knockdown studies presented here, to our knowledge provides\nthe first genetic evidence for the possible existence of dosage com-\npensation in T. castaneum. Another likely explanation for female\nelimination from theTctra RNAi progenies is an increase in non-\ndisjunction in XX embryos, as seen inD. melanogaster51. In this\ninsect, a partial reduction insxl expression in the germline results\nin high levels of non-disjunction.\nThe nature of the inhibition of maternalTctra, in males, is not\nknown at this time. Though, different regulatory mechanisms are\nknown to play role in the regulation of maternal mRNA52,53 we hypo-\nthesize the presence of a dominant male-determining gene (M fac-\ntor) to be present on Y-chromosome ofT. castaneumresponsible for\nthe inhibition of maternally transferredTctra (Fig. 6). Similar pre-\ndiction has been made for the male determination inL. cuprina\nalso29.I nD. melanogaster, msl2 is the direct target of Sxl; the primary\ngene of D. melanogaster sex determination cascade. The observed\ndefects inTctra RNAi insects suggest thatmsl2 (or some other dosage\ncompensation component) may be direct or indirect target ofTctra.\nAlso, RNAi studies on Tctra showed the requirement of Tctra\nthroughout the life, in females, to maintain the splicing ofTctra\nand Tcdsx pre-mRNA in female mode. Data reported here provide\nthe first steps towards understanding of sex determination pathway\nin a coleopteran insect which not only expands our understanding of\nsex determination mechanism in insects but also help in designing\nFigure 6| Model for sex determination inT. castaneum. Maternally\ntransferred TcTra is translated to makeTcTra protein only in females. This\nTcTra protein splices the zygotically transcribedTcTra pre-mRNA into\nfemale mode in turn production ofTcTra protein. Continuous production\nof TcTra, in females, is ensured by the positive autoregulatory feedback\nloop. TcTra splices theTcdsx pre-mRNA to produce three female-specific\nisoforms (Tcdsxf1, Tcdsxf2 and Tcdsxf3). Also,TcTra inhibits some of the\nDosage compensation components (DCC) to prevent the formation of\nactive dosage compensation complex, in females. In males, an unknown\ndominant factor (M) inhibits the translation of maternally suppliedTctra\ntranscript and/or degrades the maternal transcripts or inhibits its\nautoregulation. The lack of initialTcTra protein, in males, leads to the\ndefault splicing ofTctra, coding for truncated non-functional protein. In\nthe absence ofTcTra proteinTcdsx pre-mRNA splices in a male mode\nproducing Tcdsxm. Absence ofTcTra protein in males allows the\nformation of functional dosage compensation complex owing to the\npresence of all the DCC components (dark blue). Dark color represents\nactive protein whereas corresponding light color represents truncated or\ninactive protein.\nwww.nature.com/ scientificreports\nSCIENTIFIC REPORTS | 2 : 602 | DOI: 10.1038/srep00602 7\nstrategies for the control of harmful insect pests by employing par-\nental RNAi of Tra/Fem and the sterile insect releases.\nMethods\nTribolium castaneumstrain, RNA isolation, PCR and RT-PCR. Young (0 day)\nLarvae, Pupae and adults ofT. castaneumstrain GA-1 were used in the experiments\nconducted. Pupa and adults were sexed based on the visualization of sex-specific\nstructures. Dissected adults were frozen in liquid nitrogen and stored at270uC until\nfurther use. Both RNA and DNA (simultaneously), from the same sample, was\nisolated using Trizol method (Invitrogen Corporation, USA). DNAse treated total\nRNA was denatured at 75uC for 5 min and immediately chilled on ice. First strand\ncDNA was synthesized with MMLV reverse transcriptase (Invitrogen, USA) using\n17-mers polyT primer, according to the manufacturer’s instructions. Primers\ntargeting male- and female-specific isoforms ofTctra were designed based on the\nsequence at the junctions of the first and second exons. PCR reaction conditions were\nas follows-Initial denaturation at 94uC for 2 min, 32 cycles of 94uC for 30 s, 60uCf o r\n30 s, 72uC for 2 min and the final extension at 72uC for 10 min.\nSequence analysis. Exons and introns, ofTctra were identified by aligning sequences\nof RT-PCR products with their corresponding genomic DNA sequences obtained\nfrom the Beetlebase and the NCBI. Exon-intron boundaries were confirmed by\naligning the sequences through Spidey (http://www.ncbi.nlm.nih.gov/spidey/).\nDouble stranded RNA (dsRNA) synthesis and injections. Using T. castaneum\ncDNA template and primers (shown in supplementary Table 2S) containing the T7\npromoter sequence at their 5’ ends and sequence specific to common regions ofTctra\nwas amplified by RT-PCR (Fig.1A). Purified amplicons were in-vitro transcribed to\nsynthesize dsRNA using MEGAscript T7 kit (Ambion, Austin, TX). Amplicon from\nEscherichia coli malEgene was used to prepare control dsRNA. dsRNA injections\nwere performed on the first day of final instar larvae, 0 h pupa or newly emerged male\nand female adults (,6 h PAE). The insects were either anesthetized with ether vapor\n(for larvae) or kept on ice (for pupa and adults) for 8–10 minutes prior to injections.\ndsRNAs (<500–600 ng per insect) were injected on the dorsal side of larvae and\npupae whereas on the ventral side in adults using an aspirator tube assembly (Sigma)\nfitted with 3.50 glass capillary tube (Drummond) pulled by a needle puller (Model\nP-2000, Sutter Instrument Co.). Injected insects were allowed to recover for 8 h at\nroom temperature (,22uC) and then transferred to standard conditions. Knockdown\nefficiencies of gene expression in the RNAi insects were calculated as the ratio of gene\nexpression between target dsRNA injected andmalE dsRNA injected beetles.\nCollection and staging of embryos. For the collection of unfertilized eggs, newly\nemerged virgin females were sex-separated and allowed to grow. After 5 days, the\nfemales were transferred to fine flour and eggs laid over 12 hr period were collected by\nfiltering the flour through sieve of 250mm pore size. For the collection of fertilized\neggs, mated females were allowed to lay eggs in fine flour either for 1 hr or for 5 hr.\nEggs collected during one hour period were frozen at 2 hr intervals until 12 hr after\negg laying and stored at270uC until further use. Thus, seven samples at 0–1, 2–3, 4–5,\n6–7, 8–9, 10–11 and 12–13 hr after egg laying were tested. Similarly, eggs laid over\n5 hr period were staged at 6–11, 18–23, 30–35, 42–47, 54–59, 66–71 hr after egg\nlaying and hatched first instar larvae.\nAnalysis of parental RNAi. To evaluate the effect of dsRNA mediated knockdown\nand depletion ofTctra from the early embryos in the next generation; newly emerged\nadults were sex-separated and allowed to grow for 5 days. dsRNA forTctra or malE\nwas injected to these adults and allowed to recover at room temperature for one day\n(24 hrs). Females and males were allowed to mate in a cup kept at standard rearing\nconditions. After 20 days, cups were checked for the number of larvae and the larvae\nwere further reared to sex-separate them during pupal and adult stages.\nQuantitative real time PCR. Quantitative PCR was performed using the SYBR Green\nkit (Roche, USA) according to the manufacturer’s instructions. Female-specific\nreverse primer was designed based on the sequences at the junction of first and second\nexons (Fig. 1A). Male-specific forward primer was designed based on the sequence of\nmale-specific exon (Fig. 1A). RNA isolation and RT-PCR was done as mentioned\nabove. Three independent biological replicates were analyzed for each treatment.\nTribolium rp49gene was used as an endogenous control to normalize the expression\ndata and the gene expression level were analyzed by 22DDCt method54.\nImaging and documentation. The gonads from the dissected insects were stained\nwith acridine orange and the images were taken by Olympus 1371 Inverted Research\nMicroscope fitted with reflected fluorescence system. Acridine orange was excited\nusing 502 nm laser line. ‘‘Megna Fire software’’ (version 1.5) was used to control the\nmicroscope, image acquisition and exportation of TIFF files. Figures of all\nmicrographs were assembled using Adobe Photoshop element 9.\n1. West, S. A., Reece, S. E. & Sheldon, B. C. Sex ratios.Heredity 88, 117–124 (2002).\n2. Zarkower, D. Establishing sexual dimorphism: conservation amidst diversity?\nNature Rev Genet.2, 175–185 (2001).\n3. Bopp, D. About females and males: continuity and discontinuity in flies.J Genet.\n89, 315–323 (2010).\n4. Gempe, T. & Beye, M. Function and evolution of sex determination mechanisms,\ngenes and pathways in insects.Bioessays 33, 52–60 (2011).\n5. Sanchez, L. Sex-determining mechanisms in insects.Int J Dev Biol.52, 837–856\n(2008).\n6. Shukla, J. N. & Nagaraju, J. Doublesex: a conserved downstream gene controlled\nby diverse upstream regulators.J Genet.89, 341–356 (2010).\n7. Hediger, M. et al. Sex determination inDrosophila melanogasterand Musca\ndomestica converges at the level of the terminal regulator doublesex.Dev Genes\nEvol 214, 29–42 (2004).\n8. Cho, S., Huang, Z. Y. & Zhang, J. Sex-specific splicing of the honeybee doublesex\ngene reveals 300 million years of evolution at the bottom of the insect sex-\ndetermination pathway.Genetics 177, 1733–1741 (2007).\n9. Ohbayashi, F., Suzuki, M. G., Mita, K., Okano, K. & Shimada, T. A homologue of\nthe Drosophila doublesex gene is transcribed into sex-specific mRNA isoforms in\nthe silkworm,Bombyx mori. Comp Biochem Physiol B128, 145–158 (2001).\n10. Shukla, J. N., Jadhav, S. & Nagaraju, J. Novel female-specific splice form of dsx in\nthe silkworm,Bombyx mori. Genetica 139, 23–31 (2011).\n11. Salvemini, M.et al. Genomic organization and splicing evolution of the doublesex\ngene, a Drosophila regulator of sexual differentiation, in the dengue and yellow\nfever mosquitoAedes aegypti. BMC Evol Biol11, 41 (2011).\n12. Salz, H. K. Sex determination in insects: a binary decision based on alternative\nsplicing. Curr Opin Genetics Dev21, 395–400 (2011).\n13. Penalva, L. O. & Sanchez, L. RNA binding protein sex-lethal (Sxl) and control of\nDrosophila sex determination and dosage compensation.Microbiol Mol Biol Rev\n67, 343–359 (2003).\n14. Erickson, J. W. & Quintero, J. J. Indirect effects of ploidy suggest X chromosome\ndose, not the X:A ratio, signals sex inDrosophila. PLoS biology5, e332 (2007).\n15. Cline, T. W. Autoregulatory functioning of aDrosophila gene product that\nestablish es and maintains the sexually determined state.Genetics 107, 231–277\n(1984).\n16. Schutt, C. & Nothiger, R. Structure, function and evolution of sex-determining\nsystems in Dipteran insects.Development 127, 667–677 (2000).\n17. Keyes, L. N., Cline, T. W. & Schedl, P. The primary sex determination signal of\nDrosophila acts at the level of transcription.Cell 68, 933–943 (1992).\n18. Boggs, R. T., Gregor, P., Idriss, S., Belote, J. M. & McKeown, M. Regulation of\nsexual differentiationin D. melanogastervia alternative splicing of RNA from the\ntransformer gene.Cell 50, 739–747 (1987).\n19. Inoue, K., Hoshijima, K., Sakamoto, H. & Shimura, Y. Binding of the Drosophila\nsex-lethal gene product to the alternative splice site of transformer primary\ntranscript. Nature 344, 461–463 (1990).\n20. Hoshijima, K., Inoue, K., Higuchi, I., Sakamoto, H. & Shimura, Y. Control of\ndoublesex alternative splicing by transformer and transformer-2in Drosophila.\nScience 252, 833–836 (1991).\n21. Tian, M. & Maniatis, T. Positive control of pre-mRNA splicing in vitro.Science\n256, 237–240 (1992).\n22. Pane, A., De Simone, A., Saccone, G. & Polito, C. Evolutionary conservation of\nCeratitis capitatatransformer gene function.Genetics 171, 615–624 (2005).\n23. Salvemini, M.et al. Ceratitis capitata transformer-2 gene is required to establish\nand maintain the autoregulation of Cctra, the master gene for female sex\ndetermination. Int J Dev Biol53, 109–120 (2009).\n24. Beye, M., Hasselmann, M., Fondrk, M. K., Page, R. E. & Omholt, S. W. The gene\ncsd is the primary signal for sexual development in the honeybee and encodes an\nSR-type protein.Cell 114, 419–429 (2003).\n25. Hasselmann, M.et al. Evidence for the evolutionary nascence of a novel sex\ndetermination pathway in honeybees.Nature 454, 519–522 (2008).\n26. Gempe, T.et al. Sex determination in honeybees: two separate mechanisms induce\nand maintain the female pathway.PLoS biology7, e1000222 (2009).\n27. Saccone, G., Salvemini, M. & Polito, L. C. The transformer gene of Ceratitis\ncapitata: a paradigm for a conserved epigenetic master regulator of sex\ndetermination in insects.Genetica 139, 99–111 (2011).\n28. Verhulst, E. C., Beukeboom, L. W. & van de Zande, L. Maternal control of\nhaplodiploid sex determination in the wasp Nasonia.Science 328, 620–623\n(2010).\n29. Concha, C. & Scott, M. J. Sexual development inLucilia cuprina(Diptera,\nCalliphoridae) is controlled by the transformer gene.Genetics 182, 785–798\n(2009).\n30. Suzuki, M. G.et al. Establishment of a novel in vivo sex-specific splicing assay\nsystem to identify a trans-acting factor that negatively regulates splicing of\nBombyx moridsx female exons.Mol Cell Biol28, 333–343 (2008).\n31. Pane, A., Salvemini, M., Delli Bovi, P., Polito, C. & Saccone, G. The transformer\ngene in Ceratitiscapitata provides a genetic basis for selecting and remembering\nthe sexual fate.Development 129, 3715–3725 (2002).\n32. Lagos, D., Koukidou, M., Savakis, C. & Komitopoulou, K. The transformer gene in\nBactrocera oleae: the genetic switch that determines its sex fate. Insect Mol Biol.16,\n221–30 (2007).\n33. Ruiz, M. F., Milano, A., Salvemini, M., Eirı´n-Lo´pez, J. M., Perondini, A. L. P.et al.\nThe Gene Transformer ofAnastrepha Fruit Flies (Diptera, Tephritidae) and Its\nEvolution in Insects. PLoS ONE 2(11), e1239 (2007).\n34. Lagisz, M., Wilde, K. E. & Wolff, K. The development of PCR-based markers for\nmolecular sex identification in a model insect speciesTribolium castaneum\n(Herbst) (Coleoptera: Tenebrionidae).Entomologia Experimentalis et Applicata\n134, 50–59 (2010).\nwww.nature.com/ scientificreports\nSCIENTIFIC REPORTS | 2 : 602 | DOI: 10.1038/srep00602 8\n35. Tan, A. & Palli, S. R. Ecdysone [corrected] receptor isoforms play distinct roles in\ncontrolling molting and metamorphosis in the red flour beetle,Tribolium\ncastaneum. Mol Cell Endocrinol291, 42–49 (2008).\n36. Bitra, K. & Palli, S. R. The members of bHLH transcription factor superfamily are\nrequired for female reproduction in the red flour beetle,Tribolium castaneum. J\ninsect physiol.56, 1481–1489 (2010).\n37. Hunt, T.et al. A comprehensive phylogeny of beetles reveals the evolutionary\norigins of a superradiation.Science 318, 1913–1916 (2007).\n38. Richards, S.et al. The genome of the model beetle and pestTribolium castaneum.\nNature 452, 949–955 (2008)\n39. Verhulst, E. C., van de Zande, L. & Beukeboom, L. W. Insect sex determination: it\nall evolves around transformer.Current opinion in genet dev.20, 376–383 (2010).\n40. Parthasarathy, R. & Palli, S. R. Molecular analysis of nutritional and hormonal\nregulation of female reproduction in the red flour beetle,Tribolium castaneum.\nInsect Biochem Molec Biol.41, 294–305 (2011).\n41. Parthasarathy, R., Sheng, Z., Sun, Z. & Palli, S. R. Ecdysteroid regulation of ovarian\ngrowth and oocyte maturation in the red flour beetle,Tribolium castaneum. Insect\nBiochem Molec Biol.40, 429–439 (2010).\n42. Lucchesi, J. C. Dosage compensation inDrosophila. Annu Rev Genet.7, 225–237\n(1973).\n43. Cline, T. W. & Meyer, B. J. Vive la difference: males vs females in flies vs worms.\nAnnu Rev Genet.30, 637–702 (1996).\n44. Straub, T. & Becker, P. B. Dosage compensation: the beginning and end of\ngeneralization. Nature Rev Genet.8, 47–57 (2007).\n45. Bashaw, G. J. & Baker, B. S. The regulation of theDrosophila msl-2 gene reveals a\nfunction for Sex-lethal in translational control.Cell 89, 789–798 (1997).\n46. Hilfiker, A., Amrein, H., Dubendorfer, A., Schneiter, R. & Nothiger, R. The gene\nvirilizer is required for female-specific splicing controlled by Sxl, the master gene\nfor sexual development inDrosophila. Development 121, 4017–4026 (1995).\n47. Oliver, B., Perrimon, N. & Mahowald, A. P. Genetic evidence that the sans fille\nlocus is involved inDrosophila sex determination.Genetics 120, 159–171 (1988).\n4 8 .R u i z ,M .F . ,E s t e b a n ,M .R . ,D o n o r o ,C . ,G o d a y ,C .&S a n c h e z ,L .E v o l u t i o no fd o s a g e\ncompensation in Diptera: the gene maleless implements dosage compensation in\nDrosophila (Brachycera suborder) but its homolog in Sciara (Nematocera suborder)\nappears to play no role in dosage compensation.Genetics156, 1853–1865 (2000).\n49. Wolf, J. B. & Bryk, J. General lack of global dosage compensation in ZZ/ZW\nsystems? Broadening the perspective with RNA-seq.BMC genomics12, 91 (2011).\n50. Dearden, P. K.et al. Patterns of conservation and change in honey bee\ndevelopmental genes.Genome Res.16, 1376–1384 (2006).\n51. Bopp, D., Schutt, C., Puro, J., Huang, H. & Nothiger, R. Recombination and\ndisjunction in female germ cells of Drosophila depend on the germline activity of\nthe gene sex-lethal.Development 126, 5785–5794 (1999).\n52. Bettegowda, A. & Smith, G. W. Mechanismsof maternal mRNA regulation:\nimplications for mammalian early embryonicdevelopment.Front Biosci12,\n3713–3726 (2007).\n53. Zhang, D. X., Cuiand, X. S. & Kim, N. H. Involvement ofpolyadenylation status on\nmaternal gene expression during in vitro maturationof porcine oocytes.Mol\nReprod Dev76, 881–889 (2009).\n54. Livak, K. J. & Schmittgen, T. D. Analysis of relative gene expression data using\nreal-time quantitative PCR and the 2(-Delta Delta C(T)) Method.Methods 25,\n402–408 (2001).\nAcknowledgments\nThis work was supported by grants from National Science Foundation (IBN-0421856),\nNational Institutes of Health (GM070559-06) and USDA-CSREES (2007-04636). This is\ncontribution number 09-08-045 from the Kentucky Agricultural Experimental Station.\nAuthor contribution:\nBoth authors planned and conducted experiments and wrote manuscript.\nAdditional information\nSupplementary informationaccompanies this paper at http://www.nature.com/\nscientificreports\nCompeting financial interests statement:The authors declare no competing financial\ninterests.\nLicense: This work is licensed under a Creative Commons Attribution 3.0 Unported\nLicense. To view a copy of this license, visit http://creativecommons.org/licenses/by/3.0/\nHow to cite this article:Shukla, J.N. & Palli, S.R. Sex determination in beetles: Production of\nall male progeny by Parental RNAi knockdown oftransformer. Sci. Rep.2,6 0 2 ;\nDOI:10.1038/srep00602 (2012).\nwww.nature.com/ scientificreports\nSCIENTIFIC REPORTS | 2 : 602 | DOI: 10.1038/srep00602 9"
}