{
  "title": "Do Chimpanzees Use Weight to Select Hammer Tools?",
  "url": "https://openalex.org/W2024449473",
  "year": 2012,
  "authors": [
    {
      "id": "https://openalex.org/A5016596166",
      "name": "Cornelia Schrauf",
      "affiliations": [
        "University of Vienna"
      ]
    },
    {
      "id": "https://openalex.org/A5044389898",
      "name": "Josep Call",
      "affiliations": [
        "Max Planck Institute for Evolutionary Anthropology",
        "Max Planck Society"
      ]
    },
    {
      "id": "https://openalex.org/A5089881253",
      "name": "Koki Fuwa",
      "affiliations": [
        "Hayashibara (Japan)"
      ]
    },
    {
      "id": "https://openalex.org/A5027640522",
      "name": "Satoshi Hirata",
      "affiliations": [
        "Hayashibara (Japan)"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2029318744",
    "https://openalex.org/W2091145445",
    "https://openalex.org/W2497863347",
    "https://openalex.org/W2015588529",
    "https://openalex.org/W2964387625",
    "https://openalex.org/W83222411",
    "https://openalex.org/W2063335285",
    "https://openalex.org/W2053861307",
    "https://openalex.org/W151235344",
    "https://openalex.org/W2332338042",
    "https://openalex.org/W2031960594",
    "https://openalex.org/W2073180890",
    "https://openalex.org/W2062217769",
    "https://openalex.org/W2002369480",
    "https://openalex.org/W2095415888",
    "https://openalex.org/W6650812644",
    "https://openalex.org/W6989998155",
    "https://openalex.org/W1986909399",
    "https://openalex.org/W1579613406",
    "https://openalex.org/W1795671969",
    "https://openalex.org/W1532858913",
    "https://openalex.org/W1737831871",
    "https://openalex.org/W2157423097",
    "https://openalex.org/W2014790268",
    "https://openalex.org/W2108922045",
    "https://openalex.org/W2085196258",
    "https://openalex.org/W2043746926",
    "https://openalex.org/W2034742121",
    "https://openalex.org/W2093562415",
    "https://openalex.org/W2122597834",
    "https://openalex.org/W2030848505",
    "https://openalex.org/W2064797938",
    "https://openalex.org/W2062941941",
    "https://openalex.org/W2050958156",
    "https://openalex.org/W1976766967",
    "https://openalex.org/W2058296590",
    "https://openalex.org/W2027409062",
    "https://openalex.org/W563138947",
    "https://openalex.org/W31709968",
    "https://openalex.org/W2497508487",
    "https://openalex.org/W614025725",
    "https://openalex.org/W2016477398",
    "https://openalex.org/W2001431842",
    "https://openalex.org/W4388245520"
  ],
  "abstract": "The extent to which tool-using animals take into account relevant task parameters is poorly understood. Nut cracking is one of the most complex forms of tool use, the choice of an adequate hammer being a critical aspect in success. Several properties make a hammer suitable for nut cracking, with weight being a key factor in determining the impact of a strike; in general, the greater the weight the fewer strikes required. This study experimentally investigated whether chimpanzees are able to encode the relevance of weight as a property of hammers to crack open nuts. By presenting chimpanzees with three hammers that differed solely in weight, we assessed their ability to relate the weight of the different tools with their effectiveness and thus select the most effective one(s). Our results show that chimpanzees use weight alone in selecting tools to crack open nuts and that experience clearly affects the subjects' attentiveness to the tool properties that are relevant for the task at hand. Chimpanzees can encode the requirements that a nut-cracking tool should meet (in terms of weight) to be effective.",
  "full_text": "Do Chimpanzees Use Weight to Select Hammer Tools?\nCornelia Schrauf1*, Josep Call2, Koki Fuwa3, Satoshi Hirata3\n1 Department of Behavioural Biology, University of Vienna, Vienna, Austria,2 Department for Developmental and Comparative Psychology, Max Planck Institute for\nEvolutionary Anthropology, Leipzig, Germany,3 Great Ape Research Institute, Hayashibara Biochemical Laboratories, Tamano, Okayama, Japan\nAbstract\nThe extent to which tool-using animals take into account relevant task parameters is poorly understood. Nut cracking is one\nof the most complex forms of tool use, the choice of an adequate hammer being a critical aspect in success. Several\nproperties make a hammer suitable for nut cracking, with weight being a key factor in determining the impact of a strike; in\ngeneral, the greater the weight the fewer strikes required. This study experimentally investigated whether chimpanzees are\nable to encode the relevance of weight as a property of hammers to crack open nuts. By presenting chimpanzees with three\nhammers that differed solely in weight, we assessed their ability to relate the weight of the different tools with their\neffectiveness and thus select the most effective one(s). Our results show that chimpanzees use weight alone in selecting\ntools to crack open nuts and that experience clearly affects the subjects’ attentiveness to the tool properties that are\nrelevant for the task at hand. Chimpanzees can encode the requirements that a nut-cracking tool should meet (in terms of\nweight) to be effective.\nCitation: Schrauf C, Call J, Fuwa K, Hirata S, (2012) Do Chimpanzees Use Weight to Select Hammer Tools? PLoS ONE 7(7): e41044. doi:10.1371/\njournal.pone.0041044\nEditor: Laurie Santos, Yale University, United States of America\nReceived September 9, 2011;Accepted June 21, 2012;Published July 18, 2012\nCopyright: /C2232012 Schrauf et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nFunding: This study was financially supported by a Japan Society for the Promotion of Science Predoc Grant (http://www.jsps.go.jp/english/e-summer/index.\nhtml) to Cornelia Schrauf. The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.\nCompeting Interests: Two authors are employed by Hayashibara Biochemical Laboratories, Inc. However, the company had no role in study design,\nconsultancy, data collection and analysis, decision to publish, or preperation of the manuscript. The authors declare their full adherence to all PLOS One policies\non data sharing and materials.\n* E-mail: connyschrauf@chello.at\nIntroduction\nWild chimpanzees display a variety of tool-using behaviors.\nAmong these, nut cracking has been considered as one of the most\ncomplex forms [1–3]. In its most sophisticated variant, a\nchimpanzee cracks open a nut to access its nutritious kernel by\nplacing the nut on the flat surface of an anvil stone and then hitting\nthe nut with the flat side of a hammer stone [4], [5]. This requires\nnot only the use of two tools (hammer and anvil) but also\nproducing two spatial relations in sequence, one between the nut\nand the anvil and one between the tool and the nut [6], [7].\nNut-cracking behavior is found in several communities of wild\nchimpanzees (Guinea: [4], [8], [9]; Ivory Coast: [10], [11], [12];\nLiberia: [13], [14]; Sierra Leone: [15]). In East and Central Africa,\nnut cracking is completely absent [16], [17], apart from a single\npopulation of chimpanzees that live east from the Ivory Coast\n[18]. This is particularly intriguing given that all the necessary\nelements (nut species, supply of stones, sticks and roots for anvils)\nare available [19] thus, ecological factors alone cannot explain the\nabsence of this behavior [20]. Furthermore, even within nut-\ncracking communities, some individuals never acquire the skill [5].\nInfant chimpanzees in the Bossou community start to crack\nopen oil-palm nuts at 3.5–6 years of age [5]. In the Taı ¨ forest,\nIvory Coast, no chimpanzee younger than 5 years has been\nobserved to successfully open coula nuts ( Coula edulis) [21], [22],\neven though the younger chimpanzees used the appropriate\nmaterials and behavior. Learning nut cracking requires a longer\nprocess than other types of simpler tool use [23]. Boesch and\nBoesch [24] reported that it takes about 4 years of practice until\nchimpanzees become proficient nut crackers, whereas infant\nchimpanzees in Bossou need between 3 and 7 years to master\nthe skill [5].\nLaboratory studies on the acquisition of nut cracking indicate\nthat not only cognitive abilities are required [25], [14], [26]. A\nfemale chimpanzee named Ai who had been very successful in\nsolving computerized experiments failed to learn to use stones as\nhammers to crack open nuts [27], [26]. The authors argued that\nAis failure derived from her lacking the hitting action and her\ninsufficient stone manipulation during this task. Instead of hitting\nthe nut with a stone, Ai pressed the nut with her hand or foot.\nThese behaviors have also been observed in wild chimpanzee\ninfants who have not yet acquired stone tool use [2]. Nonetheless,\na few laboratory studies have reported captive chimpanzees\nsuccessfully learning to crack open nuts using a hammer and anvil\n[25]: 3 of 5 chimpanzees successfully acquired this behavior; [28]:\n1 of 5 chimpanzees learned the skill; [29]: all 5 chimpanzees tested\nlearned to crack open nuts; [26]: 2 of 3 chimpanzees succeeded at\nthis task. These results reinforce the idea that nut cracking is a\ndifficult skill for chimpanzees to acquire and that even extensive\ntraining does not guarantee that all individuals will eventually\nsucceed.\nThe full mastery of nut cracking requires that a chimpanzee\nattends to the properties of the tools that are relevant for reaching\nthe goal of cracking the nut. Wild chimpanzees have been\nobserved to select appropriate hammers of particular size, shape\nand material, suggesting that they are able to encode the\nproperties that make a suitable hammer [30], [8], [4]. Boesch\nand Boesch [12], for instance, found that wild chimpanzees in the\nTaı¨ forest select hammers and anvils according to the hardness of\nthe nut; for the very hard panda nuts ( Panda oleosa), chimpanzees\nPLoS ONE | www.plosone.org 1 July 2012 | Volume 7 | Issue 7 | e41044\nexclusively use stone hammers, whereas for the softer coula nuts\n(Coula edulis) they select more wooden hammers. In addition, when\nonly stones are used, bigger, heavier and harder hammers were\nemployed for panda nuts than for coula nuts. Similarly, captive\nchimpanzees released on an island in Liberia tended to use heavy\nstones to crack open palm nuts [14], and Bossou chimpanzees\nselected stones as hammers and anvils based on their size and\nweight [30], [9].\nIn nut cracking, hammer weight is a key factor determining the\nimpact of a strike; in general, the greater the weight the fewer\nstrikes are required. Weight is therefore a crucial feature because\ndifferences in hammer weight are directly related to the degree of\nefficiency to crack open nuts. In all the above-mentioned studies,\nseveral factors (e.g., material, resistance, friability, shape and\nweight) affected a hammer’s suitability, some being more\nimportant than others. Whether chimpanzees are able to choose\nthe most appropriate hammer based solely on weight is an open\nquestion.\nNut-cracking activity is not restricted to chimpanzees. Field\nobservations have shown that capuchin monkeys also use stones as\nhammers to crack open nuts [7]. In contrast to chimpanzees, who\nadopt a seated posture to crack nuts and mostly use one hand [5],\n[22], capuchin monkeys adopt a bipedal posture and raise the\nstone above their shoulder using both hands [31]. Visalberghi et\nal. [32] recently investigated whether capuchin monkeys are\nselective in their choice of hammers in terms of weight to crack\nnuts. In a series of elegant field experiments, the authors presented\nwild capuchins with stones differing in functional features (friability\nand weight). The results were clear: Capuchin monkeys chose,\ntransported, and used the most effective stone to crack open nuts\neven when the tools were visually identical and weight was the\nonly discriminative feature.\nThe present study was designed to similarly assess whether\ncaptive chimpanzees are able to selectively use tools based solely\non weight to crack nuts. In Experiment 1 we presented six\nchimpanzees with three cuboid-shaped hammers identical in\nshape, size, material, and color, but differing in weight. Our goal\nwas to assess whether chimpanzees are able to encode the\nrelevance of the tool property weight by relating the weight of the\ndifferent tools with their effectiveness and showing a preference for\nthe most effective one(s). In Experiment 2, we modified the\nhammers’ shape and presented spheric hammers. Our aim was to\ntest whether efficiency is affected by a shape change, given that\ncuboidal tools might constrain accurate handling. In Experiment\n3, we altered the weight of the spheric hammers to increase the\ndiscrepancy in tool efficiency and to measure how that affected\ntool selectivity.\nExperiment 1: Materials and Methods\nChimpanzees faced a situation that promoted the selective use\nof tools: a hard-shelled nut, an anvil, and tools that differed in no\nother perceivable characteristic than weight (and thus effective-\nness). To ensure the perception of the weight differences, the\nexperimenter gave the chimpanzees the three hammers consec-\nutively in their hands before starting the experiment.\nSubjects\nSix chimpanzees ( Pan troglodytes versus) housed at the Great Ape\nResearch Institute (GARI, Okayama, Japan) participated in the\nstudy: Loi (male, 13 years 10 months), Zamba (male, 13 years 10\nmonths), Tsubaki (female, 13 years 3 months), Mizuki (female 12\nyears, 5 months), Misaki (female, 10 years 4 months) and Natsuki\n(female, 3 years 10 months). All subjects belonged to the same\ngroup, with Loi being the alpha male and Zamba the subordinate\nmale. Loi and Zamba were tested individually. Mizuki and Misaki\nwere tested together as well as Tsubaki and her daughter Natsuki\nbecause it was impossible to separate them. In these cases a second\nexperimenter distracted one of the chimpanzees while the other\nparticipated in the experiment.\nAt the time of the study, all subjects were familiar with nut\ncracking and, except Natsuki, they had taken part in a previous\nnut-cracking experiment [33]. Prior to starting the experiment,\neach subject was presented once with one of the tools (the lightest)\nthat we used in the experiment later on. This was done for\nhabituation and to help subjects to overcome neophobia.\nThis research was conducted in accordance with the ‘‘Guide for\nthe Care and Use of Laboratory Animals’’ of Hayashibara\nBiochemical Laboratories, Inc., and the Weatherall report, ‘‘The\nuse of non-human primates in research’’. Chimpanzees were\nhoused in semi-natural indoor and outdoor enclosures with regular\nfeedings, daily enrichment and water ad lib. Subjects voluntarily\nparticipated in the study and were never food or water deprived.\nResearch was conducted in the observation room. No medical,\ntoxicological or neurobiological research of any kind is conducted\nat GARI. Research was non-invasive and the research protocols\nreported in this manuscript were approved by the Animal Welfare\nand Animal Care Committee and Hayashibara Biochemical\nLaboratories, Inc. (GARI-090601).\nApparatus\nThe experiment took place in an indoor experimental area\n(7.6 m2, 5 m height) that was connected to the outdoor enclosure.\nWe used Macadamia nuts, which were already well-known to the\nchimpanzees at the time of testing [33]. Cracking the nutshell\nrequired the use of a hammer. Subjects were provided with three\nvisually identical aluminum cuboids (6 cm 68c m66 cm) to be\nused as hammers. The heavy (1200 g) and the mid-weight (600 g)\ncuboids were filled with lead shot, whereas the light cuboid (300 g)\nwas empty. Transparent silicone paste was mixed with the lead\nshot to produce a solid and homogenous mass; this prevented any\nrattling noise during manipulations and evenly distributed the\nweight inside the tool. A granite stone (30 cm 630 cm and 7 cm\nhigh) served as an anvil with five pits (approximately 2 cm of\ndiameter and 0.5–1 cm deep) on its upper surface to place nuts\n(Figure 1).\nProcedure\nThe experiment took place from June until September 2009.\nWe conducted one session of six trials per day, for a total of 18\ndaily sessions (108 trials, i.e., 108 nuts cracked open). After the\nchimpanzee had entered the experimental room, it sat on a\nwooden platform directly in front of the stone anvil. Then the\nexperimenter (E, henceforth) entered and sat behind the anvil\nfacing the chimpanzee. Prior to the first trial of a session (to ensure\nthe perception of the differences in weight), E gave the chimpanzee\nthe three hammers consecutively before beginning the experiment.\nAfter the chimpanzee had returned the tools, E placed them next\nto the anvil at a distance of 2–3 cm from each other in front of the\nsubject. The positioning of the tools followed a fixed protocol.\nEach tool was randomly assigned to one of the three positions (left,\nright, middle) with the following constraint: a given tool could not\nbe placed consecutively in the same position and, overall, the\nnumber of times in which each tool was in one of the three\npositions was equal at the end of the experiment. A trial started by\nE putting a macadamia nut in one of the anvil pits; the nut was\nalways placed in the same pit, but the subjects were able to change\nthe nut’s position. Subjects were free to use any of the three\nDo Chimpanzees Use Weight to Select Hammer Tools?\nPLoS ONE | www.plosone.org 2 July 2012 | Volume 7 | Issue 7 | e41044\nprovided hammers, meaning that they were allowed to replace the\ntool first chosen with any other tool during the experiment. Each\ntrial lasted until the chimpanzee had cracked open the nut and\nstarted to eat the kernel. Importantly, only after three trials E\nremoved the tools and then gave the chimpanzee the three\nhammers consecutively to ensure that the subjects experienced the\ndifferences in weight. After the chimpanzee had returned the tools,\nE repositioned the tools using the above protocol and the three\nremaining trials ensued.\nData Analysis\nEach session was videotaped with a SONY SR-12 camera. We\nscored from the tapes the identity of the tool used to perform the\nstrike, the number of hits and the time to solution. Success of each\ntool was assessed in terms of the number of strikes and the time\nrequired to crack open a nut. For this analysis only those trials in\nwhich a single tool was used to open the nut were considered. In\naddition, we also calculated which hammer type led to success, i.e.,\nthe tool that was being used when the nut cracked open. Tool\nselectivity was assessed by tool choice, both overall and first choice\nas well as switching between tools. Overall tool choice was the\nfrequency with which each tool was chosen, whereas first choice\nreferred to the first tool selected. Switching behavior was measured\nby calculating the frequency a subject switched from one tool to\nanother tool and the number of times the switch resulted in\ndiscarding a lighter tool and selecting a heavier one or vice versa.\nFor the first choice of tools, only the first choice of the first and\nfourth trial could be considered independent and contributed to\nthe analysis because the tools were not repositioned after every\ntrial. Tool choice and the hammer type were calculated using the\ndata obtained from all six trials of every single session.\nWe used the Friedman test to assess whether the number of\nstrikes and time to solution differed across tools; pair-wise\ncomparisons between tools were performed with the exact two-\ntailed Wilcoxon test. We used the Kruskal-Wallis test to assess\nwhether at the individual level the number of strikes and time\nFigure 1. A chimpanzee using a cuboid-shaped hammer to crack open a nut in a pit of the anvil.\ndoi:10.1371/journal.pone.0041044.g001\nDo Chimpanzees Use Weight to Select Hammer Tools?\nPLoS ONE | www.plosone.org 3 July 2012 | Volume 7 | Issue 7 | e41044\nneeded differed between tools; the Mann-Whitney U test was used\nfor the pair-wise comparisons. We used the Friedman test to assess\ntool selectivity by comparing the values of the three tools both\noverall and in subjects’ first and last choice. Finally, we used the\nChi-square test to assess if a subject selected a particular tool\nsignificantly more often than the other tools.\nExperiment 1: Results and Discussion\nSuccess\nNumber of strikes. The number of strikes needed to open a\nnut and access the kernel differed significantly depending on the\nhammer (Friedman-test: X 2 = 10.3, P = 0.006, df = 2) (Figure 2).\nUsage of the heaviest tool required fewer hits than that of the\nlightest (Wilcoxon exact test Z = 22.201, P = 0.031) and mid-\nweight tool (Wilcoxon exact test Z = 22.201, P = 0.031). Although\nthere were no significant differences between the lightest and the\nmid-weight tool, a trend was seen (Wilcoxon exact test\nZ= 21.992, P = 0.063). An analysis for each individual showed\nthat the number of strikes needed differed significantly among the\nthree tools for all chimpanzees (Table 1).\nTime to solution. We found significant differences among\nthe three tools in the time needed to crack open the nut\n(Friedman-test: X 2 = 9.3, P = 0.009, df = 2) (Figure 3). Although\nthere was no difference in time needed between the heaviest and\nlightest hammers (Wilcoxon exact test Z = 21.577, P = 0.156),\nusage of the heaviest hammer required less time than the mid-\nweight hammer (Wilcoxon exact test Z = 22.207, P = 0.031).\nWhen employing the lightest tool, less time was needed than with\nthe mid-weight tool (Wilcoxon exact test Z = 22.201, P = 0.031).\nAnalyzing the data at the individual level revealed that the time\nneeded differed significantly depending on the hammer for Loi,\nNatsuki, Tsubaki, Mizuki and Misaki (Table 2). In contrast, no\nsuch differences were evident for Zamba.\nHammer type. Overall we found no significant differences in\nthe choice of tools that led to success, i.e., the hammer that\ncracked the nut (Friedman-test: X 2 = 1.182, P = 0.554, df = 2).\nWhen analyzing subjects’ individual choices, we found significant\ndifferences in tool choice that led to success only for Loi\n(X\n2 = 37.5, P ,0.001, df = 2, N1 = 21, N2 = 21, N3 = 66) and\nZamba (X2 = 6, P = 0.05, df = 2, N1 = 48, N2 = 30, N3 = 30). The\nremaining subjects showed no hammer preferences (Chi-square\ntests: Natsuki: X\n2 = 0.5, P = 0.779, df = 2, N1 = 33, N2 = 39,\nN3 = 36; Tsubaki: X 2 = 3.722, P = 0.155, df = 2, N1 = 34,\nN2 = 29, N3 = 45; Mizuki: X2 = 0.389,P = 0.823, df = 2, N1 = 39,\nN2 = 34, N3 = 35; Misaki: X2 = 3.556, P = 0.169,df = 2; N1 = 44,\nN2 = 36, N3 = 28).\nTool Selectivity\nFirst choice. Subjects as a group did not show any preference\nfor a certain tool (Friedman-test: X 2 = 2.8, P = 0.247, df = 2).\nFurthermore, none of the subjects’ observed individual choices\ndiverged from expected levels (Chi-square tests: Loi: X\n2 = 0.167,\nP = 0.92, df = 2, N1 = 11, N2 = 13, N3 = 12; Zamba: X2 = 2.167,\nP = 0.338, df = 2, N1 = 16, N2 = 11, N3 = 9; Natsuki: X 2 =0 ,\nP = 1, df = 2, N1 = 12, N2 = 12, N3 = 12; Tsubaki: X 2 = 0.167,\nP = 0.92, df = 2, N1 = 13, N2 = 12, N3 = 11; Mizuki: X2 = 0.167,\nP = 0.92, df = 2; N1 = 12, N2 = 13, N3 = 11; Misaki: X 2 = 1.167,\nP = 0.558, df = 2, N1 = 15, N2 = 10, N3 = 11).\nOverall choice. Subjects as a group showed no preference for\na particular tool (Friedman-test: X 2 = 0.333, P = 0.846, df = 2).\nAnalyzing the data at the individual level revealed that Loi\ndisplayed a clear preference for the heaviest hammer (X2 = 14.057,\nP = 0.001, df = 2, N1 = 45, N2 = 49, N3 = 82) while Zamba\nfavored the lightest hammer (X 2 = 6.615, P = 0.037, df = 2,\nN1 = 52, N2 = 34, N3 = 31). The remaining subjects showed no\npreference for a particular hammer (Chi-square tests: Natsuki:\nX\n2 = 0.349, P = 0.840, df = 2, N1 = 34, N2 = 39, N3 = 36; Tsubaki:\nX2 = 2.864, P = 0.239, df = 2, N1 = 39, N2 = 32, N3 = 47; Mizuki:\nX2 = 0.125, P = 0.939, df = 2, N1 = 39, N2 = 37, N3 = 36; Misaki:\nX2 = 2.619, P = 0.270, df = 2, N1 = 45, N2 = 37, N3 = 31).\nSwitching between tools. Table 3 presents the frequency of\ntool switching both prior and after using the hammer. Overall,\nsubjects showed no clear difference between the preference for\nswitching from light to heavy hammers or from heavy to light\nhammers (Wilcoxon exact test: Z = 21.16, P = 0.34). One\nindividual (Loi), however, showed a tendency for switching from\nlight to heavy hammers rather than vice versa (Binomial test:\nP = 0.057, N = 71), although this preference was mostly observed\nafter using the hammer.\nDiscussion of Experiment 1. Two chimpanzees, Loi and\nZamba, differentiated between three visually identical hammers\ndiffering only in weight to crack open a nut. In particular, these\ntwo subjects showed a preference for a certain hammer weight in\ntheir overall tool choice, and this selectivity emerged from the\nchimpanzees experiencing the differences in tool effectiveness. Loi\npreferred the heaviest (and most efficient) hammer, Zamba the\nlightest. None of our subjects showed an initial preference for a\ncertain hammer in their first choices. This absence excludes the\npossibility that our subjects had used any inadvertent cueing (e.g.,\nscratches on the tools’ surface) instead of weight. Subjects did not\nremain with the tool first chosen but switched from striking with\none tool to striking with another tool. Switching behavior, which\nfurther indicates that the tools were valued differently, was most\nfrequently recorded for Loi, who performed more switches from a\nlighter to a heavier tool than vice versa. Loi also showed a\npreference for a certain hammer weight in his choice of tools that\nled to success. In particular, Loi kept on using the heaviest\nhammer far more often than the mid-weight or lightest hammer\nuntil the nutshell cracked.\nFigure 2. Median number of strikes needed to crack open a nut\nin Experiment 1.Also shown are the IQR and significance tests.\ndoi:10.1371/journal.pone.0041044.g002\nDo Chimpanzees Use Weight to Select Hammer Tools?\nPLoS ONE | www.plosone.org 4 July 2012 | Volume 7 | Issue 7 | e41044\nNote here that Loi, who apparently outperformed all the other\nsubjects, had substantially greater experience in nut cracking,\nhaving been trained to crack nuts by humans in the past. The\nother chimpanzees had learned this behavior through social\nlearning sessions, Loi being the model [29]. It is plausible that\nLoi’s extensive experience allowed him to be more attentive to the\nrelevant tool properties. In fact, a study in human craftsmen has\nshown that skilled subjects take better advantage of the tool\nproperties [34]. Thus, in our study, although all subjects might\nhave perceived the weight differences, the deeper relationship\nbetween weight and efficiency was accessible only to Loi.\nIt is nevertheless surprising that tool selectivity did not emerge in\nall subjects, given that the hammers differed significantly in\neffectiveness. One explanation is that all tools were functional to\nsome extent, i.e. in the sense that with enough hits it was possible\nto crack the nutshell with all three tools. Using a lighter tool was\ntherefore not strictly a mistake, it was merely less efficient.\nConsequently, subjects might have used substandard tools because\nhammers have to be either functional or non functional or the\ndifference in efficiency has to be larger so that chimpanzees benefit\nmore from choosing a particular tool.\nFinally, hammer choice might not only be based on weight but\nalso be constrained by how easily a hammer can be held and\naccurately handled, which is size, weight and shape dependent.\nGiven that tool effectiveness in our study did not correlate linearly\nwith weight (i.e., using the lightest tool required fewer hits and\ntime than the mid-weight tool), this assumption is very likely.\nPerhaps the cuboidal shape of our provided tools is problematic\nfor accurate handling, as angles must be taken into account when\nmatching the hammer surface with the nut and anvil.\nExperiment 2\nIn Experiment 2 we modified the hammers shape and replaced\nthe cuboid with spherical hammers. Our aim was to measure\nwhether efficiency is affected by altered shape and consequentially\nif that shape reinforces tool selectivity.\nExperiment 2: Materials and Methods\nParticipants\nAll the subjects who had participated in Experiment 1 took part\nin Experiment 2.\nApparatus\nThree visually identical spherical aluminum hammers were\npresented as tools. The hammers were 7 cm in diameter and\nweighed 300 g, 600 g and 1200 g, respectively. The same anvil\nand nut species were used as in Experiment 1 (Figure 4).\nProcedure\nThe experiment took place from March until mid-May 2010.\nWe conducted one session of six trials per day, for a total of 6 daily\nsessions (36 trials, i.e., 36 nuts cracked open). Except for the\ndifferent hammers and the number of sessions administered, the\nexperimental procedure and data analyses were the same as in\nExperiment 1.\nExperiment 2: Results and Discussion\nSuccess\nNumber of strikes. The number of strikes needed to open a\nnut and access the kernel differed significantly depending on the\nhammer (Friedman-test: X 2 = 10.3, P = 0.006, df = 2) (Figure 5).\nThere was a significant difference in the number of hits needed to\ncrack open a nut between the heaviest and lightest hammers\n(Wilcoxon exact test Z = 22.201, P = 0.031). Using the heaviest\nTable 1.Average number of strikes (6SE) needed to solution for all subjects as a function of hammer weight in Experiment 1.\nHammer weight\nSubject 300 g 600 g 1200 g Kruskal-Wallis test: X 2 P-Values (df = 2) Pair-wise comparisons\nLoi 5.7 60.7 8.5 60.9 3.5 60.3 40.032 0.000 L , M , H\nZamba 5.8 60.7 7.4 61.4 4.6 61 6.654 0.036 L, M, H; M , H\nNatsuki 12.4 61.7 11.9 61.5 5.7 60.4 20.047 0.000 L, M , H\nTsubaki 11.1 61.5 12.8 61.9 7.4 60.8 9.044 0.011 L, M , H\nMizuki 5.5 60.5 8.2 61.3 3.5 60.4 17.914 0.000 L, M , H\nMisaki 5.5 60.5 9.4 61.5 4.1 61 24.146 0.000 L , M , H\nAlso shown are the results for the overall significance test and the corresponding pair wise comparisons (‘‘,’’ denotes a significant difference between hammers).\ndoi:10.1371/journal.pone.0041044.t001\nFigure 3. Median time needed to crack open a nut as a function\nof hammer weight in Experiment 1.\ndoi:10.1371/journal.pone.0041044.g003\nDo Chimpanzees Use Weight to Select Hammer Tools?\nPLoS ONE | www.plosone.org 5 July 2012 | Volume 7 | Issue 7 | e41044\ntool, however, did not require significantly fewer hits than the mid-\nweight tool (Wilcoxon exact test Z = 21.472, P = 0.188). In\ncontrast to Experiment 1, employing the lightest hammer\nnecessitated more hits than the mid-weight hammer (Wilcoxon\nexact test Z = 22.201, P = 0.031). Analyzing the data on an\nindividual level (Table 4) showed that strike number to crack a nut\ndiffered significantly among the three tools for all subjects except\nTsubaki.\nTime to solution. The time needed differed significantly\namong the three tools (Friedman-test: X 2 = 7, P = 0.030, df = 2)\n(Figure 6). When employing the lightest hammer, more time was\nneeded than with the mid-weight hammer (Wilcoxon exact test\nZ= 22.207, P = 0.031). The use of the heaviest tool required less\ntime than the lightest tool, although this finding did not reach\nsignificance level (Wilcoxon exact test Z = 21.997, P = 0.063).\nSimilarly, time usage did not differ between the heaviest and mid-\nweight tool (Wilcoxon exact test Z = 20.946, P = 0.406). At the\nindividual level, the time needed to crack the nut differed\nsignificantly among the three tools for Loi, Zamba and Misaki\n(Table 5). No differences were found for Natsuki, Tsubaki and\nMizuki.\nHammer type. The frequency in the choice of tools that led\nto success, i.e., the hammer that cracked the nut, differed\nsignificantly at the group level (Friedman-test: X\n2 = 7.636,\nP = 0.022, df = 2). At the individual level, however, the difference\nwas not significant (Chi-square tests: Loi: X\n2 = 4.5, P = 0.105,\ndf = 2, N1 = 6, N2 = 15, N3 = 15; Zamba: X 2 = 1.5, P = 0.472,\ndf = 2, N1 = 12, N2 = 9, N3 = 15; Natsuki: X 2 = 1.5, P = 0.472,\ndf = 2, N1 = 9, N2 = 12, N3 = 15; Tsubaki: X 2 = 4.5, P = 0.105,\ndf = 2, N1 = 6, N2 = 15, N3 = 15; Mizuki: X2 = 3.167, P = 0.205,\ndf = 2, N1 = 9, N2 = 10, N3 = 17; Misaki: X 2 = 1.167,\nP = 0.558,df = 2, N1 = 11, N2 = 10, N3 = 15).\nTool Selectivity\nFirst choice. As a group subjects first choice behavior did not\ndeviate significantly from chance (Friedman-test: X 2 = 5.143,\nP = 0.076, df = 2). A statistical analysis at the individual level was\nnot possible due to the small sample size: Loi (300 g N = 2; 600 g\nN = 5; 1200 g N = 5), Zamba (300 g N = 4; 600 g N = 3;\n1200 g = 5), Natsuki (300 g N = 4; 600 g N = 4; 1200 g N = 4),\nTsubaki (300 g N = 2; 600 g N = 5; 1200 g N = 5), Mizuki (300 g\nN = 3; 600 g N = 4; 1200 g N = 5) and Misaki (300 g N = 4; 600 g\nN = 4; 1200 g N = 4).\nOverall choice. Subjects as a group showed a preference for\nthe heaviest hammer (Friedman-test: X 2 = 7.636, P = 0.022,\ndf = 2). The heaviest tool was chosen significantly more often\nthan the lightest tool (Wilcoxon test Z = 22.214, P = 0.027) and\nmore often than the mid-weight tool, although the latter finding\ndid not reach significance level (Wilcoxon test Z = 21.826,\nP = 0.068). The frequency with which the lightest and the mid-\nweight tool were chosen also did not deviate from chance level\n(Wilcoxon test Z = 21.054, P = 0.292).\nOn an individual level, the subjects choice of tools did not differ\nsignificantly (Chi-square tests: Loi: X\n2 = 4.5, P = 0.105, df = 2,\nN1 = 6, N2 = 15, N3 = 15; Zamba: X 2 = 1.5, P = 0.472, df = 2,\nN1 = 12, N2 = 9, N3 = 15; Natsuki: X 2 = 1, P = 0.607, df = 2,\nN1 = 10, N2 = 13, N3 = 15; Tsubaki: X2 = 4.5, P = 0.105, df = 2,\nN1 = 6, N2 = 15, N3 = 15; Mizuki: X2 = 3.167, P = 0.205, df = 2,\nN1 = 9, N2 = 10, N3 = 17; Misaki: X 2 = 1.027, P = 0.598, df = 2,\nN1 = 12, N2 = 10, N3 = 15).\nSwitching between tools. Only Natsuki and Misaki switched\ntools, but they did so infrequently (Table 6). Switches occurred\nonly after subjects had already performed several strikes with the\ninitial tool.\nDiscussion of Experiment 2. Compared to Experiment 1,\nsubjects as a group developed a preference for the heaviest (and\nmost efficient) hammer, although that preference was not apparent\nin chimpanzees’ first choices. The fact that they kept on using the\nheaviest hammer significantly more often than the lightest\nhammer until the nutshell cracked, also indicates their heightened\nsensitivity to hammer weight. This result supports the data on\nhammer efficiency because heavier hammers required fewer hits\nand less time. In fact, unlike in Experiment 1, tool effectiveness in\nExperiment 2 did correlate linearly with weight (i.e., using a lighter\nTable 2.Average time (6SE) to solution for all subjects as a function of hammer weight.\nHammer weight\nSubject 300 g 600 g 1200 g Kruskal-Wallis test: X 2 P-Values (df = 2) Pair-wise comparisons\nLoi 7.4 61.5 10.9 61.6 4.2 60.4 33.518 0.000 L , M, H\nZamba 7.5 60.9 13.1 648 61.6 0.672 0.715 L, M, H\nNatsuki 11.7 62.4 11.8 61.8 6.7 60.5 6.429 0.040 L, M , H\nTsubaki 12.9 62.7 15.5 63.3 7.9 61 6.509 0.039 L, M, H; M , H\nMizuki 4.7 60.3 9.3 62.5 4.9 60.9 8.819 0.012 L, M , H\nMisaki 7.1 60.9 11.1 625 . 2 61.1 20.046 0.000 L , M , H\nAlso shown are the results for the overall significance test and the corresponding pair-wise comparisons (‘‘,’’ denotes a significant difference between hammers).\ndoi:10.1371/journal.pone.0041044.t002\nTable 3.Number of total switches observed as a function of\nhammer weight (L = 300 g, M = 600 g, H = 1200 g) and the\ndirection of switches (L-.H = from lighter to a heavier; H-\n.L = from heavier to lighter) in Experiment 1.\nTotal switches after use before use\nSubject L M H L- .HH - .LL - .HH - .L\nL O I 2 62 81 74 2 2 6 2 1\nZAMBA 5 4 1 6 3 1 0\nNATSUKI 1 0 0 1 0 0 0\nTSUBAKI 5 3 2 7 3 0 0\nMIZUKI 1 3 1 2 2 1 0\nMISAKI 1 2 5 1 4 0 3\nTOTAL 39 40 26 59 38 4 4\ndoi:10.1371/journal.pone.0041044.t003\nDo Chimpanzees Use Weight to Select Hammer Tools?\nPLoS ONE | www.plosone.org 6 July 2012 | Volume 7 | Issue 7 | e41044\ntool required more hits and time than a heavier tool). Nonetheless,\nattributing this difference solely to hammer shape would be\npremature because subjects also had more nut-cracking experience\nin Experiment 2 than Experiment 1.\nExperiment 3\nIn Experiment 3 we modified the weight of the spheric\nhammers to increase the discrepancy in tool efficiency and\nmeasure how that affected tool selectivity.\nExperiment 3: Materials and Methods\nParticipants\nAll the subjects who had participated in Experiment 2 took part\nin Experiment 3.\nApparatus\nThree visually identical spherical aluminum hammers were\npresented as tools. The hammers were 7 cm in diameter and\nweighed 200 g, 800 g, and 1400 g, respectively. The same anvil\nand nut species was used as in Experiment 2.\nProcedure\nThe experiment took place from mid-May until October 2010.\nWe conducted one session of six trials per day, for a total of 12\ndaily sessions (72 trials, i.e., 72 nuts cracked open). Except for the\ndifferent hammers and the number of sessions administered, the\nexperimental procedure was the same as in Experiment 1.\nAnalyses were also the same as in previous experiments.\nExperiment 3: Results and Discussion\nSuccess\nNumber of strikes. The number of necessary strikes differed\nsignificantly depending on the hammer (Friedman-test:\nX\n2 = 11.57, P = 0.003, df = 2) (Figure 7). Usage of the heaviest\ntool required fewer hits than that of the lightest tool (Wilcoxon\nexact test Z = 22.201, P = 0.031). Although there was no\nsignificant difference in strike number between heaviest and\nmid-weight hammers, a trend was seen (Wilcoxon exact test\nZ= 22.023, P = 0.063). The lightest hammer required more\nstrikes than the mid-weight one (Wilcoxon exact test Z = 22.201,\nP = 0.031). On an individual level, the number of necessary strikes\ndiffered significantly among the three tools for all subjects except\nfor Tsubaki (Table 7).\nFigure 4. A chimpanzee using a spherical hammer to crack open a nut in a pit of the anvil.\ndoi:10.1371/journal.pone.0041044.g004\nDo Chimpanzees Use Weight to Select Hammer Tools?\nPLoS ONE | www.plosone.org 7 July 2012 | Volume 7 | Issue 7 | e41044\nTime to solution. The time needed to crack a nut differed\nsignificantly between the three tools (Friedman-test: X 2 = 10.3,\nP = 0.006, df = 2) (Figure 8). As with the number of strikes, using\nthe heaviest hammer required less time than the lightest one\n(Wilcoxon exact test Z = 22.201, P = 0.031) but there was no\ndifference between the heaviest and the mid-weight tool (Wilcoxon\nexact test Z = 21.782, P = 0.094). Usage of the lightest hammer\nrequired more time than of the mid-weight one (Wilcoxon exact\ntest Z = 22.201, P = 0.031). At the individual level, the time\nneeded to crack a nut differed significantly among the three tools\nfor Loi, Zamba, Natsuki and Mizuki (Table 8), but not for Tsubaki\nand Misaki.\nHammer type. The frequency in the choice of tools that led\nto success, i.e., the hammer that cracked the nut, differed\nsignificantly at group level (Friedman-test: X\n2 = 7.636, P = 0.022,\ndf = 2). When analyzing subjects individual choices, the choice of\ntools differed significantly for all subjects (Chi-square tests: Loi:\nX\n2 = 21, P = 0.000, df = 2, N1 = 6, N2 = 36, N3 = 30; Zamba:\nX2 = 9.08, P = 0.011, df = 2, N1 = 12, N2 = 29, N3 = 31; Tsubaki:\nX2 = 25.75, P = 0.000, df = 2, N1 = 4, N2 = 37, N3 = 31; Mizuki:\nX2 = 19, P = 0.000, df = 2, N1 = 8, N2 = 26, N3 = 38; Misaki:\nX2 = 21, P = 0.000, df = 2, N1 = 6, N2 = 30, N3 = 36). The\nexception was Natsuki, who showed no hammer preference\n(X\n2 = 0, P = 1, df = 2 N1 = 24, N2 = 24, N3 = 24).\nTool Selectivity\nFirst choice. As a group, subjects first choice behavior did\nnot deviate significantly from chance (Friedman-test: X 2 =2 ,\nP = 0.368, df = 2). Furthermore, none of the subjects’ observed first\nchoices diverged from expected (Chi-square tests: Loi: X\n2 = 0.250,\nP = 0.882, df = 2, N1 = 7, N2 = 8, N3 = 9; Zamba: X 2 = 0.000,\nP = 1, df = 2, N1 = 8, N2 = 8, N3 = 8; Natsuki: X2 = 0.000, P = 1,\ndf = 2, N1 = 8, N2 = 8, N3 = 8; Tsubaki: X 2 = 0.250, P = 0.882,\ndf = 2, N1 = 8, N2 = 9, N3 = 7; Mizuki: X 2 = 0.250, P = 0.882,\ndf = 2, N1 = 7, N2 = 8, N3 = 9 and Misaki: X 2 = 0.000, P = 1,\ndf = 2, N1 = 8, N2 = 8, N3 = 8).\nOverall choice. Subjects as a group preferred the heaviest\nhammer (Friedman-test: X2 = 7.6, P = 0.022, df = 2). It was chosen\nFigure 5. Median number of strikes needed to crack a nut in\nExperiment 2.Also shown are the IQR and significance tests.\ndoi:10.1371/journal.pone.0041044.g005\nTable 4.Average number of strikes (6SE) needed to solution for all subjects as a function of hammer weight in Experiment 2.\nHammer weight\nSubject 300 g 600 g 1200 g Kruskal-Wallis test: X 2 P-Value (df = 2) Pair-wise comparisons\nLoi 8.8 60.9 5.1 60.5 4.3 60.6 12.604 0.002 L , M, H\nZamba 7.9 60.7 5.8 60.6 3.6 60.6 16.429 0.000 L , M , H\nNatsuki 17.4 62.9 9 61.5 10.1 61.6 7.144 0.028 L , M, H\nTsubaki 8.8 61.2 8.2 60.9 7.6 61 0.909 0.635 L, M, H\nMizuki 8.4 61 5.7 614 . 6 60.7 7.644 0.022 L, M, H; L , H\nMisaki 9.4 61.1 6.6 613 . 2 60.5 19.223 0.000 L, M , H\nAlso shown are the results for the overall significance test and the corresponding pair-wise comparisons (‘‘,’’ denotes a significant difference between hammers).\ndoi:10.1371/journal.pone.0041044.t004\nFigure 6. Median time needed to crack open a nut as a function\nof hammer weight in Experiment 2.\ndoi:10.1371/journal.pone.0041044.g006\nDo Chimpanzees Use Weight to Select Hammer Tools?\nPLoS ONE | www.plosone.org 8 July 2012 | Volume 7 | Issue 7 | e41044\nsignificantly more often than the lightest one (Wilcoxon test\nZ= 22.023, P = 0.043). No difference in the frequency of choice\nwas found between the heaviest and the mid-weight tool\n(Wilcoxon test Z = 20.412, P = 0.680). The lightest tool was\nchosen significantly less often than the mid-weight one (Wilcoxon\ntest Z = 22.032, P = 0.042).\nAt an individual level, a significant difference was detected in\nLoi’s, Mizuki’s, Misaki’s and Tsubakis choice of tools (Chi-square\ntests: Loi: X 2 = 12, P = 0.002, df = 2, N1 = 12, N2 = 36, N3 = 30;\nMizuki: X 2 = 11.077, P = 0.004, df = 2, N1 = 14, N2 = 26,\nN3 = 38; Misaki: X 2 = 9.7, P = 0.008, df = 2, N1 = 14, N2 = 30,\nN3 = 36 and Tsubaki: X 2 = 15.462, P ,0.001, df = 2, N1 = 10,\nN2 = 37, N3 = 31). No differences were found for Zamba and\nNatsuki (Chi-square tests: Zamba: X 2 = 4.468, P = 0.107, df = 2,\nN1 = 17, N2 = 29, N3 = 31; Natsuki: X 2 = 0.000, P = 1, df = 2,\nN1 = 24, N2 = 24, N3 = 24).\nSwitching between tools. Table 9 presents the frequency of\ntool switching both prior and after using the hammer. Subjects\nshowed a preference for switching more from light to heavy\nhammers than from heavy to light ones, although the differences\nwere not significant (Wilcoxon exact test: Z = 22.023, P = 0.063).\nDiscussion of Experiment 3. Subjects as a group preferred\nthe heaviest (and most efficient) hammer. Although we presented\nnew weights, selectivity quickly emerged in most subjects after\nexperiencing the differences in tool effectiveness. Besides Natsuki,\nthe infant, all subjects chose the lightest hammer less often than\nthe heavier ones. This behavior is not surprising given that using\nthe lightest hammer required the most number of hits and time to\nsuccess. Thus, the discrepancy in tool efficiency was perceived so\nthat subjects benefited more from choosing a particular tool. In\nfact, most of the subjects started to avoid the lightest tool: they\nswitched from the lightest to a heavier tool in 28 instances. The\nopposite switch never occurred; importantly, in several instances,\nsubjects switched from the lightest tool before using it, indicating\nthat subjects switched the moment they lifted it and experienced its\nweight. This strongly suggests that switching was not determined\nby a failure to crack the nut. Rather, switching was based on\nanticipating the outcome of the used hammer. Tool selectivity was\nfurther evident in the choice of tools that led to success, i.e. the\nhammer that cracked the nut. In particular, all subjects, besides\nNatsuki, kept on using the heaviest and mid-weight hammer far\nmore often than the lightest hammer until the nutshell cracked\nopen. Interestingly, the chimpanzees clearly avoided using the\nlightest and least efficient tool, but did not differ in their choice\nbetween the mid-weight and heaviest tool. Given that the\ndifference in effectiveness between the mid-weight and the heaviest\nhammer was small (especially compared with the lightest hammer)\nthis finding is not surprising, as subjects might not have really\nbenefited from preferring one of these tools. In summary, our\nresults show that 1) not only does hammer weight determine tool\nefficiency, but a combination of weight, shape and size because\nTable 5.Average time (6SE) to solution for all subjects as a function of hammer weight.\nHammer weight\nSubject 300 g 600 g 1200 g Kruskal-Wallis test: X 2 P-Values (df = 2) Pair-wise comparisons\nLoi 7.5 61 5.4 60.4 4.8 60.6 8.356 0.015 L , M, H\nZamba 6.1 60.4 4.9 60.5 3.8 60.5 14.097 0.001 L, M , H\nNatsuki 9 61.4 6.3 60.9 9.9 62.4 2.763 0.251 L, M, H\nTsubaki 8.4 62 6.3 60.6 5.7 60.6 1.740 0.419 L, M, H\nMizuki 6.4 60.6 5 60.8 4.3 60.5 5.892 0.053 L, M, H; L , H\nMisaki 9.8 61.8 5.8 60.8 3.2 60.3 15.516 0.000 L, M , H\nAlso shown are the results for the overall significance test and the corresponding pair-wise comparisons (‘‘,’’ denotes a significant difference between hammers).\ndoi:10.1371/journal.pone.0041044.t005\nTable 6.Number of total switches observed as a function of\nhammer weight (L = 300 g, M = 600 g, H = 1200 g) and the\ndirection of switches (L-.H = from lighter to a heavier; H-\n.L = from heavier to lighter) in Experiment 2.\nSwitches after use\nSubject L M H L- .HH - .L\nNATSUKI 1 1 0 1 1\nMISAKI 1 0 0 1 0\nTOTAL 2 1 0 2 1\ndoi:10.1371/journal.pone.0041044.t006\nFigure 7. Median number of strikes needed to crack open a nut\nin Experiment 3.Also shown are the IQR and significance tests.\ndoi:10.1371/journal.pone.0041044.g007\nDo Chimpanzees Use Weight to Select Hammer Tools?\nPLoS ONE | www.plosone.org 9 July 2012 | Volume 7 | Issue 7 | e41044\nthis determines accurate handling and 2) chimpanzees are selective\nin hammer choice (regarding weight) only when they really benefit\nfrom choosing a particular tool.\nDiscussion\nChimpanzees preferred to use heavier hammers that required\nfewer hits and less time to crack open nuts. Since all hammers\nshared the same visual features in terms of size and appearance,\nhammers were selected according to their relative effectiveness\nbased on their weight. In particular, the choice of a ‘‘good’’\nhammer necessitated attributing a specific function to weight as a\ntool property, namely that higher weight increased the efficiency of\na single strike. This extends and refines the results of previous\nstudies, obtained from wild chimpanzees, in which heavier\nhammers were preferred over lighter ones [30], [12], [9]. As the\nhammers in all these studies differed in several characteristics (size,\nmaterial, weight), the question whether chimpanzees choices were\nbased on weight remained unanswered. Our results provide\nconclusive evidence that chimpanzees use weight alone in selecting\ntools to crack open nuts.\nExperience seemed to play a major role in determining\nperformance, as our most proficient subject, Loi, outperformed\nthe other chimpanzees from the early beginning of the experiment.\nAlready in Experiment 1, Loi clearly made discriminative use of\nthe available tools, using weight to select an appropriate hammer.\nHe showed a preference for the heaviest (and most efficient)\nhammer and switched twice as much from a lighter to a heavier\ntool than vice versa. Loi’s prior experience in nut cracking could\nexplain his early apprehension of weight as having a relevant\nfunction for nut-cracking tools (specifically, that weight is directly\nrelated to the effort and time required).\nA study on the ability of captive capuchin monkeys to select\nhammers according to weight and effectiveness [35] revealed that\nselectivity for the heaviest hammer emerged very soon in the most\nproficient subject, Pepe. The authors argued that Pepe’s prior\nexperience with tool-mediated nut cracking could account for this\nrapidity. Furthermore, when Visalberghi et al. [32] provided semi-\nfree ranging capuchin monkeys with stone tools of different\neffectiveness to crack open nuts, these wild capuchins outper-\nformed captive capuchins tested in a similar task [7], [35]. The\nwild capuchins’ superior performance was attributed to a lifelong\nexperience with a variety of nuts and stones and cracking open\nnuts on a daily basis [7]. This experience allowed subjects to\nrecognize the properties that made a hammer tool effective.\nNevertheless, it is remarkable that most of the subjects in\nExperiment 1, who showed no discriminative use of the presented\ntools, started being selective within a few trials in Experiment 2. By\nthe end of Experiment 3, their performance was even comparable\nto Loi’s, our most experienced subject. It is conceivable that the\nimproved performance can be attributed to the changes in\nhammer shape and weight in Experiments 2 and 3. However, it is\nalso possible that this preference developed as a result of being\nconfronted with the task multiple times over the course of the\nstudy.\nHammer shape may have been another potential contributing\nfactor to the observed increase in selectivity. Compared to the\ncuboid-shaped hammers, spherically-shaped ones might have\nallowed subjects to better grab and handle them when striking\nthe nut. Fragaszy et al. [36] stated that the efficiency in capuchin\nmonkeys’ nut-cracking activity depends on the subjects’ control of\nthe stone and the angle of its impact on the nut. This could also be\nthe case for our chimpanzees, especially given our own observa-\ntions that the cuboidal hammers in Experiment 1 sometimes\ncaused difficulties for the chimpanzees when trying to contact the\nhammer’s surface with the nut. As the impact of the strike depends\nTable 7.Average number of strikes (6SE) needed to solution for all subjects as a function of hammer weight in Experiment 3.\nHammer weight\nSubject 200 g 800 g 1400 g Kruskal-Wallis test: X 2 P-Values (df = 2) Pair-wise comparisons\nLoi 11.0 61.2 6.0 60.5 3.9 60.3 22.774 0.000 L , M , H\nZamba 14.0 62.0 5.6 60.6 3.9 60.4 27.474 0.000 L , M , H\nNatsuki 18.6 62.6 7.5 60.8 6.0 60.7 31.747 0.000 L , M, H\nTsubaki 17 64.8 7.2 60.5 7.2 60.9 5.862 0.053 L , M, H\nMizuki 10.8 62.2 6.3 60.8 4.1 60.4 13.267 0.001 L , M , H\nMisaki 16 63.8 5.5 60.5 4.1 60.3 15.120 0.001 L , M , H\nAlso shown are the results for the overall significance test and the corresponding pair-wise comparisons (‘‘,’’ denotes a significant difference between hammers).\ndoi:10.1371/journal.pone.0041044.t007\nFigure 8. Median time needed to crack open a nut as a function\nof hammer weight in Experiment 3.\ndoi:10.1371/journal.pone.0041044.g008\nDo Chimpanzees Use Weight to Select Hammer Tools?\nPLoS ONE | www.plosone.org 10 July 2012 | Volume 7 | Issue 7 | e41044\non the amount of contact between the hammer and the nut [33]\nsubjects sometimes had to reposition the tool in their hand when\nthey applied insufficient force while striking the nut, which\nrequired taking the angles of the hammer into account.\nPotentially, the important role of weight was masked by the\ndifficulties subjects experienced in trying to accurately handle the\ntools. Given that tool effectiveness in Experiment 1 did not\ncorrelate linearly with weight (i.e. the lightest tool required fewer\nhits and less time than the mid-weight tool), this assumption is very\nlikely.\nExperience alone, however, is not the whole explanation for\nproficient selection of appropriate hammers. Natsuki, the only\ninfant in our study sample, never improved her performance over\nthe course of the experiments, even though she received the same\nexperience as most of the chimpanzees in the study. Even in\nExperiment 3, where the differences in tool efficiency differed\ndrastically, Natsuki still selected all three tools the same number of\ntimes and never switched tools. This fits the observations in wild\njuvenile chimpanzees, who sometimes use hammers that are too\nlight to crack open a nut, whereas adults always use heavy tools\n[37]. Taken together, the amount of experience in nut-cracking\nactivity is apparently a strong predictor for the chimpanzees’\nability to choose a tool, but maturational aspects also play an\nimportant role in determining tool selectivity and proficiency.\nCapuchin monkeys gained information about the weight of the\nstones by moving, lifting or tapping them [32] before making their\nfirst selection of a stone to be used as hammer. Moreover, they\nsearched for the critical feature (weight) when other cues were\nidentical or contradicted the critical feature. Brosnan [38]\ninterpreted these findings as evidence that capuchins had a true\nunderstanding of the contingencies of tool use. In her opinion,\nprevious tool-use studies could not differentiate whether animals\ntruly understood the parameters of the task or simply learned\nthrough trial-and-error which tools are the most effective\n(including wild chimpanzees that chose nut-cracking tools based\non the hardness of the nut) [12].\nAlthough inspecting and switching tools before use was far less\nfrequent than doing so after use in the current study, we did\nobserve a number of occasions when chimpanzees inspected\nhammers and switched between them prior to using them. This\nsuggests that our subjects attributed a specific function to tool\nweight, namely that weight is directly related to the effort (via\nnumber of strikes and time) required to crack open a nut.\nConceivably, the higher prevalence for inspection before use in\nwild capuchins compared to captive chimpanzees was related to\nthe testing conditions in each study. Recall, that Visalberghi et al.\n[32] presented capuchins with two hammers differing considerably\nin weight (639 versus 1820 g) and thus effectiveness. Moreover, the\ntools were placed at least 3 m to 12.6 m away from the anvils.\nUnder such circumstances the benefits an animal obtains by\nselecting the appropriate tool in advance is maximized. Thus, it is\nreasonable that capuchin monkeys inspected hammer weight\nbefore starting the costly transportation process. In the current\nstudy the weight difference was smaller and all hammers were\nplaced next to the anvil. Consequently, no hammer transportation\nwas necessary.\nIn a follow-up study, Fragaszy et al. [36] presented the same\ncapuchins with a choice of two stones that differed less in weight\n(213 versus 572 g) and placed only 50 cm away from the anvil.\nThis considerably reduced the cost of switching from using one\nstone to another. In contrast to another study [32] where no\nmonkey returned to carry the second stone to the anvil, Fragaszy\net al. [36] reported that monkeys switched 19 times (out of 169\ntrials) from using one stone to another stone in the course of trying\nto crack a single nut. This switch after initial use indicates that they\neither applied insufficient search for weight before tool selection or\nthat they had difficulties in recognizing the smaller weight\ndifference.\nIt is important to emphasize that, even if chimpanzees showed\nfewer behaviors to gain weight information of the tools in advance,\nthis, by itself, does not indicate a poorer understanding of the\nfunctional characteristics of the tool. Previous studies have shown\nthat chimpanzees are able to gain weight information to find\nhidden food [39] and can infer the location of food based on the\nTable 8.Average time (6SE) to solution for all subjects as a function of hammer weight.\nHammer weight\nSubject 200 g 800 g 1400 g Kruskal-Wallis test: X 2 P-Value (df = 2) Pair-wise comparisons\nLoi 9 61 6.1 60.4 4.4 60.3 16.727 0.000 L , M , H\nZamba 14.3 63.4 5.9 60.9 3.9 60.4 24.090 0.000 L , M , H\nNatsuki 11.3 61.3 5.5 60.4 5.4 60.4 21.402 0.000 L , M, H\nTsubaki 11.4 63.3 5.4 60.3 5.7 60.6 5.234 0.073 L , M, H\nMizuki 8.2 62 5.4 60.6 3.9 60.3 7.635 0.022 L, M, H; L , H\nMisaki 15.1 63.6 5.3 60.4 4.6 60.3 13.045 0.001 L , M, H\nAlso shown are the results for the overall significance test and the corresponding pair-wise comparisons (‘‘,’’ denotes a significant difference between hammers).\ndoi:10.1371/journal.pone.0041044.t008\nTable 9.Number of total switches observed as a function of\nhammer weight (L = 300 g, M = 600 g, H = 1200 g) and the\ndirection of switches (L-. H = from lighter to heavier; H-\n.L = from heavier to lighter) in Experiment 3.\nTotal switches after use before use\nSubject L M H L- .HH - .LL - .HH - .L\nL O I 5 0 1 4011\nZAMBA 5 0 0 5 0 0 0\nNATSUKI 0 0 0 0 0 0 0\nTSUBAKI 10 1 0 6 0 4 1\nMIZUKI 7 0 0 6 0 1 0\nMISAKI 10 1 1 7 0 4 1\nTOTAL 37 2 2 28 0 10 3\ndoi:10.1371/journal.pone.0041044.t009\nDo Chimpanzees Use Weight to Select Hammer Tools?\nPLoS ONE | www.plosone.org 11 July 2012 | Volume 7 | Issue 7 | e41044\neffect that its weight has on other objects [40]. In the present\nstudy, chimpanzees started to switch tools already before using\nthem, and this behavior became more frequent when the weight\ndifferences were increased (Exp. 3). Taken together, we believe\nthat the benefit an animal obtains when choosing a particular tool\n(measured by the different efficiencies of the presented tools),\ntogether with the cost of switching to another tool (measured by\nthe distance between tool and anvil), determines to a large extent\ntool selectivity.\nConclusion\nOur findings show that chimpanzees actively choose appropri-\nate hammers, based solely on weight, to crack open nuts. Encoding\nthe requirements that a nut-cracking tool should meet (in terms of\nweight) to be effective therefore lies within chimpanzees’\ncapabilities. Experience in nut cracking clearly affects subjects’\nattentiveness to the tool properties relevant for the task: Loi, our\nmost skilled subject, showed superior performance, and all other\nindividuals improved over the course of the experiments (except\nfor the infant). Studies with wild, skilled and unskilled nut-cracking\nchimpanzees would help us to better determine the role that\nexperience plays in tool selectivity.\nAuthor Contributions\nConceived and designed the experiments: CS JC SH. Performed the\nexperiments: KF SH. Analyzed the data: CS JC. Contributed reagents/\nmaterials/analysis tools: JC SH. Wrote the paper: CS JC.\nReferences\n1. Boesch C (1991) Handedness in wild chimpanzees. International Journal of\nPrimatology 12: 541–558.\n2. Inoue-Nakamura N, Matsuzawa T (1997) Development of stone tool use by wild\nchimpanzees (Pan troglodytes). Journal of Comparative Psychology 111: 159–\n173.\n3. Sugiyama Y (1993) Local variation of tools and tool use among wild chimpanzee\npopulations. In: Berthelet A, Chavaillon J, editors. The use of tools by human\nand non-human primates. Clarendon Press, Oxford, 175–187.\n4. Sugiyama Y, Koman J (1979) Social structure and dynamics of wild\nchimpanzees at Bossou, Guinea. Primates 20: 323–339.\n5. Matsuzawa T (1994) Field experiments on use of stone tools by chimpanzees in\nthe wild. In: Wrangham RW, McGrew WC, de Waal FBM, Heltone PG,\neditors. Chimpanzee cultures. Harvard University Press, Cambridge. 351–370.\n6. Matsuzawa T (1996) Chimpanzee intelligence in nature and in captivity:\nisomorphism of symbol use and tool use. In: McGrew WC, Marchant LF,\nNishida T, editors. Great Ape Societies. Cambridge University Press. 196–209.\n7. Fragaszy DM, Izar P, Visalberghi E, Ottoni EB, de Oliviera MG (2004) Wild\ncapuchin monkeys (Cebus libidinosus) use anvils and stone pounding tools.\nAmerican Journal of Primatology 64: 359–366.\n8. Sugiyama Y (1981) Observations of the population dynamics and behavior of\nwild chimpanzees at Bossou, Guinea, in 1979–1980. Primates 22: 435–444.\n9. Biro D, Sousa C, Matsuzawa T (2006) Ontogeny and cultural propagation of\ntool use by wild chimpanzees at Bossou, Guinea: case studies in nut-cracking and\nleaf folding. In: Matsuzawa T, Tomonaga M, Tanaka M, editors. Cognitive\nDevelopment in Chimpanzees. Tokyo: Springer. 476–508.\n10. Beatty H (1951) A note on the behavior of the chimpanzee. Journal of\nMammalogy 32: 118.\n11. Struhsaker TT, Hunkeler P (1971) Evidence of tool-using by chimpanzees in the\nIvory Coast. Folia Primatologica 15: 212–219.\n12. Boesch C, Boesch H (1983) Optimisation of nut-cracking with natural hammers\nby wild chimpanzees. Behaviour 83: 265–286.\n13. Anderson JR, Williamson EA, Carter J (1983) Chimpanzees of Sapo Forest,\nLiberia: Density, nests, tools and meat-eating. Primates 24: 594–601.\n14. Hannah AC, McGrew WC (1987) Chimpanzees using stones to crack open oil\npalm nuts in Liberia. Primates 28: 31–46.\n15. Whitesides GH (1985) Nut-cracking by wild chimpanzees in Sierra Leone, West\nAfrica. Primates 26: 91–94.\n16. Goodall J (1986) The chimpanzees of Gombe: patterns of behavior. Belknap\nPress, Cambridge.\n17. Nishida T (1990) The chimpanzees of the Mahale mountains: sexual and life\nhistory strategies. University of Tokyo Press, Tokyo.\n18. Morgan BJ, Abwe EE (2006) Chimpanzees use stone hammers in Cameroon.\nCurrent Biology 16: R632–R633.\n19. McGrew WC, Ham RM, White LJT, Tutin CEG, Fernandez M (1997) Why\ndont chimpanzees in Gabon crack nuts? International Journal of Primatology\n18: 353–374.\n20. Whiten A, Goodall J, McGrew WC, Nishida T, Reynolds V, Sugiyama Y, Tutin\nCEG, Wrangham RW, Boesch C (1999) Cultures in chimpanzees. Nature\n399682–685.\n21. Boesch C, Boesch H (1984) The nut-cracking behavior and its nutritional\nimportance in wild chimpanzees in the Taı ¨ National Park, Ivory Coast.\nInternational Journal of Primatology 5: 323.\n22. Boesch C, Boesch-Achermann H (2000) The chimpanzees of the Taı ¨ forest:\nBehavioural ecology and Evolution. Oxford: Oxford University Press.\n23. Matsuzawa T, Biro D, Humle T, Inoue-Nakamura N, Tonooka R, Yamakoshi\nG (2001) Emergence of culture in wild chimpanzees: education by master-\napprentice-ship. In: Matsuzawa T, editor. Primate origins of human cognition\nand behavior. Springer, Tokyo. 557–574.\n24. Boesch C, Boesch H (1990) Tool use and tool making in wild chimpanzees. Folia\nPrimatologica 54: 86–99.\n25. Sumita K, Kitahara-Frisch J, Norikoshi K (1985) The acquisition of stone-tool\nuse in captive chimpanzees. Primates 26: 168–181.\n26. Hayashi M, Mizuno Y, Matsuzawa T (2005) How does stone-tool use emerge?\nIntroduction of stones and nuts to naı¨ve chimpanzees in captivity. Primates 46:\n91–102.\n27. Matsuzawa T (2003) The Ai project: historical and ecological contexts. Animal\nCognition 6: 199–211.\n28. Ross SR, Milstein MS, Calcutt SE, Lonsdorf EV (2010) Preliminary Assessment\nof Methods Used to Demonstrate Nut-Cracking Behavior to Five Captive\nChimpanzees (Pan troglodytes). Folia Primatologica 81: 224–232.\n29. Hirata S, Morimura N, Houki C (2009) How to crack nuts: acquisition process\nin captive chimpanzees (Pan troglodytes) observing a model. Animal Cognition\n12: 87–101.\n30. Sakura O, Matsuzawa T (1991) Flexibility of wild chimpanzee nut-cracking\nbehaviour using stone hammers and anvils: an experimental analysis. Ethology\n87: 237–248.\n31. Liu Q, Simpson K, Izar P, Ottoni E, Visalberghi E, Fragaszy D (2009)\nKinematics and energetic of nut-cracking in wild capuchin monkeys (Cebus\nlibidinosus) in Piaui, Brazil. American Journal of Physical Anthropology 138:\n210–220.\n32. Visalberghi E, Addessi E, Truppa V, Spagnoletti N, Ottoni E, et al. (2009)\nSelection of effective stone tools by wild bearded capuchin monkeys. Current\nBiology 19: 213–217.\n33. Bril B, Dietrich G, Foucart J, Fuwa K, Hirata S (2008) Tool use as a way to\nassess cognition: how do captive chimpanzees handle the weight of the hammer\nwhen cracking a nut? Animal Cognition 12: 217–235.\n34. Bril B, Roux V, Dietrich G (2000) Habilete ´s implique´es dans la taille des perles\nen roches dure: caracte ´ristiques motrices et cognitives d’une action situe ´e\ncomplexe. In: Dans V Roux (sous la direction de)Les perles de Cambay- Des\npratiques techniques aux technosyste`mes de l’Orient ancien. 211–329.\n35. Schrauf C, Huber L, Visalberghi E (2008) Do capuchin monkeys (Cebus apella)\nuse weight to select hammer tools? Animal Cognition 11: 413–422.\n36. Fragaszy DM, Greenberg R, Visalberghi E, Ottoni EB, Izar P, Liu Q (2010)\nHow wild bearded capuchin monkeys select stones and nuts to minimize the\nnumber of strikes per nut cracked. Animal Behaviour 80: 205–214.\n37. Fushimi T, Sakura O, Matsuzawa T, Ohno H, Sugiyama Y (1991) Nut-cracking\nbehavior of wild chimpanzees (Pan troglodytes) in Bossou, Guinea (West Africa).\nIn: Ehara A, Kimura T, Takenaka O, Iwamoto M, editors. Primatology Today,\nElsevier, Amsterdam. 695–696.\n38. Brosnan S (2009) Animal behavior: the right tool for the job. Current Biology 19:\nR124–5.\n39. Schrauf C, Call J (2011) Great apes use weight as a cue to find hidden food.\nAmerican Journal of Primatology 73: 323–334.\n40. Hanus D, Call J (2008) Chimpanzees infer the location of a reward based on the\neffect of its weight. Current Biology 18: R370–R372.\nDo Chimpanzees Use Weight to Select Hammer Tools?\nPLoS ONE | www.plosone.org 12 July 2012 | Volume 7 | Issue 7 | e41044",
  "topic": "Hammer",
  "concepts": [
    {
      "name": "Hammer",
      "score": 0.8585066199302673
    },
    {
      "name": "Nut",
      "score": 0.7901151776313782
    },
    {
      "name": "Task (project management)",
      "score": 0.6267499327659607
    },
    {
      "name": "Property (philosophy)",
      "score": 0.5853677988052368
    },
    {
      "name": "Cracking",
      "score": 0.4761814475059509
    },
    {
      "name": "Nuts and bolts",
      "score": 0.47125935554504395
    },
    {
      "name": "Computer science",
      "score": 0.4542931914329529
    },
    {
      "name": "Body weight",
      "score": 0.42147159576416016
    },
    {
      "name": "Relevance (law)",
      "score": 0.41257500648498535
    },
    {
      "name": "Cognitive psychology",
      "score": 0.4024983048439026
    },
    {
      "name": "Psychology",
      "score": 0.3316788673400879
    },
    {
      "name": "Artificial intelligence",
      "score": 0.3308444023132324
    },
    {
      "name": "Biology",
      "score": 0.2859764099121094
    },
    {
      "name": "Engineering",
      "score": 0.22606554627418518
    },
    {
      "name": "Structural engineering",
      "score": 0.15602236986160278
    },
    {
      "name": "Materials science",
      "score": 0.12319409847259521
    },
    {
      "name": "Composite material",
      "score": 0.08338254690170288
    },
    {
      "name": "Political science",
      "score": 0.0
    },
    {
      "name": "Philosophy",
      "score": 0.0
    },
    {
      "name": "Systems engineering",
      "score": 0.0
    },
    {
      "name": "Epistemology",
      "score": 0.0
    },
    {
      "name": "Law",
      "score": 0.0
    },
    {
      "name": "Endocrinology",
      "score": 0.0
    }
  ]
}