{
  "title": "Magnetizing Current, Harmonic Content and Power Factor as the Indicators of Transformer Core Saturation",
  "url": "https://openalex.org/W2027314833",
  "year": 2013,
  "authors": [
    {
      "id": "https://openalex.org/A2189332390",
      "name": "Ismail Daut",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2248819817",
      "name": "Syafruddin Hasan",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2568771103",
      "name": "Soib Taib",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2139893769",
    "https://openalex.org/W2178049362",
    "https://openalex.org/W2136960982",
    "https://openalex.org/W2076055903",
    "https://openalex.org/W1536164530",
    "https://openalex.org/W579558559",
    "https://openalex.org/W1538580185"
  ],
  "abstract": "The paper proposes a measurement method for obtaining the parameters needed to calculate a reliable indicator of the state of transformer core saturation.The major nonlinear effects in transformer core are saturation, eddy current and hysteresis.Saturation is the predominant effect in power transformers, followed by eddy current and hysteresis effects.In saturation, a transformer core act as a source of current generating harmonics, some of which will flow directly toward the primary and secondary windings.The method is based on magnetization current, harmonic content and power factor evaluated of the transformer no-load current with high magnetic flux density subjected.The investigation is done on single phase model core type transformer.The transformer is connected to variable voltage variable frequency (VVVF) source and the investigation is done on various flux densities.The results show that the magnetization current and harmonic content increase significantly when high magnetic flux densities are injected and vice versa with power factor that decrease sharply.These phenomena can be used as the indication of transformer core saturation.",
  "full_text": "  \n  \nAbstrac\nt—The paper proposes a measurement method for \nobtaining the parameters needed to calculate a reliable \nindicator of the state of transformer core saturation. The major \nnonlinear effects in transformer core are saturation, eddy \ncurrent and hysteresis. Saturation is the predominant effect in \npower transformers, followed by eddy current and hysteresis \neffects. In saturation, a transf ormer core act as a source of \ncurrent generating harmonics, some of which will flow directly \ntoward the primary and secondary windings. The method is \nbased on magnetization current, harmonic content and power \nfactor evaluated of the transformer no-load current with high \nmagnetic flux density subjected.  The investigation is done on \nsingle phase model core type transformer. The transformer is \nconnected to variable voltag e variable frequency (VVVF) \nsource and the investigation is done on various flux densities.  \nThe results show that the magnetization current and harmonic \ncontent increase significantly when high magnetic flux densities \nare injected and vice versa with power factor that decrease \nsharply. These phenomena can be used as the indication of \ntransformer core saturation. \n \nIndex Terms —Harmonic content, no-load current, power \nfactor, saturation, transformer  \n \nI. NOMENCL\nATURES \nB  \nmagnetic flux density \nBr  \nremanence magnetic flux density \nBs  \nsaturation magnetic flux density \nCRGO Cold-Rolled Grain Oriented \nH  magnetic field intensity \nHc \ncoercivity  magnetic field intensity \nHpk \npeak value of magnetic field intensity \nHs  \nsaturation magnetic field intensity \nIEC International Electrotechnical Commission \nIEEE Institute of Electrical and Electronic Engineers \nIo   \nmagnetizing current \nIrms \nrms value of all the current harmonic component \nI1,rms rm\ns value of fundamental current \nIh,rms r\nms value of current harmonic component of order h \nM4 commercial name for grain oriented silicon steel sheet’s \ngrade \n \nManuscript receive\nd December 16, 2012; revised February 18, 2013.This \nwork was supported in part by Centre  of Excellence for Renewable Energy \nand School of Electrical Systems Engineering, Universiti Malaysia Perlis \n(UniMAP) for the technical and financial support as well.  \nI. Daut is with Centre of Excelle nt for Renewable Energy, School of \nElectrical Systems Engineering, Universiti Malaysia Perlis (e-mail: \nismail.daut@unimap.edu.my).  \nS. Hasan is with Centre of Excelle nt for Renewable Energy, School of \nElectrical Systems Engineering, Universiti Malaysia Perlis and Fakultas \nTeknik, Univ.Sumatera Utara (USU) Medan Indonesia (e-mail: \nsyafruddin@unimap.edu.my). \nS. Taib is with the School of El ectrical & Electronic Engineering, \nUniversiti Sains Malaysia (e-mail: soibtaib@eng.usm.my). \n \nP po\nwer \nPF total (true) power factor \nPFdisp di\nsplacement power factor \nPFdist d\nistribution power factor \nTHDi percent total current harmonic distortion \nV\n1rms rm\ns value of fundamental voltage \nμ  permeability of core material \n \nII. INTRODUCT\nION \nTh\ne magnetic circuit is one of the most important active \nparts of transformer. It consists of laminated iron core and \ncarries flux linked to windings. Energy is transferred from \none electrical circuit to anot her through the magnetic field \ncarried by the core. The iron core provides a low reluctance \npath to the magnetic flux thereby reducing magnetizing \ncurrent.  \nThe performances of transformers are also constrained by \nthe magnetic flux limitations of the core. For ferromagnetic \ncore transformers, we must be mindful of the saturation limits \nof the core. Remember that ferromagnetic materials cannot \nsupport infinite magnetic flux densities: they tend to \n\"saturate\" at a certain level (dictated by the material and core \ndimensions), meaning that further increases in magnetic field \nforce (mmf) do not result in proportional increases in \nmagnetic field flux.  \nChoosing the right lamination material for a particular \napplication is an important power transformer design step, \nsince lamination properties have a direct link to the losses \npower or efficiency of the transformer. Currently, important \nlamination properties (core loss and permeability) to be used \nfor assessment are presented at 50 or 60 Hz, 1.0/1.5 T \nsinusoidal. Electromagnetic designers have to decide on the \nmaterial based on this single operating point, although under \npractical working conditions, some transformers operate at \nflux density levels and frequencies beyond this point. It has \nbeen shown that choosing the lamination material that based \non the lamination performance at one operating point only is \nnot enough [1]. Designers of transformers have, however, \nnever had data available on the specific iron losses of the \nmaterials they use for alternating flux densities higher than of \nthe saturation value. The usual methods of measurement, \napplied to specimens of the material, fail completely at higher \nflux densities than because the power factor becomes very \nsmall and the magnetizing current very high [2].The major \nnonlinear effects in transformer iron core are saturation, eddy \ncurrent and hysteresis. Saturation is the predominant effect in \npower transformers, followed by eddy current and hysteresis \neffects [3]. The iron core of transformers and other \nelectromagnetic devices is laminated so that at 50 Hz or 60 \nHz (or, in general, at power frequency) skin effect is \nMagnetizing Current, Harmonic Content and Power Factor \nas the Indicators of \nTransformer Core Saturation \nIs\nmail Daut, Syafruddin Hasan, and Soib Taib \n304DOI: 10.7763/JOCET.2013.V1.69\nJournal of Clean Energy Technologies, Vol. 1, No. 4, October 2013\n  \nin\nsignificant. Due to satura tion however, harmonics are \ngenerated in either the flux or the magnetic field intensity or \nin both, and for these the spatial distribution is not uniform. \nIn saturation, a transformer core act as a source of current \ngenerating harmonics, some of which will flow directly \ntoward the primary and secondary windings. On the basis of \nthis observation, the paper proposes a measurement method \nfor obtaining the parameters needed to calculate a reliable \nindictor of the state of saturation of transformers [4]. The \nmethod is based on harmonic content evaluated of the \ntransformer no-load current with high magnetic flux density \nsubjected.  The results show that the harmonic content \nincrease significantly  when high magnetic flux density \ninjected. \nNowadays, loads of transformers are widely perturbed \nwith harmonics. Harmonic components cause the transformer \nlosses to increase and thus, transformer may fail to operate \n[5] \n \nIII. H\nARMONIC PH\nENOMENA AND CORE SAT\nURATION \nA. H\narmonic Phenomena \nThe non linear magnetic characteristics of a transformer \ncore are needed to predict distortion of its primary current. \nOne of the methods of estimating harmonic load content is \nPercent Total Harmonic Distortion (%THD). The %THD can \nbe defined in two different ways, as a percentage of the \nfundamental component (the IEEE definition of THD) or as a \npercentage of the rms (used by the Canadian Standards \nAssociation and the IEC) [7].  In this paper we use the later \none. \nThe percentage current total harmonic distortion is \n     \n2\n,\n2\n10\n0%\nhr\nm s\nh\nrms\nI\nTH\nDi I\n∞\n=\n=×\n∑\n       \n  \n       (1\n) \n                                                         \nwhe\nre Ih,rms i\ns the amplitude of the harmonic component of \norder h (i.e., the hth harmonic) and Irms is th\ne rms values of all \nthe harmonics) that can be represented as \n        \n  ∑\n∞\n=\n=\n1\n2\n,\nh\nrms\nhrms I\nI  \n                        (2\n)  \n                                                         \nThe t\notal power factor, \n \n       =ܨܲ \n௉\n௏భ,\nೝ೘ೞூభ,\nೝ೘ೞටଵାቀ்ு\n஽೔\nଵ଴\n଴%ൗ ቁ\nమ \n                      (3) \n \nThe total power factor is sometime called the true power \nfactor. As shown in equation (3) the total power factor is the \nproduct two components. The first component is called the \ndisplacement power factor: \n \n     ௗ௜\n௦௣ = \n௉\n௏భ,ೝ೘ೞூభ,\nೝ೘ೞ\n \n                           (4) \n \nThe second component of the total power factor is called \ndistortion power factor and results from the harmonic \ncomponent of the current: \n                         ܨܲ\nௗ௜௦\n௧ =\nଵ\nටଵାቀ\n೅ಹವ೔\nభబబ%ቁ\n   \n             (5)       \n                                  \nIf the voltage also has harmonic components, then the \ndistortion power factor would be the product of two terms \nlike the right side of equation (6), one for voltage and one for \ncurrent.  \n \n        ௗ௜\n௦௧ =\nଵ\nටଵାቀ\n೅ಹವ೔\nభబబ%ቁ\n×\nଵ\nටଵାቀ೅ಹವೡ\nభబబ% ቁ\n  \n                 (6)       \n \nHowever, we normally expect the voltage distortion to be \nvery low compared to the current distortion. \nB. Core Saturation \n A typ\nical hysteresis loop of a soft magnetic material is \nshown in Fig.1. When a high magnetizing force is \nencountered, a point is reached where further increase in, H, \ndoes not cause useful increase in , B. This point is known as \nthe saturation point of that material. The saturation flux \ndensity, B\ns an\nd the required magnetizing force, Hs,\n to saturate \nthe core are shown with dashed lines[8]. \nIn Fig. 1, the hysteresis loop clearly shows the remanence \nflux density, Br. The remanence flux is the polarized flux \nremaining in the core after the excitation has been removed. \nThe magnetizing force, -H c, is called\n coercivity. It is the \namount of magnetizing force required to bring the remanence \nflux density back to zero.  \nFig.\n 1. Typical B-H curve of soft magnetic material. \nC. Permea\nbility \nThe permeability of a magnetic material is a measure of the \nease in magnetizing the material. Permeability, μ is the ratio \nof the flux density, B, to the magnetizing  force, H. \n \n        \n                ߤ\n = \n஻\nு         \n                             (7\n)   \n        \n                                                        \nTh\ne relationship between B and H is not linear, as shown in \nthe hysteresis loop in Fig.1. Then, it is evident that the ratio, \nB/H, (permeability), also varies. \nThe variation of permeability with flux density, B, is \nshown in Fig. 2. Also, it shows the flux density at which the \npermeability is at a maximum. \n \nFig. 2. Va\nriation in permeability with B and H. \n305\nJournal of Clean Energy Technologies, Vol. 1, No. 4, October 2013\n  \nSilico\nn steel was one of the first alloys to be used in \ntransformers and inductors. It has been greatly improved over \nthe years and is probably, pound for pound, the most, widely \nused magnetic material. One of the drawbacks in using steel \nin the early years was, as the material became older, the \nlosses would increase. With the addition of silicon to the steel, \nthe advantages were twofold:  it increased the electrical \nresistivity, therefore reducing th e eddy current losses, and it \nalso improved the material's stability with age. Silicon steel \noffers high saturation flux density, a relatively good \npermeability at high flux density, and a moderate loss at \naudio frequency. One of the important improvements made to \nthe silicon steel was in the process called cold-rolled, \ngrain-oriented, \nBy definition, saturation occurs when the peak exciting \ncurrent (B) is twice the average exciting current (A) as shown \nin Fig. 3. Analytically, this means that [8]: \n \n    \n                Hpk\n  = 2 Hs \n                                (8)     \n \nRefer to Fig. 3, saturation occurs when B=2A \n \n \nFig.\n 3. Defining the excitation current \n \nIV. MODE\nL OF EXP\nERIMENTAL SET-UP \nTh\ne transformer test has the specification as single-phase \npower transformer with primary winding of 220 turns and \nsecondary of 220 turns respectively. The dimension of the \ncore is 508 mm × 306 mm with yoke and limb 100 mm width. \nThe core is assembled from 0.27 millimeter thickness \nlamination of M4 grain-oriented silicon iron (CRGO) that \ncomprises of 17 layers and 5 mm corner overlap length \nconfiguration (shown in Fig. 4). \n30\n6 mm\n508 mm\n5 mm\n \nFig.\n 4. Transformer core configuration \n \n \nFig.\n 5. Arrangement of experimental set-up \nThe a\nrrangement of equipment set-up which used in this \nresearch work is as shown in Fig. 5. The input current to \nharmonic analyzer (PM 300) is connected to ac variable \nvoltage variable frequency supply and its voltage is come \nfrom the secondary side of transformer test (transformer turn \nratio 1:1). The experiment was conducted with different flux \ndensity by varying the input voltage and the frequency \nmaintain constant. \n \nV. RESUL\nT \nThe \nsample of current and voltage waveforms for 50 Hz of \nfrequency supply with magnetic flux density of 1.5 Tesla and \n1.9 Tesla are shown in Fig. 6 (a) and Fig. 6 (b). \n \n \n(a) \n B = 1.5 Tesla \n \n \n(b\n) B = 1.9 Tesla \nFig. 6. Current and voltage waveforms \n  \nThe \nharmonic phenomena in term of current total \nharmonic distortion and magnetization current (Io) of \nsingle-phase transformer at various magnetic flux densities \nfor frequency 50 Hz is displayed in Table. \n \nTABL\nE I: MAGN\nETIZING CUR\nRENT, %THDI A\nND PF MEA\nSURED  \nAT VARI\nOUS MAG\nNETIC FL\nUX DE\nNSITIES \nB [T\n] Io\n [A] T\nHD [%] PF \n1.\n0 0.146 16.92 0.621 \n1.\n1 0.172 21.23 0.587 \n1.\n2 0.211 25.15 0.525 \n1.\n3 0.258 28.58 0.457 \n1.\n4 0.\n317 31.\n62 0.\n395 \n1.\n5 0.\n388 33.\n44 0.\n342 \n1.\n6 0.475 37.33 0.274 \n1.\n7 0.594 44.48 0.174 \n1.\n8 0.\n827 56.\n38 0.\n108 \n1.\n9 1.\n385 64.\n83 0.\n092 \n2.\n0 2.486 75.66 0.054 \n \nTh\ne related magnetization current and percent total \nharmonic distortion of magnetization current (%THDi) and \nthe respective magnetic flux densities for frequency 50 Hz \nare depicted as shown in Fig.  7 and Fig. 8. Meanwhile, the \ncurve of power factor versus magnetic flux densities is \ndisplayed in Fig. 9. \n306\nJournal of Clean Energy Technologies, Vol. 1, No. 4, October 2013\n  \n \nFig.\n 7. Magnetization current versus magnetic flux density \n \n \nFig.\n 8.  %THD versus magnetic flux density \n \n \nFig.\n 9. Power Factor versus magnetic flux density \n \nVI. DISCUSSION \nFi\ng. 6(a) and (b) show the waveforms of supply voltage \nand current with different magnetic flux density, i.e, 1.5 T \nand 1.9 T. Although the applied voltage is sinusoidal, the \ncurrent waveform is not sinusoid al. It is clear from Fig.7(a) \nand (b) that the non-sinusoidal current is still symmetrical \naround zero crossing of voltage waveform. \nThe magnetizing current (Io) and harmonics phenomena \nwhich are evaluated in terms of percent total harmonic \ndistortion of current (THDi) and power factor are shown in \nTable 1.  The excitation (magnetizing) current, Io at magnetic \nflux density B = 1.8 T (i.e., Io = 0.827 A) is more than \ndoubled compare to at 1.4 or 1.5 T (Io = 0.317 A or 0.388). \nMeanwhile, the %THDi increased  when the transformer is \nsubjected with higher magnetic flux density. The increasing \nof %THD is very significant when the magnetic flux densities \nare changed from 1.7 to 2.0 T. It could be signified that the \nlamination cores of transformer lead to saturate. Fig. 7 and \nFig.8 also show that the pattern of Io and %THDi versus \nmagnetic flux density nearly the same as B-H curve of a \nmagnetic material.  \nAs mention in Equation (3), the power factors are inverse \nproportional to %THDi. These phenomenon are displayed in \nTable I or Fig. 9. It is obvious that the power factors are \ndecreasing significantly when the magnetic flux densities are \nchanged from 1.7 T to 2.0 T. It could be also as indication that \nthe lamination cores of transformer have been lead to \nsaturate.\n  \n \nVI\nI.    CON\nCLUSION \nTest\n data obtained for to no-load measurement of \nsingle-phase transformer was re produced in the Centre of \nExcellence for Renewable Energy (CERE), UniMAP.  \nThis paper presented a practical method for the estimation \nof nonlinear core saturation in term of magnetization current, \nits harmonics content and power factor. Analysis of the test \ndata indicate the high magnetic flux density contribute more \nmagnetization current, high harmonic content and low power \nfactor rather than at normal magnetic flux density of actual \ntransformer operation (1.4 or 1.5 Tesla). \nThe pattern of magnetizing current and percentage current \ntotal harmonic distortion versus magnetic flux densities are \nnearly the same as B-H curve of a magnetic material.  \nTherefore, these phenomenon can  be used as indicator to \nshow that at 1.8 Tesla the material of transformer core has \nbeen lead to saturation.  \nR\nEFER\nENCES \n[1] K. Karsai\n, D. Kerenyi, and L. Kiss, Large power transformers, Elsevier \nPublication, Amsterdam, 1987, pp. 41. \n[2] E. So, R. Arseneau, and E. Hanique, “No-Load loss Measurements of \nPower Transformers under Distorted Supply Voltage waveform \nConditions,” IEEE Transaction on Instrumentation and Measurement, \nvol. 52, no. 2, April 2003, pp. 429-432. \n[3] R. Arseneau, E. So, and E. Hanique, “Measurements and Correction of \nNo-Load Losses of Power Transformers,” IEEE Transaction on \nInstrumentation and Measurement, vol. 54, no. 2, pp. 503-506. \n[4] A. H. A. Haj and I. E. Amin, “Factors that Influence Transformer \nNo-Load Current Harmonics,” IEEE Transaction on Power Delivery , \nvol. 15, no. 1, January 2000,  pp. 163-166. \n[5] M. Mirzaie, M. Y. Asrami, S. B. Sadati, and A. S. Akmal, “Impacts of \nNon-Sinusoidal Load Currents on Distribution Transformer \nLosses-Part II: Standard Aspects and Experimental Measurement,” \nInternational Review of Electrical Engineering (IREE) Journal, vol. 6. \nno. 5, October 2011, pp. 2215-2220. \n[6] V. S. Kulkarni and A. S. Khaparde, Transformer Engineering Design \nand Practice (Marcel Dekker, Inc., New York, 2004) \n[7] International Electrotechnical Commission Standards , IEC 76, part \none, Power Transformers, 2\nnd ed.,\n 1993. \n[8] S. L.Timothy and D. W. E. William, Electric Power and Controls , \nPearson-Prentice Hall, New Jersey, United States of America, 2004. \n[9] C. W. T. McLyman, Transformer and Inductor Design Handbook , 3rd \nE\ndition, Revised and Expanded, Marcel Dekker. Inc., New York, 2004. \n \nIsmail Daut  received his B. Elect.Eng. (Hons) from \nUniversity of Science Malaysia in 1980 and MSc in \nElectrical and Electromagnetic Engineering from \nUniversity of Wales, College of Cardiff, United \nKingdom in 1991 and PhD in Energy Conservation \nand Power Engineering from University of Wales,  \nCollege of Cardiff, United Kingdom in 1994. His \nresearch interest includes energy conversion, electrical \nmachine design and high voltage.  He has authored  \nand co-authored more than 200 technical papers in the \nnational, international journal and conferences. \n \nSyafruddin Hasan was born in July 1, 1959 in Pidie, \nAceh-Indonesia. He received his BSc from \nUniversitas Sumatera Utara (USU) Medan  in 1985 \nand MSc from Institut Teknologi Bandung (ITB) \nBandung-Indonesia, 1993 all in Electrical \nEngineering. He is a lecture in UniMAP and USU. He \nis currently PhD student in Universiti Malaysia Perlis \n(UniMAP). His field of interest includes \nElectromagnetic Theory, Electrical Machines, Power \nElectronic Drives and Power Quality. \n307\nJournal of Clean Energy Technologies, Vol. 1, No. 4, October 2013",
  "topic": "Power factor",
  "concepts": [
    {
      "name": "Power factor",
      "score": 0.6156497001647949
    },
    {
      "name": "Current transformer",
      "score": 0.5263332724571228
    },
    {
      "name": "Transformer",
      "score": 0.42823249101638794
    },
    {
      "name": "Electrical engineering",
      "score": 0.4149169325828552
    },
    {
      "name": "Materials science",
      "score": 0.3451123833656311
    },
    {
      "name": "Environmental science",
      "score": 0.3444841504096985
    },
    {
      "name": "Engineering",
      "score": 0.2140035331249237
    },
    {
      "name": "Voltage",
      "score": 0.13645952939987183
    }
  ]
}