{
    "title": "A high-voltage pulse transformer with a modular ferrite core",
    "url": "https://openalex.org/W2036905503",
    "year": 2008,
    "authors": [
        {
            "id": "https://openalex.org/A2098554925",
            "name": "Z. Liu",
            "affiliations": [
                "Eindhoven University of Technology"
            ]
        },
        {
            "id": "https://openalex.org/A1534042938",
            "name": "G. J. J. Winands",
            "affiliations": [
                "Eindhoven University of Technology"
            ]
        },
        {
            "id": "https://openalex.org/A2108277818",
            "name": "K. Yan",
            "affiliations": [
                "Zhejiang University"
            ]
        },
        {
            "id": "https://openalex.org/A1576899783",
            "name": "A. J. M. Pemen",
            "affiliations": [
                "Eindhoven University of Technology"
            ]
        },
        {
            "id": "https://openalex.org/A2073293754",
            "name": "E. J. M. van Heesch",
            "affiliations": [
                "Eindhoven University of Technology"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2032719750",
        "https://openalex.org/W1963946516",
        "https://openalex.org/W1969640287",
        "https://openalex.org/W110100174",
        "https://openalex.org/W2116250538",
        "https://openalex.org/W2008393446",
        "https://openalex.org/W2131765818",
        "https://openalex.org/W1496503455"
    ],
    "abstract": "A high ratio (winding ratio of 1:80) pulse transformer with a modular ferrite core was developed for a repetitive resonant charging system. The magnetic core is constructed from 68 small blocks of ferrites, glued together by epoxy resin. This allows a high degree of freedom in choosing core shape and size. Critical issues related to this modular design are the size tolerance of the individual ferrite blocks, the unavoidable air gap between the blocks, and the saturation of the core. To evaluate the swing of the flux density inside the core during the charging process, an equivalent circuit model was introduced. It was found that when a transformer is used in a resonant charging circuit, the minimal required volume of the magnetic material to keep the core unsaturated depends on the coupling coefficient of the transformer and is independent of the number of turns of the primary winding. Along the flux path, 17 small air gaps are present due to the inevitable joints between the ferrite blocks. The total air gap distance is about 0.67mm. The primary and secondary windings have 16 turns and 1280 turns, respectively, and the actually obtained ratio is about 1:75.4. A coupling coefficient of 99.6% was obtained. Experimental results are in good agreement with the model, and the modular ferrite core works well. Using this transformer, the high-voltage capacitors can be charged up to more than 70kV from a low-voltage capacitor with an initial charging voltage of about 965V. With 26.9J energy transfer, the increased flux density inside the core was about 0.23T, and the core remains unsaturated. The energy transfer efficiency from the primary to the secondary was around 92%.",
    "full_text": null
}