{
  "title": "SurvExpress: An Online Biomarker Validation Tool and Database for Cancer Gene Expression Data Using Survival Analysis",
  "url": "https://openalex.org/W2037915750",
  "year": 2013,
  "authors": [
    {
      "id": "https://openalex.org/A2981534045",
      "name": "Raúl Aguirre‐Gamboa",
      "affiliations": [
        "Tecnológico de Monterrey"
      ]
    },
    {
      "id": "https://openalex.org/A3034908647",
      "name": "Hugo Gomez Rueda",
      "affiliations": [
        "Tecnológico de Monterrey"
      ]
    },
    {
      "id": "https://openalex.org/A4276478449",
      "name": "Emmanuel Martinez-Ledesma",
      "affiliations": [
        "Tecnológico de Monterrey"
      ]
    },
    {
      "id": "https://openalex.org/A2254453404",
      "name": "Antonio Martínez Torteya",
      "affiliations": [
        "Tecnológico de Monterrey"
      ]
    },
    {
      "id": "https://openalex.org/A5016970432",
      "name": "Rafael Chacolla-Huaringa",
      "affiliations": [
        "Tecnológico de Monterrey"
      ]
    },
    {
      "id": "https://openalex.org/A5041281295",
      "name": "Alberto Rodriguez-Barrientos",
      "affiliations": [
        "Tecnológico de Monterrey"
      ]
    },
    {
      "id": "https://openalex.org/A4259974152",
      "name": "Jose G. Tamez-Pena",
      "affiliations": [
        "Tecnológico de Monterrey"
      ]
    },
    {
      "id": "https://openalex.org/A2236980110",
      "name": "Víctor Trevino",
      "affiliations": [
        "Tecnológico de Monterrey"
      ]
    },
    {
      "id": "https://openalex.org/A2981534045",
      "name": "Raúl Aguirre‐Gamboa",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A3034908647",
      "name": "Hugo Gomez Rueda",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A4276478449",
      "name": "Emmanuel Martinez-Ledesma",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2254453404",
      "name": "Antonio Martínez Torteya",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A5016970432",
      "name": "Rafael Chacolla-Huaringa",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A5041281295",
      "name": "Alberto Rodriguez-Barrientos",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A4259974152",
      "name": "Jose G. Tamez-Pena",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2236980110",
      "name": "Víctor Trevino",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2000645341",
    "https://openalex.org/W2022397091",
    "https://openalex.org/W2166273484",
    "https://openalex.org/W2048000549",
    "https://openalex.org/W1986724703",
    "https://openalex.org/W1969096316",
    "https://openalex.org/W1995535201",
    "https://openalex.org/W2000252568",
    "https://openalex.org/W2069168497",
    "https://openalex.org/W2159092541",
    "https://openalex.org/W4301341292",
    "https://openalex.org/W1984344728",
    "https://openalex.org/W2109242212",
    "https://openalex.org/W2105882193",
    "https://openalex.org/W1971465952",
    "https://openalex.org/W2107986563",
    "https://openalex.org/W2009255619",
    "https://openalex.org/W2084001490",
    "https://openalex.org/W2058451329",
    "https://openalex.org/W2142351815",
    "https://openalex.org/W2115157373",
    "https://openalex.org/W2044545697",
    "https://openalex.org/W2132165198",
    "https://openalex.org/W2155354546",
    "https://openalex.org/W2096283457",
    "https://openalex.org/W1976173969",
    "https://openalex.org/W2163563958",
    "https://openalex.org/W4245024447",
    "https://openalex.org/W2160571019"
  ],
  "abstract": "Validation of multi-gene biomarkers for clinical outcomes is one of the most important issues for cancer prognosis. An important source of information for virtual validation is the high number of available cancer datasets. Nevertheless, assessing the prognostic performance of a gene expression signature along datasets is a difficult task for Biologists and Physicians and also time-consuming for Statisticians and Bioinformaticians. Therefore, to facilitate performance comparisons and validations of survival biomarkers for cancer outcomes, we developed SurvExpress, a cancer-wide gene expression database with clinical outcomes and a web-based tool that provides survival analysis and risk assessment of cancer datasets. The main input of SurvExpress is only the biomarker gene list. We generated a cancer database collecting more than 20,000 samples and 130 datasets with censored clinical information covering tumors over 20 tissues. We implemented a web interface to perform biomarker validation and comparisons in this database, where a multivariate survival analysis can be accomplished in about one minute. We show the utility and simplicity of SurvExpress in two biomarker applications for breast and lung cancer. Compared to other tools, SurvExpress is the largest, most versatile, and quickest free tool available. SurvExpress web can be accessed in http://bioinformatica.mty.itesm.mx/SurvExpress (a tutorial is included). The website was implemented in JSP, JavaScript, MySQL, and R.",
  "full_text": "SurvExpress: An Online Biomarker Validation Tool and\nDatabase for Cancer Gene Expression Data Using\nSurvival Analysis\nRaul Aguirre-Gamboa, Hugo Gomez-Rueda, Emmanuel Martı´ nez-Ledesma, Antonio Martı´ nez-Torteya,\nRafael Chacolla-Huaringa, Alberto Rodriguez-Barrientos, Jose´ G. Tamez-Pen˜a, Victor Trevin˜o*\nCa´tedra de Bioinforma´tica, Tecnolo´ gico de Monterrey, Monterrey, Nuevo Leo ´ n, Me´xico\nAbstract\nValidation of multi-gene biomarkers for clinical outcomes is one of the most important issues for cancer prognosis. An\nimportant source of information for virtual validation is the high number of available cancer datasets. Nevertheless,\nassessing the prognostic performance of a gene expression signature along datasets is a difficult task for Biologists and\nPhysicians and also time-consuming for Statisticians and Bioinformaticians. Therefore, to facilitate performance comparisons\nand validations of survival biomarkers for cancer outcomes, we developed SurvExpress, a cancer-wide gene expression\ndatabase with clinical outcomes and a web-based tool that provides survival analysis and risk assessment of cancer datasets.\nThe main input of SurvExpress is only the biomarker gene list. We generated a cancer database collecting more than 20,000\nsamples and 130 datasets with censored clinical information covering tumors over 20 tissues. We implemented a web\ninterface to perform biomarker validation and comparisons in this database, where a multivariate survival analysis can be\naccomplished in about one minute. We show the utility and simplicity of SurvExpress in two biomarker applications for\nbreast and lung cancer. Compared to other tools, SurvExpress is the largest, most versatile, and quickest free tool available.\nSurvExpress web can be accessed in http://bioinformatica.mty.itesm.mx/SurvExpress (a tutorial is included). The website was\nimplemented in JSP, JavaScript, MySQL, and R.\nCitation: Aguirre-Gamboa R, Gomez-Rueda H, Martı ´nez-Ledesma E, Martı´nez-Torteya A, Chacolla-Huaringa R, et al. (2013) SurvExpress: An Online Biomarker\nValidation Tool and Database for Cancer Gene Expression Data Using Survival Analysis. PLoS ONE 8(9): e74250. doi:10.1371/journal.pone.0074250\nEditor: William C. S. Cho, Queen Elizabeth Hospital, Hong Kong\nReceived April 21, 2013; Accepted July 31, 2013; Published September 16, 2013\nCopyright: /C2232013 Aguirre-Gamboa et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nFunding: The authors are thankful for the financial support from Ca ´tedra de Bioinforma´tica CAT220 at ITESM (Tecnolo´ gico de Monterrey) and CONACyT grants\n83929 and 140601. The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.\nCompeting Interests:The authors have declared that no competing interests exist.\n* E-mail: vtrevino@itesm.mx\nIntroduction\nCancer causes millions of deaths around the world. To improve\ntreatments, several biomarkers have been proposed for risk\nprognosis and treatment response. Recent published biomarkers\nin many types of cancer contain numerous genes and are mainly\nbased on gene expression. They have been generated using\nmicroarray profiling and lately by RNA-Seq technologies. Often,\nidentified biomarkers are developed to a specific cancer tissue and\nsubtypes. In breast cancer, for example, more than 40 biomarkers\nhave been proposed containing between 3 and 512 genes and\nwhose prognostic or predictive performance depends on therapy,\nhormone receptor status, and the number of genes [1,2]. On the\nother hand, assessing the performance of proposed biomarkers in\ndifferent populations or evaluating competing biomarkers are\ndifficult tasks even though hundreds of public datasets are\navailable. The main limitations are the time and resources needed\nfor acquiring, processing, normalizing, filtering, and statistical\nmodeling of large gene expression datasets. This is important since\nseveral of the reasons involved in the failure of biomarkers in\nclinical trials are related to data analysis [3]. For the analysis of\nbiomarkers, tools as ITTACA, KMPlot, RecurrenceOnline, bc-\nGeneExMiner, GOBO, and PrognoScan have been proposed\n[1,4–9]. However, these tools have serious restrictions (Table 1),\ncomplicating and limiting the assessment of multi-gene biomarkers\nin cancer. Some of the main limitations include considering just\none gene at the time or a specific set of genes; focusing on breast or\novarian cancer datasets or to a particular Affymetrix gene\nexpression platform; requiring the upload of Affymetrix gene\nexpression data (.CEL files); and using a single quantity per gene\neven though some microarray platforms provide more probesets.\nTo solve these issues and to facilitate performance comparisons\nand validations of prognostic and predictive biomarkers for cancer\noutcomes, we developed SurvExpress. SurvExpress is a compre-\nhensive gene expression database and web-based tool providing\nsurvival analysis and risk assessment in cancer datasets using a\nbiomarker gene list as input. The tool is available in http://\nbioinformatica.mty.itesm.mx/SurvExpress. The tool includes a\ntutorial that describes the analysis options, plots, tables, key\nconcepts related to survival analysis, and representative methods to\nidentify biomarkers from gene expression data.\nMaterials and Methods\nDatabase Acquisition\nDatasets were obtained mainly from GEO (http://www.ncbi.\nnlm.nih.gov/geo/) and TCGA (https://tcga-data.nci.nih.gov)\nafter searching for keywords related to cancer, survival, and gene\nPLOS ONE | www.plosone.org 1 September 2013 | Volume 8 | Issue 9 | e74250\nexpression technologies. Additionally, a few were obtained from\nauthor’s websites and from ArrayExpress (http://www.ebi.ac.uk/\narrayexpress/). The data source used is shown in the web\ninterface. We favored cancer types above two different cohorts and\ndatasets containing survival data over 30 samples in which\ncensoring indicator and time to death, recurrence, relapse, or\nmetastasis were provided. Clinical data was provided by dataset\nauthors via personal email when not available online in\ncorresponding repositories. Datasets were annotated from provid-\ner files as found up to September 2012, and were quantile-\nnormalized and log2 transformed when needed. From TCGA, all\ndatasets were obtained at the gene level (level 3). RNA-Seq counts\ndata were log2 transformed. In some cancer types where many\ndatasets were found for the same gene expression platform, we also\nprovide a merged meta-base. In meta-bases, datasets were quantile\nnormalized; probesets means were equalized conserving the\nstandard deviation by each cohort; and datasets were merged by\nprobeset id. At the moment we provide meta-bases for breast,\nlung, and ovarian cancer. To facilitate gene searches and\nconversions between gene identifiers, human gene information\nwas used and obtained from the NCBI FTP site (ftp://ftp.ncbi.nih.\ngov/gene/DATA/GENE_INFO/Mammalia/Homo_sapiens.gene_\ninfo.gz). To simplify the user interface, datasets were grouped by\nrelated organ or tissue usingdisease ontologies [10].\nWeb Interface Implementation\nTwo simple and lightweight HTML user interfaces based on\njava server pages, JavaScript, R, Ajax, Apache, and MySQL were\nimplemented (Figure 1A). In theInput page, users introduce the\ngene list based on NCBI compatible gene identifiers (official\nsymbol, Entrez, Ensembl, HGNC, or others) and select the target\ndataset. Users can also choose how to treat genes having more\nthan one probe. TheAnalysis page extracts the dataset rows related\nto genes in the biomarker and delivers a web interface. Then, users\ncan assess the biomarker in a variety of ways, including switching\non and off specific genes, stratifying samples by available clinical\ninformation (e.g. stage, grade, age, biochemical results, and\nmutation status), specifying training and test samples, and\nweighting genes instead of using the Cox fitting. The results are\ndisplayed in common and flexible publication-ready plots and\ntables within theAnalysis page. A PDF version of the results can\nalso be obtained.\nPrognostic Index Estimation\nThe prognostic index (PI), also known as the risk score, is\ncommonly used to generate risk groups. The PI is known as the\nlinear component of the Cox model [11], PI = b\n1x1+\nb2x2+...+bpxp where xi is the expression value and the bI can\nobtained from the Cox fitting. EachbI can be interpreted as a\nrisk coefficient. SurvExpress implements two procedures to\nestimate the b coefficients. The first procedure is the classical\nCox model where all genes are included in a unique model.\nThe fitting is performed in R (http://cran.r-project.org) using\nthe survival package. In the second procedure, the user can\nspecify a weight for each gene instead of using the values from\nthe Cox fitting. Such option is useful to make comparisons with\nbiomarkers computed with mathematical models other than\nCox.\nTable 1.Comparison of survival analysis tools.\nTool Genes Per Analysis Tissues Datasets Samples Input Risk Groups\nKMPlot* 12 .30 4,441 AffyID Quartiles\nITTACA** 17 2 3 1 .739 Genes, Groups User\nRecurrence Online Specific 1 – – CEL Files Specific\nbc-GenExMiner 1 1 21 3,414 Genes Median\nPrognoScan 11 4 7 4 1 8,626 Genes Algorithm\nGOBO* Multiple 1 10 1,881 Genes Classifier\nSurvExpress Multiple 22 142 21,051 Genes Various***\nComparison of survival analysis tools in terms of genes, databases, input, and risk group generation.\n*Data includes only Affymetrix microarrays.\n**Only few of the datasets have survival data.\n***SurvExpress risk groups can be generated based on the Cox fitting, an optimization algorithm, or user-specified weights.\n1Only including datasets with clinical outcome information.\ndoi:10.1371/journal.pone.0074250.t001\nFigure 1. Overview of the SurvExpress web tool.Panel A shows a\nschematic diagram of the SurvExpress workflow while Panel B shows\nsnapshots of the interfaces tagging the required input fields. In the first\nInput web page, the user can paste the list of genes (tagged with the\nnumber 1, which can be symbols, entrez gene identifier and others\nidentifiers) and choose the dataset from around 140 available datasets\n(tagged with 2 and 3). SurvExpress validates and searches the genes\nand dataset to show the Analysis web page where the user selects the\ncensored outcome (tag 4) and visualizes the results (right-bottom\nexpanded in Figure 2). The whole process can be achieved in less than\none minute for a sensible number of genes.\ndoi:10.1371/journal.pone.0074250.g001\nSurvExpress: Biomarker Tool for Clinical Outcomes\nPLOS ONE | www.plosone.org 2 September 2013 | Volume 8 | Issue 9 | e74250\nRisk Estimation\nSurvExpress implements two methods to generate risk groups.\nThe first method (default) generates the risk groups splitting the\nordered PI (higher values for higher risk) by the number of risk\ngroups leaving equal number of samples in each group. For two\nrisk groups, this is equivalent to split the PI by the median. The\nsecond method to produce risk groups uses an optimization\nalgorithm from the ordered PI. Briefly, for two groups, a log-rank\ntest is performed along all values of the arranged PI. Then, the\nalgorithm chooses the split point where the p-value is minimum.\nThis procedure is generalized for more than two groups repeatedly\noptimizing one risk group at the time until no changes are\nobserved. Details of this procedure are described in the tutorial\nprovided in SurvExpress web site.\nOutputs\nThe outputs included correspond to common metrics and plots\nused to assess the performance of survival data. An example of the\nFigure 2. Common outputs of the SurvExpress Results page.This figure shows the results from a breast cancer meta-base included in\nSurvExpress. Panel A shows the Kaplan-Meier curve for risk groups, concordance index, and p-value of the log-rank testing equality of survival curve s.\nPanel B shows clinical information available related to risk group, prognostic index, and outcome data. Panel C shows a heat map representation of\nthe gene expression values. Panel D shows a box plot across risk groups, including the p-value testing for difference using t-test (or f-test for more\nthan two groups). Panel E shows the relation between risk groups and prognostic index. Panel F shows fragments of tables with the summary of the\nCox fitting and the prognostic indexes. Details are provided in SurvExpress Tutorial.\ndoi:10.1371/journal.pone.0074250.g002\nSurvExpress: Biomarker Tool for Clinical Outcomes\nPLOS ONE | www.plosone.org 3 September 2013 | Volume 8 | Issue 9 | e74250\noutputs generated by SurvExpress is shown in Figure 2. Panel A\nshows the Kaplan-Meier plots by risk group, the log-rank test of\ndifferences between risk groups, the hazard-ratio estimate, and the\nconcordance indexes, which estimate the probability that subjects\nwith a higher risk will experience the event after subjects with a\nlower risk [12]. Panel B displays a visual association of available\nclinical information to risk groups. Panel C illustrates a heat map\nof gene expression values. Panel D shows box plots of gene\nexpression values across gene groups together with the p-value of\nthe corresponding difference. Panel E demonstrates the risk group\noptimization plot. Panel F shows fragments of the tables for the\nbeta coefficients including corresponding Cox p-values, prognostic\nindex per sample, and Cox fitting information from thesurvival\npackage in R. Other advanced plots are also available in the\ntutorial provided in SurvExpress. Other ‘advanced plots’ include\nSurvivalROC that estimates time-dependent sensitivities and\nspecificities for survival risk groups [13] but needs a few minutes\nto compute. Additional plots, details and interpretations of the\noutputs are described in the tutorial provided in the SurvExpress\nweb site.\nResults and Applications\nDatabase\nAlthough data collection will continue, to date we have collected\naround 20,000 cancer samples distributed in 140 datasets covering\nmore than 20 tissues (Table 2). The main limitation to include\nmore datasets was that the absence of censoring information in\nrepositories. Nevertheless, the SurvExpress collection surpasses\nthat of similar tools in terms of tissue coverage, number of samples,\nmultivariate predictor estimation, and functionality (Table 1).\nFrom the 20 cancer types, the most represented by their number of\ndatasets were breast, hematologic, lung, brain, and ovarian,\nreaching around 70% of the database collection. It is surprising\nthat most of the existing tools are mainly concentrated in breast\ncancer even though a similar number of datasets is available for\nother cancer types. Consequently, one of the immediate advan-\ntages of SurvExpress is the availability to perform powerful\nanalysis for these highly studied types of cancers. In addition,\nSurvExpress will allow the validation of biomarkers in cancer types\nthat have not been considered by other tools such as kidney, liver,\ngastrointestinal, pancreatic, bone, head and neck, and uterine. In\nthe web interface, we also encourage users to suggest or send data\nto increase cancer and dataset coverage.\nWeb Interface\nThe two web interfaces comprise three sections:Input, Analysis\nand Results (Figure 1B). TheInput page is easily operated typing or\npasting a list of genes and specifying the target dataset (numbers 1\nto 3 in Figure 1B). It also includes a link to the tutorial that\ndescribes all options and provides comprehensive interpretations\nof the outputs. The subsequentAnalysis and Result page is obtained\nin a few seconds (about 1 second per gene and 200 samples). In the\nAnalysis section, the user specifies the outcome of the selected\ndataset in which the analysis will be performed (number 4 in\nFigure 1B). TheResults section (Figure 2) is obtained few seconds\nafter submitting an analysis. This section includes outputs such as\nKaplan-Meier curves for risk groups, visual comparison of the\nclinical information to risk groups, a heat map of the gene\nexpression values, box plots of the gene expression per gene and\nrisk group, a plot of the risk group optimization process, tables of\nthe Cox coefficients, prognostic indexes, and Cox fitting informa-\ntion, and a link to obtain the R scripts used.\nValidation and Applications\nBecause of limitations in other tools, multi-gene comparisons\nacross tools were not possible. Still, SurvExpress can provide\nsimilar results to other tools when one gene only is used.\nNevertheless, to assess the functionality and estimations of\nSurvExpress, we performed two analyses evaluating the perfor-\nmance of well-known and proposed prognostic biomarkers. We\nused the OncotypeDX biomarker for recurrence in breast cancer\nand two published biomarkers for lung cancer survival.\nOncotypeDX biomarker for breast cancer. As an exam-\nple for testing one biomarker in several datasets, we used the 16\nOncotypeDX genes [14]. OncotypeDX estimates a recurrence\nscore that is mainly offered to early-stage, estrogen positive, lymph\nnode negative breast cancers. The genes included are AURKA,\nBAG1, BCL2, BIRC5, CCNB1, CD68, CTSL2, ERBB2, ESR1,\nGRB7, GSTM1, MKI67, MMP11, MYBL2, PGR, and SCUBE2\n(ACTB, GAPDH, GUSB, RPLP0, andTFRC genes used as reference\nin the RT-PCR assay were not used here). To estimate the score,\nOncotypeDX uses a weighting algorithm equivalent to a weight\nmultiplied by corresponding gene expression normalized by a\nreference [14]. In SurvExpress we used Cox fitting (as an\napproximation since gene expression data is not normalized to\nreference genes) in four breast cancer datasets (Table 3). Other\nsettings were the maximum row average for genes with multiple\nprobesets, and two risk groups split at the median of the prognostic\nindex. To test the biomarker in several conditions, the datasets\nwere chosen to reflect patients suitable for the test (Wang [27] and\nIvshina [26]), patients with partial information besides different\nevent (TCGA [25]), and patients without clinical information (Kao\n[15]). The results shown in Figure 3 and summarized in Table 4\nsuggest that, overall, Oncotype DX can separate significantly low-\nTable 2.Current content of the SurvExpress database per\ncancer type.\nCancer Type Datasets\nBreast 25\nHematologic 20\nLung 19\nBrain 17\nOvarian 12\nColon 6\nKidney 6\nLiver 4\nProstate 4\nGastrointestinal 4\nBladder 3\nHead & Neck 3\nSkin 3\n[Miscellaneous] 3\nEsophagus 2\nEye 2\nPancreas 2\nBone 1\nOral 1\nStomach 1\nUterine 1\ndoi:10.1371/journal.pone.0074250.t002\nSurvExpress: Biomarker Tool for Clinical Outcomes\nPLOS ONE | www.plosone.org 4 September 2013 | Volume 8 | Issue 9 | e74250\nand high-risk groups in the four datasets tested. Moreover,\nsatisfactory indexes of concordance and areas under the ROC\ncurve were obtained. These results can be obtained using\nSurvExpress in a few minutes. To demonstrate the analytical\nfeatures of SurvExpress, we also performed the survival evaluation\nstratifying the samples using the tumor grades provided by authors\n(AJCC Stage in the TCGA dataset and grade in the Ivshina\ndataset). Representative results for the Ivshina dataset are shown\nin Figure 4. The figure suggests that the performance, given by the\nconcordance index and log-rank test for risk groups, decreases\nalong grade. Results for the TCGA dataset are shown in the\nTutorial available in the SurvExpress web site.\nComparison of two lung cancer biomarkers. For non-\nsmall-cell lung cancer (NSCLC), at least 16 biomarkers have been\nproposed [16]. Here we compared two biomarkers proposed for\nsurvival of NSCLC that attempt to predict the same event\nFigure 3. Kaplan-Meier curves and performance of the OncoTypeDX biomarker in four datasets.Censoring samples are shown as ‘‘+’’\nmarks. Horizontal axis represents time to event. Dataset, outcome event, time scale, concordance index (CI), and p-value of the log-rank test are\nshown. Red and Green curves denote High- and Low-risk groups respectively. The red and green numbers below horizontal axis represent the\nnumber of individuals not presenting the event of the corresponding risk group along time. The number of individuals, the number of censored, and\nthe CI of each risk group are shown in the top-right insets.\ndoi:10.1371/journal.pone.0074250.g003\nTable 3.Datasets and clinical for the OncotypeDX example.\nDataset Platform\nSamples/\nCensored ER +/2 LN+/2 Outcome\nBreast Invasive Carcinoma TCGA[25] Agilent 502/437 388/109 Survival\nKao Huang Breast GSE20685[15] Affymetrix 327/244 Metastasis\nIvshina Miller Breast GSE4922[26] Affymetrix 249/160 211/34 81/159 Recurrence\nWang Foekens Breast GSE2034[27] Affymetrix 286/179 209/77 0/286 Recurrence\nER and LN stand for Estrogen Receptor and Lymph Node respectively.\ndoi:10.1371/journal.pone.0074250.t003\nSurvExpress: Biomarker Tool for Clinical Outcomes\nPLOS ONE | www.plosone.org 5 September 2013 | Volume 8 | Issue 9 | e74250\nFigure 4. Kaplan-Meier curves and performance of the OncoTypeDX biomarker in the breast cancer Ivshina dataset across three\ntumor grades.Legends as in Figure 3.\ndoi:10.1371/journal.pone.0074250.g004\nSurvExpress: Biomarker Tool for Clinical Outcomes\nPLOS ONE | www.plosone.org 6 September 2013 | Volume 8 | Issue 9 | e74250\nTable 4.Results of the Oncotype DX in four breast cancer datasets.\nDataset GenesFound ResponseTime*\nRisk Groupsp\nValue CI\nDEG betweenRisk\nGroups SurvivalROC**\nTCGA 16 9.1 s 2.9e-7 72.2 11 0.74\nKao GSE20685 16 6.1 s 2.0e-5 69.1 16 0.69\nIvshina GSE4922 16 6.0 s 5.0e-6 68.7 13 0.70\nWang GSE2034 16 6.0 s 1.1e-7 69.1 13 0.73\nCI stands for Concordance Index. DEG means differential expressed genes.\n*Response time of the results page.\n**SurvivalROC was estimated around time = 6 years, curves took one order of magnitude more than the response time shown.\ndoi:10.1371/journal.pone.0074250.t004\nFigure 5. Performance and representation the two NSCLC biomarkers.Kaplan-Meier curves as in Figure 3. Heat map shows the expression\nof each gene (rows) along samples (columns) in risk groups. Low expression is represented in green grades and high expression in red grades.\nCorresponding beta coefficients from the Cox fitting is shown. Two stars (**) marks genes whose fitting p-value ,0.05, one star (*) for marginal\nsignificant genes having p-value ,0.10, and no stars for genes whose p-value is .0.1. Box plots compare the difference of gene expression between\nrisk groups using a t-test.\ndoi:10.1371/journal.pone.0074250.g005\nSurvExpress: Biomarker Tool for Clinical Outcomes\nPLOS ONE | www.plosone.org 7 September 2013 | Volume 8 | Issue 9 | e74250\n(survival) and use a similar number of genes; however, the genes\nare different. The first NSCLC biomarker was proposed by\nBoutros et al. [17] and contains the following genes: STX1A,\nHIF1A, CCT3, HLA-DPB1, RNF5, and MAFK. The second\nNSCLC biomarker was proposed by Chenet al. [18] and contains\nthe genesDUSP6, MMD, STAT1, ERBB3, andLCK. Therefore, it\nis of clinical interest to compare their performance. For this, we\nperformed an analysis in SurvExpress using the maximum row\naverage for genes with multiple probesets, two risk groups by\nprognostic index median, and Cox fitting. We used a special lung\nmeta-base build in our research group, which is composed of more\nthan 1,000 samples obtained from six authors (Bild [19], Raponi\n[20], Zhu [21], Hou [22], NCI [23], Okayama [24]), equivalent\nAffymetrix gene expression platform, and containing all biomarker\ngenes.\nThe results show that both biomarkers are able to separate risk\ngroups characterized by differences in their gene expression (see\nKaplan-Meier and box plots respectively in Figure 5). Nonetheless,\nthe p-value of the risk group separation, the concordance index,\nand the significance of the coefficients were slightly better in the\nChen biomarker. To analyze the biomarkers more deeply, we\ntested the biomarker per database author using the SurvExpress\nstratification functionality (this can also be achieved performing a\nSurvExpress analysis per author dataset). The results for the six\nauthors are summarized in Table 5. Three representative\nexamples are shown in Figure 6. The results show that the\nBoutros biomarker fails in four datasets (the log-rank test of the\ndifference in risk groups is not significant) while the Chen\nbiomarker works better in almost all datasets. In summary, these\nresults suggest that the performance of Chen biomarker is\nsuperior.\nConclusion\nCompared with other tools, SurvExpress is the largest and the\nmost versatile free tool to perform validation of multi-gene\nbiomarkers for gene expression in human cancers. The analysis\nTable 5.Datasets and results of the Boutros and Chen biomarkers for the lung cancer example.\nDataset\nSamples/\nCensored\nBoutros p-Risk\nGroups\nBoutros\nOverall CI\nChen p-Risk\nGroups\nChen\nOverall CI\nRaponi Beer GSE4573[20] 130/63 0.255 57.2 0.019 55.3\nBild Nevins GSE3141[19] 108/50 0.027 59.4 0.023 57.6\nZhu Tsao GSE14814[21] 72/49 0.401 59.0 0.009 63.6\nHou Philipsen GSE19188[22] 64/23 0.771 54.5 0.028 62.4\nDirectors Challenge Consortium NCI[23] 444/207 0.001 58.2 0.001 60.3\nOkayama Kohno GSE31210[24] 226/191 0.222 59.1 0.006 66.1\np-Risk Groups column show the p-value of the equality between survival curves among risk groups.\ndoi:10.1371/journal.pone.0074250.t005\nFigure 6. Comparison of Kaplan-Meier curves of the two NSCLC biomarkers in three representative lung cancer databases.Legends\nas in Figure 3.\ndoi:10.1371/journal.pone.0074250.g006\nSurvExpress: Biomarker Tool for Clinical Outcomes\nPLOS ONE | www.plosone.org 8 September 2013 | Volume 8 | Issue 9 | e74250\nrequires only the list of genes and can be performed in\napproximately one minute per dataset. Common applications for\ntesting the performance of biomarkers include the evaluation of a\nbiomarker in other populations or clinical status and the\ncomparison of competing biomarkers. We have shown these two\napplications of SurvExpress comparing the performance of a\nbreast cancer biomarker in several datasets, including tumor\ngrades, and determining the best biomarker out of two alternative\nlung cancer biomarkers. We conclude that SurvExpress is a\nvaluable and comprehensive web tool and cancer database with\nclinical outcomes tailored to rapidly evaluate gene expression\nbiomarkers.\nAuthor Contributions\nConceived and designed the experiments: VT. Performed the experiments:\nRAG HGR EML AMT RCH ARB VT. Analyzed the data: VT JTP.\nContributed reagents/materials/analysis tools: RAG HGR EML AMT\nRCH ARB VT. Wrote the paper: VT RAG JTP.\nReferences\n1. Gyorffy B, Benke Z, Lanczky A, Balazs B, Szallasi Z, et al. (2012)\nRecurrenceOnline: an online analysis tool to determine breast cancer recurrence\nand hormone receptor status using microarray data. Breast Cancer Res Treat\n132: 1025–1034.\n2. Venet D, Dumont JE, Detours V (2011) Most random gene expression\nsignatures are significantly associated with breast cancer outcome. PLoS\nComput Biol 7: e1002240.\n3. Kern SE (2012) Why your new cancer biomarker may never work: recurrent\npatterns and remarkable diversity in biomarker failures. Cancer Res 72: 6097–\n6101.\n4. Mizuno H, Kitada K, Nakai K, Sarai A (2009) PrognoScan: a new database for\nmeta-analysis of the prognostic value of genes. BMC Med Genomics 2: 18.\n5. Ringner M, Fredlund E, Hakkinen J, Borg A, Staaf J (2011) GOBO: gene\nexpression-based outcome for breast cancer online. PLoS One 6: e17911.\n6. Budczies J, Klauschen F, Sinn BV, Gyorffy B, Schmitt WD, et al. (2012) Cutoff\nfinder: a comprehensive and straightforward web application enabling rapid\nbiomarker cutoff optimization. PLoS One 7: e51862.\n7. Jezequel P, Frenel JS, Campion L, Guerin-Charbonnel C, Gouraud W, et al.\n(2013) bc-GenExMiner 3.0: new mining module computes breast cancer gene\nexpression correlation analyses. Database (Oxford) 2013: bas060.\n8. Elfilali A, Lair S, Verbeke C, La Rosa P, Radvanyi F, et al. (2006) ITTACA: a\nnew database for integrated tumor transcriptome array and clinical data\nanalysis. Nucleic Acids Res 34: D613–616.\n9. Corradi L, Mirisola V, Porro I, Torterolo L, Fato M, et al. (2009) Survival\nOnline: a web-based service for the analysis of correlations between gene\nexpression and clinical and follow-up data. BMC Bioinformatics 10 Suppl 12:\nS10.\n10. Schriml LM, Arze C, Nadendla S, Chang YW, Mazaitis M, et al. (2012) Disease\nOntology: a backbone for disease semantic integration. Nucleic Acids Res 40:\nD940–946.\n11. Collett D (1993) Modelling Survival Data in Medical Research: Chapman and\nHall/CRC. 368 p.\n12. Bovelstad HM, Borgan O (2011) Assessment of evaluation criteria for survival\nprediction from genomic data. Biom J 53: 202–216.\n13. Heagerty PJ, Zheng Y (2005) Survival model predictive accuracy and ROC\ncurves. Biometrics 61: 92–105.\n14. Paik S, Shak S, Tang G, Kim C, Baker J, et al. (2004) A multigene assay to\npredict recurrence of tamoxifen-treated, node-negative breast cancer.\nN Engl J Med 351: 2817–2826.\n15. Kao KJ, Chang KM, Hsu HC, Huang AT (2011) Correlation of microarray-\nbased breast cancer molecular subtypes and clinical outcomes: implications for\ntreatment optimization. BMC Cancer 11: 143.\n16. Subramanian J, Simon R (2010) Gene expression-based prognostic signatures in\nlung cancer: ready for clinical use? J Natl Cancer Inst 102: 464–474.\n17. Boutros PC, Lau SK, Pintilie M, Liu N, Shepherd FA, et al. (2009) Prognostic\ngene signatures for non-small-cell lung cancer.\n18. Chen HY, Yu SL, Chen CH, Chang GC, Chen CY, et al. (2007) A five-gene\nsignature and clinical outcome in non-small-cell lung cancer. N Engl J Med 356:\n11–20.\n19. Bild AH, Yao G, Chang JT, Wang Q, Potti A, et al. (2006) Oncogenic pathway\nsignatures in human cancers as a guide to targeted therapies. Nature 439: 353–\n357.\n20. Raponi M, Zhang Y, Yu J, Chen G, Lee G, et al. (2006) Gene expression\nsignatures for predicting prognosis of squamous cell and adenocarcinomas of the\nlung. Cancer Res 66: 7466–7472.\n21. Zhu CQ, Ding K, Strumpf D, Weir BA, Meyerson M, et al. (2010) Prognostic\nand predictive gene signature for adjuvant chemotherapy in resected non-small-\ncell lung cancer. J Clin Oncol 28: 4417–4424.\n22. Hou J, Aerts J, den Hamer B, van Ijcken W, den Bakker M, et al. (2010) Gene\nexpression-based classification of non-small cell lung carcinomas and survival\nprediction. PLoS One 5: e10312.\n23. Shedden K, Taylor JMG, Enkemann SA, Tsao M-S, Yeatman TJ, et al. (2008)\nGene expression-based survival prediction in lung adenocarcinoma: a multi-site,\nblinded validation study. Nature Medicine 14: 822–827.\n24. Okayama H, Kohno T, Ishii Y, Shimada Y, Shiraishi K, et al. (2012)\nIdentification of genes upregulated in ALK-positive and EGFR/KRAS/ALK-\nnegative lung adenocarcinomas. Cancer Res 72: 100–111.\n25. Network CGA (2012) Comprehensive molecular portraits of human breast\ntumours. Nature 490: 61–70.\n26. Ivshina AV, George J, Senko O, Mow B, Putti TC, et al. (2006) Genetic\nreclassification of histologic grade delineates new clinical subtypes of breast\ncancer. Cancer Res 66: 10292–10301.\n27. Wang Y, Klijn JG, Zhang Y, Sieuwerts AM, Look MP, et al. (2005) Gene-\nexpression profiles to predict distant metastasis of lymph-node-negative primary\nbreast cancer. Lancet 365: 671–679.\nSurvExpress: Biomarker Tool for Clinical Outcomes\nPLOS ONE | www.plosone.org 9 September 2013 | Volume 8 | Issue 9 | e74250",
  "topic": "Biomarker",
  "concepts": [
    {
      "name": "Biomarker",
      "score": 0.6419669985771179
    },
    {
      "name": "JavaScript",
      "score": 0.5582435131072998
    },
    {
      "name": "Computer science",
      "score": 0.529136061668396
    },
    {
      "name": "Biomarker discovery",
      "score": 0.518696665763855
    },
    {
      "name": "Database",
      "score": 0.47042322158813477
    },
    {
      "name": "Web application",
      "score": 0.4564317762851715
    },
    {
      "name": "Cancer",
      "score": 0.4386494755744934
    },
    {
      "name": "Bioinformatics",
      "score": 0.3857302665710449
    },
    {
      "name": "Medicine",
      "score": 0.2877717614173889
    },
    {
      "name": "Gene",
      "score": 0.20775148272514343
    },
    {
      "name": "Biology",
      "score": 0.18056610226631165
    },
    {
      "name": "Internal medicine",
      "score": 0.1747700572013855
    },
    {
      "name": "World Wide Web",
      "score": 0.10645857453346252
    },
    {
      "name": "Proteomics",
      "score": 0.08548575639724731
    },
    {
      "name": "Biochemistry",
      "score": 0.0
    }
  ]
}