{
    "title": "Effect of the transformer-2 gene of Anastrepha on the somatic sexual development of Drosophila",
    "url": "https://openalex.org/W2031367638",
    "year": 2011,
    "authors": [
        {
            "id": "https://openalex.org/A2074952629",
            "name": "Francesca Sarno",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2203036771",
            "name": "María Fernanda Ruiz",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2098084083",
            "name": "Lucas Sanchez",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2148510288",
        "https://openalex.org/W2031611773",
        "https://openalex.org/W2090632804",
        "https://openalex.org/W7073739344",
        "https://openalex.org/W7073842202",
        "https://openalex.org/W6674738494",
        "https://openalex.org/W2049894216",
        "https://openalex.org/W2075962135",
        "https://openalex.org/W2040478918",
        "https://openalex.org/W6910869147",
        "https://openalex.org/W2026108361",
        "https://openalex.org/W2492742009",
        "https://openalex.org/W2083704076",
        "https://openalex.org/W1998579869",
        "https://openalex.org/W2027468099",
        "https://openalex.org/W2159077785",
        "https://openalex.org/W109419934",
        "https://openalex.org/W2110447200",
        "https://openalex.org/W2119139985",
        "https://openalex.org/W2091538676",
        "https://openalex.org/W2089398626",
        "https://openalex.org/W2025675521",
        "https://openalex.org/W2097666533",
        "https://openalex.org/W2081092282",
        "https://openalex.org/W2163963918",
        "https://openalex.org/W2114655336",
        "https://openalex.org/W1605923556",
        "https://openalex.org/W2054264286",
        "https://openalex.org/W2076241630",
        "https://openalex.org/W2075983980",
        "https://openalex.org/W2113962028",
        "https://openalex.org/W2418226530",
        "https://openalex.org/W1999265573",
        "https://openalex.org/W2140282079",
        "https://openalex.org/W2159707687",
        "https://openalex.org/W2147342818"
    ],
    "abstract": "The transformer-2 gene is involved in sex determination in tephritid flies (Tephritidae). It is required for the auto-regulation of the transformer gene (the memory device for sex determination in these insects) and for the female-specific splicing of doublesex pre-mRNA, the last gene in the sex determination gene cascade. The present manuscript addressed the question of the functional conservation of the tephritid Anastrepha Tra2 protein to direct sexual development in Drosophila (Drosophilidae). To express this protein in Drosophila, the GAL4-UAS system was used. The Anastrepha Tra2 protein supplies tra-2 function in Drosophila: this protein would form a complex with the endogenous Drosophila Tra protein to promote the female-specific splicing of the Drosophila doublesex pre-mRNA. The feminisation produced by the Anastrepha Tra2 protein was, however, partial.",
    "full_text": " \nEffect of the transformer-2 gene of Anastrepha on the \nsomatic sexual development of Drosophila\nFRANCESCA SARNO, MARÍA-FERNANDA RUIZ# and LUCAS SÁNCHEZ*,#\nCentro de Investigaciones Biológicas (C.S.I.C.), Madrid, Spain\nABSTRACT  The transformer-2 gene is involved in sex determination in tephritid flies (T ephritidae). \nIt is required for the auto-regulation of the transformer gene (the memory device for sex deter -\nmination in these insects) and for the female-specific splicing of doublesex pre-mRNA, the last \ngene in the sex determination gene cascade. The present manuscript addressed the question of \nthe functional conservation of the tephritid Anastrepha T ra2 protein to direct sexual development \nin Drosophila (Drosophilidae). T o express this protein in Drosophila, the GAL4-UAS system was \nused. The Anastrepha T ra2 protein supplies tra-2 function in Drosophila: this protein would form \na complex with the endogenous Drosophila T ra protein to promote the female-specific splicing of \nthe Drosophila doublesex pre-mRNA. The feminisation produced by the Anastrepha T ra2 protein \nwas, however, partial.\nKEY WORDS: Anastrepha, Drosophila, sex determination, transformer-2\nThe characterisation of sex determination genes in Drosophila \nMelanogaster has shown that the product of a gene controls the \nsex-specific splicing of the pre-mRNA from the downstream gene in \nthe genetic cascade (reviewed in Sánchez et al., 2005). Sex-lethal \n(Sxl) is at the top of this cascade and acts as the memory device \nfor female sexual development via its auto-regulatory function: \nits product controls the splicing of its own pre-mRNA (Bell  et al., \n1991). In addition, Sxl controls the splicing of the pre-mRNA from \nthe downstream gene transformer (tra) (Boggs et al., 1987; Belote \net al., 1989). The Tra product and the product of the constitutive \ngene transformer-2 (tra-2) (Goralski et al.,  1989; Amrein  et al.,  \n1990) control the sex-specific splicing of the pre-mRNA of the \ngene doublesex (dsx), which is transcribed in both sexes (Burtis \nand Baker 1989). In females, the Tra-Tra2 complex binds to the \nfemale-specific exon (see Fig. 2A) and directs the splicing of the \ndsx pre-mRNA according to the female mode, giving rise to the \nfemale DsxF protein that promotes female sexual development. \nIn males, in which no functional Tra protein is available, the dsx \npre-mRNA follows the default male mode of splicing, giving rise \nto the mature dsxM mRNA, which produces male DsxM protein \n(Burtis and Baker 1989; Hoshijima et al., 1991; Hedley and Maniatis \n1991; Ryner and Baker 1991; Tian and Maniatis 1993; Hertel  et \nal., 1996). This promotes male sexual development.\nGenes homologous to the sex determination genes of D. mela-\nnogaster have been sought in other insects (reviewed in Sánchez \n2008; Verhulst et al., 2010; Gempe and Beye 2010). In the tephritid \nInt. J. Dev. Biol. 55: 975-979\ndoi: 10.1387/ijdb.103279fs\nwww.intjdevbiol.com\n*Address correspondence to:  Lucas Sánchez. Centro de Investigaciones Biológicas, Ramiro de Maeztu 9, E-28040 Madrid, Spain. Tel: +34-91-837-31 12. \nFax: +34-91-536-0432. E-mail: lsanchez@cib.csic.es - #Note:  The indicated authors are co-senior authors.\nAccepted: 15 February 201 1. Final, author-corrected PDF published online: 13 December 201 1.\nISSN: Online 1696-3547, Print 0214-6282\n© 2011 UBC Press\nPrinted in Spain\nAbbreviations used in this paper: Tra-2, transformer-2. \nfruit flies, the Sxl gene is not regulated in a sex-specific fashion \n(Saccone et al., 1998; Lagos et al., 2005) so that in the tephritids, \nSxl does not appear to play the key discriminating role in sex \ndetermination that it plays in Drosophila. As in the drosophilids, \nthe tephritid tra (Pane et al., 2002; Lagos et al., 2007; Ruiz et al., \n2007) and tra-2 (Salvemini et al., 2009; Sarno et al., 2010) genes \nare expressed in both sexes. The tra primary transcript shows sex-\nspecific alternative splicing. However, whereas in the drosophilids \nSxl regulates tra, in the tephritids this gene appears to have an \nauto-regulatory function that produces functional Tra protein spe-\ncifically in females (Pane et al., 2002; Lagos et al., 2007; Ruiz et \nal., 2007) so that it plays the key regulatory memory device for sex \ndetermination (Pane et al., 2002). A similar role for tra has been \nobserved in the dipterans Musca domestica (Muscidae) (Hediger \net al., 2010) and in Lucilia cuprina (Calliphoridae)  (Concha and \nScott 2009). The injection of the respective tra-2 dsRNA into \nMusca (Burghardt et al., 2005), Ceratitis (Salvemini et al., 2009) \nand Anastrepha (Sarno et al., 2010) results in the destruction of \nendogenous tra-2 function in these species and the subsequent \nmale-specific splicing of the endogenous tra and dsx pre-mRNAs, \nleading to the transformation of genotypically female embryos \ninto adult pseudomales. This highlights the role of tra-2 in Musca, \nCeratitis and Anastrepha sex determination.\n976    F . Sarno et al.\nThe present paper studied whether the Anastrepha Tra2 protein \nshows conserved sex-determination function in Drosophila; i.e., \nwhether Anastrepha Tra2 is able to substitute the endogenous \nDrosophila Tra2 protein in the control of sex determination in this \nspecies.\nResults and Discussion\nThe rationale of the experiment was to express the transgenic \nAoTra2 protein in Drosophila XX pseudomales lacking the tra-2 \ngene function and checked whether these pseudomales showed \nfeminisation. The GAL4-UAS system was used to express the \nAoTra2 protein in Drosophila. \nThe systemic expression of AoTra2 with the ubiquitous-expres-\nsion da-GAL4 or hs-GAL4 drivers was found to be lethal to both \nmale and female flies. The same lethality has been observed in \nDrosophila males and females that ectopically express their own \nTra2 protein (Qi et al., 2006). Therefore, the rn-GAL4 local expres-\nsion driver was used. This driver expresses GAL4 in agreement with \nthe expression domain of the gene rotund (rn), which is expressed \nin imaginal discs as well as in the embryonic and larval central \nnervous systems (CNS) (St. Pierre et al., 2002). The expression \nof rn in the tarsal region of the foreleg imaginal disc commences \nduring the early third larval instar, but is no longer evident in the \nlate third instar, though in the rn-GAL4 line persists the tarsal \nexpression (St. Pierre et al., 2002). This rn-GAL4 driver allowed \nthe expression of the AoTra2 protein in the foreleg basitarsus, a \nwell-characterised sexually dimorphic region of Drosophila. The \nexpression of AoTra2 by the rn-GAL4 driver was also lethal to \nboth males and females. This might be due to the expression of \nAoTra2 in the embryonic and/or larval CNS, as mentioned above.\nTo prevent embryonic lethality a strategy was followed that \nallowed the temporal control of AoTra2 expression under the rn-\nGAL4 driver. For this purpose the GAL4/GAL80 system was used. \nThe GAL80 protein inhibits GAL4 function. GAL80 is temperature \nsensitive, with 18°C the most permissive temperature and 29 °C \nthe most restrictive ( McGuire et al., 2003). Drosophila XX pseu-\ndomales mutant for tra-2 and carrying Aotra-2-UAS together with \nrn-GAL4 and Tub-GAL80ts were produced. The cross producing \nthese pseudomales was performed at 18°C, and several two-days \negg collections were made. Three days later each collection was \ntransferred to 29 °C environment. By this time the larvae had \nhatched, which were maintained at this temperature for the rest of \ntheir development. This treatment eliminated the embryonic lethal-\nity caused by the expression of the AoTra2 protein. Even under \nthese conditions, the males and females expressing the AoTra2 \nprotein were lethally affected, probably because of an excess of \nthis transgenic protein affecting the development of the larval CNS.\nFinally, since at 25°C GAL80ts retains some function (McGuire et \nal., 2003), it was reasoned that if XX pseudomales mutant for tra-2 \nand carrying Aotra-2-UAS, rn-GAL4 and Tub-GAL80ts can develop \nat that temperature, the GAL4 from the rn-GAL4 driver ought not to \nbe completely inhibited. Consequently a certain amount of AoTra2 \nprotein ought to be produced (less than at 29°C) but which might \nnot be lethal. Thus, these pseudomales might be able to survive to \nadulthood. This was the case. Fig. 1 shows the effect of express-\ning the AoTra2 protein on the sexually dimorphic development of \nthe foreleg basitarsus in XX pseudomales and in their brother XY \nmales, both mutant for tra-2 and carrying Aotra2-UAS, rn-GAL4 \nand Tub-GAL80ts. The foreleg basitarsus contained several trans-\nversal rows, the last one forming the sex comb structure (SC) in \nmales and in XX pseudomales mutants for tra-2 (Fig. 1C). This \nis composed of dark, thick bristles, and is rotated to lie parallel to \nthe proximal-distal leg axis. Females lack the sex comb (Fig. 1B). \nA significant reduction (P<0.0001, one-way ANOVA) was seen in \nthe number of bristles forming the male sex comb structure in the \nforeleg basitarsus of XX pseudomales raised at 25°C (expressing \nthe AoTra2 protein) compared to those raised at 18°C (no expres-\nsion of the AoTra2 protein) (Fig. 1A). Examples are shown in Fig. \n1 D,E. In some cases, no sex comb-like bristles were found, yet \nthe last transverse row (LTR) was partially or completely rotated \nFig. 1. Effect of the Aotra2 transgene on the somatic development of \nDrosophila. (A) Size (number of bristles) of the sex comb in the Aotra2 \ntransgenic Drosophila flies. The bars in the histograms represent the 95% \nconfidence limits. The sample size is given in parenthesis underneath \nthe histogram. XX pseudomales: ywTDAo#1/w; tra-2B/Df(2R)trix,tra-2[-]; \nTub-GAL80ts,w+/ rn-GAL4,w[+]. XY males: ywTDAo#1/Y; tra-2B/Df(2R)\ntrix,tra-2[-]; Tub-GAL80ts,w[+]/  rn-GAL4,w[+](Cross I in Materials and \nMethods). (B) Foreleg basitarsus of wild type female. LTR stands for last \ntransversal row. (C) Foreleg basitarsus of XX pseudomale mutant for tra-2 \nat 18°C. SC stands for sex comb. (D,E) Foreleg basitarsus of XX pseudo-\nmales mutant for tra-2 at 25°C.\nWild type\nfemale\nC\nXX\npseudomale\nat 18ºC\nXX pseudomales\nat 25ºC\nSC\nSC\nLTR\nLTR\n0\n5\n10\n15\n25ºC\n25ºC18ºC 18ºC\n(38) (30) (36) (34)\nXX pseudomales XY males\nB C\nD E\nA\nEffect of Anastrepha tra-2 on Drosophila    977 \nresembling the location of the sex comb (Fig. 1D). In other cases, \na sex comb-like bristle was found between the female-like bristles \nthat form the last transversal row (arrow in Fig. 1E). The sex comb \nsize of pseudomales raised at 18 °C was the same as the sex \ncomb of their XY brothers whether raised at 18 or 25°C (Fig. 1A). \nThe presence of endogenous Drosophila DsxF protein is expec-\nted to cause this reversion of the male towards the female phenotype. \nThe analysis of the Drosophila dsx pre-mRNA splicing in transgenic \nDrosophila XX pseudomales mutant for tra-2 and expressing the \nAoTra2 protein confirmed this expectation. The inducible hs-GAL4 \ndriver was used to express the Aotra2 transgene. XX pseudomales \nyw/w; Df(2R)trix,tra2[-]/tra-2B; Aotra2/hs-GAL4 were produced at \n25°C. After the hatching of the adults the flies were divided into \ntwo populations; one was maintained at 25 °C (control flies) and \none subjected to heat-shock pulses (experimental flies) to induce \nthe expression of the Aotra2 transgene. At 25°C, the transgenic \nlines did not express the female dsx mRNA isoform (Fig. 2B). \nAfter the heat shocks, however, these transgenic lines expressed \nthe female dsx mRNA isoform (Fig. 2B). Two amplicons could be \ndetected. The smaller one (646 bp) corresponded to the female \ndsxF mRNA. The larger amplicon (758 bp) was to be expected if \nthe intron 3 were retained (Fig. 2B). The cloning and sequencing \nof both fragments confirmed these suppositions. These results \nwere not the consequence of the heat-shocks since their brothers \n(males yw/Y; Df(2R)trix,tra2[-]/tra-2B; Aotra2/hs-GAL4) expressing \nthe Aotra2 transgene did not express the female dsx mRNA isoform \n(Fig. 2C). Negative controls for all these PCR reactions produced \nno amplicons (see Materials and methods). Thus, the Anastrepha \nTra2 protein is able to promote the female-specific splicing of the \nDrosophila dsx pre-mRNA.\nWhereas the expression of Anastrepha Tra2 protein in the XX \npseudomales produced their feminisation, its expression in their \nXY normal brothers mutant for tra-2 did not affect their normal \nmale development. This different effect is explained by the pre -\nsence of Tra protein in the XX pseudomales and its absence in XY \nnormal males. It should be remembered that the female-specific \ndsx pre-mRNA splicing mode requires the binding of the Tra-Tra2 \ncomplex to the female-specific exon 4 (see Fig. 2A). Therefore, the \nAnastrepha Tra2 protein supplies tra-2 function in Drosophila: this \nprotein would form a complex with the endogenous Drosophila Tra \nprotein to promote the female-specific splicing of the Drosophila \ndsx pre-mRNA.\nThe feminisation produced by the Anastrepha Tra2 protein \nwas, however, partial, indicating that the function of this protein in \nDrosophila was incomplete. There are two possible explanations \nfor this. It might be due to an insufficient quantity of Anastrepha \nFig. 2. Effect of the Aotra2 transgene on the splicing of Dro-\nsophila dsx pre-mRNA. (A) Molecular organisation of Drosophila \ndsx pre-mRNA showing the male and the female splicing pattern. \nExons are represented in boxes and introns by dotted lines. The \nred bars in exon 4 represent the specific binding sequences for \nthe Tra-Tra2 complex. (B) RT -PCR analyses of total RNA from D. \nmelanogaster XX pseudomales mutant for tra-2 and either not \nexpressing (25°C) or expressing (HS) the Aotra-2 transgene. \nHS indicates heat shock treatment.  TDAo#2: XX pseudomale \nyw/w; tra-2B/Df(2R)trix,tra-2[-]; TDAo#2 / hs-GAL4,w[+]; TDAo#3: \nXX pseudomale yw/w; tra-2B/Df(2R)trix,tra-2[-]; TDAo#3 / hs-\nGAL4,w[+] (Crosses II and III in Materials and Methods).  (C) \nRT -PCR analyses of total RNA from D. melanogaster XY males \nmutant for tra-2 (brothers of the XX pseudomales). As a control, \nthe splicing of the primary transcript of gene rp49 that codes for \nthe constitutive ribosomal protein 49 was monitored.\nTra2 protein being produced in the Drosophila \ntransgenic flies; it was necessary to restrict the \namount of Anastrepha Tra2 protein that was \nexpressed since the production of any greater \namount is lethal. Alternatively, the interaction \nbetween the endogenous Drosophila Tra protein \nand the transgenic Anastrepha Tra2 protein \nmight be affected such that the DrosophilaTra-\nAnastrephaTra2 complex is less efficient than \nthe DrosophilaTra-Tra2 complex at inducing the \nfemale-specific splicing of the endogenous Dro-\nsophila dsx pre-mRNA, as it has been suggested \nfor the interaction between the Anastrepha \nTra and the Drosophila Tra2 proteins (Ruiz \nand Sánchez 2010). In this context, it is worth \nmentioning firstly the high degree of divergence \n500 pb\nMW\n286 pb\n758 pb\n646 pb\n1 2 3 4 5 6 7 8\ndsxF dsxF dsxF dsxFrp49 rp49 rp49rp49\n25ºC25ºC HS HS\nTDAo#2 TDAo#3\nD. melanogaster dsx gene\nMW 1 2 3 4 5 6 7 8\ndsxF dsxF dsxF dsxFrp49 rp49 rp49rp49\n25ºC25ºC HS HS\nTDAo#2 TDAo#3\n286 pb\n500 pb\n \nfemale splicing\nmale splicing\n2 3 4\n2 3 4\n[Tra-Tra2]\nB\nC\nA\n978    F . Sarno et al.\nbetween the Anastrepha and the Drosophila Tra2 proteins (Sarno \net al., 2010); secondly, the incomplete feminisation of Drosophila \nXX pseudomales mutant for tra and expressing the Ceratitis Tra \nprotein (Pane et al., 2005); and thirdly, the incomplete feminisation \nof Drosophila XX pseudomales mutant for tra-2 and expressing \neither the human (Dauwalder  et al.,  1996) or the Sciara (Martin \net al., 2011) tra-2 ortholog, whereas Drosophila virilis tra-2 gene \ncan fully replace the endogenous tra-2 function of Drosophila \nmelanogaster for normal female sexual development (Chandler et \nal., 1997). Collectively, these results suggest that the interaction \nbetween the Tra and Tra2 proteins of different species might be \nimpeded as a consequence of changes accumulated in these \nproteins after the drosophilids separated from the other dipteran \nphylogenetic lineages, thus suggesting that the Tra and Tra2 \nproteins co-evolved to exert their functions in sex determination.\nMaterials and Methods\nFlies and crosses\nDrosophila flies were cultured on standard food. For the description of \nthe mutant alleles and GAL4 constructs see Lindsley and Zimm (1992) \nand FlyBase. The crosses to produce the flies were:\nCross I: Females ywTDAo#1; tra-2B/CyO,Cy; Tub-GAL80ts[w+]/MKRS,Sb \nand males w/Y; Df(2R)trix,tra-2[-]/CyO,Cy; rn-GAL4[w+]/MKRS,Sb\nCross II: Females yw; tra-2B/CyO,Cy; TDAo#2[w+]/MKRS,Sb \nand males w/Y; Df(2R)trix,tra-2[-]/CyO,Cy; hs-GAL4[ry+]/MKRS,Sb\nCross III: Females yw; tra-2B/CyO,Cy; TDAo#3[w+]/MKRS,Sb \nand males w/Y; Df(2R)trix,tra-2[-]/CyO,Cy; hs-GAL4[ry+]/MKRS,Sb\nMorphological analysis\nFlies used for the analysis of adult forelegs were kept in a mixture of \nethanol:glycerol (3:1) for several days. They were then macerated in 10% \nKOH at 60°C for 15 min, thoroughly washed with water and mounted in \nFaure’s solution for inspection under a compound microscope.\nProduction of the Aotra2 transgenic Drosophila melanogaster  lines \n(TDAo)\nFor the construction of the Aotra2 transgene, the tra-2 ORF of A. obli-\nqua was amplified by RT-PCR. The PCR reaction was performed using \nprimers PRtra2-1Ao (5’AGAGTTGGAATGAGTCCACG3’) and PRtra2-2Ao \n(5’CATATTTTTAATAGCGCGTACG3’). The resulting amplicon was cloned \nin pGEMT-easy (Promega), following manufacturer’s instructions. The \ninserted fragment was then cut with EcoRI and cloned in the EcoRI site of \npUAST. The microinjections for generating the TDAo (UAS::Aotra-2 cDNA) \ntransgenic D. melanogaster lines were performed by Genetic Services \n(Sudbury, MA, USA). To ascertain that each transgenic line was carrying \nthe correct transgene, PCR on genomic DNA with primers PRtra2-1Ao and \nPRtra2-2Ao was used to amplify the whole transgene and the amplicons \nwere cloned in pGEMT-easy (Promega), following manufacturer’s ins -\ntructions and sequenced. Three transgenic lines were produced: TDAo#1 \n(with the Aotra-2 transgene inserted in the X chromosome), and TDAo#2 \nand TDAo#3 with the Aotra-2 transgene inserted in the third chromosome. \nTDAo stands for pUAS::Aotra-2 cDNA.\nAnalysis of the splicing of dsx pre-mRNA in transgenic Drosophila \nMelanogaster lines\nThe effect of Anastrepha Tra2 protein on the splicing control of Drosophila \ndsx pre-mRNA was studied in transgenic Drosophila XX flies mutant for \ntra-2 and expressing the Anastrepha Tra2 protein. The inducible hs-GAL4 \ndriver was used to express the Aotra2 transgene. XX pseudomales of \ngenotype yw/w; tra-2B/Df(2R)trix,tra2-; TDAo#2/hs-GAL4 and of genoty-\npe yw/w; tra-2B/Df(2R)trix,tra2-; TDAo#2/hs-GAL4 , and their respective \nXY brothers of genotype yw/Y; tra-2B/Df(2R)trix,tra2-; TDAo#2/hs-GAL4 \nand of genotype yw/Y; tra-2B/Df(2R)trix,tra2-; TDAo#2/hs-GAL4 were \nproduced at 25°C (see Crosses II and III above). After the hatching of the \nadults, the XX pseudomales and their XY brothers were divided into two \npopulations; one was maintained at 25°C (control flies) and one subjected \nto heat-shock pulses (experimental flies) to induce the expression of the \nAotra2 transgene. Two 3 hours heat shock pulses (37°C) per day for two \nconsecutive days with recovery at 25°C between pulses were given to the \nexperimental flies. The effect of transgenic AoTra2 protein on Drosophila \ndsx pre-mRNA splicing was analysed by RT-PCR on total RNA from adults, \nwhich was prepared using the Ultraspec-II RNA isolation kit (Biotecx) \nfollowing the manufacturer’s instructions. Reverse transcription reactions \nwere performed with an oligo-dT. Two percent of the synthesised cDNA \nwas amplified by PCR, and one percent of this PCR was used for a second \nround of amplification, in a total volume of 50 ml. The primers used were: \ndsx1 (5’CATCGGGAACATCGGTGATC3’) and dsxF1 (5’AACGGCTGT-\nCACACATCGAC3’). \nThe PCR conditions were 95°C, 5 minutes, followed by 45 cycles of 95°C \nfor 10 seconds, 60°C for 30 seconds, and 72°C for 20 seconds each cycle, \nplus an extension step at 72°C for 7 minutes. In all cases, PCR reactions \nwith RNA samples were performed to guarantee there was no contamination \nwith genomic DNA (negative controls of PCR reactions). The amplicons were \ncloned in pGEMT-easy (Promega), following manufacturer’s instructions. \nDNA sequencing\nIt was used an automated 377 DNA sequencer (Applied Biosystems) \nand the primers forward M13 (-20) and reverse M13 reverse (-24).\nAcknowledgments\nWe thank B. Oliver, I. Guerrero, M. Calleja, F. Díaz-Benjumea, E. \nSánchez-Herrero and S. Campuzano for providing Drosophila stocks. We \nare grateful to F. Díaz-Benjumea for bringing our attention to the GAL-80 \ndriver. This work was financed by grant BFU2008-00474 awarded to L. \nSánchez by the D.G.I.C.Y.T.\nReferences\nBELL, L. R., HORABIN, J. I., SCHEDL, P. and CLINE, T.W. (1991). Positive auto -\nregulation of Sex-lethal by alternative splicing maintains the female determined \nstate in Drosophila. Cell 65: 229–239.\nBELOTE. J. M., MCKEOWN, M., BOGGS, R. T., OHKAWA, R. and SOSNOWSKI, \nB. A. (1989). The molecular genetics of transformer, a genetic switch-controlling \nsexual differentiation in Drosophila. Devel. Genet. 10: 143–154.\nBOGGS, R. T., GREGOR, P., IDRISS, S., BELOTE, J. M. and MCKEOWN, M. (1987). \nRegulation of sexual differentiation in Drosophila Melanogaster via alternative \nsplicing of RNA from the transformer gene. Cell 50: 739–747.\nBURTIS, K.C. and BAKER, B.S. (1989). Drosophila doublesex gene controls somatic \nsexual differentiation by producing alternatively spliced mRNAs encoding related \nsex-specific polypeptides. Cell 56: 997–1010.\nBURGHARDT, G., HEDIGER, M., SIEGENTHALER, C., MOSER, M., DÜBENDOR-\nFER, A and BOPP, D. (2005) The transformer-2 gene in Musca domestica is \nrequired for selecting and maintaining the female pathway of development. Dev \nGenes Evol 215:165-176.\nCHANDLER, D., MCGUFFIN, M., PISKUR, J., YAO, J., BAKER, B. and MATTOX, W. \n(1997) Evolutionary conservation of regulatory strategies for the sex determination \nfactor transformer-2. Mol Cell Biol 17: 2908–2919.\nCONCHA, C. and SCOTT, M. J. (2009) Sexual development in Lucilia cuprina (Dip-\ntera, Calliphoridae) is controlled by the transformer gene. Genetics 182: 785-789.\nDAUWALDER, B., AMAYA-MANZANARES, F. AND MATTOX, W. (1996) A human \nhomologue of the Drosophila sex determination factor transformer-2 has con -\nserved splicing regulatory functions. Proc. Natl. Acad. Sci. USA 93: 9004-9009.\nGEMPE, T and BEYE, M. (2010). Function and evolution of sex determination me -\nchanisms, genes and pathways in insects. BioEssays 33: 52-60.\nHEDIGER, M., HENGGELER, C., MEIER, N., PÉREZ, R., SACCONE, G. and \nBOPP, D. (2010) Molecular characterization of the key switch F provides a basis \nfor understanding the rapid divergence of the sex-determining pathway in the \nEffect of Anastrepha tra-2 on Drosophila    979 \nhousefly. Genetics 184: 155-170.\nHEDLEY, M. and MANIATIS, T. (1991) Sex-specific splicing and polyadenylation \nof dsx pre-mRNA requires a sequence that binds specifically to tra-2 protein in \nvitro. Cell 65: 579–586.\nHOSHIJIMA, K., INOUE, K., HIGUCHI, I., SAKAMOTO, H. and SHIMURA, Y. (1991). \nControl of doublesex alternative splicing by transformer and transformer-2 in \nDrosophila. Science 252: 833–836.\nLAGOS, D., RUIZ, M. F., SÁNCHEZ, L. and KOMITOPOULOU, K. (2005) Isolation and \ncharacterization of the Bactrocera oleae genes orthologous to the sex determining \nSex-lethal and doublesex genes of Drosophila Melanogaster. Gene 384: 111-121.\nLAGOS, D., KOUKIDOU, M., SAVAKIS, C. and KOMITOPOULOU, K. (2007). The \ntransformer gene in Bactrocera oleae: the genetic switch that determines its sex \nfate. Insect Mol. Biol. 16: 221-230.\nLINDSLEY, D. L. and ZIMM, G.(1992) The genome of Drosophila Melanogaster. San \nDiego, California. Academic Press.\nMARTÍN, I., RUIZ, M. F. AND SÁNCHEZ, L. (2011) The gene transformer-2 of Sciara \n(Diptera, Nematocera) and its effect on Drosophila sexual development. BMC \nDev. Biol. 11: 19.\nMCGUIRE, S. E., LE, P. H., OSBORN, A. J., MATSUMOTO, K. and DAVIS, R. L. \n(2003). Spatiotemporal rescue of memory dysfunction in Drosophila. Science \n302: 1765-1768.\nPANE, A., SALVEMINI, M., BOVI, P. D., POLITO, C. and SACCONE, G. (2002). The \ntransformer gene in Ceratitis capitata provides a genetic basis for selecting and \nremembering the sexual fate. Development 129: 3715–3725.\nPANE, A., DE SIMONE, A., SACCONE, G and POLITO, C. (2005). Evolutionary con-\nservation of Ceratitis capitata transformer gene function. Genetics 171: 615-624.\nQI, J., SU, S., MCGUFFIN, M. E. and MATTOX, W. (2006). Concentration dependent \nselection of targets by an SR splicing regulator results in tissue-specific RNA \nprocessing. Nucl. Acids Res. 34: 6256-6263.\nRUIZ, M. F., MILANO, A., SALVEMINI, M., EIRÍN-LÓPEZ, J.M., PERONDINI, A. L. \nP., SELIVON, D., POLITO, C., SACCONE, G. and SÁNCHEZ, L. (2007). The \ngene transformer of Anastrepha fruit flies (Diptera, Tephritidae) and its evolution \nin insects. PLoS ONE 2: e1239.\nRUIZ, M. F. and SÁNCHEZ, L. (2010). Effect of the gene transformer of Anastrepha \non the somatic sexual development of Drosophila. Int. J. Dev. Biol. 54: 627-633.\nRYNER, L. C. and BAKER, B. S. (1991). Regulation of doublesex pre-mRNA proces-\nsing occurs by 3’-splice site activation. Genes Dev. 5: 2071-2085.\nSACCONE, G., PELUSO, I., ARTIACO, D., GIORDANO, E., BOPP, D. and POLITO, \nC. (1998). The Ceratitis capitata homologue of the Drosophila sex-determining \ngene Sex-lethal is structurally conserved, but not sex-specifically regulated. \nDevelopment 125: 1495–1500.\nSALVEMINI, M., ROBERTSON, M., ARONSON, B., ATKINSON, P., POLITO, C. \nand SACCONE, G. (2009). Ceratitis capitata transformer-2 gene is required to \nestablish and maintain the autoregulation of Cctra, the master gene for female \nsex determination. Int. J. Dev. Biol. 53: 109-120.\nSÁNCHEZ, L., GORFINKIEL, N. and GUERRERO, I. (2005). Sex determination and \nthe development of the genital disc. In Comprehensive Molecular Insect Science, \nVolume 1, pp. 1-38. Edited by Gilbert LI, Iatrou K, Gill SS. Oxford, Elsevier Pergamon.\nSÁNCHEZ, L. (2008). Sex-determining mechanisms in insects. Int. J. Dev. Biol. 52: \n1059-1075.\nSARNO, F., RUIZ, M. F., EIRÍN-LÓPEZ, J. M., PERONDINI, A. L. P., SELIVON, D. and \nSÁNCHEZ, L. (2010). The gene transformer-2 of Anastrepha fruit flies (Diptera, \nTephritidae) and its evolution in insects. BMC Evol Biol 10: 140.\nST. PIERRE, S. E., GALINDO, M. I., COUSO, J. P. and THOR, S. (2002). Control of \nDrosophila imaginal disc development by rotund and roughened eye, differen-\ntially expressed transcripts of the same encoding functionally distinct zinc finger \nproteins. Development 129: 1273-1281.\nVERHULST, E. C., VAN DE ZANDE, L. and BEUKEBOOM, L. W. (2010) Insect sex \ndetermination: it all evolves around transformer. Curr. Opin. Gene. Devel. 20: 1–8.\nFurther Related Reading, published previously in the Int. J. Dev. Biol. \nEffect of the gene transformer of Anastrepha on the somatic sexual development of Drosophila\nRuiz MF and Sánchez L. \nInt. J. Dev. Biol. (2010) 54: 627-633 \nGenetic evidence against a role for W-linked histidine triad nucleotide binding protein (HINTW) in avian sex determination\nCraig A. Smith, Kelly N. Roeszler and Andrew H. Sinclair. \nInt. J. Dev. Biol. (2009) 53: 59-67  \nCeratitis capitata transformer-2 gene is required to establish and maintain the autoregulation of Cctra, the master gene for female \nsex determination\nSalvemini M, Robertson M, Aronson B, Atkinson P, Polito LC and Saccone G. \nInt. J. Dev. Biol. (2009) 53: 109-120\nCloning and functional characterization of the intersex homologous gene in the pest lepidopteron Maruca vitrata\nCavaliere D, di Cara F, Polito LC, and digilio FA. \nInt. J. Dev. Biol. (2009) 53: 1057-1062\nISI Impact Factor (2010) = 2.86\nSex-determining mechanisms in insects\nSánchez L. \nInt. J. Dev. Biol. (2008) 52: 1059-1075\nMasculinization of XX Drosophila transgenic flies expressing the Ceratitis capitata \nDoublsexM isoform\nSaccone G, Salvemini M, Pane A and Polito C.  \nInt J Dev Biol (2008) 52: 1043-1050\nMusca domestica, a window on the evolution of sex-determining mechanisms in insects.\nDübendorfer A, Hediger M, Burghardt G and Bopp D. \nInt. J. Dev. Biol. (2002) 46: 75-79\nIn vitro binding and expression studies demonstrate a role for the mouse Sry Q-rich \ndomain in sex determination\nJ Zhang J, Coward, Xian M and Lau YF.\nInt. J. Dev. Biol. (1999) 43: 219-227\nCharacterization of ovine SRY transcript and developmental expression of genes \ninvolved in sexual differentiation\nPayen E, Pailhoux E, Abou Merhi R, Gianquinto L, Kirszenbaum M, Locatelli A and Cotinot C.\nInt. J. Dev. Biol. (1996) 40: 567-575"
}