{
  "title": "Estimating the effect of cutting data on surface roughness and cutting force during WC-Co turning with PCD tool using Taguchi design and ANOVA analysis",
  "url": "https://openalex.org/W2031092513",
  "year": 2014,
  "authors": [
    {
      "id": "https://openalex.org/A1983912461",
      "name": "Wojciech Zębala",
      "affiliations": [
        "Cracow University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2137239370",
      "name": "Robert Kowalczyk",
      "affiliations": [
        "Cracow University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A1983912461",
      "name": "Wojciech Zębala",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2137239370",
      "name": "Robert Kowalczyk",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W1013724082",
    "https://openalex.org/W92139378",
    "https://openalex.org/W2024139140",
    "https://openalex.org/W2064339412",
    "https://openalex.org/W2099077825",
    "https://openalex.org/W2112013487",
    "https://openalex.org/W2108508995",
    "https://openalex.org/W2004611752",
    "https://openalex.org/W2003428971",
    "https://openalex.org/W1973623714",
    "https://openalex.org/W2084243031",
    "https://openalex.org/W1966331561",
    "https://openalex.org/W2148173193",
    "https://openalex.org/W2015746338",
    "https://openalex.org/W2091620892",
    "https://openalex.org/W2092679589",
    "https://openalex.org/W2055620319",
    "https://openalex.org/W1969470616",
    "https://openalex.org/W2019749482",
    "https://openalex.org/W2005585791",
    "https://openalex.org/W1968812247",
    "https://openalex.org/W2050030376",
    "https://openalex.org/W2621201707",
    "https://openalex.org/W1598813557",
    "https://openalex.org/W153458474",
    "https://openalex.org/W2504674580",
    "https://openalex.org/W2098314784",
    "https://openalex.org/W2625990143",
    "https://openalex.org/W2338331111",
    "https://openalex.org/W2185302767",
    "https://openalex.org/W639796129",
    "https://openalex.org/W2138232691"
  ],
  "abstract": "The cutting of high hardness composite materials such as sintered carbides based on the cobalt is a challenge from a technological point of view. The paper presents the influence of cutting data (v c, f, a p) and cobalt content in a work piece (10, 15, and 25 wt%) on the turning process of WC-Co with polycrystalline diamond (PCD) tool. This study focuses on the main component of cutting force F c and surface roughness, described by the roughness parameter Ra. The research plan, based on the Taguchi method, and variance analysis ANOVA were applied. Two types of experimental model, which describes turning process of sintered carbides based on the power function for three variables and polynomial functions as a modified method of the response surface methodology (RSM), were also presented.",
  "full_text": "ORIGINAL ARTICLE\nEstimating the effect of cutting data on surface roughness\nand cutting force during WC-Co turning with PCD tool using\nTaguchi design and ANOV A analysis\nWojciech Zębala & Robert Kowalczyk\nReceived: 28 February 2014 /Accepted: 8 September 2014 /Published online: 3 December 2014\n# The Author(s) 2014. This article is published with open access at Springerlink.com\nAbstract The cutting of high hardness composite materials\nsuch as sintered carbides based on the cobalt is a challenge\nfrom a technological point of view. The paper presents the\ninfluence of cutting data (vc, f, ap) and cobalt content in a work\npiece (10, 15, and 25 wt%) on the turning process of WC-Co\nwith polycrystalline diamond (PCD) tool. This study focuses\non the main component of cutting forceFc and surface rough-\nness, described by the roughness parameter Ra. The research\nplan, based on the Taguchi method, and variance analysis\nANOV A were applied. Two types of experimental model,\nwhich describes turning process of sintered carbides based\non the power function for three variables and polynomial\nfunctions as a modified method of the response surface meth-\nodology (RSM), were also presented.\nKeywords Turning .Sinteredcarbides .PCD .Cuttingforce .\nSurface roughness\n1 Introduction\nThe introduction of new standards in the field of environmen-\ntal protection imposes the implementation of the new technol-\nogy of super-hard material (such as sintered carbides WC-Co)\nmachining [1]. Currently, most of these types of material are\nmachined by grinding or electro-discharge (EDM) processes\n[2]. These processes are time-consuming and expensive, and\ncontemporary companies find savings at every stage of pro-\nduction [3]. For the manufacture of WC-Co parts (for exam-\nple, punches and construction parts), which are characterized\nby a high degree of hardness, high resistance to wear, and low\nsurface roughness [4–7], alternative methods of production\ncan be used. Machining with polycrystalline diamond (PCD)\ntools is one of the proposed solutions [2, 8–12]. PCD is\ncharacterized by a high degree of hardness, high thermal\nconductivity, as well as a low coefficient of friction in contact\nwith the material being worked on and abrasion resistance [8,\n13, 14].\nAt present, there is a lack of full knowledge about sintered\ncarbides turning processes using PCD tools. The first studies\nin this area were described in the work [15]. The authors\npresented durability research of tools made of cBN and\nPCD, as well as silicon plates covered with chemical vapor\ndeposition (CVD) diamond coating, soldered onto the sintered\ncarbides holder, and surface quality after turning of WC-Co\ncontaining 27 wt% Co. The greatest value of surface rough-\nness and the smallest cutting edge durability were obtained for\nPCD tools. In next studies, Belmonte et al. [16]d e t e r m i n e dt h e\ncutting data (v\nc, f, ap) influence on the machining force value,\nwear tools, and working surface roughness while dry turning\nof WC-Co with 25 wt% Co content using CVD diamond\nbrazed tools. The smallest machined surface roughness was\nobserved in the case when the value of machining forceF\nc\nwas below 35 N. However, in the work, the impact of a cutting\nedge shape on machining process was not included. The work\nof Almeida et al. [17] can be complementary to these studies,\nin which the influence of the cutting edge shape (sharp, honed,\nand chamfered) of round cutting tool inserts made via direct\ndiamond deposition on Si\n3N4 ceramic substrate on the cutting\nforce value while turning of WC-Co containing 25 wt% Co\nwas analyzed. The smallest machining force values and the\nbest work piece finishing quality (Ra<0.2μm) were regis-\ntered for tools with the sharp edge tools.\nIn the separate study, conducted by Heo [18], the influence\nof WC particle size in the deformation zone on the wear of the\nPCD cutting tool while microcutting of wear-resistant\nW. Zębala (*) : R. Kowalczyk\nProduction Engineering Institute, Mechanical Faculty, Cracow\nUniversity of Technology, Avenue Jana Pawła II 37, 31-864 Kraków,\nPoland\ne-mail: zebala@mech.pk.edu.pl\nInt J Adv Manuf Technol (2015) 77:2241–2256\nDOI 10.1007/s00170-014-6382-6\ntungsten carbides containing 22 wt% Co is presented. During\nmachining, two chip formation types were received dependent\non the shear angle. The thrust cutting forces presented a\ngreater tendency to increase its value than the principal forces\nat an increase ofa\np and vc parameter values. The feed force\nshowed a tendency to decrease its value with increasing of\ntool wear, which was a result of the cutting edge recession. In\nthe publication, the influence of Co content in the material\nstructure on the cutting forces was not described.\nCobalt content impact on the cutting process is partially\ndescribed in Almeida et al.’sr e s e a r c h[19]. Authors analyzed\nthree types of dry turning of WC-Co with the WC grain size in\nthe range of 2–6 μm and Co content (18–27 wt%). The\nhighest tool wear and cutting force values were obtained for\nmaterial with the smallest Co content (18 wt%). During stud-\nies, the highest values were observed for the thrust force and\nthe smallest for the feed force (similar effect to grinding). It\nwas also found that the higher Co content grade in the material\nstructure induces an easy formation of a built-up edge (BUE)\nresulting in cutting force discontinuities. The critical force by\nwhich a tool destruction occurred had a value approximately\n700 N.\nIn previously described research, the effect of the adhesion\nprocess between the tool and cutting material in the sintered\ncarbide turning process in the environment of the cooling-\nlubricant substance has not been described. This impact was\npresented in the works [20, 21]. The work [20]p r e s e n t sa n\neffect of WC and Co additives in four kinds of cemented\ncarbides on machinability and tool wear characteristics. In\nthe studies of the materials of different Co contents (10, 13,\n19, 25 wt%), three different cooling conditions (dry, wet, and\nmist) were turned in. Research on the cooling effect of the\ncutting process showed that the smallest roughness values\nwere obtained for turning with the application of the so-\ncalled oil mist. The influence of the Co content and WC grain\nsizes on cutting process by the effect of wear by tools confirms\nthe results presented in [18, 19], while both dry turning and\nusing coolant cutting forces increase have a linear character.\nThe size of WC grains significantly influences on the tool\nwear when turning in the oil mist. With increasing a WC\nparticle diameter in the material structure, the chip shape\nirregularities increase.\nIn the next publication [ 21], a comparison of the\nsintered carbides with 10 wt% Co content machining\nwith PCD, cBN, and PcBN tools can be found. The\nsmallest cutting insert wear was noted for PCD tools.\nThe impact of cooling-lubricant substance on machining\nprocess is similar as in the work [20].\nAlmeida et al. [22] presented the results of the cutting\nforce research during WC-Co (18 wt% Co) machining for\nthe two angular configurations of the tool: (i) neutral rake\nangle 0°, clearance angle 11° and (ii) negative rake angle\n−6°, clearance angle 6°. These results were not presented in\n[15, 16, 18, 20]. The study used CVD diamond-coated\nsilicon tools as well as PCD tools. Tools with CVD coating\nwere characterized by a greater durability, alike as described\nin [15]. In the case of PCD tools, a very clear tendency to the\nadhesion with work piece material was demonstrated, simi-\nlarly as in [21], due to a high cobalt content in the cutting\nmaterial (18 wt% Co). The coefficients of friction between\nthe tool and work piece material as the tangent to normal\nforces ratio (F\nT/FN) were determined in the work too. For\ntools received by CVD method, the friction coefficient value\nwas 0.7 after 180 m of cutting. In the case of PCD tools, the\nsame friction coefficient value was appointed already after\n70 m of cutting. For tools with diamond coating, an influ-\nence of angle configuration on the tools wear was not no-\nticed. For the both configuration cases, the similar wear\noccurred.\nZhang et al. [23] compared the grinding of WC-Co with\ndiamond and cBN grinding wheels as well as turning with\nPCD tools. In the case of turning, surface roughness had\nvalues in the range of 0.63–1.19 μm at material removal rate\n(MRR) 2.37–18.7 mm\n3/s, and grinding with diamond/cBN\ngrinding wheel roughness parameter was 0.017–0.1 μma t\nMRR 0.667–2m m3/s.\nThe above presented examples do not describe accurate\nranges of cutting data which can be used during sintered\ncarbides turning with different cobalt contents. There is a lack\nof characteristics which describe the influence of tool cutting\nedge wear on cutting forces and surface roughness values.\nAvailable research shows the impact of cutting data on the\nmachined surface quality only if two cutting parameters are\npermanent and the third is changeable. The percentage effect\nof individual cutting data on cutting force values has not been\ndetermined.\nNo comprehensive study of the super hard material\nturning, such as sintered carbides WC-Co with different\nCo contents, using PCD tools was the sole reason for\nundertaking the research described in this paper. An\nalgorithm of experimental models building and optimiza-\ntion of WC-Co turning process was presented, which\nincludes the research of cutting data ( v\nc, f, ap)a sw e l l\nas Co content in the material structure influence on the\nmain cutting force component F\nc and machined surface\nquality, described by Ra parameter. Cutting data optimi-\nzation due to the minimization of the roughness param-\neter Ra and force F\nc were conducted for the three types\nof sintered carbides: (i) 10 wt% Co and 90 wt% WC; (ii)\n15 wt% Co, 0.15 wt% VC, and 84.85 wt% WC; and (iii)\n25 wt% Co, 0.15 wt% VC, and 74.85 wt% WC.\nExperimental research based on the Taguchi method\nand ANOVA variance analysis were described in\nSection 2 and results analysis in Section 3; however,\nexperimental models building describing WC-Co turning\nprocess with PCD tool were presented in Section4.\n2242 Int J Adv Manuf Technol (2015) 77:2241–2256\n2 Research of WC-Co turning with PCD tools\n2.1 Algorithm of empirical models creation and optimization\nof WC-Co turning process\nFigure 1 summarizes the algorithm of WC-Co turning process\noptimization using the PCD tools and the steps of two differ-\nent types of empirical models building, based on the power\nand polynomial functions, respectively. The function of this\nalgorithm is presented in the following sections of the paper.\n2.2 Taguchi design\nIn the 1950s, Japanese scholar Genichi Taguchi proposed a\nmethod which used, among other things, research planning in\norder to identify factors that most influence on an investigated\nphenomenon. In the case of manufacturing companies, which\nuse the Taguchi method, it is possible to find factors that\ngenerate losses or delays in their production. The main feature\nof the design of experiment according to the Taguchi method\nis to identify the parameter values (factors controlled) for\nwhich the best value (min or max) of the investigated phe-\nnomenon is obtained, i.e., cutting forces, which is resistant to\nthe S/N ratio (so-called the signal-to-noise ratio). Tables,\nwhich described the research plan according to the Taguchi\nmethod (so-called orthogonal array), allow to select the right\namount tested factors, so-called factor levels [24–31]. The\nTaguchi design advantage over traditional methods is the\nsimplicity of usage for a variety of research plans and the\npossibility of simultaneous modeling of the average response\nof the research factor on the investigated phenomenon\n[25–27]. The usage types of the S/N ratio are described in\nAppendix 1.\nTo study the influence of the cutting data (v\nc, f, ap)a n dC o\ncontent in the material structure on the process of sintered\ncarbides turning with PCD tools, the orthogonal array type of\nL\n9 was selected. The L9 array is characterized by the research\nplan for three variables of the cutting parameters at three\ndifferent values, which corresponds to a total of nine research\ntests (Table1). The cutting data values were divided into the\nappropriate levels and the numerical values (1, 2, 3) were\nassigned to the particular level. The codes in the letters form\n(A, B, C) were set to the suitable cutting data. For the tradi-\ntional plan of research, at least 27 research samples should be\nperformed [24–26].\nThe selection of the cutting data for the sintered carbides\nturning was based on the ranges proposed by the manufacturer\nof the cutting tools, Mitsubishi company [32]:\n& a\np≤0.5 mm\n& f≤0.2 mm/rev\n& vc=(5–20)m/min\nThe test stand, for recording of the main cutting force\ncomponent Fc, was built on the precision lathe with Kistler\npiezoelectric dynamometer, attached to the tool holder\nModification \nof RSM \nequation\nap; f; vc; \n%Co\nTaguchi \ndesign\nANOVA analysis\nOptimization \nby S/N ratio Selection of factors type\nRSM \nequation\n1st type of empirical model \nbased on involution \nfunction\nap; f; \nvc; \nap; f; \nvc;%Co\n2nd type of empirical model \nbased on modification of RSM \nequation\nErrors for 1st and 2nd type of empirical models\nEnd\nStart\nFig. 1 Algorithm of empirical\nmodel creation and optimization\nof WC-Co turning process.S/N\nmeans signal-to-noise\n(Appendix 1)\nTable 1 Cutting data, based on the manufacturer’s catalogue, using\nnotation of the L9 array\nCutting data Code Unit Levels\n123\nFeed f A mm/rev 0.105 0.153 0.211\nCutting speedvc B m/min 10 15 20\nDepth of cutap C mm 0.2 0.35 0.5\nInt J Adv Manuf Technol (2015) 77:2241–2256 2243\n(Fig. 2). Measurement of the surface roughness was per-\nformed using the Taylor Hobson profilometer.\nIn the study, the Mitsubishi triangular inserts with one edge\nof the polycrystalline diamond PCD type of MD220 were\nused. The dimensions of the TNGA 160408 type inserts were\nD\n1=9.525 mm,S1=4.76 mm,Re=0.8 mm, andD2=3.81 mm\n(Fig. 2b). The characteristics and properties of each work\npiece material are described in Table2.\n2.3 Results of the recorded values of the main cutting force\ncomponent Fc and surface roughness parameter Ra\nfor the work piece materials with different contents of Co\n2.3.1 Results of the recorded values of the cutting force Fc\nfor the first (25 wt% Co) and second (15 wt% Co) shafts\nRecorded values of the cutting forceF\nc for the first and second\nshafts with content 25 and 15 wt% Co together with calculated\nvalues of the S/N ratio according to the larger-the-better\n(Appendix 1,E q .22) criterion are shown in Table3.\nBased on the S/N ratio, the cutting data for the lowest\nvalues of the cutting forceFc was indicated. For both mate-\nrials, the lowest values of the cutting forceFc were obtained at\nthe same cutting data:\n& f=0.105 mm/rev\n& vc=10 m/min\n& ap=0.2 mm\nSimultaneously, an increase of the cutting forceFc value\nfor machining of the work piece with a lower content of Co in\nthe material structure was noticed.\n2.3.2 Results of the measured values of the surface roughness\nparameter Ra for the first (25 wt% Co) and second (15 wt%\nCo) shafts\nResults of the measured values of the surface roughness pa-\nrameter Ra for the first and second shafts with content 25 and\n15 wt% Co with the calculated values of the S/N ratio (crite-\nrion larger-the-better) are shown in Table4.F o rt h es u r f a c e\nroughness parameter Ra, there is a similar situation like in the\ncase of the recorded values of the cutting forceF\nc. In the case\nof materials with two different contents of Co, the smallest Ra\nparameter values for the same cutting data were obtained:\n& f=0.105 mm/rev\n& vc=15 m/min\n& ap=0.5 mm\nIt was also revealed that after turning of the shaft with a\nlower content of Co, the larger values of the surface roughness\ndescribed by the Ra parameter were obtained.\nScanning electron micrographs (SEM) of chips, obtained\nduring machining of the first and second shafts for the lowest\nFig. 2 Test stand for recording of\nthe main cutting force:a shaft\nmade of WC-Co (1), insert type of\nTNGA 160408 with PCD edge\n(2), holder (3), and dynamometer\n(4); b dimensions of the TNGA\n160408 insert\nTable 2 Characteristics and properties of the work piece materials\nNumber of tested shaft Chemical composition Quantity Co % Density g/cm 3 Hardness HV10 Hardness HRA\n1st shaft 25 % Co, 0.15 % VC, 74.85 % WC 25 13.1 950 85.4\n2nd shaft 15 % Co, 0.15 % VC, 84.85 % WC 15 14 1200 88.2\n3rd shaft 10 % Co, 90 % WC 10 14.75 1610 91.9\n2244 Int J Adv Manuf Technol (2015) 77:2241–2256\nvalues ofFc and the lowest surface roughness Ra, are present-\ned in Fig.3.\n2.3.3 Results of the recorded values of the cutting force Fc\nand the measured values of the surface roughness Ra\nfor the third shaft with content 10 wt% Co\nRecorded values of the cutting forceFc and measured values\nof the surface roughness parameter Ra for the third shaft with\ncontent 10 wt% Co are shown in Table5.\nThe results for only three research samples of the shaft with\ncontent of 10 wt% Co are presented. For other surfaces, the\nviolent increase of the cutting edge wear of the TNGA 160408\ninserts type for the depth of cut larger than 0.2 mm occurred.\nThese situations are illustrated in Fig.4 which presents the\nchips with irregular shape and large size. The scales in the\nfigures, presented in the form of horizontal lines mean the\nfollowing: 1— 5 mm, 2— 500 μm, and 3— 1000 μm.\n2.4 Analysis of variance ANOV A for the first and second\nshafts with content of 25 and 15 wt% Co\nThe analysis of variance, better known as ANOV A analysis,\nallows to determine the influence of the quality factor level on\nthe measurable characteristics of the research object [24, 26,\n27, 29–31]. In the research, the ANOV A analysis was used to\nindicate the percentage influence of the particular cutting data\non the main cutting forceF\nc values and the surface roughness\ndescribed by the parameter Ra after the sintered carbides\nturning.\nAn explanation of functions, which were used in construc-\ntion of a table for the analysis of variance ANOV A, is pre-\nsented in Appendix2. The numbers of degrees of freedom for\neach source of variability results are presented in Appendix2.\nThe analysis of variance ANOV A of the cutting data per-\ncentage influence on the cutting forceFc for the first shaft with\n25 wt% Co is shown in Table6, while the results for the\nsecond shaft with 15 wt% Co are shown in Table7.\nThe depth of cut has the greatest influence on the cutting\nforce Fc value while turning of the first shaft. The cutting\nspeed vc has a lower influence, and the feedf has a very small\neffect, which is described in Table6.\nIn the case of the second shaft, the depth of cut also has the\ngreatest influence on the cutting forceFc. The feed has less\ninfluence, and the cutting speed has the least influence\n(Table 7). Figure 5a, b shows interactions of the individual\ncutting data on the main cutting forceF\nc for materials with\ncontent 15 and 25 wt% Co. The individual graphs in Fig.5a, b\nshow suitable levels of research factor interaction with the\nvarious levels of the other two factors’influence on the cutting\nforce Fc values. When the value of the cutting speed equals\n10 m/min, with increasing values of the feed, more values of\nthe main cutting forceFc are generated. When the intermedi-\nate cutting speed equals 15 m/min, the opposite situation\noccurs compared to the first cutting-level speed. With an\nincrease in the feed, a decrease of values in the cutting force\nF\nc is observed. At the highest values of the feed, the highest\nvalues of the cutting forceFc are generated.\nThe analysis of variance ANOV A of the percentage influ-\nence on the surface roughness described by the Ra parameter\nfor the first shaft with 25 % Co is shown in Table8, while the\nresults for the second shaft with 15 wt% Co are shown in\nTable 9.\nThe cutting speed has the greatest influence on the surface\nroughness for the first shaft, the effect of the feed and depth of\ncut is very small.\nIn the case of the second shaft, a similar (as for the first\nshaft) effect of the cutting data on the surface roughness\ndescribed by the Ra parameter was noticed. The cutting speed\nhas the least impact. Figure6a, bshows the interaction of the\nappropriate cutting data on the surface roughness parameter\nRa for the materials with content 25 and 15 wt% Co.\nTable 3 Recorded values of the main cutting forceFc for the first and\nsecond shafts with calculated S/N ratio values (criterion larger-the-better)\nSurface\nnumber\nABC Fc (N)\nshaft no. 1\nS/N Fc (N)\nshaft no. 2\nS/N\n1 3334 3 5 . 7 −52.78 414.5 −52.35\n2 1232 7 4 . 9 −48.78 311.1 −49.86\n3 2133 1 8 . 4 −50.06 361.0 −51.15\n4 2222 6 4 . 0 −48.43 284.2 −49.07\n5 3123 7 4 . 6 −51.47 323.9 −50.21\n6 1322 7 8 . 5 −48.90 264.4 −48.45\n7 1111 8 1 . 0 −45.15 196.2 −45.85\n8 2311 9 6 . 0 −45.85 219.3 −46.82\n9 3212 2 2 . 8 −46.96 222.8 −46.96\nThe entries in bold mean the maximum values of S/N ratio (criterion\nlarger-the-better)\nTable 4 Results of the measured values of the surface roughness param-\neter Ra for the first and second shafts with calculated values of the S/N\nratio (criterion larger-the-better)\nSurface\nnumber\nABCR a ( μm)\nshaft no. 1\nS/N Ra ( μm)\nshaft no. 2\nS/N\n1 3332 . 1 0 −6.45 1.90 −5.56\n2 1230 . 6 3 4.04 0.92 0.71\n3 2 1 3 0.93 0.63 1.22 −1.70\n4 2221 . 2 4 −1.84 1.21 −1.66\n5 3121 . 9 9 −5.98 1.99 −5.96\n6 1321 . 1 8 −1.45 1.00 −0.004\n7 1111 . 2 6 −2.01 1.08 −0.73\n8 2311 . 5 5 −3.80 1.66 −4.40\n9 3212 . 0 1 −6.06 2.67 −8.53\nThe entries in bold mean the maximum values of S/N ratio (criterion\nlarger-the-better)\nInt J Adv Manuf Technol (2015) 77:2241–2256 2245\n3A n a l y s i so fr e s u l t s\n3.1 Analysis of the measured values of the cutting forceFc\nThe main effects of the cutting data on values of the cutting\nforce Fc for the second shaft with content 15 wt% Co are\nshown in Fig.7a and for the first shaft with content 25 wt% Co\nare shown in Fig.7b.\nFor the first and second shafts, there are similar character-\nistics of the cutting data influence on the average values of the\ncutting forceFc for appropriate levels of the cutting data. The\ncutting forceFc also increases with higher values of feed and\ndepth of cut. The cutting speed has a different trend than feed\nand depth of cut. For the intermediate value of the cutting\nspeed (15 m/min), the lowest value of the cutting forceF\nc was\nrecorded.\nDuring the analysis of the Co content influence on the\nvalue of the cutting forceFc, the following relationship was\nobserved: the lower content of Co in the material structure, the\ngreater value of the cutting forceFc for the same cutting data,\nbut only for surfaces 1, 5, and 6, as shown in Fig.8.\n3.2 Analysis of the measured values of the surface roughness\nparameter Ra\nThe main effects of the cutting data on values of the surface\nroughness parameter Ra for the second shaft with content\n15 wt% Co are shown in Fig.9a and for the first shaft with\ncontent 25 wt% Co are shown in Fig.9b.\nIn the case of the average influence of the particular cutting\ndata on the measured values of the surface roughness de-\nscribed by the Ra parameter, other characteristics than the\nresults for the main components of the cutting forceF\nc are\nnoticed. On the basis of the charts in Fig.9a, b, a trend\nshowing that the increased value of the feed followed by\ndeterioration of the surface roughness by increasing the Ra\nparameter is noticed. For the depth of cut, the opposite situa-\ntion than for the feed is noticed. With the depth of cut, the\nsurface quality improves. Two different characteristics are\nnoticed for the cutting speed. In the case of the second shaft,\nthe smallest value of the surface roughness for the average\nvalue of the cutting speed was obtained, and in the case of the\nfirst shaft, the smallest value of the surface roughness for the\nfirst level of the cutting speed (10 m/min) was obtained. The\nTable 5 Recorded values of the cutting forceFc and surface roughness\nRa for the third shaft\nSurface number f (mm/rev) vc (m/min) ap (mm) Fc (N) Ra (μm)\n1 0.105 10 0.2 178.8 1.39\n2 0.153 20 0.2 194.5 1.90\n3 0.211 15 0.2 204.1 1.39\na) b)\nc) d)\nFig. 3 SEM views of chips,\nobtained during machining of the:\na the first shaft for the lowest\nvalues ofF\nc, b the second shaft\nfor the lowest values ofFc, c the\nfirst shaft for the lowest surface\nroughness Ra, andd the second\nshaft for the lowest surface\nroughness Ra\n2246 Int J Adv Manuf Technol (2015) 77:2241–2256\neffects of the Co content in the material structure on the values\nof the surface roughness for the same cutting data are very\ndifferent. For the first, fourth, sixth, and seventh surfaces with\na lower content of Co, better quality surfaces were achieved\n(Fig. 10).\n3.3 Analysis of the influence of the Co content in the work\npiece material on the obtained values of the cutting forceF\nc\nand surface roughness\nFor the comparison of the effects of the Co content in\nthe material structure on the cutting force Fc and the\nvalues of the surfaces roughness, only three surfaces\nfor the particular shafts for the same cutting data were\nused (Fig. 11a, b). The cutting force Fc for the other\nresearch samples for the third material has not been\nrecorded, due to extremely severe wear of the tools, as\ndescribed earlier in Section 2.3.3.\nIt was noticed that for the low Co content (10 wt%), the\nlower values of the cutting forceFc were generated and the\nworse quality of the surface was observed. The smaller values\nof the cutting forceF\nc for the third shaft for the same cutting\ndata can be a result of the smaller adhesion effect between the\nwork piece and cutting tool. The large values of the surface\nroughness for the third shaft are a result of high hardness of the\nwork piece materials.\na) b)\nc) d)\nFig. 4 Views of chips obtained\nfor the third shaft:a f=0.211 mm/\nrev, vc=20 m/min,ap=0.5 mm;\nneedle chips or irregular short\ndiscontinuous chips;b f=\n0.105 mm/rev,vc=15 m/min,ap=\n0.5 mm; needle chips, amorphous\nshort discontinuous chips, loose\narc chips, and elemental chips;c\nf=0.153 mm/rev,vc=15 m/min,\nap=0.35 mm; needle chips,\namorphous long discontinuous\nchips; andd f=0.211 mm/rev,v\nc=\n10 m/min,ap=0.35 mm;\nelemental chips, loose arc chips,\nand amorphous chips\nTable 6 Analysis of variance (ANOV A) of the cutting data percentage\ninfluence on the cutting forceFc for the first shaft\nParameter Degrees of\nfreedom\nSS MS FP % α\nvc 2 17332.78 8666.4 27.66 30.38 0.01\nf 2 3989.07 1994.5 6.37 6.11 0.01\nap 2 33035.71 16517.9 52.73 58.94 0.01\nError 2 626.56 313.3 4.55\nTotal 8 54984.12 100\nTable 7 Analysis of variance (ANOV A) of the cutting data percentage\ninfluence on the cutting forceFc for the second shaft\nParameter Degrees of\nfreedom\nSS MS FP % α\nvc 2 1188.7 594.3 2.77 1.84 0.01\nf 2 5992.2 2996.1 13.95 13.52 0.01\nap 2 33527.3 16763.7 78.08 80.45 0.01\nError 2 429.4 214.7 4.17\nTotal 8 41137.6 100\nInt J Adv Manuf Technol (2015) 77:2241–2256 2247\n4 Empirical models, describing WC-Co turning process\nwith PCD tools\n4.1 First type of experimental model based on the power\nfunction\nThe measured values of the cutting forceFc shown in Table3\nand the measured values of the surface roughness described\nby the Ra parameter shown in Table4 for the sintered carbides\nturning with PCD tools usage can be used for the equations’\ndetermination, which allow the description of the turning\nprocess. Two methods of the empirical model of WC-Co\nturning process are shown in the paper. The first type of the\nempirical model for the first shaft is based on the power\nfunction, model type I [30, 31, 33].\nAny of investigated phenomena can be described by the\nfollowing equation:\nY ¼ a\n1 /C2 xa2\n1 /C2 xa2\n2 /C2 ⋯ /C2 xai\ni ð1Þ\nwhere Y is a parameter value, describing the investigated\nphysical phenomenon, i.e., the cutting forceFc; a1, a2, … , ai\nFig. 5 Interaction of appropriate\nlevels of the cutting data on the\ncutting forceF\nc for a the first shaft\nwith content 25 wt% Co andb the\nsecond shaft with content 15 wt%\nCo\nTable 8 Analysis of variance (ANOV A) of the cutting data percentage\ninfluence on the surface roughness Ra for the first shaft\nParameter Degrees of freedom SS MS FP % α\nvc 2 1 . 6 90 . 8 53 6 . 5 47 7 . 4 10 . 0 5\nf 2 0.16 0.08 3.39 5.34 0.05\nap 2 0.23 0.11 4.97 8.64 0.05\nError 2 0.05 0.02 8.59\nTotal 8 2.13 100\nTable 9 Analysis of variance (ANOV A) of the cutting data percentage\ninfluence on the surface roughness Ra for the second shaft\nParameter Degrees of freedom SS MS FP % α\nvc 2 2 . 2 01 . 1 02 7 . 5 87 8 . 3 90 . 0 1\nf 2 0.04 0.02 0.55 4.55 0.01\nap 2 0.38 0.19 4.78 11.15 0.01\nError 2 0.08 0.04 5.89\nTotal 8 2.70 100\nFig. 6 Interaction of appropriate\nlevels of the cutting data on the\nsurface roughness parameter Ra\nfor a the first shaft andb the\nsecond shaft\nFig. 7 Main effects of the cutting\ndata on the cutting forceFc for a\nthe second shaft andb the first\nshaft\n2248 Int J Adv Manuf Technol (2015) 77:2241–2256\nare constant coefficients; andx1, x2, … , xi are factors, which\ninfluence the investigated parameter.\nThe cutting forceFc can be expressed by Eq. (2):\nFc ¼ a /C2 f b /C2 vc\nc /C2 ap\nd ð2Þ\nwhere a, b, c,a n dd are constants; andvc, f,a n dap are\nindependent variables representing suitable cutting data based\non Eq. (1).\nEquation (2), which describes (in symbolic) estimated val-\nue of the forceFc, can be linearized by finding the logarithm\n(3):\nLog FcðÞ ¼ Log aðÞ þ bLog fðÞ þ cLog vcðÞ þ dLog ap\n/C0/C1\nð3Þ\nTo facilitate the equation notation (3), a new equation was\nwritten (4):\nLog FcðÞ ¼ Y ;L o gaðÞ ¼ A0; b ¼ A1;L o gfðÞ ¼ X 1; c\n¼ A2;L o gvcðÞ ¼ X 2; d ¼ A3;L o gap\n/C0/C1\n¼ X 3 ð4Þ\nUsing the above new variables, the Eq. (3)t a k e st h e\nform (5):\nY ¼ A0 þ A1X 1 þ A2X 2 þ A3X 3 ð5Þ\nThe values ofX1, X2,a n dX3 are assumed (independent\nfactors, values of cutting data), and theY value is measured,\ni.e., value of the cutting forceFc (the parameter depends onXi\nvalues and values of constant factors).\nEquation (5) can represent a mathematical notation of the\nmachining process or any other physical phenomenon.\nEquation (5) can be used to investigate the influence of\nindividual variables on the output investigated phenomenon.\nIn the case of this work, the cutting forceF\nc or surface\nroughness Ra are these values.\nEquation (5) with the appropriate values of the cutting\nforce Fc and cutting data (vc, f, ap) was put into the Wolfram\nMathematica 7 environment (system of equations with four\nunknowns). After calculations, the constant coefficientsa, b,\nc,a n dd were obtained.\nThe final equations describing the cutting force and surface\nroughness for variable cutting data for the first shaft with\ncontent of 25 wt% Co, taking into account the set of the\ncalculated coefficients (a, b, c, d), have the forms (6, 7):\nF\nc ¼ 190:499 /C2 v0:563408\nc /C2 f 0:217297 /C2 a0:753408\np ð6Þ\nRa ¼ 0:0512948 /C2 v1:47836\nc /C2 f 0:55769 /C2 a−0:217913\np ð7Þ\nFig. 8 Comparison of the Co content influence on the main cutting force\nfor the first and second shafts\nFig. 9 Main effects of the cutting\ndata on the surface roughness\nparameter Ra fora the second\nshaft andb the first shaft\nFig. 10 Comparison of the Co content influence on the surface rough-\nness parameter Ra for the first and second hafts\nInt J Adv Manuf Technol (2015) 77:2241–2256 2249\nFor the second shaft, Eq. (8) describes the cutting forceFc\nand Eq. (9) the surface roughness Ra.\nFc ¼ 215:888 /C2 v0:398651\nc /C2 f 0:0336374 /C2 a0:706277\np ð8Þ\nRa ¼ 3:455868 /C2 v0:182942\nc /C2 f 0:946694 /C2 a−0:44174\np ð9Þ\nEquation (10) describes the first mathematical model of\nWC-Co turning taking into account the Co content in the\nmaterial structure. In the case of the constant coefficient\ndetermination for equations, the same algorithm as in the case\nof the previous equations was used. The difference occurs in\nthe input equation.\nF\nc ¼ a /C2 f b /C2 vc\nc /C2 ap\nd /C2 Coe ð10Þ\nAfter determination of the constant coefficientsa, b, c, d,\nand e, the following equations were obtained. Equation (11)\ndescribes the cutting forceFc:\nFc ¼ 1381:66 /C2 v0:190208\nc /C2 f −0:48079 /C2 a0:882778\np /C2 Co0:379094\nð11Þ\nEquation (12) describes the surface roughness Ra:\nRa ¼ 4:26695 /C2 v1:60466\nc /C2 f 0:290834 /C2 a−0:41552\np /C2 Co0:19511\nð12Þ\nA comparison of the cutting forceFc and roughness Ra\nvalues obtained from the mathematical Eqs. (6–9)a n d(11–12)\nwith values got from the measurements for the assumed\ncutting data is shown in Tables10, 11,a n d12 and Figs.12,\n13,a n d14.\nFig. 11 Influence of Co content ona cutting forceFc, b surface rough-\nness Ra (1) f=0.105 mm/rev; vc =10 m/min; ap =0.2 mm; (2) f=\n0.153 mm/rev; vc=20 m/min; ap=0.2 mm; (3) f=0.211 mm/rev; vc=\n15 m/min;ap=0.2 mm\nTable 10 Comparison of the cutting forceFc [N] values for the first type\nof the experimental model, obtained from Eqs. (6)a n d(8) and measure-\nments for the same cutting data for the first and second shafts\nNo. First shaft Second shaft\nFc_exp Fc_calc Fc_exp Fc_calc\n1 435.6 435.9 414.5 414.6\n2 274.9 318.5 311.0 361.0\n3 318.3 275.1 361.0 311.0\n4 264.0 264.3 284.2 284.1\n5 374.5 225.5 323.9 244.4\n6 278.4 286.4 264.4 314.7\n7 180.9 127.1 196.1 160.8\n8 196.0 203.9 219.2 214.6\n9 222.8 185.9 222.7 193.5\nTable 11 Comparison of the surface roughness Ra [μm] values for the\nfirst type of the experimental model, obtained from Eqs. (7)a n d(9)a n d\nmeasurements for the same cutting data for the first and second shafts\nNo. First shaft Second shaft\nRa_ex Ra_calc Ra_exp Ra_calc\n1 2.1 2.09 1.9 1.86\n2 0.6 0.89 0.9 0.91\n3 0.9 0.63 1.2 1.21\n4 1.2 1.24 1.2 1.52\n5 1.9 0.81 2.0 1.92\n6 1.1 1.43 1.0 1.12\n7 1.2 0.62 1.0 1.17\n8 1.6 2.20 1.7 2.07\n9 2.0 1.68 2.7 2.64\nTable 12 Comparison of the cutting forceFc [N] and surface roughness\nRa [μm] values of the first experimental model, obtained from Eqs. (11)\nand (12) and measurements for the same cutting data, taking type of\nmaterial into account\nNo. Fc_exp Fc_calc Ra_exp Ra_calc\n1 435.6 447.2 2.10 2.09\n2 274.9 449.7 0.63 0.627\n3 318.3 587.1 0.93 1.02\n4 264.0 352.6 1.24 1.33\n5 374.5 455.5 1.99 1.986\n6 278.4 285.8 1.18 0.79\n7 180.9 243.4 1.26 0.81\n8 196.0 187.3 1.55 1.83\n9 222.8 228.7 2.01 2.82\n10 414.5 368.5 1.90 1.902\n11 311.0 370.5 0.92 0.57\n12 361.0 483.7 1.22 0.92\n13 284.2 290.5 1.21 1.209\n14 323.9 375.3 1.99 1.80\n15 264.4 235.5 1.00 0.71\n16 196.1 200.5 1.08 0.74\n17 219.2 154.3 1.66 1.67\n18 222.7 188.4 2.67 2.56\n2250 Int J Adv Manuf Technol (2015) 77:2241–2256\nFor the first model, the biggest error of the cutting forceFc\nvalue for the first shaft with contents of 25 wt% Co for the\nsurface “5”equals 39 % relative to the measured value. In the\ncase of the shaft with contents of 15 wt% Co, the biggest error\nequals 24 %.\nThe biggest error of the surface roughness for the first shaft\nequals 59 % relative to the measured value; for the second\nshaft, the biggest error equals 26 % and is similar to theF\nc\ncutting force.\nIn the case of the experimental model taking into account\nthe type of material, the errors do not exceed a value of 30 %\nfor the cutting forceFc and 38 % for the surface roughness Ra.\nEquation (11) should be used for predicting values of the\ncutting forceFc. In the case of the estimating values of the\nroughness Ra, Eqs. (7)a n d(9) for the first model type should\nbe used.\nFigures 15, 16, 17,a n d18 present the examples of dia-\ngrams according to the mathematical equations describing the\nfirst type of experimental model. The cutting forceFc in the\nfunction of the depth of cutap and cutting speedvc for the first\nshaft are shown in Fig.15. Figure 17 presents the surface\nroughness Ra in the function of the depth of cutap and cutting\nspeed vc for the second shaft. The cutting speed increase\ninfluences on the cutting force increase (Fig.16). The same\ntendency is observed for the increase of the depth of cut and\nfeed. The surface roughness decreases when the depth of cut\nincreases and cutting speed decreases.\nThe cutting forceFc in the function of the depth of cutap\nand Co content is presented in Figs. 25, 26,a n d27 in\nAppendix 3. The increase of Co content influences the slight\nincrease of the cutting force.\nThe following notations are used for Figs.16 and 18:\n1( vc=10 m/min, ap=0.35 mm), 2 (10; 0.5), 3 (15; 0.2),\n4 (15; 0.35), 5 (15; 0.5), 6 (20; 0.2), 7 (20; 0.35), and 8\n(20; 0.5).\n4.2 Second type of experimental model based on the modified\nRSM method\nFor the second type of the experimental model, the modified\nresponse surface methodology (RSM) was used. In the stan-\ndard version of RSM, the equation describing the investigated\nphenomenon has the form [33–37]:\ny ¼ β0 þ\nXn\ni¼0βixi þ\nXn\ni¼0βiix2\nii þ\nXn\ni< jβijxixj ð13Þ\nIn our case, the required number ofy values should be 10.\nThere are only nine results of the cutting forceFc and surface\nroughness Ra in the case of the Taguchi method usage in the\ninvestigation for the first and second shafts. For that reason,\nFig. 12 Differences between experimental and calculation values\nFig. 13 Differences between experimental and calculation values\nFig. 14 Differences between experimental and calculation values\nFig. 15 Cutting forceFc in the function of depth of cutap and cutting\nspeed vc for feedf=0.153 mm/rev for the first shaft\nInt J Adv Manuf Technol (2015) 77:2241–2256 2251\nEq. (13) is modified to omit the impact of correlations be-\ntween cutting speed and feed for the cutting forceFc.I nt h e\ncase of roughness Ra, the correlation between feed and depth\nof cut was omitted. Omission of these correlation results from\nanalysis of the variance ANOV A, because the influence of\nthose parameters are very small relative to the rest of the\ncorrelations between two parameters. In the case of the cutting\nforce F\nc, the depth of cut has the greatest impact, and there-\nfore, only correlation between this parameter with others was\nincluded. In the case of the surface roughness Ra, the greatest\nimpact has the cutting speed, and therefore, the correlation of\nthe cutting speed with two other was taken into account.\nThe steps of the experimental model construction, describ-\ning the predicted cutting forceF\nc values for the first shaft\nbased on the modified RSM equations (Fig.1), are presented\nas follows. Basing on Eq. (13) and values from Tables3 and 4,\nthe following equation can be written (14):\nFc ¼ β0 þ β1vc þ β2 f þ β3ap þ β4v2\nc þ β5 f 2 þ β6a2\np\nþ β7apvc þ β8ap f ð14Þ\nwhere Fc is the estimated value of the cutting force andβ0\n… β8 are the constant coefficients\nSubstituting the above equation into the Mathematica soft-\nware, the values of theβ coefficients were calculated (Eq.15).\nFc ¼ 371:768 þ 169:628vc−22323:9f þ 1267:03ap\n−3:75619v2\nc þ 54485:8f 2−1521:41a2\np\nþ17273:3apvc−161:708ap f\nð15Þ\nIn the case of the equation, describing the surface rough-\nness Ra, the input equation has a different form than equation\ndescribing the forceFc. The other correlations between the\ncutting data are selected to the equations, based on the results,\nobtained by the ANOV A analysis. The input equation is as\nfollows (16):\nRa ¼ β0 þ β1vc þ β2 f þ β3ap þ β4v2\nc þ β5 f 2 þ β6a2\np\nþ β7vc f þ β8vcap ð16Þ\nwhere Ra is the estimated value of roughness andβ0… β8\nare the constant coefficients,\nFig. 16 Cutting forceFc in the function of feedf for different values of\nthe other cutting data (vc; ap) for the first shaft\nFig. 17 Surface roughness Ra in the function of depth of cutap and\ncutting speedvc for feedf=0.153 mm/rev for the second shaft\nFig. 18 Surface roughness Ra in the function of feedf for different values\nof the other cutting data (vc; ap) for the second shaft\nFig. 19 Differences between experimental and calculation values of the\ncutting force Fc for the second type of the model, obtained from the\nEqs. (15) and (18) and measurements for the same cutting data for the first\nand second shafts\n2252 Int J Adv Manuf Technol (2015) 77:2241–2256\nAfter calculation of the equations ’ system in the\nMathematica software, the following values of theβ coeffi-\ncients were substituted in Eq.17.\nRa ¼ 1:89338−0:26644vc þ 44:5025f −16:0481ap\nþ0:008333v2\nc −63:2094f 2 þ 9:25926a2\np−vc f\nþ0:555556vcap\nð17Þ\nFor the second shaft, theFc and Ra can be calculated from\nEqs. (18)a n d(19).\nFc ¼ 155:08 þ 18:3674vc−2538:71f þ 323:226ap\n−0:32753v2\nc þ 5453:38f 2−150:37a2\np þ 4033:33apvc\n−23:3556ap f\nð18Þ\nRa ¼ 10:8535 þ 0:033933vc−317:495f þ 82:9622ap\n−0:005v2\nc þ 736:36f 2−67:6a2\np−6:4vc f −2:50133vcap\nð19Þ\nFigures 19 and 20 present the comparison of the cutting\nforce Fc and surface roughness Ra values for the second type\nof the experimental model, obtained from Eqs. (15, 17–19)\nand measurements for the same cutting data for the first and\nsecond shafts.\nThe errors between calculated and measured values for the\nsecond experimental model do not exceed 1 %.\nFigures 21, 22, 23,a n d24 present the examples of dia-\ngrams according to the mathematical equations describing the\nsecond type of the experimental model. The cutting forceFc in\nthe function of the depth of cutap and cutting speedvc for the\nsecond shaft are shown in Figs.21 and 22. Figure23 presents\nthe surface roughness Ra in the function of the depth of cutap\nFig. 20 Differences between experimental and calculation values of the\nsurface roughness Ra for the second type of the model, obtained from the\nEqs. (17) and (19) and measurements for the same cutting data for the first\nand second shafts\nFig. 21 Cutting forceFc in the function of depth of cutap and cutting\nspeed vc for feedf=0.153 mm/rev for the second shaft\nFig. 22 Cutting forceFc in the function of feedf for the different values\nof the other cutting data (vc; ap) for the second shaft\nFig. 23 Surface roughness Ra in the function of depth of cutap and\ncutting speedvc for feedf=0.153 mm/rev for the first shaft\nFig. 24 Surface roughness Ra in the function of feedf for the different\nvalues of the other cutting data (vc; ap) for the first shaft\nInt J Adv Manuf Technol (2015) 77:2241–2256 2253\nand cutting speed vc for the first shaft. The cutting speed\nincrease influences the cutting force increase. The same ten-\ndency is observed for the increase of the depth of cut and feed.\nSurface roughness decreases when depth of cut and cutting\nspeed increase.\nThe following notations are used for Figs.22 and 24:1\n(10 m/min; 0.2 mm), 2 (10 m/min; 0.35 mm) 3 (10 m/min;\n0.5 mm) 4 (15 m/min; 0.2 mm), 5 (15 m/min; 0.35 mm) 6\n(15 m/min; 0.5 mm), 7 (20 m/min; 0.2 mm), 8 (20 m/min;\n0.35 mm), and 9 (20 m/min; 0.5 mm)\n5 Conclusion\nIn present research, the analysis of super hard material ma-\nchining such as sintered carbides WC-Co with different Co\ncontent in the material structure is shown. In studies, the main\nattention has been focused on the main cutting force compo-\nnent F\nc and the surface roughness parameter Ra values, de-\npending on the cutting data (vc, f, ap)( F i g s .25, 26,a n d27 in\nAppendix 3).\nIn the comparison of WC-Co with two different Co con-\ntents (15 and 25 wt%), in terms of the cutting forceFc,t h e r e\nwas no clear effect of Co content on the turning process. The\nlowest Fc values were obtained for the same cutting data.\nWhen machining material with less content of Co, higherFc\nvalues for the same cutting data were generated. A similar\nrelationship was noticed in the case of the cutting data for\nwhich the lowest surface roughness Ra values were obtained.\nHigher surface roughness values were measured for the ma-\nterial with lower Co content in its structure\nThe ANOV A analysis showed the biggest percentage in-\nfluence of the depth of cut and cutting speed on theF\nc and Ra\nparameters. In the case of cutting force, the depth of cut has\nthe percentage effect equals 59 and 80 % for 25 wt% Co and\n15 wt% Co, respectively. In the case of surface roughness, the\ncutting speed has the percentage effect equals 77.5 and 78 %\nfor 25 wt% Co and 15 wt% Co, respectively.\nDuring turning of the sintered carbides with 10 wt% Co,\nthe required range of the depth of cut was exceeded. The big\nsizes of chips were obtained as a result of chipping process.\nThe increase of the feed and depth of cut values influences\nthe increase of the cutting force. The lowest values of the force\nFig. 25 The function of depth of\ncut ap and Co content for feedf=\n0.153 mm/rev and cutting speed\nvc=15 m/min fora the cutting\nforce Fc and b the surface\nroughness Ra\nFig. 26 The function of feedf for\nthe different values of the other\ncutting data (vc; ap) and two types\nof material fora the cutting force\nFc and b the surface roughness Ra\nFig. 27 The function of cutting\nspeed vc for the different values of\nthe other cutting data (f; ap)a n d\ntwo types of material fora the\ncutting forceFc and b the surface\nroughness Ra\n2254 Int J Adv Manuf Technol (2015) 77:2241–2256\nFc were obtained for the material with the lowest content of Co\nin the structure. The other situation takes place in the case of the\nsurface roughness. The worst surface quality was obtained for\nthe bigger feed values and lower depth of cut and for material\nwith the lowest content of Co. It is probably a result of adhesion\nphenomenon between the work piece material and the tool,\nbigger at high content of Co and high hardness of the material.\nTwo different methods for the design of experimental\nmodels are shown in this paper. The first model is based on\nthe power function; the second is based on the polynomial\nfunction according to modified RSM equations. The obtained\nequations allow the prediction of approximate values ofF\nc or\nRa for a given type of sintered carbides and cutting data.\nFurther studies will focus on tool wear research during ma-\nchining, to determine a wear coefficient and its influence on\nthe cutting forceF\nc and surface roughness Ra values.\nAppendix 1\nUsage types of the S/N ratio (signal to noise) [24–31]:\n1. Smaller-the-better, minimize certain undesirable charac-\nteristics of the research product:\nS=N ¼ −10log10 1=nðÞ /C2\nX\ny2\ni\n/C0/C1hi\nð20Þ\nfor i=1 ton,w h e r en is the number of measurements,\nand yi is theith observed value of the response.\n2. Nominal-the-best, the fixed value of the signal (the vari-\nability around this value can be regarded as the result of\nthe noise):\nS=N ¼ −10log10 Average2=Variance\n/C0/C1\nð21Þ\nfor i=1 ton.\n3. Larger-the-better, the efficiency of the product:\nS=N ¼ −10log10 1=nðÞ /C2\nX\n1=y2\ni\n/C0/C1hi\nð22Þ\nfor i=1 ton.\nAppendix 2\nDegree of factor freedom\n(df)A=KA−1, whereKA is a number of levels\nThe total degree of the results freedom\n(df)T=N−1, whereN is a number of experiments\nThe degree of freedom for error variance\n(df)e=(df)T−∑(df)factor,w h e r e∑(df)factor is a sum of degree of\nfactors freedom\nSum of square for factorA at levelK\nSSA ¼ ∑kA\ni¼1nAi Ai−T\n/C0/C1 2\n¼ ∑\ni¼1\nkA\nA2\ni\nnAi\n/C16/C17\"#\n−T2\nN ,w h e r eN is a total\nnumber of experiences,nAi is the number of levels, andAi is\nthe sum of cutting forces or surface roughness in leveli of\nfactor A\nThe sum of squares of error\nSSe ¼\nXkA\nj¼1\nXnAj\ni¼1 yi−A¯j\n/C16/C17 2\nor SSe ¼ SST −\nX\nSSfactor\nα— level of significance represents the probability of the\nnull hypothesisH0 rejection. It is likely that the statistics will\nhave at least the same value that observed one, assuming that\nH0 is true [24, 26, 27, 29–31].\nAppendix 3\nThe following notations are used for Fig.26:1( vc=10mm/\nmin; ap=0.2 mm; wt% Co 25), 2 (10; 0.35; 25), 3 (10; 0.5;\n25), 4. (15; 0.2; 15), 5 (15; 0.35; 15), 6 (15; 0.5; 15), 7 (20; 0.2;\n25), 8 (20; 0.35; 15), and 9 (20; 0.5; 25).\nThe following notations are used for Fig.27:1( f=0.105 mm/\nrev;ap=0.2 mm; wt% Co 25), 2 (0.105; 0.35; 25), 3 (0.105; 0.5;\n25), 4 (0.153; 0.2; 15), 5 (0.153; 0.35; 15), 6 (0.153; 0.5; 15), 7\n(0.211; 0.2; 25), 8 (0.211; 0.35; 15), and 9 (0.211;0.5;25).\nOpen AccessThis article is distributed under the terms of the Creative\nCommons Attribution License which permits any use, distribution, and\nreproduction in any medium, provided the original author(s) and the\nsource are credited.\nReferences\n1. Fratila D (2013) Sustainable manufacturing through\nenvironmentally-friendly machining. In: Davim JP (ed) Green\nmanufacturing process and systems materials forming, machining\nand tribology. Springer, Berlin Heidelberg, pp 1–21\nInt J Adv Manuf Technol (2015) 77:2241–2256 2255\n2. de Lacalle LN L, Lamikiz A, de Larrinova FJ, Azkona I (2011)\nAdvanced cutting tools. In: Davim J (ed) Machining of hard mate-\nrials. Springer, London, pp 33–85\n3. Newman ST, Nassehi A, Imani-Asrai R, Dhokia V (2012) Energy\nefficient process planning for CNC machining. CIRP J Manuf Sci\nTechnol 5:127–136. doi:10.1016/j.cirpj.2012.03.007\n4. Krajnik P, Kopac J (2004) Modern machining of die and mold tools. J\nMater Process Technol 157–157:543–552. doi:10.1016/j.jmatprotec.\n2004.07.146\n5. Dobrza ński LA (2002) Podstawy nauki o materia łach i\nmetaloznawstwo. Materia łyi n żynierskie z podstawami\nprojektowania materiałowego. WNT, Warszawa\n6. Zak Fang Z, Wang X, Ryu T, Hwang KS, Sohn HY (2009) Synthesis,\nsintering, and mechanical properties of nanocrystalline cemented\ntungsten carbide— a review. Int J Refract Met Hard 27:288–299.\ndoi:10.1016/j.ijrmhm.2008.07.011\n7. Khechba M, Hanini F, Halimi R (2011) Study of structural and\nmechanical properties of tungsten carbides coatings. Nat Technol 5:\n9–11\n8. Jaworska L (2007) Diament, otrzymywanie i zastosowanie w\nobróbce skrawaniem. WNT, Warszawa\n9. Arsecularatne JA, Zhang LC, Montross C (2006) Wear and tool life\nof tungsten carbide, PCBN and PCD cutting tools. Int J Mach Tools\nManuf 46:482–491. doi:10.1016/j.ijmachtools.2005.07.015\n10. Byrne G, Dornfeld D, Denkena B (2003) Advancing cutting technol-\nogy. CIRP Ann Manuf Technol 52:483–507\n11. Cook MW, Bosson PK (2000) Trends and recent developments in the\nmaterial manufacture and cutting tool application of polycrystalline\ndiamond and polycrystalline cubic boron nitride. Int J Refract Met\nHard 18:147–152\n12. Jackson MJ, Ahmed W (2009) Machining of brittle materials using\nnanostructured diamond tools. In: Jackson MJ, Morrell JS (eds)\nMachining with nanomaterials. Springer, US, pp 1–30\n13. Bogus A, Gebeshuber IC, Pauschitz A, Roy M, Haubner R (2008)\nMicro-and nanomechanical properties of diamond film with various\nsurface morphologies. Diam Relat Mater 17:1998–2004. doi:10.\n1016/j.diamond.2008.06.010\n14. Mitura S, Mitura K, Niedzielski P, Luda P, Danilenko V (2006)\nNanocrystalline diamond, its synthesies, properties and applications.\nJ Achiev Mater Manuf Eng 16:9–16\n15. Belmonte B, Ferro P, Fernandes AJS, Costa FM, Sacramento J, Silva\nRF (2003) Wear resistant CVD diamond tools for turning for sintered\nhardmetals. Diam Relat Mater 12:738–743\n16. Belmonte M, Oliveira FJ, Sacramento J, Fernandes AJS, Silva RF\n(2004) Cutting forces evolution with tool wear in sintered hardmetal\nturning with CVD diamond. Diam Relat Mater 13:843–847. doi:10.\n1016/j.diamond.2003.11.018\n17. Almeida FA, Oliveira FJ, Sousa M, Frenandes AJS, Sacrameto\nJ, Silva RF (2005) Machining hardmetal with CVD diamond\ndirect coated ceramic tools: effect of tool edge geometry.\nDiam Relat Mater 14:651 –656. doi: 10.1016/j.diamond.2004.\n09.002\n18. Sung-jung H (2004) Micro cutting of tungsten carbides with sem\ndirect observation method. Int J KSME 18–5:770–\n779\n19. Almeida FA, Fernandes AJS, Silva RF, Oliveira FJ (2006) Re-\nsharpenable thick CVD diamond-coated Si3N4 tools for hardmetal\nturning. Surf Coat Technol 201:1776–1782. doi:10.1016/j.surfcoat.\n2006.03.005\n20. Sung Jung H (2008) Environmentally conscious hard turning of\ncemented carbide materials on the basis of micro-cutting in SEM:\nstressing four kinds of cemented carbides with PCD tools. J Mech Sci\nTechnol 22:1383–1390. doi:10.1007/s12206-008-0411-z\n21. Sung Jung H (2009) Environmentally conscious hard turning\nof cemented carbide materials on the basis of micro-cutting in\nSEM (2nd report): stress turning with three kinds of cutting\ntools. J Mech Sci Technol 23:1959–1966. doi:10.1007/s12206-\n009-0512-3\n22. Almeida FA, Fernandes AJS, Oliveira FJ, Silva RF (2009) Semi-\northogonal turning of hardmetal with CVD diamond and PCD inserts\nat different cutting angles. J Vac Sci Technol 83:1218–1223. doi:10.\n1016/j.vacuum.2009.03.029\n23. Zhong ZW, Peng ZF, Liu N (2007) Surface roughness characteriza-\ntion of thermally sprayed and precision machined WC-Co and Alloy-\n625 coatings. Mater Charact 28:997–1005. doi:10.1016/j.matchar.\n2007.05.010\n24. Inform towww.statsoft.com\n25. Xueping Z, Erwei G, Liu CR (2009) Optimization of process\nparameter of residual stresses for hard turned surfaces. J Mater\nProcess Technol 209:4286 –4291. doi: 10.1016/j.jmatprotec.\n2008.10.011\n26. Muthukrishnan N, Davim JP (2009) Optimization of machining\nparameters of Al/SiC-MMC with ANOV A and ANN analysis. J\nMater Process Technol 209:225–232. doi:10.1016/j.jmatprotec.\n2008.01.041\n27. Lazarevic D, Madic M, Jankovic P, Lazarevic A (2011) Surface\nroughness minimization of polyamide PA-6 turning by Taguchi\nmethod. J Prod Eng 15–1:29–32\n28. Krishankant, Taneja J, Bector M, Kumar R (2012) Application of\nTaguchi method of optimizing turning process by the effects of\nmachining parameters. Int J Eng Adv Technol 2–1:263–274\n29. Ramanujam R, Muthukrishnan N, Raju R (2011) Optimization of\ncutting parameters for turning Al-SiC(10p) MMC using ANOV A and\ngrey relation analysis. Int J Precis Eng Manuf 12–4:651–656. doi:10.\n1007/s12541-011-0084-x\n30. Chomsamutr K, Jongprosithporn S (2012) optimization parameters\nof tool life model using the Taguchi approach and response surface\nmethodology. Int J Comput Sci Issues 9–3:120–125\n31. Gopalsamy BM, Mondal B, Ghosh S (2009) Taguchi method and\nANOV A: an approach for process optimization of hard machining\nwhile machining hardened steel. J Sci Ind Res 68:685–695\n32. Catalogue of tools for sintered carbides Mitsubishi company\n33. Shah SC, Geroge PM (2012) Surface roughness modeling in preci-\nsion turning of aluminium by polycrystalline diamond tool using\nresponse surface methodology. Int J Emerge Technol Adv Eng 2–5:\n41–45\n34. Doniavi A, Eskandarzade M, Tahmasebian M (2007) Empirical\nmodeling of surface roughness in turning of 1060 steel using factorial\ndesign methodology. J Appl Sci 7–17:2509–2513\n35. Abhang LB, Hameedullah M (2012) Optimal machining parameters\nfor achieving the desired surface roughness in turning of steel. J Eng\nRes 9-1:37–45\n36. Bajic D, Jozic S, Podrug S (2010) Design of experiment’s application\nin the optimization of milling process. METABK 49–2:123–126\n37. Gowd GH, Reddy MG, Sreenivasulu B (2012) Empirical modeling\nof hard turning process of Inconel using response surface methodol-\nogy. Int J EmergTechnol Adv Eng 2–10:498–504\n2256 Int J Adv Manuf Technol (2015) 77:2241–2256",
  "topic": "Taguchi methods",
  "concepts": [
    {
      "name": "Taguchi methods",
      "score": 0.7799105644226074
    },
    {
      "name": "Surface roughness",
      "score": 0.7167341113090515
    },
    {
      "name": "Materials science",
      "score": 0.6151304841041565
    },
    {
      "name": "Carbide",
      "score": 0.5258563160896301
    },
    {
      "name": "Response surface methodology",
      "score": 0.5256104469299316
    },
    {
      "name": "Metallurgy",
      "score": 0.5109714269638062
    },
    {
      "name": "Diamond turning",
      "score": 0.46872958540916443
    },
    {
      "name": "Machining",
      "score": 0.41719359159469604
    },
    {
      "name": "Design of experiments",
      "score": 0.4127761125564575
    },
    {
      "name": "Mechanical engineering",
      "score": 0.37445467710494995
    },
    {
      "name": "Engineering drawing",
      "score": 0.34450763463974
    },
    {
      "name": "Engineering",
      "score": 0.267398476600647
    },
    {
      "name": "Composite material",
      "score": 0.2584800720214844
    },
    {
      "name": "Mathematics",
      "score": 0.21421071887016296
    },
    {
      "name": "Statistics",
      "score": 0.13294297456741333
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I24881138",
      "name": "Cracow University of Technology",
      "country": "PL"
    }
  ]
}