{
  "title": "Accuracy of estimates of food portion size using food photographs – the importance of using age-appropriate tools",
  "url": "https://openalex.org/W2036753684",
  "year": 2006,
  "authors": [
    {
      "id": "https://openalex.org/A5077792628",
      "name": "Emma Foster",
      "affiliations": [
        "Newcastle University"
      ]
    },
    {
      "id": "https://openalex.org/A5006873735",
      "name": "J. N. S. Matthews",
      "affiliations": [
        "Newcastle University"
      ]
    },
    {
      "id": "https://openalex.org/A5109245385",
      "name": "Michael Nelson",
      "affiliations": [
        "King's College London"
      ]
    },
    {
      "id": "https://openalex.org/A5076804742",
      "name": "Julie M. Harris",
      "affiliations": [
        "University of St Andrews"
      ]
    },
    {
      "id": "https://openalex.org/A5063872643",
      "name": "John C. Mathers",
      "affiliations": [
        "Newcastle University"
      ]
    },
    {
      "id": "https://openalex.org/A5016068379",
      "name": "Ashley Adamson",
      "affiliations": [
        "Newcastle University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2121229433",
    "https://openalex.org/W2008761951",
    "https://openalex.org/W6624815446",
    "https://openalex.org/W6739505957",
    "https://openalex.org/W2018294107",
    "https://openalex.org/W2156795022",
    "https://openalex.org/W1982994223",
    "https://openalex.org/W2053609943",
    "https://openalex.org/W2021503570",
    "https://openalex.org/W2139103444",
    "https://openalex.org/W2315613231",
    "https://openalex.org/W2160178741",
    "https://openalex.org/W2326464212",
    "https://openalex.org/W2044521758",
    "https://openalex.org/W6696931130",
    "https://openalex.org/W2076681324",
    "https://openalex.org/W1518239635",
    "https://openalex.org/W941695738",
    "https://openalex.org/W747557430",
    "https://openalex.org/W2087621913",
    "https://openalex.org/W1487022554",
    "https://openalex.org/W2666006720",
    "https://openalex.org/W572925568",
    "https://openalex.org/W2608568163",
    "https://openalex.org/W2293701530"
  ],
  "abstract": "Abstract Background In order to obtain a measure of nutrient intake, a measure or estimate of the amount of food consumed is required. Weighing foods imposes a large burden on subjects, often resulting in underreporting. Tools are available to assist subjects in providing an estimate of portion size and these include food photographs. The application of these tools in improving portion size estimation by children has not been investigated systematically. Objectives To assess the accuracy with which children are able to estimate food portion sizes using food photographs designed for use with adults, and to determine whether the accuracy of estimates is improved when age-appropriate portion size photographs are provided. Design Original data from three separate studies, on the accuracy of portion size estimates by adults using food photographs, by children using adult photographs and by children using age-appropriate photographs, are analysed and compared. Subjects One hundred and thirty-five adults aged 18 to 90 years and 210 children aged 4 to 11 years. Results Children's estimates of portion sizes using age-appropriate food photographs were significantly more accurate (an underestimate of 1% on average) than estimates using photographs designed for use with adults (an overestimate of 45% on average). Accuracy of children's estimates of portion size using age-appropriate photographs was not significantly different from that of adults. Children overestimated a food's weight by 18% on average and adults underestimated by 5%. Conclusions Providing children with food photographs depicting age-appropriate portion sizes greatly increases the accuracy of portion size estimates compared with estimates using photographs designed for use with adults.",
  "full_text": "Accuracy of estimates of food portion size using food\nphotographs – the importance of using age-appropriate tools\nEmma Foster1,*, John NS Matthews2, Michael Nelson3, Julie M Harris4,\nJohn C Mathers1 and Ashley J Adamson1\n1Human Nutrition Research Centre, University of Newcastle upon Tyne, William Leech Building, Medical School,\nFramlington Place, Newcastle upon Tyne NE2 4HH, UK:2School of Mathematics and Statistics, University of\nNewcastle upon Tyne, Newcastle upon Tyne, UK:3Department of Nutrition and Dietetics, King’s College London,\nLondon, UK:4School of Psychology, University of St Andrews, St Andrews, UK\nSubmitted 14 March 2005: Accepted 31 August 2005\nAbstract\nBackground: In order to obtain a measure of nutrient intake, a measure or estimate of\nthe amount of food consumed is required. Weighing foods imposes a large burden on\nsubjects, often resulting in underreporting. Tools are available to assist subjects in\nproviding an estimate of portion size and these include food photographs. The\napplication of these tools in improving portion size estimation by children has not\nbeen investigated systematically.\nObjectives: To assess the accuracy with which children are able to estimate food\nportion sizes using food photographs designed for use with adults, and to determine\nwhether the accuracy of estimates is improved when age-appropriate portion size\nphotographs are provided.\nDesign: Original data from three separate studies, on the accuracy of portion size\nestimates by adults using food photographs, by children using adult photographs and\nby children using age-appropriate photographs, are analysed and compared.\nSubjects: One hundred and thirty-ﬁve adults aged 18 to 90 years and 210 children aged\n4 to 11 years.\nResults: Children’s estimates of portion sizes using age-appropriate food photographs\nwere signiﬁcantly more accurate (an underestimate of 1% on average) than estimates\nusing photographs designed for use with adults (an overestimate of 45% on average).\nAccuracy of children’s estimates of portion size using age-appropriate photographs\nwas not signiﬁcantly different from that of adults. Children overestimated a food’s\nweight by 18% on average and adults underestimated by 5%.\nConclusions: Providing children with food photographs depicting age-appropriate\nportion sizes greatly increases the accuracy of portion size estimates compared with\nestimates using photographs designed for use with adults.\nKeywords\nPortion size estimation\nFood photographs\nChildren\nAdults\nThere is increasing evidence that the quality of food intake\nduring childhood is important for health in adult life1,2 and\nthat eating habits formed early in life may be retained into\nadulthood\n3,4. The proven link between diet and risk of\ndisease, along with the importance of diet during\nchildhood for heath in adult life, requires that children’s\ndiets be measured accurately. To monitor the diets of\npopulations there is a need for methods which are\naccurate, easy to use and appropriate to the target\npopulation. Estimating the dietary intake of young\nchildren presents unique difﬁculties.\nFor intakes of food to be converted into nutrient intakes,\na measure or estimate of the amount of each food\nconsumed is required. Alternatives to weighed intakes are\ndesirable as the task of weighing foods increases the\nburden placed on the subject, and the more burdensome\nthe method the more likely it will be to result in changes to\ndietary intake and inaccurate reports\n5. Where children are\nthe subjects of dietary investigations, weighing foods\nconsumed outside the home and away from the parents\nposes additional practical problems.\nAs an alternative to weighing all foods, average portion\nsizes across the population may be used. For adults\naverage portion sizes for some foods are available\n6, but no\nequivalent data exist for children. Work towards the\npublication of average portion sizes for children based on\nthe National Diet and Nutrition Survey\n7 has been\ncompleted recently at the University of Dundee8.\nAssuming an average portion size for all subjects\nparticipating in a study may be appropriate in some cases,\nbut many studies require a more precise estimate of the\nportion size consumed by each individual. A number of\nq The Authors 2006*Corresponding author: Email Emma.Foster@ncl.ac.uk\nPublic Health Nutrition: 9(4), 509–514 DOI: 10.1079/PHN2005872\nhttps://doi.org/10.1079/PHN2005872 Published online by Cambridge University Press\nmethods of measuring dietary intake rely on subjects’\nestimates of portion size. Tools are available to assist the\nsubject with doing this such as food photographs, food\nreplicas and food models\n9–1 1. Evidence from work with\nadults suggests that food photographs may improve\nportion size estimation compared with unaided esti-\nmates12, but there has been limited research into the\naccuracy with which children can use portion size\nassessment aids. Frobisher and Maxwell compared\nchildren’s ability to estimate food portion sizes with that\nof adults\n13. The 37 children taking part in the study ranged\nin age from 6 to 16 years (mean age: 12 years 2 months).\nThe subjects were asked to serve themselves with their\nusual portion size of nine food items which were taken\naway and weighed. The subjects were then asked to give a\nverbal description of the portion size of each food (small,\nmedium or large) and were asked to identify the portion\nsize of the food using the photographic atlas of food\nportion size designed for use by adults\n9. The authors\nfound, as might be expected, that there were greater errors\nwith children estimating portion sizes using both\ndescriptions and food photographs compared with\nadults\n13. In addition, there was also a tendency for food\nportion sizes to be overestimated by both adults and\nchildren.\nLivingstone and Robson commented that the assump-\ntion that including an aid to estimating portion size will\nincrease the accuracy of children’s dietary reports has not\nbeen veriﬁed as yet\n14. Food photographs designed and\nvalidated for use with adults have been used quite\nwidely as a visual aid to portion size assessment with\nchildren\n15 – 17despite there being little or no knowledge of\nthe photographs’ validity for use with subjects under 16\nyears of age.\nThe aims of the present project were to assess the\naccuracy with which children are able to estimate food\nportion sizes using food photographs designed for use\nwith adults, to determine whether the accuracy of\nestimates is improved when age-appropriate portion size\nphotographs are provided, and to compare children’s\nability to estimate portion size using the two methods with\nthat of adults.\nMethod\nThe data presented were collected during three separate\nstudies which examined the accuracy of:\n1. Adults’ estimates of food portion sizes using food\nphotographs designed for use with adults\n12 (study Aa).\n2. Children’s estimates of food portion sizes using the\nfood photographs designed for use with adults 18\n(study Ca).\n3. Children’s estimates of food portion sizes using food\nphotographs developed for use with children and\nbased on age-appropriate portion sizes\n19 (study Cc).\nAdult estimates using food photographs (A a).\nFull details of the methods used in this study assessing the\nability of adults to estimate food portion sizes using food\nphotographs are given elsewhere\n12. In brief, 135 adults\n(aged 18–90 years) were invited to serve themselves with\na number of foods in preparation for eating them. The\nfoods (n ¼ 22) were chosen to be foods which were\ncommonly consumed and to represent a range of\nmorphologies. Details of the foods included are given in\nTable 1. The foods were weighed by investigators at the\ntime of serving and any leftovers were also weighed.\nSubjects were interviewed within 5 min of completing\ntheir meal and asked to indicate, using food photographs\n9,\nthe amount of food they had consumed.\nChild estimates using adult photographs (C a)\nFor this study, children (aged 4–11 years) were shown\nplates containing foods of known weights. The foods\n(n ¼ 16) were foods commonly consumed by children\ntaking part in a fruit and vegetable intervention study\n16\nand were chosen to represent a range of morphologies\n(Table 1). The children were asked to estimate the amount\nof food on the plate, using food photographs designed for\nuse with adults\n9. Two test situations were used, with each\nchild completing both test situations; estimates were made\nby the children either with the food in front of them or 24 h\nafter having been shown the food. Half of the children\ncompleted the ‘24-hour recall’ interview ﬁrst and half\ncompleted the ‘food in front’ interview ﬁrst.\nTable 1 Details of the foods included in each study\nAdults with adult\nphotos (Aa)\nChildren with\nadult photos (Ca)\nChildren with\nage-speciﬁc photos (Cc)\nFoods n ¼ 22 Foods n ¼ 16 Foods n ¼ 23\nBaked beans Baked beans Baked beans\nCake Cake Cake\nChips Chips Chips\nCheese (chunks) Cheese (chunks) Cheese (chunks)\nMashed potato Mashed potato Mashed potato\nIce cream Ice cream\nSliced meat Sliced meat (ham)\nButter Margarine\nCornﬂakes Cornﬂakes\nStew Stew\nApple Apple\nBread Bread\nMilk Milk\nOrange squash Orange squash\nSausages Sausages\nTomato ketchup Tomato ketchup\nBoiled potato Banana Biscuit (Rocky)\nBolognese sauce Macaroni cheese Crisps\nBroccoli Rice krispies Custard\nCabbage Golden syrup\nCheese (grated) Mixed vegetables\nPeas Porridge\nQuiche Raisins\nRice Sugar\nRice pudding Tea\nShepherd’s pie\nSpaghetti\nSteak\nE Fosteret al.510\nhttps://doi.org/10.1079/PHN2005872 Published online by Cambridge University Press\nChild estimates using age-speciﬁc food photographs (C c)\nFor this study children were served with foods of known\nweights to consume. Any food left uneaten was weighed.\nThe children were asked to estimate the amount of food\nthey were served and, if appropriate, their leftovers. The\nfoods included in the study ( n ¼ 23) were foods\ncommonly consumed by a national sample of children\n7,\nchosen to represent a range of morphologies (Table 1).\nEstimates were made by children with the food in front of\nthem, just after having eaten the food or 24 h after having\neaten the food. Portion sizes were estimated using food\nphotographs designed for use with children and based on\nchildren’s portion sizes\n7. Four sets of food photographs\nwere produced based on portion sizes appropriate to each\nof four age groups (4- to 6-year-olds, 7- to 10-year-olds,\n11- to 14-year-olds and 15- to 16-year-olds). Seven images\ndepicting weights from the 5th to the 95th centile of weight\nserved were presented for estimation of the amount of\nfood served. We also included seven weights down from\nthe 5th centile to the smallest presentable portion to\nenable us to obtain a measure of the amount of food left\nover. The portion sizes of foods served to the children\nwere either the 25th, 50th or 75th centile of the amount of\nfood consumed for that individual food\n7. The weight of\nfood presented to the child did not exactly match the\nweight depicted in the food photographs and children\nwere instructed that they could indicate that the portion\nsize was in between two photographs if they wished.\nThe designs of each of the studies were slightly different as\nwere the foods included in the studies. A summary of the\nstudies is given in Table 2.\nStatistical analysis\nThe data were analysed in three ways:\n1. Including all data from all studies (all foods and all\ntest types).\n2. Including all test types but only for foods which were\ncommon to all three studies.\n3. Including only foods which were common to all\nthree studies and comparing similar interview\ntypes, e.g.\nFood in front (FIF) – child estimates using adult photos\nversus child estimates using age-appropriate\nphotos;\nJust after eating (JAE) – adult estimates using adult\nphotos versus child estimates using\nage-appropriate photos.\nAnalysis was performed on the ratio of the subject’s\nestimate to the actual weight of the food. A value greater\nthan 1 indicated overreporting and a value less than 1\nindicated underreporting.\nThe accuracy of the portion size estimates was assessed\nby plotting the geometric mean of the ratio of the estimate\nof the amount of food served (or consumed) against the\nactual weight of the food served (or consumed). Error\nbars, depicting the mean ^ 2SD (standard deviations),\ngave an estimate of the precision of the measurement.\nTo compare the relative performance of the adults using\nadult portion size photographs, children using the adult\nphotographs and children using the age-appropriate\nportion size photographs, a univariate analysis of variance\nwith child ID and study as ﬁxed factors was performed.\nResults\nThe age and gender of subjects participating in each of the\nthree studies are given in Table 2. All three studies\nincluded a large number of people for this type of study\n(study A\na, n ¼ 135; study Ca, n ¼ 55; study Cc, n ¼ 155)\nand a proportionate balance of males to females. Table 3\nshows that when all data from all studies were included\n(all foods and all test types) there were signiﬁcant\ndifferences between the three studies in the accuracy of\nestimates of portion size. Adults overestimated portion\nsize by 18% on average. Children overestimated portion\nsize by 46% on average using food photographs designed\nfor use with adults; however, when using age-appropriate\nphotographs the children were on average more accurate\nthan adults in their estimates of portion size, over-\nestimating by 7% (Table 3).\nWhen only the foods which featured in all three studies\nwere included in the analysis, there were signiﬁcant\nTable 2 Summary of details of each study included in the present paper\nStudy\nFood\neaten Estimated Test situations\nNo. of\nsubjects\nAge (years),\nmean (range)\nMales/\nfemales Reference\nAdults with adult\nphotos (Aa)\nYes Amount of food\neaten\nJust after eating 135 42.7 (18–90) 74/61 12\nChildren with adult\nphotos (Ca)\nNo Amount of food\nserved\nFood in front\n24-Hour recall\n55 9.5 (4–11) 25/30 18\nChildren with\nage-speciﬁc\nphotos (C\nc)\nYes Amount of food\nserved and if\nappropriate amount\nleftover\nFood in front\nJust after eating\n24-Hour recall\n155 7.9 (4–11) 78/77 19\nPortion size estimation by children 511\nhttps://doi.org/10.1079/PHN2005872 Published online by Cambridge University Press\ndifferences between the three studies in the accuracy of\nportion size estimates. Adults’ estimates were most\naccurate, with an underestimate of 9% on average.\nChildren using the adult photographs overestimated\nportion sizes by 47% on average, but when provided\nwith age-appropriate photographs this overestimate was\nreduced to 28% (Table 4).\nFigure 1 illustrates the accuracy and precision (as\nindicated by the error bars, which show the mean^ 2SD)\nof estimates of portion size by type of food. With the\nexception of cheese, providing children with\nage-appropriate photographs resulted in more accurate\nestimates of portion size. The adults (in study A\na) served\nthemselves with cheese while the children taking part in\nstudy Ca were shown slices of cheese and for study Cc the\nchildren were given a cheese sandwich in which the\ncheese was hidden from direct observation. The very\ndifferent presentation of the cheese could explain this lack\nof precision. For baked beans ( P ¼ 0.036) and chips\n(P ¼ 0.328) the children provided more accurate estimates\nof portion size using age-appropriate portion size\nphotographs than adults using adult portion size\nphotographs.\nWhen estimates for the same foods and the same\ninterview types only were compared, no signiﬁcant\ndifference was found between adults’ ability to estimate\nportion size just after eating the food and children’s\nability when the children were provided with\nage-appropriate tools (Table 5). Adults underestimated\nportion size by 5% on average whereas children were\nless accurate, overestimating by 18% on average. This\ndifference was not found to be signiﬁcant (P ¼ 0.182).\nThe difference between the children’s ability to estimate\nportion size using adult photographs and estimates\nusing age-appropriate photographs when the food was\nin front of them was signiﬁcantly different (P ¼ 0.001).\nChildren’s estimates using the age-appropriate photo-\ngraphs were more accurate than when using the\nphotographs designed for adults, an underestimate of\n1% on average compared with an overestimate of 45%\nusing the adult photographs, for the same foods and\nunder the same test conditions.\nChildren using the child photographs were only slightly\nless accurate and less precise than adults (study C\nc vs.\nstudy A a) and were signiﬁcantly more accurate than\nchildren using the adult photographs (study Cc vs. study\nCa). With the exception of estimates of the portion size of\ncheese, precision and accuracy of estimates were\ncomparable with those of adults and much better than\nwhen children used the adult photographs.\nDiscussion\nMethods of assessing dietary intake designed for use with\nadults are often used to measure children’s diets on the\nassumption that validity in one population implies validity\nin another. To improve the accuracy of quantitative data\ncollected on children’s diets it is imperative that an\nalternative to weighing foods is found which is appro-\npriate for this age group. Such an alternative method\nshould provide an accurate assessment of the portion size\nof foods consumed but be easy for subjects to use and\ncause minimum disruption of the habitual dietary\nbehaviour of the child. Although alternatives to weighed\nintakes such as food photographs\n9 and household\nmeasures are available, their validity for use with children\nhas not been assessed previously.\nDespite the use of slightly different designs in the\nstudies reported in this paper, a consistent pattern of\nresults emerged. Children using age-appropriate photo-\ngraphs produced estimates of portion size which were\nonly slightly less accurate than those produced by adults\n(using photographs designed for adults) and more\naccurate than when the children were using adult food\nphotographs.\nPrecision of the estimates of portion size by both adults\nand children in these studies was moderate, indicating that\nTable 3 Accuracy of estimates of portion size – including all\nfoods and all test types\n95%\nConﬁdence\ninterval\nStudy No. of estimates Mean ratio* Lower Upper P-value†\nAa 590 1.18 1.120 1.238 ,0.001\nCa 1744 1.46 1.392 1.532\nCc 2855 1.07 1.037 1.105\nAa – Adults’ estimates of food portion sizes using food photographs\ndesigned for use with adults; C a – children’s estimates of food portion\nsizes using the food photographs designed for use with adults; C c – chil-\ndren’s estimates of food portion sizes using food photographs developed\nfor use with children and based on age-speciﬁc portion sizes.\n* A value greater than 1 indicates overreporting and a value less than 1\nunderreporting.\n† P-value indicates the signiﬁcance of the difference between the study\ngroups of the mean ratio of estimated food weight to actual food weight.\nTable 4 Accuracy of estimates of portion size – including only\nfoods common to all three studies and all test types\n95%\nConﬁdence\ninterval\nStudy No. of estimates Mean ratio* Lower Upper P-value†\nAa 108 0.91 0.823 0.996 ,0.001\nCa 545 1.47 1.408 1.533\nCc 418 1.28 1.216 1.340\nAa – Adults’ estimates of food portion sizes using food photographs\ndesigned for use with adults; C a – children’s estimates of food portion\nsizes using the food photographs designed for use with adults; C c – chil-\ndren’s estimates of food portion sizes using food photographs developed\nfor use with children and based on age-speciﬁc portion sizes.\n* A value greater than 1 indicates overreporting and a value less than 1\nunderreporting.\n† P-value indicates the signiﬁcance of the difference between the study\ngroups of the mean ratio of estimated food weight to actual food weight.\nE Fosteret al.512\nhttps://doi.org/10.1079/PHN2005872 Published online by Cambridge University Press\nfood photographs are more suited to use in estimation of\ngroup means. Poor precision even where accuracy is high\nwill result in a good estimate of mean intake but reduced\nability either to rank individuals according to consumption\nor to identify extreme consumers or extreme levels of\nconsumption.\nComparison with previous studies examining subjects’\nability to estimate portion size is hampered by a lack of\nconsistency in the way in which data are presented and the\ndifferent foods included in each study. Children’s\nestimates of mashed potato portions using the\nage-appropriate photographs were poor compared with\nearlier studies conducted in adults (an error of 52%\ncompared with 20.9% to 7.7% reported in three studies\nwith adults\n20 – 22). Compared with previously published\ndata on children’s ability to estimate portion size using\nadult food photographs\n13, children in this study using\nage-appropriate photographs were more accurate in their\nestimates of chips (median error of211% compared with\n79%) and mashed potato (median error of 37% compared\nwith 56%). Estimates of baked beans (median error of\n228.7% compared with 16%) and cheese (median error of\n132% compared with 64%) portions were less accurate\nthan those of children using the adult photographs. The\nlarge error associated with assessing the portion size of\ncheese by the children in this present study can be\nexplained by the fact that the cheese was served as a\nsandwich and therefore not clearly seen by the children.\nData from the largest study of adults’ portion size\nestimation using food photographs were combined with\nthe data on children’s estimates using both adult\nphotographs and age-appropriate photographs to over-\ncome this lack of consistency in presentation of data across\nstudies. This meant that the data could be analysed in the\nsame way. Under the same test conditions and for the\nsame foods, children’s estimates using portion size\nphotographs based on children’s portion sizes were not\nstatistically signiﬁcantly different from those of adults, but\nsigniﬁcantly more accurate than estimates made by\nchildren using the adult photographs. This highlights the\nneed for the portion sizes presented in a photographic\natlas of food to be appropriate to the target population.\nThe three studies reported in this paper tested the\napplication of food photographs in an artiﬁcial situation\nwhere researchers provided and weighed all foods. The\nfood photographs designed for use with children in this\nFig. 1 Accuracy and precision of portion size estimates for individual foods – all interview types. A a – Adults’ estimates of food portion\nsizes using food photographs designed for use with adults; C a – children’s estimates of food portion sizes using the food photographs\ndesigned for use with adults; C c – children’s estimates of food portion sizes using food photographs developed for use with children and\nbased on age-speciﬁc portion sizes. Accuracy is deﬁned as the proximity of the mean estimate of portion size to the actual weight of the\nfood. Precision is deﬁned as the range of estimates around the mean and is presented by error bars which depict the mean ^ 2SD (stan-\ndard deviations). A value greater than 1 indicates overreporting and a value less than 1 underreporting\nTable 5 Accuracy of estimates of portion size – including only\nfoods common to all three studies and estimates made during the\nsame interview type\n95%\nConﬁdence\ninterval\nStudy No. of estimates Mean ratio* Lower Upper P-value†\nAa JAE 76 0.95 0.823 1.106 0.182\nCc JAE 59 1.18 0.936 1.501\nCc FIF 102 0.99 0.849 1.152 0.001\nCa FIF 168 1.45 1.315 1.607\nAa – Adults’ estimates of food portion sizes using food photographs\ndesigned for use with adults; C a – children’s estimates of food portion\nsizes using the food photographs designed for use with adults; C c – chil-\ndren’s estimates of food portion sizes using food photographs developed\nfor use with children and based on age-speciﬁc portion sizes; JAE – sub-\nject was interviewed just after having eaten the food; FIF – subject was\ninterviewed with the food in front of them.\n* A value greater than 1 indicates overreporting and a value less than 1\nunderreporting.\n† P-value indicates the signiﬁcance of the difference between the study\ngroups of the mean ratio of estimated food weight to actual food weight.\nPortion size estimation by children 513\nhttps://doi.org/10.1079/PHN2005872 Published online by Cambridge University Press\nstudy were developed for pilot testing only, and so\ncovered only a limited range of foods. This tool would\nneed to be expanded to cover a wider range of foods\nand then validated against total dietary intakes in a\n‘real-life’ situation before wider application can be\nrecommended.\nThis study has demonstrated that, given age-appropriate\nfood photographs, portion size estimation is a task even\nchildren of primary school age are able to perform with\nacceptable accuracy and precision. We have demonstrated\nthat age-appropriate food photographs have potential for\nimproving the quality of dietary intake data collected from\nchildren.\nAcknowledgements\nThe work to develop the age-appropriate portion size\nassessment tools for use with children was funded by the\nFood Standards Agency (project number N08019). The\nwork on adult estimates of portion size was funded by the\nMinistry of Agriculture, Fisheries and Food.\nThe authors thank the schools, teachers, children and\nparents who took part in this study.\nReferences\n1 Berenson GS, Srinivasan SR, Bao W, Newman WP 3rd, Tracy\nRE, Wattigney WA. Association between multiple cardiovas-\ncular risk factors and atherosclerosis in children and\nyoung adults. New England Journal of Medicine 1998;\n338: 1650–6.\n2 Gaziano JM. When should heart disease prevention begin?\nNew England Journal of Medicine 1998; 338: 1690–2.\n3 Wardle J. Parental inﬂuences on children’s diets.Proceedings\nof the Nutrition Society 1995; 54: 747–58.\n4 Welten DC, Kemper HC, Post GB, Van Staveren WA, Twisk\nJW. Longitudinal development and tracking of calcium and\ndairy intake from teenager to adult. European Journal of\nClinical Nutrition 1997; 51: 612–8.\n5 Macdiarmid JI, Blundell JE. Dietary underreporting: what\npeople say about recording their food intake. European\nJournal of Clinical Nutrition 1997; 51: 199–200.\n6 Crawley H. Food Portion Sizes , 2nd ed. London: HMSO,\n1993.\n7 Gregory J, Lowe S. National Diet and Nutrition Survey:\nYoung People aged 4 to 18 years . London: HMSO, 2000.\n8 Barton KL, Wrieden WL, Longbottom PJ, Adamson AJ,\nOgston SA. How accurate are standard children’s food\nportion sizes for estimation of dietary intakes of children of\ndifferent ages?Proceedings of the Nutrition Society 2003; 62:\n85A.\n9 Nelson M, Atkinson M, Meyer J.A Photographic Atlas of Food\nPortion Sizes. London: MAFF Publications, 1997.\n10 Hackett AF, Rugg-Gunn AJ, Appleton DR, Allinson M,\nEastoe JE. Sugars-eating habits of 405 11- to 14-year-old\nEnglish children. British Journal of Nutrition 1984; 51:\n347–56.\n11 Cameron ME, Van Staveren WA, eds. Manual on Method-\nology for Food Consumption Studies .O x f o r d :O x f o r d\nUniversity Press, 1998.\n12 Nelson M, Atkinson M, Darbyshire S. Food photography II:\nuse of food photographs for estimating portion size and the\nnutrient content of meals.British Journal of Nutrition 1996;\n76: 31–49.\n13 Frobisher C, Maxwell SM. The estimation of food portion\nsizes: a comparison between using descriptions of portion\nsizes and a photographic food atlas by children and adults.\nJournal of Human Nutrition and Dietetics 2003; 16: 181–8.\n14 Livingstone MBE, Robson PJ. Measurement of dietary intake\nin children. Proceedings of the Nutrition Society 2000; 59:\n279–93.\n15 Revill SA, Adamson AJ, Stacy R, Hooper J, Moynihan P. The\neffect of an after school ‘food club’ on intake of foods and\nnutrients by children from deprived social backgrounds.\nProceedings of the Nutrition Society 2001; 60: 189A.\n16 Anderson AS, Porteous LEG, Foster E, Higgins C, Stead M,\nHetherington M,et al. The impact of a school-based nutrition\neducation intervention on dietary intake and cognitive and\nattitudinal variables relating to fruits and vegetables.Public\nHealth Nutrition 2005; 8: 650–6.\n17 Curtis PJ, Adamson AJ, Mathers JC. Associations between\nfruit and vegetable, starch and fat consumption?Proceedings\nof the Nutrition Society 2001; 60: 183A.\n18 Foster E. Assessing dietary intake in primary school children.\nPhD thesis, University of Newcastle upon Tyne, Newcastle\nupon Tyne, UK, 2003.\n19 Foster E, Matthews JNS, Adamson AJ. The development and\nevaluation of portion size assessment tools for use with\nchildren. Proceedings of the Nutrition Society 2006; in press.\n20 Nelson M, Atkinson M, Darbyshire S. Food photography I:\nthe perception of food portion size from photographs.\nBritish Journal of Nutrition 1994; 72: 649–63.\n21 Robinson F, Morritz W, McGuiness P, Hackett AF. A study of\nthe use of a photographic food atlas to estimate served and\nself-served portion sizes.Journal of Human Nutrition and\nDietetics 1997; 10: 117–24.\n22 Robson PJ, Livingstone MB. An evaluation of food\nphotographs as a tool for quantifying food and nutrient\nintakes. Public Health Nutrition 2000; 3: 183–92.\nE Fosteret al.514\nhttps://doi.org/10.1079/PHN2005872 Published online by Cambridge University Press",
  "topic": "Portion size",
  "concepts": [
    {
      "name": "Portion size",
      "score": 0.8955972790718079
    },
    {
      "name": "Estimation",
      "score": 0.4837346374988556
    },
    {
      "name": "Statistics",
      "score": 0.47483664751052856
    },
    {
      "name": "Serving size",
      "score": 0.4673771262168884
    },
    {
      "name": "Sample size determination",
      "score": 0.42229244112968445
    },
    {
      "name": "Food intake",
      "score": 0.41825181245803833
    },
    {
      "name": "Demography",
      "score": 0.3679904043674469
    },
    {
      "name": "Mathematics",
      "score": 0.35077792406082153
    },
    {
      "name": "Medicine",
      "score": 0.33033448457717896
    },
    {
      "name": "Environmental health",
      "score": 0.1825304925441742
    },
    {
      "name": "Biology",
      "score": 0.131454199552536
    },
    {
      "name": "Food science",
      "score": 0.11460182070732117
    },
    {
      "name": "Economics",
      "score": 0.0
    },
    {
      "name": "Sociology",
      "score": 0.0
    },
    {
      "name": "Internal medicine",
      "score": 0.0
    },
    {
      "name": "Management",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I84884186",
      "name": "Newcastle University",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I183935753",
      "name": "King's College London",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I16835326",
      "name": "University of St Andrews",
      "country": "GB"
    }
  ],
  "cited_by": 108
}