{
  "title": "The Neural Correlates of Planning and Executing Actual Tool Use",
  "url": "https://openalex.org/W2046097950",
  "year": 2014,
  "authors": [
    {
      "id": "https://openalex.org/A2156065416",
      "name": "Marie-Luise Brandi",
      "affiliations": [
        "Klinikum rechts der Isar",
        "Bernstein Center for Computational Neuroscience Munich",
        "Institute for Sports Medicine"
      ]
    },
    {
      "id": "https://openalex.org/A4227192875",
      "name": "Afra Wohlschläger",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2108643327",
      "name": "Christian Sorg",
      "affiliations": [
        "Klinikum rechts der Isar",
        "Bernstein Center for Computational Neuroscience Munich"
      ]
    },
    {
      "id": "https://openalex.org/A503512879",
      "name": "Joachim Hermsdörfer",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2052148080",
    "https://openalex.org/W2033940434",
    "https://openalex.org/W2015016650",
    "https://openalex.org/W2059043110",
    "https://openalex.org/W2081057400",
    "https://openalex.org/W2085490083",
    "https://openalex.org/W2103446469",
    "https://openalex.org/W2011131455",
    "https://openalex.org/W2156130986",
    "https://openalex.org/W1964844043",
    "https://openalex.org/W2124777086",
    "https://openalex.org/W1990919624",
    "https://openalex.org/W2112693141",
    "https://openalex.org/W1941146711",
    "https://openalex.org/W2126672489",
    "https://openalex.org/W1972198437",
    "https://openalex.org/W2153156486",
    "https://openalex.org/W2093755846",
    "https://openalex.org/W2039870632",
    "https://openalex.org/W2035745109",
    "https://openalex.org/W1977683258",
    "https://openalex.org/W2164442057",
    "https://openalex.org/W2143333433",
    "https://openalex.org/W2152670257",
    "https://openalex.org/W2095276182",
    "https://openalex.org/W2113589953",
    "https://openalex.org/W1975752615",
    "https://openalex.org/W2113595938",
    "https://openalex.org/W2131833445",
    "https://openalex.org/W2116484132",
    "https://openalex.org/W2040374424",
    "https://openalex.org/W2313293719",
    "https://openalex.org/W2160983382",
    "https://openalex.org/W2136022845",
    "https://openalex.org/W2036224475",
    "https://openalex.org/W2113137424",
    "https://openalex.org/W1989885404",
    "https://openalex.org/W2046510061",
    "https://openalex.org/W2073520225",
    "https://openalex.org/W2018123056",
    "https://openalex.org/W2014748436",
    "https://openalex.org/W2092954611",
    "https://openalex.org/W2131697587",
    "https://openalex.org/W2035561054",
    "https://openalex.org/W2131799757",
    "https://openalex.org/W2067066772",
    "https://openalex.org/W2051156661",
    "https://openalex.org/W2058344427",
    "https://openalex.org/W2086427063",
    "https://openalex.org/W2103676284",
    "https://openalex.org/W2093600078",
    "https://openalex.org/W2025171520",
    "https://openalex.org/W2052404970",
    "https://openalex.org/W2095108774",
    "https://openalex.org/W2040123528",
    "https://openalex.org/W2152138539",
    "https://openalex.org/W2005821483"
  ],
  "abstract": "Human tool use is complex, and underlying neural mechanisms seem to be widely distributed across several brain systems; however, neuroimaging studies of actual tool use are rare because of experimental challenges hindering detailed analysis within one acting subject. We developed a “Tool-Carousel” that enabled us to test actual manipulation of different objects during fMRI and investigate the planning and execution of goal-directed actions. Particularly, we focused on the effects of three factors on object manipulations: the type of object manipulated, the type of manipulation, and the hand to be used. The main focus lay on the question of how complex object use compared with unspecific actions are processed and especially how such representations interact with the knowledge about the object in the action-related dorsal stream. We found that object manipulations with both right and left hand recruit a common network strongly lateralized to the left hemisphere especially during planning but also action execution. Specifically, while activity in the ventral stream was involved in processing semantic information and object properties, a dorso-dorsal pathway (i.e., superior occipital gyrus, superior parietal lobule, and dorsal premotor area) was relevant for monitoring the online control of objects and also a ventro-dorsal pathway (i.e., middle occipital gyrus, inferior parietal lobule, and ventral premotor area) was specifically involved in processing known object manipulations, such as tool use. Data further indicate an interaction of ventral stream areas, such as middle temporal gyrus and lateral occipital complex, with both dorsal pathways. These results provide evidence for left-lateralized occipito-temporo-parieto-frontal network of everyday tool use, which may help to characterize specific deficits in patients suffering from apraxia.",
  "full_text": "Behavioral/Cognitive\nThe Neural Correlates of Planning and Executing Actual Tool\nUse\nMarie-Luise Brandi,1,2,3 Afra Wohlschla¨ger, 1,3 Christian Sorg,1,3 and Joachim Hermsdo¨rfer 2\n1TUM-Neuroimaging Center, Klinikum rechts der Isar, Technische Universita¨t Mu¨nchen, 81675 Munich, Germany,2Department of Sport and Health\nSciences, Institute of Movement Science, Technische Universita¨t Mu¨nchen, 80992 Munich, Germany, and3Graduate School of Systemic Neurosciences,\nLudwig-Maximilians-Universita¨t Mu¨nchen, 82152 Planegg-Martinsried, Germany\nHuman tool use is complex, and underlying neural mechanisms seem to be widely distributed across several brain systems; however,\nneuroimaging studies of actual tool use are rare because of experimental challenges hindering detailed analysis within one acting subject.\nWe developed a “Tool-Carousel” that enabled us to test actual manipulation of different objects during fMRI and investigate the planning\nand execution of goal-directed actions. Particularly, we focused on the effects of three factors on object manipulations: the type of object\nmanipulated, the type of manipulation, and the hand to be used. The main focus lay on the question of how complex object use compared\nwith unspecific actions are processed and especially how such representations interact with the knowledge about the object in the\naction-related dorsal stream. We found that object manipulations with both right and left hand recruit a common network strongly\nlateralized to the left hemisphere especially during planning but also action execution. Specifically, while activity in the ventral stream\nwas involved in processing semantic information and object properties, a dorso-dorsal pathway (i.e., superior occipital gyrus, superior\nparietal lobule, and dorsal premotor area) was relevant for monitoring the online control of objects and also a ventro-dorsal pathway (i.e.,\nmiddle occipital gyrus, inferior parietal lobule, and ventral premotor area) was specifically involved in processing known object manip-\nulations, such as tool use. Data further indicate an interaction of ventral stream areas, such as middle temporal gyrus and lateral occipital\ncomplex, with both dorsal pathways. These results provide evidence for left-lateralized occipito-temporo-parieto-frontal network of\neveryday tool use, which may help to characterize specific deficits in patients suffering from apraxia.\nKey words: action execution; action planning; fMRI; tool use\nIntroduction\nUsing a tool is a natural action we as humans know by heart from\nour everyday life to interact with our environment. Studies have\nfocused on viewing, recognizing (\nBeauchamp et al., 2002 ;\nJohnson-Frey et al., 2003; Vingerhoets, 2008), imagining (Gre`zes\net al., 2003; Boronat et al., 2005; Vingerhoets et al., 2009; Wads-\nworth and Kana, 2011; van Elk et al., 2012), and pantomime tool\nuse (Moll et al., 2000; Johnson-Frey et al., 2005; Hermsdo¨rfer et\nal., 2007; Kro´ liczak and Frey, 2009; Vingerhoets et al., 2011).\nBecause of the variety of tasks, the neural activation patterns vary,\nbut several brain areas show consistency. The middle temporal\ngyrus (MTG) for coding semantic information, the supramar-\nginal gyrus (SMG), the anterior intraparietal area (AIP), and su-\nperior parietal lobule (SPL) for processing tool use knowledge for\ngrasping and manipulating tools plus the ventral and dorsal pre-\nmotor areas (PMv, PMd) for executing motor plans, seem to be\ncore regions for conducting actions with objects and tools (for\nreview, see\nLewis, 2006). To understand the neural principles of\ntool use, we think it is necessary to analyze object manipulation as\nrealistically as possible. A few studies have analyzed actual tool\nuse but did not include visual feedback (\nHermsdo¨rfer et al., 2007)\nor were restricted to only a small selection of tools not reflecting\nthe variety of tools known from daily life with familiar size and\ncorresponding object (\nInoue et al., 2001; Imazu et al., 2007; Va-\nlyear et al., 2012; Gallivan et al., 2013a). Prior knowledge about\nthe manipulated objects (Vingerhoets, 2008), the task (Valyear et\nal., 2012; Gallivan et al., 2013a), and which hand is used to per-\nform the action (Hermsdo¨rfer et al., 2007; Kro´ liczak and Frey,\n2009) seems to influence the mentioned neural network, but how\nexactly the network is affected by these three factors during plan-\nning and executing real actions with objects and especially real\ntools is yet not fully understood.\nTo address this gap, the main goal of this study was to analyze\nthe action network under utmost realistic conditions, by investi-\ngating planning and executing actual object manipulation. Three\nfactors influencing the network recruited for processing goal di-\nrected actions were addressed: the type of object being manipu-\nlated, the type of manipulation performed on the object, and the\nhand used. First, we aimed to define the neural network that is\nmore relevant for planning and executing actions with tools com-\nReceived Feb. 10, 2014; revised Aug. 13, 2014; accepted Aug. 17, 2014.\nAuthor contributions: M.-L.B., A.W., C.S., and J.H. designed research; M.-L.B. and J.H. performed research;\nM.-L.B. and A.W. analyzed data; M.-L.B., A.W., C.S., and J.H. wrote the paper.\nThis work was supported by the German Research Foundation (DFG: WO 1517/1 and HE 3592/7) and the Euro-\npean Union STREP Project CogWatch (FP7-ICT-288912).\nThe authors declare no competing financial interests.\nCorrespondence should be addressed to Marie-Luise Brandi, Technische Universita¨t Mu¨nchen, Department of\nSports and Health Sciences, Institute of Movement Science, Georg-Brauchle-Ring 60/62, 80992 Munich, Germany.\nE-mail: Luise.Brandi@tum.de.\nDOI:10.1523/JNEUROSCI.0597-14.2014\nCopyright © 2014 the authors 0270-6474/14/3413183-12$15.00/0\nThe Journal of Neuroscience, September 24, 2014• 34(39):13183–13194 • 13183\npared with neutral objects. Second, the neural correlates for the\nonline control of complex functional actions with objects com-\npared with nonfunctional actions were of interest. A special focus\nlaid on the neural underpinnings selective for known tool use.\nThird, we looked at the structure of the action network while\nusing the dominant compared with nondominant hand and also\ndescribed the networks with respect to its laterality. The applica-\ntion of a so-called “Tool-Carousel” made it possible to present a\nvariety of actual objects with spatial and temporal precision in the\nMRI scanner and measure functional images while participants\nperformed real actions.\nMaterials and Methods\nParticipants. Twenty healthy participants (9 males) participated in the\nfMRI experiment. Three had to be excluded (1 male and 2 female) from\nfurther statistical analysis because of strong head movements (head mo-\ntions exceeded 3 mm in translation and 3° in rotation). The group of\nparticipants who were included in the analyses had a mean age of 25 years\n(age range, 21–28 years). All had normal or corrected-to-normal vision,\nno history of neurological or psychiatric disorders, and were right-\nhanded, as measured by the Edinburgh Handedness Inventory (\nOldfield,\n1971). The study was approved by the local ethics committee.\nExperimental setup and design.To present the experimental stimuli, a\nso-called “Tool-Carousel” (Fig. 1A) was installed above the hips of the\nparticipants while lying in the MRI scanner. This setup is comparable\nwith the “Grasparatus” from\nCulham et al. (2003), a device for fMRI\nexperiments, which makes it possible to present real reachable and grasp-\nable objects in the MRI scanner.\nThe “Tool-Carousel” had a diameter of 65 cm and six compartments,\nwhich could hold exchangeable mountings for a variety of objects and\ncould be turned around its central axis. It was placed on a table with\nadjustable height. It was ensured that all participants lay comfortably and\ncould easily reach for the stimuli in the compartments with both right\nand left hand. The upper arms of the participants were placed on cush-\nions and fixated with a belt to allow easy access to the “Tool-Carousel”\nwhile preventing movements of the upper arm and shoulder. The heads\nof the participants were fixated in the MRI coil with a special set of pads\nminimizing head motion. A two-mirror system was placed on top of the\nhead coil, which enabled the participants to see the “Tool-Carousel” and\ntheir hands (\nFig. 1B). The mirror system provided a clear image of the\nwhole compartment with the object. Each compartment of the “Tool-\nCarousel” was separated by a partition, so only one compartment at a\ntime could be seen by the participant. A mirror system was used to view\nthe workspace because tilting the coil and providing a direct view on the\n“Tool-Carousel” was not possible in our experimental setup. Addition-\nally, keeping a tilted head position for the whole experiment (i.e.,/H1101190\nmin) seemed to be very uncomfortable for the participants. We consider\nany bias on the resulting task comparisons due to the visual transforma-\ntions negligible because all conditions included these transformations\nand any constant effects should be canceled out.\nIn general, the experiment comprised three different experimental\nmanipulations with two possible variations each. The first two included\nthe object type and the type of action done with the object. The resulting\nFigure 1. A, The “Tool-Carousel” with six compartments and mountings to hold the tools.B, The experimental setup:a, “Tool-Carousel”;b, adjustable table;c, two-mirror system attached to the\nhead coil;d, visual path to field of vision;e, shoulder belt;f, arm rest.C, Illustration of the four experimental conditions: tool use, tool transport, bar use, and bar transport. All four conditions are\nperformed with the right hand in one and with the left hand in the other run.D, Time course of a trial. Each trial consists of a planning phase (2– 6 s long), an execution phase (4 s long), and a return\nphase (2 s long). In no-action trials, no green light appears; and in action trials, a green light triggers the start of the action. The return phase started when the green light was turned off. No-action\ntrials were used to analyze the planning phase and action trials for the execution phase.E, An exemplary selection of the used stimuli in the experiment; shown are the pen, screwdriver, and spoon\nand the matched bars.\n13184 • J. Neurosci., September 24, 2014• 34(39):13183–13194 Brandi et al. • Neural Correlates of Planning and Executing Actual Tool Use\nexperimental conditions were randomized on a trial-by-trial basis within\nsubject. The hand used to do the tasks was the third experimental ma-\nnipulation and did not vary within both of the two runs the participants\nhad to perform. The order regarding which hand was the first to be used\nduring the experiment was randomized across participants. A more de-\ntailed description of the different experimental conditions is presented in\nthe following paragraphs.\nTwo different categories of stimuli were presented during the experi-\nment: tools and neutral objects. The tool set comprised 10 different tools\nregularly used in daily life (hammer, pen, tweezers, scissor, knife, spoon,\nscrewdriver, key, lighter and bottle opener). The other set of stimuli\nincluded 10 differently colored and shaped neutral objects. The neutral\nobjects were mainly bar-shaped; for simplicity, we hereinafter call the\nneutral objects “bars.” To reduce visual and tactile differences between\nthe two stimuli sets, the bars were designed to match the different tools\nfrom the first stimulus set as much as possible. The handle of the bars had\ndifferent shapes (e.g., a small diameter matching the pen or a flat shape\nmatching the nonfunctional part of the spoon and knife). Additionally,\nthe handles of the bars were colored to match the tools.\nFigure 1E shows\nexamples of three tools and the matched neutral bar-shaped object. One\nside of each bar was marked in blue. All tools had matching mountings to\nhold the tool and a tool-specific recipient (nail for the hammer, paper for\nthe pen, cotton ball for the tweezers, string for the scissor to cut, piece of\nbread for the knife, cup for the spoon, rotatable screw for the screwdriver,\nkeyhole for the key, candle for the lighter, and a bottle with crown seal for\nthe bottle opener). All tools were fully functional with respect to the\nmanipulation (e.g., the screw was placed in a winding and could\nbe turned by the screwdriver, the key fit in the keyhole and was rotatable).\nGoal attainment was functional in some but not in all actions (e.g., the\npen left a trace on the sheet of paper, but the nail did not move into\nthe material during hammering and the lighter did not produce a flame\ndue to security reasons). Therefore, our study addresses the neural cor-\nrelates of actual tool manipulation but does not intend to reflect repre-\nsentations of goal attainment. In case of the bars, a blue marked opening\nwas placed at the bottom of the mounting, in which the blue end of the\nbar was to be inserted. All components of the “Tool-Carousel,” as well as\nall objects, were made of plastics. fMRI compatibility was verified in test\nscans.\nThe task was to either use the different objects or to transport them, the\nlatter meaning to grab and lift the object and return it to the mounting.\nThe participants had to perform two runs of functional MRI: one in\nwhich they had to use the dominant right hand and the other in which\nthey had to use the nondominant left hand. The order in which the hands\nwere tested was randomized across subjects. In case of the tools, the\naction typical for the tool should be performed by the participant (e.g.,\nhit the nail with the hammer, write with the pen on paper). To be used\ncomfortably, each of the tools required a different tool-specific func-\ntional grip and movement (e.g., grasping the hammer at the handle and\nmove it up and down to hit the nail). The tools were placed in a way that\nthe action could be performed promptly without additional adjustments\nof the grip (the handle of the tool was placed to the right while the\nparticipants used the right hand and left while they used the left hand,\nrespectively). To use the bars, the participants had to put the blue marked\nend of the bar into the blue opening on the bottom of the mounting (\nFig.\n1C). Dependent on the placement of the marked end in the mounting\n(medial or lateral) and the hand used, the participants had to grasp the\nbar with an overhand (pronated) or underhand grip (supinated) to place\nthe blue end into the opening comfortably (\nRosenbaum and Jorgensen,\n1992; Marangon et al., 2011). In half of the trials the marked end of the\nbar was placed to the left, the other half to the right. Therefore, as for\nthe tools, the grip to comfortably use the bar had to be adjusted\naccording to the demands of the task. The order of orientation was\nrandomized across the experiment. A small sign at the top of the\nmounting showing either the letters “B” (for “benutzen,” the German\nword for “use”) or “T” (“transportieren” for “transport”) indicated\nwhich task the participants had to perform. This setup resulted in four\ndifferent main conditions: (1) tool use, a functional grip and movement\nof a known object; (2) tool transport, a nonfunctional grip and move-\nment of a known object; (3) bar use, a functional grip and movement of\na neutral object; and (4) bar transport, a nonfunctional grip, and move-\nment of a neutral object.\nThe experiment had a rapid event-related design with 200 trials per\nrun. Each of the four conditions was comprised of 40 trials (four repeti-\ntions for each tool or each bar), resulting in 160 condition trials and 40\ncontrol trials. During the control trials, an empty compartment of the\ntool carousel was shown, these trials served as a control condition for the\ncomparison in the statistical analysis. To ensure an optimal trial order,\nthe Genetic Algorithm toolbox (\nWager and Nichols, 2003) for event-\nrelated designs was used to create a randomized trial order for each run.\nThe order of objects was randomized across subjects.\nEach trial consisted of a planning phase with a duration of 2– 6 s in\nwhich the object and the cue for the action was presented, followed by an\nexecution phase in which a green light triggered the start and the dura-\ntion of the cued action. When light was turned off after 4 s, the partici-\npants had to stop the action and to return the object to the mounting in\nmaximum 2 s time (return phase) (\nFig. 1D). During the intertrial interval\n(varying equally between 1 and 2 s), the “Tool-Carousel” was turned to\npresent the next stimulus. In half of the trials of each condition, no green\nlight appeared, resulting in 80 action and 80 no-action trials. The order of\ntrials with and without the green light and also the time of the onset of the\ngreen light (2– 6 s) varied randomly across the run, making it impossible\nfor the participants to predict, if a trial is an action or no-action trial.\nProcedure. Before the fMRI measurement, all participants had to an-\nswer a questionnaire, checking their knowledge about the objects used in\nthe experiment and how familiar they are with the usage. Here the par-\nticipants had to name the object, state if they know the function of the\nobject (scale ranging from 0/H11005not at all to 3/H11005yes, very well), how to use\nit (scale ranging from 0/H11005not at all to 3/H11005yes, very well), how often they\nhave used it (scale ranging from 0/H11005never to 3/H11005often), how regularly\nthey use it (scale ranging from 0/H11005never to 4/H11005daily), how often they\nhave to use it during their job or studies (scale ranging from 0/H11005never to\n4 /H11005very often), if it is an essential object for their daily life (0/H11005not at all\nto 2/H11005very much) and if they own the object.\nExperimental procedures and tasks were explained to the subjects via a\nvideo instruction on how the different objects are thought to be used and\ntransported followed by a training of all tasks while already laying com-\nfortably in the scanner. The position of the “Tool-Carousel” was adjusted\naccording to the participants’ individual size and arm length to ensure\nthat all objects could be used comfortably and according to the instruc-\ntions. No instance was observed when an object could not be properly\ngrasped or used due to the mounting of the object acting as an obstacle.\nParticipants were asked to do the actions at least once and perform the\ntask carefully without rushing, to avoid short and quick movements,\nwhich could disturb data acquisition. The manipulation of all experi-\nmental conditions was trained with all objects until participants were\nable to perform all tasks accurately with both left and right hand in the\ngiven time of the execution phase. During the fMRI measurement,\nPresentation Software (Neurobehavioral Systems) was used to give\nacoustic instructions via headphones on timing of trials to an opera-\ntor within the scanner room. The operator exchanged task cues and\nobjects for each trial and turned the “Tool-Carousel” on the acoustic\ncueing. The subjects received no acoustic simulation. A camera placed\nat one end of the MRI scanner recorded the hand movements and\nworkspace of the participants.\nVideo analysis. The recordings of the camera were used to rate the\nparticipants’ performance and to evaluate the accuracy of the onset of\ntrials and the duration of hand movements. For the performance rating,\nthe number of errors was counted per participant. One type of error\nincluded general task errors and was rated with the scale 0 –1: a score of 1\nmeaning the task was performed according to the cue. For the use con-\nditions, the grip and movement errors were counted. Grasping errors\nwere also rated with the scale 0 –1: a score of 1 was given if a functional\ngrip was used to manipulate the object. In case of the tools, the object had\nto be held on the nonfunctional end with a hand position, enabling the\nparticipant to manipulate the tool as usual (e.g., grasp the handle of the\nhammer or hold the pen in the learned writing position). The correct grip\nwas shown to the participants in the introduction video before the test-\ning. If a subject held the tool in an uncommon way not according to the\nBrandi et al.• Neural Correlates of Planning and Executing Actual Tool Use J. Neurosci., September 24, 2014 • 34(39):13183–13194 • 13185\ninstructions, the trial was scored with a 0. In the condition bar use, a\nfunctional grip was achieved if the participants discriminated between an\noverhand or underhand grip dependent on whether the blue marked end\nof the bar was on the medial or lateral side (\nRosenbaum and Jorgensen,\n1992; Marangon et al., 2011). Another scored aspect of the task was the\ncorrect movement performed with the object (scale 0 –1). If the subjects\nmoved the object according to its function and how it was shown to them\nin the instruction, the trial was scored with 1. On the other hand, if the\nmovement was not executed correctly or incomplete (e.g., only moving a\ntool to the target without the function specific movement or not placing\nthe marked end of the bar in the opening), the trial was scored with 0.\nAdditional to the use condition, also the transport condition was rated.\nThis condition was performed correctly if the object was grasped, lifted,\nand returned as instructed before the experiment. It was evaluated if a\nfunctional grip (as in the use condition) or a nonfunctional transport\ngrip was used. The latter was shown in the introduction video and in-\ncluded grasping the tool in the middle to lift it, but no further tool-\nspecific grip adjustment. In the end, the observations of both runs were\naveraged for all subjects for each error category.\nEven though the participants were asked to perform the movement\nduring the execution phase while the green light was on and return the\nobject when the light was turned off, it cannot be guaranteed that the\ndurations of the hand movements are exactly the same in all trials and\nparticipants across the experiment. Therefore, next to the general task\nperformance, also the timing of each individual participant was deter-\nmined in a video analysis. A motion detection analysis was done with a\nMATLAB (Release 2012a, MathWorks) based script. One search area and\none reference area were selected in each video. The search field included\nthe pixels covering the workspace and hands of the participant, and the\nreference field included a part of the bore of the MRI scanner where no\nhand or any other movement occurred. The videos were converted to\nsingle picture frames (12.5 frames per second); and to detect motion, the\npixels of the search and reference fields of one picture frame were sub-\ntracted from the pixels from the following picture frame. The mean\nacross all pixels of these differences was saved as a vector representing a\ntime course of changes in the search and reference field, respectively, for\neach subject. A movement was detected if the value exceeded a certain\nthreshold. This threshold was calculated for each subject individually and\nrepresented a mean value of a time period of 4 s from the beginning of\neach run in which no hand movement occurred. The results from the\nmotion detection from the reference field only show peaks when the\naction signal (green light) was turned on and off. This information was\nused to confirm that the detected hand movements in the search field\nwere related to the task and represent the action in the execution phase.\nCorrect performance of the automatized motion detection was verified\nby visual inspection. In general, subjects’ movements filled the 4 s execu-\ntion time in all conditions. Quantitative analysis revealed that the mean\ntime across subjects needed for the tool condition was 4.2 s, for bar 4.0 s,\nfor use 4.4 s and for transport 3.8 s. These results led to a significant (p /H11021\n0.05, Bonferroni corrected for two comparisons) difference in duration\nof 0.2 s for the comparison of objects and 0.6 s for the comparison of the\ntask. The periods of each subject’s hand movements were introduced into\nthe first-level analysis to ensure an accurate modeling of events and to\ncontrol for the variance in duration across conditions (this process is\nexplained in more detail in fMRI analysis).\nMRI measurement.All fMRI measurements were performed on a Sie-\nmens 3 Tesla Verio MRI scanner. T1-weighted anatomical images were\nacquired with the MP-RAGE sequence, whereas the BOLD echo-planar\nimages were measured using a T2*-weighted gradient echo sequence\nwith the repetition time TR/H110052000 ms, echo time TE/H1100530 ms, field of\nview /H11005192 mm, flip angle\n/H9251/H1100590°, matrix/H1100564 /H1100364, slices/H1100535, slice\nthickness /H110053 mm and voxel size/H110053m m/H110033m m/H110033 mm.\nfMRI data analysis.The entire data analysis was performed with SPM8\n(Statistical Parametric Mapping software; Wellcome Department of Im-\naging Neuroscience, London; http://www.fil.ion.ucl.ac.uk). Before en-\ntering the statistical analysis, the fMRI data were preprocessed by using a\nslice time correction, realigning the images to correct for movement\nartifacts, coregistering the anatomical, and normalizing all images to\nstandard space (Montreal Neurological Institute, see SPM software).\nThereafter, the functional datasets were smoothed with a Gaussian kernel\nof 8 mm for group analysis.\nThe statistical analysis was performed at two levels. At the first level for\neach subject, the onsets of each condition were modeled in a GLM as\nevents, which are represented as stick functions and convolved with the\nhemodynamic response function. The design matrix comprised two ses-\nsions, representing the runs in which the subjects used the right or the left\nhand, respectively. The design matrix for one run was composed of 15\nregressors representing the experimental conditions and six regressors\ncomprising the realignment parameters. The 15 condition regressors in-\ncluded a separate regressor for the planning phases of each condition for\nthe no-action trials as well as the action trials (two times: tool use, tool\ntransport, bar use, bar transport). Four additional regressors modeled\nthe execution phase of the action trials of all conditions as events. The\n13th regressor represents the control condition. The 14th modeled the\nindividual trials in which the subjects made errors. The last regressor\nincluded the duration of hand movement, which was detected for each\nsubject individually by the motion detection analysis of the video record-\ning. This regressor, therefore, covers the hand movement during the\nexecution phase and return phase of all conditions in one. Because this\nstudy does not aim to analyze the basic sensorimotor processing of move-\nments, the purpose of this regressor is to explain the variance in the data,\nwhich is caused by the duration of hand movements the subjects need to\nperform the different tasks and to return the objects. To verify that this\nregressor explains mainly basic sensorimotor processes as during the\nperiod of hand movement, a second-level one-samplet test of this regres-\nsor was performed.\nAt the second level for the main activation analysis, contrast images of\neach participant were entered into a 2/H110032 /H110032 factorial design with the\nfactors object (level: tool or bar), task (level: use or transport), and hand\n(level: right or left). Separate second-level analyses were performed for\nthe main effects and interactions of the planning and execution phase,\nrespectively. The contrast images which entered the factorial design in-\ncluded the comparisons of each condition separately to the control con-\ndition. The second-level analysis of the planning phase comprised the\ncontrast images of the no-action trials only, which eliminates the influ-\nence of actual movement in this data analysis. The analysis for the exe-\ncution phase includes the contrast images of the action trials only. A\nbrain mask was created for action planning and execution and applied\nto the second-level analysis, including the added activations of all\nconditions compared with the control condition at a threshold ofp /H11021\n0.001. The anatomical labeling of the results was done with the Anat-\nomy Toolbox (\nEickhoff et al., 2005) and the graphical display of the\nstatistical maps with the BrainNet Toolbox (Xia et al., 2013). Bar plots\nshowing the contrast estimates of peak activations of clusters at a\nthreshold of p /H110210.05 (and family-wise error [FWE] correction) were\nconstructed to display activations toward the control condition for all\nfour conditions separately.\nLaterality index (LI). To evaluate the laterality of the tool use and\naction network the LI was calculated with the LI toolbox (\nWilke and\nLidzba, 2007) for each condition and each subject on a first-level basis to\ntest the laterality across the group. Additionally, the LIs of the activation\nmaps of the second-level analysis were estimated. Because the LI is\nstrongly dependent on the threshold used for the images in the analysis,\nthe bootstrap method was used as recommended by the developers of the\ntoolbox (\nWilke and Schmithorst, 2006; Seghier, 2008). The bootstrap\nmethod creates 10,000 LIs, which are calculated at a range of different\nthresholds. Taking the results from the different thresholds into account,\na weighted LI is calculated. These values range from/H110021 (right sided\nlateralization) to 1 (left-sided lateralization). To analyze the laterality of\nthe network in more detail and ensure that the calculated LIs are not\nbiased by contralateral motor-sensory processing, the calculation for the\nindividual images was performed for the occipital, temporal, parietal,\nand frontal lobe, whereas the primary sensorimotor cortices were ex-\ncluded and analyzed separately.\nTo test for significant difference of LI from zero (zero corresponds to\nsymmetrical activation), at test of the subjects’ LIs was performed for\neach condition separately. Additionally, the individual LIs were entered\n13186 • J. Neurosci., September 24, 2014• 34(39):13183–13194 Brandi et al. • Neural Correlates of Planning and Executing Actual Tool Use\ninto a three-way ANOVA with the three factors object, task, and hand to\nevaluate significant main effects for each factor.\nResults\nBehavioral data: questionnaire\nThe questionnaire, which was filled out by the participants before\nthe start of the experiment aimed at measuring if the participants\nknew the objects used in the experiment and how familiar they\nare with using them. The median score of the questions testing for\ntool knowledge (naming the tool, knowing function, and how to\nuse it) was 70 points (range, 66 –70 points). The possible maxi-\nmum score was 70 points, showing that all participants knew all\ntools (one scored only 66 because this participant did not clearly\nrecognize one object on the given photo but knew it after clarifi-\ncation). Regarding the bars, the median score was 0 (range, 0 –3\npoints), showing that participants, as expected, had no prior\nknowledge of the bar’s function or use. Concerning the familiar-\nity of objects, the participants scored a median of 75 points\n(range, 54 –98 points) for the tools and 0 for the bars. The possi-\nble maximum score was 130 points per participant, which would\nmean that all included tools had to be used on a daily basis during\nthe participants job and daily routine. The minimum score was 0,\nwhich would indicate that the object has never been used by the\nparticipant before and its usage is not familiar to him or her.\nAll participants owned all of the tools but not the bars, except for\ntwo participants, who did not own a lighter. All in all, the results\nof the questionnaire show that all participants knew the tools and\nwere familiar with using them but did not do so for the bars.\nBehavioral data: video analysis\nPerformance of the participants was evaluated by scoring the\nvideo recordings of their hands and the workspace. This evalua-\ntion was performed to ensure correct performance according to\nthe cues and instructions and to assess whether functional grips\nand movements were used. For all conditions, it was evaluated\nwhether the correct action according to the cued experimental\ncondition was performed. In total, the median number of errors\nwas one error (range, 0 –2 errors) per participant (during a total\nof 400 trials). In the following, only trials in which the correct\ncued task was performed will be considered. During the tool use\ncondition, the median error score regarding the use of a func-\ntional grip was 1 (range, 0 –5 errors), and for mistakes concerning\nthe movement of the tool was 0 (range, 0 – 4 errors). There was no\nsignificant difference of the number of mistakes made between\nthe two runs. In all trials of the condition tool transport, a non-\nfunctional grip was used to transport the tool by all participants.\nThe condition bar use was performed correctly by all participants\nin all trials. The participants made an overhand grip in all possible\n20 trials, which required this type of grip. In the 20 trials in which\nan underhand grip was appropriate, the median number of un-\nderhand grips was 19 (range, 20 –13). In the remaining trials, an\noverhand grip was used. This shows subjects adjusted the grip\ndependent on the objects properties (is the marked end on the\nmedial or lateral side). The participants made no movement er-\nrors in the bar use condition. In the bar transport condition, the\nsame lifting grip was used as in the tool transport condition in all\ntrials.\nAll in all, the behavioral results showed that the task was\nmostly performed correctly and that the condition tool use and\nbar use were performed using a functional grip and movement\nfor each object relative to the goal of the action. On the other\nhand, during both the condition tool transport and bar transport,\na nonfunctional transport grip and movement was used.\nMovement duration\nTo clarify which brain regions are sensitive to possible variations\nof the movement duration, a second-level analysis was performed.\nThe anatomical location of the peak voxels and the correspondingp\nvalues are given in\nTable 1. Results are shown with a threshold ofp /H11021\n0.05 and an FWE correction. The results of this analysis revealed\nmainly the sensorimotor cortices of both hemispheres and an\noccipito-temporo-parieto-frontal network of right, but none of the\nleft, side brain areas involved in tool use as reported below.\nfMRI activation analysis\nThe following section reports the neural responses for the manip-\nulation of tools and neutral objects during action planning and\nexecution and the main effects of the factors object, task, and\nhand. As a first step, activation caused by all task conditions\nversus the control condition during action planning was calcu-\nlated to determine the brain areas necessary for processing the\nplanning of object related manipulations independent of specific\nfunctions and object semantics. The activity maps are shown at a\nthreshold of p /H110210.05 with an FWE correction. This analysis\nshowed a left-sided network (\nFig. 2A, top), including clusters in\nthe temporal lobe, such as the fusiform gyrus (FG) and lateral\noccipital complex (LOC), MTG, clusters in the parietal lobe (SPL,\nSMG), including anterior and posterior parts of the intraparietal\narea, frontal activation, including PMv, PMd, insula lobule, and a\ncluster in the middle frontal gyrus (MFG). The LI for this contrast\nis 0.64 for frontal, 0.92 for parietal, 0.69 for temporal, and 0.58 for\nthe occipital lobe, whereas the LI for the sensorimotor cortex is\n0.99. The same analysis was performed for the execution phase\n(\nFig. 2A, bottom) showing a wider bilateral network with addi-\ntional activations in primary sensory and motor cortex in both\nhemispheres. The calculated LI for this contrast is 0.45 for frontal,\n0.34 for parietal, 0.06 for temporal, and/H110020.091 for the occipital\nlobe, whereas the LI for the sensorimotor cortex is 0.58.\nThe tool network during actual action planning\nand execution\nTo statistically determine the brain regions that are more active\nfor planning actions with known objects (tools) compared with\nneutral objects (bars), the contrast tool versus bar was calculated\nTable 1. Anatomical locations and thep values of peak voxels of the one-samplet\ntest results for the subjects’ individual period of hand movementsa\nBrain area p\nLeft hemisphere\nPrecentral gyrus 0.0381\nSuperior parietal lobule, SPL 5A 0.0010\nInferior occipital gyrus 0.0090\nPostcentral gyrus 0.0005\nRight hemisphere\nInferior frontal gyrus (pars opercularis) 0.0001\nInferior frontal gyrus (pars triangularis) 0.0010\nMiddle frontal gyrus 0.0031\nSuperior frontal gyrus 0.0008\nSuperior medial gyrus 0.0450\nInsula 0.0037\nLingual gyrus 0.0071\nPostcentral gyrus 0.0000\nPrecuneus 0.0000\nSupramarginal gyrus 0.0000\nInferior temporal gyrus 0.0042\nSuperior temporal gyrus 0.0000\naData are thep values of the peak voxel of a cluster in an anatomical area. Only clusters are reported, which survive\na threshold ofp /H110210.05 (FWE).\nBrandi et al.• Neural Correlates of Planning and Executing Actual Tool Use J. Neurosci., September 24, 2014 • 34(39):13183–13194 • 13187\nand is shown inFigure 2B (top) atp /H110210.05 (FWE corrected). The\nresults showed an overall mainly left-sided activation pattern (LI\nfrontal lobe, 0.75; LI parietal lobe, 0.83; LI temporal lobe, 0.49; LI\noccipital lobe,/H110020.38; LI sensorimotor cortex, 0.84). Additional\nto clusters in inferior occipital gyrus, the LOC, MTG, and FG\nwere activated. In the parietal cortex, the SPL, SMG, and the\ninferior parietal lobe, including the AIP, showed a specification\nfor the tool conditions compared with bars. A frontal cluster was\nlocated in the PMd and is listed in\nTable 2with the other results.\nNo specific region was activated for the opposite contrast bars\nversus tools during action planning.\nThe execution phase was analyzed in the same way (\nFig. 2B,\nbottom). The contrast tool versus bar revealed activation differ-\nences in the same temporal, parietal, and frontal regions as during\nthe planning phase, but to a larger extent and with additional\nclusters in the PMv, PMd, insula, MFG, primary sensory, and\nmotor cortex. The network is still lateralized to the left, although\nto a lesser extent due to the recruitment of the right-sided areas\nwhile executing actions with the left hand. Because the condition\nbar also required hand movements, contrast differences in pri-\nmary motor activation were however not significant. The ana-\ntomical locations of the clusters and the statistical values of the\npeak voxel in all clusters of both contrasts can be found in\nTable\n2. The reverse contrast bar versus tool for execution phase did not\nshow significant clusters surviving at this threshold.\nNeural correlates of using objects and the knowledge of how\nto use a tool\nTo study the influence of the manipulation type on the action\nnetwork, we focused on the factor task in this part of the analysis.\nTo define the brain regions engaged in functional tool use and\nobject manipulation independent of the specific object type, the\ncontrast use versus transport was calculated. This analysis was\nperformed for both planning phase and execution phase. For the\nplanning phase, two clusters were found only at a threshold of\np /H110210.001 (uncorrected). One was located in left SPL and the\nother in the left PMd. The uncorrected activation map of the\nplanning phase is shown in blue as an overlay on the activation\nmap of the execution phase in\nFigure 3A. The corresponding\nuncorrected p values of the peak voxels are listed inTable 2. The\nactivation map of the execution phase is shown atp /H110210.05 with\nan FWE correction (red color scale). The network involved in\ncontrolling a functional grip and the manipulation of an object\nincluded the left LOC, a cluster in the left lateral part of the\nsuperior occipital gyrus (SOG) close to the parietal-occipital sul-\ncus, SPL, and left PMd, the latter two matched the areas also\ndescribed for the planning phase. Additionally, primary sensory\nand motor cortices were more active during the use than during\nthe transport of an object. This network for functional use, in-\ncluding the grip and specific movements, was mainly lateralized\nto the left hemisphere, except for a cluster in the right SPL result-\ning in the following LIs: LI frontal lobe, 0.76; LI parietal lobe,\n0.76; LI temporal lobe, 0.81; LI occipital lobe, 0.85; LI sensorimo-\ntor cortex, 0.68. The contrast estimates and 90% CI of each of the\nfour experimental conditions versus control condition were plot-\nted for regions of interest (\nFig. 3A). Compared with the control\ncondition, all regions were activated in all separate task condi-\ntions, but the responses were higher for the condition use com-\npared with transport independent of which object was used.\nHowever, the use of tools in all regions produced a higher re-\nsponse than the condition bar use.\nTo define the brain regions coding function-specific tool\nknowledge during execution, the interaction between the factors\nobject and task was calculated ((tool use/H11002tool transport) vs (bar\nuse /H11002bar transport)). To restrict the analysis to regions with the\nhighest sensitivity to tool use, but not to the other three condi-\ntions, the interaction was masked with the intersection of the\nthree contrasts: tool use versus tool transport, tool use versus bar\nuse, and tool use versus bar transport (threshold for the masking\ncontrasts was p /H110210.001 uncorrected). These regions therefore\nshowed the highest sensitivity for the use of tools compared with\ngoal-directed manipulation of neutral objects and do not reveal\nobject-specific activations for nonfunctional transport actions.\nThe other three conditions (tool transport, bar use, and bar trans-\nFigure 2. Whole-brain results for the action network inA and the main contrast for the factor object inB. A, The activity maps of the contrast all conditions versus control condition shown for the\nplanning phase in the top and for the execution phase on the bottom.B, The activity map of the contrast tool versus bar is shown for the planning phase in the top and for the execution phase in the\nbottom. All results ofFigure 2are shown at a threshold ofp /H110210.05 (FWE corrected) on a rendered brain. The color scale under the brain images indicates the range of the T values from low values\nin dark red to high values in white. IOG, Inferior occipital gyrus; MOG, middle occipital gyrus.\n13188 • J. Neurosci., September 24, 2014• 34(39):13183–13194 Brandi et al. • Neural Correlates of Planning and Executing Actual Tool Use\nport) were not significantly different from each other. The statis-\ntical map is shown inFigure 3B at p /H110210.05 (FWE corrected). In\naddition to a cluster in the posterior MTG clusters were detected\nin the middle occipital gyrus close to V5, PMv, in a posterior part\nof the SMG, and the medial part of the SOG. Additionally, a\ncluster in the left postcentral gyrus showed an interaction. This\nnetwork included exclusively left-sided clusters, which are listed\nin\nTable 2. The contrast estimate and 90% CI of each of the four\nTable 2. Anatomical locations and thep values of peak voxels for all calculated contrastsa\nPlanning phase Execution phase\nBrain area\nAll versus\nbaseline Tool versus bar\nUse versus\ntransport\nAll versus\nbaseline\nTool versus\nbar\nUse versus\ntransport\nInteraction\nof task/H11003object\nLeft versus\nright\nRight versus\nleft\nLeft hemisphere\nFrontal lobe\nInferior frontal gyrus, PMv 0.0000 0.0000 0.0000 0.0001\nInferior frontal gyrus (pars orbitalis) 0.0000\nInferior frontal gyrus (pars triangularis) 0.0035\nMiddle cingulate cortex 0.0000 0.0000\nMiddle frontal gyrus 0.0000 0.0000 0.0000 0.0107\nPrecentral gyrus 0.0000 0.0001 0.0065 0.0227\nSMA 0.0000 0.0010\nSuperior frontal gyrus 0.0000\nSuperior frontal gyrus, PMd 0.0000 0.0088 0.0001* 0.0007\nInsula lobe\nInsula 0.0000 0.0000 0.0000\nOccipital lobe\nCuneus 0.0003\nInferior occipital gyrus 0.0000 0.0000 0.0000 0.0000\nLOC 0.0000 0.0000 0.0040 0.0017\nMiddle occipital gyrus 0.0000 0.0242 0.0000 0.0010 0.0001\nSuperior occipital gyrus 0.0000 0.0160 0.0025 0.0003\nSuperior occipital lobule 0.0003\nParietal lobe\nAnterior intraparietal area 0.0000 0.0048 0.0347\nInferior parietal lobule 0.0000 0.0130\nInferior temporal gyrus 0.0000\nPostcentral gyrus 0.0000 0.0000 0.0000 0.0141 0.0015 0.0034\nPrecuneus 0.0000\nSuperior parietal lobule 0.0000\nSuperior parietal lobule, SPL 7A 0.0000 0.0004* 0.0000 0.0000 0.0370\nSupramarginal gyrus 0.0000 0.0000 0.0025\nTemporal lobe\nFusiform gyrus 0.0000 0.0006 0.0003 0.0020\nInferior temporal gyrus 0.0000 0.0178\nMiddle temporal gyrus 0.0000 0.0161 0.0131\nSuperior temporal gyrus 0.0000 0.0003\nTemporal pole 0.0383\nRight hemisphere\nFrontal lobe\nInferior frontal gyrus, PMv 0.0000 0.0010\nInferior frontal gyrus (pars triangularis) 0.0000\nInferior frontal gyrus (pars orbitalis) 0.0000\nMiddle cingulate cortex 0.0000 0.0000\nMiddle frontal gyrus 0.0040\nPrecentral gyrus 0.0000 0.0000\nSMA 0.0020\nInsula lobe\nInsula 0.0180 0.0000 0.0010\nOccipital lobe\nCalcarine gyrus 0.0252\nInferior occipital gyrus 0.0000 0.0000 0.0000 0.0000\nLOC 0.0000\nParietal lobe\nPostcentral gyrus 0.0000 0.0000\nPrecentral gyrus 0.0000\nPrecuneus 0.0000 0.0000 0.0000\nSuperior parietal lobule 0.0000 0.0015\nSuperior parietal lobule, SPL 7A 0.0000\nTemporal lobe\nFusiform gyrus 0.0000 0.0009 0.0000\nMiddle temporal gyrus 0.0000\nTemporal pole 0.0160\naData are thep values of the peak voxel of a cluster in an anatomical area. Mainly clusters are reported, which survive a threshold ofp /H110210.05 (FWE).\n*Uncorrected p values.\nBrandi et al.• Neural Correlates of Planning and Executing Actual Tool Use J. Neurosci., September 24, 2014 • 34(39):13183–13194 • 13189\nexperimental conditions versus control condition were plotted\nfor the regions of interest (Fig. 3B). The LIs for the interaction are\n0.31 for the frontal lobe, 0.65 for the occipital lobe, 0.77 for the\nparietal lobe, 0.035 for the sensorimotor cortex, and 0.52 for the\ntemporal lobe. The same analysis for the planning phase or any\nother interaction between the factors object and task revealed no\nsignificant clusters surviving a threshold ofp /H110210.05 with an FWE\ncorrection.\nHandling tools with the dominant and nondominant hand\nThe results above for the combined data of the right and left hand\nshowed a left-lateralized tool network for action planning and\nexecution independent of the used hand. To compare the struc-\nture of the action network for the dominant and the nondomi-\nnant hand (in our case right and left hand, respectively), the\ncontrasts right versus left and left versus right were calculated. No\nsignificant differences were found in the planning phase at a\nthreshold ofp /H110210.05 (FWE corrected) for both contrasts. The\ndirect comparison of both conditions for the execution phase\nrevealed for the contrast right versus left, as could be expected, a\ncluster in the left motor cortex (\nFig. 4). The calculation of the LIs\nrevealed a value of 0.94 for frontal lobe,/H110020.47 for occipital lobe,\n0.18 for parietal lobe, 0.96 for sensorimotor cortex, and 0 for\ntemporal lobe. The reverse contrast (left vs right) revealed a left-\nsided activation pattern next to a strong cluster in the right motor\ncortex and SMA; the activations include temporal (superior tem-\nporal gyrus, MTG, ITG), inferior parietal (SMG, AIP), and sev-\neral frontal areas (MFG, PMd, PMv). The following LIs were\ncalculated for this contrast: 0.80 for frontal lobe, 0.89 for occipital\nlobe, 0.93 for parietal lobe,/H110020.43 for sensorimotor cortex, and\n0.95 for temporal lobe.\nThe interactions between the factors hand and object or task\ndid not reveal significant clusters surviving a threshold ofp /H11021\n0.05 with an FWE correction.\nLI\nTo verify the lateralization of the network relevant for planning\nand execution actions with tools and neutral objects across sub-\njects, the LI for all lobes and conditions was calculated separately,\ntested for significance, and compared for the factors object, task,\nand hand. The mean LI andp value for all conditions and lobes\nare shown in\nTable 3 for action planning and execution. The\nmean LI,p value, andF value of main effects for each factor are\nshown in Table 4 for the planning phase and execution phase.\nThe results indicate a significant left-sided lateralization during\naction planning in the parietal lobe, temporal lobe, and sensori-\nmotor cortex in almost all conditions. During action execution, a\nsignificant left-sided lateralization is obvious for all use condi-\ntions in the frontal lobe and for tool use right and left and bar use\nleft in the parietal lobe. A right-sided lateralization could be\nfound for the right-hand conditions in the temporal lobe. In the\nsensorimotor cortex, a clear left-sided lateralization can be found\nin the right-hand condition, whereas the left-hand condition\nshows a weak right-sided lateralization, which is only significant\nFigure 3. Results showing the influence of the factor task on the action network.A, Activity map of the contrast use versus transport is shown for the execution phase. Bar plots represent the\ncontrast estimates of the peak voxel and 90% CI in the labeled cluster for all four conditions. TU, Tool use; TT, tool transport; BU, bar use; BT, bar transport. The uncorrected activations during the\nplanning phase that did not survive the correction for multiple testing are shown as a blue overlay.B, Activity maps of the interaction between the factor object and task ((tool use vs tool transport)/H11002\n(bar use vs bar transport)) is superimposed onto a rendered brain for the execution phase. All results ofFigure 3are shown at a threshold ofp /H110210.05 (FWE corrected). *The three lines across the bar\nplots indicate that the contrast estimates of the condition tool use is significantly higher than in the other conditions with a threshold ofp /H110210.001. The color scale under the brain images indicates\nthe range of the T values from low values in dark red to high values in white. MOG, Middle occipital gyrus; PoG, postcentral gyrus.\n13190 • J. Neurosci., September 24, 2014• 34(39):13183–13194 Brandi et al. • Neural Correlates of Planning and Executing Actual Tool Use\nfor the condition bar transport left. The comparison of factors\nshow for the planning phase a significant main effect for the\nfactor object with a higher left-sided lateralization for tool than\nbar in the frontal, parietal, and temporal lobe as well as in the\nsensorimotor cortex. During action execution, a stronger left-\nsided lateralization is found in the parietal lobe for the condition\ntool compared with bar and in all areas for use compared with\ntransport. A significant main effect for the factor hand can be\nfound in the temporal lobe (stronger left-sided lateralization for\nleft than right), occipital lobe (stronger left-sided lateralization\nfor left than right), and the sensorimotor cortex (stronger left-\nsided lateralization for right than left). In summary, this analysis\nshows that especially the process of action planning, but also the\nexecution of object use, is left-lateralized.\nDiscussion\nThe current study aimed to describe the neural bases of actual\ntool use by investigating planning and executing actions with\nknown tools and neutral objects for the dominant and nondomi-\nnant hand. A wide strongly left-lateralized network was identi-\nfied, including parietal and frontal areas and areas of the ventral\nstream in addition to the obligatory primary sensorimotor areas\nas related studies have reported (\nInoue et al., 2001; Hermsdo¨rfer\net al., 2007; Gallivan et al., 2013a). More specifically, we are able\nto extend the characterization of three previously reported posterior\nstreams (\nMilner and Goodale, 2008; Binkofski and Buxbaum, 2013)\nwith distinctive functions in real tool use: the ventral stream that is\nrelevant for processing semantic tool information and object prop-\nerties, a dorso-dorsal pathway that is relevant for online monitoring\nthe grip and movements of objects during complex actions, and,\nadditionally, a ventro-dorsal pathway that is specifically involved in\nprocessing known object manipulations, such as tool use.\nDirect evidence for the separation of the dorsal stream in two\nprocessing pathways\nBy looking at complex goal-directed actions irrespective of object\nidentity compared with simpler actions, we are able to define\nareas that are increasingly recruited for monitoring the online\ncontrol of demanding object manipulations. The comparison of\nthe condition use and transport showed higher activations in left\nSPL, PMd, SOG, and LOC. In previous research,\nMartin et al.\n(2011) noted that additional to other areas left- and right-\nhanders show activity in SPL, reaching from the posterior parietal\nsulcus to the parietal-occipital sulcus and in PMd during grip\nselection and grasp planning. The cluster in the SOG of our re-\nsults is close to the superior parietal occipital complex, which\nseveral studies have described as an important cerebral region in\nreach-to-grasp actions in humans (\nCavina-Pratesi et al., 2010;\nGallivan et al., 2011; Monaco et al., 2011). A stronger recruitment\nof these “grip regions” could be based on the fact that the selec-\ntion of a functional grip is more demanding and complex than a\nsimpler transport grip (\nVerhagen et al., 2013). Furthermore, it\nmight not only be the complexity and the intended goal of the\nperformed action, which is specific for each of the two condi-\ntions, but also the process of action selection. Because the same\naction was performed during the transport condition for all trials\nbut a variety of different actions during the use condition, we can\nassume that the found neuronal circuit might also be involved in\nthe action selection process. Additionally, it is important to say\nthat all stated regions have been mentioned as being part of the\ndorso-dorsal pathway described by\nBinkofski and Buxbaum\n(2013). The dorso-dorsal pathway is running from the visual area\nV6 to the SPL ending in the PMd (Rizzolatti and Matelli, 2003). It\nis necessary for monitoring correct reaching and grasping move-\nments to handle an object dependent on the object’s properties\n(\nGrol et al., 2007). The increased load of online control and nec-\nessary movement adjustments during the use condition, irrespec-\ntive of object type compared with the transport, could be the\nreason that the pathway along the SOG, SPL, and PMd is re-\ncruited stronger (\nGlover et al., 2005, 2012; Striemer et al., 2011).\nAs our results show, SPL and PMd are not only relevant for the\nonline control of monitoring actions but possibly also for plan-\nning demanding actions. Even though the comparison of plan-\nning the use and transport of actions did not survive the\ncorrection for multiple testing, it is interesting to see that a similar\nactivation pattern can be found for planning and executing com-\nplex actions. Interestingly, next to these dorsal stream areas, also\nthe LOC of the ventral stream is sensitive for using known but\nalso neutral objects. Its involvement in object recognition and\ntherefore in tool-related tasks is known (\nGrill-Spector and Mal-\nach, 2004; Vingerhoets, 2008; Wurm et al., 2012). Additionally, it\nseems to be relevant for processing the dimensions of neutral\nobjects, which are relevant for grasping (\nMonaco et al., 2014) and\nalso when viewing unfamiliar or infrequently used tools com-\npared with familiar tools (\nVingerhoets, 2008). LOC coactivation\nwith the dorso-dorsal stream in the use condition indicates its\nrelevance for calculating object properties necessary to manipu-\nlate objects independent of their identity or familiarity and mon-\nitor the online control of actions with these objects.\nWith the analysis of the interaction of object and task, we are\nable to isolate a network specifically relevant for tool use. This\nnetwork includes the middle occipital gyrus close to V5 and clus-\nters covering parts of the SMG, postcentral gyrus, and PMv of the\nleft hemisphere. The areas are in line with the description of the\nventro-dorsal stream (\nBinkofski and Buxbaum, 2013), which is\nsuggested to run from the medial superior temporal area (MT/\nFigure 4. Results showing the influence of the factor hand on the action network. Activation\nmaps of the contrast right hand versus left hand on the top and left hand versus right hand on\nthe bottom for the execution phase. All results of\nFigure 4are shown at a threshold ofp /H110210.05\n(FWE corrected) on a rendered brain. The color scale under the brain images indicates the range\nof the T values from low values in dark red to high values in white. IOG, Inferior occipital gyrus;\nSTG, superior temporal gyrus; PrG, precentral gyrus; PoG, postcentral gyrus.\nBrandi et al.• Neural Correlates of Planning and Executing Actual Tool Use J. Neurosci., September 24, 2014 • 34(39):13183–13194 • 13191\nMST) to the inferior parietal lobule and the PMv (Rizzolatti and\nMatelli, 2003; Buxbaum and Kale´nine, 2010; Binkofski and Bux-\nbaum, 2013). It is thought to be important for processing the\nknowledge of specific learned object manipulations, such as tool\nuse (\nFrey, 2008; Buxbaum and Kale´nine, 2010). Especially pari-\netal structures show strong influence in coding actions particu-\nlarly related to tools (\nValyear et al., 2007, 2012; Vingerhoets et al.,\n2009; Verhagen et al., 2012; Peeters et al., 2013). This also seems\nto be true for the PMv, which is suggested to monitor the hand\nposture relevant for actions with a tool (\nVingerhoets et al., 2013).\nPatients suffering from apraxia, with difficulties in grasping and\nusing tools or performing pantomime of use, usually have lesions\nin inferior parietal cortex and additionally inferior frontal areas\n(\nGoldenberg and Spatt, 2009; Kale´nine et al., 2010; Randerath et\nal., 2010). Our results underline these findings and support the\nrelevance of the ventro-dorsal pathway in tool use. Additionally,\nwe show that it is coactivated with MTG, a ventral stream area. Its\nrole in processing semantic information suggests a strong con-\nnection to the ventro-dorsal stream during goal-directed actions\nwith known objects. All in all, we can show that both the dorso-\ndorsal but also the ventro-dorsal stream are activated with differ-\nent ventral stream areas during actual object manipulations and\ntool use, which indicates that information from both ventral and\ndorsal stream has to be integrated for complex actions. A func-\ntional connection seems to be probable because structural con-\nnections between MTG and SMG have been found in a Diffusion\nTensor Imaging study, which aimed to find structural connec-\ntions between regions relevant for tool use pantomime (\nRamayya\net al., 2010). Further connectivity analysis would be needed to\nprove and investigate the influence of ventral stream areas on the\ndorsal pathway, especially during tool use.\nThe tool network during actual action planning and\nexecution is largely common for dominant and nondominant\nhand\nIn our study, we are able to measure brain areas more active\nduring planning and executing tool actions compared with per-\nforming goal-directed movements with neutral objects. The spe-\ncific planning of tool manipulations recruits a mainly left-sided\nparietal and occipitotemporal network. Ventral stream activa-\nTable 3. Group mean LIs for all conditions and brain lobes andp values of statistical test for significant laterality\nFrontal lobule Parietal lobule Temporal lobule Occipital lobule\nSensorimotor\ncortex\nCondition LI p LI p LI p LI p LI p\nPlanning phase\nTool use right 0.253 0.097 0.736 0.000* 0.533 0.000* 0.249 0.008* 0.740 0.000*\nTool transport right 0.589 0.000* 0.743 0.000* 0.454 0.001* 0.187 0.117 0.801 0.000*\nBar use right 0.396 0.000* 0.526 0.001* 0.282 0.019* 0.364 0.003* 0.623 0.000*\nBar transport right 0.124 0.328 0.519 0.000* 0.372 0.002* 0.318 0.013* 0.295 0.081\nTool use left 0.363 0.003* 0.574 0.000* 0.335 0.012* 0.074 0.549 0.603 0.000*\nTool transport left 0.436 0.001* 0.453 0.005* 0.273 0.065* 0.037 0.772 0.469 0.006*\nBar use left 0.179 0.123 0.344 0.001* 0.223 0.103 0.297 0.005* 0.413 0.005*\nBar transport left 0.301 0.009* 0.355 0.014* 0.262 0.050* 0.101 0.481 0.375 0.013*\nExecution phase\nTool use right 0.414 0.000* 0.288 0.009* /H110020.323 0.004* /H110020.073 0.543 0.543 0.000*\nTool transport right 0.172 0.181 0.134 0.276 /H110020.446 0.000* /H110020.140 0.219 0.509 0.000*\nBar use right 0.511 0.000* 0.215 0.139 /H110020.263 0.024* 0.062 0.631 0.758 0.000*\nBar transport right 0.129 0.302 0.144 0.090 /H110020.338 0.003* /H110020.055 0.654 0.430 0.000*\nTool use left 0.420 0.001* 0.561 0.000* 0.573 0.002* 0.604 0.001* /H110020.064 0.664\nTool transport left 0.078 0.488 0.289 0.116 0.254 0.177 0.214 0.232 /H110020.144 0.247\nBar use left 0.263 0.032* 0.447 0.002* 0.462 0.011* 0.490 0.001* /H110020.164 0.154\nBar transport left /H110020.050 0.632 0.125 0.415 0.011 0.949 /H110020.090 0.584 /H110020.374 0.001*\n*The mean LI value is significantly different from zero at a threshold ofp /H110210.05.\nTable 4. Mean LIs for the levels of all factors and statistics for the test of main effects of factorsa\nFrontal lobule Parietal lobule Temporal lobule Occipital lobule\nSensorimotor\ncortex\nFactor Level Mean LI Statistics Mean LI Statistics Mean LI Statistics Mean LI Statistics Mean LI Statistics\nPlanning phase\nObject Tool 0.410 p /H110050.011* 0.626 p /H110050.001* 0.399 p /H110050.014* 0.137 p /H110050.018* 0.653 p /H110050.004*\nBar 0.250 F /H110058.46 0.436 F /H1100518.49 0.285 F /H110057.66 0.270 F /H110057.01 0.426 F /H1100511.51\nTask Use 0.298 p /H110050.327 0.545 p /H110050.605 0.343 p /H110050.945 0.246 p /H110050.062 0.594 p /H110050.051*\nTransport 0.363 F /H110051.02 0.517 F /H110050.28 0.340 F /H110050.00 0.161 F /H110054.06 0.485 F /H110054.50\nHand Right 0.340 p /H110050.853 0.631 p /H110050.135 0.410 p /H110050.374 0.280 p /H110050.248 0.615 p /H110050.253\nLeft 0.320 F /H110050.03 0.431 F /H110052.49 0.273 F /H110050.83 0.127 F /H110051.44 0.465 F /H110051.41\nExecution phase\nObject Tool 0.271 p /H110050.133 0.318 p /H110050.025* 0.014 p /H110050.534 0.151 p /H110050.354 0.211 p /H110050.232\nBar 0.213 F /H110052.52 0.233 F /H110056.17 /H110020.032 F /H110050.40 0.102 F /H110050.91 0.263 F /H110051.55\nTask Use 0.402 p /H110050.008* 0.378 p /H110050.001* 0.112 p /H110050.011* 0.271 p /H110050.002* 0.268 p /H110050.021*\nTransport 0.082 F /H110059.42 0.173 F /H1100516.23 /H110020.129 F /H110058.46 /H110020.018 F /H1100513.21 0.105 F /H1100516.63\nHand Right 0.306 p /H110050.257 0.195 p /H110050.432 /H110020.342 p /H110050.001* /H110020.051 p /H110050.036* 0.560 p /H110050.001*\nLeft 0.178 F /H110051.38 0.356 F /H110050.65 0.325 F /H1100516.50 0.305 F /H110055.32 /H110020.186 F /H1100552.85\naMean group laterality indices for levels of all factors and thep values andF values (df/H1100516) of the main effect of each factor.\n*Significant main effect at a threshold ofp /H110210.05.\n13192 • J. Neurosci., September 24, 2014• 34(39):13183–13194 Brandi et al. • Neural Correlates of Planning and Executing Actual Tool Use\ntions in the LOC, MTG, and FG are relevant for object recogni-\ntion and processing semantic knowledge of a tool (Milner and\nGoodale, 2008; Valyear and Culham, 2010). The left parietal cor-\ntex is known to be almost invariably involved in tool actions\n(\nLewis, 2006). We show here that core regions of the parietal\ncortex (SPL, AIP, and SMG), essential for tool manipulations, are\nalready recruited during preparation of actual execution. The\nrelevance of the parietal cortex in action planning of grasping and\nusing was emphasized by studies of\nGallivan et al. (2011, 2013a, b)\nusing pattern classification to decode movement intentions, as\nwell as other literature focusing on planning of tool use panto-\nmime (\nJohnson-Frey et al., 2005; Kro´ liczak and Frey, 2009;\nVingerhoets et al., 2011).\nThe execution of tool manipulations recruits a larger network\nwith additional involvement of frontal areas, such as PMv, MFG,\nand insula. Frontal areas are known to be relevant for realizing\nmotor plans, including grasping movements (\nCavina-Pratesi et\nal., 2010; Gallivan et al., 2013a, 2013b) and executing tool use\npantomime (Johnson-Frey et al., 2005; Kro´ liczak and Frey, 2009;\nVingerhoets et al., 2011).\nA feature of the action network seems to be its left-sided asym-\nmetry. Our results strongly support the finding that, in right-\nhanders, planning and executing object manipulations is mainly\nprocessed by the left hemisphere, independent of the used hand.\nInterestingly, the lateralization is stronger while planning actions\nwith tools than bars and for using compared with transporting\nduring execution, which indicates a changing network structure\nduring the time course of an action. Different from other studies\n(\nMoll et al., 2000; Choi et al., 2001; Kro´ liczak and Frey, 2009;\nJacobs et al., 2010), we found stronger activations during action\nexecution with the nondominant hand compared with the dom-\ninant one. We assume that stronger left-sided activations are\ncaused by an increase of recruitment of the action network in\norder for the untrained hand to perform as skilled and as dexter-\nous as the right hand. Additionally, the unfamiliarity of left-hand\nactions might result in higher activations.\nA new device to study neuronal processes of real actions\nOur results provide direct evidence for the multifaceted nature of\nneural mechanisms underlying complex actions, such as tool use.\nThis analysis was enabled by the use of a new device, the “Tool-\nCarousel,” which allows studying the influence of different fac-\ntors on real actions. The use of a mirror system in this study and\nthe therefore added visual transformations create a limitation to\nthe application, which should be avoided if the scanner environ-\nment allows it.\nIn conclusion, we successfully investigated actual tool and ob-\nject manipulation using the “Tool-Carousel.” We can identify\nactivation patterns representing tool knowledge, goal-directed\nactions, object grasping, and manipulation of tools and objects,\nincluding frontal, parietal, and temporal centers. Preparatory ac-\ntivations were strongly lateralized to the left brain and remained\nactive during actual task execution. Handling tools versus neutral\nbars and using an object versus transportation strengthen the\nlateralization of the action network toward the left brain. The\nresults support the assumption that the dorso-dorsal pathway is\nrelevant for monitoring the manipulated objects independent of\nprior knowledge about the object. On the other hand, regions of\nthe ventro-dorsal pathway code the specific knowledge of how a\nknown object (e.g., a tool) has to be used. Additionally, our study\nbrings about the question of how exactly the ventral areas LOC\nand MTG connect with the two dorsal pathways during real ac-\ntions and especially tool use.\nReferences\nBeauchamp MS, Lee KE, Haxby JV, Martin A (2002) Parallel visual motion\nprocessing streams for manipulable objects and human movements. Neu-\nron 34:149 –159.\nCrossRef Medline\nBinkofski F, Buxbaum LJ (2013) Two action systems in the human brain.\nBrain Lang 127:222–229.CrossRef Medline\nBoronat CB, Buxbaum LJ, Coslett HB, Tang K, Saffran EM, Kimberg DY,\nDetre JA (2005) Distinctions between manipulation and function\nknowledge of objects: evidence from functional magnetic resonance im-\naging. Brain Res Cogn Brain Res 23:361–373.\nCrossRef Medline\nBuxbaum LJ, Kale´nine S (2010) Action knowledge, visuomotor activation,\nand embodiment in the two action systems. Ann N Y Acad Sci 1191:201–\n218.\nCrossRef Medline\nCavina-Pratesi C, Monaco S, Fattori P, Galletti C, McAdam TD, Quinlan DJ,\nGoodale MA, Culham JC (2010) Functional magnetic resonance imag-\ning reveals the neural substrates of arm transport and grip formation in\nreach-to-grasp actions in humans. J Neurosci 30:10306 –10323.\nCrossRef\nMedline\nChoi SH, Na DL, Kang E, Lee KM, Lee SW, Na DG (2001) Functional mag-\nnetic resonance imaging during pantomiming tool-use gestures. Exp\nBrain Res 139:311–317.\nMedline\nCulham JC, Danckert SL, DeSouza JF, Gati JS, Menon RS, Goodale MA\n(2003) Visually guided grasping produces fMRI activation in dorsal but\nnot ventral stream brain areas. Exp Brain Res 153:180 –189.\nCrossRef\nMedline\nEickhoff SB, Stephan KE, Mohlberg H, Grefkes C, Fink GR, Amunts K, Zilles\nK (2005) A new SPM toolbox for combining probabilistic cytoarchitec-\ntonic maps and functional imaging data. Neuroimage 25:1325–1335.\nCrossRef Medline\nFrey SH (2008) Tool use, communicative gesture and cerebral asymmetries\nin the modern human brain. Philos Trans R Soc Lond B Biol Sci 363:\n1951–1957.\nCrossRef Medline\nGallivan JP, McLean DA, Valyear KF, Pettypiece CE, Culham JC (2011) De-\ncoding action intentions from preparatory brain activity in human\nparieto-frontal networks. J Neurosci 31:9599 –9610.\nCrossRef Medline\nGallivan JP, McLean DA, Valyear KF, Culham JC (2013a) Decoding the\nneural mechanisms of human tool use. Elife 2:e00425.CrossRef Medline\nGallivan JP, McLean DA, Flanagan JR, Culham JC (2013b) Where one hand\nmeets the other: limb-specific and action-dependent movement plans\ndecoded from preparatory signals in single human frontoparietal brain\nareas. J Neurosci 33:1991–2008.\nCrossRef Medline\nGlover S, Miall RC, Rushworth MF (2005) Parietal rTMS disrupts the initi-\nation but not the execution of on-line adjustments to a perturbation of\nobject size. J Cogn Neurosci 17:124 –136.\nCrossRef Medline\nGlover S, Wall MB, Smith AT (2012) Distinct cortical networks support the\nplanning and online control of reaching-to-grasp in humans. Eur J Neu-\nrosci 35:909 –915.\nCrossRef Medline\nGoldenberg G, Spatt J (2009) The neural basis of tool use. Brain 132:1645–\n1655. CrossRef Medline\nGre`zes J, Tucker M, Armony J, Ellis R, Passingham RE (2003) Objects auto-\nmatically potentiate action: an fMRI study of implicit processing. Eur\nJ Neurosci 17:2735–2740.\nCrossRef Medline\nGrill-Spector K, Malach R (2004) The human visual cortex. Annu Rev Neu-\nrosci 27:649 – 677.CrossRef Medline\nGrol MJ, Majdandziæ J, Stephan KE, Verhagen L, Dijkerman HC, Bekkering\nH, Verstraten FA, Toni I (2007) Parieto-frontal connectivity during vi-\nsually guided grasping. J Neurosci 27:11877–11887.\nCrossRef Medline\nHermsdo¨rfer J, Terlinden G, Mu¨hlau M, Goldenberg G, Wohlschla¨ger M (2007)\nNeural representations of pantomimed and actual tool use: evidence from an\nevent-related fMRI study. Neuroimage 36 [Suppl 2]:T109 –T118.\nImazu S, Sugio T, Tanaka S, Inui T (2007) Differences between actual and\nimagined usage of chopsticks: an fMRI study. Cortex 43:301–307.\nCrossRef Medline\nInoue K, Kawashima R, Sugiura M, Ogawa A, Schormann T, Zilles K, Fukuda\nH (2001) Activation in the ipsilateral posterior parietal cortex during\ntool use: a PET study. Neuroimage 14:1469 –1475.\nCrossRef Medline\nJacobs S, Danielmeier C, Frey SH (2010) Human anterior intraparietal and\nventral premotor cortices support representations of grasping with the\nhand or a novel tool. J Cogn Neurosci 22:2594 –2608.\nCrossRef Medline\nJohnson-Frey SH, Maloof FR, Newman-Norlund R, Farrer C, Inati S, Grafton\nST (2003) Actions or hand-object interactions? Human inferior frontal\ncortex and action observation. Neuron 39:1053–1058.\nCrossRef Medline\nBrandi et al.• Neural Correlates of Planning and Executing Actual Tool Use J. Neurosci., September 24, 2014 • 34(39):13183–13194 • 13193\nJohnson-Frey SH, Newman-Norlund R, Grafton ST (2005) A distributed\nleft hemisphere network active during planning of everyday tool use skills.\nCereb Cortex 15:681– 695.\nCrossRef Medline\nKale´nine S, Buxbaum LJ, Coslett HB (2010) Critical brain regions for action\nrecognition: lesion symptom mapping in left hemisphere stroke. Brain\n133:3269 –3280.\nCrossRef Medline\nKro´ liczak G, Frey SH (2009) A common network in the left cerebral hemi-\nsphere represents planning of tool use pantomimes and familiar intransitive\ngestures at the hand-independent level. Cereb Cortex 19:2396 –2410.\nCrossRef Medline\nLewis JW (2006) Cortical networks related to human use of tools. Neuro-\nscientist 12:211–231.CrossRef Medline\nMarangon M, Jacobs S, Frey SH (2011) Evidence for context sensitivity of\ngrasp representations in human parietal and premotor cortices. J Neuro-\nphysiol 105:2536 –2546.\nCrossRef Medline\nMartin K, Jacobs S, Frey SH (2011) Handedness-dependent and -independent\ncerebral asymmetries in the anterior intraparietal sulcus and ventral premo-\ntor cortex during grasp planning. Neuroimage 57:502–512.\nCrossRef\nMedline\nMilner AD, Goodale MA (2008) Two visual systems re-viewed. Neuropsy-\nchologia 46:774 –785.Medline\nMoll J, de Oliveira-Souza R, Passman LJ, Cunha FC, Souza-Lima F, An-\ndreiuolo PA (2000) Functional MRI correlates of real and imagined\ntool-use pantomimes. Neurology 54:1331–1336.\nCrossRef Medline\nMonaco S, Cavina-Pratesi C, Sedda A, Fattori P, Galletti C, Culham JC\n(2011) Functional magnetic resonance adaptation reveals the involve-\nment of the dorsomedial stream in hand orientation for grasping. J Neu-\nrophysiol 106:2248 –2263.\nMedline\nMonaco S, Chen Y, Medendorp WP, Crawford JD, Fiehler K, Henriques DY\n(2014) Functional magnetic resonance imaging adaptation reveals the\ncortical networks for processing grasp-relevant object properties. Cereb\nCortex 24:1540 –1554.\nMedline\nOldfield RC (1971) The assessment and analysis of handedness: the Edin-\nburgh inventory. Neuropsychologia 9:97–113.CrossRef Medline\nPeeters RR, Rizzolatti G, Orban GA (2013) Functional properties of the left\nparietal tool use region. Neuroimage 78:83–93.Medline\nRamayya AG, Glasser MF, Rilling JK (2010) A DTI investigation of neural\nsubstrates supporting tool use. Cereb Cortex 20:507–516. CrossRef\nMedline\nRanderath J, Goldenberg G, Spijkers W, Li Y, Hermsdo¨rfer J (2010) Differ-\nent left brain regions are essential for grasping a tool compared with its\nsubsequent use. Neuroimage 53:171–180.\nCrossRef Medline\nRizzolatti G, Matelli M (2003) Two different streams form the dorsal visual\nsystem: anatomy and functions. Exp Brain Res 153:146 –157.CrossRef\nMedline\nRosenbaum DA, Jorgensen MJ (1992) Planning macroscopic aspects of\nmanual control. Hum Mov Sci 11:61– 69.CrossRef\nSeghier ML (2008) Laterality index in functional MRI: methodological is-\nsues. Magn Reson Imaging 26:594 – 601.Medline\nStriemer CL, Chouinard PA, Goodale MA (2011) Programs for action in\nsuperior parietal cortex: a triple-pulse TMS investigation. Neuropsycho-\nlogia 49:2391–2399.CrossRef Medline\nValyear KF, Culham JC (2010) Observing learned object-specific functional\ngrasps preferentially activates the ventral stream. J Cogn Neurosci 22:\n970 –984.\nCrossRef Medline\nValyear KF, Cavina-Pratesi C, Stiglick AJ, Culham JC (2007) Does tool-\nrelated fMRI activity within the intraparietal sulcus reflect the plan to\ngrasp? Neuroimage 36 [Suppl 2]:T94 –T108.\nValyear KF, Gallivan JP, McLean DA, Culham JC (2012) fMRI repetition\nsuppression for familiar but not arbitrary actions with tools. J Neurosci\n32:4247– 4259.\nMedline\nvan Elk M, Viswanathan S, van Schie HT, Bekkering H, Grafton ST (2012)\nPouring or chilling a bottle of wine: an fMRI study on the prospective\nplanning of object-directed actions. Exp Brain Res 218:189 –200.\nCrossRef Medline\nVerhagen L, Dijkerman HC, Medendorp WP, Toni I (2012) Cortical dy-\nnamics of sensorimotor integration during grasp planning. J Neurosci\n32:4508 – 4519.\nCrossRef Medline\nVerhagen L, Dijkerman HC, Medendorp WP, Toni I (2013) Hierarchical\norganization of parietofrontal circuits during goal-directed action. J Neu-\nrosci 33:6492– 6503.\nCrossRef Medline\nVingerhoets G (2008) Knowing about tools: neural correlates of tool famil-\niarity and experience. Neuroimage 40:1380 –1391.CrossRef Medline\nVingerhoets G, Acke F, Vandemaele P, Achten E (2009) Tool responsive\nregions in the posterior parietal cortex: effect of differences in motor goal\nand target object during imagined transitive movements. Neuroimage\n47:1832–1843.\nCrossRef Medline\nVingerhoets G, Vandekerckhove E, Honore´ P, Vandemaele P, Achten E\n(2011) Neural correlates of pantomiming familiar and unfamiliar tools:\naction semantics versus mechanical problem solving? Hum Brain Mapp\n32:905–918.\nCrossRef Medline\nVingerhoets G, Nys J, Honore´ P, Vandekerckhove E, Vandemaele P (2013)\nHuman left ventral premotor cortex mediates matching of hand posture\nto object use. PLoS One 8:e70480.\nCrossRef Medline\nWadsworth HM, Kana RK (2011) Brain mechanisms of perceiving tools\nand imagining tool use acts: a functional MRI study. Neuropsychologia\n49:1863–1869.\nCrossRef Medline\nWager TD, Nichols TE (2003) Optimization of experimental design in\nfMRI: a general framework using a genetic algorithm. Neuroimage 18:\n293–309.\nCrossRef Medline\nWilke M, Lidzba K (2007) LI-tool: a new toolbox to assess lateralization in\nfunctional MR-data. J Neurosci Methods 163:128 –136.CrossRef Medline\nWilke M, Schmithorst VJ (2006) A combined bootstrap/histogram analysis\napproach for computing a lateralization index from neuroimaging data.\nNeuroimage 33:522–530.\nCrossRef Medline\nWurm MF, Cramon DY, Schubotz RI (2012) The context-object-\nmanipulation triad: cross talk during action perception revealed by fMRI.\nJ Cogn Neurosci 24:1548 –1559.\nCrossRef Medline\nXia M, Wang J, He Y (2013) BrainNet Viewer: a network visualization tool\nfor human brain connectomics. PLoS One 8:e68910.CrossRef Medline\n13194 • J. Neurosci., September 24, 2014• 34(39):13183–13194 Brandi et al. • Neural Correlates of Planning and Executing Actual Tool Use",
  "topic": "Neural correlates of consciousness",
  "concepts": [
    {
      "name": "Neural correlates of consciousness",
      "score": 0.7007634043693542
    },
    {
      "name": "Psychology",
      "score": 0.5134474039077759
    },
    {
      "name": "Computer science",
      "score": 0.428165465593338
    },
    {
      "name": "Cognitive psychology",
      "score": 0.3933185636997223
    },
    {
      "name": "Neuroscience",
      "score": 0.3885992169380188
    },
    {
      "name": "Artificial intelligence",
      "score": 0.36445897817611694
    },
    {
      "name": "Cognition",
      "score": 0.09817111492156982
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I2802619606",
      "name": "Klinikum rechts der Isar",
      "country": "DE"
    },
    {
      "id": "https://openalex.org/I8204097",
      "name": "Ludwig-Maximilians-Universität München",
      "country": "DE"
    },
    {
      "id": "https://openalex.org/I62916508",
      "name": "Technical University of Munich",
      "country": "DE"
    }
  ],
  "cited_by": 156
}