{
  "title": "Understanding Moisture Dynamics and Its Effect on the Dielectric Response of Transformer Insulation",
  "url": "https://openalex.org/W2047762225",
  "year": 2015,
  "authors": [
    {
      "id": "https://openalex.org/A2006287882",
      "name": "Yi Cui",
      "affiliations": [
        "Queensland University of Technology",
        "University of Queensland"
      ]
    },
    {
      "id": "https://openalex.org/A2098128952",
      "name": "Hui Ma",
      "affiliations": [
        "University of Queensland",
        "Queensland University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2439044414",
      "name": "Tapan Saha",
      "affiliations": [
        "University of Queensland",
        "Queensland University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2075377855",
      "name": "Chandima Ekanayake",
      "affiliations": [
        "University of Queensland",
        "Queensland University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2006287882",
      "name": "Yi Cui",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2098128952",
      "name": "Hui Ma",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2439044414",
      "name": "Tapan Saha",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2075377855",
      "name": "Chandima Ekanayake",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2120550347",
    "https://openalex.org/W1994563610",
    "https://openalex.org/W2154027848",
    "https://openalex.org/W2067073610",
    "https://openalex.org/W2140723035",
    "https://openalex.org/W2108110938",
    "https://openalex.org/W2142158067",
    "https://openalex.org/W2052394528",
    "https://openalex.org/W1847603572",
    "https://openalex.org/W2164685145",
    "https://openalex.org/W2047985533",
    "https://openalex.org/W232893681"
  ],
  "abstract": "Dielectric response measurement has recently been adopted by utilities for evaluating moisture content in cellulose insulation (paper and pressboard) of transformers. Moisture distribution is highly dependent on temperature. Since the temperature inside a transformer may change during the dielectric response measurement, the moisture in the transformer's cellulose and oil insulation can hardly attain an equilibrium state. Instead, moisture dynamics exist inside the transformer: 1) cellulose absorbs (desorbs) moisture from (to) oil with the changes in temperature and 2) moisture migrates inside cellulose due to a moisture gradient. This paper investigates moisture dynamics and its effect on the dielectric response of a transformer's cellulose insulation. It proposes a distributed parameter model to reveal the correlation between moisture distribution (under nonequilibrium conditions due to thermal transients) and dielectric response parameters (dielectric losses and permittivity) of cellulose insulation. It then estimates these parameters under moisture nonequilibrium conditions. The accelerated ageing and moisture diffusion experiments are conducted on a prototype transformer to verify the proposed model. The methodology developed in this paper can help the proper interpretation of dielectric response measurement of field transformers under thermal transients.",
  "full_text": "Understanding Moisture Dynamics and Its Effect on the Dielectric\nResponse of Transformer Insulation\nAuthor\nCui, Yi, Ma, Hui, Saha, Tapan, Ekanayake, Chandima\nPublished\n2015\nJournal Title\nIEEE Transactions on Power Delivery\nVersion\nAccepted Manuscript (AM)\nDOI\n10.1109/TPWRD.2015.2426199\nRights statement\n© 2015 IEEE. Personal use of this material is permitted. Permission from IEEE must be\nobtained for all other uses, in any current or future media, including reprinting/republishing this\nmaterial for advertising or promotional purposes, creating new collective works, for resale or\nredistribution to servers or lists, or reuse of any copyrighted component of this work in other\nworks.\nDownloaded from\nhttp://hdl.handle.net/10072/99103\nGriffith Research Online\nhttps://research-repository.griffith.edu.au\n 1 \n  \nAbstract— Dielectric response measurement has recently been \nadopted by utilities for evaluating moisture content in cellulose \ninsulation (paper and pressboard) of  transformers. Moisture \ndistribution is highly dependent on temperature. Since  the \ntemperature inside a  transformer may change during the  \ndielectric response measurement, the moisture in the  \ntransformer’s cellulose and oil insulation can hardly attain a n \nequilibrium state. Instead, moisture dynamics exist  inside the \ntransformer: (1) cellulose absorbs (desorbs) moisture from (to) oil \nwith the changes in temperature; and (2) moisture migrates inside \ncellulose due to a moisture gradient. This paper  investigates \nmoisture dynamics and its effect on dielectric response of a \ntransformer’s cellulose insulation. It proposes a distributed \nparameter model to reveal  the correlation between moisture \ndistribution (under non-equilibrium conditions  due to  thermal \ntransients) and dielectric response parameters ( dielectric losses \nand permittivity) of cellulose insulation . It then  estimates these \nparameters under moisture non-equilibrium conditions . The \naccelerated ageing and moisture diffusion experiments are \nconducted on a prototype transformer to verify the proposed \nmodel. The methodology developed in this paper can help the \nproper interpretation of dielectric response measurement of field \ntransformers under thermal transients.    \n \nIndex Terms —Cellulose, dielectric response, insulation, \nmoisture diffusion, moisture dynamics, oil, transformer. \nI.  INTRODUCTION \nLife expectancy of a power transformer is largely determined \nby the ageing condition of its cellulose insulation. Moisture is \none of the most harmful agents for cellulose insulation. It can \naccelerate the cellulose ageing rate and reduce both dielectric \nand mechanical strength of cellulose insulation [1]. Therefore, it \nis of great interest for utilities to estimate moisture content in \ncellulose insulation of transformers.  \n Moisture content in cellulose can be directly measured by the \nKarl Fischer T itration (KFT) method. However, it requires  \ncollecting paper samples from a transformer’s winding, which is \ndifficult in practice. A n a lternative approach is through \nmeasuring the moisture content of an oil sample and then \ndetermining the moisture content in the cellulose from \nequilibrium charts [2-4]. This approach assumes an equilibrium \nstate of moisture distribution in the transformer. However, it is \nhard to attain  an equilibrium state in the transformer and  any \n                                                           \nY. Cui, H. Ma, T. Saha and C. Ekanayake  are with School of Information \nTechnology and Electrical Engineering , The University of Queensland ，\nBrisbane, Australia (e-mail: y.cui3@uq.edu.au, huima@itee.uq.edu.au, \nsaha@itee.uq.edu.au, chandima@uq.edu.au). \nvariation in temperature tends to change  the moisture \ndistribution in cellulose and oil [5]. This can lead to  an \ninaccurate estimation of moisture in the cellulose [6]. \nThe utilities have widely adopted the dielectric response \nmethod for estimating moisture content in transformer s’ \ncellulose insulation. During dielectric response measurement, \nthe transformer is removed from the grid and thus th e \ntemperature inside the transformer continuously drops. \nConsequently, during the course of the dielectric response \nmeasurement, moisture migrate s between cellulose and oil.  \nThis will influence the interpretation of the results of dielectric \nresponse measurement and affect the accuracy of moisture \nestimation in the transformer’s cellulose insulation. As an \nexample, the authors made two dielectric measurements on one \nutility’s transformer. During the first measurement a moisture \ncontent of 2.9 % at 30 °C top- oil temperature was recorded. \nThe second measurement commenced immediately after, and \nrecorded 3.6 % at 26.5 °C. Therefore, f or an accurate \nestimation of moisture in cellulose insulation  based on  \ndielectric response measurement , it is necessary to investigate \nthe correlation s between moisture dynamics and dielectric \nresponse parameters (i.e. dielectric loss and permittivity) of a \ntransformers’ insulation. \nThis paper is aimed at understanding temperature dependent \nmoisture dynamics and its effect on the dielectric response of the \ncellulose insulation of transformers. A distributed parameter \nmodel is proposed to explore correlations between moisture \ndistribution under non- equilibrium conditions and dielectric \nresponse of cellulose insulation. By using this model, dielectric \nlosses and permittivity of cellulose insulation are estimated when a \ntransformer is under temperature variation and consequent \nmoisture non-equilibrium. To verify the methodology developed in \nthis paper, extensive ageing and moisture diffusion experiments \nare performed on a prototype transformer. \nII.  M\nOISTURE IN TRANSFORMER’S INSULATION SYSTEM   \nA.  Moisture Dynamics in Cellulose and Oil Insulation \nDue to moisture ingress from the environment and cellulose \ndegradation, moisture is present in a trans former. During the \nnormal operation of a transformer, most moisture is affiliated \nwith its cellulose insulation. Water generally has low solubility \nin transformer oil. With an increase in temperature, the water \nsolubility in oil can be significantly increa sed. On the other \nhand, free water can be formed  if the moisture in oil exceeds \nthe saturation level.  \nUnderstanding Moisture Dynamics and Its Effect \non Dielectric Response of Transformer Insulation  \nYi Cui, St. Member, IEEE, Hui Ma, Member, IEEE, Tapan Saha, Senior Member, IEEE, Chandima \nEkanayake, Member, IEEE \n 2 \nFor an in- service transformer, it can absorb water from \nenvironment and its oil can contain some amount of water. The \ntransformer’s oil -cellulose insulation system is in an \nequilibrium state if the partial pressure of water in oil equals \nthe partial pressure of water in cellulose. When the partial \npressures in oil and cellulose become different, cellulose \nabsorbs/desorbs water from/to oil to maintain the e quilibrium. \nMoreover, moisture diffusion occurs inside cellulose insulation \ndue to a moisture gradient. \nB.  Estimation of Moisture Contents in Cellulose Insulation  \nOver the past twenty years, extensive studies have been \nperformed for estimating moisture content in cellulose insulation. \nMost of t hese studies are focused on moisture diffusion us ing \nFick’s second law [7] in one dimension as (1) \n \n( ,) ( ,)W xt W xt Dtx x\n∂ ∂∂ = ∂∂ ∂ \n  (1) \nwhere ( ,)W xt  is the moisture content of cellulose at position x \nand time  t. D denotes the diffusion coefficient and is usually \nnot a constant but depends on both moisture concentration and \ntemperature. By conducting laboratory  experiments, \nresearchers have derived diffusion coefficient s for different \ntypes of cellulose (i.e. paper or pressboard, non -impregnated \nor impregnated, aged or non -aged, paper/pressboard with \ndifferent thickness ) under different local moisture \nconcentration and temperatures [ 2-9]. However, certain \nvariations may exist in these derived diffusion coefficients \nsince the experiments were conducted with different setups \nand conditions . Such variations  can pose difficulties for \nutilities on selecting the correct coefficient for a moisture \ncontent estimation in their transformers. \nGarcía et al.  proposed a moisture -in-oil model for power \ntransformer monitoring  [8]. The model considered the \nequilibrium relations between oil and cellulose, the moisture \ndynamics before attaining the steady-state equilibrium and the \nincrease of the amount of moisture due to cellulose ageing. \nHowever, it is n ot clear whether moisture in cellulose can be \nderived from this model.  \nOriginally proposed by Piper and Fessler [9], the isothermal \napproach has also attracted the attention of some researchers  \n[10]. This approach use s temperature and vapor pressure to \nderive the local moisture content in cellulose  from the \nmeasurement of moisture-in-oil sensor. However, the sensor’s \nlocation has a large influence on the moisture estimation. Given \nthe complexity of a transformer’s construction  and different \ntypes of cellulose used at different layers and locations inside the \ntransformer, a sufficient number of moisture-in-oil sensors need \nto be installed to provide an accurate estimation of moisture in \nthe cellulose insulation of a transformer.  \nAn alternative technique for estimating moisture content in \ncellulose is the dielectric response method. It measures several \ndielectric response parameters, which are influenced by \ntemperature, moisture content and the ageing condition of the \ncellulose insulation in a transformer. By using a database built \nbased on well -defined pressboard samples with different \ntemperatures and moisture contents, it is possible to estimate \nthe moisture content in cellulose insulation in a transformer. \nThe next section will provide a brief review o n dielectric \nresponse technique for moisture content estimation. \nIII.  D\nIELECTRIC RESPONSE OF TRANSFORMER INSULATION \nA.  Dielectric Response in Frequency Domain \nWhen a dielectric material is imposed by an alternating \nelectric field it\nmE Ee ω= , the complex dielectric displacement \nin this material becomes (2) \n 0\n0 00 0(t) (t t )\nt\nitit\nmmD Ee f Ee d t ωωee e∞\n−∞\n= +− ∫\n   (2) \nwhere 0e denotes t he permittivity of vacuum, e∞ denotes  the \nhigh frequency relative permittivity  of the material  and f(t) is \nthe response function of the material which  monotonically \ndecreases with time.  \nThe Fourier transform of the response function ()ft  yields \nthe complex susceptibility, ()χω   \n '\"\n0\n() ( ) () () () itf f t e dt jωω χω χ ω χ ω\n∞\n−= = = −∫\n    (3) \nThe real and the imaginary parts of the complex susceptibility \nare not independent from each other since they are both \ngenerated by the same  response function ()ft  . They can be \nregarded as the cosine and sine transforms of the response \nfunction respectively. \nThe total current density ()j ω  in the dielectric material \nunder ()E ω  excitation can therefore be expressed as \n '\"\n00() [ () ( / () ) ]() dc\ncapacitive part resistive part\nji i Eω ωe e χ ω s e ω χ ω ω∞= +− + \n)' )()) )'))) (  (4) \nwhere dcs  denotes dc conductivity of the material. This \nexpression shows that the current is composed of a resistive part \nand a capacitive part. The resisti ve part represents the energy \nlosses in the material, which are dominated  by two different \nmechanisms, one is due to dc conduction (movement of free \ncharges) and the other is because of  relaxation losses (re -\norientation of bonded charges). The capacitive part is associated \nwith the capacitance of the material. \nIn many situations, it is more convenient to use the complex \npermittivity instead of the complex susceptibility. I t can be \ndefined as follows \n '\"\n0() [() () ]()ji i Eω ω e e ω e ω ω= −    (5) \nwhere ''() ()e ω e χω∞= +  and \"\"\n0() / () dce ω s eω χ ω= +  . \nThe above equations show that the dc conductivity dcs , the \nhigh frequency component of the relative permittivity e∞ , and \nthe comp lex dielectric susceptibility ()χω , characterise the \ndielectric ma terial in the frequency domain . It is possible to \ndetermine these parameters  by measuring the magnitude and \n 3 \nphase angle of the resultant currents when the material is \nsubjected to an alternating voltage under different frequencies. \nB.  Dielectric Response Measurement for Moisture Estimation \nFor estimating moisture content in a transformer , the \ngeometric information of  the winding insulation of the \ntransformer under investigation is needed. For a core type \ntransformer the main insulation usually consists of a number of \ncylindrical shells of pressboard barriers, separated by axial \nspacers. A so -called X-Y model is widely used to represent \nsuch a structure [6]. By making use of a database and X -Y \nmodel, an algorithm can be implemented to find the  best fit \nbetween the response of the model and the measured response \nof the transformer . Th is result can then be used for moisture \nestimation of a transformer’s cellulose insulation. \nThe above moisture estimation assumes the transformer \nunder test i s kept at a constant temperature and attains \nmoisture equilibrium.  However, equilibrium is difficult to \nattain in the transfo rmer during measurement. It is therefore \nnecessary to investigate the correlation between temperature \ndependent moisture dynamics and the dielectric response of \ncellulose insulation.  This will pave a way for properly \nevaluating moisture in cellulose insulation of the transformer  \nonsite, which is under a temperature transient. \nIn the next section a distributed parameter model is \nproposed for studying the dielectric behavior of oil and \ncellulose insulation under non- equilibrium and non- uniform \nmoisture distribution in a transformer.   \nIV.   DISTRIBUTED PARAMETER DIELECTRIC RESPONSE MODEL \nThe proposed distributed model is shown in Fig. 1. In this \nmodel, the pressboard with thickness \n  is sliced into N layers \n(\n ). Assuming moisture in the transformer is in a \nnon-equilibrium state, the moisture is not uniformly distributed \nalong the thickness of the cellulose insulation . Consequently, \neach layer of  pressboard has a different dielectric loss  \n  and \npermittivity\n . \nThe impedance \n  of the whole piece of the pressboard \nin the frequency domain can be written as   \n \n   (6) \nwhere \n  denotes the total number of sliced layers of the \npressboard, \n  and \n  are the impedance and \nadmittance of the i-th layer of the pressboard respectively. \n \nFig. 1 Distributed model for modelling dielectric response of pressboard  \nIn Fig. 1, each layer of p ressboard can be represented by a \nparallel circuit consisting of a capacitor and a resistor. For the \ni-th layer of the pressboard, its admittance can be written as \n \n   (7) \nAccording to frequency domain dielectric spectroscopy \ntheory [11], (6) can be rewritten as (8) \n \n   (8) \nwhere \n  denotes the total area of the cylindrical pressboard, \n is the  thickness of each slic ed layer of the pressboard , \n  \ndenotes the real part of complex permittivity of the i -th layer \nof pressboard and\n  represents the summation of conductive \nand polarization losses of the i-th layer of pressbo ard (the loss \nof the whole piece of pressboard is shown in (5)).  \nAssuming that the above pressboard can be sliced infinitely \nthin, (8) can be rewritten as (9) \n  (9) \nIn dielectric response measurement, the phases and \nmagnitudes of the applied AC voltage and resultant current can \nbe measured. Subsequently, the impedance \n  of the \npressboard can be  obtained. Then the complex capacitance of \nthe pressboard can be calculated by using (10) \n \n        (10) \nCombining (7) and (10), the c omplex c apacitance of the \npressboard is expressed in (11) \n \n          (11) \nOn the other hand, from (9) and ( 10) the complex \ncapacitance of the pressboard can also be directly written as  \n                \n             (12) \nBy comparing (11) and (12), it can be expressed as  \n \n   (13) \nEq. (13)  reveals that \n  in (8) equals the real part of \npermittivity \n  while \n  in (8) can be calculated from the \nimaginary part of permittivity\n . Both the real and imaginary \nparts of permittivity of pressboard can be obtained from the \nresults of dielectric fre quency response measurements. T he \nabove distributed model will be used to investigate the \nmoisture dynamics effect on dielectric response measurement  \nin the following sections. \nV.  EXPERIMENTAL SETUP  \nA.  Prototype Transformer Configuration \nA prototype transformer  is used for experimental study in \nthis paper. It is a single phase transformer rated at 5 kVA with \n240 V secondary and 2.2 kV  primary. Since the losses due to \ncurrent flowing through the transformer’s winding may not \ngenerate the required temperature, a h eater was installed at the \n 4 \nbottom of the transformer. This also helped to control the \nprototype transformer’s temperature to simulate different \nthermal conditions for the accelerated ageing and moisture \ndiffusion experiments . Fig. 2 shows the geometry of the \ninsulation of the prototype transformer.  \n     \n  \nFig. 2 Insulation geometry of the prototype transformer \nIn the prototype transformer , t he cellulose insulation \nincludes hybrid Diamond Dotted Paper (DDPP), Moul dable \npressboard (MPB) and Spacers All Round (SAR) and they are \nimmersed in transformer oil ( Nynas Libra ). The temperature \nclass of the transformer’s paper insulation is A. The ratio in X-\nY model is calculate d as 38%, 16%XY= = , where X  is the \nlumped sum of the thickness of all barriers in the duct divided \nby the duct width; Y is the total width of all spacers divided by \nthe total length of the periphery of the duct [6].   \nB.  Moisture Dynamics Experiments  \nAfter the commission of the prototype transformer, it was \nsubjected to both electrical and thermal loading to attain a \ncertain degree of ageing of its cellulose insulation (equivalent to \n34 years of life consumption  based on the degree of \npolymerization (DP) measurement  of this transformer ). \nElectrical loading was imposed by using a load ba nk with \nmaximum power capacity of 6 kW. The prototype transformer \nwas kept at 110 ºC (using the abovementioned heater) with 30A \nload current for an effective time period equal to 35 days (the \ntransformer was kept at 50 ºC during the night and weekends).  \nAfter 35 days of accelerated electrical and thermal ageing \nof the prototype transformer , experiments were arranged to \nstudy the moisture dynamics and its  effect on dielectric \nresponse of the cellulose insulation of the transformer. In the \nexperiments, a sinusoidal temperature profile was  imposed on \nthe prototype transformer by using the above mentioned heater. \nThe prototype transformer is sealed from the atmosphere.  A \nmoisture-in-oil sensor (Vaisala MMT 330  [12]) was installed \nin the prototype transformer. The sensor’s tip was close to the  \ncellulose insulation of the winding. By using this setup , the \nmoisture at the interface between oil and cellulose insulation \ncould be continuously monitored . Temperature was also \nmeasured by this sensor. \nThe moisture dynamics experiments were conducted in \nthree steps: \n(1) The transformer was kept at  a constant temperature \n(55 °C) for one week to let it attain moisture equilibrium.  \n(2) The transformer was subjected to a sinusoidal \ntemperature profile (Fig. 3) for one week. The period of one \ncycle sinusoidal temperature was 24 hours  with the highest \ntemperature of 80 °C and the lowest temperature of 30 °C. \n(3) The transformer was kept at a constant temperature \n(55 °C) for another one week to let it attain moisture equilibrium.  \nDielectric response measurement was then performed. \nFig. 3 presents one complete cycle of moisture \nmeasurements under sinusoidal temperature. In the figure , the \ntemperature (in green), moisture in oil ( in red) and water \nactivity (in blue, is defined as the ratio of the partial pressure \nof water in the material  and the saturated vapor pressure of \npure water at the same temperature [10]) were directly \nobtained from the above moisture-in-oil sensor.  \n0 50 100 150 200 250 300 350 400\n240\n250\n260\n270\n280\n290\n300\n310\n320\n330\n340\n350\n360\n \nTemperature(K) \nTime (h)\nTemperature\nMoisture in oil\nWater activity Moisture in paper\n10\n15\n20\n25\n30\n35\n40\n45\n50\n55\n Moisture in oil(ppm)\n0\n10\n20\n30\n40\n50\n Moisture in paper(%)\n0.00\n0.05\n0.10\n0.15\n0.20\n0.25\n0.30\n0.35\n0.40\n0.45\n0.50\n0.55\n0.60\n0.65\n0.70\n0.75\n0.80\n0.85\n Water activity\n \nFig. 3 Sinusoidal variation of temperature (green), water activity in oil (blue), \nmoisture in oil (red , in ppm ) and water content at the cellulose surface in \ncontact with oil (black, in percentage) of the prototype transformer \nThe moisture concentration  at the cellulose surface in \ncontact with oil (in black in Fig. 3) was obtained using Fessler \n[9] equation as \n                   7 0.6685 4275.6/2.173 10 T\nvW Pe −= ×× ×   (14) \nwhere W  is the concentration of absorbed water as the ratio of \nthe mass of water to the mass of dry cellulose, vP  is the vapour \npressure of water in atm and T  is the temperature in Kelvin.  \nVI.  MODELLING OF MOISTURE DYNAMICS IN CELLULOSE \nThis section investigates the above sinusoidal temperature \ndriven moisture d ynamics in cellulose. T he time of moisture \ndiffusion inside cellulose is much larger than that of moisture \nmigration at the cellulose’s surface contacting oil. Therefor e, \nthis section mainly focuses on moisture diffusion in cellulose.  \n This section firstly model s moisture diffusion in  un-aged \npressboards. Then it investigates moisture diffusion in  the \nprototype transformer based on the experiments in Section V.  \nA.  Modelling Moisture Diffusion in Pressboard \nIt is assumed an un-aged dry pressboard (1 mm in thickness \nwith less than 0.5% water content) has one side of its surface \ncontacting with a large volume of oil, which contains a \nsufficient amount of water. When the press board is immersed \ninto the oil, the partial pressure of water in oil is significantly \nlarger than that in pressboard. Thus, the pressboard absorbs \nwater from the oil when it is just immersed into the oil.  The \nother side of the pressboard surface is sealed by an electrode \nfor dielectric response measurement.  The whole test cell is \nconsidered as a closed system. Under sinusoidal temperature  \n 5 \nvariation, the moisture content at this side of the surface \nfollows the curve in black shown in Fig. 3.  \nThe initial values of moisture content and boundary \ncondition of this pressboard is     \n 00( , 0) 0.5\n( 0 ,) ( ,) / 0 s\nW xt W W\nWx t W Wx l t x\n= = <\n= = ∂ = ∂=\n，\n，\n    (15) \nwhere 0W  is the moisture content in the whole bulk of un-aged \npressboards and is assumed less than 0.5%  initially. sW  is the \nconcentration of moisture at the interface between pressboard \nand oil and it varies as sinusoidal shape (black curve in Fig. 3).  \nBy solving Fick’s second law  (1) and (15), th e moisture \ndistribution along the thickness of  the pressboard under \nsinusoidal temperature profile from the time instances t = 1 to 72 \nhours are obtained and depicted in Fig. 4.  \nIt is assumed  that a t t = 0 when the dry and un- aged \npressboard sample was put into the oil tank , there exists a \nsignificant moisture gradient between the oil and the pressboard \nand at their interface vapor pressure of the oil is larger than that \nof the pressboard. Therefore, at t =  0 hour, the pressboard \nabsorbs water from the oil and eventually water moves towards \nthe depth of the pressboard. At the time instance t = 1 hour, there \nexists a large moisture gradient in the pressboard:  moisture \nconcentration at the pressboard surface is 5.7% and only 0.5% at \nother locations away from the surface (Fig. 4(b)). This moisture \ngradient dominates the water migration and water will \ncontinuously move into the pressboard along its thickness for \nsome time though temperature starts to increase.  \nAt the time instances t = 4  and 8 hours, the moisture moves \nfurther into the depth of the pressboard.  The moisture at the \npressboard surface is decreased from 4% to 2 .1% while the \nmoisture in most positions of the pressboard increased to above \n1% from 0.5% (Fig. 4(b)). At the time instance t = 12 hours, the \nmoisture at the surface of the pressboard almost attains uniformity \nof 1.75%. As can be observed from Fig. 4(a), at t = 12 hours the \ntemperature starts to decrease from 80 °C. Th e water in the oil \n(close to the oil-pressboard interface) starts to move towards the \npressboard. Therefore, at the time instances t = 16 and 20 hours, \nthe moisture concentration at the pressboard surface (in contact \nwith oil) increased. The moisture at the pressboard’s surface is \n2.5%, 5.0% for t= 16 and 20 hour s respectively (Fig. 4(c)). The \nmoisture at the pressboard surface reaches its peak of 6.4% at the \ntime instance t = 24 hours. Also the moisture inside the pressboard \nis larger compared to previous time instances  in this first \ntemperature cycle (Figs. 4(b) and 4(c)). \nThe above moisture dynamics are repeated for the next 24 \nhours sinusoidal temperature cycle. It can be seen from Fig. 4(d), \nthe moisture distribution at the surface of the pressboard at the \ntime instances t = 24, 48 and 72 hour s are very close (the \ndifference is less than 0.2%). The difference of moisture in th e \ndepth of the pressboard between t = 24, 48 and 72 hours is about \n0.5%. Such a difference can be explained as follows. \nAfter several cycles of diffusion, the pressboard becomes \nhumid and water migration is mainly dominated by temperature. \nAt low temperature (30 ℃ at time instances t = 24, 48, 72 hours) \nthe slow water molecules’ mobility and strong bond between \ncellulose molecules and water molecules imply that the moisture \nmovement is not able to change its directions immediately when \ntemperature changes. Therefore, a certain amount of moisture  \nmoves “back and forth” at a particular position of pressboard and a \n“standing wave” of moisture distribution can be formed. \nB.  Modelling Moisture Diffusion in Prototype Transformer \nMoisture distribution is not only a  function of temperature \nand moisture gradients but also a  function of mass and \ndimensions of the transformer’s insulation system. Therefore, \nmulti-physics modeling [13] is adopted to investigate moisture  \ndistribution in three dimensions (3D) of the prototype \ntransformer as shown in Fig.  5. It considers the effects of \nelectromagnetic, thermal, fluid flow and moisture migration \nphysics on moisture dynamics in transformers. It especially \ntakes into account t he coupling and interactions of these \nphysics as they collectively influence the moisture dynamics \nand moisture distribution inside the transformer. The  details of \nmulti-physics modeling will be provided in a future paper.  \n           \n7\n6\n5\n4\n3\n2\n1\n0\n        \n0 10 20 30 40 50 60 70 80 90\n1.4\n1.5\n1.6\n1.7\n1.8\n1.9\n2\n2.1\nTime (h)\nAverage moisture concentration(%)\n \n                       (a)                                                              (b) \nFig. 5 Moisture distribution of the prototype transformer (a) 3D moisture \ndistribution  (at time instance t = 72  hours); (b)  average moisture \nconcentration at different time  instances. Transformer was under thermal \ntransients as shown in Fig. 3. \nFig. 5(a) presents the moisture distribution in the prototype \ntransformer at the time instance t = 72 hour s. Based on the 3D \nmoisture distribution results, the average moisture concentration \nof the whole bulk of  cellulose insulation can be calculated \nas ( ),, /averageW W x y z dV V\nW\n= ∫∫∫� , where V is the total bulk \n   \n0 4 8 12 16 20 24 28 32 36 40 44 48\n30\n40\n50\n60\n70\n80\n \n \nTemperature (C)\nTime (h)\n \n     \n0.0 0.2 0.4 0.6 0.8 1.0\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n3.5\n4.0\n4.5\n5.0\n5.5\n6.0\n6.5\n \n \nMoisture concentration (%)\nDepth from surface (mm)\n 1 hour\n 4 hours\n 8 hours\n     \n0.0 0.2 0.4 0.6 0.8 1.0\n1.0\n1.5\n2.0\n2.5\n3.0\n3.5\n4.0\n4.5\n5.0\n \n \nMoisture concentration (%)\nDepth from surface (mm)\n 12 hours\n 16 hours\n 20 hours\n    \n0.0 0.2 0.4 0.6 0.8 1.0\n1.0\n1.5\n2.0\n2.5\n3.0\n3.5\n4.0\n4.5\n5.0\n5.5\n6.0\n6.5\n7.0\n7.5\n \n \nMoisture concentration (%)\nDepth from surface (mm)\n 24 hours\n 48 hours\n 72 hours\n \n                              (a)                                                         (b)                                                         (c)                                                           (d) \nFig. 4 Simulation results of m oisture distribution in an un-aged pressboard (one dimension moisture diffusion)  (a) temperature variation at different time \ninstances  (b)-(d) moisture distribution at different time instances (x=0 refers to the pressboard surface in contact with oil). \n 6 \nvolume of the cellulose insulation and (, ,)W xyz  is the moisture \nconcentration at a particular location of the cellulose insulation.  \nFig. 5(b) presents the calculated average moisture concentration \nof the cellulose insulation at different time instances. It can be \nobserved from Fig. 5(b) that moisture variations in  sinusoidal \nshape are within the range from 1. 45% - 2.0%. The overall \nmoisture of the cellulose insulation of the prototype transformer \nis 1.7 % by taking the average of data in Fig. 5 (b). It has good \nagreement with the result s from the Karl Fischer Titration \nmethod, which indicates 1.5% moisture content in a cellulose \nspecimen collected from the prototype transformer.  \nFig. 6 shows t he moisture distribution in the prototype \ntransformer’s whole bulk cellulose insulation along its radial \ncentreline under different time instances  (temperature varies \naccording to Fig. 3). In Fig. 6 the legend of the vertical axis is in \nppm for moisture concentration in oil and it is in percentage for \nmoisture concentration in cellulose insulation. From Fig. 6 it can \nbe seen that the moisture is not uniformly distributed inside the \ncellulose insulation of the prototype transformer . A l arge \nproportion of the cellulose has a relative ly low moisture level \n(less than 3 %) while the moisture of  the cellulose surface in \ncontact with oil (x = 0 and 0.4 m) may reach up to 5% - 7%. The \nmoisture distribution along the transformer height direction also \nexhibits gradients (Fig. 5 (a)). This is due to the non- uniform \nthermal distribution along the height direction and the existence \nof a fluid flow field inside the prototype transformer.  \n  \nMoisture concentration in cellulose insulation (%)\n \nFig. 6 Moisture distribution of the whole bulk cellulos e insulation in the \nprototype transformer (d = 0.2 m denotes the symmetric line of the cellulose \ninsulation). Temperature varies according to Fig. 3.  \nVII.  ANALYSIS OF MOISTURE DYNAMICS’ EFFECT ON \nDIELECTRIC RESPONSE OF CELLULOSE INSULATION \nBased on the experiments and modeling results provided in \nSections V and VI, this section applies the distributed parameter \nmodel proposed in Section IV to study the moisture dynamics’ \neffect on  dielectric response of cellulos e insulation of the \nprototype transformer. The study is carried out in two steps: \n (1) By using a database built upon the dielectric response \nmeasurements on the prototype transformer  under constant \ntemperature, the distributed model is applied to explore t he \ncorrelations between the cellulose’s position along its thickness \nand the cellulose’s dielectric response parameters (loss and \npermittivity) under uniform moisture distribution conditions.  \n(2) Based on the analysis in step 1, the dielectric response \nof the cellulose insulation in the prototype transformer  under \nmoisture dynamics and temperature transient is estimated. The \nestimation is verified by the experiment s under sinusoidal \ntemperature profile. It needs to be mentioned that the analysis \nin step 1  does not include  the influence of the temperature on \nthe dielectric response. Therefore, the temperature corrections \nwill be conducted (detailed in Section VII C). \nA.  Dielectric Loss of Cellulose Insulation vs. Moisture  \nAfter the prototype transformer attains moisture equilibrium \nand the moisture is uniformly distributed (Section V B, Step 3), \ndielectric frequency response measurement is performed from 1 \nkHz to 1 mHz. Fig. 7 presents both real and imaginary parts of \npermittivity of the cellulose insulation at 50°C with four \ndifferent moisture contents, i.e. 1.08%, 1.37%, 1.61% and \n3.23% in the prototype transformer. It can be seen from Fig.  7 \nthat the imaginary part of permittivity is influenced by moisture \nconcentration. At a particular frequency, the imaginary part of \npermittivity increases when more moisture resides in the \ncellulose insulation.  \n \n1E-3 0.01 0.1 1 10 100 1000\n1\n10\n100\n1000\n1E-3 0.01 0.1 1 10 100 1000\n1E-3\n0.01\n0.1\n1\n10\n100\n \nReal part of permittvity (e')\nFrequency (Hz)\n e'-1.08%\n e'-1.37%\n e'-1.61%\n e'-3.23%\ne''\ne'\n  Imaginary part of permittvity (e'')\n \n \nFrequency (Hz)\n e\"-1.08%\n e\"-1.37%\n e\"-1.61%\n e\"-3.23%\n \nFig. 7 Real (ε’) and i maginary (ε”) parts of permittivity of the prototype \ntransformer insulation under uniform moisture distribution at T = 50 °C \nThe dielectric loss  of cellulose insulation under each \nfrequency with different moisture contents can be obtained from \nFig. 7 and (13), which is shown in Fig. 8 (data points). Suppose \nthe dielectric loss and the moisture can be modelled as \n 1\n1\nWeβδα ⋅=   (16) \nwhere W denotes the moisture concentration  in the cellulose \ninsulation, 1α  and 1β  are parameters, which can be computed \nusing the least squares method. Fig. 8 presents the modelled \ncurves of dielectric loss with respect to moisture contents in the \ncellulose insulation under uniform moisture distribution at 50°C.   \n \n1.2 1.5 1.8 2.1 2.4 2.7 3.0 3.3\n1E-12\n1E-11\n1E-10\n \n \nLoss component\nMoisture concentration(%)\n \n \n 1000Hz\n 10Hz\n 1Hz\n 0.1Hz\n 0.01Hz\n \nFig. 8 Dependency between dielectric loss and moisture con tents under \nuniform moisture distribution condition. T = 50 °C. \nOnce the relationship between dielectric loss and moisture \ncontent is obtained by using Fig. 6 and (16), the dielectric loss of \n 7 \nthe cellulose insulation at different diffusion positions (x axis in \nFig. 6) at any specific time instance can be estimated. The \nestimated values at time instance t = 6 hours are shown in Fig. 9 \n(denoted as data points). Due to the axis symmetry, only half of \nthe curve (x axis from 0 - 0.2 m) in Fig. 6 is presented. \nSuppose that the dielectric loss and diffusion position of the \ncellulose has an exponential relationship \n 2\n2\nxeβδα ⋅=   (17) \nwhere x  denotes the position of cellulose insulation , 2α and \n2β  are parameters  which can be computed using the least \nsquares method. The modelled dielectric loss with respect to \nthe position of cellulose at the tim e instance t = 6 hour s is \npresented in Fig. 9 (denoted as curves, T = 50 °C). It should be \nmentioned that the curves in Fig. 9 are applied to non -\nequilibrium and non- uniform moisture distribution in the \ncellulose insulation. \n \n0.00 0.02 0.04 0.06 0.08 0.10 0.12 0.14 0.16 0.18 0.20\n1E-11\n1E-10\n1E-9\n1E-8\n \n \n \n \n 1000Hz\n 10Hz\n 1Hz\n 0.1Hz\n 0.01Hz\nLoss component\nDiffusion position (m)  \nFig. 9 Dependency between loss and the depth of cellulose insulation (at time \ninstance t = 6 hour s diffusion). Data points denote the values obtained from \n(16) and Fig. 6; Curves are obtained using (17). \nB.  Permittivity of Cellulosic Insulation vs. Moisture  \nThe above approach es are also applied to investigate the \ncorrelation between the real part of permittivity of cellulose \ninsulation and moisture content. Fig. 1 0 depicts the modelled \ncurves of the real permittivity with respect to moisture \nconcentrations under different frequencies at T = 50 °C. Fig. 11 \ndepicts the modelled real permittivity with respect to the depth \nof cellulose insulation at T = 50 °C. In Fig. 11, the modelled real \npart of permittivity is for the time instance t = 6 hours. \n  \n1.2 1.5 1.8 2.1 2.4 2.7 3.0 3.3\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n \n \nReal part of permittivity\nMoisture concentration(%)\n \n \n \n 1000Hz\n 10Hz\n 1Hz\n 0.1Hz\n 0.01Hz\n \nFig. 10 Dependency between real part of permittivity and moisture contents \nunder uniform distribution condition. T = 50 °C. \n0.00 0.02 0.04 0.06 0.08 0.10 0.12 0.14 0.16 0.18 0.20\n1\n2\n3\n4\n5\n \n \n \n \n 1000Hz\n 10 Hz\n 1 Hz\n 0.1 Hz\n 0.01 Hz\nReal part of permittivity\nDiffusion position (m)  \nFig. 11 Dependency between real part of permittivity and the depth of \ncellulose insulation (at time instance t = 6 hours). \nC.  Validation of Distributed Parameter Model \nAfter obtaining the complex permittivity through the \nprocedures described in Section VII A and VII B , dielectric \nresponse measurement is performed on the prototype \ntransformer. The comparison between the measured and the \nestimated complex permittivities is then made. The \ncomparison provides a validation for the proposed distributed \nparameter model.  \nThe dielectric response measurement was repeated every \nhour for 24 hours while the sinusoidal temperature profile (the \nsame as shown in Fig.  3) was imposed on the pr ototype \ntransformer. During measurement, sinusoidal  temperature \nvariation can significantly influence the dielectric response of \ncellulose, especially for low frequenc ies because it takes a \nrelatively longer time to take measurement at low frequencies.  \nThe dependency between permittivity and temperature [11] \ncan be expressed as (18) \n( )\n/\n' ''\n2 22 / 222 /11\nH kT\nrs r hrs r\nTr TH kT H kT\nhh\ne\nee\ne e ωτeeee eωτ ωτ\n∞∞\n∞\n−+= += ++ ，   (18) \nwhere rse  is the dielectric constant at zero excitation frequency \nor dc value, re ∞  is  the dielectric constant at very high frequency, \nhτ  is a pre exponential factor, H  is the  activation  energy,  T is \nthe absolute temperature and k  is the Boltzmann constant.  \nAs the dependency between dielectric response and \ndiffusion positions in Section VI is obtained under a constant \ntemperature of 50 ℃, n ecessary temperature corrections are \nneeded to compensate the influence of the temperature on the \ncomplex permittivity in  dielectric response modelling  when \nsinusoidal temperature is applied . The temperature correction \nis presented in Fig. 12.  \nIn Fig. 12, for each r ound of dielectric respons e \nmeasurements, the average temperature at a particular \nfrequency is corrected by ( )\n0\n1/\niP\nave iT P Tdt= ∫ , where iP is the \ntotal measurement duration at the i-th frequency and T  is the \ntemperature at different time instances as depicted in Fig. 4 (a). \nBy substituting aveT  into T of (18), the  estimated real and \nimaginary part of permittivity  at each frequency under \nsinusoidal temperature can be corrected. T he estimated and \n 8 \nmeasured real and imaginary part s of permittivity of cellulose \ninsulation after temperature correction under non-equilibrium \nand non- uniform moisture distribution at different times are \ndrawn in Fig. 13.  \nFrom Fig. 13 it can be observed there is a similar  trend in \nthe estimated and measured dielectric responses  at different \ntime instances. Some degree of discrepancy between the \nestimated and measured  permittivities can be observed : (1) at \nlow frequencies, which may be due to the modeling errors (can \nbe observed in Fig. 9 and Fig. 11 ); and (2) at time instance t = \n6 hour s, which may be  due to the lack of  data for high \nmoisture content in modeling (Fig. 8 and Fig. 10). \nFrom Fig. 1 3 it can also be seen that there is a decreas ing \ntrend in both es timated and measured real permittivities at \ndifferent time instance s (i.e. different moisture distribution in \nthe cellulose insulation) . When the moisture concentration \nincreases, the real permittivity also  increases at each \nfrequency. The imaginary permittivity increases throughout the \nwhole frequency range  when more moisture moves into  \ncellulose insulation. However, the increase of the imaginary  \npart of permittivity at low frequencies is more dominant.  \n \n1E-3 0.01 0.1 1 10 100 1000\n300\n305\n310\n315\n320\n325\n330\n335\n340\n345\n350\n355\n \n \n \n \n R1 \n R3 \n R6 \n R9 \n R12 \n R15 \n R18 \n R21 \n R24 \nTemperature (K)\nFrequency (Hz)  \nFig. 1 2 Temperature correction ( Rj denotes the j -th round of dielectric \nresponse measurement, data points denote the maximum temperature at  each \nfrequency, solid lines denote the corrected temperature at each frequency) \n \n1E-3 0.01 0.1 1 10 100 1000\n1\n10\n100\n1E-4\n1E-3\n0.01\n0.1\n1\n10\n100\ne''\ne'\n \n \nReal part of permittivity(e')\nFrequency (Hz) \n e'-1 hour modelled\n e'-2 hours modelled\n e'-3 hours modelled\n e'-4 hours modelled\n e'-5 hours modelled\n e'-6 hours modelled\n Imaginary part of permittivity(e'')\n \n \n \n e''-1 hour modelled\n e''-2 hours modelled\n e''-3 hours modelled\n e''-4 hours modelled\n e''-5 hours modelled\n e''-6 hours modelled\n \nFig. 13 Comparison between measured and estimated dielectric response \n(temperature varies according to Fig.  3, from T = 30 °C to T = 80 °C. Lines \ndenote the modelled data and dots denote the measured data) \nTo improve the applicability of the proposed method a \nsoftware tool is implemented, which can be used by practicing \nengineers as an al ternative to current dielectric response \nmeasurement analysis software available with the commercial \nproducts. Fig. 14 illustrates the major components of this software \ntool, including: \n \nUser Input\nEssential: \n1. Nameplate information.\n2. Dielectric response \nmeasurement.\nOptional:\n1. Geometry information.\n2. Historic dielectric response \nmeasurement dataset.\nSteps of Software\n1. Database of dielectric response.\n2. Moisture distribution model.\n3. Analysis\na) Modelled dielectric response of the \ntransformer under thermal transients.\nb) Corrections on the dielectric response \nmeasurement.  \nc) Moisture distribution of the \ntransformer under thermal transients.\n4. Results outputDielectric response \nmeasurement \n1. Moisture distribution.\n2. Average moisture content.\nResults\n \nFig. 14 Components of software tool for moisture estimation  \n(1) Database of dielectric response of transformers : This \ndatabase consists of  dielectric response measurement from \nvarious transformers of different manufacturers. Users can also \nexpand the database by including dielectric response \nmeasurement results of their transformers. If the transformer of \ninterest is not  included in the database and the user doesn’t \nhave any historic measurement dataset of this transformer, the \ndatasets of other transformers with similar rating, insulation \ngeometry and age will be utilize d by the software in its \ncalculation. \n(2) Moisture distribution model of transformers : The \nsoftware tool consists of moisture distribution models of many \ntransformers, which are developed from transformers’ \ngeometrical information of different manufacturer s. For the \ntransformer of which the geometry information is not \navailable, the software will approximate its geometry by using \nthe available information of the transformer (e.g. rating, core \ntype, temperature rise, oil volume etc .). It is assumed that the \ntransformer’s insulation construction follows common \nengineering practice and meets certain criteria (standards). It is \nalso assumed that the moisture dissolved in oil is measured (by \neither water-in-oil probes or DGA/oil test of the transformer). \nBased on  the above approximated transformer geometry and \nthe measured moisture in oil, the software will produce a \nmoisture distribution model for the transformer of interest.  \n(3) Analysis: Users conduct dielectric response measurement \non the transformer of inter est and input the dielectric response \ndata to the software. The software will automatically perform \nthe following calculations:  \n(a) Combine the above database and moisture distribution \nmodel to compute the dielectric response of the transformer \nconsidering the effect of temperature variations. \n(b) Apply the computed dielectric response in (a) to make \ncorrections on the measured dielectric response of the \ntransformer. Such correction can be done by adjusting the \nparameters (α and β in Equations 16 and 17) in the model until \nthe error between computed and measured dielectric response \nis minimized.  \n(c) Compute the moisture distribution inside the \ntransformer’s cellulose insulation under thermal transients. \n 9 \n(4) Output: The software will provide the following \ninformation.  \n(a) Moisture distribution of transformer’s cellulose \ninsulation. \n(b) Average moisture content in transformer’s cellulose \ninsulation.  \nWith the advancement of sensor technology, more sensors \ncan be installed at critical positions for continuously monitoring \nthe temperature and moisture in transformer oil. By integrating \nthe online sensor based monitoring, modeling approach, and \ndielectric response measurement, the reliability of estimation of \nmoisture and its distribution in transformer insulation system can \nbe improved by the proposed method described in this paper. \nVIII.  C\nONCLUSIONS \nThis paper developed a distributed parameter model to \ninterpret the dielectric response of cellulose insulation of \ntransformers under thermal and moisture transients. B y using \nthe methodologies proposed in this paper , the dielectric \nresponse of a transformers’ cellulose insulation under thermal \ntransients and moisture non- equilibrium condition can be \nestimated. It is expected that the proposed methodology can \nprovide proper int erpretation of dielectric response \nmeasurement and accurate moisture estimation for \ntransformers at substations. \nACKNOWLEDGMENT \n    The authors gratefully acknowledge Australian Research \nCouncil, and industry partners Powerlink Queensland, Energex, \nErgon Energy, and TransGrid for supporting this work. \nR\nEFERENCES \n [1] L. E. Lundgaard, W. Hansen, D. Linhjell and T. J. Painter, \"Aging of oil -\nimpregnated paper in power transformers,\" IEEE Trans. Power Del. , \nvol.19, pp. 230-239, 2004. \n [2] Pahlavanpour, M. Martins and Eklund, \"Study of moisture equilibrium in \noil-paper system with temperature variation,\" in Proceedings of  the 7th \nInternational Conference on Properties and Applications of Dielectric \nMaterials, 2003,1124-1129. \n [3] T. V. Oomm en, \"Moisture equilibrium charts for transformer insulation \ndrying practice,\" IEEE Transactions on Power Apparatus and Systems , \nvol.103, pp. 3062-3067, 1984. \n [4] Y. Du, M. Zahn, B. C. Lesieutre, A. V. Mamishev and S. R. Lindgren, \n\"Moisture equilibrium in transformer paper- oil systems,\" IEEE Electr. \nInsul. Mag., vol.15, pp. 11-20, 1999. \n [5] B. Buerschaper, O. Kleboth -Lugova and T. Leibfried, \"The electrical \nstrength of transformer oil in a transformerboard -oil system during \nmoisture non -equilibrium,\" in Pr oceedings of  Annual Conference on \nElectrical Insulation and Dielectric Phenomena , 2003,269-272. \n [6] C. Ekanayake, S. M. Gubanski, A. Graczkowski and K. Walczak, \n\"Frequency response of oil impregnated pressboard and paper samples \nfor estimating moisture in  transformer insulation,\" IEEE Trans. Power \nDel., vol.21, pp. 1309-1317, 2006. \n [7] A. F. Howe, \"Diffusion of moisture through power -transformer \ninsulation,\" Proceedings of the Institution of Electrical Engineers , \nvol.125, pp. 978-986, 1978. \n [8] B. Garcia, J. C. Burgos, A. M. Alonso and J. Sanz, \"A moisture -in-oil \nmodel for power transformer monitoring -  Part I: Theoretical \nfoundation,\" IEEE Trans. Power Del., vol.20, pp. 1417-1422, 2005. \n [9] W. A. Fessler, T. O. Rouse, W. J. McNutt and O. R. Compton, \"A refined \nmathematical model for prediction of bubble evolution in transformers,\" \nIEEE Trans. Power Del., vol.4, pp. 391-404, 1989.\n \n[10] D. Martin, C. Perkasa and N. Lelekakis, \"Measuring paper water content \nof transformers: a new approach using cellulose is otherms in \nnonequilibrium conditions,\" IEEE Trans. Power Del. , vol.28, pp. 1433 -\n1439, 2013. \n[11] A. K. Jonscher, Dielectric Relaxation in Solids, London: Chelsea \nDielectrics Press, 1983. \n[12] \"MMT330 Moisture and Temperature Transmitter Series for Oil\" \navailable at http://www.vaisala.com/en/industrialmeasurements/products \n/moistureinoil/Pages/MMT330.aspx. \n[13] M. A. Tsili, E. I. Amoiralis, A. G. Kladas and A. T. Souflaris, \"Power \ntransformer thermal analysis by using an advanced coupled 3D heat \ntransfer and fluid flow FEM model,\" Int. J. Therm. Sci., vol.53, pp. 188 -\n201, 2012. \nIX.  BIOGRAPHIES \n \nYi Cui (S’12) received the B.Sc. (Engg.)  and M.Sc \n(Engg.) in Electrical Engineering from Southwest \nJiaotong University, China in 2009 and 2012 \nrespectively. He is curren tly pursuing the Ph.D. \ndegree in the School of Information Technology and \nElectrical Engineering, the University of \nQueensland, Australia. He is  a member of IEEE \nsince 2012. His  research  interests include  \ncondition assessment and fault diagnos is of power \ntransformer. \n \n \nHui  Ma  (M’95)  received  his  B.Eng  and  M.Eng \ndegrees  from  Xi’an  Jiaotong  University,  China  \nin 1991  and  1994,  M.Eng  (by  research)  degree  \nfrom Nanyang  Technological  University,  \nSingapore  in 1998,  and  PhD  degree  from  the  \nUniversity  of Adelaide, Adelaide, Australia in 2008. \nCurrently Dr. Ma is a research fellow in the School \nof Information Technology  and  Electrical  \nEngineering,  the University of Queensland, \nAustralia. Prior to joining the  University  of  \nQueensland,  Dr.  Ma  has  many years  research  and  development  \nexperience.  From 1994 to 1995, he was a researcher in Xi’an \nJiaotongUniversity, China. From 1997  to  1999,  he  worked  as  a  firmware  \ndevelopment  engineer  in  CET Technologies  Pte.  Ltd.,  Singapore.  He  was  \nwith  Singapore  Institute  of Manufacturing  Technology  as  a  research  \nengineer  from  1999  to  2003.  His research  interests  include  industrial  \ninformatics,  condition  monitoring  and diagnosis,  power  systems,  wireless  \nsensor  networks, and  sensor  signal processing. \n \nTapan  Kumar  Saha  (M’93,  SM’97)  was  born  \nin Bangladesh in 1959 and immigrated to Australia \nin 1989. He  received  his  B.Sc  Engineering  \n(electrical  and electronic)  in  1982  from  the  \nBangladesh  University  of Engineering  &  \nTechnology,  Dhaka,  Bangladesh,  M. Tech  \n(electrical  engineering)  in1985  from  the  Indian \nInstitute  of  Technology,  New  Delhi,  India  and  \nPhD  i n 1994  from  the  University  of  \nQueensland,  Brisbane, Australia.  Tapan  is  \ncurrently  Professor  of  Electrical Engineering  in  the  School  of  \nInformation  Technology  and  Electrical  Engineering,  University  of  \nQueensland, Australia. Previously he has had visiting appointments for a \nsemester at both the Royal Ins titute of Technology (KTH), Stockholm, \nSweden and at the University of Newcastle (Australia). He is a Fellow of the \nInstitution of Engineers, Australia. His research interests include condition \nmonitoring of electrical plants, power systems and power quality. \n \n \n\n 10 \nChandima Ekanayake (M’00) received his \nB.Sc.Eng.(Hons) in 1999 from University of \nPeradeniya Sri Lanka. He obtained his Tech. Lic. \nand PhD from Chalmers University of Technology \nSweden in 2003 and 2006 respectively. Currently he \nis a lecturer  in th e School of Information \nTechnology and Electrical Engineering, the \nUniversity of Queensland (UQ), Brisbane, Australia. \nBefore joining UQ he was with University of \nPeradeniya Sri Lanka as a Senior lecturer. During \nhis PhD studies he was working for a Europe an Union Project called \nREDIATOOL where he engaged in research related to Diagnostics of \nTransformer Insulation from dielectric response measurements. From 2001, \nhe has been involving on condition monitoring of transformers installed at \nCeylon Electricity Board, Sri Lanka. He was the Chair of IEEE Sri Lanka \nSection in year 2006 and 2007. His research interests are condition \nmonitoring of power apparatus, alternatives for insulating oil, transient \nstudies on power systems and energy related studies. ",
  "topic": "Moisture",
  "concepts": [
    {
      "name": "Moisture",
      "score": 0.7708844542503357
    },
    {
      "name": "Pressboard",
      "score": 0.7087014317512512
    },
    {
      "name": "Materials science",
      "score": 0.699971079826355
    },
    {
      "name": "Dielectric",
      "score": 0.6983444690704346
    },
    {
      "name": "Transformer",
      "score": 0.5852817296981812
    },
    {
      "name": "Insulation system",
      "score": 0.5783790946006775
    },
    {
      "name": "Composite material",
      "score": 0.5730475783348083
    },
    {
      "name": "Water content",
      "score": 0.5295131206512451
    },
    {
      "name": "Dielectric response",
      "score": 0.5232079029083252
    },
    {
      "name": "Transformer oil",
      "score": 0.5018527507781982
    },
    {
      "name": "Dielectric loss",
      "score": 0.4473947584629059
    },
    {
      "name": "Liquid dielectric",
      "score": 0.44727805256843567
    },
    {
      "name": "Electronic engineering",
      "score": 0.40577638149261475
    },
    {
      "name": "Electrical engineering",
      "score": 0.3375994563102722
    },
    {
      "name": "Voltage",
      "score": 0.24617955088615417
    },
    {
      "name": "Geotechnical engineering",
      "score": 0.16430366039276123
    },
    {
      "name": "Engineering",
      "score": 0.14944371581077576
    },
    {
      "name": "Optoelectronics",
      "score": 0.11521989107131958
    }
  ]
}