{
  "title": "Foundation of an analytical proton beamlet model for inclusion in a general proton dose calculation system",
  "url": "https://openalex.org/W2048692002",
  "year": 2010,
  "authors": [
    {
      "id": "https://openalex.org/A5036822257",
      "name": "W. Ulmer",
      "affiliations": [
        "Varian Medical Systems (Switzerland)",
        "Max Planck Institute for Biophysical Chemistry"
      ]
    },
    {
      "id": "https://openalex.org/A5084257108",
      "name": "Barbara Schaffner",
      "affiliations": [
        "ETH Zurich",
        "Varian Medical Systems (Switzerland)"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1969217285",
    "https://openalex.org/W2001927789",
    "https://openalex.org/W2153864030",
    "https://openalex.org/W2043603625",
    "https://openalex.org/W1991770039",
    "https://openalex.org/W2061664500",
    "https://openalex.org/W1973074945",
    "https://openalex.org/W2038196526",
    "https://openalex.org/W2076014710",
    "https://openalex.org/W2076261801",
    "https://openalex.org/W2022985124",
    "https://openalex.org/W1995817893",
    "https://openalex.org/W1996275393",
    "https://openalex.org/W6631282967",
    "https://openalex.org/W1977468423",
    "https://openalex.org/W2027426300",
    "https://openalex.org/W2018826659",
    "https://openalex.org/W2047763793",
    "https://openalex.org/W6666334436",
    "https://openalex.org/W2003043687",
    "https://openalex.org/W2056064051",
    "https://openalex.org/W2082859509",
    "https://openalex.org/W2005348841",
    "https://openalex.org/W1997498511",
    "https://openalex.org/W2001881071",
    "https://openalex.org/W2068878119",
    "https://openalex.org/W2082700018",
    "https://openalex.org/W2009530441",
    "https://openalex.org/W2034861286",
    "https://openalex.org/W2038876208",
    "https://openalex.org/W2064751577",
    "https://openalex.org/W2255432394",
    "https://openalex.org/W2479859605",
    "https://openalex.org/W64857981",
    "https://openalex.org/W2798441874",
    "https://openalex.org/W1521406092",
    "https://openalex.org/W2052740467",
    "https://openalex.org/W2413117380"
  ],
  "abstract": null,
  "full_text": "An analytical proton beamlet model   - 1 - \n \nFoundation of an analytical proton beamlet model for inclusion in a general \nproton dose calculation system \nW. Ulmer 1,2  and B.Schaffner 1,3 \n1Varian Medical Systems, Baden, Switzerland , 2MPI of Biophysical Chemistry, Göttingen and Klinikum \nFrankfurt/Oder, Germany, 3ETH Zürich 5 \nE-Mail: waldemar.ulmer@gmx.net \nAbstract: We have developed a model for proton depth dose and  lateral distributions based on Monte Carlo \ncalculations (GEANT4) and an integration procedure of the Bethe-Bloch equation (BBE). The model accoun ts \nfor the transport of primary and secondary protons,  the creation of recoil protons and heavy recoil nu clei as well \nas lateral scattering of these contributions. The buildup, which is experimentally observed in higher energy depth 10 \ndose curves, is modeled by inclusion of two  different origins: 1. Secondary reaction protons w ith a contribution \nof ca. 65 % of the buildup ( for monoenergetic protons ). 2. Landau tails as well as Gaussian type of fluc tuations \nfor range straggling effects. All parameters of the  model for initially monoenergetic proton beams hav e been \nobtained from Monte Carlo calculations or checked b y them. Furthermore, there are  a few parameters, w hich \ncan be obtained by fitting the model to measured depth dose curves in order to describe individual characteristics 15 \nof the beamline – the most important being the init ial energy spread. We find that the free parameters  of the \ndepth dose model can be predicted for any intermediate energy from a couple of measured curves. \nKeywords:  proton treatment planning, Bethe-Bloch, Bragg peak , depth dose model, Landau tail, secondary \nreaction protons \n1.  Introduction 20 \nRadiotherapy with protons is becoming a modality wi th increasing importance, which triggers a lot of \nwork in the field of algorithms for treatment plann ing. One of the challenges in treatment planning in  \ngeneral is to find a reasonable compromise between the speed and the accuracy of an algorithm. The \nfastest dose calculation algorithms are based on lo ok-up tables for depth dose and lateral distributio ns \nof spread-out Bragg peaks or single pristine Bragg peaks (Hong et al 1996, Petti 1992, Deasy 1998, 25 \nSchaffner et al 1999, Russel et al 2000, Szymanowsk i et al 2002, Ciangaru et al 2005). The look-up \ntables often consist of measured data directly or a n analytical model fitted to the measurements in \nwater. A depth scaling procedure is always applied in order to convert from water to another medium. \nSome authors use higher order corrections or differ ent calculation approaches for the lateral \ndistribution. Another approach is an iterative nume rical calculation of the dose deposited by a proton  30 \nbeam along its path through the medium (Sandison et  al 1997, Hollmark et al 2004). Monte Carlo \nmethods can lead to the highest accuracy results – especially in highly heterogeneous media – but can \nstill not be performed with sufficient speed for ro utine treatment planning (e.g. Petti 1996, Jiang et  al \n2004, Tourovsky et al 2005).  \nCommon to most of the cited papers is that an adapt ation procedure of the dose model to different \n35 \nproperties of the beamline is not clearly elaborate d. Some of the models may not be easy to adapt to \nanother beamline or an intermediate range/energy at  all. An exception to this is the model published \nby Bortfeld (1997). However, this model does not de scribe the buildup observed in higher energy \nAn analytical proton beamlet model   - 2 - \n \nprotons and the transport of secondary protons. Fur thermore, we present a theoretical analysis of the \norigin of the buildup effect, which is measured in higher energy proton beams. Due to the insufficient  \ntransport of secondary protons, this buildup is not modeled correctly by the Monte Carlo code PTRAN, \nwhich is used by other authors for a comparison wit h their models (e.g. Carlsson et al 1997, Sandison \net al 2000).   5 \nThe present model, which is most widely  implemented in the commercial treatment planning p ackage \nEclipse 1 , is built upon proton beamlets in water (Eclipse TM  2008 User Manual accessible with \npermission of Varian Inc. ). They are a 3D dose distribution delivered by the  quasi-monoenergetic \nbeam impinging on a water surface with no lateral e xtension and angular divergence (by quasi-\nmonoenergetic beam we refer to the spectrum as prod uced by the accelerator and beamline without 10 \nany intended range modulation). The beamlet can be separated into a depth dose component and a \nlateral distribution. The depth dose obtained from a quasi-monoenergetic beam is often called the \npristine Bragg peak. The present work focuses on th e theoretical depth dose model that contains some \nfitting parameters - as defined below - which are u sed to fit our model to measured pristine Bragg \npeaks to account for beamline specific characteristics of our model. We will show how well the model 15 \ncan be adapted to different measured Bragg peaks – including buildup effects. The measurements have \nbeen obtained from different accelerators and will be described in more detail in the appropriate \nsections. The lateral component of the beamlet only  includes scattering in the patient. It does not \nrequire any beamline specific configuration. The beamline specific component of the lateral penumbra \nis modeled through the lateral distribution of the in-air fluence (Schaffner 2008). In the development  20 \nof the model, we have used GEANT4 (GEANT4 documents  2005) to analyze lateral scattering \ndistributions, Landau tails, the production of heav y recoil particles and to obtain some numerical \nparameters. Many comparisons between Monte Carlo re sults and an exact integration of BBE, and \nnuclear cross-sections, respectively, have been previously described (Ulmer 2007).  \n2.  Material and methods 25 \nIn order to reduce the length of the study, we have  added a Laboratory Report referred to as LR (and \nan L preceding references to equations, figures and  tables). This LR is available online of this journ al \nand provides necessary information on other publica tions (Ulmer 2007, Ulmer and Matsinos 2010) \nused in this study.  \n2.1  Range – energy relations and integration of BBE \n30 \nAn essential aspect in therapy planning is the rela tionship between initial proton energy E 0 and the \n                                                      \n1 Varian Medical Systems Inc. \nAn analytical proton beamlet model   - 3 - \n \nrange of the continuous-slowing-down-approximation (RCSDA ). The subsequent equations for R CSDA , \nE(z) and dE(z)/dz have been previously derived (Ulmer 2007), and by integration of BBE (Bethe 1953, \nBethe et al 1953, Bloch 1933, Boon 1998, ICRU49 199 3, Segrè 1964) we have obtained the useful \nequation (section LR.1 of LR):  \n                             \n)(lim 0\n1\n1 ∞⇒⋅= ∑\n=\nNEER\nn\nN\nn\np\nInZ\nA\nCSDA \nnN\nαρ   (1) 5 \nEI refers to an averaged ionization energy, Z/A N to the nuclear charge/mass number of the absorbing  \nmedium, and ρ to its density (g/cm 3).  For water we used Z = 10, A N = 18, ρ = 1 g/cm 3 (Bragg rule) \nand EI = 75.1 eV. Then Eq. (1) becomes: \n                      )(lim 0\n1\n∞⇒= ∑\n=\nNEaR\nn\nN\nn\nnCSDA                               (2)  \nN = 4 yields very accurate results for energies below 300 MeV. Parameters of Eq. (1 – 2) are stated in  10 \nTables L1 and L2 (LR.1).  \nEq. (2), valid for water, can also be transformed t o a sum of exponential functions (see Eq. (L2)). By  \nthat, it can be inverted (i.e. calculation of the ( input) energy from the residual range: E = E(R \ncsda  – z)). \nA restriction to N = 5 leads to a very high accuracy for proton energies below 300 MeV.  \n                \n\n\n\n\n\n\n\n−−\n∑\n=\n⋅⋅−=\n−\n∑\n=\n⋅⋅=\nk\nk\nzcsda R\ne\nk kAzcsda RzE\ncsda R\ne\nk kAcsda RE\nβ\nβ\n/ )(5\n1\n)()(\n/5\n10\n                              (3) 15 \nParameters of Eq. (3) are stated in Table L3; formula (L4) and Table L3 also provide the inversion \nformula of Eq. (1) as a generalization of Eq. (3) and valid for arbitrary media.  \n \nSince E(z) is analytically known, the stopping power S(z) = dE(z)/dz can be  derived from E(z):  \n    \nkCSDA zR\nk\nCSDA kk ezRAdz \nzdE zS ββ / )(\n5\n1\n1 ] 1)([)()( −−\n=\n− ⋅−−⋅⋅== ∑        (4) 20 \nEq. (4) consists of a sum of 5 exponential function s. In order to speed up this expression with respec t \nto dose calculations (50 MeV: factor 2.4 up to 250 MeV: factor 4.7; in connection with Gaussian \nconvolutions the accelerated algorithm is a factor 2 - 3 faster, again), we reduce the 5 exponential \nfunctions of S(z) to a single one of type (4) and i ntroduce 4 more convenient (much less time-\nconsuming) functions according to the following cri teria of Eq. (4) and leading to S approx  with the 25 \nAn analytical proton beamlet model   - 4 - \n \nfunctions φ1… φ5 in Eq. (5):  \n1. Optimization of the exponential behavior and coe fficient weight, slightly depending on the initial \nenergy E 0 by an envelope exponential function exp(-Q p·(R CSDA  – z)), to provide the main contribution \nof the exponentially increasing part of Bragg curves (φ3).  \n2. A Gaussian term (φ1) containing a half-width τ0 ≈ 10 -5 cm aims the reflecting behavior of the Bethe-5 \nBloch function in the environment of the CSDA-range , which would otherwise be singular and could \nnot be integrated. Thus, we are using exp(-(R CSDA  – z) 2/ τ0\n2) instead of the δ-function (if lim τ0 → 0); \nin the subsequent Eq. (6), the undefined square of a δ-function would appear instead of  products with \nGaussian terms resulting from φ1. The problem of the singularity does not exist any more in the \npresence of range straggling as represented by the parameter τ, which will be defined in a later section. 10 \nLater on, τ0 will therefore be neglected ( τ0 << τstraggle ). \n3. A power expansion of Eq. (4) with respect to the  initial plateau and slowly increasing domain of \nS(z) up to the order z 2/R CSCA \n2 provides the functions φ2, φ4 and φ5.  \nWith the help of these 5 functions we are able to develop an accelerated algorithm: \n( )\n\n\n\n\n\n\n\n\n−⋅−⋅⋅=\n−⋅⋅⋅=\n−⋅−⋅−⋅⋅=\n−⋅⋅=\n−⋅−−⋅=\n)()/1 ()(2. 5\n)()/()(2. 4\n)()) ()(exp( )(2. 3\n)()(2. 2\n)()/)(exp( . 1\n055\n2\n044\n0033\n022\n2\n0\n2\n011\nzRRzEC\nzRRzEC\nzRzREQEC\nzREC\nzRzREC\nCSDA CSDA \nCSDA CSDA \nCSDA CSDA p\nCSDA \nCSDA CSDA \nθϕ\nθϕ\nθϕ\nθϕ\nθτϕ\n      (5) 15 \nExplanations: θ(R CSDA  – z) is a unit step function, i.e. θ(R CSDA  – z) = 1 (if z ≤ R CSDA ) and 0 (otherwise). \nThe purpose of the unit step function is that the e nergy E(z) is zero for z > R CSDA .  Qp = π·PE/z max \nappears in the function φ3; z max  will be explained in section 2.3. The parameter P E and the coefficients \nC1, C 2, C 3, C 4, and C 5 depend linearly on E 0 and are determined by the variation procedure: \n               \n \n \n \n \n  \n \n \n \n== ==≈≈ ≈≈\n== ==−− −−\n∑∑ ∑∑\n∫∫ ∫∫∑∑ ∑∑\n== ==\n== ==\n5\n1\n0\n2\n0\n300 \n1\n),()(\n)()(\n0\nk\nkapprox \nR\napprox \nE\nEzSzS\nMinimum dz zSzS\nCSDA \nϕϕ ϕϕ\n                (6) 20 \nIt should be mentioned that the determination of th e stopping power function according to Eq. (5) and \nEq. (6) agrees with an internally considered expansion of the solution functions of BBE with Feynman \npropagators, but the energy-dependence of the parameters had to be defined by GEANT4. In particular, \nthe free particle propagator is also a Gaussian ker nel, and φ1 immediately results from this kernel; the \nremaining contributions 2 – 5 of Eq. (5) are genera ted via iterated integral operators. Since an 25 \nAn analytical proton beamlet model   - 5 - \n \nanalytical integration of BBE is superior to a pert urbation expansion based on propagators, we prefer \nto present here the solution method without propagators. The result of the adaptation of S(z) according \nto Eq.(6) is stated in Table 1. The mean standard d eviation amounts to 0.7 %. It turned out that the \ncontribution of the coefficient C 5 is rather negligible, since it amounts to 0.007, a nd so this \ncontribution may be omitted (C 5 = 0). Therefore the backbone of the accelerated al gorithm can be 5 \nrestricted to the four coefficients C p (p = 1,…, 4) and a parameter P E related to φ3. The linearly energy-\ndepending C1,…, C 4 and P E are given by: \n 05 , 15 , 00, 1, 0 ) 4.., , 1( EPand pEC Eppp ⋅⋅ ⋅⋅++ ++== ==== ==⋅⋅ ⋅⋅++ ++== == αα αααα αααα αααα αα         (7) \nTable 1: Parameters to calculate energy dependence of the coefficients C p and P E according to Eq. (7) \nCp C 1 C 2 C 3 C 4 P E \nα0,p 2.277463  0.2431 1.0295 0.4053 6.26751 \nα1,p - 0.0018473 0.0007 - 0.00103 - 0 .0007 0.00103 \n 10 \nA determination of the parameters presented in Tabl e 1 with GEANT4 (least-square fit) leads to the \nfollowing maximal deviations: C 1: + 0.07 %; C 2 = + 0.08 %; C 3: +0.04 %; C 4: -0.09 %; P E: -0.08 % at \ndifferent values of E 0. The mean standard deviations are of the order 0.0 4 % – 0.06 %. A \ngeneralization of Eq. (7) from water to arbitrary media is given in Eq. (L5) and Table L3 in LR.1. \n 15 \n2.2  The fluence decrease of primary protons due to nuclear  interactions \nAccording to an investigation presented previously (Ulmer 2007) the decrease of the fluence of \nprimary protons Фpp  due to nuclear interactions of protons in water can be described by:  \n           \n( )\n\n\n\n\n\n−=\nΦ⋅\n\n\n\n\n \n\n\n\n −+⋅\n\n\n\n\n ⋅−=Φ\n032 . 12\n0\n0\n]/ )( [\nerf 112\n1\ncMEEuq \nzR\nR\nzuq z\npTh \ncsda \ncsda \nPP \nτ               (8) \nΦ0 is the initial fluence of protons (dimensionless),  E 0 the initial proton energy, E Th  = 7 MeV, and 20 \nMpc2 = 938.276 MeV is the proton rest energy. Eq. (8) r esults from an integration of the total nuclear \nproton – oxygen cross-section (Figures L2 – L3, dat a of Chadwick et al 1996, and calculations of \nUlmer and Matsinos 2010). E Th  = 7 MeV is the threshold energy necessary to surmo unt the Coulomb \nrepulsion of the oxygen nucleus. Φ0 represents an arbitrary initial fluence of a proto n beamlet at \nsurface.  25 \nIt might be surprising that in formula (8) the erro r function erf  and the rms-value τ of a Gaussian \nappear. In principle, the behavior of Фpp , valid within the CSDA-framework, should be a stra ight line \nas long as E = E Th  is not yet reached. For E < E Th  to E = 0, Фpp  should be constant; at E = 0 (z = R CSDA ) \na jump to Фpp  = 0 is expected. However, due to energy/range stra ggling, the proton beam can never \nremain monoenergetic in the sense of CSDA. Since τ refers to the half-width of a Gaussian 30 \nAn analytical proton beamlet model   - 6 - \n \nconvolution, we introduce ‘roundness’ in the shape.  The range of 7 MeV protons is less than 1 mm; \ntherefore, we cannot verify whether Фpp  is constant in the fluence profile of primary protons. The half-\nwidth parameter τ will be defined subsequently. \nAt first, we adopt the commonly applied assumption that energy/range straggling can be described by \na Gaussian 2  type of fluctuation. This means, that we can add t he width of the corresponding 5 \ndistributions quadratically, i.e., τ is given by:  \n                                              \n22\nin straggle τττ +=                                    (9) \nThe parameter τin  represents the distribution of the incident beam a nd τstraggle the variation of the range \ndue to straggling along the beam path. It reaches its maximum at R CSDA : \n  \n\n\n\n\n\n\n\n\n<\n≥⋅⋅=\ncm 1 if      ,\ncm 1 if     ,012703276 . 02)(\n1.763 \n9352 . 0\ncsda csda \ncsda csda \nCSDA straggle \nRR\nRRRτ        (10) 10 \nFor most applications, it is sufficient to use a co nstant value for τstraggle  along the whole beam path. \nHowever, in some cases, we want to use the depth dependence of τstraggle  (see section 2.6 about Landau \ntail corrections). It should be noted (Ulmer 2007), that τstraggle  increases exponentially with the stopping \npower function S(z) according to BBE: \n                  \n\n\n\n\n\n=\n−\n−⋅=\n−\n⋅\n⋅\n1887 . 2\n1\n1)()(\ncm Q\ne\neRz\nz\nRQ\nzQ\nCSDA straggle straggle CSDA z\nz\nττ\n        (11) 15 \n2.3  The stopping power of primary protons \nThe overall calculation of the depth dose deposited by primary protons follows from a combination of \nthe fluence reduction (section 2.2 and the results of the integration BBE (section 2.1)). The stopping  \npower of primary protons thus becomes: \n             ( ) ( ) ( ) ( ) ( ) ( ) ( )[ ]02010403020100 ,,,,,,1, EzIEzIEzIEzIEzIEzIR\nzuq EzS Lan Lan \ncsda \npp +++++⋅\n\n\n\n\n ⋅−⋅Φ=\n   (12)  20 \nΦ 0, which has to be dimensionless and can be put 1, a nd the following factor (1 - uq ·z/R csda ) represent \nthe number of remaining protons at the given depth.  The ‘ I-terms I1 – I 4’ result from functions φ1 – φ4 \nof Eq. (5) subjected to a Gaussian convolution with τ according to Eq. (9) to account for energy/range \nstraggling. The terms ILan1  and I Lan2  result from the fact that energy fluctuations are not symmetrical, as \n                                                      \n2The usual form of the Gaussian involves the expression exp (-x2/(2 σ2)) For computational reasons, we substitute 2 σ2 by τ2 and indicate this \nby using τ, where referring to the Gaussian width. \nAn analytical proton beamlet model   - 7 - \n \nrequired by the Gaussian kernel. For the sake of cl earness we shall treat the contributions of Landau \ntails I Lan1  and I Lan2  separately (section 2.6). The remaining terms I 1(z, E 0) - I4(z, E 0) are determined by: \n   \n( )\n( )\n\n\n\n\n\n −−\n⋅\n\n\n\n\n +⋅⋅−⋅⋅⋅=\n2\n2\n2411\n1 τ\nπ\nτ\nτ\nτ\nzR\ncsda \ncsda csda straggle \nabs \ncsda \ne\nR\nzRCRCNI  (13) \n\n\n\n\n\n \n\n\n\n −+⋅\n\n\n\n\n\n⋅+⋅=\nτπ\nτ zRerf \nR\nCCNI csda \ncsda abs \n1\n2\n1\n2\n2\n422                              (14)  \n     \n( ) ( )\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n⋅\n⋅⋅−−+⋅\n⋅\n\n\n\n\n −⋅⋅−⋅⋅⋅⋅⋅\n=\nmax \nmax \n2\nmax \n3\n3\n21\n4exp 1\nz\nPzRerf \nz\nzRPzPCN\nI\nEcsda \ncsda Ein E\nabs \nτπ\nτ\nπτπ\n         (15)  5 \n \n\n\n\n\n \n\n\n\n −+⋅⋅⋅=\nτ\nzRerf \nR\nzCNI csda \ncsda abs \n11\n2\n2\n44                                         (16)  \n \nThe parameters C \n1… C4 and P E can be calculated from Eq. (7) and Table 1. The no rmalization factor \nNabs  depending on R csda  will be stated in section LR.5. For fast relative calculations in therapy planning \n(normalization of the Bragg peak: 1 or 100 %) N abs  can be put 1; only for absolute calculations 10 \n(Gy/MU, see section 3.1) the real value of N abs  is required (Eclipse TM  2008).  It should be noted that τ \nrefers to Eq. (9), but a restriction to τin  = 0 transforms equations (13 - 16) to the monoener getic case. \nParameter zmax , which appears in Eq. (15), is given by z max  = R csda  + τRange ; τRange  is calculated by the \nformula: \n    \n]10 919238854 . 010 117908559 . 2 [\n2\n0\n7\n0\n5 EERCSDA Range ⋅⋅+⋅⋅⋅= −−τ     (17) 15 \nA further use of τRange  can be verified in LR.4. \n2.4  The stopping power of secondary and recoil protons \nBefore discussing the details of the modeling of se condary protons, we need to clarify the \nnomenclature. We consider all protons to be seconda ry protons, if they did undergo a nuclear \ninteraction with the nucleus. The calculations in s ection 2.2 (decrease of primary proton fluence) is 20 \nbased on the total nuclear cross-section of the int eraction proton with the oxygen nucleus (Figure L2 \nand similar figures in Medin et al 1997, Paganetti 2002, Boon 1998). This cross-section leads to a \nsteady decrease of primary protons with a slope, wh ich is in exact agreement with results of Boon \n(1998) and the Los Alamos Scientific Library. Figur e L3 shows for example a 20% decrease of \nprimary protons for an initial energy of 200 MeV pr otons. Based on GEANT4 Paganetti (2002) states 25 \nAn analytical proton beamlet model   - 8 - \n \nsimilar numbers, but he and other authors (Fippel e t al 2004, Medin et al 1997) still call those proto ns \n‘primary’ protons, which we shall describe by the s ubsequent case 1. In our work, we classify all \nprotons emerging from nuclear interactions as secon dary protons. Looking at secondary protons in \ndetail, we can distinguish two cases: \n1. Secondary protons by potential/resonance scattering ( sp,n:  nonreaction protons). Potential scattering   \n5 \n(elastic) results from the strong interaction potential in the environment of the nucleus (note that RStrong  \n≈ 1.2 ·AN\n1/3  ·10 -13  cm determines the distance with a balance between strong interaction force and \nCoulomb force; A N(oxygen) = 16). For R > R Strong  only the Coulomb part is present.  Resonance \nscatter (inelastic) is a typical quantum mechanical effect; it results from the proton/nucleus interaction \ninducing transitions between different states of th e nucleus (e.g. vibrations leading to intermediate 10 \ndeformations, rotation bands, excited states by cha nging the spin multiplicity, E res  (oxygen): 20.12 \nMeV). These elastic and inelastic processes are described by the Breit-Wigner-Flügge formula (see e.g. \nSegrè 1964). \n2. Nuclear reactions (sp,r : reaction protons, inelastic), which produce heavy recoils (see e.g. the listing \n(27)). These protons are sometimes referred to as r eaction protons – or ‘secondary protons’ by the \n15 \nauthors cited above. For protons in the therapeutic  energy domain the contribution of reaction protons \nto the total dose amounts to 1 % (160 MeV) - 4 % (270 MeV) and increases with energy.  \nWithin the total nuclear cross-section case 1 plays the dominant role, if E < 100 MeV. If E > 100 MeV \nthe importance of case 2 surmounts case 1 and incre ases with the energy. In particular, the \ncontribution of resonance scatter is drastically decreasing (Ulmer and Matsinos 2010). In both cases ca. 20 \n1 – 7 MeV have to be added to the proton energy (th is depends on the deflection angle); they are \ntransferred to whole nucleus to satisfy energy/mome ntum conservation in the center-of-mass system.  \nThis implies that for a neutron release the proton energy has to be 21 – 27 MeV and not simply 20 \nMeV (an exception is stated in the discussion of listing (27)). Due to potential barrier the energy of the \ncolliding proton has, at least, to be 30 MeV in order to release a secondary proton. 25 \nThe fluence of secondary protons Φ sp  (Φ sp,n  and Φ sp,r ) and recoil protons/neutrons Φ rp together is only \napproximately equal to the fluence loss of primary protons due to nuclear interactions (term (1-\nuq ·z/R csda ) in Eq. (8)). The relative weight between the two types was obtained from Monte Carlo \nsimulations. We therefore obtain for the fluence of secondary nonreaction (sp,n ) and recoil protons the \nfollowing equations:  30 \nAn analytical proton beamlet model   - 9 - \n \n                             \n\n\n\n\n\n\n\n\n\n\n\n\n ⋅Φ⋅=Φ\n\n\n\n\n\n ⋅Φ⋅⋅−=Φ\ncsda \nrp \ncsda \nheavy nsp \nR\nzuq \nR\nzuq C\n0\n0,\n042 . 0\n)21 (υ\n     (18)                      \nCheavy  is determined according to Eq. (26). At this place , we already point out that the factor υ in Eq. \n(18) referring to the fluence of secondary protons has not simply to be 0.958, since it may depend on \nthe beamline (see also section 3).   \nThe transport of secondary and recoil protons according to Eq. (18) basically shows the same physical \n5 \nbehavior as primary protons. Therefore, we can describe them with the same terms as primary protons \n(section 2.3): \n( )\n( ) ( ) ( ) ( ) ( ) ( )[ ]\n\n\n\n\n+++++\n⋅\n\n\n\n\n ⋅⋅⋅−⋅Φ=\n020104030201\n00,\n,,,,,,\n)21 (,\nEzIEzIEzIEzIEzIEzI\nR\nzuq CEzS\nsLan sLan ssss\ncsda \nheavy snsp υ\n   (19) \n( )\n( ) ( ) ( ) ( ) ( ) ( )[ ]\n\n\n\n\n+++++\n⋅\n\n\n\n\n ⋅⋅⋅Φ=\n020104030201\n00\n,,,,,,\n042 . 0,\nEzIEzIEzIEzIEzIEzI\nR\nzuq EzS\nsLan sLan ssss\ncsda \nsrp \n  (20)  \n  10 \nHowever, due to energy loss of primary protons, the  Bragg peak of secondary, nonreaction protons \n(sp,n ) is shifted to a lower z-value. The depth coordina te z, therefore, has to be replaced by a shifted \ncoordinate, i.e.  \n                                  shift s zzzz +=⇒                                             (21)  \nIn addition, the convolution parameter τ also contains a term resulting from the nuclear cross-section:  15 \n                        \n222\n5 . 0heavy in straggle ττττ ⋅++=                               (22)  \nPractically, this means that secondary protons (‘ sp, n’ ) alone also exhibit a Bragg peak, but one which \nis much broader than the Bragg peak of primary prot ons (see also Figure 2). Using previous results \n(Ulmer 2007) z shift  and τheavy  are given by: \n          ( )\n\n\n\n\n\n\n\n\n\n\n\n\n≥\n\n\n\n\n\n\n⋅\n−−−⋅\n<\n=\n∑\n=\n)(]\n2 . 5\nexp 1 [\n)(0\n022\n2\n0\n4\n1\n0\nres \nres \nres n\nres \nn\nn\nres \nshift \nEEif \nE\nEEEa\nEEif \nz     (23)  20 \nAn analytical proton beamlet model   - 10 - \n \n \n( ) \n\n\n\n\n\n\n\n\n\n\n\n<−⋅−\n≤≤−\n−⋅\n<\n=\n0res 0\n0\n0\n0\n E  if ,000585437 . 0554111 . 0\n,55411 . 0\n   if ,00000 . 0\nEEE\nEEEEE\nEE\nEE\nres \nres Th \nTh res \nTh \nTh \nheavy τ     (24)  \n2.5  The contribution of heavy recoils and their connection to secondary/recoil protons \nFinally, we have to complete the total stopping pow er function S(z) for the reaction proton ( sp,r ) and  \nheavy recoil contribution. With regard to heavy rec oils an analysis of Monte Carlo calculations \n(GEANT4) for protons travelling in water for energi es from 5 MeV up to 270 MeV showed that it is 5 \npossible to fit the data with the help of the following equations: \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n −+−\n⋅+⋅⋅Φ=\n⋅−\nheavy \ncsda \nz\nz\nheavy heavy \nEzR\nerf eCEzS max \nτ\n1250 21),(\n0\n00     (25)  \n \n\n\n\n\n\n\n\n\n≥−⋅\n<\n= )()(3926 0000004264 . 0\n)   if (0\n)0\n2\n0\n0\nTh Th \nTh \nheavy \nEEif EE\nEE\nC                  (26) \n \nWith respect to the threshold energy E \nTh  = 7 MeV we have been able to verify a very small ‘ jump’ 10 \ndepending on the available proton energy, i.e. ther e is no continuous transition from E 0 < E Th  to E 0 = \nETh . The most probable heavy recoil elements resulting  from the nuclear reactions by therapeutic \nprotons are the cases 1 – 5; cases 6 – 7 result fro m cases 1 - 2: \n     \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n++⇒+\n+=−++⇒+\n+=−++⇒+\n+=−++⇒+\n+=−+++⇒+\n+=−+++⇒+\n+=−+⇒+\n−\n+\n+\n+\n+\n+\n) 3(. 7\n)sec 120 ,(. 6\n)sec 124 ,(. 5\n)sec 124 ,(. 4\n)min 10 ,(. 3\n)sec 124 ,(. 2\n)sec 22 ,()(. 1\n15 \n7\n16 \n8\n2 / 1\n16 \n7\n16 \n8\n2 / 1\n15 \n8\n16 \n8\n2 / 1\n13 \n7\n16 \n8\n2 / 1\n15 \n7\n16 \n8\n2 / 1\n15 \n8\n16 \n8\n2 / 1\n16 \n9\n16 \n8\ncase see NnpOn\nTdecay NpOn\nTdecay OdOp\nTdecay NOp\nTdecay NppOp\nTdecay OnpOp\nTdecay Fneutron nOp\nγβ\nγβ\nγβα\nγβ\nγβ\nγβ\n         (27) \nAll types of β+-decay emit one γ-quant; its energy is of the order 0.6 MeV – 1 MeV.  The β+-decay of 15 \n16 \n9F  has a half-life of about 20 seconds, and further γ-quanta are produced by collisions of positrons \nwith environmental electrons. The remaining heavy recoil fragments have partially half-times up to 10 \nminutes (N 15). Since Figure L2 refers to the total nuclear cros s-section in dependence of the actual \n(residual) proton energy, we have to add some quali tative aspects on the 5 different types with regard  \nto the required proton energy: If E < 50 MeV the ty pe (1) is the most probable case with rapid 20 \ndecreasing tendency between 50 MeV < E < 60 MeV to become zero for E > 60 MeV. Type (2) also \nAn analytical proton beamlet model   - 11 - \n \npushes out a neutron, but the incoming proton is not absorbed; the required energy amounts, at least, to \n50 MeV. Type (3) is similar, but requires, at least, ca. 60 MeV with increasing probability. The release \nof α-particles resulting from clusters in the nucleus r equires E ≈ 100 MeV and the probability is \nincreasing up to E ≈ 190 MeV; thereafter it is decreasing rapidly, sinc e higher energy protons destroy \nthese clusters by pushing out deuterons according to type 5. Thus case 5 is energetically possible for E 5 \n> 60 MeV, but the significance is only increasing f or E > 200 MeV. The nuclear reactions 6 and 7 \nresult from the release of neutrons; they may under go further interactions with oxygen. According to \nUlmer and Matsinos 2010) the cases 1 and 6 are note worthy. Thus the neutron released by the \nincoming proton has not absolutely to be the result  of a real collision (threshold energy, at least, 2 0 \nMeV). For energies E > 7 MeV and E < 20 MeV a reson ance effect via exchange interaction between 10 \nproton and nucleus via a π- meson (Pauli principle) is also possible. By that,  the incoming proton \nleaves the oxygen nucleus as a neutron. Case 6 repr esents the reversal process, i.e., the incoming \n(secondary) neutron is converted to a proton via π+ exchange.  The calculation procedure for S sp,r  is \npresented in LR, section LR.2 (see also Ulmer and Matsinos 2010). \nWe should also point out that nuclear reactions lik e relations (27) are only a part of the total decre ase 15 \nof the primary proton fluence according to Eq. (8).  If E < 100 MeV, the main part of the decrease of \nthe primary proton fluence results from nuclear scatter of protons by the oxygen nucleus (deflection of \nprimary protons without release of further nucleons) via intermediate deformations and oscillations of  \nthe nucleus. These oscillations are damped by emission of γ-quanta with very low energy (ca. 1 keV), \nwhich are most widely absorbed by the Auger effect. The most important source for recoil protons are 20 \nelastic collisions of projectile protons with the p roton of Hydrogen. Released neutrons of type 1 also  \nlose most widely their energy by such collisions before they become thermal neutrons. These neutrons \nusually escape and undergo β- - decay to produce a proton, electron and a γ-quant (0.77 MeV), T 1/2  = \n17 min. Neutrons of type 2 carry a much higher ener gy and can escape without any significant \ncollisions. The cases 6 and 7 referring to the neut ron interaction with the oxygen nucleus are the onl y 25 \nnoteworthy inelastic contributions. Fig. 1 shows th e dose contribution of reaction protons for some \ntherapeutic proton energies. The contributions of d euterons and α-particles are also accounted for in \nthis figure. The tails beyond the ranges R CSDA mainly result from the reaction types 6 and 7 of th e \nlisting (27).  \n \n30 \nAn analytical proton beamlet model   - 12 - \n \n \nFig. 1. Stopping power of secondary/tertiary proton s for the initial proton energies 100 MeV, 160 MeV,  200 \nMeV and 250 MeV. The R CSDA  ranges are indicated by perpendicular straight lines. \n2.6  Landau tail corrections and their influence to the buildup of higher energy proton beams \nAs already indicated, we have not yet determined th e contributions I Lan1  and I Lan2 resulting from the 5 \nmodification of the energy transfer and stopping po wer of protons by corrections resulting from \nLandau tails. A theoretical analysis (Ulmer 2007) yields that symmetrical – i.e. Gaussian - fluctuatio ns \n(and related convolution kernel) of the energy tran sfer according to the continuous-slowing-down-\napproximation (CSDA) are only rigorously valid, if the local proton energy and the energy transfer by \ncollisions are nonrelativistic.  The maximum energy transfer E max  as a function of the local energy for 10 \nprotons in water is shown in Figure L6. E max  has a non-linear term (relativistic correction), w hich \nbecomes more important with increasing energy. In a  similar way, the fluctuations of the energy \ntransfer become less symmetrical; i.e. collisions o ccur much less frequent. This behavior can be \nobserved more and more for proton energies greater than about 100 MeV. A consequence of this \nrelativistic effect is that protons in the incident  region (e.g. 250 MeV, E max  = 617 keV) undergo less 15 \nhits and, on the other side, the energy transfer pe r hit to environmental electrons is much higher tha n \nexpected from a symmetrical energy transfer. Thus, the energy transfer of 250 MeV protons behaves \nin a manner such as if protons with E > 250 MeV or >> 250 MeV would transfer energy in a \nsymmetrical way (in the initial plateau region, a G aussian convolution does not change the Bragg \ncurve obtained by CSDA, but the stopping power at s urface is reduced (ICRU49)).   A buildup effect 20 \ncan be seen as long as the symmetrical fluctuation is not yet reached. This effect decreases along the  \nproton track, and when the local energy approaches about 100 MeV, the fluctuations of the energy \ntransfer tend to become symmetrical and the buildup effect is negligible.   \n \nA relativistic treatment (Dirac equation and Fermi- Dirac statistics - section LR.3) of statistical 25 \nfluctuations of the energy transfer yields that the  inclusion of Landau tails (this leads to a Vavilov  \nAn analytical proton beamlet model   - 13 - \n \ndistribution function) implies modified Gaussian co nvolutions, i.e. a Gaussian convolution with \nrelativistic correction terms expressed by two-poin t Hermite polynomials. Thus, the Gaussian \nconvolution kernel additionally contains a series e xpansion of Hermite polynomials; but for proton \nenergies below about 300 MeV lower order correction s up to second order H 2 are sufficient. The \nresults of these corrections are the following terms: 5 \n( )\n( )\n\n\n\n\n\n\n\n\n\n+=⋅=\n⋅+⋅⋅=\n+⋅−⋅⋅+⋅⋅−=\n\n\n\n\n\n\n\n\n\n\n⋅\n\n\n\n\n\n−+\n\n\n\n\n\n⋅⋅=\n−−\nLs Ls \nin csda Lan \ncsda csda csda Lan \nCSDA \nLan \nCSDA \nLan abs \nLan \nLan \nzzzEcm in z\nER\nRRRC\nRzzRerf zerf N\nCI\n',270 /602 . 0)(\n2 / )492 . 020.00164835  -  20.81208791 (\n2545 . 0002435 . 010 439 . 110 427 . 1\n/''\n0\n01\n2436\n1\n11\n1\n2\n1\n1\nττ\nττ\n    (28) \nPlease note that z’ and consequently zLs  in Eq. (29) agree with Eq. (28). \n \n( )\n( )\n( )\n\n\n\n\n\n\n\n\n\n\n\n\n\n+⋅=\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n−−⋅⋅+=\n\n\n\n>\n≤⋅=\n\n\n\n\n\n\n\n\n\n\n⋅⋅++\n\n\n\n\n\n\n\n\n\n\n −+\n\n\n\n\n⋅\n\n\n\n\n\n−−\n⋅\n−=\n−−\n22\n22\n2\n0\n02\n0\n00\nLan2 \n'\n22\n2\n2\n2\n2\n222\n22\n2\n2\n2\n)(4 . 2;\n795268 .165 \nexp 100161 . 019 . 3\nMeV  168   if 0.022, \nMeV  168   if ,00013059 0\n''\n2\n2\n2\n2\n2\nin straggle Lan Lan \nzR\nLan Lan \nLan \nLan \nLan \nLan \nLan \nLan abs \nLan \nLan \nzEER\nE\nEE.C\neRzzRerf zerf zR\nRN\nCI Lan \nLan \nτττ\nπ\nτ\nττπ\nτ τ\n (29)  \n \nThe contribution terms I\nLan1  and ILan2  have to be accounted for in the previous sections referring to S pp , 10 \nSsp,n  and S rp . Equations (28 – 29) have to be used in the modifi ed form z → z s = z + z shift  and z’ → z s’ = \nz’ + z shift  with regard to the terms S sp  and S rp . A neglect of z shift  in S rp  enables us to add S rp  to S pp . For \nproton energies larger than about 120 MeV, the correction term I Lan2  is of increasing importance. If the \nenergy is lower than 120 MeV, the contribution I Lan1  still remains noteworthy due to impinging \npolychromatic protons. The beamline of protons also  shows a tail in the energy spectrum due to the 15 \nnozzle, range modulator wheel, and inclusion of rea ction protons. It is certainly not sufficient to ta ke \naccount for all these influences by a half-width parameter τin  in a Gaussian convolution. τin  also plays a \nrole in Landau tails. The philosophy of Eclipse TM  (2008) is to reduce fitting parameters as much as \npossible:  \n1. With regard to I \nLan2  we only have assumed that τLan2  remains consistent, if in the polychromatic case 20 \nτin  has the same weight as τstraggle . Possible fittings of C Lan2  and R Lan2  turned out to be superfluous. \n2. Since the influence of the beamline depends on specific properties of the accelerator installation, we \nhave implemented the adaptation of the parameters ILan1  by a fitting procedure in addition to the fitting \nvia τin . According to Eq. (28) the weight of C Lan1  only represents an initial value, which may slight ly \nbe modified by fitting procedures to adapt machine- specific properties with regard to tails 25 \nAn analytical proton beamlet model   - 14 - \n \n(section ’Results’).  The weight of C Lan1  is expected to be affected by the reaction protons  of the \nbeamline; this flexibility is necessary, since with  regard to measured impinging protons we cannot \ndistinguish between primary and secondary protons produced along the beamline (nozzle, etc).  \nThe theoretically evaluated correction terms to acc ount for Landau tails has also been subjected to \ncomparisons with results of GEANT4 with respect to monoenergetic protons, i.e. τin  = 0, in steps of 2 5 \nMeV, beginning with 20 MeV up to 250 MeV. Since GEA NT4 offers the possibility to include either \nVavilov distribution functions or the restriction t o a pure Gaussian fluctuation and to switch on or o ff \nthe Hadronic generator, a comparison yielded that t he difference between the calculation model \naccording to equations (28 – 29) and Monte Carlo ne ver exceeded 2.2 %, and the mean standard \ndeviation amounted to 1.3 %. Referring to polychrom atic proton spectra induced by the beamline, the 10 \nsole check is given by a comparison with experimental data. It should be noted that the contribution to \nthe buildup induced by Landau tails could also be v erified by Monte Carlo. If Landau tails were taken \ninto account, the buildup was increased and reduced , when statistical fluctuations were restricted to a \nGaussian kernel. Figures L7 and L8 in LR.3 present some results of theoretical and GEANT4 \ncalculations for monoenergetic primary protons (150 MeV, 200 MeV and 250 MeV). These examples 15 \nclearly show the increasing role of Landau tails with proton energy. A partially different interpretation \nof buildup effects by secondary protons has previou sly been given (Carlsson et al 1977)). Opposite to \nour results, they interpreted this effect as the only  result of secondary proton generation ( sp,r ) along \nthe proton track (see e.g. Fippel et al 2004, Medin  el al 1997 and Paganetti 2002, where this opinion \nhas been adopted). Fig. 2 presents the total stopping power S and its partial contributions S pp +S rp, Ssp,n , 20 \nSsp,r  and S heavy  for monoenergetic protons (250 MeV). Fig. 3 refers  to Fig. 2 in the buildup region. The \nrole of the reaction protons and Landau tail with r egard to the buildup can be verified in Fig. 4. Thu s \nfor monoenergetic  proton beams the reaction protons ( sp,r ) contribute ca. 65 % to the total buildup. \nThis situation may be rather different for polychro matic proton beams, which we mainly characterize \nbe the parameter τin . In our model τin  enters both, the broadening of the Gaussian rms-va lue as well as 25 \nthe Landau tail in the buildup region, expressed by the calculation of τLan1  and  τLan2  in Eq. (29).  \n \n \n \n \n30 \n \n \nAn analytical proton beamlet model   - 15 - \n \n \n \n \n \nFig. 2. Total stopping power S and related partial contributions of a monoenergetic 250 MeV proton beam.  5 \n \nIf the impinging proton beam is additionally modula ted by collimator scatter, the profiles of Bragg \ncurves may be drastically changed by the collimator -surface distance and field-size (Hong et al 1996, \nUlmer and Schaffner 2006). At every case, the param eter τ\nin  is used to model both, the width of the \nBragg peak region and the role of all protons in the buildup region. 10 \n \n \nFig. 3. Buildup region of Fig. 2. \n \n 15 \n \nFig. 4. Total contribution of all protons of Fig. 2 ,, excepted reaction protons. The buildup is decrea sed; this is \nindicated by the initial straight line. \nAn analytical proton beamlet model   - 16 - \n \n \nWe should note that collimators (blocks) may not on ly have an impact to transverse profiles, but also  \nto the initial plateau of Bragg curves, if collimator-scattered protons cross behind the impinging plane. \nHowever, these effects depend on a lot of specific factors, e.g. collimator distance, SAD, field-size and \ncollimator properties, e.g. used alloy and its length (see Ulmer and Schaffner 2006, Matsinos 2008). 5 \n2.7 Calculation of 3D beamlets and 3D dose \nThis calculation procedure has to be based on the k nowledge of stopping power and lateral scattering \nfunctions. The structure of the scatter kernel K \nlat  consists of two different kernels to treat \nprimary/recoil/nonreaction protons and, on the othe r side, reaction protons and heavy recoils. The \ndetermination of these two kernels is developed in LR.4 (see also Eclipse TM  2008).  10 \nThe dose model is a superposition-convolution algor ithm, i.e. a superposition of individual 3D proton \nbeamlets convolved with the fluence at the position  of the beamlet. The term ‘fluence’ refers here to \nthe undisturbed fluence in air Φair . The calculation and configuration of Φair  is described in detail by \nSchaffner (2008). The fluence in air incorporates all effects, which contribute to the lateral distribution \nof the protons when they exit the beamline. The mai n effects modeled in the fluence are the initial 15 \nlateral penumbra (following the effective source si ze concept introduced by Hong et al 1996), the \nscatter in the compensator and the phase space/weight of scanning pencil beams. The dose calculation \nconcept follows previously published approaches (Schaffner et al 1999, Ulmer et al 2005). In short, it  \nis given by the following formulas: \n( ) ( )( ) ( ) ( ) ( ) ( )[ ] ( )( )\n( )( ) ( ) ( )[ ] ( )( ) \n\n\n\n\n⋅++\n⋅++=\nzdrKzdSzdS\nzdrKzdSzdSzdSzrD\nlat,sec heavy rsp \nprim lat nsp rp pp \nOH\nbeamlet \n,\n,1,\n,\n,,\n2\nρ   (30) 20 \n ( ) ( ) zyxrDzyxzyxD ij beamlet \nji\njiair total ), ,(),,(,, ,\n,\n⋅Φ= ∑                      (31) \nFor the practical computation, we substitute the co nvolution by a sum over beamlets at each point of \nthe calculation grid. Φ air  is always taken at the position corresponding to t he central axis of each \nbeamlet, i.e. x i and y j for the beamlet ij. Please note that Φ0 appearing in sections 2.2 – 2.6 is \ndimensionless and has to be put 1. To save computation time, we describe the lateral  extension of 25 \nrecoil protons by the same kernel as for primary protons, since it can be assumed, that their production \nfollows the distribution of primary protons and the  energy is deposited locally. Heavy recoils deposit  \nmost of their dose through the β+-decay and annihilation or by neutron emission (see listing (27)). This \nmeans that their lateral distribution is very broad . Due to the very small overall contribution of hea vy \nAn analytical proton beamlet model   - 17 - \n \nrecoils, we simply add the dose of heavy recoils to  the dose deposited by secondary reaction protons, \nwhich have in general the broadest distribution. Another option would be to use a weighted sum of the \nsquared contributions from Eq. (31), which is done in Fig. 5. The 3D beamlet (Eq. (30)) is calculated \nfrom the results in the previous sections and LR.4 using the simplifications discussed above. \nThe distance from the central axis of the beamlet i s denoted by r, z is the position along the central  5 \naxis of the beamlet, and d(z) is the water-equivale nt-distance up to the position z. Fig. 5 plots the \nbuilding blocks of the beamlet calculation; the sto pping power distribution in depth and the lateral \ndistribution due to scattering in water. ρH2O  (in Eq. (30)) is the density in water, since we ar e \ncalculating dose to water and not dose to medium – thus following the convention used in photon dose \ncalculation algorithms. The path length correction or scaling of the beamlet in depth for non-water 10 \nmedia is taken into account by using d(z) instead o f a distance from the surface in the beamlet \ncalculation. The path length correction is applied in the same way for the scaling in depth and in the  \nlateral distribution. An improved model for the sca ling of the lateral distribution in heterogeneous \nmedia has been presented by Szymanowski et al (2002). \n 15 \nFig. 5. Example for the lateral dose distribution i n a beamlet for a 250 MeV proton beam. The beam wid th σ is \nequal to τ/√2. Secondary protons exhibit a non-zero width at the entrance. This is due to the contribution of τheavy , \nsee Eq. (L30). The emission of heavy recoil particles from a nuclear reaction is assumed to be isotropic.  \n3.  Results \n3.1  Fitting of the depth dose model to measured pristine Bragg peaks 20 \nWe used measured pristine Bragg peaks to test our m odel. The depth dose measurements were \nperformed differently, depending on the delivery te chnique of the treatment machine. Double \nscattering pristine Bragg peak curves are measured with a thimble ionization chamber in a broad beam. \nIn order to compare them to our model, we correct t he measured pristine Bragg peak curve for SAD \nAn analytical proton beamlet model   - 18 - \n \neffects by using the 1/r 2–law and shift the measurement depth by the water-e quivalent thickness of the \nnozzle (NeT). The values of the NeT was provided by  the machine manufacturer and always lead to a \ngood agreement (better than 1 MeV) between the ener gy obtained from our fits and the nominal \nenergy as provided by the manufacturers. In the cas e of uniform and modulated scanning beams, the \npristine Bragg peak is typically measured from a si ngle static pencil beam with a large parallel plate  5 \nchamber. Only the shift in depth with the water-equ ivalent thickness of the nozzle applies here. When \nfitting the beamlet model to a measured depth dose curve, we only allow a variation of following \nparameters: \n• Spectrum of the initial beam τ\nin  – the main impact of the beamline properties on th e shape of the \ndepth dose curve (see also Fig. 11). 10 \n• The normalization factor N abs , which allows the conversion of the calculated dep th dose from \nMeV/cm to the measured unit of Gy/MU. \n• Energy of the initial beam. The energy is fitted, a nd usually agrees to better than 1 MeV with the \nenergy claimed by the machine manufacturer. Start values of energy fitting are either specifications \nof the manufacturer or the expected R csda  (the 90 % value behind the Bragg peak). 15 \nThese three parameters have the most impact on the shape and the absolute scaling of the depth-dose \ncurve. Minor  corrections are possible by allowing the following parameters to vary: \n• Fraction of secondary protons reaching the water ph antom expressed by the factor υ. A possible \noption (1) is to assume, that a certain percentage of secondary protons are lost along the beamline \ndue to the fact that they are scattered broader tha n the primary component and, therefore, hit the 20 \nprimary collimator. The fraction of secondary protons is only fixed to 1 for scanning beamlines (as \nin Figures 6 – 7). A further option (2) is the appl ication of a specific Monte-Carlo code (Matsinos \n2008) to simulate the beamline characteristics (if all necessary data are available) and to determine \nto the associated phase space. The latter method provides a sufficient calculation basis, whereas the \nfirst way is a pure fitting by ‘try and error’. 25 \n• Landau parameter (C Lan1 ): There is a comparably small dependence of the am ount of Landau \ncorrection on the beamline. However, compared to τin  its impact is small (see also Figures 12 - 13). \nThe depth-dose model is fitted in a two-step approach to the measured pristine Bragg curves after their \nprocessing as explained above. In a first round of fitting, the free parameters are the energy at nozz le \nentrance (E 0), the initial range spectrum τin  and a normalization factor. As already mentioned, we 30 \nallow fitting the contribution of secondary protons  by a variation of υ according to option (1), which \nenters the fluence of secondary protons Фsp,r  (see e.g. equations (L8 – L9)). The use of this op tion \nmakes sense, whenever a considerable fraction of se condary protons may not been detected, as they \nAn analytical proton beamlet model   - 19 - \n \nmight have been stopped along the beamline and option (2) cannot be applied. This condition typically \napplies to scattering beamlines. In the second roun d of fitting, we can fit C Lan1  freely while allowing \nonly a 2% variation of the energy, the range spectr um and the normalization, and a 10% variation of \nthe contribution of secondary protons by the user. Some results of the fitting of our model to measured \npristine Bragg curves are shown in Figure 6 (modula ted scanning, high-energy beam from an Accel 5 \nmachine), Figure 7 (modulated scanning, low-energy beam from an Accel machine) and Figure 8 \n(double scattering, high-energy beam from an IBA ma chine). The match between calculation and \nmodel is excellent for all cases. It has to be poin ted out, that the term I Lan1 depends on the residual \nrange (RCSDA  in Eq. (28)) of the beam when entering the medium.  In scattering techniques, there is \nalways a considerable amount of absorption through the elements of the nozzle. This means that RCSDA  10 \nmust be replaced by R CSDA (E 0) – NeT. This shift in the position of the Landau c orrection can be seen \nin Fig. 8, where the zero position of the depth axi s corresponds to the entry position of the beam int o \nthe nozzle. Measurements and calculation only start after the range shift through the nozzle elements. \n \nFig. 6. Comparison between measured and calculated pristine Bragg peak. The dose is measured with a la rge 15 \nparallel plate chamber across a single 250 MeV penc il beam delivered by the Accel machine. The buildup  is \nmost visible for high-energy beams without absorbin g material in the beamline; it is well described by  the model. \nAn analytical proton beamlet model   - 20 - \n \n \nFig. 7. Comparison of measured and calculated prist ine Bragg peak. The dose is measured with a large p arallel \nplate chamber across a single 68 MeV pencil beam delivered by the Accel machine.  \n \n 5 \nFig. 8. Comparison between a calculated and measure d pristine Bragg peak for the IBA double scattering  \nbeamline at the Korean National Cancer Center (KNCC ). The initial beam energy is 230 MeV. The measured  \ndata points are corrected for SAD effects and shift ed in depth by the nozzle-equivalent thickness of 4 0.7 mm. \nAn analytical proton beamlet model   - 21 - \n \nNote that the buildup effect is also clearly visibl e in this scattering beamline and should not be neg lected for \nhigher energies. The field-size (10 x 10 cm \n2) did not affect this Bragg curve. However, field-s izes smaller than \nthe present one can also affect the initial plateau (Ulmer and Schaffner 2006).   \n \nSince the adaptation of the calculation model to measured data is an essential technical aspect of \n5 \ntherapy planning, we refer to the Eclipse manual (Eclipse TM  2008) for further information.   \n3.2  Lateral scattering \nThe experimental verification of the lateral scatte ring calculation is very challenging due to the sma ll \ncontributions of the large angle scattered primary protons and the secondary protons. Furthermore, \nthere are other contributions to the lateral distri bution of protons (initial phase space of a scanned  10 \nbeam or effective source size and block scattering in a scattered beam) which affect the measurement. \nThe following plots show a comparison between calcu lated beam width and beam width fit to the \nmeasurements using our theory.  \nFigure 9 shows how small the contributions of large r order scattering are. These contributions may be \nnegligible in the situation measured here, but play a more important role in higher energies and also if \n15 \nthe scatter happens in a range shifter at some dist ance from the patient. Especially in the latter cas e, it \nwill affect MU calculations (Pedroni et al 2005). This figure represents one characteristic example of a \nseries of measurements performed with a portal visi on imaging system (Varian PVI TM ) at a scanning \nbeam accelerator (Accel) at various depths and init ial energies. Although detailed presentation goes \nbeyond the scope of this study, we note that the in itial phase space of the beamlets can be accounted 20 \nfor by the initial fluence map Φair  referring to the number of protons and to τRange  (Eq. 17)). As pointed \nout in LR.4 the lateral scattering represented by k ernels Klat,prim  and K lat,sec  in Eq. (30) and the rms-\nvalues τLAT ,…, etc have to be modified. In the domain from the  Bragg peak to the distal end these \nvalues have to be subjected to a convolution to inc lude energy/range straggling and phase space \nproperties (equations L36 – L41), which provide a c igar-shaped profile of a beamlet. These aspects are 25 \npreferably of technical nature of the implementation (see Eclipse TM  2008 and Schaffner 2008).  \n \nAn analytical proton beamlet model   - 22 - \n \n  \nFig. 9. Logarithmic and linear plots of a spot-size  measurement of a 160 MeV beam at a water-equivalen t depth \nof 151 mm for an Accel machine. The black dotted li ne shows the initial phase space, which is subtract ed \nquadratically from the other contributions.  \n 5 \nA very good test of modeling of lateral scattering in a calculation model is the depth dose curve of a  \nvery small proton beam, i.e., the field-size is of the order of the rms values τLat  of the scatter kernel \n(see LR.4) . Fig. 10 presents such an example; the agreement with measurement data is excellent. It is \nonly necessary that the air gap (distance between collimator and impinging surface) is sufficiently long \nto prevent disturbances of scatter protons produced by the collimator wall.  10 \n \n \n \n \n \n15 \n \n \n \n \n \n20 \n \n0\n0,2 \n0,4 \n0,6 \n0,8 \n1\n1,2 \n1,4 \n1,6 \n0 5 10 15 20 \nRelative dose \nz/cm \nCalculation \nData Hong et al \nAirgap: 7 cm \nAn analytical proton beamlet model   - 23 - \n \nFig.10. 158 MeV proton beam passing through a cylin drical collimator with radius r = 2.4 mm. Measureme nt \ndata have been obtained by the Harvard cyclotron.  \n4.  Discussion \nLooking at the results for the fitted parameter, we  typically find agreement between our fitted energy  \nand the energy stated by the machine manufacturer to better than 1 MeV. 5 \nInteresting observations can be made by plotting the initial range spectrum σin  = τin /√ 2 as a function of \nthe nominal energy for a number of different machin es and techniques (Figure 11). The Hitachi \nmachine is a synchrotron, which produces naturally a narrow Bragg peak. The other machines are \ncyclotrons. The lower energies are obtained by degr ading the beam from the cyclotron. This process \ncreates a broad energy spectrum, which needs to be narrowed through energy selection slits. The 10 \nsetting of the energy selection slits is a compromise between the width of the Bragg peak and the beam \nintensity. It seems that this compromise is found a t a very similar width for the three machines by \nAccel, PSI and the IBA machines. The width of the P SI beam is somewhat broader, probably due to \nthe fact that the data from the PSI beamline origin ate from a 600 MeV physics research accelerator \nand therefore was degraded much more than the beams from the other machines. 15 \nThe data points from the Hitachi machine show that the range spectrum seems to increase with the \namount of high density material in the beamline (i. e. the large field configuration ( ) has more lead \nthan the medium field size ( ◊); the scanning beamline ( ∇ ) has no extra material). This shows nicely, \nthat range straggling in higher density materials i s larger than in the same (water-equivalent) amount  \nof low density materials. Since our model does not distinguish between different compositions of the 20 \nbeamline (i.e. τstraggle  from Eq. (7) is not changed), the additional strag gling component is taken into \naccount by the fitting procedure in beam configuration through an increase in τin .  \nWe found that the resulting range spectra as a func tion of the nominal energy can be fitted well by a \n3rd  degree polynomial for both, synchrotron and cyclot ron. This fact allows us to easily model the \npristine Bragg peak curves for intermediate (not configured) energies. 25 \nAn analytical proton beamlet model   - 24 - \n \n \nFig. 11. Range spectra ( τin ) obtained from our depth-dose model for a variety of treatment machines and \ntechniques (MS: Modulated scanning, DS: Doubles sca ttering). It is well known, that a synchrotron (Hit achi) \nusually creates a smaller initial range spectrum, t han a cyclotron (all other machines). It is interes ting to observe \nthat all cyclotrons produce similar range spectra. Note: The Hitachi MS data is obtained from Monte Ca rlos 5 \nsimulated pristine Bragg peak curves; measured data has not yet been available to us. \n \nThe fitting of the Landau parameter C \nLan1  for double scattering (Figure 12) shows quite a bi t of scatter \nbetween different machines and also for different c onfigurations of the beamline (often called \n‘options’) within the same machine. However, the ma gnitude of C Lan1  is the same for all machines and 10 \nthere is a trend towards a minimum at 100-150 mm re sidual range. The effect of these variations of \nCLan1  on the total depth dose calculation is very small and we normally use the Nominal C Lan1  \naccording Eq. (28) for scattering and uniform scanning dose calculations. \nAn analytical proton beamlet model   - 25 - \n \n \nFig. 12. Fit results for C Lan1  for a number of different double-scattering beamli nes and for one uniform scanning \nbeamline. The line corresponds to C Lan1  of Eq. (28). It has been obtained from a polynomia l fit to the data sets \nHitachi MDACC, IBA KNCC (double scattering) and IBA  Florida. The other data sets are plotted for \ncomparison only. The pristine Bragg peak measurements of some other double scattering beamlines could not be 5 \nmeasured up to the surface of the water phantom due  to a restriction to horizontal beam geometry. This  means, \nthat the most relevant data points for the fitting of C Lan1  were missing. Note that the fitting procedure of C Lan1  is \nimplemented due to possible tails of the beamline m odulating the energy spectrum. Only for monoenerget ic \nprotons C Lan1  can be restricted to theoretical values. \n 10 \nThe results for the pristine Bragg peak measurement s from the modulated scanning beamlines show a \nmuch clearer trend for C Lan1  as a function of the residual range (Fig. 13). We usually substitute CLan1  \nfrom Eq. (28) by another 3 rd  degree polynomial with parameters obtained from fi ts to the data points \nof each machine – as indicated by the solid lines i n Fig. 13. In a recent paper, Hollmark at al (2004) \npoint out that, in the domain of the Bragg peak, th e Gaussian solution (one Gaussian) is sufficient fo r 15 \nboth longitudinal energy straggling and lateral sca tter. The corresponding arguments are based on the \ntransition of the more general Boltzmann transport theory to the Fermi-Eyges theory in the low-energy \nlimit. However, it appears that the conclusion is o nly partially true, since the history of the proton  \ntrack has an influence on the behavior in the low-e nergy domain (see above results referring to the \nLandau tails of energy transfer), and, according to  results of Matsuura et al (2006), all types of 20 \nAn analytical proton beamlet model   - 26 - \n \ntransport equations also have more general solutions than given by one Gaussian in the diffusion limit. \nYet the linear combination of two Gaussians with different half-widths, as used in the present study, is \nnot a solution of Fermi-Eyges theory, but a corresponding one of a nonlocal Boltzmann equation. This \nis an integro-differential equation with different transition probabilities for the local and nonlocal  part \n(long-range interaction). In the diffusion limit, t he nonlocal part provides, at least, one additional  5 \nGaussian.   \n \n \nFig. 13. The value of C Lan1  for different modulated-scanning beamlines (Note: Hitachi MDACC originates from \nMonte Carlo calculated pristine Bragg peak). The fi tted lines are 3 rd  degree polynomials. They replace the 10 \nnominal C Lan1  from Eq. (28) in the dose calculation for the respective machines. \n5.  Conclusion \nWe have developed an analytical model for the depth-dose distribution of a proton beam – the pristine \nBragg peak. The model depends on a few beamline-specific parameters (nominal energy, energy/range \nspread, Landau parameter, contribution of secondary protons), which need to be obtained by fitting the 15 \nmodel to the measured pristine Bragg curves. We hav e shown that the model can reproduce the \npristine Bragg curves for different accelerator and  beamline designs. An interpolation of the key \nparameters allows us to accurately calculate any in termediate pristine Bragg peaks; this is particular ly \nimportant for delivery machines which feature an analog energy tuning. \nAn analytical proton beamlet model   - 27 - \n \nThe lateral distribution of the protons is modeled separately for primary and secondary protons; in \norder to describe better the large-angle scattering , the lateral distribution of primary protons is \nmodeled by a sum of two Gaussians. However, it has been shown by Pedroni et al (2005) and Kusano \net al (2007) that a correct modeling of the large-a ngle scattered primary protons and the scattering o f \nthe secondary protons has an important impact on the determination of the MU factor. 5 \nThere are two important features, which have to be taken into consideration in an elaborated therapy \nplanning system such as Eclipse TM  (2008) and have only been treated here marginally:  1. \nHeterogeneity problem; 2. Inclusion of collimator/block scatter in broad beams. \nTo point 1:  The formulas for E(z), dE(z)/dz, etc. for media di fferent from water have been stated \n((equations (1, L4, L5, and table L3)). They can al so be handled by the stepwise manner. The 10 \ndifficulty arises for voxel information of CT with regard to the fixation of E I, Z and A N, since CT only \nprovides the electron density. In Eclipse TM  a proposal of Schneider et al (1996) is implemente d to \nhandle the heterogeneity, and the lateral scatterin g treatment in the case of heterogeneity is based o n \nthe findings of Gottschalk et al (1993), see e.g. Figure L11 in LR.4.  \nTo point 2:   Collimator/block scatter is also implemented in E clipse TM . The algorithm incorporates a 15 \nsecond source  and is based on studies of Matsinos (2008). The sc atter contribution cannot be \nneglected, since it is responsible for ‘horns’ in t he transverse profiles of broad beams. As already \npointed out collimator scatter may also lead to pec uliar Bragg curves of very small field-sizes (Ulmer  \nand Schaffner 2006). \nAcknowledgements \n20 \nMany thanks go to the following institutions and pe rsons for providing the data used in this paper: \nIBA (N. Denef, M. Closset, V. Breev and G. Mathot),  KNCC (S. B. Lee, D. Shin, J. Kwak, D. Kim), \nMDACC (R. Zhu, J. Lii, N. Sahoo and clinical physic s team, M. Bues and George C. (MC data)), \nMPRI (W. C. Hsi), PSI Switzerland (T. Lomax), Unive rsity of Florida (D. Yeung, R. Slopsema), \nVarian-Accel (J. Heese), Varian iLab (D. Morf). Ano ther ’Thank you’ goes to the colleagues B. 25 \nSchaffner, C. Ritzmann and W. Kaissl for implementations and useful discussions and to the Reviewer \nof this journal for helpful comments.  \n \nReferences \nBethe H A 1953 Molière’s theory of multiple scattering Phys. Rev . 89 1256  30 \nBethe H A and Ashkin J 1953 Passage of radiations t hrough matter Experimental Nuclear Physics (E. Segrè Ed.)  \nWiley New York 1953, p. 176 \nBloch F 1933 Zur Bremsung rasch bewegten Teilchen b eim Durchgang durch Materie Ann der Physik  16 285 – \n292 \nBoon S N 1998 Dosimetry and quality control of scanning proton beams PhD Thesis Rijks University Groningen 35 \nAn analytical proton beamlet model   - 28 - \n \nBortfeld T 1997 An analytical approximation of the Bragg curve for therapeutic proton beams Med. Phys.  24(12) \n2024 \nCarlsson C A and Carlsson G A 1977 Proton dosimetry  with 185 MeV protons - dose buildup from secondary  \nprotons and recoil electrons  Health Physics 33 481 \nCarlsson A K, Andreo P and Brahme A 1997 Monte Carl o and analytical calculation of proton pencil beams  for 5 \ncomputerized treatment plan optimization  Phys. Med. Biol.  42 103 \nChadwick  M B and Young P G 1996 Proton nuclear int eractions with \n12 C, 14 N, 16 O, 31 P and 40 Ca for \nradiotherapy applications: evaluated data libraries  to 250 MeV Los Alamos National Laboratory Report LAUR -\n96-1649 \nCiangaru G, Polf J, Bues M and Smith A 2005 Benchma rking analytical calculations of proton doses in 10 \nheterogeneous matter Med. Phys . 32 3511 \nDeasy J O 1998 A proton dose calculation algorithm for conformal therapy simulations based on Molière’ s \ntheory of lateral deflections Med. Phys.  25 476 \nEclipse \nTM  2008 User Manual - Varian Treatment Planning System - Varian Medical Systems Inc.                                  \nhttp://www.varian.com/us/oncology/radiation_oncology/eclipse/protons/calculation model /  15 \nFippel M and Soukup M 2004 A Monte Carlo dose calculation algorithm for proton therapy Med. Phys.  31 2263 \nGEANT4-Documents 2005 http://geant4.web.cern/geant4/G4UsersDocuments/Overview/html/  \nGottschalk B, Koehler A M, Schneider R J, Sisterson J M and Wagner M S 1993 Multiple Coulomb scattering of \n160 MeV protons Nucl. Instr. and Meth B74 467 \nGottschalk B, Platais R and Platais H 1999 A test of Monte Carlo nuclear models Med. Phys . 26 2597  20 \nHighland V L 1975 Some practical remarks on multiple scattering  Nucl . Instr. Meth.  129 497 \nHighland V L 1979 Erratum on some practical remarks on multiple scattering  Nucl. Instr. Meth.  161 171 \nHollmark M, Uhrdin J, Belkic D, Gudowska I and Brah me A  2004 Influence of multiple scattering and ene rgy \nloss straggling on the absorbed dose distributions of therapeutic light ion beams: 1. Analytical penci l beam \nmodel  Phys. Med. Biol.  49 3247 25 \nHong L, Goitein M, Bucciolini M, Comiskey R, Gottsc halk B, Rosenthal S, Serago C and Urie M 1996 A pen cil \nbeam algorithm for proton dose calculations  Phys. Med. Biol.  41 1305 \nICRU 1993 Stopping powers and ranges for protons and α -particles ICRU Report 49 (Bethesda, MD) \nKusano Y, Kanai T, Yonai S, Komori M, Ikeda N, Tach ikawa Y, Ito A and Uchida H 2007 Field-size \ndependence of doses of therapeutic carbon beams Med. Phys.  34 4016 30 \nJiang H and Paganetti H 2004 Adaptation of GEANT4 t o Monte Carlo dose calculations based on CT data Med. \nPhys.  31 2811 \nMatsinos E 2008 Collimator effects in proton planning - available from: http://arxiv.org/abs/0811.1076   \n Matsuura T and Saitoh S 2006 Analytical and numeri cal inversion formulas in the Gaussian convolution by \nusing the Paley-Wiener spaces Applicable Analysis  85 901 35 \nMedin J and Andreo P 1997 Monte Carlo calculated st opping-power ratios, water/air for clinical proton \ndosimetry (50 – 250 MeV) Phys. Med. Biol. 42 89  \nMolière G 1955 Theorie der Streuung schneller geladener Teilchen III Z. Naturforschung  10a 177    \nPaganetti H 2002 Nuclear interactions in proton the rapy: dose and relative biological effect distribut ions \noriginating from primary and secondary particles Phys. Med. Biol. 47 747  40 \nPedroni E, Scheib S, Böhringer T, Coray A, Grossman n M, Lin S and Lomax A 2005 Experimental \ncharacterization and physical modelling of the dose distribution of scanned proton pencil beams Phys. Med. Biol.  \n50 541 \nPetti P 1996 Evaluation of a pencil-beam dose calculation technique for charged particle radiotherapy Int. J. Rad. \nOncol. Biol. Phys . 351049 45 \nAn analytical proton beamlet model   - 29 - \n \nRussel K R, Isacson U,  Saxner M, Ahnesjö A, Montel ius A, Grusell E, Dahlgren C, Lorin S and Glimelius  B \n2000 Implementation of pencil kernel and depth pene tration algorithms for treatment planning of proton  beams \nPhys. Med. Biol. 45 9 \nSandison G, Lee C, Lu X and Papiez L 1997 Extension  of a numerical algorithm to proton dose calculatio ns - \ncomparison with Monte Carlo simulations Med. Phys.  24 841 5 \nSandison G and Chvetsov A 2000 Proton loss model for therapeutic beam dose calculations Med. Phys.  27 2133 \nSchaffner B, Pedroni E and Lomax A 1999 Dose calcul ation models for proton treatment planning using a \ndynamic beam delivery system: an attempt to include  density heterogeneity effects in the analytical do se \ncalculation Phys. Med. Biol.  44 27 \nSchaffner B 2008 Proton dose calculation based on in-air fluence measurements Phys. Med. Biol . 53 1545 10 \nSchneider U, Pedroni E and Lomax A 1996 The calibra tion of CT Hounsfield units for radiotherapy treatm ent \nplanning Phys. Med. Biol.  41, 111 - 124 \nSegrè E 1964 Nuclei and Particles (New York (N.Y.): Benjamin) \nSzymanowski H and Oelfke U 2002 Two-dimensional pen cil beam scaling: an improved proton dose algorithm  \nfor heterogeneous media Phys. Med. Biol.  47 3313 15 \nTourovsky A, Lomax A, Schneider U and Pedroni E 200 5 Monte Carlo dose calculation for spot scanned pro ton \ntherapy Phys. Med. Biol.  50 971 \nUlmer W, Pyyry J and Kaissl W 2005 A 3D photon supe rposition/convolution algorithm and its foundation on \nresults of Monte Carlo calculations Phys. Med. Biol.  50 1767   \nUlmer W and Schaffner B 2006 Energy shifts and corr esponding spectral distributions of collimator scat ter of 20 \nproton beams IFMBE Proceedings of World Congress on  Medical Physics and Biomedical Engineering 2006 \nSeoul, Springer publishing, Berlin – Heidelberg – N ew York,  2125  \nUlmer W 2007 Theoretical aspects of energy-range re lations, stopping power and energy straggling of pr otons \nRad. Phys. Chem. 76 1089 \nUlmer W and Matsinos E W 2010 Theoretical methods f or the calculation of 3D proton dose distributions.  25 \nReview book – Rad. Phys. & Chem. in press  \nUlmer W and Matsinos E 2010 Second source model of collimator scatter and spectra of proton beams IFMB E \nProceedings of World Congress on Medical Physics an d Biomedical Engineering 2009 München, Springer \npublishing, Berlin – Heidelberg – New York, 2501 \nZerby C D and Kinney W E 1965 Calculated tissue-to-dose conversion factos for nucleons below 400 MeV N ucl. 30 \nInstr. Meth. 36 125  ",
  "topic": "Proton",
  "concepts": [
    {
      "name": "Proton",
      "score": 0.8090487122535706
    },
    {
      "name": "Monte Carlo method",
      "score": 0.8068534135818481
    },
    {
      "name": "Recoil",
      "score": 0.6960168480873108
    },
    {
      "name": "Physics",
      "score": 0.665982723236084
    },
    {
      "name": "Range (aeronautics)",
      "score": 0.5967090129852295
    },
    {
      "name": "Proton therapy",
      "score": 0.5580953359603882
    },
    {
      "name": "Gaussian",
      "score": 0.5170986652374268
    },
    {
      "name": "Computational physics",
      "score": 0.49130430817604065
    },
    {
      "name": "Scattering",
      "score": 0.4839096963405609
    },
    {
      "name": "Beamline",
      "score": 0.45839038491249084
    },
    {
      "name": "Nuclear physics",
      "score": 0.4344981014728546
    },
    {
      "name": "Atomic physics",
      "score": 0.4292324185371399
    },
    {
      "name": "Materials science",
      "score": 0.15629997849464417
    },
    {
      "name": "Optics",
      "score": 0.141294926404953
    },
    {
      "name": "Beam (structure)",
      "score": 0.13783180713653564
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0670885443687439
    },
    {
      "name": "Mathematics",
      "score": 0.060862183570861816
    },
    {
      "name": "Statistics",
      "score": 0.0
    },
    {
      "name": "Composite material",
      "score": 0.0
    }
  ]
}