{
    "title": "Use of Ultrasound Measurement of the Inferior Vena Cava Diameter as an Objective Tool in the Assessment of Children with Clinical Dehydration",
    "url": "https://openalex.org/W2048941056",
    "year": 2007,
    "authors": [
        {
            "id": "https://openalex.org/A2098089928",
            "name": "Lei Chen",
            "affiliations": [
                "University of New Haven"
            ]
        },
        {
            "id": "https://openalex.org/A2113076565",
            "name": "Yunie Kim",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1715053027",
            "name": "Karen A. Santucci",
            "affiliations": [
                "University of New Haven"
            ]
        },
        {
            "id": "https://openalex.org/A2098089928",
            "name": "Lei Chen",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1715053027",
            "name": "Karen A. Santucci",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2145696983",
        "https://openalex.org/W1970783853",
        "https://openalex.org/W2134915804",
        "https://openalex.org/W1975350755",
        "https://openalex.org/W2139900155",
        "https://openalex.org/W2157992236",
        "https://openalex.org/W2319359935",
        "https://openalex.org/W2073099285",
        "https://openalex.org/W2040327048",
        "https://openalex.org/W2073630171",
        "https://openalex.org/W1996741646",
        "https://openalex.org/W2166927380",
        "https://openalex.org/W2004186108",
        "https://openalex.org/W2025475908",
        "https://openalex.org/W2043297569",
        "https://openalex.org/W1547004776"
    ],
    "abstract": "Objectives: Bedside ultrasonography (US) measurement of the inferior vena cava (IVC) and aorta (Ao) may be useful in objectively assessing children with dehydration. The objectives of this study were 1) to compare the IVC and Ao diameters (IVC/Ao) ratio of dehydrated children with controls and 2) to compare the IVC/Ao ratio before and after intravenous (IV) rehydration in children with dehydration. Methods: This prospective observational study was performed in an urban pediatric emergency department. Children between 6 months and 16 years of age with clinical evidence of dehydration were enrolled. Bedside US measurements of the IVC and Ao were taken before and immediately after IV fluids were administered. An age‐, gender‐, and weight‐matched control without dehydration was enrolled for each subject. The IVC/Ao ratios of subjects and controls were compared using Wilcoxon signed rank test, as were the ratios before and after IV hydration for each subject. Results: Thirty‐six pairs of subjects and matched controls were enrolled. The IVC/Ao ratios in the subjects were lower as compared with controls (mean of 0.75 vs. 1.01), with a mean difference of 0.26 (95% confidence interval = 0.18 to 0.35). In subjects, the IVC/Ao ratios were significantly lower before IV hydration (mean of 0.75 vs. 1.09), with a mean difference of 0.34 (95% confidence interval = 0.29 to 0.39). Conclusions: As measured by bedside US measurement, the IVC/Ao ratio is lower in children clinically assessed to be dehydrated. Furthermore, it increases with administration of IV fluid boluses.",
    "full_text": null
}