{
    "title": "Electromagnetic model of turn-to-turn short circuits in transformers",
    "url": "https://openalex.org/W2054793125",
    "year": 2004,
    "authors": [
        {
            "id": "https://openalex.org/A2576407267",
            "name": "Guzmán Díaz González",
            "affiliations": [
                "Universidad de Oviedo"
            ]
        },
        {
            "id": "https://openalex.org/A2178896098",
            "name": "Javier Gomez Aleixandre Fernandez",
            "affiliations": [
                "Universidad de Oviedo"
            ]
        },
        {
            "id": "https://openalex.org/A4294537589",
            "name": "Pablo Arboleya Arboleya",
            "affiliations": [
                "Universidad de Oviedo"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W1992062615",
        "https://openalex.org/W2149693114",
        "https://openalex.org/W2030116664",
        "https://openalex.org/W2149202626",
        "https://openalex.org/W2163432340",
        "https://openalex.org/W6677780928",
        "https://openalex.org/W2103881001",
        "https://openalex.org/W2137993520",
        "https://openalex.org/W4230948665",
        "https://openalex.org/W2120454036",
        "https://openalex.org/W2134685614",
        "https://openalex.org/W2099033540",
        "https://openalex.org/W2029023366"
    ],
    "abstract": "In the past years, there has been an increasing concern about turn-to-turn faults in power transformers, due to the high costs that unexpected outages cause. It is not always possible to analyse the transformer behaviour under such faults at rated conditions, since the tests are largely destructive. Therefore, models are of great importance to avoid severe damage to machines. In this paper, a model based on flux rearrangement around the damaged turn is presented. Two roles are assigned simultaneously to the damaged turn – i.e. the turn is seen as damaged but segregated from winding, and virtually undamaged belonging to the winding – and the damaged turn leakage flux is considered to be a coupling flux between the two roles. Thus, complex relations of magnetic couplings between the turn and the rest of the transformer are avoided, resulting in a very fast model, easy to develop further, which has been validated through a comparison with a finite element model.",
    "full_text": null
}