{
    "title": "Use of physiological parameters as fast tools to screen for drought tolerance in sugarcane",
    "url": "https://openalex.org/W2078877248",
    "year": 2007,
    "authors": [
        {
            "id": "https://openalex.org/A4319135374",
            "name": "Marcelo de A Silva",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2325705587",
            "name": "John L. Jifon",
            "affiliations": [
                "Texas A&M University"
            ]
        },
        {
            "id": "https://openalex.org/A4212386413",
            "name": "Jorge A. G. Da Silva",
            "affiliations": [
                "Texas A&M University"
            ]
        },
        {
            "id": "https://openalex.org/A2055393275",
            "name": "Vivek Sharma",
            "affiliations": [
                "Texas A&M University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W1969021952",
        "https://openalex.org/W2171739998",
        "https://openalex.org/W1977991211",
        "https://openalex.org/W2027553208",
        "https://openalex.org/W2105535882",
        "https://openalex.org/W2027901719",
        "https://openalex.org/W2092042833",
        "https://openalex.org/W2171069014",
        "https://openalex.org/W1515333244",
        "https://openalex.org/W2069795010",
        "https://openalex.org/W2165025405",
        "https://openalex.org/W1983625498",
        "https://openalex.org/W2024925469",
        "https://openalex.org/W2518793873",
        "https://openalex.org/W2114681276",
        "https://openalex.org/W2132527497",
        "https://openalex.org/W2072010256",
        "https://openalex.org/W1498632236",
        "https://openalex.org/W1997995595",
        "https://openalex.org/W1975485061",
        "https://openalex.org/W2107524189",
        "https://openalex.org/W2077760106",
        "https://openalex.org/W1996392509",
        "https://openalex.org/W2087999148",
        "https://openalex.org/W4296535396",
        "https://openalex.org/W2058064101",
        "https://openalex.org/W3148222498",
        "https://openalex.org/W4241219663",
        "https://openalex.org/W3002297614",
        "https://openalex.org/W2460094607"
    ],
    "abstract": "Drought is one of the major limitations to plant productivity worldwide. Identifying suitable screening tools and quantifiable traits would facilitate the crop improvement process for drought tolerance. In the present study, we evaluated the ability of four relatively physiological parameters (variable-to-maximum chlorophyll a fluorescence ratio, F v/F m; estimated leaf chlorophyll content via SPAD index; leaf temperature, LT; and, leaf relative water content, RWC) to distinguish between drought tolerant and susceptible sugarcane genotypes subjected to a 90-d drought cycle. Eight field-grown genotypes were studied. By 45 d after the onset of treatments, the F v/F m, SPAD index and RWC of drought-stressed plants had declined significantly in all genotypes compared to values at the onset of well-watered treatments. However, the reductions were more severe in leaves of susceptible genotypes. Under drought stress, the tolerant genotypes as a group, maintained higher F v/F m (8%), SPAD index (15%), and RWC (16%) than susceptible genotypes. In general, LT of drought-stressed plants was higher (~4ºC) than that of well-watered plants but the relative increase was greater among drought susceptible genotypes. Under drought stress, LT of tolerant genotypes was on average 2.2ºC lower than that of susceptible genotypes. The results are consistent with the tolerant-susceptible classification of these genotypes and indicate that these tools can be reliable in screening for drought tolerance, with F v/F m, SPAD index and LT having the added advantage of being nondestructive and easily and quickly assessed.",
    "full_text": "Braz. J. Plant Physiol., 19(3):193-201, 2007\nRESEARCH ARTICLE\nUse of physiological parameters as fast tools to screen\nfor drought tolerance in sugarcane\nMarcelo de A. Silva 1*, John L. Jifon 2, Jorge A.G . Da Silva2 and Vivek Sharma2\n1APTA Regional Centro-Oeste, 17201-970 Jaú, SP , Brazil. 2Texas Agricultural Experiment Station, Texas A&M University\nSystem, Weslaco, TX, 78596, USA. *Corresponding author: marcelosilva@apta.sp.gov.br\nReceived: 25 July 2007; Returned for revision: 13 October 2007; Accepted: 05 December 2007\nUse of physiological parameters as fast tools to screen for drought tolerance in sugarcane: Drought is one of the major\nlimitations to plant productivity worldwide. Identifying suitable screening tools and quantifiable traits would facilitate the\ncrop improvement process for drought tolerance. In the present study, we evaluated the ability of four relatively physiological\nparameters (variable-to-maximum chlorophyll a fluorescence ratio, F\nv/Fm; estimated leaf chlorophyll content via SPAD index;\nleaf temperature, LT; and, leaf relative water content, RWC) to distinguish between drought tolerant and susceptible\nsugarcane genotypes subjected to a 90-d drought cycle. Eight field-grown genotypes were studied. By 45 d after the onset of\ntreatments, the Fv/Fm, SPAD index and RWC of drought-stressed plants had declined significantly in all genotypes compared\nto values at the onset of well-watered treatments. However, the reductions were more severe in leaves of susceptible\ngenotypes. Under drought stress, the tolerant genotypes as a group, maintained higher F\nv/Fm (8%), SPAD index (15%), and\nRWC (16%) than susceptible genotypes. In general, LT of drought-stressed plants was higher (~4°C) than that of well-watered\nplants but the relative increase was greater among drought susceptible genotypes. Under drought stress, LT of tolerant\ngenotypes was on average 2.2°C lower than that of susceptible genotypes. The results are consistent with the tolerant-\nsusceptible classification of these genotypes and indicate that these tools can be reliable in screening for drought tolerance,\nwith F\nv/Fm, SPAD index and LT having the added advantage of being nondestructive and easily and quickly assessed.\nKey words: c hlorophyll a fluorescence, relative water content, leaf temperature,  Saccharum , water deficit\nUso de parâmetros fisiológicos como ferramentas rápidas para selecionar tolerância à seca em cana-de-açúcar: A seca é\numa das maiores limitações à produtividade das plantas em todo o mundo. Identificar ferramentas satisfatórias de seleção e\ncaracterísticas quantitativas facilitaria o processo de melhoramento de uma cultura para tolerância à seca. No presente estudo,\nfoi avaliada a adequação de quatro parâmetros fisiológicos (razão entre fluorescências variável e máxima da clorofila a, F\nv/Fm;\nestimativa do conteúdo de clorofila na folha via o índice SPAD; temperatura da folha, TF; e conteúdo relativo de água na folha,\nCRA) para distinguir entre genótipos de cana-de-açúcar tolerantes e suscetíveis submetidos a um ciclo de 90 dias de déficit\nhídrico. Foram avaliados oito genótipos, cultivados sob condições de campo. Aos 45 dias após o estabelecimento dos\ntratamentos, F\nv/Fm, índice SPAD e CRA das plantas sob estresse declinaram significativamente em todos os genótipos,\ncomparados aos respectivos controles sob condições ideais de irrigação. Entretanto, as reduções foram mais severas nas\nfolhas dos genótipos suscetíveis à seca. Sob estresse hídrico, o grupo dos genótipos tolerantes manteve maiores valores de\nFv/Fm (8%), índice SPAD (15%) e CRA (16%) do que os dos genótipos suscetíveis. Em geral, TF das plantas sob estresse foi\nmaior (~4 oC) que TF das plantas sob condições ideais de água, mas o aumento relativo foi maior entre os genótipos\nsuscetíveis. Sob déficit hídrico, TF dos genótipos tolerantes foi, em média, 2,2 oC menor do que a dos genótipos suscetíveis.\nOs resultados são consistentes com a classificação desses genótipos como tolerantes/suscetíveis e indicam que essas\nferramentas podem ser confiáveis na seleção para tolerância à seca, com F\nv/Fm, índice SPAD e TF tendo a vantagem adicional\nde serem técnicas não-destrutivas e de fácil e rápido emprego.\nPalavras-chave:  conteúdo relativo de água, déficit hídrico, fluorescência da clorofila a, Saccharum , temperatura da\nfolha\n194\nBraz. J. Plant Physiol., 19(3):193-201, 2007\nM.A. SILV A et al.\nINTRODUCTION\nSugarcane ( Saccharum spp.) is an important crop\nglobally not only for sugar production, but also\nincreasingly as a bioenergy crop due to its phenomenal\ndry matter production capacity. Drought is one of the\nmost important environmental stress factors limiting\nsugarcane production worldwide (Venkataramana et al.,\n1986). Due to the erratic nature of rainfall, sugarcane\ngrowers rely heavily on irrigation to meet production\ngoals. However, water for irrigation is a limited and\ncontentious resource and its effective management is\ncritical, not only in reducing wasteful usage, but also in\nreducing production costs and sustaining productivity.\nDevelopment of drought tolerant sugarcane germplasm is\nthus crucial for sustaining production in areas where\nwater supply is limited.\nWater deficit stress is known to alter a variety of\nphysiological processes such as radiation capture, leaf\ntemperature (LT), stomatal conductance, transpiration,\nelectron transport, photosynthesis and respiration which\nultimately determine yield (Qing et al.,  2001). The amount\nof water used by a crop is closely associated with\nphotosynthetic activity, dry matter production and yield\nin many species (Tollenaar and Aguilera, 1992; Qing et al.,\n2001). However, the maximum photosynthetic potential of\ncrops is seldom reached due to unfavorable\nenvironmental factors, including drought.\nThe degree of limitation of yield by environmental\nstresses varies even among genotypes within a species\n(Wolfe et al., 1988; Aguilera et al., 1999). Therefore, the\nability to maintain key physiological processes, such as\nphotosynthesis during moderate drought stress, is\nindicative of the potential to sustain productivity under\nwater shortage. For instance, differences in dry matter\naccumulation between old and new corn hybrids have\nbeen shown to depend on the ability to maintain higher\nphotosynthetic rates after silking for newer hybrids\n(Tollenaar and Aguilera, 1992). O’Neill et al. (2006) also\nhypothesized that photosynthetic rates of drought\ntolerant corn hybrids were higher than those of\nsusceptible hybrids during the critical post-flowering\ngrowth period and concluded that photosynthetic\nassessments during this growth stage could be useful in\nidentifying stress tolerant genotypes.\nIn sugarcane, four distinct growth stages have been\ncharacterized, namely: germination, tillering, grand\ngrowth and maturity (Gascho and Shih, 1983). The\ntillering and grand growth stages, known as the\nsugarcane formative phase, have been identified as the\ncritical water demand period (Ramesh, 2000), mainly\nbecause this is the phase when 70-80% of cane yield is\nproduced (Singh and Rao, 1987). Water relations and\nphotosynthetic responses to water deficit stress during\nthis growth stage could therefore be useful in identifying\ndrought tolerant genotypes.\nAlthough measurements of leaf photosynthesis rate\nhave been shown to be reliable in distinguishing between\ndrought tolerant and susceptible genotypes of some\nspecies such as sunflower (Gimenez et al., 1992), gas\nexchange techniques of assessing photosynthesis are\nlaborious and not practical in crop improvement\nprograms (Earl and Tollenaar, 1999). Rong-hua et al.\n(2006), working with barley, showed that indirect and\nfaster methods of measuring photosynthetic activity,\nsuch as chlorophyll a fluorescence technique, par-\nticularly the maximum photochemical efficiency of\nphotosystem II – PSII (which can be assessed via the\nvariable-to-maximum chlorophyll a fluorescence ratio,  F\nv/\nFm) and estimated chlorophyll content (SPAD index), can\nbe as effective as the more time-consuming gas exchange\ntechniques in revealing differences between drought\ntolerant and susceptible genotypes. Other physiological\nparameters such as LT and relative water content (RWC)\nare also very responsive to drought stress and have been\nshown to correlate well with drought tolerance (Jamaux et\nal., 1997; Altinkut et al., 2001; Colom and Vazzana, 2003).\nThe reliability of these parameters to distinguish\nbetween stress tolerant and susceptible genotypes\nseems to depend on the species under consideration\n(Colom and Vazzana, 2003; O’Neill et al., 2006; Rong-hua\net al., 2006) since different species may possess different\nmechanisms of stress resistance and/or tolerance. To\nour knowledge, no studies have evaluated these\nrelationships in sugarcane. Careful selection of suitable\nphysiological traits and rapid/nondestructive methods of\nquantifying them would be very valuable in improving\ndrought tolerance. In the present study we evaluated the\nability of four relatively rapid parameters, namely the F\nv/\nFm ratio, the SPAD index, LT, and leaf RWC to distinguish\nbetween sugarcane genotypes known to be either\ndrought tolerant or susceptible.\n195\nBraz. J. Plant Physiol., 19(3):193-201, 2007\nSCREENING FOR DROUGHT TOLERANCE IN SUGARCANE\nMATERIAL  AND METHODS\nThis study was conducted near Weslaco (26 o 12’ N,\n97o 57’ W, elevation 18.90 m), TX, USA, during the 2005-\n2006 growing season in a commercial field with a sandy\nclay loam soil type. The experiment was arranged in a\ncomplete block design within a three-factor factorial,\nwhere the first factor was composed of eight genotypes;\nthe second factor was composed by two irrigation levels\n(wet and dry), and the third factor composed of three\nevaluation dates (0, 45 and 90 d after water deficit\nimposition), with four replicates.\nThe eight sugarcane genotypes analyzed in this\nstudy were categorized into two groups based on long-\nterm field observations (vigor) about yield performance\nunder drought conditions in south Texas, USA: drought\ntolerant (HOCP85-845, TCP02-4587, TCP02-4620 and\nUS01-40) and drought susceptible (CP72-1210, CP92-675,\nH99-295 and TCP02-4624). Each genotype was planted in\nthree rows, 3 m long, and 1.5 m apart on 14 November 2005;\ndata were collected only from plants in the central row.\nTwo irrigation treatments (well-watered and drought)\nwere initiated at 180 d after planting, i.e. during the grand\ngrowth phase (Gascho and Shih, 1983). The well-watered\nplots were irrigated at 50% depletion of available soil\nmoisture (DASM), whereas drought plots were irrigated\nat 80% DASM. Soil moisture depletion was monitored\nperiodically with a neutron probe.\nPhysiological parameters were measured three times\nduring the study: at 0, 45 and 90 d after the onset of\nirrigation treatments (DAT) on cloudless days and\nbetween approximately 0900 h and 1500 h. Chlorophyll a\nfluorescence characteristics were measured on intact\nleaves using a pulse amplitude modulation fluorometer\n(Model OS5-FL, Opti-Sciences, Tyngsboro, MA, USA),\nand used to estimate the extent of drought-induced\nphotoinhibition. During each measurement date, at least\nfour leaves per plot were dark-adapted for 30 min using\nleaf clips (FL-DC, Opti-Science) before fluorescence\nmeasurements. The F\nv/Fm ratio parameter was determined\nfollowing the procedures of Maxwell and Johnson (2000),\nand used as to quantify the degree of drought-induced\nphotoinhibition.\nLeaf chlorophyll content (SPAD index) was estimated\nnondestructively, using a SPAD-502 chlorophyll meter\n(Minolta Corp., Ramsey, NJ, USA). This index was used\npreferentially because the strong relationship between\nreadings of portable chlorophyll meter and leaf\nchlorophyll content has been demonstrated by several\nauthors (e.g. Yadava, 1986; Marquard and Tipton, 1987,\nMarkwell et al., 1995). The average of five measurements\ntaken on different plants in each plot was recorded.\nLeaf temperature readings were collected using a\nhand-held infrared thermometer (Model OS530HR,\nOmega Engineering Inc., Stamford CT, USA) with leaf\nemissivity set at 0.95. During each LT measurement, the\nnatural leaf orientation with respect to the sun was\nmaintained to avoid shade effects.\nFollowing the LT measurements, leaf disks (1.3 cm\ndiameter each) were collected with a cork borer from the\nsame leaves used for F\nv/Fm, SPAD index and LT\nmeasurements and used to determine leaf relative water\ncontent (RWC) following the method of Matin et al.\n(1989). Five disks per plant were collected, immediately\nsealed in glass vials and quickly transported to the\nlaboratory in an ice-cooled chest. Leaf disk fresh weights\nwere determined within 2 h after excision. The turgid\nweight was obtained after rehydration in deionized water\nfor 24 h at room temperature. After rehydration, leaves\nwere quickly and carefully blotted dry with lint-free tissue\npaper before determining turgid weight. Dry weights were\nrecorded after oven-drying leaf samples for 48 h at 80ºC.\nThe cane productivity was calculated from the weight\nof all millable canes per plot and the area occupied by\neach plot (t ha\n-1) at 425 d after trial planting.\nData were subjected to an analysis of variance\n(ANOV A) and where appropriate, mean separation was\nperformed using the least significance difference (LSD; P\n< 0.05) procedures of the SPSS statistical package (SPSS\nStudent version 15.0). Genotypes and irrigation treat-\nments were considered fixed effects and replication random\neffects. Evaluation dates were repeated observations in\nthe analysis. Linear correlation analysis was used to\ndetermine the association among F\nv/Fm, SPAD index, LT,\nleaf RWC, and stalk productivity on each date.\nRESULTS AND DISCUSSION\nAverage air temperatures during the study period\n(November 2005 to August 2006) ranged from ca. 20 to ca.\n31°C (Figure 1) and cumulative rainfall during this period\nwas 158.2 mm. The wet and dry treatments received\nadditional 299.5 and 184.1 mm, respectively, in irrigation.\nThus, the total water inputs were 457.8 and 342.4 mm for\n196\nBraz. J. Plant Physiol., 19(3):193-201, 2007\nM.A. SILV A et al.\nthe wet and dry treatments respectively, applied in eight\n(wet) and five (dry) irrigation events.\nAccording to Kumar (2005), a plant or a group of\nplants showing better growth and productivity with\nlimited soil moisture than other plants in a given set of\nsimilar environments is understood to be tolerant to\ndrought. Bearing this definition in mind and based on the\nlong-term yield performance under drought conditions in\nsouth Texas, the genotypes TCP02-4587, TCP02-4620,\nUS01-40 and HOCP85-845 were considered drought\ntolerant. However, as Figure 2 shows, in the current\nexperiment crop yield for HOCP85-845 differed\nsignificantly under well-watered (135.2 t.ha\n-1 ) and\ndrought-stress conditions (107.0 t.ha -1), although the\ngenotype was able to maintain relatively high yield under\nboth watering conditions. The genotypes CP92-675, H99-\n295, TCP02-4624 and CP72-1210 were considered drought\nsusceptible; in this group crop yield of the first three\ngenotypes significantly decreased in response to water\ndeficit application, but not that of CP72-1210 (Figure 2).\nSignificant genotype by irrigation (GxW), genotype\nby evaluation date (GxD) and irrigation by evaluation\ndate (WxD) interactions were observed for photosystem\nII (PSII) photochemical efficiency ( F\nv/Fm) measurements\n(Table 1). Under well-watered conditions, tolerant as well\nas susceptible genotypes maintained high Fv/Fm values\n(~0.82-0.83) similar to those of healthy leaves (Hall and\nRao, 1994). Drought stress generally resulted in\ndecreased Fv/Fm, which was evident only in drought-\nsusceptible genotypes (Tables 2 and 3). Stress-induced\nreduction in Fv/Fm is indicative of photoinhibition\nassociated with an over-reduction of PSII (Maxwell and\nJohnson, 2000). The ability to maintain high F\nv/Fm under\ndrought stress thus indicates a high efficiency of\nradiation use possibly for photochemistry and carbon\nassimilation. Colom and Vazzana (2003) have reported\nsimilar correlations between F\nv/Fm and drought tolerance\nin Erasgrostis curvula  cultivars, with high Fv/Fm values\nbeing associated with drought tolerance and low Fv/Fm\nvalues being associated with susceptibility to drought\nstress. The relatively rapid response of Fv/Fm to mild\ndrought stress makes it a promising trait for screening\nsugarcane germplasm for drought tolerance.\nEstimated leaf chlorophyll content (SPAD index)\nresponses to drought stress were similar to those\nobtained for F\nv/Fm with the exception of the non-\nsignificant GxD interaction. SPAD index was significantly\naffected by GxW and WxD interactions (Table 1). SPAD\nindex declined progressively with exposure to drought\nbut the decline was more severe in genotypes from the\nsusceptible group, as could be deduced from Tables 2\nand 3. TCP02-4587 had the highest SPAD index values\nunder drought conditions and TCP02-4624 had the lowest\nones (Tables 2 and 3). Chlorophyll degradation is one of\nFigure 1. Monthly maximum and minimum mean air temperature, total rainfall and irrigation for wet and dry treatments\nduring November 2005 to August 2006.\n0\n10\n20\n30\n40\n50\n60\n70\n80\nNov.05 Dec.05 Jan.06 Feb.06 Mar.06 Apr.06 May.06 Jun.06 Jul.06 Aug.06\nDate\nmm\n0\n5\n10\n15\n20\n25\n30\n35\n40\noC\nRainfall Irrigation-Wet\n Irrigation-Dry\nMax temp. Min temp.\n197\nBraz. J. Plant Physiol., 19(3):193-201, 2007\nSCREENING FOR DROUGHT TOLERANCE IN SUGARCANE\nthe consequences of drought stress that may result from\nsustained photoinhibition and photo-bleaching (Long et\nal., 1994), and even though other plant processes, such\nas cell division and cell expansion are the earliest to\nrespond to water deficit stress (Dale, 1988), a decline in\nSPAD index is a sensitive and readily measurable trait\nthat could be used to screen for stress tolerance (O’Neill\net al., 2006). The distribution of SPAD index values\namong the sugarcane genotypes used in this study is\nconsistent with their tolerance-susceptibility\nclassification, with the exception of the genotype TCP02-\n4587 at 90 DAT.\nDrought stress generally resulted in an increase in LT\nfor all the genotypes, regardless of tolerance-\nsusceptibility classification (Tables 1, 2 and 3). However,\nLT of some susceptible genotypes (CP92-675 and H99-\n295) responded sharper to drought stress (by 45 DAT)\nthan that of tolerant genotypes (Table 2). The highest\naverage increase in LT was observed in TCP02-4624 (a\nsusceptible genotype) whereas the lowest average\nincrease was recorded for US01-40 (a tolerant genotype;\nTable 2). Overall, genotypes classified as susceptible\ngenerally had higher average LT readings (~37°C) under\ndrought stress conditions than those classified as\ntolerant (~35°C; Table 3). The increase in LT was\nprobably due to reduced evapotranspirational cooling,\nresulting from drought-induced stomatal closure. As\nstomata close in response to water deficit stress,\ntranspirational cooling ceases, leading to a rise in leaf\ntemperature (Luquet et al., 2003; Jones, 2004). While this\nphysiological response to increasing water stress can\nhelp prevent development of lethal water deficits, it can\nalso lead to lethal temperatures under warm sunny\nconditions. The relatively lower LT of the tolerant\ngenotypes results from mechanisms maintaining a more\nfavorable leaf water status and hence more open stomata\nand sustained transpirational cooling. As a consequence,\nCO\n2 influx towards chloroplasts may be sustained longer,\nthus allowing greater photosynthetic rates and,\nultimately, crop yield (Kumar, 2005). Although there was\nmore variability in the LT data compared to F\nv/Fm and\nSPAD index, perhaps due to changing wind conditions\nand reflection of solar radiation during measurements,\ndrought induced differences between the tolerant and\nsusceptible genotypes were still apparent. Leigh et al.\n(2006) have shown that when measuring LT under sunlit\nconditions, excessive reflection of solar radiation can\nlead to overestimation of LT. This problem can be\nsignificant especially when working with plant canopies.\nFor leaf-level studies, temporary shading of the leaf\nFigure 2.  Stalk productivity of eight sugarcane genotypes under well-watered (W) or drought (D) conditions.  Data are\nmeans ± SE of four replicates.\n160\n140\n120\n100\n80\n60\n40\n20\n0\nHOCP85-845 TCP02-4587 TCP02-4620\nUS01-40\nCP72-1210 CP92-675 H99-295\nTCP02-4624\nWell-watered Drought stress\nStalk productivity (t.ha\n)\n-1\n198\nBraz. J. Plant Physiol., 19(3):193-201, 2007\nM.A. SILV A et al.\nbefore measurement can provide a good estimate of the\noriginal sunlit leaf temperature.\nLeaf relative water content (RWC) was the only\nparameter for which the GxWxD interaction was\nsignificant (Table 1). At the onset of differential irrigation\ntreatments RWC was similar (~90%) among all genotypes\n(Table 2) but water deficit stress resulted in progressive\ndecline in RWC (Tables 2 and 3). By 45 DAT, significant\ndifferences in RWC had developed with genotypes from\nthe tolerant group maintaining a relatively higher average\nRWC (~87%) than those in the susceptible group (~80%,\nTable 2). This trend was more evident at 90 DAT (Table 3).\nOn average, drought-induced reduction in RWC occurred\nto a greater extent in the drought-susceptible genotype\nCP92-675 (21.6%), and to a lesser degree in the tolerant\nTCP02-4587 (1.7%). The average drought-induced\nreduction in RWC was 4.1% for the tolerant group and\n14.3% for the susceptible group. All the genotypes in the\ntolerant group in this study had relatively high RWC\nvalues compared to those in the susceptible group thus\nconfirming their empirical classification as drought\ntolerant. Such genotypes would possibly maintain\nprotoplast hydration for a longer duration under water\ndeficit stress conditions and thus ensure productivity in\nsemi-arid regions. In fact, RWC is a key indicator of the\ndegree of cell and tissue hydration, which is crucial for\noptimum physiological functioning and growth\nprocesses. Numerous studies have shown that main-\nTable 1. Analysis of variance ( F values) for PSII photochemical efficiency ( Fv/Fm), estimated chlorophyll content (SPAD\nindex), leaf temperature (LT) and leaf relative water content (RWC) of eight sugarcane genotypes grown under well-\nwatered and drought conditions and measured on three dates. * P < 0.05; ** P < 0.01.\nPhysiological AttributesTreatments Fv/Fm SPAD index L T RWC\nGenotype (G) 11.47** 17.78** 2.88** 31.70**\nWater condition (W) 42.47** 50.78** 24.49** 349.87**\nEvaluation date (D) 24.27** 33.99** 13.99** 98.22**\nG x W 4.70** 2.92** 1.19ns 20.63**\nG x D 2.16* 1.70 ns 0.54 ns 12.57**\nW x D 11.74** 13.56** 6.34** 112.98**\nG x W x D 1.29 0.90 0.61 9.51**\nCV (%) 2.68 7.28 10.90 2.00\nGenotypes Fv/Fm SPAD index LT ( oC) RWC (%)\n+W -W +W -W +W -W +W -W\nTolerant\nHOCP85-845 0.820 a 0.825 a 41.97 a 41.42 a 29.95 a 32.07 a 88.97 a 88.38 a\nTCP02-4587 0.822 a 0.822 a 48.60 a 44.42 a 28.72 a 32.55 a 88.16 a 87.30 a\nTCP02-4620 0.845 a 0.835 a 41.55 a 40.32 a 27.87 a 30.35 a 89.53 a 87.11 b\nUS01-40 0.827 a 0.830 a 39.90 a 38.25 a 30.07 a 29.85 a 88.47 a 85.47 b\nMean 0.827 a 0.827 a 43.01 a 41.11 a 29.78 a 30.59 a 88.78 a 87.06 b\nSusceptible\nCP72-1210 0.820 a 0.742 b 44.22 a 40.60 a 30.97 a 34.82 a 88.89 a 80.21 b\nCP92-675 0.815 a 0.770 b 46.35 a 37.75 b 29.52 b 36.40 a 88.63 a 82.88 b\nH99-295 0.822 a 0.775 b 41.45 a 34.95 b 29.27 b 38.12 a 89.14 a 81.70 b\nTCP02-4624 0.820 a 0.792 a 38.30 a 32.92 b 31.87 a 35.72 a 88.75 a 78.90 b\nMean 0.817 a 0.767 b 42.58 a 36.56 b 30.41 b 36.27 a 88.86 a 80.93 b\nTable 2. Chlorophyll fluorescence ( Fv/Fm), estimated chlorophyll content (SPAD index), leaf temperature (LT) and leaf\nrelative water content (RWC) of eight sugarcane genotypes grown under well-watered (+W) and drought (-W) conditions.\nMeasurements were taken at 45 days after the onset of irrigation treatments. Means for tolerant and susceptible genotypes\nin a same row and within a same attribute column and having the same letter are not significantly different at 0.05\nprobability level (Tukey’s test).\n199\nBraz. J. Plant Physiol., 19(3):193-201, 2007\nSCREENING FOR DROUGHT TOLERANCE IN SUGARCANE\nTable 3. Chlorophyll fluorescence ( Fv/Fm), estimated chlorophyll content (SPAD index), leaf temperature (LT) and leaf\nrelative water content (RWC) of eight sugarcane genotypes grown under well-watered (+W) or drought (-W) conditions.\nMeasurements were taken at 90 days after the onset of treatments. Statistics as in Table 2.\nGenotype Fv/Fm SPAD index L T (ºC) RWC (%)\n+W -W +W -W +W -W +W -W\nTolerant\nHOCP85-845 0.822 a 0.817 a 42.00 a 39.20 a 32.07 a 35.50 a 89.03 a 86.18 b\nTCP02-4587 0.817 a 0.810 a 47.72 a 41.75 b 31.22 a 34.80 a 88.62 a 86.92 a\nTCP02-4620 0.840 a 0.822 a 41.40 a 39.60 a 31.62 a 34.62 a 91.20 a 86.75 b\nUS01-40 0.830 a 0.817 a 38.45 a 36.92 a 31.57 a 34.17 a 90.20 a 82.95 b\nMean 0.827 a 0.815 a 42.39 a 39.37 b 31.60 a 34.78 a 89.76 a 85.70 b\nSusceptible\nCP72-1210 0.815 a 0.735 b 43.67 a 37.02 b 32.75 a 36.30 a 88.18 a 80.22 b\nCP92-675 0.815 a 0.757 b 46.85 a 34.10 b 31.87 b 37.12 a 87.41 a 65.77 b\nH99-295 0.812 a 0.762 b 41.22 a 33.87 b 31.75 b 37.35 a 87.29 a 74.61 b\nTCP02-4624 0.815 a 0.752 b 38.52 a 32.20 b 31.30 b 37.40 a 90.84 a 75.81 b\nMean 0.814 a 0.752 b 42.57 a 34.30 b 31.92 b 37.04 a 88.43 a 74.10 b\nTable 4. Pearson’s correlation coefficients for association among  chlorophyll fluorescence ( Fv/Fm), estimated chlorophyll\ncontent (SPAD index), leaf temperature (LT), leaf relative water content (RWC) and stalk productivity of eight sugarcane\ngenotypes grown under two watering treatments measured on 0, 45 and 90 days after treatment imposition (DAT). ns,\nnot significant; * P < 0.05; ** P < 0.01.\nFv/Fm SPAD index RWC Productivity\n0 DAT\nL T -0.16ns -0.19ns 0.00ns -0.18ns\nFv/Fm 0.03ns 0.32** 0.02ns\nSPAD index -0.19ns 0.19ns\nRWC 0.22ns\n45 DAT\nL T -0.48** -0.50** -0.56** -0.53**\nF\nv/Fm 0.31* 0.53** 0.50**\nSPAD index 0.49** 0.36**\nRWC 0.50**\n90 DAT\nL T -0.68** -0.61** -0.77** -0.44**\nF\nv/Fm 0.50** 0.67** 0.56**\nSPAD index 0.58** 0.33**\nRWC 0.58**\ntenance of a relatively high RWC during mild drought is\nindicative of drought tolerance (Jamaux et al., 1997;\nAltinkut et al., 2001; Colom and Vazzana, 2003).\nBefore the onset of treatments there was no\nsignificant correlation between the parameters, with the\nexception of a positive association between F\nv/Fm and\nRWC (Table 4). A modest, although significant, positive\ncorrelation was found among F\nv/Fm, SPAD index and\nRWC as well at 45 DA T as at 90 DA T. The degree of\nassociation amongst these parameters varied between\n0.31 to 0.53 and 0.50 to 0.67 at 45 and 90 DAT,\nrespectively. On the other hand, LT showed a significant\nnegative correlation with Fv/Fm, SPAD index and RWC on\nthe two periods (-0.48 to -0.56 at 45 DAT, and -0.61 to -0.77\nat 90 DAT). The stalk productivity was found to be\npositively correlated with Fv/Fm, SPAD index and RWC\nand negatively correlated with LT during the whole\nevaluation period under drought conditions. These\n200\nBraz. J. Plant Physiol., 19(3):193-201, 2007\nM.A. SILV A et al.\nresults demonstrated that all traits were affected\nmutually, positively or negatively, and were consistent in\nresponse to water deficit condition. Therefore, these\nparameters might be used as a selection criterion for stalk\nproductivity in sugarcane under drought stress. This is\nin accordance to Araus et al. (1998), O’Neill et al. (2006)\nand Rong-hua et al. (2006) that worked with wheat, corn\nand barley, respectively.\nWater shortage is one of the major limitations to\nproductivity worldwide and a possible solution is to\nimprove the drought tolerance of crop varieties through\nbreeding. To achieve this goal, a set of reliable traits that\ncan be rapidly and relatively inexpensively screened is\nneeded. Overall, the lack of yield reduction after 90 days\nof water stress observed for the tolerant genotypes and\nthe considerable correlation with the parameters studied\nturns this approach quite attractive. Although all the\ntraits and techniques evaluated in this study were reliable\nin distinguishing between tolerant and susceptible\nsugarcane genotypes, chlorophyll fluorescence, SPAD\nindex and thermal imaging seem to be the most promising\nfor rapid and nondestructive screening for drought\ntolerance. As sugarcane is a long cycle crop, the best\nresponses for screening for drought tolerant genotypes\ncould be achieved after 90 d under water limitation during\nthe grand growth phase.\nAcknowledgments : The authors thank the Conselho\nNacional de Desenvolvimento Científico e Tecnológico\n(CNPq, Brazil) for a fellowship award (Proc. 201076/2005-\n5) to the first author. This research was also supported by\na U.S. Department of Agriculture grant (CSREES No.\n2005-34461-15661 ‘Rio Grande Basin Initiative’). Special\nthanks also to Dr. Juan Enciso, Xavier Peries and Jose\nMorales for valuable assistance with soil moisture\nmeasurements.\nREFERENCES\nAguilera C, Stirling CM, Long SP (1999) Genotypes\nvariation within Zea mays for susceptibility to and rate\nof recovery from chill-induced photoinhibition of\nphotosynthesis. Physiol. Plant. 106:429-436.\nAltinkut A, Kazan K, Ipekci Z, Gozukirmizi N (2001)\nTolerance to paraquat is correlated with the traits\nassociated with water stress tolerance in segregating\nF\n2 populations of barley and wheat. Euphytica 121:81-\n86.\nAraus JL, Amaro T, V oltas J, Nakkoul H, Nachit MM\n(1998) Chlorophyll fluorescence as a selection\ncriterion for grain yield in durum wheat under\nMediterranean conditions. Field Crops Res. 55:209-\n223.\nColom MR, Vazzana C (2003) Photosynthesis and PSII\nfunctionality of drought-resistant and drought-\nsensitive weeping lovegrass plants. Environ. Exp. Bot.\n49:135-144.\nDale JE (1988) The control of leaf expansion. Annu. Rev.\nPlant Physiol. Plant Mol. Biol. 39:267-295.\nEarl HJ, Tollenaar M (1999) Using chlorophyll fluorometry\nto compare photosynthetic performance of commercial\nmaize ( Zea mays  L.) hybrids in the field. Field Crops\nRes. 61:201-210.\nGascho GJ, Shih SF (1983) Sugarcane. In: I.D. Teare and\nM.M. Peet (eds), Crop Water Relations, pp.445-479.\nJohn Wiley & Sons, New York.\nGimenez C, Mitchell VJ, Lawlor DW (1992) Regulation of\nphotosynthetic rate of two sunflower hybrids under\nwater stress. Plant Physiol. 96:635-643.\nHall DO, Rao KK (1994) Photosynthesis. 5\nth  ed.\nCambridge University Press, Cambridge.\nJamaux I, Steinmertz A, Belhassen E (1997) Looking for\nmolecular and physiological markers of osmotic\nadjustment in sunflower. New Phytol. 137:117-127.\nJones HG (2004) Application of thermal imaging and\ninfrared sensing in plant physiology and ecophys-\niology. Adv. Bot. Res. 41:107–163.\nKumar D (2005) Breeding for drought resistance. In: Ashraf\nM, Harris PJC (eds), Abiotic stresses: Plant Resistance\nthrough Breeding and Molecular Approaches,\npp.145-175. The Haworth Press, New York.\nLeigh A, Close JD, Ball MC, Siebke K, Nicotra AB (2006)\nLeaf cooling curves: measuring leaf temperature in\nsunlight. Funct. Plant Biol. 33:515-519.\nLong SP, Humphries S, Falkowski PG (1994)\nPhotoinhibition of photosynthesis in nature. Annu.\nRev. Plant Physiol. Plant Mol. Biol. 45:633-662.\nLuquet D, Begue A, Vidal A, Clouvel P, Dauzat J, Olioso A,\nGu XF, Tao Y (2003) Using multidirectional\nthermography to characterize water status of cotton.\nRemote Sens. Environ. 84:411–421.\n201\nBraz. J. Plant Physiol., 19(3):193-201, 2007\nSCREENING FOR DROUGHT TOLERANCE IN SUGARCANE\nMarkwell J, Osterman JC, Mitchell JL (1995) Calibration of\nthe Minolta SPAD-502 leaf chlorophyll meter.\nPhotosynth. Res. 46:467-472.\nMarquard RD, Tipton JL (1987) Relationship between\nextractable chlorophyll and an in situ method to\nestimate leaf greenness. HortScience 22:1327.\nMatin MA, Brown JH, Ferguson H (1989) Leaf water\npotential, relative water content, and diffusive\nresistance as screening techniques for drought\nresistance in barley. Agron. J. 81:100-105.\nMaxwell K, Johnson GN (2000) Chlorophyll fluorescence\n– a practical guide. J. Exp. Bot. 51:659-668.\nO’Neill PM, Shanahan JF, Schepers JS (2006) Use of\nchlorophyll fluorescence assessments to differentiate\ncorn hybrid response to variable water conditions.\nCrop Sci. 46:681-687.\nQing ZM, Jing LG, Kai CR (2001) Photosynthesis\ncharacteristics in eleven cultivars of sugarcane and\ntheir responses to water stress during the elongation\nstage. Proc. ISSCT 24:642-643.\nRamesh P (2000) Effect of different levels of drought\nduring the formative phase on growth parameters and\nits relationship with dry matter accumulation in\nsugarcane. J. Agron. Crop Sci. 185:83-89.\nRong-hua L, Pei-guo G , Baum M, Grando S, Ceccarelli S\n(2006) Evaluation of chlorophyll content and\nfluorescence parameters as indicators of drought\ntolerance in barley. Agric. Sci. China 5:751-757.\nSingh S, Rao PNG (1987) Varietal differences in growth\ncharacteristics in sugarcane. J. Agri. Sci. 108:245-247.\nTollenaar M, Aguilera A (1992) Radiation use efficiency of\nan old and new maize hybrid. Agron. J. 84:536-541.\nVenkataramana S, Guruja RPN, Naidu KM (1986) The\neffects of water stress during the formative phase on\nstomatal resistance and leaf water potential and its\nrelationship with yield in ten sugarcane varieties. Field\nCrops Res. 13:345-353.\nWolfe DW, Henderson DW, Hsaio TC, Alvino A (1988)\nInteractive water and nitrogen effects on senescence\nof maize: II. Photosynthetic decline and longevity of\nindividual leaves. Agron. J. 80:865-870.\nYadava UL (1986) A rapid and nondestructive method to\ndetermine chlorophyll in intact leaves. HortScience\n21:1449-1450."
}