{
    "title": "Verification of a Pedestrian Simulation Tool Using the NIST Recommended Test Cases",
    "url": "https://openalex.org/W2073966990",
    "year": 2014,
    "authors": [
        {
            "id": "https://openalex.org/A2346228019",
            "name": "Michelle L. Isenhour",
            "affiliations": [
                "United States Military Academy"
            ]
        },
        {
            "id": "https://openalex.org/A2064460169",
            "name": "Rainald Lohner",
            "affiliations": [
                "George Mason University"
            ]
        },
        {
            "id": "https://openalex.org/A2346228019",
            "name": "Michelle L. Isenhour",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2064460169",
            "name": "Rainald Lohner",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W6630064352",
        "https://openalex.org/W2046657362",
        "https://openalex.org/W6605197631",
        "https://openalex.org/W2043006648",
        "https://openalex.org/W6638232376",
        "https://openalex.org/W1787409397",
        "https://openalex.org/W336787341",
        "https://openalex.org/W127470283",
        "https://openalex.org/W4244366952",
        "https://openalex.org/W3145671133"
    ],
    "abstract": "In an attempt to develop a verification and validation standard for building fire evacuation models, Ronchi et al. (2013) at the United States' National Institute of Standards and Technology (NIST) recommended a set of seventeen verification tests. We found that the application of these verification tests allowed us to make rather significant improvements to our simulation code (PEDFLOW) for approximately half of the recommended tests (Table 1). In some cases, we added capabilities that did not exist before. In other cases, we found anomalous behaviors and adjusted the existing code to remove these unexplained behaviors. This paper summarizes the work on the verification tests, highlighting the lessons learned and modifications made. We also discuss some modifications we recommend to the NIST verification tests, as well as demonstrate how to make these tests suitable for all pedestrian flow models (not just building fire evacuation).",
    "full_text": null
}