{
  "title": "Stone Anvil Damage by Wild Bearded Capuchins (Sapajus libidinosus) during Pounding Tool Use: A Field Experiment",
  "url": "https://openalex.org/W2079557587",
  "year": 2014,
  "authors": [
    {
      "id": "https://openalex.org/A5038381131",
      "name": "Michael Haslam",
      "affiliations": [
        "Oxford Archaeology",
        "University of Oxford"
      ]
    },
    {
      "id": "https://openalex.org/A5071073919",
      "name": "Raphael Moura Cardoso",
      "affiliations": [
        "Universidade de São Paulo"
      ]
    },
    {
      "id": "https://openalex.org/A5061405705",
      "name": "Elisabetta Visalberghi",
      "affiliations": [
        "Institute of Cognitive Sciences and Technologies"
      ]
    },
    {
      "id": "https://openalex.org/A5034397221",
      "name": "Dorothy M. Fragaszy",
      "affiliations": [
        "University of Georgia"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2008789149",
    "https://openalex.org/W4230658767",
    "https://openalex.org/W1970458629",
    "https://openalex.org/W2073180890",
    "https://openalex.org/W1992463319",
    "https://openalex.org/W2155227957",
    "https://openalex.org/W1993718605",
    "https://openalex.org/W1983341126",
    "https://openalex.org/W2170674490",
    "https://openalex.org/W2103333430",
    "https://openalex.org/W4232097924",
    "https://openalex.org/W2041015946",
    "https://openalex.org/W2000618645",
    "https://openalex.org/W2086742168",
    "https://openalex.org/W2085691262",
    "https://openalex.org/W2084448403",
    "https://openalex.org/W2122597834",
    "https://openalex.org/W2005692230",
    "https://openalex.org/W2067383678",
    "https://openalex.org/W2030848505",
    "https://openalex.org/W2102989749",
    "https://openalex.org/W2050958156",
    "https://openalex.org/W2164413135",
    "https://openalex.org/W2110140324",
    "https://openalex.org/W2019278981",
    "https://openalex.org/W1813185467",
    "https://openalex.org/W2062309893",
    "https://openalex.org/W2084327975",
    "https://openalex.org/W2107821564",
    "https://openalex.org/W1970852128"
  ],
  "abstract": "We recorded the damage that wild bearded capuchin monkeys (Sapajus libidinosus) caused to a sandstone anvil during pounding stone tool use, in an experimental setting. The anvil was undamaged when set up at the Fazenda Boa Vista (FBV) field laboratory in Piauí, Brazil, and subsequently the monkeys indirectly created a series of pits and destroyed the anvil surface by cracking palm nuts on it. We measured the size and rate of pit formation, and recorded when adult and immature monkeys removed loose material from the anvil surface. We found that new pits were formed with approximately every 10 nuts cracked, (corresponding to an average of 38 strikes with a stone tool), and that adult males were the primary initiators of new pit positions on the anvil. Whole nuts were preferentially placed within pits for cracking, and partially-broken nuts outside the established pits. Visible anvil damage was rapid, occurring within a day of the anvil's introduction to the field laboratory. Destruction of the anvil through use has continued for three years since the experiment, resulting in both a pitted surface and a surrounding archaeological debris field that replicate features seen at natural FBV anvils.",
  "full_text": "Stone Anvil Damage by Wild Bearded Capuchins\n(Sapajus libidinosus) during Pounding Tool Use: A Field\nExperiment\nMichael Haslam1*, Raphael Moura Cardoso2, Elisabetta Visalberghi3, Dorothy Fragaszy4\n1 Research Laboratory for Archaeology and the History of Art, University of Oxford, Oxford, United Kingdom, 2 Institute of Psychology, University of Sa˜o Paulo, Sa˜o Paulo,\nBrazil, 3 Istituto di Scienze e Tecnologie della Cognizione, Consiglio Nazionale delle Ricerche, Roma, Italy, 4 Department of Psychology, University of Georgia, Athens,\nGeorgia, United States of America\nAbstract\nWe recorded the damage that wild bearded capuchin monkeys ( Sapajus libidinosus) caused to a sandstone anvil during\npounding stone tool use, in an experimental setting. The anvil was undamaged when set up at the Fazenda Boa Vista (FBV)\nfield laboratory in Piauı´, Brazil, and subsequently the monkeys indirectly created a series of pits and destroyed the anvil\nsurface by cracking palm nuts on it. We measured the size and rate of pit formation, and recorded when adult and immature\nmonkeys removed loose material from the anvil surface. We found that new pits were formed with approximately every 10\nnuts cracked, (corresponding to an average of 38 strikes with a stone tool), and that adult males were the primary initiators\nof new pit positions on the anvil. Whole nuts were preferentially placed within pits for cracking, and partially-broken nuts\noutside the established pits. Visible anvil damage was rapid, occurring within a day of the anvil’s introduction to the field\nlaboratory. Destruction of the anvil through use has continued for three years since the experiment, resulting in both a\npitted surface and a surrounding archaeological debris field that replicate features seen at natural FBV anvils.\nCitation: Haslam M, Cardoso RM, Visalberghi E, Fragaszy D (2014) Stone Anvil Damage by Wild Bearded Capuchins ( Sapajus libidinosus) during Pounding Tool\nUse: A Field Experiment. PLoS ONE 9(11): e111273. doi:10.1371/journal.pone.0111273\nEditor: Roscoe Stanyon, University of Florence, Italy\nReceived July 11, 2014; Accepted September 26, 2014; Published November 5, 2014\nCopyright: /C2232014 Haslam et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nData Availability:The authors confirm that all data underlying the findings are fully available without restriction. All relevant data are within the paper.\nFunding: MH was supported by the OUP John Fell Fund, an UK Arts and Humanities Research Council Early Career Fellowship and European Research Council\nStarting Grant #283959 (PRIMARCH). RMC was supported by a CNPq scholarship (process: CNPq 143014/2009-9). EV was supported by the Short-Term Mobility\nprogram funded by the CNR. DF was funded by the University of Georgia, the National Geographic Society, and the L.S.B. Leakey Foundation. The funders h ad no\nrole in study design, data collection and analysis, decision to publish, or preparation of the manuscript.\nCompeting Interests:The authors have declared that no competing interests exist.\n* Email: michael.haslam@rlaha.ox.ac.uk\nIntroduction\nStone tool use is currently known to be habitual or customary\namong members of three wild non-human primate species:\nwestern chimpanzees ( Pan troglodytes verus ) in West Africa,\nBurmese long-tailed macaques ( Macaca fascicularis aurea )i n\nThailand, and bearded capuchin monkeys ( Sapajus libidinosus)i n\nBrazil [1–3]. All three species use hand-held stones as pounding\ntools to access embedded food, and stone surfaces (including\ncobbles, boulders and outcrops) are among the natural substrates\nused as anvils by each species to support the pounded item. The\nuse of stone for percussive tasks means that both hammers and\nanvils survive for a considerable period of time and can be used\nrepeatedly, and the forceful impact associated with percussive\nstrikes can damage the stones through fracture and abrasion. One\nresult is the formation of pits in the surface of both hammers and\nanvils, which have been noted as an indicator of pounding tool use\nfor both non-human primates and hominins [4–10]. Stone anvil\nfracture has also been posited as a potential path to the creation of\nsharp-edged tools through intentional stone flaking, a trait that\nappears confined to the hominin lineage [11,12].\nAnvil damage or use-wear is one of the primary means by which\nan anvil stone may be distinguished from other naturally occurring\nstones and outcrops [e.g., 13,14–16]. In order to interpret anvil\ndamage correctly, however, we must first understand the process\nby which it occurs. In instances where anvil use has not been\ndirectly observed and recorded, basic questions such as the\nduration and intensity of past use can only be addressed through\nanalysis of damage patterns. To help answer such questions, we\npresent here an experimental study of use-wear formation on a\nstone anvil used by wild bearded capuchins, at the Fazenda Boa\nVista (FBV) site in Brazil.\nFazenda Boa Vista\nFBV is located in the southern Parnaı´ba Basin (S 09u 399 49.60,\nW4 5u 259 22.50) in Piauı´, Brazil. Details of the local environment\nare provided in [7]. The climate is seasonally dry, with 1,290 mm\nof annual rainfall, and 25 mm rainfall during the dry season, May\nto September [17].\nCapuchins at FBV use a variety of stone materials as hammers\nto crack open resistant palm nuts (89% of tool use episodes), as well\nas other encased foods [17]. Stone hammers range in weight from\nhundreds of grams to more than two kilograms [7], with adult\nindividuals producing a maximum kinetic energy of 7–12 J per\nstrike in one experiment [18]. Stone tool use occurs at a median\nrate of about one episode per 10 h for each tool user, accounting\nfor around 1% of the total time budget for the group [17]. Both\nPLOS ONE | www.plosone.org 1 November 2014 | Volume 9 | Issue 11 | e111273\n\nstone and wood anvils are used at FBV, and most of them are\nlocated in the transition zone between large sandstone mesas and\nflat open woodland [7,19]. FBV stone anvils are formed from\nrelatively soft sandstones and siltstones, which shear from the\nmesas and can present large, almost horizontal surfaces that\naverage around 1.9 m2 [7]. Stone anvils used by capuchins around\nthe mesa that includes the experimental area have an average Rx\nrebound value of 29.6, with anvil hardness across the study area\nreflecting the hardness of the prevailing sedimentary rock [7].\nAlmost all stone anvils at FBV are pitted, as a result of repeated\nabrasion and compression forces when foods are placed on their\nsurface and forcibly pounded. Most anvils have fewer than 10 pits,\nalthough anvils with up to several dozen pits are present, and the\nmaximum number of pits recorded for one anvil to date is 83 [7;\nMH unreported data]. Anvils on the north and east sides of the\nmesas are used more frequently at FBV than those with southerly\nor westerly aspects [16].\nMethods\nOur experiment was conducted in May 2011 with the one\ngroup of wild bearded capuchins [20], which at the time consisted\nof 19 individuals: 3 adult males, 5 adult females, 5 immature males\nand 6 immature females (Table 1). The capuchins are habituated\nto human presence, and the experiment took place in part of the\nmonkeys’ natural range that had previously been used for other\nexperiments [e.g., 21,22–24]. This ‘field laboratory’ is a flat area\napproximately 15 m in diameter with good visibility and several\nstone and wood anvils, as well as a variety of quartzite and siltstone\nhammers (Figure 1a). The site is located on the north-east edge of\nthe nearest sandstone mesa.\nTo investigate the entire use-wear process, we set up an unused\nsandstone block at the field laboratory for use as an anvil\n(Figure 2). For ease of reference, the block was designated\n‘Bigorna Nova’ (BN, literally new anvil). This block had a\nminimally-weathered, flat, undamaged fracture plane measuring\n49631 cm, which was found close to vertical and therefore had\nnot been previously used by the capuchins. The fracture plane\nformed the horizontal upper surface of the anvil once we\ntransferred the block to the field laboratory, which was 29 m to\nthe north-west of the block’s original location (Figure 2a). Once\nstabilized and leveled at its new location the BN upper surface was\n24–25 cm above the slightly uneven ground, and the base of the\nanvil was 58640 cm. The BN sandstone was the same colour and\ncomposition of other anvils at the field laboratory and the\nsurrounding area.\nWe recorded all interactions between the monkeys and BN for\nfour days, covering the anvil with a tarpaulin to prevent capuchin\naccess while the researchers were absent. All monkeys’ activities\nwith BN were recorded using a digital video camera set up 4.45 m\nfrom the anvil, as well as ad libitumdigital photography (Figure 3).\nThree quartzite potential hammer stones were initially provided\nnext to the anvil, weighing 0.46 kg, 1.05 kg and 2.08 kg, along\nwith two species of nuts collected from wild plants at FBV: piac¸ava\n(Orbignya sp.) and tucum (Astrocaryum campestre). The former nut\nis much harder and bigger than the latter [25]. Soon after the\nexperiment began, we restricted hammer use at BN to the 1.05 kg\nstone, to better control this variable. The capuchins were free to\nuse the stones and nuts provided, or to bring additional nuts to the\nanvil, and they could approach and use the anvil from all sides.\nAdditional palm nuts were provided to facilitate use of BN, and\nother anvils and hammers were always available in the field\nlaboratory away from the BN study.\nEach time that the monkeys used a stone hammer to strike a nut\nthey had placed on the BN anvil, we used the video record to note\nthe position of that strike on the anvil upper surface. At a\nminimum of every 20 strikes, which usually involved multiple nuts\nTable 1.Age, sex and body mass of monkeys in the studied group, May 2011.\nIndividual Age Sex Mass (kg)*\nPiac¸ava Adult F 1.98\nTeninha Adult F 2.18\nChuchu Adult F 1.96\nAmaralinha Adult F 1.63\nDita Adult F 2.09\nMansinho Adult M 3.30\nTeimoso Adult M 3.34\nJatoba Adult M 3.84\nTomate Immature M 1.80\nCatu Immature M 1.81\nCongaceiro Immature M 1.83\nPati Immature M 1.68\nCoco Immature M 1.14\nDoree Immature F 1.37\nPamonha Immature F 1.23\nPac¸oca Immature F 1.18\nChani Infant F 0.46\nThais Infant F 0.42\nPresente Infant F 0.24\n* Body mass was obtained using a voluntary weighing system described in [26].\ndoi:10.1371/journal.pone.0111273.t001\nStone Anvil Damage by Wild Capuchins during Pounding Tool Use\nPLOS ONE | www.plosone.org 2 November 2014 | Volume 9 | Issue 11 | e111273\nbeing cracked, we recorded the presence of macroscopically-\nobserved pits in the anvil surface. We recorded pit location, and\nmaximum dimensions of length, width (perpendicular to length)\nand depth. We recorded the latter by placing a plasticine ball\nwithin the pit, then laying a ruler across the top of the pit to\ncompress the plasticine, and measuring the resulting thickness with\ncalipers. For each strike, we also recorded the individual monkey,\nthe nut type, and whether the nut was whole or partially broken\n(where this was visible on the video, or mentioned in the video by\nthe experimenter).\nWe also recorded whether or not the monkey removed loose\nmaterial from an existing pit (making the accessible part of the pit\ndeeper), and/or swept loose anvil and nut debris from the surface\nof the anvil onto the surrounding ground. Both behaviors were\nlabeled cleaning actions. Cleaning removed fragments of the anvil,\nincluding pieces from mm to cm in size, that had detached from\nthe main anvil body but had remained in situ either within or\naround surface pits (Fig. 3). Previous observations indicate that this\nmaterial would otherwise form a barrier between the nut and\nanvil, and its removal accelerates pit formation and overall\ndamage by exposing the underlying anvil surface.\nFollowing one week of complete monitoring, BN was left\nuncovered and monkey use was no longer continually recorded.\nFor the subsequent three years on an annual basis we recorded the\nanvil cross section in two perpendicular planes to assess overall\nchanges in height and surface shape, and photographed the anvil.\nTo provide controlled comparative data, MH created use-wear\npits in a separate sandstone anvil by repeatedly dropping a 1.05 kg\nquartzite hammer onto positioned piac ¸ava and tucum nuts. The\nhammer weight was chosen based on the reported average weight\nof hammers at Boa Vista of 1.096 kg [7]. The hammer stone was\nFigure 2. Setting up the Bigorna Nova (BN). (a) The original\nlocation and position of the stone SE of the field laboratory, with a\n10 cm scale on the tilted face; (b) BN in position at the start of the\nexperiment; the upper surface has chalked crosses every 5 cm to aid in\ndetermining strike positions.\ndoi:10.1371/journal.pone.0111273.g002\nFigure 3. The Bigorna Nova experiment.(a) Bigorna Nova (BN)\nexperiment in progress, with RMC operating the video camera; (b) BN\nsurface damage during the experiment, with tucum shells and quartzite\nhammer stone, scale is 10 cm; (c) BN at the end of the period of\ncontinuous monitoring, note the pitted surface and surrounding debris,\nscale is 10 cm; (d) BN 16 months after the experiment, surrounding\nstone and nut debris is extensive, scale is 5 cm.\ndoi:10.1371/journal.pone.0111273.g003\nFigure 1. The FBV field laboratory. (a) The experimental area\nbeside a steep mesa, with sandstone (SS) and wood (W) anvils, and the\nBigorna Nova (BN). (b) A sandstone anvil at the field laboratory in 2003,\nand (c) the same anvil in 2014, showing the erosive effect of capuchin\npounding.\ndoi:10.1371/journal.pone.0111273.g001\nStone Anvil Damage by Wild Capuchins during Pounding Tool Use\nPLOS ONE | www.plosone.org 3 November 2014 | Volume 9 | Issue 11 | e111273\ndropped from a height of 33 cm each time; this value was based on\naveraged data for maximum vertical hammer height during nut-\ncracking by four Boa Vista capuchins [18]. Capuchins may add\nforce to each downward strike, which was absent in this\nexperiment to err on the conservative side. Each drop fell squarely\non the nut, and was counted as a strike, with the dimensions\n(width, length, depth) of the resulting pits measured every 10\nstrikes up to a total of 100 strikes. The anvil used in the stone drop\nexperiment was collected from close to the BN original location. A\nfurther aim of this study was to assess variation in pit formation\nbetween tucum and piac¸ava that may allow for discrimination of\nthese nuts via pit data from anvils at FBV. Specifically, we\nhypothesized that the rounded tucum would produce pits with a\ngreater depth, relative to pit length and width, than the broader\npiac¸ava nuts. Pit measurements were taken as for the BN.\nWe calculated the odds ratio to assess whether whole or partial\nnuts were preferentially placed within pits.\nEthics statement\nPermission to work in Brazil was granted to EV and DF by\nInstituto Brasileiro do Meio Ambiente e dos Recursos Naturais\nRenova´veis (IBAMA) and Conselho Nacional de Desenvolvimento\nCientı´fico e Tecnolo´gico (CNPq). The study was conducted on\nprivate land, owned by the family of Marino Gomes Oliveira. This\nresearch was approved by the IACUC of the University of Georgia\n(A2010 04-067 and A2013 03-001) and complied with all\ninstitutional guidelines for the ethical participation of non-human\nanimals in research.\nResults\nDuring the period of continual observation, a total of six adults\n(3 males, 3 females) used tools on the BN anvil, along with a\nnumber of immature individuals (Table 2). The latter were not\nidentified to individual, and were analysed collectively. We\nrecorded strikes on 67 tucum (n = 320 strikes) and 161 piac ¸ava\nnuts (n = 479 strikes), for a total of 799 strikes. Note that these\nvalues do not necessarily reflect successful nut-cracking, and so\nshould not be considered measures of efficiency. The capuchins\ncreated 14 identifiable pits during this period, with 579 strikes\nlocated within pits and the remainder on other parts of the anvil\nsurface.\nThe capuchins performed 341 strikes in which the nut was\nplaced into a pit and for which the whole or partial nature of the\nnut could be ascertained; 261 of these strikes were on whole nuts,\nand 80 on partial nuts. Of the 134 strikes in which the nut was\nplaced elsewhere than in a pit, and for which we could ascertain\nwhether the nut was whole or partial, 21 were on whole nuts, and\n113 on partial nuts. We calculated the odds ratio of a whole nut\nbeing placed in a pit as 17.5 (x\n2 p,0.001), indicating that monkeys\npreferentially place whole nuts in pits, and partial nuts outside\nthese depressions.\nPit size data (Figure 4) indicate that pit width increases linearly\nas length increases (r 2 = 0.857), while depth also increases but at a\nslower rate (Figure 4a). Pit depths reach a plateau typically less\nthan 25 mm, which reflects the fact that beyond that depth the\nmonkeys often strike the surrounding stone surface rather than the\nnut, resulting in the abrasion and local fracture of the anvil surface.\nOn occasion, this can actually result in pit depth decreasing\nslightly as the other dimensions increase, even though the overall\ntrend is towards an increase in all three dimensions. Because of this\nprocess, the ratio of length to depth decreases over time\n(Figure 4b), producing larger but shallower pits. For comparison,\nand to ensure that data from BN reflected natural occurrences, we\nalso measured a sample of pits on FBV anvils that were surveyed\nover several years and reported in [16] (Figure 4a). The surveyed\nanvil pits showed similar sizes to the BN data, although they tend\nto be slightly wider (by a few mm) for pit lengths below 50 mm.\nMost of the cleaning behavior was performed by adult male\nmonkeys (33 cleaning events from 117 nuts) (Table 2). Adult\nfemales cleaned the anvil seven times (from 57 nuts) and immature\nindividuals once (from 51 nuts). The current and former alpha\nmales (Jatoba and Mansinho, respectively) were most active in this\nprocess, collectively cleaning the anvil on 38% of their visits. From\nthese data, the main agents for accelerating anvil damage through\ncleaning are dominant males. Adult females play a minor role, and\nimmature individuals very rarely engage in cleaning behavior.\nMonkeys cleaned almost twice as often when cracking tucum\nrather than piac¸ava nuts (27% to 14%).\nInitiation of a new pit occurred when a monkey placed a nut\noutside of the already established pits, and cracked nuts repeatedly\nin that location until a macroscopically visible pit formed. Of the\n14 pits created during the experiment, nine were initiated by the\nalpha male (Jatoba), one by the former alpha male (Mansinho),\nthree by another subordinate male (Teimoso), and one by the\nalpha female (Piac¸ava) (Table 2). Immature monkeys never started\na new pit. On average, a new pit was initiated after 10 nuts were\ncracked, corresponding to an average of 38.5 strikes per new pit.\nWe also looked at whether individuals would preferentially re-use\nthe pit that had been used by the previous monkey at the anvil,\nand found that the capuchins re-used the same pit 40% of the\ntime, with similar frequency seen in this behavior between\nimmature monkeys, adult females and adult males (44%, 46%\nand 37% respectively; total n = 144 events).\nFrom May 2011 to May 2014, the BN anvil continued to be\nused opportunistically by the FBV capuchins (Figures 3d, 5).\nTable 2.Summary data for the BN experiment.\nIndividual Strikes Nuts % Cleaning* # pits started\nJatoba 169 49 39.0 9\nMansinho 119 32 36.6 1\nTeimoso 159 36 4.9 3\nPiac¸ava 130 39 4.9 1\nDita 50 14 7.3 0\nChuchu 73 4 4.9 0\nImmature 99 54 2.4 0\n*% of all cleaning events that were performed by this individual.\ndoi:10.1371/journal.pone.0111273.t002\nStone Anvil Damage by Wild Capuchins during Pounding Tool Use\nPLOS ONE | www.plosone.org 4 November 2014 | Volume 9 | Issue 11 | e111273\nThrough pounding activities, its height decreased relative to the\noriginal anvil surface by at minimum of 2.6 cm, and a maximum\nof 13 cm (i.e., more than half the original anvil height). The\nerosion of the anvil upper portion left a considerable debris field in\nthe immediate vicinity, chiefly within 50 cm of the anvil base.\nDuring the initial one-week period of observation, the anvil\ndecreased in height by 0.4–4.8 cm. This was 41.7% of the total\nmass lost, as estimated by averaging loss at points taken 5 cm apart\nin two cross-sections, indicating that capuchin use of the anvil\nduring that period was considerably more intensive than in the\nsubsequent three years. We suggest that the latter period is more\nrepresentative of normal use patterns, although the change in\nintensity affects only the overall rate of wear, not the mechanisms\ninvolved. The anvil upper surface remained pitted throughout the\nthree-year period.\nResults of the stone drop experiment performed by a human are\nvery similar to those from the BN study involving capuchins.\nThree pits were created while processing piac¸ava, and these show\nconsistent formation rates (Figure 6a). One piac ¸ava nut, measur-\ning 61640 mm, was used for this experiment (it did not crack); the\nfinal pit sizes exceed these values, likely resulting from slight nut\nmovement at the moment of impact. The tucum nuts fractured\nafter an average of 33 strikes for each nut, which is a much lower\nfracture rate than that typically seen among the monkeys [23],\nsupporting the conservative assumption of lower energy input\nfrom the stone drop experiment. One aspect that differed between\nthe BN and stone drop studies is that the stone drop protocol did\nnot also involve striking nuts placed beside the pits, which explains\nthe perhaps unrealistic greater maximum pit depth (close to\n40 mm) and the high number of strikes to crack tucum attained in\nFigure 4. BN pit measurements, with anvil survey data for comparison: (a) BN pit width and depth relative to length, and surveyed\nanvil pit widths relative to length; (b) ratios of pit length:width and length:depth formed on the BN surface during the experiment.\ndoi:10.1371/journal.pone.0111273.g004\nStone Anvil Damage by Wild Capuchins during Pounding Tool Use\nPLOS ONE | www.plosone.org 5 November 2014 | Volume 9 | Issue 11 | e111273\nthe latter study. Placing nuts beside the pits would likely have\nabraded that surface and therefore slightly increased the length\nand width of the pits already present, while decreasing their\nrelative depth. Although they did not attain the same maximum\nsize in this study, pits resulting from tucum processing were not\ndistinguishable via measurement ratios from those created by\npiac¸ava nuts (Figure 6b).\nDiscussion\nDamage clearly identifiable as resulting from capuchin tool use\noccurred within a day of establishing the BN at FBV. This damage\nincluded rapid formation of the distinct pits seen at most anvils\nused by wild capuchins in the local area, along with break-up and\nremoval of the bedded sandstone surface. Initiation of new pits was\ndominated by the activities of the alpha male, potentially as a\nresult of his greater strength and body mass [26].\nOn the small BN anvil, the maintenance of more than five or six\npits appeared difficult, as pits would start to join together or be lost\nthrough abrasion and destruction of the surrounding surface.\nLarger and harder anvils than the BN stone could no doubt sustain\na greater number of pits, as evidenced by the anvil diversity seen\nacross the FBV landscape [7,16]. The published average density of\npits for stone anvils measured at FBV is 6.6 pits/m\n2 (anvils average\n7.8 pits and 1.89 m 2; range 0–43 pits and 0–43.4 pits/m 2), and\nanvils around the same mesa as the field laboratory average\n9.5 pits/m\n2 (averages of 9.8 pits and 1.29 m 2) [7]. BN had a\nmaximum pit density of 39.5 pits/m 2 (6 pits and 0.15 m 2), at the\nhigher end of previously recorded values, but within the natural\nrange. The two highest pit densities published at FBV occur at the\nsame mesa as the field laboratory (MM23: 31.1 pits/m\n2; MM30:\n43.4 pits/m2), as does a previously unpublished and heavily-pitted\nanvil with a density of 16.9 pits/m 2 (83 pits and 4.89 m 2). These\nelevated densities may relate either to intensity of use or the\nrelative softness of the sandstone in this part of the FBV site.\nNew pits were formed on the BN anvil with approximately\nevery 10 nuts cracked, or 38 strikes. While these data provide an\ninitial guide for interpreting the abundance of pits at anvils formed\nfrom similar sandstone at FBV, we caution against uncritically\napplying this metric to other types of stone surface (e.g. harder\nsandstones), to other capuchin sites, or to other primate sites.\nAdditional factors that may mediate the formation of pits must be\nconsidered, such as weathering rates, the processing of different\nfood types to those seen here, and the size of the anvil (the\ncloseness of pits to the edge of small anvils most probably affects\nthe likelihood of edge fractures affecting or removing those pits).\nThese data also do not apply to the formation of use-damage on\nwooden anvils, which require separate study. The main criterion\nused here to measure anvil damage, percussion pitting, will be less\nuseful in areas with more resistant anvils [27], or in circumstances\nwhere particular environments alter anvil characteristics more\nreadily (e.g., the inter-tidal zones exploited by tool-using long-\ntailed macaques in Thailand [8,28]).\nThe stone hammer material may also influence the rate of anvil\npit formation. Specifically, use of softer rocks as hammers likely\nresults in absorption of more of the force of a blow into the\nhammer itself, deforming or even breaking the hammer rather\nthan the nut and underlying substrate. The dominant use of\nquartzite in this experiment precludes our testing this hypothesis,\nbut we would expect the use of softer hammers to lengthen the\ntime required for pit formation, rather than eliminating pit\nformation altogether.\nOur data from the initial period of observation allow us assess\nthe approximate rate of BN use over the subsequent three years.\nThe initial processing of 228 nuts produced 42% of the estimated\nmass lost between 2011 and 2014, so we estimate that the monkeys\nhave processed around 550 nuts in total on the BN anvil. Total\nstrikes are estimated at over 1900 in that time. Under natural\nconditions (outside the initial study period), we therefore estimate\n106 nuts and 373 strikes per year at BN. It is possible that BN\nbecame less appealing following its initial use as an anvil, due to its\nreduced size and damage, but we have no data to test this\nhypothesis.\nThe debris field of sandstone anvil fragments and broken nut\nshells surrounding BN is distinctive, and composed of durable\nmaterials that constitute an archaeological signature [16]. Similar\ndebris fields surround other anvils at FBV, and reduction in anvil\nvolume and height has been qualitatively observed among the\nanvils at the field laboratory since commencement of research in\n2003 (Figure 1b,c). At BN, sediment levels adjacent to the anvil\nhave seen both decreases and increases, with the most notable\nchange being the accretion of around 4 cm sediment to the anvil’s\nFigure 5. Schematic BN cross-sections, 2011–2014: (a) South to North; and (b) West to East.The uppermost level in each cross-section is\nthe anvil shape at the start of the experiment (2011 start) and subsequent levels were taken at the end of the initial experimental period (2011 end),\nin September 2012, and in May 2014.\ndoi:10.1371/journal.pone.0111273.g005\nStone Anvil Damage by Wild Capuchins during Pounding Tool Use\nPLOS ONE | www.plosone.org 6 November 2014 | Volume 9 | Issue 11 | e111273\nsouth and west. South-west is the direction of the nearby mesa,\nwhich is the main sediment source at the field laboratory.\nWhole nuts were preferentially placed within existing pits, while\npartially cracked nuts were more often placed outside of pits. We\npropose that this behavior may result from (a) the fragmented\npartial nuts being smaller and therefore less accessible if placed\nwithin pits, (b) the rounded whole nuts being more prone to move\nduring striking, and be lost, if not placed within a controlling pit\n[see 24,26], and/or (c) partially cracked nuts being more stable\nwhen placed on a flat surface, because they are typically placed\nand struck with a flat facet downwards once initially broken.\nNeither adults nor immature monkeys consistently used existing\npits as opposed to other exposed portions of the anvil surface or\nthe most recently used pit. If pits form part of a constructed\nmaterial niche [29], then we could say that the BN experiment\ninfluenced the behavior of immature and adult individuals to a\nsimilar extent in this experiment.\nAdult males primarily engaged in cleaning, and in particular the\ncurrent and former alpha males, although monkeys of all ages and\nsexes conducted this behavior. Cleaning activities continually\nexposed the surface of the anvil directly to impact with the\nprocessed nuts, and assisted in the concurrent build-up of\nsandstone and nut debris surrounding the anvil. These activities\nappear important therefore for the archaeological recognition of\nanvils as activity centers, both as surface evidence of tool use and\nin the formation of a subsurface material record.\nPrevious studies of pit formation and interpretation from\nprimatological and paleoanthropological contexts have typically\nnot considered the impact of anvil maintenance on wear rates and\ntypes [4–7,9], which the capuchin data indicate may be a useful\nFigure 6. Results of the stone-drop use-wear experiment: (a) pit width and depth relative to length (piac¸ava and tucum results\ncombined); (b) ratio of pit length:depth for three piac¸ava nuts, and one tucum nut (the tucum nut has sixty strikes, the others 100\nstrikes).\ndoi:10.1371/journal.pone.0111273.g006\nStone Anvil Damage by Wild Capuchins during Pounding Tool Use\nPLOS ONE | www.plosone.org 7 November 2014 | Volume 9 | Issue 11 | e111273\ncomplement to existing research. Use-wear research also generally\ndoes not consider how demographic factors may influence damage\npatterns or rates, but the influence of large male capuchins as\nopposed to females or immature monkeys at FBV marks this as\nanother area worthy of further investigation. For example,\ncleaning by alpha males may be an example of a socially-\npartitioned role [e.g., 30], or it may be that extra force employed\nby some males generates additional debris, requiring more\nfrequent cleaning to maintain a stable nut position. The fact that\none lower-ranking adult male engaged in cleaning only at low\nlevels, similar to the adult females, does not allow us to distinguish\nbetween these options at present.\nFinally, we note that some archaeological sites in northeast\nBrazil (e.g., in Serra da Capivara National Park) contain pitted\nsandstone surfaces likely resulting from human activity (MH,\npersonal observation). These may be the outcome of unintentional\nanthropogenic use-damage, or they may be cupules resulting from\ndeliberate human manufacture. Data on both the formation and\nshape of anvil use-damage from capuchin monkey nut-cracking\nactivities are required to properly assess the origins of cupules or\nuse-damaged pits found at archaeological sites in this region.\nAcknowledgments\nOur thanks to the Oliviera family for logistical assistance and permission to\nwork at Fazenda Boa Vista.\nAuthor Contributions\nConceived and designed the experiments: MH RMC EV DF. Performed\nthe experiments: MH RMC. Analyzed the data: MH RMC DF. Wrote the\npaper: MH RMC EV DF.\nReferences\n1. Malaivijitnond S, Lekprayoon C, Tandavanittj N, Panha S, Cheewatham C, et\nal. (2007) Stone-tool usage by Thai long-tailed macaques ( Macaca fascicularis).\nAm J Primatol 69: 227–233.\n2. McGrew WC (1992) Chimpanzee Material Culture: Implications for Human\nEvolution. Cambridge: Cambridge University Press.\n3. Ottoni E, Izar P (2008) Capuchin monkey tool use: overview and implications.\nEvol Anthropol 17: 171–178.\n4. Boesch C, Boesch H (1982) Optimization of nut-cracking with natural hammers\nby wild chimpanzees. Behaviour 83: 265–286.\n5. Mercader J, Panger M, Boesch C (2002) Excavation of a chimpanzee stone tool\nsite in the African rainforest. Science 296: 1452–1455.\n6. Goren-Inbar N, Sharon G, Melamed Y, Kislev M (2002) Nuts, nut cracking, and\npitted stones at Gesher Benot Ya‘aqov, Israel. Proc Natl Acad Sci USA 99:\n2455–2460.\n7. Visalberghi E, Fragaszy D, Ottoni E, Izar P, de Oliveira M, et al. (2007)\nCharacteristics of hammer stones and anvils used by wild bearded capuchin\nmonkeys (Cebus libidinosus) to crack open palm nuts. Am J Phys Anthropol 132:\n426–444.\n8. Haslam M, Gumert M, Biro D, Carvalho S, Malaivijitnond S (2013) Use-wear\npatterns on wild macaque stone tools reveal their behavioural history. PLoS One\n8: e72872.\n9. Carvalho S, Cunha E, Sousa C, Matsuzawa T (2008) Chaıˆnes ope´ratoires and\nresource-exploitation strategies in chimpanzee ( Pan troglodytes) nut cracking.\nJ Hum Evol 55: 148–163\n10. Haslam M (2012) Towards a prehistory of primates. Antiquity 86: 299–315.\n11. Marchant LF, McGrew WC (2005) Percussive technology: chimpanzee baobab\nsmashing and the evolutionary modeling of hominid knapping. In: Roux V, Bril\nB, editors. Stone Knapping: The Necessary Conditions for a Uniquely Hominin\nBehaviour Cambridge: McDonald Institute for Archaeological Research.\npp.341–350.\n12. Haslam M, Hernandez-Aguilar A, Ling V, Carvalho S, de la Torre I, et al.\n(2009) Primate archaeology. Nature 460: 339–344.\n13. Canale GR, Guidorizzi CE, Kierulff MCM, Gatto CAFR (2009) First record of\ntool use by wild populations of the yellow-breasted capuchin monkey ( Cebus\nxanthosternos) and new records for the bearded capuchin ( Cebus libidinosus).\nAm J Primatol 71: 366–372.\n14. Ferreira R, Emidio R, Jerusalinsky L (2010) Three stones for three seeds: natural\noccurrence of selective tool use by capuchins ( Cebus libidinosus) based on an\nanalysis of the weight of stones found at nutting sites. Am J Primatol 72: 270–\n275.\n15. de la Torre I, Benito-Calvo A, Arroyo A, Zupancich A, Proffitt T (2013)\nExperimental protocols for the study of battered stone anvils from Olduvai\nGorge (Tanzania). J Archaeol Sci 40: 313–332.\n16. Visalberghi E, Haslam M, Spagnoletti N, Fragaszy D (2013) Use of stone\nhammer tools and anvils by bearded capuchin monkeys over time and space:\nconstruction of an archeological record of tool use. J Archaeol Sci 40: 3222–\n3232.\n17. Spagnoletti N, Visalberghi E, Verderane M, Ottoni E, Izar P, et al. (2012) Stone\ntool use in wild bearded capuchin monkeys, Cebus libidinosus. Is it a strategy to\novercome food scarcity? Anim Behav 83: 1285–1294.\n18. Liu Q, Simpson K, Izar P, Ottoni E, Visalberghi E, et al. (2009) Kinematics and\nenergetics of nut-cracking in wild capuchin monkeys ( Cebus libidinosus) in Piauı´,\nBrazil. Am J Phys Anthropol 138: 210–220.\n19. Visalberghi E, Spagnoletti N, Ramos da Silva E, de Andrade F, Ottoni E, et al.\n(2009) Distribution of potential suitable hammers and transport of hammer tools\nand nuts by wild capuchin monkeys. Primates 50: 95–104.\n20. Spagnoletti N, Visalberghi E, Ottoni E, Izar P, Fragaszy D (2011) Stone tool use\nby adult wild bearded capuchin monkeys ( Cebus libidinosus ). Frequency,\nefficiency and tool selectivity. J Hum Evol 61: 97–107.\n21. Visalberghi E, Addessi E, Truppa V, Spagnoletti N, Ottoni E, et al. (2009)\nSelection of effective stone tools by wild bearded capuchin monkeys. Curr Biol\n19: 213–217.\n22. Massaro L, Liu Q, Visalberghi E, Fragaszy D (2012) Wild bearded capuchin\n(Sapajus libidinosus) select hammer tools on the basis of both stone mass and\ndistance from the anvil. Anim Cogn 15: 1065–1074.\n23. Fragaszy D, Greenberg R, Visalberghi E, Ottoni E, Izar P, et al. (2010) How\nwild bearded capuchin monkeys select stones and nuts to minimize the number\nof strikes per nut cracked. Anim Behav 80: 205–214.\n24. Liu Q, Fragaszy D, Wright B, Wright K, Izar P, et al. (2011) Wild bearded\ncapuchin monkeys ( Cebus libidinosus) place nuts in anvils selectively. Anim\nBehav 81: 297–305.\n25. Visalberghi E, Sabbatini G, Spagnoletti N, Andrade F, Ottoni E, et al. (2008)\nPhysical properties of palm fruits processed with tools by wild bearded capuchins\n(Cebus libidinosus). Am J Primatol 70: 884–891.\n26. Fragaszy D, Pickering T, Liu Q, Izar P, Ottoni E, et al. (2010) Bearded capuchin\nmonkeys’ and a human’s efficiency at cracking palm nuts with stone tools: field\nexperiments. Anim Behav 79: 321–332.\n27. Emidio R, Ferreira R (2012) Energetic payoff of tool use for capuchin monkeys\nin the caatinga: variation by season and habitat type. Am J Primatol 74: 332–\n343.\n28. Gumert M, Kluck M, Malaivijitnond S (2009) The physical characteristics and\nusage patterns of stone axe and pounding hammers used by long-tailed\nmacaques in the Andaman Sea region of Thailand. Am J Primatol 71: 594–608.\n29. Fragaszy D, Biro D, Eshchar Y, Humle T, Izar P, et al. (2013) The fourth\ndimension of tool use: temporally enduring artefacts aid primates learning to use\ntools. Phil Trans R Soc B 368: doi:10.1098/rstb.2012.0410\n30. Hockings K, Anderson J, Matsuzawa T (2006) Road crossing in chimpanzees: a\nrisky business. Curr Biol 16: R668–R670.\nStone Anvil Damage by Wild Capuchins during Pounding Tool Use\nPLOS ONE | www.plosone.org 8 November 2014 | Volume 9 | Issue 11 | e111273",
  "topic": "Debris",
  "concepts": [
    {
      "name": "Debris",
      "score": 0.5729981064796448
    },
    {
      "name": "Geology",
      "score": 0.5640822649002075
    },
    {
      "name": "Cracking",
      "score": 0.5302820801734924
    },
    {
      "name": "Materials science",
      "score": 0.23163747787475586
    },
    {
      "name": "Composite material",
      "score": 0.1623145341873169
    },
    {
      "name": "Oceanography",
      "score": 0.0674990713596344
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I4210140987",
      "name": "Oxford Archaeology",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I40120149",
      "name": "University of Oxford",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I17974374",
      "name": "Universidade de São Paulo",
      "country": "BR"
    },
    {
      "id": "https://openalex.org/I4210166865",
      "name": "Institute of Cognitive Sciences and Technologies",
      "country": "IT"
    },
    {
      "id": "https://openalex.org/I165733156",
      "name": "University of Georgia",
      "country": "US"
    }
  ]
}