{
    "title": "Noise analysis of DC SQUIDs with damped superconducting flux transformers",
    "url": "https://openalex.org/W2070893703",
    "year": 2010,
    "authors": [
        {
            "id": "https://openalex.org/A5036774295",
            "name": "M.I. Faley",
            "affiliations": [
                "Forschungszentrum Jülich"
            ]
        },
        {
            "id": "https://openalex.org/A5075396823",
            "name": "U. Poppe",
            "affiliations": [
                "Forschungszentrum Jülich"
            ]
        },
        {
            "id": "https://openalex.org/A5102812716",
            "name": "K. Urban",
            "affiliations": [
                "Forschungszentrum Jülich"
            ]
        },
        {
            "id": "https://openalex.org/A5079342329",
            "name": "R.L. Fagaly",
            "affiliations": [
                "Quantum Applied Science and Research (United States)"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2087491525",
        "https://openalex.org/W1970298713",
        "https://openalex.org/W2108759500",
        "https://openalex.org/W2047118286",
        "https://openalex.org/W2165146116",
        "https://openalex.org/W2063034562",
        "https://openalex.org/W1980351638",
        "https://openalex.org/W2035109028",
        "https://openalex.org/W1989686309",
        "https://openalex.org/W2109811705",
        "https://openalex.org/W1989619096",
        "https://openalex.org/W2027605386",
        "https://openalex.org/W2058196733",
        "https://openalex.org/W2026853528",
        "https://openalex.org/W2054779403",
        "https://openalex.org/W1999698668",
        "https://openalex.org/W2073535388",
        "https://openalex.org/W2026453588",
        "https://openalex.org/W1972294667",
        "https://openalex.org/W2060381243",
        "https://openalex.org/W1996675383",
        "https://openalex.org/W1983140536",
        "https://openalex.org/W2059391679",
        "https://openalex.org/W1979219759"
    ],
    "abstract": "An analysis was performed of intrinsic noise for high-Tc DC SQUID with superconducting flux transformer (FT) containing resistive elements. For a SQUID with a loop inductance of about 40 pH we observed voltage swings of ~55 μV and a flux noise of ~4 μΦ0/√Hz at 77 K. Inductive coupling of an 8-mm multilayer superconducting FT to the SQUID increased voltage swings to ~70 μV due to effective reduction of the SQUID loop inductance. This also increased the flux noise to ~6μΦ0/√Hz, corresponding to a field resolution of ~18 fT/√Hz at 77 K with a white noise spectrum down to frequency ~10 Hz. The main sources of white flux noise were the Nyquist noise in the Josephson junctions and the FT, as well as the suppression of the DC SQUID voltage swings caused by parasitic capacitance between the FT and the SQUID. An ultra-low-ohmic resistor with resistance value between the flux-creep-induced resistances of superconductors (below ~0.1 nΩ) and resistances of conventional resistors (above ~0.1 mΩ) was developed. An RL-circuit based high-pass filter (HPF) with time constant ~7 sec was realized and integrated in the superconducting FT. The contribution of the HPF to the noise of the sensors was measured and compared with calculated values.",
    "full_text": "Journal of Physics:\nConference Series\n       \nOPEN ACCESS\nNoise analysis of DC SQUIDs with damped\nsuperconducting flux transformers\nTo cite this article: M I Faley et al 2010 J. Phys.: Conf. Ser. 234 042009\n \nView the article online for updates and enhancements.\nYou may also like\nMagnetic background field-tolerant SQIF-\nbased current sensors\nM Schmelz, M Hopf, V Zakosarenko et al.\n-\nBi-SQUID: design for applications\nVictor K Kornev, Nikolay V Kolotinskiy and\nOleg A Mukhanov\n-\nAnalysis of a dc SQUID readout scheme\nwith voltage feedback circuit and low-noise\npreamplifier\nJia Zeng, Yi Zhang, Matthias Schmelz et\nal.\n-\n \nThis content was downloaded from IP address 91.100.61.210 on 05/11/2025 at 19:10\nNoise analysis of DC SQUIDs with damped superconducting \nflux transformers  \nM I Faley1, U Poppe1, K Urban1, and R L Fagaly2 \n1Institut für Festkörperforschung, Forschungszentrum Jülich GmbH, Jülich, Germany \n2Quasar Federal Systems, San Diego, CA 92121 USA \nE\n-mail: m.faley@fz-juelich.de \nAbstract.  An analysis was performed of intrinsic noise for high-T c DC SQUID with \ns\nuperconducting flux transformer (FT) containing resistive elements. For a SQUID with a loop \ninductance of about 40 pH we observed voltage swings of ∼ 55 µV and a flux noise of \n∼ 4 µΦ 0/√ H z at 77 K. Inductive coupling of an 8-mm multilayer superconducting FT to the \nSQUID increased voltage swings to ∼ 70 µV due to effective reduction of the SQUID loop \ninductance. This also increased the flux noise to ∼ 6 µΦ 0/√ H z, corresponding to a field \nresolution of ∼ 18 fT/√ Hz at 77 K with a white noise spectrum down to frequency ∼ 10 Hz. The \nmain sources of white flux noise were the Nyquist noise in the Josephson junctions and the FT, \nas well as the suppression of the DC SQUID voltage swings caused by parasitic capacitance \nbetween the FT and the SQUID. An ultra-low-ohmic resistor with resistance value between the \nflux-creep-induced resistances of superconductors (below ∼ 0.1 nΩ ) and resistances of \nconventional resistors (above ∼ 0.1 mΩ ) was developed. An RL-circuit based high-pass filter \n(HPF) with time constant ∼ 7 sec was realized and integrated in the superconducting FT. The \ncontribution of the HPF to the noise of the sensors was measured and compared with calculated \nvalues. \n1.  Introduction \nT\nhe direct-current superconducting quantum interference devices (DC SQUIDs) demonstrate superior \nsensitivity for measuring the vector components and spatial gradients of magnetic fields, as well as an \nability to resolve tiny changes in large signals. These features are particularly useful and have already \nbeen implemented in many applications such as low-noise amplifiers, biomagnetic research, non-\ndestructive evaluations, and geomagnetic exploration [1, 2]. In the case of high-T c SQUIDs with a 16-\nm\nm multilayer flux transformer (FT), a field resolution greater than 4 fT/ √ Hz at 77.4 K in magnetic \nshielding has been demonstrated [ 3]. However, in the presence of large background magne tic fields, \nthe increased intrinsic noise caused by the thermally activated creep of Abrikosov vortices spoils the \nresolution of the sensors and limits their applications despite reduced costs and a simple cooling \nprocess in comparison with the operation of low-T c SQUIDs at 4.2 K. To some extent, pinning of the \nA\nbrikosov vortices can be improved by implementing thicker high-T c films [ 4 ]. However, this was \nfound\n to be insufficient for most applications. For stable operation of sensitive high-Tc SQUID sensors \ndur\ning measurements outside magnetic shielding a high slew rate is required of the measuring system \ndetermined by a low flux noise and large voltage swings of the SQUIDs. Additionally, high screening \ncurrents appearing in the pickup coil of the multilayer FT after large changes in external magnetic flux \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\nc⃝ 2010 IOP Publishing Ltd\n1\n \n \n \n \n \n \nshould be avoided to minimize the low-frequency noise of the SQUID sensors associated with creep of \nvor\ntices in the high-Tc films. \nA\n straightforward way of increasing the voltage swings and reducing flux noise of the SQUID \nsensor is to reduce its inductance [ 5] and to inductively couple it to a multiturn input c oil of a \nmultilayer FT [ 6]. A theoretical and empirical analysis and suppressi on of noise sources originating \nfrom the superconducting FT and from its coupling to the SQUID are necessary to further improve of \nfield resolution and stable unshielded operation of high-T c DC SQUID magnetometers and \ngr\nadiometers. For example, the damping resistors can cause an additional Nyquist noise in the FT, \nmaking it desirable to find an optimum in suppressing resonances [ 7]. Parasitic capacitive shunting of \nthe\n SQUID by FT can also lead to significant deterioration of the voltage swings and the noise \nproperties due to LC resonance in the SQUID [8]. \nThe\n screening currents in the FT can be limited, for example, by a weak link or a Josephson \njunction integrated in series with the pickup loop: the so called flux dam [ 9]. At much smaller \ncur\nrents, the area of the flux dam becomes non-superconducting and dissipates the excess current. Due \nto the logarithmic decay of the current with time [ 10], it takes a long time until the flux dam \ncom\npletely closes and the uncontrolled flux entry into the pickup loop stops. The waiting time can be \nshortened by applying a compensation field or a switch [ 10], reducing circulating currents to a near-\nze\nro value. Such low noise corrections of screening currents for SQUID sensors with a flux dam are \nnot trivial and they are absent in the commercially available SQUID control electronics. As an \nalternative to flux dams and local compensation of the Earth’s field [ 11], we have suggested [ 12] \nim\nplementing an RL-circuit-based high-pass filter (HPF) integrated in the FT for passive reduction of \nthe currents induced by slow-changing (time constant > 1 sec) background magnetic fields. For \ncomparison, SQUIDs with a normal conducting FT have a cutoff frequency of ∼ 10 kHz and they are \nsensitive only at operation frequencies of ∼ 1 MHz [ 13]. Another solution with high-T c \ns\nuperconducting wires [ 14] failed to demonstrate sufficient sensitivity and wa s too bulky for \nintegration into the multichannel systems. \nUsually, the FT for sensitive SQUID magnetometers is produced from a closed superconducting \ncircuit with no resistive elements introduced in series. The superconducting current can flow in such a \nFT without dissipation for many years. This corresponds to dissipation time constant τ  = L/R > 108 sec \na\nnd a resistance below 10-16 Ω  at the inductance ∼ 10 nH for a bulky ring with a diameter of ∼ 1 cm. In \nthe case of high-T c superconductors, a flux-creep-induced resistance of ρ  ≈  6 x 10 -18 Ω  cm exists, \nleading to the effective resistance ∼ 10-13 Ω  a nd a time constant τ  ≈  107 sec for the inductance of the FT \n∼ 2 µH\n [15]. This means, that for effective dissipation of the superconducting current the flux-creep-\ninduced dissipation time constant of the fully superconducting FT is too long. Thinning and/or \ndegrading the superconducting film could reduce the dissipation time constant, but could also degrade \nthe long time stability of the sensors. The flux-creep-induced resistance is strongly dependent on \ntemperature and exponentially decreases with a reduction in the circulating superconducting current. \nThis in turn increases the dissipation time in a manner similar to the flux dam application.  \nIn this paper, we analyse noise properties of high-T c flip-chip DC SQUID magnetometers intended \nf\nor sensitive measurements with no magnetic shielding in the Earth’s magnetic field. These include \nlow-inductance SQUIDs with large voltage swings and SQUID sensors with a HPF integrated in the \nthin-film multilayer FT.  \n2.  Experimental \nThe high-oxygen-pressure sputtering technique [ 16] in pure (99.999 %) oxygen at a pressure of about \n4 m\nbar was used to deposit BaZrO 3 (BZO), SrTiO 3 (STO), YBa 2Cu3O7-x (YBCO), and PrBa 2Cu3O7-x \n(\nPBCO) films of the SQUID magnetometers from dc- or rf-magnetron targets with diameters of \n50 mm. The films were about 2.5 % thinner on the corners of 10 mm x 10 mm substrates and 15 % \nthinner on the perimeter of round wafers of diameter 30 mm compared to the film thickness in the \nmiddle of the substrates. The deposition from larger targets and the optimized arrangement of the \nSm2Co17 magnets in the magnetron target holders improved the thickness homogeneity of the films \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n2\n \n \n \n \n \n \napproximately threefold compared to films produced by a non-magnetron sputtering technique as \nde\nscribed in [16].  \nThe\n deposition rate of the YBCO and PBCO films was ∼ 50 nm/hour while the deposition rate of \nthe non-conducting materials was ∼ 30 nm/hour. The PBCO films together with STO films were used \nfor the insulation layer in crossovers of the multilayer FTs [ 17] and for an integrated resonance-\nda\nmping resistance in the FT. The effective resistivity of the epitaxial thin film STO insulation was \nthickness-dependent and was found to be ∼ 105 Ω ⋅cm for 100-nm-thick STO films, ∼ 108 Ω⋅cm for 200-\nnm\n-thick STO films, and greater than 1010 Ω ⋅cm for 300-nm-thick STO films at 77 K. The PBCO film \npreserved the epitaxial growth of the heterostructural insulator layer on YBCO and provided a \nresistive damping of the resonances in the FT due to the much smaller resistivity compared to that of \nSTO.  \nThe structures were deposited at a substrate temperature of about 800 oC and then cooled down \nw\nith an oxygenation step lasting one hour at 500 oC in 1 bar of pure (99.999 %) molecular oxygen. \nT\nhis was followed by cooling down to room temperature at a rate of 10 oC/min. The transition \nt\nemperature of the YBCO films was 91 - 93 K and the critical current 3 – 6 MA/cm 2 at 77 K.  \nT\nhe multilayer FT and DC SQUID were produced on separate MgO substrates both buffered by a \n300 nm thick epitaxial STO/BZO-bilayer [ 18]. In the magnetometer, the input coil of the FT was \nc\noupled in a flip-chip arrangement to the washer of the DC SQUID with a diameter of 1 mm. The flux \ntransformers (FTs) were made on single crystal substrates up to 30 mm in diameter and were later \nshaped by a diamond saw and emery paper. The Josephson junctions of the DC SQUIDs were \nproduced on 24 o bicrystal substrates. The junctions were ∼ 2 µm\n  wide and ∼ 100 nm thick. The \nresistance of the junctions was ∼ 5 Ω  and the critical current ∼ 25 µA at 77 K. Patterning of the \nstructures was performed by ion beam etching with the exception of the non-aqueous Br-ethanol \netching of the first two layers of the multilayer FTs. AZ5214 and AZMIR701 photoresists were used \nfor structuring with ion beam etching while Br-ethanol etching was performed with a PMMA \nphotoresist mask [17]. \nTw\no types of high-T c flip-chip DC SQUID magnetometers were prepared and investigated in this \ns\ntudy: (type A) with the superconducting multilayer FT containing only pickup and input coils (see \nFigure 1) and (type B) where the superconducting multilayer FT contained an integrated passive HPF \nas an ultra-low-ohmic resistor R placed in series with the coils of the FT (see Figure 2). The PBCO \nfilm in the PBCO/STO heterostructural insulator is used for damping of resonances in the FT. This \nheterostructural insulator is represented in Figure 1 as integrated resonance damping resistors and a \ncapacitor. They are not shown in Figure 2 but also present in the type B magnetometers. \n \n \n \n  \n \n \nFigure 1. Sketch of type A flip-chip DC \nSQUID magnetometer with an 8-mm \nmultilayer FT. The resonance damping \nresistors are made from the PBCO film in \nthe heterostructural insulator layer. \n Figure 2. Sketch of type B flip-chip DC \nSQUID magnetometer with an integrated HPF \nin the 16-mm multilayer FT. \n \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n3\n \n \n \n \n \n \nThe single-turn pickup coil of the FT in the type A magnetometer had outer dimensions of 8 mm x \n8 m\nm and an estimated inductance of about 40 nH, while the pickup coil of the FT in the type B \nmagnetometer had 10 turns, outer dimensions of 16 mm x 16 mm and an estimated inductance of \nabout 8 µH. Thickness homogeneity of the films is more important for the preparation of the FT for \ntype B magnetometers because it has multilayer structures spread over the whole substrate. \n2.1. Type A magnetometers \nThe type A magnetometer (Fig.1) was a HTM-8x modification of our HTM-8 magnetometer [ 6]. It \nha\nd a similar 8-mm multilayer FT (see Figure 3) but the DC SQUID inductance was twofold lower (LS \n≈  \n40 pH instead of 80 pH). The 40-pH SQUID hole was a 60-µm-long and 4-µm-wide slit surrounded \nby an array of holes of about 2  µm in diameter. The SQUID washer was octagonal with outer \ndiameter of about 1 mm. The DC SQUID hole and washer can be classified as the “A/C” type in \nFigure 11 in [ 19]. The geometrical and kinetic inductance of the SQUI D hole and bridges of the \nJosephson junctions were taken into account to estimate the total SQUID inductance.  \n \n \nFigure 3. Photo of the 8 mm x 8 mm multilayer \nFT intended for type A magnetometers. \n \nThe flux sensitivity ∂ B/∂Φ  of the autonomous (i.e. without FT) 40-pH SQUID was about \n100 nT/Φ 0. After the flip-chip arrangement of the SQUID and FT, the flux sensitivity ∂ B /∂Φ  of the \ntype A magnetometer was ∼ 3 nT/Φ 0 compared to ∼ 1 n T/Φ 0 flux sensitivity for HTM-8 magnetometers \nw\nith ∼ 80 pH coupled-SQUID inductance. \nThe flux slew rate of the measurement system is equal to πΦ f, where Φ  is the maximal magnetic \nflux of the frequency f, which can be followed by the measuring system without loosing of the \nfeedback lock [20]. For typical environmental electromagnetic noise in buildings (e.g. in a laboratory) \nthe required system flux slew rate for type A magnetometers is ∼ 3 times smaller than for HTM-8 \nmagnetometers, and can be easily achieved with commercially available SQUID control electronics \n[21]. Tuning the operation parameters such as bias curre\n nt, flux modulation amplitude, and skew, as \nwell as locking feedback, is much easier for the type A magnetometers. The tuning procedure can be \nperformed in our laboratory, where the peak-to-peak amplitude of power-line electromagnetic \ninterference of 50 Hz was about 70 nT, in similar way to that performed in a magnetic shield. HTM-8 \nmagnetometers, on the other hand, usually require an RF shield with at the least more than 3 dB of \nsuppression at 50 Hz to tune of SQUID parameters in a magnetically unshielded environment.  \nThe voltage swing and intrinsic noise of the autonomous (without FT) DC SQUIDs were compared \nwith those of type A magnetometers after the flip-chip arrangement with FT. For the best 40-pH DC \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n4\n \n \n \n \n \n \nSQUID intended for type A magnetometers, the maximal voltage swing (peak to peak) measured was \nup \nto about 55 µV and the best flux resolution of 2 / 1\nΦS  was as low as ∼ 4 µ Φ 0/√ H z at 77 K (see \nFigure 4). The magnetic field noise was measured in a composite magnetic shield containing 3 \ncylindrical layers of µ-metal combined with a twin-cylindrical-layer high-T c superconducting shield. \nT\nhe residual permanent magnetic field in this composite magnetic shield was about 100 nT. \nFor a typical bias current I B = 2I C = 50 µA the parameter 1 / 2 0 ≈Φ= C SL I Lβ  was found to be \noptimal for SQUID operation and provided the best energy resolution. The flip-chip arrangement of \nthe 8-mm multilayer FT and the DC SQUID increased the voltage swings of the SQUID to ∼ 70 µV but \nalso increased its flux noise to ∼ 6 µΦ 0/√ H z at 77 K. This corresponds to the field resolution \n∼ 18 fT/√ Hz at 77 K. Possible sources of additional flux noise in the type A magnetometer were \ninvestigated. We observed, that part of the additional flux noise originated from the Nyquist noise in \nthe superconducting FT and part from coupling the superconducting FT to the SQUID. \n \n \nFigure 4. Noise spectrum of an autonomous DC SQUID with LS ~ 40 pH. \n \nN\nyquist noise of the integrated resistance for damping resonances [ 7] in the FT is one possible \nsour\nce of the additional flux noise. We used a PBCO/STO heteroepitaxial layer to construct an \ninsulator between the superconducting films of the FT. This allowed us to provide the required \nepitaxial growth and insulation properties of the insulator. Thanks to its conductivity along the \nsubstrate surface, the PBCO/STO heteroepitaxial layer also served as an integrated resonance-damping \nresistor. As a result, the V( Φ ) characteristics of the magnetometers were sinusoidal and the estimated \nNyquist noise of the resistor was below 2 µΦ 0/√ H\nz at 77 K. In a few cases possible normal-conducting \nmicro-shorts in the insulation layer, for example, due to CuO outgrowths or defects in epitaxial growth \nof the insulation layer at the edges of crossovers in the input coil, can also led to an additional white \nflux noise of the FTs. Such obviously defect FTs were rejected from the technology line and are not \nconsidered here. The insulation layer with embedded CuO outgrowths is sensitive to mechanical \ndamages and, hence, special treatment was necessary during the photolithography and handling of the \nFTs. The CuO outgrowths are required for improved transport properties of the superconducting films \ndue to improved pinning of the Abrikosov vortices but they are usually thicker than the surrounding \nfilm. \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n5\n \n \n \n \n \n \nA non-monotonous dependence of the voltage swing was observed on the coupling between the \ni\nnput coil of the FT and the washer of the DC SQUID. The reduction in insulation thickness first \nincreased the voltage swing due to effective reduction of the SQUID inductance down to LSeff ≈  25 pH . \nHowever, thicknesses of less than ∼ 1.5 µm led to a reduction in voltage swing, the appearance of two \nmaxima in the dependence of voltage swing on the bias current, and an increase in the flux \nnoise ( )Φ ∂ ∂ =Φ / /2 / 1 2 / 1V S SV . Such effects indicate that the LC-resonance in the DC SQUID loop \ns\nhifted to lower frequencies as a result of parasitic capacitive shunting of the DC SQUID by the FT \nwith a corresponding increase in the Stewart-McCumber parameter 0\n2 / 2Φ= C R IN CC π β  of the \nJosephson junctions (see e.g. [ 8, 22, 23]). For the bicrystal Josephson junctions, the typica l value of \nthe parameter β C is ∼ 0.3 at 77 K. This value can significantly increase due to the capacitive coupling \nof the junctions with the return line of the multilayer FT, which covers the junctions and slits in the \nSQUID washer.  \nIn our geometry, the effect of an increase in the capacitance is stronger than the effect of a \nreduction in the SQUID inductance, resulting in a reduction in the frequency of the LC-resonance. At \nthe bias current corresponding to the LC-resonance frequency, the voltage swing even fell to zero. \nHowever, in most cases, keeping the insulation thickness at ∼ 1.5 µm made it possible to avoid the \nappearance of the LC-resonance in the vicinity of the bias current of the DC SQUID, while providing \nsufficient inductive coupling between the input coil of the FT and the washer of the DC SQUID. For \noptimum insulation thickness the estimated coupling coefficient between the input coil of the FT and \nthe SQUID washer was about α  ≈  √ [2(1-LSeff/LS)] ≈  0.87. A further decrease in the SQUID inductance \nLS and a simultaneous decrease in the insulator thickness will ensure an unchanged resonance \nf\nrequency.  \n \n \nFigure 5. Noise spectrum of the type A magnetometer. \n \nThe type A magnetometers were operated in an unshielded environment without suppression of \neither the bias current or the SQUID voltage swing. The white noise of the sensors in the unshielded \nenvironment also remained unchanged. The intrinsic magnetic field noise values of the magnetometers \nwere measured in the composite magnetic shield. For the best type A magnetometer, the field \nresolution achieved was ∼ 18 fT/√ Hz at 77 K. However, the typical field resolution was about twofold \nworse (see Figure 5). The non-zero flux-creep-induced resistance ∼ 4 pΩ  and the corresponding time \nconstant ∼ 104 sec can explain the low-frequency component in the noise spectrum of the type A \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n6\n \n \n \n \n \n \nmagnetometer shown in Figure 5, assuming a flux-creep-induced resistance of ∼ 10-19 Ω⋅cm in our \nf\nilms compared to the value 6 x 10 -18 Ω ⋅cm obtained in [ 15] for YBCO films prepared by the laser \nabl\nation deposition technique. Measurements in smaller than the present 100 nT residual magnetic \nfields in the composite magnetic shield and improved pinning of the Abrikosov vortices can further \nreduce this low-frequency noise of the sensors.  \nIncreasing the linear dimensions of the FT pickup loop by K times can further improve the field \nresolution of the flip-chip sensors in about K 3/2 times [ 6 ]. Once the sensors in the Earth’s magnetic \nfi\neld had been moved or rotated, the sensors had to be heated above the superconductor transition \ntemperature for about 3 minutes to remove magnetic flux that penetrated into the high-T c films of the \nS\nQUID body and to improve the low-frequency noise properties of the sensors. This disadvantage of \ntype A magnetometers can be avoided with type B magnetometers. \n2.2. Type B magnetometers \nThe first prototype of a passive HPF based on integrating a LR-circuit into the superconducting FT \nwas realized in the present work. The aim was to diminish the effect of huge but slowly changing \nmagnetic fields on the SQUID, for example, during movement or rotation in the Earth’s magnetic \nfield. The task was to achieve the time constant τ  > 1 sec for the integrated thin film HPF to get \nsufficient field resolution at frequencies above 100 Hz. To accelerate the dissipation of the low-\nfrequency component of the circulating current, we integrated a low-noise normal metal resistor with a \nvery small resistance in series with the pickup coil and the input coil inductances of the FT. The \nproblem was to achieve such a low-noise resistor with a resistance value just between the values of the \nflux-creep-induced resistance of superconductors (< 0.1 n Ω ) and the resistance of commercially \navailable normal conducting resistors (> 0.1 m Ω ). The normal conducting FTs have a much higher \nresistance of about 1 Ω  [13]. \nA \nsketch of a thin-film resistor with low magnetic noise and an ultra low resistance is shown in \nFigure 6. We constructed [ 12] the low ohmic resistor from two 50-µm-wide meander- like \nsuperconducting coplanar lines (1) and (2) connected them to each other using a silver film (3). The \ntotal length of the lines was about 100 cm and the distance between the lines was about 50 µm. The \nmeander-like resistor should produce relatively low (negligible) magnetic flux noise for outside \ncircuits because due to its structure the magnetic field generated by Nyquist noise in the silver layer is \nessential only in the vicinity of the coplanar lines. \n \n \nFigure 6. Sketch of a thin-film resistor with low \nmagnetic noise and ultra low resistance. \n \nA 1-µm-thick silver film was deposited ex-situ on a freshly deposited YBCO film. After \nstructuring, the silver film electrically connected the superconducting lines. The estimated resistance \nof this structure was R ≈  1 µΩ  at 77 K. This value is the sum of the resistance of the silver film R Ag ≈  \n0.9 µΩ  \nand the resistance of the contacts between the silver and YBCO films R cont ≈  0.1 µ Ω . The \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n7\n \n \n \n \n \n \nestimated specific contact resistivity for the contact between the silver film and YBCO film was ρ c ≈  \n5 \n10-8 Ω ⋅cm 2. To provide the low contact resistance for the silver film deposited e x-situ on YBCO, it is \nimportant that the top YBCO film should be fresh. In our case the transfer time between two different \nsputtering machines was kept below 5 min. This value corresponds to one obtained in [ 24] for similar \nex\n-situ contact between a silver film deposited on a fresh YBCO film. To avoid possible \ndeoxygenating of the YBCO surface at the interface to silver we first sputtered 30 nm of silver in the \n30 % oxygen and 70 % argon gas mixture. The rest of the silver was deposited in pure (99.999 %) \nargon. A dc-magnetron sputtering technique was used to deposit the silver film. \nTo provide a dissipation time constant τ  = L/R ≈  10 sec with a resistance R ≈  1 µΩ  it is necessary \nthat the inductance of the FT is L ≈  10 µH. For example, the standard high-T c magnetometer HTM-16 \nha\ns a pickup loop of 16 mm [ 6] and an inductance of ∼ 70 nH . The size of the pickup coil of the FT is \nlimited by the size of the substrate washer and the only possibility of increasing the inductance L was \nto use ten turns for the pickup coil instead of one turn.  \nFor the type B magnetometers we constructed a special FT with 10 turns in a pickup coil measuring \n16 mm x 16 mm with a serially connected meander-formed 1-µ Ω  thin-film silver resistor. A photo of \nthis type of FT is shown in Figure 7. The FT had two epitaxial YBCO layers for the coils and their \nreturn lines. An epitaxial PBCO/STO multilayer film was used for the insulation between the \nsuperconducting layers. Once the top YBCO layer had been deposited, the structure was oxidized at \n500 oC for 1 hour and cooled down to room temperature at a rate ∼ 10 de g/min. The operation \ntemperature of the FT and the whole magnetometer was 77 K. \n \n \nFigure 7. Photo of the 16 mm x 16 mm \nmultilayer FT with integrated HPF intended for \ntype B magnetometers. \n \nPreliminary tests were performed on the flux transformers simply by turning them in the Earth’s \nmagnetic field under a high-T c DC SQUID gradiometer system [ 25] . While for the FT in the type A \nma\ngnetometers, the gradiometer signal changed from one constant level to another, in the case of the \nFT in the type B magnetometers, it always relaxed to a value of zero in a few seconds. This simple \nexperiment demonstrated the achievement of a dissipation time constant of τ  ∼ 7 sec for the integrated \nHPF due to a resistance of ∼ 1 µΩ  of the silver resistor.  \nThe FT with the HPF was inductively coupled to a ∼ 130-pH DC SQUID, which had an effective \ninductance of ∼ 80 pH after the flip-chip arrangement because part of the SQUID hole was screened by \nthe return line of the FT input coil. The estimated coupling coefficient of the SQUID and the input coil \nof the FT was α  ≈  0.88. The DC SQUID hole and washer of the type B magnetometers can be \nclassified as the type “A” washer in Figure 11 in [ 19]. The flux sensitivity of the type A magnetometer \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n8\n \n \n \n \n \n \nwas ∼ 2.6 nT\n /Φ 0, while the flux sensitivity of the screened DC SQUID itself was ∼ 40 nT /Φ 0. Voltage \ns\nwings in the type B SQUID magnetometers were observed up to about 20 µV peak to peak. \nThe relatively large DC SQUID inductance was required to provide sufficient direct inductive \ncoupling between the feedback coil and the SQUID. If the feedback coil was coupled to the SQUID \nmediated by the FT, as it was done for type A magnetometers, the bias flux, for example, could not be \nset at operation point Φ 0/4 because any bias flux induced in the input coil would relax within the FT to \nz\nero in few seconds. As a result, closing the feedback would bring the system in saturation, thus \nmaking measurements impossible. A 50-turn Cu-wire feedback coil was placed on the back side of the \nSQUID’s substrate at a distance of ∼ 2 mm from the SQUID’s washer. Due to the relatively small size \nof the SQUID washer and the relatively large separation the mutual inductance between the feedback \ncoil and the screened SQUID was only ∼  (10 µA/Φ 0)-1 ≈  200 pH\n and the estimated coupling coefficient \nonly ∼ 0.2.  \nNevertheless it was possible to operate the type B flip-chip magnetometers in the closed flux-lock-\nloop mode. The cut-off frequency of the HPF f 0 = R/2π L  and the corresponding dissipation time \nconstant in the FT of τ  ≈  7 sec were confirmed by measurements in low-frequency magnetic fields \ngenerated by a signal generator. The sensor was placed inside a five-turn coil with a diameter of \n15 cm, which in turn was placed inside a cylindrical µ-metal magnetic shield with a diameter of 50 cm. \nStable operation of type B magnetometers was demonstrated outside the magnetic shield. Neither \nthe slow movement (time constant > 10 sec) of the sensor together with the cryostat nor the changing \nof the background magnetic field by magnet movement near the sensor unlocked the feedback of the \nmeasurement system or increased its intrinsic noise. Faster movements (time constant < 1 sec) in the \nEarth’s magnetic field unlocked the measurement system due to weak coupling of the feedback coil to \nthe SQUID in this prototype sensor configuration. At low frequencies, the system operation frequency \nbandwidth was, , limited by the cut-off frequency of the HPF, while at high frequencies, it was limited \nto about 200 Hz by the gain of the feedback circuit. A larger voltage swing and improved coupling of \nthe feedback coil to the SQUID can potentially significantly increase the upper cut-off frequency and \nthus significantly increase the bandwidth of the measurement system. \n \n \n \nFigure 8. Measured and calculated field resolution for type B \nmagnetometers with HPF containing a 1-µ Ω  silver resistor and \na total FT inductance of 7 µH. The drop above ∼ 200 Hz is an \nartifact due to the limited gain of feedback electronics. \n \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n9\n \n \n \n \n \n \nThe measured and calculated field resolution for type B magnetometers with HPF, with a 1-µ Ω  \ns\nilver resistor and an FT total inductance of 7 µH are shown in Figure 8. AC-bias electronics was used \nfor the measurements. The observed field resolution of the type B magnetometers fits the expected \nintrinsic low-frequency noise of the magnetometer caused by Nyquist noise in the HPF at frequencies \nbelow about 10 Hz. However, the white noise level is still about five times higher than the expected \nvalue of about 40 fT/ √ Hz. There are several possible reasons for this elevated white noise: normal \nconducting micro-shorts in the multilayer FTs; the use of still non-optimized SQUID layout and flip-\nchip coupling for the current type B magnetometers as well as possible emission of the magnetic white \nnoise by the ultra-low-ohmic resistor of the HPF. Further study is required to identify and suppress the \nsources of the excess noise. \n3.  Discussion \nThe two types of the flip-chip high-T c DC SQUID magnetometers realized are interesting test objects \nf\nor analysing physical effects that contribute to their intrinsic noise. This analysis can be used to \nfurther improve the operation parameters of these DC SQUIDs. The main sources of the intrinsic flux \nnoise of the SQUID sensors are the Nyquist noise of the Josephson junctions, thermally activated \nhopping of Abrikosov vortices, noise from the resistors and defects in the FT, as well as the parasitic \neffects caused by the strong coupling between the FT and the SQUID. The voltage noise of the \npreamplifier 2 / 1\nV\neS is typically about 0.3 nV/ √ Hz and is usually small compared to the total intrinsic \nnoise of the high-Tc SQUID sensor. \nT\nhe thermally activated hopping of the Abrikosov vortices between the pinning sites depends on \nthe current due to the current-dependent pinning energy. Hence, even if the circulating current is much \nless than the critical current, the hopping of the Abrikosov vortices in the superconductor generates a \nvoltage, which opposes to the current. This leads to a flux-creep-induced effective resistance of the \nhigh-Tc superconductor films and to the low-frequency flux noise in the FT and in the SQUID [ 15]\n . \nIm\nproving the quality of the high-T c films, conducting the measurements in a smaller residual \nm\nagnetic field of the magnetic shield, and improved pinning of the Abrikosov vortices (as done e.g. in \n[26]) can further reduce the low-frequency noise of the s ensors.  \nThe white flux noise of the SQUIDs is determined mainly by the thermal fluctuations in the \nJosephson junctions: \n \n\n\n\nΦ ∂\n∂\n+\n\n\n\n\n\n\n\n\n\n\n\n\n\nΦ ∂\n∂+\n≈\n\n\n\nΦ ∂\n∂=Φ\nV\nSVL\nR\nR\nT k\nV\nSS\nVe\nN\nB SN\nV\n22 2\n2 / 1\n2 / 1\n4 2\n12\n              ,                            (1) \n \nw\nhere it was assumed that the dynamic resistance of the DC SQUID R Sdyn at the operation point R Sdyn \n≈  \nRJdyn/2 ≈  R N/√ 2, where R Jdyn is the dynamic resistance and R N is the normal resistance of one \nJ\nosephson junction in the DC SQUID [ 23] and the maximum transfer function of the DC SQUID i s \ndetermined by the expression [27]: \n \n) 5 . 3 exp(21\n4\n2\n0\n2\n0\n0 Φ− ⋅\nΦ+\n⋅Φ≈Φ ∂\n∂ S B\nS C\nN C TL k\nL\nI\nR IV π                       .          (2) \nThe SQUID voltage swing δ Vpp is equal to ( ∂ V/∂Φ )Φ 0/π  in the limit of the sinusoidal voltage \nmodulation with applied magnetic flux V(Φ ). \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n10\n \n \n \n \n \n \nThe white flux noise of an autonomous SQUID was estimated for typical operation parameters of \nt\nhe SQUID according to expression (1) and is shown in Figure 9. The calculated value ∼ 3 µΦ 0/√ H z fit \nwell to the measured white noise level ∼ 4 µΦ 0/√ H z observed for the noise spectrum of an autonomous \nDC SQUID with an inductance ∼ 40 pH, as shown in Figure 4. \n \n \n \nFigure 9. Theoretical estimation of the white flux noise of an \nautonomous DC SQUID compared with the measured flux noise of the \n40-pH DC SQUID for type A magnetometer ( /square7) and the flux noise of \nt\nhe 130-pH DC SQUID for the type B magnetometer (/trianglecentup).  \n \nTypi\ncally, the Stewart-McCumber parameter β C of the high-Tc bicrystal Josephson junctions is less \nt\nhan 0.5 at 77 K. This value is low enough that the suppression of the SQUID voltage swing due to the \nparameter β C can be neglected [ 8 ]. At β L = 2L SIC/Φ 0 = 1 the SQUID bias voltage V = I cRN√ ( 2/ πβ C), \nc\norresponding to the LC-resonance in the SQUID loop at this capacitance, exceeds the characteristic \nvoltage Vc = IcRN. Therefore, this LC-resonance does not degrade the SQUID voltage swing. \nT\nhe tight coupling of the FT to the SQUID introduces additional noise due to resonances in the FT \nand shifts the LC-resonance of the SQUID. For the pure STO insulation between the superconducting \nlayers in the multilayer FT kinks-like resonance structure was observed in the V( Φ ) characteristics of \nthe magnetometers (see e.g. [28] and references therein). The addition of a resistive  PBCO layer in the \ninsulation has allowed to suppress these kinks in the V( Φ ) characteristics of the magnetometers. An \noptimization of the distance between FT and the SQUID kept the SQUID’s LC-resonance voltage \nabove Vc. \nA\ns long as there is no significant degradation of the coupling coefficient “ α ”, reducing the SQUID \ninductance Ls should improve the field resolution of the inductively coupled magnetometers [2 9]: \n \nn\nS\nS i\ni p\nN\nR\nLS\nL L\nL LSBB αασ\n12 / 12 / 1 ∝+=\n\n\nΦ ∂\n∂= ΦΦ                 ,                                 (3) \n \nwhereas for the type A flip-chip high-T c DC SQUID magnetometers the inductance of the pick-up \nl\noop L p ∼ 40 nH  is equal to the inductance of the input coil L i and the area of the pick-up loop σ  \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n11\n \n \n \n \n \n \n∼ 64 m\nm 2. Our experience shows that reducing SQUID inductance down to at least 40 pH does not \nde\ngrade the field resolution, but rather significantly improves the voltage swing and operational \nstability of the DC SQUID magnetometers in the magnetically unshielded environment. \nA large change in the magnetic field component, which is normal to the pickup loop of the 8-mm \nFT, for example, due to movement or rotation of the magnetometers in the Earth’s magnetic field, \nleads to an induction of about 30 times stronger magnetic field at the SQUID, approaching in the worst \ncase a magnetic field of about 1 mT. The magnetic field B > 100 µT penetrates into the SQUID washer \ncreating Abrikosov vortices and suppresses the critical current I c of the bicrystal Josephson junctions \ndue\n to the “Fraunhofer pattern” dependence I c(B). Part of the magnetic field amplified by the FT can \nr\neach the Josephson junctions suppressing their critical currents and the voltage swing of the DC \nSQUID. Then the only possibility of recovering SQUID operation is to reduce the induced circulating \nsuperconducting current in the FT. For type A magnetometers, the standard procedure for removing \nthe nonequilibrium part of the frozen magnetic flux from the SQUID washer and dissipating the \ninduced circulating superconducting current in the FT is to heat the magnetometer above the \nsuperconducting transition temperature using an integrated nonmagnetic heater. This procedure \ntogether with subsequent cooling to the operation temperature usually takes up to about 5 minutes, \nwhich can be inconvenient for some applications.  \nUntil now, the only alternatives to heating the magnetometer were the application of passive or \nactive modifications of the flux dam [ 9, 10 ] or local compensation of the Earth’s field [ 11]. Our \nsugge\nstion was to solve this problem automatically in the FT before the high magnetic fields reach the \nDC SQUID by integrating the passive HPF into the FT [ 12]. This method also has its disadvantages. \nIn t\nhe following part of the paper we will discuss the features and possible application areas of SQUID \nsensors with superconducting FTs containing a passive HPF based on the ultra-low-resistance thin-\nfilm resistor integrated in series with the coils of the FT. \nA meander-like coplanar line structure of the ultra low resistance thin film resistor (see Figure 6) \nwas chosen because it generates negligibly small magnetic field noise. The structures wherein, e.g., \nthe thin film electrodes are interlocked with each other such that one set of “fingers” of the first \nelectrode are located in the gaps between another set of “fingers” of the second electrode (interdigited \ncomb-shaped electrodes) can achieve lower resistance values, but they demonstrate a large magnetic \nfield noise because they contain normal conducting loops having an area comparable with the area of \nthe pickup loop of the FT. Large normal conducting soldered contacts of high-Tc wires like it was used \ni\nn reference [ 14] would also generate significant magnetic noise pene trating between the high-T c \nf\nilaments of the superconducting electrodes. A possible low-noise alternative to the present meander-\nlike coplanar line resistor can be a planar three-layer structure containing continuous superconducting \nelectrodes and a normal conducting interlayer. Such planar three-layer structures can be produced with \nlow-Tc superconducting electrodes in the form of thin films or foils as well as with the high-T c \ns\nuperconducting electrodes in the form of thin epitaxial films deposited on different substrates and \nelectrically connected to each other in a flip-chip configuration via the low ohmic, e.g., silver \ninterlayer. \nThe resistor (see Figure 2) having the ultra low resistance R generates the following Nyquist noise \ncurrent in the frequency bandwidth ∆ f and the total inductance L of the FT: \n \n( )\n22\n2\n2\n4\nL f R\nf TR kI B\nN\nπ+\n∆=                                          .                  (4) \n \nT\nhis noise current in the FT creates magnetic field noise in the input coil of the FT and thus leads to \nadditional low-frequency flux noise in the DC SQUID:  \n \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n12\n \n \n \n \n \n \n( )\n22\n2 / 1\n2\n4\nLf R\nf L TRL kI L L S S i B\nNS i\nπαα\n+\n∆==Φ                        ,             (5) \n \nw\nhich, in turn, leads to a low-frequency noise contribution to the intrinsic noise of the magnetometer, \nlimiting its magnetic field resolution at low frequencies: \n \n( )\n22\n2 / 12 / 1\n2\n4\nLf R\nf TR k\nm\nLS\nL L m\nL LSBB B\nS i\ni p\nN\nπσσ α +\n∆=+=\n\n\nΦ ∂\n∂= ΦΦ              ,             (6) \n \nwhere m =10 is the number of turns in the pickup coil and σ  = 2.56 cm2 is the area of one loop of the \npi\nckup coil of the FT. \nTaking into account the calculated white flux noise of the magnetometers (see equation (1)) we \nestimated the total field resolution of the magnetometers with the current prototype FT containing the \npassive HPF (see Figure 10). \n \n \nFigure 10. Calculated field resolutions for the type B magnetometers \nwith total inductance of the FT of 7 µH at 77.4 K and 4.2 K. \n \nTwo main disadvantages of the present type B magnetometers were observed: high low-frequency \nnoise and weak coupling of the feedback coil. To reduce the low-frequency noise down to about \n100 fT/√ Hz at 77 K, to the level of the type A magnetometers, an increase in the dissipation time \nconstant τ  to more than about 2.5 hours is required. This is impractical, but would be possible if the \nresistance of the integrated resistor was reduced and the inductance increased both about thirtyfold to \n30 nΩ  and 210 µH, respectively. The increase in the size of the pickup loop and/or use of low-T c \nS\nQUID magnetometers with the coils wound from a superconducting wire would make it easier to \nincrease the dissipation time constant. \nThe coupling of the SQUID and the feedback coil can be improved, for example, by increasing the \nsize of the SQUID washer, introducing a directly coupled flux antenna on the SQUID chip or using an \nintermediate FT. In all cases the SQUID itself will be more sensitive to the external fields and suffer \nfrom large changes of the background fields. Shielding of the SQUID from the background fields (not \nFT!) is desirable and is also easier to realize with low-Tc sensors. \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n13\n \n \n \n \n \n \nFigure 11 shows possible applications of the low ohmic resistors as a dissipative element in the \npi\nckup coils of the directly coupled SQUID magnetometer (Figure 11a) and SQUID gradiometers of \nfirst order (Figure 11b-d) and second order (Figure 11e). In all pictures (1) denotes the pickup coil, (2) \n– the low ohmic resistor, and (3) – the input coil. The arrows indicate the direction of the induced \ncurrents in separated coils by similar changes of the external magnetic fields. The input coil of the \ndirectly coupled magnetometer is part of the SQUID loop (Figure 11a). \n \na. \n \n    b. \n    c. \n   \n d. \n e. \n  \n \nFigure 11. Additional examples of possible superconducting FTs with an integrated HPF: (a) directly \ncoupled SQUID magnetometer and (b-d) SQUID gradiometers of first order and (e) SQUID \ngradiometers of second order. \n \nIn the cases of the gradiometers shown in Figure 11b and Figure 11c, the spatially homogeneous \nchanges of the external magnetic field only generate the current in the perimeter loop of the \ngradiometer but no residual current flowing through the input coil. In the cases of the gradiometers \nshown in Figure 11d and Figure 11e, the spatially homogeneous changes in the external magnetic field \ncause the currents to cancel each other and no net current flows in the pickup coils and through the \ninput coil. The resistors help to dissipate currents produced by the slowly changing spatially \ninhomogeneous background magnetic fields. \nFurther optimization of type B magnetometers would open the possibilities for their applications in, \nfor example, non-destructive evaluation, geomagnetic exploration and biomagnetic measurements. \n4.  Summary \nWe realized and investigated DC SQUID magnetometers with different high-T c superconducting FTs: \nf\nor the type A magnetometer the FT contained a single-turn pickup coil and a multilayer input coil \nwhile for the type B magnetometer the FT contained an integrated passive HPF with an ultra-low-\nohmic resistor placed in series with the multilayer coils. The resonances in FT were damped by the \nPBCO film in the PBCO/STO-heterostructural insulator layer between the superconducting films. \nShifting was observed of the LC-resonance in the DC SQUID caused by parasitic capacitance between \nthe SQUID and the FT. An optimization was performed of the separation distance between the FT and \nthe SQUID to avoid suppression of the SQUID voltage swings and corresponding increase of the \nSQUID flux noise. An experimental and theoretical analysis was performed of the intrinsic noise of \nthe high-Tc DC SQUID with a superconducting flux transformer (FT) containing resistive elements. \nA\ngreement was obtained between the calculated and measured values. \nWe realized a low-noise ultra-low-ohmic resistor with resistance values between the flux-creep-\ninduced resistances of the superconductors (below 0.1 n Ω ) and resistances of conventional resistors \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n14\n \n \n \n \n \n \n(above 0.1 mΩ )\n . We developed an HPF with time constant ~7 sec based on an RL-circuit integrated in \nthe high-Tc superconducting FT with such ultra-low-ohmic resistor having the resistance ~1 µ Ω  and \ninductance of a 16-mm pickup coil ~7 µH. Both coils of the FT with HPF were multiturn multilayer \nhigh-Tc superconducting coils with resonance damping by the PBCO film in the PBCO/STO-\nhe\nterostructural insulator layer between the superconducting films. Contribution of the integrated HPF \nto the intrinsic noise of the high-Tc DC SQUID sensors was compared with calculated values.  \n \n5. A\ncknowledgments \nThe authors gratefully acknowledge the technical assistance of R. Speen. \n6. References \n[1] The SQUID Handbook Vol.2: Applications of SQUIDs and SQUID systems  Editors: J Clarke \nand A I Braginski 2006 (Weinheim: WILEY-VCH Verlag GmbH&Co. KGaA), ISBN 3-\n52740408-2 \n[2] Fagaly R L 2006 Rev. Sci. Instr. 77 101101 \n[3] Faley M I, Jia C L, Poppe U, Houben L, and Urban K 2006 Superc. Sci. Technol. 19 S195 \n[4] Faley M I, Mi S B, Jia C L, Poppe U, Urban K, and Fagaly R L 2008 Journal of Physics: \nConference Series 97 012164 \n[5] Enpuku K, Tokita G, Maruo T, and Minotani T 1995 J. Appl. Phys. 78 3498 \n[6] Faley M I, Poppe U, Urban K, Paulson D N, Starr T, and Fagaly R L  2001 I EEE Trans. on \nAppl. Supercond. 11 1383 \n[7] Huber M E, Steinbach A H, and Ono R H 2001 Physica C 351 85 \n[8] Enpuku K, Sueoka K, Yoshida K, and Irie F 1985 J. Appl. Phys. 57 1691 \n[9] Koch R H, Sun J Z, Foglietta V, and Gallagher W J 1995 Appl. Phys. Lett. .67 709 \n[10] Enpuku K, Kuroda D, Tokimizu D, and Yang T Q 2002 J. Appl. Phys. 92 4751 \n[11] Drung D and Schurig T 2003 IEEE Trans. on Appl. Supercond. 13 751 \n[12] Faley M I, Poppe U, and Fagaly R L 2009 German Patent Application Nr.102009025716.0 \n[13] He D F, Itozaki H, and Tachiki M, 2006 Superc. Sci. Technol. 19 S231 \n[14] Dyvorne H, Scola J, Fermon C, Jacquinot J F, and Pannetier-Lecœur M 2008 Rev. Sci. Instr. 79 \n025107 \n[15] Stephens R B and Fagaly R L 1991 Cryogenics 31 988 \n[16] Poppe U, Klein N, Dähne U, Soltner H, Jia C L, Kabius B, Urban K, Lubig A, Schmidt K, \nHensen S, Orbach S, Müller G, and Piel H 1992 J. Appl. Phys. 71, 5572 \n[17] Faley M I, Poppe U, Soltner H, Jia C L, Siegel M, and Urban K 1993 Appl. Phys. Lett. 63, 2138 \n[18] Faley M I, Mi S B, Petraru A., Jia C L, Poppe U, and Urban K 2006 Appl. Phys. Lett. 89 082507 \n[19] Koelle D, Kleiner R, Ludwig F, Dantsker E, and Clarke J 1999 Rev. Mod. Phys. 71 631 \n[20] Koch R H 1997 IEEE Trans. on Appl. Supercond. 7 3259 \n[21] CRYOTON Ltd (Moscow), SUPRACON AG (Jena), and Tristan Technologies Inc. (San Diego) \n[22] Seppä H and Ryhänen T 1987 IEEE Trans. on Magnetics 23 1083 \n[23] Ryhänen T, Seppä H, Ilmomiemi R, and Knuutila J 1989 J. Low Temp. Phys. 76, Nos. 5/6, 287 \n[24] Du J, Lamand S K H, and Tilbrook D L 2001 Superc. Sci. Technol. 14 820 \n[25] Faley M I, Poppe U, Slobodchikov V Yu, Maslennikov Yu V, and Urban K 2004 Superc. Sci. \nTechnol. 17 S301 \n[26] Maiorov B, Baily S A, Zhou H, Ugurlu O, Kennison J A, Dowden P C, Holesinger T G, Foltyn \nS R and Civale L 2009 Nature Materials 8 398 \n[27] Enpuku K, Tokita G, Maruo T, and Minotani T 1995 J. Appl. Phys. 78, 3498 \n[28] D. Drung, F. Ludwig, W. Müller, U. Steinhoff, L. Trahms, H. Koch, Y. Q. Shen, M. B. Jensen, \nP. Vase, T. Holst, T. Freltoft, and G. Curio 1996 Appl. Phys. Lett. 68 1421  \n[29] Jenks W G, Thomas I M, and Wikswo J P 1997 Encyclopedia of Appl. Phys. 19 457 \n \n9th European Conference on Applied Superconductivity (EUCAS 09) IOP Publishing\nJournal of Physics: Conference Series 234 (2010) 042009 doi:10.1088/1742-6596/234/4/042009\n15"
}