{
  "title": "Brain Cancer Risk Prediction Tool using Data Mining",
  "url": "https://openalex.org/W2099190994",
  "year": 2013,
  "authors": [
    {
      "id": "https://openalex.org/A5021587516",
      "name": "Tasnuba Jesmin",
      "affiliations": [
        "Mawlana Bhashani Science and Technology University"
      ]
    },
    {
      "id": "https://openalex.org/A5020570233",
      "name": "Kawsar Ahmed",
      "affiliations": [
        "Mawlana Bhashani Science and Technology University"
      ]
    },
    {
      "id": "https://openalex.org/A5001711391",
      "name": "Md. Zamilur Rahman",
      "affiliations": [
        "Mawlana Bhashani Science and Technology University"
      ]
    },
    {
      "id": "https://openalex.org/A5054516974",
      "name": "Md. Badrul Alam Miah",
      "affiliations": [
        "Mawlana Bhashani Science and Technology University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W765754",
    "https://openalex.org/W14214433",
    "https://openalex.org/W2073874521",
    "https://openalex.org/W2121059599",
    "https://openalex.org/W6658578313",
    "https://openalex.org/W2174555378",
    "https://openalex.org/W2100176599",
    "https://openalex.org/W2009167374",
    "https://openalex.org/W2032840619"
  ],
  "abstract": "Cancer Detection is still challenging for the upgraded and modern medical technology.Evan now the actual reason and total curing procedure of cancer is not invented .After researching a lot statistical analysis which is based on those people whose are affected in brain cancer some general Risk factors and Symptoms have been discovered.The development of technology in science day night tries to develop new methods of treatment.According to a developing country like Bangladesh it is very difficult to bear hug amount of cost for treatment of brain cancer.But it is very easy to protest brain cancer before affected and reduce treatment cost.But the number of brain cancer patients is increasing rapidly in Bangladesh lack of education, money and consciousness.Dreadful, costly and fatal brain cancer also depends on some factors that are known risk factors of brain cancer like other cancers.The detection of Skin Cancer from some important risk factors is a multi-layered problem.Initially according to those risk factors 150 people's data is obtained from different diagnostic centre which contains both cancer and non-cancer patients' information and collected data is pre-processed for duplicate and missing information.After pre-processing data is clustered using K-means clustering algorithm for separating relevant and non-relevant data to Brain Cancer.Next significant frequent patterns are discovered using Pattern Decomposition algorithm shown in Table 1.Finally implement a system using java to predict Brain Cancer risk level which is easier, cost reducible and time saveable.",
  "full_text": null,
  "topic": "Computer science",
  "concepts": [
    {
      "name": "Computer science",
      "score": 0.8815377950668335
    },
    {
      "name": "Data mining",
      "score": 0.4197492301464081
    },
    {
      "name": "Data science",
      "score": 0.37471428513526917
    }
  ]
}