{
  "title": "Cognitive Processes Associated with Sequential Tool Use in New Caledonian Crows",
  "url": "https://openalex.org/W2097556395",
  "year": 2009,
  "authors": [
    {
      "id": "https://openalex.org/A1950918261",
      "name": "Joanna H. Wimpenny",
      "affiliations": [
        "University of Oxford"
      ]
    },
    {
      "id": "https://openalex.org/A2103340939",
      "name": "Alex A. S. Weir",
      "affiliations": [
        "University of Oxford"
      ]
    },
    {
      "id": "https://openalex.org/A2199187783",
      "name": "Lisa Clayton",
      "affiliations": [
        "University of Oxford"
      ]
    },
    {
      "id": "https://openalex.org/A1892171549",
      "name": "Christian Rutz",
      "affiliations": [
        "University of Oxford"
      ]
    },
    {
      "id": "https://openalex.org/A271227249",
      "name": "Alex Kacelnik",
      "affiliations": [
        "University of Oxford"
      ]
    },
    {
      "id": "https://openalex.org/A1950918261",
      "name": "Joanna H. Wimpenny",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2103340939",
      "name": "Alex A. S. Weir",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2199187783",
      "name": "Lisa Clayton",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A1892171549",
      "name": "Christian Rutz",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A271227249",
      "name": "Alex Kacelnik",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2032888728",
    "https://openalex.org/W1520036242",
    "https://openalex.org/W6675522794",
    "https://openalex.org/W1520377904",
    "https://openalex.org/W2164672532",
    "https://openalex.org/W1965587945",
    "https://openalex.org/W2079453923",
    "https://openalex.org/W2042570062",
    "https://openalex.org/W2333419849",
    "https://openalex.org/W1992559575",
    "https://openalex.org/W2078975988",
    "https://openalex.org/W6646286568",
    "https://openalex.org/W2121247660",
    "https://openalex.org/W6636599241",
    "https://openalex.org/W2178559658",
    "https://openalex.org/W2035502133",
    "https://openalex.org/W2095944687",
    "https://openalex.org/W2964387625",
    "https://openalex.org/W2102959966",
    "https://openalex.org/W2084894865",
    "https://openalex.org/W2021211956",
    "https://openalex.org/W6670646355",
    "https://openalex.org/W1982679729",
    "https://openalex.org/W2146432586",
    "https://openalex.org/W2150375293",
    "https://openalex.org/W2051319541",
    "https://openalex.org/W2025692434",
    "https://openalex.org/W2027498580",
    "https://openalex.org/W1969898333",
    "https://openalex.org/W2165690019",
    "https://openalex.org/W2092929219",
    "https://openalex.org/W1977417532",
    "https://openalex.org/W2013140236",
    "https://openalex.org/W6631095287",
    "https://openalex.org/W2023162769",
    "https://openalex.org/W2156934441",
    "https://openalex.org/W2137840984",
    "https://openalex.org/W2077707220",
    "https://openalex.org/W2009543464",
    "https://openalex.org/W563138947",
    "https://openalex.org/W1578056686",
    "https://openalex.org/W2331490268",
    "https://openalex.org/W1984283827",
    "https://openalex.org/W2081484203",
    "https://openalex.org/W4293857795",
    "https://openalex.org/W1631057552",
    "https://openalex.org/W2078847712",
    "https://openalex.org/W2103035773"
  ],
  "abstract": "While the ability of subjects to use three tools in sequence reveals a competence beyond that observed in any other species, our study also emphasises the importance of parsimony in comparative cognitive science: seemingly intelligent behaviour can be achieved without the involvement of high-level mental faculties, and detailed analyses are necessary before accepting claims for complex cognitive abilities.",
  "full_text": "Cognitive Processes Associated with Sequential Tool Use\nin New Caledonian Crows\nJoanna H. Wimpenny¤, Alex A. S. Weir, Lisa Clayton, Christian Rutz, Alex Kacelnik*\nDepartment of Zoology, University of Oxford, Oxford, United Kingdom\nAbstract\nBackground: Using tools to act on non-food objects—for example, to make other tools—is considered to be a hallmark of\nhuman intelligence, and may have been a crucial step in our evolution. One form of this behaviour, ‘sequential tool use’, has\nbeen observed in a number of non-human primates and even in one bird, the New Caledonian crow (Corvus moneduloides).\nWhile sequential tool use has often been interpreted as evidence for advanced cognitive abilities, such as planning and\nanalogical reasoning, the behaviour itself can be underpinned by a range of different cognitive mechanisms, which have\nnever been explicitly examined. Here, we present experiments that not only demonstrate new tool-using capabilities in New\nCaledonian crows, but allow examination of the extent to which crows understand the physical interactions involved.\nMethodology/Principal Findings:In two experiments, we tested seven captive New Caledonian crows in six tasks requiring\nthe use of up to three different tools in a sequence to retrieve food. Our study incorporated several novel features: (i) we\ntested crows on a three-tool problem (subjects were required to use a tool to retrieve a second tool, then use the second\ntool to retrieve a third one, and finally use the third one to reach for food); (ii) we presented tasks of different complexity in\nrandom rather than progressive order; (iii) we included a number of control conditions to test whether tool retrieval was\ngoal-directed; and (iv) we manipulated the subjects’ pre-testing experience. Five subjects successfully used tools in a\nsequence (four from their first trial), and four subjects repeatedly solved the three-tool condition. Sequential tool use did\nnot require, but was enhanced by, pre-training on each element in the sequence (‘chaining’), an explanation that could not\nbe ruled out in earlier studies. By analyzing tool choice, tool swapping and improvement over time, we show that successful\nsubjects did not use a random probing strategy. However, we find no firm evidence to support previous claims that\nsequential tool use demonstrates analogical reasoning or human-like planning.\nConclusions/Significance: While the ability of subjects to use three tools in sequence reveals a competence beyond that\nobserved in any other species, our study also emphasises the importance of parsimony in comparative cognitive science:\nseemingly intelligent behaviour can be achieved without the involvement of high-level mental faculties, and detailed\nanalyses are necessary before accepting claims for complex cognitive abilities.\nCitation: Wimpenny JH, Weir AAS, Clayton L, Rutz C, Kacelnik A (2009) Cognitive Processes Associated with Sequential Tool Use in New Caledonian Crows. PLoS\nONE 4(8): e6471. doi:10.1371/journal.pone.0006471\nEditor: Nicola Clayton, University of Cambridge, United Kingdom\nReceived January 16, 2009;Accepted June 26, 2009;Published August 5, 2009\nCopyright: /C2232009 Wimpenny et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nFunding: This work was funded by a BBSRC studentship (to JHW), a BBSRC grant (BB/C517392/1 to AK), a Brasenose College Junior Research Fellowship (to\nAASW), and a Rhodes scholarship and Linacre College Junior Research Fellowship (both to CR). We received money from the Cogito Foundation (grant to AK)a n d\nthe University of Oxford (to CR) during the final stages of manuscript preparation. The funders had no role in study design, data collection and analysis, decision\nto publish, or preparation of the manuscript.\nCompeting Interests:The authors have declared that no competing interests exist.\n* E-mail: alex.kacelnik@zoo.ox.ac.uk\n¤ Current address: Department of Animal and Plant Sciences, University of Sheffield, Sheffield, United Kingdom\nIntroduction\nIn comparison with other animals, there can be no doubt that\nhumans are both exceptionally intelligent and outstanding in the\nintensity and complexity of their tool use. It is likely that both traits\nhave evolved in unison, although we can only speculate about the\ndirection of causality. In humans, one possibility is that tool use\npromoted the evolution of exceptional intelligence, without\nrequiring high intelligence to get started. From a comparative\nperspective, this would imply that differences between species in\ntraits associated with tool use may be due to differences in the\nspecific ecological conditions that make tool use advantageous,\npossibly leading to the evolution of motivational rather than\ncognitive differences. The presence of advanced cognitive\nfunctions in species distinguished for their sophisticated tool-\noriented behaviour should still be considered as a working\nhypothesis [1].\nMany non-human animals are known to use and make tools [2].\nHowever, there is considerable variation in the frequency and\ncomplexity of tool use, even between closely related taxa, and\nattempts to explain this variation face the challenge of distin-\nguishing between several plausible hypotheses, of which higher\ncognitive proficiency is only one candidate. It may be that\nexceptional tool users owe their skills to unusual cognitive abilities;\non the other hand, it may be that even the most impressive\ndemonstrations of tool use may be achieved by cognitive processes\ncommon to many animals that do not regularly use tools. To\naddress the potential complexity of the cognitive processes\nPLoS ONE | www.plosone.org 1 August 2009 | Volume 4 | Issue 8 | e6471\ninvolved in tool use, it is useful to examine instances of tool-\noriented behaviour that, at least at first sight, appear to be highly\nsophisticated [3]. One example of this is the ability to modify\nmaterial appropriately in order to use it as a functioning tool [4,5].\nAnother is ‘secondary tool use’–using one tool on another (non-\nfood) object to access it or modify it for use as a tool. The latter is\nthe focus of this paper, and since it has been referred to with a\nnumber of different names, we start by providing a systematic\nclassification of current terminology (see Figure 1).\nVery similar behaviour has been described in different studies as\n‘meta-tool use’, ‘secondary tool use’, ‘sequential tool use’ and as\nuse of a ‘tool set’ [6–10], or examined without a specific name\n[11–14]. We begin by isolating the latter term, ‘tool-set’, from the\nothers, and from the behaviour which is the focus of this paper.\nWe believe that ‘tool-set’ is best reserved for occasions where more\nthan one object is used in a sequence, but with the distinction that\neach of these actions is aimed towards the food (or food-containing\nobject). For example, chimpanzees ( Pan troglodytes) use a stout stick\nto puncture a termite mound and then a more slender and flexible\none to extract the prey [10,15–17]. In contrast to this, the other\nterms refer to a class of behaviours in which tools are directed at\nobjects that are not the agent’s ultimate goal (normally food), but\nwhich have a role in achieving the ultimate goal–for example,\nwhen a tool is used to retrieve another tool. We propose that\n‘meta-tool use’ should be used as an umbrella term to cover all\ninstances of this type of tool use. Within meta-tool use, there are\ntwo subcategories: ‘secondary tool use’ and ‘composite tool use’. A\ncomposite tool can be defined as a tool composed of a number of\ndistinct parts, with those parts arranged by the user [9]. To our\nknowledge, the only potential observations of composite tool use in\nthe wild are those by Matsuzawa [9,18], who saw chimpanzees use\na stone as a ‘wedge’ to make the surface of another stone level, so\nthat it could subsequently be used as an ‘anvil’ for cracking nuts\n(but see [19] for an argument as to why the wedge may not fulfil\nthe criteria to be called a ‘tool’). In contrast, secondary tool use\nrefers to occasions where one tool is used to act upon another\nobject (itself destined to become a tool) that is eventually used on\nthe ‘ultimate goal’. This would include tools used to make other\ntools, or to retrieve objects to be used as tools. Using tools to make\ntools is how the term secondary tool use is commonly used in the\nliterature on hominid technology [6]; however, we propose that\nthis term should be subdivided to also include the use of tools to\nretrieve other tools. We refer to the former as ‘constructive’ and\nthe latter as ‘sequential’ tool use (see Figure 1). The complexity of\nsequential tool use might reasonably be expected to be more\ndemanding as the number of stages between initiation of the\nsequence and acquisition of the final goal increases. There are, of\ncourse, other classification possibilities, but we hope that ours has\nthe virtue of being descriptively explicit and of separating classes of\nacts of potentially different levels of cognitive demand. Through-\nout this paper, we use this classification, and focus in particular on\nsequential tool use, i.e. the use of tools to retrieve other, out-of-\nreach objects that will serve as tools. In our experiments, subjects\nreceived different conditions, which we labelled to reflect the\nnature of the task. Notice that while we label the tasks, the tools\nthemselves are simply described by their location at the start of the\ntrial rather than as ‘primary’ or ‘secondary’, because the same\nobject may, at different moments, be used to achieve different\nFigure 1. Proposed terminology for classifying different types of animal tool use.The present study investigated sequential tool use,\nwhich falls under the broad category of ‘meta-tool use’, and more specifically can be thought of as a type of ‘secondary tool use’. Depending on the\nnumber of tools used, sequential tool use can be further divided into two-tool, three-tool, andn-tool sequences. For a detailed discussion of terms,\nsee main text.\ndoi:10.1371/journal.pone.0006471.g001\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 2 August 2009 | Volume 4 | Issue 8 | e6471\ngoals. That is, a short tool may be used to retrieve food if it is\nwithin reach, but on a different condition may be used to retrieve\nother tools. Labelling the tools according to their function is\ntherefore impossible until after the action has been performed.\nThe rarity of secondary tool use in non-humans, and its\nrelatively recent appearance in the human fossil record, has led\nsome authors to assume a strong association with the ability to\nplan ahead and act on the basis of reasoning (for example [6,8]).\nTo explore whether non-human animals are capable of secondary\ntool use in captivity, several researchers have focused on the\nfollowing problem. A subject is presented with a food reward that\nis out of reach. At the same time, it is presented with a readily\navailable tool that is too short to reach the food, but sufficiently\nlong to obtain another out-of-reach tool; only the second tool can\nreach the food. The solution is a clear example of sequential tool\nuse: the subject should use the available tool first, to reach for the\nout-of-reach but suitable tool, and then use the latter to reach for\nthe food. At least some individual chimpanzees [14,20,21], gorillas\n(Gorilla gorilla) [13], orangutans (Pongo pygmaeus) [13], and capuchin\nmonkeys (Cebus spp.) [11,12,22] are able to perform this behaviour\nspontaneously, and macaques ( Macaca spp.) [7,12] and cotton-top\ntamarins ( Saguinus oedipus) [23] can acquire it after considerable\ntraining. More recently, members of two corvid species have also\nbeen shown to use two tools in a sequence [8,24]. Bird and Emery\nreported that non tool-using rooks ( Corvus frugilegus) spontaneously\nused tools under a variety of circumstances, including what the\nauthors termed ‘metatool use’, where subjects dropped a large\nstone into a container to release a small stone, which was then used\nto acquire food [24]. Taylor et al. [8] reported that New\nCaledonian crows ( Corvus moneduloides), known to be flexible tool-\nmakers and users in the wild [25], were able to extract a long tool\nfrom a tool-box using a shorter tool, and then use the long tool to\nretrieve food. The authors argued that this behaviour demon-\nstrated ‘analogical reasoning’, by which they meant that the\nsubjects inferred, by analogy with food-retrieval, that a tool could\nalso be used to retrieve another tool, rather than just food.\nDemonstrating sequential tool use in non-human animals is\nimpressive, and might indeed expose the ability to plan or reason\nabout problems, but none of the experiments to date have\nexplicitly examined whether such advanced cognitive processes are\nactually involved. There are several possible explanations for\nsequential tool use that do not invoke goal-directed behaviour,\nplanning, causal understanding, or analogical reasoning (for a\ndiscussion of the conceptual issues surrounding this terminology,\nsee [3]). For example, subjects might attempt to retrieve the food\nwith the available tool, but after failing to do so might perform\nvarious ‘displacement activities’ such as probing randomly\nelsewhere, and thereby extracting the usable tool as they would\nany inappropriate object in the vicinity. Another possibility is that,\nif subjects had previously learned separate components of the\nsequence (for example, using a tool to probe for food, and\nextracting tools directly from the container in which tools would\nlater be out of reach), they could ‘chain’ these into a single\nsequence. Such chaining of previously learned behaviours was\nobserved in pigeons by Epstein et al. [26], in a famous replica of\nKo¨hler’s [14] study with chimpanzees, where some subjects\nstacked boxes to reach an otherwise unobtainable reward. Epstein\net al. used pigeons that were trained, in separate sessions, to climb\non a box to peck a banana-looking key (the box was fixed under\nthe key), and to push a box to a green spot on the floor (no banana\nkey was present, and climbing on the box was not reinforced);\nwhen the box was placed away from the banana key and no green\nspot was present, the subjects spontaneously pushed the box until it\nwas underneath the banana key, climbed onto it and pecked the\nbanana key. In contrast, subjects that had not been trained on all\ncomponents of the task never solved it (for example, those birds\ntrained only to push the box and not to climb on it, or those\ntrained only to climb on the box and not to push it).\nBecause of their design, previous experiments on sequential tool\nuse could not distinguish between goal-directed, planned behav-\niour and simpler, more parsimonious explanations. Firstly, in most\nof the studies [7,13,20] there was only one unreachable object (the\ntool required to retrieve food), and few or no control conditions;\nconsequently, retrieval of the out-of-reach tool could well have\nresulted from misdirected (or playful) probing with the available\ntool as a consequence of the subject’s inability to reach the food\nwith the latter. Taylor et al.[8] presented a stone as well as an out-\nof-reach tool, and since their subjects rarely extracted the stone\nthis demonstrates that tool extraction was not entirely random.\nHowever, choosing to retrieve a stick over a stone may be the\nresult of differential stimulus salience rather than anticipated use of\nthe retrieved object. Compared to sticks, stones are not typically\nused by crows to obtain food and hence they are probably not the\ntarget of their attention. Bird and Emery also presented their rooks\nwith a choice of two out-of-reach tools; in this case both options\nwere stones that had been previously rewarded, so the correct\nchoice shown by their subjects was more revealing [24]. However,\nin their experiment, it was still the case that one of the options was\nalways correct, which may have been a simple discrimination to\nlearn. Secondly, in most studies [7,8,12,13,27], where sufficient\ndetail is provided to be able to tell, subjects were pre-trained in the\nmain components of the task before testing. Subjects were usually\ntrained to pick up and use tools from the location where they were\nlater placed out of reach during the test, and most were also\ntrained to use the available tool to retrieve food. Thus, like Epstein\net al.’s pigeons [26], they were trained in each component of the\ntask separately, and might have been ‘chaining’ these together just\nas the pigeons did; the extracted tools could have become\nsecondary reinforcements worth extracting per se rather than with\nthe goal of using them as tools [28]. Thirdly, the inaccessible tool\nwas often placed either adjacent to the reward or between the\nsubject and the reward [7,12,20,23,27] increasing the probability\nof subjects retrieving it by chance, while attempting to retrieve the\nfood with the unsuitable but available tool. Finally, tasks were\noften introduced in a stepwise manner, progressing from the\neasiest to the most difficult conditions, which might have had the\neffect of training the subjects by reinforcing simple sequences of\nbehaviour generated through random processes [8,12,13,27].\nIn this study, we examined the cognitive processes that underlie\nsequential tool use in New Caledonian crows, introducing\nexperimental conditions that allow us to discriminate between\nthe aforementioned possibilities. Our experiments included the\nfollowing unique features:\n(1) Subjects were presented with multiple inaccessible tools, which\ndiffered in functionality and were spatially and visually separated\nfrom the food reward. If tools are extracted because they have\nbecome secondary reinforcers due to previous experiences, then\nwe might expect them to be extracted independently of their\nfunctionality, but if the crows plan their sequence of actions they\nshould be selective according to present needs [29].\n(2) There were several, intermixed conditions where the position\nof food and/or tools determined what sequence of behaviour\nwas required for success: in one condition we required subjects\nto retrieve and use three tools in sequence, something never\ndemonstrated in a non-human animal without specific\ntraining. Use of three tools in correct order is much more\nchallenging than the use of two tools for two reasons. Firstly,\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 3 August 2009 | Volume 4 | Issue 8 | e6471\nthe initiation of the sequence is more remote from the goal,\nthus requiring greater abstraction. Secondly, since the\ngeneration of three actions in a correct sequence at random\nis less probable than that of two, it is much more difficult to\nacquire the behaviour by reinforcement of randomly\ngenerated sequences.\n(3) We included control conditions where: (i) food was not\npresent; (ii) inaccessible tools were replaced by other unusable\nobjects; or (iii) sequential tool use was not required. If crows\nstill extracted tools and probed into the food container when\nfood was not present, it would be difficult to conclude that\nsuccessful sequences of behaviour when food was present were\nthe result of goal-directed planning. Similarly, extraction of\nnon-functional objects from the tool-dispensing apparatus\n(when food was present) would argue against rational\nplanning being the explanation for tool-extraction during\nexperimental conditions.\n(4) Finally, we manipulated the degree of pre-training the subjects\nreceived. If successful sequential tool use is dependent on\nbehavioural chaining (see above) then only subjects who received\nexperience with all components of the task should succeed.\nResults and Discussion\nExperiment 1\nIn this experiment, we investigated whether six New Caledonian\ncrows would spontaneously use an available tool to retrieve tools\nplaced out of beak reach, when these were necessary to retrieve a\nfood reward. The apparatus consisted of one transparent ‘food-tube’\nand four transparent ‘tool-tubes’, which were positioned such that\nsubjects were facing away from the food-tube when interacting with\ntool-tubes (see Figure 2). During the experiment, one long and three\nmedium-length tools were positioned out of beak reach within the\ntool-tubes, while a short tool was freely available on the table\n(termed the ‘tabletop’ tool). There were three experimental and two\ncontrol conditions (Table 1), with each subject initially receiving\nthree or four trials per condition in pseudo-random order (trial\nnumbers were deliberately low, to minimize the amount of learning\nduring the experiment). The sequence of behaviour necessary to\nretrieve the food was dictated by the depth of the food and tools\nwithin the tubes, with the most demanding condition requiring the\nuse of three tools in a sequence (‘Tertiary’; see Table 1 for an\noverview of all conditions). Subjects received different pre-testing\nexperience, to investigate whether crows required experience of\nextracting tools from tubes with their beaks to perform successfully\nin the subsequent sequential tool use tasks. Thus, prior to\nexperimental trials, three subjects were allowed to retrieve tools\nfrom tubes with their beaks and use these tools to retrieve food\n(‘experienced’ subjects: ‘Betty’, ‘Pierre’, and ‘Ue´k’), whereas three\nwere exposed to empty tool-tubes and a freely-available tool that\ncould be used for food retrieval (‘inexperienced’ subjects: ‘Barry’,\n‘Kenny’, and ‘Nalik’). To avoid handling stress [30], the birds lived\nin pairs in free flying aviaries and entered the test room voluntarily.\nDue to the presence of substantial qualitative individual differences\nin behaviour we describe individual results rather than averaging\nquantitative indices of performance across individuals.\nThe main finding was that all three experienced subjects\nshowed sequential tool use on their very first experimental trials\n(Secondary-Any, Secondary-Long and Tertiary), and consistently\nthereafter. In contrast, the inexperienced subjects only used a tool\nto extract another on four (pooled) of their first 20 trials, and never\nretrieved food in the experimental conditions (i.e., when more\nthan one tool was required). Consequently, we discuss the\nperformance of the two groups separately.\nExperienced subjects. As shown in Table 2, Betty retrieved\nfood on all her trials, and was the only subject to succeed on the\nTertiary condition (Video S1). The other two subjects successfully\nretrieved food under both two-tool conditions, but, although they\noften extracted more than one tool on Tertiary trials, they never\nused them in the correct sequence to acquire food. Interestingly,\non two Tertiary trials Pierre initially tried to extract an appropriate\ntool with the available tabletop tool, but after failing to do so, he\nleft the room and returned moments later with a natural twig tool\n(longer than the tabletop tool). He then used these twig tools to\nextract the longest tool (after first briefly probing for food on one\ntrial), with which he retrieved the food reward. Thus, by finding a\nsuitable object outside the confines of the experimental set up he\ntransformed the task from requiring three tools to two, and then\nproceeded to solve it appropriately. He also left the chamber and\nbrought in his own tool on one Secondary-Long trial (Video S2),\nand on one Secondary-Any trial he brought a tool in at the start of\nthe trial and probed directly for the food.\nWe examined three aspects of the subjects’ behaviour which relate\nto the cognitive processes underlying their performance: (i) whether\nsubjects attended to the distance to food when choosing where to\nprobe with the tabletop tool; (ii) whether they were selective about\nthe tools that they used to probe for food; and (iii) whether they still\nextracted tools when there was no food to be extracted.\nWe investigated whether subjects attended to the position of the\nfood by examining whether their first probe with the tabletop tool\nwas aimed at tools or at food. All three subjects immediately used\nFigure 2. Schematic of the apparatus used in Experiment 1\n(seen from above).The food reward is located in the central food-\ntube, and can be at any of three depths (d1, d2 or d3). Tools are located\nout of reach inside each of four additional tool-tubes (denoted T). Three\nof these tools are 10 cm in length and one is 20 cm. None of them are\naccessible by beak alone. The only tool that is directly manipulable is\nthe tabletop tool (T\nA), which is 6 cm long. The trial-type depicted is\n‘Tertiary’; i.e. the food is at its deepest, and the longest tool is in the\nrightmost tool-tube, out of reach of either beak or tabletop tool (the\nposition of the longest tool on all other conditions is shown by the\ndashed line in the same tube). The correct sequence of behaviour is for\nthe subject to probe for any 10 cm tool with the tabletop tool, then use\nthe 10 cm tool to probe for the 20 cm tool (in the right hand tube), and\nfinally use the 20 cm tool to probe for food.\ndoi:10.1371/journal.pone.0006471.g002\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 4 August 2009 | Volume 4 | Issue 8 | e6471\nthe available tool to extract food in all except one of their Primary\ntrials. In the experimental conditions, when a completely rational\nstrategy predicts not even trying for the food with the tabletop tool,\nprobing instead directly for one of the inaccessible but potentially\nsuitable tools, Betty appropriately probed into tool-tubes first in 8\nof 9 trials; in contrast, Pierre and Ue´k first briefly probed into the\nfood-tube first on 8/8 and 7/12 trials, respectively, but after these\nunsuccessful probes both subjects quickly probed into the tool-\ntubes (median interval between probing for food and probing for\ntools: Ue´k, 1.9 s; Pierre, 1.1 s). These brief inappropriate probes\ncould reflect an inability to inhibit probes towards the food, or they\ncould have been depth gauging actions.\nTo explore tool selectivity, we looked at the first extracted tool\nthat the subjects used to probe for food. While the (deliberately)\nlow number of trials per condition means that tool choice cannot\nbe analysed in detail, subjects did not appear to choose in advance\nthe tools they required. On the Secondary-Long condition (where\nonly one of the four out-of-reach tools was suitable), the subjects\nshowed weak evidence for selectivity, using the correct, longest tool\nto probe first for the food on 5 of 10 trials (pooled across subjects;\nTable 1.Description of conditions for Experiments 1 and 2.\nCondition Condition type Experiment Food depth Trial description Most efficient behaviour\nPrimary Control 1, 2 7 cm Food within reach of the (longer)\ntabletop tool.\nProbe food with the (longer)\ntabletop tool.\nNo-Food Control 1 (except Betty and\nPierre), 2\nNA No food present. Do not probe for anything.\nNo-Tools Control 2 15 cm Food at 15 cm, tools replaced by\nnon-tool objects.\nDo not probe for anything.\nSecondary-Any Experimental 1, 2 13 cm Food out of reach of the tabletop tool, but\nwithin reach of any out-of-reach tool.\nProbe for any tool with the\n(longer) tabletop tool. Use\nextracted tool to probe for food.\nSecondary-Long Experimental 1, 2 25 cm Food only reachable by the longest\nout-of-reach tool.\nProbe for longest tool with the\n(longer) tabletop tool. Use\nlongest tool to probe for food.\nTertiary Experimental 1, 2 25 cm Experiment 1: Food only reachable by\nthe 20 cm out-of-reach tool, which is\nreachable with any other out-of-reach\ntool, but not the tabletop tool.\nExperiment 2: Food only reachable by\nthe 25 cm tool, which is reachable only\nby the 20 cm out-of-reach tool.\nExperiment 1: Probe for any out-\nof-reach tool with the tabletop\ntool. Use the extracted tool to\nprobe for the 20 cm tool. Use\n20 cm tool to probe for food.\nExperiment 2: Probe for the\n20 cm tool with the longer\ntabletop tool. Use 20 cm tool to\nprobe for 25 cm tool. Use 25 cm\ntool to probe for food.\nLength-Only Control 2 7 cm 13 cm\n25 cm\nThese trials correspond to the Primary\n(7 cm), Secondary-Any (13 cm) and\nSecondary-Long/Tertiary (25 cm) trials, as\ndescribed above, with the exception that\ntools in the frame are within beak range\nand do not need to be probed for.\n7 cm: Probe for food with the\nlonger tabletop tool. 13 cm:\nProbe for food with any tool from\nthe tool-frame. 25 cm: Select the\nlongest tool from the tool-frame.\nUse tool to probe for food.\nSequential tool use is required in experimental, but not control conditions. Note that in Experiment 2 there were two tabletop tools of different lengths, compared with\njust one in Experiment 1.\ndoi:10.1371/journal.pone.0006471.t001\nTable 2.Overview of crows’ success across conditions in Experiment 1.\nGroup Subject Primary Secondary-Any Secondary-Long Tertiary Number of trials per condition\nExperienced Betty 33 3 3 3\nExperienced Pierre 3 2(1) 1(1) 0(2) 3\nExperienced Ue´k 44 2 0 4\nInexperienced Nalik 20 0 0 4\nInexperienced Barry 30 0 0 4\nInexperienced Kenny 40 0 0 4\nInexperienced Barry2 95 2 0 9\nInexperienced Kenny2 14 0 0 0 14\nPierre sometimes brought his own tools into the testing chamber to extract tools when he failed to extract them using the tools provided; the number of trials on which\nthis happened is shown in brackets. Barry and Kenny both received additional testing trials (Nalik had died at this point) as described in the main text; these are\npresented as ‘Barry 2’ and ‘Kenny 2’.\ndoi:10.1371/journal.pone.0006471.t002\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 5 August 2009 | Volume 4 | Issue 8 | e6471\nbinomial test; z = 1.83, p = 0.08). On the Tertiary condition, they\nused the correct, longest tool to first probe for the food on only 2\nout of 10 trials ( z = 20.37, p = 0.76).\nFinally, we investigated Ue ´k’s behaviour on the No-Food\ncontrol condition, which was introduced after Pierre and Betty had\ncompleted testing and were unavailable for replicates. We\nreasoned that, if tool extraction on experimental trials was goal-\ndirected and related to retrieving food, in the No-Food control\ncondition, subjects should neither extract further tools nor probe\nthe food-tube. Ue´k never probed the empty food-tube with the\ntabletop tool, but she did use it to extract further tools on all trials\nand used these to probe into it. This might suggest that, when food\nwas present, her extraction of tools is inconclusive as evidence that\nshe was directly driven by her goal to extract the food. However,\nwe make this comment with caution, for even if the tools had\nacquired some value over the course of experimentation, she may\nstill have been goal-directed in her extraction of tools during\ntesting; the two possibilities are not mutually exclusive. Even\nthough this control was only run in a single experienced subject,\nthe result suggests that such goal-absent or goal-modified controls\nmight provide important information in establishing the goal-\ndirectedness of sequential tool actions.\nInexperienced subjects. All three inexperienced crows\nobtained food with the tabletop tool where this was possible, but\nfailed in all tasks where tools had to be extracted (Table 2).\nFurthermore, some other aspects of their behaviour argue against the\ninterpretation that these subjects were reasoning about the task: one\nsubject (Nalik) repeatedly interacted with tool-tubes, and on three\ntrials used the available tool to obtain further tools, but he never then\nmade use of these for food extraction. On the No-Food trials, the\nempty food-tube was probed in two trials (out of a pooled twelve).\nBarry probed with the tabletop tool, but Nalik used that tool to\nextract another and probed the empty tube with it; this was the only\noccasion when an inexperienced bird used the available tabletop tool\nto extract a tool that was then used to probe into the food tube.\nTo explore whether the inexperienced birds’ failure to show\nsuccessful sequential tool use was a result of limited experience, we\ngave two of them (Nalik had died) additional blocks of trials. One\nsubject (Barry) extracted a tool on his second additional trial (22nd\ntrial overall; 14th experimental trial overall), and subsequently\nrepeatedly interacted with tool-tubes, showing performance levels\nsimilar to those observed in two of the experienced subjects, Ue´k and\nPierre (7/18 successes in Secondary-Any and Secondary-Long trials;\nlike Ue´k and Pierre, he never solved the Tertiary task). In contrast,\neven after a total of 77 extra trials, the other bird (Kenny) never used\none tool to retrieve another. Further tests suggested that his poor\nperformance was due to lack of attention or aversion to the tool-tubes:\neven when tools protrudedout of the tubes, and could be obtained by\nbeak, Kenny did not retrieve them, although he continued to retrieve\nthe food when it was within reach of the tabletop tool.\nDiscussion. In summary, in this first experiment one of our\nsubjects (Betty) provided the first observation of spontaneous three-\ntool sequential tool use in a non-human animal, and overall four of\nthe six birds were successful in using an available tool to retrieve\ninaccessible tools that were then used to extract food. The difference\nbetween naı¨ve and pre-trained animals suggests that elements of the\npre-testing procedure might contribute to successful behaviour, an\nobservation that runs against Taylor et al’s [8] interpretation that\nanalogical reasoning (i.e., generalising from using tools for food\nretrieval to using them to retrieve other objects) can be inferred from\nsequential tool use. If crows know that they can use tools to obtain\nfood, they do not necessarily make use of this knowledge to deduce\nthat tools can be used to obtain tools. Even in the experienced\nsubjects, we found no reliable evidence of detailed planning of the\nsequence of tools–they seemed to knowwhen to extract further tools,\nbut not which ones. Interestingly, specific pre-training experience\nwas neither always required, nor always sufficient, since one\ninexperienced subject (Nalik) did extract inaccessible tools in the\ninitial set of trials (although not appropriately to obtain food),\nanother (Barry) showed sequential tool use in his second testing\nsession, and yet another subject (Kenny) never did so even after\nrather extensive experience.\nWhile the ability to plan or reason by analogy has not been\ndemonstrated, two main reasons make the opposite conclusion\npremature (namely, that New Caledonian crows are incapable of\neither of these). Firstly, given that New Caledonian crows have\npreviously been shown to choose appropriately between directly\navailable tools [29], it is possible that the design of the apparatus\nfrom which the tools had to be extracted impaired subjects’ ability\nto judge their lengths and select accordingly. Surface reflections\nfrom the acrylic tubes containing the tools may have obscured the\nend of the tools when viewed from the side, and perspective may\nhave made distinguishing between tools of different lengths\ndifficult when viewing from the front. Since subjects could not\nperch on top of the tubes to view the tools from above they would\nhave had to look into each tube and remember the length of each\ntool within, which might have hindered their selection. This seems\nplausible, since in a previous study where the crows did show\nlength selectivity [29] potential tools were offered vertically, next\nto each other, and individuals could manipulate them before\napproaching the food-containing apparatus. Secondly, while the\nfailure of the inexperienced subjects may have been due to their\nlack of experience at extracting tools from tool-tubes, and\ntherefore their inability to ‘chain’ sensu Epstein et al. [26], it is\nalso possible that the reason for the difference between the groups\nwas that experienced subjects had learned to pay attention to tool-\ntubes. Inexperienced subjects had never been reinforced for\ninteracting with the tubes during training, and so might have\nlearned their irrelevance and ignored them during testing. We\ncarried out a second experiment to address these issues.\nExperiment 2\nThis experiment was conceptually the same as Experiment 1,\nbut we modified the procedure and apparatus to allow more\ndetailed examination of the cognitive processes involved. We re-\ntested two subjects from the experienced group in Experiment 1\n(Pierre and Ue´k; Betty had died) and another, naı ¨ve individual\n(Corbeau) with a new apparatus, additional control conditions, a\nnew familiarization regime, and more trials per condition. To\nreduce the possibility that the acrylic tubes interfered with crows’\nperception of food depth or tool lengths, we replaced them with\nwire-mesh frames on which subjects could stand to view both food\nand tools directly (instead of through acrylic) from above (Figure 3).\nWe also included two control conditions—‘No-Food’ (the food-\nframe was empty; this condition had been presented to four\nsubjects in Experiment 1) and ‘No-Tools’ (unsuitable non-tool\nobjects were placed in tool-frames instead of tools; see Table 1)—\nto reveal whether subjects would extract tools or non-tool objects\neven when this would not lead to the acquisition of food. All three\nbirds received the following familiarization procedure: the food-\nand tool-frames were presented with food and non-tool objects\n(stones, within beak range) in all lanes, but never contained tools.\nThis ensured that the subjects were reinforced for interacting with\nthe tool-frame, but not trained to extract tools from it or to probe\ninto it with tools (for details, see Materials and Methods). The\ntesting protocol was similar to Experiment 1, except that subjects\nreceived at least 9 trials of each of the 6 conditions (in blocks of 6\ntrials, one per condition in randomized order). After these 54\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 6 August 2009 | Volume 4 | Issue 8 | e6471\ntrials, they all received at least 11 additional trials of the three-tool\n(Tertiary) condition. The inaccessible tools were of four different\nlengths (rather than just medium or long, as in Experiment 1), and\nwe provided two tabletop tools rather than one, only one of which\nwas sufficiently long to retrieve either food or further tools (see\nFigure 3). Following these sequential trials we carried out a similar\nexperiment with the same individuals, but where sequential tool\nuse was unnecessary (termed ‘Length-Only’ trials). The apparatus\nand experimental protocol were the same as that used in\nsequential trials, except that the tools were not pushed out of\nreach and were therefore accessible by beak alone. The purpose of\nthis control was to determine whether tool selection was consistent\nin both types of trial; if crows choose inappropriate tools more\noften in sequential than non-sequential trials, this may indicate\nthat sequential tool use imposes higher cognitive demands.\nSequential trials. All three subjects probed for tools on their\nvery first trial and consistently thereafter, with Pierre and Corbeau\nextracting a tool from the frame on their first experimental trial\n(Tertiary), and Ue ´k on her fifth (Secondary-Long; Ue ´k had\ndifficulty actually extracting the inaccessible tools on earlier trials).\nPierre first obtained food using an extracted tool on his seventh\nexperimental trial (Secondary-Any), Corbeau on his fourth\n(Secondary-Any) and Ue ´k on her fifth (Secondary-Long). All\nobtained food on every Primary trial, but their success rates in\nother conditions decreased as task complexity increased (Figure 4).\nAll three subjects solved the three-tool problem (Tertiary; see\nVideo S3) on at least some trials, and all had higher rates of success\non the second block of these trials (Tertiary-2; Corbeau: 30% vs\n69%, n = 23 trials; Pierre: 70% vs 100%, n = 20; Ue´k: 40% vs 62%,\nn = 23). There were relatively few ‘perfect’ performances on\nexperimental trials (i.e., where subjects made no errors), with Ue´k\nbeing the only subject to show perfect performance in a Tertiary\ntrial (Figure 4). As in Experiment 1, there were some instances\nwhere subjects retrieved the food using their ‘own’ technique, such\nas bringing their own tools into the testing chamber, or probing\ndown through the mesh on the top of the food-frame; for\ndescriptive purposes these six trials are included in Figure 4 but\nbecause of their lack of qualitative conformity to the main data set\nthey were not included in subsequent quantitative analyses. Crows\npreferentially chose the correct, longer tabletop tool on almost\nevery trial (Corbeau: 90%; Pierre: 92%; Uek: 88%; binomial tests:\np,0.001 for all), with little variation across conditions.\nAs previously, we investigated whether crows probed first into\nthe food- or the tool-frames, and with which tool. We also\nexamined: (i) whether subjects exchanged tools at random; (ii)\nwhether they extracted tools/objects from the frame or probed for\nthe food in control conditions; and (iii) whether their performance\non tertiary tasks improved with experience.\nAll three subjects nearly always probed for food before probing\nfor tools in Primary trials, when the food was within reach of the\ntabletop tool (Corbeau: 89%; Pierre: 92%; Ue´k: 73%). In contrast,\nin conditions where the distance to food was greater, they first\nprobed for tools more frequently, with no subjects first probing for\nfood in the final block of Tertiary trials. We confirmed this\nstatistically with a binary logistic regression, with ‘food depth’ and\n‘subject’ as factors and ‘location of first probe’ as the dependent\nvariable (towards the food, or the tools). As the distance to the food\nincreased, the likelihood of subjects first probing towards the tools\nincreased ( z = 5.29, p,0.001). Furthermore, the same analysis\nrevealed a significant difference between subjects, in the location\nof their first probes ( x\n2 = 14.21, df =2 , p = 0.001): Uek was\nsignificantly more likely than Corbeau to first probe towards the\ntools (z = 3.43, p = 0.001), whereas there was no difference between\nPierre and Corbeau ( z = 0.42, p = 0.67). Corbeau and Pierre\nprobed for food first on the majority of their Secondary-Any trials\n(77.8% and 91.7%, respectively), when food was at an interme-\ndiate distance, suggesting that they had difficulty estimating\nprecisely how far they could reach with the tabletop tool; in\ncontrast, they (and Ue´k) probed for tools first on the majority of\ntheir Secondary-Long and Tertiary trials.\nOn this evidence, the crows appear sensitive to the position of\nthe food when deciding whether to probe for food or for tools. But\ndo they make use of this information when choosing which tool to\nextract? To tackle this, we examined the length of the first non-\ntabletop tool used to probe for food in different conditions. We\nconsidered three candidate strategies: (1) No tool selectivity.\nSubjects extract and use inaccessible tools at random to probe for\nfood. Under this strategy, in Secondary-Any and Secondary-Long\nconditions, the mean length of the first extracted tool used to\nprobe for food would be expected to be 17.5 cm (the average of all\nthe inaccessible tools: 10, 15, 20 and 25 cm), whereas in Tertiary\ntrials the predicted average length would be 15 cm (the average of\nFigure 3. Schematic of the apparatus used in Experiment 2\n(seen from above).The food reward is located in the smaller food-\nframe, and can be at any of three depths (d1, d2 or d3). Out-of-reach\ntools are located inside each of four lanes of a larger, mesh-bound tool-\nframe (denoted T). Tool lengths are 10, 15, 20 and 25 cm. None of them\nare accessible by beak alone. The only tools that are directly\nmanipulable are the two tabletop tools (T\nA), one of which is 5 cm\nand the other 7 cm long. The trial-type depicted is ‘Tertiary’; i.e. the\nfood is at its deepest, and the longest tool is out of reach of both\ntabletop tools (the dashed line shows the normal position). The correct\nsequence of behaviour is for the subject to pick up the longer of the\ntwo tabletop tools and probe with it for the 20 cm tool (located in the\nthird lane from the left), then use the 20 cm tool to probe for the 25 cm\ntool (located in the far right lane), and finally use the 25 cm tool to\nprobe for food.\ndoi:10.1371/journal.pone.0006471.g003\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 7 August 2009 | Volume 4 | Issue 8 | e6471\nthe 10, 15 and 20 cm long tools, since the 25 cm tool is out of\nreach). (2) A preference for long tools, irrespective of condition.\nUnder this strategy, we would expect tools first used to probe for\nfood to be significantly longer than the average values under\nrandom choice (see above), for all conditions. (3) Sensitivity to the\ndemands of the task. Under this strategy, we would predict no\ndeviation from random tool length for Secondary-Any trials, but\nsignificantly longer tools to be used in Secondary-Long and\nTertiary conditions.\nFigure 5 shows the deviation between the length of the extracted\ntools which subjects first used to probe for food, and the predicted\nlength if they were choosing at random (see Materials and Methods).\nCorbeau used tools that were significantly longer than expected only\nin his second block of Tertiary trials, which is consistent with this\nsubject starting with Strategy 1 (see above) and then developing\nselectivity by learning (in Tertiary-2). There was a significant\ndifference in the median length of tools used by Corbeau across\nconditions (Kruskal-Wallis: H = 10.01, df =3 , p\nadjusted= 0.02), and\npost-hoc Mann-WhitneyU-tests (with p-values adjusted for multiple\ncomparisons) confirmed that Corbeau probed with significantly\nlonger tools in Tertiary-2 trials compared to the other three\nconditions (Figure 5; Secondary-Any vs Tertiary-2: W =0 . 3 1 ,\np = 0.03; Secondary-Longvs Tertiary-2:W =3 5 . 5 ,p =0 . 0 0 7 ;T e r t i a r y\nvs Tertiary-2: W = 40.0, p = 0.03; all other comparisons non-\nsignificant). Pierre showed tool choice that was most consistent with\nStrategy 3: tool length did not differ from random expectation in\nSecondary-Any trials, but he used significantly longer tools in\nSecondary-Long and Tertiary-2 conditions (tools were also longer\nthan the random expectation in Tertiary trials, but this was not\nsignificant at the corrected alpha level; Figure 5). There was no\nsignificant difference in tool length for Pierre across conditions, but\nthis test approached significance and was in the predicted direction\n(H =7 . 0 3 ,df =3 , p\nadjusted= 0.07), suggesting that Pierre’s behaviour\nwas not fully insensitive to the demands of the task. Ue´k’s behaviour\nsupported Strategy 2: the tools that she first used to probe for food\nwere longer than the random expectation on all experimental\nconditions (significantly so for all but Secondary-Long trials; Figure 5),\nand there was no statistical difference in the median length of tools\nused to probe across conditions (H =2 . 6 2 ,df =3 , padjusted=0 . 4 5 ) .F o r\ntwo subjects, therefore, the extracted tools first used to probe for food\nwere picked with some sensitivity to the task requirements (the third\nsubject appeared to learn which tools to pick), but were still frequently\ntoo short to reach the food, indicating that the subjects did not\nanticipate the precise length of tool that was required.\nTo further investigate tool-selectivity, we analyzed instances of\n‘tool swapping’ on those trials where subjects extracted more than\none tool before their first probe for food. If they were selective\nabout tool length, they should only make ‘positive’ swaps, i.e.\nswapping tools if the tool being held is too short to reach the food\n(therefore they should only exchange for longer tools). In contrast,\nif they were insensitive to tool length, we would expect a random\nnumber of ‘positive’ and ‘negative’ swaps. We only considered\nexchanges between extracted tools, rather than between the\ntabletop tool and an extracted tool, since by definition the latter\nswaps would always be positive. All subjects showed more positive\nthan negative tool swaps in all conditions, significantly more than\nthe random expectation for all subjects in Tertiary-2 trials (for data\nand statistics, see Figure 6). In addition, Pierre made significantly\nmore positive swaps than expected in Tertiary trials, and Ue ´k\nmade significantly more positive swaps in all experimental\nconditions. Our analysis was limited to trials where the food was\nretrieved and extracted tools were swapped, and the comparatively\nsmall number of qualified trials prevents testing for statistical\ndifferences between conditions.\nNext, we examined control trials to investigate whether tools were\nonly extracted when required. If extractions on experimental trials\nwere goal-directed, there should have been no tool extractions when\nthe food was within reach of the tabletop tool (Primary), or when\nthere was no food (No-Food) or there were no usable tools in the\nframe (No-Tools). Similarly, if probing into the food-frame was\ngoal-directed, there should have been no such probes with non-tool\nobjects, or when there was no food in the frame; insertion of tools in\nFigure 4. Success rates of crows in Experiment 2.Bar shading indicates the type of success: when ‘Errors’ were made, food was retrieved but\nthe sequence of behaviour contained errors; ‘Own’ refers to a small number of trials where subjects used their own method of obtaining food (see\ntext and Video S2); ‘Good’ refers to trials where the food was out of reach of the tabletop tool and subjects still directed their first probes into the\nfood-frame, but all subsequent actions were correct; ‘Perfect’ means no errors were made in the acquisition of food. Trial types are coded as follows:\nP = Primary; SA = Secondary-Any; SL = Secondary-Long; T = Tertiary; T2 = Tertiary-2.\ndoi:10.1371/journal.pone.0006471.g004\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 8 August 2009 | Volume 4 | Issue 8 | e6471\nthe absence of food would question the birds’ understanding of the\nsituation, or rather, our understanding of the factors controlling the\nbirds’ behaviour. To examine this issue we compared subjects’\nbehaviour in the three control conditions and Secondary-Any trials\n(as this was the simplest experimental condition) .We found a\nsignificant difference between conditions in the proportion of trials\non which the food-frame was probed (Chi-square tests: Corbeau:\nx\n2 = 17.42, df =3 , p = 0.001; Pierre: x2 = 28.94, df =3 , p,0.001;\nUe´k: x2 = 18.79, df =3 , p,0.001). Post-hoc examination of the\nstandardized residuals revealed that for all subjects the No-Food\ncondition was the most significant contributor to the chi-squared\nstatistic. The food-frame was probed on fewer No-Food trials than\npredicted, although all subjects did insert an extracted tool into the\n(empty) food-frame on at least one trial (Figure 7A). They did not,\nhowever, insert all the tools they extracted into the food-frame, and\nUe´k in particular, frequently took the extracted tools to other parts\nof the aviary, suggesting that, although crows responded to some\nextent appropriately to the contingencies of the task, they were\nmotivated to extract toolsper se(probably as play objects, or because\nthey have value outside the experimental context). In the No-Tools\ncondition, all subjects probed towards the food with the tabletop\ntool, but rarely with extracted non-tool objects (Pierre did so twice\nand Corbeau once). Similarly, there was a significant difference\nbetween the proportion of trials on which an object (a tool or piece\nof lego) was extracted (Corbeau:x\n2 = 14.94,df =3 ,p = 0.002; Pierre:\nx2 = 14.78, df =3 , p = 0.002; Ue´k: x2 = 9.09, df =3 , p = 0.028). Post-\nhoc examination of the standardized residuals showed that, for\nPierre and Corbeau, tool extractions happened more often than\npredicted in the Secondary-Any condition (Figure 7B).\nFinally, we explored whether there was a difference between\nTertiary and Tertiary-2 trials, to see whether subjects’ perfor-\nmance on the three-tool problems improved with experience. All\nsubjects succeeded in retrieving the food on more Tertiary-2 than\nTertiary trials (Figure 4). Furthermore, the extracted tools first\nused by Pierre and Corbeau to probe for food were significantly\nlonger in Tertiary-2 compared to Tertiary trials (Mann-Whitney\nU-test; Corbeau: W = 35.0, p = 0.009; Pierre: W = 72.5, p = 0.009).\nThere was no significant difference in the median length of the\ntools Ue´k first used to probe for food between conditions\n(W = 72.0, p = 0.22), probably because she only probed into the\nfood-frame with a tool shorter than 20 cm four times, and thus\nalready had a bias for the longer tools.\nLength-only trials. Following the completion of the\nSequential trials, all three subjects were given thirty Length-Only\ntrials where the tools were within beak range (i.e., it was unnecessary\nto use a tool to probe for another). All other elements of the task\nremained unchanged: subjects received ten trials with food at each\nof the previously used depths (7, 13 and 25 cm), the two short\ntabletop tools were present, and the same tools were available in the\ntool-frame. In the Sequential trials described above, subjects\nretrieved and used tools that were significantly longer than the\naverage tool length predicted by random probing, but often still\nshorter than required to reach the food. Compared with a previous\nstudy in which two crows chose tools of appropriate length, and\noften longer than was necessary to reach the food [29], it therefore\nseems that the Sequential tool use task presented greater difficulties.\nOur analyses revealed significant interactions between both trial\ntype (Sequential or Length-Only) and food depth, and trial type\nFigure 5. Tool selectivity in Experiment 2.Bars show the deviation (6SE) between the mean length of the tool first used by crows to probe for\nfood (in experimental conditions) and a hypothesised mean value if subjects were picking out-of-reach tools at random. The dashed line indicates the\nlength deviation necessary to reach the food, i.e. the deviation that would have been shown by a perfect performer. On Secondary-Any (SA) trials any\nof the four out-of-reach tools is correct so there is no necessary deviation. The line is lower for the Secondary-Long (SL) than for the Tertiary (T, T2)\nconditions because average tool length expected from random choice is longer (in SL there are four tools to choose from, leading to an expected\nlength of 17.5 cm; in Tertiary trials, one tool is out of reach so the first choice can only be between the other three, leading to an expected length of\n15 cm; for further details, see main text).P-values (two-tailed) from one-samplet-tests on the observed and hypothesized means (multiplied by the\nnumber of comparisons,c, for each subject;c = 4) are indicated by asterisks above each bar;p-values from Kruskal-Wallis tests are indicated above\neach subject (* =p,0.05, ** =p,0.01, *** =p,0.001). There was a significant difference in tool length between conditions for Corbeau only: post-hoc\ntests showed that the tools he used to probe with on Tertiary-2 trials were significantly longer than those used in all other conditions.\ndoi:10.1371/journal.pone.0006471.g005\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 9 August 2009 | Volume 4 | Issue 8 | e6471\nand subject, in predicting the length of tool first used to probe for\nfood ( trial type*food depth : F2,220 = 3.92, p = 0.02; trial type*subject:\nF2,220 = 4.10, p = 0.02), as well as significant main effects of two of\nthese variables ( trial type : F1,220 = 25.03, p = 0.04; food depth :\nF2,220 = 29.76, p,0.001; subject: F2,220 = 2.51, p = 0.29). As the\ndepth to food increased, the length of tool used to probe also\nincreased, but tools used to probe for the food in Length-Only\ntrials were longer than those used in Sequential trials (Figure 8).\nFurthermore, subjects interacted with the tabletop tools on far\nfewer Length-Only than Sequential trials (number of trials where a\ntabletop tool was the first inserted into the food-frame; Corbeau:\n1/30; Pierre: 10/30; Ue´k: 3/10), and whilst Pierre and Ue´k both\nused a tabletop tool to probe for another tool, this happened on far\nfewer trials (Pierre: 2/30; Ue ´k: 3/30). It is likely that they\nrecognized that tools were now within beak range and therefore\nthe attractiveness of the tabletop tools was reduced (although not\nentirely eliminated). Ignoring the tabletop tools, which could only\nreach the food on one-third of the trials, and going straight to pick\nout a longer tool, is in fact quite an efficient strategy.\nConcluding remarks\nOur experiments provide the first demonstration, to our knowledge,\nthat a non-human animal can spontaneously use up to three tools in a\nsequence to retrieve food. Most subjects showed successful, sequential\ntool use, using tools to extract othertools from their first trial. While\nprevious experiments focused on whether subjects can perform\nsequential tool use, we analysed the details of their actions so as to\ndraw inferences about the cognitive mechanisms involved.\nExperiment 1 showed that crows can spontaneously perform\nsequential tool use. Four out of six subjects showed it reliably\n(another individual extracted tools but did not relate them to the\ntask), three of them from their first trial. These three crows had\nprior experience with the tool apparatus before being tested, as\nwas the case in a previous study of sequential tool use with New\nCaledonian crows [8]. The other three birds did not receive this\npre-testing procedure, so it is interesting that only one of them\nacquired the skill, taking him over twenty trials to do so. However,\nthe fact that this subject did acquire successful performance,\nwithout prior experience of picking out tools from the apparatus,\ndemonstrates that specific pre-training on each part of the\nsequence was not essential. Of course, as with any test on adult\nanimals living in natural or enriched environments, each subject is\nlikely to have had different experiences prior to experimentation: it\nis possible, though unlikely, that subjects had learned the separate\ncomponents of the task in which they were tested, and were\nthereafter chaining these learned skills [26]. There was no\nevidence that successful subjects were choosing which tool to\nextract based upon the distance to food, although the power of this\nnegative result is low due to the small number of trials per\ncondition. Furthermore, on the majority of their trials, two of the\nsubjects initially probed first into the food-tube with the available,\ntabletop tool, which suggests either an inability to compare food\ndepth with tool length, a lack of inhibitory control or a lack of\nknowledge about the requirements of the task. In a previous\nexperiment, crows rarely probed into the food apparatus first with\nthe available tool [8]; however, this could be simply explained by\nthe set of extinction trials that they received before testing (the\navailable tool was presented with food that was out of reach so\nsubjects had experience of the inefficiency of the available tool).\nExperiment 2 enabled further insights into the underlying\nprocesses governing sequential tool use. As in Experiment 1, all\nthree subjects showed sequential tool use on their first trials, even\nthough the apparatus was novel and none had been given prior\nexperience retrieving tools from the tool-frame; one subject was new\nto this experiment, so his first-trial tool retrieval was even more\nremarkable. All three subjects also successfully retrieved food in\nFigure 6. Tool ‘swaps’ in Experiment 2.Bars show the proportion of ‘positive’ tool swaps (exchanging a short tool for a longer one) compared\nwith the expected proportion from random swapping (0.5; shown by the dashed horizontal line). Data are only for successful trials with at least one\ntool swap, excluding all swaps from the tabletop tool to an extracted tool (since by definition these swaps will always be positive); there were no\nswaps in SA trials. The number of relevant trials is displayed underneath each bar. Error bars show 95% confidence intervals and are capped at 1 (in\nthe four relevant Tertiary trials for Ue´k, only positive tool swaps were made, hence the lack of an error bar).P-values (two-tailed) from one-samplet-\ntests of the observed and hypothesized proportions (p-values adjusted for each subject) are indicated by asterisks: * =p,0.05, ** =p,0.01,\n*** =p,0.001. Trial types are coded as in Figures 4 and 5, with the exception that no SA trials are presented.\ndoi:10.1371/journal.pone.0006471.g006\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 10 August 2009 | Volume 4 | Issue 8 | e6471\nproblems requiring the sequential use of three tools, and improved\nthe efficiency of these sequences with experience. Subjects directed\nmore of their first probes towards tools when the food was further\naway, demonstrating that probing for tools was not simply a result of\nfrustration at their inability to retrieve food. Furthermore, for two of\nthree subjects the tools that they first used to probe for food were\nsignificantly longer than would be expected if they were extracting\ntools randomly, indicating that they were sensitive to the required\nlength of tool. Sensitivity to the length of tools was also evident from\nthe subjects’ tendency to exchange short tools for longer ones but\nnot the other way round. Subjects showed flexibility in their\nbehaviour, probing into the food-frame on fewer trials when food\nwas absent, or could not be obtained, and extracting tools on fewer\ntrials when they were unnecessary.\nSubjects used longer tools to probe for food in Length-Only,\ncompared to Sequential trials, i.e. when they only needed to pick out\ntools rather than probe for them with an available tool. Subjects also\ninteracted with the tabletop tools on fewer Length-Only trials,\nindicating that they perceived thi s condition as distinct. During\nSequential trials the tabletop tools had played an integral role in success\n(by extracting food or tools) on all conditions, whereas in Length-Only\ntrials they were only suitable for retrieving the food on a third of the\ntrials. The Length-Only trials were carried out after the Sequential\nexperiments were complete, so their tendency to choose longer tools to\nprobe for food might have been due to their greater experience, but it\nmight also suggest that sequential tool use imposed extra cognitive\ndemands, disrupting their ability toselect tools based upon length [29].\nSubjects not only had to recognize and respond to the depth of food,\nbut they also had to choose whether to probe for another tool and, if so,\nwhich one. This may have had the effect of dividing their attention, a\nprocess that can affect cognitive performance [31].\nIn our opinion, claims for analogical reasoning based upon\nsequential tool use remain unjustified [8], and using sequential tool\nuse as a benchmark of this ability is inappropriate. Reasoning (let\nalone analogical reasoning) is not the only cognitive mechanism to\naccount for sequential tool use: simpler processes such as chaining\nFigure 7. Results from control conditions in Experiment 2.Panel (A) shows the percentage of trials in which subjects probed into the food-\nframe, split according to which tool was used first. Panel (B) shows the percentage of trials in which a tool/object was extracted from the tool-frame.\nSecondary-Any (SA) trials are also displayed to allow for comparison with an experimental condition. Trial types are coded as follows: NF = No-Food;\nNT = No-Tools; P = Primary; SA = Secondary-Any.\ndoi:10.1371/journal.pone.0006471.g007\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 11 August 2009 | Volume 4 | Issue 8 | e6471\nmay be sufficient. Conversely, animals that do possess elaborate,\nhuman-like reasoning capacities may not be identified in these\nexperiments: errors might be made that are not due to cognitive\nlimitations, but instead motivational, inhibitory or perceptual factors.\nFor these reasons, we do not implicate reasoning (or a lack of it) as an\nexplanation for our crows’ behaviour, but our analyses do provide\nclues about the cognitive processes involved in sequential tool use.\nThe presence of errors in subjects’ sequential tool use allows us to\nreject the hypothesis that they were perfectly sensitive to the precise\nrequirements of each task. However, a parsimonious alternative\nexplanation would be that once subjects ‘discovered’ the action of tool\nretrieval (perhaps by displacement behaviour), they automatically\nperformed a learned sequence of actions such as probing for food,\nthen for tools, then for food again. Our data were not consistent with\nthe hypothesis that subjects ‘discovered’ the out-of-reach tools in this\nway, nor that they then relied on a sequence of random probes for\ntools, followed by probes for food. We hypothesize that crows\nperceive general features of the task with different degree of detail,\nand act appropriately following this assessment. For example, crows\nmight perceive that food is either possible or impossible to retrieve\nwith the available tool, and that food or tools are present or absent.\nUnder this hypothesis, the high level of incorrect first probes towards\nthe food in Secondary-Any trials might have occurred because, at this\nintermediate food depth, subjects weren’t sure whether the tabletop\ntool could retrieve it. This suggests that in the absence of clear\ninformation regarding the task they ‘give it a go’ with any available\ntool, and if that fails they will then search for longer tools, a strategy\nsimilar to the ‘two-stage heuristic’ proposed by Hunt and Gray to\naccount for the choice behaviour of wild crows [32].\nOur observations also highlight the importance of taking into\naccount individual differences when considering behaviour of this\ncomplexity. Unlike in simple choice experiments, here there were\nmany possible sequences of behaviour, so it is unsurprising that each\nsubject showed a different strategy. The richness in our crows’\nbehaviour makes it difficult to formulate a single model for the\ncognitive operations involved in sequential tool use by this (and\npossibly other) species. What is certain, however, is that New\nCaledonian crows will spontaneously use tools to probe for tools that\nare otherwise unavailable, and they do not need specific training to do\nso. What is more, although an associative process such as chaining\n(sensu Epstein et al. [26]) could not be ruled out for the successful\nsubjects in Experiment 1, or in an earlier study [8], this was not the\ncase for Experiment 2. The two subjects who had participated in\nExperiment 1 therefore either generalized their knowledge of the first\ntask to the novel apparatus in Experiment 2, or they perceived it as\ndistinct and were spontaneously able to solve it. However, the third\nsubject in Experiment 2 used a tool to extract another tool on his very\nfirst trial, and he had no specific experience of the process, nor had he\never learned to associate the tool apparatus with tools. His behaviour\nin particular leaves open the possibility that crows may solve\nsequential tool problems by planningtheir actions, rather than having\nto build up associations by repeated experience.\nWhile our New Caledonian crows made errors that are\nincompatible with fully rational planning, their performance on\nthis task compares favourably with that of primates (including\napes) in earlier studies [7,13]. Sequential tool use is frequently\nassumed to be indicative of planning, a candidate for a unique\ncharacteristic of humans [33,34]; however, together with other\nforms of anticipatory behaviour in corvids, it might appear that\nthis assumption of human uniqueness is unjustified [24,35]. The\npotential for sequential tool use in New Caledonian crows is likely\nto relate to general problem-solving abilities, rather than to an\nevolutionary adaptation for acquiring out-of-reach tools (which\nseems an unlikely scenario in their native forested habitat, where\nsticks are readily available). Whether these abilities are peculiar to\nsome taxa (such as corvids, apes, and a few other groups) or more\nwidespread, and whether they are in any way causally associated\nwith tool use remains a matter for speculation, though the recent\nFigure 8. Tool selectivity in the Length-Only condition (L) compared with Sequential (S) trials (Experiment 2).Bars show mean length\n(6SE) of tools first used to probe for food, across the three food depths.\ndoi:10.1371/journal.pone.0006471.g008\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 12 August 2009 | Volume 4 | Issue 8 | e6471\nfinding of sequential tool use in non tool-using rooks [24] suggests\nthat the underlying cognition may have a phylogenetic origin,\nrather than being specifically associated with tool use. Our\nfindings, as well as providing clues about the cognitive processes\nunderpinning sequential tool use in New Caledonian crows, also\nargue for a shift away from the traditional modes of analysis:\nexamination of the complexities in behaviour, including the types\nof error made, should be as important to forming conclusions\nabout cognition as simply reporting whether or not behaviour is\nshown. It is now timely to run similar experiments in apes and\nother primates in order to determine how primate species fare\nunder our new experimental paradigm.\nMaterials and Methods\nExperiment 1\nSubjects and housing. The subjects were six New\nCaledonian crows ( Corvus moneduloides): four wild-caught adults\n(Betty, Barry, Kenny, Pierre; see [36] for detailed information on\ncapture history), and two crows bred and hand-raised in captivity in\n2004 (Nalik, Ue´k; see [37,38] for detailed information); two were\nfemale (Betty and her daughter Ue´k). All subjects had participated\nin earlier experiments, but none had ever been required to extract\nnon-food objects from tubes or to use tools in a sequence. Subjects\nwere assigned to two experimental groups (‘experienced’ and\n‘inexperienced’), as described in the main text. Groups were\nmatched with respect to age and developmental history: two wild-\ncaught and one younger, hand-reared subject in each. Betty had by\nfar the most experimental experience; all other crows at that point\nhad some experience. Groups were not matched for sex.\nThe subjects were housed in groups in indoor-outdoor aviaries\n(Betty and Pierre in one group, Barry and Kenny in another, and\nUe´k and Nalik as a non-breeding pair), but tested in isolation. In\ntheir home aviaries, the crows had unlimited access to branches,\nsticks and children’s toys of assorted sizes and shapes. As part of\nthe standard feeding protocol, mealworms were hidden in toys and\nin holes in wooden logs to encourage tool use outside experimental\ncontexts and to generally enrich their environment. We frequently\nobserved all subjects using tools to extract hidden food.\nApparatus. In this experiment, both the food reward and the\nfour potential tools were out of reach and located in tubes\n(Figure 2). All tubes had one blocked end and were made of\ntransparent acrylic (food-tube: 43 cm long 65 cm diameter; tool-\ntubes: 3063 cm) mounted on wooden blocks (bottom of the tubes\n4.5 cm from the table). The mouth-to-mouth distance between the\nfood-tube and the tool-tubes was 30 cm, and the angle between\nthe two outermost tool-tubes was 100 u. One (‘tabletop’) tool was\nplaced on the table 10 cm from the open end of the food-tube.\nThe reward was a small piece of pig’s heart ( ,1 g) and one\nwaxmoth larva. In experimental trials, a piece of dowelling\n(2.8 cm diameter, various lengths) was placed at the back of the\ntool-tubes to prevent the tools from being pushed backwards\nduring retrieval attempts. This modification was introduced after\nBetty and Pierre had already received, respectively, seven and five\ntesting trials in total, where they often pushed tools out of reach by\ntheir own probing. This change did not seem to affect where the\nsubjects chose to probe: both subjects probed for tools on their first\nof these trials and on subsequent trials where this was appropriate.\nPre-testing tools (see below) were pieces of bamboo skewer\n(diameter 0.2 cm) of different lengths. Experimental tools were made\nfrom wooden dowelling (diameter 0.6 cm). For Betty and Pierre, the\ntabletop tool was 6 cm long, medium-length tools were 10 cm long,\nand the longest tools were 20 cm long; all tools had a 2 cm long\nbamboo cross-piece at one end. For all other subjects, the tabletop tool\nwas 5 cm long, medium-length tools were 12.5 cm, and the longest\ntools were 25 cm; the medium and long tools had four (evenly-spaced)\ncross-pieces, and the tabletop tool had two (one at each end). The tool\nlengths were changed to increase the difference between short and\nlong tools, and the cross-pieces were added to make it easier for\nsubjects to extract out-of-reach tools, following observations that one\nsubject (Pierre) had difficulty with the original design.\nGeneral procedures. Experiments took place in a testing\nchamber connected to the home aviary of each subject. Subjects\nwere isolated prior to testing, and during trials could enter and leave\nthe experimental chamber at will. Food was removed from the\nhome aviary at 09:00 GMT, and returned when testing ended. Prior\nto each testing session, the experimental room was cleared of all\npotential tools. Trials were performed between January 2005 and\nApril 2006, and testing occurred between 10:00 and 19:00 GMT,\nwith the number of trials per day and the length of the testing session\ndepending on the subjects’ willingness to participate. We terminated\ntrials either after food retrieval, if five minutes had elapsed, or if the\nsubject left the testing room for longer than 1 minute. The\napparatus was set up out of sight of the subjects, and all trials were\nfilmed using a mini-DV camcorder (Canon DM-MV300i, Canon\nDM-MV550i, or Canon XL1) from behind a tinted Perspex screen.\nPre-testing procedure. All birds were initially habituated to\nthe testing room, and given trials with only the food-tube and a\ntraining tool (10–20 cm long, readily available). Once birds\nconsistently used the tool to retrieve food (8/10 on two consecutive\nblocks of 10 trials), the experienced birds were presented with tool-\ntubes containing training tools of four lengths (see above) within beak-\nreach, and a food-tube with food at different depths, out of beak-\nreach (food could be retrieved by 1–4 of the training tools, depending\non food position). After a minimum of 30 trials, there were six\nfamiliarization trials with the tools used later in testing, and food at\n10–20 cm depth. The inexperienced subjects were given\napproximately 30 trials with food within reach of one training tool\n(10–20 cm), which was placed 30 cm from the mouth of the tube; first\ntwo, then four empty tool-tubes were introduced.\nTesting procedure. To ensure the birds’ motivation, food was\nplaced just into the opening of the food-tube on the first trial of each\nsession, so that the subject could pick it out with its beak. All birds\nreceived four trial types (see Table 1 for details of each), which\ndiffered according to the depth of the food (‘Primary’, ‘Secondary-\nAny’ and ‘Secondary-Long’) and the depth of the longest tool\n(‘Tertiary’). In addition, Barry, Kenny, Nalik, and Ue´k received a\n‘No-Food’ condition (where the food-tube was empty), interspersed\nwith the other trials. Betty and Pierre received three trials per\ncondition, and the other subjects four. Conditions were pseudo-\nrandomly ordered, with the constraint that the same condition could\nnot occur on more than two trials in a row, and all conditions had to\noccur every four (for Betty and Pierre) or five trials (for the other\nsubjects). Betty and Pierre received twelve trials in total (excluding\ntheir initial set of trials where no dowelling was present behind the\ntools), and the others twenty. We deliberately kept trial numbers to an\nabsolute minimum, as we were interested in whether the crows could\nspontaneously solve sequential tool use tasks (as opposed to depending\non training, or extensive trial-and-error learning).\nAfter the first twenty trials, two of the inexperienced subjects\n(Barry and Kenny; Nalik had died) received an additional twenty\ntrials to test whether their poor performance on the task was due to\nthe small number of trials. Since Kenny never used one tool to\nretrieve another in these trials, he received a further 57 testing\ntrials, interspersed with trials designed to promote sequential tool\nuse (tools placed on the tabletop where tool-tubes had been\nlocated; tools placed inside the tool-tubes within reach of the beak;\nand tools protruding from the tool-tubes).\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 13 August 2009 | Volume 4 | Issue 8 | e6471\nScoring and Analysis. Scoring was done from videotapes by\nJHW, and all tapes were rescored by an independent observer,\nwho was familiar with general New Caledonian crow behavior,\nbut naı¨ve with respect to the specific hypotheses being tested in our\nanalyses. Concurrence was .95% for both scorers.\nTo address the cognitive processes underlying subjects’\nperformance, three aspects of their behavior were examined. (i)\nDo subjects attend to the distance to food when choosing where to\nprobe? (ii) Are they selective about the tools that they use to probe\nfor food? (iii) For the one subject (Ue´k) who received the No-Food\ncondition, we also looked at whether she probed the (empty) food\ntube and/or extracted out-of-reach tools. We investigated whether\nsubjects attended to the position of the food by examining whether\nthey first probed for tools or food with the tabletop tool in different\nconditions. Subjects who are sensitive to the distance to food\nshould probe for it when it is within reach (Primary trials), but not\nwhen it is out of reach (experimental trials); probing for food first\nin experimental trials would suggest either an inability to assess the\nrequired length of the tool or to inhibit an automatic tendency to\nprobe for food. To explore tool selectivity, we looked at the first\nextracted tool that the subjects used to probe for food.\nThe verb ‘to probe’ implies an insertion of a tool into a tube, and\nthus it is specifically applied to situations where a tool was in\npossession. Therefore, if a subject is said to probe towards the food,\nit is doing so with a tool. Similarly, when tools are ‘probed for’ this\nmeans with a tool, rather than simply reaching towards them.\nExperiment 2\nSubjects and housing. We used three subjects: two from the\nexperienced group in Experiment 1 (Pierre and Ue ´k), and one\nsubject (Corbeau), who had been bred and raised in captivity [37]\nbut had never participated in problem-solving experiments, and\nwas naı¨ve to the task. Corbeau was housed on his own, but all\nhousing conditions were the same as described for Experiment 1.\nApparatus. A new apparatus was built to address the\npossibility that the presentation of tools and food inside acrylic\ntubes in Experiment 1 had impaired the subjects’ perception of their\nlength and depth. Wooden frames were used, open at the front and\ntop (tool-frame: l = 98 cm, w = 52 cm, d = 10 cm; food-frame:\nl = 30 cm, w = 21 cm, d = 11 cm; Figure 3), and these open\naspects were covered in wire mesh (mesh size = 1.2 cm). The wire\nmesh did not completely cover the front sections of the apparatus; a\n2.5 cm gap was left along the bottom to enable probing with tools\nand extraction of tools or food. The tool-frame was divided into four\nlanes (approximately 22 cm wide), and to prevent the tools from\nbeing pushed out of reach, strips of linoleum were slotted behind\nthem (at the relevant distance). The distance between the openings\nof the food- and tool-frames was at least 90 cm. The pre-testing tool\nwas a natural twig (l = 15 cm, d = 0.5 cm). Testing tools for Pierre\nand Corbeau were the same as those presented to most subjects in\nExperiment 1, in that they were made of the same dowel, and had\nfour equally spaced skewer crosspieces. Ue´k was tested with natural\noak twigs because she showed a strong tendency to use artificial tools\nfor non-experimental activity (i.e., probing around her aviary) and it\nwas very difficult to retrieve these tools from her. Unlike in\nExperiment 1, the out-of-reach tools were all of different lengths (10,\n15, 20 and 25 cm). Testing tools were placed diagonally into each\nlane, at a depth of 8 cm from the open end. Two tabletop tools (5\nand 7 cm long), also made of dowel and with a crosspiece at either\nend, were provided on every trial; only the 7 cm tool was long\nenough to reach food or other tools. Tabletop tools were placed\nmidway between the tool- and food-frames, rather than closer to the\nfood apparatus as in Experiment 1. The reward was a small piece\n(,1 g) of pig’s heart.\nGeneral procedures. Pierre was tested in a separate testing\nroom (see general procedures for Experiment 1). Ue ´k and\nCorbeau were both tested in their home aviaries, because they\ndid not have an adjoining testing room large enough for the new\napparatus. Prior to each testing session, the aviaries were cleared\nof all potential tools and other objects. Testing took place between\nAugust 2006 and December 2006, between 09:00 and 18:00\nGMT. During trials, a small amount of the subjects’ least favoured\nfood (soaked cat biscuits) was available in the aviaries. Trial\ntermination and recording was as described for Experiment 1.\nPre-testing procedure. All subjects were initially given trials\nwith only the food-frame and a training tool (15 cm), which was\nreadily available. Once birds consistently used the tool to retrieve\nfood (8/10 on two consecutive blocks of 10 trials), the tool-frame\nwas introduced (positioned as it would be during testing). Subjects\nreceived 10 trials in which a piece of meat was placed in one of the\ntool lanes, in a randomized order, which they could pick out with\ntheir beaks. Stones were placed into the other tool lanes. All three\nsubjects received this familiarization, which was different to that\ngiven to both the experienced and inexperienced birds in\nExperiment 1. This revised protocol ensured that subjects never\nlearned to associate the tool-frame with tools, but were still\nreinforced for interacting with it.\nTesting procedure. To ensure motivation, food was placed\nwithin beak range at the opening of the food-frame, on the first trial of\neach session. All birds received six trial types (Table 1): Primary,\nSecondary-Any and Secondary-Long as in Experiment 1, plus a\nmodified Tertiary and two control conditions (‘No-Food’ and ‘No-\nTools’). In Tertiary trials, the longest tool was only reachable with the\nsecond longest out-of-reach tool, instead of all other out-of-reach tools\nas in Experiment 1. In No-Food trials, no reward was present, to test\nfirstly whether tools would still be extracted (in which case the tools\nthemselves may be reinforcing), and secondly, whether subjects would\nprobe the empty food-frame (which would indicate that the action of\nprobing was relatively inflexible). In No-Tools trials the tools were\nswapped for non-tool objects such as LegoH blocks or cork, and food\nwas placed at an intermediate depth of 15 cm. The purpose of these\ntrials was to see if subjects would probe for these objects, and if they\npicked them from the apparatus, whether they would then insert\nthem into the food-frame.\nSubjects received at least nine blocks of six trials; each condition was\nrandomly assigned within one block. In addition, after these blocks of\ninterspersed trials all subjects received an extra set of Tertiary trials\n(termed ‘Tertiary-2’), bringing the total number of these trials to at\nleast 23. The purpose of these was to examine learning on this most\nchallenging condition, by comparing these later trials (taking place\nafter at least 54 exposures to the apparatus) with earlier ones.\nOnce sequential trials were completed, all subjects received an\nadditional 30 ‘Length-Only’ trials. The procedure was the same as\nfor the previous sequential tool use trials with the important\ndifference that tools were placed within beak range at the end of\neach tool lane. Subjects received ten intermixed trials of each of\nthree food depths: 7, 13 and 25 cm. These trials were carried out\nto determine whether there were additional cognitive demands of\nsequential tool use, which may have hampered tool selection.\nScoring and Analysis. The performance of Pierre and\nCorbeau was scored from videotapes by LC and re-scored by\nJHW for verification and analysis (concurrence was .90%;\nanalyses use data scored by JHW). Ue ´k’s behaviour was scored\nfrom videotape by JHW. All analyses were carried out using\nMicrosoft Excel and Minitab (version 15). All statistical tests are\ntwo-tailed, with alpha set at 0.05 (unless otherwise stated). Most\nanalyses are carried out at a within-subject level, and therefore our\ninferences cannot be generalized to the species as a whole. While\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 14 August 2009 | Volume 4 | Issue 8 | e6471\nwe acknowledge that some caution should be taken in the\ninterpretation of such analyses, this is a general problem in animal-\ncognition research, where sample sizes are often small.\nAs in Experiment 1, we examined whether subjects retrieved the\nfood, where they first probed, and if they exhibited tool selectivity. The\ntarget of the first probe (into the food-frame or the tool-frame) was\nexamined using a binary logistic regression, with ‘subject’ and ‘food\ndepth’ as factors. Food depth was used, rather than ‘condition’, because\nwe wanted to know whether crows changed their behaviour when they\nperceived food to be out of reach: in this respect, there is no distinction\nbetween Secondary-Long and Tertiary trials. Tertiary-2 trials were\nexcluded from this analysis because they were presented at the end of\ntesting and therefore their inclusion would confound food depth with\nexperience. Tool selectivity was examined by comparing the average\nlength of the first extracted tool used to probe for food against a\nhypothesized value if the subject was picking tools at random. The\nexpectations are described in the main text; one-samplet-tests (with p-\nvalues adjusted for multiple comparisons) were used for each subject to\ncompare the observed average tool length against the hypothesized\nvalues, for each condition except No-Food and No-Tools. To evaluate\nwhether median tool length differed between conditions we used non-\nparametric Kruskal-Wallis tests; where significance was reached we\nemployed post-hoc Mann-WhitneyU-tests (with p-values adjusted for\nmultiple comparisons)to identify significant group differences.\nWe also performed three additional analyses: (i) we asked\nwhether subjects swapped tools that they had extracted before\nprobing for food; (ii) we examined their behaviour in control\nconditions, and; (iii) we investigated whether their performance on\nTertiary tasks improved with experience. Tool swapping was\nexamined by identifying all trials on which a subject extracted a\ntool but discarded it for another one before probing for food. The\nnumber of swaps made before the first probe was recorded, as well\nas the proportion of these that were ‘positive’ (i.e., where swapping\nresulted in increased tool length). For each subject, an average\nproportion was compared against the value that would be\npredicted if subjects were exchanging at random (i.e., 0.5), using\none-sample t-tests (p-values adjusted for multiple comparisons).\nWe analysed control trials with within-subject chi-squared tests to\ncompare the number of trials on which tools/non-tool objects\nwere extracted, as well as the number of trials on which the food-\nframe was probed. Where significance was reached we examined\nthe standardized residuals to determine which cells of the\ncontingency table significantly contributed to the chi-squared test\nstatistic [39], comparing the size of the observed residuals to the\ncritical values corresponding to an alpha value of 0.05. To\ndetermine whether subjects had improved their performance over\nthe course of testing, we used Mann-Whitney U-tests, analyzing\nwhether there was a difference in the median length of tools used\nto probe for food in Tertiary, compared to Tertiary-2 trials.\nFinally, we examined the results of Length-Only trials, where\ntools were placed within beak range. To determine whether there\nwas a difference in tool selection between sequential tool trials and\nLength-Only trials, a GLM was constructed with ‘subject’,\n‘experiment’ and ‘food depth’ entered as factors.\nSupporting Information\nVideo S1 This video shows Betty’s first exposure in Experiment 1\nto the three-tool problem (Tertiary), which was her fourth testing\ntrial in total. Correct sequence of actions: first use tabletop tool\n(freely available in the arena) to retrieve any of the three medium-\nlength tools from tool-tubes (first three tool-tubes from left); then use\nmedium-length tool to retrieve longest tool from tool-tube (fourth\ntool-tube from left); then use this long tool to obtain food reward\nfrom food-tube (in front). Observed behaviour: Betty does not\nattempt to probe for food, but immediately uses the tabletop tool to\nretrieve a medium-length tool. She then appears to look into the\nfood-tube, without probing, before using the tool to extract the\nlongest tool. Finally, she uses this tool to retrieve the reward from the\nfood-tube. It is noteworthy that she seems to actively dispose of each\ntool as its role in the sequence is completed, and she also turns the\ntools around in order to place the cross-piece distal, where it is most\neffective as a hook-like instrument.\nFound at: doi:10.1371/journal.pone.0006471.s001 (2.96 MB\nMOV)\nVideo S2 This video shows Pierre’s first exposure in Experiment\n1 to a two-tool problem (Secondary-Long), which was his second\ntesting trial in total. Correct sequence of actions: use tabletop tool\n(freely available in the arena) to retrieve the longest tool from the\ntool-tube (second tool-tube from left; the other three tubes contain\nmedium-length tools); then use this long tool to obtain food reward\nfrom food-tube (in front). Observed behaviour: Pierre picks up the\ntabletop tool and quickly inserts it into the food-tube. He then uses\nthe tabletop tool to probe for the correct, longest tool, but fails to\nretrieve it, and leaves the testing arena. Shortly thereafter ( ,1\nminute; cut from video), he returns with a twig from his aviary,\nwhich he immediately uses to extract the longest tool, which he in\nturn uses to retrieve the reward from the food-tube.\nFound at: doi:10.1371/journal.pone.0006471.s002 (3.00 MB\nMPG)\nVideo S3 This video shows Ue ´k’s fifth Tertiary-2 trial in\nExperiment 2, which was her 67th trial in total. Correct sequence\nof actions: use the longer of two tabletop tools (freely available in\ncentre of arena) to retrieve the 20 cm tool from the tool-frame\n(left-hand tool-lane); then use this 20 cm tool to retrieve the 25 cm\ntool (third tool-lane from left); then use the 25 cm tool to retrieve\nthe food. Observed behaviour: Ue´k picks up the longest tabletop\ntool and uses it to retrieve the 20 cm tool. She uses the 20 cm tool\nto probe for the 25 cm tool, initially from the top of the tool-frame\nbut then from the front. Once she has retrieved the 25 cm tool she\ntakes it immediately to the food-frame and retrieves the food.\nFound at: doi:10.1371/journal.pone.0006471.s003 (5.26 MB\nMPG)\nAcknowledgments\nWe thank D. Wilson for technical support, L. Bluff and S. Barlow for useful\ncomments and assistance with bird husbandry, and J. Aw for helping to\nscore the tapes in Experiment 1. We also thank Christopher Bird and an\nanonymous referee for providing comments on an earlier version of this\npaper. CR is the grateful recipient of a Visiting Fellowship at the Evolution\nand Ecology Research Centre, University of New South Wales, Sydney,\nAustralia.\nAuthor Contributions\nConceived and designed the experiments: JHW AASW LC CR AK.\nPerformed the experiments: JHW LC. Analyzed the data: JHW AASW\nCR AK. Contributed reagents/materials/analysis tools: AASW CR AK.\nWrote the paper: JHW AASW CR AK.\nReferences\n1. Hansell M, Ruxton G (2008) Setting tool use within the context of animal\nconstruction behaviour. Trends in Ecology & Evolution 23: 73–78.\n2. Beck BB (1980) Animal tool behavior: the use and manufacture of tools by\nanimals. New York; London: Garland STPM Press.\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 15 August 2009 | Volume 4 | Issue 8 | e6471\n3. Bluff LA, Weir AAS, Rutz C, Wimpenny JH, Kacelnik A (2007) Tool-related\ncognition in New Caledonian crows. Comparative Cognition and Behavior\nReviews 2: 1–25.\n4. Weir AAS, Chappell J, Kacelnik A (2002) Shaping of hooks in New Caledonian\ncrows. Science 297: 981.\n5. Hunt GR, Gray RD (2004) The crafting of hook tools by wild New Caledonian\ncrows. Proceedings of the Royal Society of London B (Suppl) 271: S88–S90.\n6. Kitahara-Frisch J (1993) The origins of secondary tools. In: Berthelet A,\nChavaillon J, eds.The use of tools by human and non-human primates. Oxford:\nClarendon Press. pp 239–246.\n7. Hihara S, Obayashi S, Tanaka M, Iriki A (2003) Rapid learning of sequential\ntool use by macaque monkeys. Physiology & Behavior 78: 427–434.\n8. Taylor AH, Hunt GR, Holzhaider JC, Gray RD (2007) Spontaneous Metatool\nUse by New Caledonian Crows. Current Biology 17: 1504–1507.\n9. Matsuzawa T (1991) Nesting cups and metatools in chimpanzees. Behavioral\nand Brain Sciences 14: 570–571.\n10. Brewer SM, McGrew WC (1990) Chimpanzee use of a tool-set to get honey.\nFolia Primatologica 54: 100–104.\n11. Anderson JR, Henneman MC (1994) Solutions to a tool-use problem in a pair of\nCebus apella. Mammalia 58: 351–361.\n12. Warden CJ, Koch AM, Fjeld HA (1940) Instrumentation in cebus and rhesus\nmonkeys. Journal of Genetic Psychology 56: 297–310.\n13. Mulcahy NJ, Call J, Dunbar RIM (2005) Gorillas (Gorilla gorilla) and\norangutans ( Pongo pygmaeus) encode relevant problem features in a tool-using\ntask. Journal of Comparative Psychology 119: 23–32.\n14. Kohler W (1925) The Mentality of Apes. Trans. Winter E London: Penguin.\n15. Sanz C, Morgan D, Gulick S (2004) New insights into chimpanzees, tools and\ntermites from the Congo Basin. American Naturalist 164: 562–581.\n16. Sugiyama Y (1997) Social tradition and the use of tool-composites by wild\nchimpanzees. Evolutionary Anthropology 6: 23–27.\n17. Deblauwe I, Guislain P, Dupain J, Van Elsacker L (2006) Use of a tool-set by Pan\ntroglodytes troglodytes to obtain termites (Macrotermes) in the periphery of the\nDja Biosphere Reserve, southeast Cameroon. American Journal of Primatology\n68: 1191–1196.\n18. Matsuzawa T (1994) Field experiments on use of stone tools by chimpanzees in the\nwild. In: Wrangham RW, McGrew WC, eds. Chimpanzee cultures. Cambridge,\nMA: Harvard University Press. pp 351–370.\n19. St Amant R, Horton TE (2008) Revisiting the definition of animal tool use.\nAnimal Behaviour 75: 1199–1208.\n20. Birch HG (1945) The role of motivational factors in insightful problem-solving.\nJournal of Comparative Psychology 38: 295–317.\n21. Schiller P (1952) Innate constituents of complex responses in primates.\nPsychological Review 58: 177–191.\n22. Kluver H (1933) Behavior Mechanisms in Monkeys. Chicago: University of\nChicago Press.\n23. Santos LR, Rosati A, Sproul C, Spaulding B, Hauser MD (2005) Means-means-\nend tool choice in cotton-top tamarins ( Saguinus oedipus): finding the limits on\nprimates knowledge of tools. Animal Cognition 8: 236–246.\n24. Bird CD, Emery NJ (2009) Insightful problem solving and creative tool\nmodification by captive non tool-using rooks. Proceedings of the National\nAcademy of Sciences, Advance online publication: www.pnas.org/cgi/doi/10.\n1073/pnas.0901008106.\n25. Hunt GR, Gray RD (2006) Tool manufacture by New Caledonian crows:\nchipping away at human uniqueness. Acta Zoologica Sinica 52: 622–625.\n26. Epstein R, Kirshnit CE, Lanza RP, Rubin LC (1984) ‘Insight’ in the pigeon:\nantecedents and determinants of an intelligent performance. Nature 308: 61–62.\n27. Warden CJ, Galt WE (1941) Instrumentation in cebus and rhesus monkeys on a\nmultiple platform task. Journal of Psychology 11: 3–21.\n28. Clayton N (2007) Animal Cognition: Crows spontaneously solve a metatool task.\nCurrent Biology 17: R894–R895.\n29. Chappell J, Kacelnik A (2002) Tool selectivity in a non-primate, the New\nCaledonian crow (Corvus moneduloides). Animal Cognition 5: 71–78.\n30. Mendl M (1999) Performing under pressure: stress and cognitive function.\nApplied Animal Behaviour Science 65: 221–244.\n31. Hood BM, Wilson A, Dyson S (2006) The effect of divided attention on\ninhibiting the gravity error. Developmental Science 9: 303–308.\n32. Hunt GR, Rutledge RB, Gray RD (2006) The right tool for the job: What\nstrategy do wild New Caledonian crows use? Animal Cognition 9: 307–316.\n33. Owen AM (1997) Cognitive planning in humans: Neuropsychological,\nneuroanatomical and neuropharmacological perspectives. Progress in Neurobi-\nology 53: 431–450.\n34. Suddendorf T, Corballis MC (1997) Mental time travel and the evolution of the\nhuman mind. Genetic, Social & General Psychology Monographs 123: 133–168.\n35. Raby CR, Alexis DM, Dickinson A, Clayton NS (2007) Planning for the future\nby western scrub-jays. Nature 445: 919–921.\n36. Kenward B, Rutz C, Weir AAS, Chappell J, Kacelnik A (2004) Morphology and\nsexual dimorphism of the New Caledonian Crow Corvus moneduloides, with\nnotes on its behaviour and ecology. Ibis 146: 652–660.\n37. Kenward B, Rutz C, Weir AAS, Kacelnik A (2006) Development of tool use in\nNew Caledonian crows: inherited action patterns and social influences. Animal\nBehaviour 72: 1329–1343.\n38. Kenward B, Weir AAS, Rutz C, Kacelnik A (2005) Tool manufacture by naive\njuvenile crows. Nature 433: 121.\n39. Sheskin D (2004) Handbook of parametric and nonparametric statistical\nprocedures. Chapman and Hall/CRC Press. pp 525–527.\nSequential Tool Use in Crows\nPLoS ONE | www.plosone.org 16 August 2009 | Volume 4 | Issue 8 | e6471",
  "topic": "Cognition",
  "concepts": [
    {
      "name": "Cognition",
      "score": 0.6306158304214478
    },
    {
      "name": "Computer science",
      "score": 0.5996442437171936
    },
    {
      "name": "Animal cognition",
      "score": 0.5251467227935791
    },
    {
      "name": "Artificial intelligence",
      "score": 0.4870157837867737
    },
    {
      "name": "Sequence (biology)",
      "score": 0.4761742949485779
    },
    {
      "name": "Principal (computer security)",
      "score": 0.44681739807128906
    },
    {
      "name": "Cognitive psychology",
      "score": 0.3792571425437927
    },
    {
      "name": "Machine learning",
      "score": 0.3376811742782593
    },
    {
      "name": "Psychology",
      "score": 0.2636370062828064
    },
    {
      "name": "Biology",
      "score": 0.13963153958320618
    },
    {
      "name": "Operating system",
      "score": 0.0
    },
    {
      "name": "Neuroscience",
      "score": 0.0
    },
    {
      "name": "Genetics",
      "score": 0.0
    }
  ]
}