{
    "title": "30-100-GHz inductors and transformers for millimeter-wave (Bi)CMOS integrated circuits",
    "url": "https://openalex.org/W2100779054",
    "year": 2005,
    "authors": [
        {
            "id": "https://openalex.org/A4270530796",
            "name": "T.O. Dickson",
            "affiliations": [
                "University of Toronto"
            ]
        },
        {
            "id": "https://openalex.org/A2324741675",
            "name": "M.A. Lacroix",
            "affiliations": [
                "STMicroelectronics (Canada)"
            ]
        },
        {
            "id": "https://openalex.org/A2308193898",
            "name": "S. Boret",
            "affiliations": [
                "STMicroelectronics (France)"
            ]
        },
        {
            "id": "https://openalex.org/A1973979380",
            "name": "D. Gloria",
            "affiliations": [
                "STMicroelectronics (France)"
            ]
        },
        {
            "id": "https://openalex.org/A2160597739",
            "name": "R. Beerkens",
            "affiliations": [
                "STMicroelectronics (Canada)"
            ]
        },
        {
            "id": "https://openalex.org/A1761228485",
            "name": "S.P. Voinigescu",
            "affiliations": [
                "University of Toronto"
            ]
        },
        {
            "id": "https://openalex.org/A4270530796",
            "name": "T.O. Dickson",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2324741675",
            "name": "M.A. Lacroix",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2308193898",
            "name": "S. Boret",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1973979380",
            "name": "D. Gloria",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2160597739",
            "name": "R. Beerkens",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1761228485",
            "name": "S.P. Voinigescu",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W1606694637",
        "https://openalex.org/W1975920112",
        "https://openalex.org/W2165795923",
        "https://openalex.org/W2541604120",
        "https://openalex.org/W2567225061",
        "https://openalex.org/W4250405591",
        "https://openalex.org/W2056693201",
        "https://openalex.org/W2146395926",
        "https://openalex.org/W2127977070",
        "https://openalex.org/W2157754281",
        "https://openalex.org/W1544173589",
        "https://openalex.org/W1569638374",
        "https://openalex.org/W2534384520",
        "https://openalex.org/W2541376187",
        "https://openalex.org/W2099064239",
        "https://openalex.org/W2120336633",
        "https://openalex.org/W3215683369",
        "https://openalex.org/W2168842454",
        "https://openalex.org/W2211696645",
        "https://openalex.org/W2138622826"
    ],
    "abstract": "Silicon planar and three-dimensional inductors and transformers were designed and characterized on-wafer up to 100 GHz. Self-resonance frequencies (SRFs) beyond 100 GHz were obtained, demonstrating for the first time that spiral structures are suitable for applications such as 60-GHz wireless local area network and 77-GHz automotive RADAR. Minimizing area over substrate is critical to achieving high SRF. A stacked transformer is reported with S/sub 21/ of -2.5 dB at 50 GHz, and which offers improved performance and less area (30 /spl mu/m/spl times/30 /spl mu/m) than planar transformers or microstrip couplers. A compact inductor model is described, along with a methodology for extracting model parameters from simulated or measured y-parameters. Millimeter-wave SiGe BiCMOS mixer and voltage-controlled-oscillator circuits employing spiral inductors are presented with better or comparable performance to previously reported transmission-line-based circuits.",
    "full_text": "IEEE TRANSACTIONS ON MICROW A VE THEORY AND TECHNIQUES, VOL. 53, NO. 1, JANUARY 2005 123\n30–100-GHz Inductors and Transformers for\nMillimeter-Wave (Bi)CMOS Integrated Circuits\nTimothy O. Dickson, Student Member, IEEE, Marc-Andre LaCroix, Member, IEEE, Samuel Boret, Daniel Gloria,\nRudy Beerkens, Member, IEEE, and Sorin P. V oinigescu, Senior Member, IEEE\nAbstract— Silicon planar and three-dimensional inductors and\ntransformers were designed and characterized on-wafer up to\n100 GHz. Self-resonance frequencies (SRFs) beyond 100 GHz were\nobtained, demonstrating for the ﬁrst time that spiral structures\nare suitable for applications such as 60-GHz wireless local area\nnetwork and 77-GHz automotive RADAR. Minimizing area over\nsubstrate is critical to achieving high SRF. A stacked transformer\nis reported with\n/50/49 of\n 2.5 dB at 50 GHz, and which offers im-\nproved performance and less area /40 30\n m\n 30\n m/41 than planar\ntransformers or microstrip couplers. A compact inductor model is\ndescribed, along with a methodology for extracting model param-\neters from simulated or measured\n-parameters. Millimeter-wave\nSiGe BiCMOS mixer and voltage-controlled-oscillator circuits\nemploying spiral inductors are presented with better or compa-\nrable performance to previously reported transmission-line-based\ncircuits.\nIndex Terms— Inductors, millimeter wave, mixer, self-resonance\nfrequency (SRF), stacked inductors, transformers, voltage-con-\ntrolled oscillator (VCO).\nI. I NTRODUCTION\nR\nECENTLY , silicon technologies have become a viable\noption for millimeter-wave and high-speed digital cir-\ncuits with data rates above 40 Gb/s. The potentially large\nconsumer markets have attracted considerable interest in\n60-GHz wireless local area network (WLAN) and 77-GHz\ncollision avoidance automotive RADAR, resulting in 60-GHz\nlow-noise ampliﬁers (LNAs), power ampliﬁers, and mixers\n[1], and 80-GHz voltage-controlled oscillators (VCOs) [2]\nimplemented using SiGe HBT technologies. Furthermore, the\ndemonstration of very high-speed SiGe HBT digital building\nblocks [3] paves the way for highly integrated serial com-\nmunication transceivers with data rates exceeding 100 Gb/s.\nWireless and wireline building blocks reported to date that\noperate in the millimeter-wave regime rely on microstrip trans-\nmission lines for on-chip matching networks and inductive\npeaking. However, this approach proves to be area intensive,\nas quarter-wavelengths in silicon dioxide at 60 and 80 GHz\nManuscript received April 21, 2004; revised August 31, 2004. This work was\nsupported in part by Micronet under Contract C.2.T1. The work of T. O. Dickson\nwas also supported by the Natural Sciences and Engineering Research Council\nof Canada.\nT. O. Dickson and S. P. V oinigescu are with the Department of Electrical and\nComputer Engineering, University of Toronto, Toronto, ON, Canada M5S 3G4\n(e-mail: tod@eecg.toronto.edu).\nM.-A. LaCroix and R. Beerkens are with STMicroelectronics, Ottawa, ON,\nCanada K2H 8R6.\nS. Boret and D. Gloria are with STMicroelectronics, F-38926 Crolles Cedex,\nFrance.\nDigital Object Identiﬁer 10.1109/TMTT.2004.839329\nare approximately 630 and 470\n m, respectively. Given the\nprohibitive mask and fabrication costs in the deep-submi-\ncrometer technologies at which silicon becomes commercially\nfeasible for millimeter-wave circuits, area consumption should\nbe minimized if inexpensive components are to be realized.\nWhile monolithic spiral inductors and transformers have been\nvery popular in silicon-based technologies at microwave fre-\nquencies, their application in millimeter-wave circuits has not\nbeen investigated. Mutual coupling in spiral coils allows for\nlarger inductance in less area than transmission-line structures.\nFurthermore, the increasing number of metal layers available\nin (Bi)CMOS technologies facilitates the design of three-di-\nmensional (or stacked) inductors and transformers reminiscent\nof discrete components found at lower frequencies.\nThis paper reports inductors and transformers suitable\nfor millimeter-wave applications [4]. Design guidelines for\nplanar and stacked millimeter-wave inductors are described\nin Section II. Section III examines planar and stacked mil-\nlimeter-wave transformer structures. A stacked transformer is\nintroduced that is ideal for single-ended-to-differential conver-\nsion above 40 GHz. A wide-band inductor model is presented\nin Section IV , along with a methodology for model parameter\nextraction. Finally, as examples of millimeter-wave circuits\nemploying spiral inductors, the ﬁrst dc-to-50-GHz broad-band\nmixer and the ﬁrst inductor-based 40-GHz VCO are reported\nin Section V .\nII. I\nNDUCTORS\nA. Millimeter-Wave Design Considerations\nFor silicon-based inductors in the millimeter-wave regime,\nloss in the silicon substrate is the dominant mechanism for\ndegradation in the quality factor [5]. We propose that, to\nminimize these losses, an inductor footprint be made as small\nas possible. This involves reducing outer diameter, as well as\nmetal linewidth. While inductor design at radio frequencies em-\nphasizes the use of wide metal lines to reduce series resistances,\nthis approach increases capacitance to substrate and reduces the\nself-resonance frequency (SRF). Circuits employing inductors\nshould operate below the peak-\nfrequency of the inductor in\norder to ensure proper behavior, which emphasizes the need for\nhigh SRF. In our designs, reliability concerns due to dc electro-\nmigration effects set the lower limit on linewidth. Turn-to-turn\nspacing is made roughly equal to the dielectric thickness to\nsubstrate to lessen the impact of interwinding capacitances\nand further improve SRF. Wide metal spacing also diminishes\n0018-9480/$20.00 © 2005 IEEE\n124 IEEE TRANSACTIONS ON MICROW A VE THEORY AND TECHNIQUES, VOL. 53, NO. 1, JANUARY 2005\nFig. 1. /76\n for planar millimeter-wave inductors measured using 50- and\n100-GHz network analyzers.\nTABLE I\nDESIGNED VERSUS MEASURED PLANAR INDUCTOR PERFORMANCE\nthe frequency dependence of the inductance set forth by the\nproximity effect [6].\nB. Planar Inductors\nBased on the discussion in Section II-A, a family of square\nand symmetric [7] planar inductors was designed using ASITIC\n[8] and implemented in a six-layer copper CMOS back-end\n[9]. Inductance values range from 100 to 300 pH with outer\ndiameters between 30 –50\nm. Inductors were measured up to\n100 GHz in Crolles, France, and up to 50 GHz in Ottawa, ON,\nCanada. Cable and probe losses are corrected using load-reﬂect\nmatch (LRM) calibrations with the network analyzer. Further-\nmore,\n-parameters for open and short test structures are mea-\nsured and deembedded to correct for pad capacitances, lead in-\nductances, and lead resistances, which can add on the order\nof 40 fF, 50 pH, and 1\n, respectively, to each port. Fig. 1\ndemonstrates the effective inductance measured using the 50-\nand 100-GHz network analyzers and extracted as\n(1)\nIn all cases, the measured inductance was within\n 5% of the\ntarget value, as summarized in Table I. Slight dips in\n are\nseen close to 90 GHz in all cases, which underscore the dif-\nﬁculty in measuring and deembedding such small inductance\nvalues at very high frequencies. Measurements indicate that the\nSRF is well beyond 100 GHz in all cases. To the authors ’best\nknowledge, this marks the ﬁrst veriﬁcation of ASITIC in the\nmillimeter-wave regime.\nFig. 2. Measured /76\n versus frequency for 200-, 370-, 400-, and 600-pH\nmillimeter-wave stacked inductors.\nFig. 3. Measured /76\n for 220-pH planar and stacked millimeter-wave\ninductors.\nC. Stacked Inductors\nFurther reduction in area is achieved using three-dimensional\nstructures [10]. These structures beneﬁt from strong mutual cou-\npling between vertically adjacent metal layers, and can generate\nthe same inductance in less area as compared with planar induc-\ntors. Stacked inductors implemented in two or three metal layers\nwere designed with inductance values between 200–600 pH and\nwith outer diameters ranging from 20 to 40\nm.\n extracted\nfrom measured 50-GHz data is presented in Fig. 2.\nEffective inductances for a planar and stacked inductor with\nrespective outer diameters of 36 and 18\n m are shown in Fig. 3.\nIn both cases, self-resonance is beyond the measurement capa-\nbility. Results indicate that comparable inductance (\n220 pH)\nin the millimeter-wave regime can be obtained using stacked in-\nductors with signiﬁcant area reduction over planar inductors. A\ndie photograph of the 220-pH stacked inductor, with two turns\nin metal 6 and two turns in metal 5, is presented in Fig. 4.\nAs with planar inductors, reducing area over substrate is para-\nmount in increasing the SRF of stacked inductors. Two stacked\ninductors of similar inductance were designed, the ﬁrst using\nthe top two metal layers with an outer diameter of 30\nm and\nthe second using the top three metal layers with a 21-\n m diam-\neter. The smaller inductor footprint results in an improved SRF,\nDICKSON et al.:3 0–100-GHz INDUCTORS AND TRANSFORMERS FOR MILLIMETER-W A VE (Bi)CMOS INTEGRATED CIRCUITS 125\nFig. 4. Die photograph of 220-pH two-metal stacked inductor. Inductor is\nformed with two turns in metal 6 and two turns in metal 5. The outer diameter\nis 18 /22 m.\nFig. 5. Measured /76\n and /81 of 420-pH stacked inductors implemented in\ntwo and three metal layers.\nas seen in the measured\n of Fig. 5. The nearly 50% reduc-\ntion in total area with more metal layers yields higher SRF, even\nthough the bottom metal layer is slightly closer to the substrate.\nThe effective inductor quality factor is extracted as\n(2)\nIt is noted that attempts to implement stacked inductors at lower\nfrequencies (below 10 GHz) have resulted in low quality factors,\non the order of 2–3 [11] due to additional via resistance. How-\never, as seen in Fig. 5, the quality factor for millimeter-wave in-\nductors is actually improved by adding more metal layers. While\nthe two-metal inductor has a peak\nof approximately 13, the\nof the three-metal inductor exceeds 15 and has yet to peak at\n50 GHz. This underscores the importance of minimizing sub-\nstrate losses, not series losses, to improve inductor performance\nat frequencies above 10 GHz.\nD. Impact of CMP Integrity Fill\nIn sub-0.18-\nm production technologies with multimetal\nbackends, dummy metal patterns (as seen from the die photo-\ngraph in Fig. 6) are required to preserve chemical mechanical\nplanarization (CMP) integrity. While placement of these struc-\ntures is usually automated by computer-aided design (CAD)\ntools, the layout designer can often specify an exclusion region\nto prevent dummy ﬁll from being generated in or around in-\nductors. Test structures were designed to assess the impact of\nvarying the spacing of dummy ﬁll from a 160-pH square in-\nductor. Less than 5-pH variation, well within the measurement\nFig. 6. Metal ﬁll patterns for chemical –mechanical planarization integrity\nnear millimeter-wave inductors and transformers in a production 0.13-/22 m SiGe\nBiCMOS technology.\nFig. 7. Effect of ﬁll pattern proximity on measured /76\n .\naccuracy, is observed (Fig. 7) as the distance from inductor edge\nto ﬁll pattern is changed. Reducing ﬁll proximity eases layout\nrequirements for circuits employing inductors in state-of-the-art\nsilicon technologies.\nIII. M ILLIMETER-WAV ETRANSFORMERS\nWhile differential circuit topologies are vital to improve\nnoise immunity in integrated circuits, they often call for the\ngeneration of differential signals from single-ended sources.\nHigh-speed current-mode logic (CML) or emitter coupled\nlogic (ECL) digital circuits require differential clocks, but only\nsingle-ended signal generators are available above 40 GHz.\nIn a wireless system, a single-ended-to-differential converter\nbetween a single-ended LNA and a doubly balanced mixer\nmust have low loss to mitigate its impact on the noise ﬁgure of\na receiver. At lower frequencies, conversion can be achieved\nvia an active balun, or a differential pair with the unused input\nterminated off chip. However, at millimeter-wave frequencies,\npoor common-mode rejection renders this approach ineffective,\nas the differential outputs exhibit amplitude mismatch and\nphase misalignment. While other approaches have relied on\na rat-race coupler for conversion at 80 GHz [12], the area\noccupied by such a coupler is substantial\n250\n m\n 800\n m\n .\nAn on-chip transformer is ideal for single-ended-to-differential\nconversion, but has not been attempted in the millimeter-wave\nregime.\n126 IEEE TRANSACTIONS ON MICROW A VE THEORY AND TECHNIQUES, VOL. 53, NO. 1, JANUARY 2005\nFig. 8. Die photograph of millimeter-wave planar transformer. Outer diameter\nis 45 /22 m.\nFig. 9. Die photograph of millimeter-wave stacked transformer. The primary\nis formed in metal 6 with metal 5 crossovers, while the secondary is formed in\nmetal 4 with metal 3 crossovers. Outer diameter is 30 /22 m.\nTwo transformer structures have been investigated for mil-\nlimeter-wave applications. The ﬁrst, a planar transformer, em-\nploys symmetrical inductors for the primary and secondary, as\nseen in the die photograph of Fig. 8. Both windings are formed\nin metal 6 with metal 5 crossovers. To ensure adequate SRF in\nthe primary and secondary, the design follows the guidelines set\nforth in Section II. This transformer, with an outer diameter of\n45\nm, has been utilized to generate differential 43-GHz clocks\nfrom a single-ended signal source in a 43-Gb/s decision circuit\n[13]. However, the coupling coefﬁcient predicted by ASITIC is\nonly 0.5.\nHigher coupling can be achieved through the use of stacked\nstructures. A second transformer was implemented by vertically\nstacking two symmetrical inductors, each with two turns. The\nprimary is formed in metal 6 with metal 5 crossovers, while the\nsecondary is formed in metal 4 with metal 3 crossovers. The\nouter diameter of the stacked transformer shown in Fig. 9 is\n30\nm, making it more area ef ﬁcient than the planar structure\nwhile achieving a higher ASITIC-predicted coupling coefﬁcient\n. While test structure layout prevents a comparison of\ndifferential transformer outputs, excellent phase and amplitude\nmatching is expected due to the perfect symmetry of the layout.\nFig. 10 compares the measured and simulated input–output cou-\npling\nof both transformers. The stacked transformer has ap-\nproximately 5-dB better coupling than the planar transformer\nover the measured frequency range. Furthermore, the low loss\nFig. 10. Measured (symbols) and ASITIC-simulated (lines) coupling of\nmillimeter-wave stacked and planar transformers.\nFig. 11. Compact broad-band inductor model.\n(\n 2.5 dB at 50 GHz) makes this structure well suited for wire-\nless applications.\nIV . COMPACT MODELING\nA. Inductor Equivalent Circuit\nAccurate inductor and transformer modeling is essential to\nsuccessful millimeter-wave circuit design. It is imperative that\na model not only capture all relevant energy loss mechanisms,\nbut also accurately represent the equivalent capacitances. Inade-\nquate capacitance modeling leads to poor prediction of the SRF\nand, when applied to millimeter-wave LC tuned circuits, can\nshift center frequencies by at least 10%. A single-\nequivalent\ncircuit is inadequate, as half of the capacitance to substrate is ar-\ntiﬁcially neglected in simulations if one terminal of the inductor\nis connected to a small-signal ground. Instead, the distributed\nnature of the spiral structure is better described by the double-\nequivalent circuit of Fig. 11 [6].\nFor the model to be applicable over wide bands, the frequency\ndependence of the various loss mechanisms must be accurately\ncaptured. At millimeter wavelengths, the substrate must be mod-\neled as a distributed RC network, as the period of the wave is\nless than the dielectric relaxation time of the substrate. This\nis true for all frequencies above approximately 15 GHz on a\n10-\ncm silicon substrate. Furthermore, the skin effect con-\nﬁnes carriers to the surface of the conductor, leading to increased\nloss at high frequencies. This can be modeled by a ladder net-\nwork consisting of\nand\n shunting\n . Additionally, series\nlosses are exacerbated by current crowding due to the proximity\neffect. As mentioned in Section II, turn spacing is increased in\nmillimeter-wave inductors to lessen the impact of the proximity\neffect.\nDICKSON et al.:3 0–100-GHz INDUCTORS AND TRANSFORMERS FOR MILLIMETER-W A VE (Bi)CMOS INTEGRATED CIRCUITS 127\nModel parameters for the double-\n equivalent circuit are ob-\ntained by direct extraction from ASITIC simulations, or from\nmeasurements, as follows. At low frequencies (less than 1 GHz),\nseries inductances and resistances are extracted from\nas\n(3)\nand\n(4)\nOxide capacitances and substrate resistances for a single-\nequivalent circuit are extracted as\n(5)\n(6)\n(7)\nand\n(8)\nThe corresponding double-\n parameters can then be readily de-\ntermined as follows:\n(9)\n(10)\n(11)\n(12)\n(13)\n(14)\nThe substrate capacitances\n ,\n , and\n are deter-\nmined from the dielectric relaxation time of the substrate and\ntheir associated substrate resistances\n ,\n , and\n, respectively, such that\n(15)\nwhere\n is the relative permittivity of the substrate (11.7 for\nsilicon),\n is the permittivity of free space, and\n is the sub-\nstrate resistivity in\n m [5].\nSeries inductance and skin-effect parameters\n ,\n ,\n , and\nare optimized to obtain broad-band agreement between the\nequivalent circuit and ASITIC-generated or measured\n -param-\neters. The resulting\n of the double-\n model should produce\nthe low-frequency inductance and resistance given by (3) and\n(4).\ncan be optimized concurrently with these parameters.\nHowever, if the total line length is less than approximately one-\nFig. 12. Measured (solid lines) and modeled (dashed lines) /76\n as a function\nof frequency up to 100 GHz.\ntenth of a wavelength, the difference in potential along the line\nis small, as is the electrical energy stored by\n . Hence, it does\nnot play a signiﬁcant role in the inductor model. This does not\napply to a differential inductor, as large potential differences can\nbe observed between the two terminals of the inductor.\nB. Model Veriﬁcation\nThe compact inductor model is applicable to both planar\nand stacked millimeter-wave inductors. Models were extracted\nfrom ASITIC simulations up to 100 GHz for the family of\nplanar inductors presented in Section II, and are compared with\n100-GHz measurements in Fig. 12. While the ASITIC-based\nmodels concur with measured data at lower frequencies, dis-\ncrepancies are noticed above 50 GHz. In all cases, the dc\nresistance predicted by ASITIC is less than 3.5\n, which calls\nfor careful layout of open and short deembedding structures to\nminimize lead resistance. Further investigations focusing on\ndeembedding techniques and measurement error above 40 GHz\nare needed to conclude whether measurements or simulations\nare responsible for disparities.\nASITIC simulations of the 400-pH three-layer stacked in-\nductor introduced in Section II are compared in Fig. 13 with\nmeasured data. Simulations were performed at two extreme\nprocess corners to illustrate the impact of\n10% variability\nin backend processing. The ﬁrst process corner includes low\nmetal sheet resistances and via resistances, along with thicker\ninterlevel dielectrics to represent a “high-\n ” process corner,\nwhile the “low-\n ” corner uses high resistances and thinner\ndielectrics such that the inductor is closer to the substrate. It is\nnoted that the high-\n process corner results in\n 10 GHz better\nSRF and a signiﬁcant (40%) improvement in\n .\nEquivalent circuit parameters for a two-metal 400-pH\nstacked inductor were extracted from\n -parameters measured\nup to 50 GHz. Excellent agreement between measured and\nmodeled effective inductance and quality factor is shown in\nFig. 14 and demonstrates the applicability of the compact\ninductor model at millimeter waves.\n128 IEEE TRANSACTIONS ON MICROW A VE THEORY AND TECHNIQUES, VOL. 53, NO. 1, JANUARY 2005\nFig. 13. Measured (symbols) and ASITIC-simulated /76\n and /81 for\na 400-pH inductor implemented by stacking three metal layers in series.\nSimulations for a “high-/81 ” low metal and via resistance, thick dielectric\nprocess corner (solid), and a “low-/81 ” high metal and via resistance thin\ndielectric process corner (dashed) are shown.\nFig. 14. Measured (symbols) and modeled (lines) /76\n and /81 for a 400-pH\nmultimetal inductor implemented by stacking two metals in series.\nV. MILLIMETER-WAV ECIRCUITS\nWhile common in lower frequency RF designs, inductors\nhave not been considered to date in millimeter-wave appli-\ncations. However, both broad- and narrow-band circuits can\nbeneﬁt from their use. In broad-band applications, peaking\ninductors can extend the bandwidth of resistively loaded am-\npliﬁers by up to approximately 40%. For a given bandwidth,\ncurrent consumption can be traded off for inductance, which\naids in the design of low-power transceivers. Furthermore, given\nthe need to reduce inductor footprint to maximize inductor\nperformance at millimeter-wave frequencies, the additional\narea occupied is not as exorbitant as it is at RF frequencies.\nIn millimeter-wave tuned circuits, a number of silicon-based\ndesigns presented to-date (e.g., [1], [2]) make extensive use of\ntransmission-line resonators. However, replacing transmission\nlines with inductors can reduce chip dimensions and facilitate\nthe production of low-cost components. This paper demon-\nstrates for the ﬁrst time that inductors can be used in these\napplications without degrading performance.\nTo further prove the applicability of these inductors and\ntransformers at millimeter-wave frequencies, a variety of mil-\nlimeter-wave circuits have been designed and fabricated in a\nFig. 15. Block diagram of a dc-to-50-GHz broad-band mixer with\ntransimpedance preampliﬁers and BiCMOS Gilbert multiplier.\nFig. 16. Circuit schematic of BiCMOS Gilbert multiplier cell, with n-MOS\ntransconductors and SiGe HBT mixing quad.\nFig. 17. Available gain and minimum noise ﬁgure versus current at 36 GHz\nfor an SiGe HBT cascode (solid) and MOS-HBT cascode (dashed line). Device\nsizes are 0.2 /22 m /2 5 /22 m for the SiGe HBTs, and 12 /2 2 /22 m /2 0.13 /22 m\nfor the /110 -channel MOSFETs. Selection of the bias point for maximum gain\nis illustrated for both cascodes, along with the current variation that can be\ntolerated before 1-dB compression occurs.\nproduction 0.13-\n m SiGe BiCMOS technology with 150-GHz\nSiGe HBT from STMicroelectronics, Crolles, France [9].\nFrom these, the ﬁrst dc-to-50-GHz broad-band mixer and the\nﬁrst inductor-based VCO at 40 GHz are discussed below as\nDICKSON et al.:3 0–100-GHz INDUCTORS AND TRANSFORMERS FOR MILLIMETER-W A VE (Bi)CMOS INTEGRATED CIRCUITS 129\nFig. 18. Circuit schematic of a broad-band BiCMOS 50- /10 output driver employing millimeter-wave spiral inductors.\ntypical broad- and narrow-band millimeter-wave circuits that\nbeneﬁt from the reduced area afforded by the use of inductors.\nAdditionally, an application of the planar millimeter-wave\ntransformer presented in Section III can be found in [13].\nA. Broad-Band Mixer\nFig. 15 shows a block diagram of a novel dc-to-50-GHz\nbroad-band mixer, which can be used both as an upconverter\nor downconverter. The circuit consists of a BiCMOS Gilbert\nmultiplier-cell low-noise transimpedance preampli ﬁers with\nbroad-band 50-\nimpedance match on the input and local os-\ncillator (LO) paths [12], and a 50-\n output driver with 50-GHz\nbandwidth.\nThe BiCMOS Gilbert cell, shown in Fig. 16, expounds upon\na novel BiCMOS cascode, which has been shown to have ex-\ncellent performance for millimeter-wave applications due to the\nlow gate resistance of the MOSFET and low-output capacitance\nof the SiGe HBT [13] while operating with lower supply volt-\nages. The topology consists of MOS transconductors and an\nSiGe HBT switching quad, the latter of which reduces the re-\nquired LO power. As will be proven, this BiCMOS topology is\nideal for satisfying low-noise and high-linearity requirements\nsimultaneously.\nTo illustrate the design methodology for the mixer, the avail-\nable gain\nand minimum noiseﬁgure\n of the HBT\nand BiCMOS cascodes as a function of the collector/drain cur-\nrent are compared in Fig. 17. The bias current is selected such\nthat the gain is maximized at 36 GHz, as shown in this ﬁgure.\nThis results in lower noise when a MOS transconductor is em-\nployed since\nis minimized at approximately the same\ncurrent density at which\n peaks for this device [14]. Addition-\nally, larger current variations can be tolerated in the BiCMOS\ncascode before the gain is reduced by 1 dB, indicating better lin-\nearity. To optimize the linearity and bandwidth, the MOS tran-\nsistors are biased at the peak-\ncurrent density, with transistor\ngatewidth (\n ) given by\n(16)\nThe peak-\n current density of the\n -channel MOSFET\n is\napproximately 0.25–0.3 mA per micrometer of gatewidth, irre-\nspective of technology for CMOS generations below the 0.5-\nm\ntechnology node [15]. For high-speed large-signal operation,\nSiGe HBT differential pairs are biased at a tail current corre-\nsponding to roughly 1.5 times the peak\ncurrent density for\nthe device [15]. In a mixing quad, the appropriate emitter length\nis then related to the tail current of the Gilbert multiplier as\n(17)\nHere, the peak-\n current density\n mA\n m\n of the\nSiGe HBT is technology dependent.\nThe frequency-dependent voltage conversion gain of the in-\nductively-peaked mixer is given by\n(18)\nwhere the load capacitance\n includes the transistor output\ncapacitance and external loading. The peaking inductance\ncan be chosen to give maximum bandwidth extension [16]\n(19)\nIt is noted that this choice of\n will result in gain peaking.\nWhile the mixer is broad-band in the sense that it can operate\nas an upconverter or downconverter from dc to 50 GHz, the\ninput and output signals are relatively narrow-band (less than\n10 GHz) and the peaking in frequency response can be tolerated\nas long as the signal bandwidth is within the 3-dB bandwidth\nof the mixer. Inductively peaking the output node allows for\nbandwidth extension without increasing power consumption.\nExpounding on the novel BiCMOS cascode topology, a\ndifferential output driver (Fig. 18) has been designed to have\n50-GHz bandwidth while driving an external 50-\nload. Al-\nthough originally intended as an output driver in broad-band\nserial communication circuits, the driver was applied to the\nmixer test circuit. The output swing can be adjusted by varying\n130 IEEE TRANSACTIONS ON MICROW A VE THEORY AND TECHNIQUES, VOL. 53, NO. 1, JANUARY 2005\nFig. 19. Die photograph of the broad-band mixer with preampliﬁers and output\ndriver. The circuit employs 20 millimeter-wave inductors, each smaller than a\n55 /22 m /2 70 /22 m pad, and occupies a total area of 720 /22 m /2 720 /22 m.\nFig. 20. Measured single-ended /115 -parameters of the mixer operating as an\nampliﬁer. The ampliﬁer has 8 dB of gain at 50 GHz.\nthe bias current in the driver. Using a BiCMOS cascode as\nthe ﬁrst stage of the driver enables high bandwidth while\noperating from a lower supply voltage than can be attained\nin pure-bipolar topologies [13]. Furthermore, unlike the SiGe\nHBT, the MOSFET input capacitance is not strongly dependent\non the bias point and, hence, the current can be widely varied\nwithout degrading bandwidth. The second stage requires a\n50-\nload resistance for broad-band output matching. This,\nalong with the desired output swing, dictates the bias current in\nthe second stage. To maximize output swing, a bipolar inverter\noutput stage is used instead of a cascode. Resistive degen-\neration is employed to lessen the gain and input capacitance\nvariation with bias current. Inductive peaking is added to the\nBiCMOS cascode inverter to improve its bandwidth. Addition-\nally, shunt-series peaking at the output prevents the\n40-fF\nparasitic pad capacitance from limiting bandwidth [14].\nAs seen from the die photograph in Fig. 19, each of the 20\nmillimeter-wave inductors is smaller than a 55\n m\n 70\n m\nbond pad. Despite the large number of inductors, the circuit oc-\ncupies an area of only 720\n m\n 720\n m, and is pad limited. The\nmeasured small-signal single-ended\n -parameters of the mixer\noperating as an ampli ﬁer are illustrated in Fig. 20. Input and\noutput return loss is better than\n 9 dB up to 50 GHz, and the\nsingle-ended gain is better than 8 dB over the measured range.\nFig. 21. Measured output spectrum of the mixer operating as an upconverter\nwith /0 40-dBm 5-GHz IF input and 43-GHz LO. Cable and probe losses have\nnot been deembedded.\nFig. 22. Circuit schematic of 40-GHz Colpitts VCO. Inductors /76\n , /76\n , and\n/76\n are implemented with on-chip spiral inductors.\nThe measured output spectrum of the mixer working as an up-\nconverter with a\n 40-dBm 5-GHz input signal and 43-GHz LO\nsignal is shown in Fig. 21. As seen in Fig. 20, there is a 5-dB\ndifference in measured gain between the lower sideband (LSB)\nfrequency of 38 GHz and the upper sideband (USB) frequency\nof 48 GHz. This, combined with the additional 7 dB of cable\nand probe losses at 48 GHz, accounts for the higher spectral\npower observed in the LSB of Fig. 21. The mixer with input\npreampliﬁer, LO buffer, and output driver consumes 195 mW\nfrom a 2.5-V supply, including only 15 mW from the mixer\ncore. Even though MOSFETs, with a lower\nthan either SiGe\nor InP HBTs, are used as transconductors in the Gilbert cell,\nthe mixer still has higher bandwidth than the fastest reported\ndc-to-40-GHz InP HBT mixer and operates from a lower supply\nvoltage [17].\nDICKSON et al.:3 0–100-GHz INDUCTORS AND TRANSFORMERS FOR MILLIMETER-W A VE (Bi)CMOS INTEGRATED CIRCUITS 131\nFig. 23. Die photograph of the 40-GHz Colpitts VCO. The total chip area is\n540 /22 m /2 490 /22 m, and the VCO core occupies an area of 250 /22 m /2 180 /22 m.\nFig. 24. On-wafer measured SSB phase noise of the 40-GHz VCO. The phase\nnoise is /0 100.0 dBc/Hz at a 1-MHz offset.\nB. Millimeter-Wave VCO\nA Colpitts VCO was also designed to prove the advantage\nof using inductors to reduce area and power dissipation while\nmaintaining low phase noise. The schematic of a varactor-tuned\nColpitts VCO is shown in Fig. 22. The differential 40-GHz VCO\nuses eight planar inductors, including tank inductor\n, which\nhas an ASITIC-predicted\n of 15 at 40 GHz. The addition of\ndegeneration inductor\n reduces phase noise systematically\nby 3–4 dB [18]. Consequently, power consumption can be re-\nduced if bias current is traded for inductance to achieve a target\nphase-noise speciﬁcation. Inductor\nprevents the injection\nof high-frequency noise from current source\n into the tank,\nthus improving phase noise [19].\nA die photograph of the VCO is shown in Fig. 23. It occu-\npies an area of 540\n m\n 490\n m, which is less than half the\narea of a similar 40-GHz VCO employing transmission-line res-\nonators [2]. Moreover, the chip area is limited by the spacing be-\ntween bias and high-frequency pads, which was dictated by the\nprobes available for measurements. The VCO core area is only\n250\nm\n 180\n m. The measured single-sideband phase noise\nof\n 100.0 dBc/Hz at a 1-MHz offset from a 38-GHz funda-\nmental (Fig. 24) is comparable to that achieved in transmission-\nFig. 25. Measured tuning range of the 40-GHz VCO. The oscillator is tunable\nover a 5-GHz band.\nline based VCOs [2], [20]. Phase-noise measurements were per-\nformed on-wafer using standard power supplies. From circuit\nsimulations, the expected phase noise was\n101.0 dBc/Hz. The\nmeasured center frequency of 41 GHz is in excellent agreement\nwith the value of 40.5 GHz predicted by SPECTRE simulations.\nThe VCO has a 5-GHz tuning range, as seen in Fig. 25, with a\nVCO gain of 3 GHz/V . The tuning range is less than the expected\n7-GHz value, and is attributed to the lower capacitance ratio of\nthe MOS accumulation-mode varactor than that given by the\nmodel. The VCO delivers\n1 dBm (including cable, probe, and\ndc blocking capacitor losses) to a 50-\n load while consuming\n85 mW from a 4.3-V supply. These results demonstrate that\ntuned circuits utilizing spiral inductors yield well-predicted be-\nhavior in the millimeter-wave regime without post-fabrication\ntuning, as in [2].\nVI. C\nONCLUSION\nFor the ﬁrst time, inductors and transformers have been\nreported with adequate SRF for millimeter-wave applications\nin silicon-based integrated circuits. The inductor footprint must\nbe minimized to obtain high SRF, making these inductors\nmuch more area ef ﬁcient than transmission-line resonators for\nuse in deep submicrometer technologies. A compact inductor\nmodel has been presented, along with a methodology for model\nextraction based on measured or simulated\n-parameters.\nTheir small size allows for the integration of a large number\nof millimeter-wave inductors to extend circuit bandwidth\nwhile reducing power dissipation and chip area. Measured\nresults of the ﬁrst dc-to-50-GHz broad-band mixer and 40-GHz\nVCO with integrated inductors demonstrate the applicability\nof spiral structures in the millimeter-wave range. The mixer\noperates over a wider frequency range than previously re-\nported broad-band mixers while being biased from a lower\nsupply voltage. Furthermore, the Gilbert cell employed in the\nbroad-band mixer demonstrates for the ﬁrst time the bene ﬁts\nof a true BiCMOS topology for high-linearity, low-noise, and\nlow-power millimeter-wave circuits. Measured VCO results are\ncomparable to those reported in transmission-line VCOs while\noccupying less chip area and requiring no post-fabrication\ntuning.\n132 IEEE TRANSACTIONS ON MICROW A VE THEORY AND TECHNIQUES, VOL. 53, NO. 1, JANUARY 2005\nACKNOWLEDGMENT\nThe authors gratefully acknowledge the support of\nS. McDowall, B. Sautreuil, and STMircoelectronics, Crolles,\nFrance, for fabrication. The authors also extend special thanks\nto B. Prokes, STMicroelectronics, Ottawa, ON, Canada, for\nmeasurement assistance.\nR\nEFERENCES\n[1] S. Reynolds, B. Floyd, U. Pfeiffer, and T. Zwick, “60 GHz transceiver\ncircuits in SiGe bipolar technology, ” in Int. Solid-State Circuits Conf.\nTech. Dig., Feb. 2004, pp. 442–443.\n[2] H. Li and H.-M. Rein, “Millimeter-wave VCOs with wide tuning range\nand low phase noise, fully integrated in a SiGe bipolar technology,”IEEE\nJ. Solid-State Circuits, vol. 38, no. 2, pp. 184–191, Feb. 2003.\n[3] M. Meghelli, “A 108-Gb/s 4 : 1 multiplexer in 0.13 /22 m SiGe-bipolar\ntechnology,” in Int. Solid-State Circuits Conf. Tech. Dig., Feb. 2004, pp.\n236–237.\n[4] T. O. Dickson, M.-A. LaCroix, S. Boret, D. Gloria, R. Beerkens, and\nS. P. V oinigescu,“Si-based inductors and transformers for 30–100 GHz\napplications,” in IEEE MTT-S Int. Microwave Symp. Dig., Jun. 2004, pp.\n205–208.\n[5] S. P . V oinigescu, D. Marchesan, J. L. Showell, M. C. Maliepaard, M.\nCudnoch, M. G. M. Schumacher, M. Herod, D. J. Walkey, G. E. Bab-\ncock, P. Schvan, and R. A. Hadaway, “Process- and geometry-scalable\nbipolar transistor and transmission line models for Si and SiGe MMIC’s\nin the 5 –22 GHz range,” in Int. Electron Devices Meeting Tech. Dig. ,\nDec. 1998, pp. 11.7.1–11.7.4.\n[6] Y . Cao, R. A. Groves, X. Huang, N. D. Zamdmer, J.-O. Plouchart, R. A.\nWachnik, T.-J. King, and C. Hu, “Frequency-independent equivalent-\ncircuit model for on-chip spiral inductors,” IEEE J. Solid-State Circuits,\nvol. 38, no. 3, pp. 419–426, Mar. 2003.\n[7] M. Danesh, J. R. Long, R. A. Hadaway, and D. L. Harame, “A /81 -factor\nenhancement technique for MMIC inductors, ” in Proc. IEEE RFIC\nSymp., Apr. 1998, pp. 217–220.\n[8] A. Niknejad, “ASITIC,” Univ. California at Berkeley, Berkeley, CA,\n2002. [Online.] Available: http://rﬁc.eecs.berkeley.edu/~niknejad/asitic.\nhtml.\n[9] M. Laurens, B. Martinet, O. Kermarrec, Y . Campidelli, F. Deleglise,\nD. Dutartre, G. Troillard, D. Gloria, J. Bonnouvrier, R. Beerkens,\nV . Rousset, F. Leverd, A. Chantre, and A. Monroy, “A 150 GHz\n/102\n /61/102\n 0.13 /22 m SiGe : C BiCMOS technology, ” in Proc. IEEE\nBipolar/BiCMOS Circuits Technology Meeting, Sep. 2003, pp. 199–202.\n[10] R. B. Merrill, T. W. Lee, H. You, R. Rasmussen, and L. A. Moberly,\n“Optimization of high-/81 inductors for multilevel metal CMOS,” in Int.\nElectron Devices Meeting Tech. Dig., Dec. 1995, pp. 38.7.1–38.7.4.\n[11] A. Zolfaghari, A. Chan, and B. Razavi, “Stacked inductors and trans-\nformers in CMOS technology,” IEEE J. Solid-State Circuits, vol. 36, no.\n4, pp. 620–628, Apr. 2001.\n[12] T. Suzuki, T. Takahashi, T. Hirose, and M. Takigawa, “A 80-Gbit/s\nD-type ﬂip-ﬂop circuit using InP HEMT technology,” in IEEE GaAs IC\nTech. Symp. Dig., Nov. 2003, pp. 165–168.\n[13] T. O. Dickson, R. Beerkens, and S. P. V oinigescu,“A 2.5-V , 40-Gb/s de-\ncision circuit using SiGe BiCMOS logic,” in IEEE VLSI Circuits Symp.\nDig., Jun. 2004, pp. 206 –209.\n[14] S. P. V oinigescu, M. C. Maliepaard, J. L. Showell, G. E. Babcock, D.\nMarchesan, M. Schroter, P. Schvan, and D. L. Harame,“A scalable high-\nfrequency noise model for bipolar transistors with application to optimal\ntransistor sizing for low-noise ampliﬁer design,”IEEE J. Solid-State Cir-\ncuits, vol. 32, no. 9, pp. 1430–1439, Sep. 1997.\n[15] S. P. V oinigescu, T. O. Dickson, R. Beerkens, I. Khalid, and P. Wester-\ngaard, “A comparison of Si CMOS, SiGe BiCMOS, and InP HBT tech-\nnologies for high-speed and millimeter-wave ICs,” in 5th Silicon Mono-\nlithic Integrated Circuits in RF Systems Topical Meeting, Sep. 2004, pp.\n111–114.\n[16] T. H. Lee, The Design of CMOS Radio-Frequency Integrated Cir-\ncuits. Cambridge, U. K.: Cambridge Press, 1998.\n[17] K. W. Kobayashi, “AD C–40 GHz InP HBT Gilbert multiplier,” in IEEE\nGaAs Integrated Circuits Tech. Symp. Dig., Nov. 2003, pp. 251–254.\n[18] C. Lee, T. Yao, A. Mangan, K. Yau, M. A. Copeland, and S. P.\nV oinigescu, “SiGe BiCMOS 65-GHz BPSK transmitter and 30 to\n122 GHz LC-varactor VCO’s with up to 21% tuning range, ” in IEEE\nCompound Semiconductor IC Symp., Oct. 2004, pp. 179–182.\n[19] E. Hegazi, H. Sjoland, and A. A. Abidi, “A ﬁlter technique to lower LC\noscillator phase noise,” IEEE J. Solid-State Circuits, vol. 36, no. 12, pp.\n1921–1930, Dec. 2001.\n[20] D. K. Shaeffer and S. Kudszus, “Performance-optimized microstrip\ncoupled VCOs for 40-GHz and 43-GHz OC-768 optical transmission,”\nIEEE J. Solid-State Circuits, vol. 38, no. 7, pp. 1130–1138, Jul. 2003.\nTimothy O. Dickson (S’01) received the Bachelor\nof Science (with highest honors) and Master of En-\ngineering degrees in electrical engineering from the\nUniversity of Florida, Gainesville, in 1999 and 2002,\nrespectively, and is currently working toward the\nPh.D. degree at the University of Toronto, Toronto,\nON, Canada.\nFrom 2000 to 2002, he was a Graduate Research\nAssistant with the University of Florida, where he\ninvestigated isolation issues in RF and mixed-signal\nsilicon-based technologies. He has held internships\nin the area of analog and RF circuit design with Dallas Semiconductor\n(now Maxim) and Global Communication Devices. His research interests\nlie in the area of high-frequency integrated circuits for wireless and wireline\ncommunications.\nMr. Dickson was named an undergraduate University Scholar by the Univer-\nsity of Florida in 1999. He was the recipient of the 2004 Best Paper Award pre-\nsented at the Micronet Annual Workshop. He was aﬁnalist in the Student Paper\nCompetition at the IEEE Microwave Theory and Techniques Society (IEEE\nMTT-S) International Microwave Symposium (IMS). He holds a University of\nToronto Doctoral Fellowship and is an Edward S. Rogers Sr. Scholar.\nMarc-Andre LaCroix (S’97–M’02) received the\nBachelor of Science degree in engineering from the\nUniversity of New-Brunswick, Fredericton, NB,\nCanada, in 2000, and the Master of applied science\ndegree in electrical engineering from Carleton\nUniversity, Ottawa, ON, Canada, in 2002.\nFrom 2000 to 2002, he was a Resident Researcher\nwith STMicroelectronics, Ottawa, ON, Canada,\nduring which time he developed millimeter-wave\npassive device models for silicon-based technolo-\ngies. He is currently a Circuit Design Engineer\nwith STMicroelectronics, where he develops millimeter-wave wireless and\nbroad-band wireline integrated circuits in state-of-the-art Si(Ge)-BiCMOS\nprocesses.\n Samuel Boret was born in Malo-les-Bains, France,\non December 23, 1972. He received the Ph.D. degree\nfrom the University of Lille, Lille, France, in 1999.\nIn 1996, he joined the Centre Hyperfr équences et\nSemiconducteurs, University of Lille. As part of his\ngraduate studies, he was involved with monolithic\nintegrated circuits in coplanar technology for appli-\ncations of reception up to 110 GHz. He is currently\nwith Central Research and Development, RF Elec-\ntrical Characterization Group, STMicroelectronics,\nCrolles, France. His main interests include design,\ncharacterization and modeling of RF devices in advanced silicon technologies.\nDICKSON et al.:3 0–100-GHz INDUCTORS AND TRANSFORMERS FOR MILLIMETER-W A VE (Bi)CMOS INTEGRATED CIRCUITS 133\nDaniel Gloria received the Engineering degree in\nelectronics from the École Nationale Sup érieure\nd’Electronique et de Radio électricité, Bordeaux,\nFrance, in 1995, and the M.S.E.E. degree in optics,\noptoelectronics, and microwaves design systems\nfrom the National Polytechnical Institute of Grenoble\n(INPG), Grenoble, France.\nFrom 1995 to 1997, he was an RF Designer Engi-\nneer with ALCATEL Bell Network System Labora-\ntories, Charleroi, Belgium, during which time he was\ninvolved in the development of the cable-phone RF\nfront-end and its integration in hybrid-ﬁber-coax telecommunication networks.\nSince 1997, he has been with Central Research and Development, STMicro-\nelectronics, Crolles, France, as a High Frequency (HF) Research Engineer. His\ninterests are in optimization of active and passive devices for high-frequency\napplications in BiCMOS and CMOS advanced technologies.\nRudy Beerkens (M’91) received the B.Sc. degree\nin electrical engineering from the University of\nWaterloo, Waterloo, ON, Canada, in 1986.\nFrom 1986 to 2000, he was with Nortel Net-\nworks, during which time he was involved in the\nareas of semiconductor manufacturing, BiCMOS\nprocess development, yield enhancement, device\ncharacterization, and reliability. In 2000, he joined\nSTMicroelectronics, Ottawa, ON, Canada, where\nhe currently heads an integrated-circuits design\nteam. His scienti ﬁc interests include high-speed,\nbroad-band, and millimeter-wave integrated circuits.\nSorin P. Voinigescu (S’92–M’91–SM’02) received\nthe M.Sc. degree in electronics from the Polytechnic\nInstitute of Bucharest, Bucharest, Romania, in 1984,\nand the Ph.D. degree in electrical and computer engi-\nneering from the University of Toronto, Toronto, ON,\nCanada, in 1994.\nFrom 1984 to 1991, he was involved with research\nand development and with academia in Bucharest,\nRomania, where he designed and lectured on\nmicrowave semiconductor devices and integrated\ncircuits. From 1994 to 2000, he was with Nortel\nNetworks, Ottawa, ON, Canada, where he was responsible for projects in\nhigh-frequency characterization and statistical scalable compact model devel-\nopment for Si, SiGe, and III –V heterostructure devices. He led the modeling\ninfrastructure development for, and was involved in the prototyping of, wireless\nand broad-band ﬁber-optics transceivers in emerging semiconductor technolo-\ngies. In April 2000, he cofounded Quake Technologies, Ottawa, ON, Canada,\na fabless semiconductor company that focuses on the design and fabrication of\n10- and 40-Gb/s physical layer integrated circuits. In September 2002, he joined\nthe Department of Electrical and Computer Engineering, University of Toronto,\nas an Associate Professor. He has authored or coauthored over 40 refereed\nand invited technical papers spanning the simulation, modeling, design, and\nfabrication of GaAs-, InP-, and Si-based heterostructure devices and circuits.\nHe holds two U.S. patents in these areas. His research and teaching interests\nfocus on the modeling and characterization of very deep-submicrometer semi-\nconductor devices and on novel design techniques and low-voltage low-power\ntopologies for wireless, opticalﬁber, and wireline data communication physical\nlayer integrated circuits in the 10–100-GHz range.\nDr. V oinigescu is a member of the Technical Program Committee of the IEEE\nCompound Semiconductor Integrated Circuit Symposium. He was a corecipient\nof the Best Paper Award presented at the 2001 IEEE Custom Integrated Circuits\nConference."
}