{
    "title": "A NOVEL HIGH-POWER AMPLIFIER USING A GENERALIZED COUPLED-LINE TRANSFORMER WITH INHERENT DC-BLOCK FUNCTION",
    "url": "https://openalex.org/W2100671441",
    "year": 2011,
    "authors": [
        {
            "id": "https://openalex.org/A5040846618",
            "name": "Yongle Wu",
            "affiliations": [
                "Beijing University of Posts and Telecommunications"
            ]
        },
        {
            "id": "https://openalex.org/A5020422392",
            "name": "Yuanan Liu",
            "affiliations": [
                "Beijing University of Posts and Telecommunications"
            ]
        },
        {
            "id": "https://openalex.org/A5057496762",
            "name": "Shun Li",
            "affiliations": [
                "Beijing University of Posts and Telecommunications"
            ]
        },
        {
            "id": "https://openalex.org/A5101843154",
            "name": "Shulan Li",
            "affiliations": [
                "Beijing University of Posts and Telecommunications"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2087367887",
        "https://openalex.org/W2093188259",
        "https://openalex.org/W1977908953",
        "https://openalex.org/W2062037255",
        "https://openalex.org/W2126641225",
        "https://openalex.org/W2097115767",
        "https://openalex.org/W1990407167",
        "https://openalex.org/W2096555514",
        "https://openalex.org/W2164201909",
        "https://openalex.org/W2075392867",
        "https://openalex.org/W2171674682",
        "https://openalex.org/W2109187522",
        "https://openalex.org/W2169419422",
        "https://openalex.org/W2019317388",
        "https://openalex.org/W2113537508",
        "https://openalex.org/W2104183221",
        "https://openalex.org/W1485504473"
    ],
    "abstract": "The purpose of this paper is to propose a novel generalized single-band transformer for two arbitrary complex load and source impedances and a novel high-power amplifier using this new transformer.By adding two reactive parts at across terminals, the coupled line with flexible electrical length has practical evenand odd-mode characteristic impedances.Thus, the total circuit layout can be realized on common printed circuit board without any restriction.The synthesis theory of this proposed transformer is complete and analytical.Furthermore, unlike conventional quarterwavelength transformers, this structure exhibits four main features such as effective matching for extremely low-resistive load impedance, effective matching for extremely high-resistive load impedance, tunable characteristic for equivalent electrical length and inherent DC-block function.For theoretical verification, several impedance transformers, which include some fixed operating-frequency cases and a tunable case, for smaller than 7 Ohm or larger than 1500 Ohm, are presented.As a typical experimental example, this analyzed transformer with inherent DC-block function has been applied in a 4-Watt power amplifier as output matching structure.",
    "full_text": "Progress In Electromagnetics Research, Vol. 119, 171–190, 2011\nA NOVEL HIGH-POWER AMPLIFIER USING A GEN-\nERALIZED COUPLED-LINE TRANSFORMER WITH IN-\nHERENT DC-BLOCK FUNCTION\nY. Wu*, Y. Liu, S. Li, and S. Li\nSchool of Electronic Engineering, Beijing University of Posts and\nTelecommunications, Beijing, China\nAbstract—The purpose of this paper is to propose a novel\ngeneralized single-band transformer for two arbitrary complex load\nand source impedances and a novel high-power ampliﬁer using this\nnew transformer. By adding two reactive parts at across terminals,\nthe coupled line with ﬂexible electrical length has practical even-\nand odd-mode characteristic impedances. Thus, the total circuit\nlayout can be realized on common printed circuit board without any\nrestriction. The synthesis theory of this proposed transformer is\ncomplete and analytical. Furthermore, unlike conventional quarter-\nwavelength transformers, this structure exhibits four main features\nsuch as eﬀective matching for extremely low-resistive load impedance,\neﬀective matching for extremely high-resistive load impedance, tunable\ncharacteristic for equivalent electrical length and inherent DC-block\nfunction. For theoretical veriﬁcation, several impedance transformers,\nwhich include some ﬁxed operating-frequency cases and a tunable case,\nfor smaller than 7 Ohm or larger than 1500 Ohm, are presented. As a\ntypical experimental example, this analyzed transformer with inherent\nDC-block function has been applied in a 4-Watt power ampliﬁer as\noutput matching structure.\n1. INTRODUCTION\nCoupled-line circuit is useful in the design of phase shifters [1]\nand baluns [2]. Although various kinds of ampliﬁers have been\ndeveloped in [3–6], coupled-line circuit is not applied usually. In\naddition, impedance matching is a basic and important concept\nin microwave engineering [7, 8]. Usually, single-section (quarter-\nwave length) or multiple-section transmission lines (for wideband\nReceived 4 May 2011, Accepted 15 July 2011, Scheduled 25 July 2011\n* Corresponding author: Yongle Wu (wuyongle138@gmail.com).\n172 Wu et al.\napplications) are chosen in the design of power divider/combiner,\nsub-system interconnecting and power ampliﬁers. Furthermore,\nlumped-elements matching networks are also used when the operating\nfrequency is low. For complex source and load impedances, two\ngeneralized impedance transformers [9, 10] have been proposed in 2009\nto satisfy arbitrary dual-band operations. Note that these structures\nare still based on lossless uncoupled transmission lines. Obviously,\nconventional transmission lines may be unavailable as impedance\ntransformers when the matched load impedances are extremely high,\nor low. This is because that the characteristic impedances of realized\nmicrostrip or other transmission lines have been limited by practical\nmanufacturing technologies.\nRecently, coupled transmission lines have been developed\nfor impedance transformers [11–15]. Coupled-line multi-section\nimpedance transformer in [11] performs compact circuit size. In [12],\na simple conﬁguration of coupled microstrip transmission line\ntransformer was proposed. Unfortunately, the design methodology did\nnot include analytical design equations, indicating optimal procedures\nare necessary. Then, a relatively complete design theory of coupled-line\nimpedance transformer in [12] was presented in [13] while a wide-band\ntransformer employing a transmission line and a coupled-line section\nwas proposed in [14]. These two structures [13, 14] with design theory\ndeveloped by Ang et al. have some same shortcomings. For examples,\nthe mathematical solutions of design parameters are not closed-form\nequations and the matched load and source impedances are supposed\nto be real values. More important, the large coupling coeﬃcient\n(for example, −5.1378 dB in the experimental transformer in [14]) is\nrequired; this increases the diﬃculty of microstrip realizations and\nlimits practical applications. In addition, another kind of coupled-line\nimpedance transformer was analyzed in [15]. Although the complex\nload impedances and wideband applications have been discussed\nin [15], the complex source impedance case and arbitrary electrical\nlength are not included. Obviously, similar to the mathematical results\nof [14], the synthesis of the wideband case in [15] is complicated and\nthe accurate circuit parameters cannot be easily obtained.\nIn this paper, a generalized impedance transformer for arbitrary\ncomplex source and load impedances and a novel high-power ampliﬁer\nbased on this transformer are proposed. By adding two ﬂexible reactive\nelements and modifying electrical length of the coupled line, this\ncoupled-line transformer not only has analytical design theory, but\nalso makes even- and odd-mode characteristic impedances available\nfor common microstrip fabrication technology. For veriﬁcation,\nmany kinds of numerical transformers with the theoretical results\nProgress In Electromagnetics Research, Vol. 119, 2011 173\nare demonstrated. Finally, this proposed transformer is found to\nbe an eﬀective matching structure in the design of a high-power\nampliﬁer. From the analyzed results, we will ﬁnd that the novel\nfeatures of this proposed matching structure include: 1) eﬀective\nmatching for extremely low-resistive load impedance such as the\ninput impedances of straight-wire dipole (1.1–j1015 Ω), normal mode\nhelix (4.6 Ω), spherical helix (2.2 Ω) [From Table 1 in [16]], and\nload impedances of high-power ampliﬁers; 2) eﬀective matching for\nextremely high-resistive load impedance (larger than 1500 Ω) such\nas the input impedances of biconical antennas, dipole antennas, and\nslotline antennas with special dimensions; 3) tunable characteristic for\nequivalent electrical length; 4) analytical design method for arbitrary\ncomplex impedance matching; 5) inherent DC-block function. In\naddition, the measured results of two microstrip power ampliﬁers show\nthat the proposed coupled-line impedance transformer can satisfy the\nrequirement of the output matching network in high-power ampliﬁer.\n2. DESIGN EQUATIONS FOR THE PROPOSED\nCOUPLED-LINE IMPEDANCE TRANSFORMER\nFigure 1 shows the generalized circuit conﬁguration of the proposed\ncoupled-line impedance transformer. It consists of an arbitrary-length\ncoupled line section (Z0e, Z0o, θ) and two reactive elements (ZT1,\nZT2). These two reactive elements can be realized by using lumped-\ncapacitors, lumped-inductors, lossless transmission line stubs including\nopen-circuit case and shorted-circuit case, or a combination of reactive\nlumped- and distributed-elements. Five design parameters (Z0e, Z0o,\nθ, XT1, XT2) exist in this proposed matching structure, resulting in\nSZ\nin\n1\n2 3\n4\nI\nO\nZ\nZT1\nZT2\nZL\nZ   , Z   , θ0e 00\nFigure 1. The circuit model of the proposed coupled-line impedance\ntransformer.\n174 Wu et al.\nwide range of matched source and load impedances (ZS = RS + jXS,\nZL = RL + jXL), various available solutions, and a compact size\n(θ <0.5π).\nAccording to the mathematical results [8], all elements of\nimpedance matrix that describes the single arbitrary-length coupled\nline section with port numbers deﬁnitions, as shown in Figure 1, are\nsymmetry. The impedance matrix elements can be expressed as\nZ11 = Z22 = Z33 = Z44 = −j\n(Z0e + Z0o\n2\n)\ncot(θ) = −jZa\ntan(θ), (1a)\nZ12 = Z21 = Z34 = Z43 = −j\n(Z0e − Z0o\n2\n)\ncot(θ) = −jZb\ntan(θ), (1b)\nZ13 = Z31 = Z24 = Z42 = −j\n(Z0e − Z0o\n2 sin(θ)\n)\n= −jZb\nsin(θ), (1c)\nZ14 = Z41 = Z23 = Z32 = −j\n[Z0e + Z0o\n2 sin(θ)\n]\n= −jZa\nsin(θ), (1d)\nwhere for simplifying mathematical expression we have assumed that\n{\nZa = Z0e+Z0o\n2 ,\nZb = Z0e−Z0o\n2 . (2)\nSince the values of reactive elements,ZT1 and ZT2, are imaginary, they\ncan be manually deﬁned as\n{\nZT1 = jXT1,\nZT2 = jXT2, (3)\nwhere XT1 and XT2 must be real. It is interesting to point out that the\nvalues of bothXT1 and XT2 may be zero (shorted circuit) or inﬁnity\n(open circuit). They are two special cases. In addition, the values of\nXT1 can be equal or unequal to that ofXT2, this is determined by\npractical requirements.\nOnce the reactive elements ZT1 and ZT2 are connected to the\nports 2 and 4, four-port impedance matrix can reduce to two-port\nimpedance matrix. Here, in order to guard against confusion and\nmisunderstanding, the ports 1 and 3 are redeﬁned as the ports I\n(Input) and O (Output), as shown in Figure 1. Based on (1)–(3),\nthe impedance matrix elements for the portsI and O are then\nZII = j\nZa(Z2\na − Z2\nb ) sin(θ) cos(θ) − Z2\naXT1 sin2(θ)\n+(Z2\na − Z2\nb )XT2 cos2(θ) − ZaXT1XT2 sin(θ) cos(θ)\n[Za cos(θ) − XT2 sin(θ)][Za cos(θ) − XT1 sin(θ)] − Z2\nb\n, (4a)\nProgress In Electromagnetics Research, Vol. 119, 2011 175\nZIO =ZOI\n=j −Zb sin(θ)(XT1XT2 + Z2\na − Z2\nb )\n[Za cos(θ) − XT2 sin(θ)][Za cos(θ)−XT1 sin(θ)] − Z2\nb\n, (4b)\nZOO = j\nZa(Z2\na − Z2\nb ) sin(θ) cos(θ) − Z2\naXT2 sin2(θ)\n+ (Z2\na −Z2\nb )XT1 cos2(θ)−ZaXT1XT2 sin(θ) cos(θ)\n[Za cos(θ)−XT2 sin(θ)][Za cos(θ)−XT1 sin(θ)] − Z2\nb\n. (4c)\nAccording to the conversion between the transmission (ABCD ) matrix\nand the impedance matrix [8], the transmission matrix elements for the\nports I and O can be obtained as\nA =\nZa(Z2\na − Z2\nb − XT1XT2) sin(θ) cos(θ)\n−Z2\naXT1 sin2(θ) + (Z2\na − Z2\nb )XT2 cos2(θ)\nZb sin(θ)(Z2\nb − Z2a − XT1XT2) , (5a)\nB = j\n2\nZ2\naXT1XT2 + (Z2\na − Z2\nb )2 − 2XT1XT2Z2\nb\n+[Z2\naXT1XT2 − (Z2\na − Z2\nb )2] cos(2θ)\n+(XT1 + XT2)Za(Z2\na − Z2\nb ) sin(2θ)\nZb sin(θ)(Z2\nb − Z2a − XT1XT2) , (5b)\nC = −j [Za cos(θ) − XT2 sin(θ)][Za cos(θ) − XT1 sin(θ)] − Z2\nb\nZb sin(θ)(Z2\nb − Z2a − XT1XT2) , (5c)\nD =\nZa(Z2\na − Z2\nb − XT1XT2) sin(θ) cos(θ)\n−Z2\naXT2 sin2(θ) + (Z2\na − Z2\nb )XT1 cos2(θ)\nZb sin(θ)(Z2\nb − Z2a − XT1XT2) . (5d)\nIt can be observed from Figure 1 that when the perfect matching is\nrequired, the necessary situation is (TheConj ( ) means conjugate\noperation)\nConj(ZS) =AZL + B\nCZL + D. (6)\nSubstituting ZS = RS + jXS and ZL = RL + jXL into (6) and\nseparating into real and imaginary parts gives two equations:\nARL − jRSXLC − RSD + jRLXSC = 0, (7a)\nB + jXLA − RSRLC − XSXLC + jXSD = 0. (7b)\nIn Equations (7a) and (7b), the parametersRS, RL, XS, XL are known.\nHowever, other parameters such asZa, Zb, θ, XT1, XT2 are unknown\nand desired. Fortunately, if the values of Za, Zb, θ are manually\ndetermined, other two parameters XT1, XT2 can be calculated by\nclosed-form equations. Both (5) and (7) are used to derive these\n176 Wu et al.\nanalytical design expressions, and the achieved results are{\nXT1 = C1+C3+√2C2\nC4\n,\nXT2 = C5+C6+√2C2\nC7\n,\n(8a)\n{\nXT1 = C1+C3−√2C2\nC4\n,\nXT2 = C5+C6−√2C2\nC7\n,\n(8b)\nwhere\nC1 = −4RSXLZ2\naZ2\nb − 2RLXSZ2\naZ2\nb + 4RSXLZ4\nb\n−RLXSZ4\nb + 8RSXLZ4\na cos(2θ) − 12RSXLZ2\naZ2\nb cos(2θ)\n+4RLXSZ2\naZ2\nb cos(2θ) + 4RSXLZ4\nb cos(2θ)\n−2RLXSZ2\naZ2\nb cos(4θ) +RLXSZ4\nb cos(4θ), (9a)\nC2 = −RLRS[Z2\nb − 2Z2\na + Z2\nb cos(2θ)]2{8RLRSZ4\na\n−4R2\nLR2\nSZ2\nb − 4R2\nSX2\nLZ2\nb − 4R2\nLX2\nSZ2\nb − 4X2\nLX2\nSZ2\nb\n−16RLRSZ2\naZ2\nb − 8XLXSZ2\naZ2\nb − 4Z4\naZ2\nb + 11RLRSZ4\nb\n+8XLXSZ4\nb + 8Z2\naZ4\nb − 4Z6\nb + 4Z2\nb [R2\nSX2\nL\n+R2\nL(R2\nS + X2\nS) − RLRSZ2\nb + (XLXS + Z2\na − Z2\nb )2] cos(2θ)\n+RLRSZ4\nb cos(4θ)}, (9b)\nC3 = −4R2\nLRSZ3\na sin(2θ) − 4RSX2\nLZ3\na sin(2θ) + 4RSZ5\na sin(2θ)\n+4RSZaR2\nLZ2\nb sin(2θ) − 2RLR2\nSZaZ2\nb sin(2θ)\n+4RSX2\nLZaZ2\nb sin(2θ) − 2RLX2\nSZaZ2\nb sin(2θ)\n+2RLZ3\naZ2\nb sin(2θ) − 8RSZ3\naZ2\nb sin(2θ) − 2RLZaZ4\nb sin(2θ)\n+ 4RSZaZ4\nb sin(2θ)+RLR2\nSZaZ2\nb sin(4θ)\n+RLX2\nSZaZ2\nb sin(4θ)−RLZ3\naZ2\nb sin(4θ)+RLZaZ4\nb sin(4θ), (9c)\nC4 = −4R2\nLRSZ2\na − 4X2\nLRSZ2\na − 4RSZ4\na + RLR2\nSZ2\nb\n+RLX2\nSZ2\nb + 3RLZ2\naZ2\nb + 8RSZ2\naZ2\nb − 4RSZ4\nb\n+4[R2\nLRSZ2\na − RLZ2\naZ2\nb + RSX2\nLZ2\na − RS(Z2\na − Z2\nb )2] cos(2θ)\n−RL(R2\nS + X2\nS − Z2\na)Z2\nb cos(4θ) + 8RSXLZ3\na sin(2θ)\n−8RSXLZaZ2\nb sin(2θ) + 4RLXSZaZ2\nb sin(2θ)\n−2RLXSZaZ2\nb sin(4θ), (9d)\nC5 = −2RSXLZ2\naZ2\nb − 4RLXSZ2\naZ2\nb + 4RLXSZ4\nb − RSXLZ4\nb\n+8RLXSZ4\na cos(2θ) − 12RLXSZ2\naZ2\nb cos(2θ)\n+4RSXLZ2\naZ2\nb cos(2θ) + 4RLXSZ4\nb cos(2θ)\n−2RSXLZ2\naZ2\nb cos(4θ) +RSXLZ4\nb cos(4θ), (9e)\nProgress In Electromagnetics Research, Vol. 119, 2011 177\nC6 = −4R2\nSRLZ3\na sin(2θ) − 4RLX2\nSZ3\na sin(2θ) + 4RLZ5\na sin(2θ)\n+4RLZaR2\nSZ2\nb sin(2θ) − 2RSR2\nLZaZ2\nb sin(2θ)\n+4RLX2\nSZaZ2\nb sin(2θ) − 2RSX2\nLZaZ2\nb sin(2θ)\n+2RSZ3\naZ2\nb sin(2θ) − 8RLZ3\naZ2\nb sin(2θ) − 2RSZaZ4\nb sin(2θ)\n+4RLZaZ4\nb sin(2θ) +RSR2\nLZaZ2\nb sin(4θ) +RSX2\nLZaZ2\nb sin(4θ)\n−RSZ3\naZ2\nb sin(4θ) +RSZaZ4\nb sin(4θ), (9f)\nC7 = −4R2\nSRLZ2\na − 4X2\nSRLZ2\na − 4RLZ4\na + RSR2\nLZ2\nb\n+RSX2\nLZ2\nb + 3RSZ2\naZ2\nb + 8RLZ2\naZ2\nb − 4RLZ4\nb\n+4[R2\nSRLZ2\na − RSZ2\naZ2\nb + RLX2\nSZ2\na − RL(Z2\na − Z2\nb )2] cos(2θ)\n−RS(R2\nL + X2\nL − Z2\na)Z2\nb cos(4θ) + 8RLXSZ3\na sin(2θ)\n−8RLXSZaZ2\nb sin(2θ) + 4RSXLZaZ2\nb sin(2θ)\n−2RSXLZaZ2\nb sin(4θ) (9g)\nEquations (8a) and (8b) indicate that two solutions are possible for\nXT1 and XT2. To assure these two solutions are real numbers, the\nargument of the square roots must be non-negative. The corresponding\nmathematical expression can be found as\nC2 ≥ 0. (10)\nNote that there are ﬁve design parameters in two Equations (7a)\nand (7b). This implies that the proposed coupled line transformer\nhas three degrees of freedom. Therefore, the values ofZa, Zb, θ can\nbe freely chosen when the inequality (10) is satisﬁed. The ﬂexible\nparameter selection ofZa and Zb (namely, Z0e and Z0o) means breaking\nthe practical limitation of microstrip coupled lines and other kinds of\ncoupled transmission lines. Furthermore, onceZa, Zb, θ are known,\nother parametersXT1 and XT2 can be easily obtained according to (8)\nand (9). Since the total calculation is based on analytical formulas,\nthe design theory of our proposed structure is direct and accurate.\n3. NUMERICAL EXAMPLES OF THE PROPOSED\nIMPEDANCE TRANSFORMER\nIn this section, several numerical examples are presented to verify the\nabove closed-form design equations including (8) and (9). As discussed\nabove, there are many kinds of circuits available in the implementation\nof reactive elements XT1 and XT2. Figure 2 illustrates ﬁve typical\ncircuit implementation for a given reactance XT1 or XT2. Their\n178 Wu et al.\n1inZ\nLC\nOpen\n2inZ 3inZ 4inZ 5inZ\n2\n2\nZ 3\n3\nZ 4\n4\nZ\n(1) (2) (3) (4) (5)\nθ θ\nθ\nFigure 2.The typical lumped- and distributed-circuit implementation\nfor reactive elementsXT1 and XT2.\nanalytical equations are obtained as\njXT1 or jXT2 =\n\n\n\nZin1 = j −1\n2πfC ,\nZin2 = j −Z2\ntan(θ2),\nZin3 = jZ3 tan(θ3),\nZin4 = j 2πfCZ 2\n4 tan(θ4)−Z4\n2πfCZ 4+tan(θ4) ,\nZin5 = j2πfL.\n(11)\nObviously, there are many kinds of other diﬀerent combination\nstructures when lossless transmission line and inductor are used\nsimultaneously. However, generally speaking, inductors are more\nexpensive and more diﬃcult to realize than capacitors. Thus, the\ninductor (the structure (5) shown in Figure 2) is not chosen usually.\nMoreover, for planar transmission line such as microstrip, double-sided\nparallel strip line, stripline, shorted-circuit stub (the structure (3)\nshown in Figure 2) is harder to fabricated because a via hole is required.\nIn summary, a pure capacitor and an open circuit stub are preferred\nto be utilized as the desired reactanceXT1 or XT2.\nIn the examples in Sections 3.1, 3.2, and 3.3, a coupled-line\nimpedance transformer with two open circuit stubs shown in Figure 3\nis considered. The characteristic impedances (ZT10, ZT20) of two open\ncircuit stubs are equal to 100 Ω.\n3.1. Transformers between Two Arbitrary Complex\nImpedances\nIn this section, the source and load impedances are chosen randomly as\nZS = 50+20j Ω andZL = 10−60j Ω. The operating frequency is 2 GHz\nand all electrical lengths are speciﬁed at this frequency. According to\nProgress In Electromagnetics Research, Vol. 119, 2011 179\nLZ\nS\nPort 1\nPort 2\nZ\nZT10\nθ T1\nZT20\nθ T2\nZ   , Z   , θ0e 00\nZ     = Z     = 100 ΩT10 T20\nFigure 3. The typical circuit conﬁguration of a coupled-line\nimpedance transformer with two open circuit stubs.\nTable 1. Calculated circuit parameters of the four simulated\nimpedance transformers.\nTransformers Z0e\n(Ω)\nZ0o\n(Ω)\nθ\n(Degree)\nθT1\n(Degree)\nθT2\n(Degree)\nA\n110 55\n60 71.4804 48.5666\nB 70 64.6251 59.4780\nC 80 56.5440 58.0176\nD 115 62 90 42.2654 31.8065\nthe Equations (8b) and (11), the accurate calculated circuit parameters\nare obtained, as listed in Table 1, when the practical values ofZ0e,\nZ0o, and θ are determined manually for microstrip. Note that the\neven-mode and odd-mode characteristic impedances are the same for\ntransformers A, B, and C. But the electrical lengths are diﬀerent.\nIn addition, the transformer D presents that all parameters of the\ncoupled line section can be adjusted freely only if (10) is satisﬁed.\nFrom the simulated frequency response shown in Figure 4, the ideal\nmatching and lossless transmission at 2 GHz can be clearly observed,\nwhich veriﬁes the proposed closed-form design formulas.\n180 Wu et al.\nA\nB\nC\nD\nA\nB\nC\nD\n0\n-5\n-10\n-15\n-20\n-25\n-30\n1.6 1.8 2.0 2.2 2.4\nFrequency (GHz)\nS-Parameters |S  | (dB)11\n1.6 1.8 2.0 2.2 2.4\nFrequency (GHz)\n0\n-5\n-10\n-15\n-20\n-25\n-30 S-Parameters |S  | (dB)21\n(a) (b)\nFigure 4. Frequency response of four calculated transformers (A, B,\nC, D) with open circuit stubs: (a) return loss and (b) insertion loss.\nTable 2. Calculated circuit parameters of the impedance\ntransformers, E1, E2, andE3.\nTransformers ZL\n(Ω)\nZ0e\n(Ω)\nZ0o\n(Ω)\nθ\n(Degree)\nθT1\n(Degree)\nθT2\n(Degree)\nE1 7.5\n110 64 60\n34.9032 42.2255\nE2 5 36.3843 58.3255\nE3 2 36.1018 77.2193\n3.2. Transformers for Matching a Extremely Low Load\nImpedance to a 50-Ω Standard Port\nHere, the standard port impedance 50 Ω is used as the source\nimpedance ZS. To demonstrate the matching capability of the\nextremely low load impedance, three transformers with 7.5, 5, and 2 Ω\nload impedances are designed and the accurate circuit parameters are\ngiven in Table 2. Figure 5 shows the calculated scattering parameters\nwhen the operating frequency is 2 GHz. The electrical lengthsθT1 and\nθT2 of two open circuit stubs are smaller than 90 degree, indicating\nthat two lumped capacitors can also be used to realize the similar\nperformance. Furthermore, the perfect matching at 2 GHz is clear\nin Figure 5. The return loss curves in Figure 5 also show that the\nbandwidth of matching decreases as the load impedanceZL decreases.\nProgress In Electromagnetics Research, Vol. 119, 2011 181\n3.3. Transformers for Matching a Extremely High Load\nImpedance to a 50-Ω Standard Port\nConventional quarter-wave transmission line can’t be directly used\nto match a extremely high load impedance because the desired\ncharacteristic impedance is very large and diﬃcult to realize.\nFortunately, this proposed impedance transformer based on coupled\nline can overcome this diﬃculty. Although the transformersF1, F2,\nand F3 have larger than 1 kΩ load impedances, the ﬁnal design circuit\nparameters listed in Table 3 are realized for traditional microstrip\ntechnology. In addition, the desired matching at the operating\nfrequency 2 GHz is clear in the calculated return loss shown in Figure 6.\n3.4. An Impedance Transformer with Tunable Operating\nFrequency (Electrical Length)\nIf the operating frequency is tunable, the equivalent electrical length\nshould be adjusted linearly. According to this principle, four\nE1\nE2\nE3\n1.5 1.6 1.7 1.8 1.9 2.0 2.1 2.2 2.3 2.4 2.5\nS-Parameters |S  | (dB)11\n0\n-5\n-10\n-15\n-20\nFrequency (GHz)\nFigure 5. Frequency response\n(return loss) of three calculated\ntransformers (E1, E2, and E3)\nwith open circuit stubs.\n1.6 1.7 1.8 1.9 2.0 2.1 2.2 2.3 2.4\nS-Parameters |S  | (dB)11\n0\n-5\n-10\n-15\n-20\nFrequency (GHz)\nF1\nF2\nF3\nFigure 6. Frequency response\n(return loss) of three calculated\ntransformers (F1, F2, and F3)\nwith open circuit stubs.\nTable 3. Calculated circuit parameters of the impedance\ntransformers, F1, F2, andF3.\nTransformers ZL\n(Ω)\nZ0e\n(Ω)\nZ0o\n(Ω)\nθ\n(Degree)\nθT1\n(Degree)\nθT2\n(Degree)\nF1 1500\n100 55\n80 96.1395 70.7843\nF2 1800 70 103.4270 73.8725\nF3 2200 60 111.2955 79.8340\n182 Wu et al.\nimpedance transformers with the same source and load impedances\n(ZS = 50 Ω,ZL = 5 Ω) are designed and their obtained parameters are\nlisted in Table 4. Note that the operating frequencies are diﬀerent. In\naddition, two pure capacitors are used to realize two reactive elements\nXT1 and XT2. The calculated return loss presented in Figure 7 show\nthe matching frequencies of these four transformers agree with the\ndesired ones. From another perspective, it can be obtained from\nTable 4 that adjusting the values of two reactive elementsXT1 and\nXT2 leads to a tunable operating frequency.\nTable 4. Calculated circuit parameters of the impedance\ntransformers, G1, G2, G3, andG4.\nTransfor\n-mers\nZ0e\n(Ω)\nZ0o\n(Ω)\nθ\n(Degree) XT1 XT2\nG1\n100 55\n85\n(at f =\n1.53 GHz)\n−486.3991\n(C =\n0.2139 pF)\n−91.7261\n(C =\n1.1341 pF)\nG2\n70\n(at f =\n1.26 GHz)\n−177.8611\n(C =\n0.7102 pF)\n−61.8962\n(C =\n2.0407 pF)\nG3\n60\n(at f =\n1.08 GHz)\n−120.0583\n(C =\n1.2275 pF)\n−52.2071\n(C =\n2.8227 pF)\nG4\n50\n(at f =\n0.9 GHz)\n−87.0140\n(C =\n2.0323 pF)\n−51.7552\n(C =\n3.4168 pF)\nG1\nG2\nG3\nG4\n0.6 0.8 1.0 1.2 1.4 1.6 1.8 2.0\nFrequency (GHz)\n0\n-5\n-10\n-15\n-20\n-25\n-30 S-Parameters |S  | (dB)11\nFigure 7. Frequency response (return loss) of four calculated\ntransformers (G1, G2, G3, andG4) with two lumped capacitors.\nProgress In Electromagnetics Research, Vol. 119, 2011 183\nTable 5. Calculated circuit parameters of the proposed impedance\ntransformers.\nZ0e\n(Ω)\nZ0o\n(Ω)\nθ\n(Degree)\nθT1\n(Degree)\nθT2\n(Degree)\n110 65 51 33.71 14.75\nIn summary, it can be observed from the above examples\nthat there are four obvious advantages in this proposed impedance\ntransformer: 1) ideal matching performances for two arbitrary complex\nimpedances; 2) available matching in extremely low load impedance\ncase; 3)available matching in extremely high load impedance case;\n4) ﬂexible design for equivalent electrical length, namely, operating\nfrequency.\n4. HIGH-POWER AMPLIFIER USING THE PROPOSED\nIMPEDANCE TRANSFORMER\nTwo power ampliﬁer modules are designed to compare the diﬀerence\nbetween the proposed impedance transformer and the traditional\nimpedance transformer [17] in application. LDMOS Wideband\nIntegrated Power Ampliﬁer MW7IC2240N, which integrated on-chip\ninput matching, DC block and Quiescent Current Temperature\nCompensation (QCTC), is chosen for this design. These power\nampliﬁer modules work at the frequency range from 2010 MHz to\n2025 MHz which is a TD-SCDMA frequency band and the average\noutput power level is 4 Watts.\n4.1. The Design Approach\nBased on the load impedance provided in the MW7IN2240N data\nsheet [18], the output match network should be designed to transform\n5.444 + j6.869 to 50 Ω. Considering the microstrip line which is\nnecessary for the pad of MW7IC2240N and the connection between\nthe MW7IC2240N and the impedance transformer, the proposed\nimpedance transformers and the traditional impedance transformer\nshould be designed to transform 6 .6 + j40.4 to 50 Ω. These\ncalculated circuit parameters of the proposed impedance transformers\nare shown in Table 5. The power ampliﬁer module which uses\ntraditional impedance transformer (hereafter called “PA-A” for short)\nand the power ampliﬁer module which uses the proposed impedance\ntransformer (hereafter called “PA-B” for short) circuit schematics are\nshown in Figures 8 and 9 and the circuit component designations and\n184 Wu et al.\nvalues are listed in Tables 6 and 7. The used substrate is Wangling\nF4BK, which has a dielectric constant of 2.65, a substrate thickness\nof 0.8 mm and a dissipation factor of 0.001. The size of each whole\nmodule is 145 mm× 75 mm and the layout of each ampliﬁer is shown\nin Figures 10 and 11.\n4.2. Measurement and Comparison\nThe bias point of each power ampliﬁer isVDD1 = VDD2 = 28 V,IDD1 =\n90 mA andIDD2 = 420 mA (see Figures 8 and 9). Agilent N5230C\nPNA-L Network Analyzer is used to test the frequency response of\nthese two power ampliﬁer modules and the measured small-signalS-\nR\nRFin out\nV\nZ\nI\nMW7IC2240\nQCTC\nDD1\nI DD2\nVDD2DD1\nC2 3C\n0in\nVGG1\nVGG2\n1\n1C\nR2\n4C\n5C\nC6 C7 C8 C9 C10 C16\nC11 C12 C13 C14 C15\nRF\nZ 1 Z 2 Z0out\nZ 4\nZ 8\nλ /4\nFigure 8. PA-A circuit schematic.\nR\nRFin\nout\nV\nZ\nI\nMW7IC2240\nQCTC\nDD1\nIDD2\nVDD2\nDD1\nC2 3C\n0in\nVGG1\nVGG2\n1\n1C\nR2\n4C\n5C C6 C7 C8 C9 C10\nC11\nRF\nZ1 Z2\nZ0out\nZ3\nλ /4\nZT10\nZ   , Z   , θ0e 00\nθ T1\nZT20\nθ T2\nFigure 9. PA-B circuit schematic.\nProgress In Electromagnetics Research, Vol. 119, 2011 185\nTable 6.PA-A circuit component designations and values.\nPart Description Part Description\nC1\n8.2 pF\nChip Capacitor\nC5,\nC8, C13\n4.7 µF, 35 V\nChip Capacitors\nC2, C9,\nC10, C14,\nC15\n10 µF, 35 V\nChip Capacitors C7, C12\n0.1 µF\nChip Capacitors\nC3, C6,\nC11\n5.6 pF\nChip Capacitors C16\n470 µF, 35 V\nElectrolytic Capacitor\nC4\n0.4 pF\nChip Capacitor R1, R2\n10 kΩ,\n1/4 W Chip Resistors\nTable 7.PA-B circuit component designations and values.\nPart Description Part Description\nC1\n8.2 pF\nChip Capacitor C5, C8\n4.7 µF, 35 V\nChip Capacitors\nC2, C9, C10\n10 µF, 35 V\nChip Capacitors C7\n0.1 µF\nChip Capacitors\nC3, C6\n5.6 pF\nChip Capacitors C11\n470 µF, 35 V\nElectrolytic Capacitor\nC4\n0.4 pF\nChip Capacitor R1, R2\n10 kΩ,\n1/4 W Chip Resistors\nFigure 10. Photograph of the fabricated PA-A.\nparameters are shown in Figures 12 and 13. As shown in Figure 12, the\nPA-A has 1-dB transmission bandwidth of 220 MHz and power gain of\n31.8 dB. Figure 13 illustrates that the PA-B has 1-dB transmission\nbandwidth of 60 MHz and power gain of 34.8 dB. They indicated\nthat PA-B has a narrower band and a higher gain. Fortunately, the\n186 Wu et al.\noperating bandwidth of this PA-B can satisfy the requirement of base\nstations in the TD-SCDMA communication systems.\nFigure 11. Photograph of the fabricated PA-B.\n1.9 2.0 2.1 2.2 2.3\n-30\n-20\n-10\n0\n10\n20\n30\n40S-parameters (dB)\nFrequency (GHz)\nS11\n21S\nFigure 12. Frequency response\nof the fabricated PA-A.\nS11\n21S\n1.9 2.0 2.1 2.2 2.3\nFrequency (GHz)\n-30\n-20\n-10\n0\n10\n20\n30\n40S-parameters (dB)\nFigure 13. Frequency response\nof the fabricated PA-B.\n0 5 10 15 20\n30\n35\n40\n45\n50Output Power (dBm)\nInput Power (dBm)\n Actual\n Ideal\n30\n35\n40\n45\n50Output Power (dBm)\n0 5 10 15 20\nInput Power (dBm)\n Actual\n Ideal\n(a) (b)\nFigure 14. Pulsed CW output power versus input power: (a) PA-A,\n(b) PA-B.\nProgress In Electromagnetics Research, Vol. 119, 2011 187\nThe large-signal test system consists of Agilent E438C ESG Vector\nSignal Generator, Agilent N9030A PXA Signal Analyzer, and a 30 dB\nattenuator. The measured large-signal performance of PA-A and PA-\nB at 2017 MHz are illustrated in Figure 14. The linearity assessment\nof the designed power ampliﬁers were conducted by measuring the\n3rd-order, 5th-order and 7th-order inter-modulation distortion (IMD)\ncharacteristics using a two-tone signal with 10-MHz tone spacing. The\nmeasured results are presented in Figures 15, 16, and 17. Figure 18\nshows the measured ACPR of each power ampliﬁer module. It can be\nseen that an ACPR of almost−40 dBc at 10 dB back-oﬀ has been\nachieved and the power ampliﬁer module which use the proposed\nimpedance transformer as the output match network has a better\nperformance. Additionally, the measured maximum output power can\nincrease to 33 Watts in the PA-B based on our proposed impedance\ntransformer, indicating a practical high-power ampliﬁer.\n-20 -15 -10 -5 0 5 10 15\n-70\n-60\n-50\n-40\n-30\n-20\n-10\n PA-A\n PA-B\nIMD3 (dBc)\nInput Power (dBm)\nFigure 15. Measured IMD3\ncharacteristics under two-tone\nsignal.\n PA-A\n PA-B\n-20 -15 -10 -5 0 5 10 15\nInput Power (dBm)\n-70\n-60\n-50\n-40\n-30\n-20IMD5 (dBc)\nFigure 16. Measured IMD5\ncharacteristics under two-tone\nsignal.\n-70\n-60\n-50\n-40\n-30IMD7 (dBc)\n PA-A\n PA-B\n-20 -15 -10 -5 0 5 10 15\nInput Power (dBm)\nFigure 17. Measured IMD7 characteristics under two-tone signal.\n188 Wu et al.\n(a)\n(b)\nFigure 18. Measured output spectrum of (a) PA-A (b) PA-B at an\naverage output power of 36 dBm.\n5. CONCLUSION\nA generalized and novel impedance transformer based on coupled line\nhas been proposed. The corresponding closed-form design equations\nare given by rigorous analysis. Numerical complex impedance\ntransformers, extremely low (or high) load impedance transformers,\ntunable impedance transformers are presented. Finally, a novel high-\npower ampliﬁer based on this new impedance structure is designed,\nfabricated and demonstrated with comparable measured results. As\na result, this proposed structure with analytical design approach\nprovides another alternative matching method for the design of\nmicrowave components and systems.\nProgress In Electromagnetics Research, Vol. 119, 2011 189\nACKNOWLEDGMENT\nThis work was supported in part by Important National Science\n& Technology Speciﬁc Projects (No. 2010ZX03007-003-04), National\nNatural Science Foundation of China (No. 61001060). This paper is a\npart of Yongle Wu’s doctoral dissertation.\nREFERENCES\n1. Gao, B. and Y. Xin, “Improved miniaturized wide-band 90-degree\nSchiﬀman phase shifter,”Journal of Electromagnetic Waves and\nApplications, Vol. 23, No. 4, 493–499, 2009.\n2. Jafari, E., F. Hojatkashani, and R. Rezaiesarlak, “A wideband\ncompact planar balun for UHF DTV applications,”Journal of\nElectromagnetic Waves and Applications, Vol. 23, Nos. 14–15,\n2047–2053, 2009.\n3. Yoon, J., H. Seo, I. Choi, and B. Kim, “Wideband LNA using a\nnegative GM cell for improvement of linearity and noise ﬁgure,”\nJournal of Electromagnetic Waves and Applications, Vol. 24,\nNos. 5–6, 619–630, 2010.\n4. Lee, M.-W., S.-H. Kam, Y.-S. Lee, and Y.-H. Jeong, “A highly\neﬃcient three-stage Doherty power ampliﬁer with ﬂat gain for\nWCDMA applications,” Journal of Electromagnetic Waves and\nApplications, Vol. 24, Nos. 17–18, 2537–2545, 2010.\n5. Zhang, B., Y.-Z. Xiong, L. Wang, S. Hu, T.-G. Lim, Y.-Q. Zhuang,\nand L.-W. Li, “A D-band power ampliﬁer with 30-GHz bandwidth\nand 4.5-dBmPsat for high-speed communication system,”Progress\nIn Electromagnetics Research, Vol. 107, 161–178, 2010.\n6. Jimenez Martin, J. L., V. Gonzalez-Posadas, J. E. Gonzalez-\nGarcia, F. J. Arques-Orobon, L. E. Garcia-Munoz, and\nD. Segovia-Vargas, “Dual band high eﬃciency class ce power\nampliﬁer based on CRLH diplexer,”Progress In Electromagnetics\nResearch, Vol. 97, 217–240, 2009.\n7. Abdalla, M. A. and Z. Hu, “Multi-band functional tunable LH\nimpedance transformer,” Journal of Electromagnetic Waves and\nApplications, Vol. 23, No. 1, 39–47, 2009.\n8. Pozar, D. M.,Microwave Engineering, 3rd edition, Nos. 2–5, 187–\n418, Publishing House of Electronics Industry, 2006.\n9. Wu, Y., Y. Liu, and S. Li, “A dual-frequency transformer for\ncomplex impedances with two unequal sections,”IEEE Microw.\nWireless Compon. Lett., Vol. 19, No. 2, 77–79, 2009.\n10. Wu, Y., Y. Liu, S. Li, C. Yu, and X. Liu, “A generalized\n190 Wu et al.\ndual-frequency transformer for two arbitrary complex frequency-\ndependent impedances,” IEEE Microw. Wireless Compon. Lett.,\nVol. 19, No. 12, 792–794, 2009.\n11. Chramiec, J. and M. Kitlinski, “Design of quarter-wave\ncompact impedance transformers using coupled transmission\nlines,” Electronics Letters, Vol. 38, No. 25, 1683–1685, 2002.\n12. Liu, S. P., “Planar transmission line transformer using coupled\nmicrostrip lines,”IEEE MTT-S Int. Microw. Symp. Dig., Vol. 2,\n789–792, 1998.\n13. Ang, K. S., C. H. Lee, and Y. C. Leong, “Analysis and design of\ncoupled line impedance transformers,”IEEE MTT-S Int. Microw.\nSymp. Dig., Vol. 3, 1951–1954, 2004.\n14. Ang, K. S., C. H. Lee, and Y. C. Leong, “A broad-band quarter-\nwavelength impedance transformer with three reﬂection zeros\nwithin passband,” IEEE Trans. Microw. Theory Tech., Vol. 52,\nNo. 12, 2640–2644, 2004.\n15. Jensen, T., V. Zhurbenko, V. Krozer, and P. Meincke, “Coupled\ntransmission lines as impedance transformer,” IEEE Trans.\nMicrow. Theory Tech., Vol. 55, No. 12, 2957–2965, 2007.\n16. Best, S. R., “Low Q electrically small linear and elliptical\npolarized spherical dipole antennas,” IEEE Trans. Antennas\nPropag., Vol. 53, No. 3, 1047–1053, 2005.\n17. Steve, C. C.,RF Power Ampliﬁers for Wireless Communications,\n2nd edition, No. 5, 92–100, Artech House Microwave Library, 2006.\n18. Freescale Semiconductor, “RF LDMOS wideband integrated\npower ampliﬁers,” Document Number: MW7IC2240N, Rev. 0,\n11/2007."
}