{
  "title": "Distribution of earth leakage currents in railway systems with drain auto-transformers",
  "url": "https://openalex.org/W2113744585",
  "year": 2001,
  "authors": [
    {
      "id": "https://openalex.org/A5102150655",
      "name": "Chih‐Ju Chou",
      "affiliations": [
        "Chung Yuan Christian University"
      ]
    },
    {
      "id": "https://openalex.org/A5109089963",
      "name": "Ying-Tung Hsiao",
      "affiliations": [
        "Tamkang University"
      ]
    },
    {
      "id": "https://openalex.org/A5087066339",
      "name": "J. J. Wang",
      "affiliations": [
        "Tamkang University"
      ]
    },
    {
      "id": "https://openalex.org/A5108535820",
      "name": "Yaw-Tzong Hwang",
      "affiliations": [
        "Chung Yuan Christian University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2133250661",
    "https://openalex.org/W1986280753",
    "https://openalex.org/W2022703458",
    "https://openalex.org/W2142236105",
    "https://openalex.org/W2066184070",
    "https://openalex.org/W1600868767",
    "https://openalex.org/W239153407",
    "https://openalex.org/W2993732332"
  ],
  "abstract": "This work presents a novel advanced methodology to accurately predict the earth leakage currents for analyzing the electrification railway systems with drain auto-transformers. The proposed methodology entails applying a decoupled technique to model the equivalent circuit while simultaneously considering the grounding network and the effects on mutual impedance between feeders. Also presented herein are several study cases, particularly with respect to how grounding resistance, span of auto-transformers, turn-ratio of auto-transformers, and location of ground faults influence the leakage currents. These study cases demonstrate that the computer program based on the proposed methodology can effectively analyze the leakage currents in the planning stage for developing railway systems.",
  "full_text": "IEEE TRANSACTIONS ON POWER DELIVERY , VOL. 16, NO. 2, APRIL 2001 271\nDistribution of Earth Leakage Currents in Railway\nSystems with Drain Auto-Transformers\nChih-Ju Chou, Ying-Tung Hsiao, Member, IEEE, Jhane-Li Wang, and Yaw-Tzong Hwang\nAbstract—This work presents a novel advanced methodology\nto accurately predict the earth leakage currents for analyzing the\nelectrification railway systems with drain auto-transformers. The\nproposed methodology entails applying a decoupled technique\nto model the equivalent circuit while simultaneously considering\nthe grounding network and the effects on mutual impedance\nbetween feeders. Also presented herein are several study cases,\nparticularly with respect to how grounding resistance, span of\nauto-transformers, turn-ratio of auto-transformers, and location\nof ground faults influence the leakage currents. These study cases\ndemonstrate that the computer program based on the proposed\nmethodology can effectively analyze the leakage currents in the\nplanning stage for developing railway systems.\nI. INTRODUCTION\nA\nN ELECTRIFICATION railway system is a large con-\nsumer of a utility. Moreover, a railway system is intended\nfor public service. Therefore, electrical safety is a critical\ndesign criterion of a railway system’s power supply. In general,\na railway system’s power supply has a single phase two wired\nsystem. One wire is a power feeder while the other one is a\nreturn feeder. One of the railroad tracks is utilized as the return\npath of loading currents and the other one is insulated from\nsoil as the signal path. This paper does not discuss the case of\nthe railway track as a signal path. For safety, the railroad track\nis grounded at every specified distance. Some of the track’s\ncurrents follow along the contours of the earth, called leakage\ncurrents. These currents return to their sources through the\nearth. The leakage currents following along the contours of\nthe earth may emit pollution. In the proximity of the tracks\nor substations, personnel and animals can be subjected to\npotentially hazardous shocks due to large potential gradients\n(e.g., step voltage and touch voltage) caused by the leakage\ncurrent, particularly when a ground fault occurs. In addition,\nan increase of the ground potential rise (GPR) induced by the\nleakage current may incur equipment damage [1], [2].\nIn practice, the auto-transformer (AT) is employed in the\nrailway system’s power supply to reduce the leakage currents.\nIn lieu of safety concerns, the distribution and degree of the\nleakage current must be development in the planning stage for\ndeveloping railway systems. In this study, we present a novel\nmodel of the electrical power system for a railway system.\nManuscript received June 25, 1999; revised June 14, 2000. This work was\nsupported by the National Science Council of the Republic of China under Con-\ntract No. NSC 87-2213-E-032-023.\nC.-J. Chou and Y .-T. Hwang are with the Department of Electrical Engi-\nneering, Chung Yuan Christian University, Taiwan.\nY .-T. Hsiao and J.-L. Wang are with the Department of Electrical Engineering,\nTamkang University, Taiwan.\nPublisher Item Identifier S 0885-8977(01)03419-7.\nThe decoupled technique [3]–[5] is then applied to reduce\nthe coupled model’s complexity. The decoupled technique in\n[3]–[5] is used to analysis the distribution of faulted grounding\ncurrents. In this study, we modify and extend this technique for\nanalysis the distribution of earth leakage currents. The extended\ndecoupled technique can adopt for analyzing not only the cases\nof ground faults but also the cases of normal operations.\nThe comparison of the decoupled technique with the direct\ncalculation technique shows that the computer burden and the\nerror for computing leakage currents can be greatly reduced.\nThis work utilize the extended decoupled technique to build\nthe circuit model of the railway systems. As we know, there\nis not any study on the analysis of the earth leakage currents\nin railway system with auto- transformers. A methodology is\nalso proposed to accurately predict the leakage currents and,\nthen, implemented in a computer program. Also presented\nherein are many cases, including the effects on various forms of\ngrounding resistance, distance between two ATs, locations of\nground faults and locations of trains. Those cases demonstrate\nthe effectiveness of the proposed methodology. Concluding\nremarks are finally made.\nII. T\nHE LEAKAGE C URRENTS FROM A R AILWAY SYSTEM\nAn electrification railway system’s power supply is a single\nphase system with two circuits: a power feeder and a return\nfeeder (Fig. 1). In practice, one of the railroad tracks is uti-\nlized as a return feeder. For safety concerns, the railroad track\nis grounded at every specified distance (say 200 m). There-\nfore, some of the train’s loading currents return to their original\nsources through the earth (grounding path), called leakage cur-\nrent. Fig. 2 depicts the equivalent electric circuit of a railway\nsystem. To mitigate the leakage current, ATs are installed every\n10 km along the railway, connected by the power feeder and re-\nturn feeder. The center point of AT is connected at the railway\ntrack. The AT can absorb the most leakage currents to reduce\nthe leakage currents descending into the earth.\nHerein, a circuit model (Fig. 3) is applied to analyze the\nearth leakage currents in the railway system. In this model,\nand denote the loading currents of electrification trains, the\nequivalent dependent sourcesand represent ,\nis the turn ratio of the AT,denotes the impedance of railway\ntracks, represents the source impedance referred to the\nsecondary, is the impedance of the main transformer,\ndenotes the equivalent self impedance of power lines,rep-\nresents the equivalent self impedance of return lines, and\n( ) is the mutual impedance between the railway tracks\nand the power feeders (return feeders). Analyzing this model\nis extremely difficult owing to the mutual inductance between\n0885–8977/01$10.00 © 2001 IEEE\nAuthorized licensed use limited to: Tamkang Univ.. Downloaded on March 28,2023 at 03:34:09 UTC from IEEE Xplore.  Restrictions apply. \n272 IEEE TRANSACTIONS ON POWER DELIVERY , VOL. 16, NO. 2, APRIL 2001\nFig. 1. One-line diagram of the railway’s power supply system.\nFig. 2. Equivalent electric circuit of a railway system.\nthese elements. Herein, we employ a decoupled technique to\nreduce the complexity of Fig. 3. The mutual inductance is\nequivalent to a current source.\nAs Fig. 4 indicates, the current sources drawn by a dotted line\nrespond to the effect of mutual inductance, where\ndenotes the\ntotal number of grounding points in the railway,represents the\ntotal number of AT,denotes the total number of nodes of the\nfeeder, and is the grounding resistance at grounding point\n. According to this figure, the node equations are expressed as\nfollows. At node 1,\n(1)\nwhere,\nFig. 3. A circuit model of a railway system’s power supply.\nFig. 4. The decoupled circuit model for analyzing the earth leakage currents\nin a railway system.\nAt node 2,\n(2)\nwhere\nAt node ,\n(3)\nFrom above equations, although we have equations,\nthe number of unknown variables is . The other\nequations can be derived from the relations in the equivalent\ncircuit of ATs as follows.\nAt AT 1,\n(4)\nAuthorized licensed use limited to: Tamkang Univ.. Downloaded on March 28,2023 at 03:34:09 UTC from IEEE Xplore.  Restrictions apply. \nCHOU et al.: DISTRIBUTION OF EARTH LEAKAGE CURRENTS IN RAILW AY SYSTEMS WITH DRAIN AUTO-TRANSFORMERS 273\nTherefore,\n(5)\nAt AT ,\n(6)\nBy applying the matrix form to the above equation, we have\n(7)\nwhere denotes the potential of grounding point at railway’s\nsubstations.\nIII. CALCULATION OF SYSTEM PARAMETERS\nThe main parameters for analyzing leakage currents include\nthe impedance of feeders, self impedance of railroad tracks, mu-\ntual impedance between feeders and railroad track, and value\nof the grounding resistance. These parameters are calculated as\nfollows. Under the assumptions that the resistance type of the\nearth is a single, uniform layer, the self and mutual impedance\nof feeders are expressed as follows [6]–[9].\nSelf Impedance:\nm (8)\nwhere\nrepresents the resistance of feeders\n(O/m),\nis the geometric mean distance of\nfeeders (m),\ndenotes the frequency of the currents\n(Hz),\n(m) represent the distance between\nfeeders and the earth,\nis the earth’s electrical resistivity\n( ).\nMutual Impedance:\nm (9)\nwhere denotes the geometric mean distance (m) between\nthe power feeder and track.\nFig. 5. The infinite ladder equivalent circuit.\nGrounding Resistance:The grounding of railway is usually\nachieved by burying a grounding conductor into the earth. In\nthis type of grounding, the grounding resistancespecified\nby the ANS/IEEE Std.80-1986[10] is\n(10)\nwhere\ndenotes the length of the buried grounding conductors\n(m),\nrepresents the earth’s electrical resistivity, and\nis the diameter of the buried grounding conductors (m).\nThe grounding configuration in a segment of the railway which\nhas power supplied from the same substation is modeled as an\ninfinite ladder equivalent circuit (Fig. 5). In this figure,\nand\ndenote the impedance of railroad tracks and the grounding resis-\ntance respectively. This figure, also reveals that the grounding\nresistance of first and last point is obviously\nin parallel with\nwhere,\n(11)\nA railway system segment is usually with more than 10 km in\nlength and grounded at every 200 m. Therefore, there are at least\n50 ladders for a equivalent circuit of a railway segment. Hence,\nthe error of using equation (11) for Fig. 5 can be less than 5%.\nFor the mutual effects on the return feeders, the geometric mean\nradius of the railway tracks for calculating the impedance of the\nrailway tracks in the equation (11) should be contained all the\nparallel path of the return currents. As to the mutual effects be-\ntween the power feeders and the railway tracks, they are con-\nsidered in the equation (10) and the circuit models, Fig. 3 and\nFig. 4.\nIV . C\nASE STUDIES\nIn this section, we implement the proposed methodology in\na computer program to analyze the earth leakage currents. Also\npresented herein are different cases, including various forms\nof grounding resistance, different locations of trains, various\ndistances between every two ATs, various fault locations, and\ndifferent turn ratios of ATs to predict the leakage currents. The\nparameters of these study cases are described as follows: the\ntype of feeder lines is a hard drawn copper conductor with\nAuthorized licensed use limited to: Tamkang Univ.. Downloaded on March 28,2023 at 03:34:09 UTC from IEEE Xplore.  Restrictions apply. \n274 IEEE TRANSACTIONS ON POWER DELIVERY , VOL. 16, NO. 2, APRIL 2001\nFig. 6. The different values of grounding resistance influences leakage current\ndistribution.\nFig. 7. The curve of the leakage current in response to the distance of two ATs.\n180 mm , self impedance: m /meter, mutual\nimpedance of railroad track: m /meter,\nimpedance of railroad track: m /meter, the\ndistance between two grounding points: 200 m, loading current\nof each train: 800 A.\nA. Simulation Results Under Normal Conditions\nCase 1: Exactly how the changes of grounding resistance in-\nfluence the leakage current distribution is studied herein. Fig. 6\ndisplays how the different values of grounding resistance influ-\nence leakage current distribution. The lower the grounding re-\nsistance, implies a larger leakage current.\nCase 2: The leakage current distribution varying with the\ndistance of two ATs is studied herein. As Fig. 7, plots the curve\nof the leakage current in response to the distance of two ATs.\nFor different resistance, similar results are obtained in which\nthe leakage current decreases with a decreasing distance of two\nATs.\nCase 3: The changes of the leakage current in response to\ndifferent locations of trains are analyzed herein. Fig. 8 illustrates\nFig. 8. The characteristics of the leakage currents influenced by the different\ntrain’s locations.\nFig. 9. The leakage current distribution on i) the normal condition, ii) the fault\non the location 26, and iii) the fault on the location 76.\nthe characteristics of the leakage currents, influenced by the dif-\nferent train’s locations.\nB. Simulation Results of Fault Cases\nCase 4: The leakage current distribution under the most crit-\nical fault case is analyzed herein. Two line-to-track faults oc-\ncurred on the locations 26 and 76, respectively. The following\nparameters are used to calculate the leakage current: The fault\ncurrent are: 15.52 kA, the grounding resistance: 170\n, and the\ndistance between two ATs: 10 km. Fig. 9 displays the leakage\ncurrent distribution on i) the normal condition, ii) the fault on\nthe location 26, and iii) the fault on the location 76.\nCase 5—Effects of the Turn Ratio of ATs:The turn ratio of\nATs is 1 : 1 in normal status. In short-circuit faults, the turn ratio\nvaries. When the changes of the turn ratio exceed 10%, the relay\nis tripped to stop the power supply. In this case, we analyze the\nleakage current distribution with the various turn ratio of ATs\nin the range:\n, where denotes the turn ratio\nof ATs. For and , they are the cases in which\nshort circuit faults occur at the power feeders side and return\nAuthorized licensed use limited to: Tamkang Univ.. Downloaded on March 28,2023 at 03:34:09 UTC from IEEE Xplore.  Restrictions apply. \nCHOU et al.: DISTRIBUTION OF EARTH LEAKAGE CURRENTS IN RAILW AY SYSTEMS WITH DRAIN AUTO-TRANSFORMERS 275\nFig. 10. The leakage current with respect to the turn ratio of ATs.\nfeeders side, respectively. Fig. 10 depicts the leakage current\nwith respect to the turn ratio of ATs.\nV. CONCLUSION\nThis study presents an advanced methodology and a computer\nprogram to accurately predict the leakage current distribution\nin a railway system. The proposed computer program can be\nutilized to analyze how various parameters influence leakage\ncurrents. The proposed model and the computer program allow\nplanners and decision makers to evaluate the distribution of the\nleakage current penetrating into the earth in the proximity of a\nrailway system. Moreover, this program can also analyze other\nsystems that have the configuration of the ladder grounding\nnetwork. Based on the results presented herein, we can con-\nclude that the leakage current of a railway system is increased\nunder one of the following scenarios: i) increasing the distance\nof two ATs, ii) lowering the voltage level, iii) decreasing the\nmutual impedance between power feeders and railroad tracks,\nand iv) reducing the grounding resistance (while decreasing the\nground potential).\nR\nEFERENCES\n[1] H. Hofmann and T. Preston, “Reduction of stray currents and magnetic\nfields from single-phase power distribution systems,” inIEEE/PES 1994\nSummer Meeting, San Francisco, CA, July 24–28, 1994.\n[2] T. Marinoet al., “Hazard at a distance: Effects of exposure to the elec-\ntric and magnetic field of high voltage transmission lines,”Medical Re-\nsearch Engineering, vol. 12, no. 5, pp. 6–9, Nov. 1977.\n[3] S. T. Sobral, V . G. P. Fleury, J. R. Villalba, and D. Mukhedkar, “Decou-\npled method for studying large interconnected grounding systems using\nmicro-computers,”IEEE Trans. on Power Delivery, pt. 1 and 2, vol. 3,\nno. 4, pp. 1536–1552, Oct. 1988.\n[4] S. T. Sobral, J. O. Barbosa, and V . S. Costa, “Ground potential rise\ncharacteristics of urban step-down substations fed by power cable—A\npractical example,”IEEE Trans. on Power Delivery, vol. 3, no. 4, pp.\n1564–1572, Oct. 1988.\n[5] S. T. Sobral, C. A. O. Peixoto, and D. Mulhedkar, “Ground potential dis-\ntribution in the neighborhood of the Itaipu generation complex,”IEEE\nTrans. on Power Delivery, vol. PWRD-1, no. 1, pp. 85–91, Jan. 1986.\n[6] J. R. Carson, “Wave propagation in overhead wire with ground return,”\nBell System Tech. J.S., pp. 539–554, 1926.\n[7] E. B. Rosa and F. W. Grover, “Formulas and tables for the calculation\nof mutual and self-inductance,” U.S. Bureau of Standards Bull, Wash-\nington, D.C., Scientific Paper 169, vol. 8, 1992.\n[8] E. Clarke, Circuit Analysis of AC Power System, General Electric Co.,\nSchenectady, NY , vol. 2, 1950.\n[9] M. A. Anderson,Analysis of Faulted Power Systems: The Iowa State\nUniversity Press/AMES, 1976.\n[10] ANSI/IEEE-Std. 80, 1986.\nChih-Ju Chou received the M.S. degree in electrical engineering from National\nTaiwan Institute Technology in 1986 and Ph.D. degree in electrical engineering\nfrom National Taiwan University in 1994. After that, he joined the faculty of\nChun Yuan Christian University, Taiwan. His major interests are distribution\nsystem analysis and grounding system analysis.\nYing-Tung Hsiaoreceived the B.S. degree in electrical engineering from Na-\ntional Taiwan Institute of Technology in 1986, M.S. and Ph.D. degrees in elec-\ntrical engineering from National Taiwan University in 1989 and 1993, respec-\ntively. After that, he joined the faculty of St. John’s and St. Mary’s Institute of\nTechnology, Taiwan. He is currently an Associate Professor of Electrical En-\ngineering at Tamkang University, Taiwan. His research interests include power\nsystem analysis, optimal theory and motor control.\nAuthorized licensed use limited to: Tamkang Univ.. Downloaded on March 28,2023 at 03:34:09 UTC from IEEE Xplore.  Restrictions apply. ",
  "topic": "Ground",
  "concepts": [
    {
      "name": "Ground",
      "score": 0.8235195875167847
    },
    {
      "name": "Transformer",
      "score": 0.6563386917114258
    },
    {
      "name": "Engineering",
      "score": 0.6403920650482178
    },
    {
      "name": "Leakage (economics)",
      "score": 0.47859808802604675
    },
    {
      "name": "Electrical impedance",
      "score": 0.47649067640304565
    },
    {
      "name": "Electronic engineering",
      "score": 0.4573509097099304
    },
    {
      "name": "Electrical engineering",
      "score": 0.44284284114837646
    },
    {
      "name": "Voltage",
      "score": 0.3667905926704407
    },
    {
      "name": "Macroeconomics",
      "score": 0.0
    },
    {
      "name": "Economics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I151221077",
      "name": "Chung Yuan Christian University",
      "country": "TW"
    },
    {
      "id": "https://openalex.org/I107470533",
      "name": "Tamkang University",
      "country": "TW"
    }
  ],
  "cited_by": 16
}