{
    "title": "Analysis of empirical core loss evaluation methods for non-sinusoidally fed medium frequency power transformers",
    "url": "https://openalex.org/W2121157795",
    "year": 2008,
    "authors": [
        {
            "id": "https://openalex.org/A5021080026",
            "name": "Irma Villar",
            "affiliations": [
                null
            ]
        },
        {
            "id": "https://openalex.org/A5087536904",
            "name": "Alfred Rufer",
            "affiliations": [
                "École Polytechnique Fédérale de Lausanne"
            ]
        },
        {
            "id": "https://openalex.org/A5063907135",
            "name": "U. Viscarret",
            "affiliations": [
                null
            ]
        },
        {
            "id": "https://openalex.org/A5050588030",
            "name": "Frédéric Zurkinden",
            "affiliations": [
                "École Polytechnique Fédérale de Lausanne"
            ]
        },
        {
            "id": "https://openalex.org/A5077776436",
            "name": "Ion Etxeberria‐Otadui",
            "affiliations": [
                null
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2144615846",
        "https://openalex.org/W2165019503",
        "https://openalex.org/W2111794332",
        "https://openalex.org/W6729005938",
        "https://openalex.org/W2109185194",
        "https://openalex.org/W4236419031",
        "https://openalex.org/W2158646993",
        "https://openalex.org/W2135323931",
        "https://openalex.org/W2106572889",
        "https://openalex.org/W1973423500",
        "https://openalex.org/W2138866664",
        "https://openalex.org/W2028247401",
        "https://openalex.org/W1990929519",
        "https://openalex.org/W2007615640",
        "https://openalex.org/W2265368490",
        "https://openalex.org/W2542631174",
        "https://openalex.org/W2098352844",
        "https://openalex.org/W2026934209"
    ],
    "abstract": "Nowadays medium voltage conversion systems, like traction and energy distribution systems, aim to increase power density. Volume, weight and material reduction are gaining the market today. Due to the development of new high power semiconductor devices a new working frequency range is conceived, where magnetic component reduction is feasible. The core element of these new conversion systems is the medium frequency transformer. For an optimized design of the conversion system, the correct determination of transformer core losses is essential. Sinusoidal approaches, accurate enough for line frequency transformers, do not cope with the non-sinusoidal waveforms of future medium voltage conversion systems. In the past few years several empirical methods derived from the original Steinmetz equation have been introduced to determine magnetic core losses for non-sinusoidal waveforms. This paper proposes extended expressions for core loss determination in case of rectangular three level voltage waveforms, typical of high power converters. These expressions are compared in simulation and with experimental results obtained in the same conditions using a reduced scale dc-ac conversion system prototype that includes a 61.6 kVA/2 kHz transformer. It is shown that some of these techniques allow a considerable loss estimation accuracy (error below 12% for any ratio).",
    "full_text": null
}