{
    "title": "Reliability Model of Power Transformer with ONAN Cooling",
    "url": "https://openalex.org/W2129823996",
    "year": 2010,
    "authors": [
        {
            "id": "https://openalex.org/A5002678719",
            "name": "Mobin Sefidgaran",
            "affiliations": [
                null
            ]
        },
        {
            "id": "https://openalex.org/A5057961674",
            "name": "Mohammad Mirzaie",
            "affiliations": [
                null
            ]
        },
        {
            "id": "https://openalex.org/A5009471757",
            "name": "Ataollah Ebrahimzadeh",
            "affiliations": [
                null
            ]
        }
    ],
    "references": [
        "https://openalex.org/W173461568",
        "https://openalex.org/W2103603046",
        "https://openalex.org/W2140417752",
        "https://openalex.org/W1669962393",
        "https://openalex.org/W2038028638",
        "https://openalex.org/W1569468020",
        "https://openalex.org/W2129244332",
        "https://openalex.org/W3214768147",
        "https://openalex.org/W2112646393",
        "https://openalex.org/W2147753186"
    ],
    "abstract": "Reliability of a power system is considerably influenced by its equipments. Power transformers are one of the most critical and expensive equipments of a power system and their proper functions are vital for the substations and utilities. Therefore, reliability model of power transformer is very important in the risk assessment of the engineering systems. This model shows the characteristics and functions of a transformer in the power system. In this paper the reliability model of the power transformer with ONAN cooling is obtained. The transformer is classified into two subsystems. Reliability model of each subsystem is achieved. Markov process representation and the frequency/ duration approach are employed to obtain a complete reliability model of the subsystems. By combining these models reliability model of power transformer is obtained. The reliability model associated with the transformer is then proposed combining the models of subsystems. The proposed model contains five states. To make the model more applicable, the 5-state model is alleviated to a 3-state one. Numerical analysis and sensitivity analysis relevant to the proposed reliability model are performed for evaluating the numerical values of the model parameters and the impact of different components on the reliability of the model.",
    "full_text": null
}