{
  "title": "GeneSrF and varSelRF: a web-based tool and R package for gene selection and classification using random forest",
  "url": "https://openalex.org/W2125697820",
  "year": 2007,
  "authors": [
    {
      "id": "https://openalex.org/A5080620893",
      "name": "Ramón Díaz‐Uriarte",
      "affiliations": [
        "Spanish National Cancer Research Centre"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1520812622",
    "https://openalex.org/W2107956883",
    "https://openalex.org/W2043235003",
    "https://openalex.org/W1996655954",
    "https://openalex.org/W2022441134",
    "https://openalex.org/W2034613288",
    "https://openalex.org/W2157132621",
    "https://openalex.org/W2091947792",
    "https://openalex.org/W2038818175",
    "https://openalex.org/W1953939973",
    "https://openalex.org/W1992451590",
    "https://openalex.org/W1499111884",
    "https://openalex.org/W2157219065",
    "https://openalex.org/W1875061881",
    "https://openalex.org/W3125904670",
    "https://openalex.org/W118074277",
    "https://openalex.org/W2141007997",
    "https://openalex.org/W343233802",
    "https://openalex.org/W2582743722",
    "https://openalex.org/W193615737",
    "https://openalex.org/W4301014558",
    "https://openalex.org/W625640516",
    "https://openalex.org/W3189823449",
    "https://openalex.org/W2132536544",
    "https://openalex.org/W273955616",
    "https://openalex.org/W2149234583",
    "https://openalex.org/W2127314075",
    "https://openalex.org/W3046179202"
  ],
  "abstract": null,
  "full_text": "BioMed Central\nPage 1 of 7\n(page number not for citation purposes)\nBMC Bioinformatics\nOpen AccessSoftware\nGeneSrF and varSelRF: a web-based tool and R package for gene \nselection and classification using random forest\nRamón Diaz-Uriarte\nAddress: Statistical Computing Team, Structural Biology and Biocomputing Programme, Spanish National Cancer Center (CNIO), Melchor \nFernández Almagro 3, Madrid, 28029, Spain\nEmail: Ramón Diaz-Uriarte - rdiaz02@gmail.com\nAbstract\nBackground: Microarray data are often us ed for patient classificati on and gene selection. An\nappropriate tool for end users and biomedical re searchers should combine user friendliness with\nstatistical rigor, including carefully avoiding selection biases and allowing analysis of multiple\nsolutions, together with acce ss to additional f unctional information of selected genes.\nMethodologically, such a tool would be of greater use if it incorporates state-of-the-art\ncomputational approaches and makes source code available.\nResults: We have developed GeneSrF,  a web-based tool, and varS elRF, an R package, that\nimplement, in the context of patient classification, a validated method for selecting very small sets\nof genes while preserving classi fication accuracy. Computation is  parallelized, allowing to take\nadvantage of multicore CPUs and clusters of  workstations. Output includes bootstrapped\nestimates of prediction error rate, and assessments of the stability of the solutions. Clickable tables\nlink to additional information for each gene (G O terms, PubMed citations, KEGG pathways), and\noutput can be sent to PaLS for examination of PubMed references, GO terms, KEGG and and\nReactome pathways characteristic  of sets of genes selected for class prediction. The full source\ncode is available, allowing to extend the software. The web-based application is available from http:/\n/genesrf2.bioinfo.cnio.es. All source code is available from  Bioinformatics.org or The Launchpad.\nThe R package is also available from CRAN.\nConclusion: varSelRF and GeneSrF implement a validate d method for gene selection including\nbootstrap estimates of classifica tion error rate. They are valuable tools for applied biomedical\nresearchers, specially for exploratory work wi th microarray data. Be cause of the underlying\ntechnology used (combination of parallelizatio n with web-based application) they are also of\nmethodological interest to bioinformaticians and biostatisticians.\nBackground\nPatient classification and gene selection related to classifi-\ncation are common uses of microarray data (e.g., review\nand references in [1]), but statistically rigorous and user-\nfriendly tools for gene selection in the context of class pre-\ndiction are rare. Such a tool should address two major\nissues. First, it should provide unbiased estimates of the\nprediction error rate of the procedure. Most users are by\nnow aware of \"selection bias\", as originally reported in\n[2,3], but bias caused by trying different methods and/or\nsets of genes, and choosing the one with the smallest\ncross-validated error rate [4] is still not widely recognized.\nPublished: 3 September 2007\nBMC Bioinformatics 2007, 8:328 doi:10.1186/1471-2105-8-328\nReceived: 22 March 2007\nAccepted: 3 September 2007\nThis article is available from: http://www.biomedcentral.com/1471-2105/8/328\n© 2007 Diaz-Uriarte; licensee BioMed Central Ltd. \nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/2.0), \nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.\nBMC Bioinformatics 2007, 8:328 http://www.biomedcen tral.com/1471-2105/8/328\nPage 2 of 7\n(page number not for citation purposes)\nIn this later case we need a nested [4] or double or full\ncross-validation [5] to estimate the error rate of the rule or\nprocedure. Second, we need to assess the so called multi-\nplicity (or lack of uniqueness) problem: variable selection\nwith microarray data can lead to many solutions that have\nsimilar prediction errors, but that share few common\ngenes [1,6-9]. Choosing any one particular set of genes\nwithout being aware of the variability in solutions can\nlead to a false sense of certainty in the selected set.\nFrom a users' perspective, an ideal tool should also be user\nfriendly and provide additional resources to ease the inter-\npretation of results [10]. Web-based tools are an excellent\nplatform as they do not require software installation or\nupgrades from the user. In addition, web based tools, can\nbe designed to allow easy access to information such as\nGene Ontology terms, the UCSC and Ensembl databases,\nKEGG and Reactome pathways, or PubMed references,\nthus enhancing the biological interpretation of results\n[11]. Moreover, web-based tools, if implemented appro-\npriately, can harvest computational resources rarely avail-\nable to most individual users [10], including the\nincreasing availability of multicore processors and easily\naccessible clusters made with off-the-shelf components\n[12]. Currently, the major opportunities for improved\nperformance as well as the ability to analyze ever larger\ndata sets do not lie in faster CPUs but in being able to use\nparallel and distributed computing to exploit multi-core\nservers and clusters [13,14]. In addition to providing a\nbenefit to the end user (decreased execution time), tools\nthat combine parallelization with web-based program-\nming are important methodological developments.\nFinally, a tool that fulfills the above requirements is of\nmuch greater relevance if it makes its source code availa-\nble under an open-source license. Source code availability\nallows the research community to experiment with, and\nimprove upon, the method and fix bugs, encourages\nreproducible research, allows to verify claims by method\ndevelopers, makes the international research community\nthe owner of the tools needed to carry out its work and,\nthus, creates the conditions for swift progress upon previ-\nous work, concerns of particular importance in bioinfor-\nmatics [15,16].\nWe have developed GeneSrF and varSelRF (a web-based\napplication and R package, respectively), that satisfy the\nabove requirements. The only available web-based tools\nwith similar scope are M@CBETH [17] and Prophet [18].\nThese tools, however, do not examine the multiplicity\nproblem, cannot benefit from multicore processors or\ncomputing clusters, and do not make source code availa-\nble. M@CBETH, in addition, is restricted to two-class\nproblems and does not focus on the gene selection prob-\nlem. Prophet, in turn, does not seem to solve satisfactorily\nthe biased error rate problem (it reports the error rate as\nthat of the classifier with smallest cross-validated error\nrate, without evaluating the error rate of the rule itself).\nImplementation\nThe core statistical functionality is provided by the var-\nSelRF package for R [19]. This package implements the\nprocedure in [1] for gene selection using random forests,\nbuilding upon the randomForest package [20], an R port\nby A. Liaw and M. Wiener of the original code by L. Brei-\nman and A. Cutler. We use MPI [21] for parallelization via\nthe R-packages Rmpi [22] by H. Yu, and Snow [23] by L.\nTierney, A. J. Rossini, Na Li and H. Sevcikova. In the web-\nbased application, the CGI, initial data validation, and the\nsetting-up and closing of the parallel infrastructure (boot-\ning and halting the LAM/MPI universes) is implemented\nwith Python. Our installation runs on a cluster of 30\nnodes, each with two dual-core AMD Opteron processors\n(see Figure 1 for details).\nThe input for the web-based application are either plain\ntext files, or files that come from other tools of the Asterias\nsuite [12]. GeneSrF has been running in production use\nfor over a year. Further documentation and examples for\nthe web-based application are available from its on-line\nhelp, and for the R package from the standard R documen-\ntation system. A fully commented example of the output\nis provided in the on-line help [24]. Sample output is\nshown in Figure 1. Bug-tracking and additional tests are\navailable from Bioinformatics.org and The Launchpad.\nBenchmarks and run time\nThe parallelization has been implemented over bootstrap\nresamples. The speedups achieved by parallelizing are\nshown in Figure 2a), where we plot the fold increase in\nspeed achieved by increasing the number of Rslaves (con-\ncurrently executing R processes). Parallelization makes a\ndramatic difference in speed for all the data sets shown.\nUp to 20 Rmpi slaves, the increases in speed are almost\nlinear with number of slaves. Beyond 20 slaves, speed\nincreases are slower with number of slaves: as is known\nfrom the parallelization literature [21,25], in addition to\nnumber of CPUs other factors can become limiting, in our\ncase most likely bandwith and latency of inter-node com-\nmunication, and potential bottlenecks from memory and\ncache in nodes made of dual-core processors [26].\nThe scaling of user wall time of the R code (varSelRFBoot)\nwith number of arrays and number of genes is shown in\nFigure 2b), with the default parallelization scheme and\nwith a data set that allows for exploring a range of num-\nbers of arrays and genes. User wall time increases approx-\nimately linearly with the number of arrays and number of\ngenes over a realistic range of arrays and genes (e.g., when\nBMC Bioinformatics 2007, 8:328 http://www.biomedcen tral.com/1471-2105/8/328\nPage 3 of 7\n(page number not for citation purposes)\nExample outputFigure 1\nExample output. Some figures from the output of the web-based application (see [24]). a) Out-of-bag error rate vs. the \nnumber of genes in the class prediction model, for both the complete, original data set (red line) and the 200 bootstrap sam-\nples (black lines). These figures can help identify the best number of genes in the class prediction model. It seems, that we can \ndo fairly well using just 2 genes in our model. This is the conclussion we reach both with the complete, original data set and the \nbootstrap samples. b) Probability of class membership of each sample, from out-of-bag samples (i.e., bootstrap runs where the \nsample was not included in the training group). Most samples are well classified, specially those from class ALL (their average \nout of bag probability of membership in their true class is larger than 0.75). c) Importance spectrum plots can help decide on \nthe number of \"relevant variables\": we compare the variable importance plots from the original data with variable importance \nplots that are generated when the class labels and the predictors are independent (class labels are randomly permuted). In this \ncase the first 30 variables have importances well above those from sets with randomly permuted class labels. d) Selection prob-\nability plots: for each of the top ranked genes from the original sample, the probability that it is included among the top ranked \nk genes (blue: k = 20; red: k = 100) from the (200) bootstrap samples. Thus, these plots can be a measure of our confidence in \nthe stability of choosing a number of k ranked genes. In this case, with k = 20 only the two or three most important genes are \nrepeatedly chosen among the best 20. If we select the first 100 genes, the 30 best ranked ones appear at least in 75% of the \nbootstrap samples.\n\nBMC Bioinformatics 2007, 8:328 http://www.biomedcen tral.com/1471-2105/8/328\nPage 4 of 7\n(page number not for citation purposes)\nBenchmarks and run timeFigure 2\nBenchmarks and run time. a) Fold increase in speed from parallelization. Ratios of the user wall time of execution of the R \ncode (varSelRFBoot without previous model fit) between a run with a single Rmpi slave and runs with different numbers of \nRmpi slaves (the number of simultaneously executing R processes) for five data sets (see [1] for details). In the legend, in paren-\ntheses the user wall time of the execution with a single Rmpi slave for each data set. In all cases (except \"1\", \"60(2)\", and \n\"90(3)\") there were four Rmpi slaves per node. The timings were obtained in an otherwise idle cluster with 30 nodes, each \nwith two dual-core AMD Opteron 2.2 GHz CPUs and 6 GB RAM, running Debian GNU/Linux and a stock 2.6.8 kernel, with \nversion 7.1.2 of LAM/MPI and version 2.1.4 (patched) of R. The values for \"60(2)\" refer two a configuration with 2 slaves per \nnode (recall that a node with two dual core CPUs is not identical to a node with 4 CPUs), and the value \"90(3)\" to a configura-\ntion with 3 slaves per node. b) Scaling of user wall time. User wall time as a function of number of arrays and number of genes \nwhen executing the R function varSelRFBoot without previous model fit. Shown are three replicate runs. In each run, the \narrays and genes are selected randomly from the complete original data set. Further details about the Prostate data set from \n[1]. Hardware and software as above. We used 4 Rmpi slaves per node (and, thus, a total of 120 slaves). c) User wall time of \nthe web-based application. User wall time for complete runs (i.e., including upload of files and return of complete HTML page) \nfor ten different data sets (see details in [1]). Under the name of each data set, the number of arrays and the number of genes \nare indicated. For each data set, three replicate runs were conducted. Hardware and software configuration as above, with the \ndefault settings for the web-based application (4 Rmpi slaves per node, and thus a total of 120 slaves).\n\nBMC Bioinformatics 2007, 8:328 http://www.biomedcen tral.com/1471-2105/8/328\nPage 5 of 7\n(page number not for citation purposes)\nwe double the number of arrays from 40 to 80 the user\nwall time increases by a factor of slightly over 2).\nThe run time for the web-based application for a wide\nrange of data sets is shown Figure 2c). These timings\ninclude the time needed to upload the files (and thus can\nbe affected by internet connection speed) and to prepare\nand return to the user the final figures. Note that in most\ncases the complete analysis is finished within 20 minutes.\nScripts for timing experiments are included with the\nsource code (directory \"Benchmarks\").\nResults and discussion\nOur procedure is explicitly targeted to select very small\nsets of genes, and has been shown [1] to have a classifica-\ntion error rate on-par with other, state-of-the-art, classifi-\ncation procedures. Additionally, our programs allow the\nexploratory usage of random forest for identifying large\nsubsets of genes potentially relevant for class prediction.\nIn contrast to other tools, such as M@CBETH [17], we are\nnot restricted to two-class problems.\nTo avoid underestimating the error rate of the classifica-\ntion procedure, we use the bootstrap (the 0.632+\napproach of [27]). As in [1], we bootstrap the complete\nprocedure, including selecting the classifier with minimal\nout-of-bag error rate (thus, this is a \"full\" or \"double\"\nbootstrap procedure, sensu [5]), and thus our estimates of\nerror rate are not affected by selection biases. This con-\ntrasts, for instance, with Prophet [18], where the error rate\nreported is that of the classifier with the smallest cross-val-\nidated error rate. Based upon the bootstrap results, we also\nshow the average out-of-bag predictions for each sample,\nallowing to easily asses poorly predicted samples and\npotential outliers. There are other tools available for per-\nforming cross-validation and bootstrap of classification\nmethods, such as the R package ipred [28] by A. Peters and\nT. Hothorn, the BioConductor package MCRestimate [29]\nby M. Ruschhaupt, U. Mansmann, P. Warnat, W. Huber\nand A. Benner, specifically targeted to computing misclas-\nsification error rates combining the gene selection and\nclassification steps, or the caGEDA web application [10]\nthat incorporates bootstrap, leave-one-out, and random\nresampling validation of several classifiers. Our approach,\nhowever, has been tailored to our own variable selection\nprocedure and has been parallelized. A unique feature of\nGeneSrF and varSelRF are their emphasis on examining\npossible multiple solutions.\nSince we obtain 200 resamples in the process of boot-\nstrapping (see above) there is little added computational\ncost to providing analysis of stability and multiplicity of\nsolutions. We report the number of genes selected and the\nidentity of the individual genes selected in the original\nsample and the 200 bootstrap runs, including frequencies\nof every gene selected in the solutions. Moreover, the bio-\nlogical interpretation of the results is enhanced by the\naccess to additional information. If the input file contains\ngene identifiers for either human, mouse, or rat genomes\n(in the form of Affymetrix IDs, Clone IDs, GenBank Acces-\nsion numbers, Ensembl Gene IDs, Unigene clusters, or\nEntrez Gene IDs), for each gene in the results, the web-\nbased application provides a link to IDClight [11], which\nallows the user to obtain additional information, includ-\ning mapping between gene and protein identifiers,\nPubMed references, Gene Ontology terms, and KEGG and\nReactome pathways. The multiple solutions can be further\nstudied by sending sets of selected genes to our tool PaLS\n[30] to examine PubMed references, Gene Ontology\nterms, KEGG pathways, or Reactome pathways that are\ncommon to a user-selected percentage of genes or lists\n(bootstrap solutions). A fully commented example of the\noutput is provided in the on-line help [24].\nFinally, GeneSrF is one of the very few tools for the analy-\nsis of gene expression data that uses parallelization and, as\nfar as we know, the only web-based tool to use paralleli-\nzation for gene selection and classification. This is an\nimportant methodological novelty, as we can no longer\nexpect that increases in single-CPU speed will allow us to\nanalyze larger data sets in shorter time: the rate of increase\nin CPU speed has slowed down considerably in the last\nfive years but, in contrast, increasing numbers of CPU\ncores (either in individual machines – including laptops –\nor via off-the-shelf computing clusters) are becoming\nmuch more affordable [13,14]. Thus, further decreases in\nuser wall time (time to wait for a result) and ability to\ntackle more complex problems will depend on our ability\nto use parallel, distributed, and concurrent programming.\nGeneSrF therefore represents a case example on combin-\ning parallel computing with a user-friendly web-based\napplication for the analysis of gene expression data and,\nby making the full source code available, allows other\nresearchers to build upon our developments.\nFuture work focuses on extending the software to use ran-\ndom forest-related techniques applicable to heterogene-\nous types of variables such as addition of categorical data\n[31] and other clinical information. As well, we are\nexploring alternative mechanisms and languages for par-\nallelizing and distributing computations, and we are\nrewriting most of the code using Pylons [32], a Python\nweb framework, to try to simplify installation of the web-\nbased application. Installation now involves several steps\n(see [33]), and the most time consuming are setting up\nand verifying the LAM/MPI environment, and using the\ncorrect paths in files involved in controlling the MPI envi-\nronment and executing and controlling R.\nBMC Bioinformatics 2007, 8:328 http://www.biomedcen tral.com/1471-2105/8/328\nPage 6 of 7\n(page number not for citation purposes)\nConclusion\nvarSelRF and GeneSrF implement a validated method for\ngene selection and provide bootstrap estimates of classifi-\ncation error rate, take advantage of computing clusters\nand multicore processors, and encourage careful examina-\ntion of the multiplicity of solutions problems. Thus, these\nare both useful tools for applied biomedical researchers\nusing microarray and gene expression data, and represent\nunique methodological developments in the area of web-\nbased gene expression analysis tools.\nAvailability and requirements\nFor GeneSrF:\nProject name: GeneSrF\nProject home page: http://genesrf2.bioinfo.cnio.es\nOperating system: Platform independent (web-based\napplication)\nProgramming language: R, Python\nOther requirements: A web browser.\nLicense: None for usage. Web-based code: Affero GPL\n(open source).\nAny restrictions to use by non-academics: None.\nFor varSelRF:\nProject name: varSelRF\nProject home page: http://launchpad.net/varselrf\nOperating system: Linux, Unix\nProgramming language: R, Python\nOther requirements: LAM/MPI\nLicense: GNU GPL\nAny restrictions to use by non-academics: None\nAbbreviations\nCGI, Common Gateway Interface; GO, Gene Ontology;\nKEGG, Kyoto Encyclopedia of Genes and Genomes; LAM,\nLocal Area Multicomputer; MPI, Message Passing Inter-\nface.\nAcknowledgements\nA. Alibés and A. Cañada for their work on IDClight and PaLS. Two anony-\nmous reviewers for comments that improved the manuscript. Bioinformat-\nics.org and The Launchpad for project and repository hosting. Funding \nprovided by Fundación de Investigación Médica Mutua Madrileña and \nProject TIC2003-09331-C02-02 of the Spanish Ministry of Education and \nScience (MEC). R.D.-U. is partially supported by the Ramón y Cajal pro-\ngramme of the Spanish MEC.\nReferences\n1. Díaz-Uriarte R, Alvarez de Andrés S: Gene selection and classifi-\ncation of microarray data using random forest.  BMC Bioinfor-\nmatics 2006, 7():3.\n2. Ambroise C, McLachlan GJ: Selection bias in gene extraction on\nthe basis of microarray  gene-expression data.   Proc Natl Acad\nSci USA 2002, 99(10):6562-6566.\n3. Simon R, Radmacher MD, Dobbin K, McShane LM: Pitfalls in the\nuse of DNA microarray data fo r diagnostic and prognostic\nclassification.  Journal of the National Cancer Institute 2003, 95:14-18.\n4. Varma S, Simon R: Bias in error estimation when using cross-\nvalidation for model selection.  BMC Bioinformatics 2006, 7:.\n5. Dudoit S, Fridlyand J: Classification in microarray experiments.\nIn Statistical analysis of gene expression microarray data Edited by: Speed\nT. New York: Chapman & Hall; 2003:93-158. \n6. Somorjai RL, Dolenko B, Baumgartner R: Class prediction and dis-\ncovery using gene microarra y and proteomics mass spec-\ntroscopy data: curses, caveats, cautions.   Bioinformatics 2003,\n19:1484-1491.\n7. Pan KH, Lih CJ, Cohen SN: Effects of threshold choice on biolog-\nical conclusions reached during analysis of gene expression\nby DNA microarrays.   Proc Natl Acad Sci USA  2005,\n102:8961-8965.\n8. Ein-Dor L, Kela I, Getz G, Givol D, Domany E: Outcome signature\ngenes in breat cancer: is there a unique set?  Bioinformatics 2005,\n21:171-178.\n9. Michiels S, Koscielny S, Hill C: Prediction of cancer outcome\nwith microarrays: a multiple  random validation strategy.\nLancet 2005, 365:488-492.\n10. Patel S, Lyons-Weiler J: caGEDA: a web application for the inte-\ngrated analysis of global gene expression patterns in cancer.\nApplied Bioinformatics 2004, 3:49-62.\n11. Alibés A, Yankilevich P, Cañada A, Diaz-Uriarte R: IDconverter and\nIDClight: conversion and annotation of gene and protein IDs.\nBMC Bioinformatics 2007, 8:9.\n12. Diaz-Uriarte R, Alibés A, Morrissey ER, Cañada A, Rueda O, Neves\nML: Asterias: integrated analys is of expression and aCGH\ndata using an open-source, web-based, parallelized software\nsuite.  Nucleic Acids Research 2007, 35:W75-W80.\n13. Sutter H: The Free Lunch Is Over: A Fundamental Turn\nToward Concurrency in Software.   Dr Dobb's Journal  2005,\n30(3):202-210.\n14. Kontoghiorghes EJ: Handbook of Parallel Computing and Statistics  Boca\nRaton, FL: Chapman & Hall, CRC; 2006. \n15. Dudoit S, Gentleman RC, Quackenbush J: Open source software\nfor the analysis of microarray data.  Biotechniques 2003:45-51.\n16. Díaz-Uriarte R: Supervised methods wi th genomic data: a\nreview and cautionary view.   In Data analysis and visualization in\ngenomics and proteomics  Edited by: Azuaje F, Dopazo J. New York:\nWiley; 2005:193-214. \n17. Pochet NL, Janssens FA, De Smet F, Marchal K, Suykens JA, De Moor\nBL: M@CBETH: a microarray classification benchmarking\ntool.  Bioinformatics 2005, 21:3185-3186.\n18. Medina I, Montaner D,  Tarraga J, Dopazo J: Prophet, a web-based\ntool for class prediction using microarray data.  Bioinformatics\n2006 in press.\n19. R Development Core Team: R: A language and environment for statisti-\ncal computing 2004 [http://www.R-project.org]. R Foundation for Sta-\ntistical Computing, Vienna, Austria [ISBN 3-900051-00-3]\n20. Liaw A, Wiener M: Classification and Regression by random-\nForest.  R News  2002, 2(318-22 [http://CRAN.R-project.org/doc/\nRnews/].\n21. Pacheco P: Parallel programming with MPI  San Francisco: Morgan\nkaufman; 1997. \n22. Yu H: Rmpi: Interface (Wrapper) to MPI (Message-Passing Interface)\n[http://www.stats.uwo.ca/faculty/yu/Rmpi].\n23. Tierney L, Rossini AJ, Li N, Sevcikova H: snow: Simple Network of Work-\nstations  [http://cran.r-project.org/src/contrib/Descriptions/\nsnow.html].\nPublish with BioMed Central   and  every \nscientist can read your work free of charge\n\"BioMed Central will be the most significant development for \ndisseminating the results of biomedical research in our lifetime.\"\nSir Paul Nurse, Cancer Research UK\nYour research papers will be:\navailable free of charge to the entire biomedical community\npeer reviewed and published immediately upon acceptance\ncited in PubMed and archived on PubMed Central \nyours — you keep the copyright\nSubmit your manuscript here:\nhttp://www.biomedcentral.com/info/publishing_adv.asp\nBioMedcentral\nBMC Bioinformatics 2007, 8:328 http://www.biomedcen tral.com/1471-2105/8/328\nPage 7 of 7\n(page number not for citation purposes)\n24. GeneSrF on-line commented example   [http://genesrf2.bioinfo.cnio.es/\nExamples/Leukemia/results.html].\n25. Foster I: Designing and buildin g parallel programs  Edited by: . Boston:\nAddison Wesley; 1995. \n26. Dongarra J, Gannon D, Fox G, Kenned K: The Impact of Multicore\non Computational Science Software.   CTWatch Quarterly 2007,\n3:3-10.\n27. Efron B, Tibshirani RJ: Improvements on cross-validation: the\n.632+ bootstrap method.   J American Statis tical Association 1997,\n92:548-560.\n28. Peters A, Hothorn T: ipred: Improvedt Predictors   [ h t t p : / / c r a n . r -\nproject.org/src/contrib/Descriptions/ipred.html].\n29. Ruschhaupt M, Mansmann U, Warnat P, Huber W, Benner A:\nMCRestimate  [http://www.bioconductor.org/packages/1.9/bioc/html/\nMCRestimate.html].\n30. PaLS  [http://pals.bioinfo.cnio.es].\n31. Strobl C, Boulesteix AL, Zeileis A, Hothorn T: Bias in Random\nForest Variable Importance Measures: Illustrations, Sources\nand a Solution.  BMC Bioinformatics 2007, 8:25.\n32. Pylons  [http://pylonshq.com].\n33. Download page   [http://bioinformatics.or g/asterias/wiki/Main/Down\nloadPage].",
  "topic": "Computer science",
  "concepts": [
    {
      "name": "Computer science",
      "score": 0.7771034836769104
    },
    {
      "name": "Source code",
      "score": 0.6098892688751221
    },
    {
      "name": "Data mining",
      "score": 0.5696280002593994
    },
    {
      "name": "Context (archaeology)",
      "score": 0.5383867025375366
    },
    {
      "name": "Selection (genetic algorithm)",
      "score": 0.527739405632019
    },
    {
      "name": "Software",
      "score": 0.4575859606266022
    },
    {
      "name": "Machine learning",
      "score": 0.44189244508743286
    },
    {
      "name": "R package",
      "score": 0.43192580342292786
    },
    {
      "name": "Web application",
      "score": 0.42015740275382996
    },
    {
      "name": "World Wide Web",
      "score": 0.12321078777313232
    },
    {
      "name": "Programming language",
      "score": 0.10355645418167114
    },
    {
      "name": "Paleontology",
      "score": 0.0
    },
    {
      "name": "Biology",
      "score": 0.0
    }
  ]
}