{
  "title": "Detailed analysis of evolution of the state of polarization in all-fiber polarization transformers",
  "url": "https://openalex.org/W2132041385",
  "year": 2006,
  "authors": [
    {
      "id": "https://openalex.org/A2130116964",
      "name": "Xiushan Zhu",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A1997619503",
      "name": "Ravi Jain",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2052824282",
    "https://openalex.org/W2127575540",
    "https://openalex.org/W2043517333",
    "https://openalex.org/W2057108657",
    "https://openalex.org/W2145974679",
    "https://openalex.org/W1982765314",
    "https://openalex.org/W2015088213",
    "https://openalex.org/W2026885561",
    "https://openalex.org/W2145105961",
    "https://openalex.org/W2081539977",
    "https://openalex.org/W2003211374",
    "https://openalex.org/W1987201545",
    "https://openalex.org/W2103203918",
    "https://openalex.org/W1964762292"
  ],
  "abstract": "We present a detailed analysis of key attributes and performance characteristics of controllably-spun birefringent-fiber-based all-fiber waveplates or \"all fiber polarization transformers\" (AFPTs), first proposed and demonstrated by Huang [11]; these AFPTs consist essentially of a long carefully-designed \"spin-twisted\" high-birefringence fiber, fabricated by slowly varying the spin rate of a birefringent fiber preform (either from very fast to very slow or vice versa) while the fiber is being drawn. The evolution of the eigenstate from a linear polarization state to a circular polarization state, induced by slow variation of the intrinsic structure from linear anisotropy at the unspun end to circular anisotropy at the fast-spun end, enables the AFPT to behave like an all-fiber quarter-wave plate independent of the wavelength of operation. Power coupling between local eigenstates causes unique evolution of the polarization state along the fiber, and has been studied to gain insight into - as well as to understand detailed characteristics of -- the polarization transformation behavior. This has been graphically illustrated via plots of the relative power in these local eigenstates as a function of distance along the length of the fiber and plots of the extinction ratio of the output state of polarization (SOP) as a function of distance and the normalized spin rate. Deeper understanding of such polarization transformers has been further elucidated by quantitative calculations related to two crucial requirements for fabricating practical AFPT devices. Our calculations have also indicated that the polarization mode dispersion behaviour of the AFPT is much smaller than that of the original birefringent fiber. Finally, a specific AFPT was experimentally investigated at two widely-separated wavelengths (1310 nm and 1550 nm) of interest in telecommunications systems applications, further demonstrating and elucidating the broadband character of such AFPTs.",
  "full_text": null,
  "topic": "Birefringence",
  "concepts": [
    {
      "name": "Birefringence",
      "score": 0.7399145364761353
    },
    {
      "name": "Polarization mode dispersion",
      "score": 0.650233268737793
    },
    {
      "name": "Polarization-maintaining optical fiber",
      "score": 0.6356720328330994
    },
    {
      "name": "Optics",
      "score": 0.5960756540298462
    },
    {
      "name": "Polarization (electrochemistry)",
      "score": 0.5490581393241882
    },
    {
      "name": "Polarization rotator",
      "score": 0.52037113904953
    },
    {
      "name": "Materials science",
      "score": 0.4628879725933075
    },
    {
      "name": "Anisotropy",
      "score": 0.43992945551872253
    },
    {
      "name": "Photonic-crystal fiber",
      "score": 0.42947423458099365
    },
    {
      "name": "Wavelength",
      "score": 0.4046083092689514
    },
    {
      "name": "Optical fiber",
      "score": 0.39621874690055847
    },
    {
      "name": "Physics",
      "score": 0.33370721340179443
    },
    {
      "name": "Fiber optic sensor",
      "score": 0.24180695414543152
    },
    {
      "name": "Chemistry",
      "score": 0.0
    },
    {
      "name": "Physical chemistry",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I169521973",
      "name": "University of New Mexico",
      "country": "US"
    }
  ],
  "cited_by": 11
}