{
    "title": "Design of a Linear Variable Differential Transformer With High Rejection to External Interfering Magnetic Field",
    "url": "https://openalex.org/W2130811514",
    "year": 2010,
    "authors": [
        {
            "id": "https://openalex.org/A2101280372",
            "name": "M. Martino",
            "affiliations": [
                "University of Naples Federico II",
                "European Organization for Nuclear Research"
            ]
        },
        {
            "id": "https://openalex.org/A2684439759",
            "name": "A. Danisi",
            "affiliations": [
                "European Organization for Nuclear Research",
                "University of Naples Federico II"
            ]
        },
        {
            "id": "https://openalex.org/A2086088621",
            "name": "R. Losito",
            "affiliations": [
                "European Organization for Nuclear Research"
            ]
        },
        {
            "id": "https://openalex.org/A2095589838",
            "name": "A. Masi",
            "affiliations": [
                "European Organization for Nuclear Research"
            ]
        },
        {
            "id": "https://openalex.org/A2115380512",
            "name": "G. Spiezia",
            "affiliations": [
                "European Organization for Nuclear Research"
            ]
        },
        {
            "id": "https://openalex.org/A2101280372",
            "name": "M. Martino",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2684439759",
            "name": "A. Danisi",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2086088621",
            "name": "R. Losito",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2095589838",
            "name": "A. Masi",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2115380512",
            "name": "G. Spiezia",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2039531471",
        "https://openalex.org/W6774091118",
        "https://openalex.org/W2133075019",
        "https://openalex.org/W2038032086",
        "https://openalex.org/W2057158716",
        "https://openalex.org/W2155409942",
        "https://openalex.org/W2102624812",
        "https://openalex.org/W2102740565",
        "https://openalex.org/W4240494919",
        "https://openalex.org/W2173415920",
        "https://openalex.org/W2040509855",
        "https://openalex.org/W2109599552",
        "https://openalex.org/W2157262646",
        "https://openalex.org/W2024862818",
        "https://openalex.org/W3008465345",
        "https://openalex.org/W3097626152",
        "https://openalex.org/W2106441954",
        "https://openalex.org/W582658627",
        "https://openalex.org/W2851417117"
    ],
    "abstract": "The sensitivity of linear variable differential transformer (LVDT) position sensors to external slowly varying magnetic fields represents a critical issue when these sensors are installed close to high-current cables or electrical motors with significant fringe fields. The resulting position error can reach several hundreds of micrometers against a specified uncertainty normally below a few micrometers. In this paper, the design of a LVDT position sensor with high rejection to external constant or slowly varying magnetic fields is addressed by exploiting the finite element method (FEM) simulator FLUX. A shield, isolated from the sensor's magnetic circuit, has been considered to reduce the effect of magnetic fields on the secondary voltages of the LVDT. In addition, a dc current is used in order to polarize the magnetic circuit to reduce the sensitivity of the sensor to external interferences.",
    "full_text": "674 IEEE TRANSACTIONS ON MAGNETICS, VOL. 46, NO. 2, FEBRUARY 2010\nDesign of a Linear Variable Differential Transformer With High Rejection\nto External Interfering Magnetic Field\nM. Martino/49 /59 /50 , A. Danisi /49 /59 /51 , R. Losito /49 , A. Masi /49 , and G. Spiezia /49\nCERN, EN/STI Group, Geneva 1211, Switzerland\nElectrical Engineering Department, University of Naples “Federico II,” Naples 80138, Italy\nElectronic and Telecommunications Engineering Department, University of Naples “Federico II,” Naples 80138, Italy\nThe sensitivity of linear variable differential transformer (LVDT) position sensors to external slowly varying magnetic ﬁelds represents\na critical issue when these sensors are installed close to high-current cables or electrical motors with signiﬁcant fringe ﬁelds. The resulting\nposition error can reach several hundreds of micrometers against a speciﬁed uncertainty normally below a few micrometers. In this\npaper, the design of a LVDT position sensor with high rejection to external constant or slowly varying magnetic ﬁelds is addressed by\nexploiting the ﬁnite element method (FEM) simulator FLUX. A shield, isolated from the sensor’s magnetic circuit, has been considered\nto reduce the effect of magnetic ﬁelds on the secondary voltages of the LVDT. In addition, a dc current is used in order to polarize the\nmagnetic circuit to reduce the sensitivity of the sensor to external interferences.\nIndex Terms—Linear Variable Differential Transformer (LVDT), magnetic interference, magnetic shielding.\nI. I NTRODUCTION\nT\nHE linear variable differential transformer (LVDT) is one\nof the position sensors most used in harsh environments,\nsuch as industrial plants, nuclear plants, and particle acceler-\nators, thanks to contactless sensing, good linearity, virtually\ninﬁnite resolution, low temperature sensitivity, robustness,\nand easy-to-implement radiation hardness [1]. As an example,\nLVDT sensors have been selected for the LHC (Large Hadron\nCollider) collimators, where integrated doses of up to a few\nMGray per year are expected [2].\nThe resolution and the accuracy of such a sensor are mainly\ndetermined by the conditioning electronics and the correction\nalgorithm used [3]. Digital conditioning approaches [4], [5], to-\ngether with a ratiometric reading technique [1], ensure high lin-\nearity and reading accuracy, even in conditions of low signal-to-\nnoise ratio. For instance, in the LHC collimators application, a\ntarget uncertainty of 20\nm on the position measurement has\nbeen achieved [6].\nIn applications where such a high accuracy is required, dc and\nslowly varying magnetic ﬁelds may drastically interfere with the\nLVDT, causing measurement errors. In the LHC transfer lines\ncollimators, the LVDT sensors experience a maximum external\nﬂux density of 1 mT due to the high-current cables supplying\nthe transfer line magnets and passing a few tenths of a meter\naway from them. During the magnets powering cycle, the LVDT\nreading is affected by a measurement error of some hundreds of\nmicrometers, much greater than the required reading uncertainty\nof 20\nm [7].\nIn this paper, the design of an LVDT position sensor with high\nrejection to external constant or slowly varying magnetic ﬁelds\nis addressed by exploiting a ﬁnite element method (FEM) sim-\nulator [8]. The goal is to reduce the expected external magnetic\nﬁeld of 800 A/m (1 mT magnetic ﬂux density in air) to about\n30 A/m, which will give a measurement error less than 20\nm,\nas it will be shown in detail in the experimental results. The in-\nManuscript received June 21, 2009; revised September 03, 2009; accepted\nSeptember 14, 2009. Current version published January 20, 2010. Corre-\nsponding author: M. Martino (e-mail: michele.martino@cern.ch).\nDigital Object Identiﬁer 10.1109/TMAG.2009.2033341\nFig. 1. LVDT magnetic circuit and working principle (courtesy of Macrosen-\nsors).\nnovative solution is obtained with the combined effects of an\nexternal shield, isolated from the sensor magnetic circuit, and a\ndc magnetic polarization of the LVDT magnetic circuit.\nIn Section II, after a brief recall of the LVDT working prin-\nciple, the problem of the interaction with an external magnetic\nﬁeld is introduced. In Section III, after introducing the LVDT\nmodel used for simulations, the new proposed design aimed to\nincrease the rejection to the interfering magnetic ﬁeld is pre-\nsented and discussed. In Section IV, the simulation results are\nshown.\nII. T\nHE PROBLEM\nThe LVDT, an inductive positioning sensor, is basically a\ntransformer with one excitation, or primary, coil fed by a si-\nnusoidal voltage source and two reading, or secondary, coils\nwound on a support, referred to as foil from now on (Fig. 1). The\ncore of the transformer is a movable part made of soft magnetic\nmaterial (such as nickel-iron alloy), which is bound to the ele-\nment whose position is to be measured (Fig. 1). When the core\nmoves toward a coil, the amplitude of the magnetic ﬂux, pro-\nduced by the primary winding and linked to that coil, increases.\nAccordingly, the voltage across it increases, too, while the am-\nplitude of the voltage across the other coil decreases. The dif-\nference between the secondary coil voltages allows evaluating\nthe core position.\n0018-9464/$26.00 © 2010 IEEE\nMARTINO et al.: DESIGN OF A LVDT WITH HIGH REJECTION TO EXTERNAL INTERFERING MAGNETIC FIELD 675\nTo the best of our knowledge, there are no scientiﬁc papers\naddressing speciﬁcally the inﬂuence of an external magnetic\nﬁeld on an LVDT. Datasheets of commercial LVDTs some-\ntimes warn the user about that, but no quantitative information\nis given. A detailed description of this phenomenon outgoes\nthe scope of this work. The basis of such a phenomenon can\nbe understood by referring to the working principle of ﬂux-\ngate magnetometers and direct current current transformers\n(DCCTs) [9]–[11].\nLet us consider an equivalent model of the overall primary\nand secondary circuits neglecting the hysteresis of the minor\nloops. It is possible to show that the amplitude\nof the ﬁrst\nharmonics of the secondary voltages can be expressed (trun-\ncating its series expansion at the ﬁrst order) by the following\napproximated equation [12]:\n(1)\nwhere\n is the equivalent differential permeability of the sec-\nondary circuits that takes into account the different magnetic\nmaterials and the relative volumes occupied by them.\n is the\ncore position,\n is the area of both the secondary coils,\nand\n are the magnetic ﬁelds produced respectively by the\nprimary excitation at frequency\n and the external interfering\nﬁeld. Because of the nonlinearity of the B-H curve of each mag-\nnetic material, a variation in the external ﬁeld results in a vari-\nation in the amplitudes of the secondary voltages, resulting in a\nposition measurement error.\nIn complete analogy to a simple ﬂuxgate [9], the outmost in-\nterfering component of the external ﬁeld is the longitudinal one,\nas it will be discussed in Section IV. Therefore, the design is\nmainly focused on the rejection of this component.\nIII. P\nROPOSAL\nFor the purpose of this paper, the LVDT design is not referred\nto a particular commercial sensor, therefore typical LVDT pa-\nrameters such as sensitivity and primary voltage excitation are\ntaken into account. The geometrical dimensions are purely in-\ndicative. A maximum interfering magnetic ﬁeld of 800 A/m\n(1 mT of magnetic ﬂux density in air) has been considered. This\nrepresents a reasonable value, extrapolated from examples of\ncritical installations [7], [13]. Anyway, the design guidelines\ndiscussed here can be easily applied to stronger interference\ncases. As a proposed target, the effect of the external ﬁeld has\nto be reduced such that the position sensor uncertainty must be\ncontained within 20\nm.\nThe rejection of the longitudinal interfering magnetic ﬁeld on\nthe LVDT readings is obtained by means of a proper designed\nshield and enhanced by applying a dc polarization of the mag-\nnetic media.\nA. LVDT Model\nThe primary coil is wound along the entire length of the\nsensor under study (about 110 mm), whereas the secondary\nwindings are wound over the primary, one on each side of the\nbobbin. The ferromagnetic core is a hollow cylinder whose\nlength matches the one of the secondary windings (about\n50 mm). The core is made up of Alloy 48, a very high relative\npermeability material, commonly used for these purposes\n[14], [15]. The foil is made up of S235 steel, which exhibits\nferromagnetic behavior and relatively high permeability. The\nsoft magnetic materials have been chosen to assure a working\nvoltage swing greater than 1 V. In addition, the choice takes\ninto account the fact that the LVDT materials themselves may\nworsen the interference effect. The model presents insulator\nlayers and washers between and over the primary and sec-\nondary coils that are treated as nonmagnetic regions in the\nsimulations. The structure is enclosed in a cylindrical case with\ntwo end-caps, made up of S235 steel.\nB. DC Polarization\nThe sensitivity of the amplitude of the secondary voltages\nto the external ﬁeld depends clearly on the local slope of\naround the generic point\n , as shown by evaluating the dif-\nference quotient\n(2)\nThe ﬁeld\n is zero in the nominal operation of the LVDT, so\nthe sensitivity of the sensor to the external ﬁeld depends on the\nslope of the differential permeability of the different materials\naround the zero.\nActually, the\nﬁeld can be equivalently produced applying\na dc component in the primary circuit. In this case, analyzing\nthe typical shape of the B-H curve of the used soft magnetic\nmaterials [14], it is possible to choose a biasing ﬁeld\nchar-\nacterized by a reduced sensitivity to the\n produced by the\nexternal ﬁeld.\nBecause of the demagnetization effect on the core of the\nLVDT, a relationship between the applied ﬁeld produced by the\nprimary current and the resulting ﬁelds\n and\n can be\nestablished only by means of simulations. Finally, such biasing\nwill affect the linearity of the sensor [16].\nC. Shield Design\nNormally, commercial LVDTs present a cylindrical shield in-\ntegrated in the sensor magnetic circuit.\nAn innovative aspect of the presented solution consists in\nseparating the magnetic circuit of the coaxial cylindrical shield\nfrom that of the sensor. By doing so, the design of the shield can\nbe optimized for the rejection without concerning any magnetic\nsensor constraint.\nDimensions, materials, and distances between the different\nshielding layers can be adjusted to achieve a given shielding ef-\nﬁciency, depending on the maximum acceptable position drift.\nPreliminary simulations have shown that a 1-mT transversal\nﬂux density produces a nonuniform distribution along the core,\nranging from 3 to 19\nT, whereas a 1 mT longitudinal ﬂux den-\nsity produces a nonuniform distribution along the core, ranging\nfrom 8 to 130 mT. Thus, the effect of a transversal ﬁeld is neg-\nligible with respect to the longitudinal one. A set of simulations\nhas been carried out to evaluate the effect of an interfering longi-\ntudinal magnetic ﬁeld, ranging from 0 to 800 A/m, on the mea-\nsured position. It showed that the maximum drift on the mea-\nsured position is about 1 mm, as well as that the magnetic ﬁeld\nhas to be reduced to about 35 A/m in order to have a drift not\ngreater than 20\nm. Therefore, the shield has to show an atten-\nuation factor of about 23.\n676 IEEE TRANSACTIONS ON MAGNETICS, VOL. 46, NO. 2, FEBRUARY 2010\nFig. 2. Flux density distribution in case of an external longitudinal magnetic\nﬁeld impinging on the LVDT shield. Note that only half of the LVDT longitu-\ndinal section is displayed, being symmetric around the axis.\nFig. 3. LVDT model prototype and shield case. Half of the displayed longitu-\ndinal section has been used for 2D simulations. The iron layer exhibits a thin air\ngap between the cylindrical part and the caps in order to take into account the\nactual physical discontinuity between the two pieces.\nIn a scenario in which a longitudinal interfering ﬁeld of\n800 A/m is considered, the cylindrical shield is interested by\na ﬁeld with both longitudinal and transversal components not\nuniformly distributed along its length (Fig. 2).\nSince such a case cannot be handled by means of an analyt-\nical approach [17], a simulation plan with FEM software turned\nout to be necessary in order to design the shield, having as a\nbasis the following guidelines: 1) use of high magnetic perme-\nability materials to reduce the interfering ﬁelds; 2) considera-\ntion of a multilayer shield to prevent the saturation of the inner\nlayer; 3) optimization of the air gap between the layers and their\nthicknesses not to oversize the shield with respect to the sensor\ndimensions.\nAccordingly, a single-layer shield with a high-permeability\nmaterial, such as Mumetal [18], has been discarded since a\ndecrease of about 50% of the permeability (from 120 000 to\n60 000) has been observed, meaning a signiﬁcant saturation.\nFor this reason, the shield has been endowed with an external\nlayer (Fig. 3). The distance between the two layers is 1 mm,\nand it assures that the Mumetal layer does not saturate and\nprovides an appropriate shunting for the ﬂux. The external\nlayer is a low-carbon iron cylindrical foil [18] endowed with\ntwo end-caps that, in particular, assure a very effective binding\nof the longitudinal ﬂux lines, avoiding a direct impact on the\nsensor’s magnetic circuit, as shown in Fig. 2. Owing to that,\nadditional Mumetal end-caps turned out to be useless.\nA simulation scan showed that 1 mm of low-carbon iron and\n0.4 mm of Mumetal assure both the saturation prevention and\nthe required shield efﬁciency. In fact, with an external magnetic\nﬁeld of about 30 A/m, the drift of the measured position of the\nFig. 4. Sensor characteristic with and without a longitudinal magnetic ﬁeld of\n800 A/m.\nTABLE I\nMESH PROPERTIES\nLVDT is contained within 20\n m, which has been considered as\nthe design goal.\nIV . THE SIMULATION VALIDATION\nA. FEM Modeling\nThe FEM simulator FLUX from CEDRAT Technologies has\nbeen used, as it is particularly suited for solving electromag-\nnetic problems involving moveable parts, such as sensors, mo-\ntors, and actuators [8]. In addition, it allows a deep investiga-\ntion of ﬂux distributions, end effects, nonlinearity, and nonuni-\nformity of ﬁeld strength along the different magnetic elements\n[19], [20]. For ferromagnetic materials, FLUX works with non-\nlinear B-H curves, but it neglects the magnetic hysteresis effects\n[8].\nThe model has been prepared in 2D environment, taking into\naccount the fact that the LVDT sensor has cylindrical symmetry,\nso only half of the longitudinal section of the sensor has been\nmodeled (Fig. 2). Table I summarizes the model mesh features.\nThe primary coil is fed by a voltage generator providing a\n3.5-V sine waveform at 2000 Hz. The amplitude of the ﬁrst har-\nmonics of the induced voltages on the two secondary coils has\nbeen evaluated using a fast Fourier transform (FFT) algorithm\nin order to calculate the ratiometric value as a function of the\nposition, ranging from\nto 15 mm, corresponding to 60% of\nthe overall core position range of the sensor.\nB. Simulation Results\nThe following simulation results take into account only the in-\nterference of the longitudinal magnetic ﬁeld, which is the dom-\ninating interfering component.\nFig. 4 shows the characteristic of the sensor, representing the\ncalibration curve, and the effects on it of an 800-A/m external\nmagnetic ﬁeld. The position value, in presence of the external\nMARTINO et al.: DESIGN OF A LVDT WITH HIGH REJECTION TO EXTERNAL INTERFERING MAGNETIC FIELD 677\nFig. 5. Comparison between the position drift of the LVDT model without (+)\nand with (*) dc polarization.\nFig. 6. Position drift with the shield case (+) and with its combined effect with\ndc polarization (*).\nﬁeld, has been evaluated on the basis of the corresponding ratio-\nmetric value by means of a linear interpolation of the calibration\ncurve. The position drift increases according to the nominal po-\nsition, achieving a maximum value of about 1 mm (Fig. 5).\nAs mentioned, a dc magnetic bias can be used to reduce the\neffect for those cases where a shield is not sufﬁcient or cannot\nbe ﬁt for mechanical reasons. To this purpose, a dc voltage of\n10 V (corresponding to 160 mA dc current) has been added to\nthe primary sine-wave input. Once the calibration curve of the\nsensor in presence of the dc effect is evaluated, the maximum\nposition drift due to an external interference of 800 A/m results\nto be reduced by a factor 2 (Fig. 5). The inversion of the position\ndrift sign is due to the dc polarization that affects the character-\nistic curve of the sensor.\nHowever, as a main solution strategy, the external magnetic\ninterference can be reduced by means of the shield case de-\nscribed in the previous section. Fig. 6 shows that the shield re-\nduces the position drift to about 12\nm without deeply affecting\nthe sensor linearity.\nFinally, both the shield case and the 10-V dc polarization were\napplied to the LVDT (Fig. 6). It can be stated that the beneﬁts of\nboth the solutions are kept since the position drift is still reduced\nby a factor 2 with respect to the case in which the only shield\nwas considered (Fig. 6).\nV. C\nONCLUSION AND OUTLOOK\nThe interference of a dc or slowly varying magnetic ﬁeld with\nan LVDT has been investigated. A strategy to improve the re-\njection to external longitudinal interfering ﬁeld has been pro-\nposed and validated by means of a FEM simulation approach.\nIn particular, a proper shielding design, isolated from the LVDT\nmagnetic circuit and enhanced with primary dc polarization,\nhas been discussed. In some cases, these countermeasures can\neven be adopted on commercial and already-designed LVDTs\nin order to improve rejection performances. Future works con-\ncern the prototype realization and the experimental validations\nas well as a detailed analytical LVDT model, able to foresee and\nquantify the interference effects.\nA\nCKNOWLEDGMENT\nAuthors would like to thank Prof. V. G. Vaccaro,\nProf. F. Cennamo, and Prof. P. Arpaia for their useful dis-\ncussions and suggestions. They would also like to thank\nDr. D. Taghezout from Applied Magnetics for his support on\nthe simulations.\nR\nEFERENCES\n[1] K. Ara, “A differential transformer with temperature- and excitation-\nindependent output,” IEEE Trans. Instrum. Meas., vol. IM-21, no. 3,\npp. 249–255, Aug. 1972.\n[2] A. Masi and R. Losito, “LHC collimators low level control system,”\nIEEE Trans. Nucl. Sci., vol. 55, no. 1, pp. 333–340, Feb. 2008.\n[3] R. S. Weissbach, D. R. Loker, and R. M. Ford, “Test and comparison\nof LVDT signal conditioner performance,” inProc. 17th IEEE Instrum.\nMeas. Technol. Conf., 2000, pp. 1143–1146.\n[4] S. K. Mishra and G. Panda, “A novel method for designing LVDT and\nits comparison with conventional design,” inProc. IEEE Sensors Appl.\nSymp., Houston, TX, 2006, pp. 129–134.\n[5] D. Crescini, A. Flammini, D. Marioli, and A. Taroni, “Application of an\nFFT-based algorithm to signal processing of LVDT position sensors,”\nIEEE Trans. Instrum. Meas., vol. 47, no. 5, pp. 1119–1123, Oct. 1998.\n[6] A. Masi, A. Brielmann, R. Losito, and M. Martino, “LVDT condi-\ntioning on the LHC collimators,” IEEE Trans. Nucl. Sci., vol. 55, no.\n1, pp. 67–75, Feb. 2008.\n[7] A. Danisi, “Simulation of dc interfering magnetic ﬁeld effects on the\nLHC collimators’ LVDT positioning sensors,” M.S. thesis, Dept. Elec-\ntron. Eng., Univ. “Federico II”, Naples, IT, 2009, EDMS Id 1016998\n[Online]. Available: https://edms.cern.ch/\n[8] “Flux 9 2D/3D Applications User’s Guide, Vol. 2, ”CEDRAT, Meylan,\nFrance, 2006.\n[9] S. V. Marshall, “An analytic model for the ﬂuxgate magnetometer,”\nIEEE Trans. Magn., vol. MAG-3, no. 3, pp. 459–463, Sep. 1967.\n[10] I. Sasada, “Orthogonal ﬂuxgate mechanism operated with dc biased\nexcitation,”J. App. Phys., vol. 91, no. 10, pp. 7789–7791, May 2002.\n[11] P. Odier, “DCCT technology review,” inProc. CARE-Conf-2004-023-\nHHH, Lyon, France, Dec. 2004.\n[12] M. Martino, “Characterization of magnetic interference on LVDT po-\nsitioning sensor,” Mar. 2009, unpublished.\n[13] S. Nagaitsev, C. Gattuso, S. Pruss, and J. Wolk, “Experience with mag-\nnetic shielding of a large scale accelerator,” inProc. 2001 Particle Ac-\ncelerator Conf., vol. 5, pp. 3371–3373.\n[14] R. Bozorth, “Iron-Nickel Alloys,” in Ferromagnetism, 3rd ed. New\nYork: Van Nostrand, 1951, pp. 130–131.\n[15] K. Hoselitz, “Magnetically soft materials,” in Ferromagnetic Proper-\nties of Metals and Alloys. Oxford, U.K.: Clarendon, Oxford Univ.\nPress, 1952, pp. 238–239.\n[16] S. Wu, S. Mo, and B. Wu, “An LVDT-based self-actuating displace-\nment transducer,” Sensors Actuators A.vol. 141, no. 2, pp. 558–564,\nFeb. 2008 [Online]. Available: Available: www.sciencedirect.com\n[17] Designers Handbook: The When, Why and How of Magnetic\nShielding. Blairsville, PA: Westinghouse, 1966.\n[18] “Metals Handbook vol. 1, ”10th ed. ASM International, 1990.\n[19] J. K. Sykulski, E. Sykulska, and S. T. Hughes, “Application of ﬁnite el-\nement modelling in LVDT design,”COMPEL, vol. 11, no. 1, pp. 73–76,\n1992.\n[20] M. Repetto and J. Simkin, “Engineering analysis for design optimiza-\ntion of differential transformers,”IEEE Comput.-Aided Eng. J., vol. 5,\nno. 2, pp. 51–53, Apr. 1988."
}