{
    "title": "Investigation of electrical and magnetic properties of ferro-nanofluid on transformers",
    "url": "https://openalex.org/W2143560993",
    "year": 2011,
    "authors": [
        {
            "id": "https://openalex.org/A2304855751",
            "name": "Tsung-Han Tsai",
            "affiliations": [
                "National Taiwan University"
            ]
        },
        {
            "id": "https://openalex.org/A4212047086",
            "name": "Ping-Hei Chen",
            "affiliations": [
                "National Taiwan University"
            ]
        },
        {
            "id": "https://openalex.org/A2707513135",
            "name": "Da-Sheng Lee",
            "affiliations": [
                "National Taipei University of Technology"
            ]
        },
        {
            "id": "https://openalex.org/A2291550682",
            "name": "Chin-Ting Yang",
            "affiliations": [
                "St. John's University"
            ]
        },
        {
            "id": "https://openalex.org/A2304855751",
            "name": "Tsung-Han Tsai",
            "affiliations": [
                "National Taiwan University"
            ]
        },
        {
            "id": "https://openalex.org/A4212047086",
            "name": "Ping-Hei Chen",
            "affiliations": [
                "National Taiwan University"
            ]
        },
        {
            "id": "https://openalex.org/A2707513135",
            "name": "Da-Sheng Lee",
            "affiliations": [
                "National Taiwan University"
            ]
        },
        {
            "id": "https://openalex.org/A2291550682",
            "name": "Chin-Ting Yang",
            "affiliations": [
                "National Taiwan University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W4237031765",
        "https://openalex.org/W2098480015",
        "https://openalex.org/W2129558202",
        "https://openalex.org/W2154336094",
        "https://openalex.org/W2158770808",
        "https://openalex.org/W2045086164",
        "https://openalex.org/W2075566930",
        "https://openalex.org/W1988013136",
        "https://openalex.org/W1988597515",
        "https://openalex.org/W2034077676",
        "https://openalex.org/W2136800584",
        "https://openalex.org/W2045005114",
        "https://openalex.org/W2028184575",
        "https://openalex.org/W2117364386",
        "https://openalex.org/W2102237603",
        "https://openalex.org/W2138356971",
        "https://openalex.org/W2073722974",
        "https://openalex.org/W2011651197",
        "https://openalex.org/W2101457330",
        "https://openalex.org/W2161668627",
        "https://openalex.org/W2098551897",
        "https://openalex.org/W1975882878",
        "https://openalex.org/W2109537954"
    ],
    "abstract": "Abstract This study investigated a simple model of transformers that have liquid magnetic cores with different concentrations of ferro-nanofluids. The simple model was built on a capillary by enamel-insulated wires and with ferro-nanofluid loaded in the capillary. The ferro-nanofluid was fabricated by a chemical co-precipitation method. The performances of the transformers with either air core or ferro-nanofluid at different concentrations of nanoparticles of 0.25, 0.5, 0.75, and 1 M were measured and simulated at frequencies ranging from 100 kHz to 100 MHz. The experimental results indicated that the inductance and coupling coefficient of coils grew with the increment of the ferro-nanofluid concentration. The presence of ferro-nanofluid increased resistance, yielding to the decrement of the quality factor, owing to the phase lag between the external magnetic field and the magnetization of the material.",
    "full_text": "NANO EXPRESS Open Access\nInvestigation of electrical and magnetic\nproperties of ferro-nanofluid on transformers\nTsung-Han Tsai1, Ping-Hei Chen1*, Da-Sheng Lee2 and Chin-Ting Yang3\nAbstract\nThis study investigated a simple model of transformers that have liquid magnetic cores with different\nconcentrations of ferro-nanofluids. The simple model was built on a capillary by enamel-insulated wires and with\nferro-nanofluid loaded in the capillary. The ferro-nanofluid was fabricated by a chemical co-precipitation method.\nThe performances of the transformers with either air core or ferro-nanofluid at different concentrations of\nnanoparticles of 0.25, 0.5, 0.75, and 1 M were measured and simulated at frequencies ranging from 100 kHz to\n100 MHz. The experimental results indicated that the inductance and coupling coefficient of coils grew with the\nincrement of the ferro-nanofluid concentration. The presence of ferro-nanofluid increased resistance, yielding to the\ndecrement of the quality factor, owing to the phase lag between the external magnetic field and the\nmagnetization of the material.\nIntroduction\nIn coming decades, new generations of electronic\nproducts such as mobile phones, notebooks, and e-paper\nwill be developed with the primary goals of mobilization\nand miniaturization. New CMOS fabrication technology\nwill be applied to fabricate the miniaturized IC of electro-\nnic products on silicon substrates, including on-chip\nmicro-transformers. Several issues of on-chip micro-\ntransformers have been investigated for many years\n[1-21]. Some researches focused on the material of the\nmagnetic core [1-10] and the geometry of the transfor-\nmer [11-14]. Some papers discussed the parasitic effect of\nthe conductive substrates. Transformer losses become\ndramatic at high frequencies and limit the performance\nof the transformers. Previous studies have discussed in\ndetail the causes of transformer losses such as parasitic\ncapacitance, ohmic loss, and substrate loss [15-18]. Core\nloss from the solid magnetic core significantly affected\nthe performance of the transformers. The solutions for\nthe solid magnetic core loss were proposed [19-21].\nConsequently, only a few studies addressed transfor-\nmers with liquid magnetic cores. The liquid magnetic\ncore, ferro-nanofluid, with its distinguishing features of\nlow electric conductivity and super-paramagnetism is\nregarded as a solution to the core losses of eddy current\nand hysteresis. In this study, a ferro-nanofluid was\napplied as a liquid magnetic core in a transformer. The\nperformance of the transformer with the ferro-\nnanofluids was measured, simulated, and compared with\nthat of a transformer with an air core.\nExperiment\nThe ingredients of ferro-nanofluid used in this study were\nFe\n3O4 nanoparticles, oleic acid, and diesel oil. The oil-\nbased Fe3O4 nanofluid was synthesized by co-precipitation,\nsurface modification, nanoparticles dispersing, and base-\nfluid phase changing [10].\nT h es h a p ea n ds i z eo ft h eF e\n3O4 nanoparticles was\nexamined by a transmission electron microscope (TEM).\nFigure 1 shows the TEM photo of the Fe3O4 nanoparti-\ncles. The average diameter of the nanoparticles was\napproximately 10 nm. The crystalline phases of Fe3O4\nnanoparticles were determined by X-ray diffraction, as\nshown in Figure 2. The magnetic properties of Fe\n3O4\nnanofluid were measured by a vibrating sample magnet-\nometer (VSM). The magnetized curve of the Fe\n3O4\nnanofluid measured by a VSM is shown in Figure 3.\nThe measured results illustrate that the synthesized\nferro-nanofluids have the characteristic of super-para-\nmagnetism. The saturated ma gnetizations of 0.25, 0.5,\n0.75, and 1 M Fe\n3O4 nanofluids were 3.75, 8.85, 12.7,\nand 16.7 emu/g, respectively.\n* Correspondence: phchen@ntu.edu.tw\n1Department of Mechanical Engineering, National Taiwan University, No. 1,\nSec. 4, Roosevelt Rd., Taipei 10617, Taiwan\nFull list of author information is available at the end of the article\nTsai et al. Nanoscale Research Letters2011, 6:264\nhttp://www.nanoscalereslett.com/content/6/1/264\n© 2011 Tsai et al; licensee Springer. This is an Open Access article distributed under the terms of the Creative Commons Attribution\nLicense (http://creativecommons.org/licenses/by/2.0), which permits unrestricted use, distribution, and reproduction in any medium,\nprovided the original work is properly cited.\nA liquid magnetic core of a transformer was used in\nthis study; the capillary served as a container in which\nthe Fe3O4 nanofluid was loaded. The coils of the trans-\nformer were made by winding enamel-insulated wires\non a capillary. Figure 4 shows the transformer on a\ncapillary, which loads the oil-based Fe 3O4 nanofluid.\nThe diameter of the enamel-insulated wire used was\n0.45 mm, and the thickness of the enamel layer was\napproximately 0.05 mm. The primary and secondary\nwindings had 20 turns. The outer and inner diameters\nof the capillary were 3.2 and 2.3 mm, respectively, and\nthe capacity of the capillary was 100μL.\nResults and discussion\nDifferent magnetic cores, air, and Fe3O4 nanofluids of\n0.25, 0.5, 0.75, and 1 M were applied as the magnetic\ncore of transformers. The inductance (L), coupling coef-\nficient (K), resistance (R), and quality factor (Q)w e r e\nmeasured by an Agilent 4294A Precision Impedance\nAnalyzer. In this study, the simulation of the transfor-\nmer was also established with HFSS 3D Full-wave Elec-\ntromagnetic Field Simulation. By applying measured\npermeability, permittivity, and magnetic tangent loss\nand setting exciting sources, the impedances will be cal-\nculated by the finite element method. Both the frequen-\ncies of measurement and simulation range from 100\nkHz to 100 MHz.\nFigure 5 shows the inductances of the coils of the\ntransformers with different magnetic cores. Figure 5\nillustrates that the inductance grows linearly with the\nincrease of Fe3O4 concentration. At frequencies ranging\nfrom 100 kHz to 15 MHz, the inductances decrease\nrapidly due to the skin effect of coils. At frequencies\nranging from 15 to 100 MHz, the inductances increase\ngradually and approach the maximum inductance at the\nFigure 1The TEM photo of Fe3O4 nanoparticles.\nFigure 2The crystalline phases of Fe3O4 nanoparticles.\nFigure 4 The transformer on a capillary that loads the oil-\nbased Fe3O4 nanofluid.\nFigure 3 The magnetized curve of the Fe 3O4 nanofluid\nmeasured by a VSM.\nTsai et al. Nanoscale Research Letters2011, 6:264\nhttp://www.nanoscalereslett.com/content/6/1/264\nPage 2 of 5\nresonance frequency. Figure 6 shows the measured and\nsimulated results of the coupling coefficients of the\ntransformers with different magnetic cores. The\ncoupling coefficients also increase with the increase of\nFe3O4 concentration. It increases rapidly below frequen-\ncies of 5 MHz and increases gradually with frequencies\nover 5 MHz. These results show that the magnetic cores\nof nanofluids can improve the inductance and coupling\ncoefficients.\nFigure 7 shows that the resistance increases with the\nincrease of Fe3O4 concentration, and it increases as a\nfunction of frequency. At 100 MHz, the resistances with\nt h em a g n e t i cc o r eo f0 . 2 5a n d1MF e3O4 nanofluids\nwere two and five times the resistance as the air core. It\nis speculated that this is because of the phase lag on the\nmaterial magnetization behind the external magnetic\nfield at high frequencies. When the relaxation times\ncannot keep up the alternate time of the magnetic field,\nthe resistance of the coils will grow rapidly [10,22]. At\nhigh frequencies, the permeability should be regarded as\na complex number. Rearranging complex permeability\nand the inductance of a solenoid-type inductor, the\nimpedance equation is obtained as follows:\nZ = R + jωL = R + ωμ′′N2A\nl + jωμ′N2A\nl\n(1)\nwhere ω is the angular frequency, N is the turns of\ncoil, A is the cross-sectional area of solenoid, and l is\nthe length of solenoid, μ” is the real part of complex\npermeability, and μ” is the imaginary part of complex\npermeability. It can be observed that the imaginary part\nof complex permeability μ” reflects on the real part of\nimpedance, which is the cause of increasing resistance.\nThen, the quality factorQ, which is defined as the ratio\nof inductance to resistance, becomes [10]:\nQ ≡ Im(Z)\nRe(Z) = ωμ′N2A\nRl + ωμ′′N2A (2)\nFigure 8 shows the quality factor of coils of transformers\nwith different magnetic cores. Owing to the fact that the\nincrease of resistance is larger and faster than that of\ninductance with the presence of Fe3O4 nanofluids, the\nquality factor decreases when the Fe3O4 concentration\nrises. The simulated results show the same trend.\nConclusions\nIn this study, different concentrations of ferro-nanofluids\nwere applied to the magnetic cores of transformers. The\nperformance of transformers with magnetic cores of air\nFigure 6The coupling coefficients of transformers with different magnetic cores: (a) measured data; (b) simulated data.\nFigure 5 The inductances of coils of transformers with\ndifferent magnetic cores.\nTsai et al. Nanoscale Research Letters2011, 6:264\nhttp://www.nanoscalereslett.com/content/6/1/264\nPage 3 of 5\nand Fe3O4 nanofluids of 0.25, 0.5, 0.75, and 1 M were\nmeasured, simulated, and compared. The experimental\nresults indicated that the presence of Fe3O4 improved the\ninductance and the coupling coefficient of the coils. Due\nto phase lag on the material magnetization behind the\nexternal magnetic field at high frequencies, the resistance\nincreased larger and faster than inductance, thus yielding a\nlower quality factor. For a micro-transformer, if a solid\nmagnetic core is needed for higher inductance, it could be\nachieved by adding ferro-nanofluid and removing the base\nfluid repeatedly. This method has a lower thermal budget\nthan the processes that sputtered or electroplated materi-\nals on chips. It is compatible with the MEMS process.\nAbbreviations\nTEM: transmission electron microscope; VSM: vibrating sample\nmagnetometer.\nAcknowledgements\nThe authors deeply appreciate the financial support provided by the\nNational Science Council in Taiwan under the grant numbers of NSC 96-\n2628-E-002-194-MY3 and NSC 98-3114-E-002-002-CC2.\nAuthor details\n1Department of Mechanical Engineering, National Taiwan University, No. 1,\nSec. 4, Roosevelt Rd., Taipei 10617, Taiwan2Department of Energy and\nRefrigerating Air-conditioning Engineering, National Taipei University of\nTechnology, No. 1, Sec. 3, Chung-hsiao E. Rd., Taipei 10608, Taiwan\n3Department of Mechanical and Computer-Aided Engineering, St. John’s\nUniversity, No. 499, Sec. 4, Tam-king Rd., Tamsui, Taipei 25135, Taiwan\nAuthors’ contributions\nTH performed experimental investigations of electric and magnetic\nproperties of ferro-nanofluids on transformers and prepared the draft, PH\nproposed the phenomena for investigation and revised the manuscript, DS\nsuggested the theory for the explanation of measured results, and CT\ndesigned the experimental systems. All authors read and approved the final\nmanuscript.\nCompeting interests\nThe authors declare that they have no competing interests.\nReceived: 5 November 2010 Accepted: 28 March 2011\nPublished: 28 March 2011\nReferences\n1. Ryu HJ, Han SH, Kim HJ: Characteristics of twin spiral type thin film\ninductor with Fe-based nanocrystalline core.IEEE Trans Magn 1999,\n35:3568-3570.\n2. Kim CS, Bae S, Kim HJ, Nam SE, Kim HJ: Fabrication of high frequency DC-\nDC converter using Ti/FeTaN film inductor.IEEE Trans Magn 2001,\n37:2894-2896.\n3. Kim KH, Kim J, Kim HJ, Han SH, Kim HJ: A megahertz switching DC/DC\nconverter using FeBN thin film inductor.IEEE Trans Magn 2002,\n38:3162-3164.\nFigure 8The quality factors of coils of transformers with different magnetic cores: (a) measured data; (b) simulated data.\nFigure 7 The resistances of coils of transformers with different\nmagnetic cores.\nTsai et al. Nanoscale Research Letters2011, 6:264\nhttp://www.nanoscalereslett.com/content/6/1/264\nPage 4 of 5\n4. Zhuang Y, Rejaei B, Boellaard E, Vroubel M, Burghartz JN: Integrated\nsolenoid inductors with patterned, sputter-deposited Cr/Fe10C090/Cr\nferromagnetic cores. IEEE Electron Dev Lett2003, 24:224-226.\n5. Brandon EJ, Wesseling E, White V, Ramsey C, Castillo LD, Lieneweg U:\nFabrication and characterization of microinductors for distributed power\nconverters. IEEE Trans Magn 2003, 39:2049-2056.\n6. Wang N, O ’Donnell T, Roy S, Brunet M, McCloskey P, O’Mathuna SC: High-\nfrequency micro-machined power inductors.J Magn Magn Mater2005,\n290-291:1347-1350.\n7. Gao XY, Cao Y, Zhou Y, Ding W, Lei C, Chen JA:Fabrication of solenoid-\ntype inductor with electroplated NiFe magnetic core.J Magn Magn Mater\n2006, 305:207-211.\n8. Lei C, Zhou Y, Gao XY, Ding W, Cao Y, Choi H, Won JH:Fabrication of a\nsolenoid-type inductor with Fe-based soft magnetic core.J Magn Magn\nMater 2007, 308:284-288.\n9. Lee DS: Energy harvesting chip and the chip based power supply\ndevelopment for a wireless sensor network.Sensors 2008, 8:7690-7714.\n10. Tsai TH, Kuo LS, Chen PH, Lee DS, Yang CT:Applications of ferro-nanofluid\non a micro-transformer.Sensors 2010, 10:8161-8172.\n11. Prieto MJ, Pernia AM, Lopera JM, Martin JA, Nuno F:Design and analysis of\nthick-film integrated inductors for power converters.IEEE Trans Ind Appl\n2002, 38:543-552.\n12. Seemann K, Leiste H, Beckker V: A new generation of CMOS-compatible\nhigh frequency micro-inductors with ferromagnetic cores: theory,\nfabrication and characterization.J Magn Magn Mater2006, 302:321-326.\n13. Yamaguchi M, Kim KH, Ikedaa S: Soft magnetic materials application in\nthe RF range.J Magn Magn Mater2006, 304:208-213.\n14. Dai CL, Chen YL: Modeling and manufacturing of micromechanical RF\nswitch with inductors.Sensors 2007, 7:2660-2670.\n15. Yoon JB, Kim BI, Choi YS, Yoon E:3-D construction of monolithic passive\ncomponents for RF and microwave ICs using thick-metal surface\nmicromachining technology. IEEE Trans Microw Theory Techn2003,\n51:279-288.\n16. Chong K, Xie YH: High-performance on-chip transformers.IEEE Electron\nDev Lett 2005, 26:557-559.\n17. Yunas J, Hamzah AA, Majlis BY: Fabrication and characterization of surface\nmicromachined stacked transformer on glass substrate.Microelectron Eng\n2009, 86:2020-2025.\n18. Yunas J, Hamzah AA, Majlis BY: Surface micromachined on-chip\ntransformer fabricated on glass substrate.Microsyst Technol 2009,\n15:547-552.\n19. Xu M, Liakopoulos TM, Ahn CH: A microfabricated transformer for high-\nfrequency power or signal conversion.IEEE Trans Magn 1998,\n34:1369-1371.\n20. Park JW, Allen MG: Ultralow-profile micromachined power inductors with\nhighly laminated Ni/Fe cores: application to low-megahertz DC-DC\nconverters. IEEE Trans Magn 2003, 39:3184-3186.\n21. Zhao JH, Zhu J, Chen ZM, Liu ZW:Radio-frequency planar integrated\ninductor with permalloy-Si02 granular films.IEEE Trans Magn 2005,\n41:2334-2338.\n22. Kotitz R, Weitschies W, Trahms L, Semmler W:Investigation of Brownian\nand Neel relaxation in magnetic fluids.J Magn Magn Mater1999,\n201:102-104.\ndoi:10.1186/1556-276X-6-264\nCite this article as:Tsai et al.: Investigation of electrical and magnetic\nproperties of ferro-nanofluid on transformers.Nanoscale Research Letters\n2011 6:264.\nSubmit your manuscript to a \njournal and beneﬁ t from:\n7 Convenient online submission\n7 Rigorous peer review\n7 Immediate publication on acceptance\n7 Open access: articles freely available online\n7 High visibility within the ﬁ  eld\n7 Retaining the copyright to your article\n    Submit your next manuscript at 7  springeropen.com\nTsai et al. Nanoscale Research Letters2011, 6:264\nhttp://www.nanoscalereslett.com/content/6/1/264\nPage 5 of 5"
}