{
    "title": "Understanding power transformer frequency response analysis signatures",
    "url": "https://openalex.org/W2147602330",
    "year": 2013,
    "authors": [
        {
            "id": "https://openalex.org/A2737523535",
            "name": "Abu Siada Ahmed",
            "affiliations": [
                "Curtin University"
            ]
        },
        {
            "id": null,
            "name": "Hashemnia, Naser",
            "affiliations": [
                "Curtin University"
            ]
        },
        {
            "id": "https://openalex.org/A2744085324",
            "name": "Islam Syed",
            "affiliations": [
                "Curtin University"
            ]
        },
        {
            "id": null,
            "name": "Masoum, Mohammad",
            "affiliations": [
                "Curtin University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2032418462",
        "https://openalex.org/W6638606963",
        "https://openalex.org/W1966552335",
        "https://openalex.org/W2144343128",
        "https://openalex.org/W2130178280",
        "https://openalex.org/W3217410909",
        "https://openalex.org/W2132376225",
        "https://openalex.org/W2036595214",
        "https://openalex.org/W2129222529",
        "https://openalex.org/W1998514388",
        "https://openalex.org/W2123670166",
        "https://openalex.org/W2121867909",
        "https://openalex.org/W2136643740",
        "https://openalex.org/W2123863889",
        "https://openalex.org/W2155644913",
        "https://openalex.org/W6737170692",
        "https://openalex.org/W2147078575",
        "https://openalex.org/W1980795893",
        "https://openalex.org/W2149826078",
        "https://openalex.org/W2126358576",
        "https://openalex.org/W2099741305",
        "https://openalex.org/W2094862341",
        "https://openalex.org/W6685931361",
        "https://openalex.org/W2141128402",
        "https://openalex.org/W2131896425",
        "https://openalex.org/W2099709349",
        "https://openalex.org/W2152300550",
        "https://openalex.org/W2111944939",
        "https://openalex.org/W2150262505",
        "https://openalex.org/W2097868428",
        "https://openalex.org/W2091890152",
        "https://openalex.org/W2109766135",
        "https://openalex.org/W2149093836",
        "https://openalex.org/W2121825214",
        "https://openalex.org/W2169162190",
        "https://openalex.org/W2049552648",
        "https://openalex.org/W1999862262",
        "https://openalex.org/W2102945054",
        "https://openalex.org/W2167667767",
        "https://openalex.org/W2157641147",
        "https://openalex.org/W1580065766",
        "https://openalex.org/W1981353923",
        "https://openalex.org/W2134195577",
        "https://openalex.org/W2609441550",
        "https://openalex.org/W2151103935",
        "https://openalex.org/W2181966761",
        "https://openalex.org/W1827323702",
        "https://openalex.org/W1990411798",
        "https://openalex.org/W2113634802",
        "https://openalex.org/W2138299193",
        "https://openalex.org/W4285719527",
        "https://openalex.org/W2033819227",
        "https://openalex.org/W2167104246"
    ],
    "abstract": "This paper presents a comprehensive analysis of the effects of various faults on the FRA signatures of a transformer simulated by a high-frequency model. The faults were simulated through changes in the values of some of the electrical components in the model. It was found that radial displacement of a winding alters the FRA signature over the entire frequency range (10 Hz-1 MHz), whereas changes due to axial displacement occur only at frequencies above 200 kHz. A Table listing various transformer faults and the associated changes in the FRA signature was compiled and could be used in the formulation of standard codes for power transformer FRA signature interpretation.",
    "full_text": "Copyright © 2013 IEEE. Personal use of this material is permitted. Permission from IEEE \nmust be obtained for all other uses, in any current or future media, including \nreprinting/republishing this material for advertising or promotional purposes, creating new \ncollective works, for resale or redistribution to servers or lists, or reuse of any copyrighted \ncomponent of this work in other works. \n \nSUMMARY \nData obtained using a distributed parameter model to simulate a \npower transformer are presented.  T hese data could be used in the \nformulation of  standard codes for interpretation of the frequency \nresponse analysis signatures of power transformers.  \n \nKey Words : Power transformer, FRA,  condition monitoring, \nwinding deformation. \nI. INTRODUCTION \nHE majority of transformers currently in service \nworldwide were installed prior to 1980, and consequently \nmost of them are approaching or ha ve already exceeded their \ndesign lifetimes [1, 2]. This poses a significant risk for utilities \nand other power network stakeholders, since the impact of in -\nservice transformer failure can be catastrophic.  One of the \nmost serious problems  with an in-service transformer is \nmovement of its  windings due to e lectromagnetic forces \ngenerated during short circuit  faults. Reduction of clamping \npressure due to insulation aging can also cause winding \nmovement, and may result in an explosion  [3-6]. There are \nmany causes of mechanical faults, e.g., earthquake, explosion \nof combustible gas in the transformer oil, short circuit \ncurrents, and careless transportation [7,8]. While a transformer \nwith minor winding deformation may continue to work \nsatisfactorily, its capability to withstand further mechanical  or \nelectrical faults will gradually decrease  [9]. Therefore it is \nessential to detect any minor winding deformation as soon as \npossible, and to take appropriate remedial action . Winding \ndeformation has various forms, e.g., spiral tightening, \nconductor tilting, radial/hoop buckling, shorted or open turns, \nloosened clamping structures, axial displacement, core \nmovement, and collapse of the winding end supports. It is \ndifficult to differentiate between these internal faults  using \nconventional testing methods [10]. \n   In this article data obtained using a high frequency \ndistributed parameter model to simulate a power transformer \nare presented.  Mechanical faults such as axial displacement, \nradial buckling, disk spac e variation, loss of clamping, \nbushing and leakage faults were simulated by modifying the \nrelevant electrical parameters in the transformer model , or by \nreconfiguring the impacted disks in a 3D transformer finite \nelement model. It is suggested that the res ulting data could be \nused in the formulation of  standard codes for interpretation of \nthe frequency response analysis signatures of power \ntransformers. \n  \nII. F\nREQUENCY RESPONSE AN ALYSIS \n   Frequency response analysis (FRA) is a powerful diagnostic \ntechnique widely used to identify internal faults within power \ntransformers [11]. Transformer components such as windings, \ncore and insulation can be represented by equivalent circuits \ncomprising resistors, capacitors, and self / mutual inductances, \nwhose values will be altered by a mechanical fault within the \ntransformer. Thus the frequency resp onse of the relevant \nequivalent circuit winding will change . Changes in \nttransformer geometry, or in the dielectric propertie s of \ninsulating materials due to ageing or increasing water content, \nalso affect the shape of the frequency response, especially the \nresonant frequencies and their damping [8]. \n   FRA is an offline technique in which a low voltage ac signal \nis injected at one terminal of a winding, and the response is \nmeasured at the other terminal of the same winding with \nreference to the grounded tank. The FRA analyzer measures \nthe transfer function, impedance or admittance of the winding, \ntypically over the frequency range 10 Hz - 2 MHz, and one or \nall of these three properties  can be used for fault diagnosis. \nAlthough the FRA equipment can be connected to the \ntransformer in different ways  [12-14], end-to-end connection \nshown in Fig. 1  is capable of detecting the main types of \nmechanical faults [1\n4].  \n \nFig. 1. FRA end-to-end test configuration \n   The FRA signature is considered as a fingerprint of the \ntransformer, which can be compared with a previous signature \nin order to detect any mechanical deformation  which may \nhave developed between the recording of the two signatures.\n \nFRA diagnosis has also been utilized recently to identify \nwinding deformations in rotating machine s [13]. While the \nmeasurement procedure using commercial test equipment is \nquite simple, skilled and experienced personnel are required in \norder to interpret the FRA signatures and identify correctly the \ntype and location of a fault. Although much research has been \ndone on this topic, a reliable FRA signature interpretation \ncode has not yet been published.  \nThe authors of [14] sub-divide the FRA frequency range as \nfollows: \n(a) the low frequency range (<20 kHz), within which inductive \ncomponents dominate the transformer winding response \nUnderstanding Power Transformer Frequency Response \nAnalysis Signatures  \nA. Abu-Siada, N. Hashemnia, S. Islam, and Mohammad A.S. Masoum \nElectrical and Computer Engineering Department, Curtin University, Western Australia   \n \nT \n \n(b) the medium frequency range (20–400 kHz), within which \nthe combination of induct ive and capacit ive components  \nresults in multiple resonances \n(c) the high frequency range (>400 kHz), within which \ncapacitive components dominate the FRA signature [15 ].      \nThese ranges and the associated fault types are summarized in \nTable I [16, 17]. \n   TABLE I \nFRA BANDS AND THEIR SENISTIVITY TO FAULTS [16] \nFrequency Band Fault sensitivity \n< 20kHz Core deformation, open circuits, shorted turns  \nand residual magnetism, bulk winding \nmovement,  clamping structure loosening \n20 - 400 kHz Deformation within the main or tap windings  \n> 400 kHz Movement of the main and tap windings,  \nground impedances variations \n    \nIII. TRANSFORMER MODEL AND SENSITIVITY ANALYSIS \n   Simplorer software was used to simulate the transformer \nmodel shown in Fig. 2 [17-19]. \n \nFig. 2. 10-disk model of a transformer [17]. \n \n   The high voltage (HV) and low voltage (LV) windings are \neach assumed to consist of 10 disks. Each disk comprises a \nseries resistance ( Rs) and inductance ( Ls), shunted by a  \ncapacitor (Csh) and a conductance (Gsh). The capacitance (CHL) \nbetween the HV and LV windings is shunted by a dielectric \nconductance ( GHL), and mutual inductances ( Mij) between \ncoils i and j are included. The dielectric insulation  (oil) \nbetween the LV winding and the core, and between the HV \nwinding and the tank, is simulated by a capacitance ( Cg) and \ndielectric conductance (G). The fault-free component values of \nthe model given in [9] and [13] are listed in the Appendix.  \n   In Table II the transformer model parameters , and the \nmechanical faults which influence them , are listed.  Various \nmechanical faults can be simulated by changing relevant \nparameters in the transformer m odel. This  can aid in \nestablishing a standard code for FRA signature interpretation.  \nTable II \nMODEL PARAMETERS AND THE MECHANICAL FAULTS WHICH \nINFLUENCE THEM [9], [11], [17], [20]-[23] \n \nModel Parameter Type of Fault \nInductance Ls Disk deformation, local breakdown , core \ndeformation and winding short circuits. \nShunt Capacitance \nCsh \nDisk movements, buckling due to large \nmechanical forces, moisture ingress  and loss of \nclamping pressure. \nSeries Capacitance \nCHL \nAgeing of insulation , moisture ingress  and disk \nmovement. \nResistance Rs Shorted or broken disk, failure of caulking \ncontacts and tap changer contact wear.  \n    The sensitivity of the FRA signature to variation of the \nmodel parameters was investigated. As shown in Fig. 2, a \nsinusoidal excitation voltage ( Vin) of 10 V and variable \nfrequency (10 Hz to 2 MHz) is connected to one winding \nterminal, and the response at the other terminal of the winding \n(V\no) is recorded. The input/output coaxial leads used in \npractical measurements are represented by 50 Ω resistors ( Ri \nand Ro in Fig. 2). The transfer function TF dB = 20 log 10 \nis plotted against frequency.  Fig. 3 shows the effect of \n±10% changes in the capacitances C g and Csh of the HV \nwinding on the FRA signature, compared to the base line \n(fingerprint) signature. Increasing C\nsh decreases the resonance \nand anti -resonance frequencies, i.e., the local minimum and \nlocal maximum frequencies respectively, with small changes \nin magnitude. Decreasing Csh increases the resonance and anti-\nresonance frequencies. The same trends are observed for C g \nvariation. It will be seen that the impact of varying Cg and Csh \nis more pronounced at frequencies above 400 kHz. \n \n \nFig. 3. Effect of ± 10% changes in the HV capacitance on the FRA signature, \nrelative to the baseline (a) Cg , (b) Csh   \n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-70.00\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00TF(dB)\n(a)\nCurve Info\nFingerprint\nCg Increased\nCg Decreased\n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-70.00\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00TF(dB)\n(b)\nCurve Info\nFingerprint\nCsh Increased\nCsh Decreased\n \n       Fig. 4 shows the effect of changing the self ( Ls) and \nmutual ( Mij) inductances by ±10%.  Unlike the effect of \nchanges in Cg and Csh, which appears at frequencies above 400 \nkHz, the effect of changes in Ls and Mij appears below 20 kHz \nand is more pronounced close to 1 MHz . This is attributed to \nthe fact that the amount of magnetic flux penetrating the \ntransformer core at low frequencies  is significant, so that the \ncore characteristics affect the FRA signature at low frequency. \nAt high frequencies the magnetic flux tends to encase the core \nand the transformer capacitive components dominate the \nresponse.  \n  \n \n \nFig. 4. Effect of ± 10% changes in the HV self/mutual inductances on the \nFRA signature, relative to the baseline (a) mutual inductance Mij (b) self \ninductance LS  \n   As shown in Fig. 4, increasing Ls decreases the resonance \nand anti -resonance frequencies, with s mall changes in \nmagnitude. On the other hand, decreasing Ls increases the \nresonance and anti -resonance frequencies, again with small \nchanges in magnitude. Opposite trends are observed when the \nmutual inductances Mij are changed, i.e., i ncreasing Mij \nincreases the resonance and anti -resonance frequencies, and \ndecreasing Mij decreases them, over the entire frequency range.  \n \nFig. 5. Effect of increased dielectric conductance G on the FRA signature \n   Fig. 5 shows the effect increasing the HV conductance (G) \nby 10% on the FRA signature (A decrease in conductance, i.e., \nan increase in dielectric resistance, is considered unlikely for \ntransformer insulation).  As shown in Fig. 5, increasing the \ndielectric conductance (G) has no effect on the reson ance and \nanti-resonance frequencies. It does however slightly change \nthe magnitudes of the peaks at high frequencies. This result is \nattributed to the very high dielectric resistance used in the \nsimulation (7 MΩ), typical for transformer oil.  \n   The effects of ±10% variations in various electrical \nparameters on the FRA resonance frequencies and magnitudes \nare summarised in Table III. \nTABLE III \nEFFECTS OF ±10% VARIATIONS IN VARIOUS ELECTRICAL PARAMETERS ON \nFRA REONANCE FREQUENCIES AND MAGNITUDES (RELAT IVE TO \nFINGERPRINTS) \nParameter \nVariations \nFrequency Range \nLow  \n(<20 kHz) \nMedium  \n(20–400 kHz) \nHigh  \n(>400 kHz) \n \n \n \nLs \n \n10% \nIncrease \nMagnitude and \nresonance frequencies \ndecreased \nMagnitude and \nresonance \nfrequencies \ndecreased \nMagnitude \nand \nresonance \nfrequencies \ndecreased \n10% \nDecrease \nMagnitude and \nresonance \nfrequencies \nincreased \nMagnitude and \nresonance \nfrequencies \nincreased \nMagnitude \nand \nresonance \nfrequencies \nincreased \n \nCsh \n \n10% \nIncrease  No impact No impact \nResonance \nfrequencies, \nmagnitude  \ndecreased \n10% \nDecrease No impact No impact \nResonance \nfrequencies, \nmagnitude  \nincreased \n \n \n \nCg \n \n10% \nIncrease No impact No impact \nResonance \nfrequencies \nslightly   \ndecreased \n10% \nDecrease No impact No impact \nResonance \nfrequencies, \nmagnitude  \nincreased \n \n \nMij \n \n10% \nIncrease \nResonance \nfrequencies \nincreased \nResonance \nfrequencies \nincreased \nResonance \nfrequencies \nincreased \n10% \nDecrease \nResonance \nfrequencies \ndecreased \nResonance \nfrequencies \ndecreased \nResonance \nfrequencies \ndecreased \n \nG \n10% \nIncrease No impact No impact Magnitude \ndecreased \nIV. FAULT ANALYSIS \n   In order to simulate physical faults within the  transformer, \nSimplorer and Maxwell software were used to simulate a 3D \nfinite element model of the single phase, shell -type \ntransformer shown in Fig. 6.  \n \n \n \n \n \n \nFig. 6. 3D Transformer model  \n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-100.00\n-90.00\n-80.00\n-70.00\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00TF(dB)\n(a)\nCurve Info\nFingerprint\nMij Increased\nMij Decreased\n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-70.00\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00TF(dB)\n(b)\nCurve Info\nFingerprint\nLs Increased\nLs Decreased\n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-90.00\n-80.00\n-70.00\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00\n-10.00TF(dB)\nCurve Info\nFingerprint\nG Increased\n715.53 800.00 893.88\nFrequency(kHz)\n-50.00\n-45.00\n-40.00\n-35.00\n-30.00\n-25.00\n-20.00TF(dB)\n\n \nVarious mechanical faults within the transformer model were  \nsimulated by changing the transformer coil configuration. The \ncorresponding changes in the  electrical parameters  of the \ntransformer model (Fig. 2) were calculated using the software. \nThe resulting signatures were compared with the fingerprint \nsignature.  \nA. Loss of Clamping Pressure  \nLoss of clamping pressure is a common problem, particularly \nin aged transformers. It is caused by mechanical hysteresis in \npressboard and paper insulation [24], and leads to an increase \nin insulation conductivity because of the reduced insulation \nthickness between winding layer s. It can be simulated by \nincreasing the value of the shunt conductance Gsh [21]. Figs. 7 \nand 8 show the effect of a 20% increase in Gsh on the FRA \nsignatures of the HV and LV  windings respectively; the \nresonance and anti-resonance frequencies are not shifted, but \nthe magnitudes of the resonance peaks are decreased over the \nentire frequency range . The large negative spike in the HV \nwinding signature around 200 kHz is thought to be an artefact \nof the software.  \n \nFig. 7. Effect of simulated loss of clamping pressure on the FRA signature of \nthe HV winding  \n \nFig. 8. Effect of simulated loss of clamping pressure on the FRA signature of \nthe LV winding  \nB. Inter-Disk Fault \n  The inter-disk fault is one of the most common mechanical \nfaults within power transformers, and approximately  80% of \nmechanical failures are attributable to  it [12]. It is due to \nchanges in the axial disk space (Fig. 9) caused by excess  \nmechanical stress and short circuit faults, and can be simulated \nby increasing the series capacitance ( Csh) and the mutual \ninductance (Mij )  between the two relevant disks [25, 26]. Fig. \n10 shows the effect of a 10% increase in Csh and Mij on the HV \nFRA signature when the fault occurs  at the top, middle and \nbottom of the HV winding . A 10% increase in Csh and in Mij \ncorresponds to a 10% increase in Δh, the space between the \naffected disks (Fig. 9). Fig. 10 shows that this fault does not \nhave a significant effect on the FRA signature at  frequencies \nbelow 300 kHz. The resonance and anti-resonance frequencies \nabove 300 kHz are decreased , and the peak  magnitudes are \nchanged. The frequency decreases are larger when the fault \noccurs within the top or bottom disks of the winding, rather \nthan within the middle disks.   \nΔh\nLV \nHV \nCore\nΔh\n \nFig. 9.  Interdisk fault (Δh) configuration  \n \n \nFig. 10. Effect of inter-disk fault on the FRA signature of the HV winding. \n C. HV Winding Bushing Fault \n   This type of fault  can be simulated by connecting the \nbushing T-circuit model shown in Fig. 11 between the voltage \nsource Vin  and the transformer model shown in Fig. 2 [5].  \n2.5µH 2.5µH\n400pF\n400pF\n0.2Ω 0.2Ω \nSignal \nInjection\nTo transformer \nwinding \n \nFig. 11. Transformer bushing model [5]  \n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-140.00\n-115.00\n-90.00\n-65.00\n-40.00\n-15.00TF(dB)\nCurve Info\nFingerprint\nLoss of clamping pressure (HV)\n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00\n-10.00\n0.00\nTF(dB)\nCurve Info\nFingerprint\nLoss of clamping pressure (LV)\n\n \n  \nFig. 12. Impact of high voltage bushing fault on the FRA signature  of the HV \nwinding \n   The effect of a 10% reduction  in bushing capacitance (800 \npF) shown in Fig. 11  on the FRA signature is shown in Fig. \n12. A reduction in bushing capacit ance corresponds to a \nreduction in the breakdown voltage of the bushing insulation.   \nAs shown in Fig. 12, t here is no significant change in the \nsignature below 600 kHz, but the resonance and antiresonance \npeaks around 700 kHz in the fingerprint disappear.  \nD. Axial Displacement Fault \nThis fault occurs due to imbalanced magnetic forces generated \nin a winding as a result of a short -circuit fault [21] . These \nforces cause axial movement of the winding as shown in Fig. \n13.  \nΔh\nCore\nLV \nHV \n (a) Healthy \nConfiguration\n(b) Axial \nDisplacement \nConfiguration  \nFig. 13. Axial displacement (Δh) configuration  \n   \n \nFig. 14. Impact of HV axial displacement on the FRA signature \n   The fault can be simulated by changing the values of the \nseries capacitance (Csh) and mutual inductance (M ij) between \nthe HV and LV windings [27]. A 10% increase in CHL and in \nMij corresponds to approximately 10% movement Δh which is \nthe ratio of the HV axial displacement and the overall length \nof the winding (Fig. 13). \n   Fig. 14 shows that such a fault has little effect on the FRA \nsignature below 200 kHz.  In the range 200-400 kHz the \nresonance frequencies and magnitudes decrease. The \nresonance around 700 kHz in the fingerprint is shifted towards \nhigher frequency and its magnitude increases. These trends are \nindependent of the direction of the axial movement. \nE. Dielectric Leakage Current Fault  \n  Ground shield damage, oil and paper  aging, high  moisture \ncontent in the winding and abrasion of solid insulation are the \nmain causes of leakage current to earth  through transformer \ninsulation [28]. This type of fault can be simulated by \nincreasing the conductance between the HV winding and the  \nground (G in Fig.2) [29]. Fig. 15 shows that this fault  \nproduces  small changes in peak magnitude below 200 kHz. \n \nFig. 15. Effect of leakage fault on the FRA signature \nF. Short Circuit Fault \n  This fault is due to erosion of  the winding and conductor \ninsulation, due to vibrations generated by  electromechanical \nforces. The erosion  may lead to excessive current in the \nwinding [27]. The fault can be simulated by short circuiting \nthe series resistance Rs and the series inductance Ls of the HV \nwinding (Fig.2) [30]. Fig. 16 shows that it fault has little effect \non the signature at  frequencies below 200 kHz . At higher \nfrequencies the magnitude is slightly increased and the \nresonance frequencies are slightly decreased. The same fault \nhas a greater effect when it occurs at the top or bottom of the \nwinding rather than in the middle.   \n \n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-140.00\n-115.00\n-90.00\n-65.00\n-40.00\n-15.00TF(dB)\nCurve Info\nFingerprint\nBushing Fault\n\n \n \n \nFig. 16. Impact of HV winding short circuit fault on the FRA signature when \nit occurs (a) at the top of the winding, (b) at the middle and bottom of the \nwinding \n   \nG. Radial Displacement Fault \n  Windings may be subjected to radial forces arising from the \ninteraction of the  winding current with the magnetic flux. \nFig.17 shows a radial dislocation  between the LV and HV \nwindings. Large radial forces may lead to  winding buckling \n[31]. This fault can be simulated by decreasing the capacitance \nto ground (C g), the capacitance between the HV and LV \nwindings (C HL), and  the mutual inductance ( Mij) of the \nimpacted disks [32]. A simultaneous decrease of 10% in each \nof these three parameters  corresponds to a  10% radial \ndisplacement Δw of the impacted disks as shown in Fig. 17. \nΔw is calculated as the ratio of the radial displacement of the \nimpacted disks to the diameter of the disk. The FRA responses \nof the HV and LV windings are shown in Fig. 18  (a) and (b) \nrespectively. \n \n                    \n(c) Inter-disc fault\nHV \nLV \nΔw Core\n \n               \nFig. 17.   Radial fault (Δw) configuration  \n \n    \n  \n \nFig. 18.  Impact of radial fault on the FRA signature (a)HV  (b) LV winding \n  Fig. 18 (a) shows that the resonance frequencies of the HV \nwinding are increased slightly at frequencies above 400 kHz. \nIn the LV winding an increase occurs at frequencies above 20 \nkHz.  \n   Table IV is a listing of the various fault types and their \neffects on t he FRA signature. It could be used in the \nformulation of standard codes for power transformer FRA \nsignature interpretation. \n \nTABLE IV \nIMPACT OF VARIOUS FAULTS ON TRANSFORMER FRA SIGNATURE  \nFault Type Frequency Range \n< 20kHz 20-400 kHz > 400 kHz \nAxial \nDisplacement \nNo impact \n \nResonance \nfrequencies and \nmagnitude \ndecreased \nResonance \nfrequencies and \nmagnitude  \nincreased \nRadial \nDisplacement \nResonance \nfrequencies \nincreased \nResonance \nfrequencies \nincreased \nResonance \nfrequencies \nincreased \nHigh Voltage \nBushing \nNo impact \n \nNo impact \n \nMagnitude \ndecreased, one \nresonance \nfrequency \ndisappears \nDielectric \nLeakage \ncurrent \nMagnitude \ndecreased \nMagnitude \ndecreased \nNo impact \n \nInter Disk \nNo significant \nimpact \nResonance \nfrequencies and \nmagnitudes \nincreased \nResonance \nfrequencies and \nmagnitudes \nincreased \n \nShort Circuit \nNo significant \nimpact \nResonance \nfrequencies \ndecreased and  \nmagnitudes \nincreased \nResonance \nfrequencies \ndecreased and  \nmagnitudes \nincreased \nLoss of \nClamping \nPressure \nMagnitude \ndecreased \nMagnitude \ndecreased \nMagnitude \ndecreased \n    \nV. CONCLUSION \n    This  paper presents a comprehensive analysis of the effects \nof various faults on the FRA signatures of a transformer \nsimulated by a high frequency model. The faults were \nsimulated through changes in the values of some of the \nelectrical components in the model.  It was found that radial \ndisplacement of a winding alters the FRA signature over the \nentire frequency range (10 Hz -1 MHz), whereas changes due \n\n \nto axial displacement occur only at frequencies above 200 \nkHz. A table listing various transformer faults and the \nassociated changes in the FRA signature was compiled, and \ncould be used in the formulation of standard codes for power \ntransformer FRA signature interpretation. \nAPPENDIX  \nTRANSFORMER MODEL COMPONENT VALUES [9, 13] \n Rs Ls Csh Cg Chl 1/G \nHV 1.2Ω 180µH 0.013nF 3nF 5nF 7 MΩ \nLV 0.5Ω 65µH 0.026nF 6nF 5Nf 7 MΩ \nVI. REFERENCES \n[1] S. Islam, K. M. Coates, and G. Ledwich, \"Identification of high frequency \ntransformer equivalent circuit using Matlab from  frequency domain data,\" in \nIndustry Applications Conference, 1997. Thirty -Second IAS Annual Meeting, \nIAS '97., Conference Record of the 1997 IEEE, 1997, pp. 357- 364 vol.1. \n[2] E.J. Figueroa,\"Managing An Aging Fleet of Transformers,\" Canada, 2009.  \n[3]L. M. Geldenhuis, \"Power transformer life management,\" in Electricity \nDistribution, 2005. CIRED 2005. 18th International Conference and \nExhibition on, 2005, pp. 1-4. \n[4]S. M. Islam and G. Ledwich, \"Locating transformer faults through \nsensitivity analysis of hig h frequency modeling using transfer function \napproach,\" in Electrical Insulation, 1996., Conference Record of the 1996 \nIEEE International Symposium on, 1996, pp. 38- 41 vol.1. \n[5]M. Wang, A. J. Vandermaar, and K. D. Srivastava, \"Improved detection of \npower transformer winding movement by extending the FRA high frequency \nrange,\" Power Delivery, IEEE Transactions on, vol. 20, pp. 1930- 1938, 2005. \n[6]W. J. McNutt, W. M. Johnson, R. A. Nelson, and R. E. Ayers, \"Power \nTransformen Short -Circuit Strength -  Requirements, Design, and \nDemonstration,\" Power Apparatus and Systems, IEEE Transactions on, vol. \nPAS-89, pp. 1955-1969, 1970. \n[7]M. Bagheri, M. S. Naderi, T. Blackburn, and T. Phung, \"FRA vs. short \ncircuit impedance measurement in detection of mechanical defects within \nlarge power transformer,\" in Electrical Insulation (ISEI), Conference Record \nof the 2012 IEEE International Symposium on, 2012, pp. 301- 305. \n[8]K. G. N. B. Abeywickrama, Y. V. Serdyuk, and S. M. Gubanski, \n\"Exploring possibilities for characterizatio n of power transformer insulation \nby frequency response analysis (FRA),\" Power Delivery, IEEE Transactions \non, vol. 21, pp. 1375-1382, 2006. \n[9]E. Rahimpour, M. Jabbari, and S. Tenbohlen, \"Mathematical Comparison \nMethods to Assess Transfer Functions of Tra nsformers to Detect Different \nTypes of Mechanical Faults,\" Power Delivery, IEEE Transactions on, vol. 25, \npp. 2544-2555, 2010. \n[10]B. J. Small and A. Abu -Siada, \"A new method for analysing transformer \ncondition using frequency response analysis,\" in Power and Energy Society \nGeneral Meeting, 2011 IEEE, 2011, pp. 1-5. \n[11]S. D. Mitchell and J. S. Welsh, \"Modeling Power Transformers to Support \nthe Interpretation of Frequency-Response Analysis,\" Power Delivery, IEEE \nTransactions on, vol. 26, pp. 2705-2717, 2011. \n[12]E. Rahimpour, J.Christian, K.  Feser, H. Mohseni, \"Transfer Function \nMethod to Diagnose Axial Displacement , Radial Deformation of Transformer \nWinding,\" Power Engineering Review, IEEE, vol.22, pp.70 -70, 2002. \n[13]\n C. A. Platero, F. Blazquez, P. Frias, and D. Ramirez,\"Influence of Rotor \nPosition in FRA Response for Detection of Insulation Failures in Salient -Pole \nSynchronous Machines,\"  IEEE Transactions on  Energy Conversion , vol. 26, \npp. 671-676, June 2011.  \n[14]E. P. Dick and C. C. Erven, \"Transformer D iagnostic Testing by \nFrequuency Response Analysis,\" Power Apparatus and Systems, IEEE \nTransactions on, vol. PAS-97, pp. 2144-2153, 1978. \n[15]W. Zhongdong, L. Jie, and D. M. Sofian, \"Interpretation of Transformer \nFRA Responses&#x2014; Part I: Influence of W inding Structure,\" Power \nDelivery, IEEE Transactions on, vol. 24, pp. 703- 710, 2009. \n[16]A. Shintemirov, W. H. Tang, and Q. H. Wu, \"Transformer winding \ncondition assessment using frequency response analysis and evidential \nreasoning,\" Electric Power Applications, IET, vol. 4, pp. 198-212, 2010. \n[17]E. Rahimpour, J. Christian, K. Feser, H. Mohseni,\"Transfer function \nmethod to diagnose axial displacement and radial deformation of transformer \nwindings,\" Power Delivery, IEEE Transactions on, vol. 18, pp.493- 505, 2003. \n[18]L. Satish and S. K. Sahoo, \"An effort to understand what factors affect the \ntransfer function of a two -winding transformer,\" Power Delivery, IEEE \nTransactions on, vol. 20, pp. 1430-1440, 2005. \n[19]K. Ragavan and L. Satish, \"Localization of Chang es in a Model Winding \nBased on Terminal Measurements: Experimental Study,\" Power Delivery, \nIEEE Transactions on, vol. 22, pp. 1557- 1565, 2007. \n[20]A. Shintemirov, W. H. Tang, and Q. H. Wu, \"Transformer Core \nParameter Identification Using Frequency Response  Analysis,\" Magnetics, \nIEEE Transactions on, vol. 46, pp. 141-149, 2010. \n[21]A. Abu-siada and S. Islam, \"A Novel Online Technique to Detect Power \nTransformer Winding Faults,\" Power Delivery, IEEE Transactions on, vol. 27, \npp. 849-857, 2012. \n[22]A. A. Reykh erdt and V. Davydov, \"Case studies of factors influencing \nfrequency response analysis measurements and power transformer \ndiagnostics,\" Electrical Insulation Magazine, IEEE, vol. 27, pp. 22- 30, 2011. \n[23]N. Abeywickrama, Y. V. Serdyuk, and S. M. Gubanski, \" High-Frequency \nModeling of Power Transformers for Use in Frequency Response Analysis \n(FRA),\" Power Delivery, IEEE Transactions on, vol. 23, pp. 2042- 2049, 2008. \n[24]G. Junfeng, G. Wensheng, T. Kexiong, and G. Shengyou, \"Deformation \nanalysis of transformer winding by structure parameter,\" in Properties and \nApplications of Dielectric Materials, 2003. Proceedings of the 7th \nInternational Conference on, 2003, pp. 487- 490 vol.1. \n[25]D. M. Sofian, W. Zhongdong, and L. Jie, \"Interpretation of Transformer \nFRA Responses&#x2014; Part II: Influence of Transformer Structure,\" Power \nDelivery, IEEE Transactions on, vol. 25, pp. 2582- 2589, 2010. \n[26]E. Rahimpour, S. Tenbohlen, \"Experimental and theoretical investigation \nof disc space variation in real high -voltage win dings using transfer function \nmethod,\" Electric Power Applications, IET, vol. 4, pp. 451- 461, 2010. \n[27] M.R.Barzegaran, \"Detecting the Position of Winding Short Circuit Faults \nin Transformer u sing High Frequency Analysis,\" European Journal of \nScientific Research  ISSN 1450-216X Vol.23 No.4 (2008), pp.644- 658, 2008  \n[28]N. Abeywickrama, Y. V. Serdyuk, and S. M. Gubanski, \"Effect of Core \nMagnetization on Frequency Response Analysis (FRA) of Power \nTransformers,\" Power Delivery, IEEE Transactions on, vol. 23, pp. 1432-\n1438, 2008. \n[29]J. Chong and A. Abu -Siada, \"A novel algorithm to detect internal \ntransformer faults,\" in Power and Energy Society General Meeting, 2011 \nIEEE, 2011, pp. 1-5. \n [30]J. Bak-Jensen, B. Bak -Jensen, and S. D. Mikkelsen, \"Detection of faul ts \nand ageing phenomena in transformers by transfer functions,\" Power \nDelivery, IEEE Transactions on, vol. 10, pp. 308- 314, 1995. \n[31]K. Pourhossein, G. B. Gharehpetian, and E. Rahimpour, \"Buckling \nseverity diagnosis in power transformer windings using Euclidean Distance \nclassifier,\" in Electrical Engineering (ICEE), 2011 19th Iranian Conference \non, 2011, pp. 1-1. \n[32]W. H. Tang, A. Shintemirov, and Q. H. Wu, \"Detection of minor winding \ndeformation fault in high frequency range for power transformer,\" in Power \nand Energy Society General Meeting, 2010 IEEE, 2010, pp. 1 -6. \n \nA. Abu-Siada (M’07, SM’12) received his B.Sc. and M.Sc. \ndegrees from Ain Shams University, Egypt and the PhD \ndegree from Curtin University, Australia , all in El ectrical \nEngineering. Currently he is a Senior L ecturer in the \nDepartment of Electrical and Computer Engineering at \nCurtin University. His research interests include power \nsystem stability, condition monitoring, power electronics \nand power quality. He i s Editor-in-Chief of the international journal Electrical \nand Electronic Engineering,  a regular reviewer for IEEE Transactions on \nDielectrics and Electrical Insulation , Power E lectronics and Sustainable \nEnergy. He is the  vice-chair of the IEEE C omputation Intellegence Society, \nWA Chapter. \n \nN. Hashemnia received BSc in Electrical Power Engineering \nfrom Yazd University, Iran in 2006 and Master of Electrical \nUtility Engineering from Curtin University in 2010. He \nreceived a scholarship from the Cooperative Research Centre \nfor Infrastructure and Asset Management in August 2011,  to \nenable him to  pursue his PhD study at Curtin University. His \nresearch interests include power transformer condition monitoring and \napplication of artificial intelligence to power systems.  \n \nS. Islam (M’83, SM’93) received the B.Sc. from Bangladesh \nUniversity of Engineering and Technology, Bangladesh, and \nthe M.Sc. and PhD degrees from King Fahd University of  \nPetroleum and Minerals, Saudi Arabia, all in electrical power \nengineering, in 1979, 1983, and  1988 respectively. He is \ncurrently the Chair Professor in Electrical Power Engineering \nat Curtin University, Australia. He received the IEEE T \n \nBurke Haye Faculty Recognition award in 2000. His research interests are in \ncondition monitoring of transformers, wind energy conversion and power \nsystems.  He is a regular reviewer for the IEEE Transactions on Energy \nConversion, Power Systems and Power Delivery. Prof. Islam is an E ditor of \nthe IEEE Transaction on Sustainable Energy.  \n \n \n \n Mohammad A. S. Masoum (S’88–M’91–SM’05) received \nhis B.S., M.S. and Ph.D. degrees in Electrical and Computer \nEngineering in 1983, 1985, and 1991, respectively, from the \nUniversity of Colorado, USA. Dr. Masoum's research \ninterests include optimization, power quality and stability of \npower systems/electric machines and distributed generation. \nCurrently, he is a Professor and the Discipline Leader and \nCourse Coordinator for Power System Engineering in  the Electrical and \nComputer Engineering Department, Curtin University, Australia. He is the co -\nauthor of Power Quality in Power Systems and Electrical Machines  (Elsevier, \n2008) and Power Conversion of Renewable Energy Systems  (Springer, 2011). \nDr. Masoum i s Editor-in-Chief for the American Journal of Engineering and  \nApplied Science, and an editor of the Australian Journal of Electrical & \nElectronic Engineering.\n \n \nSUMMARY \nData obtained using a distributed parameter model to simulate a \npower transformer are presented.  T hese data could be used in the \nformulation of  standard codes for interpretation of the frequency \nresponse analysis signatures of power transformers.  \n \nKey Words : Power transformer, FRA,  condition monitoring, \nwinding deformation. \nI. INTRODUCTION \nHE majority of transformers currently in service \nworldwide were installed prior to 1980, and consequently \nmost of them are approaching or ha ve already exceeded their \ndesign lifetimes [1, 2]. This poses a significant risk for utilities \nand other power network stakeholders, since the impact of in -\nservice transformer failure can be catastrophic.  One of the \nmost serious problems  with an in-service transformer is \nmovement of its  windings due to e lectromagnetic forces \ngenerated during short circuit  faults. Reduction of clamping \npressure due to insulation aging can also cause winding \nmovement, and may result in an explosion  [3-6]. There are \nmany causes of mechanical faults, e.g., earthquake, explosion \nof combustible gas in the transformer oil, short circuit \ncurrents, and careless transportation [7,8]. While a transformer \nwith minor winding deformation may continue to work \nsatisfactorily, its capability to withstand further mechanical  or \nelectrical faults will gradually decrease  [9]. Therefore it is \nessential to detect any minor winding deformation as soon as \npossible, and to take appropriate remedial action . Winding \ndeformation has various forms, e.g., spiral tightening, \nconductor tilting, radial/hoop buckling, shorted or open turns, \nloosened clamping structures, axial displacement, core \nmovement, and collapse of the winding end supports. It is \ndifficult to differentiate between these internal faults  using \nconventional testing methods [10]. \n   In this article data obtained using a high frequency \ndistributed parameter model to simulate a power transformer \nare presented.  Mechanical faults such as axial displacement, \nradial buckling, disk spac e variation, loss of clamping, \nbushing and leakage faults were simulated by modifying the \nrelevant electrical parameters in the transformer model , or by \nreconfiguring the impacted disks in a 3D transformer finite \nelement model. It is suggested that the res ulting data could be \nused in the formulation of  standard codes for interpretation of \nthe frequency response analysis signatures of power \ntransformers. \n  \nII. F\nREQUENCY RESPONSE AN ALYSIS \n   Frequency response analysis (FRA) is a powerful diagnostic \ntechnique widely used to identify internal faults within power \ntransformers [11]. Transformer components such as windings, \ncore and insulation can be represented by equivalent circuits \ncomprising resistors, capacitors, and self / mutual inductances, \nwhose values will be altered by a mechanical fault within the \ntransformer. Thus the frequency resp onse of the relevant \nequivalent circuit winding will change . Changes in \nttransformer geometry, or in the dielectric propertie s of \ninsulating materials due to ageing or increasing water content, \nalso affect the shape of the frequency response, especially the \nresonant frequencies and their damping [8]. \n   FRA is an offline technique in which a low voltage ac signal \nis injected at one terminal of a winding, and the response is \nmeasured at the other terminal of the same winding with \nreference to the grounded tank. The FRA analyzer measures \nthe transfer function, impedance or admittance of the winding, \ntypically over the frequency range 10 Hz - 2 MHz, and one or \nall of these three properties  can be used for fault diagnosis. \nAlthough the FRA equipment can be connected to the \ntransformer in different ways  [12-14], end-to-end connection \nshown in Fig. 1  is capable of detecting the main types of \nmechanical faults [1\n4].  \n \nFig. 1. FRA end-to-end test configuration \n   The FRA signature is considered as a fingerprint of the \ntransformer, which can be compared with a previous signature \nin order to detect any mechanical deformation  which may \nhave developed between the recording of the two signatures.\n \nFRA diagnosis has also been utilized recently to identify \nwinding deformations in rotating machine s [13]. While the \nmeasurement procedure using commercial test equipment is \nquite simple, skilled and experienced personnel are required in \norder to interpret the FRA signatures and identify correctly the \ntype and location of a fault. Although much research has been \ndone on this topic, a reliable FRA signature interpretation \ncode has not yet been published.  \nThe authors of [14] sub-divide the FRA frequency range as \nfollows: \n(a) the low frequency range (<20 kHz), within which inductive \ncomponents dominate the transformer winding response \nUnderstanding Power Transformer Frequency Response \nAnalysis Signatures  \nA. Abu-Siada, N. Hashemnia, S. Islam, and Mohammad A.S. Masoum \nElectrical and Computer Engineering Department, Curtin University, Western Australia   \n \nT \n \n(b) the medium frequency range (20–400 kHz), within which \nthe combination of induct ive and capacit ive components  \nresults in multiple resonances \n(c) the high frequency range (>400 kHz), within which \ncapacitive components dominate the FRA signature [15 ].      \nThese ranges and the associated fault types are summarized in \nTable I [16, 17]. \n   TABLE I \nFRA BANDS AND THEIR SENISTIVITY TO FAULTS [16] \nFrequency Band Fault sensitivity \n< 20kHz Core deformation, open circuits, shorted turns  \nand residual magnetism, bulk winding \nmovement,  clamping structure loosening \n20 - 400 kHz Deformation within the main or tap windings  \n> 400 kHz Movement of the main and tap windings,  \nground impedances variations \n    \nIII. TRANSFORMER MODEL AND SENSITIVITY ANALYSIS \n   Simplorer software was used to simulate the transformer \nmodel shown in Fig. 2 [17-19]. \n \nFig. 2. 10-disk model of a transformer [17]. \n \n   The high voltage (HV) and low voltage (LV) windings are \neach assumed to consist of 10 disks. Each disk comprises a \nseries resistance ( Rs) and inductance ( Ls), shunted by a  \ncapacitor (Csh) and a conductance (Gsh). The capacitance (CHL) \nbetween the HV and LV windings is shunted by a dielectric \nconductance ( GHL), and mutual inductances ( Mij) between \ncoils i and j are included. The dielectric insulation  (oil) \nbetween the LV winding and the core, and between the HV \nwinding and the tank, is simulated by a capacitance ( Cg) and \ndielectric conductance (G). The fault-free component values of \nthe model given in [9] and [13] are listed in the Appendix.  \n   In Table II the transformer model parameters , and the \nmechanical faults which influence them , are listed.  Various \nmechanical faults can be simulated by changing relevant \nparameters in the transformer m odel. This  can aid in \nestablishing a standard code for FRA signature interpretation.  \nTable II \nMODEL PARAMETERS AND THE MECHANICAL FAULTS WHICH \nINFLUENCE THEM [9], [11], [17], [20]-[23] \n \nModel Parameter Type of Fault \nInductance Ls Disk deformation, local breakdown , core \ndeformation and winding short circuits. \nShunt Capacitance \nCsh \nDisk movements, buckling due to large \nmechanical forces, moisture ingress  and loss of \nclamping pressure. \nSeries Capacitance \nCHL \nAgeing of insulation , moisture ingress  and disk \nmovement. \nResistance Rs Shorted or broken disk, failure of caulking \ncontacts and tap changer contact wear.  \n    The sensitivity of the FRA signature to variation of the \nmodel parameters was investigated. As shown in Fig. 2, a \nsinusoidal excitation voltage ( Vin) of 10 V and variable \nfrequency (10 Hz to 2 MHz) is connected to one winding \nterminal, and the response at the other terminal of the winding \n(V\no) is recorded. The input/output coaxial leads used in \npractical measurements are represented by 50 Ω resistors ( Ri \nand Ro in Fig. 2). The transfer function TF dB = 20 log 10 \nis plotted against frequency.  Fig. 3 shows the effect of \n±10% changes in the capacitances C g and Csh of the HV \nwinding on the FRA signature, compared to the base line \n(fingerprint) signature. Increasing C\nsh decreases the resonance \nand anti -resonance frequencies, i.e., the local minimum and \nlocal maximum frequencies respectively, with small changes \nin magnitude. Decreasing Csh increases the resonance and anti-\nresonance frequencies. The same trends are observed for C g \nvariation. It will be seen that the impact of varying Cg and Csh \nis more pronounced at frequencies above 400 kHz. \n \n \nFig. 3. Effect of ± 10% changes in the HV capacitance on the FRA signature, \nrelative to the baseline (a) Cg , (b) Csh   \n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-70.00\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00TF(dB)\n(a)\nCurve Info\nFingerprint\nCg Increased\nCg Decreased\n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-70.00\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00TF(dB)\n(b)\nCurve Info\nFingerprint\nCsh Increased\nCsh Decreased\n \n       Fig. 4 shows the effect of changing the self ( Ls) and \nmutual ( Mij) inductances by ±10%.  Unlike the effect of \nchanges in Cg and Csh, which appears at frequencies above 400 \nkHz, the effect of changes in Ls and Mij appears below 20 kHz \nand is more pronounced close to 1 MHz . This is attributed to \nthe fact that the amount of magnetic flux penetrating the \ntransformer core at low frequencies  is significant, so that the \ncore characteristics affect the FRA signature at low frequency. \nAt high frequencies the magnetic flux tends to encase the core \nand the transformer capacitive components dominate the \nresponse.  \n  \n \n \nFig. 4. Effect of ± 10% changes in the HV self/mutual inductances on the \nFRA signature, relative to the baseline (a) mutual inductance Mij (b) self \ninductance LS  \n   As shown in Fig. 4, increasing Ls decreases the resonance \nand anti -resonance frequencies, with s mall changes in \nmagnitude. On the other hand, decreasing Ls increases the \nresonance and anti -resonance frequencies, again with small \nchanges in magnitude. Opposite trends are observed when the \nmutual inductances Mij are changed, i.e., i ncreasing Mij \nincreases the resonance and anti -resonance frequencies, and \ndecreasing Mij decreases them, over the entire frequency range.  \n \nFig. 5. Effect of increased dielectric conductance G on the FRA signature \n   Fig. 5 shows the effect increasing the HV conductance (G) \nby 10% on the FRA signature (A decrease in conductance, i.e., \nan increase in dielectric resistance, is considered unlikely for \ntransformer insulation).  As shown in Fig. 5, increasing the \ndielectric conductance (G) has no effect on the reson ance and \nanti-resonance frequencies. It does however slightly change \nthe magnitudes of the peaks at high frequencies. This result is \nattributed to the very high dielectric resistance used in the \nsimulation (7 MΩ), typical for transformer oil.  \n   The effects of ±10% variations in various electrical \nparameters on the FRA resonance frequencies and magnitudes \nare summarised in Table III. \nTABLE III \nEFFECTS OF ±10% VARIATIONS IN VARIOUS ELECTRICAL PARAMETERS ON \nFRA REONANCE FREQUENCIES AND MAGNITUDES (RELAT IVE TO \nFINGERPRINTS) \nParameter \nVariations \nFrequency Range \nLow  \n(<20 kHz) \nMedium  \n(20–400 kHz) \nHigh  \n(>400 kHz) \n \n \n \nLs \n \n10% \nIncrease \nMagnitude and \nresonance frequencies \ndecreased \nMagnitude and \nresonance \nfrequencies \ndecreased \nMagnitude \nand \nresonance \nfrequencies \ndecreased \n10% \nDecrease \nMagnitude and \nresonance \nfrequencies \nincreased \nMagnitude and \nresonance \nfrequencies \nincreased \nMagnitude \nand \nresonance \nfrequencies \nincreased \n \nCsh \n \n10% \nIncrease  No impact No impact \nResonance \nfrequencies, \nmagnitude  \ndecreased \n10% \nDecrease No impact No impact \nResonance \nfrequencies, \nmagnitude  \nincreased \n \n \n \nCg \n \n10% \nIncrease No impact No impact \nResonance \nfrequencies \nslightly   \ndecreased \n10% \nDecrease No impact No impact \nResonance \nfrequencies, \nmagnitude  \nincreased \n \n \nMij \n \n10% \nIncrease \nResonance \nfrequencies \nincreased \nResonance \nfrequencies \nincreased \nResonance \nfrequencies \nincreased \n10% \nDecrease \nResonance \nfrequencies \ndecreased \nResonance \nfrequencies \ndecreased \nResonance \nfrequencies \ndecreased \n \nG \n10% \nIncrease No impact No impact Magnitude \ndecreased \nIV. FAULT ANALYSIS \n   In order to simulate physical faults within the  transformer, \nSimplorer and Maxwell software were used to simulate a 3D \nfinite element model of the single phase, shell -type \ntransformer shown in Fig. 6.  \n \n \n \n \n \n \nFig. 6. 3D Transformer model  \n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-100.00\n-90.00\n-80.00\n-70.00\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00TF(dB)\n(a)\nCurve Info\nFingerprint\nMij Increased\nMij Decreased\n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-70.00\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00TF(dB)\n(b)\nCurve Info\nFingerprint\nLs Increased\nLs Decreased\n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-90.00\n-80.00\n-70.00\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00\n-10.00TF(dB)\nCurve Info\nFingerprint\nG Increased\n715.53 800.00 893.88\nFrequency(kHz)\n-50.00\n-45.00\n-40.00\n-35.00\n-30.00\n-25.00\n-20.00TF(dB)\n\n \nVarious mechanical faults within the transformer model were  \nsimulated by changing the transformer coil configuration. The \ncorresponding changes in the  electrical parameters  of the \ntransformer model (Fig. 2) were calculated using the software. \nThe resulting signatures were compared with the fingerprint \nsignature.  \nA. Loss of Clamping Pressure  \nLoss of clamping pressure is a common problem, particularly \nin aged transformers. It is caused by mechanical hysteresis in \npressboard and paper insulation [24], and leads to an increase \nin insulation conductivity because of the reduced insulation \nthickness between winding layer s. It can be simulated by \nincreasing the value of the shunt conductance Gsh [21]. Figs. 7 \nand 8 show the effect of a 20% increase in Gsh on the FRA \nsignatures of the HV and LV  windings respectively; the \nresonance and anti-resonance frequencies are not shifted, but \nthe magnitudes of the resonance peaks are decreased over the \nentire frequency range . The large negative spike in the HV \nwinding signature around 200 kHz is thought to be an artefact \nof the software.  \n \nFig. 7. Effect of simulated loss of clamping pressure on the FRA signature of \nthe HV winding  \n \nFig. 8. Effect of simulated loss of clamping pressure on the FRA signature of \nthe LV winding  \nB. Inter-Disk Fault \n  The inter-disk fault is one of the most common mechanical \nfaults within power transformers, and approximately  80% of \nmechanical failures are attributable to  it [12]. It is due to \nchanges in the axial disk space (Fig. 9) caused by excess  \nmechanical stress and short circuit faults, and can be simulated \nby increasing the series capacitance ( Csh) and the mutual \ninductance (Mij )  between the two relevant disks [25, 26]. Fig. \n10 shows the effect of a 10% increase in Csh and Mij on the HV \nFRA signature when the fault occurs  at the top, middle and \nbottom of the HV winding . A 10% increase in Csh and in Mij \ncorresponds to a 10% increase in Δh, the space between the \naffected disks (Fig. 9). Fig. 10 shows that this fault does not \nhave a significant effect on the FRA signature at  frequencies \nbelow 300 kHz. The resonance and anti-resonance frequencies \nabove 300 kHz are decreased , and the peak  magnitudes are \nchanged. The frequency decreases are larger when the fault \noccurs within the top or bottom disks of the winding, rather \nthan within the middle disks.   \nΔh\nLV \nHV \nCore\nΔh\n \nFig. 9.  Interdisk fault (Δh) configuration  \n \n \nFig. 10. Effect of inter-disk fault on the FRA signature of the HV winding. \n C. HV Winding Bushing Fault \n   This type of fault  can be simulated by connecting the \nbushing T-circuit model shown in Fig. 11 between the voltage \nsource Vin  and the transformer model shown in Fig. 2 [5].  \n2.5µH 2.5µH\n400pF\n400pF\n0.2Ω 0.2Ω \nSignal \nInjection\nTo transformer \nwinding \n \nFig. 11. Transformer bushing model [5]  \n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-140.00\n-115.00\n-90.00\n-65.00\n-40.00\n-15.00TF(dB)\nCurve Info\nFingerprint\nLoss of clamping pressure (HV)\n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-60.00\n-50.00\n-40.00\n-30.00\n-20.00\n-10.00\n0.00\nTF(dB)\nCurve Info\nFingerprint\nLoss of clamping pressure (LV)\n\n \n  \nFig. 12. Impact of high voltage bushing fault on the FRA signature  of the HV \nwinding \n   The effect of a 10% reduction  in bushing capacitance (800 \npF) shown in Fig. 11  on the FRA signature is shown in Fig. \n12. A reduction in bushing capacit ance corresponds to a \nreduction in the breakdown voltage of the bushing insulation.   \nAs shown in Fig. 12, t here is no significant change in the \nsignature below 600 kHz, but the resonance and antiresonance \npeaks around 700 kHz in the fingerprint disappear.  \nD. Axial Displacement Fault \nThis fault occurs due to imbalanced magnetic forces generated \nin a winding as a result of a short -circuit fault [21] . These \nforces cause axial movement of the winding as shown in Fig. \n13.  \nΔh\nCore\nLV \nHV \n (a) Healthy \nConfiguration\n(b) Axial \nDisplacement \nConfiguration  \nFig. 13. Axial displacement (Δh) configuration  \n   \n \nFig. 14. Impact of HV axial displacement on the FRA signature \n   The fault can be simulated by changing the values of the \nseries capacitance (Csh) and mutual inductance (M ij) between \nthe HV and LV windings [27]. A 10% increase in CHL and in \nMij corresponds to approximately 10% movement Δh which is \nthe ratio of the HV axial displacement and the overall length \nof the winding (Fig. 13). \n   Fig. 14 shows that such a fault has little effect on the FRA \nsignature below 200 kHz.  In the range 200-400 kHz the \nresonance frequencies and magnitudes decrease. The \nresonance around 700 kHz in the fingerprint is shifted towards \nhigher frequency and its magnitude increases. These trends are \nindependent of the direction of the axial movement. \nE. Dielectric Leakage Current Fault  \n  Ground shield damage, oil and paper  aging, high  moisture \ncontent in the winding and abrasion of solid insulation are the \nmain causes of leakage current to earth  through transformer \ninsulation [28]. This type of fault can be simulated by \nincreasing the conductance between the HV winding and the  \nground (G in Fig.2) [29]. Fig. 15 shows that this fault  \nproduces  small changes in peak magnitude below 200 kHz. \n \nFig. 15. Effect of leakage fault on the FRA signature \nF. Short Circuit Fault \n  This fault is due to erosion of  the winding and conductor \ninsulation, due to vibrations generated by  electromechanical \nforces. The erosion  may lead to excessive current in the \nwinding [27]. The fault can be simulated by short circuiting \nthe series resistance Rs and the series inductance Ls of the HV \nwinding (Fig.2) [30]. Fig. 16 shows that it fault has little effect \non the signature at  frequencies below 200 kHz . At higher \nfrequencies the magnitude is slightly increased and the \nresonance frequencies are slightly decreased. The same fault \nhas a greater effect when it occurs at the top or bottom of the \nwinding rather than in the middle.   \n \n0.00 0.20 0.40 0.60 0.80 1.00\nFrequency(MHz)\n-140.00\n-115.00\n-90.00\n-65.00\n-40.00\n-15.00TF(dB)\nCurve Info\nFingerprint\nBushing Fault\n\n \n \n \nFig. 16. Impact of HV winding short circuit fault on the FRA signature when \nit occurs (a) at the top of the winding, (b) at the middle and bottom of the \nwinding \n   \nG. Radial Displacement Fault \n  Windings may be subjected to radial forces arising from the \ninteraction of the  winding current with the magnetic flux. \nFig.17 shows a radial dislocation  between the LV and HV \nwindings. Large radial forces may lead to  winding buckling \n[31]. This fault can be simulated by decreasing the capacitance \nto ground (C g), the capacitance between the HV and LV \nwindings (C HL), and  the mutual inductance ( Mij) of the \nimpacted disks [32]. A simultaneous decrease of 10% in each \nof these three parameters  corresponds to a  10% radial \ndisplacement Δw of the impacted disks as shown in Fig. 17. \nΔw is calculated as the ratio of the radial displacement of the \nimpacted disks to the diameter of the disk. The FRA responses \nof the HV and LV windings are shown in Fig. 18  (a) and (b) \nrespectively. \n \n                    \n(c) Inter-disc fault\nHV \nLV \nΔw Core\n \n               \nFig. 17.   Radial fault (Δw) configuration  \n \n    \n  \n \nFig. 18.  Impact of radial fault on the FRA signature (a)HV  (b) LV winding \n  Fig. 18 (a) shows that the resonance frequencies of the HV \nwinding are increased slightly at frequencies above 400 kHz. \nIn the LV winding an increase occurs at frequencies above 20 \nkHz.  \n   Table IV is a listing of the various fault types and their \neffects on t he FRA signature. It could be used in the \nformulation of standard codes for power transformer FRA \nsignature interpretation. \n \nTABLE IV \nIMPACT OF VARIOUS FAULTS ON TRANSFORMER FRA SIGNATURE  \nFault Type Frequency Range \n< 20kHz 20-400 kHz > 400 kHz \nAxial \nDisplacement \nNo impact \n \nResonance \nfrequencies and \nmagnitude \ndecreased \nResonance \nfrequencies and \nmagnitude  \nincreased \nRadial \nDisplacement \nResonance \nfrequencies \nincreased \nResonance \nfrequencies \nincreased \nResonance \nfrequencies \nincreased \nHigh Voltage \nBushing \nNo impact \n \nNo impact \n \nMagnitude \ndecreased, one \nresonance \nfrequency \ndisappears \nDielectric \nLeakage \ncurrent \nMagnitude \ndecreased \nMagnitude \ndecreased \nNo impact \n \nInter Disk \nNo significant \nimpact \nResonance \nfrequencies and \nmagnitudes \nincreased \nResonance \nfrequencies and \nmagnitudes \nincreased \n \nShort Circuit \nNo significant \nimpact \nResonance \nfrequencies \ndecreased and  \nmagnitudes \nincreased \nResonance \nfrequencies \ndecreased and  \nmagnitudes \nincreased \nLoss of \nClamping \nPressure \nMagnitude \ndecreased \nMagnitude \ndecreased \nMagnitude \ndecreased \n    \nV. CONCLUSION \n    This  paper presents a comprehensive analysis of the effects \nof various faults on the FRA signatures of a transformer \nsimulated by a high frequency model. The faults were \nsimulated through changes in the values of some of the \nelectrical components in the model.  It was found that radial \ndisplacement of a winding alters the FRA signature over the \nentire frequency range (10 Hz -1 MHz), whereas changes due \n\n \nto axial displacement occur only at frequencies above 200 \nkHz. A table listing various transformer faults and the \nassociated changes in the FRA signature was compiled, and \ncould be used in the formulation of standard codes for power \ntransformer FRA signature interpretation. \nAPPENDIX  \nTRANSFORMER MODEL COMPONENT VALUES [9, 13] \n Rs Ls Csh Cg Chl 1/G \nHV 1.2Ω 180µH 0.013nF 3nF 5nF 7 MΩ \nLV 0.5Ω 65µH 0.026nF 6nF 5Nf 7 MΩ \nVI. REFERENCES \n[1] S. Islam, K. M. Coates, and G. Ledwich, \"Identification of high frequency \ntransformer equivalent circuit using Matlab from  frequency domain data,\" in \nIndustry Applications Conference, 1997. Thirty -Second IAS Annual Meeting, \nIAS '97., Conference Record of the 1997 IEEE, 1997, pp. 357- 364 vol.1. \n[2] E.J. Figueroa,\"Managing An Aging Fleet of Transformers,\" Canada, 2009.  \n[3]L. M. Geldenhuis, \"Power transformer life management,\" in Electricity \nDistribution, 2005. CIRED 2005. 18th International Conference and \nExhibition on, 2005, pp. 1-4. \n[4]S. M. Islam and G. Ledwich, \"Locating transformer faults through \nsensitivity analysis of hig h frequency modeling using transfer function \napproach,\" in Electrical Insulation, 1996., Conference Record of the 1996 \nIEEE International Symposium on, 1996, pp. 38- 41 vol.1. \n[5]M. Wang, A. J. Vandermaar, and K. D. Srivastava, \"Improved detection of \npower transformer winding movement by extending the FRA high frequency \nrange,\" Power Delivery, IEEE Transactions on, vol. 20, pp. 1930- 1938, 2005. \n[6]W. J. McNutt, W. M. Johnson, R. A. Nelson, and R. E. Ayers, \"Power \nTransformen Short -Circuit Strength -  Requirements, Design, and \nDemonstration,\" Power Apparatus and Systems, IEEE Transactions on, vol. \nPAS-89, pp. 1955-1969, 1970. \n[7]M. Bagheri, M. S. Naderi, T. Blackburn, and T. Phung, \"FRA vs. short \ncircuit impedance measurement in detection of mechanical defects within \nlarge power transformer,\" in Electrical Insulation (ISEI), Conference Record \nof the 2012 IEEE International Symposium on, 2012, pp. 301- 305. \n[8]K. G. N. B. Abeywickrama, Y. V. Serdyuk, and S. M. Gubanski, \n\"Exploring possibilities for characterizatio n of power transformer insulation \nby frequency response analysis (FRA),\" Power Delivery, IEEE Transactions \non, vol. 21, pp. 1375-1382, 2006. \n[9]E. Rahimpour, M. Jabbari, and S. Tenbohlen, \"Mathematical Comparison \nMethods to Assess Transfer Functions of Tra nsformers to Detect Different \nTypes of Mechanical Faults,\" Power Delivery, IEEE Transactions on, vol. 25, \npp. 2544-2555, 2010. \n[10]B. J. Small and A. Abu -Siada, \"A new method for analysing transformer \ncondition using frequency response analysis,\" in Power and Energy Society \nGeneral Meeting, 2011 IEEE, 2011, pp. 1-5. \n[11]S. D. Mitchell and J. S. Welsh, \"Modeling Power Transformers to Support \nthe Interpretation of Frequency-Response Analysis,\" Power Delivery, IEEE \nTransactions on, vol. 26, pp. 2705-2717, 2011. \n[12]E. Rahimpour, J.Christian, K.  Feser, H. Mohseni, \"Transfer Function \nMethod to Diagnose Axial Displacement , Radial Deformation of Transformer \nWinding,\" Power Engineering Review, IEEE, vol.22, pp.70 -70, 2002. \n[13]\n C. A. Platero, F. Blazquez, P. Frias, and D. Ramirez,\"Influence of Rotor \nPosition in FRA Response for Detection of Insulation Failures in Salient -Pole \nSynchronous Machines,\"  IEEE Transactions on  Energy Conversion , vol. 26, \npp. 671-676, June 2011.  \n[14]E. P. Dick and C. C. Erven, \"Transformer D iagnostic Testing by \nFrequuency Response Analysis,\" Power Apparatus and Systems, IEEE \nTransactions on, vol. PAS-97, pp. 2144-2153, 1978. \n[15]W. Zhongdong, L. Jie, and D. M. Sofian, \"Interpretation of Transformer \nFRA Responses&#x2014; Part I: Influence of W inding Structure,\" Power \nDelivery, IEEE Transactions on, vol. 24, pp. 703- 710, 2009. \n[16]A. Shintemirov, W. H. Tang, and Q. H. Wu, \"Transformer winding \ncondition assessment using frequency response analysis and evidential \nreasoning,\" Electric Power Applications, IET, vol. 4, pp. 198-212, 2010. \n[17]E. Rahimpour, J. Christian, K. Feser, H. Mohseni,\"Transfer function \nmethod to diagnose axial displacement and radial deformation of transformer \nwindings,\" Power Delivery, IEEE Transactions on, vol. 18, pp.493- 505, 2003. \n[18]L. Satish and S. K. Sahoo, \"An effort to understand what factors affect the \ntransfer function of a two -winding transformer,\" Power Delivery, IEEE \nTransactions on, vol. 20, pp. 1430-1440, 2005. \n[19]K. Ragavan and L. Satish, \"Localization of Chang es in a Model Winding \nBased on Terminal Measurements: Experimental Study,\" Power Delivery, \nIEEE Transactions on, vol. 22, pp. 1557- 1565, 2007. \n[20]A. Shintemirov, W. H. Tang, and Q. H. Wu, \"Transformer Core \nParameter Identification Using Frequency Response  Analysis,\" Magnetics, \nIEEE Transactions on, vol. 46, pp. 141-149, 2010. \n[21]A. Abu-siada and S. Islam, \"A Novel Online Technique to Detect Power \nTransformer Winding Faults,\" Power Delivery, IEEE Transactions on, vol. 27, \npp. 849-857, 2012. \n[22]A. A. Reykh erdt and V. Davydov, \"Case studies of factors influencing \nfrequency response analysis measurements and power transformer \ndiagnostics,\" Electrical Insulation Magazine, IEEE, vol. 27, pp. 22- 30, 2011. \n[23]N. Abeywickrama, Y. V. Serdyuk, and S. M. Gubanski, \" High-Frequency \nModeling of Power Transformers for Use in Frequency Response Analysis \n(FRA),\" Power Delivery, IEEE Transactions on, vol. 23, pp. 2042- 2049, 2008. \n[24]G. Junfeng, G. Wensheng, T. Kexiong, and G. Shengyou, \"Deformation \nanalysis of transformer winding by structure parameter,\" in Properties and \nApplications of Dielectric Materials, 2003. Proceedings of the 7th \nInternational Conference on, 2003, pp. 487- 490 vol.1. \n[25]D. M. Sofian, W. Zhongdong, and L. Jie, \"Interpretation of Transformer \nFRA Responses&#x2014; Part II: Influence of Transformer Structure,\" Power \nDelivery, IEEE Transactions on, vol. 25, pp. 2582- 2589, 2010. \n[26]E. Rahimpour, S. Tenbohlen, \"Experimental and theoretical investigation \nof disc space variation in real high -voltage win dings using transfer function \nmethod,\" Electric Power Applications, IET, vol. 4, pp. 451- 461, 2010. \n[27] M.R.Barzegaran, \"Detecting the Position of Winding Short Circuit Faults \nin Transformer u sing High Frequency Analysis,\" European Journal of \nScientific Research  ISSN 1450-216X Vol.23 No.4 (2008), pp.644- 658, 2008  \n[28]N. Abeywickrama, Y. V. Serdyuk, and S. M. Gubanski, \"Effect of Core \nMagnetization on Frequency Response Analysis (FRA) of Power \nTransformers,\" Power Delivery, IEEE Transactions on, vol. 23, pp. 1432-\n1438, 2008. \n[29]J. Chong and A. Abu -Siada, \"A novel algorithm to detect internal \ntransformer faults,\" in Power and Energy Society General Meeting, 2011 \nIEEE, 2011, pp. 1-5. \n [30]J. Bak-Jensen, B. Bak -Jensen, and S. D. Mikkelsen, \"Detection of faul ts \nand ageing phenomena in transformers by transfer functions,\" Power \nDelivery, IEEE Transactions on, vol. 10, pp. 308- 314, 1995. \n[31]K. Pourhossein, G. B. Gharehpetian, and E. Rahimpour, \"Buckling \nseverity diagnosis in power transformer windings using Euclidean Distance \nclassifier,\" in Electrical Engineering (ICEE), 2011 19th Iranian Conference \non, 2011, pp. 1-1. \n[32]W. H. Tang, A. Shintemirov, and Q. H. Wu, \"Detection of minor winding \ndeformation fault in high frequency range for power transformer,\" in Power \nand Energy Society General Meeting, 2010 IEEE, 2010, pp. 1 -6. \n \nA. Abu-Siada (M’07, SM’12) received his B.Sc. and M.Sc. \ndegrees from Ain Shams University, Egypt and the PhD \ndegree from Curtin University, Australia , all in El ectrical \nEngineering. Currently he is a Senior L ecturer in the \nDepartment of Electrical and Computer Engineering at \nCurtin University. His research interests include power \nsystem stability, condition monitoring, power electronics \nand power quality. He i s Editor-in-Chief of the international journal Electrical \nand Electronic Engineering,  a regular reviewer for IEEE Transactions on \nDielectrics and Electrical Insulation , Power E lectronics and Sustainable \nEnergy. He is the  vice-chair of the IEEE C omputation Intellegence Society, \nWA Chapter. \n \nN. Hashemnia received BSc in Electrical Power Engineering \nfrom Yazd University, Iran in 2006 and Master of Electrical \nUtility Engineering from Curtin University in 2010. He \nreceived a scholarship from the Cooperative Research Centre \nfor Infrastructure and Asset Management in August 2011,  to \nenable him to  pursue his PhD study at Curtin University. His \nresearch interests include power transformer condition monitoring and \napplication of artificial intelligence to power systems.  \n \nS. Islam (M’83, SM’93) received the B.Sc. from Bangladesh \nUniversity of Engineering and Technology, Bangladesh, and \nthe M.Sc. and PhD degrees from King Fahd University of  \nPetroleum and Minerals, Saudi Arabia, all in electrical power \nengineering, in 1979, 1983, and  1988 respectively. He is \ncurrently the Chair Professor in Electrical Power Engineering \nat Curtin University, Australia. He received the IEEE T \n \nBurke Haye Faculty Recognition award in 2000. His research interests are in \ncondition monitoring of transformers, wind energy conversion and power \nsystems.  He is a regular reviewer for the IEEE Transactions on Energy \nConversion, Power Systems and Power Delivery. Prof. Islam is an E ditor of \nthe IEEE Transaction on Sustainable Energy.  \n \n \n \n Mohammad A. S. Masoum (S’88–M’91–SM’05) received \nhis B.S., M.S. and Ph.D. degrees in Electrical and Computer \nEngineering in 1983, 1985, and 1991, respectively, from the \nUniversity of Colorado, USA. Dr. Masoum's research \ninterests include optimization, power quality and stability of \npower systems/electric machines and distributed generation. \nCurrently, he is a Professor and the Discipline Leader and \nCourse Coordinator for Power System Engineering in  the Electrical and \nComputer Engineering Department, Curtin University, Australia. He is the co -\nauthor of Power Quality in Power Systems and Electrical Machines  (Elsevier, \n2008) and Power Conversion of Renewable Energy Systems  (Springer, 2011). \nDr. Masoum i s Editor-in-Chief for the American Journal of Engineering and  \nApplied Science, and an editor of the Australian Journal of Electrical & \nElectronic Engineering.\n "
}