{
  "title": "Devenir musulmane pour discipliner le corps et transformer l’esprit",
  "url": "https://openalex.org/W2151220758",
  "year": 2012,
  "authors": [
    {
      "id": "https://openalex.org/A5053608327",
      "name": "Géraldine Mossière",
      "affiliations": [
        "Université de Montréal"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1942618001",
    "https://openalex.org/W2101513886",
    "https://openalex.org/W2064749916",
    "https://openalex.org/W2051176586",
    "https://openalex.org/W4235420751",
    "https://openalex.org/W1974519284",
    "https://openalex.org/W2138885601",
    "https://openalex.org/W6600987683",
    "https://openalex.org/W1531955244",
    "https://openalex.org/W2147409824",
    "https://openalex.org/W2026372904",
    "https://openalex.org/W3211474204",
    "https://openalex.org/W2317356104",
    "https://openalex.org/W1547026353",
    "https://openalex.org/W651466875",
    "https://openalex.org/W2038600245",
    "https://openalex.org/W2540844921",
    "https://openalex.org/W418231951",
    "https://openalex.org/W1874546263",
    "https://openalex.org/W132272324",
    "https://openalex.org/W260186310",
    "https://openalex.org/W23976310",
    "https://openalex.org/W1983179236",
    "https://openalex.org/W1546124888"
  ],
  "abstract": "À partir de données ethnographiques collectées auprès de nouvelles musulmanes rencontrées en France et au Québec, nous examinons le processus de conversion comme une forme d’herméneutique (Foucault). Nous montrons que la performance religieuse constitue une technique du soi qui, par la discipline du corps, vise à restaurer l’individu comme sujet éthique et acteur social. De ces religiosités contemporaines découlent de nouvelles conceptions du corps, de la santé et de la guérison perçues selon une vision holistique.",
  "full_text": "Tous droits réservés © Ethnologies, Université Laval, 2011\nCe document est protégé par la loi sur le droit d’auteur. L’utilisation des\nservices d’Érudit (y compris la reproduction) est assujettie à sa politique\nd’utilisation que vous pouvez consulter en ligne.\nhttps://apropos.erudit.org/fr/usagers/politique-dutilisation/\nCet article est diffusé et préservé par Érudit.\nÉrudit est un consortium interuniversitaire sans but lucratif composé de\nl’Université de Montréal, l’Université Laval et l’Université du Québec à\nMontréal. Il a pour mission la promotion et la valorisation de la recherche.\nhttps://www.erudit.org/fr/\nDocument généré le 5 nov. 2025 14:56\nEthnologies\nDevenir musulmane pour discipliner le corps et transformer\nl’esprit\nL’herméneutique du sujet pieux comme voie de restauration\ndu soi\nGéraldine Mossière\nVolume 33, numéro 1, 2011\nURI : https://id.erudit.org/iderudit/1007799ar\nDOI : https://doi.org/10.7202/1007799ar\nAller au sommaire du numéro\nÉditeur(s)\nAssociation Canadienne d’Ethnologie et de Folklore\nISSN\n1481-5974 (imprimé)\n1708-0401 (numérique)\nDécouvrir la revue\nCiter cet article\nMossière, G. (2011). Devenir musulmane pour discipliner le corps et\ntransformer l’esprit : l’herméneutique du sujet pieux comme voie de\nrestauration du soi. Ethnologies, 33(1), 117–142.\nhttps://doi.org/10.7202/1007799ar\nRésumé de l'article\nÀ partir de données ethnographiques collectées auprès de nouvelles\nmusulmanes rencontrées en France et au Québec, nous examinons le\nprocessus de conversion comme une forme d’herméneutique (Foucault). Nous\nmontrons que la performance religieuse constitue une technique du soi qui,\npar la discipline du corps, vise à restaurer l’individu comme sujet éthique et\nacteur social. De ces religiosités contemporaines découlent de nouvelles\nconceptions du corps, de la santé et de la guérison perçues selon une vision\nholistique.\n\nDEVENIR MUSULMANE POUR DISCIPLINER LE CORPS ET\nTRANSFORMER L’ESPRIT\nL’herméneutique du sujet pieux comme voie de restauration du soi\nGéraldine Mossière\nUniversité de Montréal\nNoémie, une jeune Québécoise dans la vingtaine, s’est convertie à\nl’islam depuis trois ans. Souffrant de fatigue chronique depuis son\nenfance, elle explique avec satisfaction que le rythme régulier des\npratiques religieuses ainsi que la discipline de vie imposée par l’islam\nlui ont permis d’améliorer son état de santé et de trouver un équilibre\ndans son quotidien. Mélanie, une étudiante entrée elle aussi dans l’islam\ndepuis quelques années, diffuse parmi sa liste de distribution électronique\n(incluant des non-musulmans) les résultats d’une recherche scientifique\npréconisant de porter le front à la terre de temps à autre afin de contrer\nles effets néfastes des cristaux des écrans d’ordinateur . Elle en déduit\nque l’obligation de la prière musulmane révèle avant l’heure une sagesse\naxée sur le soin et l’entretien du corps. L ’interprétation de l’éthique\ntransmise par les pratiques corporelles musulmanes se conjugue ici à un\ndiscours moderne de la santé, et assure la cohérence de la nouvelle\nsubjectivité ainsi construite. Dans cet article, nous soutenons que les\ncomportements religieux contemporains, en l’occurrence la conversion\nreligieuse, constituent des modes de restauration du soi, c’est-à-dire\nune herméneutique dont la conversion constitue, parmi « les\ntechnologies du soi qu’a connues l’Occident, une des plus importantes  »\n(Foucault 2001 : 199), en atteste son rôle central dans le christianisme .\nCes modes de guérison, qui touchent autant les maux physiques et\némotionnels que les traumas biographiques, s’appuient sur le corps,\nespace privilégié de discipline et de gestion du soi, mais aussi vitrine\nsociale qui donne à voir la performance du croyant. Ainsi la notion de\nguérison traduit-elle une vision holiste du sujet dont le bien-être repose\nsur l’articulation équilibrée du corps, du soi et du social réalisée par\nl’incorporation d’une morale. En effet, selon Foucault, le sujet spirituel\n7 - Mossière.pmd 2011-10-24, 20:13117\n118 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\nest en constant processus d’autoconstitution éthique à travers un\nensemble de techniques du soi. Celles-ci s’élaborent autour de l’impératif\ndu souci de soi-même ( epimeleia heautou ) qui a traversé la philosophie\ndepuis l’antiquité avec Socrate, jusqu’à l’ascétisme chrétien, pour\nimprégner aujourd’hui le mode d’être de l’individu moderne. Dans cette\nperspective, le sujet éthique se construit par un effort continu de retour\nvers le soi qui lui permet de se constituer dans le cadre d’une conduite\nmorale à l’aide d’un ensemble de pratiques.\nNotre étude ethnographique réalisée auprès de femmes converties\nà l’islam en France et au Québec suggère que l’adhésion à l’islam engage\nle sujet dans une forme d’herméneutique, selon une perspective\nthéologique d’accomplissement personnel englobant l’individu et le\nsocial. Dans l’islam en effet, l’être humain est représenté comme un\nindividu né dans un état naturellement pur ( fitra ), si bien que sa\ndémarche religieuse ne vise pas tant à le transformer , comme dans la\ntradition chrétienne, qu’à l’amener à modifier son style de vie en vue\nde revenir à sa condition initiale, soit de se soumettre à Dieu ( islam)\n(Woodberry 1992). Ainsi, les nouveaux musulmans évoquent-ils moins\nleur « conversion » que leur « retour à Dieu ». Pour ces derniers, c’est\ndans l’accès à l’islam comme à de nouvelles pratiques du soi et de relations\nsociales que se produit le sujet, conformément à une conception de la\npersonne qui, tout en s’inscrivant dans une structure sociale et politique,\nest porteuse de désirs et vecteur de choix. En ce sens, la performance\nreligieuse constitue avant tout une opération qui vise à restaurer le\nsujet selon une démarche éthique non seulement réflexive, mais aussi\nsociale.\nDans cet article, nous considérons le parcours dans l’islam de\nnouvelles musulmanes comme un processus de restauration personnel\nqui implique la reconstruction du soi en tant que sujet éthique. À cet\négard, le corps joue un rôle particulier comme vecteur d’ascétisme et\nvitrine sociale. En effet, selon l’islamologue Edward E. Curtis, la\nconversion à l’islam ne signifie pas seulement l’adhésion à des canons\nthéologiques tels que les cinq piliers, mais aussi le passage par divers\nprocessus historiques par lesquels les êtres humains se définissent comme\nmusulmans : « En de nombreux cas, les nouveaux convertis imaginaient\nque Dieu avait eu l’intention de les voir se convertir – ou revenir à\nl’islam – et que leur destinée ultime en tant que peuple serait déterminée\npar la manière dont ils auraient réalisé le plan de Dieu »\n1 (2005 : 680).\n1.   « In many cases converts imagined God had intended for them to convert – or\n7 - Mossière.pmd 2011-10-24, 20:13118\n         119DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\nAinsi, nous montrons d’abord que l’entrée dans l’islam signifie l’adoption\nd’un ensemble de comportements de piété dont l’incorporation est vécue\npar les nouvelles musulmanes comme une lutte, soit un djihad personnel,\nvisant à la constitution d’un sujet éthique par la discipline du corps.\nNous définissons ensuite l’ensemble des techniques que le sujet croyant\net pratiquant opère sur lui-même, soit l’herméneutique du soi à laquelle\nil se soumet dans un effort constant d’introspection, et en dialogue\npermanent avec sa perception du divin. Ce processus moderne de\nsubjectivation du croire qui s’exprime parfois selon une sémantique\nthérapeutique est vécu comme un projet de réhabilitation et\nd’accomplissement du soi. Bien que cette démarche s’appuie sur\nl’affirmation de la liberté de choix individuel, nous soutenons qu’inscrire\nl’éthique sur le corps engage également le sujet dans une structure\nsociale, soit la communauté de croyants ( Oumma), qui conduit autant\nà l’émulation à la performance qu’au contrôle mutuel et aux pressions\nnormatives. Ce rôle reconnu au social et au groupe  dans le processus\nd’herméneutique du soi des converties nuance les approches qui\ninscrivent la conversion à l’islam dans une perspective de retour au soi\ntypique de la logique individualiste européenne (Zebiri 2008). En\nconclusion, cette lecture de la conversion nous amène à redéfinir les\nnotions de santé et de guérison dans le cadre de la vision actuellement\ndominante dans les sociétés de la modernité avancée, qui lie expérience,\ncorps et société. La démonstration débute par une présentation de nos\nterrain et méthode ethnographiques, suivie d’une discussion\nconceptuelle quant à l’opérationnalité des notions de technologie du\nsoi et de conversion proposées par Foucault dans le cas de l’entrée dans\nl’islam.\nRencontres avec des femmes converties à l’islam : considérations\nméthodologiques\nNotre étude s’appuie sur une enquête ethnographique réalisée entre\n2006 et 2008 auprès de femmes converties à l’islam en France et au\nQuébec. Près de quarante entrevues ont été réalisées avec de nouvelles\nmusulmanes dans chacun des espaces étudiés. Nous avons également\nmené des observations au sein des associations où les répondantes sont\nactives ainsi que dans des mosquées et divers centres d’apprentissage\noù elles suivent des cours d’arabe ou sur l’islam. T ous les âges sont\n         revert to Islam –  and that their ultimate destiny as a people would be determined\nby how well they realized Go d’s plan » (T.d.l.R.).\n7 - Mossière.pmd 2011-10-24, 20:13119\n120 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\nreprésentés bien que la génération des moins de 35 ans prédomine\nnettement, en particulier en France. Si elles ne sont pas mariées à des\nhommes nés dans l’islam, les nouvelles musulmanes recherchent\nactivement un conjoint de la même confession. Étant donné leur jeune\nâge, la plupart des répondantes sont étudiantes ; toutes aspirent à rester\nau foyer afin de se consacrer à leur vie familiale et religieuse qu’elles\nconsidèrent inextricablement liées. Les niveaux d’éducation sont\ngénéralement élevés, en particulier au Québec où plus du trois quarts\ndes répondantes préparent ou détiennent un diplôme universitaire,\ntandis qu’en France elles représentent plus de la moitié des femmes\nrencontrées. Dans les deux espaces considérés, une part significative\ndes répondantes œuvre dans le domaine associatif (mosquées,\nassociations musulmanes étudiantes etc.), ou encore sur les forums et\nsites Internet. Contrairement au Québec où les nouvelles musulmanes\nrencontrées proviennent de milieux sociaux très divers, une forte\nproportion des converties françaises est issue des cités, soit de milieux\nsocialement marginalisés. Les récits collectés auprès de ces femmes\ntraitent de leur parcours biographique antérieur à la conversion, puis\nde leur démarche vers et dans l’islam. En particulier , ils portent sur les\nmodes d’apprentissage des pratiques religieuses et sociales et des codes\nde conduite liés à la tradition musulmane (relativement à l’alimentation,\nl’habillement, l’hygiène, etc.).\nDans le cadre d’une lecture critique antérieure, nous avons déjà\ntraité du caractère construit de ces discours et de leur signification quant\naux conditions qui entourent et encadrent le geste de conversion\n(Mossière 2010 ; 2008). Le choix d’une approche comparative entre la\nFrance et le Québec a permis de distinguer le rôle des conditions sociales\net historiques spécifiques à ces deux espaces politiques dans la trajectoire\nde conversion des nouveaux musulmans. Les récits montrent toutefois\nune convergence sur le plan de la dimension vécue de l’entrée dans\nl’islam. Dans cet article, nous adoptons une perspective\nphénoménologique afin d’examiner la dimension expérientielle de la\ntrajectoire de conversion ; c’est pourquoi nous attribuons aux récits de\nconversion des nouvelles musulmanes la valeur de témoignage subjectif\net à leurs comportements religieux, celle d’actes de foi. Ainsi, discours\net pratiques reflètent le monde vécu de nos interlocutrices, la plupart\nayant insisté sur la nature spirituelle de leur démarche, refusant de lui\nconcéder une quelconque charge sociale, et encore moins politique.\nLes récits de conversion traduisent la constante autoévaluation des\n7 - Mossière.pmd 2011-10-24, 20:13120\n         121DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\nnouvelles musulmanes qui, de façon réflexive et consciente, surveillent\net réorientent leurs comportements, pensées et émotions, de façon à\ngénérer et incorporer les attributs propres au modèle de la « bonne\nmusulmane » tel qu’elles le conçoivent. À cet égard, l a littérature\nempirique suggère que dans l’islam contemporain, les identités\nreligieuses tendent à converger vers un modèle de piété et de dévotion\n(Deeb 2006 ; Hirschkind 2001 ; Jouili et Amir -Moazimi 2006 ;\nMahmood 2005 ; T orab 1996 ; T urner 2008).\nBien que la plupart des femmes de notre corpus aspirent à incarner\nce profil, nous proposons de distinguer plusieurs types de converties\nafin de tenir compte de la proportion non négligeable, et sans doute\nsous-représentée, de nouvelles musulmanes qui font preuve d’une\napproche plus souple de leur religion d’adoption. En France comme au\nQuébec, plus de la moitié des femmes rencontrées adhèrent à une lecture\nlittérale des textes coraniques dans un contexte communautaire qui\nvise au respect d’une version authentique de l’islam, inspirée de\nl’exemple du Prophète. Une autre catégorie de converties formule un\ndiscours réformateur préconisant d’actualiser l’islam aux contraintes\ndu temps et du lieu. Elles affichent une interprétation plus personnelle\ndes textes, tout en accordant la priorité au respect des piliers de l’islam\nqu’elles placent au cœur de leur quotidien. Finalement, une minorité\nde femmes semble construire un islam hybride, parfois inspiré de\nspiritualité soufie, et caractérisé par une certaine individualisation de\nla performance religieuse. Par exemple, certaines femmes moins\npratiquantes ne s’adonnent qu’à certaines activités religieuses d’ordre\nsocial, comme le ramadan ou par certains événements festifs ( Aïd-el-\nkebir, Aïd-el-Fitr, etc.). Nous plaçons dans une catégorie particulière\nles quelques femmes rencontrées qui mettent l’accent sur l’expérience\nreligieuse en adhérant à un courant spirituel de l’islam.\nT TT TTechnologie et herméneutique du sujet converti : lechnologie et herméneutique du sujet converti : lechnologie et herméneutique du sujet converti : lechnologie et herméneutique du sujet converti : lechnologie et herméneutique du sujet converti : l ’union du corps’union du corps’union du corps’union du corps’union du corps\net de l’esprit dans le soiet de l’esprit dans le soiet de l’esprit dans le soiet de l’esprit dans le soiet de l’esprit dans le soi\nLa conversion : techniques du corps et constitution d’un sujet éthique\nSelon Foucault, la subjectivité de l’individu, soit sa relation\npersonnelle à la société et à l’histoire, est travaillée par un ensemble de\ndispositions du soi, à savoir des processus normatifs qui opèrent par\nstratégies d’inclusion, mais surtout d’exclusion (le criminel, le déviant\n7 - Mossière.pmd 2011-10-24, 20:13121\n122 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\nsexuel) et, pourrait-on ajouter , de fabrication de profils idéaux (Haince\n2004). L’intégration de l’ensemble de ces mécanismes forme un dispositif\norganisé de technologies permettant de discipliner l’individu et, de\nmanière ultime, de produire un sujet éthique. Ce processus qualifié de\nsubjectivation ou « constitution du sujet » s’inscrit dans un champ\nconstitué d’un ensemble de procédures pratiques qui visent à instaurer\net à développer un rapport au soi déterminé. Parmi ces procédures,\nFoucault identifie et développe la notion aristotélicienne du souci de\nsoi qui implique un savoir -faire éthique. Il s’agit en réalité de mobiliser\nl’epimeleia, soit « un certain nombre d’actions, actions que l’on exerce\nde soi sur soi, actions par lesquelles on se prend en charge, par lesquelles\non se modifie, par lesquelles on se purifie et par lesquelles on se\ntransforme et on se transfigure » (1994 : 12). Dans son ethnographie\nde femmes musulmanes pieuses en France et en Allemagne, Jeannette\nJouilli ajoute que les pratiques religieuses (l’acquisition du savoir\nreligieux, la prière et la modestie) constituent autant de « techniques\nde soi » destinées à « créer des dispositions intérieures, et notamment\ncertains désirs et émotions qui permettent de ressentir et d’agir comme\nle sujet pieux que l’on souhaite devenir » (2007 : 38).\nLa constitution de l’être éthique repose donc fondamentalement\nsur la pratique. Locus des expériences vécues, le corps joue un rôle\nfondamental dans ce schéma. V ecteur de l’esprit, des cognitions et des\némotions, il constitue l’espace où se réalisent et se manifestent les\npratiques de guérison, les normes sexuelles, les codes alimentaires et\nvestimentaires, ou les comportements sexués, mais aussi les rituels et la\nreconfiguration des sens et des notions du temps et de l’espace qu’ils\ninduisent (McGuire 2008). Auprès de femmes égyptiennes pratiquantes,\nMahmood (2006) observe que  la piété se développe par la performance\nd’actes limités qui requièrent l’incorporation de dispositions particulières\nà travers un entraînement simultané du corps, des émotions et de la\nraison, comme autant de lieux de discipline où les vertus religieuses\nacquièrent le statut d’ habitus. Le corps constitue par conséquent autant\nun marqueur de la piété qu’un des moyens essentiels pour la réaliser . À\ncet égard, la mimesis (imitation) et divers processus d’apprentissage font\ndu corps un moyen de naturalisation des pratiques et normes sociales.\nAinsi, l’embodiment constitue également un lieu de pouvoir où s’exercent\nles discours et les représentations qui gouvernent le modelage du corps\net de l’expérience, et la production de l’identité (Csordas 1993).\n7 - Mossière.pmd 2011-10-24, 20:13122\n         123DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\nLes outils conceptuels apportés par Foucault et adaptés au cas des\nsujets pieux par Jouilli semblent adéquats pour étudier les modes\nd’incorporation de l’éthique musulmane par les converties. T outefois,\ncette lecture praxéologique nous paraît insuffisante pour saisir\nl’approche résolument cognitive des musulmanes visant à rationaliser\nleur processus éthique de subjectivation. Comme d’autres auteurs\n(Jouilli 2007 ; Mannson 2002), notre approche reconnaît également\nau sujet autonomie et réflexivité et, dans le cas des converties, une\npossibilité de réappropriation personnelle de la religion adoptée.\nLa conversion, technologie du soi par excellence\nS’inspirant de la philosophie grecque antique, Foucault (2001)\ninscrit le concept de conversion au sein d’une polarité établie autour\nde deux modèles : l’ epistrophê de Platon et la metanoïa du christianisme.\nD’une part, l’ epistrophê entraîne un mouvement de libération de l’âme\npar rapport au corps et un retour vers sa source, vers l’essence et la\nvérité de l’Être. Constatant sa propre ignorance, « c’est dans l’acte de\nréminiscence comme forme fondamentale de la connaissance  » (2001 :\n201) que le sujet est mené à l’éveil. L’epistrophê repose sur une opposition\nfondamentale entre le monde terrestre et l’au-delà, il suppose une\nlibération de l’âme par rapport au corps. La metanoïa quant à elle découle\nd’un bouleversement de l’esprit, d’un renouveau radical ; la mort et la\nrésurrection du sujet fondent l’expérience et la volonté de renoncement\nde soi à soi. Cette transformation brutale du mode d’être du sujet découle\nd’un élément unique, soudain, «  à la fois historique et métahistorique  ».\nEntre ces deux moments fondateurs du retour du sujet vers le soi,\nFoucault relève une troisième démarche inspirée de la culture du soi\nhellénistique et romaine, à savoir le convertere ad se . Ici, la conversion\nconstitue un processus long et continu d’autosubjectivation qui ne\ns’appuie ni sur une opposition entre deux mondes, ni sur un détachement\npar rapport à son corps. Il s’agit d’un «  rapport complet achevé de soi à\nsoi » qui se réalise par l’exercice, la pratique, l’entraînement, en bref,\nl’askêsis plus que la connaissance du soi. Dans ce processus téléologique,\nc’est tout l’être qui se concentre sur le soi comme seul et unique objectif.\nSi ces formes de conversion proposées par Foucault s’appliquent\navant tout à la spiritualité et à la philosophie occidentales, la troisième\nnous semble particulièrement opérationnelle pour comprendre les\ncomportements religieux contemporains orientés vers les adeptes de la\n7 - Mossière.pmd 2011-10-24, 20:13123\n124 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\ngnose, et leur aspiration à embrasser « les voies de la connaissance »\naccessibles au moyen des expériences personnelles et d’un idéal de\n« fusion avec le sacré » (Laplantine 2003 : 18). À la grille proposée\npar Foucault, la conversion à l’islam ajoute toutefois un idéal typique\ndont nous situons la spécificité entre l’ epistrophê platonicien et le\nconvertere ad se  hellénistique et romain. En effet, si, dans l’islam, le\nretour vers l’état naturellement pur de l’être humain ( fitra) est accompli\nà travers le rappel de l’âme à sa source, soit le monde et l’état originels,\nil faut lui ajouter la notion de soumission ( islam), si essentielle à cette\nreligion qu’elle lui est homonyme. Car c’est par l’observation stricte et\nrigoureuse d’exercices du soi propres à l’ascèse du convertere ad se qu’une\ntelle obéissance construit une éthique qui se matérialise en premier\nlieu dans le corps et assure le passage salutaire de l’être d’un monde à\nl’autre. En fait, l’examen du discours des répondantes montre que les\npratiques du soi imprègnent le sujet d’un ensemble de normes qui, plus\nqu’une imposition sociale, forment sa substance et son intériorité. Dans\nune religion comme l’islam axée sur la pratique , les pratiques du soi\nconstituent un médium bien plus qu’un but ( telos). L’herméneutique du\nsujet pieux, converti à l’islam, s’élabore donc dans l’apprentissage et la\ndocilité de l’esprit et du corps, vecteurs d’une morale révélée et offertes\npar le divin pour accéder à son monde.\nDiscipline, éthique et corps : construire le sujet musulman pieuxDiscipline, éthique et corps : construire le sujet musulman pieuxDiscipline, éthique et corps : construire le sujet musulman pieuxDiscipline, éthique et corps : construire le sujet musulman pieuxDiscipline, éthique et corps : construire le sujet musulman pieux\nAdoption des pratiques et djihad personnel\nL’adhésion à l’islam implique la soumission à un ensemble de\nprescriptions et de représentations : en premier lieu, les cinq piliers,\nsoient l’acte de foi (chahada), les cinq prières quotidiennes ( salat), le\nmois de jeûne ( ramadan), l’aumône aux pauvres ( zakat) et le pèlerinage\nà La Mecque ( hajj), mais aussi un certain nombre de principes d’ordre\nvestimentaire (vêtements pudiques, voile), hygiénique (ablutions\nprécédant la prière entre autres), et alimentaire (interdiction d’alcool\net de porc, prescription de la viande halal), sans compter l’adoption de\ncertains discours autorisés justifiant ces pratiques, et régissant un\nensemble de codes de conduite sociale et religieuse.\nCes comportements de piété constituent des performances\nreligieuses et sociales, ou des « rituels d’intimité » [ rituals of intimacy ]\n(Turner 2008 : 6), visant la transformation du soi par la discipline du\n7 - Mossière.pmd 2011-10-24, 20:13124\n         125DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\ncorps et menant par ricochet à la réalisation du sujet. L ’hygiène de vie\nainsi inculquée assure l’incorporation d’une vision du monde associée à\nl’islam, et investit le quotidien d’une nouvelle forme de conscience. La\nplupart des converties comprennent cette discipline du soi comme une\nlutte, ou un d jihad personnel, qu’elles expriment à l’aide de diverses\nmétaphores. Par exemple, Mélanie compare son expérience dans l’islam\nà une traversée de l’Atlantique à la voile. Les converties plus orthodoxes\nsanctionnent le respect de cette discipline en invoquant l’arithmétique\ndes hasanas, soient les bons et les mauvais points que les anges et les\ndémons propres à chacun comptabilisent pour chaque action positive\nou négative du croyant. Selon Diane, convertie de longue date, un bon\ntémoignage relativement à l’islam rapporterait un bon point. Plus que\ndes pratiques, les femmes rencontrées parlent d’acquérir et d’intérioriser\nun « comportement » : en France, Anaïs témoigne : « c’est difficile pour\nle moment, mais c’est une question d’habitude » ; tandis qu’au Québec,\nNatasha explique : « c’est pas aussi dramatique, mais c’est comme\nquelqu’un qui devient aveugle par rapport à quelqu’un qui est aveugle,\nc’est le fait d’avoir déjà goûté quelque chose et de ne plus en\nremanger ... »\nEn fait, la progression dans l’islam est marquée par des tentatives de\npratique, par exemple un « essai » du jeûne du ramadan, ou un « essai »\ndu voile. Comme le montre Brenner (1996) auprès de Javanaises\nrevenant à l’islam, le port du foulard apparaît comme un moment clé\ndans cette reconstruction du soi, marqué par la réflexivité et par une\nprise de conscience personnelle et permanente de l’identité religieuse\nadoptée. En ce sens, couvrir son corps et cacher ses formes constitue\nselon Brenner « un mouvement conscient en direction d’un changement\npersonnel et social »\n2 (1996 : 685). C’est d’ailleurs autour de la question\ndu foulard que se cristallise la diversité d’interprétations de l’islam\ncollectées auprès des femmes rencontrées, à la lumière des idéologies\nen compétition dans l’islam. En fait, la variété de ces courants se reflète\ndans le mode d’appropriation des préceptes musulmans. Pour les plus\northodoxes, la pratique quotidienne représente une continuité entre\nles vécus social et religieux, et donc une preuve de « loyauté » et de\nvérité envers soi. À l’inverse, celles qui pratiquent avec flexibilité\nconsidèrent la rigidité des prescriptions comme un construit culturel et\nnon divin, elles lui préfèrent donc une interprétation plus souple,\n2.  « a self-conscious move toward personal and social change » (T .d.l.R.).\n7 - Mossière.pmd 2011-10-24, 20:13125\n126 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\norientée vers la sincérité et l’authenticité de l’acte. Julie fait preuve\nd’un tel discernement.\nJe ne sais pas si c’est une invention des hommes ou si Dieu, ça le\ndérangerait vraiment. Je pense sérieusement que non, que je pourrais\nlire mon Coran ou faire la prière –  je prie quand même, c’est juste que\nj’aime pas faire la prière toute seule, je parle avec Dieu quand même,\nc’est normal.\nPour celles qui ont choisi le soufisme, le respect de valeurs\nhumanistes comme l’humilité, l’altruisme ou la bienfaisance prévaut\nsur celui des prescriptions coraniques, de sorte que certaines s’accordent\nun verre de vin de temps à autre, privilégiant l’intention de se dévouer\nà Dieu à l’orthopraxie.\nLe corps, vecteur d’ascétisme\nLa plupart des converties vantent le respect accordé au corps dans\nla tradition musulmane. Maryam décrit par exemple les grands soins\napportés au lavage du corps de sa belle-mère marocaine après son décès,\net le respect accordé aux cadavres, l’opposant à l’exposition des morts\npratiquée dans le Québec catholique et jugée dévalorisante pour le\ndéfunt. Selon la perspective de Mauss (1973), le corps apparaît ici\ncomme un vecteur d’ascétisme, comme l’indique Juliette.\nDans la religion, on dit que c’est Dieu qui a tout créé, il a créé le corps\net il nous demande d’en prendre soin parce qu’il nous l’a prêté…\nDonc je respecte mon corps, ne serait-ce que par rapport aux garçons,\nle fait de ne pas coucher à droite à gauche… Et puis je suis très\ngourmande, j’essaie de ne pas trop manger . […] J’ai une nouvelle\nvision de la vie plus saine, plus pure, je me sens plus propre.\nL’assimilation des pratiques corporelles passe autant par la gestion\ndes émotions, colères et conflits étant canalisés par la prière, que par\nles rêves ou le sommeil, que certaines interprètent comme des modes\nde communication avec le divin. Quant au code de conduite sexuelle,\nla plupart des femmes rencontrées présentent la perte de leur virginité\ncomme un regret, mais non un préjudice, puisque les péchés précédant\nla conversion sont réputés absous par l’entrée dans l’islam. Elles sont\nmoins nombreuses celles qui reconnaissent maintenir une vie sexuelle\nhors mariage, mentionnant souvent la pression de leur fiancé, bien que\nmusulman. En fait, ces performances physiques affichent, affirment et\n7 - Mossière.pmd 2011-10-24, 20:13126\n         127DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\nprogressivement naturalisent leur choix d’adhérer à l’islam. Juliette\npoursuit :\nComme justement, j’avais trouvé une hygiène de vie, et que je\nrespectais mon corps, je ne voulais pas avoir des sales regards… T u\nsais bien les hommes comment ils sont. Je savais qu’en mettant le\nfoulard, j’allais avoir des sales regards, mais je savais aussi que quelque\npart, j’allais être respectée.\nLes pratiques que les nouvelles musulmanes incorporent concernent\nautant le soin de l’intérieur du corps, réalisé à l’aide d’un nouveau régime\nalimentaire et d’habitudes hygiéniques, que celui de son apparence\nextérieure, garantie par un code vestimentaire et sexuel, ainsi que par\ndes façons de faire esthétiques. Après avoir adopté l’islam, toutes les\nconverties rencontrées ont par exemple proscrit le porc de leur menu ;\nen France comme au Québec, une minorité, en général les adeptes du\nsoufisme ou les moins pratiquantes, s’autorise cependant quelques écarts\noccasionnels en buvant de l’alcool ou en ingérant de la viande non\nhalal. Toutes font également leurs ablutions avant la prière. La majorité\nporte le voile sous forme de hijab et, pour une minorité, sous forme de\nbandeau ; une seule Française portait le tchador de type iranien.\nNéanmoins, toutes les femmes rencontrées tiennent à conserver une\ntenue discrète et « modeste », soit des vêtements longs et amples, ce\nqui ne les empêche pas de se permettre un maquillage, léger toutefois.\nL’islam est vu ici comme une métho de d’éducation et de soin personnels\ndestinée à purifier le corps. Sophie, une jeune mariée française, rapporte\navoir longuement appréhendé le moment où son fiancé algérien\ndécouvrirait le tatouage qu’elle s’était fait faire avant sa conversion et\nqui, selon elle, souille son corps.\nModeler le corps à l’éthique\nD’après la théorie performative de Butler (1990) appliquée au cas\ndes converties à l’islam par Oestergaard (2009), c’est la répétition rituelle\nde pratiques jugées appropriées pour les «  bonnes musulmanes  » qui\npermet d’inscrire sur le corps des femmes les dispositions de la religiosité\nmusulmane. Par exemple, Noémie enseigne à de nouvelles recrues à\nfaire la prière en leur recommandant de garder les bras et les coudes\nplaqués contre le corps afin de réduire l’espace qu’elles occupent, en\nsigne de modestie. Hélène décrit comment les pratiques propres à\nl’éthique musulmane sont naturalisées :\n7 - Mossière.pmd 2011-10-24, 20:13127\n128 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\nCe n’est pas l’islam qui rentre dans ta vie, mais ta vie, c’est l’islam. T u\nfais le choix de l’islam, puis ensuite tu recadres ta vie dedans. Par\nexemple, pour organiser une journée je vais regarder ce que j’ai le\ntemps de faire entre la prière du matin et celle de l’après-midi, c’est\ncomme si ça restructure .\nLa plupart des converties présentent la clarté et la précision du\nsystème de normes et du code de conduite musulmans comme un de\nses facteurs d’attraction. Leur approche de l’islam est d’ailleurs\nessentiellement fondée sur l’interprétation individuelle et indépendante\nde ses sources scripturaires ( ijtihâd ). Le savoir et l’acquisition de\nconnaissances sur l’islam représentent effectivement une priorité pour\ntoutes les femmes rencontrées qui soulignent la nécessité de\n« comprendre pourquoi on fait les choses  ».\nLe voile, manger halal, c’est pas quelque chose qu’au début j’ai très\nbien compris, parce que la pratique, ça vient avec les connaissances.\nAu début, je trouvais ça difficile d’intégrer des choses que je ne\ncomprenais pas vraiment, je ne voyais pas qu’est-ce que ça change. Je\nmangeais pas de porc, mais je ne comprenais pas l’importance de\nmanger halal (Marie-Claude) .\nLes recherches de Samia proposent une justification scientifique du\nbien-fondé de ce procédé alimentaire : « On sait que l’animal égorgé\nsouffre moins. Quand il est égorgé, le sang sort et donc s’il y a des\nmaladies transmises par le sang, il y a moins de risques de les\ntransmettre ». Dans cette optique, le Coran et les hadiths constituent\nune référence de base pour la vie quotidienne, au point que les moins\npratiquantes disent avoir adopté certaines règles corporelles, surtout\nen raison de leur caractère hygiénique. Les Écritures sont donc\nconsidérées comme un guide de fonctionnement et d’amélioration de\nl’individu et par ricochet, de la société. En dépit de la priorité portée à\nl’étude des textes sacrés dans l’apprentissage de l’islam, le désir de\nreproduire le comportement d’un musulman considéré comme un\nmodèle traverse l’ensemble des entrevues. Ainsi, la ressource\nd’apprentissage ultime des nouvelles femmes rencontrées reste une figure\nd’autorité coutumière, telle que l’imam de la mosquée fréquentée, le\ncheikh de la confrérie  d’appartenance, ou encore une femme âgée\nreconnue pour sa grande piété, et donc sa respectabilité, comme l’exprime\nSalma : « la phrase qui a guidé ma vie, “don’t tell me, show me !” ».\nDe fait, les prescriptions islamiques sont fondées sur un schéma\ndualiste distinguant le domaine de l’illicite ( haram) du domaine du\n7 - Mossière.pmd 2011-10-24, 20:13128\n         129DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\nlicite ( halal). Toutefois, la diversité des mo des d’incorporation de la\nnorme musulmane observée auprès des converties souligne leur\nagentivité, certaines ne manquant pas, par exemple, de rappeler\nl’existence d’une zone intermédiaire entre le halal et le haram, soit le\n« non recommandé, mais toléré  ». S’inspirant d’Aristote, Foucault\n(2001) postule que les opérations que l’individu s’impose à lui-même\ndéfinissent un co de moral ou éthique. L ’éthique est ici considérée non\ncomme un système de normes, mais comme un ensemble de pratiques\ncaractéristiques d’un certain style de vie. Les pratiques construisent et\njustifient donc des valeurs érigées en code de conduite. Dans le même\nsens, Mahmood (2005) souligne qu’il existe différentes modalités\nd’action morale ou éthique qui, chacune, constitue un mode de\nsubjectivation spécifique. Par exemple, le respect des prescriptions\nvestimentaires induit un changement de références, désormais fondées\nsur les valeurs de pudeur et d’humilité. Parmi les récits collectés, relevons\négalement la récurrence des notions de dignité humaine et d’équilibre,\ntoutes deux érigées en quête, tandis que la conscience de l’existence\ndu paradis et de l’enfer justifie une éthique du juste milieu et de la\nresponsabilisation, et que la transformation du soi symbolise une lutte\npersonnelle (d jihad) vers la paix. De tels modes d’incorporation et de\nmatérialisation de la norme entraînent une négociation permanente\nentre le présent (devenir musulmane), le passé (être mécréante) et le\nfutur (être une bonne musulmane).\nLa spiritualité comme voie d’herméneutique du soiLa spiritualité comme voie d’herméneutique du soiLa spiritualité comme voie d’herméneutique du soiLa spiritualité comme voie d’herméneutique du soiLa spiritualité comme voie d’herméneutique du soi\nOn dirait qu’avant de me convertir , je croyais qu’on pouvait être\nparfait et qu’en me convertissant j’ai réalisé qu’on ne pouvait pas\nl’être, et qu’il y a que Lui qui l’était, et que le but d’avoir une religion\nc’est de se parfaire. Ça veut pas dire qu’on va être parfait. (Stéphanie)\nUne démarche de piété dans l’immanence du monde\nLes sociologues de la religion (McGuire 2008 ; T ank-Storper 2007)\ns’accordent à considérer les comportements religieux contemporains\ncomme des modes de « compréhension du soi impliquant une\ntransformation personnelle » (T ank-Storper 2007 : 18). Ces processus\nde démantèlement et de reconstruction personnels permettent de mettre\nà distance des situations vécues, et de reconfigurer le présent et l’avenir\ndans le cadre de nouveaux modèles de réalisation du soi. La plupart\n7 - Mossière.pmd 2011-10-24, 20:13129\n130 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\ndes converties rencontrées considèrent effectivement la conversion\ncomme un mode d’accomplissement du soi, de sorte que les préceptes\net les prescriptions de l’islam définissent une herméneutique qui repose\nsur une prise de conscience de sa propre subjectivité et de sa possibilité\nde construction par voie d’autodiscipline. Les converties expliquent\ncomment la pratique et la foi musulmanes les amènent à une\nintrospection perpétuelle, en vue d’une amélioration personnelle,\nconformément à un code de conduite rationnel et moral à la fois. Ce\nsouci du soi qui vise la transparence, la sincérité, l’authenticité et la\nvérité, en somme «  être vrai » comme beaucoup le formulent, constitue\nparfois une thérapie personnelle, comme en témoigne la multitude de\ntémoignages rapportant : « je me suis moi-même interdit de… ». La\nreligiosité constitue à cet égard une démarche ascétique au sens où le\ndéfinit Foucault (1997 dans Besley 2005), soit un ensemble d’exercices\nvisant à développer et à transformer le soi, en vertu d’un mode d’être\nidéal défini. Par la conversion, le sujet entreprend un processus de retour\nà sa source divine qui se réalise dans l’immanence même du monde.\nPlus qu’un rapport exclusif au corps, il accomplit de façon holistique\nun rapport d’adéquation achevé de soi à soi qui se manifeste autant par\ndes actions (éducation par exemple), que par des attitudes (respect de\nsoi-même, etc.)\nDes programmes « d’autoperfectionnement »\nS’inspirant des travaux de Max W eber, Nabti propose de considérer\nle concept « d’autoperfectionnement » comme un agir comportemental\nconforme à des règles éthiques édictées par une autorité religieuse, dont\nle respect « doit permettre la réalisation d’un certain état d’être qui est\nà la fois le garant et le signe du salut et […] doit lui permettre de se\nrapprocher du modèle prophétique de “l’homme parfait” ( al-insân al-\nkâmil ), véritable idéal d’être humain » (2007 : 62). En effet, les\nconverties rencontrées disent aspirer à un modèle de comportement\nqu’elles travaillent par une discipline stricte et assidue.\nJe vois que ma mentalité a changé, c’est des petites améliorations que\nje vois, que j’accepte et je comprends tranquillement, c’est mon djihad\npersonnel qui se manifeste. Même des traits de caractère comme la\ncolère ou la paresse, il faut travailler sur soi pour pas éclater pour\nn’importe quoi. On a chacun nos défauts puis il faut travailler pour\nles améliorer. Tu vas me dire « c’est pas juste dans l’islam, c’est partout »,\nmais ça fait partie intégrante de l’islam, c’est la religion. (Catherine)\n7 - Mossière.pmd 2011-10-24, 20:13130\n         131DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\nLes propos de Julia démontrent que les performances religieuses et\nrituelles musulmanes concourent à cet « autoperfectionnement » désiré,\nconformément au modèle généralement incarné par le Prophète, sa\nfille et ses femmes.\nAprès que j’ai accouché de ma fille, j’avais un goût incontrôlable de\ncafé. Puis le ramadan arrive, je me disais « Ah mon Dieu ! Je pourrai\nplus boire de café jusqu’au soir , puis quand tu te réveilles à 5H du\nmatin pour déjeuner, tu peux pas boire trois litres de café ! ». Puis ça\nm’a aidée, ça m’a désintoxiquée, ça a contrôlé mon besoin de café.\nAprès le ramadan, j’étais rendue à une tasse par jour […] j’avais réussi\nà maîtriser ce besoin-là.\nLa démarche herméneutique amorcée suite à l’entrée dans l’islam\ninsère les converties dans un modèle de piété religieuse ; en somme,\nc’est la morale qu’elles portent sur leur corps qui construit leur piété.\nAuprès de femmes musulmanes en Allemagne et en France, Jouilli\nexplique que ce « régime de disciplines corporelles et discursives […]\nvise à inculquer des émotions et des vertus permettant de se conformer\nà la morale islamique. Il s’agit d’un travail entrepris de façon réflexive\net consciente et qui façonne le sujet islamique pieux » (2007 : 282).\nComme le suggère V an Nieuwkerk (2010), les expériences de piété\nqui découlent des performances religieuses des nouvelles musulmanes\nsont vécues et présentées comme les récompenses les plus valorisantes\nde leurs efforts d’incorporation de l’islam et de leur témoignage de\ndévotion.\nSouci ou soumission du soi ? Nouvelle éthique du bonheur personnel et de\nla réalisation spirituelle\nLes récits collectés empruntent une sémantique de l’épanouissement\net du bien-être individuels qui participe ici d’un projet de construction\ndu soi, axé sur l’impératif de bonheur . Effectivement, la majorité des\nfemmes rencontrées insistent sur le fait qu’elles se sentent « vraiment\nmieux qu’avant » leur conversion, associant ainsi l’islam à la stabilité, à\nune grille de références et à une maîtrise du soi, mais aussi à une\nauthenticité illustrée par la simplicité des lieux de prière et par la relation\ndirecte qui lie le croyant à Dieu. La conversion serait donc vécue comme\nun processus d’affranchissement et d’accès à l’autonomie visant à\n« construire sa propre intériorité en termes spirituels » (Khoroskavar\n1998 : 129), comme le suggère Mélanie : « De manière générale, se\nconvertir c’est une démarche intellectuelle, psychologique, qui amène\n7 - Mossière.pmd 2011-10-24, 20:13131\n132 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\nà beaucoup d’indépendance, quelle que soit la religion d’où l’on vient\net que l’on choisit ».\nSi cette herméneutique du soi se produit dans un perpétuel dialogue\navec soi-même, elle se réalise dans l’assujettissement au code divin en\nvue de «  plaire à Dieu  », comme en témoigne Mélanie à l’évocation du\nport du voile : « on se cache parce qu’on n’est pas des objets, mais\nsurtout pour plaire à Dieu ». En fait, la réflexivité induite par les\npratiques d’autosubjectivation gravite autour de l’impératif de se\nsoumettre au divin. La conversion engage donc le croyant dans une\nnégociation constante avec une entité omniprésente, motivée par la\nvolonté de « Lui faire plaisir », et par le sentiment de sa constante\nsurveillance, comme en atteste leur rappel fréquent à l’effet qu’«  Il nous\nsurveille ! » ou encore « Dieu, Lui, nous voit... » . Ce dialogue est\norganisé selon un procédé de « petits pas », visant au respect progressif\ndes pratiques et prescriptions imposées par  Allah, littéralement « Le\nplus grand ».\nJe fumais beaucoup d’herbe, donc il fallait que j’arrête si je voulais\navoir l’esprit assez sain pour pouvoir réfléchir à ce à quoi je m’étais\nconvertie. Je fumais la clope aussi, il fallait que j’arrête parce que ça\ncorrespondait aussi à un interdit entre guillemets, au même titre que\nl’alcool, je priorise des choses comme ça. Ça prend le temps que ça\nprend, pour après rajouter tranquillement des pratiques. Maintenant\nje prie une fois par jour , j’ai fait deux ramadans, le dernier j’ai essayé\nde le faire et j’étais tellement nulle ! Le premier jour, j’ai complètement\nabandonné, je me suis dit, « si je fais tout, tout de suite, ça marche pas,\nc’est la bonne méthode pour abandonner vite ». Donc je Lui demande\nde faire des compromis. Ce ramadan j’ai arrêté de fumer , justement,\npour moi j’ai demandé si ça pouvait pas être ça mon ramadan plutôt\nque pas boire, pas manger : pas fumer . (Marie-Ève).\nCe sentiment de surveillance inscrit la trajectoire religieuse dans\nun rapport d’abandon à l’autorité divine, nourri par un sentiment de\ncrainte d’un Dieu omniscient, et entretenu par un comportement de\npiété et de fidélité quotidiennes. Pour certaines, cette démarche fait\nsuite à une expérience extrême ou à la peur de la mort de sorte que\nl’acte de conversion participe d’une réflexion philosophique visant à\ndonner un sens à l’existence, à la mort et à la vie terrestre, en vertu\nd’une conception du destin qui justifie une forme d’assujettissement.\nL’islam a apporté plus de stabilité et de sérénité dans ma vie, j’étais\npeut-être un peu perdue, on se demande toujours « l’homme avec qui\n7 - Mossière.pmd 2011-10-24, 20:13132\n         133DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\nje suis, c’est le bon ? » Il y a toujours un peu d’incertitude, même par\nrapport au futur , à l’avenir , on n’est jamais sûr de rien. T andis que\ndepuis que je suis convertie à l’islam, on met plus les choses dans les\nmains de Dieu, on se fie au destin : « si c’est pas arrivé, c’est parce que\nc’est le destin qui l’a voulu, c’est comme ça… » (Natasha)\nFinalement, cette soumission à un pouvoir divin omnipotent intègre\nle souci du soi dans une forme d’oubli du soi visant à l’action pour Dieu\net pour les autres, à l’instar de Chantale qui considère son dévouement\nauprès de sa grand-mère mourante, puis auprès de son mari handicapé,\ncomme sa voie personnelle de dévouement à Dieu. Cet auto-\nassujettissement établit la croyante dans une attitude de confiance et\nd’abandon fondée sur des compromis. De tels parcours ne s’opèrent\ntoutefois pas sans réticences. Car si toutes rappellent l’importance de\n« plier devant Dieu », elles soulignent également qu’accepter de\ntransférer la maîtrise de sa vie et obéir de façon quasi aveugle à une\ndiscipline contraignante à laquelle la plupart des individus modernes\nrefuseraient de s’adonner constitue un dépassement  personnel et une\nlutte quotidienne contre le soi.\nRestauration du soi et réhabilitation socialeRestauration du soi et réhabilitation socialeRestauration du soi et réhabilitation socialeRestauration du soi et réhabilitation socialeRestauration du soi et réhabilitation sociale\nSi le corps met en scène des sujets musulmans en devenir , il est\négalement le témoin de la foi du sujet envers son entourage, qu’il soit\nmusulman ou « mécréant ». Par exemple, le jeûne du ramadan qui\nreprésente un exercice d’autodiscipline personnelle offre également\nl’occasion d’une forte sociabilité qui donne à voir l’affiliation musulmane\npar la maîtrise collective du corps. Quant au voile, bien que les femmes\nrencontrées le présentent comme un symbole spirituel et une épreuve\nde maîtrise personnelle, elles rappellent qu’il constitue un mode de\ncontrôle et de valorisation de son corps et de l’image projetée du soi.\nEn s’appropriant les pratiques corporelles associées à l’islam, les\nnouvelles musulmanes produisent une subjectivité nouvelle qu’elles\nsituent dans un jeu de miroir à l’autre.\nPar rapport à moi, à mon corps, je suis mieux maintenant parce que je\nm’assume. Si j’ai des bourrelets, tant pis, j’ai pas besoin d’être mince.\nQuand tu t’habilles pour pas rien montrer , c’est pas juste par rapport\naux hommes, c’est aussi entre femmes, parce qu’on se compare toujours.\nMoi je trouve que c’est un respect entre les femmes. (Audrey)\n7 - Mossière.pmd 2011-10-24, 20:13133\n134 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\nCette visibilité sociale de la performance religieuse expose les\nmusulmanes converties à la surveillance et à la pression du groupe qui,\ntout en stimulant leurs performances de piété, contraignent leur\nautonomie quant à l’interprétation de l’éthique et à l’incorporation de\nla norme.\nL’émulation du groupe\nParmi les facteurs d’attraction de l’islam, la possibilité d’une relation\ndirecte à Dieu, ainsi que l’autonomie et l’autoresponsabilisation de la\npratique religieuse figurent parmi les plus fréquemment cités. Pourtant,\nles premiers gestes qui suivent la conversion, et parfois même la\nprécèdent, consistent à rechercher soutien et lien social au sein de\nréseaux composés de musulmans. Anaïs, convertie récemment,\ntémoigne de l’importance de la motivation du groupe : « C’est dur quand\ntu n’as pas de musulmans autour de toi, je n’en ai pas trouvé pendant\nmon stage à Lisbonne et c’est sûr que tu as tendance un peu à t’éloigner\nde la religion. Noémie [une autre convertie] est pour moi un vrai modèle,\nje suis contente de l’avoir ».\nLa foi et la religiosité individuelles se construisent donc dans\nl’émulation du groupe, si bien que la piété devient un motif de\ncompétition symbolique et de différenciation religieuse, comme le\nsuggère Anaïs : « Je ne suis pas aussi courageuse que Noémie, je ne\nporte pas le voile, mais ce n’est pas un gros péché. Ce qui compte c’est\nla foi non ? » Alors que certaines converties décident volontairement\nde se soustraire à au contrôle du groupe en s’isolant dans une\ninterprétation personnalisée de la pratique, la piété des femmes plus\nconservatrices correspond à ce que T urner nomme une « technologie\ndu soi conçue pour produire l’excellence ou les vertus religieuses »\n3\n(2008 : 3). Ainsi, la vertu et la piété sont définies selon l’orthodoxie\ndes performances et mesurées par opposition à la mécréance ou à la\nsouplesse des pratiques religieuses. Au moment de notre entrevue,\nManon (Québec) disait ne manger ni porc, ni viande puisque\nvégétarienne depuis un passage dans la religiosité Nouvel Âge opéré\nbien avant son entrée dans l’islam. Quelques mois plus tard, tandis que\nnous la voyons manger du bout des lèvres un tajine  à l’agneau en\ncompagnie de ses sœurs musulmanes, elle nous explique que celles-ci\n3.    « technology of the self designed to produce religious excellence or virtues »\n(T.d.l.R.)\n7 - Mossière.pmd 2011-10-24, 20:13134\n         135DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\nlui ont prouvé que le Coran préconise de consommer les animaux qui\ns’offrent à l’Homme pour son bien-être. Comme T urner (2008), on\npourrait s’interroger sur l’authenticité d’une telle piété produite par\nl’émulation sociale, bien que les discours de la plupart des femmes visent\nà tempérer l’impact du groupe sur la démarche individuelle et que les\npremiers conseils prodigués aux nouvelles recrues sont « d’y aller\ndoucement ! » Ainsi, Céline rappelle : « Il y a quand même dans l’islam\nla notion qu’on force personne à faire des choses qui sont au-delà de ses\ncapacités et que chaque étape qui est franchie, même si c’est une petite\nétape, même si ça prend du temps, c’est toujours ça de bien  ».\nPressions normatives et contrôle mutuel\nSi elles sont des modèles les unes pour les autres, à l’instar du\nProphète, le modèle ultime, les sœurs musulmanes sont également des\nvigiles mutuels qui veillent au maintien de la juste performance et\nentretiennent l’idéal du « bon musulman ». Sarah, une jeune femme,\nconvertie de longue date, et particulièrement active au sein de sa\nmosquée explique : « l’islam fait de nous des gens meilleurs, c’est un\ndjihad permanent. De toute façon, pas le choix, on vit tellement en\nvase clos qu’on doit travailler sur nous-mêmes pour être meilleures ».\nSource de réconfort et de renforcement, la communauté exerce\négalement une forte pression normative sur la performance des nouvelles\nrecrues, au point que certaines se détournent finalement de leur nouvelle\nreligion, la jugeant trop dogmatique.\nAu début, il y a tellement de choses que tu ne sais pas et il y a tellement\nde possibilités qu’on te guide mal. Le groupe que je fréquentais, je\ncrois qu’il me guidait mal, j’ai même failli renoncer à mon choix, il a\nfallu que je me rappelle pourquoi je l’avais fait, et que j’essaie de\ncontinuer dans la façon dont moi, je l’avais approché au début...\n(Marie-Ève, France)\nAinsi, chacun des actes du quotidien est sujet au contrôle interne à\nla communauté : Anna, une jeune étudiante québécoise de tendance\nsoufie, s’est vue rappeler plusieurs fois à l’ordre par ses collègues de\nl’association musulmane universitaire, qui estimaient que ses vêtements\ndévoilaient exagérément ses épaules. Les pressions visant à imposer\nl’orthodoxie sont parfois intériorisées par un sentiment de culpabilité,\nsi bien que plusieurs pratiquantes qui fréquentent la mosquée endossent\nle port du voile sous l’influence de leur entourage : « Je le mettais pour\naller à la mosquée et en sortant je l’enlevais ! C’était hypocrite ! »\n7 - Mossière.pmd 2011-10-24, 20:13135\n136 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\n(Manon) ; ou encore : « Je me sentais mal par rapport aux autres femmes\nà la mosquée qui ne l’enlèvent pas en sortant » (Audrey).\nBien que ces attitudes de contrôle réciproque restent le fait d’une\ncatégorie de converties très axées sur l’assiduité de la pratique ou de\nnouvelles recrues particulièrement zélées , celles-ci semblent conserver\nle monopole de la reconnaissance de l’identité musulmane. Plusieurs\nfemmes qui disent « pratiquer selon leur propre compréhension du\nCoran et de la religion »  ont en effet hésité à se définir comme\npratiquantes en vertu de la définition dominante qui privilégie\nl’orthodoxie et l’orthopraxie.\nGestion du soi et réhabilitation sociale\nAuprès de musulmans noirs américains, Simmons (2006) relève\nque l’islam représente un motif d’ordre et de dignité, générant une\ndiscipline stricte et un sentiment d’appartenance. De façon consensuelle,\nles femmes rencontrées insistent également sur leur « fierté d’être\nmusulmane », soulignant combien le système de références adopté\nrétablit leur propre agentivité. Elles disent trouver dans l’islam les\nressources pour regagner pouvoir et estime de soi, de sorte que\nl’incorporation des performances dans l’islam est toujours mise en lien\navec la trajectoire personnelle de l’individu et son statut social. Par\nexemple, les discours associent de façon unanime le port du foulard à\nl’idée « d’être forte » dans l’islam, notamment de pouvoir assumer et\njustifier son choix dans des environnements où les musulmans sont\nminoritaires. McGuire (2008) rappelle à cet égard que les pratiques\nrituelles transformant le soi remettent souvent en question les catégories\nsociales, ainsi que les structures de pouvoir et de domination.\nEn effet, la perception d’un Dieu omniscient et omnipotent motive\nautant la discipline du soi qu’elle organise un système de justice sociale,\nsi ce n’est dans la vie terrestre, du moins dans le monde céleste. Il faut\ndistinguer ici le processus de restauration du soi, opéré de façon quasi\nsystématique suite à la conversion, de la réhabilitation sociale vis-à-vis\nde l’environnement, qui touche surtout les nouvelles musulmanes issues\nde milieux sociaux marginalisés, tels que les cités en France, ou les\nmilieux défavorisés au Québec. Car comme l’indique Sandra, « pour\nbeaucoup, c’est une mode d’avoir une religion, parce qu’il y a quand\nmême un certain respect, on respecte les gens qui sont religieux ».\nNotons que dans certains cas, la réhabilitation peut également\n7 - Mossière.pmd 2011-10-24, 20:13136\n         137DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\nengendrer une rupture volontaire et radicale avec la société globale.\nDans des espaces périphériques au groupe dominant, l’islam apparaît\ncomme un vecteur d’ascension sociale pour des acteurs dévalorisés dans\nleur environnement socioéconomique. La religion est ici pensée comme\nun garde-fou, ou une « grammaire sociale des interdits » (Göle 2005),\nqui protège des comportements délinquants ou déviants et constitue\nune source de revalorisation personnelle dans des contextes sociaux\nprécis. Par exemple, tout en déplorant la perte du sens communautaire\nde leur société d’origine, certaines nouvelles musulmanes issues du\ngroupe majoritaire mettent l’accent sur le port de marqueurs identitaires\nvisibles, affichant ainsi un sentiment d’appartenance fort envers un groupe\nminoritaire. À l’inverse, dans les cités françaises, nous avons rencontré\ndes femmes dont l’adhésion à un islam souple ou culturel visait avant\ntout à l’intégration dans un environnement social dominé par des\npopulations immigrantes d’origine maghrébine ou africaine de l’Ouest.\nCe recours à la ressource religieuse donne ainsi lieu à une réappropriation\nde l’éthique adoptée puisque la performance religieuse sert alors autant\nà renforcer la norme qu’à la revisiter .\nConclusion : la performance religieuse comme technique deConclusion : la performance religieuse comme technique deConclusion : la performance religieuse comme technique deConclusion : la performance religieuse comme technique deConclusion : la performance religieuse comme technique de\nrestauration du soi et de réhabilitation sociale, une perspectiverestauration du soi et de réhabilitation sociale, une perspectiverestauration du soi et de réhabilitation sociale, une perspectiverestauration du soi et de réhabilitation sociale, une perspectiverestauration du soi et de réhabilitation sociale, une perspective\nholiste du sujetholiste du sujetholiste du sujetholiste du sujetholiste du sujet\nDans cet article, nous avons montré comment les comportements\nreligieux contemporains, en particulier les phénomènes de conversion,\ns’articulent à des dispositifs de type ascétique qui, exercés sur le soi à\ntravers la discipline du corps, visent au développement de l’individu et\nà sa valorisation sociale. Dans le cas particulier de l’islam, l’orthopraxie\nreligieuse inscrit la performance des nouveaux croyants dans un processus\nd’herméneutique du soi au sens où l’entend Foucault, associant ainsi la\ndémarche de conversion au processus de constitution éthique du sujet\net au retour à la dimension subjective de l’individu croyant. Pour les\nnouvelles musulmanes en effet, l’objectif de croissance spirituelle est\nlié à une quête d’amélioration personnelle et vécu comme un processus\nlong et graduel de « retour » à Dieu. Ainsi, les phénomènes de religiosité\ncontemporains marquent-ils la transformation des notions de corps, de\nguérison et de bien-être.\nLe corps est ici perçu comme une entité ajustable et malléable,\nouverte à des possibilités d’amélioration par le respect de procédures\nreligieuses et sociales précises. La conversion dépossède en effet les\n7 - Mossière.pmd 2011-10-24, 20:13137\n138 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\nnouvelles croyantes de leur corps, désormais considéré comme un simple\ndépositaire du pouvoir de création divin. Le sujet pieux désincorpore\nalors sa socialisation première, afin d’y intégrer une éthique nouvelle, à\nl’aide d’une discipline stricte dont le sentiment constant de la surveillance\ndivine assure le respect. T andis que cette représentation sonne le glas\ndu dualisme chrétien dissociant chair et esprit, elle investit également\nle corps d’un nouveau système de signifiants déterminé par un dispositif\néthique si bien que l’on peut, à l’instar de McGuire (2008), parler de\n« désécularisation du corps ». Si interpréter la maladie dans un langage\nsymbolique constitue un trope classique, l’inscrire dans l’expérience\nhumaine et personnelle marque une tendance de plus en plus nette\ndans les sociétés contemporaines à assimiler santé et bien-être, guérison\nde l’individu et réalisation du sujet.\nAlors qu’ils associent les notions de pureté et de santé, les discours\ndes femmes rencontrées révèlent en effet de nouvelles conceptions de\nla santé et de la guérison désormais interprétées dans un cadre spirituel\net holistique, et axées sur la restauration du sujet et sa réhabilitation\nsociale. En ce sens, la démarche des converties à l’islam participe d’un\nmouvement plus général des religiosités actuelles orienté vers une\ndéfinition de la religion aujourd’hui vécue comme une spiritualité ou,\ncomme l’entend Paul Heelas, une forme de « spiritualités de la vie »\n[spiritualities of life ], lesquelles sont définies par « tous ces enseignements\net pratiques qui inscrivent la spiritualité au sein des profondeurs de la\nvie […] la spiritualité se découvre au sein des profondeurs de la vie\nsubjective, de nos expériences les plus valorisées de ce que signifie être\nvivant »\n4 (2008 : 25). En ce sens, comme le suggère le sociologue, la\nnotion de guérison réfère aujourd’hui moins au soin porté aux maux\nphysiques liés à des dysfonctionnements extérieurs, qu’au souci des\nperturbations personnelles qui, générant un mal-être, « empêchent les\ngens d’expérimenter toutes les dimensions de leur bien-être subjectif »\n5\n(2008 : 34). Ces représentations holistiques n’évacuent toutefois pas\nles déterminants scientifiques de la santé. En effet, les discours des\nnouvelles musulmanes articulent les prescriptions religieuses au progrès\nde la connaissance, tous deux garants du bien-être et de la santé du\n4.    « all those teachings and practices which locate spirituality within the depths of\nlife. […]  spirituality is found within the depths of subjective-life, our most\nvalued experiences of what it is to be alive  » (T.d.l.R.).\n5.   « prevent people from experiencing all that their subjective wellbeing is capable\nof achieving  » (T.d.l.R.).\n7 - Mossière.pmd 2011-10-24, 20:13138\n         139DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\nsujet. Marqués par la dynamique pouvoir et savoir , ils placent le\nthérapeutique à l’intersection des catégories de la science et du religieux.\nIl s’agit donc de recouvrir l’étendue des capacités expérientielles\ndont l’être humain est doté. En ce sens, l’acte de conversion induit un\nprocessus de restauration subjective qui, réalisé à travers la performance\nreligieuse, organise en un tout cohérent l’ensemble des attributs de\nl’individu, intellect, corps, affect et social. En effet, c’est par l’expérience\nde la pratique religieuse, axée sur la réflexivité et le ressenti, que les\nfemmes rencontrées disent accéder au divin. Elles inscrivent toutefois\nleur démarche dans une quête du mieux-vivre, brouillant ainsi les\nfrontières entre le transcendant et l’immanent.\n7 - Mossière.pmd 2011-10-24, 20:13139\n140 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\nRéférencesRéférencesRéférencesRéférencesRéférences\nBesley, Tina, 2005, « Foucault, T ruth Telling and T echnologies of the\nSelf in Schools », Journal of Educational Enquiry  6 : 76-89.\nBrenner, Suzanne, 1996, « Reconstructing Self and Society: Javanese\nMuslim W omen and “The V eil” ». American Ethnologist  23 : 673-\n97.\nButler, Judith, 1990 , Gender T rouble: Feminism and the Subversion of\nIdentity. New Y ork, Routledge.\nCsordas, Thomas J., 1993, « Somatic Modes of Attention », Cultural\nanthropology  8 : 135-56.\nCurtis, Edward E., 2005, « African-American Islamization Reconsidered:\nBlack History Narratives and Muslim Identity  ». Journal of the\nAmerican Academy of Religion  73 : 659-84.\nFoucault, Michel, 2001, L’herméneutique du sujet , Paris, Gallimard.\nGöle, Nilufer, 2005, Interpénétrations. L’Islam et l’Europe . Paris, Galaade\nÉditions.\nHaince, Marie-Claude, 2004, La fabrication de l’immigrant parfait.\nProcédures, stratégies et nouvelles pratiques de sécurité autour du droit\nd’établissement au Québec . Thèse de doctorat, Montréal, Université\nde Montréal.\nHeelas, Paul , 2008, Spiritualities of Life: New Age Romanticism and\nConsumptive Capitalism . Malden (MA), W iley-Blackwell.\nHervieu-Léger , Danièle, 1999, Le pèlerin et le converti. La religion en\nmouvement . Paris, Flammarion.\nHirschkind, Charles, 2006, The Ethical Soundscape: Cassette Sermons\nand Islamic Counterpublics . New Y ork, Columbia University Press.\nJouilli, Jeannette, 2007, Devenir pieuse. Femmes musulmanes en France\net en Allemagne. Entre réforme de soi et quête de reconnaissance . Thèse\nde doctorat, Paris et Frankfurt, École des Hautes Études en Sciences\nSociales et Europa-Universität V iadrina Fakultät.\n—— et Schirin Amir -Moazami, 2006, « Knowledge, Empowerment and\nReligious Authority Among Pious Muslim W omen in France and\nGermany », The Muslim W orld 96 : 617-42.\nKhoroskhavar , Fahrad, 1998, « L ’islam des jeunes en France », dans\nMondher Kilani (dir.), Islam et changement social: 137-154. Lausanne,\nPayot. \nLaplantine, François, 2003, « Penser anthropologiquement la religion »,\nAnthropologie et sociétés  27 : 11-35.\nMahmoo d, Saba, 2006, « Agency , Performativity , and the Feminist\nSubject », dans Ellen T . Armour et Susan M. St. V ille (dir.), Bodily\n7 - Mossière.pmd 2011-10-24, 20:13140\n         141DEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANEDEVENIR MUSULMANE\nCitations: Religion and Judith Butler : 177-223. New Y ork, Columbia\nUniversity Press.\n——, 2005, The Politics of Piety: The Islamic Revival and the Feminist\nSubject. Princeton, Princeton University Press.\nMansson, Anna Magdalena, 2002, Becoming Muslim: Meanings of\nConversion to Islam . Thèse, Lund, Lunds Universitet.\nMauss, Marcel, 1973 , Les techniques du corps . Paris, PUF .\nMcGuire, Meredith, 2008, Lived Religion. Faith and Practice in Everyday\nLife. New York, Oxford University Press.\nMossière, Géraldine, 2010, « Passer et retravailler la frontière. Des\nconverties à l’islam en France et au Québec. Jeux et enjeux de\nmédiation et de différenciation », Sociologie et Sociétés  42 (1) : 245-\n270.\n——, 2008, « Reconnue par l’autre, respectée chez soi. La construction\nd’un discours politique critique et alternatif par des femmes\nconverties à l’islam en France et au Québec », Diversité Urbaine\n8 : 37-59.\nNabti, Mehdi, 2007, « Des soufis en banlieue parisienne. Mise en scène\nd’une spiritualité musulmane ». Archives des Sciences Sociales des\nReligions  140 : 49-78.\nOestergaard, Kate, 2009, « The Process of Becoming Muslim:\nRitualization and Embodiment ». Journal of Ritual Studies  23 (1) :\n1-13.\nSimmons, Gwendolyn Zoharah, 2006, « African American Islam as an\nExpression of Converts’ Religious Faiths and Nationalist Dreams\nand Ambitions », dans Karin V an Nieuwkerk (dir .), Women\nEmbracing Islam: Gender and Conversion in the West : 171-192. Austin\n(Tx), University of T exas Press.\nTank Storper, Sébastien, 2007, Juifs d’élection. Se convertir au judaïsme .\nParis, CNRS Éditions.\nTorab, Azam, 1996, « Piety as Gendered Agency: A Study of Jalaseh\nRitual Discourse in an Urban Neighbourhood in Iran », Journal of\nthe Royal Anthropological Institute  2 : 235-52.\nTurner , Bryan S., 2008, « Intro duction: the Price of Piety »,\nContemporary Islam  2 : 1-6.\nVan Nieuwkerk, Karin, 2010, « ’Conversion’ to Islam », dans Lewis R.\nRambo et Charles E. Farhadian (dir .), Oxford Handbook of Religious\nConversion. Oxford, Oxford University Press.\n7 - Mossière.pmd 2011-10-24, 20:13141\n142 GÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈREGÉRALDINE MOSSIÈRE\nWoodberry, J Dudley , 1992. « Conversion in Islam », dans H Newton\nMalony et Samuel Southard (dir .), Handbook of Religious\nConversion  : 22-40. Birmingham (AL), Religious Education.\nZebiri, Kate, 2008, British Muslim Converts: Choosing Alternative Lives .\nOxford, One W orld.\n7 - Mossière.pmd 2011-10-24, 20:13142",
  "topic": "Humanities",
  "concepts": [
    {
      "name": "Humanities",
      "score": 0.7053687572479248
    },
    {
      "name": "Philosophy",
      "score": 0.48855695128440857
    },
    {
      "name": "Physics",
      "score": 0.3278757333755493
    }
  ]
}