{
    "title": "Modelica - a general object-oriented language for continuous and discrete-event system modeling and simulation",
    "url": "https://openalex.org/W2159503156",
    "year": 2003,
    "authors": [
        {
            "id": "https://openalex.org/A5076482335",
            "name": "Peter Fritzson",
            "affiliations": [
                "Linköping University"
            ]
        },
        {
            "id": "https://openalex.org/A5055417325",
            "name": "Peter Bunus",
            "affiliations": [
                "Linköping University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2004274486",
        "https://openalex.org/W6638150438",
        "https://openalex.org/W4298263761",
        "https://openalex.org/W1824352287",
        "https://openalex.org/W6675369214",
        "https://openalex.org/W6629202617",
        "https://openalex.org/W4242395378",
        "https://openalex.org/W6629453420",
        "https://openalex.org/W3010782316",
        "https://openalex.org/W1494836481",
        "https://openalex.org/W1521496944",
        "https://openalex.org/W1489649483",
        "https://openalex.org/W1553437683",
        "https://openalex.org/W147779991",
        "https://openalex.org/W2342082360",
        "https://openalex.org/W1778049851",
        "https://openalex.org/W2099165995",
        "https://openalex.org/W1555104280",
        "https://openalex.org/W1996703648"
    ],
    "abstract": "Modelica is a general equation-based object-oriented language for continuous and discrete-event modeling of physical systems for the purpose of efficient simulation. The language unifies and generalizes previous objectoriented modeling languages. The Modelica modeling language and technology is being warmly received by the world community in modeling and simulation. It is bringing about a revolution in this area, based on its ease of use, visual design of models with combination of legolike predefined model building blocks, its ability to define model libraries with re-usable components and its support for modeling and simulation of complex applications involving parts from several application domains. In this paper we present the Modelica language with emphasis on its language features and one of the associated simulation environments. Simulation models can be developed in an integrated problem-solving environment by using a graphical editor for connection diagrams. Connections are established just by drawing lines between objects picked from a class library. The principles of object oriented physical systems modeling and the multi-domain capabilities of the language are presented in the paper by several examples.",
    "full_text": null
}