{
  "title": "Using the Wii Fit as a tool for balance assessment and neurorehabilitation: the first half decade of “Wii-search”",
  "url": "https://openalex.org/W2158051318",
  "year": 2014,
  "authors": [
    {
      "id": "https://openalex.org/A5065086012",
      "name": "Daniel J. Goble",
      "affiliations": [
        "San Diego State University"
      ]
    },
    {
      "id": "https://openalex.org/A5044857001",
      "name": "Brian L. Cone",
      "affiliations": [
        "San Diego State University"
      ]
    },
    {
      "id": "https://openalex.org/A5017645785",
      "name": "Brett W. Fling",
      "affiliations": [
        "Oregon Health & Science University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1988633562",
    "https://openalex.org/W2164159598",
    "https://openalex.org/W2136023139",
    "https://openalex.org/W2015249647",
    "https://openalex.org/W1971500460",
    "https://openalex.org/W2146582924",
    "https://openalex.org/W2011392399",
    "https://openalex.org/W2017455416",
    "https://openalex.org/W2123009829",
    "https://openalex.org/W2146464837",
    "https://openalex.org/W1978713375",
    "https://openalex.org/W2129992026",
    "https://openalex.org/W2058989724",
    "https://openalex.org/W1994897578",
    "https://openalex.org/W1970400103",
    "https://openalex.org/W2086037289",
    "https://openalex.org/W2127540631",
    "https://openalex.org/W2155058646",
    "https://openalex.org/W1997194061",
    "https://openalex.org/W2016624949",
    "https://openalex.org/W2110257378",
    "https://openalex.org/W2132078140",
    "https://openalex.org/W2021251478",
    "https://openalex.org/W2144184384",
    "https://openalex.org/W2127326669",
    "https://openalex.org/W194326884",
    "https://openalex.org/W2114303011",
    "https://openalex.org/W1563098518",
    "https://openalex.org/W2118177184",
    "https://openalex.org/W2002722940",
    "https://openalex.org/W2050645726",
    "https://openalex.org/W2078749671",
    "https://openalex.org/W2146368921",
    "https://openalex.org/W2003631723",
    "https://openalex.org/W2395933437",
    "https://openalex.org/W2141555127",
    "https://openalex.org/W19911071",
    "https://openalex.org/W2150141965",
    "https://openalex.org/W2122075512",
    "https://openalex.org/W2963732661",
    "https://openalex.org/W2106699917",
    "https://openalex.org/W1974704788",
    "https://openalex.org/W2047532356",
    "https://openalex.org/W147204859",
    "https://openalex.org/W1579060055",
    "https://openalex.org/W2101333636",
    "https://openalex.org/W2117799554"
  ],
  "abstract": null,
  "full_text": "REVIEW Open Access\nUsing the Wii Fit as a tool for balance assessment\nand neurorehabilitation: the first half decade of\n“ Wii-search”\nDaniel J Goble1*, Brian L Cone1 and Brett W Fling2\nAbstract\nThe Nintendo Wii Fit was released just over five years ago as a means of improving basic fitness and overall\nwell-being. Despite this broad mission, the Wii Fit has generated specific interest in the domain of neurorehabilitation\nas a biobehavioral measurement and training device for balance ability. Growing interest in Wii Fit technology is likely\ndue to the ubiquitous nature of poor balance and catastrophic falls, which are commonly seen in older adults and\nvarious disability conditions. The present review provides the first comprehensive summary of Wii Fit balance research,\ngiving specific insight into the system’s use for the assessment and training of balance. Overall, at the time of the fifth\nanniversary, work in the field showed that custom applications using the Wii Balance Board as a proxy for a force\nplatform have great promise as a low cost and portable way to assess balance. On the other hand, use of Wii Fit\nsoftware-based balance metrics has been far less effective in determining balance status. As an intervention tool, positive\nbalance outcomes have typically been obtained using Wii Fit balance games, advocating their use for neurorehabilitative\ntraining. Despite this, limited sample sizes and few randomized control designs indicate that research regarding use of\nthe Wii Fit system for balance intervention remains subject to improvement. Future work aimed at conducting studies\nwith larger scale randomized control designs and a greater mechanistic focus is recommended to further advance the\nefficacy of this impactful neurorehabilitation tool.\nKeywords: Postural control, Interventions, Training, Virtual reality, Evaluation\nIntroduction\nOn December 1st, 2012 the Nintendo Wii Fit gaming sys-\ntem celebrated its fifth anniversary. This novel system con-\nsists of exercise-based game software, the Wii console, and\na specially developed Wii Balance Board (WBB) controller.\nAccording to Nintendo, the purpose for developing the\nWii Fit was to combine fun and fitness for all ages, includ-\ning such aspects of physical well-being as joint flexibility,\nmuscle strength, and upright standing posture. The system\nis relatively inexpensive (~$200 US), easy to access, and\nthe games are highly engaging [1-3]. Based on these char-\nacteristics, it is not surprising that the Wii Fit software is\none of the top selling video console games of all time.\nBeyond its use in the general population, the Wii Fit has\ngenerated significant interest in the neurorehabilitation re-\nsearch domain. This is particularly true with respect to the\nstudy of balance control, where the Wii Fit software and/\nor WBB have provided an increasingly attractive means of\nassessing and training individual balance ability. The num-\nber of balance-related research papers using the Wii Fit\nsystem (Figure 1) tripled in the two years prior to the fifth\nanniversary, compared the first three years of its existence\n[1,2,4-42]. Undoubtedly, balance research using the Wii\nFit is gaining in both popularity and acceptance within the\nscientific community.\nThe ubiquitous importance of balance research for\nneurorehabilitation is unquestioned based on epidemio-\nlogical reports indicating that older adults and various in-\ndividuals with neuromuscular disability conditions have an\nincreased likelihood for catastrophic fall-related injuries\n[43-47]. The cost of such injures is not just to the individ-\nual but to the greater health care system at large. To this\n* Correspondence:dgoble@mail.sdsu.edu\n1Sensory-Motor and Rehabilitative Technology Laboratory (SMaRTlab), School\nof Exercise and Nutritional Sciences, San Diego State University, 5500\nCampanile Drive, San Diego, CA 92182-7251, USA\nFull list of author information is available at the end of the article\nJNER\nJOURNAL OF NEUROENGINEERING\nAND REHABILITATION\n© 2014 Goble et al.; licensee BioMed Central Ltd. This is an Open Access article distributed under the terms of the Creative\nCommons Attribution License (http://creativecommons.org/licenses/by/2.0), which permits unrestricted use, distribution, and\nreproduction in any medium, provided the original work is properly credited.\nGoble et al. Journal of NeuroEngineering and Rehabilitation2014, 11:12\nhttp://www.jneuroengrehab.com/content/11/1/12\nextent, the goal of the present review was to summarize\nthe first half decade of Wii Fit balance research and pro-\nvide insight regarding the important results that will shape\nthe next five years. Literature for this review was obtained\nthrough a targeted search of PubMED and MEDline data-\nbases using keywords such as“Wii” and “Balance”. Papers\nwere included that used the Wii Fit system or WBB for\nthe assessment or training of balance ability. In the first\nhalf of this review, approaches are overviewed that utilized\nthe Wii Fit as a neuroengineering tool for balance assess-\nment. Alternatively, the second half of this review discusses\ndetailed evidence supporting use of the Wii Fit as a balance\nintervention tool for both healthy and diseased populations.\nBalance assessment using the Wii Fit system\nComparing the WBB and a scientific grade force platform\nPerhaps the most significant neuroengineering-based\ninnovation to arise with the advent of the Wii Fit gaming\nsystem was the creation of the WBB itself. This device,\nwhile limited to some extent in terms of weight capacity\n(~150 Kg) and sampling frequency (~30-50 Hz), can be\nutilized as a cost-efficient and transportable version of a\nscientific-grade force platform. Force platforms are cur-\nrently the gold standard for assessment of balance ability\nin many laboratories and clinics, but cost between $5000-\n20000 US. These devices provide accurate measures of\nbody center of pressure (COP), which is an approximation\nof the body’s center of mass (or balance point) projected\nvertically onto the floor below. COP is an important\nmetric for balance stability assessment given that it closely\napproximates body sway.\nWhen standing on the WBB, the Wii Fit system mea-\nsures body sway in the side to side (COPx) and front to\nback (COPy) directions based on downward force sensor\ndata generated at each corner of the WBB according to\nthe following equations:\nCOPx ¼ 21 /C3 TR þ BRðÞ ‐ TL þ BLðÞðÞ = TL þ TR þ BL þ BRðÞ\nCOPy ¼ 12 /C3 TL þ TRðÞ ‐ BL þ BRðÞðÞ = TL þ TR þ BL þ BRðÞ\nIn these equations TR, TL, BR and BL are the force\nsensor values from the top right, top left, bottom right\nand bottom left corners of the WBB. This information,\nalong with total downward force (i.e. vertical ground re-\naction force), is transmitted with minimal time lag to the\nWii console via wireless (i.e. Bluetooth) technology.\nIn addition to communicating with the Wii console for\ngaming applications, WBB wireless signals are also readily\navailable for use with other Bluetooth compatible devices\nsuch as personal computers and laptops. To this extent,\nonce synced to a device, it is possible to create customized\nWBB software applications in a number of computer pro-\ngramming environments (e.g. LabVIEW, MATlab,) based\non COP data and/or the total downward force obtained\ndirectly from the WBB in real-time. This straightforward\nmeans of unlocking the Wii has opened the door for the\ndevelopment of many custom balance applications.\nUsing the WBB and custom software, Clark and col-\nleagues [11] performed an initial, and critical, validation\nstudy of COP information outputted from a WBB. In this\nstudy, the total length of COP traces was compared be-\ntween a WBB and scientific grade force plate during ten,\n30s trails of standing with eyes opened/closed in single or\ndouble stance conditions. The results showed that COP\npath lengths obtained from the WBB were valid, correl-\nating well with those from th es c i e n t i f i cg r a d ef o r c e\nplatform. The COP data were also reliable, evidenced by\nstrong interclass correlations between trials of similar\nbalance conditions. These findings have since been repli-\ncated in healthy adults by Hubbard and colleagues [26], as\nwell as by Holmes et al. [39] for assessment of postural\ndisturbances in Parkinson’s disease. Sample data from our\nown lab is shown in Figure 2, comparing 20 s standing on\na WBB and a sophisticated force plate (model: OR6-7-\n2000, Advanced Mechanical Technology, Inc., Watertown,\nMA, USA). Taken together, it can be concluded that the\nWBB provides COP data that is both valid and reliable.\nThis information can subsequently serve as a cost effective\nproxy for force plate COP in the development of portable\nposturography systems.\nFigure 1Growth in Wii Fit Research.From 2011 till the fifth\nanniversary the number of Wii Fit-balance related papers has shown\nan exponential increase [1,2,4-42].\nGoble et al. Journal of NeuroEngineering and Rehabilitation2014, 11:12 Page 2 of 9\nhttp://www.jneuroengrehab.com/content/11/1/12\nExamples of balance assessment using custom WBB COP\ndata applications\nSeveral attempts have been made to use raw COP data\nfrom a customized WBB for balance assessment. Young\net al. [19], demonstrated that customized WBB COP data\ncould be used to assess changes in older adult balance\nfollowing a specially designed, game-based intervention\nover four weeks. Before and after training, six elderly\nparticipants undertook a traditional balance test (i.e.\nRomberg Test) whereby they stood as still as possible on\nthe WBB for two, 30 s trials - one with eyes open and\none with eyes closed. The COP data collected showed\nanterior-posterior COP variability was positively reduced\nby the intervention, but only in more difficult trials where\nvisual information was not available (i.e. eyes closed condi-\ntions). Increases in body sway for individuals with Autism\n[12] and Hearing Loss [37] have also been measured with\ncustom WBB COP.\nIn contrast to the traditional balance assessment uti-\nlized by Young et al. [19], Clark et al. [16] described a\nslightly more novel method for assessing an important\naspect of balance – weight bearing asymmetry. Weight\nbearing asymmetry is prevalent in many clinical popula-\ntions, whereby greater body weight is placed on, typic-\nally, the less impaired limb. In this study, 23 healthy\nyoung adults stood with each leg on a different WBB,\nand performed five squats with and without visual feed-\nback regarding weight bearing asymmetry. The results\nshowed that participants could reduce asymmetry when\nvisual feedback was provided. In future work, this method\ncould be utilized to enhance known weight bearing asym-\nmetries in individuals with hemiplegia due to, for example,\nstroke or cerebral palsy. Further, these findings provide an\nexcellent example of the potential for creating novel bal-\nance tools with WBB technology. For other examples of\nnon-traditional COP-based applications of the WBB see\nKennedy et al. [22] and Yamamoto et al. [41].\nBalance metrics provided by the Wii Fit game software\nThe Wii Fit software includes several means of assessing\nbalance ability. Once the Wii Fit software is loaded, par-\nticipants are first encouraged to perform a “body test”\nthat comprises both“center of balance” and “body con-\ntrol” measures of balance control. In the center of bal-\nance assessment, participants stand still on the WBB for\n7 s while COP data is collected. From this data, the par-\nticipant’s average COP deviation from body midline is\ncalculated, indicating a measure of weight bearing asym-\nmetry. Overall, this assessment is thought to provide in-\nformation about body posture with the assumption that\nhaving an equal distribution of weight between left and\nright legs is ideal.\nThe second balance metric garnered by the Wii Fit\nsoftware is based on a body control test. Unlike the cen-\nter of balance test, the body control test is not an assess-\nment of static COP but, rather, a complex combination\nof cognitive and dynamic COP control. Individuals are\ngiven one assessment“game” at random from a group of\nten possible choices. The games range from simple tests\nof how accurately individuals can move a cursor represent-\ning their COP on the television screen to a target location,\nto those that are more cognitive in nature (i.e. involving\ncounting, ordering and memorizing of items). Once com-\npleted, the participant is given a score called the“Wii Fit\nage” for their performance. This metric ranges from 2-99\nand represents age-normalized performance such that, for\nexample, a score of 46 indicates balance ability equal to\nthat of the average 46 year old.\nExamples of Wii Fit software-based balance assessments\nOnly a few attempts have been made to utilize Wii Fit\nsoftware-based balance metrics in research settings, and\nonly limited success has been achieved. First, in a study\nby Dougherty et al. [23], 9 older adults were asked to un-\ndergo a 5-week balance training program using a multi-axis\nFigure 2Representative COPx (A) and COPy (B) data for the force\nplate and WBB over the course of an example 20 s static balance\ntrial. Pearson Correlation between the two signals is r = 0.99.\nGoble et al. Journal of NeuroEngineering and Rehabilitation2014, 11:12 Page 3 of 9\nhttp://www.jneuroengrehab.com/content/11/1/12\nbalance training board (Indo Board Balance Trainer, EABO\nInc.). The participant’s Wii Fit Age was calculated before\nand after the intervention and results showed that Wii Fit\nAge was lower (i.e. improved) following training. Despite\nthis mean improvement, however, no statistical differences\nwere found, suggesting thatonly some of the balance im-\nprovement was captured by the Wii Fit Age metric.\nTo what extent two Wii Fit body test metrics correlate\nwith standardized tests of older adult fitness, balance\nand mobility was recently determined by Reed-Jones and\ncolleagues [13]. These researchers compared a battery of\nclinical examinations with the“Basic Balance Test” and\nthe “Prediction test” of the Wii Fit software. Overall, there\nwas little correlation between the clinical tests and the\ndata provided from the Wii Fit software-based tests of bal-\nance. This finding mirrored that which was described by\nGras et al. [6], who also found that the center of balance\ntest was not a valid measure compared to its counterpart\ndetermined via a force platform. Further, Wikstrom [40]\nfound poor validity and reliability for 12 of the exer-games\nassociated with the Wii Fit software compared to a stand-\nard balance test. This result may reflect the different re-\nquirements of balance for gaming and the balance test\nutilized by Wikstrom [40]. Taken together, however, these\nresults suggest that Wii Fit software-based measures of\nbalance ability are not effective.\nUsing the Wii Fit for balance intervention\nThe most prominent scientific use for the Wii Fit has been\nneurorehabilitation-based balance interventions [1,2,4,7,\n10,14,15,17-19,21,22,27-31,34,36]. An overview of studies\nwhere the balance abilities of healthy adults have been\ntrained is provided in Table 1. This table shows a clear\nbias toward work with older individuals. In Table 2, those\nstudies are outlined that have used the Wii Fit system as a\nmeans for neurorehabilitating poor balance in various\nclinical conditions. This work has focused on a number of\nclinical populations including Stroke, Parkinson’s Disease\nand Cerebral Palsy. Specific detail regarding the interven-\ntion types utilized, and their efficacies are provided herein.\nTypes of Wii Fit balance intervention\nMost balance interventions involving the Wii Fit system\nhave relied on the balance-specific exer-games included\nwith the Wii Fit software. The goal of the Wii Fit balance\ngames is to move a virtual representation of the participant\n(called a“Mii”) on a television screen via displacement of\nparticipant COP over the WBB. In some games, COP con-\ntrol is only required along a single axis (e.g. medial-lateral),\nmaking control of the character more simplistic for the\nuser. In contrast, other games entail greater COP control\nthrough simultaneous displacement along both medial-\nlateral and anterior-posterior axes. Most games last between\n30s and 3 min and participants are given a game-specific\nscore after playing that is reflective of their overall perform-\nance. An excellent analysis of the various games included in\nthe Wii Fit software was recently provided by Deutsch and\ncolleagues [25].\nIn addition to the balance games included in the Wii\nFit software, some studies have used Wii Fit yoga games\nto improve participant balance. Rather than focusing on\ndynamic aspects of COP, as is typical for the Wii Fit bal-\nance games, yoga games rely on static balance control.\nExamples of Wii Fit yoga games are the Sun Salutation\nand Half Moon poses. In these tasks, participants are led\nby a virtual trainer on screen, who demonstrates a target\nbody position the participant must achieve. Once in that\nposture, feedback is given to the participant via a point-\nrepresentation of their COP in real-time. The participant\ngoal is to keep their body (and COP) as still as possible\nwhile maintaining the yoga pose.\nBeyond the standard games included in the Wii Fit soft-\nware, a small number of researchers have sought to create\ntheir own balance intervention games using COP data\nfrom a customized WBB software application [8,19,21].\nThis approach allows the creation of games that are cus-\ntomized to fit the needs of a specific population, such as\nelderly adults or individuals with reduced cognitive func-\ntion. In addition, these applications have the ability to cap-\nture in-game performance, which may be advantageous\nfor developing custom performance metrics. To date, the\ngames created have been quite varied, but generally re-\nquire the participant to shift their COP to move an object\ntowards or around other objects in a virtual environment.\nSome examples include catching apples in a basket [8,19],\nmoving a golf ball around barriers towards a hole [8], pop-\nping rising balloons/bubbles [19,21] and air hockey [21].\nNot all Wii fit balance interventions have been game-\nbased. Shih [42], for example, used a unique approach that\nencouraged individuals with Cerebral Palsy to become\nmore aware of their COP location. In this experiment, a\ncustomized WBB setup was used to activate participants’\nfavorite television programs when standing on the board\nwith their COP centered between the feet. Deviation from\nthis ideal resulted in the television program being turned\noff. Even though the participants had reduced cognitive\nabilities, they were able to implicitly learn COP control\nover multiple trials and keep the television on for longer\nperiods of time than normal. An increased percentage of\ntrials with the desired COP location were also found in re-\ntention trials with the television stimulus constantly on.\nEfficacy of Wii Fit-based interventions\nAs can be seen in Tables 1 and 2, a plethora of balance\noutcome measures have been utilized to assess Wii Fit\nbalance intervention efficacy. The most common tests\nemployed pre and post intervention have been clinical\nmeasures of balance such as the Berg Balance Scale [48]\nGoble et al. Journal of NeuroEngineering and Rehabilitation2014, 11:12 Page 4 of 9\nhttp://www.jneuroengrehab.com/content/11/1/12\nand Timed up and Go test [49]. These standard, yet\nsomewhat subjective, measures have been chosen as they\nare 1) commonly employed in clinical settings, 2) rela-\ntively straightforward to administer and 3) do not rely\non expensive equipment. Alternatively, some researchers\nhave performed more complex assessments of balance\nability such as the sensory organization and limits of\nstability tests of the Neurocom balance manager sys-\ntem. These latter tests involve state of the art balance\nequipment and respectively measure the extent to which\nan individual relies on various sources of sensory feed-\nback (e.g. vision, proprioception, vestibular) during quiet\nTable 1 Wii Fit intervention studies that trained balance in healthy adults\nAuthor(s) Intervention details Population Balance-specific Statistical\n(Group size) Outcome measure Significance?\nBateni (2012) [36] Ski Slalom, Ski Jump and Table Older Berg balance scale Not tested\nTilt Wii Fit games Adults (n = 5) Bubble balance score Not tested\nDose: 12, 20 min sessions\nPadala et al. (2012) [34] Various Wii Fit games selected Older Berg balance scale p < 0.01\nfrom all categories Adults (n = 11) Tinetti test p < 0.05\nDose: 40, 30 min sessions TUG (normal) p > 0.05 p>0.05\nToulotte et al. (2012) [14] Various Wii Fit games selected Older Unilateral stance test p > 0.05\nmostly from yoga a balance types Adults (n = 9) Tinetti test p < 0.05\nDose: 20, 60 min sessions Wii fit center of balance p < 0.05\nRendon et al. (2012) [30] 3 Wii Fit games – not specified Older TUG (normal) p < 0.05\nDose: 18, 40 min sessions Adults (n = 16) ABC p < 0.05\nFranco et al. (2012) [28] Soccer heading, Ski jump, Ski Older Berg balance scale p < 0.001\nslalom, Tightrope and Table tilt Adults (n = 11) Tinetti test p < 0.01\nWii Fit games\nDose: 6, 15 min sessions\nYoung et al. (2011) [19] Two custom-designed games Older ML/AP COP variability eyes open p > 0.05\ncontrolled by WBB Adults (n = 6) ML COP variability eyes closed p > 0.05\nDose: 10, 20 min sessions AP COP variability eyes closed p < 0.05\nTinetti falls efficacy scale Not given\nWilliams et al. (2011) [15] Self-selected Wii Fit games from Older Berg balance scale p < 0.01\nbalance and aerobics categories Adults (n = 22)\nDose: 12, 20 min sessions\nAgmon et al. (2011) [18] Basic step, Soccer heading, ski Older Berg balance scale p < 0.05\nslalom and Table tilt Wii Fit games Adults (n = 7)\nDose: 50, 30 min sessions\nNitz et al. (2010) [7] Self-selected Wii Fit games from Adults (n = 8) TUG (normal and cognitive) p > 0.05\nall categories mCTSIB (foam, eyes closed) p > 0.05\nDose: 20, 30 min sessions mCTSIB (unilateral, eyes closed) p < 0.05\nLimits of stability test p > 0.05\nPigford et al. (2010) [1] Ski slalom, Table tilt and Deep Older Berg balance scale Not tested\nbreathing Wii Fit games Adults (n = 1) TUG (normal) Not tested\nDose: 10, 20 min sessions ABC Not tested\nHanneton and Hanneton (2009) [2] Deep breathing, Warrior posture Adults (n = 4) Improvement in game scores Not tested\nTorso Twist, Soccer heading, Ski Not tested\nslalom, Ski jump, Table tilt and\nBasic step games Wii Fit games\nDose: 10, 37 min sessions\nAbbreviations: ABCactivities-based balance confidence scale,MCTSIB modified Clinical Test for Sensory Integration of Balance,ML Medial/Lateral,AP Anterior/Posterior.\nGoble et al. Journal of NeuroEngineering and Rehabilitation2014, 11:12 Page 5 of 9\nhttp://www.jneuroengrehab.com/content/11/1/12\nstance, and how far one ’s COP can be moved in all\ndirections.\nRegardless of the outcome measure, Wii Fit interven-\ntions have largely been shown to be effective (see Tables 1\nand 2). No study has reported a negative impact of Wii Fit\ntraining for any measure of balance ability, and most have\nindicated at least some quantitative or anecdotal evidence\nof improvement. This is despite a major criticism of the\nWii Fit balance work to date - a lack of convincing\nstatistical support. This is likely due to the relatively large\nnumber of studies conducted that have utilized small sam-\nples of trained individuals. As shown in Figure 3, 40% of\nstudies conducted to date have tested five individuals or\nless, and 3 out of 4 studies conducted have had 10 partici-\npants or less. This underscores the imminent need to go\nbeyond preliminary and case study reports of Wii Fit inter-\nvention efficacy and move towards larger-scale, randomized\ncontrol designs in the future.\nTable 2 Wii Fit Intervention studies that rehabilitated balance in clinical populations\nAuthor(s) Intervention details Population Balance-specific Statistical\nOutcome measure Significance?\nNilsagard et al. (2012) [29] Perfect 10, Ski/snowboard Multiple TUG (normal and cognitive) p < 0.05\nslalom, Table tilt(+), Penguin Sclerosis (n = 41) Four square step test p < 0.01\nslide, Soccer heading, Tightrope, ABC p < 0.05\nSkateboard and balance\nbubble(+)Wii Fit games\nDose: 12, 30 min sessions\nEsculier et al. (2012) [31] Table tilt, Ski slalom, Balance Parkinson ’s One-leg stance duration p < 0.001\nbubble, ski jump and penguin Disease (n = 10) COP velocity variability p < 0.05\nslide Wii Fit games ABC p > 0.05\nDose: 18. 40 min sessions TUG (normal) p < 0.05\nTinetti’s test p < 0.05\nCBM p < 0.001\nMiller et al. (2012) [27] Wii Fit games selected based on Transfemoral Biodex balance test Not tested\nparticipant preference Amputation (n = 2) ABC Not tested\nDose: 12, 20 min sessions\nKennedy et al. (2011) [22] Custom designed “WiiHab” tasks Acquired Improvement on custom Not tested\nusing WBB including Sit to Stand, Brain designed tasks Not tested\nWeight Shifting and Stepping Injury (n = 1)\nDose: 6, 12 min sessions\nZettergren et al. (2011) [17] Sun salutation, Half moon, Rowing Parkinson ’s TUG (normal) Not tested\nsquat, Torso twists, Chair, Penguin Disease (n = 1) Berg balance scale Not tested\nslide, Table tilt and Bubble balance\nWii Fit games\nDose: 12, 50 min sessions\nGil Gomez et al. (2011) [21] Custom designed balance games Acquired Berg balance scale p < 0.001\nusing WBB including Simon, Brain Brunel balance assessment p < 0.05\nBalloon breaker and Air hockey Injury (n = 9) Anterior reach test p < 0.01\nDose: 20, 60 min sessions TUG (normal) p < 0.01\nShih et al. (2010) [10] Change of standing posture Cerebral Duration of time in desired\ndetector using the WBB Palsy (n = 2) standing posture p < 0.01\nDose: 45, 3 min sessions\nDeutsch et al. (2009) [4] Ski jump, Ski slalom, Tightrope, Chronic ABC Not tested\nLunges and Park stroll Wii Fit games Stroke (n = 2) TUG (normal and cognitive) Not tested\nDose: 12, 60 min sessions\nAbbreviations: ABC activities-based balance confidence scale,TUG timed up and go,CBM community balance and mobility scale.\nGoble et al. Journal of NeuroEngineering and Rehabilitation2014, 11:12 Page 6 of 9\nhttp://www.jneuroengrehab.com/content/11/1/12\nOf the studies gathered for this review, only three were\nidentified as having some form of randomized control\ndesign. The best insight into the overall effectiveness of\nWii Fit interventions might be gained from this work by\ncalculating effect sizes for the mean outcome measure\ndifferences. First, in a study by Franco et al. [28], it was\nshown that six, 15-minute sessions of Wii Fit exer-gaming\nhad a strong effect (Cohen’s d = 0.7) on Berg Balance score\nin a group of community dwelling older adults compared\nthose that did not use the Wii Fit. Toulotte et al. [14] also\nfound moderate to strong effects across all balance out-\ncome variables in a study of older adults who played Wii\nFit games one hour per week for 20 weeks. Balance mea-\nsures in this study included unilateral stance tests with eyes\nopen (Cohen’s d = 0.5) and eyes closed (Cohen’sd = 1 . 3 ) ,\nTinetti’ss t a t i c( C o h e n’sd = 3 . 8 )a n dd y n a m i c( C o h e n’s\nd = 1.0) tests, as well as the Wii Fit test of center of bal-\nance (Cohen’sd=1 . 9 ) .\nThe only randomized control clinical study at the time\nof the fifth anniversary was carried out by Nilsagard [29]\nin individuals with multiple sclerosis (MS). MS Patients\nwho played Wii Fit games twice a week for six weeks\nshowed a moderate improvement in the timed up and go\ntest (Cohen’s d = 0.4) and small improvements in the four\nsquare step test (Cohen’s d = 0.1) and activities based bal-\nance confidence assessment (Cohen’s d = 0.2) compared to\na group of individuals with MS that did not play Wii Fit\ngames. These results, while positive, were less impressive\nthan those seen for healthy older adults.\nAn important factor influencing the effectiveness of any\nintervention is the amount of time devoted to the training\nand rehabilitation tasks (i.e. dosing). In Figure 4, box and\nwhisker plots are given demonstrating the mean, median,\ninter-quartile range and 95% confidence intervals for the\ndoses associated with Wii Fit interventions. On average,\nparticipants have been asked to take part in 19 training\nsessions with a mean intervention time of approximately\n30 min per session. This has resulted in an average of\n605 min of training per individual tested. Despite this,\nthere have been several studies with high dose values that\nappear to skew the mean dosage in the upward direction.\nIn this case, median dose metrics may be more inform-\native of typical intervention characteristics. Using median\ndata, interventions with 12 sessions of 30 min per session\nwould appear to be more normal with an intervention\ntime of 485 min. These values serve as a guideline for op-\ntimally designing future Wii Fit interventions. However,\nadditional work focused solely on determining the ideal\ndosing parameters is still needed to maximize the poten-\ntial for positive change.\nSummary and conclusions\nUse and acceptance of the Wii Fit as a balance assessment\nand neurorehabilitation tool is growing rapidly. With re-\nspect to assessment, initial attempts to use the WBB as a\nlow cost proxy for a scientific force platform via custom-\nized software applications appear to be an extremely prom-\nising area of exploration. Research relying on measurement\nof balance ability using Wii Fit software-based metrics,\nhowever, has been far less convincing to date. With respect\nto balance neurorehabilitation, there is reason for opti-\nmism regarding the use of Wii Fit-based interventions\nto foster meaningful balance improvements across a\nFigure 3Group sizes for Wii Fit Interventions.A majority of Wii\nFit intervention studies have utilized group sizes of 10 participants or\nless. [1,2,4,7,10,14,15,17-19,21,22,27-31,34,36].\nFigure 4Wii Fit Intervention Dosing Parameters.Box and whisker plots representing the 95th percentile (whiskers), interquartile range (box),\nmean (black circle) and median (black line) data for the various dosing parameters of Wii Fit interventions [1,2,4,7,10,15,17-19,21,22,27-31,34,36].\nGoble et al. Journal of NeuroEngineering and Rehabilitation2014, 11:12 Page 7 of 9\nhttp://www.jneuroengrehab.com/content/11/1/12\nvariety of clinical populations. Multiple studies now show\nimprovement in balance control following reasonable pe-\nriods of training with the Wii Fit games and custom de-\nsigned applications.\nWhile some evidence has been provided regarding the\nextent to which training induces shifts in sensory feedback\nweighting, improvement in sensorimotor processing, or\nmuscle strength gains in association with balance improve-\nments [7], far greater work is needed. In addition, a careful\neye should be kept on controlling for various confounds\nduring balance assessment and training protocols. These\nfactors may include participant age, body composition,\neducation level and current medications.\nOverall, use of the Wii Fit for assessment and neuror-\nehabilitation purposes is likely to continue to grow in\nthe years to come. Greater emphasis must still be placed\non implementing more powerful, randomized control\ndesigns with larger sample populations to test questions\nof interest. There must also be a greater emphasis placed\non determining what specific neural and musculoskeletal\nadaptations occur in response to Wii Fit training, and\nhow those changes compare to other commonly utilized\nbalance training interventions such as uneven balance\nboards and yoga. Such studies, in association with the\ninformation gathered in this review, will form the basis\nof the next half decade of“Wii-search”.\nAbbreviations\nWBB: Wii Balance Board; COP: Center of pressure.\nCompeting interests\nThe authors declare that they have no competing interests.\nAuthors’ contributions\nDG, BC and BF were all involved in the conception of this work, as well as in\nthe gathering of relevant published research papers on the topic, their\nsynthesis and drafting the manuscript. All authors read and approved the\nfinal manuscript.\nAuthors’ information\nDG is currently an Assistant Professor and director of the Sensorimotor and\nRehabilitation Technology Laboratory (SMaRTlab). He has a Master’s degree\nin Biomechanics, Phd in Human Motor Control and has done post-doctoral\nwork in the field of sensorimotor neuroscience. His past work on balance has\nfocused on proprioception and brain function using neuroimaging.\nBC is currently pursuing a Master’s degree in Rehabilitation Sciences and has\nUndergraduate Training in the field of Exercise and Nutritional Sciences. He\nhas clinical experience in the field of physical therapy including balance\nintervention for individuals with disabilities.\nBF is currently finishing a post-doctoral position in the Balance Disorders\nLaboratory of Dr Faye Horak at Oregon Health Sciences University. He has\naccepted a faculty position at OHSU and will begin there next year. His main\nbalance expertise is in the domain of Multiple Sclerosis and aging\npopulation.\nFunding\nFunding for this work was provided by a University Grants Program award\ngiven to D. Goble by the Research Foundation– San Diego State University,\nas well as a grant from the National Skeletal Muscle Research Center.\nAuthor details\n1Sensory-Motor and Rehabilitative Technology Laboratory (SMaRTlab), School\nof Exercise and Nutritional Sciences, San Diego State University, 5500\nCampanile Drive, San Diego, CA 92182-7251, USA.2Balance Disorders\nLaboratory, Department of Neurology, Oregon Health and Science University,\n505 NW 185th Avenue, Beaverton, OR 97006, USA.\nReceived: 5 April 2013 Accepted: 4 February 2014\nPublished: 8 February 2014\nReferences\n1. Pigford T, Andrews WA: Feasibility and Benefit of Using the Nintendo Wii\nFit for Balance Rehabilitation in an Elderly Patient Experiencing\nRecurrent Falls.J Stud Phys Ther Res2010, 2:12– 20.\n2. Hanneton S: Coaching the Wii: Evaluation of a physical training\nexperiment assisted by a video game.I n Haptic, Audio, Visual Environments\nand Games; Lecco, Italy.2009:54– 57.\n3. Taylor MK, McCormick D, Shawis T, Impson R, Griffin M:Activity-promoting\ngaming systems in exercise and rehabilitation.J Rehabil Res Dev2011,\n48:1171– 1186.\n4. Deutsch JE, Robbins D, Morrison J, Guarrera Bowlby P:Wii-Based\nCompared to Standard of Care Balance and Mobility Rehabilitation for\nTwo Individuals Post-Stroke.I n Virtual Rehabilitation International\nConference; Haifa. 2009:117– 120.\n5. Deutsch JE, Borbely M, Filler J, Huhn K, Guarrera-Bowlby P:Use of a low-cost,\ncommercially available gaming console (Wii) for rehabilitation of an\nadolescent with cerebral palsy.Phys Ther2008, 88:1196– 1207.\n6. Gras LZ, Hummer AD, Hine ER: Reliability and Validity of the Nintendo Wii\nFit. J CyberTher Rehabil2009, 2:329– 335.\n7. Nitz JC, Kuys S, Isles R, Fu S: Is the Wii Fit a new-generation tool for\nimproving balance, health and well-being? A pilot study.Climacteric\n2010, 13:487– 491.\n8. Billis AS, Konstantinidis EI, Mouzakidis C, Tsolaki MN, Pappas C, Bamidis PD:\nA Game-Like Interface for Training Seniors’ Dynamic Balance and Coordin-\nation.In IFMBE Proceedings.Edited by Bamidis PD, Pallikarakis N; 2010:691– 694.\n9. Lange B, Flynn S, Proffitt R, Chang CY, Rizzo AS:Development of an\ninteractive game-based rehabilitation tool for dynamic balance training.\nTop Stroke Rehabil2010, 17:345– 352.\n10. Shih C-H, Shih C-T, Chu C-L:Assisting people with multiple disabilities\nactively correct abnormal standing posture with a Nintendo Wii Balance\nBoard through controlling environmental stimulation.Res Dev Disabil\n2010, 31:936– 942.\n11. Clark RA, Bryant AL, Pua Y, McCrory P, Bennell K, Hunt M:Validity and\nreliability of the Nintendo Wii Balance Board for assessment of standing\nbalance. Gait Posture 2010, 31:307– 310.\n12. Travers BG, Powell PS, Klinger LG, Klinger MR:Motor Difficulties in Autism\nSpectrum Disorder: Linking Symptom Severity and Postural Stability.\nJ Autism Dev Disord2013, 43:1568– 1583.\n13. Reed-Jones RJ, Dorgo S, Hitchings MK, Bader JO:WiiFit Plus balance test\nscores for the assessment of balance and mobility in older adults.\nGait Posture 2012, 36:430– 433.\n14. Toulotte C, Toursel C, Olivier N:Wii Fit(R) training vs. Adapted Physical\nActivities: which one is the most appropriate to improve the balance of\nindependent senior subjects? A randomized controlled study.\nClin Rehabil 2012, 26:827– 835.\n15. Williams BDNL, Bender A, Mattox H, Tibbs JR:The effect of Nintendo Wii\non Balance: A Pilot Study Supporting the Use of the Wii in Occupational\nTherapy for the Well Elderly.Occup Ther Health Care2011, 25:131– 139.\n16. Clark RA, McGough R, Paterson K:Reliability of an inexpensive and\nportable dynamic weight bearing asymmetry assessment system\nincorporating dual Nintendo Wii Balance Boards.Gait Posture 2011,\n34:288– 291.\n17. Zettergren K, Franca J, Antunes M, Lavallee C:The effects of Nintendo Wii\nFit training on gait speed, balance, functional modility and depression in\none person with Parkinson's disease.Med Health Sci J2011, 9:18– 24.\n18. Agmon M, Perry CK, Phelan E, Demiris G, Nguyen HQ:A pilot study of wii\nfit exergames to improve balance in older adults.J Geriatr Phys Ther2011,\n34:161– 167.\n19. Young W, Ferguson S, Brault S, Craig C:Assessing and training standing\nbalance in older adults: a novel approach using the‘Nintendo Wii’\nBalance Board.Gait Posture 2011, 33:303– 305.\n20. Owens SG, Garner JC 3rd, Loftin JM, van Blerk N, Ermin K:Changes in\nphysical activity and fitness after 3 months of home Wii Fit use.\nJ Strength Cond Res2011, 25:3191– 3197.\nGoble et al. Journal of NeuroEngineering and Rehabilitation2014, 11:12 Page 8 of 9\nhttp://www.jneuroengrehab.com/content/11/1/12\n21. Gil-Gomez JA, Llorens R, Alcaniz M, Colomer C:Effectiveness of a Wii\nbalance board-based system (eBaViR) for balance rehabilitation: a pilot\nrandomized clinical trial in patients with acquired brain injury.\nJ Neuroeng Rehabil2011, 8:30.\n22. Kennedy MW, Schmiedeler JP, Striegel AD, Crowell CR, Villano M, Kuitse J:\nEnhanced Feedback in Balance Rehabilitation using the Nintendo Wii\nBalance Board.I n e-Health Networking Applications and Services (Healthcom),\n2011 13th IEEE International Conference Columbia, MO.2011:162– 168.\n23. Dougherty J, Kancel A, Ramar C, Meacham C, Derrington S:The effects of a\nmulti-axis balance board intervention program in an elderly population.\nMo Med 2011, 108:128– 132.\n24. Yamada M, Aoyama T, Nakamura M, Tanaka B, Nagai K, Tatematsu N,\nUemura K, Nakamura T, Tsuboyama T, Ichihashi N:The reliability and\npreliminary validity of game-based fall risk assessment in community-\ndwelling older adults.Geriatr Nurs 2011, 32:188– 194.\n25. Deutsch JE, Brettler A, Smith C, Welsh J, John R, Guarrera-Bowlby P, Kafri M:\nNintendo wii sports and wii fit game analysis, validation, and application\nto stroke rehabilitation.Top Stroke Rehabil2011, 18:701– 719.\n26. Hubbard B, Pothier D, Hughes C, Rutka J:A portable, low-cost system for\nposturography: a platform for longitudinal balance telemetry.\nJ Otolaryngol Head Neck Surg2012, 41(Suppl 1):S31– S35.\n27. Miller CA, Hayes DM, Dye K, Johnson C, Meyers J:Using the Nintendo Wii\nFit and body weight support to improve aerobic capacity, balance, gait\nability, and fear of falling: two case reports.J Geriatr Phys Ther2012,\n35:95– 104.\n28. Franco JR, Jacobs K, Inzerillo C, Kluzik J:The effect of the Nintendo Wii Fit\nand exercise in improving balance and quality of life in community\ndwelling elders.Technol Health Care2012, 20:95– 115.\n29. Nilsagard YE, Forsberg AS, von Koch L:Balance exercise for persons with\nmultiple sclerosis using Wii games: a randomised, controlled multi-centre\nstudy. Mult Scler 2013, 19:209– 216.\n30. Rendon AA, Lohman EB, Thorpe D, Johnson EG, Medina E, Bradley B:\nThe effect of virtual reality gaming on dynamic balance in older adults.\nAge Ageing 2012, 41:549– 552.\n31. Esculier JF, Vaudrin J, Beriault P, Gagnon K, Tremblay LE:Home-based\nbalance training programme using Wii Fit with balance board for\nParkinsons's disease: a pilot study.J Rehabil Med2012, 44:144– 150.\n32. Meldrum D, Glennon A, Herdman S, Murray D, McConn-Walsh R:Virtual\nreality rehabilitation of balance: assessment of the usability of the\nNintendo Wii((R)) Fit Plus.Disabil Rehabil Assist Technol2012, 7:205– 210.\n33. Kwok BC, Mamun K, Chandran M, Wong CH:Evaluation of the Frails’ Fall\nEfficacy by Comparing Treatments (EFFECT) on reducing fall and fear of\nfall in moderately frail older adults: study protocol for a randomised\ncontrol trial.Trials 2011, 12:155.\n34. Padala KP, Padala PR, Malloy TR, Geske JA, Dubbert PM, Dennis RA, Garner KK,\nBopp MM, Burke WJ, Sullivan DH:Wii-Fit for Improving Gait and Balance in\nan Assisted Living Facility: A Pilot Study.J Aging Res2012, 2012:597573.\n35. Koslucher F, Wade MG, Nelson B, Lim K, Chen FC, Stoffregen TA:Nintendo\nWii Balance Board is sensitive to effects of visual tasks on standing sway\nin healthy elderly adults.Gait Posture 2012, 36:605– 608.\n36. Bateni H: Changes in balance in older adults based on use of physical\ntherapy vs the Wii Fit gaming system: a preliminary study.Physiotherapy\n2012, 98:211– 216.\n37. Kanegaonkar RG, Amin K, Clarke M:The contribution of hearing to normal\nbalance. J Laryngol Otol2012, 126:984– 988.\n38. Howells BE, Clark RA, Ardern CL, Bryant AL, Feller JA, Whitehead TS, Webster KE:\nThe assessment of postural control and the influence of a secondary task in\npeople with anterior cruciate ligament reconstructed knees using a\nNintendo Wii Balance Board.Br J Sports Med2013, 47:914– 919.\n39. Holmes JD, Jenkins ME, Johnson AM, Hunt MA, Clark RA:Validity of the\nNintendo Wii(R) balance board for the assessment of standing balance\nin Parkinson's disease.Clin Rehabil 2013, 27:361– 366.\n40. Wikstrom EA: Validity and reliability of Nintendo Wii Fit balance scores.\nJ Athl Train2012, 47:306– 313.\n41. Yamamoto K, Matsuzawa M: Validity of a jump training apparatus using\nWii Balance Board.Gait Posture 2013, 38:132– 135.\n42. Shih CH: A standing location detector enabling people with developmental\ndisabilities to control environmental stimulation through simple physical\nactivities with Nintendo Wii Balance Boards.Res Dev Disabil2011,\n32:699– 704.\n43. Lord SR, Clark RD, Webster IW:Postural stability and associated physiological\nfactors in a population of aged persons.J Gerontol1991, 46:M69– M76.\n44. Gray P, Hildebrand K: Fall risk factors in Parkinson's disease.J Neurosci\nNurs 2000, 32:222– 228.\n45. Rubenstein LZ, Josephson KR: Falls and their prevention in elderly people:\nwhat does the evidence show?Med Clin Noth Am2006, 90:807– 824.\n46. Teasell R, McRae M, Foley N, Bhardwaj A:The incidence and consequences\nof falls in stroke patients during inpatient rehabilitation: factors\nassociated with high risk.Arch Phys Med Rehabil2002, 83:329– 333.\n47. Saposnik G, Mamdani M, Bayley M, Thorpe KE, Hall J, Cohen LG, Teasell R:\nEffectiveness of Virtual Reality Exercises in STroke Rehabilitation\n(EVREST): rationale, design, and protocol of a pilot randomized clinical\ntrial assessing the Wii gaming system.Int J Stroke2010, 5:47– 51.\n48. Berg KO, Wood-Dauphinee SL, Williams JI, Maki B:Measuring balance in\nthe elderly: validation of an instrument.Can J Public Health1992,\n83(Suppl 2):S7– S11.\n49. Podsiadlo D, Richardson S: The timed“ Up & Go” : a test of basic functional\nmobility for frail elderly persons.J Am Geriatr Soc1991, 39:142– 148.\ndoi:10.1186/1743-0003-11-12\nCite this article as:Goble et al.: Using the Wii Fit as a tool for balance\nassessment and neurorehabilitation: the first half decade of“Wii-search”.\nJournal of NeuroEngineering and Rehabilitation2014 11:12.\nSubmit your next manuscript to BioMed Central\nand take full advantage of: \n• Convenient online submission\n• Thorough peer review\n• No space constraints or color ﬁgure charges\n• Immediate publication on acceptance\n• Inclusion in PubMed, CAS, Scopus and Google Scholar\n• Research which is freely available for redistribution\nSubmit your manuscript at \nwww.biomedcentral.com/submit\nGoble et al. Journal of NeuroEngineering and Rehabilitation2014, 11:12 Page 9 of 9\nhttp://www.jneuroengrehab.com/content/11/1/12",
  "topic": "Neurorehabilitation",
  "concepts": [
    {
      "name": "Neurorehabilitation",
      "score": 0.8950796723365784
    },
    {
      "name": "Balance (ability)",
      "score": 0.739910364151001
    },
    {
      "name": "Physical medicine and rehabilitation",
      "score": 0.5803968906402588
    },
    {
      "name": "Balance training",
      "score": 0.5169662833213806
    },
    {
      "name": "Intervention (counseling)",
      "score": 0.43900972604751587
    },
    {
      "name": "Rehabilitation",
      "score": 0.3888593912124634
    },
    {
      "name": "Physical therapy",
      "score": 0.35172000527381897
    },
    {
      "name": "Psychology",
      "score": 0.3389725685119629
    },
    {
      "name": "Computer science",
      "score": 0.32750004529953003
    },
    {
      "name": "Medicine",
      "score": 0.2808886766433716
    },
    {
      "name": "Psychiatry",
      "score": 0.0
    }
  ]
}