{
    "title": "Methods used in the Lives Saved Tool (LiST)",
    "url": "https://openalex.org/W2151858787",
    "year": 2011,
    "authors": [
        {
            "id": "https://openalex.org/A2003508752",
            "name": "William Winfrey",
            "affiliations": [
                "Avenir Health",
                "Futures Group (United States)"
            ]
        },
        {
            "id": "https://openalex.org/A2128955015",
            "name": "Robert McKinnon",
            "affiliations": [
                "Futures Group (United States)",
                "Avenir Health"
            ]
        },
        {
            "id": "https://openalex.org/A2113875280",
            "name": "John Stover",
            "affiliations": [
                "Avenir Health",
                "Futures Group (United States)"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2099843794",
        "https://openalex.org/W2146241019",
        "https://openalex.org/W2016598657",
        "https://openalex.org/W2144275819",
        "https://openalex.org/W2019903356",
        "https://openalex.org/W2113510423",
        "https://openalex.org/W4230894813",
        "https://openalex.org/W647691793",
        "https://openalex.org/W1964608889",
        "https://openalex.org/W2766154138",
        "https://openalex.org/W29863781"
    ],
    "abstract": "Abstract Background Choosing an optimum set of child health interventions for maximum mortality impact is important within resource poor policy environments. The Lives Saved Tool (LiST) is a computer model that estimates the mortality and stillbirth impact of scaling up proven maternal and child health interventions. This paper will describe the methods used to estimate the impact of scaling up interventions on neonatal and child mortality. Model structure and assumptions LiST estimates mortality impact via five age bands 0 months, 1-5 months, 6-11 months, 12-23 months and 24 to 59 months. For each of these age bands reductions in cause specific mortality are estimated. Nutrition interventions can impact either nutritional statuses or directly impact mortality. In the former case, LiST acts as a cohort model where current nutritional statuses such as stunting impact the probability of stunting as the cohort ages. LiST links with a demographic projections model (DemProj) to estimate the deaths and deaths averted due to the reductions in mortality rates. Using LiST LiST can be downloaded at <url>http://www.jhsph.edu/dept/ih/IIP/list/</url> where simple instructions are available for installation. LiST includes default values for coverage and effectiveness for many less developed countries obtained from credible sources. Conclusions The development of LiST is a continuing process. Via technical inputs from the Child Health Epidemiological Group, effectiveness values are updated, interventions are adopted and new features added.",
    "full_text": "METHODOLOGY Open Access\nMethods used in the Lives Saved Tool (LiST)\nWilliam Winfrey*, Robert McKinnon, John Stover\nAbstract\nBackground: Choosing an optimum set of child health interventions for maximum mortality impact is important\nwithin resource poor policy environments. The Lives Saved Tool (LiST) is a computer model that estimates the\nmortality and stillbirth impact of scaling up proven maternal and child health interventions. This paper will describe\nthe methods used to estimate the impact of scaling up interventions on neonatal and child mortality.\nModel structure and assumptions:LiST estimates mortality impact via five age bands 0 months, 1-5 months, 6-\n11 months, 12-23 months and 24 to 59 months. For each of these age bands reductions in cause specific mortality\nare estimated. Nutrition interventions can impact either nutritional statuses or directly impact mortality. In the\nformer case, LiST acts as a cohort model where current nutritional statuses such as stunting impact the probability\nof stunting as the cohort ages. LiST links with a demographic projections model (DemProj) to estimate the deaths\nand deaths averted due to the reductions in mortality rates.\nUsing LiST: LiST can be downloaded at http://www.jhsph.edu/dept/ih/IIP/list/ where simple instructions are\navailable for installation. LiST includes default values for coverage and effectiveness for many less developed\ncountries obtained from credible sources.\nConclusions: The development of LiST is a continuing process. Via technical inputs from the Child Health\nEpidemiological Group, effectiveness values are updated, interventions are adopted and new features added.\nBackground\nHuman and financial resources for expansion of health\nservices are limited. Therefore resources should be\ndirected toward expanding availability and use of ser-\nvices that have the greatest health impact. Health policy\nmakers and program managers require a tool that allows\nthem to assess the differential mortality impact of a\ncomprehensive set of maternal and child health inter-\nventions. Previously developed tools are either narrowly\nfocused on a single set of interventions or calculate\nimpacts without a rigorous demographic or epidemiolo-\ngical framework. LiST overcomes these limitations by\nallowing the simultaneous projection of health impacts\nfor many maternal and child health interventions. This\nis primarily done by linking LiST as an additional mod-\nule to the Spectrum suite of projection models that\nincludes a demographic projection model, an HIV/AIDS\nprojection model and a model for assessing the demo-\ngraphic impacts of family planning programs. Spectrum\nand the integration of LiST with other modules of\nSPECTRUM are described in Stover et al. [1]\nLiST is a computer projection model used to estimate\nthe number of deaths that can be averted as a result of\nscaling up effective maternal and child health interven-\ntions in developing countries. The work presented here is\nan instantiation of the work performed by the Child\nHealth Epidemiology Reference Group (CHERG) for\nWHO and UNICEF. The model and approach used in\nLiST are drawn from the modeling in a series of papers\nin Lancet, including the Child Survival Series [2], the\nNeonatal Series [3] and the Maternal and Child Under-\nnutrition series. [4] A complete description of the uses of\nLiST and background on its creation including, expert\ntechnical inputs can be found in Boschi-Pinto et al. [5]\nThis paper describes the technical details of the model\nfor scaling up non-AIDS inter ventions for preventing\ndeaths and improving health status among children\nunder the age of five. While LiST also estimates the\nimpact of interventions on maternal mortality and still\nbirths, these outputs will not be discussed in detail here.\nLiST estimates the direct impact of interventions on\nmortality as well as the indirect effects of interventions\n* Correspondence: bwinfrey@futuresinstitute.org\nFutures Institute, 41-A New London Turnpike, Glastonbury, Connecticut,\n06033, USA\nWinfrey et al. BMC Public Health2011, 11(Suppl 3):S32\nhttp://www.biomedcentral.com/1471-2458/11/S3/S32\n© 2011 Winfrey et al; licensee BioMed Central Ltd. This is an open access article distributed under the terms of the Creative Commons\nAttribution License (http://creativecommons.org/licenses/by/2.0), which permits unrestricted use, distribution, and reproduction in\nany medium, provided the original work is properly cited.\nthat act through intermediate outcomes, such as stunt-\ning. The model projects mortality rates including the\nneonatal mortality rate, the infant mortality rate and the\nunder-five mortality rate. With the help of the demo-\ngraphic engine in Spectrum, LiST also calculates the\nnumbers of deaths disaggregated by cause of death and\nby age band. Deaths averted are also disaggregated by\ncause of death, age band and intervention. The mortality\nimpact of scaling up PMTCT, Cotrimoxazole and ART\nfor children is independently calculated within the AIDS\nImpact Module (AIM) of SPECTRUM. Reductions in\nAIDS mortality are calculated with AIM because the\nmortality from AIDS is contingent upon the prevalence\nof AIDS among adults. AIM contains an epidemiological\nmodel for AIDS among the entire population in contrast\nto LiST which is directed uniquely at child mortality.\nLiST requires three sets of inputs: a) intervention cov-\nerages that can be scaled up from a projection baseline\nor from the first year of an intervention program; b)\nmeasures of health status (e.g., levels of risk factors and\npopulation exposures, and baseline cause-specific mor-\ntality estimates); and c) estimates of intervention effec-\ntiveness. LiST estimates mor tality reductions from a\nprojection baseline. The projection baseline is the most\nrecent point in time where a complete set of baseline\nintervention coverages and mortality are known.\nLiST is loaded with default baseline coverage values,\nmeasures of health status, levels of risk factors, popula-\ntion exposures and cause of death data for more than\n80 countries. The user is encouraged to choose his/her\nown scale up trajectories of coverage for all interven-\ntions of interest. Occasionally the user will have health\nstatus or mortality information that s/he believes is\nmore up to date than that provided within LiST. In\nthese cases s/he may want to update this information\nwithin LiST for his/her country. There is also a com-\nplete set of intervention effectiveness estimates in LiST.\nThese effectiveness values are based on reviews per-\nformed by the Child Health Epidemiological Group of\nWHO and UNICEF. Examples of these reviews can be\nfound in this issue as well as in earlier publications. [6].\nThis paper describes how the model is constructed\nand presents key equations used to estimate the impact\nof health interventions on child mortality.\nModel structure, assumptions and formulae\nOutline of basic structure\nLiST is a partial cohort modelw h i c hf o l l o w sc h i l d r e n\nthrough five age bands from birth to five years of age.\nMortality rates and causes of death are described for\nneonates (under 1 month of age), children 1-59 months\nof age, and women giving birth (Table 1). From this\ninformation the model determines the number of deaths\nby cause each year. Current mortality rates can be\nreduced through increased coverage of any of 77 health\ninterventions organized by the time period when the\ninterventions are implemented: periconceptual, preg-\nnancy, childbirth, breastfeed ing promotion, preventive\nafter birth, vaccines and curative after birth (Additional\nFile 1).\nInterventions may have a direct effect on a specific\ncause of death or an indirect effect. LiST does not\nassume that secular trends of mortality decline will con-\nt i n u e .O n l yi n t e r v e n t i o ns c a l eu pw i l lc a u s eac h a n g ei n\nmortality rates. Increasing the coverage of any given\nintervention may cause a reduction in multiple causes of\ndeath. For example, zinc for prevention will decrease\nboth diarrhoea mortality and pneumonia directly. Zinc\nfor prevention will also decrease stunting which has\ndownstream impacts on diarrhoea, malaria, measles and\npneumonia mortality. Indirect effects work though inter-\nmediate characteristics or risk factors including the pro-\np o r t i o no fc h i l d r e nb o r nw i t hi n t r a - u t e r i n eg r o w t h\nrestriction (IUGR); nutritional status of children, as\nmeasured by height-for-age z-score (HAZ) and weight-\nfor-height z-score (WHZ); and diarrhoea incidence.\nThese indirect characteristics or risk factors impact\nmortality rates. Outcomes are calculated for mortality\nrates (neonatal, infant, child and maternal mortality),\nnumbers of still births, numbers of deaths by cause of\ndeath, and deaths averted by intervention and cause of\ndeath.\nCalculating the direct effects of interventions on mortality\nDirect effects are calculatedwhen a particular interven-\ntion directly reduces mortality from a specific cause. For\nexample, expanding the coverage of oral rehydration\nsalts (ORS) directly reduce s mortality from diarrhoea.\nThe reduction in mortality caused by a specific interven-\ntion is calculated from the increased coverage of the\nintervention multiplied by the effectiveness of the inter-\nvention in reducing mortality. This crude estimate is\nadjusted for the impact of current coverage that is\nalready incorporated in current mortality rates (by divid-\ning the crude impact by the potential mortality reduc-\ntion remaining). Since some interventions may not act\nagainst all mechanisms of mortality, the impact is\nfurther adjusted for the pro portion of cause-specific\nmortality that is susceptible to that intervention, called\nthe Affected Fraction. For example, ORS is effective\nagainst some forms of diarrhoea but not all. Thus the\naffected fraction of ORS is 0.95, indicating that 5% of\ndiarrhoea deaths are due to mechanisms not affected by\nORS.\nIn detail, the proportional reduction R in mortality\nfrom cause of deathj for children in age banda caused\nby intervention i at time t (R\ni,j,a,t) is a function of the\neffectiveness of the interventionIi,j,a, the increase in the\nWinfrey et al. BMC Public Health2011, 11(Suppl 3):S32\nhttp://www.biomedcentral.com/1471-2458/11/S3/S32\nPage 2 of 11\ncoverage of interventionI (Ci,a,t – Ci,a,0) and the affected\nfraction ( AFi,j,a) adjusted for the unrealized potential\nimpact (1 – Ii,j,a,0 xC i,a,0).\nRi,j,a,t =[ Ii,j,a x( Ci,a,t – Ci,a,0)/\n(1 – Ii,j,a,0 xC i,a,0)] x AFi,j,a\n(1)\nFor example, suppose that the coverage of ORS\nincreased from 25 percent to 50 percent and that the\neffectiveness of ORS was 0.93 and the fraction of diar-\nrhoea deaths that could be prevented by ORS was 0.95.\nIf ORS were the only intervention then the percent\nreduction in mortality would be: [0.930 * (0.50– 0.25)]\n/( 1 – 0.93*0.25) * 0.95 = 0.288 or a 28.8 percent reduc-\ntion in diarrhoea mortality.\nWhen more than one intervention is scaled up LiST\nfirst calculates the mortality reduction for each interven-\ntion in isolation, as if it were the only intervention\nimplemented. The total mortality reduction for a pack-\nage of interventions is calculated by sequencing the\nimpact calculations such that the first intervention acts\non the current level of mortality, while the second, third\nand subsequent interventions act on the remaining mor-\ntality, after the effects of the previous interventions have\nbeen removed. In mathematical terms, the total impact\nof all interventions (R\nj,a,t)i st h ep r o d u c to ft h ei m p a c t\nof each intervention on the remaining mortality:\nRj,a,t =1 – (1 – R1,j,a,t )*( 1 – R2,j,a,t)*\n(1 – R3,j,a,t)*( 1– R4,j,a,t) … (2)\nThe ordering of the interventions in this calculation is\nirrelevant because the total impact does not depend on\nthe order. On the other hand, attributing the share of\nthe impact to a specific intervention depends on the\ntiming of the intervention. This is discussed below.\nIn LiST there are currently 11 interventions that\nimpact diarrhea mortality (see figure 1). As an example\nassume that two interventions are being scaled up to\nreduce diarrhoea mortality: ORS and zinc tablets for\ntreatment. If ORS reduces diarrhoea mortality by 28.8\npercent and Zinc reduces mortality by 25.0 percent then\nthe combined reduction in mortality would be 1 – (1\n-0.288) x (1- 0.25) = 0.466 or a 46.6 percent reduction.\nIn the simplest case, the mortality reduction attributed\nto each individual intervention (R’) is determined as the\ntotal mortality reduction multiplied by the full impact of\nthe intervention when calculated in isolation divided by\nthe sum of the full impacts of all interventions.\nR’\ni,j,s,t =R j,s,t xR i,j,s,t / ∑i Ri,j,s,t (3)\nFollowing the example from above, the shares of mor-\ntality reduction for cause j allocated to ORS and zinc\nfor treatment respectively would be: 0.288 / (0.288 +\n0.250) = 0.535 for ORS and 0.250 / (0.288 + 0.250) =\n0.465 for Zinc.\nA complicating factor is that interventions are\ncharacterized by the timing of their impact. Peri-con-\nceptual interventions are first in line, followed in\nturn by pregnancy related interventions, childbirth\ninterventions, vaccines, “preventive after birth ” inter-\nventions and finally “curative after birth ” interven-\ntions. The interventions whose timing is first receive\ncredit for mortality reductions as if they were work-\ning on the entire burden of cause specific mortality.\nThe subsequent sequential interventions receive\ncredit as if they were only acting on the cause speci-\nfic mortality that remained after the upstream inter-\nventions have acted.\nFollowing the previous example, suppose that coverage\nof rotavirus vaccine was scaled up in addition to ORS\nand zinc for treatment. Rotavirus vaccine is a preventive\nintervention and acts on mortality before ORS and zinc\nfor treatment. Assume that the by equation (1) the inde-\npendent impact of the rotavirus vaccine would be 30.6.\nUsing the equation (2) the total impact would be 62.9\npercent. Since rotavirus is the only vaccine and it acts\nbefore the other interventions (both curative) it receives\nfull credit in its share. Rotavirus share of the mortality\nreduction is therefore 0.306/.629 or 48.6%. ORS and\nzinc for treatment then share the mortality reduction\nthat remains. Applying the shares that were calculated\nbefore ORS would have a share of (0.629– 0.306)/0.629\nx 0.535 = 0.173 or 27.5% and zinc for treatment would\nhave a share of (0.629– 0.306) / 0.629 x 0.465 = 0.239\nor 23.9%.\nTable 1 Age bands and causes of death modeled in LiST\nAge band Causes of death acting during age band\nBirth to 0.9 months Birth asphyxia, prematurity, sepsis/pneumonia, congenital anomalies, tetanus, diarrhoea, all other causes of death\n1 – 5.9 months Diarrhoea, pneumonia, meningitis, measles, malaria, pertussis, injury, AIDS, all other causes of death\n6 - 11.9 months\n12 – 23.9 months\n24 – 59.9 months\nWomen giving birth (maternal\nmortality)\nAntepartum hemorrhage, postpartum hemorrhage, hypertensive diseases of pregnancy, sepsis, abortion,\nobstructed labor, ectopic pregnancy, malaria, other causes of death\nWomen giving birth (still births) Antepartum, intrapartum\nWinfrey et al. BMC Public Health2011, 11(Suppl 3):S32\nhttp://www.biomedcentral.com/1471-2458/11/S3/S32\nPage 3 of 11\nThe reduction in all cause mortality is simply the\nreduction from all interventions acting on a single cause\nof death multiplied by the proportion of all deaths due\nto that cause. Thus, if diarrhoea mortality is reduced by\n46% due to ORS and zinc for treatment, and diarrhoea\nis responsible for 20% of all deaths in that age band,\nthen the reduction in all cause mortality would be 0.46\nx 0.20 = 0.09. Reductions in mortality from other causes\nof death are applied similarly to determine the total\nreduction in all causes of death.\nThe number of deaths averted is determined by applying\nthe reduction in the overall mortality rates to the number\nof children in each age band. The number of children is\nprovided by the demographic projection module in Spec-\ntrum. The number of deaths averted by an intervention is\ncalculated as the product of the total number of deaths\naverted and the proportional contribution of each inter-\nvention. Because an intervention frequently has an impact\non several causes of death, LiST sums the deaths averted\nby an intervention across the several causes of death to\ndetermine the total impact of each intervention.\nBecause a demographic model lies behind LiST there\nare several spillover effects. For example, a reduction in\nneonatal mortality will result in an increased number of\nchildren exposed to mortality after the neonatal period.\nIn the absence of mortality reduction measures for chil-\ndren aged 1-59 months there would be more deaths to\nolder children than otherwise would have occurred.\nLikewise, problems in the neonatal period can have an\neffect on the risk of mortality during the period 1-59\nmonths via inter-uterine growth retardation. Children\nwith IUGR have a higher rate of mortality in the neona-\nt a lp e r i o db u ta l s oah i g h e rr i s ko fo fs t u n t i n ga m o n g\nchildren aged 1 -59 months, leading to reduced mortal-\nity among the older children.\nHerd effect of vaccines and bednets\nEstimates of the impact of vaccinations and/or bednets\nmay include a herd effect caused by the disruption of\ntransmission. The herd effect occurs when some chil-\ndren who are not themselves vaccinated or sleeping\nunder a bednet are protected from infection due to the\nreduced exposure to infection caused the large percen-\ntage of other children who are vaccinated or sleeping\nunder bednets. These calculations require an assump-\ntion about the protection received by children not\nreceiving the intervention as a function of the overall\npopulation coverage. The additional reduction in mor-\ntality due to the herd effect (Hi,j,a,t ) is calculated as the\ndifference in the herd effect (HEi,j,a,t) at the current cov-\nerage and the baseline coverage (HEi,j,a,0 ), adjusted for\nthe effect at the baseline coverage.\nHi,j,a,t = (HEi,j,a,t – HEi,j,a,0)/(1 – HEi,j,a,0) (4)\nThe herd effect of the vaccine acts in tandem with its\ndirect protective effect to produce the total impact on\nmortality when the herd effect is present (hR).\nFigure 1LiST calculation of postneonatal diarrhoea deaths in children aged 1 month to 59 months.\nWinfrey et al. BMC Public Health2011, 11(Suppl 3):S32\nhttp://www.biomedcentral.com/1471-2458/11/S3/S32\nPage 4 of 11\nhRi,j,a,t =R i,j,a,t +H i,j,a,t x( 1 – Ri,j,a,t) (5)\nFor the measles vaccine a herd effect of 1.00 exists for\ncoverage that exceeds 95 percent. For coverage between\n90 percent and 95 percent the herd effect is the interpo-\nlated value between 0.00 and 1.00. For values of coverage\nbelow 90 percent the herd effect is 0.00. The effectiveness\nof the measles vaccine is 0.850. If baseline coverage of the\nmeasles vaccine was 75 percent and the target coverage\nwas 97 percent then the additional reduction in mortality\ndue to the herd effect would be (1.00 – 0.00)/(1.00 –\n0.00) = 1.00. Using equation (1) R\ni,j,a,t would be 0.516. By\nequation (5) the total reduction in mortality due to the\nmeasles vaccine would be 0.516 + 1.00 x ( 1– 0.516) =\n1.00, a 100% reduction in mortality.\nCalculating the effects of interventions on intermediate\nhealth outcomes\nThe previous discussion describes the procedures used\nwithin LiST for calculating the effects of interventions\nthat directly reduce mortality from specific causes of\ndeath. Other interventions, such as nutrition, affect mor-\ntality indirectly through intermediate health outcomes\nsuch as stunting, which in turn affect mortality. For\nexample, zinc supplementation for prevention may affect\nstunting which in turn may affect mortality from\ndiarrhoea.\nZinc supplementation for prevention ® stunting ®\ndiarrhoea mortality\nThe following subsections describe the approach used\nto capture these indirect effects.\nIndirect effect\nLiST includes four intermediate health outcomes or risk\nfactors that affect mortality: stunting, wasting, intrauter-\nine growth restriction (IUGR) and diarrhoea incidence\n(which actually affects another intermediate outcome,\nstunting). Breastfeeding is a special intermediate out-\ncome that is discussed below.\nStunting and IUGR\nInterventions impacting stunting are modeled via\ncohorts such that the nutritional status of a child in a\ngiven cohort will continue to impact nutritional status\nas the child ages. In other words a child that is born\nwith IUGR will be more likely to be stunted in the first\nmonth of life and children who are stunted at the end\no fa na g eb a n dw i l lb em o r el i k e l yt ob es t u n t e da st h e y\nage into the next age band. Figure 2 is a summary sche-\nmatic of the approach to modeling.\nThe impact of interventions and conditions that\nimpact stunting are modeled as odds ratios. The odds of\nstunting is the probability of being stunted divided by\nthe probability of not being stunted: Odds = P / [1 - P].\nThe odds ratio formulation was chosen to assure that\nthe risk of stunting would never exceed 1.00. The odds\nratio compares the odds of stunting for children in two\ndifferent statuses. For example the odds ratio of being\nstunted relative to not being stunted for children who\ndo not receive zinc supplements for prevention versus\nthat for children who are zinc supplemented has a\ndefault value 1.180. This means that the odds of being\nstunted for a child who has not received zinc supple-\nments for prevention are 18 percent higher than the\nodds of being stunted for a child who has received zinc\nsupplements.\nContinuing with the zinc example, if a child moves\nfrom a state of not being zinc supplemented to a state\nof being zinc supplemented her odds of being stunted\ndecline. The risk of a child who is zinc supplemented is\nrelated to the risk for children who are not zinc supple-\nmented by equation (6). This equation is derived from\nthe definition of an odds ratio.\nP\nk,a = (ORk,a *P 1,a /( 1-P 1,a +O Rk,a *P 1,a) (6)\nPk,a is the probability of being stunted in the riskier\nstatus (e.g., not receiving zinc for prevention). P1,a is the\nprobability of being stunted in the less risky status. ORk,\na is the odds ratio. The weighted sum of the probabil-\nities will equal the overall probability of stunting as indi-\ncated by equation (7).\nP\na,t =F k,a,t *P k,a +F 1,a,t *P 1,a (7)\nPa,t is the probability of stunting among children in\nage band “a” at time “t”.F k,a,t and F1,a,t are the fractions\nof the children in the age band who are in the risky sta-\ntus and the non-risky status respectively. At the base-\nline, Equations 6 and 7 are two equations in two\nunknowns that can be solved for the risk of stunting for\nt h ec h i l d r e ni nt h en o n - r i s k ys t a t u s( P\n1,a )a n df o rt h e\nchildren in the risky status (Pk,a). After having solved\nthese two equations, the probability of stunting can be\ncalculated based on changing levels of the risky versus\nnon-risky status using the values of P\n1,a and P1,k.T h e\nindependent percent reduction in stunting that would\nbe caused by the reduction in the more risky status is\ncalculated by equation 8.\nR\nk,t =(P a,t -P a,0)/P a,0 (8)\nThe following presents an example calculation with\nzinc for prevention. Suppose 25 percent of children\nreceive zinc supplementation at the baseline 35 percent\nof children are stunted. F\nk,a,t would be the percent of\nchildren who do not receive zinc supplementation or 75\npercent. In LiST the default odds ratio of being stunted\nfor children who are zinc supplemented relative to those\nwho are not zinc supplemented is 1.18. If equations 6\nand 7 are solved simultaneously then the percent of zinc\nsupplemented children who are stunted is 32.2 and the\nWinfrey et al. BMC Public Health2011, 11(Suppl 3):S32\nhttp://www.biomedcentral.com/1471-2458/11/S3/S32\nPage 5 of 11\npercent of un-supplemented children who are stunted is\n35.9.\nIf preventive zinc supplementation were the only\nintervention and the percent of children who are supple-\nmented were to increase from 25 percent to 50 percent\nthen the percent stunted would decline from 35 percent\nto 34.1 percent via equation 7 (0.50 x 0.322 + 0.50 x\n0.359 = 0.341). And the percent decline in stunting\nwould be 2.7 percent via equation 8 ( (0.350– 0.341)/\n0.350 = 0.027).\nThis process would be replicated for all statuses or\nbehaviors impacting stunting status. The overall reduc-\ntion in stunting is calculated similar to the process\ndescribed above in equations (1) and (2).\nIn LiST there are five factors that influence stunting:\n For neonatal children the percent who were born\nwith IUGR;\n For post-neonatal children the percent who were\nstunted at the previous age band;\n Complementary feeding;\n Episodes of diarrhoea per year; and\n Zinc supplementation.\nLiST includes two interventions related to feeding\nchildren. Complementary feeding is an intervention\ndesigned to address stuntin g. Supplementary feeding\nis an intervention designed to address wasting. The\npercent of children born IUGR is impacted by\nimprovements in coverage of pregnant women pro-\ntected via Intermittent Prevention Therapy (IPT) or\nsleeping under a bednet, balanced energy supplemen-\ntation or multiple micronutrient supplementations.\nThe percent reduction in children born IUGR is cal-\nculated with the strategy described in equations (1)\nand (2) with the percentage reduction in mortality\nreplaced by the percentage reduction in children born\nwith IUGR.\nThe impact of complementary feeding is described by\nodds ratios associated with four different states:\n Food secure with promotion;\n Food secure without promotion;\n Food insecure with promotion and supplementa-\ntion; and\n Food insecure without promotion and\nsupplementation.\nFood secure populations are defined as those living\nabove the poverty line. The isolated impact of comple-\nmentary feeding is calculated with the strategy described\nby equations (6) through (8). A major difference is that\nequation 6 is replaced with three equations correspond-\ning to three odds ratios defined relative to the food\nsecure population with promotion, the least risky group.\nEquation 7 is replaced with an equation that has four\nterms on the right hand side corresponding to the four\nbulleted populations listed above. These four equations\n(three equations replacing equation 6 and the new equa-\ntion 7) lead to a quartic equation that is solved analyti-\ncally to obtain the baseline stunting probabilities for the\nfood secure population with promotion, the food secure\npopulation without promotion, the food secure popula-\ntion with promotion and supplementation and the food\nsecure population with neither promotion nor supple-\nmentation. The remainder of the calculations are the\nsame as described above.\nThe impact of reduced diarrhoea incidence on stunt-\ning is modeled via an odds ratio that is denominated as\nan odds ratio that increases as the number of episodes\nFigure 2Schematic of the process behind the calculation of stunting.\nWinfrey et al. BMC Public Health2011, 11(Suppl 3):S32\nhttp://www.biomedcentral.com/1471-2458/11/S3/S32\nPage 6 of 11\nof diarrhoea increases. The population averag odds ratio\nis the odds ratio of a single case raised to the power of\nthe average number of cases of diarrhoea per year (i).\nAO\nk,a,t = (ORk,a)i,t (10)\nThis formulation is converted into the approach of\nequations (6) through (8) by assuming that all children in\nthe base year have“i” cases of diarrhoea and that reduc-\ntions in diarrhoea incidence are achieved by moving a\nproportion of the children from having“i” cases of diar-\nrhoea to having no diarrhoea at all. For example assume\nthat there are on average 3 cases of diarrhoea per child in\nthe baseline year and on average 2 cases of diarrhoea in\nthe target year. This would be translated into 66.7 per-\ncent of the children having 3 cases of diarrhoea (analo-\ngous to F\na,k,t)a n d3 3 . 3p e r c e n to ft h ec h i l d r e nh a v i n gn o\ndiarrhoea (analogous to Fa,1,t) in the target year.\nDiarrhoea incidence is itself an intermediate outcome\nin LiST. It is affected by water and sanitation improve-\nments. The water and sanitation interventions include\nimproved water source within 30 minutes, use of a\nwater connection in the home, improved excreta dispo-\nsal (latrine/toilet), hand washing with soap and hygienic\ndisposal of children’s stools. The impact of these inter-\nventions is calculated following the strategy described by\nequations (1) through (3) above where the percent\nreduction in mortality and the mortality rate are\nreplaced by percent reduction in diarrhoea incidence\nand number of cases of diarrhoea per year.\nTheoretically and empirically breastfeeding has an\nimpact on diarrhoea incidence. Disentangling the direct\nnutritional impact of breastfeeding and the indirect\nimpact of breastfeeding via reduced diarrhoea incidence\nis very difficult or impossible. Rather than attempt to\ndisentangle these effects, LiST employs a combined\neffectiveness value for breastfeeding. This is described\nelsewhere in this article.\nThe impact of all interventions affecting stunting is\ncombined as in equation 2 above by applying the per-\ncent reduction in stunting caused by a single interven-\ntion to the amount of stunting remaining after the\nimpact of previous interventions has been included.\nWasting\nWasting is impacted by only one intervention, supple-\nmental feeding, that is given only to severely wasted\nchildren (those less than three standard deviations\nbelow the international norm median for weight for\nheight). Starting from a normally distributed population\nbased on current levels of wasting, wasted children\nreceiving supplemental feeding are shifted into different\nbands within the international standard distribution for\nweight for height for health children. These bands into\nwhich children are moved are:\n More than 1 standard deviation less than the med-\nian norm\n Between 1 and 2 standard deviations less than the\nmedian norm\n Between 2 and 3 standard deviations less than the\nmedian norm.\nFor some children supplemental feeding is not at all\neffective. They remain at below 3 standard deviations\nless than the median norm.\nCalculating the effects of intermediate health outcomes\non mortality\nThe stunting calculations in the previous section deter-\nmined the percent of children who are stunted or not\nstunted. Stunting is the percent of children who are less\nthan two standard deviations below the international\nnorm of height for age. Within LiST however the risks\nfor mortality vis-à-vis stunting are defined in terms of\nthe following four bands on the international normal\ndistribution for height for age:\n More than 1 standard deviation less than the med-\nian norm\n Between 1 and 2 standard deviations less than the\nmedian norm\n Between 2 and 3 standard deviations less than the\nmedian norm\n Below 3 standard deviations less the median norm.\nImmediately following is a description of how the\nstunting is translated into these four bands. LiST\nassumes that height for age is distributed normally with\na standard deviation of one. Using the percent stunted\nor wasted, LiST calculates the percent of children who\nare at various points along the international standard\ncurve for height for age and weight for height. Children\nare then assigned to one of the four categories based\nupon these calculations. Figure 2 shows the distribution\nof children in relation to the norm in an illustrative case\nfor stunting. The curve on the right represents the inter-\nnational standard. The curve on the left represents the\nactual situation in the illustrative case. In the interna-\ntional standard the percent of children who are stunted\n(more than 2 standard deviations below the norm) is a\nrelatively small proportion (2.5%) of the population in\nthe left hand tail of the distribution. In the illustrative\ncase, approximately 50 percent of the children are\nstunted. The vertical bars under the curve on the left\nshow the points in the distribution that correspond to\n-1 SD, -2 SD and -3 SD in the international standard.\nFrom these curve LiST calculates the percent of children\nfalling into the four key categories: < -3 SD, -3 to <-2\nWinfrey et al. BMC Public Health2011, 11(Suppl 3):S32\nhttp://www.biomedcentral.com/1471-2458/11/S3/S32\nPage 7 of 11\nS D ,- 2t o- 1S D sa n d- 1-0S D s .I l l u s t r a t i o n so ft h e s e\ncalculations can be found in figure 3.\nEach of the height for age or weight for height sta-\ntuses is associated with a risk of cause specific mortality\nrelative to normal height for age and weight for height.\nFor example children aged 1-5 months who are less\nthan three standard deviations below the international\nnorm for height for age are 4.6 times more likely to die\nof diarrhoea than are children who are greater than one\nstandard deviation less than the international median\nnorm.\nPercent reductions in cause specific mortality are\nestablished by first calculating the average relative risk\nof mortality relative to the reference.“Reference” in the\nnext few paragraphs refers to greater than one standard\ndeviation less than the international median norm. The\naverage relative risk (ARR) for a specific cause of death\n(j) and a particular age (a)a tt i m et is the sum across\nall categories (s) of height for age or weight for height\nof the percentage of children in that category (Z) multi-\nplied by the relative risk (RR) of death for children in\nthat category. The reference category (children of nor-\nmal height for age or weight for height) has a relative\nrisk of 1.00.\nARRa,ji,t = ∑s Zs,a,t xR Rs,a,j, t (11)\nThe percent reduction in mortality is then calculated\nas 1 minus the ratio of the average relative risk at timet\nto the average relative risk in the base year.\nRa,i,t =1 – ARRa,i,t / ARRa,i,0 (12)\nNote that this equation represents the reduction in\nmortality that would occur if only reductions in stunting\nwere impacting mortality. In the general case this\nreduction is combined with reductions in mortality due\nto other interventions as if stunting were also an inter-\nvention. The shares of mortality reduction accounted\nfor by interventions that cause reductions in stunting\nare established recursively via the share of mortality\naccounted for by reductions in stunting and then by the\nshares of stunting reduction accounted for by the inter-\nventions which reduce stunting.\nThe impact of reduced wasting on mortality is\nhandled exactly the same as stunting. Decreased wasting\nleads to a shift of the distribution of weight for height\nscores.\nIUGR impact on neonatal mortality\nThe direct impact of IUGR on mortality is calculated in\na similar manner via reductions in relative risk. The\nmajor difference is that instead of four categories of\nstunting only two states, IUGR or no IUGR, are\nincluded.\nImpact of improved breastfeeding on mortality\nIn the original version of LiST breastfeeding was an\nintermediate outcome that improved as a result of\nscaling up breastfeeding promotion. In the current\nversion of LiST, breastfeeding may be an intermediate\noutcome or it may be entered directly by the user as\nif it were an intervention. In reality breastfeeding is a\nrisk factor, but for calculation purposes it is handled\nas if it were an intervention. Breastfeeding is modeled\nvia four categories: exclusive breastfeeding, predomi-\nnant breastfeeding, partial breastfeeding and no\nbreastfeeding. These categories are disaggregated by\nage.\nThe impact of breastfeeding promotion is modeled via\nodds ratios. The calculation process is similar to that\nused in equations 6 - 8. The major difference is that the\nFigure 3Illustration of the calculation of the percent of children who are < -3 SD, -3 to <-2 SD, -2 to -1 SDs and above -1 SDs for height to age\nrelative to international standard.\nWinfrey et al. BMC Public Health2011, 11(Suppl 3):S32\nhttp://www.biomedcentral.com/1471-2458/11/S3/S32\nPage 8 of 11\nodds ratios are structured as the odds of improved\nbreastfeeding without promotion versus the odds with\npromotion.\nMortality reductions associated with improved breast-\nfeeding are calculated in the same way as mortality\nreductions are calculated for reduced stunting. However,\ninstead of children being in categories falling along a nor-\nmal curve, risk is defined by the type of breastfeeding.\nIllustrations of the complexity of LiST\nThis paper does not discuss all aspects of LiST as that\nwould take too much space. Figures 1 and 4 exhibit the\ncomplexity of LiST from two directions: from the stand-\npoint of a cause of death (postneonatal diarrhoea) and a\nsingle intervention (multiple micronutrient supplemen-\ntation). Figure 4 is conceptually shaped like a funnel\nwith multiple interventions funneling in and at the end\ngenerating a reduction in postneonatal diarrhoea mortal-\nity. Some interventions such as Zinc treatment directly\nimpacts diarrhoeal mortality. Other interventions such\nas complementary feeding impact diarrhoeal deaths\nindirectly via a nutritional status such as stunting. And\na third group of interventions affect diarrhoea mortality\ndirectly and indirectly. An example of this would be\nhand washing which impacts diarrhoea incidence which\nin turn impacts stunting and then diarrhoea mortality.\nFigure 4 flips the funnel over to show how a single inter-\nvention can impact multiple causes of death like a shotgun\nblast. Multiple micronutrien t supplementation impacts\nintra-uterine growth retardation (IUGR). This in turn\ndirectly impacts several neonatal causes of death. IUGR\nalso impacts subsequent stunting. Reductions in stunting\nthen impacts several postneonatal causes of death.\nModel parameters and baseline data inputs\nThe key parameters in the calculation of intervention\neffects on mortality include current health status indica-\ntors, the distribution of deaths by cause, the effective-\nness of each intervention and current and future\nintervention coverage. The key parameters and sources\nof baseline data are shown in Table 2. National health\nsurveys such as the Demographic and Health Surveys\n(DHS) and the Multiple Indicator Cluster Surveys\n(MICS) provide most of the data on current mortality\nrates, the prevalence of stunting and wasting, and the\ncurrent coverage of interventions. Other health status\nindicators are drawn from WHO databases. Estimates of\nintervention effectiveness have been developed by the\nChild Health Epidemiology Reference Group (CHERG).\nMost of that work has been published previously. [6]\nUsing LiST\nLiST is a component of the Spectrum program for pol-\nicy modeling. Spectrum may be downloaded from sev-\neral web servers including http://www.jhsph.edu/dept/\nih/IIP/list/. Detailed instructions on installation are at\nthis site. The program contains all the parameter values\ndescribed above for 77 maternal and child interventions,\nFigure 4LiST calculation of mortality reduction due to scaling up multiple micronutrient supplementation.\nWinfrey et al. BMC Public Health2011, 11(Suppl 3):S32\nhttp://www.biomedcentral.com/1471-2458/11/S3/S32\nPage 9 of 11\nincluding current intervention coverage for most coun-\ntries. If the model is run without any changes the cover-\nage of all interventions will remain constant at the\ncurrent level and, as a result, mortality rates will also\nremain constant.\nLiST can be used to explore the effects of alternate\nstrategies by scaling up coverage of selected interventions\nover time. LiST will calculate the expected change in\nmortality as a result of the changes in coverage. The\nnumber of possible strategies that can be examined using\nLiST is quite large.\nLiST is designed to encourage a strategic approach to\nstrategy selection. The first step is to examine the mor-\ntality rates to see when most mortality happens. If mor-\ntality is concentrated in the neonatal period, then\ninterventions that reduce neonatal mortality should be\nexamined close. A second step is to examine the distri-\nbution of deaths by cause. If one or two causes of death\nare responsible for most deaths then, interventions that\nare effective against those causes of death are likely can-\ndidates. The most effective strategies will be those that\nscale up interventions that have large effects and those\nthat currently have low coverage.\nModel outputs\nLiST calculates the effects of health interventions on\nneonatal, child and maternal mortality. The key outputs\nfor each type of mortality are:\n the mortality rates (neonatal, infant, under five and\nmaternal mortality rates)\n the number of deaths\n the number of still births\n the number of deaths by cause\n the number of deaths averted\n the number of deaths averted by cause\n the number of deaths averted by intervention\nLiST also provides outputs related to nutrition includ-\ning the percentage of children severely wasted, the per-\ncentage stunted, average height/length, breastfeeding\nprevalence, diarrhoea incidence and the prevalence of\nIUGR. All indicators are available for each year of the\nprojection.\nConclusions\nThis paper restricted its discussion to the child mortality\naspects of The Lives Saved Tool (LiST). LiST also\nincludes the capacity to calculate reductions in maternal\nmortality and reductions in still births. The calculations\nfor these run in parallel to those for child mortality. All\ninterventions for child mortality, maternal mortality and\nstill births are scaled up in the same editors assuring\nconsistent estimates of all outcomes. The calculations\nfor maternal mortality and still births do not require\nturning on special features. They are calculated automa-\ntically when LiST is implemented.\nTable 2 Key Parameters in LiST and Sources of Baseline Information\nParameter Source\nHealth Status Indicators\nNeonatal, infant and under five mortality rate United Nations Estimates\nDistribution of neonatal and post-neonatal deaths by cause CHERG\nWhether or not the population of interest is Vitamin A deficient and/or zinc deficient CHERG\nPercent of women exposed to falciparum Guerra et al.[8]\nPercent of newborns with IUGR DHS, MICS, UNICEF, WHO\nPercent of children severely wasted by age DHS, MICS, WHO (http://www.who.int/nutgrowthdb/\ndatabase/en)\nPercent of children stunted by age DHS, MICS, WHO (http://www.who.int/nutgrowthdb/\ndatabase/en)\nIncidence of diarrhoea by age Boschi et al. [9]\nPercent of pregnancies ending with spontaneous abortion WHO\nPercentage of the population living below the poverty line Human Development Report, UNDP\nIntervention Effectiveness\nEffectiveness of each intervention against each cause of death CHERG\nAffected fraction (fraction of deaths from a specific cause potentially addressed by each\nintervention)\nCHERG\nEffectiveness of nutrition-related interventions against IUGR, stunting, wasting and\ndiarrhoea incidence\nCHERG\nEffectiveness of breastfeeding promotion on breastfeeding practices CHERG\nCoverage\nCurrent coverage of each intervention DHS, MICS, UNICEF, WHO, JMP\nWinfrey et al. BMC Public Health2011, 11(Suppl 3):S32\nhttp://www.biomedcentral.com/1471-2458/11/S3/S32\nPage 10 of 11\nThe Lives Saved Tool, LiST, is intended to support\nnational planning to improve maternal and child health.\nIt summarizes a vast impact assessment literature by\nproviding consensus estimates of the effectiveness of\nhealth interventions in a tool that facilitates the applica-\ntion of this information to any national context. LiST\nprovides planners and policy makers with a tool to\nexamine the potential impact of alternative strategies to\nreduce mortality. It is intended to support the strategic\nanalysis of alternatives by displaying the cause of death\nstructure and producing output showing not only the\ntotal impact on mortality but also the contribution of\neach intervention to the total impact.\nThere are limitations to LiST. It can be difficult to\nensure that data on coverage of interventions refers to\ninterventions that are similar to those in the impact lit-\nerature. For some interventions estimates of effective-\nn e s sm a yr e l yo nas m a l ln u m b e ro fs t u d i e s .T h e\ncurrent version of LiST does not address these uncer-\ntainties although we expect to add this feature to future\nversions. The current version does not consider cost,\nbut work is underway to add costing the model. Future\nversions will also include the ability to add interven-\ntions, for example a new vaccine, into the model.\nLiST is readily available to anyone who wants to use\nit. It contains data bases to facilitate use. Most of the\nkey assumptions in LiST are addressed in published arti-\ncles in this supplement and earlier publications. [6]\nUsing LiST properly requires an investment in time to\nfully understand the epidemiological context of any par-\nticular country and to const ruct realistic scenarios\ndetailing increases in coverage for key interventions.\nHowever, in most cases this is time well spent if it can\nlead to more strategic plans for scaling up key health\ninterventions and averting many unnecessary deaths.\nAdditional material\nAdditional file 1: Interventions in LiST organized by when the\nintervention occurs.\nAcknowledgements\nThe authors acknowledge the Child Health Epidemiological Group who\nmade this work possible via their technical inputs. The authors received\nguidance from Neff Walker on the content and structure of the paper. Tanya\nM. Malpica-Llanos contributed several diagrams for the paper.\nThis article has been published as part ofBMC Public Health Volume 11\nSupplement 3, 2011: Technical inputs, enhancements and applications of the\nLives Saved Tool (LiST). The full contents of the supplement are available\nonline at http://www.biomedcentral.com/1471-2458/11?issue=S3.\nAuthors’ contributions\nWW developed many of the methods described here and wrote the first\ndraft of this article. JS revised the first draft extensively. RM has been\nresponsible for implementing these methods in the LiST computer program.\nCompeting interests\nThe authors have no competing interests.\nPublished: 13 April 2011\nReferences\n1. Stover J, McKinnon R, Winfrey B: Spectrum: a model platform for linking\nmaternal and child survival interventions with AIDS, family planning and\ndemographic projections. International Journal of Epidemiology2010, 39:\ni7-i10.\n2. Jones G, Steketee R, Black RE, Bhutta Z, Morris S: How many children\ndeaths can we prevent this year?Lancet 2003, 362:65-71.\n3. Darmstadt GL, Bhutta ZA, Cousens S, Adam T, Walker N, de Bernis L:\nEvidence-based, cost-effective interventions: how many newborns can\nwe save and at what cost?Lancet 2005, 365:977-988.\n4. Bhutta ZA, Ahmed T, Black RE, Cousens S, Dewey K, Giugliani E,et al: What\nworks? Interventions for maternal and child undernutrition and survival.\nLancet 2008, 372:972-989.\n5. Boschi-Pinto C, Young M, Black RE: The Child Health Epidemiology\nReference Group reviews of the effectiveness of interventions to reduce\nmaternal, neonatal and child mortality.International Journal of\nEpidemiology 2010, 39:i3-i6.\n6. Development and use of the lives saved tool (L:iST): A model to\nestimate the impact of scalingup interventions on maternal, neonatal\nand child mortality. In International Journal of EpidemiologySachdev HPS,\nHall A, Walker N 2010,39:S1.\n7. Guerra CA, Gikandi PW, Tatem AJ, Noor AM, Smith DL, et al: The Limits and\nIntensity of Plasmodium falciparum Transmission: Implications for\nMalaria Control and Elimination Worldwide.PLoS Medicine 5(2):e38.\n8. World Health Organization: Low Birthweight: Country, regional and global\nestimates. UNICEF, New York; 2004 [http://www.unicef.org/publications/\nindex_24840.html].\n9. Boschi-Pinto C, Lanata C, Black R: The Global Burden of Childhood\nDiarrhoea. In Maternal and Child Health: Global Challenges, Programs, and\nPolicies. Springer Publishers, Washington DC, USA;Ehiri, John 2009.\ndoi:10.1186/1471-2458-11-S3-S32\nCite this article as:Winfrey et al.: Methods used in the Lives Saved Tool\n(LiST). BMC Public Health 2011 11(Suppl 3):S32.\nSubmit your next manuscript to BioMed Central\nand take full advantage of: \n• Convenient online submission\n• Thorough peer review\n• No space constraints or color ﬁgure charges\n• Immediate publication on acceptance\n• Inclusion in PubMed, CAS, Scopus and Google Scholar\n• Research which is freely available for redistribution\nSubmit your manuscript at \nwww.biomedcentral.com/submit\nWinfrey et al. BMC Public Health2011, 11(Suppl 3):S32\nhttp://www.biomedcentral.com/1471-2458/11/S3/S32\nPage 11 of 11"
}