{
  "title": "Location Based Recommendation for Mobile Users Using Language Model and Skyline Query",
  "url": "https://openalex.org/W2152728889",
  "year": 2012,
  "authors": [
    {
      "id": "https://openalex.org/A2123891594",
      "name": "Pu Qiang",
      "affiliations": [
        "Chengdu University",
        "Laboratoire d'Informatique de Grenoble",
        "Université Joseph Fourier",
        "Université Grenoble Alpes",
        "Chengdu University of Information Technology"
      ]
    },
    {
      "id": "https://openalex.org/A30964063",
      "name": "Ahmed Lbath",
      "affiliations": [
        "Université Grenoble Alpes",
        "Université Joseph Fourier",
        "Laboratoire d'Informatique de Grenoble"
      ]
    },
    {
      "id": "https://openalex.org/A2629467299",
      "name": "Daqing He",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W386946596",
    "https://openalex.org/W2020263912",
    "https://openalex.org/W1506441597",
    "https://openalex.org/W2143369903",
    "https://openalex.org/W2170188482",
    "https://openalex.org/W2093390569",
    "https://openalex.org/W2114512077",
    "https://openalex.org/W2121612399",
    "https://openalex.org/W1978394996",
    "https://openalex.org/W2139896607",
    "https://openalex.org/W1987345418",
    "https://openalex.org/W2169213601",
    "https://openalex.org/W2049920566"
  ],
  "abstract": "Location based personalized recommendation has been introduced for the purpose of providing a mobile user with interesting information by distinguishing his preference and location. In most cases, mobile user usually does not provide all attributes of his preference or query. In extreme case, especially when mobile user is moving, he even does not provide any preference or query. Meanwhile, the recommendation system database also does not contain all attributes that can express what the user needs. In this paper, we design an effective location based recommendation system to provide the most possible interesting places to a user when he is moving, according to his implicit preference and physical moving location without the users providing his preference or query explicitly. We proposed two circle concepts, physical position circle that represents spatial area around the user and virtual preference circle that is a non-spatial area related to users interests. Those skyline query places in physical position circle which also match mobile users implicit preference in virtual preference circle will be recommended. Users implicit preference will be estimated under language modeling framework according to users historical visiting behaviors. Experiments show that our method is effective in recommending interesting places to mobile users. The main contribution of the paper comes from the combination of using skyline query and information retrieval to do an implicit location-based personalized recommendation without users providing explicit preference or query.",
  "full_text": "I.J. Information Technology and Computer Science, 2012, 10, 19-28 \nPublished Online September 2012 in MECS (http://www.mecs-press.org/) \nDOI: 10.5815/ijitcs.2012.10.02 \nCopyright © 2012 MECS                                          I.J. Information Technology and Computer Science, 2012, 10, 19-28 \nLocation Based Recommendation for Mobile \nUsers Using Language Model and Skyline Query \n \nQiang Pu1,2,3 \n1School of Information Science and Technology, Chengdu University, Chengdu, China \n2Key Lab of Pattern Recognition & Intelligent Information Processing, Chengdu University, Chengdu, China \nEmail: puqiang1116@gmail.com \n \nAhmed Lbath3 \n3Joseph Fourier University of Grenoble, LIG-MRIM, Grenoble, France \nEmail: ahmed.lbath@imag.fr \n \nDaqing He \nSchool of Information Sciences of University of Pittsburgh, Pittsburgh, USA \nEmail: dah44@pitt.edu \n \nAbstract— Location based personalized \nrecommendation has been introduced for the purpose of \nproviding a mobile user with interesting information by \ndistinguishing his preference and location. In most \ncases, mobile user usually does not provide all attributes \nof his preference or query. In extreme case, especially \nwhen mobile user is moving, he even does not provide \nany preference or query. Meanwhile, the \nrecommendation system database also does not contain \nall attributes that can exp ress what the user needs. In \nthis paper, we design an effective location based \nrecommendation system to provide the most possible \ninteresting places to a user when he is moving, \naccording to his implicit preference and physical \nmoving location without the user‟s providing his \npreference or query explicitly. We proposed two circle \nconcepts, physical position circle that represents spatial \narea around the user and virtual preference circle that is \na non -spatial area related to user‟s interests. Those \nskyline query places in physical position circle which \nalso match mobile user‟s implicit preference in virtual \npreference circle will be recommended. User‟s implicit \npreference will be estimated under language modeling \nframework according to user‟s historical visi ting \nbehaviors. Experiments show that our method is \neffective in recommending interesting places to mobile \nusers. The main contribution of the paper comes from \nthe combination of using skyline query and information \nretrieval to do an implicit location -based personalized \nrecommendation without user‟s providing explicit \npreference or query. \n \nIndex Terms — Location-Based Service, Mobile \nInformation Recommendation, Language Model, \nSkyline Query, Implicit Preference \n \nI. Introduction \nMobile-based applications have be en grown as the \ndevelopment of mobile computing and communication \ntechnologies [1]. Since mobile devices are designed \nspecifically for personal use, but having limited display \nsizes and processing power , we often need to select \ncarefully the appropriate informati on to be presented to \nmobile users. Information r ecommendation for mobile \nusers is currently an important research topic especially \nfor location-based services using skyline query [2, 3] or \nspatial-temporal query [4]. Mobile information \nrecommendation system is expect ed to provide more \nsuitable and personal services to mobile user and \novercome the shortages of mobile devices. \nMost of location based mobile recommendation \nsystems take into account mobile user current location \nas well as his preference by using skyline qu ery [2, 3]. \nSkyline query retrieves a set of interesting points from a \nlarge set of objects. For example, a hotel might be a \nskyline interesting for a tourist, if there is no othe r hotel \nwhich is nearer, cheaper than this one. The tourist can \nchoose the most promising hotel from the skyline. Here \nthe distance and price are the attributes of hotel which \nuser cares for.  \nSo user‟s preference can be represented as a series of \nattributes of an object, that is also to say, users \npreference of interest will be affected by different \ndynamic attributes of the restaurant. As more attributes \nof an object are added into skyline query calculation, it \nwill meet a time-consuming job [2]. Among all objects, \nif one or two objects are very strong compared to other \nobjects, or when the number of category attributes is \nsmall, the resulting skyline may consist of a small \nnumber of objects [3].  \nMany researches focus on finding better algorithms \nto improve the effectiveness of skyline query, \n20 Location Based Recommendation for Mobile Users Using Language Model and Skyline Query \nCopyright © 2012 MECS                                          I.J. Information Technology and Computer Science, 2012, 10, 19-28 \ndecreasing the calculation time [2, 3, 5, 6]. Because not \nall attributes that mobi le user needs are included in \ndatabase, to say nothing of the attributes that can not be \npresented by a value in database.  \nFor instance, a mobile user is on his way to travel in a \nChinese city in the morning. He is interested in the \nhistory of Qing dynasty, if there is a museum or temple \nor other places in which is exhibiting some pictures \nfrom Qing dynasty, maybe the user is more interested in \nthose places which have nearest distance to the user \nwith lowest price.  In this example, the attributes like \nprice and coordinates of the place is easy to be added \ninto database in advance, but adding the attribute of \nuser‟s interest of Qing dynasty as a value in database is \nnot easy. Usually, each user has so different preference \nthat no one database can include eve ry attribute of \nuser‟s preference. Obviously, if user‟s preference in not \nincluded completely as attributes of a place in database, \nthe place that may be the candidate interesting place \nshould not be recommended to the user.  \nAnother problem is, in most ca ses, mobile user \nusually does not provide all attributes of his pr eference \nor query. In extreme case , especially when mobile user \nis moving, he even would not like to provide any \npreference or query explicitly, or register himself in a \nservice system. For example, when a user goes a city on \nbusiness at first time without any schedule for tourism, \nhe will even not know where he wants to visit and how \nto provide an effective preference or query to get those \ninteresting places for him. How does it work for \ninformation recommendation system without user‟s \npreference? If the system can automatically deal with \nthe user‟s implicit preference without user‟s explicitly \nproviding preference or query, then recommend \neffectively some interesting places especial in the \ntypical case of when user is moving.  \nThe problems that mobile information \nrecommendation system meets mentioned above \nmotivates us to design an effective  location based \nmobile information recommendation system for mobile \nusers, providing the most possible interesting places to \nthe user when he is moving, according to his implicit \npreference and physical moving location without the \nuser‟s providing his preference or query explicitly. \nFirst, for the attributes that can not be included in \ndatabase, we keep it as a form of text. Borrowing the \nidea of mobile information retrieval that takes account \nof the location and behavior of the user to improve the \ngeographic relevance [7] of the information retrieved by \na mobile user , we assume that the place should own \nthree kinds of characters: (1) geographic feat ure like \ncoordinates, (2) simple attribute, like price, (3) related \ndocument, that means the text which describes the \ninformation about the place and could not be included \nas a value into database. The document will be \npreprocessed at semantic level in ord er to match the \nuser‟s interest. Section 4 will give its theoretic \nexplanation. \nAccording to the assumption, w e propose two circle \nconcepts. One is a physical position circle  that \nrepresents spatial area  around the user, formed by \ncharacters (1) and (2) if  using the skyline query to \ncalculate. The other is a virtual preference circle that is \na non-spatial area related to user‟s preference of \ninterests. A skyline query place in physical position \ncircle, if its semantic meaning of document matches \nmobile user ‟s implicit p reference in virtual preference \ncircle as well, the place will be recommended  as a \ncandidate of user‟s interest . The two kind s of circles \nrefer to the Fig. 1. \n \nFig. 1: Scenario of location based information recommendation according to two circles \n \nIn order to implement a real -time recommendation, \nsystem does some pre -processes offline before the \nvirtual preference circle calculation. The pre -process \nincludes user‟s implicit preference estimation that \nautomatically done by system as a series of important \nterms according to user‟s historical visiting behaviors  \n[8], and documents similarity matrix that reveals the \nrelationship of similarity among all documents which \nare responsible to describe the places. To save the time \nof documents similarity matrix calculation, we just \ncalculate the matrix for those documents that are most \nsimilar. We use semantic clustering method [9] to \n Location Based Recommendation for Mobile Users Using Language Model and Skyline Query 21 \nCopyright © 2012 MECS                                          I.J. Information Technology and Computer Science, 2012, 10, 19-28 \ncluster all documents of places, only selecting the \ncluster which is m ost similar to the user‟s preference to \ncalculate the matrix. Research results showed pseudo-\nrelevance feedback is very popular and used by almost \nall high -performing research systems  [10, 11]. If new \nfeatures are added to the initial query, the revised query \nwill search more relevant results on average when the \nrevised query re-runs. Automatic query expansion \nrequiring two rounds of retrieval and document analysis \nmakes it runs typically vastly 20 or more times slower \nfor some systems [10]. This slowdown prevents the \nadoption of automatic query expansion for real \ninformation recommendation systems. The similarity \nmatrix will be used for automatic query expansion [10] \nin order to get the real -time response time and retrieval \nresults in mobile environment.  \nSuch preprocess benefits the real -time process to \nform the virtual preference circle. We use the implicitly \nestimated user‟s query or explicit query if user provides \nto match content of each document in cluster, the \ndegree of similarity is calculated to determine whether \nthe documents from the most similar cluster is used to \nexpand the estimated user‟s query. Because the \ndocument similarity matrix has been already existed, \nthe process of query expansion is so fast that satisfies \nthe real-time information process requirement [10]. The \ntop ranked documents returned by information retrieval \nmethod are put into the virtual preference circle, marked \nby a number of each place to explain which place the \ndocument belongs to. \nFig. 1 gives a promising scenario of location -based \ninformation recommendation which tends to \nrecommend appropriate places based on the user‟s \nsituation and preferences  to the user even without his \nexplicit query, and shows the two circles in it. Now let \nus suppose that as a mobile user is moving from place A \nto place B, the bold line represents the user‟s trajectory  \nin Fig.  1. When he moves from A to cur rent location \nPM where is decided by GPS signal, suppose that most \nusers like the lowest price of a place, like entrance fee \nof a museum or dinner price. According to the attributes \nof place‟s coordinates and providing lowest price, our \nrecommendation system uses skyline query to calculate \nthe places in a physical position circle, with the center \nof user current location PM and a radius of a certain \ndistance the user can arrive in a short time, for example, \n1 km if user goes by foot. F rom Fig. 1, at the cur rent \nlocation PM, the places M1, R1, H1 are in the physical \nposition circle. M, R, H represents museum, restaurant, \nand hotel respectively. The virtual preference circle can \nbe formed using the method mentioned above, which \nconsider the user‟s preference a s circle center VM. We \nobserve that the documents of places M1, R1 are in this \ncircle to illustrate the two places match the user‟s \npreference better than those of other places. We can \nrecommend those places M1, R1 in the overlapping area \nbetween the two c ircles to mobile user when he is \nlocated on the place PM. When the user goes on moving \nfrom PM to PN, his virtual preference circle center also \nmoves to VN, in this case, the place H3 in the \noverlapping area is recommended to the user. Based on \nthis scenar io, we define system the Location -based \nRecommendation System based on Skyline Query and \nInformation Retrieval (LRS-SQIR)”. \nThis paper aims to make contributions on the \nfollowing aspects:  \n(1) User‟s preference or q uery automatic generation: \nmobile user is not compulsorily required to provide \nhis preference directly and explicitly. We propose \na method that is capable of learning user \npreferences in order to reduce the burden of user‟s \ninput. Even in the case of without user‟s providing \ndirectly preference or query, our system can form \npreference query for mobile users.  \n(2) Integrate effective language model of information \nretrieval into recommendation  system: We \nintegrate automatic query expansion based on \nrelevance model so that we find the virtual \npreference circle more accurately and effectively  \nin a real-time environment. The offline calculation \nof document similarity matrix reduces the time \nneeded for automatic query expansion , it provides \nalmost no delay at recommendation time. \n(3) We only use coordina tes and price as default \nattributes to save the time of the calculation of \nskyline query. As to other attributes that are not \neasy to be quantitated as a value, we use \ninformation retrieval method to rank the \ndocuments of each place. According to the flexi ble \nattributes match besides the geographic \ncoordinates, our system has ability to recommend \ndifferent type of places, like museum and hotel for \nmobile user when he is moving, as the normal \nskyline query just recommends one type of place, \nsuch as hotel only, for user at a calculation time. \nThe rest of this paper is organized as follows: In \nSection 2 we give some related works on mobile \ninformation recommendation and information retrieval. \nIn Section 3, we give an architecture of our LRS -SQIR \nsystem. Section  4 is the methodologies used in this \npaper. Section 5 is the experiments and analysis. In \nSection 6, we conclude and present future work. \n \nII. Related Work \nMany skyline query algorithms have been proposed \nfor different types of databases and different situatio ns. \nSkyline query is also used for information \nrecommendation system.  \nKodama et al. [3] also proposed a location based  \napproach to recommending restaurants to a mobile user, \nby taking into account  his current location and \npreferences. This approach showed a good \nrecommendation effects, but there is still at least two \nproblems in it. One problem is the skyline may contain \n22 Location Based Recommendation for Mobile Users Using Language Model and Skyline Query  \nCopyright © 2012 MECS                                          I.J. Information Technology and Computer Science, 2012, 10, 19-28 \na small number of objects when one or two objects are \nvery strong compared to other objects, or when the \nnumber of attributes is small [3]. Though they proposed \nthe second algorithm to solve this problem, it still needs \nthe interactivity with user and requires more time to \ncalculate the skyline query again. Another problem is it \ndealt with one type of object, like restaurant, in a \ncomputing time, furthermore, if some attributes of the \nobject are not in database, the approach can not find out \nthe object. We improve their appro ach by taking into \naccount the information retrieval in recommendation \nsystem. That is, we only take coordinates and price to \nfast calculate the skyline query. We will retrieve other \nattributes that may be not easy to input the relational \ndatabase by user query expansion. According to retrieve \nthe attributes similar to user‟s preference by information \nretrieval method, and reduce the constraints of skyline \nquery attributes, different type of places can be \nprovided by our system. \nKossmann et al.[12] presented an online algorithm to \nreturns the first skyline results immediately, allowing \nthe user to give preferences during the running time of \nthe algorithm so that the user can control what kind of \nresults are produced next. Their work foc used on the \nguide for skyline query from user interaction. The \ndifference is our work does not require user interaction, \nwe consider it is not convenient for mobile user to \ninteract with system especially when he is moving. This \nis why we tend to implicitl y estimate user‟s preference \nby using user‟s visiting history. Through preprocessing \nwork, our system can provide real -time \nrecommendation with a simple skyline query which \nonly takes into account the attributes of coordinates and \nprice of a place. \nUsing independent component analysis (ICA) [13], a \ndocument can be viewed as being generated based on an \ninteraction of a s et of independent hidden topics , thus \nan ICA model  in text data analysis can be used to \nseparate these independent hidden topics. With this \nunderstanding, Kolenda [14] used ICA to perform \ndocuments clustering in  the latent semantic space \naccording to each latent topic with an open source \ntoolkit. Pu et al. [9] employed ICA to cluster documents \nin latent semantic s pace, and estimated a relevance \nmodel using documents in activated semantic cluster. \nZhukov et al. [15] investigated applications of ICA and \nPCA for soft clustering and topic identification. PCA is \ngood at reducing the dimensionality of the data, while \nICA provides superior identification of the topics. \nLavrenko et al. [10] showed that by expending time \nfor calculating a set of affinity lists – cross-entropy H(M \n||D), for every document M in the collection during \nindexing, the time needed for automatic query \nexpansion can be reduced to the point where it provides \nalmost no delay at query time. The key point is that it‟s \nnot necessary to know the affinity between every pair of \ndocuments in the collection, they found that it is \nsufficient compute H(M ||D) for most similar documents \nand expect that the query QM will bring those \ndocuments to the top of the ranked list. The initial query \nQM is formed by representative words from document M. \nAfter using QM to retrieve a set of top -ranked \ndocuments, the affinity H(M ||D) is computed and stored \nas a documents similarity matrix. Our method borrowed \nthis idea of offline computing, the  difference is the \nmethod of selecting documents to compute the affinity. \nWe select the documents from a semantic cluster to \ncalculate the documents similarity matrix, because we \nbelieve that documents from the semantic cluster are \nmore similar to user que ry than those documents \ncoming from a pseudo query by representative words of \na document. \n \nIII. Architecture of LRS-SQIR \nThe architecture of LRS -SQIR we design contains \nthree main modules: preprocessing module, query \nprocessing module and visual module, s ee Fig. 2. There \nare two kind of database in this system, one database is \nthe traditional relational database in which the \ncoordinates of place and its price are stored. The other \nis the document of place corpus which has been indexed \nand some related documents similarity matrix has also \nbeen calculated.  \nAll system is divided into two kinds of calculations: \nonline and offline calculation. The offline calculation is \nmainly managed by the preprocessing module.  \n \nFig. 2: Architecture of LRS-SQIR system \n Location Based Recommendation for Mobile Users Using Language Model and Skyline Query 23 \nCopyright © 2012 MECS                                          I.J. Information Technology and Computer Science, 2012, 10, 19-28 \nThe outline  of workflow in Fig.  2 is described like \nthis: for the offline part, preprocessing module clusters \ndocuments in corpus using a semantic clustering \nmethod, then selects documents with high similarity \nscore in a cluster that is similar to user‟s preference t o \ncompute documents similarity matrix. The matrix and \nall documents index will be stored in database.  \nWhen a mobile user is using this system, the system \nwill online obtain his location coordinates by using GPS \nsignals. This coordinates will be put into s kyline query \nwith lowest price and the coordinates from database, \ngiven a certain Euclidean radius distance, the result of \nplaces are in the physical position circle, denoted as C1. \nMeanwhile, the system estimates user‟s preference or \nquery according to hi s visiting history records, this step \ncan be also done offline. If mobile user provides his \nquery, the user explicit query combing with the implicit \nuser‟s preference will be expanded in a real -time by \nusing language model based method. The real -time \nprocess is guaranteed by the documents similarity \nmatrix existed in database in advance. The result of \ndocuments which belongs to places is in the virtual \npreference circle, denoted as C2. The visual module is \nresponsible for recommending and visualizing the \nplaces in the shadowy area by calling Google map API. \n \nIV. Methodology \nGenerally we give the algorithm of how to \nrecommend information if the mobile user does not \nprovide his preference or query explicitly, see \nAlgorithm 1. \nIn Algorithm 1, we only input the syst em the \ndocuments collection of places, the database that stores \nthe coordinates and price of places, and user visiting \nhistory. The function form_query( u, h) generates \nautomatically user preference or query q according to \nuser‟s visiting history; the funct ion s_clustering(d) uses \nindependent component analysis based semantic \nclustering method to clustering the documents of places \nin collection into C clusters; the function dsm( C,q) \ncomputes the documents similarity matrix M; the \nfunction rqe(q, M) ranks the documents of places by the \nsimilarity score with comparing to user‟s preference \nmodel, using user‟s query expansion method, the \nranking results form a virtual reference circle VRC; the \nfunction skyline_query( l, p) will get the places that is \nnearest to user and provides the lowest price, the results \nof skyline query form a physical position circle PPC. If \nthe place or its document is in the overlapping area of \nthe two circles at the same time, it will be recommended \nvirtually to the user by calling GoogleAPI. \nAccording to the generic algorithm, we give the \nmethodologies used in this paper as follows: \n4.1 Estimation of query user preference or query \nmodel \nUser implicit query  may be represented by user‟s \nvisiting history behaviors, such as a list of terms and  \nweights associated with those terms, a list of visited \nURLs and a list of past search queries and pages clicked \nfor these search queries. We look each behavior as a \ndocument with a certain preference degree. We define \nmobile user‟s query  as function of in teresting \ndocuments and corresponding preference degree like  \n[16]: \n 11, ,   , , iiUserQuery f D g D g     \n       (1) \nwhere <Di, gi> denotes what preference degree gi is \nused by user to visit document Di. The preference \ndegree is defined like: gi = g(Di, Acti, U), 0≤ gi≤1, U \nrepresents user. Acti = (a1, a2, …, an), i = 1, 2, … , n, is \na user visiting activity vector, such as register \ninformation, browse -pages, browse -time, q uery terms, \ndownload pages, bookmarks and etc, each Acti has \ndifferent interest level ai according to empirical data, 0< \nai≤1.  \nAlgorithm 1 Process of LRS-SQIR \n1: \n2: \n3: \n4: \n5: \n6: \n7: \n8: \n9: \n10: \n11: \n12: \n13: \n14: \n15: \n16: \n17: \n18: \n19: \n20: \n21: \n22: \nFunction LRSQIR(u, h, d, db)  \n//u: mobile user \n//h: user‟s visiting history \n//d: documents of places in collection \n//db: store coordinates and price of places \nq ← form_query(u, h) \n//form query for user u by his h \nC ← s_clustering(d)  \n//semantic clustering for d \nM ← dsm(C, q) \n//get documents similarity matrix M \nVRC ← rqe(q, M) \n//get virtual reference circle VRC \nPPC ← skyline_query(l, p) \n//l: coordinates of place \n//p: price of place \n//get physical position circle PPC \nfor each place in VRC ∩ PPC \n       GoogleAPI(place,u)  \n//visually recommend place to user \nend for \n    end function \n \nWe calculate expe ctation of all activities: \n  iiE p a iAct\n, pi is the weight of activity i, \n1 1\nn\nii p  . \nFinally, the user query model is denoted as a vector \nspace model [17] as below: \n \n \n \n1\n121 1 1\n121 1 1\n12\n, , ,\n, , ,\n, , ,\nn\niii\nn n n\ni i i i i imi i i\nn n n\ni i i i i i i i imi i i\nm\nUserQuery g D\ng w g w g w\np a w p a w p a w\nu u u\n\n  \n  \n\n\n\n\n\n  \n  \n \n(2) \nwhere wim represents weight of term m in document i, \nwhich is calculated by tf-idf formula [17]. \n24 Location Based Recommendation for Mobile Users Using Language Model and Skyline Query  \nCopyright © 2012 MECS                                          I.J. Information Technology and Computer Science, 2012, 10, 19-28 \n \n   \n22\n1\nlog 0.01\nlog 0.01\nim m\nim\nn\nim mm\ntf N nw\ntf N n\n\n\n \n(3) \nwhere tfim is term frequency of term m in document i, \nN is the number of total documents, and nm is the \nnumber of document containing term m. \n4.2 Independent component analysis based \nsemantic clustering \nFor effectively computing the documents similarity \nmatrix, like in [10], we do not need to calculate the \nevery pair of documents in the collection. We are going \nto only computing the pair of documents that are most \nsimilar to user‟s implicit preference. In or der to find \nthese documents, we use independent component \nanalysis (ICA) [13] based semantic clustering method to \nclustering the documents of places in collection. ICA is \na suitable approach to semantic clustering for a set of \ndocuments [9, 13, 14], The ICA model in text data \nanalysis can be described as follows: \nX AS\n (4) \nwhere X is a term -document matrix that holds m \nobserved terms in each row with n document samples in \neach column, X={x1, x2, …, xn}, m is the same size of \nthe vocabulary. A is an unknown m×k mixing m atrix \nwith non -orthogonal transformation basis, and S is \nanother unknown matrix that holds k independent \ncomponents (latent topics) in each row and n document \nsamples in each co lumn. If we can derive the inverse \nmatrix A-1, then S = A-1X, usually denote the matrix A-1 \nas an unmixing matrix W, that is, W=A-1. \n12\n1 11 12 1\n2 21 22 2\n12\nn\nn\nn\nk k k kn\nC p p p\nC p p p\nC p p p\nx x x\n \nFig. 3: Semantic clustering matrix \n \nAccording to the matrix S, we can evolve a k×n \npartition matrix U(X) of the term-document matrix X in \nN\n. The matrix U(X) represents the partitioning into a \nnumber k of semantic clusters ( C1, C2,…, Ck), it can be \ndenoted as U=[uij], i=1, …, k, and j=1, …, n, where uij \nis the membership of do cument xj belonging to a \nsemantic cluster Ci. Fig. 3 shows that the element pij in \nsemantic clustering matrix U(X) represents document xj \nbelongs to semantic cluster Ci with a probability pij. \nWith the help of such a probability, a document xj could \nbe ass igned to a latent cluster Ci according to the \nhighest probability pij, as shown formally as \n | arg maxj i ij i\np C p x\n (5) \nAccording to equation (5), the clustering of \ndocuments therefore boils down to a clu ster label \nassignment to each document based on  the obtained \nmaximum probability in Fig. 3 matrix. \nThere are k clusters after semantic clustering on the \ndocuments collection. We only select the documents in \ncluster that is most similar to the user‟s implicit \npreference to compute the documents similari ty matrix. \nFormula (6) is a Kullback -Leibler (KL) divergence that \nmeasures the closeness between the two models and \ngives how to select this cluster by match the similarity \nbetween user‟s preference and cluster. \n     \n \n|\narg min | log |S\nSS\nQ\nQ S Q\nwV S\npw\nD p w pw\n\n   \n\n \n \n(6) \nwhere \nQ  is the a user‟s preference or query model, \nS  \nis the semantic cluster model which is estimated from a \nsemantic cluster. \nS  represents all the semantic clusters \nderived from ICA algori thm. The semantic cluster that \nhas the smallest KL divergence value to user‟s query \nwould be used for computing document similarity \nmatrix. The value of every pair of documents in the \nselected cluster is represented as the cross -entropy of \ntheir document language model [10], shown as follows. \n     || | log |\ni j i jd d d d\nw\nH p w p w   \n \n(7) \nwhere \nid , \njd  are document model of document di and \ndj. \n4.3 Retrieval with user query expansion \nRelevance models [18] compute the probability that \nthe word would appear during random sampling from \nsame distribution that produced the query.  Though \nautomatic query expansion can improve the retrieval \nresults, it is slow [10] that prevents it from ad option for \nreal retrieval systems, especially in mobile environment. \nAccording to [10], good retrieval performance can be \nachieved if we rank the documents D in the collection \nby the cross-entropy of their language model \nD with the \nestimated relevance model \nR : \n     || | log |R D R D\nw\nH p w p w   \n \n(8) \nBecause the summation goes over all vocabulary \nwords w in equation ( 8), running a query consisting of \nthousands of words is very inefficient and requires a lot \nof computational resources  [10]. If directly using \nequation (8) in our information recommendation system, \nit will meet a real-time problem. After transformation of \nthe equation (8), we get: \n \n     \n   \n1\n1\n||\nlog | | |\n|| |\nM\nM\nRD\nD M M k\nw\nM D M k\nH\np w p w p q q\nH p q q\n\n\n\n  \n  \n \n\n\n\n\n \n(9) \n Location Based Recommendation for Mobile Users Using Language Model and Skyline Query 25 \nCopyright © 2012 MECS                                          I.J. Information Technology and Computer Science, 2012, 10, 19-28 \nNotice that  \n ||MDH   in equation (9) is independent \nof the user's query and can be pre -computed and stored \nat the time when the collection is indexed [10]. We give \nthe algorithm for computing the documents similarity \nmatrix offline. We do only calculation the \n ||MDH   for \nthe pair of documents which is most similar to user‟s \npreference. Algorithm 2 gives the effective process of \ndocument similarity matrix calculation. \nAlgorithm 2 Document Similarity Matrix \n1: \n2: \n3: \n4: \n5: \n6: \n7: \n8: \n9: \n10: \n11: \n12: \n13: \n14: \n15: \n16: \n17: \n18: \n19: \n20: \n21: \nfunction DSM(d, q) \n//d: each document in collection \n//q: user‟s preference or query \n  M ← Ø                 //document similarity matrix \n  C ← ica(d)                         //semantic clustering \n  max ← 0             //maximum score of similarity \nfor each c in C \n     score ← sim(c, q)    \n//similarity between c and q \n     if score > max then \n         max ← score \n     end if \n  end for \n  c ← get_cluster(max) \n//get most similar cluster, c\n C \n  for each di, dj in c \n     mij ← H(di || dj) \n//cross-entropy calculation, mij\n M \n  end for \n  return M \nend function \n \nIn Algorithm 2, the function DSM( d,q) computes the \ndocument similarity matrix. M represents the resulting \ndocument similarity matrix. The function ica( d) makes \nsemantic clustering for all documents in collection, the \nsemantic clustering method r efers to [9, 14]. The \nfunction sim( c,q) computes the similarity between \nsemantic cluster c and user's query q using the formula \n(6). We select the most similar cluster by fun ction \nget_cluster(max) to calculate the cross -entropy H(di || dj) \nbetween documents in the cluster. Finally, we store the \nresult of document similarity matrix M. \nAccording to [10], we give the Algorithm 3 for \neffective query expansion for refining user‟s preference \nand rank documents of places according to its similarity \nto the user‟s information need. \nAlgorithm 3 Ranking With Query Expansion \n1: \n2: \n3: \n4: \n5: \n6: \n7: \n8: \n9: \n10: \n11: \nfunction RQE(Q, M) \n//Q: user‟s preference or query \n//M: document similarity matrix \nRankList ← Ø \n//array to store ranked documents \nTopK ← topk(Q) \n//get top-ranked K documents by Q \nSum ← Ø \n//array to store summation of cross-entropy \nfor each di in M \n       Sum[i] ← 0         //initialize summation for di \n12: \n13: \n14: \n15: \n16: \n17: \n18: \n19: \n     for each dj in TopK                          //1≤ j ≤ k \n          Sum[i] += mij * p(dj | Q) \n//ranking score of di \n       end for \nend for \n    RankList ← sort(Sum)   //sort by ranking score \n    return RankList \nend function \n \nIn Algorithm  3, the function RQE( Q,M) ranks the \ndocuments of places with  considering user query \nexpansion. Q is user‟s preference or query, Q = \n(q1,q2,…qk), M represents the resulting document \nsimilarity matrix. The function top( Q) uses basic \nlanguage model [19] to retrieve top -ranked K \ndocuments from collection by user‟s query Q. Line 13 \nis the implementation of Formula (9). The ranking score \nof document di is stored in Sum[i]. The calculation \nmethod of p(dj | Q) refers to [18]. The final rank list is \nsorted according ranking scores in descending order. \n4.4 Skyline query \nA skyline query is a query to select the set S of all the \nobjects such that are not dominated by other objects [2]. \nS is called the skyline and formally given as follows: \n   { |  ' ( ) '< o }S O o O o O o o     \n (10) \nThe „<‟ in equation (10) means dominance \nrelationship [3]. Given two objects O1 and O2, if O1 is \nequal to or better than O2 in terms of all attributes, and \nif O1 is better than O2 at least one attribute, we say O1 \ndominates O2, and write O1 < O2. \nIn our location based recommendation system, we \nalways want the places in order from the nearest  to \nfurther places. If a lot of attributes are added to \ncalculate the skyline, it is a time -consuming task. We \nonly take the attributes of price into account to \ndetermine the dominance relationship. \n \nSELECT *  \nFROM Etourism \nWHERE city = 'Chengdu‟ \nSKYLINE OF price MIN, distance MIN; \nFig. 4: Example of skyline query \n \nWe can use the skyline query [2] as Fig. 4 to form the \nphysical position circle in which the places are nearest \nto the user and provide the lowest price. \n \nV. Experimental Results and Analysis \nTo examine the effects of our location based \ninformation recommendation system, we des igned the \nfollowing experiments. We prepared the data for \nsimulating the environment at the first step. For the \ndistribution of different places in a city, like in Chengdu, \n26 Location Based Recommendation for Mobile Users Using Language Model and Skyline Query  \nCopyright © 2012 MECS                                          I.J. Information Technology and Computer Science, 2012, 10, 19-28 \nChina, we randomly generated coordinates in Great \nChengdu city area for 1000 places that represent hotels, \nrestaurants, museums and so on, the same dealing with \nprice of places was also done. We generated the virtual \ninformation because our target is to test if our method \nworks better or not, it is not important for places if we \nput a virtually generated on it. All the data were store in \nMySql database as Fig . 5 shows. When a skyline query \nlike Fig. 4 is acted on the data in Fig.  5, as a result, a \nphysical position circle will be formed in which the \nplaces are nearest to user as well as has lowest price. \n \nFig. 5: Random generation of places in Chengdu city \n \nFor forming virtual preference circle, we conducted \nexperiments on one TREC data set: Los Angeles Times \n(LA) with query topics 301 -400 except query 320 and \nquery 334 which have no re levant documents in the \njudged pool for the LA collection. Indri 2.9 system was \nused for indexing and retrieval. The collection and all \n98 queries were stemmed using Porter stemmer, and \nstop-words were removed as well. \nUsually, many experiments need to ver ify the \nrecommendation of place is right or not manually \nthrough a group of volunteers, according to their \npreference judgment. Suppose that we have documents \nof places, we can organize them into a collection and do \nthe indexing and retrieval. To save the time and avoid \nsome judgment errors happening due to the boring \nevaluation process, we decide to automatically judge if \nthe document of a place meets the user‟s preference or \nnot. So we used the relevant document in judged pool of \nLA collection as the docu ments that describe the \nattributes of places. For each place, we only assigned \nrelevant documents of one query to a place, and marked \nthe documents with the id of place. For example, we \nassigned documents d1…d20 of query 310 with id 974, \nthat means, the 20  documents are the documents of \nplace “MingTing Restaurant”, see Fig. 5.  \nThese relevant documents assigning to each place are \nunknown by users, if user‟s preference or query can \nretrieve some of the relevant documents, we think that \nthe place connecting t o the retrieved documents should \nbe in the virtual preference circle.  \nTo effectively use the relevant documents as standard \nof judgment, we used query topics 301 -400 for LA \ncollection as simulation of the user‟s preference or \nquery after estimation according to user visiting history.  \nThe implementation of ICA algorithm for documents \nsemantic clustering was from DTU: Toolbox [20]. After \nthen, the documents similarity matrix was calculated \nand stored. The document s are from a semantic cluster \nthat is most similar to the user‟s query. \nThe initial user query results were generated using \nthe basic query likelihood language model. Top 50 \ndocuments were used to do a query expansion. Table 1 \ngives the time comparisons of  query running and \ndocuments similarity matrix computing as well as the \naverage precision of retrieval by using queries 301 -400 \non collection LA among the basic language model (LM) \n[19], the relevance model with full in itial retrieved \nresults (LM-full) [18]as feedback for query expansion, \nthe fast relevance model (fRM) [10], the semantic \nrelevance model (SRM) [9] and the fast semantic \nrelevance m odel (fSRM). The data in columns LM, \nRM-full, fRm are directly from [10] for comparison.  \nFrom Table 1, we observe LM method is the fastest \none that only takes 7.6 seconds to fulfill 100 queries. \nfSRM method takes 11.75 seconds vs. fRM method‟s \n15.83 seconds for completing the whole 100 queries. \nFor fSR M method, a query only needs to 1/10 of a \nsecond to finish. The fast speed shows the three \nmethods are suitable for real -time retrieval task, like \nmobile information recommendation. Our fSRM \nmethod outperforms the other two, because it takes \nacceptable tim e to deal with the user‟s queries and \nretrieves more precise results. It gets average precision \n27.34% that is better than the RM -full method 27.19% \nand the LM method 24.58%. This comparison presents \nthat our fSRM retrieving information in a real time is a  \ngood choice for mobile information recommendation \nthat has ability to provide almost no delay at \nrecommendation time. \nThough RM-full method and SRM get higher average \nprecision, their retrieving time is also long, achieving \n611.43 seconds and 829.53 secon ds. The long retrieval \ntime is caused by the query expansion and document \ncontent process. SRM needs more time because it \nrequires another step for clustering the documents from \ntop N initial retrieved results. \nTable 1: Time comparison of query running and documents similarity \nmatrix computing on collection LA \n LM RM-\nfull fRM SRM fSRM \nAve Pr 0.2458 0.2719 0.2653 0.2958 0.2734 \ntime[s] 7.6 611.43 15.83 829.53 11.75 \nsims[h]   38.55  13.47 \n Location Based Recommendation for Mobile Users Using Language Model and Skyline Query 27 \nCopyright © 2012 MECS                                          I.J. Information Technology and Computer Science, 2012, 10, 19-28 \nThe LA collection required over 38 hours of time to \nbuild the document similarity matrix if using fRM \nmethod. If a collection will be indexed rarely and \nsearched often, this is a fine tradeoff. In other cases, the \nindexing time may be unacceptable [10]. For our mobile \nrecommendation system, we would like to use the real -\ntime query expansion in in formation retrieval area as \nwell as need less time to create the document similarity \nmatrix. Our fSRM method shows that it only needed \nalmost 1/3 of fRM building time for the matrix. We \nanalyze the reason of the amount of time reduction is \nwe use fewer doc uments for calculation the documents \nsimilarity matrix. fRM used all the top N documents \nwhile we just used some of top N documents in a \nsemantic cluster to calculate. One semantic cluster has \nat most N documents, normally, it has average number \nof N/3 doc uments in the semantic cluster that is most \nsimilar to user‟s preference or query. As we just take \ninto account the most similar documents to calculate, \nit‟s not strange using our fSRM method to building the \nmatrix during indexing time will be cut to a lar ge \ndegree when comparing to fRM method.  \nD Skyline \npoints \n2 \n3 \n4 \n5 \n6 \n60 \n783 \n4515 \n13022 \n20000 \n \n2 3 4 5 6\n0\n0.5\n1\n1.5\n2\nx 10\n4\nDimensions d\n# Skyline Points\n \nFig. 6: Skyline size \n \nThe mobile information recommendation system \nrequires a real-time response to user‟s query. This is the \nreason why we only took into acc ount two attributes of \na place, coordinates and price, to calculate the skyline \nquery, forming the physical position cycle. We \nexamined the skyline size and skyline query calculation \ntime to prove it is reasonable that we consider more \nthan 2 attributes us ing high effective information \nretrieval method. We also extended our dataset from \n1000 places to 20000 places as our test bed. The \nattributes are also increased from 2 to 6. \nFig. 6 shows the skyline size. When taking two \nattributes or dimensions of a plac e into computing, we \ngot 60 skyline points there. As attributes increased to 3, \nthere are totally 783 skyline points, 11 times than that of \nusing dimension 2. As the attributes achieved to 6, all \nthe places in dataset became the skyline points. An \nincreasing number of skyline points are involved in \nrecommendation system, the user faces a second or \nthird round to decide what place is his really interesting \nplace. \nd Times [s] \n2 \n3 \n4 \n5 \n2 \n37 \n94 \n203 \n \n2 3 4 5\n0\n50\n100\n150\n200\nDimensions d\nTime [s]\n \nFig. 7: Running time using BNL-basic algorithm \n \nFig. 7 gives the skyline query running time using the \nBNL-basic algorithm [2]. We observed the running time \nwill increase explosively as the dimension increases. If \nwe choose 4 attribu tes to compute the skyline query, it \nwill cost us 94 seconds to get more than  4500 skyline \npoints. Considering the response time, it is obviously \nnot good for mobile information recommendation \nsystem. If using our method in this paper, the effective \ninformation retrieval method saved a large amount of \ntime to deal with the attributes that will take too much \ntime and bring a lot of skyline results in skyline query. \nAccording to the experiments, our mobile information \nrecommendation system can response a user ‟s query in \n2 seconds. \n \nVI. Conclusion \nIn this paper, we present ed a mobile information \nrecommendation system  to provide interesting places, \nsuch as restaurants , hotels, museums and so on to \nmobile users without their explicitly providing his \npreference or que ry. Our method is capable of learning \nuser preferences  and forming user query according to \nhis visiting history. We integrate d automatic query \nexpansion based on relevance model so that we can find \nthe virtual preference circle more accurately and \neffectively in a real -time environment . The offline \ncalculation of document similarity matrix according to \nsemantic cluster reduced the time needed for automatic \nquery expa nsion it provides almost no delay at \nrecommendation time. With the help of information \nretrieval method to make use of the attributes that can \nnot be added in relational database, we used a simple \nskyline query with only two attributes of coordinates \nand price to save the time of the calculation of skyline \nquery. Our main contribution is to combi ne skyline \nquery and information retrieval method together to form \ntwo kinds of circles that a user physically or virtually \nlocated in. This combination makes our location based \ninformation recommendation system work better. \n \nAcknowledgments \nThis work was partially supported by European \nCommission in Sustainable e -Tourism: Erasmus \n28 Location Based Recommendation for Mobile Users Using Language Model and Skyline Query  \nCopyright © 2012 MECS                                          I.J. Information Technology and Computer Science, 2012, 10, 19-28 \nMundus Action 2 Program, Science & Technology \nFoundation of Chengdu University under Grant No. \n2011XJZ01, Science & Technology Project of Sichuan, \nChina under Grant No. 2010SZ0004  and NSF under \nNSF/IIS 0704628. \n \nReferences \n[1] Lbath, A. Method and Device for Automatic \nProduction of Context Aware  Mobile Services. \nPat. N°  WO 006721, 2005. \nhttp://patentscope.wipo.int/search/en/WO2007006\n721. \n[2] Bö rzsö nyi, S., Kossmann, D., and Stocker, K. The \nskyline operator. in Proceedings of the 17th \nInternational Conference on Data Engineering. \n2001. Heidelberg, Germany. \n[3] Kodama, K., et al. Skyline Queries Based on User \nLocations and Preferences for Making Location -\nBased Recommendations. in ACM LBSN'09. 2009. \nSeattle, WA, USA. \n[4] Boulmakoul, A., L. Karim, and A. Lbath, Moving \nObject Trajectories Meta -Model And Spatio -\nTemporal Queries. International Journal of \nDatabase Management Systems (IJDMS). 2012. \n4(2)  \n[5] Huang, Z., et al. Skyline queries  against mobile \nlightweight devices in MANETs. in ICDE'06. 2006. \n[6] Huang, X. and C.S. Jensen. In -Route Skyline \nQuerying for Location -Based Services. in LNCS \n3428. 2005. \n[7] Raper, J., Geographic relevance. Journal of \nDocumentation, 2007. 63(6): p. 836-852. \n[8] Kuo, M. -H., Chen, L. -C. , and Liang, C. -W. \nBuilding  and Evaluating a Location-Based Service \nRecommendation System with  a  Preference  \nAdjustment  Mechanism. Expert Systems with \nApplications, 2009. 36: p. 3543–3554. \n[9] Pu, Q. and He, D. Semantic c lustering based \nrelevance language model. Information \nTechnology Journal, 2009. 9(2): p. 236-246. \n[10] Lavrenko, V. and Allan, J. Realtime query \nexpansion in relevance models. in IR 473. 2006. \nUniversity of Massachusetts. \n[11] Kurland, O., Lee, L., and Domshlak, C. Better than \nthe real thing? Iterative pseudo -query processing \nusing cluster-based language models, in Proc. 28th \nACM SIGIR conference on Research and \nDevelopment in Information Retrieval. 2005: \nAugust 15-19. p. 19-26. \n[12] Kossmann, D., Ramsak, F ., and Rost, S. Shooting \nStars in the Sky: An Online Algorithm for Skyline \nQueries. in Proceedings of the 28th VLDB \nConference. 2002. HongKong, China. \n[13] Hyvä rinen, A., Survey on independent component \nanalysis, in Neural Computing Surveys 2. 1999. p. \n94-128. \n[14] Kolenda, T., Clustering text using independent \ncomponent analysis. 2002, Inst. of Informatics and \nMathematical Modeling, Tech. University of \nDenmark. \n[15] Zhukov, L. and Gleich, D. Topic indentification in \nsoft clustering using PCA and ICA, in Te chnical \nreport. 2004, Yahoo Research Labs. \n[16] Pu, Q., et al., Information recommendation using \nimproved feature selection and independent \ncomponent analysis. Journal of Computational \nInformation Systems, 2007. Vol. 3(4): p. 1731 -\n1738. \n[17] Salton, G., an d Buckley, B. Term -weighting \napproaches in automatic text retrieval. Information \nProcessing and Management, 1988. 24: p. 513 -523. \n[18] Lavrenko, V., and Croft, W.B. Relevance -based \nlanguage models, in Proc. 24th ACM SIGIR \nconference on Research and Develop ment in \nInformation Retrieval. 2001: New Orleans, LA, \nUSA. p. 120-127. \n[19] Ponte, J., and Croft, W.B. A language modeling \napproach to information retrieval. in Proc. 21st \nACM SIGIR conference on Research and \nDevelopment in Information R etrieval. 1998. \nMelbourne, Australia. \n[20] Kolenda, T., et al., Dtu:toolbox, in \nhttp://isp.imm.dtu.dk /toolbox/. 2002: Internet site, \nInformatics and Mathematical Modeling, \nTechnical University of Denmark. \n \n \nQiang Pu: Associate Professor of School of \nInformation Science and Technology in Chengdu \nUniversity, main researcher in Key Lab of Pattern \nRecognition and Intelligent Information Processing in \nChengdu University. He is now a Post-doctor in Joseph \nFourier Universi ty, Grenoble 1, France. H is current \nresearch focuses on pattern recognition, information \nretrieval, location based service and mobile tourism. \n \nAhmed Lbath: Professor of Joseph Fourier University \nof Grenoble , he is interested  in GIS, location based \nservice and mobile tourism. \n \nDaqing He:  Associate professor of school of \ninformation sciences in University of Pittsburgh, USA. \nHis current research is cross-language information \nretrieval, machine translation. ",
  "topic": "Computer science",
  "concepts": [
    {
      "name": "Computer science",
      "score": 0.9300553798675537
    },
    {
      "name": "Skyline",
      "score": 0.8954256772994995
    },
    {
      "name": "Information retrieval",
      "score": 0.46197474002838135
    },
    {
      "name": "World Wide Web",
      "score": 0.3605028986930847
    },
    {
      "name": "Data mining",
      "score": 0.24205690622329712
    }
  ]
}