{
  "title": "Efficient parametric identification method for high voltage pulse transformers",
  "url": "https://openalex.org/W2160083713",
  "year": 2013,
  "authors": [
    {
      "id": "https://openalex.org/A5040886230",
      "name": "Sylvain Candolfi",
      "affiliations": [
        "Université Laval"
      ]
    },
    {
      "id": "https://openalex.org/A5049434827",
      "name": "Davide Aguglia",
      "affiliations": [
        "European Organization for Nuclear Research"
      ]
    },
    {
      "id": "https://openalex.org/A5087204545",
      "name": "P. Viarouge",
      "affiliations": [
        "Université Laval"
      ]
    },
    {
      "id": "https://openalex.org/A5059523878",
      "name": "J. Cros",
      "affiliations": [
        "Université Laval"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2012156922",
    "https://openalex.org/W2166321866",
    "https://openalex.org/W2127550738"
  ],
  "abstract": "This paper presents a new identification method for a pulse transformer equivalent circuit. It is based on an analytical approximation of the frequency-domain impedance data derived from a no-load test with open-circuited secondary winding and only requires measurements of primary current and voltage without phase data. Compared with time consuming and complex methods based on off-line non-linear identification procedures, this simple method also gives an estimation of the error on the identified parameters. The method is validated on an existing pulse transformer.",
  "full_text": "CERN-ACC-2014-0347\n17/12/2014\n \n \nCERN-ACC-2014-0347  \nDavide.Aguglia@cern.ch   \n \n \n \n \nEfficient Parametric Identification Method \nfor High Voltage Pulse Transformers \n \n \n \n \nD. Aguglia \nCERN, Geneva, Switzerland \n \nS. Candolfi, P. Viarouge, J. Cros \nLEEPCI Lab., Quebec, Canada \n \n \n \nKeywords: High Voltage Pulse Transformers \nAbstract \nThis paper presents a new identification method for a pulse transformer equivalent circuit. It is based \non an analytical approximation of the frequency -domain impedance data derived fr om a no -load test \nwith open -circuited secondary winding and only requires measurements of primary current and \nvoltage without phase data. Compared with time consuming and complex methods based on off -line \nnon-linear identification procedures, this simple m ethod also gives an estimation of the error on the  \nidentified parameters. The method is validated on an existing pulse transformer. \n \n \n \nPresented at: IEEE pulsed power and plasma science conference (PPPS),  \nSan Francisco, USA, June 2013 \n \n \nGeneva, Switzerland \nNovember, 2014 \n\nEfﬁcient Parametric Identiﬁcation Method for High\nV oltage Pulse Transformers\nSylvain Candolﬁ 1, Member, IEEE, Davide Aguglia 2, Member, IEEE,\nPhilippe Viarouge1, Member, IEEE, J ´erˆome Cros1, Member, IEEE\n1LEEPCI Lab., Electrical and Computer Eng. Dept., Laval University, G1V 0A6 Quebec (QC), Canada\nEmails: sylvain.candolﬁ.1@ulaval.ca, philippe.viarouge@gel.ulaval.ca, jerome.cros@gel.ulaval.ca\n2CERN - European Organization for Nuclear Research, Technology Dept., Electric Power Converter Group\nCH-1211 Geneva 23, Switzerland Email: davide.aguglia@cern.ch\nAbstract—This paper presents a new identiﬁcation method for\na pulse transformer equivalent circuit. It is based on a analytical\napproximation of the frequency-domain impedance data derived\nfrom a no-load test with open-circuited secondary winding and\nonly requires measurements of primary current and voltage\nwithout phase data. Compared with time consuming and complex\nmethods based on off-line non-linear identiﬁcation procedures,\nthis simple method also gives an estimation of the error on the\nidentiﬁed parameters. The method is validated on an existing\npulse transformer.\nI. I NTRODUCTION\nKlystrons tubes are high-frequency and high-power ampli-\nﬁers widely used in particle accelerators. In order to avoid\nthe overheating of the tubes and waste of energy, klystrons are\nsupplied with pulsed electrical power by modulators. Classical\nlong pulse modulators are made of a capacitor bank, solid-state\nswitches and a monolithic pulse transformer. The capacitor\nbank is constantly charged to smooth the power ﬂuctuations\non the electrical network side and quickly discharged through\nthe pulse transformer. The pulse transformer adapts the voltage\nto the speciﬁcation of the klystron and allows the use of\nlow voltage solid-state switches on the primary side. The\noutput pulse shape is very important for the performance of\nthe klystron operation. The real pulse shape differs from an\nideal one by its rising and falling times, overshoot and ﬂat-\ntop stability. The electrical equivalent circuit parameters of the\npulse transformer are very important for the modulator design\nand control process. The standard electrical equivalent circuit\ninclude the windings resistances, the magnetizing and leakage\ninductance and three lumped capacitances. The value of the\nelements of the equivalent circuit parameters are usually pre-\ndicted during the design process with analytical relations or by\nusing FEA techniques [2]. Non-linear identiﬁcation techniques\nand speciﬁc tests in the frequency domain are also carried out\nto measure these parameters on pulse transformers [3], but\nthese identiﬁcation methods usually require several tests and\ncomplex identiﬁcation procedures which deliver no speciﬁc\nestimation of the precision on the equivalent circuit elements.\nThe new identiﬁcation method presented in this paper\nonly requires a simple treatment of the frequency domain\nimpedance measurements derived from a tranformer no-load\ntest with open secondary winding. These data are analyzed\nto select four speciﬁc frequencies and their related impedance\nvalues. All transformer equivalent circuit parameters can be\nderived from analytic approximations of these characteristic\nimpedance values except the primary winding capacitance.\nThis capacitance cannot be determined because it is small\ncompared to the other capacitances, but this parameter is not\ncritical for the modulator design. The parameter identiﬁcation\nerrors are related to the instrumentation precision and to\nthe approximation of the method itself. This error can be\nestimated and quantiﬁed for a range of typical transformers.\nThe equivalent circuit is used during the design process and\nequivalent circuit referred to primary is used to demonstrate\nthe identiﬁcation method. It is demonstrated that those circuits\nare equivalent under some conditions between the parameters\nof both circuits. Some relations between the characteristic\nimpedance and response to a pulse is established. Finally a case\nstudy is presented on an existing transformer. The equivalent\nmodel of the transformer is deduced from a frequency-domain\nidentiﬁcation. The time-response to a pulse of the transformer\nand of the equivalent model are compared.\nII. E QUIVALENT PULSE TRANSFORMER MODEL\nThe standard equivalent circuit [4] of pulse transformers is\nmade of one magnetizing inductance, two leakage inductances,\nthe resistances of the primary and secondary windings and\nthree lumped capacitances (Fig. 1). Primary and secondary\nwindings are both connected to ground. The capacitances take\ninto account the energy stored in the electrical ﬁeld and they\nhave an important inﬂuence on the dynamic performance of the\ntransformer. The values of the capacitances referred to primary\nside are derived by equaling the electrostatic energy of the\nequivalent circuit and equivalent circuit referred to primary [3].\nThe values of the capacitances referred to primary side are\nderived by equaling the electrostatic energy of the equivalent\ncircuit and equivalent circuit referred to primary [3].\nC11V2\n1 + C12(V2 −V1)2 + C22V2\n2 =\nC′\n11V2\n1 + C′\n12(aV2 −V1)2 + C′\n22(aV2)2 (1)\nBecause this relation must be true for any voltage V1 and V2,\none can determine the equivalent capacitances referred to the\nprimary side.\nR1 R2Ls/2 Ls/2\nLmC’11\nC’22\nC’12\nR1 R2Ls/2 Ls/2\nLmC11 C22\nC12\nA)\nB)\nzΔ2 \nz’12=1/(jωC’12)\nz’22=\n1/(jωC’22)\nV’1\nV’2 z’L\nC)\nzY1 zY3 zY2 \nzΔ1 zΔ3 z’c\nFig. 1. A) Equivalent circuit B) Equivalent circuit referred to primary C)\nCircuit resulting of the Y- ∆ transform\nC′\n11 = C11 + C12\na−1\na (2)\nC′\n22 = C22\na2 + C12\n1 −a\na2 (3)\nC′\n12 = C12\na (4)\nThese equivalence lead to four observations:\n• In the equivalent circuit, when both winding are sup-\nplied with their rated voltage, the voltage across C12\nterminals is much higher than the voltage across C′\n12\nterminals for the same operation point. The energy\nstored in C12 is distributed in the capacitances C11,\nC′\n12 and C22 of the equivalent circuit referred to the\nprimary side.\n• Naturally C′\n12 <C ′\n22 if a< 1\n2 . This condition on the\ncapacitance is mandatory for using the identiﬁcation\nmethod.\n• The secondary capacitance value referred to primary\nis ampliﬁed for a step-up transformer.\n• the primary capacitance can be negative if the trans-\nformer ratio a is small. This characteristic illustrates\nthe limit of the standard circuit modelling of the trans-\nformer but the equivalent circuit referred to primary\nmust be considered as an equivalent mathematical\nrepresentation of the transformer only.\nBy using these equivalent capacitances, one can obtain identi-\ncal transfer functions v2\nv1\nand characteristic impedances v1\ni1\nfor\nthe equivalent circuit itself and its representation referred to\nthe primary side. The demonstration can be greatly simpliﬁed\nby using a Y- ∆ transformation on the equivalent circuit of\nthe pulse transformer. The elements zY1,zY2 and zY3 are\ntransformed to z∆1,z∆2 and z∆3 ( Fig. 1). Because z∆1 is in\nparallel with V1, it is not used for the evaluation of the transfer\nTABLE I. E XPRESSION OF THE FREQUENCIES IN FUNCTION OF THE\nPARAMETERS\nFrequency Expression\nf0\nR1\n2πLm\nf1 1\n2π\n√\nLmC′\n22\nf2 1\n2π\n√\nLsC′\n22\nf3 1\n2π\n√\nLsC′\n12\nfunction V1\nV′\n2\n. z∆3 is placed in parallel with the impedance of\nthe load z′\nL to give the equivalent impedance z′\nc.\nThe transfer functions of the equivalent circuit and the\nequivalent circuit referred to the primary side can now be\nestablished:\nV1\nV′\n2\n= z′\n12z∆2 + z′\n22z′\n12 + z′\n22z∆2\nz′\n22z′\n12 + z′\n22z∆2\n(5)\nV1\nV2\n= z12z∆2 + z22z∆2 + a2z12z22\nz22z∆2 + az22z12\n(6)\nThe impedances involving the capacitance of the transformer\nare replaced with their expression and the capacitances referred\nto primary are expressed from the capacitances of the equiva-\nlent circuit (eq. 2 to 4).\nFor both circuits the same transfer function is obtained.\nV1\nV′\n2\n= V1\naV2\n= jωz∆2zc(C22 + C12) + z∆2 + a2zc\nz∆2zcjωC12 + azc\n(7)\nFor the transfer functions to be equal, the electrostatic energy\nbetween the equivalent circuit and equivalent circuit referred\nto primary must be equal (eq. 1).\nThe equivalence of the characteristic impedance between\nthe circuits is demonstrated with the help of this last result.\nThe energy in the circuit is the sum of the magnetic, electric\nand thermally dissipated energy. Secondary voltage being\ndetermined by the same transfer function for an identical\nprimary voltage, the total energy is the same in both circuits\n(eq. 1). Consequently the consumed power are identical.\nP = dE\ndt = V1i1 = V1i′\n1 (8)\nPrimary voltages are the same for both circuits therefore\ncurrents i1 and i′\n1 are identical (eq. 8). It follows that the\nimpedances are equal.\nIII. I MPEDANCE ANALYSIS OF THE EQUIVALENT MODEL\nThe modulus of impedance Z is expressed in dBΩ, de-\nﬁned as dBΩ = 20 log(|Z|). The impedance v.s. log(f) of\nindividual resistance, inductance or capacitance in function of\nthe frequency are represented by straight lines. The impedance\nof a typical pulse transformer (table II) is presented as well\nas the impedance of its elements referred to the primary side\n(Fig. 3). During a frequency sweep, each range of frequency\nsequentially approximates the impedance of one element.\nThis method only requires measurement of the current and\nvoltage modulus regardless to the phase. The requirements on\ninstrumentation is less severe. When the difference of modulus\nbetween two impedances is large, the resulting impedance is\n10\n−2\n10\n0\n10\n2\n10\n4\n10\n6\n10\n8\n−20\n0\n20\n40\n60\n80\n100\nfrequency [Hz]\nGain [dBΩ ]\nf0 f1 f2 f3\n20log(R1)\n20log(ωLs)\n20log( 1\nωC′\n22\n)\n20log( 1\nωC′\n11\n)\n20log( 1\nωC′\n12\n)\n20log(ωLm)\nP1\n20log(R1 + R2)\nP3 P4 P5\nP2\nFig. 2. Modulus of the characteristic impedance of the typical pulsed\ntransformer referred to the primary (red) and impedance of the elements\nindividually (blue)\naround the bigger one if they are in series or the smallest one if\nthey are in parallel. The resonances and anti-resonances occur\nwhen the modulus of impedance of two speciﬁc elements are\nequal. The expression of those frequencies is listed in Table I.\nBelow f0 (Fig. 2) the capacitance can be considered\nas open circuits and inductances like short-circuits. The\nimpedance is dominated by the primary winding resistance\nonly. The primary winding resistance can be derived from\na simple DC test. Above the frequency f0, the magnetizing\nimpedance modulus increases with frequency and becomes\nlarger than the resistance of the primary winding which can be\nthen neglected. The measured impedance is approximately the\nmagnetizing impedance. At the frequency f1 the magnetizing\ninductance and the secondary winding capacitance make a\nparallel resonance. Above this frequency the impedance mod-\nulus of the secondary winding capacitance becomes smaller\nthan the impedance modulus of the magnetizing impedance.\nThe capacitance is in parallel with the inductance therefore\nthe inductance is neglected above f1. At the frequency f2\nthe leakage inductance and the secondary winding capacitance\nanti-resonate in series. The resulting impedance is the sum of\nthe winding resistances because inductance and capacitance\nimpedances are in phase-opposition. Above this frequency the\nimpedance modulus of the leakage inductance becomes larger\nthan the secondary winding impedance which can be consid-\nered as a short-circuit. Finally at the frequency f3 the leakage\ninductance resonates with the inter-winding capacitance C′\n12.\nAbove this frequency the impedance of the transformer is\napproximately equal to the impedance of the inter-windings\ncapacitance if the primary capacitance is negligible. The order\nof the frequencies determines the shape of the impedance\nvs frequency characteristic. Some speciﬁc conditions on the\ntransformer parameters are necessary to validate the method\nproposed in this paper.\n• The magnetizing inductance must be greater than the\nleakage inductance: Lm >Ls\n• The secondary winding capacitance must be bigger\nR1 R2Ls/2 Ls/2\nLmC’11 C’22\nC’12\nR1 R2Ls/2 Ls/2\nLmC’11 C’22\nC’12\nR1 R2Ls/2 Ls/2\nLmC’11\nC’22\nC’12\n0 < f < f1\nf1 < f < f3\nf3 < f \nFig. 3. Consecutive RL, RLC and C circuits in bolt approximating the\nimpedance for each range of frequency.\nTABLE II. T YPICAL VALUE OF THE PARAMETERS OF A 800 µS PULSE\nTRANSFORMER WITH A SECONDARY VOLTAGE OF 110 KV\nParameter Typical value Unit\nR1 1 Ω\nR2 1 Ω\nLs 200 µH\nLm 0.6 H\nC′\n11 10 pF\nC′\n22 10 µF\nC′\n12 1 nF\nthan the inter-winding one referred to primary:\nC′\n22 >C ′\n12.\nThe ﬁrst condition is veriﬁed as the permeability of mag-\nnetic core is very high compared to air. The second condition\nis true on transformers with a transforming ratio smaller than\n1\n2 (eq. 3 and 4).\nIV. P ROPOSED IDENTIFICATION METHODOLOGY\nThe identiﬁcation method follows 7 steps:\n1) Measurement of the characteristic impedance of the\ntransformer with no-load from the primary.\n2) Measurement of the resonant and cut-off frequencies.\n3) Computation of the logarithmic average (mid. point)\nbetween two consecutive frequencies.\n4) Measurement of the impedance at the computed fre-\nquencies, highest possible frequency and DC.\n5) The impedances measured at these frequencies cor-\nrespond to the impedances of the elements of the\nequivalent model (Table III).\n6) The parameters referred to primary are retrieved from\nthe impedances.\n7) Estimation of the error from analysis of the plots\n(section VI).\nTABLE III. F REQUENCY AND CORRESPONDING MEASURED ELEMENT\nPoint Frequency f Impedance measured\nP1 Continuous R1\nP2 10\nLogf0+Logf1\n2 2πf(Lm+ Ls\n2 )\nP3 10\nLogf1+Logf2\n2\nC′\n22\n2πf\nP4 f2 R1 + R2\nP5 10\nLogf2+Logf3\n2 2πfLs\nP6 10f3\nC′\n12\n2πf\nV. T IME -DOMAIN ILLUSTRATION OF THE PROPOSED\nMETHOD VALIDITY RANGE\nThree poles and one zero have been identiﬁed in the\ncharacteristic impedance of a pulse transformer. These poles\nand zero can be related to the step-response of the transformer\nrepresented by its equivalent circuit. In the same way of the\nanalytic approximation of the impedance, the impulse response\nwithout load is approximated by considering two circuits\napproximating the real one in order to handle only circuits of\nthe 2 nd order or less. A resistive load would mainly damp the\nresponse of the transformer. The ﬁrst circuit (Fig. 4 A) is made\nof the capacitance, leakage inductance and winding resistances.\nOnly the magnetizing inductance is neglected which only has\ninﬂuence at low frequency like the characteristic impedance\ndemonstrates. The magnetizing inductance can be neglected at\nthe beginning of the pulse. Its transient response to an impulse\nis the response of a serie (R1 + R2)Ls(C′\n22 + C′\n12) circuit. In\nthe under damped case the frequency of oscillation fd is:\n2πfd =\n√\nω2\n0 −α2 (9)\nwith\nω0 = 1√\nLs(C′\n22 + C′\n12)\n(10)\nα = (R1 + R2)\n2Ls\n(11)\nNeglecting α in front of ω0 we have a relation between the\nfrequencies f2 and f3 of the impedance and the frequency of\nthe oscillation.\nf2\nd = 1\n1\nf2\n2\n+ 1\nf2\n3\n(12)\nThe amplitude of the oscillation is given by the initial\ncondition. At t=0 the output voltage is given by the tension\nof the capacitive voltage divider formed of the capacitance\nC′\n12 and C′\n22. The ratio C′\n22\nC′\n12\n= f3\nf2\n2\ndetermine the amplitude\nof the oscillation. If it is bigger than 1 then f3 >>f2 and the\namplitude is small. The condition on the capacitance for the\napplication of the identiﬁcation method is fulﬁll the amplitude\nof oscillation in the step-response is low.\nThe second circuit (Fig. 4 B) constituted of the inductances\nand resistances approximates the response of the transformer\nafter a time t >> α−1 when the ripple is damped. The\ncapacitance are neglected as they have no inﬂuence at low\nfrequency. The step-response is an exponential decay with a\ntime constant τ related to the frequency f0.\nτ = 1\nf0\n(13)\nR1 R2Ls/2 Ls/2\nLmC’11 C’22\nC’12\nA)\nB)\nR1 R2Ls/2 Ls/2\nLmC’11 C’22\nC’12\nFig. 4. Circuits used for the approximation of the time-response of the\ntransformer in the beginning of the pulse A) and at the end of the pulse B)\nVI. A PRIORY ERROR ESTIMATION ON IDENTIFIED\nPARAMETERS\nThe error between the measurement and the real equivalent\nparameter assuming the instruments have no uncertainty is\nevaluated with simulations. The error is presented in function\nof the frequencies in order to provide a direct link with\nthe measured characteristic impedance. The error is mostly\ndependent on the two frequencies adjacent to the measurement\npoint which include three parameters. The error in function\nof two variable parameters is computed, the third parameters\nis ﬁxed and the others take the value of a typical pulse\ntransformer (Table II). The values of the parameters are\ntransformed into the frequencies (Table I). The third parameter\nis set to a new value and the error in function of the two other\nparameters is computed again. For each set of frequencies two\nerrors are computed and the largest is retained to plot the graph\nand the bounds of the third parameter are always speciﬁed.\nA. Magnetizing inductance\nThe magnetizing impedance is measured between the fre-\nquencies f0 and f1. The closer those two frequencies are,\nthe bigger the error will be (Fig. 5 b)). The case where\nf0 = f1 is the lower right limit of the plot. If there is\nmore than two decades between the frequencies f0 and f1\nthe error on the inductance is less than 10 %. In all the cases\npresented the inductance is overestimated due to the proximity\nof the resonance with the secondary capacitance and to the\nprimary winding resistance which increase the impedance at\nthe measurement point. The upper left bound on the chart\nis due to the frequency f2 becoming higher than f3. The\nfrequencies f2 and f3 have little inﬂuence on the error on\nLm as they do not inﬂuence the value of the characteristic\nimpedance between f0 and f1 (Fig. 5 a)).\nB. Capacitance C′\n22\nThe error on the secondary winding capacitance is near 0%\nfor a large range of frequencies f1 and f2 (Fig. ??) thanks to\nthe position of the measurement point between a resonance and\nan anti-resonance frequency. The error increase above 10% if\nthe frequencies f1 and f2 are closer than 0.2 decade because\nof the proximity of the measurement point with the resonance\na)\n b)\n c)\nFig. 5. Error on the magnetizing inductance Lm with C′\n22 = 10µF (a) and 1Ω < R1 < 10Ω (b), error on the secondary winding capacitance C′\n22 with\n10µH <Lm <10H (c) versus the resonant, anti-resonant and cut-off frequencies.\nand anti-resonance. The error increase above 10% as well if\nthe frequencies f1 and f2 are spaced by more than 2.8 decades.\nIn this case the anti-resonance has a low quality factor and the\nmeasurement point is found on the anti-resonance (Fig. 6 c)).\nThis situation can be visually identiﬁed and solved by taking\na measurement point where the impedance has a slope of 20\ndB/decade.\nC. Leakage inductance\nThere are several similarities between the measurement of\nthe leakage inductance and of the secondary winding capaci-\ntance as both are measured between a resonance and an anti-\nresonance frequency. If the frequencies f2 and f3 are close,\nthe resonance lower the impedance, the leakage inductance is\noverestimated (Fig. 6 a)). The error is under 15% if f2 and f3\nare separated by more than half-a-decade.\nD. Capacitance C12\nThe error on the inter-winding capacitance is under 5% for\na large range of frequencies. If f3 is high, the inter-wining\ncapacitance is small and the primary capacitance cannot be\nneglected as it can be seen in the top right corner (Fig. 6\nb)). If f2 is close to f3 then C′\n22 ≈C′\n12 and C′\n22 cannot be\nneglected above f3 but is in serie with C′12\nVII. E XPERIMENTAL VALIDATION\nThe method is tested on a prototype with primary and\nsecondary windings on one leg (Fig. 7). The impedance is\nmeasured (Fig. 8). The shape of the impedance indicates that\nthe criteria are fulﬁlled to use the method. The value of the\nimpedance between the resonance frequencies are measured\nand the corresponding elements deduced (table III). The inter-\nwinging capacitance must be carefully measured. It must\nbe done at the highest possible frequency allowed by the\ninstruments to keep away the resonance but experimentally\nother high-frequency resonances which are not modeled by\nthe lumped parameter model appear at very high frequency. A\ntrade off between those resonances must be found.\nThe frequencies are evaluated, the measurement points\nfound and the parameters computed (table IV). The char-\nacteristic impedance is simulated with these parameters and\ncompared with the experimental one. Both are in concordance\nFig. 7. Transformer prototype experimentally identiﬁed\nat the measurement points and the error is small elsewhere.\nNeglecting the instrumentation incertitude, the error on the\nparameters can be evaluated on the plots ( Fig. 5 and 6) as all\nthe measured parameters are within the limits adopted to plot\nthe errors. The error on the magnetizing inductance and sec-\nondary winding capacitance are less than 5% and less than 10%\nfor the leakage inductance and inter-windings capacitance. An\nindependent test is performed on the transformer. The response\nof the transformer to a pulse is recorded and simulated with\nthe parameters of the equivalent model previously determined.\nSimulation and measurement are compared.\na)\n b)\n c)\n10\n−2\n10\n0\n10\n2\n10\n4\n10\n6\n10\n8−40\n−20\n0\n20\n40\n60\n80\nfrequency [Hz]\nGain [dBΩ ]\nP4\nP2\nP1\nP5 P6\nFig. 6. Error on the leakage inductance Ls with 1µH <Ls <1mH (a), error on the inter-windings capacitance C′\n12 with 1µH <Ls <1mH (b) versus\nthe resonant and anti-resonant frequencies and plot of the characteristic impedance in the unfavourable case where f1 = 45Hz and f2 = 3.6104Hz (c).\n0\n20\n40\n60\n80\n100\n120\n1.E-01 1.E+00 1.E+01 1.E+02 1.E+03 1.E+04 1.E+05 1.E+06\nImpedance [dBΩ] \nFrequency [Hz] \n0\n10\n20\n30\n40\n50\n60\n70\n0 2 4 6 8 10 12\nSecondary voltage [V] \nTime [µs] \nFig. 8. Measure (blue) and simulation with the measured equivalent\nelements(green) of the characteristic impedance and time response to a step\nat the primary\nTABLE IV . E XPERIMENTAL FREQUENCIES AND MEASURED ELEMENT\nFrequency Value [Hz]\nf0 9.6 10−1\nf1 6.5 103\nf2 1.64 105\nf3 6.2 105\nElement value Unit\nR1 1.52 Ω\nLm 262 mH\nC′\n22 2.7 n F\nLs 297 µH\nC′\n12 230 p F\nIn the simulated step-response the capacitance are instantly\ncharged leading to a discontinuity. In the measured response\nthis discontinuity disappears. The capacitances are charged\nthrough the resistance and inductance of the connecting wires,\nadding a charging time. The frequency of the simulated\nresponse is underestimated of about 10%. This is inside the\nincertitude on the parameters. The amplitude of the ripple is\nwell predicted.\nVIII. C ONCLUSION\nIt has been demonstrated that the frequency-domain\nimpedance measurement derived from a no-load test with\nopen-circuited secondary winding is sufﬁcient to identify the\nequivalent circuit of a pulse transformer. In such a test,\nphase measurements are not necessary. For a large range of\npulse transformers, the parameters are predicted with sufﬁcient\naccuracy to simulate the time response of the transformer\nand the method has been validated on a prototype. The\nproposed method combines analytic approximations and nu-\nmerical simulations to conﬁrm the validity of the hypothesis.\nFurther reﬁnements can be achieved by taking into account\nthe resonance frequencies or by taking the parameters derived\nwith the proposed method as initial guess of a non-linear\noptimization identiﬁcation procedure.\nACKNOWLEDGMENT\nThis work is ﬁnancially and materially supported by\nCERN, Switzerland.\nREFERENCES\n[1] D. Aguglia, C. A. Martins, M. Cerqueira Bastos, D. Nisbet, D.Siemaszko,\nE. Sklavounou, P. Viarouge, Klystron Modulator Technology Challenges\nfor the Compact Linear Collider (CLIC) , IEEE Conference on Pulsed\nPower, Washington DC 2011, pp. 1-10\n[2] P. Viarouge, D. Aguglia, C.A. Martins, J. Cros, Modelling and Dimen-\nsioning of High Voltage pulse Transformers for Klystron Modulators ,\n20th International Conference on electrical machines (ICEM), 2-5 Sept.\n2012, pp.2332 -2338.\n[3] D. Aguglia, P. Viarouge and A. Martins C., Frequency domain non-\nlinear identiﬁcation method for high voltage pulse transformer , 20 th\nInternational Conference on electrical machines (ICEM), 2-5 Sept. 2012,\npp.1977 -1983.\n[4] IEEE Standard for Pulse Transformers , ANSI/IEEE Std 390, 1987.",
  "topic": "Electrical impedance",
  "concepts": [
    {
      "name": "Electrical impedance",
      "score": 0.603532075881958
    },
    {
      "name": "Transformer",
      "score": 0.5848107933998108
    },
    {
      "name": "Parametric statistics",
      "score": 0.5420817136764526
    },
    {
      "name": "Equivalent circuit",
      "score": 0.515209972858429
    },
    {
      "name": "Electronic engineering",
      "score": 0.511104166507721
    },
    {
      "name": "Voltage",
      "score": 0.4921342730522156
    },
    {
      "name": "Linear variable differential transformer",
      "score": 0.4914635419845581
    },
    {
      "name": "Computer science",
      "score": 0.47249045968055725
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.4019729793071747
    },
    {
      "name": "Distribution transformer",
      "score": 0.34621959924697876
    },
    {
      "name": "Engineering",
      "score": 0.27365267276763916
    },
    {
      "name": "Mathematics",
      "score": 0.21930745244026184
    },
    {
      "name": "Electrical engineering",
      "score": 0.21569126844406128
    },
    {
      "name": "Statistics",
      "score": 0.07941007614135742
    },
    {
      "name": "Control (management)",
      "score": 0.0
    },
    {
      "name": "Artificial intelligence",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I43406934",
      "name": "Université Laval",
      "country": "CA"
    },
    {
      "id": "https://openalex.org/I67311998",
      "name": "European Organization for Nuclear Research",
      "country": "CH"
    }
  ],
  "cited_by": 8
}