{
  "title": "Validating the Unified Theory of Acceptance and Use of Technology (UTAUT) tool cross-culturally",
  "url": "https://openalex.org/W2161128771",
  "year": 2007,
  "authors": [
    {
      "id": "https://openalex.org/A1264172517",
      "name": "Lidia Oshlyansky",
      "affiliations": [
        "Swansea University",
        "University of Wales"
      ]
    },
    {
      "id": "https://openalex.org/A384539364",
      "name": "Paul Cairns",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2237019543",
      "name": "Harold Thimbleby",
      "affiliations": [
        "University of Wales",
        "Swansea University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4239203632",
    "https://openalex.org/W9237225",
    "https://openalex.org/W6759366072",
    "https://openalex.org/W389099677",
    "https://openalex.org/W6894130495",
    "https://openalex.org/W2148043668",
    "https://openalex.org/W1518373993",
    "https://openalex.org/W646445811",
    "https://openalex.org/W2149679803",
    "https://openalex.org/W2117013879",
    "https://openalex.org/W2100379340",
    "https://openalex.org/W2618039",
    "https://openalex.org/W1517801435",
    "https://openalex.org/W4398772568",
    "https://openalex.org/W2040582146",
    "https://openalex.org/W1978616753",
    "https://openalex.org/W2583382610",
    "https://openalex.org/W115450024",
    "https://openalex.org/W2101319914",
    "https://openalex.org/W1553243973",
    "https://openalex.org/W2111280021"
  ],
  "abstract": "HCI methods and tools are often used cross-culturally before being tested for appropriateness and validity. As new tools emerge, they must be cross-culturally validated to ensure that they work with all audiences, not just those in the country in which they were developed. This paper presents the validation of a technology acceptance model over nine culturally-diverse countries. The model validated is the Unified Theory of Acceptance and Use of Technology (UTAUT). The paper also explores ongoing analysis of the culture differences that emerge on UTAUT measures, and suggests avenues for future work.",
  "full_text": "Validating the Unified Theory of Acceptance and Use of \nTechnology (UTAUT) tool cross-culturally \nLidia Oshlyansky \nUniversity of Wales Swansea \nSingleton Park \nSwansea SA2 8PP \n+44 1792 205678 \nlidiaosh@gmail.com \nPaul Cairns \nDept of Computer Science \nUniversity of York \n York Y010 5DD  \n+44 1904 434336 \npcairns@cs.york.ac.uk \nHarold Thimbleby \nUniversity of Wales Swansea \nSingleton Park \nSwansea SA2 8PP \n+44 1792 205678 \nharold@thimbleby.net \n \n \nABSTRACT \nHCI methods and tools are often used cross-culturally before \nbeing tested for appropriatene ss and validity. As new tools \nemerge, they must be cross-culturally validated to ensure that \nthey work with all audiences, not  just those in the country in \nwhich they were developed. This  paper presents the validation \nof a technology acceptance model over nine culturally-diverse \ncountries. The model validated is the Unified Theory of \nAcceptance and Use of Technology (UTAUT). The paper also \nexplores ongoing analysis of the culture differences that emerge \non UTAUT measures, and suggests avenues for future work.  \nCategories and Subject Descriptors \nH.5.2 [User interfaces]: Evaluation/methodology \nGeneral Terms \nMeasurement, Reliability, Standardization, Verification. \nKeywords \nCross-cultural, technology acceptance, UTAUT, validation. \n1. INTRODUCTION \nParticularly with website de sign and mobile devices, Human-\nComputer Interaction practitioners face the challenges of \ndesigning across cultures daily, but there is little in the way of \nproven, cross-culturally validated  tools. Ongoing research has \nshown that differences do exist in  the way subjects in different \ncultures respond to standard usability measurement techniques \n[3,6]. Standard HCI measuremen t tools have been shown to \nhave cultural differences that can be missed if they are not \ncarefully evaluated and considered [13]. \nHCI has often relied on cultural models to help explain \ndifferences found in various aspects of usability and interaction. \nFor example, cultural models have been used to explain cross-\ncultural differences in technology acceptance, adoption and \nuptake [2,5,10]. However, models  of cultural differences may \nnot be applicable, or indeed valid, for use in the field [9,11,14]. \n“Technology acceptance,” that is, people’s attitude to the up-\ntake and use of different tec hnologies, has emerged as a strong \ncandidate for cross-cultural valid ation of HCI tools. Previous \nresearch has undertaken some work to cross-culturally validate \nand culturally extend technology acceptance models, such as \nthe Technology Acceptance Model (TAM) [4,7,15]. However, \nthe Unified Theory of Acceptance and Use of Technology, \nUTAUT [16], is a more recent instrument, which is a synthesis \nof eight existing models of technology acceptance — including \nTAM. UTAUT also integrates elements from: Theory of \nReasoned Action, Motivational Model, Theory of Planned \nBehaviour (TPB), a combined TAM and TPB model, Model of \nPC Utilization, Innovation Diffusion Theory, and Social \nCognition Theory. The unification of these models provides \nUTAUT with eight constructs: Performance expectancy, Effort \nexpectancy, Attitude towards using technology, Social \ninfluence, Facilitating conditions, Self-efficacy, Anxiety and \nBehavioural intention to use the system [16]. \nUTAUT has already been validated and applied in the field in \nEnglish-speaking countries [1,16]. The present paper provides a \ncross-cultural validation. \n2. PREPARING UTAUT  \nThe aim of the present study was to collect data from countries \naround the world to cross-culturally validate the UTAUT tool. \nThe data was collected from undergraduate and postgraduate \nstudents from all countries sample d. To make the questions on \nUTAUT accessible and applicable to all participants in the \nstudy, the general use of webs ites was queried, which ensured \nthat all participants would have access to the technology in \nquestion. External factors, such as price and technology \navailability, would not interfere or skew confound the findings.  \nUTAUT is meant to be adjusted to fit the technology being \nqueried [16], and therefore a certain amount of rewording is \nexpected. Due to the nature of the questions being asked, and \nbecause this research did not seek to predict usage or \nacceptance of a particular application, certain measures on \nUTAUT were excluded. Behavi oural intention to use was \ndropped, as it is intended as a predictor of use. Facilitating \nconditions was excluded specifically because the chosen \ntechnology, websites, would be available and accessible to all \nparticipants - making many of the questions on this construct \nredundant. The question, “Using the system is a bad/good idea” \nwas dropped from Attitude toward s using technology construct \nas it was not possible to make its wording suitable for the \ngeneral question of website use.  \nThese adjustments may of course influence the validity of the \ninstrument, as measures are re moved and questions changed. \n \n© Oshlyansky, Cairns, Thimbleby  2007 \nPublished by the British Computer Society \nVolume 2 Proceedings of the 21st BCS HCI Group \nConference \nHCI 2007, 3-7 September 2007, Lancaster University, UK \nDevina Ramduny-Ellis & Dorothy Rachovides (Editors) \n \nTo ensure that these changes have not affected the overall \nvalidity of UTAUT, an analysis of the data from English only \nspeaking countries was done. As will be discussed in the \nResults section of this paper, these changes did not significantly \ninfluence the tool. \n2.1 Translation  \nOnce all questions were reworded , UTAUT was translated into \nsix languages: Arabic (Saudi Arabian), Czech, Dutch, French, \nGreek, and Malay. Each translation was completed by at least \ntwo bilingual speakers, using the back-translation process. This \nprocess ensures that meaning and nuance are not lost, and that \nthe translated versions of the que stionnaires remain as true to \nthe original as possible [12]. The translation process did not \ngive rise to further modifications of the UTAUT tool. \n3. PARTICIPANTS  \n Table 1. Per country participant sample summary  \n Total \nsample \nReject \ndata \nUsed \nsample Male Female\nMean \nage \nCzech \nRepublic 157 5 152 98 44 23.3 \nGreece 152 36 116 39 61 23.75\nIndia 129 36 93 68 21 23.44\nMalaysia 187 19 168 49 102 21.99\nNew \nZealand 199 92 107 58 48 21.7 \nSaudi \nArabia 123 91 36 46 24.19\nSouth \nAfrica 144 34 110 75 27 20.94\nUnited \nKingdom 242 125 117 53 61 25.68\nUnited \nStates 156 30 126 43 79 24.28\nTotals 1489 286 1080 519 489 23.25\nThe translated questionnaires were distributed to university \nstudents in the Czech Republic, France, Greece, India, \nMalaysia, Netherlands, New Z ealand, Saudi Arabia, South \nAfrica, the United Kingdom, and to the United States. In all \ncountries students were recr uited from diverse Faculties \nincluding, Humanities, Science,  Health Science, Medicine, \nEngineering, Computer Scien ce, Business and Economics. No \nsample was represented by less than 5 academic disciplines.  \nA total of 1,570 questionnaires were returned. Only those \ncountries returning close to 100 or more questionnaires were \nleft in for analysis (table 1). This meant that the France ( N=38) \nand the Netherlands ( N=43) were not used in further analysis. \nOf the remaining sample, participants were kept in the analysis \nif their questionnaires were completed and no suspect data \npattern was present; that is, ques tionnaires with more than five \nquestions missing, patterns like 1234512345, or giving all one \nanswer were discarded. Likewise, only native participants, \nthose receiving primary, secondary and university education in \nthe same country as where they were living, were used in the \nanalysis to ensure a truly re presentative, homogeneous country \nsample. The sample was matched for age, education and access \nto technology and was equally balanced by gender. Table 1 \nsummarises the data collected fo r those countries meeting the \nselection requirements. \n4. DATA ANALYSIS \nLarge sets of data, such as the one collected here, can be \ndifficult to understand without tool s that assist in simplifying \nand summarising them. Factor analysis simplifies a matrix of \ncorrelations into more easily comp rehensible factors. Factors, \nin turn, represent a summary of the relationship between sets of \nvariables. Principal Component Analysis (PCA) was used here \nas it is a good method for exploring broad questions about the \nrelationship between variables in large sets of data. \nAdditionally,  PCA makes no dist ributional assumptions about \nthe data arising from the UTAUT cross-culturally unlike \nconfirmatory factor analysis methods. If the UTAUT constructs \nare working across cultures - and indeed measuring technology \nacceptance - they will emerge as  one omnibus factor in the \nanalysis [16]. Variables measuring each individual construct \nshould also group together on factors, showing that they \nmeasure a particular aspect of technology acceptance [8]. \nThe determination of factors is not defined by the factor \nanalysis method, but instead must be a result of judgment or \nheuristics. We have used the common guidelines [8] that factors \nare selected if their eigenvalues are 1 or more; variables having \na loading of magnitude 0.3 or more are considered to have a \nsignificant influence on the factor especially in large samples \nsuch as this. Of course, where these heuristics are nearly met, \nwe highlight this to give a more rounded and flexible picture. \n4.1 Analysis of UTAUT in all countries \nThe data for the English only language sample was analysed to \nensure that the changes made to UTAUT had not affected its \noverall validity. This sample included New Zealand, the United \nKingdom and the United States. South Africa and India were \nnot included in this analysis because while English is used in \nTable 2: UTAUT Principal Component Analysis all \ncountries \n  1 \n(29.04)\n2 \n(12.87) \n3 \n(8.30) \n4 \n(6.27) \n5 \n(5.74)\n6 \n(4.37)\nPerformance 0.32 -0.31 0.57 0.07 0.15 0.02 \nPerformance 0.37 -0.42 0.54 0.11 0.22 0.05 \nPerformance 0.43 -0.38 0.57 0.15 0.15 0.04 \nPerformance 0.49 -0.32 0.43 0.16 -0.01 0.04 \nEffort  0.53 -0.38 -0.17 0.05 0.22 -0.05 \nEffort  0.65 -0.18 -0.37 0.05 0.32 -0.19 \nEffort  0.65 -0.23 -0.39 0.07 0.34 -0.21 \nEffort  0.65 -0.18 -0.36 0.07 0.32 -0.22 \nAttitude 0.54 -0.17 0.02 0.43 -0.32 0.09 \nAttitude 0.59 -0.07 -0.22 0.44 -0.44 0.13 \nAttitude 0.62 -0.10 -0.25 0.37 -0.39 0.09 \nSocial  0.62 0.14 0.15 -0.22 -0.31 -0.37 \nSocial  0.61 0.17 0.14 -0.14 -0.36 -0.33 \nSocial  0.65 0.14 0.17 -0.40 -0.18 -0.15 \nSocial  0.63 0.14 0.15 -0.49 -0.08 -0.08 \nSelf-efficacy 0.63 -0.10 -0.20 -0.18 0.08 0.08 \nSelf-efficacy 0.66 0.22 -0.08 -0.17 0.01 0.30 \nSelf-efficacy 0.58 0.04 -0.06 -0.29 0.06 0.46 \nSelf-efficacy 0.60 0.12 -0.11 -0.23 0.03 0.48 \nAnxiety  0.40 0.62 0.12 0.21 0.10 -0.07 \nAnxiety  0.19 0.68 0.14 0.20 0.26 0.02 \nAnxiety  0.27 0.77 0.12 0.24 0.16 0.04 \nAnxiety  0.29 0.74 0.13 0.22 0.17 -0.07 \nhigher education and in business it is not necessarily the only or \nfirst language of the participants. The component matrix for this \nanalysis is not reproduced here, as  it is very similar to the one \npresented for all countries in Tabl e 2. Just as in the original \ndevising and evaluation of UTAUT [16], the English-only  data \nproduces the first omnibus fact or but with the exception of \nAnxiety.  \nThe data was then analysed as one complete set to ascertain if \nUTAUT would work on a widely -heterogeneous sample. Table \n2 presents the component matrix for the all-countries data set. \nThe questions for each construct appear in the order in which \nthey are presented in the ques tionnaire. The heading for each \ncolumn lists the factor numbe r, and the amount of variance \naccount for that factor in brackets. The six factors selected \naccount for over 66% of the overall variance in the data \ncollected. \nThe analysis clearly shows the first factor is the general \nUTAUT factor. All UTAUT constructs load on factor 1, with \nthe exception of Anxiety, which loads strongly on factor 2 \n(Table 2). Closer examination shows that, in fact, a further two \nof the Anxiety questions load almost at the 0.3 cut-off point in \nthe all-countries analysis. T hus, we have confidence that \nUTAUT is working as expected. The only concerning question \nthen is, why the Anxiety measur e does not load on factor 1 in \nthe English only analysis.  \nIn the remaining factors, questions that measure UTAUT \nconstructs (Performance, Effort  Expectancy, Attitude, Social, \nSelf-efficacy, and Anxiety) load, for the most part, in their sets. \nFor example, Performance and Anxiety load on factor 2, \nPerformance also loads with Effort on factor 3. However, in \nboth Effort and Self-Efficacy, there is one question that does \nnot load with the other questions  on that scale. The Social and \nSelf Efficacy constructs are both noted as being slightly \nawkward [16]. The Social construct is strongly influenced by \ngender, age and experience, while the effect of the Self-efficacy \nconstruct is partially captured by the Effort Expectancy \nconstruct [16]; this could be th e reason for their lower loadings \nhere. In the case of Effort, the missing question is loading \nfactor 2 with the Performance measure. In the English only \nsample the missing Effort question falls just short of the .30 cut \noff (.25) on factor 2. (This ques tion rates, “Interacting with the \nwebsite is clear and understandabl e.”) In the case of the data \ncollected here it seems that this  question groups with those of \nPerformance rather than Effort. This behaviour could be an \nartefact of the technology (the web) being queried and not of \nthe UTAUT tool: people may relate to websites differently than \nother technologies, especially t hose that are not as ubiquitous \nand readily available.  \nThe worst construct is Social . After loading on the omnibus \nfactor 1, the Social construct is broken up over factors 4, 5 and \n6. This may reflect Ventkatesth et al.’s original problems with \nthe Social construct. Overall, th en, this analysis of the entire \ndataset provides some confiden ce that the UTAUT tool works \ncross-culturally. \n4.2 UTAUT analysis by country \nAn analysis of UTAUT country -by-country provided further \nevidence that the questionnaire is  working as intended in each \nof the sample countries. Furtherm ore, translation did not hinder \nthe performance of UTAUT. Factor  1 emerged as the omnibus \nfactor in all countries, except India. In India the sample was \nsmall and male-dominant, which may account for the \nunexpected UTAUT performance in that sample. \nAs the first factor to emerge is always the UTAUT factor, it is \nmost interesting to consider th e remaining factors. Looking at \nthe different UTAUT constructs that appear for each country on \nthe subsequent factors provi des a better understanding of \nspecific cultural influence on technology acceptance. Instead of \nreproducing the component matrices for each country, Table 3 \nprovides a summary of the UTAUT constructs that emerged on \nfactors 2, 3 and 4 for each country. A minus sign after a \nconstruct indicates that it loads negatively on the factor rather \nthan positively. The “---” indicates that no clear construct \nemerged on these factors for the country but rather the factor \nwas made up of different ques tions from several different \nconstructs.   \nTable 3 provides clear evidence that the UTAUT constructs \ncontinue to load together and work across the nine cultures \nsampled, even when the countri es are examined independently. \nHowever, different constructs  have different amounts of \ninfluence in each country. For example, the Social construct \nonly emerges on factor 2 for the Saudi Arabia sample, which \nseems to indicate that social influence has greater weight on \nwebsite acceptance in Saudi Arabia than in the other countries \nsampled. Anxiety, on the other ha nd, emerges on factor 2 in all \ncountries except the Czech Re public. This may show that \nAnxiety is not a strong influence on website acceptance in the \nCzech Republic. The Effort and Performance constructs almost \nalways emerge on factors 2 and 3 for all the countries (except \nIndia, whose sample was problema tic). This could point to the \noverall, cross-cultural importance of these two constructs. The \nconfused factors for India and Saudi Arabia may mean that in \nthese countries UTAUT is not working cleanly or be due to the \nrelatively small sample sizes of India and Saudi Arabia. \nTable 4: Kruskal-Wallis test for UTAUT constructs \n  Chi-Squared DF Asymp. Sig. \nPerformance 76.25 8 r0.000 \nEffort 144.21 8 0.000 \nAttitude 189.27 8 0.000 \nSocial 145.22 8 0.000 \nSelf-efficacy 158.59 8 0.000 \nAnxiety 174.43 8 0.000 \nTable 3: UTAUT constructs emerging on factors 2, 3, 4 \n  Factor 2 Factor 3 Factor 4 \nCzech \nRepublic \nAttitude - \nEffort \nAttitude - \nEffort - \nPerformance \nSocial \nAttitude \nPerformance \nGreece Anxiety - \nPerformance \nEffort - \nPerformance \nAttitude \nIndia Anxiety \nAttitude - \n--- Attitude \nMalaysia Anxiety Attitude \nPerformance \nSocial - \nNew \nZealand \nAnxiety Effort \nPerformance - \nAttitude \nPerformance \nSaudi \nArabia \nAnxiety \nSocial \nEffort \nPerformance \n--- \nSouth \nAfrica \nAnxiety - \nPerformance \nAnxiety \nEffort - \nPerformance \nAttitude - \nUnited \nKingdom \nAnxiety - \nEffort \nEffort - \nPerformance \nAttitude \nUnited \nStates \nAnxiety Performance Attitude \nSocial - \n4.3 Analysis of means of UTAUT constructs \nBecause different UTAUT constructs emerged as having more \ninfluence (explaining more variance) in some countries sampled \nthan others, it is interesting to see if the differences are \nsignificant. It was not possible to  assume that the samples were \nparametric in nature, so the more conservative Kruskal-Wallis \ntest was run instead of ANOVAs. Table 4 gives the results for \nthe Kruskal-Wallis test, and shows that all the mean differences \nfor each of the UTAUT constructs was significant in the nine \ncountries presented here. However, given the large sample sizes \nused, this result should be interp reted with some caution. Large \nsample sizes, like the one here, can show significant differences \neven when these are not entirely interesting or meaningful. \nFurther research and analysis , such as Kruskall-Wallis post \ntests, is needed to determine the direction of the differences, \nestablish if the differences found here on UTAUT are \nmeaningful to cross-cultural acceptance, and can be translated \ninto guidelines or recommendations for design.  \n5.  DISCUSSION  \nThe results presented here clearly show that the UTAUT tool is \nrobust enough to withstand translation and to be used cross-\nculturally, outside its original country and language of origin. \nThis finding is useful, as it enables HCI researchers and \npractitioners to use the tool in an international context without \nconcern for its cross-cultural va lidity. Our analysis seems to \nindicate that the UTAUT tool will uncover cultural differences \nat least in the constructs it measures. Our analysis also gives an \ninitial indication that the UTAUT tool may be useful in \nproviding insight into cross-cultural technology acceptance \ndifferences. This is a particularly useful result, as the current \ntrend for explaining such differences relies heavily on the use \nof cultural models that have not been validated in the HCI field \n[11]. Future analysis of the tool would be useful with more and \ndifferent countries as those covered here are by no means \nexhaustive. \nThe Anxiety measure not loadi ng on the omnibus factor could \nbe caused by several aspects of the research. It could be an \nartefact of the changes made to the UTAUT questionnaire; it \ncould be because participants are asked to reflect on their \nprevious decisions and use, a nd are therefore emphasising their \nanxiety more in hindsight; it could be caused by some \nparticular aspect of how people reflect on the use of websites as \nopposed to other technologies. All these possibilities would \nbenefit from further and more in-depth exploration.  \nAlternatively, the problem with Anxiety may only be due to \none question, since the others a ll load on the omnibus factor at \nor around the 0.3 level. This is similar to the exceptional \nquestions in the Effort and Self-Efficacy constructs. It is \npossible that all these slight anomalies are due to the rewording \nand realignment of the UTAUT tool to query website use \nretrospectively. If the tool was used as a predictive measure of \nacceptance, the concern of the missing questions may not be an \nissue. It is likely that the mi ssing questions simply do not hold \nas much sway or as much explanatory power when being used \nwith a technology such as website s. If the tool were used with \nthe intent to query the acceptance of a specific office software \napplication, say, or even a specific web site the concerns noted \nhere may not arise. \n6. ACKNOWLEDGMENTS \nThe authors would like to thank Dr. V. Venkatesh for allowing \nthe use of the UTAUT. A great amount of gratitude is owed to  \nthose who helped translate and gather data in the countries \nsampled, unfortunately too numerous to list here; thank you! \n7. REFERENCES \n[1] Anderson, J. and Schwager, P., SME Adoption of Wireless \nLAN Technology: Applying the UTAUT Model. \nProceedings 7th Conference of the Southern Association \nfor Information Systems (SAIS), 39–43, 2004. \n[2] Barnett, G. A. & Sung, E., Culture and the Structure of the \nInternational Hyperlink Network. Journal of Computer-\nMediated Communication. 11(1), 217–238, 2005. \n[3] Cleary, Y., The impact of subjective cultural issues on the \nusability of a localized Web site: The Louvre Museum \nWeb site. In Bearman, D. and Trant, J. (eds.) Museums \nand the Web 2000. 153–162, 2000. \n[4] Day, D., Cultural Bases of interface acceptance: \nfoundations. Proc. of BCS HCI’96. 35-47, 1996. \n[5] De Angeli, A., Athavankar, U., Joshi, A., Coventry, L. and \nJohnson, G. I., Introducing ATMs in India: A contextual \ninquiry. Interacting with Computers. 16(1), 29–44, 2004. \n[6] Evers, V., Cross-Cultural Applicability of User Evaluation \nMethods: A Case Study amongst Japanese, North \nAmerican, English and Dutch Users. CHI’02 extended \nabstracts on Human Factors in computing systems. 740–\n741, 2002. \n[7] Evers, V. and Day, D., The role of culture in interface \nacceptance. In Howard, S., Hammond, J. and Lindegaard, \nG. (eds), Proc. of  INTERACT’97, 260–267, 1997. \n[8] Kline, P., An Easy Guide to Factor Analysis. Routledge, \nNew York, 2002. \n[9] Kruger, T. and Roodt, G., Hofstede’s VSM-94 Revisited: \nIs it reliable and valid? South African Journal of Industrial \nPsychology. 29(1), 75–82, 2003. \n[10] Maitland, C. F. and Bauer, J. M., National level culture \nand global diffusion: The case of the Internet. In Ess, C. & \nSudweeks, F. (eds.), Culture, Technology, Communication \nTowards an Intercultural Global Village. State University \nof New York Press, Albany, NY, 87–128, 2001.  \n[11] Oshlyansky, L., Cairns P. and Thimbleby, H., A \ncautionary tale: Hofstede’s VSM revisited. Proc.  of BCS \nHCI  2006. vol 2, 11–15 2006.  \n[12] Neuman, W. L., Social Research methods: qualitative and \nquantitave approaches 4th edition. Allyn and Bacon, \nBoston, 2000.  \n[13] Shimaneni, J. S. and Dunckley, L., Users’ Satisfaction — \nAn African Perspective. Proc. of BCS HCI, vol 2, 167-172. \n2005.  \n[14] Spector, P. E., Cooper, C. L. and Sparks, K., An \nInternational Study of the Psychometric Properties of the \nHofstede Value Survey Module 1994: A Comparison of \nIndividual and Country/Province Level Results. Applied \nPsychology: An International Review. 50(2), 269–281, \n2001.  \n[15] Straub, D., Keil, M. and Brenner, W., Testing the \ntechnology acceptance model across cultures: A three \ncountry study. Information & Management. 33(1), 1–11, \n1997.  \n[16] Venkatesh, V., Morris, M., Davis, G. B. and Davis, F.D., \nUser Acceptance of Information Technology: Toward a \nUnified View. MIS Quarterly. 27(3), 425–478, 2003 ",
  "topic": "Unified theory of acceptance and use of technology",
  "concepts": [
    {
      "name": "Unified theory of acceptance and use of technology",
      "score": 0.8929836750030518
    },
    {
      "name": "Work (physics)",
      "score": 0.5665347576141357
    },
    {
      "name": "Computer science",
      "score": 0.52875155210495
    },
    {
      "name": "Cross-cultural",
      "score": 0.4742949306964874
    },
    {
      "name": "Cultural diversity",
      "score": 0.46647554636001587
    },
    {
      "name": "Culturally sensitive",
      "score": 0.4618147611618042
    },
    {
      "name": "Culturally appropriate",
      "score": 0.4252024292945862
    },
    {
      "name": "Knowledge management",
      "score": 0.40546277165412903
    },
    {
      "name": "Management science",
      "score": 0.3601999878883362
    },
    {
      "name": "Data science",
      "score": 0.3523327708244324
    },
    {
      "name": "Psychology",
      "score": 0.30844876170158386
    },
    {
      "name": "Expectancy theory",
      "score": 0.24649029970169067
    },
    {
      "name": "Sociology",
      "score": 0.22837406396865845
    },
    {
      "name": "Social psychology",
      "score": 0.21807068586349487
    },
    {
      "name": "Engineering",
      "score": 0.1727791726589203
    },
    {
      "name": "Medicine",
      "score": 0.0643928050994873
    },
    {
      "name": "Anthropology",
      "score": 0.0
    },
    {
      "name": "Family medicine",
      "score": 0.0
    },
    {
      "name": "Mechanical engineering",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I39586589",
      "name": "Swansea University",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I97429440",
      "name": "University of Wales",
      "country": "GB"
    }
  ]
}