{
    "title": "MODELING TWO-LANGUAGE COMPETITION DYNAMICS",
    "url": "https://openalex.org/W2161138297",
    "year": 2012,
    "authors": [
        {
            "id": null,
            "name": "Patriarca, M.",
            "affiliations": [
                "National Institute of Chemical Physics and Biophysics",
                "Institute for Cross-Disciplinary Physics and Complex Systems"
            ]
        },
        {
            "id": null,
            "name": "Castelló, X.",
            "affiliations": [
                "Institute for Cross-Disciplinary Physics and Complex Systems"
            ]
        },
        {
            "id": null,
            "name": "Uriarte, J. R.",
            "affiliations": [
                "University of the Basque Country"
            ]
        },
        {
            "id": null,
            "name": "Eguíluz, V. M.",
            "affiliations": [
                "Institute for Cross-Disciplinary Physics and Complex Systems"
            ]
        },
        {
            "id": "https://openalex.org/A4299912760",
            "name": "Miguel, M. San",
            "affiliations": [
                "Institute for Cross-Disciplinary Physics and Complex Systems"
            ]
        },
        {
            "id": null,
            "name": "Castell\\'o, X.",
            "affiliations": []
        },
        {
            "id": null,
            "name": "Egu\\'iluz, V. M.",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W1994739812",
        "https://openalex.org/W2061477898",
        "https://openalex.org/W2058105398",
        "https://openalex.org/W1992262800",
        "https://openalex.org/W2090270891",
        "https://openalex.org/W2070599055",
        "https://openalex.org/W2128612344",
        "https://openalex.org/W2057652160",
        "https://openalex.org/W6812632318",
        "https://openalex.org/W3150888262",
        "https://openalex.org/W1971842701",
        "https://openalex.org/W2086642293",
        "https://openalex.org/W1969241582",
        "https://openalex.org/W2127839521",
        "https://openalex.org/W2080434622",
        "https://openalex.org/W596251256",
        "https://openalex.org/W2061446702",
        "https://openalex.org/W2021755467",
        "https://openalex.org/W1990284772",
        "https://openalex.org/W4237997615",
        "https://openalex.org/W2044174588",
        "https://openalex.org/W1989861930",
        "https://openalex.org/W2071853197",
        "https://openalex.org/W2108758170",
        "https://openalex.org/W2061916724",
        "https://openalex.org/W2122603079",
        "https://openalex.org/W4240528608",
        "https://openalex.org/W2130938799",
        "https://openalex.org/W2150063142",
        "https://openalex.org/W2146008209",
        "https://openalex.org/W2008569255",
        "https://openalex.org/W2111913169",
        "https://openalex.org/W2112090702"
    ],
    "abstract": "During the last decade, much attention has been paid to language competition in the complex systems community, that is, how the fractions of speakers of several competing languages evolve in time. In this paper, we review recent advances in this direction and focus on three aspects. First, we consider the shift from two-state models to three-state models that include the possibility of bilingual individuals. The understanding of the role played by bilingualism is essential in sociolinguistics. In particular, the question addressed is whether bilingualism facilitates the coexistence of languages. Second, we will analyze the effect of social interaction networks and physical barriers. Finally, we will show how to analyze the issue of bilingualism from a game theoretical perspective.",
    "full_text": "arXiv:1206.2960v1  [physics.soc-ph]  13 Jun 2012\nModeling two-language competition dynamics\nM. Patriarca (1, 2)∗ and X. Castell´ o (1)†\n(1) IFISC, Instituto de F´ ısica Interdisciplinar y Sistemas Co mplejos (CSIC-UIB), E-07122 Palma de Mallorca, Spain ‡ and\n(2) National Institute of Chemical Physics and Biophysics, R¨ a vala 10, 15042 Tallinn, Estonia\nJ. R. Uriarte §\nUniversidad del Pais Vasco-Euskal Herriko Unibertsitatea ,\nDepartamento de Fundamentos del An´ alisis Econ´ omico I,\nEkonomi Analisiaren Oinarriak I Saila, 48015 Bilbao, Spain\nV. M. Egu´ ıluz¶ and M. San Miguel ∗∗\nIFISC, Instituto de F´ ısica Interdisciplinar y Sistemas Co mplejos (CSIC-UIB), E-07122 Palma de Mallorca, Spain ‡\nDuring the last decade, much attention has been paid to langu age competition in the complex\nsystems community, that is, how the fractions of speakers of several competing languages evolve in\ntime. In this paper we review recent advances in this directi on and focus on three aspects. First we\nconsider the shift from two-state models to three state mode ls that include the possibility of bilingual\nindividuals. The understanding of the role played by biling ualism is essential in sociolinguistics. In\nparticular, the question addressed is whether bilingualis m facilitates the coexistence of languages.\nSecond, we will analyze the eﬀect of social interaction netw orks and physical barriers. Finally, we\nwill show how to analyze the issue of bilingualism from a game theoretical perspective.\nKeywords: language competition; bilingualism; opinion dy namics\nI. INTRODUCTION\nThe modeling of language dynamics in the general framework of comp lex systems has been addressed from at least\nthree diﬀerent perspectives: language evolution (or how the stru cture of language evolves) [1], language cognition (or\nthe way in which the human brain processes linguistic knowledge) [2], an d language competition (or the dynamics of\nlanguage use in multilingual communities) [3–5]. The latter is the approa ch followed in this paper in which, therefore,\nwe focus on problems of social interactions. Thus, there is a direct connection with social sciences and social dynamics,\nsince linguistic features represent cultural traits of a speciﬁc nat ure, whose propagation and evolution can in principle\nbe modeled through a dynamics analogous to that of cultural sprea ding and opinion dynamics [6, 7]. Furthermore,\nlanguage dynamics oﬀers the possibility to understand the mechanis ms regulating the size evolution of linguistic\ncommunities, an important knowledge in the design of appropriate ling uistic policies.\nThis paper reviews recent work on language competition dynamics fo cusing on models describing interaction in\nsocial communities with two languages or two linguistic features “A” a nd “B”. In particular, we consider the special\nrole of bilingual speakers. The emphasis is on two- or three-state m odels, in the physics jargon, or models with\ntwo excluding or non-excluding options, to say it from the perspect ive of economics and social norms. Languages\nor linguistic features are considered here as ﬁxed cultural traits in the society, while the more general dynamics of\nevolving interacting languages is not considered.\nWe discuss work done in several parallel directions and from diﬀeren t methodological points of view. A ﬁrst approach\nreviewed below is the family of competition models, referred to also as “ecological models of language”. They can be\nstudied at a macroscopic or mesoscopic level, introducing population densities for the respective language communities\nor using microscopic agent-based models, where the detailed intera ctions between agents are taken into account. The\nformulation can be made at diﬀerent levels of detail, possibly introduc ing the eﬀect of population dynamics, geography,\nand intrinsic or external random ﬂuctuations. A diﬀerent approac h considered is that of game-theoretical models,\nwhich allows the description of agents making choices about the langu age to be spoken at each encounter when limited\n∗ Electronic address: marcop@iﬁsc.uib-csic.es\n† Electronic address: xavi@iﬁsc.uib-csic.es\n‡ http://ifisc.uib-csic.es\n§ Electronic address: jr.uriarte@ehu.es\n¶ Electronic address: victor@iﬁsc.uib-csic.es\n∗∗ Electronic address: maxi@iﬁsc.uib-csic.es\n2\ninformation is available to them. While in the ecological models each langu age is initially spoken by a fraction of\nthe population, in the game-theoretical framework we consider th e present situation in many societies in which one\nlanguage is spoken by everyone, while a minority language is only spoke n by a proportion of the population. The\nonly relevant dynamics is then the one of the bilingual minority.\nThe outline of the paper is as follows: Section 2 describes language co mpetition models. A ﬁrst part is devoted to\nreview the seminal model of Abrams and Strogatz [8] and variations thereof, while a second part reviews several models\nproposed to take into account bilingual agents in this context. Sec tion 3 discusses how to account for geographic eﬀects\nin the models of language competition dynamics. Section 4 introduces a game-theory perspective into the problem.\nSection 5 contains some general conclusions and outlook.\nII. LANGUAGE COMPETITION MODELS\nA. The Abrams & Strogatz model\nThe Abrams & Strogatz model (from now on, AS model) [8] is the sem inal work which triggered a coherent eﬀort\nfrom a statistical physics and complex systems approach to the pr oblem of language competition [43]. It is a simple\ntwo-state model with two parameters (with a main focus on prestig e of the languages [44]), which the authors ﬁt\nto real aggregated data of endangered languages such as Quech ua (in competition with Spanish), Scottish Gaelic\nand Welsh (both in competition with English). The original model is a pop ulation dynamics model. However in\nthis review, we ﬁrst introduce its microscopic version [9] and we cons ider later its population dynamics (mean-ﬁeld)\napproximation.\nThe microscopic or individual based version of the AS model [9] is a two -state model proposed for the competition\nbetween two languages in which an agent i sits in a node within a network of N individuals and has ki neighbors.\nNeighbors are here understood as agents sitting in nodes directly c onnected by a link. The agent can be in the\nfollowing states: A, agent using language A (monolingual A); or B, agent using language B (monolingual B). At each\niteration we choose one agent i at random and we compute the local densities for each of the state s in the neighborhood\nof node i, σi,l (l=A, B). The agent changes its state according to the following transition probabilities:\npi,A →B = (1 − s)(σi,B )a , p i,B →A = s(σi,A )a (1)\nEquations (1) give the probabilities for an agent i to change from state A to B, or vice-versa. These probabilities\ndepend on the local densities ( σi,A , σi,B ) and on two free parameters: the prestige of language A, 0 ≤ s ≤ 1 (the one\nof language B is 1 − s); and the volatility parameter, a ≥ 0. Prestige is modeled as a scalar which aggregates multiple\nfactors. In this way, s gives a measure of the diﬀerent status between the two languages , that is, which is the language\nthat gives an agent more possibilities in the social and personal sphe res. Mathematically, it is a symmetry breaking\nparameter. The case of socially equivalent languages corresponds to s = 0 . 5. On the other hand, the volatility\nparameter gives shape to the functional form of the transition pr obabilities. The case a = 1 is the neutral situation,\nwhere the transition probabilities depend linearly on the local densitie s. A high volatility regime exists for a < 1,\nwhere the probability of changing language state is larger than the n eutral case, and therefore agents change its state\nrather frequently. A low volatility regime exists for a > 1 with a probability of changing language state below the\nneutral case, and thus agents have a larger resistance to chang e its state. In this way, the volatility parameter gives\na measure of the propensity (or resistance) of the agents to cha nge their language use.\n1. Mean-ﬁeld approximation\nIn the limit of inﬁnite population and fully connected society, that is, e ach agent can interact with any other agent\nin the population, the model can be described by diﬀerential equatio ns for the population densities of agents [8],\n˙xA = sA xa\nA xB − sB xa\nB xA ,\n˙xB = −sA xa\nA xB + sB xa\nB xA . (2)\nHere xi(t), i = A, B , represents the fraction of speakers of language i while si represents the prestige. Using the\ncondition xA(t) + xB(t) = 1 and following the normalization sA +sB = 1 ( sA = s), they can be reformulated as a\ntwo-parameter single-variable problem for the variable xA(t):\n˙xA = sA xa\nA (1 − xA) − sB (1 − xA)a xA . (3)\n3\nFIG. 1: Stability diagram for the AS model in a fully connecte d network (left) and a degree-regular random networks (righ t).\nSolid and dashed lines correspond to degree-regular random networks with degrees ⟨k⟩ = 3 and ⟨k⟩ = 10 respectively. See the\ntext for the deﬁnition of the regions. From Ref. [11].\nThe ﬁnal state reached by the dynamics depends on the initial popu lations xi(t0) and the values of the parameters\nsi and a. Note that from an ecological point of view the reaction term R(xA, x B ) = sAxa\nAxB − sBxa\nB xA implies that\nlanguages A and B act to each other as preys and predators at the same time [10], a situation peculiar in ecology but\nrealistic in the competition between cultural traits [8].\nAbrams and Strogatz found an exponent a = 1 . 31 when ﬁtting to real data from the competition between Quechua -\nSpanish, Scottish Gaelic-English and Welsh-English [8]. Moreover, the y also inferred the corresponding value of s\nin each of the linguistic situations. The general analysis of the role of parameters s and a in the model is discussed\nbelow.\nAn alternative macroscopic description of the AS model can be obta ined deﬁning a magnetization m = xA − xB =\n2xA − 1 and a bias parameter v = 1 − 2s. The time evolution of the magnetization is given by\ndm(t)\ndt = 2 −(a+1)(1 − m2)\n[\n(1 + v)(1 + m)a−1 − (1 − v)(1 − m)a−1]\n. (4)\nEquation (4) describes the evolution of a very large system ( N ≫ 1) at the macroscopic level, neglecting ﬁnite size\nﬂuctuations. It has the three stationary solutions\nm− = −xB = −1, m ∗ = (1 − v)\n1\na− 1 − (1 + v)\n1\na− 1\n(1 − v)\n1\na− 1 + (1 + v)\n1\na− 1\nand m+ = xA = 1 . (5)\nSolutions m± correspond to the dominance of one of the languages, so that a so cial consensus on which language\nto be used has been reached. Solution m∗ corresponds to a situation of coexistence of the two languages. W hen\na < 1 (large volatility), both solutions m± are unstable, and m∗ is stable, whereas for a > 1 (small volatility) the\nopposite happens. In the line a = 1, m+ is unstable (stable) for v < 0 ( v > 0), and vice-versa for m−. Therefore, a\nstructural transition is found at the critical value a = 1. In Fig. 1, we show the regions of stability and instability\nof the stationary solutions on the ( a, v ) plane obtained from the above analysis. We observe a region of coe xistence\n(m∗ stable) and one of bistable dominance of any of the languages ( m+ and m− stable) for any value of the prestige\nparameter.\nThe AS model has been studied within the context of viability theory a nd resilience [12, 13]. In this framework, it\nis assumed that the prestige s of the model can be changed in real time by action policies in order to m aintain the\ncoexistence of two competing languages, that is, keeping language coexistence viable. In Ref. [13] such policies are\nobtained, studying the eﬀect of varying the volatility parameter. I n general, large values of a (small volatility) reduce\nthe set of viable situations for language coexistence.\n2. Random networks\nIn order to account for local eﬀects in which each agent only intera cts with a small fraction of the population one\nneeds to go beyond the mean ﬁeld approximation. A ﬁrst step in this d irection is considering the AS model in random\nnetworks. For these networks a pair approximation can be used in w hich the state of an agent only depends on the\n4\nstate of its ﬁrst neighbors. This approximation works well in networ ks with no correlations to second neighbors. For\na degree-regular random network, that is, a network in which each node is randomly connected to a ﬁxed number of\n⟨k⟩ neighbors, the phase diagram obtained in Ref. [11] is shown in Fig. 1. Compared to the fully connected case, the\nregion of coexistence is found to shrink for v ̸= 0, as there appear two regions where only the solution correspon ding\nto dominance of the most prestigious language is stable (labeled as CO NSENSUS STATE A [B]). These regions\nbecome larger, the smaller the average number of neighbors ⟨k⟩, because the local eﬀects become more important (see\ntransition lines for ⟨k⟩ = 3 and ⟨k⟩ = 10 in Fig. 1), reducing further the set of parameters for which co existence is\npossible.\nThese regions become larger as local eﬀects in the network become more important as the number of neighbors ⟨k⟩\ndiminish (see transition lines for ⟨k⟩ = 3 and ⟨k⟩ = 10 in Fig. 1), reducing further the set of parameters for which\ncoexistence is possible. The fourth region (EXTINCTION/CONSENS US) corresponds to situations where dominance\nin any of the two languages is stable.\n3. Two-dimensional lattices\nWhen two-dimensional lattices are considered, correlations to sec ond neighbors become important. Thus a pair\napproximation is not enough to describe the system macroscopically . Instead, a ﬁeld approximation is needed [14],\nwhich describes well the macroscopic evolution of the system and is a ble to characterize the diﬀerent dynamics of the\ngrowth of linguistic domains depending on the volatility parameter, a. The stability diagram obtained for a square\nlattice is qualitatively similar to the one found in random networks (Fig. 1), but the region for coexistence is found\nto be much narrower than the ones observed in complex networks w ith low degree (small number of neighbors).\nIn the ﬁeld approximation [11], we deﬁne φr(t) as the average magnetization ﬁeld at site r at time t, which is a\ncontinuous representation of the magnetization at that site ( −1 < φ < 1). In this description, an alternative and\nmore visual way of studying stability is by writing the time evolution of t he magnetization ﬁeld φr in the form of a\ntime-dependent Ginzburg-Landau equation\n∂φ r(t)\n∂t = D(φr)∆ φr − ∂Va,v (φr)\n∂φ r\n, (6)\nwith potential Va,v (φr) and diﬀusion coeﬃcient D(φr).\nThe study of the potential allows us to obtain the diﬀerent regimes o f domain growth of the model. An especially\ninteresting case is that of v = 0 (socially equivalent languages). For a < 1 there is no domain growth, and a large\nsystem does not order remaining in a dynamically changing state of lan guage coexistence. The value a = 1 appears\nto be critical, as for this value the potential becomes Va,v (φr) = 0, and then linguistic domains grow by interfacial\nnoise (Voter model dynamics) leading to a ﬁnal ordered absorbing s tate of dominance of one of the languages. For\na > 1 instead, the mechanism of domain growth changes: it is driven by su rface tension, and the system also orders\nleading to a state of dominance of one of the languages. Notice that the order-disorder non-equilibrium transition at\nac = 1 is of ﬁrst order.\nB. Introducing bilingual speakers\n1. Minett & Wang model\nMinett & Wang proposed a natural extension of the AS model in which bilingual agents are introduced in the\ndynamics. They made a schematic proposal of how to include such ag ents in Ref. [15]. After a ﬁrst proposal in a\nworking paper in 2005, they published a model which considers both v ertical and horizontal transmission [16]. This\nmodel focuses on language competence rather than use, and has seven free parameters, including prestige, volatility,\nfour diﬀerent peak transition rates, and a mortality rate [16]. Howe ver, they only present results regarding the case\nof neutral volatility ( a = 1).\nIn this context, the ﬁrst relevant results concern a dynamical sy stems approach of the model, ﬁxing most of the\nparameters to given values and analyzing mainly the role of the prest ige parameter. This includes a stability analysis\nof the ﬁxed points and the study of the basins of attraction in phas e portraits. They propose a simple language\npolicy which consists in changing the prestige of a language once the t otal density of speakers falls below a given value\n(intervention threshold) for which the language is considered to be in danger [45]. In this way, they show a possible\ncoexisting scenario for both languages.\nThe second important result concerns the study of an agent base d model, which takes into account a discrete society.\nThey analyze fully connected networks and the so-called local world networks [17] (where agents link by preferential\n5\nattachment only to a subset of the total number of nodes in the ne twork) for which they analyze the frequency of\nconvergence to each of the equilibria depending on the intervention threshold. They obtain similar results for the\ndynamics of both networks when no language policy favoring coexist ence is applied; but they found that once this\npolicy takes place, maintenance is more diﬃcult in local world networks .\n2. Castell´ o et al. model\nThe work by Castell´ o et al. aims to study the dynamics of language co mpetition taking into account complex\ntopologies of social networks, ﬁnite size eﬀects and diﬀerent mech anisms of growth of linguistic domains. Their\nBilinguals model is an extension of the AS model inspired in the original p roposal of Minett and Wang. In this model\nagents can also be in a third bilingual state, AB, where agents use both languages, A and B. There are three local\ndensities to compute for each node i : σi,l (l = A, B, AB ). An agent i changes its state according to the following\ntransition probabilities:\npi,A →AB = (1 − s)(σi,B )a , p i,B →AB = s(σi,A )a, (7)\npi,AB →B = (1 − s)(1 − σi,A )a , p i,AB →A = s(1 − σi,B )a, (8)\nwhich depend on the same two parameters of the AS model: prestige (s) and volatility ( a). Equations (7) give the\nprobabilities for changing from a monolingual state, A or B, to the bilingual state AB, while equations (8) give the\nprobabilities for an agent to move from the AB-state towards the A or B states. Notice that the latter depends on\nthe local density of agents using the language to be adopted, includ ing bilinguals (1 − σi,l = σi,j + σi,AB , l, j = A, B ;\nl ̸= j). It is important to stress that a change from state A to state B or vice-versa always implies an intermediate\nstep through the AB-state [46] .\nIn the mean ﬁeld limit, the model is described by the following diﬀerentia l equations for the total population\ndensities of agents xA, x B (xAB = 1 − xA − xB),\ndxA/ dt = s(1 − xA − xB)(1 − xB)a − (1 − s)xA(xB )a , (9)\ndxB / dt = (1 − s)(1 − xA − xB)(1 − xA)a − s(xA)axB . (10)\nEquations (9)-(10) have three ﬁxed points: ( xA, x B , x AB) = (1 , 0, 0), (0, 1, 0), which correspond to consensus in the\nstate A or B respectively; and ( x∗\nA, x ∗\nB, x ∗\nAB), with x∗\nl ̸= 0 ( l = A, B, AB ). There are no closed expressions for x∗\nl\n(l = A, B, AB ) and numerical analyses are needed. The dynamics of the AS model and the Bilinguals model in\nthe whole parameter space has been analyzed in detail in Ref. [11], w here macroscopic descriptions are obtained for\nfully connected networks, random networks and two-dimensional lattices; and order-disorder transitions are found\nand analyzed in detail (asymptotic states).\nWhen introducing bilingual agents, the order-disorder transition d escribed in Sec. II A (Fig. 1) is qualitatively\nthe same, but the whole stability diagram shifts towards smaller value s of the parameter a [11]. In fully connected\nnetworks, the critical value shifts from ac = 1 to ac = 0 . 63. In random networks and square lattices the whole\nstability diagram shifts to smaller values of the parameter a, with ac(v = 0) = 0 . 3 and ac(v = 0) = 0 . 16 respectively.\nTherefore, bilingual agents are found to generally reduce the sce nario of language coexistence in the networks studied.\nSocially equivalent languages and neutral volatility. The role played by bilingual agents in the dynamics\nof language competition becomes more evident when considering the particular case of socially equivalent languages\n(s = 0 . 5) and neutral volatility ( a = 1), in which the AS model reduces to the Voter model [18–20], and t he Bilinguals\nmodel to the AB model [21, 22].\nA ﬁrst relevant result concerns the diﬀerent interface dynamics f or the growth of linguistic domains observed on two-\ndimensional lattices. The addition of the third intermediate state (b ilingual agents) results in a change of the interfacial\nnoise dynamics characteristic of the Voter model to a curvature d riven dynamics, characteristic of spin ﬂip Kinetic\nIsing dynamics [23], changing the growth of monolingual spatial doma ins [21, 24] (see Fig. 2). The time evolution\nof the characteristic length of a domain ξ(t) changes from ξ ∼ ln(t) to ξ ∼ tα , with α ≃ 0. 5. In addition, bilingual\ndomains are never formed. Bilingual agents place themselves at the boundaries between monolingual domains. These\nresults imply that the AB model behaves as a local majority model wit h two states ( A and B), with bilingual agents\nat the interfaces. As we discuss in the next paragraphs, this chan ge in the interface dynamics turns to be crucial in\nthe diﬀerent behavior of the Bilinguals model observed in diﬀerent ne tworks when compared to the AS model.\nThe second result is related to the role of social networks of increa sing complexity. In the ﬁrst place, small world\nnetworks [25] are considered, which take into account the existen ce of long range interactions throughout the network.\nIn comparison to the Voter model, where the dynamics reaches a me tastable state [47], bilingual agents restore the\nprocesses of domain growth and they speed-up the decay to the a bsorbing state of language dominance by ﬁnite size\n6\n,\nFIG. 2: Snapshots of the Voter model (left) and the Bilingual s model (right). Speakers of language A (red), B (black) and\nbilinguals (white) after 80 time steps starting with a rando m initial condition.\nFIG. 3: Fraction of alive runs in time for networks with commu nities (solid symbols) for the AB model (double logarithmic\nplot). The system sizes are N = 100, 400, 2500, 10000 from left to right, with averages take n over diﬀerent realizations of\nthe network (400-5000 depending on system size), with 10 run s in each. Inset: same plot for networks with communities\n(solid symbols) and randomized networks (empty symbols) fo r the Voter model (semilogarithmic plot). The system sizes a re\nN = 2500, 10000. Averages are taken over 100 diﬀerent realizat ions of the networks, with 10 runs in each. From Ref. [22].\nﬂuctuations [21]. The characteristic time, τ to reach an absorbing state scales with the rewiring parameter [48 ] as\nτ ∼ p−0. 76.\nSecondly, networks with community structure are analyzed, follow ing the algorithm by Toivonen et al. [26]. These\nnetworks mimic most of the features of real social networks: the presence of hubs, high clustering, assortativity, and\nmesoscale structure. Communities do not aﬀect substantially the V oter model dynamics, where the system reaches\nagain metastable states. Instead, the presence of communities d ramatically aﬀects the AB model [22]. On the one\nhand, linguistic domains correlate with the community structure, wit h bilingual agents connecting agents belonging\nto diﬀerent communities, leading to trapped metastable states. Th e analysis of the lifetime distributions to reach an\nabsorbing state shows that there is no characteristic time for the dynamics (Fig. 3): trapped metastable states are\nfound at arbitrary long times, which lead to scenarios of long time lang uage segregation. Notice that the change in\nthe interface dynamics found in two-dimensional lattices mentioned above when introducing bilingual agents, from\ninterfacial noise to curvature reduction, is at the basis for the ch ange of behavior observed in complex networks .\n7\nThe AB model has also been compared to the Naming Game restricted to two conventions ( 2c-Naming Game )\n[27, 28]. The general Naming Game [29] describes a population of agen ts playing pairwise interactions in order to\nnegotiate conventions, i.e., associations between forms and meanings, and elu cidates the mechanisms leading to the\nemergence of a global consensus among them. In the case of two c onventions, the Naming Game can be also interpreted\nas a language competition model with two non-excluding options. The AB model and the 2c-Naming Game are found\nto be equivalent in the mean ﬁeld approximation. However, the main re sult concerns the fact that, when these are\nextended incorporating a parameter β which describes the inertia of the agents to abandon an acquired lan guage,\nthey show an important diﬀerence with respect to the existence of an order-disorder transition. While the 2c-Naming\nGame features an order-disorder transition between consensus and stationary coexistence of the three phases present\nin the system [27], in the AB model such a transition does not exist [28 ].\n3. Mira et al. model\nThe works of Mira et al. [30, 31] introduce the category of bilinguals, in the particular but relevant case in which\ntwo languages are relatively similar to each other and partially mutually intelligible. In such a situation any speaker\nof e.g. the speaking community B can learn the language of the other speaking community A with a small eﬀort, thus\nbecoming a member of the bilingual community AB. In practice, this is d escribed in the model through a transition\nprobability, to switch from monolingual B to a bilingual community AB, w hich is relatively large compared to that\nof the opposite transition, as discussed below. This changes the dy namics in such a way that stable coexistence is\npossible.\nThe model may actually be given more general interpretations, sinc e there may be situations in which the transition\nfrom a monolingual community B to the bilingual community AB is very pr obable or easiest to carry out for reasons\nother than linguistic similarity, e.g. tight economical needs which requ ires both languages or social policies which\nfavor or push B speakers to learn language A.\nThe model describes the time evolution of the fractions xA and xB of speakers in the monolingual communities\nA and B and the analogous fraction xAB for the bilingual community AB. In the approximation of a constant t otal\npopulation, xA + xB + xAB = 1, one can eliminate the variable xAB, obtaining\n˙xA = (1 − xA)(1 − k)sA(1 − xB)a − xA(1 − sA)(1 − xA)a ,\n˙xB = (1 − xB )(1 − k)(1 − sA)(1 − xA)a − xAsA(1 − xB)a , (11)\nwhich reduce to Eqs. (2) of the AS model for k = 0. Here the normalization for the language status sA + sB = 1 has\nbeen assumed, so that the actual parameters of the model are a, k and sA. The closer the parameter k is to one, the\nmore probable is the transition from monolingual B to bilingual AB. Diﬀe rent types of stable equilibrium states have\nbeen shown to exist in the phase-plane of the model [30, 31], includin g some with non-zero bilingual community size\nxAB > 0 even for sA ̸= 1 / 2, i.e. when one of the languages is favored by a higher status. In or der for this condition\nto happen a suﬃciently large value of k is needed [31].\n4. Lotka-Volterrra like models\nIn Ref. [32] a Lotka-Volterra-like dynamical model is introduced, w hich provides a counter-example to the con-\nclusions of the AS model (which predicts the extinction of one of the two competing languages in a broad range of\nvalues of the prestige s and volatility a parameters). A main ingredient of the model is the introduction of p opulation\ndynamics with diﬀerent Malthus rates α A and α B for the two populations A and B. The dynamical equations read\n˙xA = c xAxB + α AxA\n(\n1 − xA\nKA\n)\n,\n˙xB = −c xAxB + α B xB\n(\n1 − xB\nKB\n)\n, (12)\nwhere c measure the switch rate from language B to language A, while the car rying capacities KA and KB represent\nthe maximum population sizes allowed in case of isolated populations ( c = 0). The language with lower status — in\nthe present case language B since it is assumed that c > 0 — is shown to be able to survive, as long as its corresponding\nreproduction rate is higher than its language disappearance rate, i.e. if cKB < α B . This system presents a stable\nequilibrium solution in which both communities survive ( xA, x B > 0).\nAs noticed in Ref. [33], the equilibrium value of the population size xA is larger than the maximum allowed value\nKA for population A. In order to overcome this problem, Kandler et al. [ 33] have proposed some diﬀerent models.\n8\nIn particular, they introduced a model with a common carrying capa cities K for the two language communities, in\nthe sense that in principle both the communities could reach the same maximum population size K. To take into\naccount the fact that in practice the resources actually available t o a community are limited by those already used\nby the other community, their model (in its zero-dimensional versio n) is deﬁned by the following equations,\n˙xA = c xAxB + α AxA\n(\n1 − xA\nK − xB\n)\n,\n˙xB = −c xAxB + α BxB\n(\n1 − xB\nK − xA\n)\n. (13)\nNotice that while the transition between A and B communities is regulat ed by the same Lotka-Volterra-type rate of\nthe model described in Eq. (12), the Verhulst terms in the populatio n dynamics part of the equations now contain the\neﬀective carrying capacities KA(t) = K −xB(t) and the analogous one for population B, which prevent the populat ion\nsizes from overcoming the carrying capacity K. However, with this change the coexistence equilibrium state is lost\nagain and only one community can survive asymptotically. The addition of heterogeneity to the model can change\nthings substantially, as discussed below in Sec. III.\nThe model was then generalized to include the bilingual community size [33, 34]. The transition dynamics is similar\nto that of the Minett and Wang model but eﬀective carrying capacit ies of the population dynamics part are designed\nin a way similar to those used above in Eqs. (13). It was still found tha t the presence of bilingualism does not allow the\ncoexistence of two languages asymptotically and that bilinguals repr esent the interface between the two monolingual\ncommunities; however, the presence of bilinguals can in some cases p rolong signiﬁcantly the extinction time.\nIII. MODELS WITH GEOGRAPHY\nThe importance of physical geography, e.g. the presence of wate r boundaries and mountains, for the evolution and\ndispersal of biological species is well known [35]. In cultural diﬀusion , both physical and political boundaries have to\nbe taken into account. Furthermore, other factors of dynamica l or economical nature, related to e.g. to the features\nof the landscape, can modify the otherwise homogeneous cultural spreading process.\nThe geographical models considered below [33, 36, 37] are extens ions of the 0-dimensional AS model to spatial\ndomains. In all cases some geographical inhomogeneities are taken into account, related to the underlying political,\neconomical, or physical geography.\nA. Inhomogeneous cultural diﬀusion\nInhomogeneous cultural diﬀusion can be modeled by adopting space (and time) dependent transition rates for the\nswitching between diﬀerent languages.\nIn the model introduced in Ref. [37] the speakers of two communit ies with diﬀerent languages A and B can diﬀuse\nfreely across a two-dimensional domain Z, divided symmetrically into two regions α and β. The border between\nthe regions, which could represent e.g. political or geographical fa ctors, is assumed to inﬂuence the communication\nbetween speakers in such a way that language A is more inﬂuential in z one α and language B in zone β. The reaction\ndynamics is similar to that of the AS model, with the crucial diﬀerence t hat (1) there is free homogeneous diﬀusion\nthrough the domain Z = α + β and (2) each speaker is only aﬀected by the other speakers who ar e in the same region\nwhere the speaker is. The AS dynamics is modiﬁed as follows,\n∂fA(r, t )\n∂t = ∆ fA(r, t ) + R(r, t ) ,\n∂fB(r, t )\n∂t = D∆ fB(r, t ) − R(r, t ) ,\nR(r, t ) = [ sA ξa\nA(r, t )fB (r, t ) − sB ξ a\nB (r, t )fA(r, t )] , (14)\nwhere r = ( x, y ), ∆ is the Laplacian in two dimensions, D the diﬀusion coeﬃcient, fA and fB the population density\nof the speaking community A and B, respectively, and si (i = A, B ; sA + sB = 1) maintain the same meaning of the\nlanguage status. The terms ξi(r, t ) in the reaction rate R(r, t ) are the fractions of speakers of language i at time t in\n9\nthe same region ( α or β) where a speaker with position r is,\nξi(r, t ) = N(α )\ni (r, t )/ [N(α )\nA (r, t ) + N(α )\nB (r, t )] if r ∈ α , (15)\n= N(β )\ni (r, t )/ [N(β )\nA (r, t ) + N(β )\nB (r, t )] if r ∈ β , (16)\nN(α )\ni (r, t ) =\n∫\nα\ndx′dy′fi(r′, t ) , N (β )\ni (r, t ) =\n∫\nβ\ndx′dy′fi(r′, t ) , i = A, B . (17)\nThe model exhibits stable equilibrium with both languages surviving in th e two diﬀerent regions α and β, also for\nvery diﬀerent language status, if the two populations are initially sep arated on the opposite sides of the boundary.\nAnother example of inhomogeneous language spreading modeling is pr ovided by the model introduced in Ref. [33],\nwhere the transition rate c in Eqs. (13) is allowed to vary in space, i.e. c → c(r), and diﬀusion is taken into account.\nThis analogously models a situation in which the two languages have a hig her status in diﬀerent spatial domains. The\nequations read\n∂fA(r, t )\n∂t = DA∆ fA(r, t ) + c(r)fA(r, t )fB (r, t ) + α AfA(r, t )\n[\n1 − fA(r, t )\nK −fB(r, t )\n]\n,\n∂fB(r, t )\n∂t = DB∆ fB(r, t ) − c(r)fA(r, t )fB (r, t ) + α BfB(r, t )\n[\n1 − fB(r, t )\nK −fA(r, t )\n]\n. (18)\nThe model predicts survival of both languages in the two diﬀerent r egions for suitable forms of the function c(r).\nIt is noteworthy that Kandler et al. applied their geographical mode ls in real situations, to test diﬀerent social\nstrategies planned for defending the survival of Britain’s Celtic lang uages [33, 34, 38]. For further details and data\nsource references see Ref. [38]. It is also worth pointing out that t he geographical character of these models may\nbe given a wider interpretation in terms of social space. For instanc e, the x coordinate may represent age, diﬀerent\nincome classes, or diﬀerent social environments (e.g. workplace ve rsus administration, workplace versus home, etc.).\nThus, while in all these cases there is actual competition between lan guages everywhere, in practice each language\neventually may turn up to be successful in and therefore charact erize a diﬀerent speciﬁc social domain. The diversity\nof diﬀerent languages or language features or their ability to ﬁnd a s uitable niche where to be successful is crucial to\nthe survival of any minority language.\nB. Inhomogeneous human dispersal\nThe model introduced in Ref. [36] can be considered to be compleme ntary to those discussed in the previous section,\nin the sense that it assumes a homogeneous switching rate in parallel with an inhomogeneous diﬀusion. It can be\nnoticed that while inhomogeneous diﬀusion is typically caused by facto rs related to the physical geographic features of\nthe underlying landscape, it can also be due e.g. to political boundarie s or natural borders between regions with very\ndiﬀerent economical features. It turns out that even such non- cultural features can strongly inﬂuence the evolution\nand ﬁnal distribution of cultural traits.\nIn the continuous limit the model assumes a dynamics of a reaction-d iﬀusion type, described by\n∂f1\n∂t = R(f1, f 2) − ∇ · ( Ff1) + ∇ · (D∇f1) + αf 1\n(\n1 − f1 + f2\nK\n)\n, (19)\n∂f2\n∂t = −R(f1, f 2) − ∇ · ( Ff2) + ∇ · (D∇f2) + αf 2\n(\n1 − f1 + f2\nK\n)\n, (20)\nR(f1, f 2) = k (s1f a\n1 f2 − s2f a\n2 f1) . (21)\nHere the ﬁrst term on the right hand side of Eqs. (19) and (20) is th e reaction term R, which can be recognized\nfrom Eq. (21) to be formally identical to that of the AS model, if the p opulation fractions are replaced by the\npopulation densities. Inhomogeneous diﬀusion can be due to the adv ection term containing the external “force\nﬁeld” F(x, y ) = ( Fx(x, y ), F y (x, y )) as well as to an inhomogeneous diﬀusion coeﬃcient D = D(x, y ). The model\nalso contains logistic terms with Malthus rate α and carrying capacity K, which introduces a negative competitive\ncoupling ∝ − f1f2. Notice that for equal dispersal and growth properties, the tot al population density f = f1 + f2\nfollows a standard diﬀusion-advection-growth process,\n∂f\n∂t = −∇ · [ Ff] + ∇ · (D∇f) + αf\n(\n1 − f\nK\n)\n. (22)\n10\nThe results of Ref. [36] can be summarized as follows. First, inhomo geneities in the initial distributions are crucial\nfor the ﬁnal state, e.g. broader initial distributions represent a d isadvantage for small population growths ( α → 0)\nwhile they can become an advantage for large enough values of α . Secondly, also boundary conditions are relevant\nin the competition process, e.g. the vicinity of reﬂecting boundaries deﬁnitely favors the survival of a language for\nlow growth rates. Finally, geographical barriers such as mountains or rivers can create a refugium where a linguistic\npopulation with lower status can survive with a stable ﬁnite density, e ven in the presence of an in-ﬂux of speakers of\na higher-status language.\nAs in the previous section, similar considerations apply also to these s peciﬁc models describing human dispersal\nabout possible more general interpretations as models of dispersa l in social space, e.g., through diﬀerent social classes.\nIV. A GAME-THEORETICAL MODEL: BILINGUALS AS A MINORITY POPU LATION\nA. Introductory remarks\nThe AS model [8], where the languages A and B compete for speakers, is not a good analytical tool to study most\nof the multilingual societies, as we know them today. The AS model se ems to be more appropriate to describe the\nlanguage competition that took place during the historical period of emergence of nation-states, typically during the\n18th and 19th century in Europe. This is the period in which the nation alist program is about to be accomplished:\nthe consolidation of a national market, with precise borders, free of internal restrictions to economic activities, and\nan increasing demand for a unique national language that would facilit ate those activities and help develop a national\nculture and identity [39]. Some societies, nevertheless, in Europe an d elsewhere, resisted that shift to language\nuniqueness. Extensions of the AS model have been developed to un derstand the existence of those multilingual\nsocieties (see sections III A and III B, and Refs. [16, 30, 32, 37]). The Lotka-Volterra type of models of language\nshift [33, 38] describe fairly well the historical shift to English of Sco ttish Gaelic and Welsh, that converted these two\nvernacular languages into two minority languages.\nHere, we shall consider a society with two languages, A spoken by all its members, and B spoken by a small\nproportion α . Thus, α denotes the proportion of bilingual speakers and (1 −α ) that of the monolingual ones. As\nexamples of this situation, we can consider: in Wales, Welsh and English ; in Scotland, Scottish Gaelic and English; in\nthe Basque Country, Basque and French in the French part and Ba sque and Spanish in the Spanish part; in Brittany,\nBreton and French; Sami and Swedish, Norwegian and Russian in the Sami society; Frisian, spoken in the province\nof Friesland in The Netherlands, competing with Dutch; Maori and En glish in New Zealand and Australia; Native\nAmerican languages (Quechua, Aymar´ a, Guarani, among others) and English, Spanish, French, Portuguese and Dutch\nin America; languages from the Russian Federation competing with Ru ssian. See Ref. [40] for more examples.\nWe could either assume a population of constant size or allow for chan ges in the size. In the latter case, any\nnew individual added to the society (say an immigrant) would, most like ly, learn at least A. But in both cases the\nproportion of individuals who would speak A, in the type of society we are dealing with, would always be almost, or\njust, 100%. Hence, in those societies, there is no dynamics for lang uage A of any relevance. Only the dynamics of\nlanguage B matters; and, therefore, to keep diversity, only the use of B matters.\nWe will investigate the language conventions of bilingual speakers by means of game-theoretic tools. As a method-\nological procedure, we might think that our analysis will deal with the stable equilibria obtained by some of the\nmodels used in Refs. [16, 30, 32, 37], where it is formally shown that A and B may coexist. We want to study the\nlanguage used in the interactions between bilingual speakers that o ccur outside the traditional geographical areas\nof B studied in section III A [37], and ask: will the language conventions developed by the bilingual sp eakers use the\nminority language B and therefore keep up the language diver sity?\nB. The Language Conversation Game (LCG): Iriberri-Uriarte Model\nThe model proposed by Iriberri and Uriarte [13] consists of a game played by two individuals (at least one should\nbe bilingual) to decide the language that will be used in the conversatio n that takes place during an interaction. The\nmodel satisﬁes the following set of assumptions.\n1. Assumptions\nAssumption 1 (A.1). Imperfect information : Nature or Chance chooses ﬁrst the actual realization of the ran dom\nvariable that determines the type of each speaker (i.e. bilingual or m onolingual). But each speaker knows only\n11\nhis own type. That is, a bilingual speaker does not know, ex-ante, t he bilingual or monolingual type of the\nagent she will interact with. We assume, on the other hand, that th e probability distribution, α and (1 − α ), is\ncommon knowledge among all the agents in the society\nAssumption 2 (A.2) Linguistic Distance : A and B are linguistically very distant, so that successful communic ation\nis only possible when the interaction takes place in one language.\nAssumption 3 (A.3) Language loyalty : Bilingual speakers prefer to use B.\nAssumption 4 (A.4) Payoﬀs : For a given proportion α < 1 − α , we assume the following payoﬀ ordering: m >\nn > c > 0. The maximum payoﬀ m is obtained when bilingual speakers coordinate in their preferred lan guage\nB. Bilingual or monolingual players might coordinate on the majority la nguage A; in that case, we will assume\nboth players get payoﬀs equal to n, because this was a voluntary coordination or choice. Then ( n − c) is the\npayoﬀ to a bilingual player who, having chosen B, is matched to someone monolingual (or bilingual) who uses\nlanguage A and is therefore forced to speak A; c denotes the frustration cost felt by this bilingual speaker.\nAssumption 5 (A.5) Frustration Cost : c < (m − n)α/ (1 − α ). The bilingual’s frustration cost is smaller than the\nweighted beneﬁt.\n2. Discussion of the assumptions\nNotice that A.1 does not allow the existence of a geographical linguistic partition, as it is assumed in Ref. [37],\nsince inside the historical areas where B is widely used, there will exist almost perfect information about the b ilingual\nor monolingual nature of their inhabitants. A.1 tries to capture the use of B outside the strongholds of B, in, so\nto say, the urban domains. We should take into account that, ofte n, one of the consequences of a language contact\nsituation is that even the accents, as signals that would reveal who speaks B and who does not, are erased. If we\neliminate A.1 and assume perfect information and the rest of assumptions, it is e asy to see that bilingual speakers\nwould coordinate in B. Assumption A.2 avoids the linguistic similarities between A and B assumed in Ref. [30].\nIf we assume language similarity, then conversations could take plac e using both A and B, bilingual speakers would\nnot be forced to change necessarily from B to A, and there would not be any frustration cost. If, instead of A.5, we\nassume c ≥ (m − n)α/ (1 − α ) while keeping the other assumptions, then it can be shown that the language used in\nequilibrium would be A. See also Ref. [41].\n3. Pure Strategies\nLet us consider a bilingual speaker who must decide, under imperfec t information, which language is going to use\nin an interaction which is about to occur. Simplifying things, we could sa y that the bilingual speaker expects to be\ninvolved in two exclusive events: a matching with another bilingual speaker (which will occur with probability α ) and\na matching with a monolingual speaker (which will occur with probability 1 − α ). We could also simplify the set of\nstrategies that any bilingual speaker may play to the following two:\ns1: Use always B, whether you know for certain you are speaking to a bilingual individual or not .\ns2: Use B only when you know for certain that you are speaking to a b ilingual individual; use A, otherwise.\nNote that strategy s1 reveals the bilingual nature of the speaker. Strategy s2, on the other hand, hides the bilingual\nnature of the speaker. Its purpose is to avoid the frustration co st c of assumption A.4.\nIn the present paper, we study the normal form of the LCG. A com plete description of the LCG is given by the\nextensive form presented in Ref. [41].\nThe language associated to each pure strategy proﬁle is given by th e following matrix:\ns1 s2\ns1 B B\ns2 B A\nNote that since players have no perfect information about the typ e of the opponent, they might use either B or\nA in the interaction. That is, if both bilingual speakers hide their type b y choosing s2, then they will use in the\ninteraction their less preferred language A. In the other three cases they will use B, because at least one speaker is\nrevealing the bilingual identity.\n12\nFIG. 4: The game to be played in the event in which two bilingua l speakers are matched. Notice that s1 is weakly dominant.\nFIG. 5: The game to be played in the event in which a bilingual s peaker is matched to a monolingual. Notice that s2 is strictly\ndominant.\n4. Expected Payoﬀs\nThe (mythical) player called Nature or Chance chooses, with probab ility α , that the bilingual speaker interacts\nwith another bilingual speaker, to play the game described in Fig. 4, in which, by assumption A.4, strategy s1 is\nweakly dominant.\nNature chooses, with probability 1 − α , that the bilingual speaker interacts with a monolingual speaker, t o play\nthe game described in Fig. 5, in which, by assumption A.4, s2 is strictly dominant. The monolingual agent does not\nmake choices and gets n.\nIf a bilingual speaker chooses strategy s1, then, no matter the choices of the other bilingual player, the exp ected\npayoﬀ is αm + (1 − α )(n − c); if the choice is s2, then, against s1, the expected payoﬀ will be αm + (1 − α )n and,\nagainst s2, n. The resulting matrix of expected payoﬀs of the LCG played by two b ilingual speakers will, therefore,\nbe symmetric:\ns1 s2\ns1 α (m − n) − c(1 − α ), α (m − n) − c(1 − α ) α (m − n) − c(1 − α ), α (m − n)\ns2 α (m − n), α (m − n) − c(1 − α ) 0,0\nMatrix of Expected Payoﬀs\nC. Evolutionary Setting\nThe LCG will now be viewed as a population game. To this end, let us assu me that the bilingual population\nconsists of a large, but ﬁnite number of individuals, who play a certain pure strategy si, ( i = 1 , 2), in a two-player\ngame. The members of the bilingual population play the LCG having S = {s1, s 2} as their common strategy set. The\ninteractions are modelled as pairwise random matching between agen ts of the bilingual population; that is, no more\nthan two (randomly chosen) individuals interact at a time. The intera ctions take place continuously over time. Let\nN be the total population of bilingual speakers in the society, and x = N1\nN the proportion of bilingual agents playing\nthe pure strategy s1 at any point t in time (time dependence is suppressed in the notation). In this sett ing, a mixed\nstrategy is interpreted as a population state that indicates the bilin gual population share of agents playing each pure\n13\nstrategy. On the other hand, the payoﬀs of the game should not b e interpreted as biological ﬁtness, but as utility.\nUnder assumptions A.1-A.5, we get the following result.\nProposition. There exists a mixed strategy Nash equilibrium in which the b ilingual population plays s1 with\nprobability x∗ = 1 − c(1−α )\nα (m−n) . This equilibrium is evolutionary stable — that is x∗ is a language convention built by\nthe bilingual population — and asymptotically stable in the associated one-population Replicator Dynamics.\nProof: Note that the LCG has the strategic structure of a Hawk-Dove Game (with s1 as Dove and s2 as Hawk).\nThus, it has three Bayesian Nash equilibria: the asymmetric (and uns table) equilibria ( s2, s1) and ( s1, s2), and the\nsymmetric mixed strategy equilibrium ( x∗, 1 − x∗) = (1 − c(1−α )\nα (m−n) , c(1−α )\nα (m−n) ), with x∗ ∈ (0, 1). To see that the latter\nequilibrium is evolutionary stable, see Ref. [42]. The single population R eplicator Dynamics is as follows:\n·\nx = [ α (m − n)(1 − x) − c(1 − α )]x(1 − x) .\nNotice that in x∗, α (m − n)(1 − x) − c(1 − α ) = 0 and so\n·\nx = 0. We can see that for any 0 < x < 1 − c(1−α )\nα (m−n) ,\n·\nx\nincreases toward x∗, and for any 1 > x > 1 − c(1−α )\nα (m−n) ,\n·\nx decreases toward x∗■ .\n1. Interpretation\nLanguage B is spoken in the asymmetric equilibria ( s2, s1) and ( s1, s2), but these equilibria are unstable and,\nhence, we must rule them out. Thus, we are left with the evolutionar y and asymptotically stable equilibrium x∗.\nSince x∗ ∈ (0, 1), s1 and s2 are played by non-zero proportions of bilingual speakers. That is, the bilingual population\nis optimally partitioned in two subpopulations: N∗\n1 = N[1 − c(1−α )\nα (m−n) ] and N∗\n2 = N c(1−α )\nα (m−n) . The former group is\ncomposed of agents who play strategy s1 and the latter of those who play s2. Hence, the bilingual agents in N∗\n2 do\nnot use B in the interactions among themselves. Only when they interact with a gents of N∗\n1 will they use B.\nThus, in equilibrium, the population of bilingual speakers will speak bot h A and B in the interactions between\nthemselves; the level of use of B depends on the relative size of N∗\n1 .\nD. Concluding remarks\nThe mixed equilibrium x∗ is compatible with almost all the possible levels of use of B: from the lowest, when x∗\nis almost 0 and therefore N∗\n2 approaches N, so that bilingual speakers will mostly speak A between them; to the\nhighest, when x∗ is almost 1 and so bilingual speakers will be almost all speaking their pre ferred language B. Hence\nwe cannot give a sharp answer to the question posed in the introduc tory remarks in Sec. IV A. We can only say that\nlanguage diversity is not safe in this equilibrium.\nOur prediction is that there is a tendency towards a situation in which N∗\n2 > N ∗\n1 , and that the use of B will always\nface the danger of being reduced to marginal levels outside the tra ditional areas. Many factors will intervene, some\nof them from outside the model. Among others, imperfect informat ion, the dominance of A in formal and informal\nusages of the language, and the politeness norms that would advice the use of (the Hawk strategy) s2. Bilingual\nspeakers playing s2 will hurt each other because they end up speaking the less preferr ed language (see the language\nmatrix above). This might explain the diﬃculties observed by Fishman ( 2001) [40]. The actual lower bound to the\nuse of B will be near to that set by the communities living in the geographical ar eas where B is strong and where\ninteractions occur with almost perfect information [37]. See Ref. [ 41] for a more complete analysis.\nV. CONCLUSIONS\nWe have revisited several approaches used to study the dynamics of two competing languages. The main question\naddressed is whether the competition leads to the coexistence or o n the contrary to the prevalence of a majority\nlanguage. The seminal work of the AS model considers speakers of two languages without the possibility of bilinguals.\nIn this case, the stationary conﬁgurations depend on the volatility , that is, how easy is to change language use\ndepending on the local density of speakers. When the volatility is high (a < 1), i.e., the probability is larger than\nthe linear case, coexistence is the stationary solution where the pe rcentage of speakers of each language depends on\nthe prestige. When the volatility is low ( a > 1), the systems converges to the dominance of one of the languag es\nand the extinction of the other. The presence of bilinguals and netw ork of interactions (Bilinguals model) change\n14\nthe boundaries separating the diﬀerent regimes, but the overall p icture remains similar. Physical and/or political\nboundaries have been shown to allow for coexistence as long as the t wo communities are separated. There have been\nalso attempts to show the coexistence of monolingual speakers in p opulation dynamic models and the stability of\nbilingual communities. Finally, by means of a game theoretical approa ch, we have analyzed the case of language\ncompetition when one of languages is known by all the agents while the other is only spoken by a minority.\nDespite the eﬀorts to understand the diﬀerent mechanisms of lang uage competition, an overall clear picture on the\nquestion of coexistence (or not) or multilingual communities is still mis sing. In this respect empirical works should\nprovide evidence and guidance to improve current models. The origin al data in Ref. [8] on the evolution of the total\nnumber of speakers has triggered the research line so far. Recen t research [38] using empirical data on Britain’s Celtic\nlanguages with good spatial and temporal resolution should be take n as a motivation for further studies. We anticipate\nthat future research will address how spatio-temporal pattern s emerge from the competition of local interaction with\nglobal signals (e.g., prestige, language policies).\nAcknowledgments\nWe acknowledge ﬁnancial support from the Spanish Ministry of Scien ce and Innovation MICINN and FEDER\nthrough projects ECO2009-11213-ERDF, FISICOS (FIS2007-6 0327); MODASS (FIS2011-24785), and SEJ2006-05455;\nthe Basque Government through project GV-EJ: GIC07/22-IT- 223-07; the Estonian Ministry of Education and Re-\nsearch through Project No. SF0690030s09 and the Estonian Scie nce Foundation via grant no. 7466. Jos´ e Ram´ on\nUriarte wants to thank the Department of Economics of Humbolt-U niverstt zu Berlin, where this research was com-\npleted, for the facilities oﬀered. We also thank Federico Vazquez fo r his contribution to the original work reviewed\nhere.\n[1] L. Steels, Phys. Life Rev. 8, 339 (2011).\n[2] S. Edelman and H. Waterfall, Phys. Life Rev. 4, 253277 (2007).\n[3] R. Sol´ e, B. Corominas-Murtra, and J. Fortuny, Interfac e 7, 1647 (2010).\n[4] D. Stauﬀer and C. Schulze, Phys. Life Rev. 2, 89 (2005).\n[5] S. Wichmann, Language and Linguistics Compass 2/3, 442 (2008).\n[6] C. Castellano, S. Fortunato, and V. Loreto, Rev. Mod. Phy s. 81, 591 (2009).\n[7] M. San Miguel, V. M. Egu´ ıluz, R. Toral, and K. Klemm, Comp uting in Sci. & Eng. 7, 67 (2005).\n[8] D. M. Abrams and S. H. Strogatz, Nature 424, 900 (2003).\n[9] D. Stauﬀer, X. Castell´ o, V. M. Egu´ ıluz, and M. San Migue l, Physica A 374, 835 (2007).\n[10] J. D. Murray, Mathematical Biology I. An Introduction (Springer, New York, 2002).\n[11] F. Vazquez, X. Castell´ o, and M. San Miguel, J. Stat. Mec h. P04007 (2010).\n[12] J. P. Aubin, Viability Theory (Birkhauser, Boston, 1991).\n[13] L. Chapel, X. Castell´ o, C. Bernard, G. Deﬀuant, V. M. Eg u´ ıluz, S. Martin, and M. San Miguel, PLoS ONE 5, e8681\n(2010).\n[14] F. Vazquez and C. L´ opez, Phys. Rev. E 78, 061127 (2008).\n[15] W. S.-Y. Wang and J. W. Minett, TRENDS in Ecology and Evol ution 20, 263 (2005).\n[16] J. Minett and W.-Y. Wang, Lingua 118, 19 (2008).\n[17] X. Li and G. Chen, Physica A 328, 274 (2003).\n[18] R. Holley and T. Liggett, Annals of Probability 3, 643 (1975).\n[19] T. M. Liggett, Stochastic Interacting Sysyems: Contact, Voter and Exclus ion Processes (Springer, New York, 1999).\n[20] F. Vazquez and V. M. Egu´ ıluz, New J. Phys. 10, 063011 (2008).\n[21] X. Castell´ o, V. M. Egu´ ıluz, and M. San Miguel, New J. Ph ys. 8, 308 (2006).\n[22] X. Castell´ o, R. Toivonen, V. M. Egu´ ıluz, J. Saram¨ aki, K. Kaski, and M. San Miguel, Europhys. Lett. 79, 66006 (2007).\n[23] J. D. Gunton, M. San Miguel, and P. Sahni, Phase Transitions and Critical Phenomena (Academic Press, London, 1983),\nvol. 8, chap. The dynamics of ﬁrst order phase transitions, p p. 269–446.\n[24] X. Castell´ o, F. Vazquez, V. M. Egu´ ıluz, L. Loureiro-P orto, M. San Miguel, L. Chapel, and G. Deﬀuant, in Viability and\nResilience of Complex Systems: Concepts, Methods and Case S tudies from Ecology and Society , edited by G. Deﬀuant and\nN. Gilbert (Springer-Verlag, Berlin Heidelberg, 2011), Un derstanding Complex Systems, pp. 39–73.\n[25] D. J. Watts and S. H. Strogatz, Nature 393, 440 (1998).\n[26] R. Toivonen, J.-P. Onnela, J. Saram¨ aki, J. Hyv¨ onen, J . Kert´ esz, and K. Kaski, Physica A 371, 851 (2006).\n[27] A. Baronchelli, L. Dall’Asta, A. Barrat, and V. Loreto, Phys. Rev. E 76, 051102 (2007).\n[28] X. Castell´ o, A. Baronchelli, and V. Loreto, Eur. Phys. J. B 71, 557 (2009).\n[29] L. Steels, Artiﬁcial Life 2, 319 (1995).\n[30] J. Mira and A. Paredes, Europhys. Lett. 69, 1031 (2005).\n15\n[31] J. Mira, L. Seoane, and J. Nieto, New J. Phys. 13, 033007 (2011).\n[32] J. Pinasco and L. Romanelli, Physica A 361, 355 (2006).\n[33] A. Kandler and J. Steele, Biological Theory 3, 164 (2008).\n[34] A. Kandler, Human Biology 81, 181 (2009).\n[35] M. V. Lomolino, B. R. Riddle, and J. H. Brown, Biogeography (Sinauer Associates, Sunderland, Masachusetts, 2006).\n[36] M. Patriarca and E. Heinsalu, Physica A 388, 174 (2009).\n[37] M. Patriarca and T. Lepp¨ anen, Physica A 338, 296 (2004).\n[38] A. Kandler, R. Unger, and J. Steele, Phil. Trans. R. Soc. B 365, 3855 (2010).\n[39] E. J. Hobsbawm, Nations and Nationalism Since 1780: Programme, Myth, Reali ty. 2nd Ed. (Cambridge University Press,\n1992).\n[40] J. A. Fishman, Why is it so Hard to Save a Threatened Language? (Clevedon, 2001), Multilingual Matters.\n[41] N. Iriberri and J. R. Uriarte, Rationality and Society, in press (2012).\n[42] J. W. Weibull, Evolutionary Game Theory (The MIT Press, Cambridge, Mass., 1995).\n[43] See http://www.ifisc.uib-csic.es/research/complex/APPLET LANGDYN.html for online applets of the AS model and\nthe Bilinguals model considered in Sec. II B 2.\n[44] “Status” is the term used in Ref. [8] to refer to prestige . However, in later publications authors have referred to it as\n“prestige”, which appears to be more appropriate for sociol inguistic studies since in linguistics status usually refe rs to the\ndegree of oﬃcial recognition of a language.\n[45] Notice that diﬀerently to this policy, when using viabi lity theory [13, 24] we suppose that the prestige can take any value\nalthough the action on the prestige is not immediate: the tim e variation of the prestige is bounded.\n[46] Notice that in the analysis of the AS model and the Biling uals model, the use of a language rather than the competence is\nconsidered. In this way, learning processes are out of reach of the present models. Eﬀectively, the situation is such as i f all\nagents were competent in both languages.\n[47] Notice that the critical dimension for the Voter model i s d = 2. Therefore, in complex networks the system falls in\nmetastable dynamical states which only reach an absorbing s tate (language dominance) due to ﬁnite size ﬂuctuations.\n[48] A small world network occurs for intermediate values of p between p = 0 (regular network) and p = 1 (random network)."
}