{
  "title": "Experimentally obtaining on-line FRA in transformers by injecting controlled pulses",
  "url": "https://openalex.org/W2171459930",
  "year": 2013,
  "authors": [
    {
      "id": "https://openalex.org/A2164136808",
      "name": "Eduardo Gómez-Luna",
      "affiliations": [
        "Universidad del Valle"
      ]
    },
    {
      "id": "https://openalex.org/A2122623667",
      "name": "Guillermo Aponte",
      "affiliations": [
        "Universidad del Valle"
      ]
    },
    {
      "id": "https://openalex.org/A2121076170",
      "name": "Wilder Herrera",
      "affiliations": [
        "Universidad del Valle"
      ]
    },
    {
      "id": "https://openalex.org/A2109096215",
      "name": "Jorge Pleite Guerra",
      "affiliations": [
        "Universidad Carlos III de Madrid"
      ]
    },
    {
      "id": "https://openalex.org/A2164136808",
      "name": "Eduardo Gómez-Luna",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2122623667",
      "name": "Guillermo Aponte",
      "affiliations": [
        "Universidad del Valle"
      ]
    },
    {
      "id": "https://openalex.org/A2121076170",
      "name": "Wilder Herrera",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2109096215",
      "name": "Jorge Pleite Guerra",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2151052655",
    "https://openalex.org/W2134391768",
    "https://openalex.org/W2065040883",
    "https://openalex.org/W2023192197",
    "https://openalex.org/W2153605667",
    "https://openalex.org/W2131449031",
    "https://openalex.org/W2163203026",
    "https://openalex.org/W2154642750",
    "https://openalex.org/W2066277723",
    "https://openalex.org/W2117791287",
    "https://openalex.org/W939212319",
    "https://openalex.org/W2330492179"
  ],
  "abstract": "Transformer monitoring based on the operating condition (on-line test) has boomed in recent years because it allows early detection of risk situations or limitations regarding use to make appropriate decisions before a failure occurs. Frequency response analysis (FRA) is one of the most heavily researched techniques for on-line development; it is based on obtaining a transformer's frequency response (admittance, impedance or transfer function) in a given bandwidth. This paper presents an experimental method for obtaining the frequency response with the transformer in service by injecting controlled pulses of the voltage signal using an external electronic circuit. Once the voltage and current signals had been recorded, the wavelet transform was used via multi-resolution analysis (MRA) for filtering. This led to results being obtained without noise interference from the electrical system. The transfer function was obtained in terms of impedance, using the fast Fourier transform (FFT). The proposed method represented an alternative in solving some problems arising from the on-line FRA technique such as filtering and results' repeatability. The tests involved a 5-kVA 1150/345 V three-phase transformer and a 3-kVA, 7620/240 V single-phase transformer in the Universidad del Valle's High Voltage Laboratory.",
  "full_text": "INGENIERÍA E INVESTIGACIÓN VOL. 33 No. 1, APRIL 2013 (43-45) \n                                                                                                                                                                                                                     41  \nExperimentally obtaining on-line FRA in transformers  \nby injecting controlled pulses \n \nObtención experimental de FRA on-line en transformadores mediante  \nla inyección de pulsos controlados \n \nE. Gomez-Luna1, G. Aponte2, W. Herrera3 and J. Pleite4 \n \nABSTRACT  \nTransformer monitoring based on the operating condition (on-line test) has boomed in recent years because it allows early detection \nof risk situations or limitations regarding use to make appropriate decisions before a failure occurs. Frequency response analysis (FRA) \nis one of the most heavily researched techniques for on- line development; it is based on obtaining a transformer’s frequency re-\nsponse (admittance, impedance or transfer function) in a given bandwidth. This paper presents an experimental method for obtain-\ning the frequency response with the transformer in service by injecting controlled pulses of the voltage signal using an external elec-\ntronic circuit. Once the voltage and current signals had been recorded, the wavelet transform was used via multi-resolution analysis \n(MRA) for filtering. This led to results being obtained without noise interference from the electrical system. The transfer function was \nobtained in terms of impedance, using the fast Fourier transform (FFT). The proposed method represented an alternative in solving \nsome problems arising from the on-line FRA technique such as filtering and results’ repeatability. The tests involved a 5-kVA 1150/345 \nV three-phase transformer and a 3-kVA, 7620/240 V single-phase transformer in the Universidad del Valle’s High Voltage Laboratory. \nKeywords: On-line FRA, on-load FRA, Fourier transform, MRA analysis, filtering, transformer, multi-resolution analysis. \n \nRESUMEN \nEl monitoreo en transformadores basado en la condición de operación (pruebas en línea) ha tenido un gran auge en los últimos \naños debido a que facilita detectar oportunamente situaciones de riesgo o limitaciones de utilidad que permita tomar decisiones \noportunas, antes de que ocurra una falla. Una de las técnicas en la cual se viene investigando con fuerza para el desarrollo en línea \nes el análisis de la respuesta en frecuencia (FRA), la cual se basa en obtener la respuesta en frecuencia (admitancia, impedancia, \no función de transferencia) del transformador en un ancho de banda determinado. El siguiente artículo presenta un método expe-\nrimental para obtener la respuesta en frecuencia con el transformador en servicio, por medio de la inyección de pulsos controlados \nsobre la señal de voltaje, usando un circuito electrónico externo. Una vez registradas las señales de voltaje y corriente, se usó la \ntransformada Wavelet mediante el análisis multirresolución (MRA) para el filtrado, lo que permitió obtener resultados sin problemas \nde ruido del sistema eléctrico; luego se obtuvo la función de transferencia en términos de la impedancia usando la transformada \nrápida de Fourier (FFT). De acuerdo con los resultados obtenidos, el método propuesto es una alternativa para dar solución a algu-\nnos problemas que se han presentado en la técnica FRA en línea hasta el momento, tales como el filtrado y la repetitividad en los \nresultados. Las pruebas fueron realizadas sobre un transformador trifásico de 5 kVA, 1150/345 V y un transformador monofásico de 3 \nkVA, 7620/240 V, en el Laboratorio de Alta tensión de la Universidad del Valle. \nPalabras clave: FRA en línea, FRA on-load, transformada de Fourier, análisis MRA, filtrado, transformador, análisis multirresolución. \n \nReceived: February 7th 2013 \nAccepted: March 15\nth 2013 \n12 \n \n                                                \n1 Eduardo Gómez -Luna. Ingeniero Eléctrico , Universidad del Valle, Colombia.  \nAffiliation: Universidad del Valle, Colombia.  \nE-mail: eduardo.gomez@correounivalle.edu.co \n2 Guillermo Aponte. PhD in Ingeniería con énfasis en Ingeniería Eléctrica , Universi-\ndad del Valle, Colombia. Affiliation: Universidad del Valle, Colombia.  \nE-mail: guillermo.aponte@correounivalle.edu.co \n3 Wilder Herrera. Ingeniero Eléctrico , Universidad del Valle, Colombia.  Affiliation: \nUniversidad del Valle, Colombia. E-mail: wilderh2@hotmail.com \n4 Jorge Pleite Guerra . PhD en Ingeniería con énfasis en Ingeniería eléctrica, Unive r-\nsidad Carlos III de Madrid, Spain. Affiliation: Universidad Carlos III de Madrid, Spain. \nE-mail: pleite@ing.uc3m.es \nHow to cite:  Gomez-Luna, E., Aponte, G., Herrera, W., Pleite, J., Experimentally \nobtaining on -line FRA in transformers  by injecting controlled p ulses., Ingeniería e \nInvestigación. Vol. 33, No. 1. April 2013, pp. 41-45. \nIntroduction  \nFrequency response analysis (FRA) is a technique which is used \nto evaluate the state of transformers; it is used worldwide as a \ncomplement and for supporting other diagnostic techniques. This \ntest leads to detecting possible mechanical problems, such as \ndisplacement or deformation in the windings or core plates \nwhich are quite difficult to locate when using other methods. \nTwo methods are used for obtaining the frequency response in \ntransformers according to the nature of the input signal. Sweep \nfrequency response analysis (SFRA) consists of injecting a period-\nic small-signal amplitude (1-20 VRMS) sinusoidal signal and vari a-\nble frequency in a Hz to MHz bandwidth, applied to one of the \nterminals. This measures the output signal at another of its te r-\nminals to obtain the transformer transference function, defined \nEXPERIMENTALLY OBTAINING ON-LINE FRA IN TRANSFORMERS BY INJECTING CONTROLLED PULSES  \n             INGENIERÍA E INVESTIGACIÓN VOL. 33 No. 1, APRIL 2013 (41-45) 42    \nas the quotient between input and output voltages for all fr e-\nquency points being measured. \nThe second method, impulse frequency response analysis (IFRA), \nuses an impulse-type single non-periodic signal, having a max i-\nmum value in the order of hundreds of volts and broad freque n-\ncy content. It is injected by any of the transformer’s accessible \nterminals as excitation or input signal; the output signal is, lik e-\nwise, measured at another transformer terminal and the fr e-\nquency response is thus obtained.  \nA particular transformer must be taken out of service (off-line) \nfor the FRA test (using the SFRA or IFRA method) which is why \nFRA with the transformer in service (on-line) is an attractive \nalternative, as this will permit the transformer to be monitored \nat all times and reduce the costs associated with performing the \ntest (Leibfried and Feser 1999; Krieg and Napolitano 2000; Feser \net al., 2000). \nSome work has dealt with testing frequency response with on-\nline transformers via the impulse technique (IFRA) (Christian et \nal., 1999; Vandermaar 2001; De Rybel et al., 2010; Gomez-Luna \net al., 2012); however, this has detected that certain aspects must \nbe improved, like recording equipment sampling frequency, \nfiltering noise by the power system and test repetition (Wang \n2003). The methods proposed until now fo r on -line IFRA have \nbeen based on pulses randomly generated by manoeuvres or by \natmospheric discharges, signals over which there is no control \nregarding the generated transient (Birlasekaran and Fetherston \n1999; René Wimmer 2004; (Coffeen 2003; Coffeen 2007; Cof-\nfeen et al., 2009) \nThis article proposes a new method for on-line IFRA by injecting \ncontrolled pulses. \nA proposed method for an on-line FRA test on \ntransformers \nThe proposed on-line IFRA experimental method consisted of \nthree stages (presented in Figure 1). \nVoltage Measurement On-\nline with wide bandwidth\n- Voltage sensors\nCurrent Measurement On-\nline with wide bandwidth\n- Current sensors\nData register\nFiltered\nMathematical \nprocessing of \nsignals \nInjection and measurement \nof the signal\nSignal processing \nObtaining of \non-line FRA\nInformation \nAnalysis \nObtaining and \nanalysis of information\nStage 1 Stage 2 Stage 3\nInjection of the signal in \nthe time domain  \n \nFigure 1. FRA test stages using on-line transformers \nStage 1 referred to injecting the excitation signal and its mea s-\nurement along with the output signal. Once the input/output \nsignal had been injected and measured, stage 2 dealt with signal \nmathematical filtering, recording and processing. Stage 3 consis t-\ned of obtaining the FRA curve using mathematical tools. \nStage 1: Injection and signal measurement  \nRegarding the injection system, an electronic circuit was specifically \ndesigned for injecting controlled pulses on the 60-Hz signal (Figures \n2 and 3). \nThe injection system allowed  the amplitude, width and phase of \nthe pulse generated on the 60-Hz wave to be chang ed, ensuring \nthat it had high spectral content and that there was total control \nover it. \nzero crossing \ndetector\n (LM 555) \nAC Power \nsupply \n(Rectifier)\nTransformer under \ntest (System and \nload)\nCoupling circuit for \nsending controlled \npulses (BTC)\nPower \nsystem\n \nFigure 2. Injection circuit block diagram \n120V \nAC\nLM 555\nLM 555\nC2\n1K 10K\n0,001μF\nVint \n3\n8 4\n1\n2\n5\n6\n7\n7\n6 \n8 4\n2\n     1  5\n3\n+ 12 V + V  8-18VDC\n+ 12 V \ntrigg\nR5\nR6R7\n33Ω\n    C3\n+\n--\nRectifier \nPotentiometer \nR1\nR2\nR3\nR4\nR8\nR9Transformer \nunder test  \nL\nO\nA\nD\nFerrite \ntransformer for \nHigh Voltage\nBushing Tap \nCoupler  \n(BTC)\n \nFigure 3. High-frequency controlled pulse injection circuit \nThe electronic circuit consisted of a 60-Hz wave (LM 555) zero \ncrossing detector for controlling the injection moment and a \npower transistor for generating a low-duration short circuit (µ \nsec) in series with a ferrite transformer. The pulse was co n-\ntrolled through the transistor’s saturation time. \nThe controlled pulse on the 60-Hz signal was the input signal for \nthe on-line IFRA test; it was sent to the LV side of the tran s-\nformer being tested through a high-voltage capacitor serving as a \nlow frequency high-pass filter and high frequency low-pass filter.  \nThe ferrite transformer isolated the injection circuit of the tran s-\nformer being tested. Figure 4 shows that the response (pulses in \nthe current signal) was in phase with the injected voltage signal. \n \nFigure 4. Controlled pulse regarding the 60 -Hz signal, applied to on -line \nIFRA measurement \nBroad bandwidth sensors, high-voltage sensors for the voltage \npulses and Rogowski coils for the current (Figure 5) we re used \nto measure the voltage and current signals thereby allowing \ntransient registry without saturation problems, bearing in mind \n\nGOMEZ-LUNA, APONTE, HERRERA AND PLEITE \n  \n                         INGENIERÍA E INVESTIGACIÓN VOL. 33 No. 1, APRIL 2013 (41-45)    43 \nthat the pulses were short duration and had high spectral co n-\ntent. \nHigh \nLow\nA\nV\nHigh \nLow\nA\nV\nZ\nZ\nA\nV\nCurrent sensor \n(Rogowski)\nVoltage sensor \n(High Voltage probe) \nSource pulse \ninjection \n \nFigure 5. On -line IFRA measurement scheme configuration in a tran s-\nformer \nStage 2: Signal registry and processing  \nThe controlled pulses on the voltage signals and the response \nones in the current signal could be affected by the electrical \nsystem’s harmonic distortion and background noise which is why \nsuppression signals had to be used for eliminating unwanted \nsignals.  \nIn this case, filtering techniques were used based on discrete \nwavelet transform (DWT) multi-resolution (MRA). A db4 mot h-\ner wavelet was selected to eliminate electrical system noise; it \nwas used to filter the electrical signal (Butler-Purry and Bagr i-\nyanik 2003; Zheng, Liu, and  Ma 2010). This decomposed low- \nand high-frequency signals by using high-pass g[n] and low-pass \nh[n] filters (as indicated in Figure 6: Dn represented high-\nfrequency information and approximations and An the low-\nfrequency information). \n \nFigure 6. Decomposition tree used for MRA analysis  \nMRA analysis of DWT was used to eliminate harmonics; howe v-\ner, in this case, the db10 mother wavelet was used with just the \nvoltage and current transient remaining to be analysed by signal \nprocessing and for obtaining the transformer’s frequency spe c-\ntrum.  \nA PCI-6115 data acquisition card (National Instrument) was used \nfor obtaining the signal registry (voltage-current). \nThe current and voltage temporal signal spectrum was obtained \nby mathematical processing of the fast Fourier transform (FFT), \ncalculating the transformer’s on -line impedance, Z(w), as qu o-\ntient  between voltage, V(w) and current, I(w) for all frequency \ncomponents. \n) (\n) () (\n) (\n) (\n\n\nt i\nt v\nFFT\nFFTZ \n (1) \nStage 3: Obtaining and analysing information \nThe signal spectra and transformer impedance computed from \non-line records, measured while the transformer was energised, \nwere juxtaposed with the corresponding frequency response \ncomputed from off-line measurements (SFRA method) using \nMegger FRAX 101 equipment in the test configurations shown in \nTable 1. Although the international standard for measuring fre-\nquency response (IEC 60076-18 2012) only considers open \ncircuit testing for off-line FRA, short circuit measurements have \nalso been considered in this study. \nTable 1. Measurement configurations for comparing on-line and off-line FRA \n Off-line FRA \n(equipment: Megger \nFRAX 101) \nOn-line IFRA \n(proposed method) \nCase 1 \nMeasurement at one winding \n(side 1) with no load in the \nother (side 2) \n- One winding (side 1) open. \n- Other winding (side 2) energised \n- Injection and measurement at open \nwinding (side 1) \nCase 2 \nMeasurement at one winding \n(side 1) with the other (side 2) \nshort circuited \n- One winding (side 1) with load \n- Other winding (side 2) energised \n- Injection and measurement at \nloaded winding (side 1) \nTable 1 was devised for providing a frame of reference to parallel \noff-line FRA and on-line IFRA methods. Case 1 considered no-\nload (open circuit) test conditions where the core magnetic \ncircuit effect was predominant. Case 2 concerned full-load situ a-\ntions where winding field leakage became significant. However, \nthe parallel was not complete in case 2, given that the short-\ncircuit test was performed with reduced voltage excitation (no \nsignificant core magnetic effects) for off-line FRA, whereas the \ntransformer had nominal voltage excitation for on-line IFRA tests \nto simulate on-line (in service) conditions.  \nExperimental validation \nInjection \nsystem Transformer \nunder test \nLoad\nPower \nsource\nRecorder  \nNI PCI 6115\nComputer \nsystem \n \nFigure 7. Experimental setup for on-line FRA \n\nEXPERIMENTALLY OBTAINING ON-LINE FRA IN TRANSFORMERS BY INJECTING CONTROLLED PULSES  \n             INGENIERÍA E INVESTIGACIÓN VOL. 33 No. 1, APRIL 2013 (41-45) 44    \nFigure 7 shows the experimental setup used for obtaining a \nfrequency response by injecting controlled pulses (indicating the \nmain on-line test components). \nThe proposed method was applied using load and no-load cond i-\ntions on the transformer shown in Figure 8. \nU X u x\nPower [kVA]:                     3 \nVoltage [V]:         7620/240\nCurrent [A]:         0.394/12.5\nPn\nHigh voltage winding Low voltage winding \nSingle-phase Transformer  \n \nFigure 8. Single-phase distribution transformer being tested \n \nFigure 9. Off -line FRA reference curve using Megger FRAX 101 equi p-\nment, measured at low voltage winding (ux) with high voltage winding \n(UX) open (see case 1, Table 1) \n \nFigure 10. Off -line FRA reference curve using controlled pulse (off -line \nIFRA) measured at low voltage winding (ux) with high voltage winding \n(UX) open (see case 1, Table 1) \n \nFigure 11. On -line IFRA measurement and pulse injection at low voltage \nwinding (ux) with high voltage winding (UX) energised by the power \nsource (see case 1, Table 1) \n \n \nFigure 12. Off -line FRA reference curve in short circuit conditions. Mea s-\nured at low voltage winding (ux) with high voltage winding (UX) short \ncircuited (See case 2, Table 1) \n \nFigure 13. On -line IFRA in load conditions. Measurements and pulse \ninjection made at low voltage winding (ux) with high voltage winding (UX) \nenergised by the power source (See case 2, Table 1) \n \nFigure 14. Comparing off -line/on-line IFRA curves at the low voltage \nwinding (ux) \nFigures 9 to 14 show the corresponding results. The transformer \nwas tested under 100% load, supplying power to a resistive load \nin the on-line IFRA tests in load conditions. \nThe results revealed a good response in the 10 kHz – 1 MHz \nrange; this may have been because the low-frequency signals \n(<10 kHz) were greatly affected by the filtering and load system.  \nThe high frequency range on-line curves had resonance which \nwas not present in the off-line curves; this could have been ass o-\nciated with the parasitic capacitance effect of the measurement \ncables, the load and the whole system connected to the tran s-\nformer, thereby making the impedance seen unequal. It could \nalso have been attributed to using two different sets of mea s-\nurement equipment (Megger FRAX 101 for off-line FRA and PCI-\n6115 recorder for on-line IFRA) and the difference between test \nconditions. Nevertheless, despite the differences between off-line \nand on-line curves, monitoring the transformer’s physical cond i-\n10\n4\n10\n5\n10\n610\n0\n10\n1\n10\n2\n10\n3\n10\n4\n10\n5 Off-Line FRA curve ux\nFrecuencia (Hz)\nImpedance |Z| (ohm)\n \n \nOff-Line Reference curve  \n10\n4\n10\n5\n10\n610\n0\n10\n1\n10\n2\n10\n3\n10\n4\n10\n5 Off-lineFRA curve \nFrequency (Hz)\nMagnitude |Z|\n \n \nOff-line reference curve\n10\n4\n10\n5\n10\n610\n0\n10\n1\n10\n2\n10\n3\n10\n4\n10\n5 On-line FRA Curve in the Low Winding\nFrequency  (Hz)\nImpedance |Z| (ohm)\n \n \nTest 1 on-line curve \nTest 2 on-line curve \nTest 3 on-line curve\n10\n4\n10\n5\n10\n610\n0\n10\n1\n10\n2\n10\n3\n10\n4\n10\n5 Off-line FRA at Low Voltage side. High voltage side short circuited \nFrequency (Hz)\nImpedance |Z| (ohm)\n \n \nOff-Line FRA curve \n10\n4\n10\n5\n10\n610\n0\n10\n1\n10\n2\n10\n3\n10\n4\n10\n5 On-line IFRA curve at loaded low voltage side\nFrequency (Hz)\nImpedance |Z| (ohm)\n \n \nTest 1 on-load curve\nTest 2 on-load curve\nTest 3 on-load curve\n10\n4\n10\n5\n10\n610\n0\n10\n1\n10\n2\n10\n3\n10\n4\n10\n5 off-line/on-line FRA curve \nFrequency (Hz)\nMagnitude |Z|\n \n \nTest 1 on-line curve\nTest 2 on-line curve \nTest 3 on-line curve \nTest 4 on-load curve\nTest 5 on-load curve\nTest 6 on-load curve\noff-line Reference \nGOMEZ-LUNA, APONTE, HERRERA AND PLEITE \n  \n                         INGENIERÍA E INVESTIGACIÓN VOL. 33 No. 1, APRIL 2013 (41-45)    45 \ntions was based on continuous tracking of changes in the fr e-\nquency response curve (either off-line or on-line), given that \ngood repetition of the curves was obtained with it, this being one \nof the basic FRA technique requirements for supporting tran s-\nformer diagnosis. \nSo far, all progress in relation to the on-line IFRA method i n-\nvolved using FFT for signal processing; however, by definition, \nthis tool would have been useful for processing stationary signals. \nTaking that into consideration, transient signal analysis could be \nhypothetically improved by using wavelet transform for signal \nprocessing, given its variable time/frequency resolution (Gomez-\nLuna et al., 2012; Duarte et al., 2012), thereby forming the basis \nfor future work which the authors are currently working on.  \nConclusions \nThis article has contributed towards obtaining a frequency r e-\nsponse in on-line transformers by injecting controlled pulses into \nthe 60-Hz wave. \nAlthough the experimentally proposed method was viable, fu r-\nther signal processing research is needed, given that measur e-\nments sometimes become altered by the noise present in a \npower system, thereby affecting measurement repetition. \nThe on-line impedance at high frequencies differed from the off-\nline measurement.  This may have been due to the effect of the \nparasitic capacitance associated with the measurement cables and \nthe load connected to the transformer. \nWork on on-line IFRA has involved using the Fourier transform \nas the mathematical tool to date; the method proposed here has \nsuggested using wavelet transform, given its good response in \nanalysing transient signals. \nAcknowledgments  \nThe authors would like to express their gratitude to COLCIE N-\nCIAS for the finance received through project 494-2009, as well \nas Spanish government financing through project DPI2008-05890. \nWe would also like to thank the Universidad del Valle’s High -\nVoltage Laboratory and the Research Vice- Rector’s office for \nproviding funding, facilities and making equipment available for \nthe tests. \nReferences  \nBirlasekaran, S. & Fetherston, F., Off / On-Line FRA Condition Moni-\ntoring Technique For Power Transformer. IEEE power Engineering \nReview, (732), 1999, pp.54–56. \nButler-purry, K.L. & Bagriyanik, M., 2003. Characterization of trans i-\nents in transformers using discrete wavelet transforms. IEEE \nTransactions on Power Systems, 18(2), 2003, pp.648–656. \nChristian, J. Feser, K. Sundermann, U. Leibfried, T. Diagnostics of \npower transformers by using the transfer function method. Co n-\nference Publication No. 467, High Voltage Engineering Symposi-\num, 22-27 August 1999. \nCoffeen, L. Mcbride, J. Woldemariam, N. Benach, J. A Summary \n \n \n \n \n \n  \n \nof NEETRAC On-line Frequency Response Analysis ( FRA ) a New \nEPRI Commercial Prototype FRA Installation at First Energy. NEET-\nRAC and EPRI, EPRI Substation Equipment Maintenance Optim i-\nzation & Diagnostics Conference San Antonio, TX March 2009, \npp.1–24. \nCoffeen, L. Cantrelle, D. and Mango J. On-Line Monitor Tracks \nTransformer Health. Transmission & Distribution World; Vol. 59 I s-\nsue 10, p62, Power & Light; October. 2007. [Online], Available: \nhttp://connection.ebscohost.com/c/articles/27325791/on-line-\nmonitor-tracks-transformer-health \nCoffeen, L. System and Method for On-Line Impulse Frequency \nResponse Analysis. U. S, Patent 6549017B2, April 15, 2003. \nDuarte, C. Delmar, P.  Goossen, K. Barner, K. Gomez-Luna E. Non-\nIntrusive Load Monitoring Based on Switching  Voltage Transients \nand Wavelet Transforms. International Workshop Future of I n-\nstrumentation (FIIW), pp. 1-4, October 2012. \nDe Rybel, T. Singh, A. Pak, P. and Marti, J. R. Online Signal Inje c-\ntion Through a Bus-Referenced Current Transformer. IEEE Tran s-\nactions on Power Delivery, vol. 25, no. 1, pp. 27-34, January \n2010. \nFeser, K. Christian, J. Leibfried, T. Kachler, A. Neumann, C. Su n-\ndermann, U. Loppacher, M. The Transfer Function Method for \nDetection of Winding Displacements on Power Transformers a f-\nter Transport, Short Circuit or 30 Years of Service. CIGRE, Paris,. \n2000. pp. 1-13. \nGomez-Luna, E. Aponte, G. Gonzalez-Garcia, C. Pleite, J. Current \nStatus and Future Trends in Frequency-Response Analysis with a \nTransformer in Service. IEEE Transactions on Power Delivery, D e-\ncember 08, 2012, pp.1 –8. Accepted for publication. DOI: \n10.1109/TPWRD.2012.2234141. \nGómez-Luna, E. Silva, D. Aponte, G. Pleite, J. and Hinestroza, D. \nObtaining the electrical impedance using wavelet transform \nfrom the time response. IEEE Power Eng. Lett., Dec. 04, 2012, \naccepted for publication. Digital Object Identifier: \n10.1109/TPWRD.2012.2234942. \nIEC 60076-18 International Standard: Power transformers. Part 18: \nMeasurement of Frequency Response International Electr o-\ntechnical Commission, Ed. 1, July 2012. \nKrieg, T. & Napolitano, M., Techniques and experience in on-line \ntransformer condition monitoring and fault diagnosis in Electr a-\nNet SA. International Conference on Power System Technology. \nProceedings, 2000, pp.1019–1024.  \nLeibfried, T. and Feser, K. Monitoring of power transformers using \nthe transfer function method.  IEEE Transactions on Power Deli v-\nery, vol. 14, no. 4, pp. 1333-1341, Oct. 1999. \nVandermaar, A. On-line Frequency Response Analysis System. \nDevelopment of Specifications. EPRI Project Manager, Tec h-\nnical      Progress, Development of Specifications No. 1001942, \nEPRI, Palo Alto, Canada, December 2001. \nWimmer, R. and Feser, K. Calculation of the transfer function of a \npower transformer with online measuring data. II International \nConference on Advances in Processing, Testing and Applic a-\ntions of Dielectric Materials, pp1-5, September 2004. \nWang, M. Winding movement and condition monitoring of power \ntransformers in service. Department of Electrical and Computer \nEngineering, Thesis PhD, University of British Columbia, 2003. \nZheng, E. Liu, Z. Ma. L. Study on Harmonic Detection Method \nBased on FFT and Wavelet Transform. 2nd International Confe r-\nence on Signal Processing Systems, (ICSPS). Pp. 1-4 IEEE 2010. ",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.5763468742370605
    },
    {
      "name": "Electrical impedance",
      "score": 0.5276787877082825
    },
    {
      "name": "Electronic engineering",
      "score": 0.5193951725959778
    },
    {
      "name": "Frequency response",
      "score": 0.49221816658973694
    },
    {
      "name": "Electrical engineering",
      "score": 0.4723818302154541
    },
    {
      "name": "Engineering",
      "score": 0.4567822217941284
    },
    {
      "name": "Frequency domain",
      "score": 0.45290523767471313
    },
    {
      "name": "Transfer function",
      "score": 0.4414724111557007
    },
    {
      "name": "Voltage",
      "score": 0.39676323533058167
    },
    {
      "name": "Acoustics",
      "score": 0.3618085980415344
    },
    {
      "name": "Computer science",
      "score": 0.33012861013412476
    },
    {
      "name": "Physics",
      "score": 0.1537255048751831
    },
    {
      "name": "Computer vision",
      "score": 0.0
    }
  ]
}