{
    "title": "Rigid conformal polishing tool using non-linear visco-elastic effect",
    "url": "https://openalex.org/W2170583573",
    "year": 2010,
    "authors": [
        {
            "id": "https://openalex.org/A2134865345",
            "name": "Dae Wook Kim",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2041159029",
            "name": "James H. Burge",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2102920442",
        "https://openalex.org/W1976047846",
        "https://openalex.org/W2063514146",
        "https://openalex.org/W2031598767",
        "https://openalex.org/W2147472207",
        "https://openalex.org/W1969865153",
        "https://openalex.org/W756952289",
        "https://openalex.org/W2068642019",
        "https://openalex.org/W2055540940",
        "https://openalex.org/W1972590250",
        "https://openalex.org/W2007500672",
        "https://openalex.org/W2095049505"
    ],
    "abstract": "Computer controlled optical surfacing (CCOS) relies on a stable and predictable tool influence function (TIF), which is the shape of the wear function created by the machine. For a polishing lap, which is stroked on the surface, both the TIF stability and surface finish rely on the polishing interface maintaining intimate contact with the workpiece. Pitch tools serve this function for surfaces that are near spherical, where the curvature has small variation across the part. The rigidity of such tools provides natural smoothing of the surface, but limits the application for aspheric surfaces. Highly flexible tools, such as those created with an air bonnet or magnetorheological fluid, conform to the surface, but lack intrinsic stiffness, so they provide little natural smoothing. We present a rigid conformal polishing tool that uses a non-linear visco-elastic medium (i.e. non-Newtonian fluid) that conforms to the aspheric shape, yet maintains stability to provide natural smoothing. The analysis, design, and performance of such a polishing tool is presented, showing TIF stability of <10% and providing surface finish with <10A roughness.",
    "full_text": null
}