{
  "title": "Use of Social Networks as an Educational Tool",
  "url": "https://openalex.org/W2185106712",
  "year": 2011,
  "authors": [
    {
      "id": "https://openalex.org/A5007595023",
      "name": "Filiz TİRYAKİOGLU",
      "affiliations": [
        "Anadolu University",
        "Usak University"
      ]
    },
    {
      "id": "https://openalex.org/A5010302490",
      "name": "Funda Erzurum",
      "affiliations": [
        "Anadolu University",
        "Usak University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W7009789882",
    "https://openalex.org/W2132004355",
    "https://openalex.org/W6813993340",
    "https://openalex.org/W4244323574",
    "https://openalex.org/W237234726",
    "https://openalex.org/W2191478007"
  ],
  "abstract": "Social network, particularly Facebook, can be defined as a unique online service, platform, or area where social communication and/or social relations can be established and individuals intensely share information. This definition implies that communication specialists should have more expertise and interest in social media than any other group of experts. Based on this assumption, the present study investigated the views and attitudes of instructors in the Faculty of Communication Sciences at Anadolu University in Turkey, which is a country where the total number of Facebook users ranks fourth in the world. The sample of the study consisted of 67 professors with various levels of academic titles. Data were gathered through a specially-designed survey form including 52 items in four subcategories. Results suggest that three fourth of instructors have a Facebook account and they spend less than half an hour per day on Facebook. There is no gender-related difference among the faculty in terms of attitudes toward Facebook. Instructors who are younger than 45 years old login Facebook on daily basis, while senior faculty login several times a week. Two in every three instructors use Facebook mainly as a tool of communication with friends. Finally, two thirds of the faculty think that Facebook can provide important contributions to social interactions among students as well as to communications between instructors and students.",
  "full_text": "CONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n135 \n \nUse of Social Networks as an Education Tool \n \n \n \nFiliz Tiryakioglu \nFunda Erzurum \nAnadolu University, Turkey \n \n \n \nAbstract \nSocial network, particularly Facebook, can be defined as a unique online service, platform, \nor area where social communication and/or soci al relations can be established and \nindividuals intensely share information. This def inition implies that communication \nspecialists should have more expertise and interest in social media than any other group \nof experts. Based on this assumption, the prese nt study investigated the views and \nattitudes of instructors in the Faculty of Communication Sciences at Anadolu University  in \nTurkey, which is a country where the total number of Facebook users ranks fourth in the \nworld. The sample of the study consisted of 67 professors with various levels of academic \ntitles. Data were gathered through a specially -designed survey form including 52 items in \nfour subcategories. Results suggest that three fourth of instructors have  a Facebook \naccount and they spend less than half an hour per day on Facebook.  There is no gender -\nrelated difference among the faculty in terms of attitudes toward Facebook. I nstructors \nwho are younger than 45 years old login Facebook on daily basis , while senior faculty login \nseveral times a week.  Two in every three instructors use Facebook mainly as a tool of \ncommunication with friends. Finally, two thirds of the faculty  think that Facebook can \nprovide important contributions to social interactions  among students as well as to \ncommunications between instructors and students. \n \nKey Words: Facebook; Social networks; Communication technologies; Educational tools \n \n \nIntroduction \n \nStarting with emergence of the Internet as a public sphere, many unprecedented changes have \noccurred in communication types and  formats in  daily life.  Face -to-face communicatio n in \ninterpersonal relationships has been gradually replaced with communications via technological \ndevices. This change has  also been associated with new types of relations hips (Murray, 2008, \np.8). Social networks within the scope of social media are  almost at the heart o f these virtual \ncommunication forms. \n \nSocial networks are platforms for virtual social lives created by people over the Internet. \nIndividuals define thems elves in such networks so that  they communicate with other people \nsharing same or different cultural backgrounds/dimensions through powerful communication  \nopportunities provided by the Internet. \n \nThe first known network in this area is considered the SixDegrees which was constructed in \n1997.  Particularly after 2003, rapid  and important developments were  experienced in social \nnetworks; consequently the number of users has increased quickly. The worldwide growth of \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n136 \n \nsocial communication networks gained incredible pace and popularity. Among these networks, \nthe most common one is known as Facebook (Toprak et al., 2009, p.27).  \n \nAs of February 2011, Facebook has more than 500 millions of users  around the world . Fifty \npercent of total users  actively login the site every day. Users spend a total of 700 billion \nminutes per month on  Facebook. More than 200 million users have mobile connection to \nFacebook.  There are about a billion of  locations (page s, group s, activities etc. ) in Facebook \nwhere users interact with each other. An ordinary user is connect ed to 80 groups, activities or \nsociety pages and  shares an average of  90 contents per month. More than 30 billions of \ncontents per month are shared by users (http://www.facebook.com). \n \nWhen over 500 millions of peopl e worldwide started to spend a substantial part of the ir daily \nlives in Facebook, this social network also attracted interest of sociologists and psychologists. \nAccording to researchers, social networks improve communication skills, enhance participation \nas well as  social commitment, reinforce peer support , and ensure realization of education \nbased on collaboration  strategies. Furthermore, social net working sites can be easily and  \ninexpensively used without substantial support from universities . That is als o to say that  they \ncan be successfully integrated into education al processes. In appears that t his type of use \nrapidly becomes widespread all around the world (Gulbahar et al., 2010, p.2). \n \nIt is a fact that F acebook is the larg est social network with the biggest audience compared to \nsimilar media , particularly becaus e it enables people communicate with their friends and \nexchange multimedia-based information conveniently. Hundreds of people, unaware of each \nothers, may gather around a particular purpose  via this social network and they may even \ndecide to act together. Many i ndividuals increasingly spend more time on this new medium. \nDespite it is generally accepted and as a social network , Facebook could also gain a unique \nposition as a learning technology for educational purposes. \n    \nWith a population of 26.198.200 Facebook users, Turkey ranks fourth in the world , following \nthe United States , I ndonesia, and the United Kingdom.  A lso, 34% of the country’s general \npopulation and 75% of the population with Int ernet access login the Facebook. Approximately \n36% of the Turkish  users are women and 64 % are men . As far as age groups are concerned, \n67% are between 18 and 34 years, 20% are younger than 18 years, and the remaining 15% are \nabove 34 years (http://www.socialbakers.com). These figures imply that Facebook has a great \npotential for education of relatively young population of Turkey. \n \nAn interesting example in this area was presented by Heather Rogers of the Haversack Towson \nUniversity.  She used the Facebook Group titled “Female of 324 Reading Methods Group” for \nmeeting teacher candidates in a reading class. The group functioned a s a platform where class \nworks were discussed, questions were asked, opinions were critici zed, information was sent, \nand views we re supported. The researcher  recommended the construction of book clubs for \nsupporting students read, performing book discussion , and using  social networks for sharing \nreadings. She also mentioned that these social ne tworks might be used in courses like history \nand literature, preparing cultural guides and p rogramming applications (Gulbahar et al., 2010, \np.3). \n \n \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n137 \n \n \n \nFigure 1. Use of Facebook in Turkey by Age Groups (http://www.socialbakers.com). \n \n \nMethods \n \nThis study investigated the views and attitudes of academics regarding the use of Facebook for \neducational purposes. The study wa s conducted to test the hypothesis stating that  “Although \ninstructors who are older than 45 years old use Facebook in daily communication, they do not \nbelieve in the use of Facebook for educational purposes.” \n \nThe data were gathered through a survey (a mixture of a questionnaire and a Likert-type scale) \nfrom instructors of the Faculty of Communication Sciences at Anadolu University in Turkey. As \nknown, communication faculties are academic institutions providing educational opportunities \nto train qualified personnel for various areas of specialization  in the media sector. Thus , it is \nexpected that instructors of communication faculties should have more expertise and interest \nin social media including social networks.  \n \nThere were a total of 75 instructors in four departments of the Faculty of Communication \nSciences at Anadolu University including lecture rs, assistant professors, associate professors, \nand full professors. The questionnaires were  distributed to all 75 instructors but 67 of them \nwere returned. Graduate assistants were not included in the study. The reason for this choice \nwas that they are no t authorized to teach classes independently or without supervision of a \nprofessor. Analysis of data was performed by using SPSS version 16.0. \n \nThe survey form included a total 52 items in 4 categories in order to collect information about \ndemographics of the participants, adoption level of Facebook, purpose for using Facebook, and \nviews on educational use s of Facebook. The survey form was reviewed and approved after \nsome revisions by a panel of experts working on communication technologies. The validation \nof the survey was checked through a pilot test implemented in the same faculty before the \nactual implementation. \n \nItems in the first category of the survey aimed to determine personal information about the \nparticipants. Age, gender, title , experience  etc. w ere asked. Items in the second category, \nasked to what degree they adopted Facebook . I tems in the third category  asked for what \npurposes the participants used Facebook in daily life (f inding friends, having good time, \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n138 \n \nobtaining information, communicating with other people etc.). Items in t he fourth category \naimed to find out the views and attitudes of the participants regarding the use of Facebook for \neducational purposes.  \n \nDue to the nature of the study, descriptive statistical techniques were used in ana lyzing and \nreporting data. The findings were presented in relevant tables or figures and corresponding \ninterpretations followed right after them. \n \n \nTheoretical Framework \n \nSocial Media versus Conventional Media \n \nSocial m edia is a common concept which gained  its position and popularity in our life as a \nrecent consequence of Web 2.0. It refers to the locations with highly accessible and sharable \ncontent. It has become more widespread through  social interaction using Internet and W eb \nbased technologies. In othe r words, the concept of social media  refers to platforms such as \nsocial networks, blogs, micro -blogs, and forums where self -generated contents of users are \nshared by the user like a publisher. The possibility to make shared content reach more  people \nmay be increased when they are shared with popular individuals or if the shared content gains \ngood interest. People share any and all types of personal experiences ranging from l ife stories \nto usefulness of a  product or service purchased through social media such as Facebook, \nFriendfeed, Myspace, Twitter, and Youtube.  \n \nHaving a position in the “conventional m edia” such as radio, television, newspaper etc . is \nassociated with many challenges such as high costs and lim itations pertaining to access  to \narchived information. On the other hand, ability to be in “social m edia” mostly requires only \nInternet access. In short, specialization is not a prerequisite for content generation  in social \nmedia (http://eticaret.garanti.com.tr). \n \nSocial media differs from conventional media. In general, particular resources are required for \npublishing information in conventional media; while social media is relatively without cost, and \naccess devices are open to everybody. User is defined as a consumer-producer. It has active \nposition as defined in the uses and gratifications approach. It both generate s and consumes \nthe content. I t also has the ability to perform this in an interactive manner. The common \ncharacteristic of social media and conventional media is the ability to reach small  or large \naudience.  The content may reach nobody or to millions of people. Features providing support \nin determining differences between social media and conventional media may vary depending \non the method used. Those features may be listed as follows: \n \n Access – Both conventional media and social media technologies enable everybody \nreach a particular audience. \n \n Accessibility – Production for conventional media is generally possessed by private \ncompanies and governments; social media tools can be, in ge neral, used by \neverybody with a low cost or no cost. \n \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n139 \n \n Availability – Production of conventional media usually requires specialized skills and \ntraining. This is not valid for most productions of social media or in some cases, skills \nare completely different and everybody may complete production. \n \n Novelty – The time difference in conventional media communications (days, weeks , \nand even months) can be longer in comparison with the social media enabling instant \neffect and reaction. The time difference of reaction is decided by participants.  \n \n Permanence – Conventional media cannot be changed after it is produced and \npublished, whereas social media can be immediately changed via comments and \nrepurposing. \n \n Following introduction of social media into our life, many issues in human life started \nto change; since content is produced by the user, creativity gained importance and \nparticipation took center stage. The strict differentiation between producer and \naudience of the content in conventional media is gone (http://www.asiamedia.ucla. \nedu/article). \n \n \nSocial Networks \n \nIn general, s ocial network can be defined as an online service, platform , or area where social \ncommunication and relations can be established, and also individuals share information. Social \nnetworks offer the user ability to share online their views, feelings, activities, events, and fields \nof interest.  \n \nToday, many social network sites emerged, which reshaped communication, interaction, \ncollaboration, and efforts of people. Degree of participation to social networks also constantly \nincreases. Individuals may define themselves over Internet in the social life and they become a \nmember of social networks in order to reach and communicate with friends of similar cultural \nlevel, field of interest, common background , and mutual friends. Thus, a group of friends can \nbe enlarged and information exchange is enabled (Jordan, 1999, p.191).   \n \nPeople login social networks for different purposes. This condition leads to the fact t hat \nprivate lives are known by and shared with hundr eds or even thousands of people who do not \nknow each other. Social network sites have become an extremely  important tool for sharing \ncommunication and obtaining new information as well as making new friendships. Moreover, \nsocial network environments offer possibilities for personal statements, creating interest  \ngroups, ensuring cooperation, and sharing information. Using several mouse clicks, people may \nsend each other videos, images, or any other content (Aydogan & Akyuz, 2010, p.66).  \n \nAccording to Perlman and Miller (2008), social sharing networks, which make people share all \ndetails of their lives with whole world , remove the sense of shame. However, it is also at the \nheart of many scientific claims ran ging from health problems, loss of future job opportunities \nto conversion of users into “monster” due to deepening of jealousy and narcissism. After all, \nsocial sharing networks became an inevitable part of human life. \n \nAccording to researchers, social networks improve communication skills, enhance participation \nand social commitment, reinforce peer support , and ensure realization of education based on \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n140 \n \ncollaboration. Moreover, social networking sites can be easily and inexpensively used without \na substantial support from universities so that they can be integrated into educational process \nof students. Thus, following graduation from the university, student s will have possibilities to \nre-access learning process over the Web and continue his/her studies (Gulbahar, Kalelioglu, & \nMadran, 2010).  \n \n \nSocial Networks in Educational Environments \n \nSocial network sites offer  several possibilities such as socialization of individuals, ability to \ncommunicate with people living worldwide, ability to be a member of group wh ich cannot be \npossible in real life due to geographical and physica l constraints, self-expression and ability to \nreceive information and share it. Problems pertaining to confidentiality, misuse of information \nand social network dependence are also undeniab le facts. However, it is possible to make \nsocial networks advantageous through positive uses.  \n \nSocial networks can also be successfully used in the field of educ ation. Seguin and Seguin \n(1995, p.30) recommends educators that they may gain benefits such as  program exchanges, \njob announcements , creating relief funds or  searching such funds, arranging concurren t or \nnon-concurrent conferences, and publishing studies conducted by them selves or their \nstudents. Moreover, studies such as course plans, activities e tc. can be more efficient ly used \nby a larger number of educators over a database.  \n \nWhen we examine advantages deriving from the use of social networks as an educational tool, \ninteractivity a nd participation provided by such  environments should be also mentioned. \nAdvantages possibly deriving from use of social networks as an education tool can be listed as \nfollows (Balci, 2010, p.466). \n \n Independence from time and location \n Improvement in quality, success, and efficiency of education by use of computer for \neducation \n Ability to learn in more systematic manner and in shorter time due to advances in \ncomputer technology \n Individualization of learning \n Ability to have instant feedback \n Offering the student ability to repeat course content as much as desired \n Ease of displaying the content \n Allowing to the design of visual and auditory learning environments \n Ability to present courses that require  laboratory applications to students via \nsimulation, animation, and virtual laboratories \n Archiving course content and synchronized class (virtual class) applications \n Bidirectional communication \n Tendency towards more voluntary behaviors on the side of students for  improving \nresearch, knowledge, and skills in comparison to conventional programs \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n141 \n \n Offering possibility to evaluate performance of students \n Minimizing risk of error in measuring evaluation results \n Improving skills of students and teachers to reach, evaluate, use, and efficiently cite \nthe knowledge. \n \n \nFacebook \n \nFacebook is a social network which ai ms to enable people communicate with friends and \nexchange information. Being developed by Mark Zuckerberg, a student at  Harvard University, \nin 4 February 2004, Facebook is primarily constructed for enabling communication between \nHarvard students. Later, it covered schools located arou nd Boston and it started to accept \nmembership of all students and graduates from all schools in the United States of America \nwithin one year. While individuals may become member using only e -mail a ddress of the \nrelevant school high schools and some large c ompanies were added to the network and \nFacebook was opened to all e-mail addresses with some age constraints in 11 September 2006 \n(http://www.Facebook.com). \n \nFacebook is an online social network software which enable s users connect to each other via \nprivate or public correspondences based on different authorization levels in networks and join \nother groups and share contents with other users.  Similar to other online social network sites \n(i.e. Friendster, MySpace), user s define themselves via online profile, gain friendships , and \nwrite comments or information to profiles of others or the social content. \n    \nSince social communication networks are highly new, studies on their uses in  education are \nvery scarce. Based on several studies, a substantial proportion of student s spend  non-\nnegligible time in such social networks (Jones, Bl ackey, Fitzgibbon, & Chew, 2010, p. 776). This \ntrend shows that education al environments constructed in social networks will better attract \nattention of students . When this is done successfully, it is often stated that educational \nexperiences will be more effective. \n \n \nFindings \n \nPersonal Details \n \nA total of 75 instructors work in the Faculty of Communication Sciences at Anadolu University. \nSince thr ee instructors (o ne professor and two associate professor s) we re commissioned to \nwork in other universities, they could not participate in the study. Therefore, survey form  \ncould be delivered to 72 instructors. Of  them, 18 were full professor s, 15 were associate \nprofessors, 26 were assistant professors, and 13 were l ecturers. Responses could be obtained \nfrom 67 faculty members and 5 instructors did not return the completed survey. \n  \nOf the faculty members participating in the study, 30 were female and 37 were male. This is \nconsistent with the overall gender distribution. \n \nThe age group of 41 -45 years had more participants (24 persons-36%) than any other group. \nThis indicates that most of instructors lecturing in the faculty are in middle ages . Of the \nremaining participants, 18  (27%) were in the age group of 30 -40 years, 11 (16 %) were in the \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n142 \n \nage group of 46-50 years, 6 (9%) were in the age group of 51-55 years, and 8 (12%) were above \n56 years old.  \n \n \nUse of Facebook \n \nFifty of 67 instructors (75%) responding the survey have a Facebook account.  Of 50 instructors \nwith an account, 25 are female and 25 are male. It is observed that Facebook users are heavily \nfelt in the age range of 41-45 years.  \n \nThe instructors who \nhave a Facebook \naccount \nThe instructors who \nthink positively about \nFacebook \nThe instructors who \nuse Facebook every \nday \nThe instructors who \nspend half an hour or \nless on Facebook \n50  (74%) 33 (66%) 28 (56%) 37 (74%) \n \nFigure 2. Behaviors of Participants Concerning Use of Facebook \n \nTwenty-eight of partic ipants (56 %) stated that they check their Facebook account daily; 14 \n(28%) stated that they login  Facebook account several times a week; 6 (12%) stated several \ntimes a month ; and finally 2 participants (4%) said that they check their Facebook accounts \nseveral times a year. \n  \nNo significant difference between gender and frequency of use could be found. When we \nexamined the relationship between age of participants and frequency of use, it was found that \nthe participants aged under 45 years had daily logins to the Facebook. When the time spent is \nexamined, it is obser ved that 37 of participants (74 %) spend half an hour or less per day. Of \nparticipants, only 1 participant stated more than 3 hours time spent in Facebook.  \n \nConsidering the responses to questions a bout group membership, which is an indicator of \nbeing active in Facebook, it  is found that 34 participants (68%) had group membership. No \nsignificant difference is present with regard to  the age and group membership . However, it is \nobserved that tendency of male participants towards group membership is higher than female \nparticipants. When membership to groups pertaining to Internet and technology is particularly \nexamined, it is revealed out that no female participant is a member of such groups. When \ndistribution of group memberships is probed  further, it was found that 30 participants were \nmembers to student groups, 40 were members  to common interest groups, 5 were members \nto I nternet and technology groups and 18 were members to organi zation and corporation  \ngroups. I t is noted that one participant had a membership to more than one group  and all \nparticipants who were members to I nternet and technology groups were male. When \nrelationship between age and group membership is examined, it is observed that partici pants \nwho were members to a group were younger than 45 years old (79%). Users who were older \nthan 55 years have no group membership at all.  \n \n \nAdoption of Facebook  \n \nResponses given to questions for determining adoption of Facebook indicates that instructors \nadopted Facebook and they regularly use it. T hirty-seven participants (74 %) agreed that they \nbenefited from the possibility of communicating with more than one participant. Twenty-eight \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n143 \n \nparticipants (56%) stated that they could share more things within shorter time. Nu mber of \nparticipants who agreed that views and information shared in Facebook contributes to the \npersonal development by offering different perspectives  was 19 (38 %), 14 participants (28%) \nwere neutral to this question and 16 (32%) did not agree.  \n \n \n \n \nFigure 3. Adoption of Facebook \n \nThirty-three participants (66 %) had positive views  about Facebook, while 1 participant  was \nnegative. Almost all participants (96%) agree that membership to Facebook is easy, but only 33 \nparticipants (66%) stated that use of Facebook is easy.  \n \nForty-one participants (82%) did not agree that they use Facebook since valued people use it , \nand again 41 participants (82%) disagreed with the statement that they started to use it upon \nrecommendation. Twenty-five participants (50%) stated that they were using Facebook since \ngroup of friends, relatives, and akin etc. also uses it; while 8 participants (16%) were neutral to \nthe view.  \n \nTwenty-eight participants had positive views on ability to reach information and resource s \nrequired for using Facebook, while 18 participants (36%) were neutral about ease of getting \nsupport and additional 23 participants (46%) stated that they could easily get support.   \n  \nConsidering the similarity of Facebook with other sharing and communic ation environments, \n27 participants (54%) stated similarity, 12 (24%) stated they were neutral and 11 (22 %) stated \ndissimilarity. With regards to access to Facebook at any time at anywhere with Internet access, \n41 participants (82%) stated positive approach. \n \nThirty-one participants (62 %) stated that they customized Facebook profiles. When rates \npertaining to learning and arranging activities via Facebook are examined, it i s observed that \n25 participants (50%) had positive attitude, 14 (28 %) were negative and 11 participants (22%) \nwere neutral.  \n \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n144 \n \nThirty-seven participants (74%) stated that they were acting based on their personal interests \nand needs. Considering the item about approaches to create groups, 31 (62%) stated negative \nattitudes, while 19 (38%) agreed that groups reinforce communication and relations, 20 (40%) \nstated the disagreement and 11 participants (22%) were neutral.  \n \nParticipants using Facebook for collaboration with individuals shar ing common interests and \naims consisted of 16 instructors (32%). With regard to  the same question, 14  (28%) were \nneutral, and 20 participants (40%) disagreed.  \n \nWith consideration to meeting with others having common field of interes t via Facebook, 19 \nparticipants (38%) had positive and 19 participants (38%) had negative attitude, while other s \nstated that they were neutral.   \n \nFifteen participants (30%) mentioned that they had good time via applications such as games \nin Facebook, while 31 participants (62%) stated that they did not use such applications. \n \nWhen ove rall approach to Facebook is considered, it was revealed out that instructors had \npositive attitudes and they were using the network particularly for co mmunicating and \nsharing. T he use for making announcement to and sharing with friends in the profile list  is \nwidespread. It is also used for learning reactions of others to events and messages shared and \nfor forming an opinion. Instructors found participation to social networks  easy, learning the \nuse of this environment not difficult, and the software user-friendly. It appears that Facebook \nprovides support for enabling users communicate and share comfortably and easily.  \n \nDisagreement of instructors to the view that they joined Facebook upon recommendation or \nas others are p resent in this environment indicates that absence in this environment is their \npreference. They join Facebook since they found it beneficial and they actively use interactivity \nof the environment. It is easy to login Facebook from anywhere with Internet access. \nInstructors customize the acc ount such that it reflects the owner of the account and their \nneeds and learning activities are arranged and shared with friends on this environment. A \npositive approach is also observed considering the view that joining groups would reinforce \ncommunication and relations. However, there is a negative attitude towards the use of the site \nfor collaborating with individuals having common field of interest. Games are among attractive \napplications of the Facebook  too. Facebook users are interested in games playe d in virtual \nenvironment such as Farmville, Diner dash etc. and they recommend friends participate to \nthose games. It is revealed out that a substantial part of instructors do not participate to such \napplications. Instructors use Facebook largely for being  informed about developments related \nto friends in the ir list, communicating with friends  as well as relatives , sharing content, and \ngetting or providing feedback.  \n \n \nIntended Use of Facebook \n \nThe interactivity which always  increases due to the improving t echnology laid the ground for  \nnew information and communication environments . Social n etworks are one of these new \ncommunication environments. Individuals communicate, interact, cooperate , and even carry \nout their learning activities through these networks . People are connected to social networks \nalmost every day and they spend some time there, which increases day by day. Many people \nfrom different age groups join social n etworks for different purposes and the number of users \njoining the social n etworks is gradually increasing. As mentioned before, the total number of \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n145 \n \nFacebook users in the world is above 500 million . The incred ible development of the social \nnetworks are mainly due to  the ability of sharing  of personal lives with different individuals, \nlearning of daily news and events , and exchanging information. All these are  happening in \nsocial networks with remarkable speed and precision.  \n \n \n \nFigure 4. Intended Use of Facebook \n \nOne participant chose not to answer the  questions in this section, while 2 participants chose \nnot to answer two questions. While 20 participants (40%) stated that they occasionally use \nFacebook to find their former friends, 16 (32%) stated that they often find their former friends \nvia Facebook. These answers appear to be suitable fo r the opening purposes of Facebook. It is \nan effective environment in establishing and maintaining social networks. Similarly, the use of \nFacebook to communicate with friends is high (75%). Twenty-four participants (49%), on the \ncontrary, stated that they never use Facebook to make ne w friends. 12 participants  (24%) \nstated that they sometimes use Facebook for this reason, only 2 participants ( 4%) stated that \nthey often use it. \n    \nAs far as responses to the question about the use of Facebook to communicate with people \nwho have common hobbies and needs  are concerned, 14 participants (28%) answered \n“Never”, 14 (28%) answered “Sometimes”, and 15 participants (30%) answered “Sometimes”.  \n \nConsidering the use of Facebook in terms of people’s share of different in formation and \nsources with each other, 17 participants (34%) answered  “Sometimes”, 17 (34%) answered \n“Often”, 3 (6%)  answered “A lways”, 6 (12%) answered “R arely”, and 6 participants (12%) \nanswered “Never”.  \n \nThe participants stated that they do not share the sources such as assignments and projects on \nFacebook, 16 participants (32%) stated that they never use this environment for this purpose. \nA similar situation is also observed in the use for the support of the academic studies. While 17 \nparticipants (34% ) stated that they will never use this environment for supporting the \nacademic studies, 15 (30%) stated that they sometimes use it for this purpose and the number \nof those who always use it for this purpose is limited to 2 participants (4%).   \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n146 \n \n   \nThe answers given to the question in terms of following the developments about schoolmates \nand the changes in their lives highlighted that 17 participants (35%) sometimes use this \nenvironment for this purpose. It is quite remarkable that 19 participants (38%) use Facebook in \norder to follow the developments in daily life and 13 participants (26%) use it to follow the \ncurrent changes.  \n \nInstructors use Facebook to find their former friends; however, they do not look positively to \nmaking friends with people they do not know or looking for friendships. Finding former friends \n(primary school, secondary school, high school, university, former workplace, neighborhood, \netc.) seems to serve the establishment purposes of Facebook. It is an effective environment in \nestablishing and maintaining social networks.  Similarly, Facebook is widely used in order to \ncommunicate with friends. The answers given to the questions in the section regarding the \nadoption of Facebook show that instructors think positively about the involvement i n groups \nand their benefits; however, an unstable attitude was observed in the questions about  the \ngroups in the section on  adoption. Most of the instructors have some kind of memberships in \none or more groups, which can be explained as a reaction against the groups established by \nthose who they do not know about. Instructors are willing to share various information  \nsources; however, it was seen that they are not sure about the share of academic studi es such \nas assignment, articles etc. and the reliability of the shared information and they do not share \nthem.  Instructors use Facebook as an instrument to follow the daily developments and keep \nup with the global and/or national agenda in this environment, which means they adopted \nFacebook and it has taken its place among the daily life practices. \n \n \nUse of Facebook for Educational Purposes  \n \nAs mentioned earlier, a ll instructors participating in the present study teach in the Faculty of \nCommunication Sciences. From this perspective, analyses included in this particular section are \nimportant. A substantial body of participants, in other words 40 participants (80%), agrees that \nFacebook makes contribution to communication between classmates. Instructors have the \nview that intra-class dialogue may be effectively re alized and maintained on this environment \nand communications of students will not be limited with only course hours. Students with \nlonger communication time will better know each other and they will also conduct better team \nwork.  \n \nIt should be indicated that in this part of the study, one participant preferred not to answer (4 \nquestions), 2 participants preferred not to answer (6 questions) and 3 participants preferred \nnot to answer one question. \n \nImportance of communication between instructor and student is a non-negligible issue and all \nthe possible tools  contributing to this environment should certainly be benefited. Attitude of \nparticipants regarding the view that Facebook will contribute  to the communication provides \nsupport to this idea because  37 participants (74%) agree with  this view. Only one participant \nstated that it has no contribution in this area and 3 participants stated disagreement. Although \nit is considered by participants that it is an effective environment for com munication, 21 \nparticipants (42%) were neutral about conducting discussion in the class. Substantial part of \nparticipants, namely 21 participants, regard the Facebook suitable for intra -class discussion \nand 8 participants were neutral on this issue. \n \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n147 \n \n \n \nFigure 5. The Use of Facebook for Educational Purposes \n \n   \nUse of Facebook more commonly emerges in the form of announcement and task distribution. \nThe issues with highest agreement were suitability of Facebook for announcement about \ncourse, which was agreed by 36 participants (72%) and announcing home works, whic h was \nagreed by 31 participants (62%).  \n \nInstructors have positive attitude s toward  creating academic groups with regard to  the \ncommon field of interest and requirements. Thirty-two participants (64%) had positive views \nabout Facebook on this issue, while 6 participants (12%) were negative.  \n \nMore than half of participants (29 participants) had positive attitudes for conducting group \nwork and sharing information about courses over Facebook. Multiple environment support, \nbenefited during a course or a project, had positive impact on views o f instructors and 26 \nparticipants (52 %) agree  with contribution of video, animation , and auditory support. \nHowever, they are still neutral for accepting that it is a safe environment for acc essing to \neducation materials. Six participants (12 %) stated strict negative view on t his issue, while 7 \n(14%) disagreed, 21 (42 %) were neutral and 14 participants (28%) had positive views. There is \nno participant absolutely agreeing this issue.  \n \nOnly one  of 284 courses lectured in the Faculty of Communication Sciences at  Anadolu \nUniversity, where the present study was conducted, is completely offered over Facebook. \nInstructors generally use this environment as a supplementary environment. Instructors regard \nFacebook suitable for communicating with students, communication of students with each \nother, being informed about students and making announcements about courses and sharing \ncontent. However, they still have some negative attitude s on completely lecturing courses \nover Facebook.  \n \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n148 \n \nHowever, it appears that the use of this environment by more instructors for educational \npurposes is not a distant future because  almost all instructors participating in the  study \nsomehow use Facebook in their courses ; even the  instructor with the lowest frequency of \nusing this technology makes announcement about the course by creating a group. It should be \nnoted, on the other hand, that instructors are neutral about efficiency of this environment on \nintra-class discussions. \n \nInstructors form gr oups for their large -scaled courses and share information regarding their \ncourses on these group pages. They also supervise or control many group work over Facebook. \nThe multimedia support that can be made use of during the course or the p roject has affected \nthe instructors’ opinion on this matter positively.  However, many instructors have remained \nindecisive on the stage of accepting Facebook as a reliable media for accessing education al \nmaterials. Instructors often use Facebook for supporting their courses and for communicating \nwith students. When the data obtaine d at this section of the study is evaluated as a whole , it \nappears that instructors do not have an u nfavourable attitude  of carrying out their courses \nover Facebook in the near future with a little support.  \n \n \nConclusion \n \nSocial networks have affected the modern society positively and have changed some of  \npeople’s habits. Effective use of features and opportunities of social networks supports  \ninstructors' empowering of the educatio nal process with active  learning, creativity, problem-\nsolving, cooperation, and multifaceted interactions as well as  students' using and improving \ntheir academic performance, inquiry, and alternative thinking skills. \n   \nIt develops communication skills, ex tends participation and social commitment, strengthens \npeer support , and enables  the realization of cooperation -based learning.  In addition, social \nnetwork sites can be used easily and conveniently, they can be integrated into the educational \npractices successfully and such utilizations are becoming widespread rapidly.  Social networks, \nrepresented as Facebook in this study, provide the users a communication environment which \nis not limited with space and time because they are online tools that generate inte raction by \nallowing new opportunities for more information, interest, and data sharing. \n \nBased on the results of this study, social networks are  used actively by the instructors in the \nFaculty of Communication Sciences.  The present study shows that instructors in the Faculty of \nCommunication Sciences have adopted Facebook and they are using it intensively.  Instructors \nof the Faculty of Communication Sciences tend toward the  use of Facebook for educational \npurposes as well. A large proportion of the students are able to use social media a nytime and \nanywhere via mobile Internet. Hence, utilization of Facebook to support learning also becomes \nmeaningful and widespread.  The instructors have displayed an indecisive approach for the use \nof Facebook merely for ed ucation purpose; they mostly use it as a medium  to make contact \nwith students and for sharing information. \n   \nSocial networks also provide opportunities for the academicians because they are flexible and \nuser friendly, they are used more easily than the ot her education al management systems.  \nFacebook is used in the delivery of information , reference books, group assignments, and  \ncourse sessions .  Instructors and students can send materials, addresses of web sites , and \nvideos regarding courses on Facebook an d presentations, assignments, and other products of \nthe students that can be shared by forming links to Google documents.  Facebook can be used \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n149 \n \nto share materials (video files, audio files, pictures, spre adsheet, presentation, database, web \nsites etc. ) effe ctively, follow up current eve nts, news, people or groups, and get involved in \ndiscussion environments to support the skills of learning for cooperation, research, discussion, \ncritical thinking, problem solving and so on. A similar result has been obtained  in this study as \nwell. Those who have Facebook membership amongst the instructors participating in this \nstudy are using these features actively.  \n \nSocial networking sites are becoming more involved in our daily life day by day . As of today, \ninstructors can neither conduct a course completely through Facebook nor they can ignore this \ndevelopment comfortably. None of the instructors in the current study denies that Facebook is \nan effective medium; they all agree that educators should benefit from its tools . The younger \nfaculty members use Facebook and similar technologies more in their courses compared to \nsenior faculty members. This might be due to their familiarity and mastery regarding the use of \nthese technologies. \n \nIt should be noted that the present stu dy is limited with the findings of a certain academic \norganization, namely a faculty of communication in Turkey. Both the national and institutional \ncultures might have affected the results. New studies need to be conducted in other countries \nand educational settings representing various sensitivities and differences. Studies should also \nbe conducted in s o-called high-tech universities offering degrees through virtual technologies. \nAdditionally, future studies may compare experiences of instructors and stud ents regarding \nthe use of social networks in educational practices. Furthermore, new studies may look at how \ncommunicational uses of social networks have influenced educational uses. Finally, possible \ninteractions between alternative uses of social network s and individual differences of learners \nshould be investigated.    \n \n \nReferences \nAkar, E. (2010). Sanal topluluklarin bir turu olarak sosyal ag siteleri: Bir pazarlama iletisimi \nkanali olarak isleyisi [Social networking sites as a type of virtual communities : Processing \nas a marketing communication channel].  Eskisehir: Anadolu Universitesi Sosyal Bilimler \nDergisi, 10(1), 107-122. \nAwl, D. ( 2010). Facebook me! A guide to socializing, sharing, and promoting on Facebook. \nBerkeley, CA: Peachpit. \nAydogan, F., Akyuz, A. ( 2010). Ikinci medya caginda Internet. Istanbul: Alfa.  \nBalci, B. (2010). E-ogrenme sistemindeki basari faktorleri. In U. Demiray, G. Yamamoto, M. \nKesim. (Eds.). Turkiye’de e-ogrenme: Gelismeler ve uygulamalar (pp. 465-480). [E-\nlearning in Turkey: Developments and applications]. Ankara:  Cem Web Ofset.  \nBilen, M.( 2002) Plandan uygulamaya ogretim. Ankara: Ani. \nGulbahar, Y., Kalelioglu, F., & Madran, O. (2010). Sosyal aglarin egitim amacli kullanimi \n[Educational use of social networks]. XV. Turkiye’de Internet kullanimi konferansi. \nIstanbul: Istanbul Teknik Universitesi. \nhttp://www.asiamedia.ucla.edu/article.asp?parentid=52164  \nhttp://www.ezberim.com/internet-haberleri/167867-Facebook-sitesinin-kurulus-hikayesi \nhttp://www.Facebook.com/press/info.php?statistics. Retrieved on 22 February 2011. \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2011, 2(2), 135-150 \n \n150 \n \nhttp://www.nedirbilgi.com \nhttp://www.socialbakers.com/blog/25-countries-with-top-Facebook-penetration-to-\npopulation/ Retrieved on 22 February 2011. \nhttp://www.socialbakers.com/Facebook-statistics/turkey.Retrieved on 22 February 2011. \nhttp://www.theglobeandmail.com/news/technology/personal-tech/Facebook-a-big-hit-with-\nnarcissists-study/article1698694/ Retrieved on 12 March 2011. \nhttp://www.haber3.com \nhttp://www.socialbakers.com \nJones, N., Blackey, H., Fitzgibbon, K., Chew, E. (2010) ‘Get out of MySpace!’ Computers & \nEducation, 54, 776–782.   \nJordan, T. (1999). Cyberpower. London: Routledge.  \nKelsey, T. ( 2010) Social networking spaces: From Facebook to Twitter and everything in \nbetween (beginning). New York: Apress.  \nMattelart, A. (2004). Bilgi toplumunun tarihi. Istanbul: Iletişim.  \nMurray, C . ( 2008). Schools and social networking: Fear or education? Synergy Perspectives: \nLocal, 6(1), 8-12. \nOsuagwu, N.G. ( 2009). Facebook addiction: The life & times of social networking addicts. \nPhiladelphia: Ice Cream Melts Publishing.   \nPerlman, D. & Miller, R. (2008). Intimate relationships. New York: McGraw-Hill.  \nSeguin, A. & Seguin, C. ( 1995). Window to the world. Vocational Education Journal, 70, 30-33. \nShih, C. ( 2009). The Facebook era: Tapping online social networks to build better products, \nreach new audiences, and sell more stuff. Ohio: Prentice Hall.  \nToprak, A. ( 2009). Toplumsal paylasim agi Facebook.  Istanbul: Kalkedon. \nYamamoto, G. T., Demiray, U., & Kesim, M. (Eds.). (2010). Turkiye’de e-ogrenme: Gelismeler ve \nuygulamalar [E-learning in Turkey: Developments and applications]. Ankara:  Cem Web \nOfset. \n \nCorrespondence: Filiz Tiryakioglu, Associate Professor, Faculty of Communication Sciences, \nAnadolu University, Yunus Emre Campus, Eskisehir, Turkey. \n  ",
  "institutions": [
    {
      "id": "https://openalex.org/I133743585",
      "name": "Anadolu University",
      "country": "TR"
    },
    {
      "id": "https://openalex.org/I204585392",
      "name": "Usak University",
      "country": "TR"
    }
  ]
}