{
  "title": "A Three-phase Hybrid Power Flow Algorithm for Meshed Distribution System with Transformer Branches and PV Nodes",
  "url": "https://openalex.org/W2327112112",
  "year": 2016,
  "authors": [
    {
      "id": "https://openalex.org/A2096447395",
      "name": "Hongwei Li",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2223426563",
      "name": "Huabing Wu",
      "affiliations": [
        "Southwest Petroleum University"
      ]
    },
    {
      "id": "https://openalex.org/A2366956053",
      "name": "Biyu Jiang",
      "affiliations": [
        "Southwest Petroleum University"
      ]
    },
    {
      "id": "https://openalex.org/A2133092992",
      "name": "Anan Zhang",
      "affiliations": [
        "Southwest Petroleum University"
      ]
    },
    {
      "id": "https://openalex.org/A2097419868",
      "name": "Wei Fang",
      "affiliations": [
        "Southwest Petroleum University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2031454011",
    "https://openalex.org/W2139609852",
    "https://openalex.org/W2114083729",
    "https://openalex.org/W2099517607",
    "https://openalex.org/W2104179704",
    "https://openalex.org/W2052845676",
    "https://openalex.org/W2105724362",
    "https://openalex.org/W2051489666",
    "https://openalex.org/W2120504237",
    "https://openalex.org/W2037818444",
    "https://openalex.org/W2149575540",
    "https://openalex.org/W2096796121",
    "https://openalex.org/W2150513989",
    "https://openalex.org/W2164446432",
    "https://openalex.org/W2158119364",
    "https://openalex.org/W2017834553",
    "https://openalex.org/W2153332004",
    "https://openalex.org/W2154328145",
    "https://openalex.org/W2019651709",
    "https://openalex.org/W2179936718",
    "https://openalex.org/W2154951274",
    "https://openalex.org/W2355527074",
    "https://openalex.org/W1541786028",
    "https://openalex.org/W2126126123",
    "https://openalex.org/W2004704209"
  ],
  "abstract": "Aiming at analyzing the power flow of the distribution systems with distribution transformer (DT) branches and PV nodes, a hybrid three-phase power flow methodology is presented in this paper. The incidence formulas among node voltages, loop currents and node current injections have been developed based on node-branch incidence matrix of the distribution network. The method can solve the power flow directly and has higher efficiency. Moreover, the paper provides a modified method to model DT branches by considering winding connections, phase shifting and off-nominal tap ratio, and then DT branches could be seen like one transmission line with the proposed power flow method. To deal with the PV nodes, an improved approach to calculate reactive power increment at each PV node was deduced based on the assumption that the positive-sequence voltage magnitude of PV node is fixed at a given value. Then during calculating the power flow at each iteration, it only needs to update current injection at each PV node with the proposed algorithm. The process is very simple and clear. The results of IEEE 4 nodes and the modified IEEE 34 nodes test feeders verified the correctness and efficiency of the proposed hybrid power flow algorithm.",
  "full_text": "J Electr Eng Technol.2016; 11(1): 65-75 \nhttp://dx.doi.org/10.5370/JEET.2016.11.1.065 \n 65\nCopyright ⓒ The Korean Institute of Electrical Engineers \nThis is an Open-Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/ \nlicenses/by-nc/3.0/) which permits unrestricted non-commercial use, distribution, and reproduction in any medium, provided the original work is properly cited. \nA Three-phase Hybrid Power Flow Algorithm for Meshed Distribution \nSystem with Transformer Branches and PV Nodes \n \n \nHongwei Li†, Huabing Wu*, Biyu Jiang*, Anan Zhang* and Wei Fang* \n \nAbstract – Aiming at analyzing the power flow of the distribution systems with distribution \ntransformer (DT) branches and PV nodes, a hybrid three-phase power flow methodology is presented \nin this paper. The incidence formulas among node voltages, loop currents and node current injections \nhave been developed based on node-branch incidence matrix of the distribution network. The method \ncan solve the power flow directly and has higher e fficiency. Moreover, the paper provides a modified \nmethod to model DT branches by considering winding connections, phase shifting and off-nominal tap \nratio, and then DT branches could be seen like one transmission line with the proposed power flow \nmethod. To deal with the PV nodes, an improved approach to calculate reactive power increment at \neach PV node was deduced based on the assumption that the positive-sequence voltage magnitude of \nPV node is fixed at a given value. Then during calculating the power flow at each iteration, it only \nneeds to update current injection at each PV node with th e proposed algorithm. The process is very \nsimple and clear. The results of IEEE 4 nodes and the modified IEEE 34 nodes test feeders verified the \ncorrectness and efficiency of the proposed hybrid power flow algorithm. \n \nKeywords: Distribution transformer, Meshed distribution system, Node-branch incidence matrix, \nPower flow, PV nodes  \n \n \n \n1. Introduction \n \nPower flow method is a fundamental tool for distribution \nmanagement system, so a robust and efficient power flow \nsolution method must be able to model the special features \nof distribution systems in sufficient detail. During the \npast decade, several power flow algorithms have been \ndeveloped [1-11]. The most popular estimation algorithm is \nthe forward/backward sweep based method for its fully \nutilizing the distribution networ k structure characteristics, \nsimple programming, no large matrix calculation and fast \ncomputing speed [6-11]. \nFor meshed network, the most commonly adopted \nsolution is the compensation current method [6-7]. It uses a \nreduced Thévenin impedance matrix and a vector of known \nterms that are the open circuit voltages between the cut \nnodes. The method in [8] is a direct extension of the \ncompensation-based power flow method proposed earlier \nin [6-7], and it is capable of handling three-phase weakly \nmeshed distribution network, dispersed generation (PV \nnodes) and unbalanced and distributed loads. The good \nresults have been achieved with this method, but it has \nmore iterations and becomes less efficient when node \nvoltages are lower. A direct approach for unbalanced \nthree-phase distribution power flow solutions is proposed \nin [9], in which two developed matrices, the bus-injection \nto branch-current matrix and the branch-current to bus-\nvoltage matrix, are used to solve power flow problem \ndirectly. The proposed method is robust and time-efficient, \nbut the universal forms of two matrices are not proved \nthrough theoretical deduction. Reference [10] presents a \nnovel forward/backward sweep algorithm for meshed \nnetwork which is firmly based on loop analysis theorem. \nThe method gives a concise formula to formulate the \nrelationship between branch flow and node injection flow. \nThe convergence of this novel algorithm is improved \ndramatically for meshed network. Reference [11] developed \na methodology to analyze the radial or weakly meshed \ndistribution systems, in which loads are simulated by \nmeans of impedances. The applications show the efficiency \nof the methodology in solving distribution networks with \nmany meshes and PV nodes. \nDetailed models for three-phase distribution transformers \n(DTs) are critical for distribution system analysis. The \nmost common DT models are based on nodal admittance \nmatrices [12~18]. But for the forward/backward sweep \nbased methods, the nodal admittance matrices based \nmodels are proved to be difficult to be used and claimed \nto be unsatisfactory due to relatively slow convergence \nproblems [17]. It may also cause singularity in the \nconnection matrix which appears on some special \nconnection types such as delta-grounded wye or grounded \nwye-delta transformers. Moreover, it also need considers \nthe different neutral grounding modes and the difference \nbetween zero sequence impedance and positive sequence \n†  Corresponding Author: School of Electrical and Electronic Engineering, \nSouthwest Petroleum University, Chengdu, China. (lhwmail@126.com) \n* School of Electrical and Electronic Engineering, Southwest \nPetroleum University, Chengdu, China. ({363116099, 461802287} \n@qq.com, ananzhang@swpu.edu.cn, villa1006@163.com) \nReceived: December 2, 2013; Accepted: October 5, 2015 \nISSN(Print)  1975-0102\nISSN(Online) 2093-7423\nA Three-phase Hybrid Power Flow Algorithm for Meshed Distribution System with Transformer Branches and PV Nodes \n 66 │ J Electr Eng Technol.2016; 11(1): 65-75 \nimpedance \nThe future distribution networks will consist of a \nconsiderable proportion distributed generators (DGs) based \non renewable energy sources. The emergence of DGs into \nthe distribution systems has great influence on the voltage \nquality, power flow and loss etc. [19-20]. So far, many \nrelated researches have been done and many algorithms \nhave been proposed. Reference [21] introduces an improved \nNewton-Raphson algorithm with lower initial values \nrequirement. But the method is  much complicated to deal \nwith PV nodes and the three-phase power. Besides, it needs \nto calculate the Jacobian matrix and the matrix may be ill-\nconditioned for the high R/X ratios in distribution system. \nThe most commonly adopted method in the solution \nscheme is also the forward/backward sweep techniques [6-\n8, 11, 22-23]. In [6-8,11], the method based on current \ncompensation for multi-port systems is applied to solve \nradial and weakly meshed systems with PV nodes and have \ngood efficiency. But the converged iteration increases \nsignificantly, and sometimes the results do not converge \nwhen network become more meshed and has more PV \nnodes. In [22], based on the models of DGs (wind turbines, \nphotovoltaic system, fuel cell, CHP etc.) for power flow \ncalculation, an improved thr ee-phase back/forward sweep \npower flow calculation for the weakly meshed distribution \nnetwork with the distributed generation was presented. \nReference [23] proposed a direct unbalanced three-phase \npower flow algorithm and a new approach handling PV \nnodes based on the assumption that the positive-sequence \nvoltage magnitudes of PV nodes are invariable. The \nefficiency and feasibility of the two algorithms has been \nproved, but they didn’t consider the transformer branches \nin the meshed network. \nIn a word, the power flow algorithms need to be further \nstudied considering transformer branches and the high \npenetration of DGs into the power distribution system. This \npaper develops a three-phase power flow solution method \nfor real-time analysis of meshed distribution systems with \nDT branches and PV nodes. The focus of this paper is on \nthe improved node-branch incidence matrix based power \nflow algorithm and several modeling issues related to \ndistribution system including DT branches and DGs (PV \nnodes). The test results show the efficiency of the proposed \nmethod in solving distribution networks in complex \nsituations. The modeling detail and convergence performance \nof the algorithm make it suitable for real-time applications \nin distribution automation systems.  \n \n \n2. Node-branch Incidence Matrix Based Power \nFlow Method \n \nFor a weakly meshed distribution network with N+1 \nnodes and m link branches (loops), there are N independent \nnodes when the power supply is referred as reference node \n(the first node). The number of the total braches b equals \nN+m. The reduced node-branch incidence matrix A can be \nused to describe the network. The element in A is [24]:  \n \nNode  is the starting point of branch \nNode  is the ending point of branch  \nNode  is neither the starting point nor\nthe ending point of bran\n1.\nch \n1.\n0\n.\nij\nij\nai j\ni\nj\n−⎧⎪= ⎨\n⎪⎩\n \n \n \nDesignating one tree in the weakly meshed network and \nnumbering the tree branches in the front and the link \nbranches in the back, then A can be expressed as, \n \n \n[ ]t , l=AA A  (1) \n \nThe order of invertible tA  is NN×  and the order of \nlA  is Nl× .  \nExcluding the node injection branches from the network \nand assuming that the node injection current is positive if it \nflows out of the node and node injection current is negative \nif it flows into the node. Let \nbt\nb\nb\nl\n⎡⎤\n⎢⎥⎣⎦= II I  be the branch \ncurrent vector of 1b×  and gI  be the node injection \ncurrent vector of 1N × , there exists, \n \n [] bttt b t b\nb\ngb , ll l\nl\n⎡⎤=+ ⎢⎣= ⎥⎦ =AA A AA III I I I   (2) \n \nwhere, btI  is the tree branch current vector of 1N × , blI  \nis the loop current (link branch current) vector of 1l × .  \nThen btI  can be obtained with, \n \n -1 -1 T T\nbt t t b t t gg bll l=− + =II I I IAA ATB   (3) \n \nwhere, Superscript “T” indicates matrix transpose. \ntB ( T- 1 T\ntt t ll=− =−BA A T A ) is the loop matrix of l×N  and \ntT ( T- 1\ntt =TA ) is the path matrix of N×N  corresponding to \ntree branches [10]. Define T\n1t gf= TI , the contribution of \nnode current injection gI , and T\n2t lf= B I , the contribution \nof loop current blI . \nBased on Kirchhoff’s voltage law and Ohm law,  \n \n \nbt bt bt\nbt t\nbb b\n[] [] 0ll\nll l\n⎡⎤ ⎡ ⎤ ⎡ ⎤= ==⎢⎥ ⎢ ⎥ ⎢ ⎥⎣⎦ ⎣ ⎦ ⎣ ⎦\n0\n0\nUZ IB U BE BE UZ I   (4) \n \nwhere, lE  is unit matrix of l × l, btU is the tree branch \ncorresponding voltage vector of N × 1, blU  is the link \nbranch corresponding voltage vector of l  × 1, btZ is the \ntree branch corresponding impe dance diagonal matrix of \nN × N, blZ is the link branch corresponding impedance \ndiagonal matrix of l × l. \nExpanding (4) and rearranging it gives,  \n \n tb t b t bb 0ll+ =BZ I Z I   (5) \nHongwei Li, Huabing Wu, Biyu Jiang, Anan Zhang and Wei Fang \n http://www.jeet.or.kr │67\nSubstituting (3) into (5), blI  can be derived as, \n \n T\nbt b t tll g l l=− = ΔIY B Z T I Y U  (6) \n \nwhere, T\ntb t tlgΔ= −UB Z T I , T\ntb tt bll =+ZB Z BZ  is the \nloop impedance matrix. lY  Is the inverse matrix of lZ .  \nLet the nodes at the both ends of link branch in loop h be \ni and j , then the contribution of lhI\u0005  in loop h to the tree \nbranch currents is,  \n \n TT\n2 t t t []h h lh i j lh I== −fB IT T \u0005   (7) \n \nwhere, lhI\u0005  is assumed to flow from node i to node j, \nt iT and t jT are the node  i  and j corresponding row \nvectors(path vectors)in tT , tt  t  []hi j= −B TT  is the loop h \ncorresponding row vector in tB .  \nThe contributions of other loop currents to the tree \nbranch current can be also calculated with (7), so another \nform of \n2f  can be expressed as, \n \n 22 1\nm\nhh== ∑ff  (8) \n \nThe voltage difference t iΔU  between power supply and \nany other node i is equal to the sum of tree branch voltage \nalong the path of node i, that is: \n \n ()t 0 n t bt bt 1, 2, ,ii i iNΔ= = -= \"UU U T Z I    (9) \n \nwhere 0U  is the power supply voltage and nU is the node \nvoltage vector of N ×1.  \nThe power flow calculation can  be realized by solving \n(9) iteratively. The improved algorithm can be described as \nfollowing (set \nk as iteration count): \n \nStep 1 : Calculate nodal current: the node i injection \ncurrent g\nk\niI\u0005  is calculated by, \n \n ()\n(1 ) (1 )*\ng nn(/ ) -  1 , 2 , ,kkk\nii i iiI SU Y U i n−−==\u0005\u0005 \u0005 \"   (10) \n \nwhere, (1 )\nn\nk\niU −\u0005 is the voltage, piS is the power injection and \niY is the sum of all the shunt elements at node i. \nStep 2 : Calculate T\n1t g\nkkf =T I , which is equivalent to \nbreak the links and do a backward sweep calculation for \nthe radial network. \nStep 3: Calculate \n2\nkf with (6), (7) and (8), then calculate \nbranch current bt\nkI  with (3). \nStep 4: Calculate n\nk\niΔU  with (9), and the nodal voltage \nis updated with n0 n\nkk\nii =Δ -UUU ; \nSteps 1-4 are repeated until convergence is achieved \n(here, when the maximum voltage mismatch between n\nkU  \nand 1\nn\nk −U  is small enough). \n \nThe above algorithm is also suitable for the three-phase \nunbalanced system and it only need to update the elements \nin each vector (matrix) with three-phase system parameters. \n3. Handling of DT Branch in Power Flow \nAlgorithm \n \n3.1 Modeling of distribution transformer \n \nThe exact DT models of the various connections must \nsatisfy Kirchhoff’s voltage and current laws (KVL and \nKCL) and the ideal relationship between the voltages and \ncurrents on the two sides of the DT windings. The models \nmust also represent any phase shift because of the \nparticular connection. DT branch sketch is shown in Fig. 1. \nThe core loss of DT could be evaluated by the shunt core \nloss functions on each phase of the secondary terminal [12] \nand will not be considered in the models.  \nLet DT line-to-ground voltage be \nT\npG AG BG CG[]UUU= \u0005\u0005\u0005U  \nand T\nsg ag bg cg[]UUU= \u0005\u0005\u0005U , DT line-to-neutral voltage be \nT\nsn an bn cn[]UUU= \u0005\u0005\u0005U , DT line currents be T\nABC[]p I II= \u0005\u0005\u0005I  \nand T\nsa b c[]I II= \u0005\u0005\u0005I . Subscript “ p” and “ s” indicate \nprimary side and secondary side respectively.  \nThere exist the following equations, \n \n p 11 pG 12 s=IH U + H I   (11a) \n s2 1 p G 2 2 s= −UH U H I   (11b) \n \nWhen solving the power flow, sU  chooses snU for \nungrounded wye-connection and delta-connection and \nchooses \nsgU  for wye-grounded connection.  \nFor delta-connection in secondary side, the equivalent \nline-to-neutral voltages is determined by, \n \n \n1\nsn T012 sL sL\n00 01 01 - 3 0 0\n3 001 3 0\n−⎡⎤\n=∠ ° = ⎢⎥\n⎢⎥ ∠°⎣⎦\nUA Z A UK U   (12) \n \nwhere, 22[1 1 1;1 a a;1 a a ]=A   \n (\n2πj 3a e= )， [1 0 1; 1 1 0; 0 1 1] / 3= −− −K , \n T\nsL ab bc ca[]UUU= \u0005\u0005\u0005U . \n \nLet t1z  be DT positive-sequence impedance and t0z  \nbe DT zero-sequence impedance, then let T012 =Z  \nt0 t1 t1diag[ ]zzz  be three-sequence impedance matrix. So \nthe three-phase DT impedance matrix is,  \n \n \nt0 t1 t0 t1 t0 t1\n1\np h a s e T 0 1 2 t 0 t 1t 0 t 1t 0 t 1\nt0 t1 t0 t1 t0 t1\n21 23 2\nzz z z z z\nzz z z zz\nzz zz z z\n−\n+− −⎡ ⎤\n⎢ ⎥== − + − ⎢ ⎥−− +⎣ ⎦\nZA Z A  (13) \n \npGU\npI sI\nsU\n \nFig. 1. The sketch of transformer branch \nA Three-phase Hybrid Power Flow Algorithm for Meshed Distribution System with Transformer Branches and PV Nodes \n 68 │ J Electr Eng Technol.2016; 11(1): 65-75 \nReferring to the modeling process in [18, 26] and further \nconsidering DT impedance asymmetry and neutral point \ngrounded impedance, the exact DT models and coefficient \nmatrices in (11) were re-der ived (derivatio n process is \nomitted). The coefficient matrices for all kind of DT \nconnections were shown in Table 1. \n \nTable 1. The coefficient matrices of transformer models \nConnection 11H  12H  21H  22H  \nYn-yn 0 T1/ n  T1/ n  \n2\nphaseβ Z\nY-yn 0 TnW/  TnW/  \n2\nphaseβ Z\nD-yn11 0 T3 nK/  \nT\nT3 nK/  \n2\nphaseβ Z\nYn-d11 2\nt0(3 ) zαM/  T3 nK/  \nT\nT3 nK/  \n2\nt1 3zβ W/\nY-d11 0 T3 nK/  \nT\nT3 nK/  \n2\nt 3zβ W/\nD-d 0 T1/ n  TnW/  \n2\nt 3zβ W/\nD-y11 0 T3 nK/  \nT\nT3 nK/  \n2\nt1zβ  \nYn-y 0 T1/ n  T1/ n  \n2\nt1zβ  \nY- y 0 T1/ n  T1/ n  \n2\nt1zβ  \n \nwhere, T /n α β=  is the off-nominal DT tap ratio ( α  \nand β  are the taps on the two sides respectively), \n[ 2 1 1 ;1 2 1 ;1 1 2 ] / 3= −−− −−−W  and M  is all-1 matrix \nof 3×3. It needs to note that t0z  should be replaced with \nt0 tg 3zz +  for Y -yn , D -yn11 and Y n-d11 if there is a \ngrounded impedance tgz  at neutral point. \n \n3.2 Handling of DT branch \n \nIn Table 1, except Y n-d11, all other connections have \n11 0=H . Even for Y n-d11, 11 pH U can also be removed \nfrom (11a) because 11 pH U  is generally much smaller than \n12 sH I . So (11a) can be simplified as: \n \n p 12 s I s==IH IK I  (14) \n \nDefine s2 1 p V p′ =U= HU KU and T2 2=ZH , and \nsubstituting them into (11b), \n \n sV p T s s T s ′=− = −UK UZ I U Z I   (15) \n \nwhere, I1 2=K H  is the voltage tran sformation matrix and \nV2 1K =H  is the current transformation matrix. Note the \ndiagonal entries in the matrices, IK is not equal to VK  \nfrom the derivation results earlier. \nHence, based on (15), the DT branch can be described \nwith an equivalent model shown in Fig. 2. \npI sI\npU\n'\nsU\n TZ\n \nFig. 2. The equivalent model of DT branch \n \nFig. 3. A simple network with transformer branch \n \n3.3 Improved power flow algorithm with DT \n \nFor the network with the DT, btI  and nU  can’t be \ndirectly calculated with proposed algorithm in section 2 \nfor current and voltage transformations. So based on the \nnetwork shown in Fig.3 as follows, the improvement to \ncalculate\nbI and nU were analyzed and re-derived again. \nThere are three DT branches and two loops in Fig.3, in \nwhich V3K , V7K , V9K and I3K , I7K , I9K  can be calculated \nwith the DT coefficient matrices.  \n \n3.3.1 Calculation of 1f  \n \nLet sI  be the DT branch current, and the second branch \ncurrent, b2I , in Fig.3 can be calculated by (E is unit matrix \nof 3×3 and 0 is all-0 matrix of 3×3): \n \n []\nb2g 2 I 3 g 3 g 4 g 7 I 8 g 8\nI3 I3 I8 g\n() + +\n      \n= +\n=\nII + K I I I K I\n0EK K 00EK I  \n \nSimilarly, other branch currents can be obtained too. \nSo 1f  can be expressed in general form as, \n \n I\nT\n1t g Kf= T I  (16) \n \nSubstituting all corresponding IK  with VK  in ItKT  \ncan get VtKT . Vt iKT is the node i corresponding row vector \n(path) in VtKT . Supposing that 2f  is known, btI  can be \ncalculated by (2). The voltage at node i can be obtained by,  \n \n ( )Vn 0 0 t 0 0 t bt bt    1, 2, ,ii ii i K iN=Δ = =-- \"UK U U K U T Z I  (17) \n \nwhere, 0iK  is the first entry of Vt iKT .  \nAppendix A describes the generation of ItKT and the \nderivation of (17) in detail.  \n \n3.3.2 Calculation of 2f  \n \nTo calculate 2f  needs to calculate lI firstly. But from \n(6), to calculate lI  must know lΔU  and lY . In fact, \nlΔU  is the voltage difference vector of 3 m×1 between the \nboth ends of link branch when breaking link branches and \nonly considering the contribution of \n1f . Let the ends of \nlink branch in loop h be i and j , then niU  and n jU  can be \ncalculated by (17) (here, bt1 =If  not including 2f ). \nHongwei Li, Huabing Wu, Biyu Jiang, Anan Zhang and Wei Fang \n http://www.jeet.or.kr │69\nSo lhΔU is, \n \n n n lh i jΔ= −UUU  (18) \n \nTo calculate lY  should calculate lZ  first. In Fig. 1, the \nfollowing equation is true, \n \n \nsV p V p 0 p p\nVp 0 VpI s\n()'U= K U= K U - Z I\n=K U -K Z KI  (19) \n \nwhere, p0U  is the power supply volta ge and, referring to \nDT primary side, pZ  can be seen as the internal resistance \nof the power supply.  \nIt can be seen from (19) that pZ  became Vp IK ZK  \nwhen it is referred to DT s econdary side. There are two \nloops in Fig. 3, and the self and mutual impedances are \n(\nlZ  is referred to DT secondary side because lΔU  is the \nvoltage vector in DT secondary side):  \n \n_ 1 1 V 3 b 2I 3 T 3 b 4 V 7 b 6I 7 T 7 b 1 0 +l =+Z K Z K +Z +Z K Z K +Z Z  \n_ 22 T3 b4 b5 V9 b8 I9 T11 b11l =+ +Z Z +Z +Z K Z K +Z Z  \n_12 _ 21 T3 b4 =+ll =ZZ Z Z  \n \nRewriting them in matrix form, that is \n \n VI\nT\nTtb t t b=lK K l +ZB Z B Z  (20) \n \nThe calculation of VthKB and IthKB for loop h are similar \nto (7), that is \n \n VV Vtt  t  hK iK jK=−BT T  (21) \n II Itt  t  hK iK jK=−B TT   (22) \n \nwhere, Vt iKT and Vt jKT are the node  i  and node j \ncorresponding row vectors （path vectors ）in VtKT , It iKT  \nand It jKT  are the node  i  and node j corresponding row \nvectors（path vectors）in ItKT . \nThen lI  can be calculated with (6) when TlZ  and \nlΔU  are known. Like (7), the contribution of lhI  in h \nloop to the tree branch currents can be calculated by, \n \n II I I\nTT T T\n2 t t t t \nlh\nhi K j K i K j K l h\nlh\n⎡⎤⎡⎤ ⎡ ⎤== ⎢⎥⎣⎦ ⎣ ⎦ −⎣⎦\nIfT T T - T I I   (23) \n \nAnd then 2f  can be obtained with (8). \n \n3.3.3 Modification of the power flow algorithm \n \nWhen there are DT branch es in the network, the \ncalculation process of power flow is the same as that \ndescribed in section 2. But it should use the formulas \nproposed in this section to calculate \n1f  (with(16)), lΔU  \n(with(18)), TlZ (with(20)) and 2f (with(23)). \n4. Compensation for PV Nodes  \n \nWhen integrating DGs into distribution systems, some \nDGs can be well represented as PQ nodes, which require \nlittle special treatment in the power flow algorithm. Other \nneed be modeled as PV nodes, which inject a given active \npower into the system and require the necessary but \nunknown reactive power to su stain the voltage magnitude \nto a scheduled value. Thus the output reactive powers of \nPV nodes need to be determ ined and to compensate PV \nnode voltage mismatch. \nThe phase injection current of any PV node i can be \ncalculated with (subscript “d” means PV nodes), \n \n ()\ndd *\nd\nd\nj( )  =a,b,c; 1, 2, ,3\nii\npi\npi\nPQI pi nU\n+=− =\u0005 \"\u0005  (24) \n \nwhere, dpiU\u0005 is the phase voltage phasor with fixed \nmagnitude and its phase angle is unknown, diP  and diQ  \nis the total active power an d reactive power (the minus \nrepresents that PV node outputs active and reactive powers \nto the system). \nThe open loop impedance matrix (Thevenin equivalent \nimpedance matrix) is used to deal with PV node [13-14, \n23]. Supposing that there are \ndN  PV nodes in the system, \nthe relationship between the breakpoint compensation \nvoltage vector \ndΔU  and current vector dΔI  is, \n \n dd dΔ =ΔUZ I  (25) \n \nwhere dZ  is the Thevenin  equivalent impedance matrix \nof d3N × d3N . \nFor a radial distribution network with DT branches, \nextracting all PV nodes corr esponding row vectors from \npath matrices VtKT and ItKT make up two new matrices, \nVtdKT  and ItdKT , then dZ  can be expressed by [23], \n \n VI\nT\ndt d b t t dKK=ZTZ T  (26) \n \nThe sequence impedance matrix for any branch can be \nexpressed as, \n \n 1\nb _012 bii\n−=ZA Z A  (27) \n \nWhen the spatial distribution of three-phase transmission \nlines is symmetrical, all non-diagonal elements in b _012iZ  \nare equal to zero. When th e spatial distribution is \nasymmetrical, non-diagonal element in b _012iZ  is not \nequal to zero which means that the sequence impedances \nare coupled. Generally speaki ng, the absolute values of \nnon-diagonal elements are far less than those of the \ndiagonal elements, so they can be ignored. Then \nb _012iZ  \ncan be simplified as, \n \n b _012 b _0 b _1 b _2diag( )ii i i =ZZ Z Z  (28) \nA Three-phase Hybrid Power Flow Algorithm for Meshed Distribution System with Transformer Branches and PV Nodes \n 70 │ J Electr Eng Technol.2016; 11(1): 65-75 \nLet d diag( , , )= \"ΑΑ Α (total of dN Α ) and pre-\nmultiplying (25) with 1\nd\n−A  gives, \n \n \n11\nd_012 d d d d d\n11\nd d d d d d_012 d_012             ( )\n−−\n−−\nΔ= Δ =Δ\n=Δ = Δ\nUA U A Z I\nAZ AA I Z I    (29) \n \nIt can be seen from (28) that the sequence impedances of \neach branch can be approximated as a diagonal matrix, so \nthe positive sequence component equation can be extracted \nfrom (29) as, \n \n \nd_1 d_1 d_1Δ= ΔUZ I  (30) \n \nThe dimensions of d_1ΔU , d_1ΔI  and d_1Z  are equal \nto the number of PV nodes, dN . Define, \n \n d_1 d_1 d_1 jΔ= Δ + ΔUe f   (31) \n d_1 d_1 d_1 jΔ= Δ+ ΔIc d   (32) \n d_1 d_1 d_1 j=Δ + ΔZR X   (33) \n \nSubstituting (31) ~ (33) into (30) and rewriting it, \n \n \nd_1 d_1 d_1 d_1\nd_1 d_1 d_1 d_1\n−Δ Δ⎡⎤ ⎡ ⎤ ⎡ ⎤ =⎢⎥ ⎢ ⎥ ⎢ ⎥−Δ Δ⎣⎦ ⎣ ⎦ ⎣ ⎦\nXR d e\nRX c f   (34) \n \nLet driU be the scheduled voltage magnitude for PV \nnode i . During the kth iteration, the positive sequence \nvoltage d_ 1\nk\niU\u0005 of breakpoint is calculated with phase angle \nd_ 1\nk\niθ (both sides of the breakpoint should have the same \nphase angle), then voltage mismatch for PV node i can be \ncalculated by, \n \n d_ 1j\nd_ 1 d r d_ 1 d_ 1 d_ 1() e + j\nk\nikkk k\nii i i iUU U ef\nθ\nΔ=− = Δ Δ\u0005   (35) \n \nThe reactive power increment at PV node i will be \ndetermined by, \n \n \ndr d _11\nd\nd_ 1\n3 \ncos\nk\niik\ni k\ni\nUdQ\nθ\n+ ΔΔ= −   (36) \n \nThe PV node reactive current injection d_ 1\nk\nidΔ will be \nsolved using following equation, \n \n d_1 d _1 d _1() kk\nii−Δ = ΔX de  (37) \n \nwhere, d_ 1\nk\niΔe can be obtained from (34). Appendix B \ndescribes the derivation of (36) and (37) in detail.  \nThe total reactive power at PV node i is, \n \n 11\ndd _ 1 d\nkk k\nii iQQ Q++ =+ Δ  (38) \n \nThe initial value of output reactive power could be set to \n0 or other value. And 1\nd\nk\niQ +  is compared with the reactive \npower generation limits at PV node i. If 1\nd\nk\niQ +  is within the \nlimits, the corresponding curr ent injection is calculated \naccording to (24). Otherwise, if 1\nd\nk\niQ +  violates any reactive \npower limit, it will be set to that limit and PV node  i will \nbe converted to PQ node during next iteration, and in \naddition, the row and column in \nd_1X , corresponding to \nthis node, are removed. \n \n \n5. Iterative Process of Hybrid Power Flow \nAlgorithm \n \nThe overall power flow algorithm should consist of two \nnested iteration loops for meshed power flow calculation \n(inner loop) and PV node voltage magnitude compensation \ncalculation (outer loop) respectively. The inner loop \ncalculates the meshed power fl ow by regarding PV nodes \nas PQ nodes, and the termination is controlled by the \nmaximum node voltage mismatch between the results of \ntwo successive iterations. The outer loop calculate the \nreactive power increments at PV  nodes with (36) and then \nreenter the inner loop until the maximum voltage mismatch \nate each PV node is small enough. \nHowever, the experience shows that the current injection \nincrements generated by th e reactive power increments \nfrom PV nodes have little impact on the power flow of the \nwhole system at each iteration. So the outer loop can be \ncancelled for the output reactive powers at PV nodes can \nbe updated at each iteration during the inner loop. A simple \nflow chart of overall power flow algorithm is shown in \nFig.4. During each iteration, the meshed power flow is \ncalculated first, then the re active power increments are \ncalculated, and the next iteration starts. Hence, the higher \ncalculation efficiency can be obtained. \n \n \nFig. 4. A simple flow chart of the hybrid algorithm \nHongwei Li, Huabing Wu, Biyu Jiang, Anan Zhang and Wei Fang \n http://www.jeet.or.kr │71\n6. Numerical Results \n \n6.1 Test 1: IEEE 4 node test feeder \n \nIEEE four-node test feeder [25] was used to validate the \nproposed algorithm and DT models. The test results of the \nalgorithm match very well with those listed in [25] for \nboth balanced and unbalanced loads with different DT \nconnections (the convergence accuracy is 10-6 p.u.). The \nnumber of iterations is six fo r all cases. The feasibility of \nthe proposed method and the correctness of DT models \nhave been proved.  \n \n6.2 Test 2: modified IEEE 34 node test feeder \n \nAnother test feeder is IEEE 34 test feeder [25] but all the \nregulators are excluded from the standard data. The test \nfeeder was characterized for its very long lines and light \nloads. The system maximum load is 1165 kW and 665 \nkvar with unbalanced distribution. Because of the length \nof the feeder and the unbalanced loads, it might have a \nconvergence problem. \nThe feeder has one Δ-Yn DT, T1, at substation and \nanother one, T2, on the lateral near node 13. For testing \npurposes, four loops were added and two more DTs, T3 \nand T4, were introduced. The one-line diagram of the \nmodified 34 feeder is shown in Fig. 5. Similar to T2, both \nT3 and T4 reduce the voltage from 24.9 to 4.16 kV . There’s \na fixed capacity parallel capacitor group at node 31 and the \nreactive compensation capacity is 300 kvar. \nLet T2~T4 have the same winding connections. The \nconverged iterations with the proposed power flow method \nfor different connections are summarized in Table 2 \n(convergence accuracy is 10\n-6 p.u., voltage）. \nRadial Distribution Analysis Package (RDAP) [26] was \nfurther used to verify the correctness of the proposed \nmethod. The results calculate with the proposed method are \nfound to be in consistency w ith the RDAP’s results for all \nthe connections shown in Table 2. \nIn order to further examin e the algorithm’s robustness \nand accuracy, the method in [6] and the Newton-Raphson \nmethod in [3] are used to  compare with the proposed \nmethods with Y\nn-Yn connection of T2~4. The results from \nthree methods are basically consistent and the maximum \nrelative error is below 1%. In Table 2, the underlined \nnumbers (first row for Y\nn-Yn) are the converged iterations \nwith the method in [6], an d the italic and underlined \nnumbers (second row for Y n-Yn) in Table 2 are the \nconverged iterations with the Newton-Raphson (N-R) \nmethod in [3]. The N-R method has better convergence \n(fewest iterations), but it has much longer calculation time.  \nMoreover, as shown in Table 2, the proposed method has \nless iteration number with more loops for meshed network. \nSo compared with those two methods in [6] and [3], the \nproposed method has the fastest calculation speed and \nefficiency.  \nWhen T2~4 with Y\nn-Δ, Δ-Δ and Δ-Yn connections, the \nproposed algorithm has less iterations. The possible reason \nmay be that the voltage unbalance degrees for Y\nn-Yn \nconnection are much larger than those for later three cases.  \nFig. 6 shows the A-phase converged voltage profiles for \nno closed loop, closed loop 1~2 and closed loop1~4 \nrespectively for Y\nn-Δ connection of T2~T4. It can be seen \nfrom Fig. 6 that the closed loops can make better power \nflows and improve node voltage level although the output \nactive and reactive powers keep  the same. The results also \nindicate that the more closed loops, the better the voltage \nlevel. \n \n6.3 Test 3: modified IEEE 34 node test feeder with \nPV nodes \n \nEven with the light loads, the voltages at some nodes are \nlow and do not meet the sta ndards for the larger voltage \ndrops in the long transmission lines. So, three DGs with PV \nnode type are added at node 26, 16 and 32 respectively (see \nFig. 5). Their rated active powers are 150kW, 100kW and \n100kW in turn. The lower and upper limits of each DG \noutput reactive power are set to  zero and the value of the \n \nFig. 5. The modified IEEE 34 node test feeder \n \nTable 2. Converged results of Test 2 \nclosed loops Item T2~T4 \nconnection 0 1 1~2 1~3 1~4\n11 11 12 12 12 \n6 6 7 7 7 Yn-Yn \n11 10 10 9 9 \nYn-Δ 8 8 8 7 7 \nΔ-Δ 9 9 9 8 8 \niterations \nΔ-Yn 8 8 8 8 8 \nFig. 6. The A-phase voltage profiles for Yn-Δ connection of \nT2~T4 \nA Three-phase Hybrid Power Flow Algorithm for Meshed Distribution System with Transformer Branches and PV Nodes \n 72 │ J Electr Eng Technol.2016; 11(1): 65-75 \nrated active power respectively. The convergence accuracy \nis 10 -6 p.u (voltage) and the PV voltage mismatch is \n0.01p.u. The converged iterations for different operation \nmodes with the proposed method are shown in Table 3. \nComparing the results in Table 2 and Table 3, it can be \nseen that the iteration numbers changed little with PV \nnodes, so the good convergen ce of the proposed algorithm \nis further verified. The A-phase converged voltage profiles \nfor Y\nn-Δ connection of T2~T4 with different loops and PV \nnodes are shown in Fig. 7. It can be seen that the voltages \nhave been improved with closed loops and (or) PV nodes. \nSimilarly, the more closed lo ops and (or) PV nodes, the \nbetter the improvement of the voltage level. \nSome PV nodes will be conver ted to PQ node if they \nviolate the reactive power lim its. Generally speaking, the \nvoltage can be further improved by increasing the output \nreactive power. In order to further analyze the effect on the \nvoltage level from the output reactive power of PV node, \nthree cases were discussed for Y\nn-Δ connection of T2~T4,  \nCase1: no closed loop but including PV1~3; \nCase2: closed loop 1~2 and PV1~2; \nCase3: closed loop 1~4 and PV1; \n \nThe Fig. 8 is the A-phase voltage profiles for Y\nn-Δ \nconnection of T2~T4 for limited and unlimited output \nreactive power at each PV node for three cases. And the \nTable 3. Converged results of Test 3 with PV nodes \nclosed loops and PV nodes \nno Loop loop1~2 loop1~4 item T2~T4 \nConnection PV1 PV1~2 PV1~3 PV1 PV1~2 PV1~3 PV1 PV1~2 PV1~3 \nYn-Yn 9 9 9 9 9 9 9 9 9 \nYn-Δ 7 8 8 7 7 8 7 7 8 \nΔ-Δ 8 8 8 8 8 8 8 7 8 iterations \nΔ-Yn 8 8 8 8 8 8 7 8 11 \n \nTable 4. Part of converged results for Yg-Δ connection of T2~T4 in case1~3 \nitem case iterations PV node positive sequence voltage at PV node/p.u. reactive power at PV node/kvar \nPV1 0.99045 150 \nPV2 0.99226 100 Case1 8 \nPV3 0.99700 14.8 \nPV1 0.989651 150 Case2 8 PV2 0.991288 100 \nLimited reactive  \npower \nCase3 7 PV1 0.96923 150 \nPV1 0.99424 171.0 \nPV2 0.99430 107.9 Case1 11 \nPV3 0.99757 0 \nPV1 0.99313 154.4 Case2 9 PV2 0.99572 122.6 \nUnlimited reactive \npower \nCase3 8 PV1 0.99442 302.3 \n \n \nFig. 7. The A-phase voltage profiles for Yn-Δ connection of T2~T4 with different loops and PV nodes \nHongwei Li, Huabing Wu, Biyu Jiang, Anan Zhang and Wei Fang \n http://www.jeet.or.kr │73\nrelated final solutions are presented in Table 4.  \nIn three cases, the voltage level with the unlimited \noutput reactive power is better than that with limited output \nreactive power The voltage improvement in case 3 is more \nobvious (see Fig. 8(c)), bu t the iteration number increases. \nFrom Table 4 for case 3, when the output reactive power \nhas a limit, the positive sequen ce voltage at the PV node \n(PV1) is very low, 0.969 23 p.u.. When the output reactive \npower has no limit, it is up to 0.994 42 p.u.. However, this \nhas been achieved with the cost of more reactive power \n(the reactive power has doubled from 150kvar to 302.3kvar \nin Case 3), and there will be much difficult in the actual \nsystem due to the high investments. \n7. Conclusion \n \nThis paper presents a three-phase hybrid power flow \nsolution for meshed distribution systems with DT branches \nand PV nodes. The main works include, \nAn improved three-phase power flow solution for meshed \ndistribution system was presented based on node-branch \nincidence matrix. The method has clear theory basis and \ngood efficiency. \nThe detailed DT models for all different connections were \nre-developed by considering the DT impedance asymmetry \nand neutral point grounded impedance. The equivalent \nmodel of DT branch was established and can be dealt with \nas an ordinary transmission line with the proposed power \nflow method. \nBased on the assumption that  the positive-sequence \nvoltage magnitudes of PV nodes are invariable, an approach \nwas developed to calculate reactive power increments of \nPV nodes. It can be easily integrated into the propose power \nflow method. \nCompared with the typical methods by using the IEEE4 \nand the modified IEEE34 test feeders, the validity and \nefficiency of the proposed algorithm have been proved. \n \n \nAcknowledgements \n \nThis work is supported fi nancially by the Chinese \nNational Key Basic Research and Development Program \n(973) with item #2013CB228203  and the Chinese Post-\ndoctoral Science Foundation with item #2014M562335. \n \n \nReferences \n \n[1] T. Chen, M. Chen, K. Hwang, P . Kotas, and E. Chebli, \n“Distribution system power  flow analysis: A rigid \napproach,” IEEE Trans. Power Deliv., vol. 6, no. 3, pp. \n1146-1152, 1991. \n[2] Ray D. Zimmerman, Hsiao-Dong Chiang, “Fast de-\ncoupled power flow for unbalanced radial distribution \nsystems,”\n IEEE Trans. Power Syst., vol. 10, no. 4, pp. \n2045-2051, 1995. \n[3] Zhang F，Cheng C S, “A Modified Newton Method \nfor Radial Distribution System Power Flow Analysis,” \nIEEE Trans. Power Syst., vol. 12, no. 1, pp. 389-397, \n1997. \n[4] P .  A .  N .  G a r c i a ,  J .  L .  R .  P e r e i r a ,  S .  C a r n e i r o ,  e t  a l ,  \n“Three-phase power flow calculations using the current \ninjection method,” \nIEEE Trans. Power Syst. , vol.15, \nno. 2, pp. 508-514, 2000. \n[5] M. Abdel-Akher, K. Nor, and A. Rashid, “Improved \nthree-phase power-flow methods using sequence com-\nponents,” \nIEEE Trans. Power Syst., vol. 20, no. 3, pp. \n1389-1397, 2005. \n \n(a) Case1 \n \n(b) Case2 \n \n(c) Case3 \nFig.8. The A-phase voltage profiles for Y n-Δ connection of\nT2~T4 for limited and unlimited reactive power a t \nPV node \n \nA Three-phase Hybrid Power Flow Algorithm for Meshed Distribution System with Transformer Branches and PV Nodes \n 74 │ J Electr Eng Technol.2016; 11(1): 65-75 \n[6] Shirmohammadi D，Hong H W, Semlyen A, et al, “A \ncompensation-based power flow method for weakly \nmeshed distribution and transmission networks,” \nIEEE \nTrans. on Power Syst., vol. 3, no. 2, pp. 753-761, 1988. \n[7] Luo G X, Semlyen A, “Efficient load flow for large \nweakly meshed networks,” \nIEEE Trans. on Power \nSyst., vol. 5, no. 4, pp. 1309-1316, 1990． \n[8] C. Cheng and D. Shirmohammadi, “A three-phase \npower flow method for real-time distribution system \nanalysis,” \nIEEE Trans. Power Syst., vol. 10, no. 2, pp. \n671-679, May 1995. \n[9] Teng J H, “A direct approa ch for distribution system \nload flow solutions,” IEEE Trans. on Power Deliv. , \nvol.18, no.3, pp. 882-887, 2003. \n[10] W.C. Wu , B.M. Zhang, “A three-phase power flow \nalgorithm for distribution system power flow based on \nloop-analysis method,” \nInt. J. Elect. Power and Energy \nSyst., vol. 30, no. 1, pp. 8-15, 2008. \n[11] Augugliaro, L. Dusonchet, S. Favuzza, et al, “A \nbackward sweep method for power flow solution in \ndistribution networks,”\n Int. J. Elect. Power and Energy \nSyst., vol. 32, no. 1, pp. 271-280, 2010. \n[12] T . H. Chen, M. S. Chen, T . Inoue, P . Kotas, and E. A. \nChebli, “Three phase coge nerator and transformer \nmodels for distribution system analysis,”\n IEEE Trans. \nPower Deliv., vol.6, no.4, pp1671-1681, 1991. \n[13] Mesut E. Baran, Eric A. Staton, “Distribution Trans-\nformer Models for Branch Current Based Feeder \nAnalysis,” \nIEEE Trans. on Power Syst., vol. 12, no. 2, \npp. 698-703, 1997. \n[14] Chen T. H., Yang W. C., Guo T. Y ., and Pu G . C., \n“Modeling and analysis of asymmetrical three-phase \ndistribution transformer banks with mid-tap connected \nto the secondary neutral conductor,” \nElect. Power Syst. \nResearch, vol. 54, no. 2, pp. 83-89, 2000.  \n[15] Irving M. R. and Al-Othman A. K., “Admittance matrix \nmodels of three-phase transformers with various \nneutral grounding configurations,”\n IEEE Trans. Power \nSyst., vol. 18, no. 3, pp. 1210-1212, Aug. 2003. \n[16] Xiao P., Yu D.C., and Yan W., “A Unified Three-Phase \nTransformer Model for Distribution Load Flow \nCalculations,” \nIEEE Trans. Power Syst., vol. 21, no. 3, \npp. 153-159, 2006.  \n[17] Wang Z., Chen F., and Li J., “Implementing trans-\nformer nodal admittance matrices into backward / \nforward sweep-based power flow analysis for un-\nbalanced radial di stribution systems,” \nIEEE Trans. \nPower Syst., vol. 19, no. 4, pp. 1831-1836, 2004. \n[18] LI hong-wei, LIU Qing-you, SHEN Xia, “A Three-\nPhase Unbalanced Power Fl ow Solution with Three-\nphase Distribution Transformers,” \nin Proceedings of \nDRPT2011, Weihai, China, pp. 831-836, July, 2011. \n[19] R. Palma-Behnke, J.L.A. Cerda, L.S. Vargas, A. Jofre, \n“A distribution company energy acquisition market \nmodel with integration of distributed generation and \nload curtailment options,” \nIEEE Trans. Power Syst. , \nvol. 20, no. 4, pp. 1718-1727, 2005. \n[20] Pecas Lopes J A, Hatziargyriou N, Mutale J, et al, \n“Integrating distributed generation into electric \npower systems: a review of drivers, challenges and \nopportunities,” \nElect. Power Syst. Research , vol.77, \nno. 9, pp. 1189-1203, 2007. \n[21] Y . Zhu and K. Tomsovic, “Adaptive power flow \nmethod for distribution systems with dispersed gene-\nration,” \nIEEE Trans. Power Deliv., vol. 17, no. 7, pp. \n822-827, 2002.  \n[22] Ding M., Guo X.F. , “Three-phase power flow for the \nweakly meshed distribution network with the dis-\ntributed generation,” \nProceedings of the CSEE, vol. 29, \nno. 13, pp. 35-40, 2009. \n[23] Li H.W., Sun H.B., Zhang A, et al, “Positive-sequence \ncomponent based three-phase unbalanced power flow \nsolution for distribution sy stem with PV nodes,” \nPro-\nceedings of the CSEE, vol. 32, no. 1, pp. 115-121, 2012. \n[24] Hongwei Li, Anan Zhang, Xia Shen, Jin Xu, “A load \nflow method for weakly meshed distribution networks \nusing powers as flow variables,” \nInt. J. Elect. Power \nand Energy Syst., vol. 58, pp. 291-299, 2014 \n[25] Distribution System An alysis Subcommittee. Radial \ndistribution test feeders  [EB/OL]. http://ewh.ieee.org \n/soc/pes/dsacom/testfeeders/ index.html. \n[26] William H. Kersting, Distribution System Modeling \nand Analysis. 2nd. New York: Taylor & Francis, 2007. \n \n \nAppendix A \n \nIn (16), I\nI3 I3\nI3 I3\nt I3 I3\nI7 I7\nI9 I9 I9\nK\n⎡ ⎤\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎣ ⎦\nE 0 000 0 0 0 0\nE E 000 0 0 0 0\nKKE 0 0 0 0 0 0\nKKE E 0 0 0 0 0\nT= K K EEE 0 0 0 0\nE 0 000 E 0 0 0\nK 0 000K E 0 0\nE E 000 0 0 E 0\nK K 000 0 0K E\n, but the \npath matrix is t\n⎡ ⎤\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥\n⎢ ⎥⎣ ⎦\nE 00000000\nE E0000000\nE E E000000\nE E E E00000\nT= E EEEE0 0 0 0\nE 0000E000\nE 0000E E00\nE E00000E0\nE E00000E E\n when \nreplacing all DT branches with  ordinary transmission lines \nin Fig. 3. Comparing tT  with ItKT , the generation process \nof ItKT  can be summarized as following. \nMoving from the first entry to the last en try along the \npath of node i in tT , when encountering DT branch  j, the \ncorresponding entries before DT branch j corresponding \nentry are pre-mu ltiplied with I jK  and then path vector \nVt iKT of node i could be obtained. Certainly, if there is more \nHongwei Li, Huabing Wu, Biyu Jiang, Anan Zhang and Wei Fang \n http://www.jeet.or.kr │75\nthan one DT branch on the path, all the corresponding \nentries should be pre-multi plied with corresponding IK  \nwhenever encountering a DT branch along the path. \nIn Fig. 3 the voltages of node 8 and node 9 can be \ncalculated with: \n \n[]\nV\nn 8 0 b1 bt1 b2 bt2 b8 bt8\n0b t b t\n0t 8 b t b t\n   \n   K\n=− − −\n=−\n=−\nUU Z IZ IZ I\nU EE00000E0Z I\nUTZ I\n  (A.1) \n[]\nV\nn 9 V9 0 b1 bt1 b2 bt2 b8 bt8 T9 bt9\nV9 0 V9 V9 V9 bt bt\nV9 0 t9 bt bt\n()\n   \n   K\n=− − −−\n=−\n=−\nUK U Z IZ IZ I Z I\nK U K K 00000K E Z I\nKU T Z I\n (A.2) \n \nwhere, T9Z  is determined by DT  coefficient matrices, \nbtZ  is link branches impedance diagonal matrix of \n3m × 3m, Vt8KT and Vt9KT are the node 8 and node 9 \ncorresponding row vectors in VtKT  respectively. \nBy introducing the voltage calculation process to other \nnodes based on (A.1) and (A.2), the formula to calculate \nnode voltage can be expressed in general form as (17). \n \n \nAppendix B \n \nAfter \nkth iteration, the pos itive sequence current \nincrement at PV node i is d_ 1\nk\niIΔ\u0005 , and then the apparent \npower increment at PV node i can be calculated by, \n \nd_1 d_1jj1*\nd dr d _1 dr d _1 d _13e( ) 3e( j )\nkk\niikk k k\nii i i i iSU I U c d θθ+Δ= Δ = Δ− Δ \u0005  (B.1) \n \nExpanding (B.1), the active power increment is, \n \n11\ndd d r d _ 1 d _ 1 d _ 1 d _ 1Re( ) 3 (cos sin )kk k k k k\nii i i i i iPS U c d θθ++Δ=Δ = Δ+ Δ  \n  (B.2) \n \nFor the output active power of PV node is constant, that \nis \n1\nd 0k\niP +Δ= . Substituting it into (B.2) gives \n \n d_ 1 d_ 1 d_ 1 tankk k\nii icd θΔ= − Δ   (B.3) \n \nFrom (B.1), the reactive po wer increment of PV node i \ncan be expressed as, \n \n 1\nd d r d_ 1 d_ 1 d_ 1 d_ 13( s i n c o s )kk k k k\nii i i i iQU d θθ+Δ= Δ − Δ   (B.4) \n \nSubstituting (B.3) into (B.4) and rearranging gives (36). \nBesides, d_ 1kiθ is generally very small, so d_1Δc  is \nmuch less than d_1Δd  based on (B.3). Then (37) can be \nobtained by expanding (34) and ignoring d_1Δc . \nHongwei Li He received Ms.c degree \nin electrical engineering from South-\nwest Jiaotong Univer sity in China in \n2005. His research interests are Distri-\nbution system analysis and control, \nDistributed Generation modeling and \nControl. \n \n \n \nHuabing Wu He received B.S degree \nin Electrical Engineering and Automa-\ntion from Southwest Petroleum Uni-\nversity in 2013. Now,  he is a graduate \nstudent in Control Science and \nEngineering in Southwest Petroleum \nUniversity. His research interests are \nmicrogrid analysis and optimization. \n \n \nBiyu Jiang She received B.S degree in \nelectrical engineering and automation \nfrom southwest petroleum university in \n2013. Now she is a graduate student in \ncontrol science and engineering in \nSouthwest Petroleum University. Her \nresearch interest is  microgrid analysis \nand optimization. \n \n \nAnan Zhang He received B.S., M.S. \nand PhD degree from Sichuan Uni-\nversity in 2000, 2003 and 2010 \nrespectively. His research interests are \nsmart grid, reactive power control and \nvoltage control.  \n \n \n \n \nWei Fang She received B.S. degree in \ntesting technology and automatic instru-\nment from Chongqing University in \n1998. Her research interests are power \nelectronics and power drives.  \n \n",
  "topic": "Correctness",
  "concepts": [
    {
      "name": "Correctness",
      "score": 0.6947967410087585
    },
    {
      "name": "Incidence matrix",
      "score": 0.662455141544342
    },
    {
      "name": "Transformer",
      "score": 0.6233311891555786
    },
    {
      "name": "Node (physics)",
      "score": 0.5407633185386658
    },
    {
      "name": "Power flow",
      "score": 0.4822548031806946
    },
    {
      "name": "Voltage",
      "score": 0.47843697667121887
    },
    {
      "name": "Topology (electrical circuits)",
      "score": 0.47716015577316284
    },
    {
      "name": "Algorithm",
      "score": 0.4443351924419403
    },
    {
      "name": "AC power",
      "score": 0.44260475039482117
    },
    {
      "name": "Power (physics)",
      "score": 0.3837788701057434
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.3719991445541382
    },
    {
      "name": "Electronic engineering",
      "score": 0.3442828059196472
    },
    {
      "name": "Computer science",
      "score": 0.34321361780166626
    },
    {
      "name": "Electric power system",
      "score": 0.3258097767829895
    },
    {
      "name": "Engineering",
      "score": 0.282020628452301
    },
    {
      "name": "Electrical engineering",
      "score": 0.22592037916183472
    },
    {
      "name": "Physics",
      "score": 0.0
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    },
    {
      "name": "Control (management)",
      "score": 0.0
    },
    {
      "name": "Artificial intelligence",
      "score": 0.0
    },
    {
      "name": "Structural engineering",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I165745306",
      "name": "Southwest Petroleum University",
      "country": "CN"
    }
  ],
  "cited_by": 13
}