{
  "title": "Study of Dielectric Properties of a Potential RBD Palm Oil and RBD Soybean Oil Mixture as Insulating Liquid in Transformer",
  "url": "https://openalex.org/W2328792303",
  "year": 2015,
  "authors": [
    {
      "id": "https://openalex.org/A5057084720",
      "name": "Kiasatina Azmi",
      "affiliations": [
        "Universiti Sains Malaysia"
      ]
    },
    {
      "id": "https://openalex.org/A5071527753",
      "name": "Mohd Azmier Ahmad",
      "affiliations": [
        "Universiti Sains Malaysia"
      ]
    },
    {
      "id": "https://openalex.org/A5020238509",
      "name": "Mohamad Kamarol Mohd Jamil",
      "affiliations": [
        "Universiti Sains Malaysia"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2051924269",
    "https://openalex.org/W2158423711",
    "https://openalex.org/W2135715542",
    "https://openalex.org/W2130180486",
    "https://openalex.org/W2167873708",
    "https://openalex.org/W2125563508",
    "https://openalex.org/W2019867516",
    "https://openalex.org/W2132518957",
    "https://openalex.org/W1815940692",
    "https://openalex.org/W2060120129",
    "https://openalex.org/W2041855240",
    "https://openalex.org/W2130776655",
    "https://openalex.org/W2158993527",
    "https://openalex.org/W588132785",
    "https://openalex.org/W2093395288",
    "https://openalex.org/W2146862034",
    "https://openalex.org/W2123518501",
    "https://openalex.org/W1675235271",
    "https://openalex.org/W2540268467",
    "https://openalex.org/W2332429694",
    "https://openalex.org/W2103650551",
    "https://openalex.org/W2536782676",
    "https://openalex.org/W2072280982",
    "https://openalex.org/W2504851542",
    "https://openalex.org/W1864541204",
    "https://openalex.org/W3140467905",
    "https://openalex.org/W1974705239",
    "https://openalex.org/W2324466708",
    "https://openalex.org/W2177923188",
    "https://openalex.org/W2053720482",
    "https://openalex.org/W2107556928",
    "https://openalex.org/W2052733514",
    "https://openalex.org/W3145843727",
    "https://openalex.org/W2124820370",
    "https://openalex.org/W2119607692",
    "https://openalex.org/W2038914297",
    "https://openalex.org/W2097342371",
    "https://openalex.org/W1557207449",
    "https://openalex.org/W87792921",
    "https://openalex.org/W2013590480",
    "https://openalex.org/W2122802427",
    "https://openalex.org/W2158856611",
    "https://openalex.org/W2169190621",
    "https://openalex.org/W2170016128",
    "https://openalex.org/W2126049032",
    "https://openalex.org/W2108262504",
    "https://openalex.org/W3144015425",
    "https://openalex.org/W2071255352",
    "https://openalex.org/W2151383119",
    "https://openalex.org/W2542580745"
  ],
  "abstract": "This paper reported the experimental result of dielectric properties of Refined, Bleached and Deodorized Palm Oil (RBDPO) combined with 0-50% of Refined, Bleached and Deodorized Soybean Oil (RBDSO). The dielectric strength and relative permittivity of RBDPO/RBDSO was higher compared to mineral oil at all ranges of ratios and temperatures which indicated a positive sign for its possible use as insulating liquid in a transformer. All ratios of the RBDPO/RBDSO mixture also demonstrated lower dissipation factor compared to mineral oil at 40℃, 70℃ and 90℃. Apart from that, the kinematic viscosity for the oil mixtures shown exceeded the IEC 60296 as well as the mineral oil results. 70%RBDPO/30%RBDSO mixture ratio was chosen as the best mixing percentage after comparison was made with the mineral oil and IEC 60296 standard where the mixture accumulated the most satisfactory of dielectric properties hence making it as the potential candidate for palm and soybean-based transformer oil.",
  "full_text": "J Electr Eng Technol.2015; 10(5): 2105-2119 \nhttp://dx.doi.org/10.5370/JEET.2015.10.5.2105 \n 2105\nCopyright ⓒ The Korean Institute of Electrical Engineers \nThis is an Open-Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/ \nlicenses/by-nc/3.0/) which permits unrestricted non-commercial use, distribution, and reproduction in any medium, provided the original work is properly cited. \nStudy of Dielectric Properties of a Potential RBD Palm Oil and RBD \nSoybean Oil Mixture as Insulating Liquid in Transformer \n \n \nKiasatina Azmi*, Azmier Ahmad** and Mohamad Kamarol† \n \nAbstract – This paper reported the experimental result of dielectric properties of Refined, Bleached \nand Deodorized Palm Oil (RBDPO ) combined with 0-50% of Refi ned, Bleached and Deodorized \nSoybean Oil (RBDSO). The diel ectric strength and relative permittivity of RBDPO/RBDSO was \nhigher compared to mineral oil at all ranges of ratios and temperatures which indicated a positive sign \nfor its possible use as insulating liquid in a transformer. All ratios of the RBDPO/RBDSO mixture also \ndemonstrated lower dissipation factor compared to mineral oil at 40 ˚C, 70 ˚C and 90 ˚C. Apart from \nthat, the kinematic viscosity for the oil mixtures shown exceeded the IEC 60296 as well as the mineral \noil results. 70%RBDPO/30%RBDSO mixture ratio was chosen as the best mixing percentage after \ncomparison was made with the mineral oil and IEC 60296 standard where the mixture accumulated the \nmost satisfactory of dielectric properties hence making it as the potential candidate for palm and \nsoybean-based transformer oil. \n \nKeywords: RBDPO, Dielectric strength, Relative permittivity, Kinematic viscosity, Mineral oil\n  \n \n \n \n1. Introduction \n \nA Transformer is one of the crucial equipments in \nelectric power transmission and distribution system. In \norder to perform its function, electrical power transformers \nneed an insulating liquid to function as a cooler and \ninsulator. There are a few characteristics that an insulating \nmedium is required to have in order to function effectively \nin transformers. These characteristics include long term \nstability due to possible problems brought about by \noxidation, contamination and excessive temperature which \ncan affect the reliability of the equipment and the suitability \nof the oil in rheological aspect. These characteristics \nimplicate the dielectric properties of the insulating liquid \nwhich used inside the transformers.  \nGenerally, petroleum-based mineral oil is used to \npermeate the high voltage transformer to function as an \ninsulating liquid. However, due to the considerations of \nthe environment, costs and its working life span, suitable \nreplacements are being sought for this petroleum based \noil [1]. Numerous researches [2-7] have been conducted \nand the findings indicated that environmentally friendly \ninsulating oil such as vegetable oil (natural ester) was \nshown to be the best candidate for this replacement.  \nMoreover, in the last five years, numerous researches \npertaining to the uses of natural ester as an insulating \nliquid in electrical power transformer had been extensively \nconducted either singly or in combination with mineral oil \n[8-17]. The selection is due to its compatible dielectric \nproperties which best suit its function as an insulating \nliquid, fire safety advantageous and most importantly it is \nrenewable and environmentally friendly product. In Europe, \nvegetable oil such as soybean oil, sunflower oil and \nrapeseed oil have already been utilized as the transformer \noils [18]. Thus, it is implied that the used of vegetable oil \nas an insulating liquid has been well developed in outside \nrange of Malaysia. \nOne biodegradable vegetable oil that is available in \nMalaysia is palm oil. There has been extensive research \ninto the use of palm oil as alternative transformer oil [19-\n28]. The extensive research has shown that palm oil is a \npotential candidate for the replacement of petroleum based \ninsulating oil. Refined, Bleached and Deodorized Palm Oil \n(RBDPO) has shown its potential as dielectric fluids [19-\n21]. Some of its dielectric properties are at par with the \nexisting standard. Compared to mineral oil, palm oil has \nshown to have more elevated breakdown voltage (BDV), \nflash point and fire point. However, the kinematic viscosity \nof RBDPO does not comply with the IEC 60296 standard. \nElimination of this weakness should be considered to make \nthe use of palm oil as an insulating fluid in transformer \nmore effective. One of the suggestions to improve the \nkinematic viscosity is by mixing palm oil with soybean oil. \nNevertheless, the dielectric properties of the oil mixture \nhave yet to be investigated. Therefore, the aims of this \nresearch are to investigate a nd to compare the dielectric \nproperties of palm oil and soybean oil mixture with mineral \noil of various ratios and temperatures. The compared \ndielectric properties of mineral oil were obtained from the \npast researches at various ratios and temperatures too. The \n†  Corresponding Author: School of Electrical and Electronic Engin-\neering, Universiti Sains Malaysia, Malaysia. (eekamarol@usm.my) \n*  School of Electrical and Electr onic Engineering, Universiti Sains \nMalaysia, Malaysia. (kiasatina.azmi@yahoo.com) \n**  School of Chemical Engineering, Universiti Sains Malaysia, Malaysia. \n(chazmier@usm.my) \nReceived: September 4, 2014; Accepted: June 19, 2015 \nISSN(Print)  1975-0102\nISSN(Online) 2093-7423\nStudy of Dielectric Properties of a Potential RBD Palm Oil and RBD Soybean Oil Mixture as Insulating Liquid in Transformer \n 2106 │ J Electr Eng Technol.2015; 10(5): 2105-2119 \nmixing formulation of the oil mixture which has the most \neffective dielectric properties to be utilized as an insulating \nliquid in a transformer is then selected. \n \n \n2. Experimental Test Setup \n \n2.1 Samples preparation \n \nTwo vegetable oil products were used in the experiments \nand they were palm oil and soybean oil. The palm oil \nproduct was Refined Bleached  and Deodorized Palm Oil \n(RBDPO) which was bought from the Wilmar Edibles Oil \nSdn. Bhd. The soybean oil product was Refined, Bleached, \nand, Deodorized Soybean Oil (RBDSO) which was a \ncommercial cooking oil known as Vesoya Cooking Oil and \nmanufactured by Yee Lee Corporation Berhad. No treatment \nhas been conducted on any of the oils. RBDPO does not \nperformed any treatment due to the breakdown voltage of \n100%RBDPO found in this experiment was higher \ncompared to the past resear ches (19-21). The breakdown \nvoltage of 100%RBDPO reported by Suwarno (19, 20) \nand U. U. Abdullahi (21) was approximately 53kV , 43kV \nand 75kV , respectively at 40°C. Whereas 100%RBDPO \nin this research gives high value of 84.23kV at the same \ntemperature. Thus, it was considered that the oil has \nrelatively low contamination and no further treatment need \nto be done. Meanwhile, the RBDSO used in the experiments \nwas commercial cooking oil which is freshly poured out from \nthe container and free from the contaminants. Therefore, \nno pretreatment was conducted on the RBDSO. \nThe samples used in the experiments were the mixture of \nRBDPO and RBDSO. The mixture ratio of RBDSO and \nRBDPO varies from 0 % to 50%. The mixing formulations \nare shown in Table 1. The RBDSO was limited to 50% due \nto the main focus in this research which is to utilize the \npalm oil as the insulating liquid in transformer. \n \nTable 1. BDPO/RBDSO mixture \nSamples symbol RBDPO RBDSO \nS1 100% 0% \nS2 90% 10% \nS3 80% 20% \nS4 70% 30% \nS5 60% 40% \nS6 50% 50% \n \n2.2 Electrodes configuratio n and breakdown voltage \nmeasurement \n \nFig. 1 shows the electrodes configuration of Fully \nAutomatic Portable Breakdown V oltage Test Set which was \nused to evaluate the breakdown voltage. The equipment \nwas capable of supplying the voltage up to 100kV . The \nbreakdown voltage test was implemented according to IEC \n60156 [29]. The test cell had a volume capacity of 400ml, \nconsisted of VDE electrodes of 12.5mm diameter with \nthe gap of 2.5mm. The temperature of 40°C to 100°C was \ndetermined by using a stirring hot plate which can sustain \nthe temperature up until 540°C. The stirring hot plate can \nalso stir with the speed range between 60 to 1200 rpm.  \nSince the BDV test device operated automatically to \nmeasure six consecutive breakdown voltages nonstop, \nthe temperature of the oil mixture could drop slightly in \nbetween the operation of BDV test after placing the test \ncell from the hot plate into the BDV test device. Thus, the \ntemperature dropping of RBDPO and RBDSO at starting \npoint of 120°C was recorded and plotted by using Matlab \nSoftware as shown in Fig. 2. From the plotted graph, an \nequation was obtained. Thus, by using the equation, the \ntemperature dropping within a time range can be evaluated. \nThe equation for temperature dropping for RBDPO and \nRBDSO is as follows:- \n \nRBDPO: f(x)=p1/(x+q1) where p1=7232 and q1= 59.96 \nRBDSO: f(x)=p1/(x+q1) where p1=6439 and q1= 54.25 \n \nThe drop in the temperature of the oil mixture from \n0% to 50% ratio of RBDSO was evaluated by using the \ntemperature dropping of RBDPO and RBDSO recorded.  \nAs a result, the BDV test of the oil mixture was performed \nwithin the time range of the dropping temperature in \nbetween ±4°C. The test cell was filled with the oil mixtures \nwith 0% to 50% of RBDSO content being directly heated \nuntil it reached the required te mperature on the hot plate \n \nFig. 1. The electrode used for measuring BDV of oil mixture\n \n \nFig. 2. Temperature drop of RBDPO and RBDSO \nKiasatina Azmi, Azmier Ahmad and Mohamad Kamarol \n http://www.jeet.or.kr │2107\nfor 5 to 10 minutes. At the same time, it was stirred at 250 \nto 300 rpm to ensure that the temperature’s equilibrium in \nthe test cell. After the requ ired temperature was reached, \nthe test cell then was quickly inserted into the BDV device. \nThe BDV device was automatically run by applying the \nvoltage at the rise rate of 2kVs\n-1 until breakdown occurs. \nThe breakdown voltage was recorded in the average of \nsix measurements with 2 minutes pause between each \nconsecutive breakdown. The experiment was conducted in \nthe laboratory at 40˚C to 100˚C. \n \n2.3 Dielectric strength calculation and simulation \n \nThe mean value of six breakdown voltage measurements \nobtained from the experiment were used in the calculation \nand simulation of dielectric strength. The simulation result \nwas then compared with the calculation result. For further \nanalysis, a simulation on the da ta of dielectric strength was \nconducted according to Weibull distribution. This statistical \nanalysis was carried out by analyzing the dispersion of ten \ndata of the dielectric strength. The function of the Weibull \ndistribution was to identify the lowest withstands dielectric \nstrength from the dispersion data of the dielectric strength. \nThe result from the analysis of the Weibull distribution was \nthen compared with the simulation and calculation of the \ndielectric strength. \nOpera 2D and Minitab Software were used in the \nsimulation process. For Opera 2D simulation, the spherical \nelectrode configuration was modeled as shown in Fig. 3. \nThen, the simulation was performed and the result of \nelectric field distribution was obtained as shown in Fig. 8.  \nMeanwhile the calculation was performed by using the \napproximate formula for quasi- uniform electric field near \nthe symmetrical axis of the same radius of spherical \nelectrode which is valid in narrow gap as follows [30]: \n \n \n2( 1c o s)\nVE dR θ≈ +−  (1) \n \nwhere V is the applied AC voltage which is the breakdown \nvoltage (in kV), d is the gap distance between the spherical \nelectrodes (in mm) and R is the radius of the spherical \nelectrodes (in mm). The polar angle, θ = 0˚ corresponds to \nthe apex of the sphere; which means that only a small part \nof the spherical electrode surface area near the symmetrical \naxis contributed to the breakdown voltage. \n \n2.4 Dissipation factor (Tan Delta) and Relative \nPermittivity (Dielectric Constant) measurement \n \nFig. 4 shows A VOX ADTR-2k fully automatic tan delta, \ndielectric constant and resistivity test set. It is equipped \nwith oil test cell heater for controlling the temperature. The \ntest was conducted according to the standard of IEC 60247 \n[31] at 40˚C, 70˚C and 90˚C. The oil sample was filled into \na liquid test cell. Then, the dissipation factor was obtained \nautomatically by subjecting the electrical stress to the oil in \nbetween 0.03kV/mm to 0.1kV/mm. \n \n2.5 Kinematic viscosity measurement \n \nFig. 5 shows Petrolab TV4000 Constant Temperature \nViscosity Bath using with RTE 111 temperature controller \nbath which was used to measure the kinematic viscosity. \nThe kinematic viscosity was measured according to ISO \n3104 [32]. The experiment was conducted at 40 ˚C in \nlaboratory. The glass capillary viscometer was filled with \napproximately 10ml of oil sample. Two levels of viscometer \nFig. 3. Model of spherical electrode configuration \n \nFig. 4. A VOX ADTR-2k fully automatic Tan delta, dielectric\nconstant and resistivity test set \n \nFig. 5. Petrolab TV4000 constant temperature viscosity \nbath with RTE 111 temperature controller bath\nStudy of Dielectric Properties of a Potential RBD Palm Oil and RBD Soybean Oil Mixture as Insulating Liquid in Transformer \n 2108 │ J Electr Eng Technol.2015; 10(5): 2105-2119 \nwere used to determine the kinematic viscosity. Time was \ntaken for the oil to flow from the high level to low level of \nthe capillary viscometer. The kinematic viscosity was \ndetermined by using the following formula: \n \n \n  VC x t=  (2) \n \nwhere V is the kinematic viscosity (in mm 2/s), C is the \nviscometer constant (in mm 2/s2) and t is the time taken for \nthe oil to flow from high level to low level of the glass \ncapillary viscometer (in s). \n \n2.6 Water content measurement \n \nFig. 6 shows Mettler Toledo DL 37 Karl Fisher \nCoulometer which is used to measure the water content. \nThe water content is measur ed according to IEC 60814 \n[33]. The experiment was conducted in the laboratory at \nroom temperature. The sample used was 2ml and it was \ntaken by using a syringe. The tip of the syringe’s needle \nwas then closed with silicone rubber block. The syringe \nwas filled with 2ml of oil sample with silicone rubber \nblock on the tip of needle which was weighed to obtain W1. \nAfter that, the syringe was injected into the titration cell \nthrough the rubber septum. After the injection process \ninto titration cell was completed, the empty syringe with \nsilicone rubber block on the tip of needle was weighed to \nobtain W2. After the titration process was completed, the \nvalue of W1 and W2 was keyed in into the instrument for \ndetermination of the mass of the oil mixture. The water \ncontent was determined using the following formula:  \n \n \nWater content m\nM=  (3) \n \nwhere m is the quantity of water titrated (in mg/kg) and M \nis the mass of sample obtained from value of W1 and W2 \ninserted into the measurement instrument (in mg/kg). \n \n2.7 Chemical composition analysis \n \nThe oil samples were first converted into fatty acid \nmethyl ester (FAME) by using based catalyzed methyl ester \nmethod. The FAME were then analyzed by using Perkin \nElmer Clarus 600T Gas Chromatograph-Mass Spectrometers \nas shown in Fig. 7. The GC/MS consisted of 30m length \ncolumn with 250µm diameter. The initial temperature of \nthe oven was held for 2 minutes at 65 ˚C. Then, the \ntemperature of the oven was gradually increased at the rate \nof 8 ˚C/min until it reached 300 ˚C. The temperature was \nheld for 10 minutes at 300 ˚C. The chemical composition \nwas separated by using helium gas which was utilized as \na carrier gas. A 0.1µl volume of FAME was used in the \nanalysis and the test was run for 40 minutes. Software \nTurbomass was used to integrate the chromatograms \nwhere the peak areas of different components were \nmeasured. The identification of the components was \nachieved by comparing them with National Institute of \nStandards and Technology (NIST) standard reference \ndatabase. \n \n \n3. Results & Discussion \n \n3.1 Dielectric strength characteristics \n \nThe dielectric strength (electric field strength) is the \nmaximum stress which the insulation can withstand \nbefore breakdown. It depends on the insulation material, \nimpurities and the geometri es of electrodes under the \napplied electric field. The quality of an insulating liquid \nis usually determined by the mean breakdown values. \nHowever, transformers are designed according to the \nminimum withstand dielectric strength, rather than the \nmean breakdown values. Thus, statistical analyses need \nto be used for estimation of the lower probability of the \ndielectric strength. In order to evaluate the dielectric \nstrength, the value of breakdown voltage should be known. \nThe breakdown voltage experiment of RBDPO/RBDSO \nmixture was conducted for furthe r analysis of its dielectric \nstrength.  \nIn this analysis, the dielectric strength was obtained from \nthe mean value breakdown voltage through calculation \nand simulation and it was compared with the estimated \nlowest dielectric strength from  dispersion data of Weibull \n \nFig. 6.Mettler toledo DL 37 karl fisher coulometer \n \nFig. 7. Perkin elmer clarus 600T gas chromatograph-mass \nspectrometers \nKiasatina Azmi, Azmier Ahmad and Mohamad Kamarol \n http://www.jeet.or.kr │2109\ndistribution. The purpose of comparing the result of \ncalculation and simulation with the Weibull distribution \nwas to establish whether the dielectric strength obtained \nthrough calculation and simulation was aligned with the \nlowest required dielectric strength obtained from the \nWeibull distribution. \nTable 2 shows the results of breakdown voltage from \n0% to 50% of RBDSO content in the RBDPO mixture at \n40˚C to 100 ˚C. The breakdown voltage results listed in \nTable 2 were the mean value of six breakdown voltage \nmeasurements. The breakdown voltage was measured \nbased on the RBDSO ratio and the temperature. \nAll the results of breakdown voltage from 0% to 50% \nof RBDSO were above 30kV , which fulfilled the IEC \n60296 standard. The breakdown voltage of 100% RBDPO \nobtained in this experiment was relatively higher than that \nreported by Suwarno et al. [19] which was only around \n53kV at 40 ˚C. Furthermore, the breakdown voltage of \n100% RBDPO obtained in this experiment was also \nrelatively higher than the conventional mineral oil which \nwas only around 37kV at 40 ˚C [23]. The mixture of \nRBDSO with up to 50% ratio in RBDPO also gave a \nhigher breakdown voltage compared to this mineral oil at \n40˚C. \nBased on Eq. 1 written previous, the dielectric strength \nof RBDPO/RBDSO mixture was calculated by using the \nmean value of breakdown voltage from Table 2. The \ncalculation results of dielectri c strength are tabulated in \nTable 3. For comparison, a simulation has been conducted \nusing Software Opera 2D to simulate the electric field \ndistribution of RBDPO/RBDSO mixture. The simulation of \nelectric field distribution is shown in Fig. 8. The maximum \nelectric field is indicated by pink color between the gaps \nconcentrated at the symmetrical axis of spherical electrode. \nThe simulations results of dielectric strength are listed in \nTable 4. \nA withstand dielectric strength is regarded not as the \nfixed value but rather as a statistical variable which \ncorresponds to a low breakdown probability [34]. One of \ncommon statistical distributions used to analyze the failure \nin dielectric materials is Weibull distribution [35, 36]. In \nliquid dielectric, the breakdown field strength has shown \nto have a good agreement with the two parameters (scale \nand shape) of failure density in Weibull distribution. The \nequation which is expressed below is based on the weakest \nlink theory:  \n \n \n() 1e x p EtFE t Ets\nβ⎡⎤ ⎛⎞\n=− − ⎢⎥ ⎜⎟⎜⎟⎢⎥ ⎝⎠⎣⎦\n (4) \n \nwhere F(Et) is the cumulative failure probability for the \nWeibull distribution, Et is the random variable (the \nmeasuring values of the cumulative breakdown field \nstrength), Ets is the scale parameter which represents the \ncumulative dielectric breakdown field strength required for \nTable 2. Breakdown voltage measurements of RBDPO/\nRBDSO mixture \n \nTable 3. Calculation of dielectric strength of RBDPO /\nRBDSO mixture \nFig. 8. Electric field distribution of quasi-uniform electrodes\nof RBDPO/RBDSO mixture \n \nTable 4. Simulation of dielectric strength of RBDPO/\nRBDSO mixture \n \nStudy of Dielectric Properties of a Potential RBD Palm Oil and RBD Soybean Oil Mixture as Insulating Liquid in Transformer \n 2110 │ J Electr Eng Technol.2015; 10(5): 2105-2119 \n63.21% of the tested specimens to fail and β is the shape \nparameter which is a dimensionless number, a measure of \nscattered values of the cumulative breakdown field strength \nfor Et =Ets and determine the shape of the probability \ndensity function. In failure distribution and reliability \nfunction, Ets plays an important role where it defines the \ncharacteristics life of the Weibull distribution at probability \nfailure of 63.21% [37, 38]. Therefore, in this statistic \nanalysis, the sample which fit best the Weibull distribution \nwas identified by having the highest dielectric strength at \n63.21% of failure. Moreover, at probability failure of \n63.21%, the lowest withstand of dielectric strength was \nalso estimated. \nIn order to determine the probability of dielectric strength \nof RBDPO/RBDSO mixture, p-value plays an important \nrole to identify whether the dielectric strength data follows \nthe distribution. P-value is the probability of making a \nmistake if the null hypothesis is rejected [36]. P-value \nshould be higher than the significant levels test ( α = 0.05) \nto accept null hypothesis which means the dielectric strength \ndata belongs to the distribution.  \nTen data has been used in this statistical analysis. The \nprobability distribution of dielectric strength of RBDPO/ \nRBDSO mixture was analyzed from 0% to 50%, at 40˚C to \n60˚C. The results of Weibull distribution analysis at 40 ˚C, \n50˚C and 60˚C are tabulated in Table 5. Figs. 9 (a), (b), and \n(c), shows the probability plot of dielectric strength for \n40˚C, 50 ˚C and 60 ˚C, respectively. It shows that the \nconformity of Weibull distribution started to decrease \nbelow than 63.2% probability in certain ratios of RBDSO. \nHowever, all the data showed a good linearity and are well \nscattered along the curve fitting which showed that the \ndielectric strength of RBDPO /RBDSO mixture generally \nfollowed the Weibull distribution. Moreover, the result of \np-value in Table 5 has shown that the data sufficiently \nfitted into the Webull distribution. It appears that only one \ndielectric strength data has the p-value less than 0.05 at \n50˚C and 60 ˚C. Thus, the dielectric strength data was \nassumed to fit in the Weibull plot. \n \nTable 5. Weibull distribution analysis of RBDPO/RBDSO \nmixture \n \n \nFig. 10 shows the comparisons of the dielectric strength \nof RBDPO/RBDSO mixture between calculation, simulation \nand Weibull distribution analysis. The electric field \nstrength of RBDPO/RBDSO mixture determined from the \ncalculation supported the simulation results. In addition, \nthe dielectric strength obtained from the calculation and \nsimulation of mean value breakdown voltage shows \nslightly close to the estimated  lowest dielectric strength \nobtained from Weibull plot at 40 ˚C, 50 ˚C and 60 ˚C with \napproximate difference from 0% to 11%.  \nFig. 10 also shows that the dielectric strength depended \n \n(a) Weibull distribution of RBDPO/RBDSO mixture at 40˚C\n \n(b) Weibull distribution of RBDPO/RBDSO mixture at 50˚C\n \n(c) Weibull distribution of RBDPO/RBDSO mixture at 60˚C\nFig. 9. Weibull distribution of RBDPO/RBDSO mixture a t\n40˚C, 50˚C and 60˚C \nKiasatina Azmi, Azmier Ahmad and Mohamad Kamarol \n http://www.jeet.or.kr │2111\non the RBDSO content. The dielectric strength of RBDPO/ \nRBDSO mixture decreased with  the increment of RBDSO \nratio into RBDPO. The decrement of dielectric strength \nwas explained by the breakdown mechanism in liquid \ndielectric as illustrated in Fig. 11. RBDPO/RBDSO mixture \nat various ratio of RBDSO may yield to different stressed \noil volume mechanism which might be due to the water \ncontent in the commercial li quid of RBDSO [39]. It is \nbelieved that in this case, the stressed oil volume in the oil \nmixture increased with the increment of RBDSO content \nwhich resulted in a decrease the breakdown voltage. The \ndifferences in stressed oil volume might form a number of \ngas bubbles bridging the gap at different voltage. As stated \nin the cultivation and bubble mechanism theory [39], the \nproduction of large number of gas bubbles will form a \nbridge along the region from the high voltage electrode to \nthe grounded electrode side. The generation of gas bubbles \nin RBDPO/RBDSO mixture at each ratio of RBDSO might \noccur at the voltage below the breakdown voltage level and \nthe gas bubbles completely bridged the gap when the \nvoltage applied reached the breakdown voltage. The bridging \nprocess of the gas bubbles can be explained according to \nthe suspended particle theory [39, 40]. The permittivity \nof the gas bubble, ε\ng is smaller than the permittivity of the \noil, εl. Under the electric field intensity, the gas bubbles \nexperienced a force directed towards areas of minimum \nstress. When the voltage applied approached the breakdown \nvoltage, the number of gas bubbles formation is large and \naligned between the electrodes due to the existing force. \nThe gas bubbles finally form a stable chain bridging the \ngap and lead to th e breakdown of the o il at each ratio of \nRBDPO mixture. \nThe graph plotted also shows the dielectric strength of \nmineral oil at 40 ˚C to 100 ˚C reported by Suwarno et al. \n[19]. It shows that the dielectric strength of mineral oil is \nlower compared to the dielectric strength of the oil mixture \nfrom 0% to 50% of the RBDSO content. The two results of \nmineral oil at 40 ˚C and 50 ˚C also showed slightly lower \nthan IEC 60296 standard wh ile the rest of dielectric \nstrength for the mineral oil and the oil mixtures were \nhigher compared to the standard. Meanwhile, Liao et al. \n[41] and Rajab et al. [42] foun d that the dielectric strength \nof mineral oil at 40°C was approximately 10.4kV/mm and \n4.4kV/mm, respectively which was lower than all the \nmixtures and the standard. However, Yusnida et al. [43] \nreported that mineral oil posse sses high dielectric strength \nwhich was approximately 32kV/mm at 40°C. Gockenbach \nand Borsi [44] found that the dielectric strength of mineral \noil at 60°C and 90°C was approximately 29.2kV/mm, \nwhich was lower than all the mixtures except for 50% \nRBDSO content at 60°C. Thus, these results indicated that \nthe RBDPO/RBDSO mixture can be considered to be used \nas insulating liquid in transformer. \nFig. 12 shows the dielectric strength of RBDPO/RBDSO \nmixture dependence on temper ature. As comparison, the \ndielectric strength of mineral oil dependence on temperature \nobtained from Suwarno et al. [13] was also included. The \ndielectric strength of RBDPO /RBDSO mixture increased \nwith the increase of temper ature. Similar to the RBDPO/ \nRBDSO oil mixture, the dielectric strength of mineral oil \nalso increased with the increment of temperature. The \nincrement of the dielectric stre ngth might occur due to the \npresence of dissolved wa ter in the RBDPO/RBDSO \nmixture and mineral oil.  \nThere are three types of water in oil which are known as \ndissolved water, emulsified water and free water. The \ndissolved water is hydrogen bonded to the hydrocarbon \nmolecules of which oil is composed, emulsified water is \nsupersaturated in solution but has not totally separated \nfrom the oil and free water is also supersaturated in \nsolution and exists in the form of water droplets when the \nmoisture in oil has exceeded the saturation value. Free \nFig. 10. Dielectric strength of RBDPO/RBDSO mixture\ndependence on RBDSO content compared with\nmineral oil [9] and IEC 60296 standard \n \n \nFig. 11. Breakdown mechanism in liquid dielectric \nStudy of Dielectric Properties of a Potential RBD Palm Oil and RBD Soybean Oil Mixture as Insulating Liquid in Transformer \n 2112 │ J Electr Eng Technol.2015; 10(5): 2105-2119 \nwater is measured in parts per million (ppm) [45, 46]. The \ndissolved water increased in tandem with the increment of \ntemperature which also depends on the solubility of the oil. \nAs the water dissolved effectively with the increase in \ntemperature, the water molecule also dispersed actively \nwith the molecule of oil mixture, known as intermolecular \nwater bridge [47]. This water bridge can restrain the kinetic \nmobility of electron to participate in the conduction \nprocess which resulted in the increment of breakdown \nstrength of the oil mixture and mineral oil. \nComparison between the mineral oil and the RBDPO/ \nRBDSO mixture for all ratios indicated that mineral oil has \nconsiderable lower dielectric strength with the increment \nof temperature. This difference was due to the chemical \nstructural difference between these two distinct oils. The \ndifference of chemical structure caused the vegetable oil \npossess higher solubility compared to the mineral oil at \nthe same temperature. Mineral oil consists of hydrocarbon \nwhich is divided into alkanes, naphthenes and aromatics \n[48] as shown in Fig. 13(a). On the other hand, vegetable \noil consists of hydrocarbon attached to carboxyl group \n(-COOH) to produce ester group (-COOR) [49] as shown \nin Fig. 13(b). The presence of carbonyl group (C=O) \ncauses the vegetable oil to become more polar compared to \nmineral oil. The two lone pair electrons owned by oxygen \nin the vegetable oil can participate in hydrogen bonded as \nhydrogen acceptor which conf ers additional solubility to \nthe vegetable oil [50]. Due to the absence of carboxyl \ngroup in the mineral oil, the formation of hydrogen bonded \nwith water molecules diminish. Therefore, the solubility \nof mineral oil increased less with the temperature which \nwas the cause to the slower dispersion of water molecules \nwithin molecules of the mineral oil. This caused less \nrestriction to the electron movement in the conduction \nprocess which yields to low breakdown voltage. Similar \nresults of breakdown strength increment with the increase \nof temperature were reported in numerous papers where \nvegetable oil and mineral oil were utilized as the samples \nin the experiments [23, 41, 42, 51, 52]. \n \n3.2 Dissipation factor (tan δ) characteristics \n \nThe dissipation factor is the measurement of energy loss \nwithin the dielectric liquids subjected to AC voltage. This \nenergy loss is the heat energy which dissipated in the liquid \ndue to the presence and movement of charge carriers under \nthe influence of alternating electric field. The insulating \nliquid is characterized by the low value of the dissipation \nfactor [54]. Fig. 14 depicts the dissipation factor of 10%, \n30% and 50% RBDSO ratio mixture in the RBDPO at \n40˚C, 70 ˚C, and 90 ˚C. In comparison, the results of \ndissipation factor of mineral oil reported by Suwarno et al. \n[19] at 40 ˚C, 70 ˚C, and 90 ˚C were also included. The \nA l k a n e               N a p h t e n e               A r o m a t i c  \n(a) Chemical structure of hydrocarbon in mineral oil. \n \n(b) Chemical structure of vegetable oil [33]. \nFig. 13. Chemical structure of mineral oil and vegetable oil\nFig. 12. Dielectric strength of RBDPO/RBDSO mixture\ndependence on temperature compared with mineral\noil [9] and IEC 60296 standard \nRBDPO(%) \nFig. 14. Dissipation factor of 10%, 30% and 50% o f \nRBDPO content at 40°C, 70°C and 90°C compared\nwith mineral oil [9] and IEC 60296 standard \nKiasatina Azmi, Azmier Ahmad and Mohamad Kamarol \n http://www.jeet.or.kr │2113\ndissipation factor of the RBDPO/RBDSO mixture has \nshown descending trend from 10% to 50% RBDSO ratio. \nThis result shows that the addition of 0% to 50% RBDSO \ninto RBDPO gives a positive effect on the dissipation \nfactor. On the other hand, the dissipation factor for the oil \nmixture and mineral oil increased with the increase of \ntemperature. The temperature rise caused the reduction of \noil viscosity, which caused less friction or resistance to the \nmovement of mobile ions. As a consequence, the mobility \nof ions increased with the reduction of viscosity [54]. Thus, \nthe increment of ion mobility will result in more energy \ndissipating in the liquid. Jian Li et al. [55], Caixin et al. \n[56] and Suwarno et al. [52] also discovered the same \nascending trend of dissipation f actor with the increment of \ntemperature when using vegetable oil and mineral oil as \ntheir specimen. Comparison between the oil mixture and \nmineral oil indicated that the dissipation factor of the oil \nmixture from 0% to 50% was lower compared to mineral \noil of all ranges of temperatures. This result shows a positive \nresult in using the palm oil and soybean oil mixture as \ntransformer oil. \n \n3.3 Relative permittivity (dielectric constant) charac-\nteristics \n \nThe relative permittivity is a measure to describe the \npolarization in dielectric liquid under applied electric field. \nHigh value of relative permittivity means more charges \nare stored in the dielectric liquid which could reduce the \nmismatch between the liquid and solid insulation for \nattaining higher withstand field strength [57]. Fig. 15 \nshows relative permittivity of 10%, 30% and 50% of \nRBDSO ratio in RBDPO/RBDSO mixture compared to the \nmineral oil [56] at 40 ˚C, 70 ˚C, and 90 ˚C. The results of \nrelative permittivity of RBDPO/RBDSO mixture were \nhigher compared to conventional mineral oil which was \nonly 2.0 at 90˚C. The relative permittivity of mineral oil at \n90˚C reported by Suwarno et al. [19] and Hemmer et al. \n[58] also showed a close valu e with Caixin et al. [56] \nwhich indicated that the relative permittivity of RBDPO/ \nRBDSO mixture of 0% to 50% were better compared to \nmineral oil. \nFrom the plotted graph, the relative permittivity also was \nnearly constant with the addition of the RBDSO ratio of \n10% to 50%. Meanwhile, the relative permittivity shows a \ndescending trend with the in creased of temperature from \n40˚C to 90˚C for RBDPO/RBDSO mixture and mineral oil. \n \n3.4 Kinematic viscosity characteristics \n \nFig. 16 shows the plotted graph of kinematic viscosity of \nRBDPO/RBDSO mixture dependence on RBDSO ratio at \n40˚C. In comparison, the kinematic viscosity of mineral \noil [59] was also included. It is shown that the kinematic \nviscosity of mineral oil was under the limit of IEC 60296 \nstandard. Rozga et al. [60] reported that the kinematic \nviscosity of mineral oil at 40°C also showed lower than \nthe standard which is 9mm\n2/s. Other than that, Sun-Ho and \nChang-Su [14] also reported low kinematic viscosity of \nmineral oil at 40°C which was 7.8mm2/s. Meanwhile, the \nkinematic viscosity of various ratios of the RBDPO/ \nRBDSO mixture exceeded the standard limit. However, it \nalso showed that the kinematic viscosity of RBDPO/ \nRBDSO mixture decreased with  the increment of RBDSO \nratio into RBDPO. This result showed a significant positive \nresult of reducing the kinematic viscosity of the palm oil \nwhich might improve its heat transfer characteristic. \n \n3.5 Water content characteristics \n \nFig. 17 shows the plotted graph of water content in the \nRBDPO/RBDSO mixture at room temperature. In \ncomparison, the water content of mineral oil at room \ntemperature reported by Krins et al. [61] was also included \nRBDPO(%) \nFig. 15. Relative permittivity of 10%, 30% and 50% o f\nRBDPO content at 40°C, 70°C and 90°C compared\nwith mineral oil [36] \n \nRBDPO(%) \nFig. 16. Kinematic viscosity of RBDPO/RBDSO mixture \ndependence on RBDSO cont ent at 40°C compared \nwith mineral oil [39] and IEC 60296 standard \nStudy of Dielectric Properties of a Potential RBD Palm Oil and RBD Soybean Oil Mixture as Insulating Liquid in Transformer \n 2114 │ J Electr Eng Technol.2015; 10(5): 2105-2119 \nin Fig. 17. Fig. 17 shows an ascending trend of water \ncontent from 0% to 50% of the RBDSO content in RBDPO \nwhile mineral oil shows slightly close result to the \nmaximum limit of IEC 60296 standard which is 40 parts \nper million (ppm). Meanwhile, Gockenbach and Borsi [44], \nLewand [45] and Miyagi and Wakimoto [62] found that the \nwater content in mineral oil is approximately 70-80 ppm \nwhich is slightly higher than the standard. This suggested \nstandard limit represents a maximum limit of relative \nsaturation of 50% in the mineral oil at room temperature. \nRelative saturation is the concentration of water which the \noil can hold at the measurement temperature. It is governed \nby the equation below: \n \n \n()  100%WcRS So=  (5) \n \nwhere RS is relative saturation (in percent), Wc is absolute \nwater content in the oil at the measurement temperature \n(in ppm) and So is solubility of the oil at the measurement \nof temperature (in ppm). Solubility of the oil is highly \ndependent on the temperature where it increased with the \nincrement of temperature. Fig. 17 shows absolute water \ncontent of the RBDPO/RBDSO mixture is greater compared \nto the mineral oil. Vegetable oil and mineral oil possess \nhuge difference of solubility at the same temperature due \nto its difference in chemical composition. As proof, an \nexperiment conducted by Caixin et al. [56] has shown \nthat the solubility of vegetable oil is 10 times greater than \nthe solubility of mineral oil at room temperature. High \nsolubility of vegetable oil gives advantageous to the solid \ninsulator (paper and pressboard) of the transformer. Due \nto high solubility owned by vegetable oil, the water that \nresides in the paper will be forced into the oil efficiently \nwhich could retain the dryness of the paper. This gives way \nto prolong the aging rate of the insulating paper in the \ntransformer. The relative saturation plays an important \nrole to diagnose the condition of the transformer systems. \nTo maintain the reasonable breakdown strength of the \ntransformer oil, the relative saturation should remain below \n50% of the water saturation in the oil [45]. Therefore, it is \nbelieved that the increment of RBDSO content from 0% \nto 50% had caused a gradually increase of relative water \ncontent which might resulted in gradual reduction of \ndielectric breakdown voltage of the oil mixture. \n \n3.6 Chemical composition analysis \n \nThe chemical composition of RBDPO/RBDSO mixture \nin various ratios have been analyzed. In addition, the \nchemical composition of 100% RBDPO and 100% RBDSO \nwere also analyzed. The purpose of analyzing the chemical \ncomposition of the oil mixtures was to prove that the \nratios between RBDPO and RBDSO are aligned with the \ngeneral standard of chemical composition of palm oil and \nsoybean oil. Figs. 18(a) and 18(b) show the GC-MS result \nof fatty acid composition of 100% RBDPO and RBDSO, \nrespectively. Table 6 depicts the results of fatty acid \ncomposition in percentage of weight of 100% RBDPO and  \n \nRBDPO(%) \nFig. 17. Water content of RBDPO/RBDSO mixture depen-\ndence on RBDSO content at room temperature\ncompared with mineral oil [61] and IEC 60296\nstandard \n \n(a) GC-MS result of fatty acid composition of 100% RBDPO\n \n(b) GC-MS result of fatty acid composition of 100% RBDSO\nFig. 18. GC-MS result of fatty acid composition of 100% \nRBDPO and 100%RBDSO \n \nTable 6. Fatty acid composition of 100% RBDPO and \n100%RBDSO \nWeight (%) Fatty acid composition RBDPO RBDSO \nPalmitic acid (C16:0) 45.5 11.6 \nOleic acid (C18:1) 40.6 23.4 \nLinoleic acid (C18:2) 9.4 55.6 \nOthers 4.5 9.4 \nKiasatina Azmi, Azmier Ahmad and Mohamad Kamarol \n http://www.jeet.or.kr │2115\n \nRBDSO analysis. 100% RBDPO showed a balance ratio \nof saturated fatty acid to unsaturated fatty acid which was \nalmost 50:50 where the highest percentage of saturated \nfatty acid was Palmitic acid which contributed around \n45.5%. On the other hand, Oleic acid was the highest \npercentage of unsaturated fatty acid which contributed \naround 40.6%. Meanwhile, 100% RBDSO showed higher \ntotal number of unsaturated fatty acid where the total ratio \nof unsaturated fatty acid to the saturated fatty acid in \n100% RBDSO was almost 80:20. The highest percentage \nof unsaturated fatty acid and saturated fatty acid in RBDSO \nwas held by Linoleic acid and Palmitic acid which \ncontributed around 55.6% and 11.6%, respectively. \nFigs. 19 (a), (b), (c), (d) and (e) show the GC-MS results \nof fatty acid composition from 10% to 50 % of RBDSO in \nRBDPO mixture. The result revealed the presence of \nPalmitic acid (C16:0), Oleic acid (C18:1) and Linoleic acid \n(C18:2) in all ratios of RBDSO in RBDPO/RBDSO \nmixture, which was the major fatty acid components in the \noil mixture. Fig. 20 and Table 7 depicted the trend of fatty \nacid composition and listed the result obtained, respectively. \nThe result in Fig. 20 shows the increasing of RBDSO ratio \nfrom 0% to 50% causes a gradually decreased in Palmitic \nand Oleic acid, while signifi cantly increased the Linoleic \nacid. McShane [6] mentioned in his paper that a high \npercentage of unsaturated fatty acid in oils will result in \nlower kinematic viscosity and better low temperature \nproperties. Thus, due to th e gradually increase of the \nunsaturated fatty acid with RBDSO content, the kinematic \n(a) GC-MS result of fatty acid composition of 10% RBDPO\n \n(b) GC-MS result of fatty acid composition of 20% RBDPO\n \n \n(c) GC-MS result of fatty acid composition of 30% RBDPO\ncontent \n \n(d) GC-MS result of fatty acid composition of 40% RBDPO\ncontent \n \n(e) GC-MS result of fatty acid composition of 50% RBDPO\ncontent \nFig. 19. GC-MS result of fatty acid composition of 10% to\n50%RBDSO content \n \nRBDPO(%) \nFig. 20. Major fatty acid components from 0% until 50% \nRBDSO content \n \nTable 7. Fatty acid composition of RBDPO/RBDSO mixture\nWeight (%) \nRBDSO (%) Fatty acid \ncomposition 0 10 20 30 40 50 \nPalmitic Acid (C16:0) 45.5 42.9 39.6 35.7 31.2 26.6\nOleic Acid (C18:1) 40.6 38.7 36.9 35.4 33.1 29.8\nLinoleic Acid (C18:2) 9.4 13.3 17.1 21.6 27.6 34.2\nOthers 4.5 5.1 6.4 7.3 8.1 9.1\nStudy of Dielectric Properties of a Potential RBD Palm Oil and RBD Soybean Oil Mixture as Insulating Liquid in Transformer \n 2116 │ J Electr Eng Technol.2015; 10(5): 2105-2119 \nviscosity of the oil mixtures also tended to reduce. This \nexplains the descending trend of kinematic viscosity with \nincrement ratio of RBDSO. \nMeanwhile, in terms of electri cal strength, Forster [63] \nhas suggested that the presence of unsaturated hydrocarbon \nwill create the electron jumping process which is unavailable \nin saturated substances. Unsaturated hydrocarbon contained \na double bond which has pi electrons inside. This pi \nelectron could partake in the conduction process when \nelectric field is applied. Thus , the increment of unsaturated \nhydrocarbon with the increment of RBDSO content might \nincrease the pi electron which resulted in the increment of \nconductivity. This situation might reduce the breakdown \nstrength of RBDPO/RBDSO mixture with the increment of \nRBDSO content. \n \n3.7 Summary \n \nFrom the result and discussion above, comparison \nbetween RBDPO/RBDSO mixtures with mineral oil reported \nby past researchers have shown that oil mixture can be \nconsidered as an insulating liquid in power transformer. \nThe dielectric strength for all ratios of RBDPO/RBDSO \nmixture has proven far superior to mineral oil where all the \nbreakdown voltage of oil mixture has exceeded the \nbreakdown voltage of mineral oil from 40 ˚C to 100˚C. The \ndissipation factor of RBDPO/RBDSO mixture from 0% to \n50% is also considerably lower compared to mineral oil at \n40˚C, 70˚C and 90˚C. The relative permittivity for all ratios \nof the oil mixture was also higher compared to mineral oil \nat 40˚C, 70˚C and 90 ˚C. Although the kinematic viscosity \nof all ratios of RBDPO/RBDSO mixture was higher than \nthe mineral oil, it indicates an improvement with the gradual \nincrease of RBDSO. Despite th is, there is increment of \nrelative water content from 0% to 50% of RBDSO ratio \nwhich caused the gradual reduction of breakdown voltages. \nNevertheless, the breakdown voltages of the oil mixture are \nstill higher than mineral oil at the same temperature. From \nthe above results, it can also be concluded that between the \nranges of 0% to 50% ratio of RBDSO into RBDPO, 30% \nRBDSO content has shown to be the most suitable mixture \nof RBDPO/RBDSO to be used as an insulating liquid. \n30% RBDSO content is the intermediate content which \naccumulates better dielectric properties. This is due to its \nhigh and reasonable dielectric strength for all ranges of \ntemperatures, sufficiently low dissipation factor for \nvarious temperatures, high relative permittivity for various \ntemperatures and improved kinematic viscosity. Table 8 \nsummarizes and compares the result of 30% RBDSO \ncontent with mineral oil. The breakdown voltage and the \nrelative permittivity of 30% of RBDSO content are higher \ncompared to the mineral oil. Although the dissipation \nfactor and the kinematic viscosity of 30% ratio of RBDSO \ndo not agree with IEC 60296 standard as well as higher \ncompared to the mineral oil, yet it has higher breakdown \nvoltage and relative permittivity. Thus, it has shown better \npotential mixture of palm and soybean-based transformer \noil. Therefore, it can be summarized that 70%RBDPO/ \n30%RBDSO is considered as a better mixture as dielectric \ninsulating fluid in transformer. \n \n \n4. Conclusion \n \nThe experiment of dielect ric properties of RBDPO/ \nRBDSO mixture was performed. It is reveals that the \nbreakdown voltage decreases w ith the increase of RBDSO \nratio from 0% to 50%. All the breakdown voltage of the oil \nmixture were above 30kV which fulfilled the IEC standard. \nThe breakdown voltage of the oil mixture shows slight \nincreases with the increment of temperatures. The dielectric \nstrength obtained from the calculation and simulation of \nmean value breakdown voltage shows slightly close to the \nestimated lowest dielectric strength obtained from Weibull \ndistribution at 40 ˚C, 50 ˚C and 60 ˚C with approximate \ndifference from 0% to 11%. Comparisons between RBDPO/ \nRBDSO mixture with mineral oil reported by past \nresearchers have shown that the dielectric strength for all \nratios of RBDPO/RBDSO mixture are far superior than \nmineral oil where all the breakdown voltage of oil mixture \nhas exceeded the breakdown voltage of mineral oil from \n40˚C to 100 ˚C. The dissipation factor of RBDPO/RBDSO \nmixture has shown to decrease from 10% to 50% of \nRBDSO content. In comparison between the oil mixture \nand mineral oil, the dissipation factor of the oil mixture \nwas lower compared to mineral oil for all ranges of \ntemperatures. Meanwhile for relative permittivity, no \nsignificant changes has been observed when the ratio of \nRBDSO was increased from 10% to 50%. The relative \npermittivity of the RBDPO/RBDSO mixture is also shown \nto be higher than mineral oil. Although the kinematic \nviscosity exceeded the IEC 60296 standard and mineral oil \nresult, the value of kinematic viscosity decrease with the \nincrement of RBDSO into RBDPO which shows a positive \nresult. In this paper, 70%RBDPO/30%RBDSO has been \nselected as the optimum mixing ratio as the potential \ninsulating liquid in transformer. \nTable 8. Comparison between 70%RBDPO/30%RBDSO \ncontent and Mineral Oil \nDielectric Properties 70%RBDPO/ \n30%RBDSO \nMineral \noil \nIEC 60296 \nstandard \nBreakdown  \nvoltage (kV/mm) at 40˚C 61.40 21 a ≥ 30d \nDissipation factor (tan δ) \nat 90˚C 0.0414 0.005 a ≤ 0.005 \nRelative permittivity at 90˚C 2.854 2.0 b - \nKinematic Viscosity (mm2/s) \nat 40˚C 37.9 9 c ≤ 12 \na Reference from Suwarno et al., 2003  \nb Reference from Caixin et al., 2006  \nc Reference from Perrier et al., 2006  \nd Reference from Krins et al., 2002  \nd 30kV at ambient temperature of 20˚C±5˚C \nKiasatina Azmi, Azmier Ahmad and Mohamad Kamarol \n http://www.jeet.or.kr │2117\nAcknowledgements \n \nThe author is deeply indebted to Malaysia Ministry of \nHigher Education and Universiti Sains Malaysia for \nfinancially support this work under MyPhD scholarship \nand Research University Grant (1001/PELECT/814232). \n \n \nReferences \n \n[1] Oommen T. V ., “Vegetable Oils for Liquid-Filled \nTransformers”, IEEE Electrical Insulation Magazine, \nV ol. 18, No. 1, pp. 6-11, 2002.  \n[2] Oommen, T. V ., Claiborne, C. C. & Mullen, J. T., \n“Biodegradable electrical  insulation fluids”, IEEE \nConference on Electrical Insulation, Electrical \nManufacturing & Coil Winding Conference ”, 465-\n468, 22-25 Sep. 1997.  \n[3] Oommen, T. V ., Claiborne, C. C. & Walsh, E. J., \n“Introduction of a new fully biodegradable dielectric \nfluid”, IEEE Conference on Textile, Fiber and Film \nIndustry Technical, 1998.  \n[4] Mcshane, C. P ., “Natural and synthetic ester dielec-\ntric fluids: their relative environmental, fire safety, and \nelectrical performance”, IEEE Technical Conference \non Industrial &amp; Commercial Power Systems , \n1999.  \n[5] Boss, P. & Oommen, T. V ., “New insulating fluids for \ntransformers based on biodegradable high oleic \nvegetable oil and ester fluid”, IEE Colloquium on \nInsulating Liquids, 7/1-710, 1999.  \n[6] Mcshane, C. P., “Relativ e properties of the new \ncombustion resistant vegetable oil based dielectric \ncoolants”, Petroleum and Chemical Industry Con-\nference, 265-272, 2000.  \n[7] Mcshane, C. P., “Vegetable-oil-based dielectric \ncoolants”, Industry Applications Magazine, IEEE . 8 \n(3), 34-41, 2002.  \n[8] Eberhardt, R., Muhr, H. M., Lick, W., Wieser, B., \nSchwarz, R. & Pukel, G . “Partial discharge behaviour \nof an alternative insulating liquid compared to mineral \noil”, IEEE Internationa Conference on Power Mod-\nulator and High Voltage Conference (IPMHVC), \n426-429, 23-27 May 2010. \n[9] Ngoc, M. N., Lesaint, O., Bonifaci, N., Denat, A. & \nHassanzadeh, M. “A comparison of breakdown pro-\nperties of natural and synthetic esters at high voltage”, \n2010 Annual Report Conference on Electrical \nInsulation and Dielectric Phenomena (CEIDP), 1-4, \n17-20 Oct. 2010.  \n[10] Dang, V ., Beroual, A. & Perrier, C. “Comparative \nstudy of statistical breakdown in mineral, synthetic \nand natural ester oils under AC voltage”, IEEE Inter-\nnational Conference on Dielectric Liquids (ICDL), 1-\n4, 26-30 June 2011. \n[11] Trnka, P., Mentlik, V . & Cerny, J. “Electroinsulating \nfluids - New insulating mixtures”, Annual Report \nConference on Electrical Insulation and Dielectric \nPhenomena (CEIDP), 575-578, 16-19 Oct. 2011. \n[12] Jovalekic, M., Vukovic, D. &Tenbohlen, S. “Gassing \nbehavior of various alternative insulating liquids under \nthermal and electrical stress”, IEEE International \nSymposium on Electrical Insulation (ISEI), 490-493, \n10-13 June 2012. \n[13] Dongjin, K. & Kyosun, K., “Winding Temperature \nMeasurement in a 154 kV Transformer Filled with \nNatural Ester Fluid”, JEET, V ol. 8 (1), 156-162, 2013. \n[14] Sun-Ho, C. & Chang-Su, H., “The Lightning Impulse \nProperties and Breakdown V oltageof Natural Ester \nFluids Near the Pour Point”, JEET, V ol. 8 (3), 524-\n529, 2013. \n[15] Vasovic, V ., Lukic, J., Perrier, C. & Coulibaly, M. L., \n“Equilibrium charts for moisture in paper and press-\nboard insulations in mineral and natural ester trans-\nformer oils”, IEEE Electrical Insulation Magazine , \nV ol.30 (2), 10-16, 2014. \n[16] Toudja, T., Chetibi, F., Beldjilali, A., Moulai, H. & \nBeroual, A. “Electrical and physicochemical pro-\nperties of mineral and vegetable oils mixtures”, IEEE \nInternational Conference on Dielectric Liquids \n(ICDL), 1-4, June 29 2014-July 3 2014. \n[17] Trnka, P., Mentlik, V . & Svoboda, M. “Ecologically \nacceptable insulating liquids for electrical appliances”, \nIEEE 18th International Conference on Dielectric \nLiquids (ICDL), 2014, 1-4, June 29 2014-July 3 2014. \n[18] Biermann, U. & Metzger, J. O., “Application of \nVegetable Oil-Based Fluids as Transformer Oil”, \nOleochemicals under Changing Global Conditiones , \n25-27 Feb. 2007.  \n[19] Suwarno, F. Sitinjak, Ichwan Suhariadi &Luthfi \nImsak, “Study on the characteristics of palm oil and \nit's derivatives as liquid insulating materials”, IEEE \nProperties and Applications of Dielectric Materials, \nProceedings of the 7th International Conference, V ol. \n2, 2003.  \n[20] Abdullah, U. U., Bashi, S. M., Yunus, R., Mohibullah, \nNurdin, A., “The potentials of palm oil as a dielectric \nfluid”, IEEE National Power & Energy Conference \n(PeCon), 2004.  \n[21] Aditama, S., “Dielectric properties of palm oils as \nliquid insulating materials: effects of fat content”, \nIEEE Electrical Insula ting Materials, 2005. (ISEIM \n2005). Proceedings of 2005 International Symposium, \n2005. \n[22] Takaaki Kanoh et al., “Analyses of Electro-Chemical \nCharacteristics of Palm Fatty Acid Esters as \nInsulating Oil”, IEEE Int. Conf on Dielectric Liquids, \n1-4, 2008.  \n[23] Suwarno & Darma, I. S., “Dielectric properties of \nmixtures between mineral oil and natural ester from \npalm oil”, WSEAS TRANSACTION on POWER \nSYSTEMS. 3 (2), 37-46, 2008.  \nStudy of Dielectric Properties of a Potential RBD Palm Oil and RBD Soybean Oil Mixture as Insulating Liquid in Transformer \n 2118 │ J Electr Eng Technol.2015; 10(5): 2105-2119 \n[24] Rejab A., Suwarno, Aminuddin S., “Properties of \nRBDP Oleum as a candidate of palm-based trans-\nformer insulating liquid”, IEEE Electrical Engineering \nand Informatics International Conference , pp. 548-\n552, 5-7 Aug. 2009.  \n[25] Azis, N., Jasni, J., Khadir, M. Z. A. A. & Mohtar, M. \nN., “Suitability of Palm Based Oil as Dielectric \nInsulating Fluidin Transformers,” JEET, V ol. 9 (2), \n662-669, 2014. \n[26] Al-Ammar, E. A. & Qureshi, M. I., “Probing the Use \nof Green Insulating Oils in transformers based on \ntheir statistical breakdown data”, International Con-\nference on Electric Power and Energy Conversion \nSystems (EPECS), 1-6, 10-12 Nov. 2009.  \n[27] Al-Ammar, E. A., “Evaluation of seed oils based on \nstatistical breakdown data for their application as \ninsulating fluids in distribution transformers”, Euro-\npean Journal of Scientific Research . 40 (1), 15-26, \n2010.  \n[28] Abdelmalik, A. A., Fothergill, J. C., Dodd, S. J., \nAbbott, A. P. & Harris, R. C., “Effect of side chains \non the dielectric properties of alkyl esters derived \nfrom palm kernel oil”, International Conference on \nDielectric Liquids (ICDL), 26-30 June 2011.  \n[29] IEC 60156:1995, Insulating Liquids – Determination \nof the Breakdown Voltage at Power Frequency – Test \nMethod, Second Edition, 1995.  \n[30] Ding, H. Z., Wang, Z. D. & Jarman, P., “On electric \nstresses at wedge-shaped oil gaps in power trans-\nformers with application to surface discharge and \nbreakdown”, IEEE International Conference on Die-\nlectric Liquids (ICDL), 1-4, 30 June-3 July 2008.  \n[31] IEC 60247:1978, Measurement of relative permit-\ntivity, dielectric dissipation factor and d.c. resistivity \nof insulating liquids, 1978.  \n[32] ISO 3104:1994, Petroleum products - Transparent \nand opaque liquids - Determination of kinematic \nviscosity and calculation of dynamic viscosity, 1994.  \n[33] IEC 60814: 1985, Determination of water in insula-\nting liquids by automatic coulometric Karl Fischer \ntitration, 1985.  \n[34] Morcos, M. M. & Cherukupalli, S. E., “Review of \nStatistical Testingof Solid Insulating Materials”, IEEE \nConf. 3rd Conduction and Breakdown in Solid \nDielectrics, Norway, 574-581, 1989. \n[35] Martin, D. & Wang, Z. D., “Statistical Analysis of the \nAC Breakdown V oltages of Ester Based Transformer \nOils”, IEEE. 15 (4), 1044-1050, 2008.  \n[36] Dang, V ., Beroual, A., & Perrier, C., “Comparative \nstudy of statistical breakdown in mineral, synthetic \nand natural ester oils under AC voltage”, IEEE Trans-\nactions on Dielectrics and Electrical Insulation , 19 \n(5), 1508-1513, 2012. \n[37] Horst, R., The Weibull Distribution A Handbook, \nCRC Press, Taylor & Francis Group\n, p. 34-44, 2009. \n[38] Hamzah, M. S., Jaafar, M., Mohd Jamil, M. K., \n“Electrical insulation char acteristics of alumina, \ntitania, and organoclay nanoparticles filled PP/EPDM \nnanocomposites”, Journal of Applied Polymer Science \n131 (23), 2014. \n[39] Naidu, M. S., Kamaraju, V ., High Voltage Engi-\nneering, McGraw-Hill, Third Edition, 2008.  \n[40] Kuffel, E., Zaengl, W. S. & Kuffel, J., High Voltage \nEngineering: Fundamentals , Newnes. P. 387-390, \n2000. \n[41] Ruijin, L., Jian, H., Chen, G ., Zhiqin, M., & Lijun, Y ., \n“A comparative study of physicochemical, dielectric \nand thermal properties of pressboard insulation \nimpregnated with natural ester and mineral oil”, \nIEEE Transaction on Diel ectrics and Electrical \nInsulation, 18 (5), 1626-1637, 2011. \n[42] Rajab, A., Aminuddin, S.., Sudaryatno, S. & Suwarno, \n“A Comparison of Dielectric Properties of Palm Oil \nwith Mineral and Synthetic Types Insulating Liquid \nunder Temperature Variation”, ITB Journal of Engi-\nneering and Technological Sciences, 43 (3), 191-208, \n2011. \n[43] Yusnida, M., Kiasatina, A., Mohd., A. A., Zulkifli, A., \nKamarol, M., “Breakdown Strength Characteristic \nof RBDPO and Mineral Oil Mixture asan Alternative \nInsulating Liquid for Transformer”, Jurnal Teknologi, \n64 (4), 69-72, 2013. \n[44] Gockenbach E. & Borsi H., “Performance and New \nApplication of Ester Liquids”, [Online], [Accessed \n14\nth January 2015]. Available from World Wide \nWeb:http://www.nttworldwide.com/docs/ester1.pdf. \n[45] Lewand, L., “Understanding Water in Transformer \nSystem - The Relationship Between Relative Satura-\ntion and Parts per Million (ppm)”, NETA WORLD, 1-\n4, 2002.  \n[46] Du, Y ., Mamishev, A. V ., Lesieutre, B. C., Zahn, M. \n& Kang, S. H., “Moisture solubility for differently \nconditioned transformer oils”, IEEE Transactions on \nDielectrics and Electrical Insulation , 8 (5), 805-811, \n2001. \n[47] Borsi, H., “Dielectric Behaviour of Silicone and ester \nFluids for Use in Distribution Transformer”, IEEE \nTransactions on Electrical Insulation , 26 (4), 755-\n762, 1991.  \n[48] Rouse, T. O., “Mineral insulating oil in transformers”, \nElectrical Insulation Magazine, IEEE . 14 (3), 6-16, \n1998.  \n[49] Martins, M. A. G., “Vegetable oils, an alternative to \nmineral oil for power transformers- experimental \nstudy of paper aging in vegetable oil versus mineral \noil”, Electrical Insulation Magazine, IEEE. 26 (6), 7-\n13, 2010. \n[50] Clark, J., “Introducing Esters” [Online], [A ccessed \n21th May 2013]. Available from World Wide Web: \nhttp://www.chemguide.co.uk/organicprops/est \ners/background.html, 2004.  \n[51] Badent, R., Hemmer, M., & Schwab, A. J., “Inhibited \nKiasatina Azmi, Azmier Ahmad and Mohamad Kamarol \n http://www.jeet.or.kr │2119\nrape-seed oil as substitute for mineral oils”,  IEEE \nConference on Electrical Insulation and Dielectric \nPhenomena, 268-271, 2002.  \n[52] Suwarno, Ilyas, M., & Rubadi, “Effects of tem-\nperature on dielectric proper ties of rhicinnus oils as \ninsulating liquid”, IEEE International Conference on \nCondition Monitoring and Diagnosis (CMD), 286-\n289, 21-24 April 2008. \n[53] Yuliastuti, E., Analysis of Dielectric Properties \nComparison between Mineral Oil and Synthetic Ester \nOil, MSc. Thesis, Department of Electrical Sustain-\nability Energy, Delft University of Technology, 2010. \n[54] Bartnikas, R., Permittivity and Loss of Insulating \nLiquids, Engineering Dielectric, Electrical Insulating \nLiquids, ASTM, p.3, 56, 1994.  \n[55] Jian, L., Grzybowski, S., Yanfei, S. & Xiaoling, C., \n(2007) Dielectric propertie s of rapeseed oil paper \ninsulation”, Conference on Electrical Insulation and \nDielectric Phenomena (CEIDP), 500-503, 14-17 Oct. \n2007.  \n[56] Caixin, S., Jian, L., Xiaohu, L. & Grzybowski, S., \n“Electric Properties of Vegetable Oil-Based Dielec-\ntric Liquid and Lifetime Es timation of the Oil-Paper \nInsulation”, IEEE Conference on Electrical Insulation \nand Dielectric Phenomena, 680-683, 15-18 Oct. 2006. \n[57] Ohki, Y ., “News from Japan”, IEEE Electrical In-\nsulation Magazine, 27(3), 55-57, 2011.  \n[58] Hemmer, M., Badent, R. & Leibfried, T., “Electrical \nproperties of vegetable oil-impregnated paper in-\nsulation”, Conference on Electrical Insulation and \nDielectric Phenomena, 60-63, 19-22 Oct. 2003.  \n[59] Perrier, C., Beroual, A., Besse, X & De, J. L. “Im-\nprovement of power transformers by using mixtures \nof mineral oil with synthetic esters”, IEEE Trans-\naction on Dielectrics an d Electrical Insulation , 13 \n(3), 556-564, 2006. \n[60] Rozga, P., Stanek, M. & Cieslinski, D., “Comparison \nof properties of electrical discharges developing in \nnatural and synthetic ester at inception voltage”, \nIEEE Conference on Electrical Insulation and Die-\nlectric Phenomena (CEIDP), 891-894, 20-23 Oct. \n2013. \n[61] Krins, M., Reuter, M., Borsi, H. & Gockenbach, E., \n“Breakdown and flashover phenomena related to the \npresence of high absolute water contents in clean and \ncarbonized transformer oil”, Conference on Elec-\ntrical Insulation and Dielectric Phenomena, 2002. \n[62] Miyagi, K., & Wakimoto, K., “Global trend on new \ninsulating liquids for electrical insulation properties”, \nProceedings of 2011 International Conference on \nElectrical Insulating Materials (ISEIM), 440-443, 6-\n10 Sept. 2011. \n[63] Forster, E. O., “Electric Conduction in Liquid Hydro-\ncarbons. III. Comparison of Saturated and Unsaturated \nHydrocarbons”, Journal of Chemical Physics , 40(1), \n91-95, 1964. \nKiasatina Azmi  She received her \nB.Eng (Hons) and MSc degree from \nUniversiti Sains Malaysia (USM) in \nElectrical Engineering in 2009 and \n2013, respectively. Currently she is in \nfirst year of PhD study at USM. Her \nresearch includes study on the dielec-\ntric properties of palm oil as liquid \ndielectric in electrical power transformer. Currently, her \nstudy has been focused on partial discharge in transformer’s \ninsulating liquid. She has published two conference papers \nin 2011 and one journal in 2012. \n \n \nMohd Azmier Ahmad He received the \nB.Eng (Hons) and Master degrees in \nthe field of chemical engineering from \nUSM in 2000 and 2003, respectively. \nHe got PhD in reaction engineering \nfrom Universiti Malaya, Malaysia in \n2007. Currently he is Associate Pro-\nfessor and Deputy Dean (Student Affairs \n& Networking) in School of chemical engineering at USM. \nHe is a member of ACS, IChemE, IEM and BEM and \nYoung Scientist Network of Academy Science Malaysia. \n \n \nMohamad Kamarol Mohd Jamil  He \nreceived his B.Eng (Hons) in Electrical \nEngineering from Universiti Technol-\nogy Mara, Malaysia, in 2000. He re-\nceived the M.Eng. and D.Eng. degrees \nfrom Kyushu Institute of Technology, \nJapan in March 2005 and 2008, re-\nspectively. Currently, he is Associate \nProfessor at USM. His research interest includes the \ninsulation properties in oil palm and solid dielectric material, \ninsulation properties of environmentally benign gas, PD \ndetection technique for insulation diagnosis of power \napparatus and electrical machine.  He is also involved in \ntemperature rise and short ci rcuit electromagnetic study of \nbusbar system. He is a C.Eng. and a member of IEEE, IET, \nBEM and IEM. \n",
  "topic": "Mineral oil",
  "concepts": [
    {
      "name": "Mineral oil",
      "score": 0.7752635478973389
    },
    {
      "name": "Transformer oil",
      "score": 0.6001258492469788
    },
    {
      "name": "Palm oil",
      "score": 0.5850337743759155
    },
    {
      "name": "Transformer",
      "score": 0.5368016362190247
    },
    {
      "name": "Soybean oil",
      "score": 0.5207610130310059
    },
    {
      "name": "Relative permittivity",
      "score": 0.5194758772850037
    },
    {
      "name": "Dielectric",
      "score": 0.5131867527961731
    },
    {
      "name": "Materials science",
      "score": 0.4847135543823242
    },
    {
      "name": "Pulp and paper industry",
      "score": 0.3763444125652313
    },
    {
      "name": "Composite material",
      "score": 0.3307257294654846
    },
    {
      "name": "Chemistry",
      "score": 0.3301244080066681
    },
    {
      "name": "Metallurgy",
      "score": 0.3069908916950226
    },
    {
      "name": "Permittivity",
      "score": 0.2746374011039734
    },
    {
      "name": "Food science",
      "score": 0.11261925101280212
    },
    {
      "name": "Optoelectronics",
      "score": 0.07731407880783081
    },
    {
      "name": "Electrical engineering",
      "score": 0.07088619470596313
    },
    {
      "name": "Voltage",
      "score": 0.0
    },
    {
      "name": "Engineering",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I139322472",
      "name": "Universiti Sains Malaysia",
      "country": "MY"
    }
  ],
  "cited_by": 30
}