{
  "title": "Transformering av kunnskap mellom campus og skole i lærerutdanningen",
  "url": "https://openalex.org/W2402609428",
  "year": 2016,
  "authors": [
    {
      "id": "https://openalex.org/A5009184685",
      "name": "Britt Oda Fosse",
      "affiliations": [
        "University of Oslo"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2077985586",
    "https://openalex.org/W2098103640",
    "https://openalex.org/W1825900564",
    "https://openalex.org/W2600091179",
    "https://openalex.org/W624518319",
    "https://openalex.org/W1705714200",
    "https://openalex.org/W2135943618",
    "https://openalex.org/W2127013545",
    "https://openalex.org/W2082864650",
    "https://openalex.org/W4246837278",
    "https://openalex.org/W579559746",
    "https://openalex.org/W4252947492",
    "https://openalex.org/W2414151564",
    "https://openalex.org/W2900001004",
    "https://openalex.org/W2086245846",
    "https://openalex.org/W2078791875",
    "https://openalex.org/W2116199508",
    "https://openalex.org/W1958906380",
    "https://openalex.org/W1982820121",
    "https://openalex.org/W2084658243",
    "https://openalex.org/W138851544"
  ],
  "abstract": "Til tross for lærerutdanningers mangeårige arbeid med å finne innovative løsninger som skaper gode sammenhenger mellom campuskonteksten og skolekonteksten, etterlyser lærerstudentene fortsatt en bedre sammenheng i studiet. Det som kjennetegner metodene i mange lærerutdanninger er at de bygger på ideen om læring for praksis. Dette innebærer i stor grad forventninger om at studentene transformerer kunnskap fra campus til undervisning og refleksjon i skolen. Mye tyder på at lærerstudentene får lite hjelp i denne prosessen. Studier om koherens – eller sammenheng – i lærerutdanningen knyttes sjelden til at lærerutdanning kan innebære et læringsproblem. Hensikten med denne artikkelen er å undersøke de læringsutfordringer studenter har når kunnskap skal transformeres mellom de to kontekstene. Tanken er at en forståelse for lærerstudenters læring på denne måten kan bidra inn i arbeidet med å videreutvikle metoder i lærerutdanningen som kan lette transformeringsprosessene. Artikkelen er tematisk og drøftes i lys av sosiokulturelle perspektiver på læring og utvikling med vekt på begrepene “overføring” og “transformering”. Videre drøftes problemstillingen i lys av studier av lærerstudenters interaktive læringsprosesser. Nøkkelord: lærerutdanning, lærerstudenters læringsprosesser, transformering av læring.AbstractDespite innovative work on bridging the gap between campus activities and classroom activities, student teachers ask for more coherence in their education. What characterizes the different teacher education innovations is that they are mainly based on the idea that students construct knowledge for practice. In these scenarios, teacher education programmes rely on the students’ ability to transform knowledge from activities at campus into teaching and reflection in their practice schools. The student teachers seem to get little or no help in these transformational processes. When studying coherence in teacher education, researchers rarely draw the attention to teacher education as a learning problem. This article discusses the problems inherent in transforming knowledge between contexts in teacher education, by focusing on the concepts of “transfer” and “transformation” and on studies of student teachers’ interactive learning processes. The idea is that knowledge about how student teachers learn in different contexts and how the knowledge is transformed between contexts is necessary to develop a coherent teacher education. The paper is thematic and the research question will be discussed in light of a socio-cultural perspective on learning and development, relevant literature, and studies regarding theories of learning and transformation. The research question will be further discussed in light of qualitative studies on teacher students’ interactive learning processes.Keywords: teacher education, learning, student teachers learning processes, learning as transformation",
  "full_text": "Britt Oda Fosse \nInstitutt for lærerutdanning og skoleforskning \nUniversitetet i Oslo \nE-post: b.o.fosse@ils.uio.no \n \n \nTransformering av kunnskap mellom campus og skole i \nlærerutdanningen \n \n \nSammendrag \nTil tross for l ærerutdanningers mangeårige arbeid med å finne innovative løsninger som skaper gode \nsammenhenger mellom campuskonteksten og skolekonteksten, etterlyser lærerstudentene fortsatt en \nbedre sammenheng i studiet. Det som kjennetegner metodene i mange lærerutdanninger er at de \nbygger på ideen om læring for praksis. Dette innebærer i stor grad forventninger om at studentene \ntransformerer kunnskap fra campus til undervisning og refleksjon i skolen. Mye tyder på at \nlærerstudentene får lite hjelp i denne prosessen. S tudier om koherens – eller sammenheng – i \nlærerutdanningen knyttes sjelden til at lærerutdanning kan innebære et læringsproblem. Hensikten \nmed denne artikkelen er å undersøke de læringsutfordringer studenter har når kunnskap skal \ntransformeres mellom de to  kontekstene. Tanken er at en forståelse for lærerstudenters læring på \ndenne måten kan bidra inn i arbeidet med å videreutvikle metoder i lærerutdanningen som kan lette \ntransformeringsprosessene. Artikkelen er tematisk og drøftes i lys av sosiokulturelle perspektiver på \nlæring og utvikling med vekt på begrepene “ overføring” og “transformering” . Videre drøftes \nproblemstillingen i lys av studier av lærerstudenters interaktive læringsprosesser. \n \nNøkkelord: lærerutdanning, lærerstudenters læringsprosesser, transformering av læring. \n \nAbstract \nDespite innovative work on bridging the gap between campus activities and classroom activities, \nstudent teachers ask for more coherence in their education. What characterizes the different teacher \neducation innovations is that they are mainly based on the idea that students construct knowledge for \npractice. In these scenarios, teacher education programmes rely on the students’ ability to transform \nknowledge from activities at campus into teaching and reflection in their practice schools. The student \nteachers seem to get little or no help in these transformational processes. When studying coherence in \nteacher education, researchers rarely draw the attention to teacher education as a learning problem . \nThis article discusses the problems inherent in transforming knowledge between contexts in teacher \neducation, by focusing on the concepts of “transfer” and “transformation” and on studies of student \nteachers’ interactive learning processes. The idea is that knowledge about how student teachers learn \nin different contexts and how the knowledge is transformed between contexts is necessary to develop a \ncoherent teacher education. The paper is thematic and the research question will be discussed in light \nof a socio-cultural perspective on learning and development, relevant literature, and studies regarding \ntheories of learning and transformation. The research question will be further discussed in light of \nqualitative studies on teacher students’ interactive learning processes.  \n \nKeywords: teacher education, learning, student teachers learning processes, learning as \ntransformation \n \n \nVol. 10, Nr. 2\nBritt Oda Fosse\n235\n2016©adno.no\nActa Didactica Norge\nInnledning \n \nMange lærerutdanninger i Norge har de siste 15 årene utviklet og gjennomført \nstrategier og metoder for å lette lærerstudenters transformering av kun nskap \nmellom campus og skolekonteksten, og mye tyder på at de grepene som er \ngjennomført har gjort det enklere for studentene å se sammenhengen mellom de \nto kontekstene (Klette & Hammerness, 2016; Lillejord & Børte, 2014; \nLudvigsen & Hoel, 2002; Rindal, Lu nd, & Jakhelln, 2015). En sentral løsning i \ndette arbeidet har vært å utvikle partnerskap mellom lærerutdanningene ved \nuniversiteter/høyskoler og praksisskolene (Darling-Hammond, 2008; Korthagen, \n2008; Lambert, 2003; Lillejord & Børte, 2014), og å utvikle nye metoder som \nkan lette transformeringsarbeidet for lærerstudentene. Eksempler på det siste er \nbruk av case -metodikk, arbeid med “core-set-of-practices”, grenseobjekter og \n“det tredje rom” (Edwards, 2010; Grossman, Hammerness, & McDonald, 2009; \nHauge, 2002; Klette & Hammerness, 2016; Lillejord & Børte, 2014; Rindal, \nLund, & Jakhelln, 2015).  \nDet som kjennetegner metodene er imidlertid at de i stor grad initieres og \nutvikles av lærerutdannere på campus og at det blir studentenes ansvar å \ntransformere og br uke kunnskapen i skolen. Det som ofte skjer, er at det blir \nlærerstudentenes ansvar å informere skolene om hva som gjelder som kunnskap \nved universitetet eller høyskolen. I denne prosessen transformerer ofte studenten \nsin individuelle kunnskap og forståelse (Afdal, 2014; Childs, Edwards, & \nMcNicholl, 2014) og tilpasser seg videre til skolens måte å forstå og snakke om \nundervisning på ( Edwards & Protheroe, 2003; Fosse, 2011; Ottesen, 2006; \nSundli, 2001). \nDet er mye som tyder på at studentene, til tross for innovativt arbeid i \nlærerutdanningen, fortsatt opplever at de går ut og inn av to forskjellige verdener \nog etterlyser større sammenheng i studiet \n(Lillejord & Børte, 2014; NOKUT, \n2006; 2013). I følge Lillejord og Børte (2014) er det behov for nytenkning når  \ndet gjelder partnerskapsmodeller, hvor blant annet studentenes læring blir satt i \nsentrum. \nDe studiene det refereres til ovenfor har i hovedsak satt søkelyset på \noverordnede strukturelle og organisatoriske endringer og reformer i \nlærerutdanningen og på læ rerstudenters rapporterte forståelse av egen læring i \nspenningsfeltet mellom teori og praksis. Det er få studier som ser på hvordan \nlærerstudenter konstruerer kunnskap og hva som skjer med denne kunnskapen i \ntransformeringsprosessen mellom campus og skole (Haug, 2010; Karlsen, \n2003).  \nHovedmålet med denne artikkelen er å bidra med forståelse for de \nlæringsutfordringer lærerstudenter har. Tanken er at innsikt i lærings og \ntransformeringsprosesser er grunnleggende når partnerskapsmodeller og \nmetoder som kan l ette disse prosessene\n i lærerutdanningen,  skal utvikles. \nArtikkelen er tematisk og tar utgangspunkt i sosiokulturelle teorier om læring og \nVol. 10, Nr. 2\nBritt Oda Fosse\n236\n2016©adno.no\nActa Didactica Norge\nutvikling. Den handler i hovedsak om pedagogikk i norsk offentlig \nlærerutdanning, og ser på kvalitative studier av lærerstudenters interaktive \nlæringsprosesser ved en praktisk -pedagogisk utdanning (PPU). Med dette som \nutgangspunkt drøftes følgende problemstilling: \nHvordan kan vi, med utgangspunkt i teorier og studier knyttet til læring, forstå \nlærerstudenters utfordringe r med å transformere kunnskap mellom campus og \nskole? \n \n \nGjennomgang av relevant litteratur og forskning \n \nSøkeprosessen \nTemaet for denne artikkelen har sitt utgangspunkt i arbeidet med en \ndoktoravhandling (Fosse, 2011). I lys av at denne artikkelen utforske r \nlærerstudenters læring og transformering av læring og videre støtter seg til et \nsosiokulturelt på læring er det søkt etter studier som sier noe om lærerstudenters \nsituerte læringsprosesser i lys av disse perspektivene. Det er søkt etter litteratur \nsom drøfter og forklarer ulike perspektiver på læring og transformering av \nlæring. Relevant litteratur og empiriske studier som kan belyse \nproblemstillingen er hentet fra flere kilder; i databaser (ERIC og Google Scolar), \ni håndbøker (Studying Teacher Education:  The Report of the AERA Panel on \nResearch and Teacher Education, 2005 og Handbook of Research on Teacher \nEducation: Eduring Questions in Changing Contexts, 2008), i pensumlister fra \ndoktorgradskurs ved Universitetet i Oslo om menneskers læring og utvikling og \ni relevante bøker og artikler presentert i lærerutdanningsmiljøer nasjonalt og \ninternasjonalt.  \nSøkeord som “kognitive*, kulturhistoriske* og sosiokulturelle* \nlæringsteorier”, “overføring*, transformering* av kunnskap ”, “overføring*, \ntransformering* av kunnskap mellom teori praksis i lærerutdanningen ”, «teori-\npraksis problematikken i lærerutdanningen”, og videre “ cognition”, “cognitive* \nsocio-cultural* culture-historical* learning-theories”, “transfer*, transportation*, \ntransformation* of learning/knowledge ”, “theory-practice dilemma* problems* \nteacher eduction*”  for å nevne de viktigste. Det er søkt både med norske og \nengelske ord og uttrykk. På norsk ble søkeordene utvidet med ord som \n“lærerstudenter* interaktive* læringsprosesser ”, “transformering* \ntransformasjon* overføring* læring* i lærerutdanningen”. Søket ga få resultater \nsom gikk spesifikt på lærerstudenters interaktive og situerte læringsprosesser. \nAv relevante søkeresultater falt valget på studier gjort ved Universitetet i Oslo, \nsom viser hvordan mening utvikles i aktiviteter i pedagogikkfaget på campus og \ni veiledningen i skolens praksis. Disse studiene støtter seg til interaksjons-\nanalytiske metoder. Søkeordene ble både brukt i søk på nettet og i bøkers \ninnholdsfortegnelse, referanselister og emneindeks. \nVol. 10, Nr. 2\nBritt Oda Fosse\n237\n2016©adno.no\nActa Didactica Norge\nArtikkelen hevder ikke å ha gjennomført en altomfattende og inngående \ngjennomgang av potensielt relevant litteratur, men mener at det som er valgt \nviser et representativt bilde av tilgjengelige kilder som belyser utfordringer med \nå transformere kunnskap mellom campus og skole. Artikkelen trekker på \nforskning med et spesifikt læringssyn og med spesifikt fokus. Dette begrenser \nselvsagt søket og valget av litteratur. De dypdykk som er valgt, av \nlærerstudenters læringsprosesser, er få og gjort ved egen institusjon. I følge \nBorko mfl. (2008) har imidlertid forskning i lys av sosiokulturelle teorier i sin \nkjerne søken etter lokal mening, og de lokale studiene er således ett av flere \nlokale bidrag som til sammen kan gi et kunnskapsgrunnlag det kan gene raliseres \nut fra. \n \nFremtredende perspektiver \nI søket med referanse til de overordnede perspektivene på læring og \ntransformering er det spesielt en diskusjon på slutten av 1980 -tallet og \nbegynnelsen 2000-tallet som trer fram som aktuell litteratur.  Flere f orskere (for \neksempel Anderson, Greeno, & Simon, 2000; Packer & Goicoechea, 2000; \nWertsch, 1998) drøftet det de mener er et unaturlig skille mellom individ og \nsamfunn innenfor sosial eller human forskning, og trekker frem de \nsosiokulturelle og kognitive pe rspektivene som eksempler på motsatser det bør \nbygges bro mellom.  \nSøkeprosessen brakte også fram diskurser om hvilken kunnskap og \nerfaringer som gjør lærerstudenter og lærere best egnet til å gi god undervisning, \nsamt hvor og hvordan denne kunnskapen best konstrueres (Cochran-Smith & \nLytle, 1999; Fenstermacher, 1994). For eksempel, hvem produserer kunnskap \nom undervisning, er det forskeren, læreren eller begge? Hvordan overføres eller \ntransformeres kunnskap, fra universitetet til skolen eller omvendt, elle r i \ngjensidighet?  \nFor å understreke artikkelens teoretiske perspektiv vises det her til Cochran-\nSmith og Lytles (1999) studier knyttet til læreres læring.  De skiller mellom tre \nideer om hvordan kunnskap om undervisning konstrueres: Kunnskap for praksis, \nkunnskap i praksis og kunnskap fra praksis. Kunnskap for praksis ser på \nnødvendigheten av at lærerstudenter utvikler en kunnskapsbasis som de først og \nfremst får fra forskning produsert ved universitetet. Undervisning innenfor dette \nperspektivet er forstått som en transformering av teoretisk kunnskap til praksis i \nklasserommet. Cochran-Smith og Lytle (1999) hevder at det å opprettholde \nkunnskap for praksis som overordnet, eller gi dette høyere status enn den \npraktiske kunnskapen, er med på å forsterke avsta nden mellom de to praksisene \nog mellom praktikere og forskere. Kunnskap i praksis har som utgangspunkt at \nundervisning i stor grad er en spontan og uforutsigbar aktivitet situert og \nkonstruert i møte med det som skjer i klasserommet. Innenfor dette perspek tivet \nligger den kunnskapen lærere og lærerstudenter trenger fra eksemplarisk \nundervisning gjort av erfarne lærere. Kunnskap oppnås gjennom erfaring, og \nVol. 10, Nr. 2\nBritt Oda Fosse\n238\n2016©adno.no\nActa Didactica Norge\ngjennom refleksjon over og undersøkelser av praksis. Innenfor den tredje ideen, \nom kunnskap fra praksis tenker man at lærere genererer lokal kunnskap, ved å \njobbe innenfor og samtidig forske på egen praksis. Denne ideen står i kontrast til \nideen om at det finnes to distinkte typer kunnskap om undervisning, altså \nteoretisk og praktisk kunnskap. De involverte lærer gjennom å delta i \nsystematisk og intensjonell forskning av alle sider ved undervisningen. Målet er \nå forstå, sette ord på og endre undervisningen, og samtidig problematisere egen \nkunnskap og praksis.  \nI Norge har lærerutdanningen tradisjonelt vært styrt av ideen om kunnskap \nfor praksis (Aasen, 2008; Smebye, 2010; Sundli, 2003). Denne tenkningen \npreger også litteraturen og forskningen det vises til i denne artikkelen. \nArtikkelen står dermed i fare å fremheve ideen om kunnskap for praksis som \nden vesentligste. Dette er ikke hensikten. En av hensiktene med artikkelen er å \nvise at arbeidet med å utvikle lærerutdanningen også innebærer å stille spørsmål \nved hvor og hvordan kunnskap om undervisning konstrueres.   \nI lys av et sosiokulturelt syn på læring utgjør teoretisk kunnskap, praktisk \nkunnskap og erfaringer en integrert del av lærerstudentenes representasjoner, i \nalle situasjoner (Vygotsky, 2001; Wertsch, 1998). Det innebærer at det er \nunaturlig å bruke begrepet “ teori og praksis” om det som skjer henhol dsvis på \nuniversitetet/høyskolen og i skolens praksisperiode. I stedet for å bruke begrepet \n“teori og praksis» bruker jeg i denne artikkelen begrepet “campus og skole” som \nbetegnelse på hovedkontekstene i lærerutdanningen. Utrykket “mellom \nkontekster” betyr her i prinsippet at kunnskap er i bevegelse begge veier. \n \nKunnskap for praksis \nTradisjonelt har teoretisk og abstrakt kunnskap blitt sett på som mer verdt enn \nden praktiske. Pedagogikkfagets rolle var å produsere teorier om praksis og for \npraksis (Korthagen, 2008).\n Imidlertid er det mye som tyder på at pedagogikken \nikke har innfridd i denne sammenhengen.   I følge Haug (2008) har den \nakademiske pedagogikken (i norsk kontekst) bare i liten grad vært opptatt av \nskole, lærerutdanning og lærerprofesjon. Dette har ført til at orienteringen om \nskole i pedagogikkfaget har vært avhengig av den enkelte som underviste i \nfaget, noe som igjen har hindret lærere i å utvikle et felles språk de kan snakke \nom skolen innenfor. Samtidig vet vi at lærerstudentene i stor grad opplever \nskoleerfaringene som mer verdifulle enn de akademiske erfaringene (Korthagen, \n2008;\n NOKUT, 2006;  2013). Studier gjort av lærerstudenters aktiviteter i \nskolekonteksten viser blant annet at det som dominerer veiledningen i skolen, er \nfortellinger om  ”gjøringer” i klasserommet og i liten grad begrunnelser og \nrefleksjon over disse (Edwards & Protheroe, 2003; Fosse, 2011; Ottesen, 2006; \nSundli, 2001). Videre viser studier at lærerstudenter i stor grad påvirkes av \npraksislæreres klasseromatferd og adopte rer deres hverdagslige måte å snakke \npå. Det betyr ikke at lærerstudenter ikke er opptatt av forskning og teorier om \nelevers læring og utvikling, men at de opplever manglende yrkesrelevans i \nVol. 10, Nr. 2\nBritt Oda Fosse\n239\n2016©adno.no\nActa Didactica Norge\nstudiet, og liten mulighet til å bruke kunnskapen og begrepene de  har utviklet i \ncampuskonteksten i skolen (Haugan, 2014; Smeby, 2010). Vi står med andre ord \noverfor dilemmaer knyttet til lærerstudenters læring som tydelig viser en \nspenning mellom ulike læringsarenaer eller kontekster som har ulikt innhold og \nulike interesser.  \nI denne artikkelen knyttes denne manglende sammenhengen mellom \nkontekster – her omtalt som koherensproblemet i lærerutdanningen – til et \nlæringsproblem, nærmere bestemt til utfordringer lærerstudentene har med å \ntransformere kunnskap mellom kontekster. Denne artikkelen antyder videre at \nlærerutdanningen bør bli bedre til å hjelpe studentene i transformerings -\nprosessene og at det derfor er avgjørende å vite noe om hvordan lærerstudenter \nlærer i de ulike kontekstene og hvordan kunnskap transformeres mellom \nkontekster. I det følgende vil dette problematiseres i lys av teorier om læring og \ntransformering av læring. \n \nLæring og transformering av kunnskap – et spørsmål om læringssyn? \nDet tradisjonelle skillet mellom teori og praksis, som presentert ovenfor , knyttes \nav flere til et dualistisk perspektiv på læring som innebærer en forståelse av \nindivid og verden (mind and world) som to atskilte verdener ( Lave & Wenger, \n1991; Packer & Goicoechea, 2000; Säljö, 2006). Læring som overføring sto \nsentralt i denne sammenhengen. \nOverføring som begrep betydde overføring eller transportering av kunnskap \nmellom situasjoner og problemer. Det var spesielt kognitive perspektiver som \nrepresenterte dette synet. Fakta, prinsipper og holdninger overføres eller \ntransporteres til individet, som bringer fram kunnskapen i passende situasjoner. \nInnenfor et kognitivt læringsperspektiv har en antatt at individet ganske \nuproblematisk bringer med seg kunnskap fra en situasjon til en annen.  Denne \ntenkningen har vært med på å prege skolen siden dens opprinnelse, hevder Säljö \n(2006).   \nEt bærende prinsipp i kognitiv teori er menneskets naturlige tendens til å \ntolke, skape system i og ordne oppfatninger om verden rundt seg. De kognitive \nperspektivene la vekt på å utforske menneskets indre prosesser mellom \npåvirkning og handling (Gardner, 1985), det vil si menneskers intellektuelle \nfunksjoner, som læring, hukommelse, tenkning og problemløsning. Forskningen \ndreide seg som oftest om isolerte forsøk på enkeltindivider. Man mente at \nstudier av læringsprosesser ikke måtte påvirkes av eksterne faktorer som \nfølelser, historie, kultur og kontekst siden disse utgjør skiftende variabler som \nkan virke inn på individets handlinger (Vera & Simon, 1993).  Menneskelig \ntenkning ble ansett som en indre og individuell prosess.\n De sosiale aspektene \nved kognitiv læring utelukkes i første omgang, og kan kun trekkes inn når man \nhar oppnådd konsistent kunnskap om indre prosesser (Gardner, 1985). Jean \nPiaget (1896-1980) var en betydelig bidragsyter på dette forskningsfeltet. \nVol. 10, Nr. 2\nBritt Oda Fosse\n240\n2016©adno.no\nActa Didactica Norge\nVygotsky (1896-1934) utviklet en kulturhistorisk teori som en motsats mot \ndet han kalte krisen innenfor psykologien i begynnelsen av 1920-årene, nettopp \nfordi synet på menneskelig bevissthet og tenkning var preget av en \nindividualistisk forutinntatthet om tenkning som noe privat, som kun en indre \nprosess. Vygotsky (1978) kritiserte spesielt Piagets syn på kognisjon, og hevdet \nat menneskelig bevissthet utvikles først i fellesskap mellom mennesker, og \nderetter som egenskap i det enkelte mennesket. Læringsprosesser har videre en \nmateriell forankring, hvilket betyr at individer handler i forhold til potensielle \nfelles ”objekter”, eller problemområder. Dette innebærer at læring er prosesser \nsom retter seg mot å anvende ulike former for tegn, symboler og verktøy i \nsosiale aktiviteter. Innenfor dette perspektivet er læring styrt av både indre og \nytre prosesser, der det sosiale har størst betydning for læring.  Redskapene for de \nhøyere psykologiske prosessene er ikke utviklet av barnet selv, men er deler av \nden kulturen som omgir barnet.  For V ygotsky er språket det viktigste redskap \nfor læring. De psykologiske prosessene som styrer bruken av ord, forandres først \nog fremst gjennom samfunnsmessige faktorer. \n \nTransformering av kunnskap mellom kontekster \nDiskusjonen Vygtosky startet på 1920-tallet, ble hentet opp igjen på 1980 -tallet, \nav Lave og Wenger. De utviklet et situert perspektiv på læring, et perspektiv \nsom i stor grad var med på å sette i gang en ny diskusjon om hvordan vi kan \nforstå læring og overføring av kunnskap. I følge Lave og Wenger (1991) \ninnebærer læring å bli et fullverdig medlem, deltaker og person i et samfunn. \nLæring involverer hele personen med vekt på gjensidig relasjonell avhengighet \nmellom aktør og verden, virksomhet, mening, kognisjon, læring og innsikt (Lave \n& Wenger, 2003). Læring er således en prosess som finner sted i en \ndeltakelsesramme, ikke kun i en individuell bevissthet.\n   \nDiskusjonen som utviklet seg handlet om hvorvidt de kognitive og de \nsosiokulturelle perspektivene på kunnskap og læring kunne forenes innenfor \nforskning og utdanning, og ble i stor grad en diskusjon der man utfordret \ndualismen mellom individ og samfunn og mellom teori og praksis.  I denne \ndiskusjonen ble begrepet overføring, forstått som transportering av kunnskap fra  \nen person til en annen, ensbetydende med et dualistisk syn. Diskusjonen dreide \nseg både om epistemologiske spørsmål, det vil si som søker etter svar på \nhvordan man oppnår kunnskap, og om ontologiske spørsmål, som søker svar på \nhvordan verden faktisk ser ut og på vår væren-i-verden. Diskusjonen gikk videre \npå hvordan man kunne leve i spenningsfeltet mellom to så ulike perspektiver. \nNoen hevdet at det var vanskelig å forene de to synene (Packer & Goicoechea, \n2000), mens andre mente at man burde søke etter en måte å «live in the middle» \n(Wertsch, 1998). Andre hevdet at begge perspektivene tilbyr komplementære \nanalyser av læring i utdanning (Andersen mfl., 2000), og andre igjen at det er \numulig å lage et klart skille mellom de to hovedretningene i læringsteorie n \n(Sfard, 1998).  \nVol. 10, Nr. 2\nBritt Oda Fosse\n241\n2016©adno.no\nActa Didactica Norge\nPacker og Goicoechea (2000) hevdet at de kognitive og sosiokulturelle \nperspektivene på kunnskap og læring har ulike ontologiske syn,  og at det vil \nvære vanskelig å forene det ontologiske perspektivet vi finner i et dualistisk syn \npå verden med et antidualistisk syn. Ifølge Packer og Goicoechea (2000) handler \nlæring om transformering der vi både utvikles av og selv utvikler verden. Den \nkunnskapen vi har, overføres ikke direkte fra en sitasjon til en annen, som en \nkopi som skal passe inn i noe nytt.  Kunnskapen konstrueres av mennesker og \ntransformeres eller forandrer seg avhengig av situasjonen den oppstår i. \nMennesket har på denne måten påvirkning på omgivelsene, og er ikke passive \nmottakere av sann og objektiv kunnskap. \nSfard (1998) hevder  at overføringsmetaforen krysser grenser mellom det \nvitenskapelige og det hverdagslige og blir betydelige begreper for hvordan vi \nforstår fenomener. Det er derfor umulig å lage et klart skille mellom de to \nhovedretningene i læringsteorien, de kan ikke ekskludere eller utelukke \nhverandre. Sfard (1998) unngår overføringsmetaforen ved å konstruere to nye \nmetaforer: tilegnelsesmetaforen (the Aquisition Metaphor [AM]) og \ndeltakelsesmetaforen (the Participation Metaphor [PM]) og hevder at all diskurs \nom læring er  fanget mellom disse to metaforene.  I likhet med Packer og \nGoicoecheas (2000) hevder hun at AM og PM er ontologisk av natur og trekker \npå to helt ulike svar på spørsmålet om hva læring er, men at dikotomien ikke er \nkontroversiell når det kommer til å definere læring, og heller hviler på ulike \nvisjoner om læringsmekanismer. Både det kognitive og det sosiokulturelle synet \npå læring innehar individuelle og sosiale læringsprosesser sett fra et \nutdanningsperspektiv, hevder Sfard (1998). Hun spør blant annet om det ikke \nskal være lov å snakke om at vi bringer med oss noe direkte fra en situasjon til \nden annen, eller om vi tør nekte for at ting repeteres eller gjentar seg selv når vi \nbeveger oss fra situasjon til situasjon.  \nSfard (1998) finner altså en løsning på de kognitive og sosiokulturelle \nperspektivene ved å kvitte seg med metaforen «overføring»  men ikke selve \ninnholdet i det. Hun beveger seg bort fra de rent forskningsmessige dilemmaene \nog ser innholdet i lys av det mer hverdagslige. Hun legger med dette gru nnlaget \nfor å forstå de ulike teoretiske synene i lys av den oppgaven lærerstudentene står \noverfor i den profesjonelle rollen de skal virke i, nemlig at læring både handler \nom sosiale og individuelle prosesser. \nEraut (2004) studerte, i lys av sosiokulturelle teorier, overføring og \ntransformering som begreper i profesjonelle praksiser, og brukes her som kilde \nfor å belyse tematikken ytterligere. Han var  opptatt av hvordan kunnskap \ntransformeres mellom profesjonelle kontekster, som for eksempel \nlærerutdanningen og definerer overføring som: ”The learning process involved \nwhen a person learns to use previously aquired knowledge/ skills / competence / \nexpertise in a new situation” (Eraut, 2004, s. 58).  Han trekker på Lave og \nWengers teorier om praksisfelleskap, men kritiserer dem samtidig for ikke å \nvære opptatt av at deltakerne også er deltakere i andre sosiale grupper, og at det \nVol. 10, Nr. 2\nBritt Oda Fosse\n242\n2016©adno.no\nActa Didactica Norge\nde har lært andre steder ikke er en del at det situerte her og nå. Overføring \nmellom kontekster foregår ifølge Eraut (2004, min oversettelse) i fem trinn som \nalle er knyttet sammen. I denne prosessen vil studenten: \n \n1. Trekke ut potensiell relevant kunnskap fra konteksten studenten kommer \nfra. \n2. Jobbe med å forstå den nye situasjon ( gjøres ofte gjennom uformelle \nsosiale prosesser). \n3. Jobbe med å kjenne igjen kunnskap og ferdigheter som er relevante. \n4. Transformere relevant kunnskap og ferdigheter slik at de passer inn i den \nnye situasjonen. \n5. Integrere ny/transformert kunnskap og ferdigheter med annen kunnskap \nog ferdigheter med den hensikt å tenke, handle eller kommunisere i den \nnye situasjonen.  \n \nEraut (2004) redefinerer med dette overføringsbegrepet og plasserer det innenfor \net sosiokulturelt perspektiv på læring der både individuelle og sosiale prosesser \ninteragerer. Samtidig ser vi at begrepet «transformering» blir en del av \noverføringsprosessene.  \nEarut (2004) hevder imidlertid at høyere utdanning er mest interessert i å \noverføre en kunnskap som er tatt for gitt, og derfor først og fremst vil forholde \nseg til trinn 1 og 3. Videre hevder han at praksisplassen vil gi noe \noppmerksomhet til trinn 3, og ta trinn 2 for gitt. Dette innebærer blant annet at \ndet forventes at kunnskap fra høyere utdanning er ”ferdig til bruk”. Videre \nhevder Eraut (2004) at begge praksisene ikke bare ignorerer de store \nutfordringene som ligger i trinn 4 og 5, men benekter eksistensen av dem, altså \nat selve transformasjonsprosessen ignoreres og at ingen tar ansvar for den. Eraut \n(2004) hevder videre at , ”Since transfer is a social process as well as an \nindividual process, this lack of preparedness is best described as disastrous” (s. \n59). Han understreker også i nyere litteratur (Eraut, 2014) at dette er et stort \nproblem for utvikling av profesjonell læring.  \nOppsummert viser litteraturen at synet på læring og delaktighet i egn e \nlæringsprosesser har endret seg, og at dette får konsekvenser både for \nforskningsmetodene som brukes for å studere læring og utvikling, og for \nhvordan vi legger til rette for læring i undervisningssituasjoner.  Diskusjonen \nsom utviklet seg på 1980-tallet var i stor grad et oppgjør med den kognitive \ntradisjonen og dens syn på overføring som en direkte og ofte uproblematisk \ntransport av kunnskap fra en kontekst til en annen. I et situert eller sosiokulturelt \nperspektiv var oppfatningen at kunnskap transformeres og forandrer verden \nrundt oss (Packer & Goicoechea, 2000). Samtidig ble læring anerkjent for å \nhandle om  både sosiale og individuelle prosesser og om overføring og \ntransformering (Eraut 2004; Sfard, 1998). Når det dreier seg om lærerstudenters \nlæring e r det dermed ikke mulig å lage et klart skille mellom de to \nVol. 10, Nr. 2\nBritt Oda Fosse\n243\n2016©adno.no\nActa Didactica Norge\nhovedretningene innenfor læringsteorier, de kan verken ekskluderes eller \nutelukke hverandre. \n \nLæring i og mellom kontekster i lærerutdanningen. Studier av \nlæringsprosesser \nBasert på ovennevnte teorigjennomgang, hevder jeg i denne artikkelen at en \ninnsikt i lærerstudenters læringsprosesser kan bidra til å forstå hva som skjer når \nde beveger seg mellom campus og skolen. I det følgende presenteres studier \ngjort ved Universitetet i Oslo (Fosse, 2011; Jahreie 2010; Ottesen, 2006;\n Ottesen \n& Jahreie, 2010a, 2010b) som kan belyse dette. Disse studiene tar utgangspunkt \ni sosiokulturelle forskningsmetoder. Formålet med en sosiokulturell \nforskningsmetode, er å forstå hvordan mentale funksjoner er relatert til en \nkulturell, institusjonell og historisk kontekst (Wertsch, 1998). Tidligere studier \nviser at sosiokulturelle  forskningsmetoder har fungert som et viktig vindu til \nlærerstudenters læringsprosesser (Borko, Whithcomb, & Byrnes, 2008;  \nCochran-Smith & Demers, 2008; Howard & Aleman, 2008).  \nDe studiene som blir presentert her, har analysert dialoger mellom studenter, \nmellom studenter og lærere på campus, samt mellom studenter og veiledere i \nskolen. Studiene bruker interaksjonsanalytiske metoder i analysene av dialoger i \nlærerutdanningen, Basert på audio- eller video opptak av dialogene. Fokus i \nstudiene er på hvilke redskaper som til tilbys i de ulike situasjonene og hvordan \nredskaper, både språklig og fysiske, får betydning i lærerstudentenes \nkunnskapsutvikling i de ulike kontekstene. \nI den første studien, så Ottesen (2006) på lærerstudenters læring i \nskolekonteksten. Hun fulgte et utvalg studenter gjennom det ettårige \nlæringsutdanningsløpet PPU. Studien hadde som overordnet mål å forstå \nhvordan lærerstudenter seg imellom og med praksisveileder utviklet sin \npraksisidentitet. Fokus i analysen var på hvordan dialogen konstituerte seg og \nkom til syne i situasjonen, hvordan kunnskap ble rekontekstualisert og hvilke \nbegrepsmessige og praktiske redskaper som ble tatt i bruk i dialogen. Ottesens \n(2006) analyser viste at studentene tilpasset seg skolenes institusjonelle språk \nnår de konstruerte sin identitet som lærere. Det bildet som dominerte \nveiledningen, var fokusering på undervisningens rutiner mer enn på \nlærerstudenters læring. De utviklet med andre ord sin identitet, og sin \nindividuelle måte å gjøre ting på, innenfor den sosiale og kulturelle praksisen de \ndeltok i. Imidlertid påpeker Ottesen (2006) at institusjonelle tradisjoner ikke kan \nses som forsterkende og stab ile, men som fleksible og utviklende. Hun \nkonkluderte med at til tross for partnerskap, var avstanden mellom universitetet \nog skolene stor. \nI en annen studie, studerte Jahreie (2010) bruk av case i teoriundervisningen \npå campus for å forstå hvordan lærerstudenter i fellesskap konstruerte mening \nom teori gjennom bruk av case. Casen var problemorientert og skulle fungere \nsom et gjensidig samarbeidsprosjekt mellom universitetet og skolene. Data var \nVol. 10, Nr. 2\nBritt Oda Fosse\n244\n2016©adno.no\nActa Didactica Norge\nhentet fra to studentgrupper over en periode på tre uker (9 x 45 minutter). \nStudentene skulle utvikle en case med utgangspunkt i en elev de hadde observert \ni skolen, og diskutere casen i lys av teori i en skriftlig oppgave på campus, etter \npraksisperioden. Jahreies (2010) studie viste at det å transformere en \nobservasjon fra en praktisk situasjon i klasserommet til en teoretisk refleksjon, \nbød på utfordringer nettopp fordi redskapene som ble brukt, tolkes og endres av \ndeltakerne i situasjonen. Likeledes viste studien at det ikke var en klar \nsammenheng mellom de vitenskapelige begrepene studentene tok i bruk, og \nstudentenes erfaringer fra den praktiske situasjonen. Studien viste hvordan \nstudentene går gjennom kompliserte og tidkrevende prosesser når de skal \ntransformere praktisk kunnskap til teoretiske refleksjoner. Jahreie (2010) hevdet \nat institusjonens tilrettelegging av oppgaven, ga studentene muligheter til en \nkollektiv orientering i forhold til både den teoretiske og den praktiske \nkonteksten.  \nI ytterligere to artikler, analyserte Ottesen og Jahreie (2010a, 2010b) \nlærerstudenters deltakelse innenfor og på tvers av læringskontekster. Data er \nhentet fra tre læringskontekster i studiet: teoriundervisningen på campus, \nsamtaler i den praktiske delen av studiet og muntlig eksamen på campus på \nslutten av studiet. En gruppe på fire studenter ble fulgt gjennom et læringsforløp \npå ett år. Analyser ble gjort av dialoger mellom studenter, og mellom studenter, \nlærerutdannere og de ansvarlige for den praktiske delen. De empiriske analysene \nviste at det tilbys et felles motiv for studentenes læringsforløp, men at \nlæringsforløpene tolkes og konstrueres forskjellig i de ulike kontekstene. Hva \nsom gjaldt som kunnskap innenfor de ulike kontekstene, og hvilke aspekter i \naktiviteten deltakerne orienterte og posisjonerte seg i forhold til,  var bestemt av \ninteraksjonen, men regulert i relasjonen mellom det sosiale, kulturelle og \nhistoriske.  \nBasert på det samme datamaterialet, drøftet Jahreie og Ottesen (2010b) \nhvordan lærerstudenter samhandler på tvers av kontekster gjennom \nlærerutdanningen, med fokus på hvordan grenser mellom kontekstene \nkonstrueres i interaksjoner, hvordan studentene gjør grenser relevante og får \nkonsekvenser for deres læringsforløp. Analysene viste hvordan interaksjoner i \n”grenselandet” mellom de to kontekstene, fører til begrensninger. Deltakernes \nmeningskonstruksjoner kan således ta forskjellige retninger og ende i \nmotsetninger innenfor og mellom kontekster, blant annet på grunn av historisk \nutviklede og rigide grenser mellom teoriundervisningen på campus og den \npraktiske delen av studiet. \nFosse (2011) har studert studenters samtaler på campus og i skolen. Ni \nstudenter ble fulgt gjennom sitt første semester. Her ble samtaler analysert, \nmellom studentene og lærerutdanner på campus mens de jobbet med en case og \nmellom studentene og veilederne i skolen etter undervisning. Etter at teorier om \nlæring og utvikling var blitt presentert på campus og lærerstudentene oppfordret \ntil å utvikle vitenskapelig språkbruk, viste dataene at studentene utviklet \nVol. 10, Nr. 2\nBritt Oda Fosse\n245\n2016©adno.no\nActa Didactica Norge\nteoretisk kunnskap om læring ved å studere pensumlitteraturen og jobbe med en \nautentisk case om Mons (en umotivert elev som bruker unngåelsesstrategier). I \ndisse samtalesituasjonene viste studentene hvordan de var i stand til å analysere \nog forstå begreper om for eksempel motivasjon, analysere casen i lys av teorier \nom motivasjon og foreslå tiltak for tilpasset opplæring for Mons. I samtalene \ngjorde studentene fagbegreper til objekter for analyse og resonnerte seg fram til \nen forståelse av dem.\n I skolen bar samtalene med veileder preg a v å være \nhverdagslige og med fokus på praktiske aktiviteter fra undervisningen. Til tross \nfor at noen studenter forsøkte å vise til det de hadde lært på campus, gikk \nsamtalene over i hverdagslig tale fordi veileder i liten grad responderte og støttet \nstudentene i deres forsøk. Kunnskap konstruert i samtalene på campus ble altså i \nsvært liten grad tydeliggjort eller hentet fram i veiledningssamtalene i skolen. \nDet at studentene forsøkte viser imidlertid at det ligger et potensial for \ntransformering av kunnskap mellom kontekstene dersom de andre deltakerne \nhadde respondert og elaborert videre over fenomenet det ble snakket om.   \nOppsummert viser disse studiene hvordan konteksten påvirker \nlærerstudentens læring. Studentene forhandler innenfor en annen ramme i \nskolehverdagen enn på campus. Dette innebærer at lærerstudentene skaper \nmening i omgivelser som tilbyr andre redskaper, kunnskap og erfaringer i skolen \nenn dem som finnes på campus. Studiene viser at transformering byr på \nutfordringer nettopp fordi redskape ne som brukes, tolkes og endres av \nlærerstudentene i situasjonen. Mye tyder likevel på at studentene forstår og tar i \nbruk kunnskap konstruert i andre kontekster, under gitte forutsetninger. De \nstudiene det refereres til her viser videre hvordan case kan gjøre lærerstudentene \nbedre i stand til å knytte teoretiske prinsipper og begreper til autentiske \nklasseromssituasjoner, noe flere nasjonale og internasjonale studier også viser \n(Grossman, 2005; Hauge, 2002; Levin, 1999; Ludvigsen & Flo, 2002; Nieto, \n1999; Pugach, 2005). Case ser dermed ut til å kunne fungere som et viktig \nredskap i studentenes læringsprosesser og i transformeringen mellom \nkontekstene.\n \n \n \nDiskusjon \n \nJeg vil i det følgende diskutere problemstillingen,  som spør hvordan vi kan \nforstå lærerstudenters utfordringer med å transformere kunnskap mellom \ncampus- og skolekontekstene, i lys av litteraturen og forskningen artikkelen \nstøtter seg til. \nI et sosiokulturelt perspektiv, transformeres kunnskap når den oppstår i andre \npraksiser, hvilket betyr at ku nnskap får ulike utrykk i ulike kontekster, fordi \nkunnskapens status og mening er forskjellig, og fordi kunnskapskonstruksjon \nforegår i ulike kulturer med ulike agendaer og ressurser (Vygotsky, 1978; \nWertsch, 1998). I følge Sfard (1998) og Eraut (2004) er  læringsprosesser en \nVol. 10, Nr. 2\nBritt Oda Fosse\n246\n2016©adno.no\nActa Didactica Norge\nkombinasjon mellom overføring og transformasjon, tilegnelse og deltakelse og \nmellom individuelle og sosiale prosesser.  \nDe studiene som ligger til grunn for denne artikkelen (Fosse, 2011; Jahreie \n2010; Ottesen, 2006; Ottesen & Jahreie, 2010a, 2010b) viser hvordan \ntilgjengelige redskaper, spesielt de språklige, og den sosiokulturelle konteksten \nvirker inn på studentenes læring. I hvilken grad de bruker kunnskap fra campus \nnår de snakker om undervisning i skolen er vanskelig å identifisere  fordi språket \nendrer seg under påvirkning fra veileders måte å snakke på, fra et fagspråk \netablert på campus til et hverdagslig språk som inneholder få eller ingen \nfagbegreper (Fosse, 2011).  \nTransformeringsprosesser er med andre ord komplekse og lærerstudenters \nkunnskapskonstruksjoner utfordres når det de har lært, for eksempel om \nmotivasjon, skal brukes i nye kontekster. Eraut (2004) hevder at profesjonelle \npraksiser som lærutdanninger ikke er opptatt av hva som foregår i \ntransformeringsprosessene, og heller ikke hjelper studentene i disse prosessene. \nDen forskning det er vist til i denne artikkelen bekrefter langt på vei dette, fordi \nden tyder på at studentene på egen hånd må transformere kunnskap fra campus \ntil undervisning, og til refleksjon over under visning, i skolen. Lærerstudenters \nrapportering om manglende sammenheng mellom det som skjer på campus og i \nskolen kan blant annet ha sitt utspring i manglende hjelp til å transformere og \nintegrere relevant kunnskap i nye situasjoner (NOKUT, 2006; 2013). E t \nspørsmål som kan stilles i den sammenheng er i hvilken grad \npartnerskapsmodellene og metodene som brukes i lærerutdanningen tar hensyn \ntil at kunnskap må transformeres når studentene skal bruke den i andre \nkontekster.  \nSom nevnt, er lærerutdanninger preget av ideen om kunnskap for  praksis, \nsom innebærer at studentene forventes å overføre eller transformere sine \nteoretiske kunnskap og erfaringer til praksis i klasserommet (Aasen, 2008; \nCochran-Smith & Lytle, 1999; Korthagen, 2008). I det reformarbeidet som  \nmange lærerutdanninger etablerer, er en av de viktigste hensiktene nettopp å \nlette studentenes transformeringsprosesser. Siden det i hovedsak er \ncampuskonteksten som utvikler metodene og gjennomfører undervisningen som \nskal lette transformeringen foregår disse prosessene i hovedsak på campus og \ndet blir fortsatt studentenes oppgave å transformere kunnskapen og tilpasse den \ntil skolekonteksten. Dette ansvarliggjør studenten på en måte som kan hindre \neller forsinke profesjonell utvikling, inkludert et felles fagspråk (Haug, 2008).\n  \nDet å anerkjenne at kunnskap om undervisning handler om både teoretisk, \npraktisk og erfaringsbasert kunnskap, vil kunne utfordre den tradisjonelle teori -\npraksis tenkningen og samarbeidet mellom campus og skole. Diskusjoner om \npedagogikkens rolle i lærerutdanningen og hvordan faget kan gjøres relevant for \nskolen blir viktige i denne sammenhengen (Haug, 2010).\n Videre bør spørsmålet \nom hvorvidt det er mulig å avskaffe spenningen mellom teori og praksis eller \nhvordan man kan leve med de n, drøftes. Med andre ord blir lærerutdanningen \nVol. 10, Nr. 2\nBritt Oda Fosse\n247\n2016©adno.no\nActa Didactica Norge\nutfordret til å stille grunnleggende spørsmål om hvor og hvordan kunnskap om \nundervisning best konstrueres, for eksempel som kunnskap for praksis, i praksis \neller fra praksis (Cochran-Smith & Lytle, 1999) – eller i en integrering mellom \ndisse.  \nI tillegg er det klare indikasjoner på at kontekstene i lærerutdanningen jobber \ninnenfor grenser som på flere områder er fastlagte og kan fremstå som lukkede \n(Lillejord & Børte, 2014). At kontekster kan oppleves som lit e \ngjennomtrengelige kan nettopp ha sammenheng med at kontekster oppstår i \nsituasjoner mellom menneskene, redskapene og de spesielle aktivitetene som \nforegår der. Hensikten formes med andre ord innenfor de praksisene der \nhensikten oppstår (Edwards, 2010). D ette skaper utfordringer med hensyn til å  \nutvikle partnerskap, som både skal gi innsikt i den aktuelle konteksten og kunne \nta del i felles kunnskapsutvikling. Sett i lys av et sosiokulturelt perspektiv på \nlæring og hvordan kontekster utvikles, vil en løsni ng kunne være å opprette en \nhelt ny kontekst i nærheten av de opprinnelige grensene (Edwards, 2010), med \ndeltakere fra campus og skole der alle transformerer sin kunnskap til et felles \nprosjekt. I et slikt samarbeid\n anerkjennes alles kunnskap og bidrag, og  det \nutvikles oppgaver og metoder som har som grunnlag å skape sammenheng i \nlærerutdanningen, for lærerstudentene.  \nLillejord og Børte (2014) tar, som nevnt, i sin forskningsrapport et oppgjør \nmed den tradisjonen vi har i dag og etterlyser en ny måte å tenke på når det \ngjelder partnerskapsmodeller.  Det er mye som tyder på at utfordringer i \nlærerutdanningen i liten grad diskuteres i lys av studier om hva som skjer i \nlærerstudenters læringsprosesser. \n \n \nAvsluttende kommentar og videre forskning \n \nDenne artikkelen problematiserer lærerstudenters læringsprosesser og spesielt \ntransformeringsprosessene som skjer når studentene beveger seg mellom  \ncampus og skole,  og antyder at kunnskap om lærerstudenters læringsprosesser \nmå tas i betraktning når for eksempel ulike partnerskapsmodeller og metoder \nutvikles i lærerutdanningen. Artikkelen spør blant annet om manglende fokus på \nhva som faktisk skjer i lærerstudenters lærings- og transformeringsprosesser kan \nvære medvirkende årsak til at lærerstudenter fortsatt opplever svak sammenheng \nmellom aktivitetene på campus og i skolen.  \nFor bedre å forstå lærerstudenters utfordringer med å knytte sammen \ncampusaktiviterer og skoleaktiviteter er det behov for forskning som i større \ngrad ser på hvordan lærerstudenter konstruerer og tra nsformerer kunnskap i \nlærerutdanningens ulike kontekster. Det innebærer også studier av de \nkontekstene læringen konstrueres i, de redskapene som tilbys og hvordan \nveiledere i skolen og lærerutdannere på campus bidrar til lærerstudenters læring \nog utvikling. \nVol. 10, Nr. 2\nBritt Oda Fosse\n248\n2016©adno.no\nActa Didactica Norge\n \n \nReferanser \n \nAasen, P. (2008). Lærerutdanningen ved universiteter og høyskoler. Utdanningspolitiske \nperspektiver. I Knudsen, G. & Evenshaug, T. (red.), Universitetet og lærerutdanningen. \nHistoriske perspektiver (s. 239-254). Oslo: Unipub. \nAfdal, H. W. (2014) Fra politikk til praksis – konstruksjon av læreres profesjonelle kunnskap. \nNorsk pedagogisk tidsskrift, 98, 469-481. \n Anderson, J. R., Greeno, J. & Simon, H. A. (2000). Perspectives on Learning, Thinking, and \nActivity. Educational Researcher, 29(4), 11-13. \nBorko, H., Whithcomb, J. A., &  Byrnes, K. (2008). Genres of research in teacher education. I  \nCochran-Smith, M.,  Feiman-Nemser, S., McIntyre,  D. J.,  & K. E. Demers (red.). \nHandbook of research on teacher education. Enduring Questions in Changing Contexts \n(s. 1017- 1050). New York: Routledge. \nChilds, A., Edwards, A., & McNicholl, J. (2014). Developing a Multi-Layered System of \nDistributed Expertise: What does Cultural Historical Theory Bring to Understandings of \nWorkplace Learning in School-University Partnerships? I McNamara, O., Murray, J., & \nJones, M. (red.). Workplace Learning in Teacher Education. International Practice and \nPolicy (s. 29-54). Dordrecht: Springer. \n Cochran-Smith, M. & Demers, K. E. (2008). How do we know what we know? Research and \nteacher education. I Cochran-Smith, M., Feiman-Nemser, S., McIntyre, D. J., & Demers, \nK. E.  (red.). Handbook of research on teacher education. Enduring Questions in \nChanging Contexts (s. 1009-1016). New York: Routledge/Taylor & Francis group and the \nAssociation of Teachers Educators.  \nCochran-Smith, M. & Lytle, S. L. (1999). Relationships of Knowledge and Practice: Teacher \nLearning in Communities. I Iran-Nejad, A. & Pearson, P. D. (red.),  Review of Research in \nEducation, 24 (s. 249-306). Washington, DC: American Educational Research \nAssociation. \nDarling-Hammond, L. (2008). The case for university-based teacher education.  I Cochran-\nSmith, M., Feiman-Nemser, S., McIntyre, D. J.,  & Demers, K. E. (red.). Handbook of \nresearch on teacher education. Enduring Questions in Changing Contexts (s. 333-346).  \nNew York: Routledge.  \nEdwards, A. & Protheroe, L. (2003). Learning to See in Classrooms: what are student \nteachers learning about teaching and learning while learning to teach in schools? British \nEducational Research Journal, 29(2), 227-242. \nEdwards, A. (2010). Being an expert professional practioner: The relational term in expertise. \nDordrecht: Springer.  \nEraut, M. (2004). Transfer of knowledge between education and workplace settings. I  \nRainbird, H., Fuller, A. & Munro, H. (Red.), Workplace learning in context (s.201-221). \nLondon: Routledge. \nEraut, M. (2014). Developing Knowledge for Qualified Professionals. I McNamara, O., \nMurray, J., & Jones, M. (red.), Workplace Learning in Teacher Education. International \nPractice and Policy (s. 47-72). Dordrecht: Springer. \nFenstermacher, G . D. (1994). The Knower and the known: The nature of knowledge in \nresearch on teaching. I Darling-Hammond, L. (red.), Review of Research in Education 20. \nWashington: American Educational Research Association. \nVol. 10, Nr. 2\nBritt Oda Fosse\n249\n2016©adno.no\nActa Didactica Norge\nFosse, B. O. (2011). Lærerstudenters innramming og forståelse av tilpasset opplæring. En \nstudie av kollektive læringsprosesser i ulike kontekster ved en praktisk-pedagogisk \nlærerutdanning. Upublisert Doktoravhandling, Universitetet i Oslo, Oslo \nGardner, H. (1985). The Minds New Science. A History of the Cognitive Revolution. New \nYork: Basic Books.  \nGrossman, P. (2005). Research on Pedagogical Approaches in Teacher Education. I Cochran-\nSmith, M, & Zeichner, K.M. (red.). Studying Teacher Education. The Report of the AERA \nPanel on Research and Teacher Education. Mahwah, New Jersey: Lawrence Erlbaum \nAssociates. \nGrossman, P., Hammerness, K., & McDonald, M. (2009). Redefining teaching, reimagining \nteacher education. Teachers and Teaching: Theory and Practice, 15(2), 273-289. \nHaug, P. (2008). Norsk lærarutdanning – kva har skjedd med pedgogikkfaget? Norsk \npedagogisk tidsskrift, 06, 487-493. \nHaug, P. (2010). Kvalifisering til læraryrket. I Haug, P. (red.). Kvalifisering til læraryrket (s. \n9-28). Oslo: Abstrakt forlag. \nHaugan, J. A. (2014). Student teachers' tool orientation during internships.  Tidsskriftet FoU i \npraksis, 8(2), 29-49. \nHauge, T. E. (2002). Casearbeid og mappevurdering som integreringsverktøy i \nlærerutdaningen. I  Ludvigsen, S. &  Hoel, T. L. (red.). Et Utdanningssystem i Endring: \nIKT og Læring (s. 149-172). Oslo: Gyldendal Akademisk. \nJahreie, C. F. (2010). Making sense of conceptual tools in student-generated cases: Student \nteachers’ problem-solving processes. Teacher and teacher education,26(6), 1229-1237. \nJahreie, C. F. & Ottesen, E. (2010a). Learning to become a teacher. Participation across \nspheres for learning. I Ellis, V ., Edwards, A., & Smagorinsky, P. (red.), Cultural-\nHistorical Perspectives on Teacher Education and Development. Learning Teaching (s. \n131–146). London: Routledge \nJahreie, C. F. & Ottesen, E. (2010b). Construction of boundaries in teacher education: \nAnalyzing student teachers’ accounts’. Mind, Culture, and Activity, 17(3), 212-234. \nKarlsen, G . E. (2003). Hvorfor en bok om lærerutdanning? I Karlsen,\n G . E. & Kvalbein, I. A. \n(red.), Norsk lærerutdanning. Søkelys på allmennlærerutdanningen i et reformperspektiv ( \ns.13-23). Oslo: Universitetsforlaget. \nKlette, K. & Hammerness, K. (2016). Conceptual Framework for Analyzing Qualities in \nTeacher Education: Looking at Features of Teacher Education from an International \nPerspective. Acta Didactica Norge, 10(2), 26-53. \nKorthagen, F. A. J. (2008). Linking Practice and Theory. The Pedagogy og Realistic Teacher \nEducation. New York: Routledge. \nLambert, P. (2003). Promoting Developmental Transfer in V ocational Teacher Education. I \nTuomi-Gröhn, T. & Engeström, Y . (red.). Between School and Work: New perspectives on  \ntransfer and boundary-crossing (s. 233-254). Amsterdam: Pergamon. \nLave, J. & Wenger, E. (1991). Situated Learning: Legitimate Peripheral Participation. New \nJersey: Cambridge University Press. \nLave, J. & Wenger, E. (2003). Situert Læring og andre tekster. København:\n Hans Reitzels \nForlag. \nLevin, B. B. (1999). The Role of Discussion in Case Pedagogy: Who Learns What? And \nHow? I Lundeberg, M. A., Levin, B. B., & Harrington, H. L. (red.), Who Learns What \nFrom Cases and How. The research base for teaching and learning with cases (s. 139-\n157). Mahwah, New Jersey: Lawrence Erlbaum Associates.  \nLillejord, S. & Børte, K. (2014). Partnerskap i lærerutdanningen. En forskningskartlegging –\nKSU 3/2014. Hentet fra \nVol. 10, Nr. 2\nBritt Oda Fosse\n250\n2016©adno.no\nActa Didactica Norge\nhttp://www.forskningsradet.no/servlet/Satellite?c=Rapport&cid=1254003899070&lang=n\no&pagename=kunnskapssenter%2FHovedsidemal \nLudvigsen, S. & Flo, C. F. (2002). Innovasjon i Lærerutdanningen: Hvordan Skapes Endring? \nI Ludvigsen, S. & Hoel, T. L. (red.). Et Utdanningssystem i Endring: IKT og Læring. \nOslo: Gyldendal Akademisk. \nLund, A., Jakhelln, R., &  Rindal, U. (2015). Fremragende lærerutdanning – hva er det, og \nhvordan kan vi få det?  I Rindal, U., Lund, A., &  Jakhelln, R. (red.). Veier til fremragende \nlærerutdanning (s. 13-31). Oslo: Universitetsforlaget. \nNieto, S. (1999). Culturally Relevant Teaching With Cases: A personal Reflection and \nImplications for Pedagogy. I. Lundeberg, M. A., Levin, B. B., & Harrington, H. L. (red.), \nWho Learns What From Cases and How. The research base for teaching and learning \nwith cases (s. 179-196).  Mahwah, New Jersey: Lawrence Erlbaum Associates.  \nNOKUT. (2006). Evaluering av allmennlærerutdanningen i Norge 2006. Del 1: Hovedrapport. \nHentet fra \nhttp://www.nokut.no/Documents/NOKUT/Artikkelbibliotek/Norsk_utdanning/Evaluering\n/alueva/ALUEV A_Hovedrapport.pdf \nNOKUT. (2013). PPUs relevans av studenters og nyutdannede læreres oppfatninger. Rapport, \n2013-3. Oslo: Nasjonalt organ for kvalitet i utdanningen.  \nOttesen, E. (2006). Talk in practice. Analysing student teachers’ and mentors’ discourse in \ninternship. Upublisert Doktoravhandling, Universitetet i Oslo, Oslo \nPacker, M. J. & Goicoechea, J. (2000). Sociocultural and Constructivist Theories of Learning: \nOntology, Not Just Epistemology. Educational Psychologist, 35(4), 227-241. \nPugach, M. C. (2005). Research on Preparing General Education Teachers to Work With \nStudents With Disabilities. I Cochran-Smith, M. & Zeichner, K. M. (red.). Studying \nTeacher Education. The Report of the AERA Panel on Research and Teacher Education (s. \n549-590). Mahwah, New Jersey: Lawrence Erlbaum Associates. \nSäljö, R. (2006). Læring og kulturelle redskaper. Om læreprosesser og den kollektive \nhukommelsen. Oslo: Cappelen Akademisk. \nSfard, A. (1998). On two Methaphors and the Danger of Choosing Just One. Educational \nResearcher, 27(2), 4-13. \nSmeby, J. C. (2010). Studiekvalitet, praksiskvalitet og yrkesrelevans. I Haug, P. (red.). \nKvalifisering til læraryrket (s. 98-117). Oslo: Abstrakt forlag. \nSundli, L. (2001). Veiledning i lærerutdanningens praksis – mellom refleksjon og kontroll. \nHiO rapport no. 15. Oslo: Høgskolen i Oslo og Akershus. \nSundli, L. (2003). Yrkeskvalifisering gjennom praksis. I Karlsen, G . E & Kvalbein, I. A. \n(red.). Norsk lærerutdanning. Søkelys på allmennlærerutdanningen i et reformperspektiv \n(s. 223–238). Oslo: Universitetsforlaget. \nVera, A. H. & Simon, H. A. (1993). Situated Action: A Symbolic Interpretation. Cognitive \nScience, 17(1), 7-48. \nVygotsky, L. S. (1978). Mind in Society. The development of Higher Psychological Processes. \nCambridge, MA: Harvard University Press. \nVygotsky, L. S. (2001). Tenkning og tale. Oslo: Gyldendal Akademisk. \nWertsch, J. V . (1998). Mind as Action. New York: Oxford University Press. \n \nVol. 10, Nr. 2\nBritt Oda Fosse\n251\n2016©adno.no\nActa Didactica Norge",
  "topic": "Humanities",
  "concepts": [
    {
      "name": "Humanities",
      "score": 0.541827917098999
    },
    {
      "name": "Sociology",
      "score": 0.3738425672054291
    },
    {
      "name": "Pedagogy",
      "score": 0.3419558107852936
    },
    {
      "name": "Psychology",
      "score": 0.3298770785331726
    },
    {
      "name": "Philosophy",
      "score": 0.3164129853248596
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I184942183",
      "name": "University of Oslo",
      "country": "NO"
    }
  ],
  "cited_by": 13
}