{
    "title": "Quadruple Active Bridge DC-DC converter as the basic cell of a modular Smart Transformer",
    "url": "https://openalex.org/W2406956442",
    "year": 2016,
    "authors": [
        {
            "id": "https://openalex.org/A2230027594",
            "name": "Levy F. Costa",
            "affiliations": [
                "Kiel University"
            ]
        },
        {
            "id": "https://openalex.org/A2064389746",
            "name": "Giampaolo Buticchi",
            "affiliations": [
                "Kiel University"
            ]
        },
        {
            "id": "https://openalex.org/A1981475371",
            "name": "Marco Liserre",
            "affiliations": [
                "Kiel University"
            ]
        },
        {
            "id": "https://openalex.org/A2230027594",
            "name": "Levy F. Costa",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2064389746",
            "name": "Giampaolo Buticchi",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1981475371",
            "name": "Marco Liserre",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2003821750",
        "https://openalex.org/W2052825255",
        "https://openalex.org/W2129374939",
        "https://openalex.org/W2057175642",
        "https://openalex.org/W1934158599",
        "https://openalex.org/W2158114484",
        "https://openalex.org/W6629555931",
        "https://openalex.org/W6785279208",
        "https://openalex.org/W2163437965",
        "https://openalex.org/W2151261431",
        "https://openalex.org/W2000203998",
        "https://openalex.org/W2077711491",
        "https://openalex.org/W6639461308",
        "https://openalex.org/W6746924249",
        "https://openalex.org/W2068334467",
        "https://openalex.org/W2097116243",
        "https://openalex.org/W1884783084",
        "https://openalex.org/W3099039147",
        "https://openalex.org/W2776683826",
        "https://openalex.org/W1494319207"
    ],
    "abstract": "One of the main challenges of a Solid-State transformer (SST) lies in the dc-dc conversion stage. In this work, a Quadruple-Active-Bridge (QAB) dc-dc converter is investigated to be used as the basic module for the whole dc-dc stage. Besides the feature of high power density and soft-switching operation, the QAB converter provides a solution with a reduced number of high frequency transformers, since more bridges are connected to the same multi-winding transformer. To ensure soft-switching in the full operation range of the converter, two modulation strategies are investigated: the phase-shift modulation and the triangular current modulation. The theoretical analysis is developed for both modulation strategies and a comparison between them is carried out. In order to validate the theoretical analysis, a 20 kW prototype was built and tested.",
    "full_text": "  \n                                                                                         \n \n \n \n© 2016 IEEE. Personal use of this material is permitted. Permiss ion from IEEE must be obtained for \nall other uses, in any current or future media, inc luding reprinting/republishing this material for \nadvertising or promotional purposes, creating new c ollective works, for resale or redistribution to \nservers or lists, or reuse of any copyrighted component of this work in other works.  \n \nDigital Object Identifier (DOI):\n 10.1109/APEC.2016.7468209 \n \n \nIEEE Transactions on Power Electronics \nQuadruple Active Bridge DC-DC converter as the basic cell of a modular Smart Transformer \n \nLevy Ferreira Costa \nGiampaolo Buticchi \nMarco Liserre \n \nSuggested Citation \nL. F. Costa, G. Buticchi and M. Liserre, \"Quadruple Active Bridge DC-DC converter as the basic cell of \na modular Smart Transformer,\" IEEE Applied Power Electronics Conference and Exposition (APEC), \nLong Beach, 2016, pp. 2449-2456. \nQuadruple Active Bridge DC-DC Converter as the\nBasic Cell of a Modular Smart Transformer\nLevy F . Costa, Giampaolo Buticchi and Marco Liserre, F ellow, IEEE\nChristian-Albrecht-University of Kiel (Uni-Kiel) / Power Electronics Chair (PE)\nKaiserstr. 2, 24143, Kiel, SH, Germany\nEmail: {lfc, gibu, ml }@tf-uni-kiel.de\nAbstract—One of the main challenges of a Solid-State trans-\nformer (SST) lies in the dc-dc conversion stage. In this work , a\nQuadruple-Active-Bridge (QAB) dc-dc converter is investi gated\nto be used as the basic module for the whole dc-dc stage.\nBesides the feature of high power density and soft-switchin g\noperation, the QAB converter provides a solution with a redu ced\nnumber of high frequency transformers, since more bridges a re\nconnected to the same multi-winding transformer . T o ensure\nsoft-switching in the full operation range of the converter , two\nmodulation strategies are investigated: the phase-shift modulation\nand the triangular current modulation. The theoretical ana lysis\nis developed for both modulation strategies and a compariso n\nbetween them is carried out. In order to validate the theoret ical\nanalysis, a 20 kW prototype was built and tested.\nI. I N T RO D U CT IO N\nIn recent years, the smart grid technologies have received\nmore and more attention, as a feasible solution to manage in\nan efﬁcient way the increased demand and the high penetratio n\nof distributed generation (DG). One of these technologies i s\nthe Smart Transformer, which is a Solid-State Transformer\n[1] - [2] with control and communication functionality [3].\nThis power electronics based system uses a high frequency\n(HF) transformer, reducing volume and weight, and it can als o\nprovide ancillary services to the grid, such as: power facto r\ncorrection, active ﬁltering, V AR compensation, electroni cs\nprotection and disturbance rejection [1] - [2].\nThe three-stage ST is usually composed of a Medium-\nV oltage (MV) ac-dc stage, a HF isolated dc-dc stage and\na Low-V oltage (L V) dc-ac stage. The main challenge of\nthis architecture is the dc-dc conversion stage, since it ha s\nstrict requirements, such as: high rated power, high curren t\ncapability in L V side, high voltage capability in HV side, hi gh\nfrequency isolation and high efﬁciency.\nT o meet all these requirements, two solutions have been\nwidely investigated: the ﬁrst one is to use standard convert er\nwith high voltage rating devices [4] - [5], while the second o ne\nis based on the modular concept, in which several modules are\nused to share the total voltage and power among them [6] -\n[8]. Although the modular solution presents a high componen t\ncount, it has several advantages compared to the ﬁst solutio n,\nsuch as: low dv/dt (low EMI emission), possibility to use\nstandard low voltage rating devices and also modularity, wh ich\nenables fault tolerance capability.\nSeveral converters have been investigated to be used as\nmodule of the main core of the ST , but the Dual-Active-Bridge\nFig. 1. Modular smart transformer architecture using the QA B converter as\na basic module of the dc-dc conversion stage.\nT ABLE I\nSP E C I FIC AT I O N O F A SM A RT T R A N S F O R M E R F O R D I S T R I BU T I O N S Y S T E M\nSpeciﬁcation Smart Transformer Speciﬁcation QAB\nRated Power 1 MV A Rated Power 111 kW\nInput V oltage 400 V Input voltage (L V) 700 V\nOutput V oltage 10 kV Output voltage (MV) 1.13 kV\nL VDC link 700 V Switching frequency 20 kHz\nMVDC link 10.2 kV IGBT 1700 V\n(DAB) and the Series-Resonant converter (SR) have received\nmore attention, due their advantages of soft-switching, hi gh\nefﬁciency and power density [9] - [8]. The Series-Resonant d c-\ndc converter presents a well regulated output voltage for wi de\nrange of load (when operating in discontinuous-conduction -\nmode), avoiding the requirement of control loops. For that\nreason, it is also called dc-transformer [6] - [8]. On the oth er\nhand, when the output voltage control or power ﬂow control\nis required, the DAB converter is more advantageous, since i t\nenables the active control of the transferred power [9] - [11 ].\nThe Multiple Active Bridge (MAB) is an alternative so-\nlution for the DAB or SRC. This kind of converter was\nﬁrstly introduced in [12] and it was applied in a solid-state\ntransformer in [13], in order to connect renewable energy\nFig. 2. T opology of the Quad-Active-Bridge dc-dc converter .\nsources and storage system to the grid. The MAB converter has\nthe same features of the DAB converter, with the additional\ncharacteristic to reduce the number of the HF transformers,\nsince the MAB converter integrates more active bridges into a\nsingle transformer. In this context, this paper investigat es the\napplication of the Quad-Active-Bridge (QAB) dc-dc convert er\nas a basic converter to build the entire ST system.\nThe QAB converter is composed of four active bridges\nconnected to the same HF transformer. Fig. 1 shows the ST\narchitecture using the QAB converter as a basic module of\nthe dc-dc stage, while Fig. 2 shows the topology of the QAB\nconverter. A basic speciﬁcation of the QAB converter for\ndistribution system application is presented in T able I, wh ere\na very high Medium V oltage DC (MVDC) link is required. In\norder to share the MVDC link with the maximum number of\nmodules, three bridges of the QAB converter are connected to\nthe MV side, while only one is connected in the L V side, as\nillustrated in Fig. 1. T able I lists the speciﬁcation of the Q AB\nconverter.\nThe main contribution of this paper is the investigation\nof the QAB converter as a basic cell for a modular ST\napplication. T o control the converter, the well-known phas e-\nshift modulation is initially considered. Nevertheless, t his\nmodulation method has some limitations regarding the soft-\nswitching operating range, when the output voltage varies.\nFor this reason, an alternative scheme based on the triangul ar\ncurrent modulation is also investigated in this paper. In se ction\nII, the operation principle of the converter is presented an d\nboth modulations schemes are described. The semiconductor s\nFig. 3. Simpliﬁed diagram of the ST , illustrating the fault o peration of the\nsystem, with one faulty cell.\nFig. 4. Equivalent circuit of the QAB converter and possible power transfer\npath among the actives bridges: (a) Equivalent circuit. (b) All possible power\npath of the converter . (c) Normal balanced condition case, w here the L V cell\na receives equal power from the three MV cells ( b, c and d), (load: cell a,\nsources: cell b, c and d). (d) Unbalanced condition case, where the L V cell a\nreceives different power from the MV cells ( b, c and d), and in this example\nthe cell d delivers more power than the cells b and c; (load: cell a, source:\ncell b, c and d). (e) Unusual case, where the MV cell b operates as a source,\ngiving energy to cells ( b and c), (load: cell a, sources: cell b, c and d). In the\nlast case, P1 = 0.\ncurrent effort and transformer current effort are presente d and\ndiscussed in Section III. In section IV , the operation of the\nQAB converter with unbalanced load in the MV cells and\nthe impact on the structure is discussed. Finally, experime ntal\nresults obtained for both modulation strategies under inve sti-\ngation are presented in Section V .\nII. O P E RAT IO N PRIN CIP L E\nThe QAB is composed of four active bridges and for the\nanalysis, each of them is denoted by the letters a, b, c and d.\nThe elements of the bridges have sub-index i = {a, b, c, d } to\nindicate the bridge the element belongs to, as depicted in Fi g.\n2. In ST application, the bridge a is connected to the L V side,\nwhile the bridges b, c and d are connected to the MV side.\nAll bridges can exchange power among themselves and the\npossible power paths are depicted in Fig. 4 (b), where each\nbridge is symbolized by the voltage source vi.\nIn standard operation, the power ﬂows from the MV to the\nL V side and the bridges b, c and d process the same amount\nof power, i.e. balanced power condition, given by P1, P2 and\nP3, respectively. This point of operation is represented in Fi g.\n4 (c).\nThe unbalanced condition, where the powers P1, P2 and\nP3 are positive, but not equal, is also a common operation\nin ST application and this situation is depicted in Fig. 4 (d) .\nThis condition can happen in case of a dynamic response of\nthe system, where the MV cells process unbalanced instanta-\nneous power or even intentionally to perform other kinds of\noptimization.\nAn unusual operation is depicted in Fig. 4 (e), where the\npower ﬂows not only from the MV to the L V side, but also\nfrom one MV cell to the others MV cells. In this situation, a\nMV cell operates as source and load. Although this situation is\nvery unlikely, it is presented here to demonstrate the versa tility\nof the QAB converter in ST application.\nSimilarly to the DAB, there are several possibilities to\nmodulate the QAB converter. Originally, the classical phas e-\nshift modulation strategy has been applied to most multiple\nactive bridge solutions present in literature.\nNevertheless, a different modulation strategy based on the\nTriangular Current Modulation (TCM) was applied to the\nQAB converter in [14], as a possible solution to increase the\nsoft-switching range in variable output voltage condition s. In\nstandard operation of the ST , variation on the QAB converter\noutput voltage is not expected. However, in fault case one or\nmore faulty cells are disconnected from the system, as depic ted\nin Fig. 3, and then all the remaining cells must reconﬁgure th e\nsystem adjusting its output voltage, in order to keep the MVD C\nlink in the correct value after the fault. For this condition , the\nPSM might operate with hard switching and this motivates\nthe investigation of the TCM for QAB converter. In this paper\nthese two modulation strategies will be compared.\nT o analyze the converter, an equivalent circuit based on the\nY -model and depicted in Fig. 4 (a) is used, in which the bridge s\nare replaced by rectangular voltage sources ( va, vb, vc and vd).\nThe voltage on the central point vx and the current slope of\neach inductor are given by (1) and (2), respectively, where\nk = {a, b, c, d }.\nvx = va + vb + vc + vd\n4 (1)\ndiLk\ndt = (vk − vx)\nL (2)\nA. Phase-Shift Modulation Strategy\nFor phase-shift operation, rectangular voltages va, vb, vc\nand vd with phase shift ϕa, ϕb, ϕc and ϕd, respectively, and\nconstant switching frequency fs are applied to the transformer.\nThe power is controlled by the phase difference among the\nbridges and it can be generally described as\nFig. 5. Main waveforms of the QAB converter, considering pos itive power\nﬂow (from the MV to the L V side): (a) PSM, (b) TCM.\nPik = VM VL\n2πfsLnϕik\n(\n1 − |ϕik|\nπ\n)\n, ϕ ik = ϕi − ϕk (3)\nwhere, i = a, b, c, d and k = a, b, c, d , according to [13].\nIn this work, the L V bridge is used as the reference cell, thus\nit is deﬁned that ϕa = 0 . In the case, the power exchanged\namong the cells a and b is given by (4). The main waveform\nof the PSM is shown in Fig. 5 (a).\nP1 = VM VL\n2πfsLnϕb\n(\n1 − |ϕb|\nπ\n)\n(4)\nThe PSM is characterized by ZVS turn-on, but this features\ndepends on the input and output voltages relation and also\nthe load [15]. As the input and output voltage are considered\nconstant, the converter can be properly designed to work\nwith ZVS operation for its entire range of operation. As a\ndisadvantage, a high level of reactive power that circulate s in\nthe high frequency transformer when the phase-shift operat ion\nangle is high. Therefore, to avoid high reactive circulatin g\ncurrent, a relatively low nominal phase-shift angle must be\nchosen on the converters design.\nB. T riangular Current Modulation Strategy\nThe TCM was previously applied to the DAB converter\nin [16] and then extended to the QAB converter in [14].\nDifferently from the previous modulation strategy, the TCM\nuses the duty-cycle to control the power transferred among\nthe bridges. Using the TCM, the switches of the MV cells\ncan operate with ZCS and the circulating reactive power on\nthe converter can be reduced. However, the current on the\nsemiconductors and transformer can have a high root-mean-\nsquare (rms) value, due to the triangular current shape with\nhigh peak, impacting on the conduction losses.\nIn this analysis, it is considered that the QAB converter\noperates in balanced condition, i.e. P1 = P2 = P3 and the L V\nbridge duty-cycle is given by D1, while the voltage of the MV\ncells b, c and d are given by D2, D3 and D4, respectively. As\nthe balanced condition is considered, then D2 = D3 = D4.\nThe basic principle of the TCM is to impose a triangular\ncurrent on the inductors, as shown in Fig. 5 (b). T o achieve\nthat, the voltages va and vb should have the waveforms\ndepicted in Fig. 5 (b) and consequently the voltage vx is\nvx =\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nnVL + 3VM\n4 , 0 < t < d 2Ts\nnVL\n4 , d 2Ts < t < d 1Ts\n0, d 1Ts < t < T s/ 2\n. (5)\nAs can seen in Fig. 5 (b), the current in the inductor starts\nfrom zero and reaches its maximum value ∆ iLb during the\nperiod of time between 0 < t < D 2Ts, where Ts is the\nswitching period.\nThe current variation during this period, denoted as\n∆ iLb(0<t<D2T s) , can be calculated by using (2), where vx is\ngiven by (5). As the currents start from zero, the switches S2\nand S3 of the L V side and also the switches S5 and S6 of the\nMV side turn-on at Zero-Current-Switching (ZCS).\nLikewise, during the period 0 < t < D 2Ts, the currents\ndecrease from ∆ iLb until reaches zero again. For this period,\nthe current variation denoted as ∆ iLb(D2T s<t<T s) can also be\ncalculated by (2). In the moment t = D2Ts, the current is zero\nand the switch S1 turned-off at ZCS.\nT o achieve ZCS operation regardless the load and input\nor output voltages levels, the condition ∆ iLb(0<t<D2T s) =\n∆ iLb(D2T s<t<T s) must be satisﬁed. As a results, the relation\nbetween the duty-cycle D1 and D2 is found and presented in\n(6).\nThe total power transferred from the L V to the MV is given\nby (7) [14]. Thus, the duty-cycle of the L V bridge D1 can be\nused to control the power transferred from the MV to the L V\nside, while the duty-cycle of the MV bridges, D2,3,4 can be\ncalculated to ensure the ZCS operation of the converter.\nD2 = VL ·n\nVM\nD1 (6)\nP(tot) = 3D1\n2 (VLn) (VM − VLn)\n4Lfs\n(7)\nIII. S E M ICO N D U CTO RS A N D TRA N S F O RM E R EFF O RT\nIn order to evaluate the performance in terms of efﬁciency of\nthe QAB converter with both modulation strategies, the curr ent\neffort on the semiconductors and transformer, as well as the\npower losses in these elements are calculated and compared.\nFor the PSM, the current waveforms on the primary side\ntransformer and also on the semiconductors of the L V bridge\nand MV bridge are depicted in Fig. 6. T o calculate the rms and\naverage value of these waveforms, the equations (8) and (9)\nare used. Similarly, for the TCM, the current waveforms are\nshown in Fig. 6. The current efforts on the semiconductors an d\nFig. 6. Current waveform on the semiconductors and transfor mer of the QAB\nconverter, for both analyzed modulation schemes.\ntransformer for this modulation method were demonstrated\nin [14] and the equations are used in this work. The efforts\nare calculated taking into account the speciﬁcation shown i n\nT able I and the results are presented in Fig. 7. T o evaluate th e\nperformance of the converter for the entire possible range o f\noperation, a maximum phase shift of ϕ = 90 ◦ for the PSM\nand a maximum duty-cycle of D = 0 . 5 for the TCM were\nconsidered. The inductor was designed in order to have the\nmaximum power at maximum control variable (phase angle for\nthe PSM and duty-cycle for the TCM), resulting a L = 80 µH\nfor PSM and L = 22 . 5µH for TCM.\niS1a,rms =\n\n\n\n\n√\n1\nTs\nTs∫\n0\niS1a2 (t) dt (8)\niLa,avg = 1\nTs\nTs∫\n0\niLa (t) dt (9)\nAs can be seen in Fig. 7 (a), the rms current in the\nsemiconductor of the MV cell are always lower for the PSM,\ncompared to the TCM. However, for the primary side current,\nthere is a region where the TCM presents lower rms current.\nThe main reason for that is the high reactive power on the\nconverter due to the high phase shift operation angle. This\neffect is also observed in the rms current on the transformer\nprimary side, depicted in Fig. 7 (c).\nThe average current through the semiconductors for both\nmodulation methods are shown in Fig. 7 (b). According to\nthis graphic, the primary side semiconductors carry the sam e\naverage current for both modulation methods. However, the\naverage current on the secondary side semiconductors are\nhigher for the TCM method. Therefore, for this graphics,\nhigher conduction losses for the TCM compared to the PSM\nare expected.\n0\nFig. 7. Current effort on the semiconductor and transformer as function of the total transferred power for both modulati on methods and considering balanced\ncondition: (a) rms current on the semiconductors, (b) avera ge current on the semiconductors, (d) rms current on the tran sformer primary side.\nFig. 8. Current effort on the semiconductor and transformer for fault case.\nIn a fault case, the output voltage of the remaining QAB\nconverter cells must be adjusted in order to compensate the\nfaulty cell, providing a regulated MVDC link after the fault .\nThe variation of the QAB converter output voltage has impact\non the current efforts of the semiconductors and transforme r.\nFig. 8 shows the current effort on the semiconductor and\ntransformer, in case of a fault of one and two cells. As can\nbe noticed, the current efforts increase signiﬁcantly for l ow\npower (lower than 25% of the total power) when the QAB\noperates with the PSM and one faulty cell. In case of two\nfaulty cells and PSM operation, the current efforts is even\nhigher for processed power lower than 43% of the total power.\nThus, in faulty operation, it is more advantageous to employ\nthe TCM in case of light load. Moreover, in this condition the\nZVS operation achieved with the PSM is not ensured anymore,\nand switching losses will be added in the converter losses.\nIV . U N BA L A N CE D CO N D IT IO N\nIn the theoretical analysis performed so far, steady-state\nand balanced condition is considered, i.e. P1 = P2 = P3.\nNevertheless, situation in which different power level are\nprocessed by the MV cells will happen often in ST . For that\nreason, the performance of the converter during unbalanced\ncondition is also studied in this work.\nFig. 9 shows the main voltage and current waveforms of\nthe QAB converter for unbalanced condition. Regardless the\nmodulation strategy, the inductor current waveform might h ave\na high rms value in highly unbalanced operation, as those cas es\npresented in [13] and [12]. However, for ST application, it i s\nconsidered that the power ﬂowing in each bridge does not\nchange its direction, but only the power level is changed, as\nthe case presented in Fig. 4 (c). Thus, the MV currents ( iLb,\niLc and iLd) waveforms will be modiﬁed, but the impact on\nthe iLa current is minimum.\nFor the PSM, the main waveforms are shown in Fig. 9 (a)\nfor a realistic situation in unbalanced condition, in which one\nMV cell processes around 30% more power than the other MV\ncells. The imbalance can be easily observed on the current\nwaveforms iLb and iLc, but slightly noticed on the current\niLa. This represents a great advantage of this structure, since\nan imbalance does not affect signiﬁcantly the L V cell, which\nis responsible for the major losses of the converter, due to\nits high current. Fig. 10 (a) shows the current effort on the\nsemiconductors of the cells b and c, when the QAB converter\noperates with PSM and an imbalance of 15% (i.e. one MV\ncell c process 15% more power then the others) and 30%.\nThis graphic was plotted using the same speciﬁcations and\nparameters already presented in Section III.\nFor the TCM scheme, the main waveforms are shown in 9\n(b) for a condition where the bridge c procesess 30% more\npower than the others bridges. In this case, the duty-cycle\nD3 of the cell c is slightly higher than the D2 and D4. It\nis important to note in this ﬁgure that the imbalance causes\nthe loss of the ZCS, adding switching losses to the converter ,\nsince the current starts from a small constant dc value, but\ndifferent from zero.\nAs can be observed in Fig. 9 (b), the voltage vx has one\nmore level, caused by the duty-cycle difference given by\n∆ D = D3 − D2, and this additional level makes the current ib\ndecrease and the current ic increase. Afterward, both currents\ndecrease with the same slope, but they reach different value s,\nbecause they started from different points. As a conclusion , the\nFig. 9. Main current and voltage waveforms of the QAB convert er for\nunbalanced condition.\nvariable ∆ D has direct impact on the dc value of the currents,\nand consequently the additional power delivered by the MV\ncell. For that reason, this new variable can be used to contro l\nthe power exchange among the MV cells, as described in [14].\nFig. 10 (a) shows the current effort on the semiconductors\nof the cells b and c, when the QAB converter operates with\nTCM and an imbalance of 15% (i.e. one MV cell processing\n15% more power then the others) and 30%, in order to point\nout the imbalance on the semiconductors effort.\nV . E X P E RIM E N TA L RE S U LT S\nIn order to verify the operation and evaluate the performanc e\nof the QAB converter with both modulation strategies, a 20\nkW prototype was designed, and the converter performance\nwas veriﬁed experimentally.\nThe converter speciﬁcations, as well as the selected com-\nponents used in the prototype are shown in T able II.\nAs can be noticed in Section III, the required inductance\nfor the TCM is lower than the value required for the TCM.\nLikewise, for the PSM the transformer turn ratio should be\nchosen in order to have the same voltage level on the primary\nside and reﬂected secondary side. However, this situation\nmust be avoided for the TCM. As the experimental results\nwere obtained for both modulation methods using the same\nprototype, different output voltages were utilized, accor ding to\nthe modulation strategy, in order to have similar performan ce.\nThe experimental results consist of the relevant voltage\nand current waveforms for steady-state operation of the QAB\nconverter using both presented modulation methods. The mai n\nwaveforms obtained from the prototype are shown in Fig. 11.\nConsidering the limitations of dc voltage sources, the L V po rt\nwas connected to the DC supply and the ohter ports were\nconnected to loads (reverse power ﬂow operation).\nThe results of the converter operating with TCM for bal-\nanced and unbalanced loads are shown in Fig. 11 (a) and (b),\nFig. 10. Semiconductors effort of the QAB converter for an im balance of\n15% and 30%.\nrespectively. In Fig. 11 (a), the converter processes aroun d\n2. 2 kW , divided equally among the MV cells. As expected,\nthe current and voltage waveforms are very similar to the\ntheoretical waveforms and the ZCS feature can be noticed\nin the ﬁgure. Fig. 11 (b) shows the results for unbalanced\ncondition, where the bridges b and d process 640 W , while\nthe bridge c process 480 W , resulting in a total power of\napproximately 1. 8 kW . For safety reasons (open semiconductor\nmodules without the insulating gel), the test was performed\nwith voltage of 150V in the secondary side. As can seen in\nFig. 11 (b), the ZCS feature is lost.\nSimilarly, Fig. 11 (c) and (d) show the results for the QAB\nconverter operating with PSM. It is important to note that\nthe PSM modulation results were obtained with switching\nfrequency of 40 kHz.T o ensure ZVS operation, the results were\nobtained for the same input and output voltage of 200 V . The\nresults for balanced load condition is depicted in Fig. 11 (c )\nand it is presented just to point out the proper operation of t he\nQAB converter. In Fig. 11 (c), the imbalance can be noticed\non the waveform of the current iLb. However, this effect is not\nvery evident on the current iLa.\nVI. C O N CL U S IO N\nIn the framework of Solid-State transformer development,\nmodular architectures will play a fundamental role. In this\npaper, a quadruple active bridge converter is employed as\na basic cell of the dc-dc conversion stage of the ST . The\ntheoretical analysis of the QAB converter was carried out\nconsidering the phase-shift modulation scheme and the tria n-\ngular current modulation. From the comparison it is observe d\nthat in standard operation the phase-shift modulation pres ents\nlower current effort on the semiconductors and transformer ,\ncompared to the triangular current modulation, implying al so\nreduced conduction losses. However, in a fault case, where\nthe system must be reconﬁgured and the MV cells must work\nwith higher voltage, the triangular current modulation is m ore\nadvantageous.\nMoreover, the theoretical analysis and experimental re-\nsults showed that unbalanced load in the MV cells has an\ninsigniﬁcant effect on the primary side current, which is\nresponsible for the major converter losses. In other words,\nFig. 11. Experimental results of the QAB converter using bot h modulation\nstrategies and considering balanced and unbalanced condit ions: (a) for the\nTCM and balanced load condition, (b) for the TCM and imbalanc e of 25%,\n(c) for the PSM and balanced load condition, (d) for the PSM an d imbalance\non the MV side.\nT ABLE II\nSP E C I FIC AT I O N O F T H E Q A B D C -D C C O N V E RT E R P ROTOT Y P E\nParameter V alue\nRated Output Power Po = 20kW\nL V dc-link ( Va) V = 200V\nMV dc-link ( Vb, V c, V d) V = 250V\nSwitching frequency fs = 20kHz\nLeakage inductance La = Lb = Lc = Ld = 35µH\nTransformer turn ratio n = 1 : 1 : 1 : 1\nOutput ﬁlter capacitor C = 500µF\nIGBT S1,2,3,4 Inﬁneon SIGC32T120R3E\nIGBT3 (1200V/25A)\nfor the conﬁguration used in this work, the current effort on\nthe primary side and consequently the conduction losses is\nunaffected by the imbalance in the MV cells.\nRE F E RE N CE S\n[1] X. She, R. Burgos, G. W ang, F . W ang, and A. Huang, “Review o f\nsolid state transformer in the distribution system: From co mponents to\nﬁeld application, ” in IEEE Energy Conversion Congress and Exposition\n(ECCE), Sept 2012, pp. 4077–4084.\n[2] J. W . Kolar and G. Ortiz, “Solid-state-transformers: Ke y components\nof future traction and smart grid systems, ” in Proceedings of the\nInternational P ower Electronics Conference - ECCE Asia (IPEC 2014),\nMay 2014.\n[3] G. De Carne, M. Liserre, K. Christakou, and M. Paolone, “I ntegrated\nvoltage control and line congestion management in active di stribution\nnetworks by means of smart transformers, ” in IEEE 23rd International\nSymposium on Industrial Electronics (ISIE) , June 2014, pp. 2613–2619.\n[4] R. W . D. D. N. Soltau, R. U. Lenke, “High-power dc-dc conve rter, ”\nT echnical Report, Rheinisch-W estflische T echnische Hoch schule, 2013.\n[5] D. Rothmund, J. Huber, and J. Kolar, “Operating behavior and design of\nthe half-cycle discontinuous-conduction-mode series-re sonant-converter\nwith small dc link capacitors, ” in Control and Modeling for P ower\nElectronics (COMPEL), 2013 IEEE 14th W orkshop on , June 2013, pp.\n1–9.\n[6] D. Dujic, G. Steinke, E. Bianda, S. Lewdeni-Schmid, C. Zh ao, and\nJ. Steinke, “Characterization of a 6.5kv igbt for medium-vo ltage high-\npower resonant dc-dc converter, ” in Applied P ower Electronics Confer-\nence and Exposition (APEC), 2013 T wenty-Eighth Annual IEEE , March\n2013, pp. 1438–1444.\n[7] D. Dujic, A. Mester, T . Chaudhuri, A. Coccia, F . Canales, and J. Steinke,\n“Laboratory scale prototype of a power electronic transfor mer for trac-\ntion applications, ” in P ower Electronics and Applications (EPE 2011),\nProceedings of the 2011-14th European Conference on , Aug 2011, pp.\n1–10.\n[8] C. Zhao, D. Dujic, A. Mester, J. Steinke, M. W eiss, S. Lewd eni-\nSchmid, T . Chaudhuri, and P . Stefanutti, “Power electronic traction\ntransformer;medium voltage prototype, ” Industrial Electronics, IEEE\nTransactions on, vol. 61, no. 7, pp. 3257–3268, July 2014.\n[9] X. She, S. Lukic, A. Huang, S. Bhattacharya, and M. Baran, “Perfor-\nmance evaluation of solid state transformer based microgri d in freedm\nsystems, ” in Applied P ower Electronics Conference and Exposition\n(APEC), 2011 T wenty-Sixth Annual IEEE , March 2011, pp. 182–188.\n[10] H. Fan and H. Li, “High-frequency transformer isolated bidirectional\ndc-dc converter modules with high efﬁciency over wide load r ange for\n20 kva solid-state transformer, ” P ower Electronics, IEEE Transactions\non, vol. 26, no. 12, pp. 3599–3608, Dec 2011.\n[11] B. Zhao, Q. Song, and W . Liu, “ A practical solution of hig h-frequency-\nlink bidirectional solid-state transformer based on advan ced components\nin hybrid microgrid, ” Industrial Electronics, IEEE Transactions on ,\nvol. 62, no. 7, pp. 4587–4597, July 2015.\n[12] H. T ao, J. Duarte, and M. Hendrix, “Three-port triple-h alf-bridge bidi-\nrectional converter with zero-voltage switching, ” IEEE Transactions on\nP ower Electronics, vol. 23, no. 2, pp. 782–792, March 2008.\n[13] S. Falcones, R. A yyanar, and X. Mao, “ A dc-dc multiport- converter-\nbased solid-state transformer integrating distributed ge neration and stor-\nage, ” IEEE Transactions on P ower Electronics, vol. 28, no. 5, pp. 2192–\n2203, May 2013.\n[14] L. F . Costa, G. Buticchi, and M. Liserre, “Quad-active- bridge as cross-\nlink for medium voltage modular inverters, ” in IEEE Energy Conversion\nCongress and Exposition (ECCE) , Sept 2015, pp. 645–652.\n[15] R. De Doncker, D. Divan, and M. Kheraluwala, “ A three-ph ase soft-\nswitched high-power-density dc/dc converter for high-pow er applica-\ntions, ” IEEE Transactions on Industry Applications , vol. 27, no. 1, pp.\n63–73, Jan 1991.\n[16] N. Schibli, “Symmetrical multilevel converters with t wo quadrant dc-\ndc feeding, ” Ph.D. dissertation, Swiss Federal Institute o f T echnology ,\n2000."
}