{
    "title": "The browsing index: new tool uses browsing pressure to monitor deer populations",
    "url": "https://openalex.org/W2462588528",
    "year": 2001,
    "authors": [
        {
            "id": null,
            "name": "Morellet, N.",
            "affiliations": []
        },
        {
            "id": null,
            "name": "Champely, S.",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A4303259120",
            "name": "Gaillard, Jean-Michel",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A4300301728",
            "name": "Ballon, P.",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A4300301730",
            "name": "Boscardin, Y.",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2026886905",
        "https://openalex.org/W2339349966",
        "https://openalex.org/W2077227783",
        "https://openalex.org/W2012224772",
        "https://openalex.org/W2235153797",
        "https://openalex.org/W2054492715",
        "https://openalex.org/W2006861076",
        "https://openalex.org/W2073096671",
        "https://openalex.org/W2327794373",
        "https://openalex.org/W2315530411",
        "https://openalex.org/W1983010296",
        "https://openalex.org/W2120695425",
        "https://openalex.org/W2776795646",
        "https://openalex.org/W4285719527",
        "https://openalex.org/W2281862169",
        "https://openalex.org/W2034918647",
        "https://openalex.org/W2323291361",
        "https://openalex.org/W2490840621",
        "https://openalex.org/W2047810995",
        "https://openalex.org/W2014317435"
    ],
    "abstract": "Usual counts of deer populations generally show low reliability, especially at the high-density levels deer have recently reached in most parts of Europe. Since 1990, researchers and managers have looked for index methods to replace counts. Monitoring vegetation changes over time in response to deer browsing could be useful for managers to index deer abundance. We assessed the feasibility of using Aldous-derived vegetation surveys to monitor the population-habitat interaction over time. We first developed an original statistical procedure to define a reliable measure of deer browsing. Then we applied our browsing index to a case study involving a roe deer (Capreolus capreolus) population that was monitored intensively over 18 years and increased 5-fold in size. Our browsing index closely tracked the roe deer population size, the species-specific browsing rates differed widely, and bramble (Rubus sp.) could be reliably used to assess total browsing pressure of roe deer. Because it is an easy tool to use and involves much lower costs than traditional counts, our browsing index can be viewed as an efficient and reliable indicator of ecological change according to deer population status. / Les méthodes de dénombrement des populations de cervidés ont une faible précision spécialement aux niveaux élevés de densité atteints dans beaucoup d'endroits en Europe. Depuis 1990, les chercheurs et gestionnaires ont cherché à développer des méthodes indiciaires à la place des comptages. Le suivi des modifications de la végétation dans le temps en réponse à l'abroutissement des cervidés peut s'avérer utile pour les gestionnaires chargés de suivre l'abondance de leurs populations de chevreuils. Nous avons examiné la possibilité d'utiliser des suivis de la végétation basés sur la méthode d'Aldous pour suivre dans le temps les interactions entre les populations et leur habitat. Dans un premier temps nous avons développé un procédé original pour définir un outil de mesure de l'abroutissement fiable et robuste au plan statistique. Ensuite nous avons testé cet indice au cas d'une population de chevreuils suivie intensément depuis 18 ans et qui s'est multipliée par 5 au cours de cette période. Notre indice de consommation suit étroitement les fluctuations des niveaux de populations de chevreuils. La ronce (Rubus sp.) est un bon indicateur de la pression totale d'abroutissement du chevreuil. Notre indice peut être considéré comme un outil de suivi des populations de chevreuils reflétant de façon fiable les modifications de l'utilisation de la végétation et qui de plus s'avère d'un emploi facile et rapide à mettre en oeuvre.",
    "full_text": null
}