{
  "title": "Cultural adaptation and validation of the Health Literacy Questionnaire (HLQ): robust nine-dimension Danish language confirmatory factor model",
  "url": "https://openalex.org/W2476632380",
  "year": 2016,
  "authors": [
    {
      "id": "https://openalex.org/A5070678389",
      "name": "Helle Terkildsen Maindal",
      "affiliations": [
        "Aarhus University"
      ]
    },
    {
      "id": "https://openalex.org/A5041714967",
      "name": "Lars Kayser",
      "affiliations": [
        "University of Copenhagen"
      ]
    },
    {
      "id": "https://openalex.org/A5063592062",
      "name": "Ole Nørgaard",
      "affiliations": [
        "University of Copenhagen"
      ]
    },
    {
      "id": "https://openalex.org/A5038374688",
      "name": "Anne Bo",
      "affiliations": [
        "Aarhus University"
      ]
    },
    {
      "id": "https://openalex.org/A5050412020",
      "name": "Gerald R. Elsworth",
      "affiliations": [
        "Deakin University"
      ]
    },
    {
      "id": "https://openalex.org/A5059234240",
      "name": "Richard H. Osborne",
      "affiliations": [
        "Deakin University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2092105646",
    "https://openalex.org/W2441457230",
    "https://openalex.org/W2163627416",
    "https://openalex.org/W2048897735",
    "https://openalex.org/W2260281562",
    "https://openalex.org/W1537335868",
    "https://openalex.org/W2045241688",
    "https://openalex.org/W1977437529",
    "https://openalex.org/W2043388471",
    "https://openalex.org/W2147554606",
    "https://openalex.org/W2018869249",
    "https://openalex.org/W2150377764",
    "https://openalex.org/W1965315711",
    "https://openalex.org/W2414124461",
    "https://openalex.org/W2034820849",
    "https://openalex.org/W2002085590",
    "https://openalex.org/W2162821268",
    "https://openalex.org/W2144722485",
    "https://openalex.org/W2117183956",
    "https://openalex.org/W2168782065",
    "https://openalex.org/W2157335584",
    "https://openalex.org/W2105099865",
    "https://openalex.org/W2129751987",
    "https://openalex.org/W2064920814",
    "https://openalex.org/W2117053834",
    "https://openalex.org/W2060855535",
    "https://openalex.org/W2024648404",
    "https://openalex.org/W2056627493",
    "https://openalex.org/W2101761001",
    "https://openalex.org/W2339139760",
    "https://openalex.org/W2030606556",
    "https://openalex.org/W2133323217",
    "https://openalex.org/W2334408772",
    "https://openalex.org/W1585299578",
    "https://openalex.org/W2182397241",
    "https://openalex.org/W4254865137",
    "https://openalex.org/W2969587975",
    "https://openalex.org/W1967441381",
    "https://openalex.org/W4299927410",
    "https://openalex.org/W3014478659",
    "https://openalex.org/W1815596065",
    "https://openalex.org/W1992193527",
    "https://openalex.org/W2281507496",
    "https://openalex.org/W2156895524",
    "https://openalex.org/W566204369"
  ],
  "abstract": null,
  "full_text": "Maindal et al. SpringerPlus  (2016) 5:1232 \nDOI 10.1186/s40064-016-2887-9\nRESEARCH\nCultural adaptation and validation of the \nHealth Literacy Questionnaire (HLQ): robust \nnine-dimension Danish language confirmatory \nfactor model\nHelle Terkildsen Maindal1,2* , Lars Kayser3 , Ole Norgaard3,4 , Anne Bo1, Gerald R. Elsworth5  \nand Richard H. Osborne5 \nAbstract \nHealth literacy is an important construct in population health and healthcare requiring rigorous measurement. The \nHealth Literacy Questionnaire (HLQ), with nine scales, measures a broad perception of health literacy. This study aimed \nto adapt the HLQ to the Danish setting, and to examine the factor structure, homogeneity, reliability and discriminant \nvalidity. The HLQ was adapted using forward–backward translation, consensus conference and cognitive interviews \n(n = 15). Psychometric properties were examined based on data collected by face-to-face interview (n = 481). Tests \nincluded difficulty level, composite scale reliability and confirmatory factor analysis (CFA). Cognitive testing revealed \nthat only minor re-wording was required. The easiest scale to respond to positively was ‘Social support for health’ , and \nthe hardest were ‘Navigating the healthcare system’ and ‘Appraisal of health information’ . CFA of the individual scales \nshowed acceptably high loadings (range 0.49–0.93). CFA fit statistics after including correlated residuals were good for \nseven scales, acceptable for one. Composite reliability and Cronbach’s α were >0.8 for all but one scale. A nine-factor \nCFA model was fitted to items with no cross-loadings or correlated residuals allowed. Given this restricted model, the \nfit was satisfactory. The HLQ appears robust for its intended application of assessing health literacy in a range of set-\ntings. Further work is required to demonstrate sensitivity to measure changes.\nKeywords: Health literacy, Questionnaire, Measurement, Validation, Psychometrics, HLQ\n© 2016 The Author(s). This article is distributed under the terms of the Creative Commons Attribution 4.0 International License \n(http://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, \nprovided you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, \nand indicate if changes were made.\nBackground\nThe complexity of modern healthcare and the many \nhealth messages being promoted have led to health lit -\neracy being a key consideration for health promotion and \nimproving the quality of health services (Nutbeam 2000; \nProtheroe et  al. 2009; Sørensen et  al. 2012; Kickbusch \net al. 2013; Norgaard et al. 2014). Furthermore, the need \nfor people to manage their health themselves, including \nusing various health technologies, requires individuals to \nhave a wide range of health literacy competencies.\nThe World Health Organization defined health literacy \nas “the cognitive and social skills which determine the \nmotivation and ability of individuals to gain access to, \nunderstand and use information in ways which promote \nand maintain good health” (World Health Organization \n1998). From the consumer’s perspective the required \ncompetencies include not only being able to read and \nunderstand health information, but also being able to \nnavigate the health system, communicate and engage \nwith healthcare providers, engage in critical appraisal \nof health information, and advocate for one’s right to \nhealth services (HLS-EU Consortium 2012; Kickbusch \net al. 2013; Osborne et al. 2013). There is, therefore, great \npotential to improve public health and clinical medicine \nby addressing health literacy in organisations on many \nOpen Access\n*Correspondence:  htm@ph.au.dk \n1 Department of Public Health, Section of Health Promotion and Health \nServices Research, Aarhus University, Bartholins Alle 2, 8000 Aarhus C, \nDenmark\nFull list of author information is available at the end of the article\nPage 2 of 16Maindal et al. SpringerPlus  (2016) 5:1232 \nlevels through clinician training, organisational policy \nand planning, health protection, and public health policy.\nIn Denmark, and many other countries, there is a need \nfor data about population health literacy in order to cul -\ntivate an inclusive health system that meets the needs \nof individuals and diverse population groups (Sorensen \net al. 2014).\nThe focus of previous health literacy measurement meth\n-\nods was on functional health literacy: word recognition \ntests, reading ability and numeracy (Mårtensson and Hens\n-\ning 2012; Haun et al. 2014). Recent instruments, such as the \nHealth Literacy Questionnaire (HLQ) (Osborne et al. 2013) \nand the European Health Literacy Survey (HLS-EU) (HLS-\nEU Consortium 2012), assess a wider range of health liter\n-\nacy components. Data derived from the HLQ are designed \nto assist with the diagnosis of the diverse health literacy \nneeds of individuals and communities in both health pro\n-\nmotion and clinical settings. It has nine scales that generate \ncomprehensive profiles of the health literacy of individuals \nand groups. The profiles then assist practitioners, planners \nand policy makers to understand the health literacy needs \nof communities and this in turn assists in planning, design\n-\ning and evaluating interventions.\nThe HLQ has been widely translated and applied in \nresearch, evaluation and monitoring (Deakin University \n2016). However, in order for data from a new measure to \nbe regarded as sufficiently robust to make decisions about \nindividuals, communities or organisations, or to compare \nacross settings, psychometric evidence is required that \ndemonstrates that it is culturally and linguistically appro\n-\npriate and has strong measurement properties.\nIn the development of the English language HLQ the \nitems were chosen to best represent the constructs that \nhad been generated through a ‘grounded validity-driven’ \napproach which included both qualitative and quantita\n-\ntive techniques among both consumers and professionals \n(Buchbinder et al. 2011). The meaning of the constructs \nwas established by this grounded process and validated \nby the psychometric analyses reported in the original \npaper (Osborne et al. 2013). A strict translation protocol \nwas then instituted to ensure that this meaning was car\n-\nried through accurately to all non-English-language ver -\nsions. The psychometric analyses in the present paper \nhave sought to replicate the results in the original paper \nand thus validate the meaning of the Danish scales as \nequivalent to that established by the original procedures.\nThe aims of this study were to translate the HLQ to \nDanish and test the psychometric properties of the trans\n-\nlated version in a Danish validation sample. Adaptation \nwas done through a rigorous cultural and linguistic trans\n-\nlation procedure, followed by psychometric analyses. The \noutcome will inform stakeholders and the research com\n-\nmunity if the Danish HLQ data enable valid and reliable \ndecisions to be made about health literacy in Danish \nsettings.\nMethods\nSetting and data collection\nThe study was undertaken in primary care settings (com -\nmunity health centres and general practices), public \nplaces and workplaces with wide geographic and socio-\ndemographic variation. These settings were consistent \nwith populations and areas in which future application \nof the HLQ is planned. Data were gathered by health \nprofessionals and students by face-to-face interview in \nboth the cognitive testing and validation samples using a \nstandardised protocol.\nHealth Literacy Questionnaire (HLQ)\nThe HLQ was designed using a grounded, validity-driven \napproach and initially tested in diverse samples of indi\n-\nviduals in Australian communities and shown to have \nstrong construct validity, reliability and acceptability to \nclients and clinicians (Osborne et  al. 2013; Batterham \net  al. 2014). It was designed for administration by pen \nand paper self-administration or by interview to ensure \ninclusion of people who cannot read or have other diffi\n-\nculties with self-administration.\nThe HLQ contains 44 questions that cover nine con -\nceptually distinct areas of health literacy:\n1. Feeling understood and supported by healthcare pro-\nviders (four items).\n2. Having sufficient information to manage my health \n(four items).\n3. Actively managing my health (five items).\n4. Social support for health (five items).\n5. Appraisal of health information (five items).\n6. Ability to actively engage with healthcare providers \n(five items).\n7. Navigating the healthcare system (six items).\n8. Ability to find good health information (five items).\n9. Understand health information well enough to know \nwhat to do (five items).\nResponse options for each scale were determined by the \ncontent and nature of the items. For scales 1–5 four-\npoint ordinal response options are used (strongly disa\n-\ngree, disagree, agree and strongly agree), while for scales \n6–9 five-point ordinal response options are used (cannot \ndo, very difficult, quite difficult, quite easy and very easy).\nTranslation, cultural adaptation, and item strength \nequivalence\nA standardised procedure (Hawkins and Osborne 2010) \nwas used including recommendations from a range of \nPage 3 of 16\nMaindal et al. SpringerPlus  (2016) 5:1232 \norganisations (Guillemin et  al. 1993; Wild et  al. 2005; \nKoller et  al. 2007). The translation process included an \ninitial discussion of cultural differences between the Aus\n-\ntralian and Danish health systems and the presence of \nlocal dialects in Denmark. It involved two forward trans\n-\nlators, two backward translators, the authors, and was \nchaired by one of the HLQ developers (RHO). The pro\n-\ncess involved three main steps:\n1. Professional translators, with Danish as their native \nlanguage, were briefed and provided with the Eng\n-\nlish HLQ and detailed information about the intent \nof each of the nine scale constructs and each of the \nitems within those scales. The item intent document \nincluded narratives about precisely what each ele\n-\nment of the HLQ items mean and, in some cases, \nwhat these do not mean.\n2. Back translation was undertaken by two native Eng\n-\nlish speakers with excellent Danish language skills.\n3. Finally, a translation consensus meeting was con -\nducted by an expert panel comprising the four trans -\nlators and four researchers in the fields of population \nhealth, health promotion and patient care (HTM), \nhealthcare systems and medicine (ON, LK), and \nquestionnaire development and translation method\n-\nology (RHO). Each translated item was examined in \nturn. Panel members confirmed that: (a) the princi\n-\npal scale construct embodied in each Danish item \nmatched the original English item; (b) the translated \nitems were suitable for males and females, for a wide \nage range, for people with low linguistic skills, limited \nexperience of health and the healthcare system, and \nwho either did or did not have a health problem; and \n(c) the relative ‘difficulty’ (in choosing the positive \nresponse options agree/strongly agree and quite easy/\nvery easy) of each item was equivalent between the \nlanguages. When a word from a Danish dialect was \nused in the translation, panel members were required \nto consider how ubiquitous the word is across the \ncountry, or if a more commonly-used word with the \nsame meaning would be more appropriate.\nThe level of comprehensibility and cognitive equivalence \nof the preliminary translated Danish HLQ (Willis 1999; \nWild et  al. 2005) was field tested through face-to-face \ncognitive interviews with 15 persons across gender and \neducation categories and from different parts of Den\n-\nmark. The cognitive testing involved initial administra -\ntion of items using paper and pen format with careful \nobservation of each respondent. The interviewer then \nreviewed items with the respondent and asked specific \nquestions about items they had hesitated on or appeared \nto have found difficult in answering. Respondents were \nasked ‘What were you thinking about when you were \nanswering that question?’ This process elicited the cog\n-\nnitive process behind the answers. A prompt was used if \nneeded: ‘Why did you select that response option?’\nEthics\nThe study was approved by the Danish Data Protection \nAgency (j.no: 2013-41-2270). According to Danish law, \nwhen survey-based studies are undertaken in accord\n-\nance with the Helsinki Declaration, specific approval by \nan ethics committee and written informed consent is \nnot required. Potential respondents were provided with \ninformation about the survey and its purpose, including \nthat participation was voluntary. The completion of the \nsurvey by participants was then considered to be implied \nconsent.\nStatistical analysis\nAnalyses were conducted with STATA version 13.0 and \n14.0 and Mplus version 7.11. Descriptive statistics were \ngenerated for each item to determine the extent of miss\n-\ning values and to demonstrate the range of responses by \nproviding difficulty estimates within and across the nine \nscales. For scales with disagree/agree response options, \nthe relative strength of an item (how difficult it is to score \nhighly) was calculated as the proportion responding disa\n-\ngree and strongly disagree (low scores) as against agree \nor strongly agree (high scores). For scales with response \noptions cannot do to very easy, the difficulty level was \ncalculated as the proportion responding cannot do, very \ndifficult, or quite difficult as against quite easy and very \neasy (Raykov and Marcoulides 2011).\nAs Cronbach’s α is frequently a biased estimate of pop\n-\nulation reliability, unbiased estimates of composite reli -\nability were generated (Raykov 2007). However, α was \nalso calculated for comparison with other studies. Given \nthat the HLQ scales were specified a priori, confirmatory \nfactor analysis (CFA) was undertaken. Using one-factor \nCFA, a model was fitted to the data for each previously \nconfirmed scale (Osborne et  al. 2013). The response \noptions were scored as ordinal variables (1–4 for the \nstrongly disagree–strongly agree scales; 1–5 for the can\n-\nnot do–very easy scales) and the models were fitted using \nthe weighted least squares mean and variance adjusted \n(WLSMV) estimator available in Mplus. Unstandard\n-\nised and standardised factor loadings, an estimate of the \nvariance in the measured variable explained by the latent \nvariable (R\n2), and associated standard errors are pro -\nvided in Mplus together with fit statistics (χ 2, compara-\ntive fit index—CFI, Tucker–Lewis index—TLI, and root \nmean square error of approximation—RMSEA). Indica\n-\ntive threshold values for the tests of ‘close fit’ used in this \nanalysis were CFI > 0.95; TLI > 0.95; RMSEA < 0.06 while \nPage 4 of 16Maindal et al. SpringerPlus  (2016) 5:1232 \na value of <0.08 for the RMSEA was taken to indicate a \n“reasonable” fit (Browne and Cudeck 1993; Yu 2002; West \net al. 2012).\nMplus also provides statistics that can be used to facili\n-\ntate model improvement by suggesting fixed parameters \n(e.g., in the case of single-factor models, correlations \namong residual variances) that might be freely estimated. \nIn Mplus, these statistics include standardised residuals, \nmodification indices (MIs) and the associated change in \na parameter if the modification is included in the model \n(standardised expected parameter change—SEPC).\nA full nine-factor CFA model with no correlated resid\n-\nuals or cross-loadings was fitted to the data to investigate \ndiscriminant validity. As the restrictions that are typically \nplaced on multi-factor CFA models frequently result in \na strong upwards bias in the estimation of inter-factor \ncorrelations, this analysis was followed-up by fitting the \nnine-factor model using Bayesian structural equation \nmodelling (BSEM) (Marsh et  al. 2010). By using small-\nvariance priors, BSEM allows models to be fitted that \nhave the flexibility to estimate small variations from \nthe strictly zero constraints on the residual correlations \nand cross-loadings in a typical multi-factor CFA model \n(Muthén and Asparouhov 2012). For this analysis, the \nvariance of the Bayesian priors for the cross-loadings was \nset at 0.02 such that there was a 95 % probability that the \ncross-loadings would be within the range ±0.28. Simi\n-\nlarly, the variance for the residual correlations was set to \ngive a 95 % probability that the correlations were within \nthe range of ±0.2 (Muthén and Asparouhov 2012).\nHLQ scale scores were calculated as unit-weighted \nsums of the constituent items averaged by the number \nof items in the scale such that the nominal range of the \nscale scores was 1–4 for scales 1–5 and 1–5 for scales \n6–9. One-way ANOVA was used to investigate mean dif\n-\nferences on the HLQ scale scores across a range of socio-\ndemographic variables. Effect sizes (ES) and their 95  % \nconfidence intervals (CI) for standardised differences in \nmeans between sociodemographic groups were calcu\n-\nlated using Cohen’s ‘d’ with interpretation of ES as fol -\nlows: “small” ES > 0.20–0.50, “medium” ES approximately \n0.50–0.80, and “large” ES > 0.80.\nResults\nCognitive testing\nCognitive testing revealed that almost all items were well \nunderstood. Only minor re-wording was required.\nValidation sample characteristics\nTable 1 shows the sociodemographic characteristics and \nhealth conditions of the 481 respondents in the validation \nsample. The median age was 53  years, with the young\n-\nest being 17, and the oldest 92. There were more women \nthan men (a percentage-point difference of 19.2), while \n18.9 % of respondents lived alone. Over 50 % had com\n-\npleted a high school or higher and 60 % reported having \na longstanding illness or disability. The most frequent \nchronic conditions reported were: musculoskeletal dis\n-\norders, cardiovascular disease, diabetes, cancer, chronic \nobstructive pulmonary disease and mental disorders. Just \nover a quarter of respondents lived in the capital area of \nDenmark and 63 % lived in other Danish cities across dif\n-\nferent geographical regions.\nPsychometric properties of the Danish HLQ\nResponse to the HLQ items was high (missing answers: \n0.2–1.7  %). Tables  2 and 3 present the psychomet\n-\nric properties of the items and scales. At the item level, \nTable 1 Characteristics of  participants in  the validation \nof  the Health Literacy Questionaire (HLQ), Danish version \n(n = 481)\na More than one possible\nCharacteristics n\nAge, years median (IQR) 53 (36–62) 449\nSex\nFemale [n (%)]\n286 (59.6) 480\nMother tongue\nDanish [n (%)]\n445 (92.9) 479\nLiving area\nCopenhagen (capital) [n (%)]\n118 (26.8) 441\nEducation level [n (%)] 479\n Still in school 10 (2.1)\n 7 or fewer years of school 34 (7.1)\n 8–9 years of school 47 (9.8)\n 10–11 years of school 120 (25.1)\n High school diploma 247 (51.6)\n Other 21 (4.4)\nCohabitation \nLive alone [n (%)]\n90 (18.9) 475\nSelf-reported health status [n (%)] 481\n Excellent 97 (20.2)\n Very good 169 (35.1)\n Good 156 (32.4)\n Less good 52 (10.8)\n Poor 7 (1.5)\nLong-standing illness or disability, yes 288 (59.9)\nSelf-reported chronic disease [n (%)]\na\n Diabetes 50 (10.5) 477\n Chronic Obstructive Pulmonary disease 39 (8.2) 477\n Cardiovascular disease (stroke, angina pectoris, AMI) 124 (26.1) 475\n Cancer 43 (9.1) 475\n Musculoskeletal (arthritis, osteoporosis, back pain or \nother)\n165 (34.9) 473\n Mental health condition >6 months 38 (8.0) 476\nPage 5 of 16\nMaindal et al. SpringerPlus  (2016) 5:1232 \nTable 2 Data quality of the translated Health Literacy Questionnaire (HLQ) in a Danish population (n = 481)\nSubscale/items Obs  \n(n = 481)\nMissing  \n[n (%)]\nMedian Mean  \n(SD)\nStrongly  \ndisagree  \n(%)\nDisagree  \n(%)\nAgree  \n(%)\nStrongly \nagree (%)\n*Difficulty \nlevel (%)\n(95 % CI)\n1. Feeling understood and supported by healthcare providers\nI have at least one \nhealthcare provider \nwho knows me \nwell …\n479 2 (0.4) 3 2.79 (0.89) 8.4 27.1 41.5 23.0 35.5 (31.3–39.9)\nI have at least one \nhealthcare provider \nI can discuss …\n478 3 (0.6) 3 2.98 (0.75) 4.0 16.7 56.3 23.0 20.7 (17.3–24.6)\nI have the healthcare \nproviders I need to \nhelp me work …\n480 1 (0.2) 3 3.13 (0.61) 1.0 9.8 64.0 25.2 10.8 (8.3–14.0)\nI can rely on at least \none healthcare \nprovider …\n477 4 (0.8) 3 3.08 (0.68) 2.1 13.0 59.7 25.2 15.1 (12.1–18.6)\n3.00 (0.60) 20.5\n2. Having sufficient information to manage my health\nI feel I have good \ninformation about \nhealth\n478 3 (0.6) 3 3.15 (0.61) 1.3 8.8 64.0 25.9 10.0 (7.6–13.1)\nI have enough infor-\nmation to help me \ndeal with my …\n478 3 (0.6) 3 3.09 (0.68) 2.3 11.9 60.5 25.3 14.2 (11.4–17.7)\nI am sure I have all \nthe information I \nneed to manage \n…\n478 3 (0.6) 3 3.01 (0.69) 3.1 13.4 62.6 20.9 16.5 (13.5–20.1)\nI have all the \ninformation I need \nto look after my \nhealth\n478 3 (0.6) 3 2.98 (0.68) 1.5 19.7 58.6 20.3 21.1 (17.7–25.0)\n3.06 (0.55) 15.5\n3. Actively managing my health\nI spend quite a lot of \ntime actively man-\naging my health\n476 5 (1.1) 3 2.72 (0.75) 4.0 33.6 48.5 13.9 37.6 (33.3–42.1)\nI make plans for what \nI need to do to be \nhealthy\n476 5 (1.1) 3 2.79 (0.79) 5.0 28.8 48.1 18.1 33.8 (29.7–38.2)\nDespite other things \nin my life, I make \ntime to be healthy\n478 3 (0.6) 3 2.62 (0.74) 4.0 41.8 42.3 11.9 45.8 (41.4–50.3)\nI set my own goals \nabout health and \nfitness\n479 2 (0.4) 3 3.00 (0.67) 1.7 17.5 60.3 20.5 19.2 (15.9–23.0)\nThere are things that \nI do regularly to \nmake myself more \nhealthy\n480 1 (0.2) 3 3.04 (0.68) 2.3 14.0 60.8 22.9 16.3 (13.2–19.8)\n2.84 (0.55) 30.5\n4. Social support for health\nI can get access to \nseveral people who \nunderstand and …\n478 3 (0.6) 3 3.10 (0.67) 1.7 12.8 59.4 26.2 14.4 (11.6–17.9)\nWhen I feel ill, the \npeople around me \nreally understand \n…\n478 3 (0.6) 3 2.90 (0.72) 4.2 18.8 59.6 17.4 23.0 (19.4–27.0)\nPage 6 of 16Maindal et al. SpringerPlus  (2016) 5:1232 \nTable 2 continued\nSubscale/items Obs  \n(n = 481)\nMissing  \n[n (%)]\nMedian Mean  \n(SD)\nStrongly  \ndisagree  \n(%)\nDisagree  \n(%)\nAgree  \n(%)\nStrongly \nagree (%)\n*Difficulty \nlevel (%)\n(95 % CI)\nIf I need help, I have \nplenty of people I \nrely on\n479 2 (0.4) 3 3.17 (0.72) 2.3 11.9 52.2 33.6 14.2 (11.3–17.6)\nI have at least one \nperson who can \ncome to medical \n…\n479 2 (0.4) 3 3.31 (0.66) 2.3 4.4 53.2 40.1 6.7 (4.8–9.3)\nI have strong support \nfrom family and \nfriends\n480 1 (0.2) 3 3.21 (0.65) 1.5 8.5 57.3 32.7 10.0 (7.6–13.0)\n3.14 (0.52) 13.7\n5. Appraisal of health information\nI compare health \ninformation from \ndifferent sources\n479 2 (0.4) 3 2.85 (0.75) 5.2 21.5 56.6 16.7 26.7 (22.9–30.9)\nWhen I see new \ninformation about \nhealth, I check \nup …\n477 4 (0.8) 3 2.62 (0.80) 6.7 38.4 41.5 13.4 45.1 (40.6–49.6)\nI always compare \nhealth informa-\ntion from different \nsources …\n477 4 (0.8) 3 2.69 (0.80) 5.2 35.8 43.2 15.7 41.1 (36.7–45.6)\nI know how to find \nout if the health \ninformation I \nreceive is …\n476 5 (1.1) 3 2.91 (0.75) 4.2 21.0 54.8 20.0 25.2 (21.5–29.3)\nI ask healthcare pro-\nviders about the \nquality of the …\n479 2 (0.4) 3 2.68 (0.79) 6.1 34.2 45.5 14.2 40.3 (36.0–44.8)\n2.75 (0.56) 35.7\nSubscale/items Obs \n(n = 481)\nMissing  \nn (%)\nMedian Mean  \n(SD)\nCannot  \ndo (%)\nVery  \ndifficult  \n(%)\nQuite \ndifficult \n(%)\nQuite  \neasy (%)\nVery  \neasy (%)\n*Difficulty \nlevel (%)\n(95 % CI)\n6. Ability to actively engage with healthcare providers\nMake sure that \nhealthcare \nproviders under-\nstand your …\n479 2 (0.4) 4 3.79 (0.75) 0.8 3.5 24.8 57.2 13.6 29.2 (25.3–33.5)\nFeel able to dis-\ncuss your health \nconcerns with \na …\n480 1 (0.2) 4 4.11 (0.72) 0.4 2.7 10.2 58.3 28.3 13.3 (10.6–16.7)\nHave good discus-\nsions about \nyour health with \ndoctors\n479 2 (0.4) 4 4.05 (0.81) 1.0 3.5 13.2 53.7 28.6 17.7 (14.6–21.4)\nDiscuss things \nwith healthcare \nproviders until \nyou understand \n…\n477 4 (0.8) 4 3.98 (0.78) 1.0 2.9 16.8 55.8 23.5 20.8 (17.3–24.6)\nAsk healthcare \nproviders ques-\ntions to get \nthe …\n477 4 (0.8) 4 4.00 (0.74) 0.6 2.3 16.4 57.7 23.1 19.3 (16.0–23.1)\n3.99 (0.59) 20.1\nPage 7 of 16\nMaindal et al. SpringerPlus  (2016) 5:1232 \nTable 2 continued\nSubscale/items Obs \n(n = 481)\nMissing  \nn (%)\nMedian Mean  \n(SD)\nCannot  \ndo (%)\nVery  \ndifficult  \n(%)\nQuite \ndifficult \n(%)\nQuite  \neasy (%)\nVery  \neasy (%)\n*Difficulty \nlevel (%)\n(95 % CI)\n7. Navigating the healthcare system\nFind the right \nhealthcare\n479 2 (0.4) 4 3.58 (0.86) 3.3 5.8 29.0 52.6 9.2 38.2 (33.9–42.7)\nGet to see the \nhealthcare pro-\nviders I need to\n478 3 (0.6) 4 3.72 (0.85) 1.0 7.3 25.9 49.8 15.9 34.3 (30.2–38.7)\nDecide which \nhealthcare pro-\nvider you need \nto see …\n478 3 (0.6) 4 3.87 (0.78) 1.3 2.3 23.2 54.4 18.8 26.8 (23.0–30.9)\nMake sure you \nfind the right \nplace to get the \nhealth …\n476 5 (1.1) 4 3.80 (0.75) 0.6 4.0 24.8 56.3 14.3 29.4 (25.5–33.7)\nFind out what \nhealthcare \nservices you are \nentitled to …\n475 6 (1.3) 4 3.47 (0.89) 1.5 11.2 38.3 37.3 11.8 50.9 (46.4–55.4)\nWork out what is \nthe best care for \nyou\n473 8 (1.7) 4 3.69 (0.77) 1.1 3.8 31.7 51.8 11.6 36.6 (32.3–41.0)\n3.69 (0.61) 36.0\n8. Ability to find good health information\nFind information \nabout health \nproblems\n479 2 (0.4) 4 4.04 (0.70) 1.0 1.5 11.9 63.9 21.7 14.4 (11.5–17.9)\nFind health infor-\nmation from \nseveral different \nplaces\n477 4 (0.8) 4 3.98 (0.81) 1.9 2.7 14.0 58.3 23.1 18.7 (15.4–22.4)\nGet information \nabout health so \nyou are up to \ndate …\n477 4 (0.8) 4 3.98 (0.71) 1.7 1.3 12.8 66.2 18.0 15.7 (12.7–19.3)\nGet health infor-\nmation in words \nyou understand \n…\n475 6 (1.3) 4 3.92 (0.75) 0.8 3.8 16.0 60.8 18.5 20.6 (17.2–24.5)\nGet health \ninformation by \nyourself\n477 4 (0.8) 4 4.01 (0.77) 1.9 2.3 10.9 62.5 22.4 15.1 (12.1–18.6)\n3.99 (0.61) 16.9\n9. Understanding health information well enough to know what to do\nConfidently fill \nmedical forms in \nthe correct way\n478 3 (0.6) 4 3.93 (0.83) 1.9 3.3 16.9 55.9 22,0 22.2 (18.7–26.1)\nAccurately follow \nthe instructions \nfrom healthcare \nproviders\n477 4 (0.8) 4 3.93 (0.64) 0.4 1.0 18.7 65.2 14.7 20.1 (16.8–24.0)\nRead and under-\nstand written \nhealth informa-\ntion\n476 5 (1.1) 4 4.02 (0.74) 0.8 2.3 14.1 59.2 23.5 17.2 (14.1–20.9)\nRead and under-\nstand all the \ninformation \non medication \nlabels\n477 4 (0.8) 4 3.81 (0.80) 1.5 3.8 22.9 55.8 16.1 28.1 (24.2–32.3)\nPage 8 of 16Maindal et al. SpringerPlus  (2016) 5:1232 \nthere were few missing data, with the highest propor -\ntion being for item 7.6 ‘Work out what is best care for \nyou’ (1.7  %). The relative strength of the items within \nscales and between scales varied modestly. The scales \nthat were easiest to score highly were 4. ‘Social support \nfor health’ (average item difficulty 0.14) and 2. ‘Having \nsufficient information to manage my health’ (0.16). The \nscales that were hardest to score highly were 7. ‘Navi\n-\ngating the healthcare system’ (0.36) and 5. ‘ Appraisal of \nhealth information’ (0.36). The easiest item was found in \nscale 4. ‘Social support for health’ [4.4 ‘I have at least one \nperson who can come to medical appointments with me’ \n(0.07)], and the hardest item was in scale 7. ‘Navigating \nthe healthcare system’ [7.5 ‘Find out what healthcare ser\n-\nvices you are entitled to’ (0.51)]. The scale with the small-\nest range of difficulty was 8. ‘ Ability to find good health \ninformation’ (hardest 0.21, easiest 0.15, range 0.06), \nwhereas 1. ‘Feeling understood and supported by health\n-\ncare providers’ had the largest range of difficulties (hard -\nest 0.36, easiest 0.11, range 0.25).\nThe model fit for all scales (with some inclusion of cor -\nrelated errors related mostly to linguistic overlap) was \ngenerally very good, demonstrating that the scales are \nhomogeneous, although, after model modification, the \nRMSEA remained unacceptably high for scale 1 (Table 3) \nsuggesting some further association between the item \nresiduals in this scale. Initially four scales (scales 2, 3, 7 \nand 8) returned a satisfactory close fit for the one-factor \nmodels. For five scales, the close fit statistics were ini\n-\ntially not satisfactory due to the presence of correlated \nresiduals which, when included in the model (maximum \n2), ranged from 0.23 (scale 4) to 0.49 (scale 1).\nFor each scale there were high loadings on almost all \nitems [all above 0.6 except for one each in scale 5 (0.49) \nand scale 7 (0.50)]. The median loading was 0.79. A com\n-\nposite reliability and Cronbach’s α of ≥0.8 was observed \nfor all scales except scale 5. ‘ Appraisal of health informa\n-\ntion’ (composite reliability = 0.77, α = 0.76). The median \ncomposite reliability was 0.84 (α  = 0.83), with the high -\nest for scale 8. ‘ Ability to find good health information’ \n(composite reliability  =  0.87, α  =  0.87). In summary, \nthe reliability for all scales was good (0.8–0.9) except for \nscale 4. These findings are in the same range as what was \nobserved in the original psychometric studies of the Eng\n-\nlish HLQ.\nA nine-factor CFA model was fitted to the 44 items \nwith no cross-loadings or correlated residuals allowed. \nGiven the very restricted nature of the model, the fit was \nquite satisfactory: χ\n2\nWLSMV (866 df)  = 2459.31, p < 0.0001, \nCFI = 0.934, TLI = 0.930 and RMSEA = 0.062. While the \nCFI and TLI are lower than the pre-specified cut-off, this \nis not surprising given the large number of parameters \nin the model set precisely to 0.0. Also, the CFI and TLI \ntend to underestimate the goodness-of-fit of models with \nlarge numbers of measured variables compared with the \nRMSEA as in this analysis (Kenny and McCoach 2003). \nThe ranges of the factor loadings in this model were: scale \n1. ‘Feeling understood and supported by healthcare pro\n-\nviders’: 0.78–0.95; scale 2. ‘Having sufficient information \nto manage my health’: 0.77–0.86; scale 3. ‘ Actively man\n-\naging my health’: 0.69–0.89; scale 4. ‘Social support for \nhealth’: 0.62–0.84; scale 5. ‘ Appraisal of health informa\n-\ntion’: 0.58–0.83; scale 6. ‘ Ability to actively engage with \nhealthcare providers’: 0.69–0.90; scale 7. ‘Navigating the \nhealthcare system’: 0.57–0.81; scale 8. ‘ Ability to find \ngood health information’: 0.79–0.89; and scale 9. ‘Under\n-\nstanding health information well enough to know what to \ndo’: 0.69–0.86.\nInter-factor correlations in the nine-factor model \nranged from 0.41 (scales 4 and 9) to 0.93 (scales 8 and 9). \nInter-factor correlations were >0.80 for scales 6/7 = 0.82, \n7/8 = 0.87, 6/9  = 0.84, 7/9  = 0.92 and 8/9  = 0.93. It is \nfrequently argued that an inter-factor correlation of >0.80 \nto >0.85 indicates a potential lack of discriminant validity \n(Brown 2006). This suggests that there may be a lack of \ndiscriminant validity in second part of the HLQ, particu\n-\nlarly for scales 7, 8 and 9.\nBy allowing some flexibility in the estimation of resid -\nual correlations and cross-loadings the nine-factor BSEM \nmodel was an excellent fit to the data (the posterior \nTable 2 continued\nSubscale/items Obs \n(n = 481)\nMissing  \nn (%)\nMedian Mean  \n(SD)\nCannot  \ndo (%)\nVery  \ndifficult  \n(%)\nQuite \ndifficult \n(%)\nQuite  \neasy (%)\nVery  \neasy (%)\n*Difficulty \nlevel (%)\n(95 % CI)\nUnderstand what \nhealthcare pro-\nviders are asking \nyou to do\n477 4 (0.8) 4 4.08 (0.71) 1.0 1.7 10.1 63.1 24.1 12.8 (10.1–16.1)\n3.95 (0.56) 20.1\n* For scales with agree/disagree response options (scales 1–5), the ‘difficulty’ level was calculated as the proportion responding disagree and strongly disagree as \nagainst agree or strongly agree. For the competency scales (scales 6–9), difficulty was calculated as the proportion responding cannot do, very difficult or quite \ndifficult as against quite easy and very easy\nPage 9 of 16\nMaindal et al. SpringerPlus  (2016) 5:1232 \nTable 3 Psychometric properties of the HLQ, Danish version\nItem Factor loading\n(95 % CI)\nR2 Composite reliability (95 % CI)\nCronbach’s α (italics)\nFeeling understood and supported by healthcare providers 0.84 (0.82–0.87); 0.83\n I have at least one healthcare provider who knows me well 0.80 0.77–0.84 0.65\n I have at least one healthcare provider I can discuss … 0.91 0.88–0.94 0.83\n I have the healthcare providers I need to help me work … 0.75 0.71–0.79 0.56\n I can rely on at least one healthcare provider. 0.83 0.80–0.86 0.69\n Fit with 1 correlated residual = χ\n2\nWLSMV (1) = 6.504, p = 0.0108, CFI = 0.999, TLI = 0.980, RMSEA = 0.107 (0.041–0.191)\nHaving sufficient information to manage my health 0.84 (0.82–0.87); 0.84\n I feel I have good information about health 0.76 0.71–0.80 0.57\n I have enough information to help me deal with my … 0.83 0.79–0.87 0.69\n I am sure I have all the information I need to manage … 0.89 0.85–0.92 0.79\n I have all the information I need to look after my health 0.85 0.81–0.88 0.72\n Model fit—χ2\nWLSMV (2) = 4.753, p = 0.093, CFI = 0.999, TLI = 0.997, RMSEA = 0.054 (0.000–0.118)\nActively managing my health 0.83 (0.80–0.85); 0.82\n I spend quite a lot of time actively managing my health 0.72 0.67–0.77 0.51\n I make plans for what I need to do to be healthy. 0.93 0.90–0.96 0.87\n Despite other things in my life, I make time to be healthy 0.66 0.60–0.71 0.43\n I set my own goals about health and fitness 0.63 0.58–0.69 0.40\n There are things that I do regularly to make myself more healthy 0.79 0.74–0.84 0.62\n Model fit—χ2\nWLSMV (5) = 18.527, p = 0.0024, CFI = 0.994, TLI = 0.988, RMSEA = 0.075 (0.041–0.113)\nSocial support for health 0.82 (0.79–0.84); 0.81\n I can get access to several people who understand and … 0.78 0.74–0.83 0.61\n When I feel ill, the people around me really understand … 0.60 0.54–0.67 0.36\n If I need help, I have plenty of people I can rely on. 0.86 0.82–0.89 0.73\n I have at least one person who can come to medical … 0.73 0.68–0.78 0.53\n I have strong support from family or friends. 0.82 0.77–0.86 0.67\n Fit with two correlated residuals = χ2\nWLSMV (3) = 3.101, p = 0.3764, CFI = 1.000, TLI = 1.000, RMSEA = 0.008 (0.000–0.078)\nAppraisal of health information 0.77 (0.73–0.80); 0.76\n I compare health information from different sources 0.71 0.65–0.76 0.50\n When I see new information about health, I check up … 0.75 0.70–0.80 0.57\n I always compare health information from different sources … 0.86 0.81–0.90 0.73\n I know how to find out if the health information I receive is … 0.49 0.41–0.56 0.24\n I ask healthcare providers about the quality of the … 0.59 0.52–0.66 0.35\n Fit with one correlated residual = χ2\nWLSMV (4) = 7.509, p = 0.1113, CFI = 0.997, TLI = 0.994, RMSEA = 0.043 (0.000–0.090)\nAbility to actively engage with healthcare providers 0.84 (0.81–0.86); 0.84\n Make sure that healthcare providers understand your … 0.60 0.54–0.66 0.36\n Feel able to discuss your health concerns with a … 0.78 0.74–0.83 0.62\n Have good discussions about your health with doctors 0.75 0.70–0.80 0.56\n Discuss things with healthcare providers until you understand … 0.86 0.82–0.89 0.73\n Ask healthcare providers questions to get the … 0.87 0.84–0.91 0.76\n Fit with one correlated residual = χ2\nWLSMV (4) = 5.976, p = 0.2010, CFI = 0.999, TLI = 0.998, RMSEA = 0.032 (0.000–0.082)\nNavigating the healthcare system 0.84 (0.82–0.87); 0.84\n Find the right healthcare 0.72 0.66–0.77 0.51\n Get to see the healthcare providers I need to 0.50 0.42–0.57 0.25\n Decide which healthcare provider you need to see. 0.84 0.80–0.88 0.70\n Make sure you find the right place to get the health … 0.85 0.82–0.89 0.73\n Find out what healthcare services you are entitled to 0.78 0.73–0.82 0.61\n Work out what is the best care for you 0.79 0.75–0.83 0.62\n Fit with two correlated residuals = χ2\nWLSMV (7) = 11.293, p = 0.1264, CFI = 0.999, TLI = 0.997, RMSEA = 0.036 (0.000–0.072)\nAbility to find good health information 0.87 (0.85–0.89); 0.87\nPage 10 of 16Maindal et al. SpringerPlus  (2016) 5:1232 \npredictive probability value was 0.49 compared with the \ntarget value of 0.50). There were nine statistically sig -\nnificant cross-loadings, the largest being 0.28. Correla -\ntions between scales 6–9 were 6/7  =  0.72, 6/8  =  0.63, \n6/9 = 0.67, 7/8 = 0.83, 7/9 = 0.85, 8/9 = 0.84.\nTable  4 shows pattern of HLQ scores according to \nsociodemographic variables. Females were somewhat \nhigher than males only on 8. ‘ Ability to find good health \ninformation’ . Younger people had substantially higher \nscores on 4. ‘Social support for health’ than older peo\n-\nple. There were differences on six HLQ variables for edu -\ncation, all indicating that people with higher education \nhave higher health literacy than those with less educa\n-\ntion. The strongest effects were seen for 8. ‘ Ability to find \ngood health information’ . There are no significant differ\n-\nences between those who did or didn’t have Danish as \ntheir mother tongue. Five scales showed that those with \na long term illness or disability had higher health liter\n-\nacy, the largest effect was seen for 4. ‘Social support for \nhealth’ and 2. ‘Having sufficient information to manage \nmy health’ . The strongest pattern of all exogenous vari\n-\nables was with self-rated health. All scales demonstrated \na difference between those rating themselves as having \n’Excellent’ or ’Very good’ health compared with ’Good’ \nor worse health . The effect was strongest for 4. ‘Social \nsupport for health’ , 2. ‘Having sufficient information to \nmanage my health’ , and 3. ‘ Actively managing my health’ .\nDiscussion\nIn this study, we applied rigorous linguistic and cultural \nadaption methods to the HLQ to produce a high qual\n-\nity Danish version. We used a process we call measure -\nment adaptation whereby the meanings of the original \nconcepts were carefully reproduced. Consequently, data \nfrom a diverse validation sample of the Danish popula\n-\ntion demonstrated that the translated HLQ has a strong \npsychometric structure, and the reliability of the origi\n-\nnal HLQ was maintained. Within each scale, the Dan -\nish items have a range of difficulty that should enable \nthe Danish HLQ to be sensitive to differences between \ngroups and change over time. Importantly, respondents \nclearly understood all the translated items. This series of \nrigorous psychometric and practical tests indicate that \nthe Danish HLQ is robust and suitable for application \nin Danish settings, and that the reproduction of the nine \nscales in a different language and setting attests to the \nfundamental separate elements embodied in each of the \nHLQ constructs (Osborne et al. 2013).\nThe cognitive interviews generated valuable informa\n-\ntion. It was demonstrated that the translated items were \nunderstood according to the item intents by Danish peo\n-\nple from a wide range of backgrounds.\nWithin scales there was some item residual correla -\ntion. Such correlations can mean construct complexity \n(i.e., sub-constructs) or item redundancy (Boyle 1991). In \nsome cases, this seemed to be due to limited choices of \nwords in the Danish language. For example, two separate \nwords exist in English for ‘asking’ and ‘discussing’ (items \n6.4 and 6.5) but not in Danish in this context. For items \n5.1 and 5.3, the correlation is thought to relate to the \npositioning of these items on Bloom’s taxonomy (Amer \n2006). That is, the items measure the easy and difficult \nends of the same dimension: item 5.1 (0.27) is a relatively \neasy item on which to score highly, and item 5.3 (0.41) \nis a relatively hard item. While there is some conceptual \noverlap across these items, this scale, like most HLQ \nscales, has a good range of item strength and therefore \nhas wide coverage of the target construct.\nTable 3 continued\nItem Factor loading\n(95 % CI)\nR2 Composite reliability (95 % CI)\nCronbach’s α (italics)\n Find information about health problems 0.81 0.77–0.85 0.65\n Find health information from several different places 0.86 0.83–0.90 0.74\n Get information about health so you are up to date … 0.83 0.79–0.86 0.68\n Get health information in words you understand 0.71 0.67–0.76 0.51\n Get health information by yourself 0.88 0.85–0.91 0.77\n Model fit—χ\n2\nWLSMV (5) = 5.106, p = 0.4031, CFI = 1.0, TLI = 1.0, RMSEA = 0.007 (0.000–0.064)\nUnderstanding health information well enough to know what to do 0.81 (0.79–0.84); 0.81\n Confidently fill medical forms in the correct way 0.69 0.64–0.75 0.48\n Accurately follow the instructions from healthcare providers 0.69 0.63–0.75 0.48\n Read and understand written health information 0.83 0.79–0.87 0.68\n Read and understand all the information on medication labels 0.80 0.76–0.84 0.65\n Understand what healthcare providers are asking you to do 0.78 0.73–0.83 0.61\n Fit with one correlated residual = χ2\nWLSMV (4) = 5.897, p = 0.2070, CFI = 0.999, TLI = 0.998, RMSEA = 0.031 (0.000–0.081)\nPage 11 of 16\nMaindal et al. SpringerPlus  (2016) 5:1232 \nTable 4 Relationships between sociodemographic variables and HLQ scores\nVariable 1. Feeling \nunderstood \nand supported \nby healthcare \nproviders\n2. Having  \nsufficient  \ninformation \nto manage my \nhealth\n3. Actively \nmanaging my \nhealth\n4. Social  \nsupport \nfor health\n5. Appraisal \nof health  \ninformation\n6. Ability \nto actively \nengage \nwith healthcare \nproviders\n7. Navigating \nthe healthcare \nsystem\n8. Ability to find \ngood health \ninformation\n9. Understand \nhealth information \nenough to know \nwhat to do\nSex\nFemale\n Mean (SD) 3.00 (0.59) 3.00 (2.53) 2.85 (0.50) 3.15 (0.56) 2.77 (0.54) 3.98 (0.60) 3.71 (0.60) 4.05 (0.59) 3.99 (0.51)\nMale\n Mean (SD) 3.00 (0.61) 2.99 (0.54) 2.82 (0.62) 3.13 (0.52) 2.72 (0.58) 4.01 (0.58) 3.67 (0.62) 3.91 (0.63) 2.91 (0.62)\nANOVA F = 0.00; 1, 473 df; \np = 0.950\nF = 0.12; 1, 472 \ndf; p = 0.732\nF = 0.28; 1, 469 \ndf; p = 0.600\nF = 0.19; 1, 474 \ndf; p = 0.666\nF = 0.86; 1, 473 \ndf; p = 0.354\nF = 0.33; 1, 473 \ndf; p = 0.569\nF = 0.47; 1, 466 \ndf; p = 0.493\nF = 6.32; 1, 469 \ndf; p = 0.012\nF = 2.91; 1, 470 df; \np = 0.090\nES\n(95 % CI)\n0.01\n(−0.18 to 0.19)\n0.04\n(−0.23 to 0.14)\n0.05\n(−0.13 to 0.23)\n0.04\n(−0.14 to 0.22)\n0.09\n(−0.10 to 0.27)\n−0.05\n(−0.24 to 0.13)\n0.06\n(−0.12 to 0.25)\n0.24\n(0.05 to 0.42)\n0.16\n(−0.02 to 0.34)\nAge\n<65 years\n Mean (SD) 3.00 (0. 62) 3.05 (0.54) 2.84 (0.56) 3.20 (0.50) 2.77 (0.54) 3.97 (0.59) 3.69 (0.60) 4.01 (0.57) 3.95 (0.55)\n≥65 years\n Mean (SD) 3.01 (0.53) 3.08 (0.52) 2.83 (0.51) 2.99 (0.55) 2.66 (0.60) 4.02 (0.55) 3.73 (0.61) 3.94 (0.67) 3.99 (0.61)\nANOVA F = 0.01; 1, 444 df; \np = 0.923\nF = 0.30; 1, 442 \ndf; p = 0.586\nF = 0.02; 1, 439 \ndf; p = 0.879\nF = 12.50; 1, 444 \ndf; p > 0.001\nF = 3.55; 1, 443 \ndf; p = 0.060\nF = 0.65; 1, 442 \ndf; p = 0.421\nF = 0.35; 1, 436 \ndf; p = 0.556\nF = 1.28; 1, 439 \ndf; p = 0.258\nF = 0.41; 1, 440 df; \np = 0.521\nES\n(95 % CI)\n−0.01\n(−0.23 to 0.21)\n−0.06\n(−0.28 to 0.16)\n−0.02\n(−0.21 to 0.24)\n0.40\n(0.18 to 0.62)\n0.21\n(−0.01 to 0.44)\n−0.09\n(−0.31 to 0.13)\n−0.07\n(−0.29 to 0.16)\n0.13\n(−0.09 to 0.35)\n−0.07\n(−0.30 to 0.15)\nEducation\n≤Year 12\n Mean (SD) 2.98 (0.56) 2.97 (0.55) 2.77 (0.57) 3.08 (0.53) 2.64 (0.56) 3.95 (0.61) 3.59 (0.65) 3.83 (0.67) 3.86 (0.61)\nHigh school diploma\n Mean (SD) 3.03 (0.62) 3.13 (0.53) 2.88 (0.55) 3.20 (0.51) 2.82 (0.56) 4.02 (0.57) 3.78 (0.56) 4.13 (0.51) 4.04 (0.51)\nANOVA F = 0.78; 1, 442 df; \np = 0.379\nF = 9.61; 1, 440 \ndf; p = 0.002\nF = 3.72; 1, 437 \ndf; p = 0.054\nF = 5.72; 1, 442 \ndf; p = 0.017\nF = 10.38; 1, 440 \ndf; p = 0.001\nF = 1.57; 1, 440 \ndf; p = 0.210\nF = 10.49; 1, 434 \ndf; p =\n 0.001\nF = 28.19; 1, 437 \ndf; p = 0.000\nF = 11.75; 1, 438 df; \np = 0.001\nES\n(95 % CI)\n−0.08\n(−0.27 to 0.10)\n−0.30\n(−0.48 to −0.11)\n−0.19\n(−0.37 to −0.00)\n−0.23\n(−0.42 to −0.04)\n−0.31\n(−0.50 to −0.12)\n−0.12\n(−0.31 to 0.07)\n−0.31\n(−0.50 to −0.12)\n−0.51\n(−0.70 to −0.32)\n−0.33\n(−0.52 to −0.14)\nMother tongue\nDanish\n Mean (SD) 3.00 (0.59) 3.06 (0.54) 2.83 (0.56) 3.14 (0.53) 2.73 (0.56) 3.98 (0.59) 3.69 (0.60) 3.99 (0.59) 3.95 (0.56)\nOther\n Mean (SD) 2.99 (0.67) 3.04 (0.53) 2.85 (0.51) 3.09 (0.42) 2.89 (0.53) 3.99 (0.62) 3.71 (0.69) 4.13 (0.67) 4.06 (0.59)\nANOVA F = 0.01; 1, 472 df; \np = 0.936\nF = 0.03; 1, 471 \ndf; p = 0.548\nF = 0.04; 1, 640.6 \ndf; p = 0.835\nF = 0.34; 1, 473 \ndf; p = 0.558\nF = 2.51; 1, 472 \ndf; p = 0.114\nF = 0.01; 1, 471 \ndf; p = 0.931\nF = 0.02; 1, 465 \ndf; p = 0.893\nF = 1.81; 1, 468 \ndf; p = 0.180\nF = 1.30; 1, 469 df; \np = 0.255\nPage 12 of 16Maindal et al. SpringerPlus  (2016) 5:1232 \nTable 4 continued\nVariable 1. Feeling \nunderstood \nand supported \nby healthcare \nproviders\n2. Having  \nsufficient  \ninformation \nto manage my \nhealth\n3. Actively \nmanaging my \nhealth\n4. Social  \nsupport \nfor health\n5. Appraisal \nof health  \ninformation\n6. Ability \nto actively \nengage \nwith healthcare \nproviders\n7. Navigating \nthe healthcare \nsystem\n8. Ability to find \ngood health \ninformation\n9. Understand \nhealth information \nenough to know \nwhat to do\nES\n(95 % CI)\n0.01\n(−0.34 to 0.37)\n0.03\n(−0.32 to 0.38)\n−0.04\n(−0.39 to 0.32)\n0.10\n(−0.24 to 0.45)\n−0.28\n(−0.63 to −0.07)\n−0.02\n(−0.36 to 0.33)\n−0.02\n(−037 to 0.33)\n−0.24\n(−0.59 to 0.11)\n−0.20\n(−0.55 to 0.15)\nLong illness or disability\nYes\n Mean (SD) 2.97 (0.59) 3.13 (0.49) 2.90 (0.54) 3.22 (0.45) 2.80 (0.53) 3.99 (0.59) 3.73 (0.60) 4.04 (0.58) 3.98 (0.54)\nNo\nMean (SD) 2.92 (0.58) 2.94 (0.60) 2.74 (0.55) 3.02 (0.58) 2.67 (0.59) 3.98 (0.62) 3.63 (0.61) 3.92 (0.63) 3.93 (0.58)\nANOVA F = 2.23; 1, 474 df; \np = 0.136\nF = 13.95; 1, 473 \ndf; p = 0.000\nF = 8.85; 1, 640.6 \ndf; p = 0.003\nF = 17.78; 1, 475 \ndf; p = 0.000\nF = 6.47; 1, 473 \ndf; p = 0.011\nF = 0.02; 1, 473 \ndf; p = 0.900\nF = 2.58; 1, 467 \ndf; p = 0.109\nF = 4.32; 1, 470 \ndf; p = 0.038\nF = 0.96; 1, 471 df; \np = 0.328\nES\n(95 % CI)\n−0.14\n(−0.32 to 0.04)\n0.35\n(0.16 to 0.53)\n0.28\n(0.09 to 0.46)\n0.39\n(0.21 to 0.58)\n0.24\n(0.05 to 0.42)\n0.01\n(−0.17 to 0.19)\n0.15\n(−0.03 to 0.34)\n0.20\n(0.01 to 0.38)\n0.09\n(−0.09 to 0.28)\nSelf-rated health\nExcellent, very good\n Mean (SD) 3.06 (0.60) 3.17 (0.50) 2.94 (0.53) 3.26 (0.47) 2.84 (0.53) 4.05 (0.54) 3.79 (0.60) 4.10 (0.57) 4.04 (0.53)\nGood, less good, poor\n Mean (SD) 2.92 (0.58) 2.91 (0.60) 270 (0.55) 2.99 (0.54) 2.64 (0.57) 3.92 (0.60) 3.56 (0.61) 3.85 (0.62) 3.95 (0.58)\nANOVA F = 6.33; 1, 474 df; \np = 0.012\nF = 27.67; 1, 473 \ndf; p = 0.000\nF = 23.98; 1, 470 \ndf; p = 0.000\nF = 32.01; 1, 475 \ndf; p = 0.000\nF = 15.58; 1, 473 \ndf; p = 0.000\nF = 5.81; 1, 473 \ndf; p = 0.016\nF = 18.30; 1, 467 \ndf; p = 0.000\nF = 19.80; 1, 470 \ndf; p = 0.000\nF = 14.17; 1, 471 df; \np = 0.000\nES\n(95 % CI)\n0.23\n(0.05 to 0.41)\n0.49\n(0.30 to 0.67)\n0.45\n(0.27 to 0.64)\n0.52\n(0.34 to 0.70)\n0.36\n(0.18 to 0.55)\n0.22\n(0.04 to 0.40)\n0.40\n(0.21 to 0.58)\n0.41\n(0.23 to 0.60)\n0.35\n(0.17 to 0.53)\nES effect size\nPage 13 of 16\nMaindal et al. SpringerPlus  (2016) 5:1232 \nThe majority of the Danish HLQ items load highly on \ntheir respective factors and the scales have good reliabil -\nity. The fit of both single-factor and nine-factor models to \nthe data was generally good, indicating scale homogene -\nity. Further, scales 1–6 showed clear discriminant validity, \nwhile discriminant validity was not clearly established for \nscales 7–9. By allowing for small correlated item residu\n-\nals and cross-loadings the BSEM analysis showed inter-\nfactor correlations among scales 6–9 that were somewhat \nsmaller, however three remained >0.80 but ≤0.85. The \noverlap between scales 7–9 suggests that there may be \na higher-order factor or causal linkages determining the \nstronger association between the concepts measured by \nthese scales. Strong associations between these scales \nhave been noted in previous analyses of the English HLQ \n(Osborne et al. 2013). Scales 8 and 9 focus on the ability \nto locate (scale 8) and appraise (scale 9) health informa\n-\ntion, while scale 7 (health system navigation) may be seen \nas a closely linked outcome of these abilities.\nEvery item clearly loaded on its own factor, with only \nthree of the 44 items loading <0.6. Given that every scale \ncomprised only four, five or six items, this demonstrates \nparsimony: that is, a minimum number of items are \nadministered to respondents to reliably capture the full \nbreadth of the intended constructs (Boyle 1991). Many \nquestionnaires achieve high reliability through the inclu\n-\nsion of large numbers of items, or of items that have only \nminor linguistic differences and conceptual redundancy \n(Boyle 1991). In the Danish HLQ, only one scale had \nreliability below our nominal 0.8 cut-off: 5. ‘ Appraisal of \nhealth information’ (0.77). This scale included the most \ndifficult items and asked respondents about a range of \nchallenging tasks such as comparing, checking up and \nfinding out about information. These concepts are high \nin Bloom’s taxonomy (Krathwohl 2002; Amer 2006) and \nare likely to be more difficult for respondents to attend \nto and process successfully. Thus respondents may have \nfound it challenging to judge their own critical appraisal \nability, and this possibly contributed to the lower, but \nacceptable, reliability of the scale.\nThe wide ranging difficulty of items within a scale was \nan important and deliberate step in the development \nof the HLQ as it is intended to make the questionnaire \nsensitive to small differences at both the low score (e.g., \nstrongly disagree or cannot do) and high score (e.g., \nstrongly agree or very easy) ends of the scales. The abil\n-\nity to measure differences between subgroups was dem -\nonstrated in a recent study that used two of the scales \nfrom the Danish HLQ (scales 6 and 9—the understand\n-\ning and engagement dimensions of health literacy) \n(Bo et  al. 2014). The response options were slightly dif\n-\nferent because the extreme cannot do category in this \ngeneral survey was omitted. However, the estimates \nclearly pointed out that 8–20  % of the Danish popu\n-\nlation have difficulties with these two dimensions of \nhealth literacy. Further, the study showed that the elderly, \nimmigrants, those with limited formal education, and \nlow-income groups were more likely to have limited \nhealth literacy skills. The findings are in line with Dutch \nresults using the European Health Literacy Survey, where \nhaving a low level of education, or a low perceived social \nstatus, or being male were found to be modestly related \nto low health literacy scores, mainly for accessing and \nunderstanding health information (van der Heide et  al. \n2013).\nThe HLQ scales were related to the sociodemographic \nsubgroups in our sample in reasonably expected ways. \nWhile the items were written specifically to avoid poten\n-\ntial bias in gender, age and education, the data indicated \nthat women were slightly better than men in their ability \nto find good information, however differences were not \nobserved in other domains. Younger people (<65  years), \ncompared with older people (≥ 65  years), reported more \n‘Social support for health’ (scale 4), probably related to \nisolation in older people. As expected, education was \nclearly related to health literacy, but primarily in those \nHLQ domains with content covering finding and pro\n-\ncessing information (scales 2, 5, 7, 8 and 9) and not with \ndomains related to feeling understood or engaging with \nhealth care professionals (scales 1, 3 and 6). In previous \nresearch we have seen language variables, such as the lan\n-\nguage spoken at home, to be strongly related to health lit-\neracy (Beauchamp et al. 2015). In the current study, with \n93 % having Danish as their mother tongue and where no \nquestionnaires were offered in other languages, almost \nno association between language and health literacy was \nobserved. Only a small effect was observed for the scale \nwith content requiring the highest language skills, 5. \n‘ Appraisal of health information’ , where those without \nDanish reported slightly higher scores. It is possible that \nthis small group included nationalised professionals, how\n-\never future studies need to explore this in more detail.\nHaving a long term illness or disability was moder -\nately and positively related to several health literacy \ndomains. This is consistent with the notion that health \nliteracy develops in individuals as they gain experience \nwith managing illnesses, working with practitioners over \nmany years, and through overcoming information bar\n-\nriers (Paasche-Orlow and Wolf 2007). Finally, we expect \nthat good health literacy is a determinant, antecedent or \nconsequence of good health (Paasche-Orlow and Wolf \n2007; Berkman et al. 2011; Batterham et al. 2016). Con\n-\nsequently, we observe this pattern through all nine HLQ \ndomains positively related to self-rated health.\nPage 14 of 16Maindal et al. SpringerPlus  (2016) 5:1232 \nStrengths and limitations\nIt is intended that the HLQ can be used in diverse set -\ntings, and with people with broad-reaching sociodemo -\ngraphic profiles and various health conditions. A strength \nof this study is that the validation sample was drawn \nfrom communities across a wide range of locations, with \nan array of health conditions, and who were young and \nold. The face-to-face administration of the questionnaire \nensured a high participation rate, particularly from peo\n-\nple with limited reading and writing abilities who usually \nare excluded from taking part in questionnaire studies.\nThere are several indications that the Danish HLQ \nhas good psychometric properties. The use of mod\n-\nern psychometric procedures permitted the applica -\ntion of highly demanding tests, and the analysis has \nclearly shown that the HLQ multi-dimensional con\n-\nstruct of health literacy comprises nine separate and \ncogent scales. A nine-factor CFA model demonstrated \ngood construct validity. A model with no residual cor\n-\nrelations or cross-loadings was an acceptable fit to the \ndata while a very good fit was achieved with a BSEM \nanalysis that allowed modest correlated residuals and \ncross-loadings.\nThe stringent linguistic, cultural and measurement \nadaptation procedures are likely to have contributed \nto the strong psychometric performance of the Danish \nHLQ. This procedure includes an extensive item intent \ndocument that explains what the elements of indi\n-\nvidual items mean and do not mean. This document, \nalong with the intensive translation consensus meet\n-\ning, ensures the translators are supported to capture the \nprecise meaning, context, difficulty, and measurement \njuxtaposition of one item with other items within each \nscale.\nA strength of the HLQ is that it has sensitivity to group \ndifferences related to illness or disability, and self-rated \nhealth. This has also been demonstrated in other settings \n(Beauchamp et al. 2015; Zhang et al. 2016; Vamos et al. \n2016). While it is important that differences between \ngroups are demonstrated, research needs to be done to \ndemonstrate sensitivity to change. This issue is being \naddressed in a range of ongoing intervention studies \nwhere the HLQ is part of the assessments of a range of \noutcomes (Batterham et al. 2014; Livingston et al. 2014; \nRedfern et  al. 2014; Banbury et  al. 2014; Barker et  al. \n2015; Griva et al. 2015).\nAnother possible limitation that needs further investi\n-\ngation is the somewhat high inter-correlations between \nDanish HLQ scales 7, 8 and 9. These data suggest that \nthere may be a lack of discriminant validity between \nthese scales; however, this may also be explained by \nhigher-order models and causal relationships between \nthese constructs. This provides guidance for further \nwork, particularly in exploring how the scales respond, \nwith careful exploration of rates of change (or no change) \nover time.\nFinally, this study only explored administration of the \nHLQ in face-to-face interviews. This is a strength of the \nstudy because it overcomes illiteracy of respondents, but \nfuture work should continue to explore other modes of \nadministration including self-administered written for\n-\nmats, and confirm whether the HLQ produces valid \ninformation that results in improved services across the \nDanish society.\nConclusion\nIn conclusion, this study demonstrates that the Dan -\nish HLQ has strong construct and content validity, \nand high composite reliability. As such, the HLQ is \nnow available for application in Denmark with nine \nscales providing a robust multi-dimensional approach \nto understanding health literacy. It is incumbent on \nthe developers of questionnaires to demonstrate the \nmeasurement properties of new questionnaires, and \nthat the data they return to consumers, practitioners, \npolicymakers and researchers provide valid inferences \nand are reliable. The findings of this study may be an \nimportant contribution to health literacy research, \nand the data support the web of evidence of measure\n-\nment validity of the interpretation of HLQ scores for \nuse in national and international population health and \nhealthcare.\nAbbreviations\nBSEM: Bayesian structural equation modelling; CFA: confirmatory factor analy-\nsis; CFI: comparative fit index; CI: confidence interval; HLQ: Health Literacy \nQuestionnaire; HLS-EU: European Health Literacy Survey; IQR: inter quartile \nrange; MI: modification indices; RMSEA: root mean square error of approxima-\ntion; SD: standard deviation; SEPC: standardised expected parameter change; \nTLI: Tucker–Lewis index; WLSMV: weighted least squares mean and variance \nadjusted.\nAuthors’ contributions\nHTM, RHO and GE conceived the research question. ON, HTM, LK and RHO \nundertook the translation and cultural adaption. HTM, ON and LK were \nresponsible for data collection and HTM was responsible for the data manage-\nment. HTM, AB, RHO and GE analysed and interpreted the data. HTM and RHO \nproduced the initial draft of the manuscript. All authors read and approved \nthe final manuscript.\nAuthor details\n1 Department of Public Health, Section of Health Promotion and Health Ser-\nvices Research, Aarhus University, Bartholins Alle 2, 8000 Aarhus C, Denmark. \n2 Steno Diabetes Center, Health Promotion Research, Gentofte, Denmark. \n3 Department of Public Health, University of Copenhagen, Copenhagen, \nDenmark. 4 Research and Knowledge Centre, Danish Veteran Centre, Ringsted, \nDenmark. 5 Health Systems Improvement Unit, Deakin University Centre \nfor Population Health Research, School of Health and Social Development, \nGeelong, VIC, Australia. \nAcknowledgements\nOur appreciation goes to individuals responding to the questionnaire, and the \nlocal sites for helping with recruitment. We express sincere thanks to Kirsten \nPage 15 of 16\nMaindal et al. SpringerPlus  (2016) 5:1232 \nVinther-Jensen who conducted cognitive interviews and helped with data \ncollection, and to Karin Rosenkilde Laursen, who chaired the students that \nconducted interviews.\nCompeting interests\nThe authors declare that they have no competing interests.\nFunding\nThe Danish Strategic Research Council has funded the translation process and \nON as part of the project Experience-oriented Sharing of health knowledge \nvia Information and Communication Technology (ESICT). RHO received a \nGrant from the Nordea Foundation to work in Denmark in the period May to \nAugust 2012 to chair the translation process. RHO is a recipient of an Austral-\nian National Health and Medical Research Council Senior Research Fellowship \n#1059122. Three of the six students that conducted the interviews were partly \nemployed by an unrestricted research Grant given to HTM from the pharma-\nceutical company MSD Denmark.\nReceived: 7 January 2016   Accepted: 20 July 2016\nReferences\nAmer A (2006) Reflections on Bloom’s revised taxonomy. Electron J Res Ed \nPsychol 4:213–230\nBanbury A, Parkinson L, Nancarrow S et al (2014) Multi-site videoconferencing \nfor home-based education of older people with chronic conditions: the \nTelehealth Literacy Project. J Telemed Telecare 20:353–359. doi:10.1177/1\n357633X14552369\nBarker AL, Cameron PA, Hill KD et al (2015) RESPOND—a patient-centred \nprogramme to prevent secondary falls in older people presenting to the \nemergency department with a fall: protocol for a multicentre randomised \ncontrolled trial. Inj Prev 21:e1. doi:10.1136/injuryprev-2014-041271\nBatterham RW, Buchbinder R, Beauchamp A et al (2014) The OPtimising \nHEalth LIterAcy (Ophelia) process: study protocol for using health literacy \nprofiling and community engagement to create and implement health \nreform. BMC Public Health 14:694. doi:10.1186/1471-2458-14-694\nBatterham RW, Hawkins M, Collins PA et al (2016) Health literacy: applying cur-\nrent concepts to improve health services and reduce health inequalities. \nPublic Health 132:3–12. doi:10.1016/j.puhe.2016.01.001\nBeauchamp A, Buchbinder R, Dodson S et al (2015) Distribution of health \nliteracy strengths and weaknesses across socio-demographic groups: \na cross-sectional survey using the Health Literacy Questionnaire (HLQ). \nBMC Public Health 15:678. doi:10.1186/s12889-015-2056-z\nBerkman ND, Sheridan SL, Donahue KE et al (2011) Low health literacy and \nhealth outcomes: an updated systematic review. Ann Intern Med \n155:97–107. doi:10.7326/0003-4819-155-2-201107190-00005\nBo A, Friis K, Osborne RH, Maindal H (2014) National indicators of health \nliteracy: ability to understand health information and to engage actively \nwith healthcare providers—a population-based survey among Danish \nadults. BMC Public Health 14:1095. doi:10.1186/1471-2458-14-1095\nBoyle GJ (1991) Does item homogeneity indicate internal consistency or \nitem redundancy in psychometric scales? Pers Individ Differ 12:291–294. \ndoi:10.1016/0191-8869(91)90115-R\nBrown TA (2006) Confirmatory factor analysis for applied research. Guildford \nPress, New York\nBrowne MW, Cudeck R (1993) Alternative ways of assessing model fit. In: Bollen \nKA, Long JS (eds) Testing structural equation models. Sage, Newbury Park, \nCA, pp 136–162\nBuchbinder R, Batterham R, Elsworth G et al (2011) A validity-driven approach \nto the understanding of the personal and societal burden of low back \npain: development of a conceptual and measurement model. Arthritis \nRes Ther 13:R152. doi:10.1186/ar3468\nDeakin University (2016) The Ophelia approach. http://www.ophelia.net.au. \nAccessed 11 June 2016\nGriva K, Mooppil N, Khoo E et al (2015) Improving outcomes in patients with \ncoexisting multimorbid conditions—the development and evaluation of \nthe combined diabetes and renal control trial (C-DIRECT): study protocol. \nBMJ Open 5:e007253–e007253. doi:10.1136/bmjopen-2014-007253\nGuillemin F, Bombardier C, Beaton D (1993) Cross-cultural adaptation of \nhealth-related quality of life measures: literature review and proposed \nguidelines. J Clin Epidemiol 46:1417–1432\nHaun J, McCormack L, Valerio M, Sorensen K (2014) Health literacy measure-\nment: an inventory and descriptive summary of 52 instruments. J Health \nCommun. doi:10.1080/10810730.2014.936571\nHawkins M, Osborne R (2010) Questionnaire translation and cultural adapta-\ntion procedure. Deakin University, Burwood\nHLS-EU Consortium (2012) Comparative report on health literacy in eight EU \nmember states: the European Health Literacy Survey (HLS-EU). The Euro-\npean Health Literacy Project Consortium (HLS-EU Consortium), Maastrict\nKenny DA, McCoach DB (2003) Effect of the number of variables on measures \nof fit in structural equation modeling. Struct Equ Model A Multidiscip J \n10:333–351. doi:10.1207/S15328007SEM1003_1\nKickbusch I, Pelikan JM, Apfel F, Tsouros AD (2013) Health literacy: the solid \nfacts. WHO Regional Office for Europe, Copenhagen\nKoller M, Aaronson NK, Blazeby J et al (2007) Translation procedures for \nstandardised quality of life questionnaires: The European Organisation \nfor Research and Treatment of Cancer (EORTC) approach. Eur J Cancer \n43:1810–1820. doi:10.1016/j.ejca.2007.05.029\nKrathwohl DR (2002) A revision of Bloom’s taxonomy: an overview. Theory \nPract 41:212–218. doi:10.1207/s15430421tip4104_2\nLivingston PM, Osborne RH, Botti M et al (2014) Efficacy and cost-effectiveness \nof an outcall program to reduce carer burden and depression among car-\ners of cancer patients [PROTECT]: rationale and design of a randomized \ncontrolled trial. BMC Health Serv Res 14:5. doi:10.1186/1472-6963-14-5\nMarsh HW, Lüdtke O, Muthén B et al (2010) A new look at the big five factor \nstructure through exploratory structural equation modeling. Psychol \nAssess 22:471–491. doi:10.1037/a0019227\nMårtensson L, Hensing G (2012) Health literacy—a heterogeneous \nphenomenon: a literature review. Scand J Caring Sci 26:151–160. \ndoi:10.1111/j.1471-6712.2011.00900.x\nMuthén B, Asparouhov T (2012) Bayesian structural equation modeling: a \nmore flexible representation of substantive theory. Psychol Methods \n17:313–335. doi:10.1037/a0026802\nNorgaard O, Sorensen K, Maindal HT, Kayser L (2014) Measuring health literacy \ncan improve communication in health care. Ugeskr Laeger 176:37–39\nNutbeam D (2000) Health literacy as a public health goal: a challenge for con-\ntemporary health education and communication strategies into the 21st \ncentury. Health Promot Int 15:259–267. doi:10.1093/heapro/15.3.259\nOsborne RH, Batterham RW, Elsworth GR et al (2013) The grounded psycho-\nmetric development and initial validation of the Health Literacy Ques-\ntionnaire (HLQ). BMC Public Health 13:658. doi:10.1186/1471-2458-13-658\nPaasche-Orlow MK, Wolf MS (2007) The causal pathways linking health \nliteracy to health outcomes. Am J Health Behav 31(Suppl 1):S19–S26. \ndoi:10.5555/ajhb.2007.31.supp.S19\nProtheroe J, Nutbeam D, Rowlands G (2009) Health literacy: a necessity \nfor increasing participation in health care. Br J Gen Pract 59:721–723. \ndoi:10.3399/bjgp09X472584\nRaykov T (2007) Reliability if deleted, not “alpha if deleted”: evaluation of \nscale reliability following component deletion. Br J Math Stat Psychol \n60:201–216. doi:10.1348/000711006X115954\nRaykov T, Marcoulides GA (2011) Classical item analysis using latent variable \nmodeling: a note on a direct evaluation procedure. Struct Equ Model A \nMultidiscip J 18:315–324. doi:10.1080/10705511.2011.557347\nRedfern J, Usherwood T, Harris MF et al (2014) A randomised controlled trial of \na consumer-focused e-health strategy for cardiovascular risk manage-\nment in primary care: the Consumer Navigation of Electronic Cardiovas-\ncular Tools (CONNECT) study protocol. BMJ Open 4:e004523. doi:10.1136/\nbmjopen-2013-004523\nSorensen K, Norgaard O, Maindal HT (2014) Need for more research in patients’ \nhealth literacy. Ugeskr Laeger 176:40–43\nSørensen K, van den Broucke S, Fullam J et al (2012) Health literacy and public \nhealth: a systematic review and integration of definitions and models. \nBMC Public Health 12:80. doi:10.1186/1471-2458-12-80\nVamos S, Yeung P , Bruckermann T et al (2016) Exploring health literacy \nprofiles of Texas university students. Heal Behav Policy Rev 3:209–225. \ndoi:10.14485/HBPR.3.3.3\nvan der Heide I, Rademakers J, Schipper M et al (2013) Health literacy of \nDutch adults: a cross sectional survey. BMC Public Health 13:179. \ndoi:10.1186/1471-2458-13-179\nPage 16 of 16Maindal et al. SpringerPlus  (2016) 5:1232 \nWest SG, Taylor AB, Wu W (2012) Model fit and model selection in structural \nequation modeling. In: Hoyle RH (ed) Handbook of structural equation \nmodeling. Guilford Press, New York, pp 209–231\nWild D, Grove A, Martin M et al (2005) Principles of good practice for the trans-\nlation and cultural adaptation process for patient-reported outcomes \n(PRO) measures: report of the ISPOR task force for translation and cultural \nadaptation. Value Health 8:94–104. doi:10.1111/j.1524-4733.2005.04054.x\nWillis GB (1999) Cognitive interview. A “how to” guide. Research Triangle Insti-\ntute, Research Triangle Park\nWorld Health Organization (1998) Health promotion glossary. World Health \nOrganization, Geneva\nYu CY (2002) Evaluating cut-off criteria of model fit indices for latent variable \nmodels with binary and continuous outcomes. Los Angeles, CA\nZhang Y, Zhang F, Hu P et al (2016) Exploring health literacy in medical uni-\nversity students of Chongqing, China: a cross-sectional study. PLoS One \n11:e0152547. doi:10.1371/journal.pone.0152547",
  "topic": "Confirmatory factor analysis",
  "concepts": [
    {
      "name": "Confirmatory factor analysis",
      "score": 0.673445463180542
    },
    {
      "name": "Health literacy",
      "score": 0.6430145502090454
    },
    {
      "name": "Danish",
      "score": 0.6199582815170288
    },
    {
      "name": "Medicine",
      "score": 0.476312518119812
    },
    {
      "name": "Adaptation (eye)",
      "score": 0.4741974472999573
    },
    {
      "name": "Dimension (graph theory)",
      "score": 0.45742499828338623
    },
    {
      "name": "Literacy",
      "score": 0.4555966854095459
    },
    {
      "name": "Computer science",
      "score": 0.39437544345855713
    },
    {
      "name": "Psychology",
      "score": 0.28075268864631653
    },
    {
      "name": "Machine learning",
      "score": 0.18778225779533386
    },
    {
      "name": "Structural equation modeling",
      "score": 0.1764368712902069
    },
    {
      "name": "Health care",
      "score": 0.12145444750785828
    },
    {
      "name": "Linguistics",
      "score": 0.10807675123214722
    },
    {
      "name": "Economics",
      "score": 0.0
    },
    {
      "name": "Pure mathematics",
      "score": 0.0
    },
    {
      "name": "Neuroscience",
      "score": 0.0
    },
    {
      "name": "Pedagogy",
      "score": 0.0
    },
    {
      "name": "Economic growth",
      "score": 0.0
    },
    {
      "name": "Philosophy",
      "score": 0.0
    },
    {
      "name": "Mathematics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I204337017",
      "name": "Aarhus University",
      "country": "DK"
    },
    {
      "id": "https://openalex.org/I124055696",
      "name": "University of Copenhagen",
      "country": "DK"
    },
    {
      "id": "https://openalex.org/I149704539",
      "name": "Deakin University",
      "country": "AU"
    }
  ]
}