{
  "title": "Tie-breaker: Using language models to quantify gender bias in sports journalism",
  "url": "https://openalex.org/W2491733261",
  "year": 2022,
  "authors": [
    {
      "id": "https://openalex.org/A2266412389",
      "name": "Fu Liye",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A4290221372",
      "name": "Danescu-Niculescu-Mizil, Cristian",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A4288524351",
      "name": "Lee, Lillian",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2011404061",
    "https://openalex.org/W1993779339",
    "https://openalex.org/W2505191071",
    "https://openalex.org/W1573788826",
    "https://openalex.org/W1547870421",
    "https://openalex.org/W2092262981",
    "https://openalex.org/W2089478583",
    "https://openalex.org/W2145966799",
    "https://openalex.org/W2145996244",
    "https://openalex.org/W1970564707",
    "https://openalex.org/W2143209442",
    "https://openalex.org/W1965892432",
    "https://openalex.org/W1980494983",
    "https://openalex.org/W1485189459",
    "https://openalex.org/W2048945236",
    "https://openalex.org/W2039337535",
    "https://openalex.org/W2016489455"
  ],
  "abstract": "Gender bias is an increasingly important issue in sports journalism. In this work, we propose a language-model-based approach to quantify differences in questions posed to female vs. male athletes, and apply it to tennis post-match interviews. We find that journalists ask male players questions that are generally more focused on the game when compared with the questions they ask their female counterparts. We also provide a fine-grained analysis of the extent to which the salience of this bias depends on various factors, such as question type, game outcome or player rank.",
  "full_text": "Tie-breaker: Using language models to quantify gender bias in sports journalism\nLiye Fu and Cristian Danescu-Niculescu-Mizil and Lillian Lee\nCornell University\nliye@cs.cornell.edu cristian@cs.cornell.edu llee@cs.cornell.edu\nAbstract\nGender bias is an increasingly important issue in\nsports journalism. In this work, we propose a\nlanguage-model-based approach to quantify differ-\nences in questions posed to female vs. male ath-\nletes, and apply it to tennis post-match interviews.\nWe ﬁnd that journalists ask male players questions\nthat are generally more focused on the game when\ncompared with the questions they ask their female\ncounterparts. We also provide a ﬁne-grained anal-\nysis of the extent to which the salience of this bias\ndepends on various factors, such as question type,\ngame outcome or player rank.\n1 Introduction\nThere has been an increasing level of attention to and dis-\ncussion of gender bias in sports, ranging from differences\nin pay and prize money 1 to different levels of focus on off-\ncourt topics in interviews by journalists. With respect to the\nlatter, Cover the Athlete, 2 an initiative that urges the media\nto focus on sport performance, suggests that female athletes\ntend to get more “sexist commentary” and “inappropriate in-\nterview questions” than males do; the organization put out\nan attention-getting video in 2015 purportedly showing male\nathletes’ awkward reactions to receiving questions like those\nasked of female athletes. However, it is not universally ac-\nknowledged that female athletes attract more attention for\noff-court activities. For instance, a manual analysis by Kian\net al. [2009] of online articles revealed signiﬁcantly more\ndescriptors associated with the physical appearance and per-\nsonal lives of male basketball players in comparison to female\nones.\nTranscripts of pre- or post-game press conferences offer an\nopportunity to determine quantitatively and in a data-driven\nmanner how different are the questions which journalists\npose to male players from those they pose to female players.\nHere are examples of a game-related and a non-game-relevant\nquestion, respectively, drawn from actual tennis interviews:\n1“U.S. Women, Fighting for Equal Pay, Win Easily as\nFans Show Support”, The New York Times , April 6, 2016.\nhttp://www.nytimes.com/2016/04/07/sports/soccer/uswnt-\ncolombia-friendly-equal-pay-complaint .html\n2http://covertheathlete.com/\n1. What happened in that ﬁfth set, the ﬁrst three games?\n2. After practice, can you put tennis a little bit behind you\nand have dinner, shopping, have a little bit of fun?\nTo quantify gender discrepancies in questions, we propose\na statistical language-model-based approach to measure how\ngame-related questions are. In order to make such an ap-\nproach effective, we restrict our attention in this study to a\nsingle sport—tennis—so that mere variations in the lingo of\ndifferent sports do not introduce extra noise in our language\nmodels. Tennis is also useful for our investigation because, as\nKian and Clavio [2011] noted, it “marks the only professional\nsports where male and female athletes generally receive sim-\nilar amounts of overall broadcast media coverage during the\nmajor tournaments.”\nUsing our methodology, we are able to quantify gender\nbias with respect to how game-related interview questions\nare. We also provide a more ﬁne-grained analysis of how gen-\nder differences in journalistic questioning are displayed under\nvarious scenarios. To help with further analysis of interview\nquestions and answers, we introduce a dataset of tennis post-\nmatch interview transcripts along with corresponding match\ninformation.3\n2 Related Work\nIn contrast with our work, prior investigations of bias in sport\njournalism rely on manual coding or are based on simple\nlists of manually deﬁned keywords. These focus on bias\nwith respect to race, nationality, and gender [Rainville and\nMcCormick, 1977; Sabo et al., 1996; Eastman and Billings,\n2001; Bruce, 2004; Billings, 2008; Kian and Clavio, 2011;\nLiˇcen and Billings, 2013]; see Van Sterkenburg et al. [2010]\nfor a review.\nMuch of the work on gender bias in sports reporting\nhas focused on “air-time” [Eastman and Billings, 2000;\nHiggs et al., 2003]. Other studies looked at stereotypical de-\nscriptions and framing [Messner et al. , 1993; Jones, 2004;\nAngelini and Billings, 2010; Kian et al., 2009]. For surveys,\nsee Knight and Giuliano [2001] or Kaskan and Ho [2014],\ninter alia. Several studies have focused on the particular case\nof gender-correlated differences in tennis coverage [Hilliard,\n3Dataset available at http://www.cs.cornell.edu/˜liye/\ntennis.html\narXiv:1607.03895v1  [cs.CL]  13 Jul 2016\n1984; Vincent et al., 2007; Kian and Clavio, 2011 ]. We ex-\ntend this line of work by proposing an automatic way to quan-\ntify gender bias in sport journalism.\n3 Dataset Description\nWe collect tennis press-conference transcripts from ASAP\nSport’s website ( http://www.asapsports.com/),\nwhose tennis collection dates back to 1992 and is still\nupdated for current tournaments. For our study, we take post-\ngame interviews for tennis singles matches played between\nJan, 2000 to Oct 18, 2015. We also obtain easily-extractable\nmatch information from a dataset provided by Tennis-Data, 4\nwhich covers the majority of the matches played on the\nmen’s side from 2000-2015 and on the women’s side from\n2007-2015.\nWe match interview transcripts with game statistics by date\nand player name, keeping only the question and answer pairs\nfrom games where the statistics are successfully merged. This\ngives us a dataset consisting of 6467 interview transcripts and\na total of 81906 question snippets5 posed to 167 female play-\ners and 191 male players.\nTo model tennis-game-speciﬁc language, we use live text\nplay-by-play commentaries collected from the website Sports\nMole (http://www.sportsmole.co.uk/). These tend\nto be short, averaging around 40 words. Here is a sample,\ntaken from the Federer-Murray match at the 2015 Wimbledon\nsemi-ﬁnal:6\n“The serve-and-volley is being used frequently by\nFederer and it’s enabling him to take control behind\nhis own serve. Three game points are earned before\nan ace down the middle seal [sic] the love hold.”\nFor our analysis, we create a gender-balanced set of com-\nmentaries consisting of descriptions for 1981 games played\nfor each gender.\n4 Method\nAs a preliminary step, we apply a word-level analysis to un-\nderstand if there appear to be differences in word usage when\njournalists interview male players compared to female play-\ners. We then introduce our method for quantifying the degree\nto which a question is game-related, which we will use to ex-\nplore gender differences.\n4.1 Preliminary Analysis\nTo compare word usage in questions, we consider, for each\nword w, the percentage of players who have ever been asked\na question containing w. We then consider words with the\ngreatest difference in percentage between male and female\n4http://www.tennis-data.co.uk/\n5Each snippet represents one turn from one journalist. Most\nquestion snippets contain at least one question, although some could\nbe merely clariﬁcations or comments. Note that reporter information\n(who asked which question) is not available in the transcript.\n6http://www.sportsmole.co.uk/tennis/wimbledon/live-\ncommentary/live-commentary-roger-federer-vs-andy-murray-\nas-it-happened 232822.html\nplayers.7 The top distinguishing words, which are listed be-\nlow in descending order of percentage difference, seem to\nsuggest that questions journalists pose to male players are\nmore game-related:\nMale players: clay, challenger(s), tie, sets, practiced,\ntiebreaker, maybe, see, impression, serve, history, vol-\nley, chance, height, support, shots, server(s), greatest,\nway, tiebreaks, tiebreakers, era, lucky, luck;8\nFemale players: yet, new, nervous, improve, seed, friends,\nnerves, mom, every, matter, become, meet, winning,\ntype, won, draw, found, champion, stop, ﬁght, wind,\nthough, father, thing, love.\n4.2 Game Language Model\nTo quantify how game-related a question is in a data-driven\nfashion, we train a bigram language model using KenLM 9\n[Heaﬁeld et al., 2013] on the gender-balanced set of live-text\nplay-by-play commentaries introduced in Section 3.\nFor an individual question q, we measure its perplexity\nPP (q) with respect to this game language model Pcommentary\nas an indication of how game-related the question is: the\nhigher the perplexity value, the less game-related the ques-\ntion. Perplexity, a standard measure of language-model ﬁt\n[Jelinek et al. , 1977 ], is deﬁned as follows for an N-word\nsequence w1w2 . . . wN:\nPP (w1w2...wN) = N\n√\n1\nPcommentary(w1 ···wN) .\nBelow are some sample questions of low-perplexity and high-\nperplexity values:\nPerplexity Sample Questions\nLow What about your serve, Rafa?\nThe tiebreak, was that the key to the match?\nHigh Who designed your clothes today?\nDo you normally watch horror ﬁlms to relax?\n5 Experiments\nIn this section we use the game language model to quantify\ngender-based bias in questions. We then compare the extent\nto which this difference depends of various factors, such as\nquestion type, game outcome, or player rank.\n5.1 Main Result: Males vs. Females\nWe ﬁrst compute perplexities for each individual question 10\nand then group the question instances according to the inter-\n7Words that are gender-speciﬁc (like ‘her’) are manually dis-\ncarded.\n8It is interesting, but beyond the scope of this paper, to speculate\non reasons why “luck” and “lucky” skew so strongly male.\n9KenLM (https://kheafield.com/code/kenlm/) estimates lan-\nguage models using modiﬁed Kneser-Ney smoothing without prun-\ning.\n10We identify individual questions simply by looking for ‘?’.\nviewee’s gender class. Throughout we use the Mann-Whitney\nU statistical signiﬁcance test,11 unless otherwise noted.\nComparing perplexity values between the two groups, we\nﬁnd that the mean perplexity of questions posed to male play-\ners is signiﬁcantly smaller ( p-value <0.001) than that of\nquestions posed to female players. This suggests that the\nquestions male athletes receive are more game-related.\nHowever, the number of interviews each player participates\nin varies greatly, with highly interviewed players answering\nas many as thousands of questions while some lesser-known\nplayers have fewer than 10 interview questions in the dataset.\nThus it is conceivable that the difference is simply explained\nby questions asked to a few proliﬁc players. To test whether\nthis is the case, or whether the observation is more general,\nwe micro-average the perplexities by player: for each of the\n167 male players and 143 females who have at least 10 ques-\ntions in our dataset, we consider the average perplexities of\nthe questions they receive. Comparing these micro-averages,\nwe ﬁnd that it is still the case that questions posed to male\nplayers are signiﬁcantly closer to game language ( p-value <\n0.05), indicating that the observed gender difference is not\nsimply explained by a few highly interviewed players.\n5.2 Relation to Other Factors\nWe further investigate how the level of gender bias is tied to\ndifferent factors: how typical the question is (section 5.2.1),\nthe ranking of the player (section 5.2.2), and whether the\nplayer won or lost the match (section 5.2.3). For all the fol-\nlowing experiments, we use per-question perplexity for com-\nparisons: per-player perplexity is not used due to limited sam-\nple size.\n5.2.1 Typical vs. Atypical Questions\nOne might wonder whether the perplexity disparities we see\nin questions asked of female vs. male players are due to “off-\nthe-wall” queries, rather than to those that are more typical\nin post-match interviews. We therefore use a data-driven ap-\nproach to distinguish between typical and atypical questions.\nFor any given question, we consider how frequently its\nwords appear in post-match press conferences in general.\nSpeciﬁcally, we take the set of all questions as the set of doc-\numents, D. We compute the inverse document frequency for\neach word (after stemming) that has appeared in our dataset,\nexcluding the set S consisting of stop words and a special\ntoken for entity names. 12 For a question q that contains the\nset of unique words {w1, w2, ..., wN} /∈S, we compute its\natypicality score Sc(q) as:\nSc({w1, w2, ..., wN}) = 1\nN\nN∑\ni=1\nidf(wi, D) .\nWe use the overall mean atypicality score of the entire\nquestion dataset as the cutoff point: questions with scores\n11We used this non-parametric signiﬁcance test instead of the\nt-test because it doesn’t assume the samples to be normally dis-\ntributed.\n12We replace capitalized words and phrases with “ <NOUN>”;\nfor each word at the beginning of a sentence (which is always capi-\ntalized), we check whether it is a dictionary word.\nabove the overall mean are considered atypical and the rest\nare considered typical.13 Below are some examples:\nCategory Sample Questions\nTypical Have you played each other before?\nHow do you feel playing here?\nAtypical What about your haircut?\nAre you a vodka drinker?\nFigure 1 shows that a gender bias with respect to whether\ngame-related language is used exists for both typical and\natypical questions. However, additional analysis reveals that\nthe difference in mean perplexity values between genders is\nhighly statistically signiﬁcantly larger for atypical questions,\nsuggesting that gender bias is more salient among the more\nunusual queries.\nFigure 1: Mean perplexity values for male and female athletes\nafter grouping the questions by how typical they are. Stars\nindicate high statistical signiﬁcance (p <0.001) between the\nmale and female case. The male-female difference for the\natypical group is statistically signiﬁcantly larger than for the\ntypical group.\n5.2.2 Player Ranking\nHigher ranked players generally attract more media attention,\nand therefore may be targeted differently by journalists. To\nunderstand the effect of player ranking, we divide players into\ntwo groups: top 10 players and the rest. For our analysis, we\nuse the ranking of the player at the time the interview was\nconducted. (It is therefore possible that questions posed to\nthe same player but at different times could fall into different\nranking groups due to ranking ﬂuctuations over time.) We\nﬁnd that questions to male players are signiﬁcantly closer to\ngame language regardless of player ranking (p-value < 0.001,\nFigure 2).\nFurthermore, if we focus only on players who have ranked\nboth in and outside the top 10 in our dataset, and pair the\nquestions asked to them when they were higher-ranked to\nthe questions asked when their ranking was lower, we ﬁnd\nthat there is no signiﬁcant difference between questions asked\nto male athletes when they were in different ranking groups\n13Questions consisting only of stop words and player or tourna-\nment names are still considered typical questions, even though they\ndo not have an atypicality score.\nFigure 2: Mean perplexity values for male and female ath-\nletes after grouping the questions by the ranking of the player\nto which they are addressed. Stars indicate high statistical\nsigniﬁcance (p <0.001) between the male and female case.\n(Wilcoxon signed-rank p-value > 0.05). However, the differ-\nence is signiﬁcant for females (Wilcoxon signed-rankp-value\n< 0.01), suggesting that gender bias may be more salient for\nlower ranked players as questions to lower-ranked female ath-\nletes tend to be less game-related.\nWhile one might expect that star players would receive\nmore off-court questions (yielding higher perplexities), the\nperplexity values for questions posed to top 10 players are\nactually lower regardless of gender. This may be because the\ntraining data for our language model is more focused on spe-\nciﬁc points played in matches, and may not be representative\nof tennis-related questions that are more general (e.g., longer-\nterm career goals, personal records, injuries). In other words,\nour result suggests that journalists may attend more to the\nspeciﬁcs of the games of higher ranked players, posing more\nspeciﬁc questions about points played in the match during in-\nterviews.\n5.2.3 Winning vs. Losing\nWhile it is reasonable to expect that whether the intervie-\nwee won or lost would affect how game-related the questions\nare, the difference in mean perplexity for males and females\nconditioned on win/loss game outcome are comparable. In\naddition, for both male players and female players, there is\nno signiﬁcant difference observed between the paired set of\nquestions asked in winning interviews and the losing ones\n(Wilcoxon signed-rank p-value > 0.05), controlling for both\nplayer and season.14 This suggests that that game result may\nnot be a factor affecting how game-related the interview ques-\ntions are.\n6 Concluding discussion\nIn this work we propose a language-model based approach to\nquantify gender bias in the interview questions tennis players\nreceive. We ﬁnd that questions to male athletes are generally\n14We pair each question asked to a given player when winning\nto one question posed to the same player in the same calendar year\nwhen losing to construct the paired set of winning and losing ques-\ntions for each gender.\nmore game-related. The difference is more salient among the\nunusual questions in press conferences, and for lower-ranked\nplayers.\nHowever, this preliminary study has a number of limita-\ntions. We have considered only a single sport. In addition,\nour dataset does not contain any information about who asked\nwhich question, which makes us unable to control for any id-\niosyncrasies of speciﬁc journalists. For example, it is con-\nceivable that the disparities we observe are explained by dif-\nferences in the journalists that are assigned to conduct the\nrespective interviews.\nIn this work, we limit our scope to bias in terms of game-\nrelated language, not considering differences (or similarities)\nthat may exist in other dimensions. Further studies may use a\nsimilar approach to quantify and explore differences in other\ndimensions, by using language models speciﬁcally trained to\nmodel other domains of interests, which may provide a more\ncomprehensive view of how questions differ when targeting\ndifferent groups.\nFurthermore, our main focus is on questions asked dur-\ning press conferences; we have not looked at the players’\nresponses. The transcripts data, which we release publicly,\nmay provide opportunities for further studies.\nAcknowledgments\nWe thank the anonymous reviewers and the participants in the\nFall 2015 edition of the course “Natural Language Processing\nand Social Interaction” for helpful comments and discussion.\nThis research was supported in part by a Discovery and In-\nnovation Research Seed award from the Ofﬁce of the Vice\nProvost for Research at Cornell.\nReferences\n[Angelini and Billings, 2010] James R. Angelini and An-\ndrew C. Billings. An agenda that sets the frames: Gen-\nder, language, and NBC’s americanized olympic telecast.\nJournal of Language and Social Psychology, 2010.\n[Billings, 2008] Andrew C. Billings. Olympic media: Inside\nthe biggest show on television. Routledge, 2008.\n[Bruce, 2004] Toni Bruce. Marking the boundaries of the\n‘normal’ in televised sports: The play-by-play of race.Me-\ndia, Culture & Society, 26(6):861–879, 2004.\n[Eastman and Billings, 2000] Susan Tyler Eastman and An-\ndrew C. Billings. Sportscasting and sports reporting: The\npower of gender bias. Journal of Sport & Social Issues ,\n24(2):192–213, 2000.\n[Eastman and Billings, 2001] Susan Tyler Eastman and An-\ndrew C. Billings. Biased voices of sports: Racial and\ngender stereotyping in college basketball announcing.\nHoward Journal of Communication, 12(4):183–201, 2001.\n[Heaﬁeld et al., 2013] Kenneth Heaﬁeld, Ivan Pouzyrevsky,\nJonathan H. Clark, and Philipp Koehn. Scalable modiﬁed\nKneser-Ney language model estimation. InProceedings of\nthe ACL, pages 690–696, August 2013.\n[Higgs et al., 2003] Catriona T. Higgs, Karen H. Weiller, and\nScott B Martin. Gender bias in the 1996 olympic games:\nA comparative analysis. Journal of Sport & Social Issues,\n27(1):52–64, 2003.\n[Hilliard, 1984] Dan C. Hilliard. Media images of male and\nfemale professional athletes: An interpretive analysis of\nmagazine articles. Sociology of Sport Journal, 1:251–262,\n1984.\n[Jelinek et al., 1977] Fred Jelinek, Robert L. Mercer, Lalit R.\nBahl, and James K. Baker. Perplexity — a measure of the\ndifﬁculty of speech recognition tasks. The Journal of the\nAcoustical Society of America, 62(S1):S63–S63, 1977.\n[Jones, 2004] Dianne Jones. Half the story? Olympic women\non ABC news online. Media International Australia ,\n110(1):132–146, 2004.\n[Kaskan and Ho, 2014] Emily R. Kaskan and Ivy K. Ho.\nMicroaggressions and female athletes. Sex Roles, 74(7-\n8):275–287, 11 2014.\n[Kian and Clavio, 2011] Edward M. Kian and Galen Clavio.\nA comparison of online media and traditional newspaper\ncoverage of the men’s and women’s U.S. open tennis tour-\nnaments. Journal of Sports Media, 2011.\n[Kian et al., 2009] Edward (Ted) M. Kian, Mondello\nMichael, and Vincent John. ESPN — the women’s sports\nnetwork? a content analysis of internet coverage of March\nmadness. Journal of Broadcasting & Electronic Media ,\n53(3):477–495, 9 2009.\n[Knight and Giuliano, 2001] Jennifer L. Knight and Traci A.\nGiuliano. He’s a Laker; she’s a “looker”: The conse-\nquences of gender-stereotypical portrayals of male and fe-\nmale athletes by the print media. Sex Roles, 45(3-4):217–\n229, 2001.\n[Liˇcen and Billings, 2013] Simon Li ˇcen and Andrew C.\nBillings. Cheering for ‘our’ champs by watching ‘sexy’ fe-\nmale throwers: Representation of nationality and gender in\nSlovenian 2008 Summer Olympic television coverage.Eu-\nropean Journal of Communication, 28(4):379–396, 2013.\n[Messner et al., 1993] Michael A. Messner, Mar-\ngaret Carlisle Duncan, and Kerry Jensen. Separating\nthe men from the girls: The gendered language of\ntelevised sports. Gender & Society, 7(1):121–137, 1993.\n[Rainville and McCormick, 1977] Raymond E. Rainville\nand Edward McCormick. Extent of covert racial prejudice\nin pro football announcers’ speech. Journalism & Mass\nCommunication Quarterly, 54(1):20–26, 1977.\n[Sabo et al., 1996] Don Sabo, Sue Curry Jansen, Danny\nTate, Margaret Carlisle Duncan, and Susan Leggett. Tele-\nvising international sport: Race, ethnicity, and national-\nistic bias. Journal of Sport & Social Issues , 20(1):7–21,\n1996.\n[Van Sterkenburget al., 2010] Jacco Van Sterkenburg, An-\nnelies Knoppers, and Sonja De Leeuw. Race, ethnicity,\nand content analysis of the sports media: A critical reﬂec-\ntion. Media, Culture & Society, 32(5):819–839, 2010.\n[Vincent et al., 2007] John Vincent, Paul M. Pedersen, War-\nren A. Whisenant, and Dwayne Massey. Analysing\nthe print media coverage of professional tennis players:\nBritish newspaper narratives about female competitors in\nthe Wimbledon championships. International Journal of\nSport Management and Marketing, 2(3):281–300, 2007.",
  "topic": "Salience (neuroscience)",
  "concepts": [
    {
      "name": "Salience (neuroscience)",
      "score": 0.8731772303581238
    },
    {
      "name": "Ask price",
      "score": 0.6390000581741333
    },
    {
      "name": "Journalism",
      "score": 0.6300716400146484
    },
    {
      "name": "Gender bias",
      "score": 0.597396194934845
    },
    {
      "name": "Outcome (game theory)",
      "score": 0.5561001300811768
    },
    {
      "name": "Athletes",
      "score": 0.5524637699127197
    },
    {
      "name": "Psychology",
      "score": 0.49600204825401306
    },
    {
      "name": "Work (physics)",
      "score": 0.42719462513923645
    },
    {
      "name": "Rank (graph theory)",
      "score": 0.42206957936286926
    },
    {
      "name": "Social psychology",
      "score": 0.4107625186443329
    },
    {
      "name": "Cognitive psychology",
      "score": 0.28800907731056213
    },
    {
      "name": "Sociology",
      "score": 0.21693968772888184
    },
    {
      "name": "Media studies",
      "score": 0.20255684852600098
    },
    {
      "name": "Engineering",
      "score": 0.10141745209693909
    },
    {
      "name": "Economics",
      "score": 0.09919324517250061
    },
    {
      "name": "Medicine",
      "score": 0.09131675958633423
    },
    {
      "name": "Mathematics",
      "score": 0.08694973587989807
    },
    {
      "name": "Mathematical economics",
      "score": 0.07989150285720825
    },
    {
      "name": "Economy",
      "score": 0.0
    },
    {
      "name": "Physical therapy",
      "score": 0.0
    },
    {
      "name": "Combinatorics",
      "score": 0.0
    },
    {
      "name": "Mechanical engineering",
      "score": 0.0
    }
  ],
  "institutions": [],
  "cited_by": 29
}