{
    "title": "The Emergence of Tool Use in Preterm Infants",
    "url": "https://openalex.org/W2494875241",
    "year": 2016,
    "authors": [
        {
            "id": "https://openalex.org/A5078166564",
            "name": "Maja Petković",
            "affiliations": [
                "Institut Jacques Monod",
                "Université Paris Cité"
            ]
        },
        {
            "id": "https://openalex.org/A5086608002",
            "name": "Lauriane Rat‐Fischer",
            "affiliations": [
                "Université Paris Nanterre"
            ]
        },
        {
            "id": "https://openalex.org/A5048083490",
            "name": "Jacqueline Fagard",
            "affiliations": [
                "Laboratoire Psychologie de la Perception",
                "Laboratoire de Physique des Plasmas"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W4239731113",
        "https://openalex.org/W2167792110",
        "https://openalex.org/W1976241900",
        "https://openalex.org/W2018600823",
        "https://openalex.org/W1746890799",
        "https://openalex.org/W2093634982",
        "https://openalex.org/W1993814273",
        "https://openalex.org/W2072574874",
        "https://openalex.org/W2073982657",
        "https://openalex.org/W1856987485",
        "https://openalex.org/W2329927919",
        "https://openalex.org/W2094973121",
        "https://openalex.org/W2034308905",
        "https://openalex.org/W2489051105",
        "https://openalex.org/W1904139676",
        "https://openalex.org/W2120257947",
        "https://openalex.org/W2140190130",
        "https://openalex.org/W2134776603",
        "https://openalex.org/W2138652400",
        "https://openalex.org/W1965572903",
        "https://openalex.org/W2092222977",
        "https://openalex.org/W2286462227",
        "https://openalex.org/W2107357190",
        "https://openalex.org/W2017958767",
        "https://openalex.org/W2004001070",
        "https://openalex.org/W2029239795",
        "https://openalex.org/W4232064122",
        "https://openalex.org/W2049207494",
        "https://openalex.org/W2081289252",
        "https://openalex.org/W2038764349",
        "https://openalex.org/W2019084238",
        "https://openalex.org/W2128246617",
        "https://openalex.org/W1016911050",
        "https://openalex.org/W2002659740",
        "https://openalex.org/W2069676145",
        "https://openalex.org/W1983192291",
        "https://openalex.org/W1972953070",
        "https://openalex.org/W4243776133",
        "https://openalex.org/W2087399490",
        "https://openalex.org/W2158698668",
        "https://openalex.org/W4249180569",
        "https://openalex.org/W1963887364",
        "https://openalex.org/W1985905477",
        "https://openalex.org/W2038446937",
        "https://openalex.org/W2073620241",
        "https://openalex.org/W1979799526"
    ],
    "abstract": "Preterm born children without neurological impairments have been shown to present some visual-manual coordination deficits, more or less depending on their tonicity and the degree of prematurity. In this paper, we compare the development of tool use in 15-23-month-old preterm infants born after 33-36 weeks of gestation without neurological complications with that of full-term infants according to corrected age. Understanding the affordance of a tool is an important cognitive milestone in early sensorimotor period. Using a tool to bring within reach an out-of-reach object, for instance, has been shown to develop during the 2nd year in full-term infants. Here we presented preterm infants with an attractive toy out of reach and with a rake-like tool within reach in five conditions of spatial relationships between the toy and the tool. Like full-terms, preterm infants used the tool with success in conditions of spatial contiguity around 15-17 months. In conditions of a spatial gap between tool and toy, i.e., the only conditions which shows without ambiguity that the infant understands the affordance of the tool, preterm infants as a group showed no delay for tool use: the frequency of spontaneous successes started to increase after 18 months, and demonstration became effective after that age. However, further analyses showed that only the preterm infants without hypotonia and born after 36 weeks of pregnancy developed tool use without delay. Hypotonic preterm infants were still largely unsuccessful in the conditions of spatial gap, even at the end of the study. The degree of prematurity also influenced the performance at tool use. These results, following the observation of a delay in the development of bimanual coordination and of handedness in the same infants at 10-12 months in a previous study, show that low risk preterm infants can still be impaired for the development of new manual skills beyond the 1st year. Thus, hypotonic preterm infants and infants born before 36 weeks of pregnancy should be followed and might benefit from early intervention programs.",
    "full_text": "fpsyg-07-01104 July 15, 2016 Time: 12:13 # 1\nORIGINAL RESEARCH\npublished: 19 July 2016\ndoi: 10.3389/fpsyg.2016.01104\nEdited by:\nArnaud Roy,\nUniversity of Angers, France\nReviewed by:\nFrançois Osiurak,\nLumière University Lyon 2, France\nChrystelle Remigereau,\nUniversity of Angers, France\n*Correspondence:\nMaja Petkovic\nmajapetkovic@net.hr\nSpecialty section:\nThis article was submitted to\nCognitive Science,\na section of the journal\nFrontiers in Psychology\nReceived: 23 March 2016\nAccepted: 08 July 2016\nPublished: 19 July 2016\nCitation:\nPetkovic M, Rat-Fischer L and\nFagard J (2016) The Emergence\nof Tool Use in Preterm Infants.\nFront. Psychol. 7:1104.\ndoi: 10.3389/fpsyg.2016.01104\nThe Emergence of Tool Use in\nPreterm Infants\nMaja Petkovic*, Lauriane Rat-Fischer and Jacqueline Fagard\nLaboratoire Psychologie de la Perception, Centre Biomédical des Saints-Pères, CNRS UMR 8158, Université Paris\nDescartes, Paris, France\nPreterm born children without neurological impairments have been shown to present\nsome visual-manual coordination deﬁcits, more or less depending on their tonicity and\nthe degree of prematurity. In this paper, we compare the development of tool use in 15–\n23-month-old preterm infants born after 33–36 weeks of gestation without neurological\ncomplications with that of full-term infants according to corrected age. Understanding\nthe affordance of a tool is an important cognitive milestone in early sensorimotor period.\nUsing a tool to bring within reach an out-of-reach object, for instance, has been shown\nto develop during the 2nd year in full-term infants. Here we presented preterm infants\nwith an attractive toy out of reach and with a rake-like tool within reach in ﬁve conditions\nof spatial relationships between the toy and the tool. Like full-terms, preterm infants\nused the tool with success in conditions of spatial contiguity around 15–17 months. In\nconditions of a spatial gap between tool and toy, i.e., the only conditions which shows\nwithout ambiguity that the infant understands the affordance of the tool, preterm infants\nas a group showed no delay for tool use: the frequency of spontaneous successes\nstarted to increase after 18 months, and demonstration became effective after that age.\nHowever, further analyses showed that only the preterm infants without hypotonia and\nborn after 36 weeks of pregnancy developed tool use without delay. Hypotonic preterm\ninfants were still largely unsuccessful in the conditions of spatial gap, even at the end of\nthe study. The degree of prematurity also inﬂuenced the performance at tool use. These\nresults, following the observation of a delay in the development of bimanual coordination\nand of handedness in the same infants at 10–12 months in a previous study, show that\nlow risk preterm infants can still be impaired for the development of new manual skills\nbeyond the 1st year. Thus, hypotonic preterm infants and infants born before 36 weeks\nof pregnancy should be followed and might beneﬁt from early intervention programs.\nKeywords: preterm infants, visual-manual coordination, tool-use\nINTRODUCTION\nThe World Health Organization (WHO) deﬁnes preterm infants as those born before 37 weeks\nof completed pregnancy. Unfortunately, the prevalence of developmental disabilities in preterm\nchildren is still high and many children born preterm present mild dysfunctions such as learning\ndisabilities, lower IQ scores and speciﬁc cognitive deﬁcits aﬀecting attention, such as ADHD\n(attention-deﬁcit/hyperactivity disorder), as well as visual function, visual-motor integration, and\nexecutive functions (Van Braeckel et al., 2010\n; Baron et al., 2011; Bos and Roze, 2011). The causes\nFrontiers in Psychology | www.frontiersin.org 1 July 2016 | Volume 7 | Article 1104\nfpsyg-07-01104 July 15, 2016 Time: 12:13 # 2\nPetkovic et al. Tool-use in Preterm Infants\nof these disabilities are still unclear, although they are\nsometimes connected with neurological impairments such as\nintraventricular hemorrhage (IVH) and are often related to\ndecreasing gestational age at birth (Moster et al., 2008; Volpe,\n2009). However, there is a growing body of cross-sectional and\nlongitudinal research showing that even preterm infants without\nmajor neurological complications (e.g., such as IVH grades III\nand IV , congenital abnormalities, etc.), considered “healthy”\nor “low risk”, have poorer cognitive and neuropsychological\nperformances than full-term infants in preschool and school age\nperiod (Vicari et al., 2004; Linnet et al., 2006; Sansavini et al.,\n2011; Caravale et al., 2012; Nepomnyaschy et al., 2012). It is yet\nunknown to what extent later cognitive deﬁcits could be predicted\nearlier in infancy. We thus decided to test low risk preterm infants\nfor the acquisition of tool use, which is an important cognitive\nmilestone in infants’ early sensorimotor period. Before describing\nwhat is known about the emergence of tool use in full-term\ninfants, we will brieﬂy summarize the main disabilities reported\nfor these low risk preterm children.\nCognitive performances have been well studied in low risk\npreterm children, in preschool and school-age period (Vicari\net al., 2004; Linnet et al., 2006; Sansavini et al., 2010, 2011, 2014;\nCaravale et al., 2012; Nepomnyaschy et al., 2012). For instance,\nCaravale et al. (2005, 2012) observed lower neuropsychological\nperformances in low risk preterm infants at 3–4 years, some\nof them still present at 5 years. They found that 3-year-old\nand 4-year-old preterm children, when compared to full-terms,\nachieved lower mean scores on the Stanford-Binet intelligence\nscale, visual perception test (observation of geometric shape),\nvisual-motor integration test (paper-pencil components of the\nVisual-Motor Integration Test), memory for location test and\nsustained attention. When tested at 5 years, preterm children\nstill obtained signiﬁcantly lower mean scores than full-terms on\nvisual-motor integration testand visual perception.\nMuch less studies on sensorimotor development have focussed\non low risk preterm infants within the ﬁrst 2 years of life.\nRegarding motor development, results from kinematics studies\nshowed some motor impairment during reaching in 6- to 7-\nmonth-old preterm infants, with lower mean and ﬁnal velocities\nwhen compared to full-term infants (Rönnqvist and Domellöf,\n2006; Toledo and Tudella, 2008). However, some studies found\nthat the reaching development of 8-, 10-, and 12-month-old\npreterm infants was similar to that of their full-term peers when\ncorrected age was used (see for review O’Sullivan et al., 2012).\nWhether or not preterm infants have normal visual function\nis an important question when considering visual-manual\ndevelopment. Visual attention as assessed through ﬁxation shifts\nis less mature in preterm than in full-term infants (Ricci et al.,\n2010). Similarly, preterm infants have a lower proportion of\nsmooth pursuit eye movements (Grönqvist et al., 2011), lower\nvisual recognition memory (Rose et al., 2001), and narrower\nvisual ﬁeld (Petkovic et al., 2016). Some studies aimed at\ndisentangling the inﬂuence of visual versus motor deﬁcits\nresulting in the visual-motor impairment in preterm children.\nAnd according to Teplin et al. (1991) and Goyen et al. (2008),\npreterm infants visual-manual deﬁcits are more due to a ﬁne\nmotor deﬁcit than to low visual perception.\nTool use is one of the visual-manual skills which develop\nduring the 2nd year of life. It is one of the hallmarks of the\nsensorimotor period (Rat-Fischer et al., 2012). Tool use belongs\nto the category of means-end behaviors, for which reaching a goal\nrequires an intermediate action. For instance, when an interesting\nobject is placed at the end of an uninteresting one, such as an out-\nof-reach toy at the end of a string or placed on a cloth within\nreach, infants must discover that pulling the string (or the cloth)\nwill allow them to retrieve the toy. Such means-end behaviors\ndevelop between 7 and 12 months (Piaget, 1936; Fagard, 1998;\nWillatts, 1999). When the uninteresting object within reach is not\nconnected to the interesting object, the problem is much harder\nfor the infant. For instance, Bates et al. (1980) compared 9-10-\nmonth-old infants retrieving an out-of-reach toy placed either on\na cloth, at the end of a string, or at diﬀerent positions near three\nkinds of utensils likely to help the children to retrieve it (hoop,\ncrook, or stick). The children succeeded in the conditions where\ntoy and means to retrieve it were physically linked (‘unbreakable\ncontact”, cf. means-end situations just mentioned) but less often\nwhen the contact was breakable, and not at all in the condition\nwithout any contact.\nWhen the object within reach is not physically attached to the\ntoy, a rigid object is required to bring the toy closer. The rigid\nobject must be used as a tool. One widely accepted deﬁnition of\na tool is an object independent from the object on which it is\nsupposed to act. Infants’ ﬁrst tool is generally the spoon. Infants\noften start using a spoon or trying to use a spoon around the\nend of the 1st year. Note that the spoon is a particular tool,\nin that prior to using the spoon themselves, infants have many\nopportunities to see their family and other people using a spoon\nto eat.\nUsing unfamiliar tools to bring an out-of-reach object within\nreach is succeeded later. A few studies have focussed on how\ninfants learn to use such a new tool (see Keen, 2011 and Greif\nand Needham, 2011, for reviews). Many of them have focussed\non perceptual factors, all stressing that diﬃculty increases with\nincreasing spatial gap between the tool and the object to be\nacted upon (Bates et al., 1980; van Leeuwen et al., 1994), and\nmore generally with an increasing number of steps needed to\nachieve the required result (Smitsman and Cox, 2008). Other\nstudies aimed at ﬁnding the mechanisms leading to learning\nthe aﬀordance of a tool and its skillful use, namely trial and\nerror, observational learning, and practice (Rat-Fischer et al.,\n2012; Esseily et al., 2013, 2016; Fagard et al., 2014, 2016;\nSomogyi et al., 2015, for a review). These studies showed that\nit is not before the end of the 2nd year that infants become\nsuccessful in using tools when there is a spatial gap between\nthem and the target, implying a true understanding of the\ntool’s function. Indeed, discovering how to use an unfamiliar\ntool represents a very complex aﬀordance learning: the infant\nmust combine several aﬀordances such as grasping the tool,\nplacing it behind the toy, pulling it toward himself, but he must\nalso anticipate the state of the rake after being moved. This\nmakes tool use an important hallmark of cognitive development,\nfrom an evolutionary as well as a developmental point of view.\nSince, as we saw previously, some preterm children exhibit\ncognitive deﬁcits in school years, it would be interesting to know\nFrontiers in Psychology | www.frontiersin.org 2 July 2016 | Volume 7 | Article 1104\nfpsyg-07-01104 July 15, 2016 Time: 12:13 # 3\nPetkovic et al. Tool-use in Preterm Infants\nwhether they show an earlier typical development of tool use\nor not.\nSo far, there have been no studies carried out on the\ndevelopment of tool use in preterm infants. Investigating the\ndevelopment of this cognitively demanding visual-manual skill\ncould bring us closer to evaluating the relationship between\nvisual-manual early development and possible later cognitive\ndeﬁcits seen in preterm children. Since such relationships\nbetween early visual-motor development and later cognitive\nabilities have been observed in full-terms (see for instance, Piek\net al., 2008), we might hypothesize that tool-use could be a\nsensitive tool for detecting future cognitive deﬁcits.\nMATERIALS AND METHODS\nParticipants\nTwelve preterm infants (eight girls and four boys) participated\nin this study. All infants included in the study were considered\nhealthy, with no IVH above grade I, no evidence of visual or\nauditory impairment, and no major neurological complications\n(see Table 1 ). They were part of a longitudinal study which\nstarted at 5 months with a visual evaluation and an evaluation\nevery month for a visual-manual follow-up (see Petkovic et al.,\n2016). The visual evaluation showed no visual impairment in any\ninfant, except a tendency toward narrower visual ﬁeld in preterm\ninfants compared to full-terms. Preterm infants were recruited\nfrom a database of the Zagreb Special Hospital for Children\nwith Neurodevelopmental and Motor Disorders. After approval\nof the Hospital Ethical Committee, the families were sent an\ninformation leaﬂet about the study. The families who expressed\ninterest in taking part in the study signed a parental consent\nform.\nThe preterm infants were compared to 60 full-term infants (20\ngirls and 40 boys). These full-term infants were part of a previous\ncross-sectional study (Rat-Fischer et al., 2012), and constituted\nthe control group of the present study in which the authors of\nTABLE 1 | Medical information about preterm infants.\nType of\npregnancy:\nSingle birth: 4 Twin birth: 8 (4 × 2)\nCategory of\ngestational age at\nbirth:\nModerate preterm birth: 5\n33 weeks: 2 (1 hypotonic)\n34 weeks: 3 (1 hypotonic)\nLate preterm birth: 7\n36 weeks: 7 (1 hypotonic)\nCategory of birth\nweight:\nNormal birth weight: 6 Low birth weight: 6\nIncubator: Yes: 7 No: 5\nMuscle tone: Hypertonic: 10 (including 3\nmoderate)\nHypotonic: 3 (including 2\nmoderate)\nIVH: IVH, grade I: 6 No: 6\nType of birth: Vaginal: 5 Cesarean: 7\nFollow-up by\nphysician:\nYes: 12 No: 0\nVAT (Visual evoked\npotentials):\nNo visual disabilities: 12 Visual disabilities: 0\nBERA No auditory disabilities: 12 Auditory disabilities: 0\nthe ﬁrst study actively participated, thus guarantying a common\nmethodology. Five age groups of 12 participants were part of the\ncontrol group: 14-month-olds (13 months 28 days to 14 months\n13 days), 16-month-olds (15 months 28 days to 16 months\n9 days), 18-month-olds (17 months 26 days to 18 months 4 days),\n20-month-olds (19 months 27 days to 20 months 10 days), and\n22-month-olds (21 months 25 days to 22 months 5 days). Infants\nwere recruited from a list of local families who expressed interest\nin taking part in studies of infant development. Prior parental\nconsent was granted before observing the infants.\nFor tool use the preterm infants were tested every 2 months\nfrom 15 to 23 months, thus at 15, 17, 19, 21, and 23 months. We\nchose to test them at these ages so that we could compare them\nto the full-terms tested at 14, 16, 18, 20, and 22 months. Thus, to\ncorrect for prematurity, the preterm infants were compared with\nfull-terms a month younger.\nProcedure\nThe experimental apparatus was designed to assess at what age\nand in which conditions infants were capable of using a tool to\nretrieve an out-of-reach toy. The desired toy was placed out of\nreach at diﬀerent positions near a white cardboard rake-like tool\ndesigned to be visually plain (see Figure 1 ). During the whole\nexperiment, infants sat on the lap of one of their parents in front\nof a table. The experimenter sat facing the infants across the table.\nA digital video camera recorded the whole session.\nAfter the infants were familiarized with the surroundings\nand with the material, an attractive toy was placed in front of\nthem successively in ﬁve conditions: toy attached to the rake\npart of the tool (C1: no spatial gap, attached), toy inside and\nagainst the rake part of the tool (C2: no spatial gap, unattached),\ntoy inside the tool but not against it (C3: small spatial gap),\ntoy to the side of the tool (C4: large spatial gap), and toy in\nthe middle of the table with the tool directly held out to the\ninfant by the experimenter (C5: eﬀectively a very large spatial\ngap). The conditions were presented in order of increasing\nspatial gap from C1 to C5. All infants received one trial at C1,\nwhere they all immediately succeeded. They were then directly\npresented with two trials at C2. If both trials were successful,\nthey received two trials at C3 (and so on until C5). If infants\nfailed to one or both trials of a condition, they were given\none or two additional trials of that condition. If infants failed\nto retrieve the toy in two of three trials, the parents or the\nexperimenter gave two consecutive demonstrations of the failed\ncondition. If infants failed in a condition after a demonstration,\nthey were directly presented with the C5 condition. Thus,\nthe C3 and C4 conditions were presented only if infants\nsucceeded in the previous condition either spontaneously or\nafter a demonstration; only the C1, C2, and C5 conditions were\npresented to all infants.\nData Analysis\nA trial was coded both for global success/failure to retrieve the\ntoy in a given condition, and on the basis of a behavioral category\nevaluated for each trial. When an infant succeeded at least at two\ntrials in a given condition, he was coded as successful for this\ncondition. When an infant succeeded at one trial but failed at the\nFrontiers in Psychology | www.frontiersin.org 3 July 2016 | Volume 7 | Article 1104\nfpsyg-07-01104 July 15, 2016 Time: 12:13 # 4\nPetkovic et al. Tool-use in Preterm Infants\nFIGURE 1 | Tool use conditions (C5, where the tool is handled to the child) is not shown.\nother two trials, he was coded as failure for this condition but he\nwas granted 33.3% successful trials. For the behavioral category\na score of 0 was attributed when infants expressed no interest\nin the toy, the tool, or (more generally) the task; a score of 1\nwas attributed when infants were mostly interested in the out-\nof-reach toy, pointing toward it and possibly trying to retrieve it\nwithout using the tool; a score of 2 was attributed when infants\nwere mainly interested in manipulating the tool itself, possibly\nalternating their attention between the toy and the tool but not\nin connecting them; a score of 3 was attributed when infants\nsystematically and repetitively brought the tool to bear on the toy\nbut seemingly not with the purpose of retrieving the toy; a score\nof 4 was attributed when infants brought the tool to bear on the\ntoy obviously with the purpose of retrieving the toy but failed.\nA score of 5 was attributed when infants succeeded in retrieving\nthe toy with the tool.\nThe percentage of success was calculated in two ways: 1%\nof infants with success for the condition (success if the infant\nhad been successful at both consecutive trials or at 2/3 of the\ntrials of the condition); 2/ mean percentage of successful trials\nfor the condition. When infants were not tested for the following\ncondition after repeated failure at the easier preceding condition,\nthey were given a score of 0.\nA Friedman ANOV A was calculated to test the eﬀect of age\nand condition on the percentage of successful trials, separately\nfor preterm children and full-terms. We did not include C1 in\nthese Friedman ANOV As since there was not enough variance\nfor this condition. A Mann–Whitney test was used to compare\nthe preterm children with the full-terms, and within the preterm\nchildren, to compare the children as a function of their tonicity,\ndegree of prematurity, and birth weight. To evaluate the impact\nof observation of a demonstration, we calculated an ANOV A for\nGroup (x 2; Preterm infants, Full-terms), for Condition (x 2,\nBefore Demo, After Demo, repeated measures) for each age\nseparately.\nRESULTS\nSpontaneous Success\nPercentage of successful infants is shown on Figures 2 and 3. C1\nwas almost always successfully performed from the ﬁrst session\nFIGURE 2 | Percentage of successful infants (Preterm infants).\nFrontiers in Psychology | www.frontiersin.org 4 July 2016 | Volume 7 | Article 1104\nfpsyg-07-01104 July 15, 2016 Time: 12:13 # 5\nPetkovic et al. Tool-use in Preterm Infants\nFIGURE 3 | Percentage of successful infants (Full-terms).\nin both groups. In both groups there was a decrease in the\npercentage of successful infants from C1 to C2 and to C3. There\nwas a clear decrease in the percentage of successful infants for the\ntwo most diﬃcult conditions, C4 and C5, which did not diﬀer\nmuch from each other.\nFor the preterm infants, a Friedman ANOV A was calculated\non the percentage of successful trials for each condition as\na function of Age. It shows a near-signiﬁcant age eﬀect for\nC2, F(10,4) = 8.5; p = 0.075; a signiﬁcant age eﬀect for\nC3, F(10,4) = 27.3; p = 0.00002; for C4, F(10,4) = 15.8;\np =0.003, and for C5, F(10,4) =23.9; p =0.00008. We also\nchecked whether the conditions signiﬁcantly diﬀered for each\nage. A Friedman ANOV A indicates a signiﬁcant diﬀerence for\nCondition at 15 months,F(12,3) =17.7; p =0.0005; at 17 months,\nF(11,3) =20.9; p =0.0001; at 19 months, F(10,3) =19.2;\np =0.0002, and at 21 months, F(11,3) =12.6; p =0.006, but not\nat 23 months (p =0.17).\nSimilarly, for full-terms, a Friedman ANOV A was calculated\nfor each condition as a function of Age on the percentage\nof successful trials. It shows a signiﬁcant age eﬀect for C2,\nF(12,4) =16.2; p =0.003; for C3, F(11,4) =12.4; p =0.015,\nand for C5, F(8,4) =15.8; p =0.003. The eﬀect does not\nreach signiﬁcance for C4, p =0.10. We also checked whether\nthe conditions signiﬁcantly diﬀered for each age. A Friedman\nANOV A indicates a signiﬁcant diﬀerence for Condition at\n14 months, F(11,3) = 17.9; p = 0.0005; at 16 months,\nF(11,3) = 18; p = 0.0004; at 18 months, F(10,3) = 18.5;\np =0.0003, and at 22 months, F(12,3) =12.8; p =0.005, but not\nat 20 months, p =0.22.\nA Mann–Whitney was calculated to check whether the group\nof preterm infants diﬀered from the full-terms. At 15–14 months,\n17–16 months, 19–18 months, and 23–22 months, there was\nno signiﬁcant diﬀerence between the two groups for any of the\nconditions; at 21 months the preterm infants were signiﬁcantly\nmore performant than the 20-month-old full-terms at C2,\nz =2.6, p =0.008, and C3, z =0.9, p =0.049. There was\nno signiﬁcant diﬀerence at C4 and C5 between both groups at\nany age.\nThe Inﬂuence of Demonstration at C4\nand C5\nInfants who did not spontaneously succeed were given a\ndemonstration of how to use the tool. We analyzed the eﬀect\nof the demonstration for C4 and C5 only, which are the main\nconditions of interest, the only ones which cannot be succeeded\nby chance thanks to the spatial contingency between the tool\nand the toy. We compared the mean behavioral score before\nand after the demonstration at C4 and C5 combined. Before\n19–18 months, there was no eﬀect of the demonstration (see\nFigure 4).\nWe calculated an ANOV A for Group (x 2; Preterm infants,\nFull-terms) and for Condition (x 2, Before Demo, After Demo,\nrepeated measures) for each age separately. At 15–14 months,\nthere is no eﬀect of Group, no eﬀect of Condition, and no\nGroup ×Condition interaction. At 17–16 months, there is no\neﬀect of Condition but there is a signiﬁcant eﬀect of Group,\nF(1,17) =5.07, p =0.04. The group of preterm infants had\na higher mean score than the group of full-terms both before\nand after demonstration. There is no Group × Condition\ninteraction. At 19–18 months, there is no eﬀect of Group but\nthere is an eﬀect of Condition, F(1,13) =8.98, p =0.01. Infants\nhad a higher behavioral score after than before demonstration.\nThere is no Group ×Condition interaction. At 21–20 months,\nthere is an eﬀect of Condition, F(1,12) =12.8, p =0.004. In\naddition, there is an eﬀect of Group, F(1,12) =10.8, p =0.01.\nThe group of preterm infants had a higher mean behavioral\nscore than the group of full-terms, and infants from both\ngroups had a higher score after than before demonstration.\nThere is no Group ×Condition interaction. At 23–22 months,\nthere is an eﬀect of Condition, F(1,9) =8.6, p =0.017, but\nno eﬀect of Group and no Group ×Condition interaction.\nIn both groups infants had a higher behavioral score after\nthan before demonstration. Thus, starting at 19–18 months,\nthe eﬀect of Condition is signiﬁcant. Even though there is a\nGroup eﬀect at some ages, the complete absence of signiﬁcant\nGroup ×Condition interaction indicates a comparable eﬀect of\ndemonstration for both groups.\nFrontiers in Psychology | www.frontiersin.org 5 July 2016 | Volume 7 | Article 1104\nfpsyg-07-01104 July 15, 2016 Time: 12:13 # 6\nPetkovic et al. Tool-use in Preterm Infants\nFIGURE 4 | Mean behavioral score at C4–C5 Before versus After demonstration in Preterm (PT) and Full-term (FT) infants.\nPreterm Infants’ Performance as a\nFunction of their Characteristics (Muscle\nTone, Prematurity, Birthweight)\nWe checked whether tool-use performance varied with muscle\ntone (hypertonia vs. hypotonia), number of weeks of pregnancy\n(33, 34, or 36 weeks), and birth weight (normal vs. low) within the\ngroup of preterm infants. Globally, the three hypotonic infants\nwere less successful at tool use than the nine hypertonic infants\n(see Table 2). A Mann–Whitney test calculated on the percentage\nof success at all conditions with muscle tone as independant\nvariable shows no signiﬁcant diﬀerences between both groups at\n15 and 17 months. At 19 months, the hypertonic infants were\nsigniﬁcantly more successfull than the hypotonic ones for C2\nonly, z =−3.3, p =0.001. At 21 months, the hypertonic infants\nwere signiﬁcantly more successful than the hypotonic infants\nTABLE 2 | Mean percentage of success among premature children as a\nfunction of muscle tone and age.\nC2 C3 C4 C5\n15 m\nhypo 33,33 11,11 0,00 0,00\nhyper 55,56 11,11 0,00 2,22\n17 m\nhypo 66,67 44,45 0,00 2.23\nhyper 74,07 66,67 14,81 7,41\n19 m\nhypo 44,45 66,67 10 6.7\nhyper 100,00 87,50 38.9 28.7\n21 m\nhypo 100,00 62.5 17 22.7\nhyper 100,00 96,30 62,96 83,33\n23 m\nhypo 55,56 63,89 24.2 0,00\nhyper 96,30 100,00 88,89 96,30\nfor C5, z =−2.2, p =0.029, and almost signiﬁcantly so for\nC3, z =−1.8, p =0.06. At 23 months, the hypertonic infants\nperformed signiﬁcantly better than the hypotonic ones for all\nconditions; C2, z =−1.9, p =0.05; C3, z =−2.6, p =0.01; C4,\nz =−2.5, p =0.01; C5, z =−3, p =0.002.\nThe ﬁve infants born after 33 or 34 weeks (moderate preterm)\nwere less successful than the seven infants born after 36 weeks\n(late preterms) but only at the two most diﬃcult conditions\n(C4 and C5) of tool use (see Table 3). A Mann–Whitney test\ncalculated on the percentage of success at all conditions as a\nfunction of Prematurity shows that the two groups displayed\nno signiﬁcant diﬀerence at 15 and 17 months. At 19 months,\nthe late perterm infants performed signiﬁcantly better than the\nmoderate preterms for C4, z =−2.28, p =0.022, and C5,\nz =−1.94, p =0.05. At 21 months, the late preterm infants\nwere almost signiﬁcantly more successful than the moderate\nTABLE 3 | Mean percentage of success among premature children as a\nfunction of prematurity and age.\nC2 C3 C4 C5\n15 m\nmoderate 73,30 19,90 0,00 0,00\nlate 33,30 4,80 0,00 2,90\n17 m\nmoderate 86,70 66,70 20,00 13,30\nlate 61,90 57,10 4,8 0,90\n19 m\nmoderate 86,70 80,00 0,00 0,00\nlate 85,70 85,70 54,30 38,60\n21 m\nmoderate 100,00 95,00 20,00 40,00\nlate 100,00 82,70 73,90 88,30\n23 m\nmoderate 80,00 93,30 40,00 53,30\nlate 90,50 89,30 96,10 85,70\nFrontiers in Psychology | www.frontiersin.org 6 July 2016 | Volume 7 | Article 1104\nfpsyg-07-01104 July 15, 2016 Time: 12:13 # 7\nPetkovic et al. Tool-use in Preterm Infants\npreterms for C4, z =−1.83, p =0.06, but signiﬁcance is not\nreached for C5, p =0.12. At 23 months, the late perterm infants\nperformed almost signiﬁcantly better than the moderate preterms\nfor C4, z =−1.85, p =0.06, but non-signiﬁcantly better for C5,\np =0.14. There was no diﬀerence in performance according to\nbirthweight.\nDISCUSSION\nThe preterm infants were ﬁrst successful at the C2 and C3\nconditions (both conditions with no spatial gap or with a small\nspatial gap), with an increase in the frequency of success from 15\nto 21 months when almost all infants were successful. However,\nin the C2 and C3 conditions, the toy was positioned so that it\nlaid in the trajectory between the tool head and the infants. Thus,\nsimply pulling the tool through a small distance would inevitably\nbring the toy into reach. Thus, in these conditions, successes\ncould have been achieved by chance, at least at the early sessions,\nbecause infants could pull the tool and obtain the toy by pure\nspatial contingency. High percentages of success in the C2 and\nC3 conditions with little or no spatial gap, therefore, should not\nbe considered as true indicators of infants’ comprehension of the\ntool. In contrast C4 and C5 (both conditions with a large spatial\ngap) could barely be succeeded by chance. Because of the spatial\ngap between the tool and the toy in these conditions, infants must\nunderstand the usefulness of the tool to succeed. Success at C4\nand C5 occurred much later during development than success at\nC2 and C3. First spontaneous successes arose toward the end of\nthe 2nd year.\nThese results are close to the results of the full-terms,\nobtained in a previous study and used here as controls for the\npremature children (Rat-Fischer et al., 2012). Preterm infants\nwere compared with full-terms 1 month younger for correction\nof prematurity. The percentage of successful infants tends to\nbe slightly higher in the preterm infants than in the full-terms.\nHowever, this diﬀerence between the two groups is signiﬁcant\nonly for C2 and C3 and only at 21–20 months. There is no\nsigniﬁcant diﬀerence in the percentage of success at C4 and C5\nbetween the two groups. This result indicates that, as a group,\nthe preterm infants are not delayed in their acquisition of tool\nuse. The tendency for them to perform even better at the easiest\nconditions can be explained by the fact that there was a correction\nfor prematurity: it could be that at that age, the time spent\nafter birth is more important than the total number of months\nsince conception. Another reason for the better performance of\nthe preterm infants, not exclusive of the ﬁrst one, is that the\npreterm infants were tested longitudinally and therefore had\nthe opportunity to practice, whereas the full-terms were seen\nonly once. This is in line with the diﬀerence that we observed\nbetween a cross-sectional and a longitudinal study, the infants\nfrom the latter being slightly more advanced than the infants\nfrom the former (Rat-Fischer et al., 2012; Fagard et al., 2014). To\ncontrol for this possibility, we also compared the preterm infants\nwith the full-terms of our longitudinal study carried out on ﬁve\nchildren from 12 to 18 months (Fagard et al., 2014). At the ages\nwhen such comparison was possible (15, 17, and 19 months for\nthe preterm children, compared with the full-terms at 14, 16,\nand 18 months, respectively), we observed no signiﬁcant group\ndiﬀerences. This conﬁrms that, as a group, the preterm children\nof our study are not delayed in their acquisition of tool use. We\ndid not report a qualitative analysis of the strategies used by the\npreterm children because we observed the same ﬂuctuations and\nthe same lack of tendencies in the strategies used before being\nsuccessful as reported in the previous studies with full-terms\n(Rat-Fischer et al., 2012; Fagard et al., 2014): infants sometimes\nbeg for the toy, sometimes play with the tool, sharing their\nattention between both, until they become able to spread their\nattention simultaneously on the toy and the tool and to make the\nlink between them.\nWhen the infants failed, we gave them two demonstrations.\nThe eﬀect of the demonstration on the performance was\nanalyzed for C4 and C5, by comparing the mean behavioral\nlevel of performance on trials before demonstration and after\ndemonstration. In preterm infants, there was no eﬀect of\nthe demonstration before 19 months: starting at that age\ninfants tended to have a higher mean behavioral score after\ndemonstration. These results are close to those found with full-\nterms who start to score better after demonstration than before at\n18 months. The lack of interaction between Group and Condition\nreveals that preterm infants are able to learn from observation of\na model to the same extent and at the same age (corrected for the\npreterm infants) as the full-terms.\nFinally we checked whether, beyond the absence of group\ndiﬀerences between the preterm infants and the full-terms, we\nwould ﬁnd diﬀerences within the group of preterm infants\ndepending on muscle tone, degree of prematurity and birth\nweight. Muscle tone was clearly associated with a lower\nperformance within preterm infants. Whenever there was a\ndiﬀerence between hypotonic and hypertonic preterm infants,\nthe latter were always more successful than the former. And\nat 23 months hypotonic preterm infants were signiﬁcantly\nless successful than hypertonic infants in all conditions. It is\nworth noting that at 23 months of age, the hypotonic children\nstill showed an important diﬀerence in percentage of success\nbetween the two easiest conditions (C2 and C3) and the two\nmost diﬃcult ones (C4 and C5) whereas hypertonic children\nwere mostly successful at all conditions, including the two\nconditions with a large gap between the tool and the toy.\nThese results are in continuity with our observation of the\nsame infants at 6 to 12 months: hypotonic infants showed\nsigniﬁcantly less visual-manual coordination on the Peabody\nDevelopmental Motor Scale than preterm infants with high\nmuscle tone (hypertonia) at all ages. In addition, hypotonia was\nalso signiﬁcantly associated with lower bimanual coordination\nat 11- and 12-months postnatal age. We suggested that these\nresults could be interpreted with reference to the development\nof the cerebellum, which is involved in dynamic feedforward\nmotor control, and has been found to be impaired in preterm\ninfants (Allin et al., 2004; Limperopoulos et al., 2005). The\ncerebellum is important in muscle tone regulation (Shah\net al., 2006), which could explain why muscle tone modulated\nperformance in our ﬁrst study (Petkovic et al., 2016). But the\ncerebellum is also involved in cognitive skills, as shown by child\nFrontiers in Psychology | www.frontiersin.org 7 July 2016 | Volume 7 | Article 1104\nfpsyg-07-01104 July 15, 2016 Time: 12:13 # 8\nPetkovic et al. Tool-use in Preterm Infants\n(Berger et al., 2005) and adult studies (Timmann and Daum,\n2007). This could also explain the persistent eﬀect of muscle tone\nin the two most cognitive conditions of tool use at the end of the\n2nd year.\nThe degree of prematurity also inﬂuenced tool use\nperformance at C4 and C5, but not in the easiest conditions.\nThe percentage of successful trials at C4 and C5 was signiﬁcantly\nlower in moderate compared to late preterm infants at 19 months,\nwhen the latter started to succeed in these conditions. The\ntendency of the late preterm infants to show more success than\nthe moderate preterm infants in these conditions could still be\nobserved at up to 23 months, the oldest age in our study. This\nindicates that late preterm infants start earlier to show some\nsuccessful trials than moderate preterm infants in the two most\ncognitively demanding conditions. In our ﬁrst longitudinal study,\ngestational age at birth similarly inﬂuenced the age of emergence\nof bimanual coordination. In addition, the two 33-week preterm\ninfants had a very low laterality index compared to the 34- and\n36-week preterm infants up to 12 months. Thus, the degree of\nprematurity partly accounted for the preterm group’s results on\nthe emergence of a new skill (bimanual coordination) or of new\nmovement organization (having a preferred hand). Tool use is\nalso a new skill for infants in their 2nd year of life: it is worth\nnoting that we also observe a delay in the emergence of this\nskill in moderate preterm infants. Similar ﬁndings on the eﬀect\nof the degree of prematurity on movement organization have\nbeen reported in other studies (Domellöf et al., 2011). Finally,\nbirth weight did not signiﬁcantly inﬂuence the tool use results,\nin the same way it did not inﬂuence any of the results of the ﬁrst\nlongitudinal study.\nCONCLUSION\nOur results indicate that, as a group, the preterm infants seem\nto have a normal development of tool use. However, not all\npreterm infants developed tool use without delay. Hypotonic and\nmoderate preterm children seemed delayed in their acquisition of\ntool use, in the same vein as they showed a delay in the acquisition\nof bimanual coordination and of handedness during their 1st\nyear. By following these hypotonic low risk preterm children, it\nshould be possible to evaluate which of the observed delays in\nthese two studies are the best markers of later cognitive deﬁcits in\nchildhood. It could then lead us to evaluate when and how to help\nhypotonic and moderate preterm children in order to prevent\nlater cognitive deﬁcits.\nHowever, these results must be taken with care because\nthere are several limitations in our study. First the results bear\non a small number of children. In particular, even though all\nhypotonic infants were clearly delayed in their acquisition of\ntool use, they were only three in this study. Similarly, the\nmoderate preterm children are only ﬁve, and two of them are\nalso hypotonic. A replication of the study with a larger sample of\nchildren is clearly needed to draw ﬁrm conclusions. In addition,\nthe corrected age might have over-compensated the prematurity\nand a comparison for chronological age would be welcome. It\nmight reveal a delay in the preterm children considered as a\ngroup that was not revealed by a corrected age comparison;\nhowever, the delay observed for hypotonic children would be\neven more striking in a chronological comparison. Finally, it\nwould be important to test the visual ﬁeld of the premature\nchildren when they start being tested for tool use. In our ﬁrst\nstudy, the hypotonic preterm children showed a narrower visual\nﬁeld than the hypertonic children at the age of 5 months (Petkovic\net al., 2016). Preterm children were not tested again for vision in\nthis study: it is not excluded that a narrower visual ﬁeld partly\nexplains the hypotonic preterm children’s delay in the emergence\nof tool use.\nAUTHOR CONTRIBUTIONS\nMP and JF contributed to this work by planning, organizing, and\ncaring the follow-up study. Analyzing the data and interpreting\nthe results in terms of current theories of action-perception\napproach and development of preterm infants. LR-F. contributed\nto this work by taking part in preparation of the methodology\nreferring to her own research on tool us carried out in full-term\ninfants. Also by reﬂecting on the results found in this study to her\nown ﬁndings on full-term infants.\nREFERENCES\nAllin, M., Henderson, J., Suckling, C., Nosarti, C., Rushe, T., Fearon, P., et al.\n(2004). Eﬀects of very low birthweight on brain structure in adulthood. Dev.\nMed. Child Neurol.46, 46–53.\nBaron, I. S., Erickson, K., Ahronovich, M. D., Baker, R., and Litman, F. R.\n(2011). Cognitive deﬁcit in preschoolers born late-preterm. Early Hum. Dev.\n87, 115–119. doi: 10.1016/j.earlhumdev.2010.11.010\nBates, E., Carlson-Luden, V., and Bretherton, I. (1980). Perceptual aspects of\ntool use in infancy. Infant Behav. Dev. 3, 127–141. doi: 10.1016/S0163-\n6383(80)80017-8\nBerger, A., Tzur, G., Constantini, S., Sadeh, M., Shuper, A., Kornreich, L., et al.\n(2005). Task switching after cerebellar damage. Neuropsychology 19, 362–370.\ndoi: 10.1037/0894-4105.19.3.362\nBos, A. F., and Roze, E. (2011). Neurodevelopmental outcome in preterm infants.\nDev. Med. Child Neurol.53, 35–39. doi: 10.1111/j.1469-8749.2011.04062.x\nCaravale, B., Mirante, N., Vagnoni, C., and Vicari, S. (2012). Change in\ncognitive abilities over time during preschool age in low risk preterm\nchildren. Early Hum. Dev. 88, 363–367. doi: 10.1016/j.earlhumdev.2011.\n09.011\nCaravale, B., Tozzi, C., Albino, G., and Vicari, S. (2005). Cognitive development in\nlow risk preterm infants at 3-4 years of life. Arch. Dis. Child. Fetal Neonatal Ed.\n90, 474–479. doi: 10.1136/adc.2004.070284\nDomellöf, E., Johansson, A. M., and Rönnqvist, L. (2011). Handedness in preterm\nborn children: a systematic review and a meta-analysis. Neuropsychologia 49,\n2299–2310. doi: 10.1016/j.neuropsychologia.2011.04.033\nEsseily, R., Rat-Fischer, L., O’Regan, K., and Fagard, J. (2013). Understanding\nthe experimenter’s intention improves 16-month-olds’ observational learning\nof the use of a novel tool. Cogn. Dev. 28, 1–9. doi: 10.1016/j.cogdev.2012.\n10.001\nEsseily, R., Rat-Fischer, L., Somogyi, E., O’Regan, K. J., and Fagard, J.\n(2016). Humour production may enhance observational learning of a new\ntool-use action in 18-month-old infants. Cogn. Emot. 30, 817–825. doi:\n10.1080/02699931.2015.1036840\nFagard, J. (1998). “Changes in grasping skills and the emergence of bimanual\ncoordination during the ﬁrst year of life, ” in The Psychobiology of the Hand.\nFrontiers in Psychology | www.frontiersin.org 8 July 2016 | Volume 7 | Article 1104\nfpsyg-07-01104 July 15, 2016 Time: 12:13 # 9\nPetkovic et al. Tool-use in Preterm Infants\n(Clinics in Developmental Medicine, Vol. 147), ed. K. J. Connolly (London: Mac\nKeith Press), 123–143.\nFagard, J., Rat-Fischer, L., Esseily, R., Somogyi, E., and O’Regan, J. K. (2016). What\ndoes it take for an infant to learn how to use a tool by observation? Front.\nPsychol. 7:267. doi: 10.3389/fpsyg.2016.00267\nFagard, J., Rat-Fischer, L., and O’Regan, J. K. (2014). The emergence of use of a\nrake-like tool a longitudinal study in human infants. Front. Psychol.5:491. doi:\n10.3389/fpsyg.2014.00491\nGoyen, T. A., Todd, D. A., Veddovi, M., Wright, A. L., Flaherty, M., and Kennedy, J.\n(2008). Eye–hand co-ordination skills in very preterm infants from 29 weeks\ngestation at 3 years: eﬀects of preterm birth and retinopathy of prematurity.\nEarly Hum. Dev.82, 739–745. doi: 10.1016/j.earlhumdev.2006.02.011\nGreif, M. L., and Needham, A. (2011). “The development of human tool use early\nin life, ” inTool Use and Causal Cognition, eds T. McCormack, C. Hoerl, and S.\nButterﬁll (Oxford: Oxford University Press).\nGrönqvist, H., Brodd, K. S., and Rosander, K. (2011). Development of smooth\npursuit eye movements in very prematurely born infants: 2. The low-risk\nsubgroup. Acta Paediatr.100, 5–11. doi: 10.1111/j.1651-2227.2011.02247.x\nKeen, R. (2011). The development of problem solving in young\nchildren: a critical cognitive skill. Annu. Rev. Psychol. 62, 1–21. doi:\n10.1146/annurev.psych.031809.130730\nLimperopoulos, C., Soul, J. S., and Gauvreau, K. (2005). Late gestation cerebellar\ngrowth is rapid and impeded by premature birth. Pediatrics 115, 688–695. doi:\n10.1542/peds.2004-1169\nLinnet, K. M., Wisborg, K., Agerbo, E., Secker, N. J., Thomsen, P. H.,\nand Henriksen, T. B. (2006). Gestational age, birth weight, and the\nrisk of hyperkinetic disorder. Arch. Dis. Child. 91, 655–660. doi:\n10.1136/adc.2005.088872\nMoster, D., Lie, R. T., and Markestad, T. (2008). Long-term medical and\nsocial consequences of preterm birth. N. Engl. J. Med. 359, 262–267. doi:\n10.1056/NEJMoa0706475\nNepomnyaschy, L., Hegyi, T., Ostfeld, B. M., and Reichman, N. E. (2012).\nDevelopmental outcomes of late-preterm infants at 2 and 4 years.Matern. Child\nHealth J.16, 1612–1624. doi: 10.1007/s10995-011-0853-2\nO’Sullivan, L. P., Goubet, N., and Berthier, N. L. (2012). L ’atteinte de l’objet chez\nl’enfant né prématuré (Object reaching in premature-born child). Enfance 64,\n25–34.\nPetkovic, M., Chokron, S., and Fagard, J. (2016). Visuo-manual coordination in\npreterm infants without neurological impairments. Res. Dev. Disabil.5, 76–88.\ndoi: 10.1016/j.ridd.2016.01.010\nPiaget, J. (1936). Origins of Intelligence in the Child. London: Routledge & Kegan\nPaul.\nPiek, J. P., Dawson, L., Smith, L. M., and Gasson, N. (2008). The role of early ﬁne\nand gross motor development on later motor and cognitive ability. Hum. Mov.\nSci. 27, 668–681. doi: 10.1016/j.humov.2007.11.002\nRat-Fischer, L., O’Regan, J. K., and Fagard, J. (2012). The emergence of tool\nuse during the second year of life. J. Exp. Child Psychol.113, 440–446. doi:\n10.1016/j.jecp.2012.06.001\nRicci, D., Cesarini, L., Gallini, F., Serrao, F., Leone, D., Baranello, G., et al. (2010).\nCortical visual function in preterm infants in the ﬁrst year. J. Pediatr. 156,\n550–555. doi: 10.1016/j.jpeds.2009.10.042\nRönnqvist, L., and Domellöf, E. (2006). Quantitative assessment of right and left\nreaching movements in infants: a longitudinal study from 6 to 36 months. Dev.\nPsychobiol. 48, 444–459. doi: 10.1002/dev.20160\nRose, S. A., Feldman, J. F., and Jankowski, J. J. (2001). Attention and recognition\nmemory in the 1st year of life: a longitudinal study of preterm and full-term\ninfants. Dev. Psychol.37, 135–151. doi: 10.1037/0012-1649.37.1.135\nSansavini, A., Guarini, A., Justice, L. M., Savini, S., Broccoli, S., Alessandroni, R.,\net al. (2010). Does preterm birth increase a child’s risk for language impairment?\nEarly Hum. Dev.86, 765–772. doi: 10.1016/j.earlhumdev.2010.08.014\nSansavini, A., Guarini, A., Savini, S., Broccoli, S., Justice, L., Alessandroni, R.,\net al. (2011). Longitudinal trajectories of gestural and linguistic abilities in very\npreterm infants in the second year of life. Neuropsychologia 49, 3677–3688. doi:\n10.1016/j.neuropsychologia.2011.09.023\nSansavini, A., Pentimonti, J., Justice, L., Guarini, A., Savini, S., Alessandroni, R.,\net al. (2014). Language, motor and cognitive development of extremely preterm\nchildren: modeling individual growth trajectories over the ﬁrst three years of\nlife. J. Commun. Disord.49, 55–68. doi: 10.1016/j.jcomdis.2014.02.005\nShah, D. K., Anderson, P. J., Carlin, J., Pavlovic, M., Howard, K., Thompson, D. K.,\net al. (2006). Reduction in cerebellar volumes in preterm infants: relationship to\nwhite matter injury and neurodevelopment at two years of age. Pediatr. Res.60,\n97–102. doi: 10.1203/01.pdr.0000220324.27597.f0\nSmitsman, A. W., and Cox, R. F. A. (2008). Perseveration in tool use: a window\nfor understanding the dynamics of the action-selection process. Infancy 13,\n249–269. doi: 10.1080/15250000802004379\nSomogyi, E., Ara, C., Gianni, E., Rat-Fischer, L., Fattori, P., O’Regan, J. K., et al.\n(2015). The roles of observation and manipulation in learning to use a tool.\nCogn. Dev.35, 186–200. doi: 10.1016/j.cogdev.2015.06.002\nTeplin, S. W., Burchinal, M., Johnsonmartin, N., Humphry, R. A., and Kraybill,\nE. N. (1991). Neurodevelopmental, health, and growth status ar age 6 years of\nchildren with birth weights less than 1000 grams. J. Pediatr.118, 768–777. doi:\n10.1016/S0022-3476(05)80045-9\nTimmann, D., and Daum, I. (2007). Cerebellar contributions to cognitive\nfunctions: a progress report after two decades of research. Cerebellum 6, 159–\n162. doi: 10.1080/14734220701496448\nToledo, A. M., and Tudella, E. (2008). The development of reaching\nbehavior in low-risk preterm infants. Infant Behav. Dev. 31, 398–407. doi:\n10.1016/j.infbeh.2007.12.006\nVan Braeckel, K., Butcher, P. R., Geuze, R. H., van Duijn, M. A., Bos, A. F., and\nBouma, A. (2010). Diﬀerence rather than delay in development of elementary\nvisuomotor processes in children born preterm without cerebral palsy: a quasi-\nlongitudinal study. Neuropsychology 24, 90–100. doi: 10.1037/a0016804\nvan Leeuwen, L., Smitsman, A., and van Leeuwen, C. (1994). Aﬀordances,\nperceptual complexity, and the development of tool use. J. Exp. Psychol. Hum.\nPercept. Perform.20, 174–191.\nVicari, S., Caravale, B., Carlesimo, G. A., Casadei, A. M., and Allemand, F.\n(2004). Spatial working memory deﬁcits in children at ages 3-4 who were low\nbirth weight, Preterm Infants. Neuropsychology 18, 673–678. doi: 10.1037/0894-\n4105.18.4.673\nVolpe, J. J. (2009). Brain injury in premature infants: a complex amalgam of\ndestructive and developmental disturbances. Lancet Neurol. 8, 110–124. doi:\n10.1016/S1474-4422(08)70294-1\nWillatts, P. (1999). Development of means–end behavior in young infants:\npulling a support to retrieve a distant object. Dev. Psychol. 35, 651–667. doi:\n10.1037/0012-1649.35.3.651\nConﬂict of Interest Statement: The authors declare that the research was\nconducted in the absence of any commercial or ﬁnancial relationships that could\nbe construed as a potential conﬂict of interest.\nThe reviewer CR and handling Editor declared their shared aﬃliation, and the\nhandling Editor states that the process nevertheless met the standards of a fair and\nobjective review.\nCopyright © 2016 Petkovic, Rat-Fischer and Fagard. This is an open-access article\ndistributed under the terms of the Creative Commons Attribution License (CC BY).\nThe use, distribution or reproduction in other forums is permitted, provided the\noriginal author(s) or licensor are credited and that the original publication in this\njournal is cited, in accordance with accepted academic practice. No use, distribution\nor reproduction is permitted which does not comply with these terms.\nFrontiers in Psychology | www.frontiersin.org 9 July 2016 | Volume 7 | Article 1104"
}