{
  "title": "Load Control Using Sensitivity Identification by Means of Smart Transformer",
  "url": "https://openalex.org/W2529186219",
  "year": 2016,
  "authors": [
    {
      "id": "https://openalex.org/A2082956346",
      "name": "Giovanni De Carne",
      "affiliations": [
        "Kiel University"
      ]
    },
    {
      "id": "https://openalex.org/A2064389746",
      "name": "Giampaolo Buticchi",
      "affiliations": [
        "Kiel University"
      ]
    },
    {
      "id": "https://openalex.org/A1981475371",
      "name": "Marco Liserre",
      "affiliations": [
        "Kiel University"
      ]
    },
    {
      "id": "https://openalex.org/A5113786508",
      "name": "Constantine Vournas",
      "affiliations": [
        "National Technical University of Athens"
      ]
    },
    {
      "id": "https://openalex.org/A2082956346",
      "name": "Giovanni De Carne",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2064389746",
      "name": "Giampaolo Buticchi",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A1981475371",
      "name": "Marco Liserre",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A5113786508",
      "name": "Constantine Vournas",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W1599680004",
    "https://openalex.org/W2070207746",
    "https://openalex.org/W2152560253",
    "https://openalex.org/W2116751355",
    "https://openalex.org/W2108829714",
    "https://openalex.org/W2060472803",
    "https://openalex.org/W1526984457",
    "https://openalex.org/W1575602259",
    "https://openalex.org/W2037691098",
    "https://openalex.org/W1580167679",
    "https://openalex.org/W2166226698",
    "https://openalex.org/W2526981415",
    "https://openalex.org/W2031329484",
    "https://openalex.org/W1540186654",
    "https://openalex.org/W2527281210",
    "https://openalex.org/W4247689375",
    "https://openalex.org/W2063194390",
    "https://openalex.org/W2438616010",
    "https://openalex.org/W1970706794",
    "https://openalex.org/W2442002586",
    "https://openalex.org/W4212821273",
    "https://openalex.org/W2427306935",
    "https://openalex.org/W4245483807",
    "https://openalex.org/W2125322364",
    "https://openalex.org/W1763243278"
  ],
  "abstract": "The higher variability introduced by distributed generation leads to fast changes in the aggregate load composition, and thus in the power response during voltage variations. The smart transformer, a power electronics-based distribution transformer with advanced control functionalities, can exploit the load dependence on voltage for providing services to the distribution and transmission grids. In this paper, two possible applications are proposed: 1) the smart transformer overload control by means of voltage control action and 2) the soft load reduction method, that reduces load consumption avoiding the load disconnection. These services depend on the correct identification of load dependence on voltage, which the smart transformer evaluates in real time based on load measurements. The effect of the distributed generation on net load sensitivity has been derived and demonstrated with the control hardware in loop evaluation by means of a real time digital simulator.",
  "full_text": "  \n                                                                                         \n \n \n \n© 2016 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for \nall other uses, in any current or future media, including reprinting/republishing this material for \nadvertising or promotional purposes, creating new collective works, fo r resale or redistribution to \nservers or lists, or reuse of any copyrighted component of this work in other works.  \n \nDigital Object Identifier (DOI): 10.1109/TSG.2016.2614846 \n \n \nIEEE Transactions on Smart Grid (Volume:PP, Issue:99) October  2016 \nLoad Control using Sensitivity Identification by means of Smart Transformer \n \nGiovanni De Carne \nGiampaolo Buticchi \nMarco Liserre \nCostas Vournas \n \nSuggested Citation \nG. De Carne; G. Buticchi; M. Liserre; C. Vournas, \"Load Control using Sensitivity Identification by \nmeans of Smart Transformer,\" in IEEE Transactions on Smart Grid , vol.PP, no.99, pp.1-1 \n1\nLoad Control using Sensitivity Identiﬁcation\nby means of Smart Transformer\nGiovanni De Carne,Student Member, IEEE,Giampaolo Buticchi,Member, IEEE,Marco Liserre,Fellow, IEEE,\nand Costas V ournas,Fellow, IEEE\nAbstract—The higher variability introduced by distributed\ngeneration leads to fast changes in the aggregate load compo-\nsition, and thus in the power response during voltage variations.\nThe Smart Transformer, a power electronics-based distribution\ntransformer with advanced control functionalities, can exploit\nthe load dependence on voltage for providing services to the\ndistribution and transmission grids. In this paper two possible\napplications are proposed: the Smart Transformer overload\ncontrol by means of voltage control action, and the Soft Load\nReduction method, that reduces load consumption avoiding\nthe load disconnection. These services depend on the correct\nidentiﬁcation of load dependence on voltage, which the Smart\nTransformer evaluates in real time based on load measurements.\nThe effect of the distributed generation on net load sensitivity\nhas been derived and demonstrated with the Control Hardware\nIn Loop evaluation by means of a Real Time Digital Simulator.\nIndex Terms—Smart Transformer, Solid State Transformer,\nload voltage sensitivity, load reduction, overload control.\nI. INTRODUCTION\nT\nHE penetration of Distributed Generation (DG), mostly\nbased on renewable energy sources (RES), has increased\nthe demand variability in the power grid [1]. The DG vari-\nability can impact adversely the control actions on the grid.\nFor instance, voltage control for stability purposes [2][3],\nor voltage and frequency regulation [4][5], without a proper\nunderstanding of the aggregate load active and reactive power\nresponse to voltage variations, may lead to an incorrect esti-\nmate of grid stability [6]. Particular attention in the lastyears\nhas been given to the Conservation V oltage Reduction (CVR)\nmethod, where energy saving can be achieved by decreasing\nthe voltage in the grid [7][8]. However, in all the above cases\nthe load sensitivities to voltage variation are assumed known\na priori and are not evaluated in real time. Thus a proper\nidentiﬁcation of load sensitivity with respect to voltage is of\nvital importance for correct control actions.\nThe load dependence on voltage has been object of study in\nthe literature for many years [9][10][11]. Identifying theload\nactive and reactive power response to voltage and frequency\nvariations, however, presents several challenges. Even when\nthe behavior of the single load is well known in the lab, or\nThe research leading to these results has received funding from the\nEuropean Research Council under the European Union’s Seventh Framework\nProgramme (FP/2007-2013) / ERC Grant Agreement n. [616344] - HEART.\nGiovanni De Carne, Giampaolo Buticchi, Marco Liserre are with the Chair\nof Power Electronics, University of Kiel, Kiel, Germany, e-mail: gdc@tf.uni-\nkiel.de\nCostas V ournas is with the School of Electrical and Computer En-\ngineering, National Technical University, Athens, Greece, email: vour-\nnas@power.ece.ntua.gr\nin simulation, the aggregate load sensitivity to voltage isdif-\nﬁcult to be evaluated. Two approaches have been adopted for\nidentifying the aggregate load characteristic: the component-\nbased method, and the measurement-based method [6], [12]-\n[13]. The ﬁrst approach implies experimental tests of load\ncomponents and then aggregating them in composite loads\n[14]. In the second approach the measurements are taken from\nthe ﬁeld and the parameters of the loads are estimated by\nﬁtting methods [15]. The latter approach is largely employed\nby utilities due to the availability of ﬁeld measurements [16].\nThe aforementioned methods require a long data history and\nare computationally demanding. This represents a limitation\nfor on-line control actions due to the high variability of DG,\nand load composition.\nThe Smart Transformer (ST) is a power electronic trans-\nformer [17]. It enables the control of voltage amplitude and\nfrequency of low voltage (LV) grid independently from the\nmedium voltage (MV) grid (Fig. I). The ST can offer additional\nservices to the LV grid, such as voltage balancing in presence\nof unbalanced loads, and interaction with the local loads and\ngenerators to avoid overload conditions [18][19]. When the\nOn-Line Load Identiﬁcation method [20] is implemented in\na ST, the load active and reactive power response to voltage\nand frequency variation can be evaluated in real time, and\nsubsequent corrective control actions can take into account\nthe actual load response.\nSmart Transformer\nFig. 1. Three-stages Smart Transformer in a LV AC distributiongrid.\nThis paper introduces the mathematical and experimental\nveriﬁcation of on-line load sensitivity identiﬁcation including\nthe effect of DG on the evaluated voltage sensitivities. It is\ndemonstrated how, in the presence of DG, the aggregate load\ndependence on voltage increases with respect to the passive\nload case. The On-Line Load Identiﬁcation method is used in\nthe paper for two services: the Soft Load Reduction following\na request by the system operator, and the V oltage-Based Over-\nload Control of the ST. The ﬁrst application is an alternative\nto the ﬁrm load shedding method. It reduces the consumed\npower by means of voltage variation without disconnecting\nthe load in the LV grid. In the second application, the correct\n2\nLV\nGrid\nMV\nGrid\nLoad\nIdentiﬁcation\nand Control\nPower ﬂow\nController\nPower and\nMVDC link\nController\nCurrent\nController\nV oltage and\nCurrent\nController\nFig. 2. Smart Transformer control scheme.\nidentiﬁcation of voltage load sensitivity allows calculating the\nappropriate voltage variation to alleviate the overload ofthe\nST. If the load is constant impedance, a voltage decrease leads\nto current decrease [18]; on the contrary, with constant power\nload the voltage decrease worsens the ST overload, increasing\nthe current.\nThe paper is structured as follows: in Section II the ST\nconcept and control is described; the operation principle of the\nOn-Line Load Identiﬁcation method and the inﬂuence of DG\nin the sensitivity measurement are described in Section III.\nThe services offered by the Load Identiﬁcation and Control\nare introduced in Section IV . Their experimental veriﬁcation\nis performed with the Control-Hardware-In-Loop (CHIL) con-\ncept by means of a Real Time Digital Simulator (RTDS) in\nSection V . In Section VI the accuracy analysis of the On-\nLine Load Identiﬁcation and the experimental veriﬁcation of\nthe effect of DG on the voltage sensitivity measurement are\ndiscussed. Finally Section VII draws the conclusions.\nII. THE SMART T RANSFORMER C ONCEPT\nThe Smart Transformer is a three-stage power electronics\ntransformer [17][21] that adapts the voltage between the MV\nto the LV grid and provides new services to the distribution\ngrid. Although several topology solutions can be studied for\neach stage [22], the control strategies do not differ substan-\ntially. In fact there is no indication for a preferred topology due\nto the fact that the ST must adapt itself to the grid to which\nit is connected (grounding, voltage level, number of phases).\nThe LV side provides symmetrical voltage waveforms in the\nLV grid. The amplitude and shape of the current waveform is\ndetermined solely by the load. The DC/DC converter performs\ntwo tasks: (i) transforms the voltage from MV to LV and (ii)\ncontrols the voltage value of the LV DC link, thus keeping the\nbalance between input and output active power. The MV side\nkeeps the MV DC link voltage ﬁxed to the nominal value,\nexchanging the needed power in the MV grid. The control\nstrategy of the ST is shown in Fig. I.\nIn addition to controlling the voltage in the MV DC link, the\nMV converter controls also the reactive power injection in the\nMV grid. In ordinary conditions, the ST works with constant\npower factor, setting the reactive power reference to zero.In\ncase ancillary services are requested from the ST (for instance\nvoltage support in the MV grid), the ST can provide reactive\npower. The reactive power set-point can be evaluated locally\nby means of a V/Q droop controller curve, or set remotely\nfrom a centralized controller.\nThe DC/DC regulates the power ﬂow between the two DC\nstages keeping the LV DC link voltage constant to the nominal\nvalue. The reference power is limited between thePmax,\ndetermined by the ST rating, andPmin. The value ofPmin can\nbe set equal to− Pmax (allowing bi-directional ﬂow), or equal\nto zero, if a limitation of reverse power ﬂow is desired. In this\ncase, the interaction with the local generation, for example by\nmeans of frequency variation [23], is necessary.\nThe LV converter is controlled by means of a voltage and a\ncurrent control loops, in order to keep the voltage waveform\nsinusoidal with constant amplitude and frequency under any\nload condition. In this application the voltage waveform ref-\nerence is given by the On-Line Load Identiﬁcation controller\n(Fig. I, red box), explained in the next section.\nIII. ON -LINE L OAD IDENTIFICATION\nA. Load Sensitivity Measurement\nThe basic idea of the On-Line Load Identiﬁcation method\nis to apply a ramp variation of the chosen variable (voltage or\nfrequency) by means of the ST, and measure the active and\nreactive power consumption during the ramp, in order to com-\npute the voltage and frequency load sensitivity coefﬁcients. In\nthis paper only the voltage dependence of active and reactive\npower of load has been considered.\nThe load sensitivity to voltage is normalized as follows\nKp = ∆ P/P 0\n∆ V/V 0\nKQ = ∆ Q/Q 0\n∆ V/V 0\n(1)\nwhere P0, Q0, V0 are respectively the values of the active\nand reactive powers andRMS voltages at the ST busbar at\nthe time the measurement is taken;∆ P and ∆ Q the active\nand reactive power variations following the voltage disturbance\n∆ V . If the exponential model is used, i.e. if it is assumed that:\nP = P0 (V/V 0)Kp\nQ = Q0 (V/V 0)Kq\n(2)\nthen the load voltage sensitivitiesKp and Kq deﬁned in (3)\nare equal to the corresponding exponents of (2) [24].\n3\nIn order to evaluate the voltage sensitivity coefﬁcients of\nthe grid load, the control logic in Fig. 3 is applied. The On-\nLine Load Identiﬁcation controller (Fig. I, red box) applies\na trapezoidal voltage disturbance as described in [20]. At\nspeciﬁed time instants during the voltage variation the ST\nmeasures the line currents and phase-to-ground voltages. Then\nthe single-phase active and reactive powersP and Q are\nevaluated and stored in memory together with theRMS\nvoltageV . Using the measured values at timetk and the\nprevious time instanttk− 1, the sensitivities at timetk are\ncomputed as in [20]:\nKp =\nP (tk)− P (tk− 1)\nP (tk− 1)\nV (tk)− V (tk− 1)\nV (tk− 1)\nKq =\nQ(tk)− Q(tk− 1)\nQ(tk− 1)\nV (tk)− V (tk− 1)\nV (tk− 1)\n(3)\nand stored in memory.\nThis sequence is repeated in the following time instant until\nthe end of the voltage ramp. The ﬁnal value of the sensitivities\nis obtained averaging all the values stored during the time\nwindow considered.\nFig. 3. Flow chart of the V oltage On-Line Load Identiﬁcationmethod\nB. Effect of DG in voltage sensitivity values\nWhen a signiﬁcant DG penetration is present, a marked\neffect on the sensitivity of the net feeder load is expected.This\nsection is focused on the active power sensitivities, assuming\nthat the DG is operating at unity power factor so thatQG = 0 .\nAssuming a feeder with connected loadPL and distributed\ngenerationPG < P L (i.e. the feeder is still providing power)\nthe net load seen by the feeder is:\nP0 = PL − PG > 0 (4)\nif the loadPL has a normalized voltage sensitivityKp,L:\nKp,L = ∆ PL/P L\n∆ V/V 0\n(5)\nand the active power of the DG is insensitive to voltage\n(considering negligible its contribution to the losses), i.e.\nKp,G = 0 , the net feeder load changes for a voltage distur-\nbance ∆ V as follows:\n∆ P = ∆ PL = Kp,L (∆ V/V 0) PL (6)\nUsing (3), (5) and (6) the apparent feeder load sensitivity\nis given by:\nKp = ∆ P/P 0\n∆ V/V 0\n= Kp,L\nPL\nPL − PG\n(7)\nThe net load sensitivity is used in order to estimate the\neffectiveness of voltage reduction in controlling feeder load\n(as will be discussed in the next section) and it depends on the\n(unknown a priori) DG penetration. Clearly (7) is meaningless\nwhen the DG penetration is close or exceeds100 %. If the DG\nis participating in voltage regulation, a more detailed analysis\nis necessary to model the coordination between feeder and DG\nvoltage control and to incorporate the effect ofQG in overall\nload behavior.\nIV. LOAD IDENTIFICATION A PPLICATIONS\nThe On-line Load Identiﬁcation and Control is represented\nwith more details in Fig. 4. At each time step, the controller\nmeasures current and voltage from the ST ﬁlter and performs\na ﬁrst security check on the power, voltage and current limits.\nIf the ST receives the request of load reduction, it triggersthe\nSoft Load Reduction control. If the security current limit of\nST is exceeded (here ﬁxed at95 % of the maximum current),\nST limit controller overrides any control action and triggers\nthe V oltage-Based Overload Control (see Section IV .B).\nA. Soft Load Reduction control\nLoad shedding is an extreme measure to be adopted when\nthe stability of the grid can be compromised due to severe\ncontingencies: faults, generators disconnections, linestripping\n[25]. However, ﬁrm load shedding is a harmful measure for the\ndisconnected customers and incurs considerable costs. [26].\nThe ST can decrease the consumed load active power by\ncontrolling the voltage in the LV grid in accordance with load\nsensitivity, thus realizing a softer load reduction. The accuracy\nof this method depends on the knowledge of the load active\npower dependence on voltage. In order to guarantee to the\nTransmission (TSO) and Distribution System Operator (DSO)\na pre-speciﬁed load reduction, an accurate analysis of the\nload sensitivity is needed. The On-Line Load Identiﬁcation\ncan perform this analysis and provide accurate data on load\ncomposition, and thus an accurate load reduction when needed.\n4\nP, V , I\nLimit\nController\nLoad\nIdentiﬁcation\nV oltage and Current\nController\nLoad Identiﬁcation and Control\nLV\nGrid\nFig. 4. Load Identiﬁcation and Control scheme\nIn an unbalanced three-phase system it is possible that\neach phase has a different load sensitivity. Thus the proposed\nalgorithm evaluates separately the sensitivitiesKP and KQ of\neach phase, using a simultaneous balanced three-phase load\ndisturbance. Assuming a required percentage of load reduction\n0 < γ < 1, the desired load change will be:\n∆ P = ∆ PA + ∆ PB + ∆ PC = − γ(PA + PB + PC ) (8)\nwhere PA, P B, P C are the initial consumed active powers\nin each phase and∆ PA, ∆ PB, ∆ PC , ∆ P the corresponding\nphase and total load variations.\nApplying (3) to all three phases:\n∆ PA = PA\nVA\nKpA(V − VA)\n∆ PB = PB\nVB\nKpB(V − VB)\n∆ PC = PC\nVC\nKpC (V − VC )\n(9)\nthe voltage to be applied for achieving a speciﬁed power\nvariation∆ P is:\nV = ∆ P + (PAKpA + PBKpB + PC KpC )\nPA\nVA\nKpA + PB\nVB\nKpB + PC\nVC\nKpC\n(10)\nThe ST is able to impose three phase voltages with equal\namplitude independently from the load, so that (10) can be\nsimpliﬁed assumingVA = VB = VC = V0. The voltage\nvariation to be applied in p.u. is now deﬁned with the formula:\nV\nV0\n= 1 + ∆ P\nPAKpA + PBKpB + PC KpC\n(11)\nIf the ST receives the request to curtail a certain amount of\nactive power and the voltage to be applied does not exceed\nneither the minimum nor the maximum voltage limit, the Load\nIdentiﬁcation and Control controller applies (11).\nB. ST Overload Control\nThe basic idea for controlling the overload conditions in\nthe ST is to modify the voltage in the LV grid in order to\nreduce the current ﬂowing in the ST. This technique has been\napplied in [18] assuming the load as constant impedance and\ndecreasing the voltage in order to reduce the load consumption.\nHowever, if the same control action is applied in a grid where\nthe loads behave in the direction of constant power load, it\nwill increase the current ﬂowing in the ST. Computing the\nload sensitivities, the overload conditions are alleviated in\nreal time by adapting the voltage in the grid appropriately.\nIf the ST security current limit is exceeded in one phase, the\nlimit controller triggers the V oltage-Based Overload Control.\nThe On-Line Load Identiﬁcation evaluates the active and\nreactive power sensitivities and decides to increase or decrease\nthe voltage. Since the behavior of load active power can\nbe different from that of reactive power, in this section the\nsensitivity of current with respect to voltage is evaluatedfor\neach phase taking into account both sensitivities. It is worth\nmentioning that the current sensitivity can also be determined\nby direct measurement. However, it is demonstrated in this\nsection that the active and reactive power sensitivities are\nsufﬁcient to reconstruct the sensitivity of the current.\nIn order to apply a balanced control action, the voltage\nvariation to be applied to control ST overload must be the\nsame in all phases. Consider the current and apparent power\nequations for one of the phases:\nI = S/V\nS2 = P 2 + Q2 (12)\nwhich are linearized by taking ﬁrst order partial derivatives\nand assuming small variations (marked with preﬁx∆ ) around\nthe operating pointV0,S0 (P0,Q0):\n∆ I = ∆ S/V 0 − (S0/V 2\n0 )∆ V (13)\n2S0∆ S = 2 P0∆ P + 2Q0∆ Q (14)\nSubstituting (3) and (14) in (13), the current variation follow-\ning a voltage variation is obtained:\n∆ I =\n[\n(P0/S 0)2Kp + (Q0/S 0)2Kq − 1\n]\n(S0/V 2\n0 )∆ V\n(15)\nThe equivalent voltage sensitivity coefﬁcient of currentKi can\nbe calculated as follows:\nKi = ( cosϕ 0)2Kp + (sinϕ 0)2Kq − 1 (16)\nThus the per unit current response to voltage changes is\ndeﬁned with the formula:\n∆ I/I 0 = Ki∆ V/V 0 (17)\nOnce the equivalent sensitivity of the apparent power is known,\nthe voltage variation to be applied can be calculated using:\nif I > I sec\nV\nV0\n= 1 +\n( Isec − ILV\nIsec\n)\n/K i\n(18)\nwhere Isec is the security current limit, at which the V oltage-\nBased Overload Control is triggered. Note that each time the\nabove condition holds for one phase, the newV is applied\nto all three phases simultaneously. If the corrective voltage\naction calculated in one phase leads to overload another phase,\n5\na single-phase voltage control must be applied, following the\nvoltage sensitivity of that speciﬁc overloaded phase. However,\nthis should be used as last resort, due to the application of\nintentionally unbalanced voltage and the following decrease\nof power quality in the grid. In this application theIsec has\nbeen set equal to95 % of the ST maximum current. IfKi\nis positive, corresponding to a load condition in the constant\nimpedance direction, the ST decreases the voltage to deal with\nthe overload. IfKi is negative, the case of constant power\nloads, the ST increases the voltage. For conditions whereKi =\n0, meaning a constant current load, other control strategies\nshould be applied, i.e. Frequency-Based Overload Control with\ncontrollable resources [18].\nC. Feasibility range of the voltage variation\nThe requested variation of the grid voltage may be not\ncompatible with the ST design under some conditions. The\nST controls the ﬁlter capacitor voltage. Due to the voltage\ndrop on the ﬁlter inductor caused by high current with low\npower factor, the voltage request before the ﬁlter may be\nhigher than the DC link voltage. In this analysis, the worst\ncase scenario has been assumed. The current request from\nthe load is kept constant and at the maximum current limit\n(145 Arms). The ratio between the ST output peak voltage\nbefore the ﬁlter and the half of DC-link voltage (400 V) has\nbeen plotted in Fig. IV-C, varying the voltage variation request\nand the power factor of the net load. As can be noticed, the\nratio exceeds the1 pu value (ﬂat gray surface in Fig. IV-C) in\ncase of high voltage variation request (above0. 07 pu) and low\npower factor (below0. 9 pu, inductive). The ST parameters are\nlisted in Table I.\nInductive\nCapacitive\nVoltage Ratio (pu)\n0.8\n0.8\nFig. 5. Feasibility range of the voltage variation: voltageratio between the\nST output peak voltage and LV DC link voltage, depending on the voltage\nvariation request and the net load power factor. The infeasibility region is\nmarked with a gray area. The current is assumed constant to the maximum\nlimit (145 Arms).\nV. EXPERIMENTAL E VALUATION OF PROPOSED CONTROLS\nA. Experimental Setup\nThe experimental veriﬁcation of ST Load Identiﬁcation and\nassociated services has been performed with the CHIL method\nby means of a RTDS system in the lab setup described in\nFig. V-A. The ST-fed grid, shown in Fig. 7, is implemented\nin RSCAD, the RTDS software. The ST control scheme de-\nscribed in Fig. I is implemented in dSPACE. The ST topology\nconsidered is an IGBT-based Neutral Point Clamped (NPC)\nconverter, due to the availability of the neutral conductor\nconnection in the DC link. The IGBT switches have the\nrating current of145 A and maximum voltage equal to1200 V ,\nand they are implemented as equivalent model in RTDS for\nreal time applications, as described in [27]. The switching\nfrequency of the single IGBT is5 kHz and Phase Disposition\nPWM (PD-PWM) technique has been implemented in RTDS\nin order to balance the DC link capacitors voltage. The\nmodulation signals are sent by dSPACE to RTDS, where the\nPD-PWM is performed. The switching dead-time considered is\none time step delay of the small time-step model of RTDS, in\nthis case1. 73 µ s. The grid load consist of a balanced constant\nimpedance loads, indicated withZL, an induction machine\nIm1, and unbalanced constant power loads, as described in\nFig. 7 and listed in Table II.\nFig. 6. Control-Hardware-In-Loop setup by means of RTDS and dSPACE\nrealized in lab.\nTABLE I\nSMART T RANSFORMER DATA\nST parameter Value Grid Parameter Value\nSST 100 kV A Vrms 230\nCLV 100 µ F V DC\nLV 800 V\nLLV 0. 5 mH\nB. Soft Load Reduction\nIn this section, the application of the On-Line Load Iden-\ntiﬁcation for Soft Load Reduction purpose is shown. The ST\nperforms load identiﬁcation every20 s (in a real application\nthis could be every5 − 10 minutes) and evaluates in real\ntime the amount of voltage drop to be applied for achieving a\n5 % reduction of the load. A signiﬁcant source of variability\nregarding voltage sensitivity is the varying power injection\nfrom uncontrolled DG. Thus, in order to introduce variability\nin the grid, the PV active power curves shown in Fig. 8 have\nbeen implemented in the two photovoltaic power plants in\nFig. 7. The ramp voltage adopted in this study case to measure\n6\nZL\nZL\nZL\nZL\nZL\nZL\nZL\nZL\nZL\nPWM\nFig. 7. ST-fed grid implemented in RSCAD and CHIL description\nTABLE II\nST-FED GRID DATA\nLoad Variable Phase A Phase B Phase C\nL1\nApparent Power (kV A) 1 2 . 0 2 . 7\nPower Factor (pu) 0. 85 0 . 85 0 . 85\nL2\nApparent Power (kV A) 4. 8 6 . 4 8 . 0\nPower Factor (pu) 0. 85 0 . 85 0 . 85\nL3\nApparent Power (kV A) 4. 8 6 . 4 8 . 0\nPower Factor (pu) 0. 85 0 . 85 0 . 85\nL4\nApparent Power (kV A) 0 0 2 . 7\nPower Factor (pu) 1. 0 1 . 0 0 . 85\nL5\nApparent Power (kV A) 1. 6 3 . 2 4\nPower Factor (pu) 0. 85 0 . 85 0 . 85\nZL\nApparent Power (kV A) 0. 66 0 . 66 0 . 66\nPower Factor (pu) 0. 9 0 . 9 0 . 9\nIm1\nApparent Power (kV A) 4. 0 4 . 0 4 . 0\nPower Factor (pu) 0. 8 0 . 8 0 . 8\nload sensitivity is− 0. 02 p.u. over a time window of0. 5 s\nand the total voltage disturbance lasts2 s. The time window\nas well as the magnitude of the voltage variation can vary\ndepending on the load connected in the grid (e.g., thermostatic\nloads and machines with long time constant). However two\nconstraints must be respected:i) a lower threshold to remove\nthe small voltage variations caused by stochastic load;ii) an\nupper ceiling not to impact on grid power quality during the\nmeasurement. As shown in Fig. 9, att = 100 s the ST receives\nthe signal from the TSO/DSO to reduce the load by5 % for\n100 s. The ST uses the active power sensitivities to voltage\nevaluated in the previous time interval (Fig. 9a) and applies a\nFig. 8. Photovoltaic power plants A (black) and B (red) powercurves.\nreduction of8 % of the voltage (Fig. 9b). The green line in\nFig. 9b is the bus8 voltage proﬁle, representing the lowest\nvoltage in the grid during the load reduction. It is shown how\nthe voltage is kept near0. 90 p.u., still acceptable considering\nthe emergency request of load reduction by the TSO/DSO.\nNote that the load is less sensitive to voltage variation in this\ncase than a constant current load (KP < 1). As can be noticed\nfrom Fig. 9c,d, the average of the load shed is near5 % for the\nthe entire time window. The voltage and the load active power\nare restored to the nominal value when the load reduction is\nnot needed any longer.\nC. ST Overload Control\nIn order to demonstrate the V oltage-Based Overload Control\nconcept the power curves described in Fig. 8 are applied to the\nPV plants. Att = 100 s the PVA is suddenly disconnected\nfrom the grid for100 seconds (Fig. 10a), causing a current\nincrease in the ST. If no control action is taken, the current\nof Phase C goes above the maximum current limit of the\nST (Fig. 10b, black line), equal to145 Arms (Fig. 10b, red\nline), corresponding to205 Apeak in sinusoidal conditions. If\nthe V oltage-Based Overload Control is applied in this case\ntogether with the On-Line Load Identiﬁcation, the voltage in\nall three phases is increased (Fig. 10c), decreasing the current\nbelow the maximum limit. It is worth noting that without a\nproper identiﬁcation of the load sensitivity a voltage variation\nmay worsen the overload condition of the ST, instead of\nalleviating it. In case of insufﬁcient control range (upperor\nlower voltage limit), the need for energy storage elements (i.e.,\nbatteries, diesel generators) becomes essential for solving the\nST overload.\nVI. EXPERIMENTAL ACCURACY EVALUATION\nA. Case studies\nIn this section the experimental veriﬁcation of the On-Line\nLoad Identiﬁcation accuracy is presented. Three test caseshave\nbeen analyzed: in Test CaseA, the grid works in steady state\n7\nActive Power (MW)\nVoltage (pu)\nActive Power Sensitivity (pu)\nLoad Reduction (%)\nTime (s)\nFig. 9. Soft Load Reduction: (a) active power exponential coefﬁcients\nevaluated in real time, (b) ST voltages and bus8 voltage (green line), (c)\nThree-phase active power at1 p.u. voltage (black line) and when the5 %\nload reduction is applied (red line), (d) load reduction in %.\nand the Photovoltaic plantA is producing20 kW with unity\npower factor. Photovoltaic plantB is shut down. A voltage\nvariation of− 0. 05 p.u. is applied to measure the real power\nconsumption and compare it with the estimated one calculated\nwith the On-Line Load Identiﬁcation method. In Test Case\nB, the conditions are the same as in Test CaseA, but with\na voltage variation of− 0. 10 p.u.. In this condition the non-\nlinearity of the load response in case of low voltage conditions\nis taken in account. In Test CaseC, the same conditions of\nTest CaseB are applied with the PVA power production set\nto 0 and purely passive grid. The test cases are summarized\nin Table III.\nIn all the three test cases On-Line Load Identiﬁcation is\nperformed and subsequently the voltage variation is applied\n(e.g., Fig. 11, Test CaseB). The results for the active and reac-\ntive power exponential coefﬁcients are shown in Table IV. As\nexpected the active power coefﬁcients tend to decrease in the\nFig. 10. Overload Control of ST: (a) PV power proﬁles, (b) Maximum current\n(red line), ST current without any applied control (black line), and ST current\nwith Overload Control and On-Line Load Identiﬁcation method(blue line),\n(c) ST voltages\nTABLE III\nA CCURACY EVALUATION T EST C ASES\nTest Case V oltage Variation (p.u.) PVA power (kW)\nA − 0. 05 20\nB − 0. 10 20\nC − 0. 10 0\nabsence of PV generation. This conﬁrms what demonstrated\nmathematically in Section III. The reactive power coefﬁcients\nremain unchanged due to the unity power factor operation of\nPV A. The accuracy of the On-Line Load Identiﬁcation can be\nevaluated by means of the comparison between the measured\npowers after the voltage step and the estimated ones, obtained\nfrom the calculated active and reactive power coefﬁcients.The\nrelative errors of the two active and reactive powers are listed\nin Table V. It can be noted how the relative errors never exceed\nthe 2 % in the worst case, and when the voltage change is\nreduced (i.e.,− 0. 05 p.u.) the relative errors decrease below\nthe 1 %. This is explained by the fact that the evaluation of\n8\nFig. 11. On-Line Load Identiﬁcation accuracy evaluation, Test Case B: (a)\nST voltages, (b) ST active powers, (c) ST reactive powers.\nTABLE IV\nC OEFFICIENTS VALUES .\nPhase Parameter Test Case A Test Case B Test Case C\nA Kp 0. 77 0 . 93 0 . 62\nKq 0. 35 0 . 34 0 . 29\nB Kp 0. 61 0 . 70 0 . 42\nKq 0. 21 0 . 25 0 . 21\nC Kp 0. 50 0 . 53 0 . 31\nKq 0. 07 0 . 17 0 . 15\nthe sensitivities are performed in a point (0. 98 p.u.) nearer to\nthe Test CaseA voltage variation point (0. 95 p.u.) than the\nTest CaseB and C voltage variation points (0. 90 p.u.).\nB. Impact of DG on active power sensitivity\nIn Fig. 12 the measured net load voltage sensitivities in\nthe three phases for varying DG (PV) generation are shown.\nFig. 13 shows the effect (measured active power reduction)\nof a voltage variation of− 0. 05 pu applied from100 s up to\n200 s. The blue line shows the actual load reduction using\nTABLE V\nR ELATIVE ERRORS BETWEEN THE EXPECTED POWER AND THE MEASURED\nONE AFTER THE VOLTAGE VARIATION (%).\nPhase Power Test Case A Test Case B Test Case C\nA PA 0. 3 1 . 2 1 . 6\nQA 0. 8 1 . 8 1 . 7\nB PB 0. 9 0 . 8 1 . 0\nQB 0. 6 1 . 3 1 . 4\nC PC 0. 5 1 . 3 0 . 2\nQC 0. 2 1 . 8 1 . 0\nthe photovoltaic power proﬁles shown in Fig. 8. The black\nline shows the expected load reduction using the sensitivities\nfound in Test CaseC (i.e. neglecting the effect of the DG in net\nload sensitivity). The red line is the estimated load reduction\nby the On-Line Load Identiﬁcation as applied in this paper. It\ntakes into account the DG inﬂuence, using the last computed\nsensitivity before the load reduction, as shown in Fig. 12. The\nsensitivity evaluation has been performed in this case every\n20 s excluding the time of voltage reduction.\nTime (s)\nFig. 12. V oltage dependence of net active power: sensitivity coefﬁcients in\nphase A (black line), phaseB (red line), and phaseC (blue line).\nAs can be noticed, if the effect of DG is ignored an underes-\ntimation of load reduction is expected during the voltage dip\n(average2. 12 % reduction), which is in line with what was\nfound in Test CaseC. On the other hand, when the DG is\ntaken into account in the net load, the expected load variation\n(average2. 65 %) has a better match to the average of the real\nload variation (2. 83 %) during the voltage step. The difference\nwith respect to the actual load reduction is due to the fact\nthat the voltage sensitivities are calculated before the load\nreduction and they do not change during the transient. The\nactual active load reduction curve is inﬂuenced instead from\nthe variable PV plants power production.\nThe results obtained in Fig. 13 conﬁrm the main advantage\nthat the On-Line Load sensitivity Identiﬁcation has with\nrespect to the approaches based on statistical evaluationsor\ninterpolation of long history data.\n9\nTime (s)\nFig. 13. Impact of DG on the voltage dependence of active power: a) load\nreduction estimation taking into account only passive load (black line);b)\nload reduction estimation using the On-Line Load Identiﬁcation (red line);c)\nactual load reduction with varying PV injection (blue line).\nVII. CONCLUSION\nThe Smart Transformer can provide additional services\nto the LV grids by controlling the output voltage, like the\nSoft Load Reduction control and the V oltage-Based Overload\nControl. The Soft Load Reduction technique enables to reduce\nthe load active power consumption when requested by the\nTSO/DSO without disconnecting any load in the grid, contrary\nto ﬁrm load shedding. The V oltage-Based Overload Control\navoids the overload conditions in the ST, acting on the\nconsumed power of the loads. However, these two services\ndepend on the load active and reactive power response to\nvoltage variations. The On-Line Load Identiﬁcation concept\ncan estimate in real time the load sensitivity to voltage\nvariations and provide more accurate control actions for these\ntwo services. The identiﬁcation takes into account also the\ninﬂuence of the DG on the voltage sensitivities, and thus\nidentiﬁes the real behavior of the net aggregate load in the\nLV grid. In this work the load identiﬁcation and control has\nbeen described and veriﬁed by means of CHIL with of RTDS.\nFinally the On-Line Load Identiﬁcation accuracy has been\nevaluated and veriﬁed by means CHIL, highlighting how the\nDG inﬂuences the voltage sensitivities measurements.\nR EFERENCES\n[1] E. K. Hart, E. D. Stoutenburg, and M. Z. Jacobson, “The potential of\nintermittent renewables to meet electric power demand: Current methods\nand emerging analytical techniques,”Proceedings of the IEEE, vol. 100,\nno. 2, pp. 322–334, Feb 2012.\n[2] P. Aristidou, G. Valverde, and T. Van Cutsem, “Contribution of dis-\ntribution network control to voltage stability: A case study,” IEEE\nTransactions on Smart Grid, vol. PP, no. 99, pp. 1–1, 2015.\n[3] G. Delille, L. Capely, D. Souque, and C. Ferrouillat, “Experimental\nvalidation of a novel approach to stabilize power system frequency\nby taking advantage of load voltage sensitivity,” inIEEE Eindhoven\nPowerTech, June 2015, pp. 1–6.\n[4] P. J. Douglass, R. Garcia-Valle, J. stergaard, and O. C. Tudora, “V oltage-\nsensitive load controllers for voltage regulation and increased load factor\nin distribution systems,”IEEE Transactions on Smart Grid, vol. 5, no. 5,\npp. 2394–2401, Sept 2014.\n[5] M. Farrokhabadi, C. A. Caizares, and K. Bhattacharya, “Frequency\ncontrol in isolated/islanded microgrids through voltage regulation,”IEEE\nTransactions on Smart Grid, vol. PP, no. 99, pp. 1–10, 2015.\n[6] W. Price, K. Wirgau, A. Murdoch, J. V . Mitsche, E. Vaahedi, and M. El-\nKady, “Load modeling for power ﬂow and transient stability computer\nstudies,”IEEE Transactions on Power Systems, vol. 3, no. 1, pp. 180–\n187, Feb 1988.\n[7] K. P. Schneider, J. Fuller, F. Tuffner, and R. Singh, “Evaluation of con-\nservation voltage reduction (cvr) on a national level,”Paciﬁc Northwest\nNational Laboratory report, 2010.\n[8] Z. Wang and J. Wang, “Review on implementation and assessment of\nconservation voltage reduction,”IEEE Transactions on Power Systems,\nvol. 29, no. 3, pp. 1306–1315, May 2014.\n[9] I. T. F. on Load Representation for Dynamic Perfomance, “Load\nrepresentation for dynamic performance analysis [of power systems],”\nIEEE Transactions on Power Systems, vol. 8, no. 2, pp. 472–482, May\n1993.\n[10] ——, “Standard load models for power ﬂow and dynamic performance\nsimulation,”IEEE Transactions on Power Systems, vol. 10, no. 3, pp.\n1302–1313, Aug 1995.\n[11] Z. Dong, A. Borghetti, K. Yamashita, A. Gaikwad, P. Pourbeik, and\nJ. Milanovic, “Recommendations on measurement based and component\nbased load modeling practice,” inCIGRE WG C4.605 , 2012.\n[12] P. Kundur,Power System Stability and Control. Electric Power Research\nInstitute, 1994.\n[13] P. Regulski, D. S. Vilchis-Rodriguez, S. Djurovi?, andV . Terzija,\n“Estimation of composite load model parameters using an improved\nparticle swarm optimization method,”IEEE Transactions on Power\nDelivery, vol. 30, no. 2, pp. 553–560, April 2015.\n[14] L. Hajagos and B. Danai, “Laboratory measurements and models\nof modern loads and their effect on voltage stability studies,”IEEE\nTransactions on Power Systems, vol. 13, no. 2, pp. 584–592, May 1998.\n[15] D. Han, J. Ma, R.-m. He, and Z. yang Dong, “A real application of\nmeasurement-based load modeling in large-scale power grids and its\nvalidation,”IEEE Transactions on Power Systems, vol. 24, no. 4, pp.\n1756–1764, Nov 2009.\n[16] J. Milanovic, K. Yamashita, S. Martinez Villanueva, S. Djokic, and\nL. Korunovic, “International industry practice on power system load\nmodeling,”IEEE Transactions on Power Systems, vol. 28, no. 3, pp.\n3038–3046, Aug 2013.\n[17] X. She, A. Huang, and R. Burgos, “Review of solid-state transformer\ntechnologies and their application in power distribution systems,”IEEE\nJournal of Emerging and Selected Topics in Power Electronics, vol. 1,\nno. 3, pp. 186–198, Sept 2013.\n[18] G. De Carne, G. Buticchi, M. Liserre, P. Marinakis, and C. V ournas,\n“Coordinated frequency and voltage overload control of smart trans-\nformers,” inIEEE PowerTech, 2015.\n[19] G. De Carne, G. Buticchi, M. Liserre, and C. V ournas, “Frequency-based\noverload control of smart transformers,” inIEEE PowerTech, 2015.\n[20] G. D. Carne, M. Liserre, and C. V ournas, “On-line load sensitivity\nidentiﬁcation in lv distribution grids,”IEEE Transactions on Power\nSystems, vol. PP, no. 99, pp. 1–1, 2016.\n[21] M. Liserre, G. Buticchi, M. Andresen, G. De Carne, L. Costa, and\nZ. Zhiziang, “The smart transformer: Impact on the electric grid and\ntechnology challenges,”IEEE Industrial Electronics Magazine, in press.\n[22] R. Pena-Alzola, G. Gohil, L. Mathe, M. Liserre, and F. Blaabjerg,\n“Review of modular power converters solutions for smart transformer\nin distribution system,” inIEEE Energy Conversion Congress and\nExposition (ECCE), Sept 2013, pp. 380–387.\n[23] G. Buticchi, G. D. Carne, D. Barater, Z. Zou, and M. Liserre,\n“Analysis of the frequency-based control of a master/slave micro-\ngrid,”IET Renewable Power Generation , June 2016. [Online].\nAvailable: http://digital-library.theiet.org/content/journals/10.1049/iet-\nrpg.2016.0167\n[24] T. Van Cutsem and C. V ournas,Voltage Stability of Electric Power\nSystems. Kluwer Academic Publishers, 1998.\n[25] C. W. Taylor, “Concepts of undervoltage load shedding for voltage\nstability,”IEEE Transactions on Power Delivery, vol. 7, no. 2, pp. 480–\n488, Apr 1992.\n[26] I. Industrial and C. P. S. Committee, “Report on reliability survey of\nindustrial plants, part ii: Cost of power outages, plant restart time, critical\nservice loss duration time, and type of loads lost versus time of power\noutages,”IEEE Transactions on Industry Applications, vol. IA-10, no. 2,\npp. 236–241, March 1974.\n[27] VSC Valves and Breakers, RTDS manual.\n10\nGiovanni De Carne Giovanni De Carne (S’14) was\nborn in Noci, Bari (Italy) in 1988. He received the\nbachelor and master degrees in Electrical Engineer-\ning from Politecnico di Bari (Italy) in 2011 and\n2013, respectively. In 2013, he started working on\nhis Ph.D. studies at the Chair of Power Electronics at\nUniversity of Kiel, Germany. He is currently work-\ning on his PhD ”Analysis of ST features for electric\ndistribution grid” within the ERC Grant project\n”Highly Reliable And Efﬁcient smart Transformer\n(HEART)”.\nGiampaolo Buticchi Giampaolo Buticchi (S’10-\nM’13) was born in Parma, Italy, in 1985. He received\nthe Masters degree in Electronic Engineering in\n2009 and the Ph.D degree in Information Technolo-\ngies in 2013 from the University of Parma, Italy. He\nis now working as a postdoctoral research associate\nat the University of Kiel, Germany. His research\narea is focused on power electronics for renewable\nenergy systems, smart transformer fed micro-grids\nand reliability in power electronics.\nMarco LiserreMarco Liserre, (S’00-M’02-SM’07-\nF13) is Full Professor and Head of the Chair of\nPower Electronics at the University of Kiel (Ger-\nmany). He has published over 200 technical papers\nand a book, for them he is listed in ISI Thom-\nson report The worlds most inﬂuential scientiﬁc\nminds. He has been awarded with an European ERC\nConsolidator Grant, one of the most prestigious in\nEurope, to make research about Smart Transformer.\nHe did serve IAS, PELS, PES and IES in various\ncapacities such as reviewer, associate editor, editor,\nconference chairman or track chairman and Vice-President. Hehas received\nseveral IEEE Awards.\nCostas Vournas Constantine (Costas) V ournas\n(S’77-M’87-SM’95-F’05) received the Diploma of\nElectrical and Mechanical Engineering from the\nNational Technical University of Athens (NTUA)\nin 1975, the M.Sc in Electrical Engineering from\nthe University of Saskatchewan, Saskatoon, Canada\nin 1978, and the NTUA Doctor of Engineering\ndegree in 1986. He is currently Professor in the\nElectrical Energy Systems Laboratory of the School\nof Electrical and Computer Engineering of NTUA.\nHe has co-authored the book V oltage Stability of\nElectric Power Systems. His research interests are in the area of power\nsystem dynamics, stability and control and include voltage stability and\nsecurity analysis, wind generator integration in power systems, novel control\napplications in the distribution and transmission grid, as well as the effect of\nderegulation on power system operation and control.",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.6636025309562683
    },
    {
      "name": "Distribution transformer",
      "score": 0.6339566111564636
    },
    {
      "name": "Smart grid",
      "score": 0.5584302544593811
    },
    {
      "name": "Voltage regulation",
      "score": 0.5232968926429749
    },
    {
      "name": "Voltage",
      "score": 0.4971325695514679
    },
    {
      "name": "Voltage reduction",
      "score": 0.484928160905838
    },
    {
      "name": "Tap changer",
      "score": 0.4748128652572632
    },
    {
      "name": "Computer science",
      "score": 0.4554142951965332
    },
    {
      "name": "Engineering",
      "score": 0.43869900703430176
    },
    {
      "name": "Electronic engineering",
      "score": 0.409162700176239
    },
    {
      "name": "Electrical engineering",
      "score": 0.3780764937400818
    }
  ]
}