{
    "title": "Advanced technology of transformer winding condition control based on nanosecond probing impulse",
    "url": "https://openalex.org/W2520602811",
    "year": 2016,
    "authors": [
        {
            "id": "https://openalex.org/A5004225597",
            "name": "Valeriy A. Lavrinovich",
            "affiliations": [
                "National Research Tomsk State University",
                "Tomsk Polytechnic University"
            ]
        },
        {
            "id": "https://openalex.org/A5006963064",
            "name": "Alexey V. Mytnikov",
            "affiliations": [
                "National Research Tomsk State University",
                "Tomsk Polytechnic University"
            ]
        },
        {
            "id": "https://openalex.org/A5088333603",
            "name": "Hongda Li",
            "affiliations": [
                "Shenyang Ligong University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2126358576",
        "https://openalex.org/W2042885846",
        "https://openalex.org/W2135592086"
    ],
    "abstract": "One of the prospects of resource-effective technologies in power industry is control of electric equipment condition. Effectiveness of any electrical energy system strongly depends on stable work of power supply equipment. It, in turn, is defined by timely and reliable control of equipment condition. Power transformers are the key element of an electrical energy system. Winding defects caused by short circuit currents are the reason for an emergency situation. Reliable control of winding condition is an urgent task of modern power engineering technology. This paper deals with the experimental research of pulsed method of transformer winding control. A new approach to the winding condition control technology is described. The proposed method is based on short nanosecond range (compared to typical pulsed technology) probing impulse and front impulse durations. Experimental results of sensitivity growth at the nanosecond probing impulse duration are shown. Experimental equipment and measurements are described. Comparison of experimental results of the proposed pulsed method and FRA is given. It is shown that probing impulse of nanosecond duration allows upgrading sensitivity of diagnostics procedure. The main proposals are confirmed by measurement results obtained in the electric energy system transformer for different types of winding defects.",
    "full_text": null
}