{
    "title": "Comparative study of resists and lithographic tools using the Lumped Parameter Model",
    "url": "https://openalex.org/W2546604616",
    "year": 2016,
    "authors": [
        {
            "id": "https://openalex.org/A1979188479",
            "name": "Roberto Fallica",
            "affiliations": [
                "Paul Scherrer Institute"
            ]
        },
        {
            "id": "https://openalex.org/A2108100232",
            "name": "Robert Kirchner",
            "affiliations": [
                "Paul Scherrer Institute"
            ]
        },
        {
            "id": "https://openalex.org/A2098060473",
            "name": "Yasin Ekinci",
            "affiliations": [
                "Paul Scherrer Institute"
            ]
        },
        {
            "id": "https://openalex.org/A2635885009",
            "name": "Dominique Mailly",
            "affiliations": [
                "Centre National de la Recherche Scientifique"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W3142012139",
        "https://openalex.org/W1994386437",
        "https://openalex.org/W2062074587",
        "https://openalex.org/W2025720102",
        "https://openalex.org/W2083991019",
        "https://openalex.org/W2059213112",
        "https://openalex.org/W1922562607",
        "https://openalex.org/W2079418923",
        "https://openalex.org/W2139994638",
        "https://openalex.org/W1971232887",
        "https://openalex.org/W1608930752",
        "https://openalex.org/W2040831909",
        "https://openalex.org/W1971082942",
        "https://openalex.org/W2034250236",
        "https://openalex.org/W2162983760",
        "https://openalex.org/W2282892712",
        "https://openalex.org/W2501698921",
        "https://openalex.org/W1996900454",
        "https://openalex.org/W2127423978",
        "https://openalex.org/W2065707669",
        "https://openalex.org/W2086180939",
        "https://openalex.org/W2037226069",
        "https://openalex.org/W2010558237",
        "https://openalex.org/W2137377938",
        "https://openalex.org/W2763786753",
        "https://openalex.org/W1980836284",
        "https://openalex.org/W1490724136",
        "https://openalex.org/W2016765563",
        "https://openalex.org/W2085285825",
        "https://openalex.org/W2169619385",
        "https://openalex.org/W2516377126",
        "https://openalex.org/W2509878920",
        "https://openalex.org/W2309747255",
        "https://openalex.org/W2032569227",
        "https://openalex.org/W2026672365",
        "https://openalex.org/W2027253590",
        "https://openalex.org/W2161646562",
        "https://openalex.org/W2517376078",
        "https://openalex.org/W2054015086",
        "https://openalex.org/W2501873590"
    ],
    "abstract": "A comparison of the performance of high resolution lithographic tools is presented here. The authors use extreme ultraviolet interference lithography, electron beam lithography, and He ion beam lithography tools on two different resists that are processed under the same conditions. The dose-to-clear and the lithographic contrast are determined experimentally and are used to compare the relative efficiency of each tool. The results are compared to previous studies and interpreted in the light of each tool-specific secondary electron yield. In addition, the patterning performance is studied by exposing dense lines/spaces patterns, and the relation between critical dimension and exposure dose is discussed. Finally, the lumped parameter model is employed in order to quantitatively estimate the critical dimension of lines/spaces, using each tool specific aerial image. Our implementation is then validated by fitting the model to the experimental data from interference lithography exposures and extracting the resist contrast.",
    "full_text": " \n 1 \nA comparative study of resists and lithographic \ntools using the Lumped Parameter Model \n \n \nRoberto Fallicaa), Robert Kirchner, Yasin Ekinci \nPaul Scherrer Institut, 5232 Villigen PSI, Switzerland \nDominique Mailly \nLaboratoire de photonique et de nanostructures, CNRS, Route de Nozay, 91460 Marcoussis, \nFrance \n \na) Electronic mail: roberto.fallica@psi.ch  \n \nA comparison of the performance of high resolution lithographic tools is presented \nhere. We use extreme ultraviolet interference lithography,  electron beam lithography, \nand He ion beam lithography  tools on two different resists  that are processed under \nthe same conditions . The dose-to-clear and the lithographic contrast are determined \nexperimentally and are used to compare the relative efficiency of each tool . The \nresults are compared to previous studies and interpreted in the light of each tool -\nspecific secondary electron yield. In addition, the patterning performance is studied \nby exp osing dense line/spaces patterns and the relation between critical dimension  \nand exposure dose is discussed. Finally, the Lumped Parameter Model is employed in \norder to quantitatively estimate the critical dimension of line/spaces, using each tool \nspecific aerial image. Our implementation is then validated by fitting the model to the \nexperimental data from interference lithography exposures, and extracting the resist \ncontrast. \n \n \n \n \n 2 \nI. INTRODUCTION \nOver the last four decades, several novel lithographic techniques such as \nelectron beam lithography1,2, nanoimprint lithography3, projection and focused ion \nbeam lithography4,5 have been developed and have become widely employed in \nresearch labs and manufacturing fabs. Among these equipment, some are \neconomically viable and technologically mature for high-volume manufacturing as, \nfor example, photolithography and nanoimprint lithography. Conventional optical \nlithography has been the workhorse of high-volume manufacturing and has steadily \nevolved in terms of wavelength and new concepts, e.g. ArF immersion6 and extreme \nultraviolet (EUV) lithography7. Other techniques, such as those based on electron \nbeam and on ion beam direct writing, are not yet suitable for mass production but are \nstill of paramount importance for specific applications such as fabrication of masks \nfor optical lithography, specific ultrahigh resolution applications, and for academic \nresearch and ad hoc nanofabrication. The field of lithography in a general sense is in \ncontinuous evolution on several fronts. The recent introduction of gaseous Ne and He \nion sources has been a significant breakthrough8 owing to the possibility of achieving \nextremely small virtual source size (≈ 0.25 nm) while, at the same time, providing \nrelatively high beam current. These two features make it desirable not only for high \nresolution microscopy, but especially for lithography, patterning and nanofabrication, \nas plenty of studies have shown.9,10,11,12 \nIn any lithography process, the resist chemistry plays a paramount role \nbecause the lithographic performance is coupled to the imaging performance of the \nmaterial and the lithographic equipment. During exposure to photons, electrons or \nions, resist molecules undergo chemical bond formation, in a negative tone resist, or \nscission, in a positive tone resist. The core of any lithographic process is the way an \n \n 3 \naerial image (i.e. the spatial distribution of energy) produces the resist image (i.e. the \nfinal pattern or feature). Finding the relation between the former and the latter and its \naccurate modeling is of substantial interest for estimation and optimization of any \nlithographic process. Nevertheless, this undertaking is far from being straightforward \nand several analytical models have been developed and are available for simulating \nthe exposure by electron beam13, by optical lithography14,15, and by X-ray \nlithography16. There are many other so called “full resist models”, which provide \nhigher accuracy and versatility, at the expense of computational burden: these are \nbeing commercialized in software suites (Dr. LiTHO, PROLITH, TRAVIT, \nSentaurus). These comprehensive models can estimate several process parameters, \nsuch as the resist dissociation rate, the deblocking fraction, the solubility change, etc. \nThe wealth of lithographic models and software testifies to the technological \nimportance of lithographic modeling. \nUnderstanding of the lithographic process and the accurate modeling thereof \nbecome more and more important towards achieving cutting-edge resolution in the \nfabrication of nanoscale devices. This undertaking is a great challenge not only for \nlarge-scale industrial production, but also for academic purposes and prototyping. The \nstate-of-the-art equipment have strengths and weaknesses on their own. The electron \nbeam lithography (EBL) for instance is a well-established technique but is relatively \nslow and suffers from large proximity effect. This effect is, in general, taken into \naccount by tuning the exposure dose according to the geometry and most EBL design \nsoftware provide such compensation. The He ion beam lithography (HIBL) is a \ntechnique that holds promise for higher resolution and better lithographic control than \nEBL, owing to the reduced proximity effect. Optical lithography brings the advantage \nof fast patterning and high density but its resolution is limited by the wavelength used. \n \n 4 \nFor these reasons, in this work we compare and discuss the performance of \nthree different tools: EUV interference lithography (EUV-IL), EBL, and HIBL in \npatterning a periodic layout of densely packed lines and spaces (l/s). L/s are \nubiquitously used in integrated circuit architecture such as crossbar memory devices, \nmetal lines, programmable logic arrays, word & bit lines; and they will likely be also \nused in future 3-D devices.17 Moreover, dense l/s represent the ultimate resolution \ntesting condition for resist and tools where the proximity effect is accounted for. In \nthe present work, we focus on the amount of energy (or dose) required to print a resist \nfeature of given size (critical dimension, CD), also known as the CD vs. dose \nfunction, which is a relevant figure of merit for lithographers. Although the exposure \nmechanism is radically different in these tools, the exposure chemistry is always \ntriggered by the (primary or secondary) electrons in all the three tools. We discuss \nhow these differences affect the final result also in the light of existing studies on the \nexposure dosage of photoresists by EBL and EUV. Finally, an implementation of the \nlumped parameter model (LPM) in the case of a periodic l/s pattern is presented. This \nmodel is employed to present a quantitative comparison of the effect of the aerial \nimage of different tools on the CD vs. dose relationship. Our implementation is then \nvalidated on experimental data from optical lithography by using a nonlinear least \nsquare regression.  \n \nII. EXPERIMENTAL \nHere, we describe the characteristics of the three lithographic tools and resist \nmaterials used in this work. The conventional geometry adopted here is that the l/s \npatterns are printed on the resist along one direction parallel to the surface of the \nsample. It is assumed z along the normal to the surface of the sample. The aerial \n \n 5 \nimage intensity, I generated by each exposure tool is thus symmetrical along the \ndirection of lines and it is fully described as a function of x only. The CD of lines was \nexperimentally measured from by top-down SEM imaging of the patterned resist l/s \nand by quantitative metrology image analysis using a commercial software suite \n(SuMMIT, Lithometrix).  \nA. Extreme Ultraviolet-Interference Lithography \nThe extreme ultraviolet interference lithography tool (EUV-IL) at the XIL-II \nbeamline uses light at 13.5 nm wavelength from the Swiss Light Source. Masks \nfeaturing transmission diffraction gratings produce two-beam interference patterns on \nthe surface of the sample to form dense l/s, as detailed elsewhere.18 The main \nadvantages of this technique are the high resolution (down to 6 nm half-pitch) and the \nfast speed to pattern large areas.19 The shape of the aerial image is dictated by the \nconstructive and destructive interference of the two diffracted beams and it is given \nby: \n𝐼𝐸𝑈𝑉−𝐼𝐿(𝑥) =\n1\n2 cos (2𝜋\n𝑥\n𝑝) +\n1\n2 = 𝑐𝑜𝑠2(𝜋\n𝑥\n𝑝)   (1) \nwhere p is the pitch of the l/s array. \nFor the two-beam interference l/s patterning, pairs of gratings of different \npitches were fabricated on SiN membranes. For producing the contrast curves, an \naperture of 0.5×0.5 mm2 was used to expose an array of increasing doses. \nB. Electron beam lithography \nAn electron beam lithography tool (Vistec EBPG 5000) with 100 keV \nacceleration voltage, beam current of 500 pA at aperture 400 μm was used for the \npresent study. The direct write with a raster-scan focused beam has a relatively low \nspeed and can print only about a few μm2 per second, depending on a variety of \nsettings. For the sake of this comparison, we are interested in the effect of beam shape \n \n 6 \nand for this reason all software proximity effect corrections were disabled during this \nexperiment. Abundant research has been put into the measurement of the beam size \nand shape using the point spread function (PSF) method.20 Here, we adopt the widely \nused notation and define the beam shape as the sum of two Gaussians, the first \nrepresenting the highly collimated primary beam, and another representing the \ncontribution from backscattered electrons: \n𝐼𝐸𝐵𝐿(𝑥) =\n1\n2𝛼 2 𝑒−𝑥2 𝛼 2⁄ +\nη\n2𝛽 2 𝑒−𝑥2 𝛽 2⁄  (2) \nwhere α is the square root of the variance of the forward scattering beam, β is the \nsquare root of the variance of the backscattering electrons and η is defined as a \ncorrection factor. Experimentally measured values for α range from 4 to 14 nm, \nwhereas β is about several microns; the correction factor η is typically ≈ 0.7-1.21,22,23 \nBased on literature data, the amplitude of the primary Gaussian (1/2α2) can be \nestimated to be about 100 to 1000 times larger than the amplitude of the secondary \nGaussian (η/2β2). The expression of Eq. (2) therefore describes the combination of a \nsharp beam profile with a very broad and low-intensity tail. \nC. He ion beam lithography \nA He ion beam was generated by field ionization from a gas source in a ZEISS \nmicroscope column, and accelerated to 30 keV. The raster scan was controlled by an \nOrion Nanofab pattern generator to perform direct write lithography of arbitrary user-\ndefined layout. The beam aperture was 7 μm and the write current was 0.19 pA for all \nsamples. Although the source and the column are capable of supplying higher \ncurrents, these settings were dictated by the need for high resolution and by the \nmaximum allowed frequency of the beam blanking unit. In this equipment, the raster \nscan speed is possibly the main disadvantage of the direct write with focused beam, as \n \n 7 \nless than a square micron per second can be patterned, using these settings for high \nresolution. \nEarly works demonstrated that the large mass and large scattering cross \nsection of helium ions lead to a much shallower penetration depth in matter and a \nsmaller interaction volume than it occurs with electron beam, thus bringing \nremarkably superior imaging performance.24,25Similar to the electron beam, the PSF \nof the He ion beam has been determined by previous investigations and it has been \nconventionally modeled as the sum of two Gaussians.26,27 As these studies found, the \nexperimental measurement of the PSF was significantly more challenging than for \nelectron beam, because the He beam size is well below the resolution limit of printing \ndetection and its proximity effect is weaker. Among the few works on this topic, one \nestimated the PSF indirectly by Abel inversion of experimentally measured line \nspread function of a chemically amplified resist.28 Reported r.m.s. width values are \n0.9 nm and 150 nm for the primary and secondary beams, respectively.29 Notably, the \nintensity of the secondary beam was estimated to be six orders of magnitude weaker \nthan that of the primary beam. For this reason, in this work we modeled the aerial \nimage of the ion beam as a single Gaussian: \n𝐼𝐻𝐼𝐵𝐿(𝑥) =\n1\n2𝜎2 𝑒−𝑥2 𝜎2⁄   (3) \nwhere σ is the Gaussian standard deviation. \nD. Resist materials \nPoly-methylmethacrylate (PMMA, molecular weight 950k, 1% w/w in ethyl \nlactate) and hydrogen silsesquioxane (HSQ, 1% in methyl isobutyl ketone, MIBK) \nwere chosen because they are sensitive resists over a broad range of energies and \npatternable by both photons and particle beams. For the sake of comparison, the \nprocessing was kept the same throughout all lithographic tools: thermal treatments, \n \n 8 \ndevelopment time, and development conditions. Both resists were spin coated to \ntarget a 40 nm film thickness. A post application bake of 180 °C and 5 minutes was \nused for PMMA, while no thermal treatment was used for HSQ. PMMA was \ndeveloped in methyl isobutyl ketone and isopropyl alcohol 1:3 mixture (MIBK:IPA) \nfor 50 seconds and rinsed for 30 s in pure IPA. HSQ was developed in \ntetramethylammonium hydroxide and deionized water 1:3 mixture (TMAH:DIW) for \n30 s, followed by rinsing in deionized water for 30 s, and isopropyl alcohol for 30 s. \nAll developments were done at room temperature. \n \nIII. MODELING \nThe Lumped Parameters Model (LPM)15 is based on the segmented \ndevelopment of a resist after exposure and it describes the geometry of the resist \nimage resulting from a given aerial image. The LPM belongs to the category of \n‘simplified resist models’, because it lumps (as the name implies) the effects of \nseveral physical mechanisms into a limited number of parameters. The LPM is also an \nanalytical model: it is based on the combination of the resist development kinetics \nwith the exposure intensity distribution on and in the resist. As a consequence, this \nmodel is very compact and has a low computational burden. In the specific case of \ntwo dimensional l/s symmetry, its exact analytical form is given by the expression:30 \n𝐸(𝑥) = 𝐸0 [1 +\n1\n𝐷𝑒𝑓𝑓\n∫ (\n𝐼(𝑥′)\n𝐼(𝑥0))\n−𝛾𝑥\n𝑥0\n𝑑𝑥′]\n1\n𝛾\n (4) \nwhere E is the energy (or dose) required to print a line with CD of x, by an aerial \nimage of normalized intensity I(x) on a resist of contrast γ and dose-to-clear E0; x0 \nindicates the center location of the line. Because this model was devised specifically \nfor photolithography, an effective thickness Deff in Eq. (4) is defined as: \n \n 9 \n 𝐷𝑒𝑓𝑓 =\n1\n𝛼𝛾 (1 − 𝑒−𝛼𝛾𝐷)   (5) \nand it accounts for the finite transmissivity of the material via the actual resist \nthickness D, its optical absorption coefficient α, and resist contrast γ. \nThe LPM is, therefore, a compact and accurate method to quantitatively \ncalculate the CD vs. Dose relationship. An important aspect of the LPM is that it takes \ninto account and can be tuned for different aerial images. A MATLAB algorithm of \nthe exact LPM model of Eq. (4) was implemented using the numerical integration \nmethod (global adaptive quadrature). In a conventional experiment, the CD of lines is \nmeasured after an exposure of known dose. To use the LPM, CD values ranging from \nabout 0 to pitch are inputted in Eq. (4) and the corresponding dose is extracted. The \naerial images I(x) are then replaced with the definitions of Section II for the three \nlithographic tools. Because different tools have specific dose-to-clear, for the sake of \nthis comparison, the CD vs. dose plots was normalized to E0. Aside from the obvious \ndifferences in exposing a material using a photon beam, an electron beam and an ion \nbeam, the exposure reaction is always triggered by electrons. In the case of EUV-IL, \nthese electrons are secondary electrons (SE) generated by ionization following the \noptical absorption. In the case of EBL and HIBL, both the primary beam and the SE \ngenerated by the impact ionization of the primary do contribute to the reaction. As a \nresult, there is a difference in the spatial energy distribution of generated SE, as it was \ndemonstrated by a comparative study of chemically amplified resists exposed by EBL \nand EUV. Those Authors found a that in the former, ionization occurs mostly in \nspatially isolated reactions, whereas in the latter, the probability of multiple ionization \nevents in confined space is about a factor three-fold higher.31 The LPM model does \nnot account for the spatial distribution of ionization events because only the aerial \nimage intensity (i.e., its spatial energy) is provided as an input.  \n \n 10 \nThe LPM was employed to calculate the CD vs. dose for three aerial image \nconditions: sinusoidal beam (EUV-IL), Gaussian beam with proximity effect (EBL), \nand single Gaussian beam with no proximity effect (HIBL) when patterning dense l/s \non an arbitrary positive tone resist of contrast γ = 1, absorption coefficient α = 5 μm-1 \nand thickness 20 nm. In the outlook of cutting edge processing, we considered the \nhypothesis of patterning dense l/s patterns of pitch 20 nm, which presents some \nchallenge for current state-of-the-art lithography (analogous results hold valid for less \nstringent resolution). Based on the aforementioned studies of the PSF of EBL and \nHIBL, the width of the primary beam (σ) was assumed to be 5 nm. To simplify the \nexpression of the IEBL(x) aerial image, the proximity effect of the EBL which arises \nfrom a dense array of lines is cumulatively incorporated into a single term of the \nsecondary Gaussian. Therefore, the r.m.s. amplitude of the secondary Gaussian was \nset to 1/50 of the amplitude of the primary beam and its width equal to σ = 5 μm. \nWith this setting, the aerial image of the EBL simplifies and approximatively \naccounts for the cumulative proximity arising from 100 adjacent lines having a \nsecondary beam intensity equal to 1/5000 of the primary. A comparison of the \ncalculated CD for the three lithographic tools is then shown in the following Fig. 1, \nwhere the dose was normalized to each tool’s specific dose-to-clear E0, and the CD \nwas normalized to the pitch. \n \n 11 \n \nFIG. 1. (Color online) Critical dimension, normalized to the pitch, as a function of \nnormalized dose calculated by using the LPM for dense l/s of pitch 20 nm exposed by \nEUV-IL (black line), EBL (red line) and HIBL (blue line). The parameters for the \nLPM were set to a positive tone resist of thickness 20 nm, contrast 1 and absorption \ncoefficient 5 μm-1. The E0 dose represents the resist’s dose-to-clear for each specific \ntool. \nThe different trends of the CD vs. dose in Fig. 1 represent exclusively the \neffect of the aerial image, while all the other parameters are the same. The LPM \npredicts, as expected, that no lines are printed at dose below the E0 threshold. As the \ndose increases above E0, the estimated CD decreases (as a consequence of the \nincrease of the width of the cleared trench, being it a positive tone resist) in all cases, \nalthough with different slope. The CD of lines patterned using EBL and HIBL \ndecreases until the lines become overexposed and the CD gets to zero. However, this \nsaturation point is reached much faster in the former case than in the latter, owing to \nthe contribution from proximity effect which effectively contributes to the broadening \nof linewidth. In the case of ion beam (and in general any purely Gaussian aerial \nintensity) the CD varies weakly with the dose, and the lines merge together only at \nvery high energies, when the effect of the tail of the Gaussian proximity effect from \nadjacent lines increases in magnitude. Due to the lack of proximity effect, the ion \n0 1 2 3 4\n0.0\n0.5\n1.0CD/pitch\nNormalized Dose E/E0\n EUV-IL\n EBL\n HIBL\n \n 12 \nbeam also requires a relatively higher dose to pattern lines of the same CD as those \npatterned by EBL. Finally, the CD of lines printed using EUV-IL levels off at higher \ndoses and never completely saturate, even at higher energy. This observation is a \ndirect consequence of the aerial image intensity IEUV-IL(x) being exactly zero at the \ncenter of the line geometry, regardless of the dose and pitch. It is important to clarify \nthat the LPM estimations are as accurate as the respective PSF, on which they are \nbased. This observation becomes especially relevant at relatively high doses, when the \ndetermination of the tail of the PSF is inaccurate owing to the solubility change of the \nresist. \n \nIV. RESULTS AND DISCUSSION \nA. Resist Dose-to-Clear (E0) and Contrast (γ) parameters \nThe E0 of PMMA (i.e. the dose-to-clear) and of HSQ (i.e. the dose-to-gel) \nwere measured by exposing arrays of large squares at increasing dose. (In the \nlithographic community, the dose-to-clear is usually indicated by the symbol D0: in \nthis work, E0 will be used for consistency with the LPM notation.) The measurement \nof E0 provides information on the relative efficiency of a lithographic equipment in \npatterning a given material. In addition, the E0 is also useful as parameter for the LPM \nfit as mentioned above. In the case of EUV-IL, 0.5×0.5 mm2 open frame exposures \nwere conducted and the remaining thickness was measured by profilometer. In a \nsimilar way, large areas of size in excess of 250 μm2 areas were patterned in the case \nof EBL and HIBL; the remaining thickness was measured by atomic force microscopy \nin contact mode. The contrast curves, normalized to the film thickness, are shown in \nFig. 2. The experimental data were then fitted to a dose response curve, from which \nthe E0 and γ were extracted; these values are summarized in Table I. \n \n 13 \n \nFIG. 2. (Color online) Experimentally measured contrast curves for PMMA (circles) \nand HSQ (squares) exposed by EUV-IL (a), EBL (b), and HIBL (c). The solid lines \nare dose response fits to the corresponding data and were used to extract the dose-to-\nclear E0 and contrast γ of the resists for each specific exposure conditions. For EBL \nand HIBL, the equivalent dose in unit energy per area is also reported on the top axis. \n \n In agreement with the known properties of these materials, our data indicate \nthat HSQ is significantly less sensitive than PMMA: the E0 was more than one order \nof magnitude higher, regardless of the tool. As for the ‘relative sensitivity’ of these \ntools when exposing the same resist, a considerable gap can be detected in the amount \nof charge per unit area required to clear. The EBL required almost a two orders of \nmagnitude higher dose than the HIBL did. Several studies had previously reported a \nsimilar observation: the dose-to-clear obtained by the former is about 4-fold to \nhundred-fold higher than the latter.5,8,9,,32 The exposure efficiency is described by the \nsecondary electron yield (SEY) parameter, which indicates the amount of secondary \nelectrons generated by each absorbed primary photon, electron or ion. This definition \nis widely used in the photoresist community to describe the efficiency of each SE \ngeneration: it is not related to the total incident dose nor to the surface effects, but to \nthe dose absorbed throughout the resist. According to our experimental data, the dose \n1 10 100\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n  EUV-IL\n PMMA\n HSQ\nThickness (norm.)\nDose (mJ/cm\n2\n)\n(a)\n100 1000 10000\n10000 100000 1000000\nDose (mJ/cm\n2\n)\n  EBL\n PMMA\n HSQ\nDose (C/cm\n2\n)\n(b)\n0.1 1 10 100\n3 30 300 3000\nDose (mJ/cm\n2\n)\nHIBL\n PMMA\n HSQ\nDose (C/cm\n2\n)\n(c)\n \n 14 \nrequired to fully expose these materials by the HIBL is a 100-fold lower than that \nneeded by the EBL, for both resists. Other authors estimated the SEY of He ion beam \nto be between 7 and 30.33,34 Those estimations are in agreement with the experimental \nobservations of a decreasing sensitivity of these materials when using a 100 keV \nelectron beam, as in the present work, as compared to the 30 keV and lower energies \nreported in previous works.9  \nFurthermore, the energetic efficiency of the EUV-IL can be discussed by \ncalculating the equivalent dose for EBL and HIBL in unit energy per area, based on \nthe kinetic energy of these tools and shown in the dosage curves of Fig. 2, top axis. It \ncan be noticed that the ion beam required only about 3 times more energy than the \nEUV photons to clear PMMA, whereas the EBL needed an incident dose as much as \n3000-fold higher. Furthermore, the dose gap between HIBL and EBL is, in terms of \nincident energy, wider than it was in terms of deposited charge. In other words, the \nrelative energetic efficiency of EBL is lower than the simple charge dosage would \nsuggest. This finding is consistent with the well-known fact that the EBL dose is \ninversely proportional to the acceleration voltage. In summary, the electron beam \nexhibits a remarkably low lithographic efficiency as consequence of both the weaker \ninteraction with matter and the high kinetic energy (100 keV) as compared to that of \nthe ion beam (30 keV). \nWhile many studies have previously experimentally compared EBL with \nHIBL, there is a remarkable lack of systematic studies of electron beam exposures \nversus extreme ultraviolet lithography. Recent works by Kyser et al.35 and by Oyama \net al.36 both proposed two approaches to calibrating the dose ratio between EBL and \nEUV exposures, expressed in (μC/cm2)/(mJ/cm2). From the calculated deposited dose \nper unit volume in the resist, this dose ratio was estimated to be ≈ 7 (in the case of 100 \n \n 15 \nkeV EBL)35 and ≈ 3.5 (in the case of a 75 keV EBL).36 However, dose ratios reported \nin experimental studies vary from 4.5,37 ≈ 10,38 and between 7 and 35.39 This ratio, \ncalculated from our dose-to-clear of PMMA and HSQ, is ≈ 42 and ≈ 20, respectively. \nIt is not straightforward to explain the discrepancy between theory and experiment, \nand among all these experimental values as well. It should be noted that those \ntheoretical estimates assume that the dose required to fully expose a resist depend \nexclusively on the energy deposited (based on the equivalency of the volumetric \nabsorbed dose, in the case of EUV, and of the primary e-beam electron in the case of \nEBL). However, previous works have shown that the ionization efficiency might \ndiffer, as it was demonstrated in the case of the volumetric probability of photoacid \ngeneration. Exposure by EUV, for instance, is more likely to produce multiple \nionization event in a confined volume of resist than the EBL can accomplish.40 The \nexperimental dose ratio reported in the present work is higher than the theoretical \npredictions, which we ascribe to a higher lithographic efficiency of EUV than it \nwould be expected from the pure dose equivalency. Finally, the broad differences in \nthe dose ratio across different resist platforms reported in one of the previous works,39 \nis suggesting that the acid generation probability is also a specific variable in the resist \nexposure kinetics. While most of the above mentioned values are extracted from l/s \npatterning at the 1:1 duty cycle dose (i.e., the dose-to-size), our dose ratio are instead \ncalculated from dosage curves: this difference does not changes our argumentation. \nAs for the resist contrast, this quantity is strongly dependent on the processing \nconditions and previous studies reported values of γ ranging from 1 to 3.5 for both \nPMMA and HSQ materials developed using conventional methodology.9,27,41 \nAccording to our data, the contrast was not changed significantly across the \n \n 16 \nlithographic tools, which is a good indication of the consistency of the processing, \ndespite being produced by different equipment. \n \nTABLE I. Summary of measured dose-to-clear E0 and contrast γ for all resists and tools \ninvestigated in this work. \n Dose-to-Clear E0 Contrast γ \n EUV-IL \n[mJ/cm2] \nEBL \n[μC/cm2] \nHIBL \n[μC/cm2] EUV-IL EBL HIBL \nPMMA 8.5 355 1.1 1.4 1.6 1.5 \nHSQ 171 3364 17.6 1.8 1.3 1.2 \n \n \nB. Dense lines/spaces  \nThe performance in patterning dense l/s was tested using EUV-IL, EBL and \nHIBL on PMMA (pitch 80 and pitch 60 nm) and HSQ (pitch 44 nm). The CD of lines \nwas measured by metrological scanning electron microscopy. The resulting CD, \nnormalized to the total pitch, is plotted for these tools as a function of the normalized \ndose E/E0 in Fig. 3.  \nA consistent trend can be observed from these plots. At normalized dose \nbelow 1, that is, when E < E0, no lines are printed: E0 represents a minimum threshold \nenergy. As the dose is increased, in a positive tone resist as it is PMMA, trenches \nbegin to be printed and the measured CD decreases with increasing dose: the \nmeasured CD represents here the width of remaining resist lines between the trenches \n(measured by the SEM). As for HSQ, the resulting CD indicates a similar behavior as \nPMMA. In the case of this negative tone resist, the CD of lines increases with \nincreasing dose. \n \n 17 \n \nFIG. 3. (Color online) Normalized critical dimension as a function of normalized dose \nfor dense l/s, 80 nm pitch (a) and 60 nm pitch (b) in PMMA, and of 44 nm pitch in \nHSQ (c), exposed by EUV-IL (black triangles), EBL (red squares), and HIBL (blue \ncircles). \n \nRemarkable differences in the CD of lines printed by these tools can be \nnoticed. At higher doses, the CD patterned by EUV-IL levels off and never saturates. \nFor EBL, the CD increases faster with dose than it does in other tools; while the ion \nbeam exposes lines have an almost linear trend with dose. These same trends occur \nregardless of the pitch and of the resist tone. Moreover, the onset of the threshold \n\n \n 18 \ndepends on the tool used. Considerations on the different features of the tools \ninvestigated here will follow to explain the different graph behavior now. In the EUV-\nIL, the dose intensity is formed by an interference pattern and it is ideally a sinusoidal \ncurve: therefore, a zero intensity point is always present, regardless of the amplitude \n(i.e. dose). As a result, in a dense l/s pattern, adjacent lines will ideally always be well \ndetached from each other (neglecting here the effect of resist blur). This was \nexperimentally confirmed by the leveling off of the EUV-IL trace. On the opposite, \npatterning dense l/s by EBL and HIBL produces a different result due to the proximity \neffect of the beam in adjacent lines. In the case of the EBL, this effect is much more \nmarked due to the broad spatial effect of the backscattered electrons. This observation \nwas confirmed by the steeper decrease or increase of the EBL traces compared to the \nHe+ traces for PMMA and HSQ, respectively. In conclusion, it can be qualitatively \nunderstood that it is the beam geometry that affects the spatial energy distribution and \nthus the CD vs. dose behavior. \n  \nC. LPM fit to EUV-IL \nThe lumped parameter model provides a compact and precise estimation of the \nCD vs. dose relationship which is of interest in the scope of this work. In this section \nwe aim at validating our MATLAB implementation of the LPM against experimental \ndata. EUV-IL exposures of dense l/s were carried out on PMMA (pitches 100, 80 60 \nand 44 nm) and on HSQ (pitch 44, 36, 32 nm). Because the EUV-IL mask used to this \npurpose features all of the above mentioned periodicities, all the l/s pitches were \nexposed at once on the same wafer. Subsequently, the entire sample was processes at \nthe same time and under the same conditions for all pitches, thus providing a \n \n 19 \nconsistent comparison. The exposure dose was varied so as to obtain as many data \npoint as possible in a broad range.  \nA nonlinear least-squares fit routine, based on the Levenberg-Marquardt \nalgorithm, was implemented in MATLAB for the regression of the LPM expression \nof Eq. (4) to the experimental CD vs. dose data. To this purpose, the normalized aerial \nimage was set to the function IEUV-IL(x) described in Eq. (1), Section II, and the period \np was set to the corresponding data. The absorption coefficient α was set to 5.0 μm-1, \nbased on previous measurement of the optical absorption of PMMA and HSQ at EUV \nwavelength.42 The dose were normalized to the E0 of the two materials at EUV, as \nmeasured in Section IVa. The regression algorithm provided the γ which best fitted to \nthe data. The resulting best fit LPM are shown alongside the experimental CD data in \nthe following Fig. 4, and the values are summarized in Table II. \n \n\n \n 20 \nFIG. 4. (Color online) Experimental critical dimension (symbols) of dense lines/spaces \nas a function of normalized dose, patterned by EUV-IL on PMMA (a) and HSQ (b). e \nThe corresponding nonlinear least-squares fit to the each data set, obtained using the \nLumped Parameter Model of Eq. (4) is also shown (dashed lines). \n \nThe regression algorithm provided a good fit throughout all the range. In the \nproximity of the dose-to-clear (E/E0 ≈ 1), the fit diverges from the data, which can be \nascribed to the inaccuracy in measuring the critical dimension of very underexposed \nlines. It was found that the extracted contrast γ was below the value measured from \ncontrast curves. In this regard, the contrast of a resist is influenced by the \ndevelopment contrast γd (which depends on the processing) and by the exposure \ncontrast γe (which depends on the beam decay in the resist due to optical absorption), \naccording to the relation 𝛾𝑡\n−1 = 𝛾𝑑\n−1 +  𝛾𝑒\n−1.30 In our implementation of the LPM, we \nemployed the effective thickness Deff, as mentioned in Section III. As a result, the γ \nparameter extracted from the LPM fit is already accounting for the detrimental effect \nof both the absorption and the non-ideal development. This observation seems to \nindicate a loss of lithographic contrast of the resist when patterned in dense l/s, in \ncomparison to the same resist patterned in open frame exposures. These two non-\nidealities concurrently decrease the contrast of the high resolution patterns. Finally, it \nmust be noticed that the contrast values did not show any dependence on the pitch of \nthe l/s: as can be seen from the slope of the fitting, which is similar throughout all \npitches. We ascribe this effect to the quality of the aerial image of EUV-IL, which is \ndescribed by a constant normalized image-log slope value of π, regardless of the \npitch.43 \n \n \n 21 \nTABLE II. Summary of best fit parameters using the LPM regression to the EUV-IL \nexposures of PMMA and HSQ dense l/s. \npitch γ \n(PMMA) \nγ  \n(HSQ) \n100 nm 0.45 - \n80 nm 0.50 - \n60 nm 0.41 - \n44 nm 0.46 0.65 \n36 nm - 0.60 \n32 nm - 0.62 \n \n \nV. SUMMARY AND CONCLUSIONS \nA comparative study of the extreme ultraviolet interference lithography, \nelectron beam lithography and He ion beam lithography has been presented here. \nDespite the different working principle, the similarity in the exposure mechanism in \nbroadband resists made it possible to conduct this comparison. Preliminarily, we \ndetermined the dose-to-clear and the resist contrast of PMMA and HSQ for each tool, \nwhich was used to normalize the exposure doses. In agreement with previous studies, \nit was found that the He ion beam lithography required about a hundred-fold lower \ndose than electron beam lithography did. From the dosage point of view, our findings \nindicate that EBL is more than four orders of magnitude less lithographically efficient \nthan EUV-IL and more than three orders of magnitude less than HIBL, owing to the \nweak interaction with the resist and the high kinetic energy of the electron beam. The \nratio between the exposure doses by EBL and by EUV-IL, found experimentally in \nthe present work, was higher than theoretical estimates reported in previous studies. \n \n 22 \nWe discussed this discrepancy in the light of the different in ionization efficiency of \nthese lithographic tools. \nThe critical dimension of dense l/s patterns, which is a relevant figure of merit \nfor lithographic processing and fabrication of integrated circuits in general, was \nstudied in detail. The beam shape had a remarkable effect on the CD vs. dose \nrelationship, as it accounts for the specific features of each tool. A numerical \nformulation of the exact lumped parameter model and a nonlinear least-squares \nregression were also implemented. This model estimated quantitatively the effect of \ndifferent aerial images on the CD vs. dose, consistently with the experimental \nfindings. Finally, the LPM fit to the EUV-IL exposure data extracted the parameters \nfor γ and E0, thus validating our implementation. Our findings quantitatively explain \nfor the peculiar features each tool has and which make it suitable for different \npurposes. The EUV-IL make it possible to pattern large areas of dense features such \nas line/spaces, with relatively good resolution. The electron beam lithography is \neffective in exposing high resolution arbitrary patterns and has a better performance \nfor isolated structures than dense ones. The HIBL is a promising technique for the \nlithography of dense high resolution patterns due to the almost negligible \nbackscattered secondary electrons from the beam-substrate interaction, which \npossibly make it ideal for both isolated and dense high resolution patterning. \n \nACKNOWLEDGMENTS \nWe gratefully acknowledge Simon Tschupp (PSI) for sample analysis and fruitful \ndiscussion and Vitaliy Guzenko (PSI) and Michaela Vockenhuber (PSI) for fruitful \ndiscussion. This project has received funding from the EU-H2020 Research and \n \n 23 \nInnovation programme under grant agreement No. 654360 NFFA-Europe. One of the \nAuthors (R.F.) acknowledges Inpria Corp. for funding. \n \n                                                 \n1 D. R. Herriott, J. Vac. Sci. Technol. 20, 781 (1982). \n2 K. Wilder, C. F. Quate, B. Singh, and D. F. Kyser, J. Vac. Sci. Technol. B 16, 3864 \n(1998). \n3 S. Y. Chou, P. R. Krauss, and P. J. Renstrom, Appl. Phys. Lett. 67, 3114 (1995). \n4 W. L. Brown, T. Venkatesan, and A. Wagner, Nucl. Instrum. Methods 191(1), 157 \n(1981). \n5 S. Hirscher, R. Kaesmaier, W.-D. Domke, A. Wolter, H. Loeschner, E. Cekan, C. \nHorner, M. Zeininger, and J. Ochsenhirt, Microelectron. Eng. 57, 517 (2001). \n6 M. Chan, R. R. Kunz, S. P. Doran, and M. Rothschild, J. Vac. Sci. Technol. B 15, \n2404 (1997). \n7 V. Bakshi, EUV lithography, 1st ed. (SPIE Press, Bellingham, Washington USA, \n2009), pp.42-43. \n8 J. Notte, B. Ward, N. Economou, R. Hill, R. Percival, L. Farkas, and S. McVey, AIP \nConf. Proc. 931, 489 (2007). \n9 V. Sidorkin, E. van Veldhoven, E. van der Drift, P. Alkemade, H. Salemink, and D. \nMaas, J. Vac. Sci. Technol. B 2(4), 18 (2009). \n10 C. A. Sanford, L. Stern, L. Barriss, L. Farkas, M. DiManna, R. Mello, D. J. Maas, \nand P. F. A. Alkemade, J. Vac. Sci. Technol. B 27(6), 2660 (2009). \n11 D. Winston, V. R. Manfrinato, S. M. Nicaise, L. L. Cheong, H. Duan, D. Ferranti, J. \nMarshman, S. McVey, L. Stern, J. Notte, and K. K. Berggren, Nano Lett. 11, \n4343 (2011). \n12 F. H. M. Rahman, S. McVey, L.  Farkas, J. A. Notte, S. Tan, and R. H. Livengood, \nScanning 34, 129 (2012). \n13 E. A. Dobisz, H. W. P. Koops, F. K. Perkins, C. R. K. Marrian, and S. L. Brandow, \nJ. Vac. Sci. & Technol., B 14, 4148 (1996). \n \n \n 24 \n                                                                                                                                            \n14 M. P. C. Watts, J. Vac. Sci. & Technol., B 3, 434 (1985). \n15 N. G. Einspruch, Lithography for VLSI: VLSI Electronics - Microstructure Science \n(Academic Press, New York, USA, 1987), pp. 19–55. \n16 Z. Liu, F. Bouamrane, M. Roulliay, R. K. Kupka, A. Labèque, and S. Megtert, J. \nMicromech. Microeng. 8(4), 293 (1998). \n17 A. DeHon, IEEE T. Nanotechnol. 2(1), 23 (2003). \n18 E. Buitrago, R. Fallica, D. Fan, T. S. Kulmala, M. Vockenhuber, and Y. Ekinci, \nMicroelectron. Eng. 155, 44 (2016). \n19 D. Fan, and Y. Ekinci, J. Micro-nanolith. Mem. 15(3), 033505 (2016). \n20 T. H. P. Chang, J. Vac. Sci. & Technol. 12, 1271 (1975). \n21 S. A. Rishton and D. P. Kern, J. Vac. Sci. & Technol., B 5, 135 (1987). \n22 M. Osawa, K. Takahashi, M. Sato, Masami and H. Arimoto, K. Ogino, H. Hoshino, \nand Y. Machida, J. Vac. Sci. & Technol., B 19, 2483 (2001). \n23 H. Duan, V. R. Manfrinato, J. K. W. Yang, D. Winston, B. M. Cord, and K. K. \nBerggren, J. Vac. Sci. & Technol., B 28(6), C6H11 (2010). \n24 D. C. Joy and S. Luo, Scanning 11(4), 176 (1989). \n25 D. Cohen-Tanugi and N. Yao, J. Appl. Phys. 104, 063504 (2008). \n26 D. Winston, B. M. Cord, B. Ming, D. C. Bell, W. F. DiNatale, L. A. Stern, A. E. \nVladar, M. T. Postek, M. K. Mondol, J. K. W. Yang, and K. K. Berggren, J. \nVac. Sci. & Technol., B 27, 2702 (2009). \n27 G. Hlawacek, V. Veligura, R. van Gastel, and B. Poelsema, J. Vac. Sci. & Technol., \nB 32, 020801 (2014). \n28 N. Kalhor, W. Mulckhuyse, P. Alkemade, and D. Maas, Proc. SPIE Conf. 9425, \n942513 (2015). \n29 D. Winston, J. Ferrera, L. Battistella, A. E. Vladár, and K. K. Berggren, Scanning \n34(2), 121 (2012). \n30 C. Mack, Fundamental Principles of Optical Lithography (John Wiley & Sons, \nChichester, West Sussex, England, 2007), p. 286. \n \n \n 25 \n                                                                                                                                            \n31 T. Kozawa, K. Okamoto, A. Saeki, and S. Tagawa, Jap. J. Appl. Phys. 48, 056508 \n(2009). \n32 L. Scipioni, and D. Winston, Helium Ion Beam Lithography in the ORION® \nPLUS, Zeiss Whitepaper, July 2009. \n33 J. Morgan, J. Notte, P. Hill, and B. Ward, Micros. Today 14, 24 (2006). \n34 D. Maas, E. van Veldhoven, A. van Langen-Suurling, P. F.A. Alkemade, S. \nWuister, R. Hoefnagels, C. Verspaget, J. Meessen, and T. Fliervoet, Proc. \nSPIE Conf. 9048, 90482Z (2014). \n35 D. F. Kyser, N. K. Eib, and N. W. M. Ritchie, J. Micro-nanolith. Mem. 15(3), \n033507 (2016). \n36 T. G. Oyama, A. Oshima, and S. Tagawa, AIP Adv. 6, 085210 (2016). \n37 S. Bhattarai, A. R. Neureuther, and P. P. Naulleau, Proc. SPIE Conf. 9422, 942209 \n(2015). \n38 J. Stowers, A. Telecky, M. Kocsis, B. L. Clark, D. A. Keszler, A. Grenville, C. N. \nAnderson, and P. P. Naulleau, Proc. SPIE Conf. 7969, 796915-1 (2011). \n39 L. D. Bozano, P. J. Brock, H. D. Truong, M. I. Sanchez, G. M. Wallraff, W. D. \nHinsberg, R. D. Allen, M. Fujiwara, and K. Maeda, Proc. SPIE Conf. 7972, \n797218-1 (2011). \n40 T. Kozawa and S. Tagawa, Jap. J. Appl. Phys. 49, (2010) 030001. \n41 J. K. W. Yang, B. Cord, H. Duan, K. K. Berggren, J. Klingfus, S.-W. Nam, K.-B. \nKim, and M. J. Rooks, J. Vac. Sci. & Technol., B 27, 2622 (2009). \n42 R. Fallica, J. K. Stowers, A. Grenville, A. Frommhold, A. P. G. Robinson, and Y. \nEkinci, J. Micro-nanolith. Mem. 15(3), 033506 (2016). \n43 A. Langner, H. H. Solak, R. Gronheid, E. van Setten, V. Auzelyte, Yasin Ekinci, K. \nvan Ingen Schenaud, and K. Feenstrad, Proc. SPIE Conf. 7636, 76362X-1 \n(2010). "
}