{
    "title": "Evaluating greenhouse gas emissions from dairy manure management practices using survey data and lifecycle tools",
    "url": "https://openalex.org/W2562477323",
    "year": 2016,
    "authors": [
        {
            "id": "https://openalex.org/A5011656996",
            "name": "Horacio A. Aguirre‐Villegas",
            "affiliations": [
                "University of Wisconsin–Madison"
            ]
        },
        {
            "id": "https://openalex.org/A5061893047",
            "name": "Rebecca A. Larson",
            "affiliations": [
                "University of Wisconsin–Madison"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2056784972",
        "https://openalex.org/W1603874699",
        "https://openalex.org/W2065913146",
        "https://openalex.org/W2014199404",
        "https://openalex.org/W1985003575",
        "https://openalex.org/W2074901795",
        "https://openalex.org/W2165786993",
        "https://openalex.org/W1777004581",
        "https://openalex.org/W2001828507",
        "https://openalex.org/W2001977689",
        "https://openalex.org/W1997401310",
        "https://openalex.org/W2299509929",
        "https://openalex.org/W1978605725",
        "https://openalex.org/W2104593329",
        "https://openalex.org/W2028094018",
        "https://openalex.org/W2126222557",
        "https://openalex.org/W2015229587",
        "https://openalex.org/W2005005055",
        "https://openalex.org/W1963739702",
        "https://openalex.org/W1992103893",
        "https://openalex.org/W6769588581",
        "https://openalex.org/W2111206403",
        "https://openalex.org/W2113103468",
        "https://openalex.org/W2063890177",
        "https://openalex.org/W2118462633",
        "https://openalex.org/W2147434934",
        "https://openalex.org/W2164076062",
        "https://openalex.org/W1967630518",
        "https://openalex.org/W2047797795",
        "https://openalex.org/W6667096547",
        "https://openalex.org/W2896195675",
        "https://openalex.org/W2147373184",
        "https://openalex.org/W4243749534",
        "https://openalex.org/W2981420978",
        "https://openalex.org/W2133119982",
        "https://openalex.org/W1201749067",
        "https://openalex.org/W2066361555"
    ],
    "abstract": "Manure is the second largest source of greenhouse gas (GHG) emissions from dairy farms. Detailed data for representative manure systems are needed to guide climate change mitigation strategies. This study uses surveys sent to WI dairies to identify current farm and manure management practices, collect inventory data on manure handling and energy consumption, compare practices based on farm size, and relate these practices to GHG emissions. Results show that manure systems and management practices vary significantly with farm size. For example, larger farms handle liquid manure and have long term storage while small farms handle solid manure and land-apply daily. Sand separation, solid-liquid separation (SLS), and anaerobic digestion (AD) are implemented only by the surveyed facilities that are large enough to require permitting. Ammonia, biotic, and fossil GHG emissions from archetypes small, large, and permitted facilities are estimated using modeling tools. For this, the most common manure management practices identified by the survey are analyzed. Results (per cow, kg of milk, and ton of manure) show that storing liquid manure for long periods of time without processing contributes the most to GHG emissions. When implementing manure processing, permitted facilities are able to reduce emissions significantly, mostly through AD. Small farms keep their emissions lower than large farms as they mostly handle solid manure and land-apply manure daily. Depending on the practice and farm size, GHG emissions per ton of manure range from 2200 to 12,000 g CO2-eq for collection, 200 to 2400 g CO2-eq for transportation, 16,000 to 84,000 g CO2-eq for storage, and 16,400 to 33,500 g CO2-eq for land-application.",
    "full_text": null
}