{
  "title": "Identifying the missing proteins in human proteome by biological language model",
  "url": "https://openalex.org/W2562883458",
  "year": 2016,
  "authors": [
    {
      "id": "https://openalex.org/A2496622354",
      "name": "Dong Qiwen",
      "affiliations": [
        "East China Normal University",
        "Shenzhen Institute of Information Technology"
      ]
    },
    {
      "id": "https://openalex.org/A1902378672",
      "name": "Wang, Kai",
      "affiliations": [
        "Jilin Agricultural University"
      ]
    },
    {
      "id": "https://openalex.org/A2064023963",
      "name": "Liu Xuan",
      "affiliations": [
        "Shanghai Ocean University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2127230663",
    "https://openalex.org/W2060769471",
    "https://openalex.org/W2080993908",
    "https://openalex.org/W1987437192",
    "https://openalex.org/W2049928819",
    "https://openalex.org/W4210767115",
    "https://openalex.org/W2086226889",
    "https://openalex.org/W2031095666",
    "https://openalex.org/W2153349010",
    "https://openalex.org/W2098174226",
    "https://openalex.org/W2074956188",
    "https://openalex.org/W2074229758",
    "https://openalex.org/W1972624882",
    "https://openalex.org/W1518399713",
    "https://openalex.org/W2792561556",
    "https://openalex.org/W2121085676",
    "https://openalex.org/W2060593022",
    "https://openalex.org/W2148279834",
    "https://openalex.org/W2117502874",
    "https://openalex.org/W2146628513",
    "https://openalex.org/W2009470087",
    "https://openalex.org/W2070980386",
    "https://openalex.org/W2915667579",
    "https://openalex.org/W2056499061",
    "https://openalex.org/W2739999456",
    "https://openalex.org/W2170747616",
    "https://openalex.org/W2037312364",
    "https://openalex.org/W2104812418",
    "https://openalex.org/W2017277794",
    "https://openalex.org/W2123525093",
    "https://openalex.org/W1494484168",
    "https://openalex.org/W652664929",
    "https://openalex.org/W4302378679",
    "https://openalex.org/W2398160319",
    "https://openalex.org/W2161072217",
    "https://openalex.org/W2133657429",
    "https://openalex.org/W2102245393",
    "https://openalex.org/W2161811833",
    "https://openalex.org/W2069860553",
    "https://openalex.org/W2136101247",
    "https://openalex.org/W2165460636",
    "https://openalex.org/W2092067718",
    "https://openalex.org/W2085277871",
    "https://openalex.org/W1977046142",
    "https://openalex.org/W2058833671"
  ],
  "abstract": null,
  "full_text": "RESEARCH Open Access\nIdentifying the missing proteins in human\nproteome by biological language model\nQiwen Dong 1,2*, Kai Wang 3 and Xuan Liu 4*\nFrom The 27th International Conference on Genome Informatics\nShanghai, China. 3-5 October 2016\nAbstract\nBackground: With the rapid development of high-throughput sequencing technology, the proteomics research\nbecomes a trendy field in the post genomics era. It is necessary to identify all the native-encoding protein\nsequences for further function and pathway analysi s. Toward that end, the Human Proteome Organization\nlunched the Human Protein Project in 2011. However m any proteins are hard to be detected by experiment\nmethods, which becomes one of the bottleneck in Human Proteome Project. In consideration of the complicatedness\nof detecting these missing proteins by using wet-experiment approach, here we use bioinformatics method\nto pre-filter the missing proteins.\nResults: Since there are analogy between the biological sequences and natural language, the n-gram models\nfrom Natural Language Processing field has been used to filter the missing proteins. The dataset used in this\nstudy contains 616 missing proteins from the “uncertain” category of the neXtProt database. There are 102\nproteins deduced by the n-gram model, which have high probability to be native human proteins. We perform a detail\nanalysis on the predicted structure and function of these missing proteins and also compare the high probability\nproteins with other mass spectrum datasets. The evalu ation shows that the results reported here are in good\nagreement with those obtained by other well-established databases.\nConclusion: The analysis shows that 102 proteins may be native gene-coding proteins and some of the missing\nproteins are membrane or natively disordered protein s which are hard to be detected by experiment methods.\nKeywords: Human proteome, Missing protein, Biological language model\nBackground\nProteins play important roles in biology. The Human\nGenome Sequence Project [1] provides a comprehensive\ncompendium about all the human protein encoding\ngenes. However, due to the diversity of proteins and the\nunder-development of current proteomics technology,\nthere are many proteins which have not been identified\nand annotated.\nThe Human Proteome Project (HPP) [2] was launched\nby the Human Proteome Organization (HUPO) in 2011,\nwhich contains the Chromosome-centric HPP (C-HPP)\n[3] and Biology/Disease-Driven HPP (B/DHPP) [4]. This\nproject tries to identify as more proteins as possible with\nthe goal of covering all human protein-encoding genes.\nThis great goal is cooperated by an international associa-\ntions contains 25 members [5]. The baseline metrics for\nthe HPP contains five annually updated data resources\n[5]: the Ensembl database [6] provides the possible genes\ncoding proteins; Peptide Atlas [7] and GPMdb [8] separ-\nately screen high confident proteins from mass spec-\ntrometry data; the Human Protein Atlas [9] is in charge\nof extracting proteins by antibody-based research; and\nfinally neXtProt [10] collects all human proteins and\nassigns confidence level (PE 1-5) by protein expres-\nsion evidence. Proteins at the PE1 level are identified\nat protein expression level by mass spectrometry,\n* Correspondence: qwdong@sei.ecnu.edu.cn; xliu@shou.edu.cn\n1Institute for Data Science and Engineering, East China Normal University,\nShanghai 200062, People ’s Republic of China\n4College of Engineering, Shanghai Ocean University, Shanghai 201303,\nPeople’s Republic of China\nFull list of author information is available at the end of the article\n© The Author(s). 2016 Open Access This article is distributed under the terms of the Creative Commons Attribution 4.0\nInternational License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and\nreproduction in any medium, provided you give appropriate credit to the original author(s) and the source, provide a link to\nthe Creative Commons license, and indicate if changes were made. The Creative Commons Public Domain Dedication waiver\n(http://creativecommons.org/publicdomain/zero/1.0/) applies to the data made available in this article, unless otherwise stated.\nThe Author(s) BMC Systems Biology 2016, 10(Suppl 4):113\nDOI 10.1186/s12918-016-0352-6\nimmunohistochemistry, 3D structure, and/or amino acid\nsequencing. The proteins at PE2 level is detected by tran-\nscript expression but not by protein expression. At PE3\nlevel, there are no protein or transcript evidence, but have\nhomologies represented in related species. Proteins at PE4\nlevel are speculated from gene models. Finally, the protein\nsequences at PE5 level are generated from “dubious” or\n“uncertain” genes which seemed to have some protein-\nlevel evidence in the past but such identifications are\ndoubtful by curation.\nMuch progress has been achieved since 2011 by the\nproteomics community and the HPP. Based on the cur-\nation of neXtProt [11] database, currently 82% of the\nprotein-coding genes in human have protein expressions\nwith high-confidence. However, there are 3, 564 genes at\nlevels PE2-5 which have no or insufficient evidence of\nidentification by any experimental methods and are thus\nnamed as “missing proteins” [11]. Many of these missing\nproteins are hard to be detected because of low abun-\ndance, poor solubility, or indistinguishable peptide se-\nquences within protein families. The missing of such a\nsignificant amount of proteins marks a significant\nproblem about our current understanding of the hu-\nman proteome, with particularly important questions\nincluding, e.g., whether these proteins are essential to\nthe cell functions and if yes what biological roles they\nplay in cell and why they are not detectable by the\ncurrent instruments of both transcription and transla-\ntion levels. Thus identifying the missing proteins will\nb eac h a l l e n g i n gt a s k .\nPrevious study has shown that there are analogies\nbetween biological sequences and natural language. In\nlinguistics, some words and phrases can form a mean-\ningful sentence; in biology, the tactic nucleotides\ndenote gene, and the fixed protein sequences can deter-\nmine its structure and function. Tsonis [12] discussed\nthat whether DNA is a language or not. Many linguistic\napproaches have been used in computational biology\n[13– 15]. Ganapathiraju et al. [16] analyzed the language\nfeature of whole-genome protein sequence. Many tech-\nniques of Natural Languag e Pprocess have been used in\nbioinformatics, such as protein domain recognition\nbased on language modeling [17], dictionary-driven\nprotein annotation [18], protein remote homology de-\ntection by latent semantic analysis [19 – 22], identifica-\ntion of DNA-binding protein [23, 24], and so on.\nIn this study, the missing proteins in human proteome\nare identified by using biological language model. The\namino acid n-gram models for human and non-human\nprotein sequences are constructed. These models are\nsubsequently used to discriminate whether the missing\nproteins are natively gene-coding proteins in human or\nnot. The identified proteins are then analyzed by their\npredicted structures and functions, annotation from\nneXtProt database [10], HGNC database [25] and other\nmass spectrometry dataset [26].\nMethods\nDatasource\nThe native gene-coding proteins are downloaded from\nSwiss-Prot database [27]. To construct the reliable\nmodels, only the protein sequences with reviewed items\nare selected. Totally, there are 14565 human proteins\nand 70854 non-human proteins. The redundant se-\nquences are then filtered by using CD-HIT program [28]\nwith the sequence identity threshold of 90%. Finally, we\nget 14189 human proteins and 59060 non-human pro-\nteins, which are used to build the n-gram model for hu-\nman and non-human respectively.\nThe “dubious” or “uncertain” missing proteins with\nconfidence code “PE5” are extracted from the neXtProt\ndatabase [10] that was released at Sep. 19, 2014. There\nare in total 616 proteins in this category with length ran-\nging from 21 to 2, 252 residues. The structures of these\nproteins are predicted by using I-TASSER software [29].\nThe functions including the EC number, the GO terms\nand the binding sites are predicted by using COFAC-\nTOR software [30]. Both I-TASSER and COFACTOR\nare run in non-homology mode where all the homologous\nstructures identified with sequence identities greater than\nor equal to 30% are removed. The subcellular localization\nis predicted by using Hum-mPLoc [31].\nBiological language models to discriminate the native\ngene-coding human and non-human proteins\nThe protein sequences are composed of 20 native amino\nacids, while in natural language, the sentences are com-\nprised by words. Such similarity has draw researchers at-\ntention and the language features of DNA and protein\nsequence have been investigated extensively [32 – 34]. In\nthis study, the methods from natural language process-\ning, especially, the statistical natural language processing\nmethods which have been successfully solve many of the\nnatural language task [35], are applied to identify the\nmissing proteins. Formally, the problem of identifying\nmissing proteins can be described as following: given a\nprotein P =( a\n1, a2, … , aL), is this protein a human pro-\ntein or not:\nPH jPðÞ > PN H jPðÞ ð 1Þ\nwhere P(H|P) and P(NH|P) represent the probability of\nthis protein belongs to human and non-human. The\nabove equation can be converted by conditional prob-\nability formulae:\nThe Author(s) BMC Systems Biology 2016, 10(Suppl 4):113 Page 394 of 548\nPHðÞ PP jHðÞ\nPPðÞ > PN HðÞ PP jNHðÞ\nPPðÞ ð2Þ\nSince the denominator is the same, it can be ignored\nduring the comparison. P(H)a n d P(NH) are the prior\nprobability of human and non-human proteins, and can\nbe estimated from the training dataset by using maximum\nlikelihood estimation based on the number of human and\nnon-human protein. By applying the conditional probabil-\nity formulae repeatedly, the probability of P(H|P)o r\nP(NH|P) can be decomposed into:\nPP jHðÞ ¼ Pa\n1… aLjHðÞ\n¼ Pa 1jHðÞ Pa 2… aLjH; a1ðÞ\n¼ Pa 1jHðÞ Pa 2jH; a1ðÞ Pa 3… aLjH; a1; a2ðÞ\n¼ Pa 1jHðÞ\nXL\ni¼2Pa ija1… ai−1; HðÞ\nð3Þ\nThe n-gram model supposes that the occurrence of\neach word is only dependent on the previous n-1 words,\nso the above equation can be recalculated as:\nPP jHðÞ ≈\nXL\ni¼nPa ijai−nþ1… ai−1; HðÞ ð 4Þ\nwhere the conditional probability can be estimated by\nmaximum likelihood estimation:\nPa ijai−nþ1… ai−1ðÞ ¼ Ca i−nþ1… aiðÞ\nCa i−nþ1… ai−1ðÞ ð5Þ\nwhere C(ai…aj) is the number of occurrence of amino\nacid sequence ai..aj.\nThe same procedure can be applied to construct the\nn-gram model of non-human proteins. The missing pro-\nteins can be identified by using n-gram models to get\nwhether it ’s native human proteins or not.\nResults and discussions\nBased on the n-gram models, there are 102 proteins in the\nneXtProt “PE5” category which have high probabilities to\nbe native human proteins. In the following sections, these\nproteins are analyzed by the predicted structure and func-\ntion and annotations from other databases.\nThe structure and function analysis of the high-\nprobability proteins\nSince the missing proteins have not been identified by\nexperiment methods, their structures and functions are\ncurrently unknown. In this study, the structures and\nfunctions of the high-probability proteins inferred by n-\ngram models are predicted by I-TASSER and COFAC-\nTOR software and the confidence scores outputted by\nthe software are used to indicate the reliability of the\nprediction. The I-TASSER confidence score (C-score) is\ncomputed by the accuracy of the threading programs\nand the simulation results of the structural assembly\nprocess. The value range is between -5 and 2, where\nthe higher the C-score value is, the more confident\nthe corresponding model is, and vice-versa. A model\nwith I-TASSER C-score larger than -1.5 means that\nthe structure topology is correct. The confidence\nscore (C-score) of COFACTOR is calculated based on\nthe confidence score of the structure prediction and\nthe similarity between the predicted models and their\nnative structures in the PDB. The COFACTOR C-\nscore are normalized between 0 and 1, where a large\nvalue indicates a good prediction. Figure 1 shows the\ndistribution of I-TASSER and COFACTOR C-score of\nthe 102 high -probability missing proteins. The number of\nfoldable proteins (with C-score higher than -1.5) are less\nthan that of the un-foldable proteins (with C-score lower\nthan -1.5) which is also confirmed in our previous study\nFig. 1 The distribution of I-TASSER ( a) and COFACTOR ( b) C-score of the identified missing proteins\nThe Author(s) BMC Systems Biology 2016, 10(Suppl 4):113 Page 395 of 548\nabout missing proteins [36]. The reason for this\nphenomenon may be that the missing proteins are not\ngene-coding proteins or there is no homology templates\nused during prediction. Based on the results of structure\nprediction, there are 7 foldable proteins whose I-TASSER\nC-score are larger than the foldable threshold (-1.5).\nThese proteins have good structure models with no\nhomologous templates used during prediction, which\nmeans that they may be gene-coding proteins. Most\nof the COFACTOR C-scores are distributed between\n0.3 and 0.6, where 8 proteins have very high COFAC-\nTOR C-score. As shown in the figure, the COFAC-\nTOR C-score for most of the missing proteins are\nlarger than 0.2, which indicates a good function pre-\ndiction based on experience evaluation.\nStructural topology analyses of the I-TASSER models\nThe SCOPe library [37] is used as the classification cri-\nterion of structure topology, which is an extended\nstructure library integrated from the standard SCOP\n[38] and ASTRAL [39] databases. The structure class of\nthe I-TASSER model is assigned as the corresponding\nstructure class of the SCOPe domain which has the\nhighest structural similarity with the model. The struc-\nture alignment program TM-align [40] is used to calcu-\nlate the TM-score between the I-TASSER model and all\nstructural domains from SCOPe. If there are multiple\ndomains in target model, we selected the domain that\nhas the maximum TM-score to SCOPe domain. Figure 2\nshows the distribution of the SCOPe class of the identi-\nfied missing proteins. It is interesting that some missing\nproteins have structure topology in ‘membrane and cell\nsurface proteins and peptides’ and ‘coiled coil proteins ’\nclass. Such phenomenon is reasonable since these kind\nof proteins are difficult to be identified by experiment\nmethod.\nEvaluation of the function base on gene ontology\nThe GO molecular function of the high-probability miss-\ning proteins is predicted by the COFACTOR package and\nthe number in each GO item is shown in Fig. 3. As shown\nin the Fig. 3 GO terms come from the first level of GO\nmolecular function. Most of the high-probability missing\nproteins have the GO function of ‘binding’(GO:0005488)\nand ‘catalytic activity’(GO:0003824). However some miss-\ning proteins may be membrane proteins since they have\nthe GO function of ‘transporter activity ’ (GO:0005215)\nand ‘receptor activity’(GO:0004872). The results are con-\nsistent with the structural topology analysis in which there\nare many membrane proteins in the missing proteins.\nComparision of subcellular localization\nThe subcellular localizations of proteins are critical for\ntheir biological functions. The Hum-mPLoc 2.0 program\n[31] is used to predict the subcellular localizations of the\nhigh-probability missing proteins. The types of subcellu-\nlar localizations and the number of proteins in each\ntypes is illustrated in Fig. 4. Most of the proteins are lo-\ncated at extracellular and nucleus. The missing proteins\nare also observed at plasma membrane, which is also\nconfirmed by the results from the structural topology\nanalysis and function predictions.\nFig. 2 Relative frequency distribution of SCOP classes for the identified missing proteins\nThe Author(s) BMC Systems Biology 2016, 10(Suppl 4):113 Page 396 of 548\nHGNC mapping analysis\nThe HGNC [41] database is in charge of assigning a\nunique symbol and name for each gene loci from human\ngenome. Most of the HGNC data are manually collected\nand carefully checked [41]. The information from\nHGNC gene loci provides valuable resource to identify\nthe missing proteins. Based on the Gene mapping, 71\nout of the 102 high-probability missing proteins can be\nmapped to one or more HGNC items. We collected the\ncorresponding gene loci types for the 71 missing pro-\nteins and counted the number of missing proteins in\neach loci type. The results are shown in Table 1. There\nare 9 proteins confirmed by HGNC with gene loci type\n“gene with protein product ”. There are 26 pseudogenes.\nSince pseudogenes are the products of evolution. They\nusually have homologous proteins. That ’s the reason why\nthere are many pseudogenes in the missing proteins.\nConsistence analysis with other mass spectrometry\ndataset\nMass spectrometry is currently one of the efficient\nmethod to identify protein peptides. There are many\nmass spectrometry data deposited in public database,\nsuch as PeptideAtlas [42] and GPMDB [8]. The sketch\nFig. 3 The distribution of predicted GO items from the fist level of molecular function\nFig. 4 The distribution of subcellular localizations for the identified missing proteins\nThe Author(s) BMC Systems Biology 2016, 10(Suppl 4):113 Page 397 of 548\nof human proteome is drawing by mass spectrometry\ndata [26, 43]. Recently Kim et al [26] reported that about\ntwo-third (2535/3844) of the “missing proteins ” [11]\nhave been identified. Actually the “missing proteins ”\nused by Kim et al. are constituted by the neXtProt pro-\nteins with evidence codes of “PE2”, “PE3” or “PE4”. This\npaper aims to identify the “PE5” missing proteins. By\nRefSeq [44] mapping, we found that there are 41 “PE5”\nproteins which are also in Kim ’s dataset. Among these\n41 missing proteins, there are 6 proteins are foldable\nbased on the structure prediction results in non-\nhomology mode. These results indicate that our finding\nare in good consistent with Kim ’s results.\nConclusion\nIn this study, the human gene-coding proteins currently\nundetected are identified by using biological language\nmodels. The amino acid n-gram models of human and\nnon-human proteins are constructed. These models are\nthen used to identify the “uncertain” missing proteins with\nevidence code “PE5” from neXtProt database. The results\nshow that 102 high probability proteins may be gene-\ncoding proteins. The structure, function and subcellular\nlocalization of these proteins are then inferred by using\nthe advanced programs. The identified missing proteins\nare then analyzed with the annotation from other data-\nbase. Without using homology templates, 7 proteins have\ncorrect structure topology with I-TASSER C-score larger\nthan -1.5. The predicted functions are mainly within GO\nitems ‘binding’ (GO:0005488) and ‘catalytic activity ’\n(GO:0003824). 9 missing proteins are confirmed by\nHGNC with gene loci type “gene with protein product ”.6\nmissing proteins are also detected by mass spectrometry\nexperiment. The analysis also shows that many of the un-\nknown proteins are membrane or natively disordered pro-\nteins which are difficult to be detected. The identified\nmissing proteins need to be further validated by experi-\nmental approach. The results in this study provides valu-\nable complementary resource for the human proteome.\nDeclarations\nThis article has been published as part of BMC Systems Biology Volume 10,\nSupplement 4, 2016: Proceedings of the 27th International Conference on\nGenome Informatics: systems biology. The full contents of the supplement\nare available online at http://bmcsystbiol.biomedcentral.com/articles/\nsupplements/volume-10-supplement-4.\nFunding\nFinancial support funding for publication costs was provided by the National\nKey Research and Development Program of China (Grant No.\n2016YFB1000905) and National Natural Science Foundation of China (Grant\nNo. 61672234, U1401256 and 61402177).\nAvailability of data and materials\nThe datasets of the current study are freely available by requesting on the\ncorresponding authors.\nAuthors’ contributions\nDQW performed the experiment and wrote the paper. WK proposed the\nidea and polished the paper. LX designed the architecture and analyzed the\nresults. All authors read and approved the paper.\nCompeting interests\nThe authors declare that they have no competing interest.\nConsent for publication\nNot applicable.\nEthics approval and consent to participate\nNot applicable.\nAuthor details\n1Institute for Data Science and Engineering, East China Normal University,\nShanghai 200062, People ’s Republic of China. 2Key Laboratory of Network\nOriented Intelligent Computation, Harbin Institute of Technology Shenzhen\nGraduate School, Shenzhen 518055, People ’s Republic of China. 3College of\nAnimal Science and technology, Jilin Agricultural University, Changchun\n130118, People ’s Republic of China.\n4College of Engineering, Shanghai Ocean\nUniversity, Shanghai 201303, People ’s Republic of China.\nPublished: 23 December 2016\nReferences\n1. Venter JC, Adams MD, Myers EW, Li PW, Mural RJ, Sutton GG, Smith HO,\nYandell M, Evans CA, Holt RA, et al. The sequence of the human genome.\nScience. 2001;291(5507):1304– 51.\n2. Legrain P, Aebersold R, Archakov A, Bairoch A, Bala K, Beretta L, Bergeron J,\nBorchers CH, Corthals GL, Costello CE, et al. The human proteome project:\ncurrent state and future direction. Mol Cell Proteomics. 2011;10(7):M111 009993.\n3. Paik YK, Jeong SK, Omenn GS, Uhlen M, Hanash S, Cho SY, Lee HJ, Na K,\nChoi EY, Yan F, et al. The Chromosome-Centric Human Proteome Project for\ncataloging proteins encoded in the genome. Nat Biotechnol.\n2012;30(3):221–3.\n4. Aebersold R, Bader GD, Edwards AM, van Eyk JE, Kussmann M, Qin J,\nOmenn GS. The biology/disease-driven human proteome project (B/D-HPP):\nenabling protein research for the life sciences community. J Proteome Res.\n2013;12(1):23–7.\n5. Marko-Varga G, Omenn GS, Paik YK, Hancock WS. A first step toward\ncompletion of a genome-wide characterization of the human proteome.\nJ Proteome Res. 2013;12(1):1 –5.\n6. Flicek P, Amode MR, Barrell D, Beal K, Billis K, Brent S, Carvalho-Silva D,\nClapham P, Coates G, Fitzgerald S, et al. Ensembl 2014. Nucleic Acids Res.\n2014;42(Database issue):D749 –755.\n7. Farrah T, Deutsch EW, Hoopmann MR, Hallows JL, Sun Z, Huang CY, Moritz\nRL. The state of the human proteome in 2012 as viewed through\nPeptideAtlas. J Proteome Res. 2013;12(1):162 –71.\n8. Craig R, Cortens JP, Beavis RC. Open source system for analyzing, validating,\nand storing protein identification data. J Proteome Res. 2004;3(6):1234– 42.\n9. Uhlen M, Oksvold P, Fagerberg L, Lundberg E, Jonasson K, Forsberg M,\nZwahlen M, Kampf C, Wester K, Hober S, et al. Towards a knowledge-based\nHuman Protein Atlas. Nat Biotechnol. 2010;28(12):1248 –50.\n10. Lane L, Argoud-Puy G, Britan A, Cusin I, Duek PD, Evalet O, Gateau A,\nGaudet P, Gleizes A, Masselot A, et al. neXtProt: a knowledge platform for\nhuman proteins. Nucleic Acids Res. 2012;40(Database issue):D76 –83.\n11. Lane L, Bairoch A, Beavis RC, Deutsch EW, Gaudet P, Lundberg E, Omenn\nGS. Metrics for the Human Proteome Project 2013-2014 and strategies for\nfinding missing proteins. J Proteome Res. 2014;13(1):15 –20.\nTable 1 The gene loci types and the number of proteins for\nthe high-probability missing proteins after hgnc mapping\nGene loci type No. missing proteins\nGene with protein product 9\nPseudogene 26\nRNA, long non-coding 30\nUnknown 6\nThe Author(s) BMC Systems Biology 2016, 10(Suppl 4):113 Page 398 of 548\n12. Tsonis AA, Elsner JB, Tsonis PA. Is DNA a language? J Theor Biol.\n1997;184(1):25 –9.\n13. Dyrka W, Nebel JC. A stochastic context free grammar based framework for\nanalysis of protein sequences. BMC Bioinformatics. 2009;10:323.\n14. Ganapathiraju M, Balakrishnan N, Reddy R, Klein-Seetharaman J.\nComputational Biology and Language. Ambient Intell Sci Discov LNAI.\n2005;3345:25–47.\n15. Searls DB. Linguistic approaches to biological sequences. Comput Appl\nBiosci. 1997;13(4):333– 44.\n16. Ganapathiraju M, Weisser D, Rosenfeld R, Carbonell J, Reddy R, Klein-\nSeetharaman J: Comparative n-gram analysis of whole-genome protein\nsequences. In: Proceedings of the second international conference on\nHuman Language Technology Research. San Diego: Morgan Kaufmann\nPublishers Inc; 2002. pp. 76 –81.\n17. Coin L, Bateman A, Durbin R. Enhanced protein domain discovery by using\nlanguage modeling techniques from speech recognition. Proc Natl Acad\nSci. 2003;100(8):4516 –20.\n18. Rigoutsos I, Huynh T, Floratos A, Parida L, Platt D. Dictionary-driven protein\nannotation. Nucleic Acids Res. 2002;30(17):3901 –16.\n19. Dong Q-W, Wang X-L, Lin L. Application of latent semantic analysis to\nprotein remote homology detection. Bioinformatics. 2006;22(3):285 –90.\n20. Liu B, Wang X, Lin L, Dong Q. A discriminative method for protein remote\nhomology detection and fold recognition combining Top-n-grams and\nlatent semantic analysis. BMC Bioinformatics. 2008;9:510.\n21. Liu B, Xu J, Zou Q, Xu R, Wang X, Chen Q. Using distances between Top-n-\ngram and residue pairs for protein remote homology detection. BMC\nBioinformatics. 2014;Suppl 2:S3.\n22. Liu B, Zhang D, Xu R, Xu J, Wang X, Chen Q, Dong Q, Chou KC. Combining\nevolutionary information extracted from frequency profiles with sequence-\nbased kernels for protein remote homology detection. Bioinformatics.\n2014;30(4):472–9.\n23. Liu B, Xu J, Fan S, Xu R, Zhou J, Wang X. PseDNA-Pro: DNA-Binding Protein\nIdentification by Combining Chou ’s PseAAC and Physicochemical Distance\nTransformation. Mol Inform. 2015;34(1):8 –17.\n24. Liu B, Xu J, Lan X, Xu R, Zhou J, Wang X, Chou KC. iDNA-Prot|dis: identifying\nDNA-binding proteins by incorporating amino acid distance-pairs and\nreduced alphabet profile into the general pseudo amino acid composition.\nPLoS ONE. 2014;9(9):e106691.\n25. Gray KA, Yates B, Seal RL, Wright MW, Bruford EA. Genenames. org: the\nHGNC resources in. Nucleic Acids Res. 2015;43(D1):D1079 –85.\n26. Kim M-S, Pinto SM, Getnet D, Nirujogi RS, Manda SS, Chaerkady R,\nMadugundu AK, Kelkar DS, Isserlin R, Jain S. A draft map of the human\nproteome. Nature. 2014;509(7502):575 –81.\n27. Consortium U. UniProt: a hub for protein information. Nucleic Acids Res.\n2015;43(Database issue):D204 –212.\n28. Fu L, Niu B, Zhu Z, Wu S, Li W. CD-HIT: accelerated for clustering the next-\ngeneration sequencing data. Bioinformatics. 2012;28(23):3150 –2.\n29. Roy A, Kucukural A, Zhang Y. I-TASSER: a unified platform for automated\nprotein structure and function prediction. Nat Protoc. 2010;5(4):725 –38.\n30. Roy A, Yang J, Zhang Y. COFACTOR: an accurate comparative algorithm for\nstructure-based protein function annotation. Nucleic Acids Res. 2012;40(Web\nServer issue):W471 –477.\n31. Shen HB, Chou KC. A top-down approach to enhance the power of\npredicting human protein subcellular localization: Hum-mPLoc 2.0. Anal\nBiochem. 2009;394(2):269 –74.\n32. Liu B, Liu F, Fang L, Wang X, Chou KC. repDNA: a Python package to\ngenerate various modes of feature vectors for DNA sequences by\nincorporating user-defined physicochemical properties and sequence-order\neffects. Bioinformatics. 2015;31(8):1307 –9.\n33. Liu B, Liu F, Wang X, Chen J, Fang L, Chou KC. Pse-in-One: a web server for\ngenerating various modes of pseudo components of DNA, RNA, and\nprotein sequences. Nucleic Acids Res. 2015;43(W1):W65 –71.\n34. Liu B, Liu F, Fang L, Wang X, Chou KC. repRNA: a web server for generating\nvarious feature vectors of RNA sequences. Mol Genet Genomics.\n2016;291(1):473–81.\n35. Hristea FT. Statistical Natural Language Processing. In: International\nEncyclopedia of Statistical Science. Heidelberg: Springer; 2011. pp. 1452 –1453\n36. Dong Q, Menon R, Omenn GS, Zhang Y. Structural Bioinformatics Inspection\nof neXtProt PE5 Proteins in the Human Proteome. J Proteome Res.\n2015;14(9):3750–61.\n37.\nFox NK, Brenner SE, Chandonia J-M. SCOPe: Structural Classification of\nProteins— extended, integrating SCOP and ASTRAL data and classification of\nnew structures. Nucleic Acids Res. 2014;42(D1):D304 –9.\n38. Murzin AG, Brenner SE, Hubbard T, Chothia C. SCOP: a structural\nclassification of proteins database for the investigation of sequences and\nstructures. J Mol Biol. 1995;247(4):536 –40.\n39. Chandonia JM, Hon G, Walker NS, Lo Conte L, Koehl P, Levitt M, Brenner SE.\nThe ASTRAL Compendium in 2004. Nucleic Acids Res. 2004;32(Database\nissue):D189–192.\n40. Zhang Y, Skolnick J. TM-align: a protein structure alignment algorithm\nbased on the TM-score. Nucleic Acids Res. 2005;33(7):2302 –9.\n41. Gray KA, Yates B, Seal RL, Wright MW, Bruford EA. Genenames.org: the HGNC\nresources in 2015. Nucleic Acids Res. 2015;43(Database issue):D1079 –85.\n42. Desiere F, Deutsch EW, King NL, Nesvizhskii AI, Mallick P, Eng J, Chen S,\nEddes J, Loevenich SN, Aebersold R. The PeptideAtlas project. Nucleic Acids\nRes. 2006;34(Database issue):D655 –658.\n43. Wilhelm M, Schlegl J, Hahne H, Moghaddas Gholami A, Lieberenz M, Savitski\nMM, Ziegler E, Butzmann L, Gessulat S, Marx H, et al. Mass-spectrometry-based\ndraft of the human proteome. Nature. 2014;509(7502):582 –7.\n44. Pruitt KD, Brown GR, Hiatt SM, Thibaud-Nissen F, Astashyn A, Ermolaeva O,\nFarrell CM, Hart J, Landrum MJ, McGarvey KM, et al. RefSeq: an update on\nmammalian reference sequences. Nucleic Acids Res. 2014;42(Database\nissue):D756–763.\n•  We accept pre-submission inquiries \n  Our selector tool helps you to ﬁnd the most relevant journal\n  We provide round the clock customer support \n  Convenient online submission\n  Thorough peer review\n  Inclusion in PubMed and all major indexing services \n  Maximum visibility for your research\nSubmit your manuscript at\nwww.biomedcentral.com/submit\nSubmit your next manuscript to BioMed Central \nand we will help you at every step:\nThe Author(s) BMC Systems Biology 2016, 10(Suppl 4):113 Page 399 of 548",
  "topic": "Systems biology",
  "concepts": [
    {
      "name": "Systems biology",
      "score": 0.7123291492462158
    },
    {
      "name": "Human proteome project",
      "score": 0.67766273021698
    },
    {
      "name": "Computational biology",
      "score": 0.6544861793518066
    },
    {
      "name": "Proteome",
      "score": 0.6525111198425293
    },
    {
      "name": "Biological network",
      "score": 0.4768332540988922
    },
    {
      "name": "Computer science",
      "score": 0.4727899730205536
    },
    {
      "name": "Human biology",
      "score": 0.4253772497177124
    },
    {
      "name": "Biology",
      "score": 0.3682721257209778
    },
    {
      "name": "Data science",
      "score": 0.36057963967323303
    },
    {
      "name": "Proteomics",
      "score": 0.34658709168434143
    },
    {
      "name": "Bioinformatics",
      "score": 0.3033473491668701
    },
    {
      "name": "Genetics",
      "score": 0.11393311619758606
    },
    {
      "name": "Gene",
      "score": 0.0827186107635498
    }
  ]
}