{
  "title": "Comparison of Double Stage Heat Transformer with Double Absorption Heat Transformer Operating with Carrol – Water for Industrial Waste Heat Recovery",
  "url": "https://openalex.org/W2583532968",
  "year": 2011,
  "authors": [
    {
      "id": "https://openalex.org/A5037130360",
      "name": "R.J. Romero",
      "affiliations": [
        "Universidad Autónoma del Estado de Morelos"
      ]
    },
    {
      "id": "https://openalex.org/A5102708539",
      "name": "A. Rodríguez–Martínez",
      "affiliations": [
        null
      ]
    },
    {
      "id": "https://openalex.org/A5016449466",
      "name": "Jesús Cerezo",
      "affiliations": [
        null
      ]
    },
    {
      "id": "https://openalex.org/A5031532464",
      "name": "W. Rivera",
      "affiliations": [
        null
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1968736289",
    "https://openalex.org/W2007079331",
    "https://openalex.org/W2031940793",
    "https://openalex.org/W2138687210",
    "https://openalex.org/W1493520779",
    "https://openalex.org/W2045812957",
    "https://openalex.org/W2056880110",
    "https://openalex.org/W1594604909"
  ],
  "abstract": "Abstract preview not available - see full-text PDF article.",
  "full_text": "Comparison of Double Stage Heat Transformer with \nDouble Absorption Heat Transformer Operating with \nCarrol – Water for Industrial Waste Heat Recovery \nRosenberg J. Romero1*, Antonio Rodríguez Martínez1, Sotsil Silva1, Jesús Cerezo2, W. \nRivera3 \n1Engineering and Applied Science Research Centre (CIICAP), Autonomous University \nof Morelos State. Av. Universidad 1001, Chamilpa (62209), Cuernavaca, Morelos, \nMexico, rosenberg@uaem.mx  \n2Renewable Energy Studies Centre, Eng Inst (II), Autonomous Univ of Baja California \nCalle de la Normal s/n, Col. Insurgentes Este, (21280) Mexicali, B.C., Mexico \n3Energy Research Centre (CIE), National Autonomous University of México, Av. \nXochicalco S/N, Centro (62580), Temixco, Morelos, Mexico \n \nThis work shows the first comparison of two industrial energy saving devices. An \nabsorption heat transformer (AHT) is an industrial device based on thermodynamic \ncycle with the purpose to recover heat at  higher temperatures. The thermodynamics \ncycles have crystallization fluids limits. The gross temperature lift (GTL) is a parameter \nfor comparison of heat pumps devices. Heat pumps may compare themselves with GTL \nand Coefficient of Performance (COP) to define the best fluid or operating conditions \nfor same process. Double stage heat transformer (DSHT) is a device designed for cover \nthe upper conditions and avoid crystallization problem of AHT using two AHT, also \ndouble absorption heat tran sformer (DAHT) is an alternative device for operating \nconditions where AHT is not able to operate. The studied industrial process \n(sterilization vegetables) has operating temperatures from 120 to 140 °C from waste \nheat at 60 °C or 70 °C. The results show the operating conditions for DSHT and DAHT \nwith Carrol – water mixture. Conclusion show COP values as function of GTL, waste \nheat temperature, ambient temperature an d revalorized temperature. DSHT COP is \nhigher than DAHT COP for same operating purposes. These devices are a technological \nalternative for waste energy recovery. \n1. Introduction \nA heat pump (HP) is a therma l machine that tran sfers heat from something at a lower \ntemperature to something at a higher temper ature. There are different kinds of “heat-\npumps”. There are two heat pumps: Type I and II. “Type I” is a device with evaporation \nprocess at lower temperature than condensation process. Type II is another device with \ncondensation process at lower temperatur e than evaporation process. The main \ndisadvantage of the process of absorption h eat pumps is due to cyclical feature that \nrequires a transitional period in which thermodynamic equilibrium is established \nthroughout the system. \n2. Industrial waste recovery state of the art \nSeveral processes are able for heat recovery by heat integration analysis (Feng, 2011). \nHowever, heat integration only exchange h eat at similar levels. An absorption heat \ntransformer (AHT) or Single Stage Heat Transformer (SSHT) is a thermal device made \nfor heat revalorization. The main objective of a SSHT is to increase the temperature \nvalue of industrial waste heat or solar energy (Sözen, 2007).  \n2.1 Advanced cycles of heat transformers \nA single-stage heat transformer (SSHT) can be  used for industrial waste heat recovery \nat intermediate temperatures when it is nece ssary to increase the temperature similar to \nor lower than 50 ° C. However, when it is necessary to increase the temperature higher \nthan 50 °C from original source, it could be  used advanced thermal transformer such as \ndouble stage heat transformer (DSHT) and double absorption heat transformer (DAHT). \n2.1.1 Double absorption heat transformers \nDouble absorption heat transformers (DAHT) consist of a generator, a condenser, an \nevaporator, an absorber, a second absorber /evaporator and an economizer as shown in \nFigure 2. A heat source is supplied to separa te the working fluid in the generator at an \nintermediate temperature. Then the vapou rized working fluid is condensed in the \ncondenser at a lower temperature. Then the condensed working fluid is split into two \nparts, one of them is pumped into the ev aporator where it is vapourized at an \nintermediate temperature and pressure (doted lines), and the other part is pumped at a \nhigher pressure and vapourized in the seco nd absorber/evaporator by means of an \namount of available heat. The vapourized working fluid is absorbed in the absorber, at \nthe highest temperature by th e rich solution coming from the generator. The solution at \nan intermediate salt concentration is split into two streams, one goes to the generator \npreheating the rich solution through the heat exchanger and the other is fed to the \nabsorber/evaporator absorbing the vaporized working fluid coming from the evaporator \nand delivering an amount of heat. Finally, the poor salt solution at a low concentration \nleaving the absorber/evaporator goes to the generator starting the cycle again. \n2.1.2 Double Stage heat transformer \nA double stage heat transformer (DSHT) c onsists of two SSHT, which can be coupled \nin three different ways. There are some studies for the interconnection for DSHT. The \nuseful heat from first absorber may be divided for the second evaporator and second \ngenerator. \n \n \nPE\nPump1\nExpa\nnsion \nvalve Pump2\nQEV QAB\nQGE\nAbsorber\nCondenser Generato\nEvaporator \nTCO \nPCO \nT \nP \nTEV \nEconomizer \nQC\nTAB      \nGenerador \nCondenser  \nEvaporator2, \nAbsorber1\nAbsorber2 \nEconomizer  \nEvaporator\nW W W\nQEV1\nQAB\nQGE \nQCO\n \nFigure 1: Schematic diagram for SSHT           Figure 2: DAHT schematic diagram \nThe amount of entering energy in second stage is almost 50 % from the total amount \nentering at first stage. Other way to connect the stages is from first absorber to second \ngenerator; however this connection is limited by crystallization risk. The best option for \nthe connection of DSHT is to add the useful  heat from first absorber to the second \nevaporator, and add waste heat in second generator to avoid crystallization problems. In \nthe figure 3 the dotted lines represent vapour from evaporators to absorbers and vapour \nfrom generators to condensers. In this figures there is not draw the heat loads to avoid \nconfusion, because there are many lines for the interconnection of components. The \nwaste heat is added in the DSHT in the generator 1 (Q\nGE1), evaporator 1 (Q EV1), and \ngenerator 2 (Q GE2) and the useful heat from absorber 1 (Q AB1) is conducted to \nevaporator 2 (Q EV2), so the useful heat at higher te mperature is obtained in absorber 2 \n(QAB2). \n \nG enerator 1 \nCondenser 1 \nEvaporator 1 \nAbs or b e r  1 \nEconomizer 1 \nW\nW\nG enerator 2 \nCondenser 2 \nEvaporator 2 \nAbs or be r  2 \nEconomizer 2 W\nW\n \n \nFigure 3: DSHT schematic diagram. \n3. Operation conditions \nFollowing the mathematical models developed by previous papers (Romero, 2010; Jun \n1999) and their assumptions, comparisons were carried out. The waste heat is added at \n60 °C or 70 °C into the evaporators and generator. The surroundings leads to the \ncondenser to operate at 20 °C or 25 °C, and the purpose temperature is above 120 °C \nand still 140 °C for sterilization vegetables process, because for higher temperatures \nthere is undesirable effect in the vitamins concentrations (De Roeck, 2008). The useful \nheat obtained from DAHT and DSHT must be constant for the sterilization process \nbecause the exposed time is a critical vari able (Oerlemans, 2006). Carrol – water \n(Reimann, 1984) is used into the advanced  system for higher COP compared with \ncommercial mixture (aqueous lithium bromide) (McNelly, 1979). Waste heat lead to the \nDAHT and DSHT to keep constant generator (T\nGE) and evaporator (T EV) temperatures. \nWhile absorber temperature (TAB) affect the useful heat and according equations 1 to 3, \ndiminished also the respective COP. Eco nomizers are pre-heater for concentrated \nsolution from generator and it is assumed with constant effectiveness equal to 0.7 in all \ncalculations for the comparison of bot h DAHT and DSHT. The effect of the \neffectiveness of economizer was previously reported (Kakac, 2002) and 0.7 is a value \nfor commercial plate heat exchanger. Finall y, waste heat was considered as constant \nvalue between 10 and 15 kW for this study, this waste heat is added as Q EV and QGE for \nDAHT and Q GE1, QEV1 and Q EV2 for DSHT. Temperature of waste heat is considering \nthe same for the entering into de DAHT and DSHT, of course for industrial process this \nmean that are large areas for heat transfer and the losses are negligible.  \n4. Comparison main parameters \nThe most important design parameters for an absorption heat transformer are: the \ncoefficient of performance and the gross temper ature lift. It is defined as the ratio of \nuseful heat delivered and wasted heat added to the system. \n1WQQ\nQCOP\nEVGE\nAB\nSSHT\n++=  (1) \n211,\n2,\nWWQQ\nQCOP\nEVGE\nAB\nDAHT\n+++=  (2) \n43212,1,1,\n2,\nWWWWQQQ\nQCOP\nGEEVGE\nAB\nDSHT\n++++++=  (3) \n \nIn a previous paper it was concluded that work done by centrifugal pumps were \nnegligible because those were only 2 % of waste heat. These works are not considered \nfor COP calculation. Although the COP is less than unity always for these systems, they \nhave the unique ability to raise the temperature of any waste heat to transform it at a \nuseful heat. (Holland, 1999; Rivera, 2001). The gross temperature lift (GTL) is defined \nas the difference between the useful temperature and the added waste heat temperature: \n \nEVABSSHT TTGTL −=  (4) \n1,2, EVABDAHT TTGTL −=  (5) \n1,2, GEABDSHT TTGTL −=  (6) \n5. Results \nIn Figure 4, DAHT COP as function of GTL is shown, for condensation temperature at \n20 °C and 25 °C, upper and lower lines. Both lines are for waste heat added at 70 °C. In \nthis Figure it can be observe useful temperature from 111 °C (according Equation 5) \nstill 140 °C (GTL = 70 °C). The highest COP is almost the same (0.27) and diminishes \nfor higher temperature. Useful heat at 120  °C may operate with a COP of 0.249 and \n0.235. For 130 °C the COP are 0.198 and 0.147 for each line, and both conditions are \nable for the sterilization purpose. \nFigure 5, compared with the previous one, are both similar. The highest COP for these \nconditions happens at 135 °C (GTL = 65 °C) for two first absorber temperatures: 100 \nand 95 °C, upper and lower lines. The COP goes from 0.297 to 0.244 in the upper line \nand from 0.292 to 0.091 in the lower line. For useful recovery heat at 140 °C (GTL \nequal to 70 according equation 6) the COP are 0.289 and 0.277 for first stage absorber \ntemperature at 100 and 95 °C. \n \n0.000\n0.050\n0.100\n0.150\n0.200\n0.250\n0.300\n40 45 50 55 60 65 70 75\nGTL (°C)\nCOP DAHT (dimensionless)\n \nFigure 4: COP for DAHT for industrial energy recovery as GTL function. \n0.000\n0.050\n0.100\n0.150\n0.200\n0.250\n0.300\n0.350\n60 65 70 75 80 85\nGTL (°C)\nCOP DSHT (dimensionless)\n \nFigure 5: COP as function of GTL for DSHT whit T CO = 25 °C, waste heat temperature \nat 70 °C and first absorber temperature at 95 and 100 °C. \n6. Conclusions \nThe single stage heat transformer (SSHT) ha s crystallization limit, therefore advanced \nheat transformer are proposed for recovery energy at higher levels than SSHT. For \nindustrial process the double absorption heat transformer (DAHT) and double stage heat \ntransformer (DSHT) are proposed for temperatures from 120 °C to 140 °C, for \nsterilization vegetables process. The results shows that it is possible to recover energy \nfrom 70 °C for this purpose, with a Coeffi cient of performance (COP), in DAHT from \n0.147 to 0.198, than means between 14 to 19 % of recovery from waste heat at 70 °C. \nThe other analyzed advanced system is DSHT , with a first stage useful temperature at \n95 or 100 °C, in this case, the COP is higher than for DAHT at 120 °C, and 140 °C. The \nCOP for 140 °C goes from 0.277 to 0.289, which is 27 % to 28 % from energy at 70 °C \nand revalued to 140 °C. Finally, the comparison of both systems indicates that \nsurroundings temperature affect the perfor mance of system. The higher condensation \ntemperature into de DAHT and DSHT diminish the COP values, both systems recovers \nhigher amount of energy (higher COP) at 20 °C instead 25 °C. \nReferences \nDe Roeck A., Sila D. N., Duvetter T. and Lo ey A. V., Hendrickx M., 2008, Effect of \nhigh pressure/high temperature processing on cell wall pectic substances in relation \nto firmness of carrot tissue, Food Chemistry, 107, 1225–1235 \nFeng X., Pu J.,Yang J., and Chu K.H., 2011, Energy recovery in petrochemical \ncomplexes through heat integration retrofit analysis, Applied Energy, 88, 1965–1982 \nJun J. and Masaru I, 1999, Behavior of a two-stage absorption heat transformer \ncombining latent and sensible heat exchange modes, Applied Energy, 62, 67-281   \nKakaç S., 2002, Heat exchangers: selection, rating and thermal design, CRC Press. 373-\n385 \nOerlemans K., Barrett D. M. and Bosch S. C., Verkerk R., Dekker M., 2006, Thermal \ndegradation of glucosinolates in red cabbage, Food Chemistry, 95, 9–29 \nMcNelly A., 1979, Thermodynamic properties of aqueous solutions of lithium bromide, \nASHRAE Transactions, 413-434 \nReimann R. and Biermann W. J., 1984, Development of a single family absorption \nchiller for use in solar heating and cooling system, Phase III Final Report, US DoE, \nEG-77-C-03-1587, Carrier Corporation. \nRivera W., Cardoso M. J. and Romero R. J., 2001, Single-stage and advanced \nabsorption heat transformers operating with lithium bromide mixtures used to \nincrease solar pond’s temperature, Solar Energy Mater & Solar Cells, 70, 321-333 \nRomero R.J., Silva Sotelo S. and Cerezo J ., 2010, First Double Stage Heat Transformer \n(Dsht) in Latin America, Chemical Engineering Transaction, 9, 149 - 155 \nSözen A. and Serdar Y. H., 2007, Performance improvement of absorption heat \ntransformer, Renewable Energy, 32, 267-284 ",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.6389760971069336
    },
    {
      "name": "Mexico city",
      "score": 0.5625675320625305
    },
    {
      "name": "Waste heat",
      "score": 0.5613961219787598
    },
    {
      "name": "Renewable energy",
      "score": 0.4401945173740387
    },
    {
      "name": "Environmental science",
      "score": 0.3892490267753601
    },
    {
      "name": "Humanities",
      "score": 0.32112228870391846
    },
    {
      "name": "Electrical engineering",
      "score": 0.26860201358795166
    },
    {
      "name": "Engineering",
      "score": 0.209172785282135
    },
    {
      "name": "Art",
      "score": 0.16337740421295166
    },
    {
      "name": "Mechanical engineering",
      "score": 0.14061108231544495
    },
    {
      "name": "Heat exchanger",
      "score": 0.0
    },
    {
      "name": "Voltage",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I884181516",
      "name": "Universidad Autónoma del Estado de Morelos",
      "country": "MX"
    }
  ]
}