{
  "title": "An evaluation of copy number variation detection tools for cancer using whole exome sequencing data",
  "url": "https://openalex.org/W2617530335",
  "year": 2017,
  "authors": [
    {
      "id": "https://openalex.org/A2618133614",
      "name": "Fatima Zare",
      "affiliations": [
        "University of Connecticut"
      ]
    },
    {
      "id": "https://openalex.org/A2160346191",
      "name": "Michelle Dow",
      "affiliations": [
        "University of California, San Diego"
      ]
    },
    {
      "id": "https://openalex.org/A2620359078",
      "name": "Nicholas Monteleone",
      "affiliations": [
        "University of Connecticut"
      ]
    },
    {
      "id": "https://openalex.org/A2304849468",
      "name": "Abdelrahman Hosny",
      "affiliations": [
        "University of Connecticut"
      ]
    },
    {
      "id": "https://openalex.org/A2629677719",
      "name": "Sheida Nabavi",
      "affiliations": [
        "University of Connecticut",
        "Institute for Systems Biology"
      ]
    },
    {
      "id": "https://openalex.org/A2618133614",
      "name": "Fatima Zare",
      "affiliations": [
        "University of Connecticut"
      ]
    },
    {
      "id": "https://openalex.org/A2160346191",
      "name": "Michelle Dow",
      "affiliations": [
        "University of San Diego",
        "University of California, San Diego"
      ]
    },
    {
      "id": "https://openalex.org/A2620359078",
      "name": "Nicholas Monteleone",
      "affiliations": [
        "University of Connecticut"
      ]
    },
    {
      "id": "https://openalex.org/A2304849468",
      "name": "Abdelrahman Hosny",
      "affiliations": [
        "University of Connecticut"
      ]
    },
    {
      "id": "https://openalex.org/A2629677719",
      "name": "Sheida Nabavi",
      "affiliations": [
        "University of Connecticut",
        "Institute for Systems Biology"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2398147728",
    "https://openalex.org/W2162212014",
    "https://openalex.org/W2096318664",
    "https://openalex.org/W2059300459",
    "https://openalex.org/W2055798820",
    "https://openalex.org/W2024091637",
    "https://openalex.org/W2073198149",
    "https://openalex.org/W2010164205",
    "https://openalex.org/W1971321176",
    "https://openalex.org/W2110374888",
    "https://openalex.org/W2153240577",
    "https://openalex.org/W2159733789",
    "https://openalex.org/W2107751484",
    "https://openalex.org/W1965856472",
    "https://openalex.org/W2090129174",
    "https://openalex.org/W2085070983",
    "https://openalex.org/W2060084956",
    "https://openalex.org/W2066827579",
    "https://openalex.org/W2153056550",
    "https://openalex.org/W2020624823",
    "https://openalex.org/W2022385074",
    "https://openalex.org/W2118526609",
    "https://openalex.org/W2153010521",
    "https://openalex.org/W2010498181",
    "https://openalex.org/W2134151441",
    "https://openalex.org/W2022714591",
    "https://openalex.org/W2078512370",
    "https://openalex.org/W2021714239",
    "https://openalex.org/W2169766923",
    "https://openalex.org/W2032247293",
    "https://openalex.org/W2012151892",
    "https://openalex.org/W1579730317",
    "https://openalex.org/W2149118757",
    "https://openalex.org/W2140888103",
    "https://openalex.org/W2046137036",
    "https://openalex.org/W2040657105",
    "https://openalex.org/W2141637710",
    "https://openalex.org/W2170490448",
    "https://openalex.org/W2117656191",
    "https://openalex.org/W1984542357",
    "https://openalex.org/W2032518018",
    "https://openalex.org/W2002843742",
    "https://openalex.org/W2169744057",
    "https://openalex.org/W2107126369",
    "https://openalex.org/W2144759168",
    "https://openalex.org/W2155943701",
    "https://openalex.org/W2080809959",
    "https://openalex.org/W2097360336",
    "https://openalex.org/W2133257334",
    "https://openalex.org/W2158931791",
    "https://openalex.org/W2131478115",
    "https://openalex.org/W1743872520",
    "https://openalex.org/W2121812297"
  ],
  "abstract": "The limited performance of the current CNV detection tools for WES data in cancer indicates the need for developing more efficient and precise CNV detection methods. Due to the complexity of tumors and high level of noise and biases in WES data, employing advanced novel segmentation, normalization and de-noising techniques that are designed specifically for cancer data is necessary. Also, CNV detection development suffers from the lack of a gold standard for performance evaluation. Finally, developing tools with user-friendly user interfaces and visualization features can enhance CNV studies for a broader range of users.",
  "full_text": "RESEARCH ARTICLE Open Access\nAn evaluation of copy number variation\ndetection tools for cancer using whole\nexome sequencing data\nFatima Zare 1, Michelle Dow 2, Nicholas Monteleone 1, Abdelrahman Hosny 1 and Sheida Nabavi 3*\nAbstract\nBackground: Recently copy number variation (CNV) has gained considerable interest as a type of genomic/genetic\nvariation that plays an important role in disease susceptibility. Advances in sequencing technology have created an\nopportunity for detecting CNVs more accurately. Recently whole exome sequencing (WES) has become primary strategy\nfor sequencing patient samples and study their genomics aberrations. However, compared to whole genome\nsequencing, WES introduces more biases and noise that make CNV detection very challenging. Additionally,\ntumors’complexity makes the detection of cancer specific CNVs even more difficult. Although many CNV detection\ntools have been developed since introducing NGS data, there are few tools for somatic CNV detection for WES\ndata in cancer.\nResults: In this study, we evaluated the performance of the most recent and commonly used CNV detection tools for\nWES data in cancer to address their limitations and provide guidelines for developing new ones. We focused on the\ntools that have been designed or have the ability to detect cancer somatic aberrations. We compared the performance\nof the tools in terms of sensitivity and false discovery rate (F DR) using real data and simulated data. Comparative analysis\nof the results of the tools showed that there is a low consensus among the tools in calling CNVs. Using real data,\ntools show moderate sensitivity (~50% - ~80%), fair s pecificity (~70% - ~94%) a nd poor FDRs (~27% - ~60%).\nAlso, using simulated data we observed that increasing the coverage more than 10× in exonic regions does not\nimprove the detection power of the tools significantly.\nConclusions: The limited performance of the current CNV detection tools for WES data in cancer indicates the need\nfor developing more efficient and precise CNV detection methods. Due to the complexity of tumors and high level of\nnoise and biases in WES data, employing advanced novel segmentation, normalization and de-noising techniques that\nare designed specifically for cancer data is necessary. Also, CNV detection development suffers from the lack of a gold\nstandard for performance evaluation. Fi nally, developing tools with user-frien dly user interfaces and visualization\nfeatures can enhance CNV studies for a broader range of users.\nKeywords: Copy number variation, Whole-exome sequencing, Somatic aberrations, Cancer\nBackground\nRecently, biomedical researchers have considered the\nimpact of genomics variations on human diseases as it\nprovides valuable insight into functional elements and\ndisease-causing regulatory variants [1 – 3]. Specific focus\nis drawn on copy number variation (CNV), which is a\nform of structural variation of the DNA sequence,\nincluding multiplication and deletions of a particular\nsegment of DNA (> 1 kb) [4]. The interest and import-\nance of CNVs has risen in a wide collection of diseases\nincluding Parkinson [5], Hirschsprung [6], diabetes mel-\nlitus [7], Autism [8 – 10], Alzheimer [11], schizophrenia\n[12] and cancer [13]. Specifically, significant effort has\nfound associations between CNVs and cancers [13 – 16].\nCancer is well known as a disease of genome and gen-\nomic aberrations of interest in cancer are mostly somatic\naberrations, since tumors arise from normal cells with\nacquired aberrations in their genomic materials [16, 17].\n* Correspondence: sheida.nabavi@uconn.edu\n3Computer Science and Engineering Department and Institute for Systems\nGenomics, University of Connecticut, Storrs, CT, USA\nFull list of author information is available at the end of the article\n© The Author(s). 2017 Open Access This article is distributed under the terms of the Creative Commons Attribution 4.0\nInternational License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and\nreproduction in any medium, provided you give appropriate credit to the original author(s) and the source, provide a link to\nthe Creative Commons license, and indicate if changes were made. The Creative Commons Public Domain Dedication waiver\n(http://creativecommons.org/publicdomain/zero/1.0/) applies to the data made available in this article, unless otherwise stated.\nZare et al. BMC Bioinformatics  (2017) 18:286 \nDOI 10.1186/s12859-017-1705-x\nCNV is one of the most important somatic aberrations\nin cancer [13, 17 – 19], since oncogene activation is often\nattributed to chromosomal copy number amplification,\nand tumor suppressor gene inactivation is often caused\nby either heterozygous deletion associated with mutation\nor by homozygous deletion. Thus identification of som-\natic CNV can have an important role in cancer prognosis\nand treatment improvement [20].\nArray-based technologies have been used widely since\nlate 1990s for more than a decade as an affordable and\nrelatively high-resolution assay for CNV detection [21].\nHowever, array-based technologies have limitations asso-\nciated with hybridization, which results in poor sensitiv-\nity and precision; and with resolution, related to the\ncoverage and density of the array ’s probes. With the\narrival of next generation sequencing (NGS) technolo-\ngies [22], sequence-based CNV detection has rapidly\nemerged as a viable option to identify CNVs with higher\nresolution and accuracy [14, 23, 24]. As a result, recently\nwhole-genome sequencing (WGS) and whole-exome\nsequencing (WES) have become primary strategies for\nNGS technologies in CNV detection and for studying of\nhuman diseases. In most cases, CNVs are identified from\nWGS data. Yet, WGS is considered too expensive for\nresearch involving large cohort and WES, which is\ntargeted to protein coding regions (less than 2% of the\ngenome), is becoming an alternative, cost-effective strat-\negy [25]. Even though WES has several technical issues\n[26], it has been emerged as one of the most popular\ntechniques for identifying clinically relevant aberrations\nin cancer [27]. WES, can offer lower cost, higher cover-\nage, and less complex data analysis, which are appealing\nfor clinical application when there are several samples.\nExome represents a highly function-enriched subset of\nthe human genome, and CNVs in exome are more likely\nto be disease-causing aberrations than those in nongenic\nregions [28, 29].\nMany tools have been developed for CNV detection\nusing WGS data. However, these methods are not suitable\nfor WES data since their main assumptions on read distri-\nbutions and continuity of data do not hold. In addition,\nWES data introduce biases due to hybridization, which do\nnot exist in WGS data and are not considered in the CNV\ndetection methods. On the other hand, germline and som-\natic CNVs are very different in their overall coverage of\nthe genome and their frequency across population; and\nthey need to be identified differently. The characteristics\nof somatic CNVs need special consideration in algorithms\nand strategies in which germline CNV detection programs\nare usually not suited for. In general, germline CNVs cover\nsmall portion of the genome (about 4%) [30], they are\nmore deletion, and they are common among different\npeople. However somatic CNVs can cover a majority part\nof a genome, can be focal, and are unique for each tumor.\nAs a result CNV detection methods that are developed for\nidentifying population CNVs or germline CNVs cannot be\nused for identifying somatic aberrations. Also, identifying\nsomatic CNVs in cancer is very challenging because of the\ntumor heterogeneity and complexity: tumor samples are\ncontaminated by normal tissue, the ploidy of tumors is\nunknown, and there are multiple clones in tumor samples.\nOn top of the tumor samples ’complexity there are experi-\nmental, technical and sequencing noise and biases which\nmakes somatic CNV detection very challenging.\nEven though many CNV detection tools and methods\nhave been developed since introducing NGS data, there\nare few tools available for somatic CNV detection for\nWES data in cancer. Because of the popularity of WES\nin cancer studies and challenges of detecting somatic\nCNV using WES data, in this study we focus on CNV\ndetection methods and tools for WES data in cancer.\nThe objectives of this study are addressing the limita-\ntions of the current tools and methods and providing\nguidelines for developing new ones. In this work first,\nwe briefly explain the CNV detection methods and chal-\nlenges for WES data and then introduce the recent CNV\ndetection tools for WES data. Then we present the\nperformance analysis of the tools in terms of sensitivity\nand specificity of detecting true CNVs, using real data\nand simulated data.\nMethods\nCNV detection methods\nIn general there are three main approaches to identify\nCNV from next generation sequencing data: 1) read\ncount, 2) paired-end, 3) assembly [31]. In the read depth\n(RD) approach mostly a non-overlapping sliding window\nis used to count the number of short reads that are\nmapped to a genomic region overlapped with the win-\ndow. Then these read count values are used to identify\nCNV regions. Due to reducing the cost of sequencing\nand improving the sequencing technologies more and\nmore high-coverage NGS data are available; as a result,\nRD-based methods have recently become a major\napproach to identify CNVs. Paired-end (PE) approach,\nwhich are applied to paired-end NGS data, identifies\ngenomics aberration based on the distances between the\npaired reads. In paired-end sequencing data, reads from\nthe two ends of the genomics segments are available.\nThe distance between a pair of paired-end reads is used\nas an indicator of a genomics aberration including CNV.\nA genomic aberration is detected when the distance is\nsignificantly different from the predetermined average\ninsert size. This approach is mostly used for identifying\nother type of structural variation (beyond CNVs) such as\ninversion and translocation. In the assembly approach\nshort reads are used to assemble the genomics regions\nby connecting overlapping short reads (contigs). CNV\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 2 of 13\nregions are detected by comparing the assembled contigs\nto the reference genome. In this methods short reads are\nnot aligned to the reference genome first. Since in WES\ntargeted regions are exonic regions, they are very short\nand discontinuous across the genome. As a result, the\nPE and assembly approaches for identifying CNVs are\nnot suitable for WES data. Also high coverage of WES\ndata makes the RD approach more practical. Therefore,\nall CNV detection tools for WES are based on the RD\napproach.\nIn general, the RD approach consist of two major\nsteps: 1) preprocessing, and 2) segmentation. The input\ndata are aligned short reads in BAM, SAM or Pileup\nformats. In the preprocessing step, WES data ’s biases\nand noise are eliminated or reduced. Normalization and\nde-noising algorithms are the main components of this\nstep. In the segmentation step a statistical approach is\nused to merge the regions with the similar read count to\nestimate a CNV segment. The most commonly used\nstatistical methods for segmentation are circular binary\nsegmentation (CBS) and hidden Markov model (HMM).\nIn CBS, the algorithm recursively localizes the breakpoints\nby changing genomic positions until the chromosomes are\ndivided into segments with equal copy numbers that are\nsignificantly different from the copy numbers from their\nadjacent genomic regions. In HMM the read count\nwindows are sequentially binned along the chromosome\naccording to whether they are likely to measure an ampli-\nfication, a deletion, or a region in which no copy number\nchange occurred. Even though other statistical methods\nhave been introduced for detecting CNVs from WGS\ndata, these two methods are the most common\nmethods that are used in the current CNV detection\ntools for WES data.\nChallenges for detecting somatic CNVs in cancer\nDespite improvements to sequencing technologies and\nCNV detection methods, identifying CNV is still a chal-\nlenging problem. Complexity of tumors and technical\nproblems of WES add more challenges to identifying\nsomatic CNVs from WES data in cancer [31, 32]. In this\nsection we briefly explain the challenges that somatic\nCNV identification are faced with in cancer when using\nWES data. We divide these challenges into three classes:\nchallenges due to 1) sequencing data, 2) WES technical\nproblems, and 3) tumor complexity.\nChallenges due to sequencing data\nThe main assumption of the RD based CNV detection\nalgorithms is that the read counts and CNV for a\nparticular region are correlated. However, there are\nbiases and noise that distort the relationship between\nthe read count and copy number. These biases and noise\ninclude GC bias, mappability bias, experimental noise,\nand technical (sequencing) noise. GC content varies\nsignificantly along the genome and has been found to\ninfluence read coverage on most sequencing platforms\n[33, 34]. In the alignment step, a huge number of reads\nare mapped to multiple positions due to the short read\nlength and the presence of repetitive regions in the refer-\nence genome [34, 35]. These ambiguities in alignment\ncan produce unavoidable biases and error in RD based\nCNV detection methods [33]. Furthermore, sample\npreparation, library preparation and sequencing process\nintroduce experimental and systematic noise that can\nhinder CNV detection [34, 36].\nChallenges due to WES technical problem\nThe exome capture procedure in the library preparation\nprocess for WES introduces biases and noise that dis-\ntorts the relation between read count and CNV. In the\nWES library preparation, the hybridization process pro-\nduces biases. In addition, the distribution of read in the\nexonic regions is not even, which is another source of\nbias [37]. It is very common that in some genomic\nregions the read count is very low. This low read counts\naffect the statistical analysis for calling CNVs and as a\nresult produce noise in the CNV detection algorithms.\nChallenges due to tumor complexity\nComplexity of cancer tumor also distorts the relation-\nship between read count and CNV and as a result pro-\nduces noise. The tumor complexity includes tumor\npurity, tumor ploidy, and tumor subclonal heterogeneity.\nTumor samples are mostly contaminated by normal\ncells. Therefore, mapped read on a particular region are\nnot all belong to tumor cells. As a result, read count\nvalues do not completely reflect copy number of tumor\ncells and the tumor normal copy number ratio is less\nthan the real value. This introduces difficulties in calling\ncopy number segments. A threshold for calling CNV will\ndepend on tumor purity, which is usually unknown.\nThere are a few tools available to estimate tumor purity\n[38, 39]. Aneuploidy of the tumor genome is observed in\nalmost all cancer tumors [40], which creates difficulties\nin determining the copy number values. The normal\ntumor read count ratio is corresponding to the average\nploidy, which is usually unknown in the tumor sample.\nIt is observed that multiple clonal subpopulations of\ncells are present in tumors [41]. Due to their low\npercentage in a sample, it is hard to determine the sub-\nclones. This intra-tumor heterogeneity or multiple\nclonality distorts the CNV and makes calling CNV\nsegments complicated.\nCNV detection tools\nAS of August 2016, we have identified fifteen sequence-\nbased CNV detection tools (Additional file 1: Table S1)\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 3 of 13\nfor WES data. Several studies have already evaluated and\ncompared the performance of CNV detection tools for\nWES data [31, 32, 42]. However, the focus of their work\nhas not been on cancer. In this work, we restricted the\nanalysis and comparison of CNV tools to those that have\nbeen used or have the ability to detect cancer specific\naberrations (somatic aberrations). Due to the fast advan-\ncing sequencing technologies, we also focused on the\nwidely used and more recent tools. Out of the available\nCNV detection tools for WES data, we chose the tools\nthat fit the criteria of (1) ability to detect somatic aberra-\ntion, (2) using read depth (RD) method and (3) was pub-\nlished in the recent years or commonly used. Six tools\nmeet the above criteria: (1) ADTEx [25], (2) CONTRA\n[43], (3) cn.MOPS [44], (4) ExomeCNV [45], (5) VarS-\ncan2 [46], and (6) CoNVEX [47]. ADTEx and CoNVEX\nwere developed by the same group using a similar\nmethod, which ADTEx is the modified version of the\nCoNVEX. As a result, we only considered ADTEx. More\nrecent tools, such as CANOES [48], ExomDepth [49],\nand cnvCapSeq [50], are not used specifically for cancer;\ntherefore we did not consider them in this study. The\nlist of the tools that we considered in this study and\ntheir general characteristics are provided in Table 1.\nADTEx [25] is specifically designed to infer copy num-\nber and genotypes using WES from paired tumor/nor-\nmal samples. ADTEx uses both read count ratios and B\nallele frequencies (BAF) to detect CNV along with their\ngenotypes. It addresses the problem of tumor complexity\nby employing BAF data, if these data are available. For\nnormalization, ADTEx first calculates the average read\ncount of exonic regions for both tumor and normal, and\nthen computes the ratios of read counts for each exonic\nregion. ADTEx also uses the Discrete Wavelet Trans-\nform approach as a preprocessing step to reduce the\nnoise of read count ratio data. It uses the HMM method\nfor segmentation and CNV call. Two HMMs are used in\nthe detection algorithm: one to detect CNVs in combin-\nation with BAF signal to estimate the ploidy of the\ntumor and predict the absolute copy numbers, the other\nto predict the zygosity or genotype of each CNV seg-\nment. When the BAFs of tumor samples are available,\nthey fitted the HMM for different base ploidy values. To\ndetermine the base ploidy, ADTEx selects the SNPs\nwhich overlaps with each exonic region, segments BAFs\nusing CBS algorithm, estimates B allele count for differ-\nent ploidy levels, and finally uses the distances between\nB allele counts to provide the best fit for base ploidy.\nCONTRA [45] is a method used for CNV detection\nfor targeted resequencing data, including WES data. It is\ndesigned to detect CNV for very small target regions\nranging between 100 to 200 bp. The main difference\nbetween CONTRA and the other method is that it cal-\nculates and normalizes the read count and log ratio for\neach base (not a window or exon). This allows for better\nGC normalization and log ratio calculations for low\ncoverage regions. After calculating base-level log ratios,\nit estimates region-level log ratios by averaging the base-\nlevel log ratios over the targeted regions (exons in\nWES). Then, it normalizes the region-level log ratios for\nthe library size of control and normal samples. The\nsignificant values of the normalized region-level log\nratios are calculated by modeling region-level log ratios\nas normal distribution. For detecting large CNVs span-\nning multiple targeted regions (exons), CONTRA per-\nforms CBS on region-level log-ratios. To call a CNV\nsegment, at least half of the segment has to have overlap\nwith the significant region-level CNVs. This method\naddresses the problems of some very low coverage\nregions and sequencing biases (GC bias), which are due\nto uneven distribution of reads in WES.\nThe main difference between cn.MOPS [44] and other\ntools is that it can use several samples for each genomics\nregion to have a better estimate of variations and true\ncopy numbers. cn.MOPS uses non-overlapping sliding\nwindow to compute read counts for genomic regions.\nTo model read count, it employs a mixture of Poisson\ndistribution across the samples. The model is used to\nestimate copy number for each genomic region.\ncn.MOPS does not calculate ratios of case and control.\nInstead it uses a metric that measure the distance\nbetween the observed data and null hypothesis, which is\nall samples have copy number of 2. If CNV differs from\n2 across the sample, the metric is higher. This metric is\nused for segmentation by CBS per sample. At each gen-\nomic position, cn.MOPS uses the model of read counts\nacross samples, so it is not affected by read count alter-\nation along chromosomes. By using Baysian approach,\ncn.MOPs can estimate noise and so it can reduce the\nfalse discovery rate (FDR).\nExomeCNV is designed specifically for WES data\nusing pairs of case-control samples such as tumor-\nnormal pairs. It counts the overlapping reads for exons;\nand by using these read counts for tumor and normal, it\ncomputes the ratio of read counts for each exonic\nregions. Hinkley transformation (ratio distribution) is\nused to infer the normal distribution for the read count\nratios. After finding ratios of tumor and normal for\nexonic regions, CBS is used for segmentation. If the\ntumor purity is given in advance, ExomeCNV will use it\nto compute copy numbers. It also can detect loss of het-\nerozygosity (LOH) if BAF data is given. ExomeCNV\ndivides the average read count by the overall exome\naverage read count to normalize the average read count\nper exon.\nVarScan2 [46] is also specifically designed for the\ndetection of somatic CNVs in WES from tumor – normal\npairs. To compute the read counts of bases, the\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 4 of 13\nTable 1 Selected tools for the performance analysis of CNV detection tools using WES data\nTool name ADTEx CONTRA cn.MOPS ExomeCNV VarScan 2\nChara- Cteristics\nControl set required Yes Yes No Yes No\nProg. Language Python, S/R Python, R R R Java\nInput format BAM, BED BAM, SAM, BED BAM, Read count matrices BAM, Pileup, GTF BAM, Pileup\nSegmentation Algorithm HMM CBS CBS CBS NAa\nOS GNU, Linux Linux, Mac OS Linux, Mac OS, windows Linux, Mac OS, windows Linux, Mac OS, windows\nMethodology\ncharacteristic\nDWTc for de-noising,\nuse BAF d\nBase-level log-ratio Bayesian approach for de-noising Statistical test for analyzing BAF\ndata\nCMDSb for generating read\ncounts\nYear 2014 2012 2012 2011 2012\nURL http://adtex.sourceforge.net https://sourceforge.net/projects/\ncontra-cnv/\nhttp://www.bioinf.jku.at/software/\ncnmops/cnmops.html\nhttps://secure.genome.ucla.edu/\nindex.php/ExomeCNV_User_Guide\nhttp://varscan.sourceforge.net/\naSegmentation is not imbedded in the tool. CBS is recommended for segmentation\nbCorrelation Matrix Diagonal Segmentation\ncDiscrete wavelet transform\ndB allele frequencies\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 5 of 13\nalgorithm considers only high quality bases (phred base\nquality ≥20) for tumor and normal samples individually.\nIt does not use a sliding window or exons to generate\nread count data. Instead, it calculates tumor to normal\nread count ratios of the high quality bases that full fill\nthe minimum coverage requirement. Then, in each\nchromosome, consecutive bases that their tumor to nor-\nmal read count ratios do not change significantly, based\non the Fisher ’s exact test, are binned together as a\ngenomic region to generate read count data. For each\ngenomic region, copy number alterations are detected\nand then are normalized based on the amount of input\ndata for each sample. A segmentation algorithm in not\nembedded into the VarScan2 tool and CBS algorithm is\nrecommended for the segmentation of the genomic\nregions.\nData sets\nIn this work, we used real and simulated WES data to\nevaluate CNV tools ’ performances.\nReal data\nWe used ten breast cancer patient tumor-normal pair\nWES datasets from the cancer genome atlas (TCGA) to\nevaluate the performance of the CNV detection tools. The\nlist of samples is given in the Additional file 1: Table S2.\nThe WES data were generated by the Illumina Genome\nAnalyzer platform at Washington University Genome\nSequencing Center (WUGSC). The aligned BAM files of\nthese 20 samples (10 tumor-normal pairs) were down-\nloaded from The Cancer Genomics Hub (CGHub),\nhttps://cghub.ucsc.edu/index.html. We also used array-\nbased CNV data from the same 10 tumor samples as a\nbenchmark for the CNV detection tools evaluation. We\ndownloaded SNP-array level 3 data from the Affymetrix\ngenome-wide SNP6 platform from the TCGA data\nportal website (https://portal.gdc.cancer.gov/projects/\nTCGA-BRCA) for the 10 tumors.\nSimulated data\nTo evaluate the performance of the tools, we have also\nused benchmark datasets generated by a CNV simulator,\ncalled VarSimLab [51]. VarSimLab is a simulation soft-\nware tool that is highly optimized to make use of exist-\ning short read simulators. Reference genome in FASTA\nformat and sequencing targets (exons in the case of\nWES) in BED format are inputs of the simulator. A list\nof CNV regions that are affected by amplifications or de-\nletions is randomly generated according to the simula-\ntion parameters. The CNV simulator manipulates the\nreference genome file and the target file before generat-\ning short reads that exhibit CNVs. The output consists\nof: (i) a list file that contains the synthesized amplifica-\ntions and deletions in txt format, (ii) short reads with no\nCNVs as control in FASTQ format, and (iii) short reads\nwith synthesized CNV as case in FASTQ format.\nWe used VarSimLab to generate simulated short reads\nof length 100 bp for chromosome 1. We generated syn-\nthesized datasets with 3 M, 2 M, 1 M, 0.5 M, 0.1 M,\n0.05 M, 0.01 M reads to simulate different coverage\nvalues (approximately from 0.2X to 60X in exonic\nregions). For each coverage value, we generated 10 data-\nsets (70 datasets in total). These simulated data with\nknown CNV regions were used to evaluate the perform-\nance of the CNV detection tools in terms of sensitivity\nand specificity for identifying CNV regions.\nComparison methods\nTo evaluate the performance of the tools in terms of\nsensitivity, false discovery rate (FDR) and specificity for\ndetecting CNVs we compared their detected CNVs with\nthe benchmark CNVs. For this comparison, we utilized\ntwo approaches: 1) gene-based comparison, and 2)\nsegment-based comparison. Gene-based comparison\nanalysis indicates the performance of the tools on calling\nCNVs only on exonic regions, which are the targets of\nthe WES. However, segment-based analysis indicates the\nperformance of the tools on overall calling CNV\nsegments across the genome.\nGene-based comparison\nFor the gene-based comparison, we first annotated the\ndetected CNV segments in the benchmark and samples\nfor both real data and simulated data. We used\n“cghMCR” R package from Bioconductor [52] to identify\nCNV genes using Refseq gene identifications. The aver-\nage of the CNV values of the overlapping CNV segments\nfor each gene is used as the gene CNV value. A thresh-\nold of ± thr for log2 ratios was used for calling CNV\ngenes, that is: amplification for log2 ratios > thr, deletion\nfor log2 ratios < − thr, and No CNV for log2 ratios\nbetween - thr and thr.\nFor each tool, we computed sensitivity, specificity\nand FDR separately for amplification and deletion. If\nwe name the detected CNV value for a specific gene\nas CNVtest and the benchmark CNV value of the\ngene as CNVbench, then we can define True Positive\n(TP), False Positive ( FP), True Negative ( TN)a n d\nFalse Negative ( FN) for amplified and deleted genes\na sg i v e ni nT a b l e2 .\nThe sensitivities or true positive rates (TPRs), speci-\nficities (SPCs) and FDRs are calculated using the\nfollowing equations for both amplified and deleted\ngenes.\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 6 of 13\nTPR ¼ TP\nTP þ FNðÞ ; ð1Þ\nFDR ¼ FP\nTP þ FPðÞ ; ð2Þ\nand\nSPC ¼ TN\nFP þ TNðÞ ð3Þ\nFor each tool we calculated TPRs, SPCs, and FDRs of\nthe tools for all datasets and used their average values.\nSegment-based comparison\nFor the segment-based comparison, we focused on com-\nparing the CNV segments between detected CNVs and\nbenchmark CNVs. Similar with the gene-based CNV\ncomparison, we used a threshold ( thr) to call amplified,\ndeleted and no CNV segments. Comparing CNV regions\nbetween detected CNVs and their corresponding bench-\nmark CNVs is more complicated than comparing CNV\ngenes. Detected CNV segments, unlike CNV genes, have\ndifferent sizes and different start and end positions com-\npared to those of benchmark CNV segments. We used\n“GenomicRanges” R package from Bioconductor [52] to\nobtain overlapping regions between detected CNVs and\nbenchmark CNVs. If an amplified/deleted segment of a\nsample, which has CNV > thr/C N V< −thr, has an over-\nlap of 80% or more with a benchmark amplified/deleted\nsegment it was considered as TP. If we cannot find an\noverlap of 80% or more between a detected CNV region\nand any benchmark CNVs, the detected CNV segment\nwas consider as FP. An amplified/deleted segment in the\nbenchmark that does not have an overlap of 80% or\nmore with any detected amplified/deleted regions was\ncalled FN. Since the regions with no CNVs cover very\nlarge sections of a genome we did not calculate TN\nregions. Therefor for segment-based comparison we\ncalculated TPRs and FDRs as eqs. 1 and 2. If we name a\nCNV segment of samples as TestSeg and a CNV segment\nof benchmark as BenchSeg, we can calculate TPs, FPs\nand FNs as shown in Table 3.\nResults and Discussion\nReal data\nGene-based comparison\nThe average sensitivity, specificity and FDR of the 5\nCNV detection tools on real breast cancer WES data are\nshown in Table 4 (The CNV results of the tools for the\nreal samples are given in Additional files 2, 3, 4, 5 and 6).\nThresholds of ±0.2 were used to call CNV genes. In\nsummary tools show moderate sensitivities (~50% to\n~80%), fair specificities (~70% to ~94%) and poor FDRs\n(~30% to 60%) on detecting CNV genes. Of the five\ntools, ExomeCNV was found to outperform other tools\nwith the highest sensitivity rate of 83.67% for amplifica-\ntion and 81.3% for deletion. VarScan2 (FDR = 26.87%,\nSPC = 92.71%) and ADTEx (FDR = 41.80%,\nSPC = 94.18%) show the best FDR and specificity for\ndetecting amplified and deleted genes (Table 4). Exo-\nmeCNV employs a minimum power/specificity parameter,\nand it makes a call on a specific exon if the desired power/\nspecificity is achieved by the coverage of that exon. That is\nlikely the reason of its better performance.\nIn general, tools show higher FDRs in detecting\ndeleted genes compared to detecting amplified genes.\nADTEx, CONTRA, and cn.MOPS show similar rate of\nsensitivity for detecting the true amplified CNV genes\n(about 50%). The high FDRs of the tools might be\nTable 4 Overall performance of the CNV detection tools using\nthe gene-based comparison approach for real data\nMethod ADTEx CONTRA cn.MOPS ExomeCNV VarScan2\nAmplification\nSensitivity 51.53% 54.37% 58.03% 83.67% 69.11%\nFDR 33.70% 53.52% 57.36% 38.79% 26.87%\nSPC 89.84% 83.06 66.54% 82.07 92.71%\nDeletion\nSensitivity 50.14% 64.95% 52.81% 82.94% 76.77%\nFDR 41.80% 64.86% 61.35% 45.31% 51.91%\nSPC 94.18% 78.86% 78.08% 87.26% 82.52%\nIn the table, bold value in each line represents the best value of each\nperformance measure\nTable 2 Computing TP, FP, TN and FN for Gene-Based comparison\nof the performance of the tools\nAmplification CNVbench > thr CNVbench < thr\nCNVtest > thr TP FP\nCNVtest < thr FN TN\nDeletion CNVbench < ( − thr) CNVbench > ( −thr)\nCNVtest < ( −thr) TP FP\nCNVtest > ( −thr) FN TN\nTable 3 Computing TP , FP and FN for Segment-Based comparison\nAmplification BenchSeg CNV > thr BenchSeg CNV < thr\nTestSeg CNV > thr TP if they have overlap\n>80% of TestSeg\nFP if they have overlap\n>80% of TestSeg\nTestSeg CNV < thr FN if they have overlap\n>80% of TestSeg\n…\nDeletion BenchSeg CNV < − thr BenchSeg CNV > −thr\nTestSeg CNV < −thr TP if they have overlap\n>80% of TestSeg\nFN if they have overlap\n>80% of TestSeg\nTestSeg CNV > −thr FN if they have overlap\n>80% of TestSeg\n...\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 7 of 13\npartially due to using array-based CNV results as bench-\nmark CNVs. Array-based technologies suffer from low\nresolution due to probe intensities, which results in\ndetecting large CNV regions and missing the detection\nof small CNV regions.\nTo examine the consistency of the tools ’ results, we\ncompared the CNV calls of the genes for each sample\nacross the tools. Figure 1 shows the CNV calls of 55\nbreast cancer related genes [53, 54] for the breast cancer\nsamples used in this study. It can be seen that there is\nno strong consistency among the tools in calling these\nbreast cancer related genes for each sample. There are\nfew genes that are called as amplified or deleted in each\nsample by all the tools. Many genes are called as ampli-\nfied by some tools, deleted by some other tools and no\nCNV by the rest. As can be seen from Fig. 1, sample 3\nhas a few amplified or deleted CNV regions compared\nto other samples; thus, we removed it for the rest of ana-\nlysis. Figure 2a and b show the Venn diagram of the\naverage of the number of truly detected deleted and\namplified genes by the tools from all the samples. As\ncan be seen, a small fraction of true amplified and true\ndeleted genes are common across all the tools. Only 946\ngenes out of 4849 true amplified genes in union, and\n569 genes out of 4104 true deleted genes in union are\ncommon across the tools, which show low consistency\namong the tools.\nSegment-based comparison\nAverage sensitivities and FDRs of the CNV detection\ntools based on the segment-based comparison analysis\nare given in Table S3 in Additional file 1. We considered\nan overlap of at least 80% between the detected CNVs\nand benchmark CNVs to call TPs and FPs. We also used\nthresholds of ±0.2 to call CNV regions. Sensitivities and\nFDRs of the segment-based analysis are almost similar\nto the sensitivities and FDRs of the gene-based analysis.\nHowever, we observed that tools that can detect larger\nCNV segments show better performance. This is most\nlikely due to use large benchmark CNV regions from the\narray-based technologies. ExomeCNV and cn.MOPS\nshow the highest sensitivities for detecting CNV\nSegments; and cn.MOPS and VarScan2 show the lowest\nFDR for detecting CNV Segments (Additional file 1:\nTable S3). ExomeCNV and cnMOPS also detect a\ngreater percentage of large CNV segments (Fig. 3a).\nThe CNV size distributions and the number of the\ndetected CNVs from the breast cancer samples by the\nfive tools are shown in Fig. 3. There is no strong\nconsistency among the tools on the size and number of\ndetected CNVs as well. Tools that detect larger CNV\nsegments detect lower number of CNVs and tools that\ndetect shorter CNV segments detect more CNVs (Fig. 3a\nand b). That indicates a high level of errors in CNV\nbreak point (CNV segment edge) detection. In Fig. 3a,\nFig. 1 CNV call of 55 breast cancer related genes. Blue: deletion, Red: amplification, and light yellow no CNV call. Order of tools from left to right:1 :\nADTEx, 2: ExomeCNV, 3: CONTRA, 4: cn.MOPS, and 5: VarScan2\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 8 of 13\ncn.MOPS and ADTEx show a tendency to detect larger\nCNV segments. CONTERA detects shorter CNV\nsegments. Only about 1% of its detected CNVs regions\nare larger than 1000 K.\nWe also examined the computational complexity of\nthese CNV detection tools by comparing their execution\ntimes. In order to compare the running time of the tools,\nwe run the tools using one of the breast cancer sample\nfor 5 times and averaged their execution times. The runs\nperformed on a single node of the same computer clus-\nter. Figure 4 shows the average execution times of the\ntools on the real dataset. In Fig. 4, you can see that while\nADTEx takes the longest time, cn.MOPS is the fastest\ntool among the five tools. The running times of the\nother three tools are almost comparable.\nIn summary, ADTEx has a moderate sensitivity and\nbetter FDR. Similar to cn.MOPS, it is capable of detect-\ning larger CNV regions, but it detects CNVs with a\nwider range of sizes. ADTEx is the most recently devel-\noped tool for CNV detection. Different from the other\nfour tools, it employs two HMMs for calling CNVS and\na denoising method for preprocessing. Its detection\nmethod is more computationally expensive compared to\nthe other tools. CONTRA has a moderate sensitivity and\nFDR, with a wide range of detected CNVs sizes. Its\nperformance outperforms the other tool using simulated\ndata. Because CONTRA was developed based on empir-\nical relationships between log-ratios and read count data,\nit relies on the case sample being largely copy number\nneutral. But this might not be true for cancer data, and\nresults in poor performance for real cancer data.\ncn.MOPS also has a moderate sensitivity and FDR for\nthe gene-based comparison approach. cn.MOPS can\napply to multiple samples at once for a better\nnormalization, which can improve its performance. It\nshows better performance in detecting CNV segments.\ncn.MOPS detects larger CNV regions, and is the fastest\ntool. ExomeCNV has higher sensitivity and moderate\nFDR. Its better sensitivity can be due to its additional\nstep to call CNV at individual exon before segmentation\nprocess. In general, ExomeCNV shows better overall\nperformance in comparison to the other tools. Its execu-\ntion time is comparable with other tools as well. In this\nstudy we did not use BAF data. Using BAF data can\nimprove its performance too. VarScan2 has higher sensi-\ntivity and better FDR for both amplification and deletion\nin the gene-based comparison analysis. Even though\nVarScan2 did not show the best performance, it shows\nFig. 3 Characteristics of the detected CNV regions by the 5 tools. a Size distributions of CNV segments. b Number of detected CNV segments\nFig. 2 Venn diagrams of the average of the number of truly detected CNV genes from the 5 tools, ( a) amplified genes, ( b) deleted genes\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 9 of 13\nstable overall performance and ease of use with a\ncomparable execution time.\nSimulated data\nThe advantages of using simulated data are that: 1) we\nhave a known list of benchmark CNVs that can be used\nas a gold standard for calculating accurate sensitivities\nand FDRs, and 2) we can investigate the effect of cover-\nage on the detection power of the tools. Since the price\nof sequencing directly depends on the coverage of the\ndata (or number of reads), knowing the minimum cover-\nage of data needed for accurate CNV detection is\nimportant. It is useful to notice that even though simu-\nlated data harbor sequencing noise and biases, tumor\nrelated distortions have not simulated in the synthesized\ndata. As a result, CNV detection tools show superior per-\nformance on synthesized data compared to real tumor\ndata. We generated 7 sets of 10 simulated paired-end\nWES data for chromosome one. Each set has different\nnumbers of 100 bp reads of 3 M, 2 M, 1 M, 0.5 M, 0.1 M,\n0.05 M, 0.01 M. Thresholds of ±0.5 were used to call\nCNV genes and segments for simulated data.\nGene-based approach\nFigure 5a and b show sensitivity (TPR) verses 1- specifi-\ncity (FPR) of the tools in calling amplified and deleted\ngenes respectively, when changing the number of reads\nin chromosome 1 from 0.01 M to 3 M. In calling ampli-\nfied genes, CONTRA was found to outperform other\ntools with the highest sensitivity rate especially for lower\ncoverage values. Its base-level log2 ratio approach gives\nit the advantage of working well for low coverage data.\nIn calling deleted CNV genes, the five tools showed\ncomparable performance in terms of sensitivity and\nFDR. As expected, we can see that the detection power\nof the tools decreased with lowering the coverage\n(Fig. 5a and b). We also noticed that the performance\nof the tools is not improving significantly by increas-\ning the number of read more than about 0.5 M for\nchromosome 1 (almost the coverage of 10X for the\nexonic regions).\nSegment-based approach\nSegment-based analysis of the performance of the tools\nusing the simulated data showed that VarScan2 and\ncn.MOPS have the highest sensitivity for detecting ampli-\nfied CNVs, and Varscan2 and ExomeCNV have the lowest\nFDR in detecting deleted CNVs, as shown in the\nAdditional file 1: Table S4. The five tools show almost the\nsame FDR for detecting amplified and deleted CNV seg-\nments. They have high sensitivities and low FDRs espe-\ncially for high coverage values. As expected, we observed\nthat the overall performances of the tools are better for\nhigher coverage values (Additional file 1: Table S4).\nIn addition, we analyzed False Negative, False Positive\nand True Positive CNV segments regarding their lengths.\nFig. 5 Sensitivity (TPR) versus 1- specificity (FPR) of the tools for different coverage values, using simulated data, for ( a) amplified genes, and ( b)\ndeleted genes. Since CONTRA could not generate the proper output for the coverage of 0.01 M, its results for coverage of 0.05 have not been shown\nFig. 4 Average execution times of the tools from 5 runs on a real\nbreast cancer dataset\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 10 of 13\nWe observed that in general FN and FP segments have\nsignificantly shorter lengths compared to TP segments\n(with p-value <0.05 using Wilcoxon test) for all of the\ntools. The boxplots of the lengths of FP , FN, and TP CNV\nsegments for all the tools and for amplification and dele-\ntion are given in Additional file 1: Figures S1 and S2). It\ncan be concluded that the power of all the tools in detect-\ning short CNVs is low and they detect many false short\nCNVs and miss many true ones. The length of a CNV\nsegments is indirectly related to the local coverage of the\nsegment. Therefore, mis-detection of short and low cover-\nage segments is one of the major reasons for poor\nperformance of the tools.\nConclusions\nIn this study, we surveyed CNV detection tools for WES\ndata in cancer. We focused on CNV detection for WES\ndata because WES is a more affordable and a more\npopular sequencing technique in translational research\ncompared to WGS. Despite the popularity and preva-\nlence of WES data, detecting CNV using WES data is\nchallenging. CNV detection using WES data requires\ndifferent approaches compared to the CNV detection\nusing WGS data due to different type of noise and biases\nand sparsity of exonic regions. Also, in this study we\nconcentrated our efforts on studying CNV detection\ntools that can apply to or designed for cancer. Cancer\ntumors harbor somatic aberrations and tumors are com-\nplex due to tumor ploidy, normal cells contamination\nand subclonal heterogeneity. As a result, studying CNVs\nin cancer requires different approaches compared to\nstudying germline CNVs or population CNVs.\nWe evaluated the performance of the five most recent\nand commonly used CNV detection tools (Table 1) for\ncancer WES data in terms of sensitivity, FDR and speci-\nficity of detecting CNV genes and CNV segments. For\nthe performance evaluation, we used real breast cancer\ndata as well as simulated data. The comparative analysis\nof the performance of the tools on real data shows that\nthe tools have moderate detection power (sensitivity)\nwhile show low precision (or poor FDR). The poor FDRs\nshow that the tools generate many false positives.\nThere are some important reasons for having low\nsensitivity and specificity of CNV detection tools. First\nreason is related to the inability of accurate detection of\nCNV breakpoints for WES date. Percentage of exons in\ngenome is about 1.1% to 1.4% and some of the real\nbreakpoints are outside of the captured target regions\n[55]. Second, all of these tools are based on the RD\napproach that uses the depth of coverage (read count)\ninformation for detecting CNV. This method has low\nresolution and power in detecting small CNVs due to\nlow values of read count data [42]. Third reason is the\nlack of appropriate preprocessing methods such as bias\nremoving, de-noising and normalization. It is assumed\nthat there is a shared bias between tumor and normal\nread count data, which can be removed by calculating\nthe ratio of tumor and normal coverage. But this\nassumption can lead to potential problems. The noise of\na local region is not considered in this assumption.\nTherefor in computing ratio values of depth of coverage\nbetween tumor and normal samples, noise is amplified.\nIt has been shown that CNV detection tools do not per-\nform well for low quality and noisy samples [56], which\nindicates a need for using more advanced preprocessing\nand detection (segmentation) methods.\nAlso, the characteristics of the detected CNV segments\n(size, number, orientation) are different across the tools\nthat show inconsistency in the segmentation of the CNV\nregions. In addition, the consensus CNVs across the\ntools is low which can be the result of the high FDRs as\nwell. Using synthesized data resulted in the better\nperformance of the tools because tumor complexity\n(ploidy, normal contamination, clonal heterogeneity) has\nnot been simulated on the synthesized data. That shows\nthe importance of considering tumor complexity in\nCNV detection in cancer.\nEven though tumor complexity play an important role\non the accurate detection of CNVs, there are only two\ntools, ADTEx and ExomeCNV, that partially address\ntumor complexity by employing BAF information – re-\ngarding tumor ploidy- in their CNV detection methods.\nHowever, tumor subclonal heterogeneity and tumor purity\nhave not been addressed by any tools. Incorporating extra\ninformation such as allelic frequency and a model of\ntumor purity can help to improve true detection of CNVs.\nUsing the simulated data, we also investigated the\neffect of coverage on the detection power of the tools.\nCoverage of sequencing, or the number of reads, is pro-\nportional to the cost of sequencing. High coverage is\nimportant to call somatic aberration, especially for som-\natic mutations, but it costs more as well. In this study,\nwe observed that the tools ’ performances do not\nimprove significantly by increasing the coverage more\nthan about 10X on exonic regions. Although, the tools\nuse different preprocessing methods, they used HMM\nand CBS for segmentation of CNV regions, which are\nadopted from CNV detection for microarray technolo-\ngies. New segmentation approaches that can effectively\nuse characteristics of WES data in cancer, such as tumor\ncomplexity and sparsity of exonic regions, need to be\ndeveloped. In addition, even though it is well known that\nread count data suffer from noise there is only one tool,\nADTEx, that uses a noise cancellation method- based on\nthe discrete wavelet transform technique - to reduce\nnoise before segmentation. Also, somatic CNV detection\nmethods typically utilize matched normal DNA as a\nmeans for identifying true somatic variations from\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 11 of 13\ngermline variations and reducing background sequen-\ncing biases. Developing appropriate and effective noise\ncancelation and normalization methods is required to\ndetect CNVs more accurately. Utilizing techniques from\nother fields such as statistical image/signal processing\ncan help to address these challenges.\nOne of the challenges we faced in this study was\nusability of the tools. One of the problems is the mis-\nmatch of the tools with the newer version of their\ndependencies. In addition, all of the CNV detection tools\nare command line based software tools without user-\nfriendly user interfaces. The lack of user-friendly user\ninterface makes the tools ’ utilization difficult for\nresearcher with limited expertise in computer systems.\nVisualization is also very important to study CNVs. Most\nof the tools offer commands for plotting CVNs with very\nlimited features. However, embedding advanced and\nuser-friendly visualization features to the CNV detection\nsoftware tool can be very useful.\nFinally, the lack of a CNV gold standard to accurately\nevaluate the performance of the tools is another chal-\nlenge in developing CNV detection tools. An effort on\ndeveloping a gold standard for CNV detection can\nsignificantly help CNV detection tool development.\nIn summary, the moderate sensitivities and poor FDRs\nof the current CNV detection tools for WES data in\ncancer indicate the need for developing more efficient\nand precise CNV detection methods. CNV detection\ntools with user-friendly user interfaces and visualization\nfeatures can extremely enhance CNV studies. Also, util-\nizing advanced novel segmentation, normalization and\nde-noising techniques that are designed specifically for\ncancer data is necessary.\nAdditional files\nAdditional file 1: Supplementary materials (Table S1-S4, Supplementary\nFigures). (PDF 351 kb)\nAdditional file 2: CNV results of ADTEx for the 10 real breast cancer\nsamples. (XLSX 572 kb)\nAdditional file 3: CNV results of CONTRA for the 10 real breast cancer\nsamples. (XLSX 21170 kb)\nAdditional file 4: CNV results of cn.MOPS for the 10 real breast cancer\nsamples. (XLSX 68 kb)\nAdditional file 5: CNV results of ExomeCNV for the 10 real breast cancer\nsamples. (XLSX 3535 kb)\nAdditional file 6: CNV results of VarScan2 for the 10 real breast cancer\nsamples. (XLSX 999 kb)\nAbbreviations\nCNV: Copy Number Variation; TCGA: The Cancer Genome Atlas; WES: Whole\nExome Sequencing; WGS: Whole genome Sequencing; FDR: False Discovery\nRate; BAF: B Allele Frequencies; SPC: Specificity; HMM: Hidden Markov Model;\nCBS: Circular Binary Segmentation; TP: True Positive; FN: False Negative;\nTN: True Negative; FP: False Positive; TPR: True Positive Rate; FPR: False\nPositive Rate\nAcknowledgments\nNot applicable.\nFunding\nThis study was supported by a grant from the National Institutes of Health\n(NIH, R00LM011595, PI: Nabavi).\nAvailability of data and materials\nAll data generated or analyzed are included in this published article\n(Additional files 1, 2, 3, 4, 5 and 6). The breast cancer CNV data that are used\nas benchmark are available at TCGA ’s data portal (https://portal.gdc.cancer.gov/\nprojects/TCGA-BRCA) The BAM files of the breast cancer data are protected\ndata and are available at The Cancer Genomics Hub (CGHub), https://\ncghub.ucsc.edu/index.html. The simulator for generating simulated WES\ndata is available at https://github.com/NabaviLab/VarSimLab.\nAuthors’ contributions\nSN, MD and FZ designed the study. FZ, MD, AH and NM implemented the\nanalysis; SN, FZ, MD, AH and NM interpreted the results. SN, FZ and MD\nwrote the manuscript. All authors read and approved the final version of the\nmanuscript.\nCompeting interests\nThe authors declare that they have no competing interests.\nConsent for publication\nNot applicable.\nEthics approval and consent to participate\nNo ethics approval was required for the study. Input data are publicly\navailable through The Cancer Genome Atlas (TCGA) and are simulated data.\nPublisher’sN o t e\nSpringer Nature remains neutral with regard to jurisdictional claims in\npublished maps and institutional affiliations.\nAuthor details\n1Computer Science and Engineering Department, University of Connecticut,\nStorrs, CT, USA. 2Biomedical Informatics Department, University of California\nSan Diego, San Diego, CA, USA. 3Computer Science and Engineering\nDepartment and Institute for Systems Genomics, University of Connecticut,\nStorrs, CT, USA.\nReceived: 14 November 2016 Accepted: 22 May 2017\nReferences\n1. Barnes MR. Genetic variation analysis for biomedical researchers: a primer.\nMethods Mol Biol Clifton NJ. 2010;628:1 –20.\n2. Stankiewicz P, Lupski JR. Structural Variation in the Human Genome and its\nRole in Disease. Annu Rev Med. 2010;61:437 –55.\n3. Wain LV, Armour JA, Tobin MD. Genomic copy number variation, human\nhealth, and disease. Lancet. 2009;374:340 –50.\n4. Stratton MR, Campbell PJ, Futreal PA. The cancer genome. Nature. 2009;458:\n719–24.\n5. Pankratz N, Dumitriu A, Hetrick KN, Sun M, Latourelle JC, Wilk JB, et al. Copy\nNumber Variation in Familial Parkinson Disease. Roberts RG, editor. PLoS\nOne. 2011;6:e20988.\n6. Jiang Q, Ho Y-Y, Hao L, Nichols Berrios C, Chakravarti A. Copy Number\nVariants in Candidate Genes Are Genetic Modifiers of Hirschsprung Disease.\nSchönbach C, editor. PLoS One. 2011;6:e21219.\n7. Grayson BL, Smith ME, Thomas JW, Wang L, Dexheimer P, Jeffrey J, et al.\nGenome-Wide Analysis of Copy Number Variation in Type 1 Diabetes. von\nHerrath MG, editor. PLoS One. 2010;5:e15393.\n8. Levy D, Ronemus M, Yamrom B, Lee Y, Leotta A, Kendall J, et al. Rare De\nNovo and Transmitted Copy-Number Variation in Autistic Spectrum\nDisorders. Neuron. 2011;70:886 –97.\n9. Sebat J, Lakshmi B, Malhotra D, Troge J, Lese-Martin C, Walsh T, et al. Strong\nAssociation of De Novo Copy Number Mutations with Autism. Science.\n2007;316:445–9.\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 12 of 13\n10. Pinto D, Pagnamenta AT, Klei L, Anney R, Merico D, Regan R, et al.\nFunctional impact of global rare copy number variation in autism spectrum\ndisorders. Nature. 2010;466:368 –72.\n11. Brouwers N, Van Cauwenberghe C, Engelborghs S, Lambert J-C, Bettens K,\nLe Bastard N, et al. Alzheimer risk associated with a copy number variation\nin the complement receptor 1 increasing C3b/C4b binding sites. Mol\nPsychiatry. 2012;17:223 –33.\n12. Kirov G. The role of copy number variation in schizophrenia. Expert Rev\nNeurother. 2010;10:25 –32.\n13. Shlien A, Malkin D. Copy number variations and cancer. Genome Med. 2009;1:62.\n14. Meyerson M, Gabriel S, Getz G. Advances in understanding cancer genomes\nthrough second-generation sequencing. Nat Rev Genet. 2010;11:685 –96.\n15. Speleman F, Kumps C, Buysse K, Poppe B, Menten B, De Preter K. Copy\nnumber alterations and copy number variation in cancer: close encounters\nof the bad kind. Cytogenet Genome Res. 2008;123:176 –82.\n16. Weir B, Zhao X, Meyerson M. Somatic alterations in the human cancer\ngenome. Cancer Cell. 2004;6:433 –8.\n17. Albertson DG, Collins C, McCormick F, Gray JW. Chromosome aberrations in\nsolid tumors. Nat Genet. 2003;34:369 –76.\n18. Kircher M, Kelso J. High-throughput DNA sequencing - concepts and\nlimitations. BioEssays. 2010;32:524 –36.\n19. Beroukhim R, Mermel CH, Porter D, Wei G, Raychaudhuri S, Donovan J, et al.\nThe landscape of somatic copy-number alteration across human cancers.\nNature. 2010;463:899 –905.\n20. Dancey JE, Bedard PL, Onetto N, Hudson TJ. The genetic basis for cancer\ntreatment decisions. Cell. 2012;148:409 –20.\n21. Carter NP. Methods and strategies for analyzing copy number variation\nusing DNA microarrays. Nat Genet. 2007;39:S16 –21.\n22. Metzker ML. Sequencing technologies — the next generation. Nat Rev\nGenet. 2010;11:31 –46.\n23. Ley TJ, Mardis ER, Ding L, Fulton B, McLellan MD, Chen K, et al. DNA\nsequencing of a cytogenetically normal acute myeloid leukaemia genome.\nNature. 2008;456:66 –72.\n24. Ku CS, Loy EY, Salim A, Pawitan Y, Chia KS. The discovery of human genetic\nvariations and their use as disease markers: past, present and future. J Hum\nGenet. 2010;55:403 –15.\n25. Amarasinghe KC, Li J, Hunter SM, Ryland GL, Cowin PA, Campbell IG, et al.\nInferring copy number and genotype in tumour exome data. BMC\nGenomics. 2014;15:732.\n26. Belkadi A, Bolze A, Itan Y, Cobat A, Vincent QB, Antipenko A, et al. Whole-\ngenome sequencing is more powerful than whole-exome sequencing for\ndetecting exome variants. Proc Natl Acad Sci U S A. 2015;112:5473 –8.\n27. Rabbani B, Tekin M, Mahdieh N. The promise of whole-exome sequencing\nin medical genetics. J Hum Genet. 2014;59:5 –15.\n28. Conrad DF, Pinto D, Redon R, Feuk L, Gokcumen O, Zhang Y, et al. Origins\nand functional impact of copy number variation in the human genome.\nNature. 2010;464:704 –12.\n29. Gonzaga-Jauregui C, Lupski JR, Gibbs RA. Human Genome Sequencing in\nHealth and Disease. Annu Rev Med. 2012;63:35 –61.\n30. Kidd JM, Cooper GM, Donahue WF, Hayden HS, Sampas N, Graves T, et al.\nMapping and sequencing of structural variation from eight human\ngenomes. Nature. 2008;453:56 –64.\n31. Zhao M, Wang Q, Wang Q, Jia P, Zhao Z. Computational tools for copy\nnumber variation (CNV) detection using next-generation sequencing data:\nfeatures and perspectives. BMC Bioinformatics. 2013;14(Suppl 11)\n32. Liu B, Morrison C, Johnson C, Trump D, Qin M, Conroy J, et al.\nComputational methods for detecting copy number variations in cancer\ngenome using next generation sequencing: principles and challenges.\nOncotarget [Internet]. 2013;4. Available from: http://www.impactjournals.\ncom/oncotarget/index.php?journal=oncotarget&page=article&op=\nview&path%5B%5D=1537\n33. Minoche AE, Dohm JC, Himmelbauer H. Evaluation of genomic high-\nthroughput sequencing data generated on Illumina HiSeq and genome\nanalyzer systems. Genome Biol. 2011;12:R112.\n34. Teo SM, Pawitan Y, Ku CS, Chia KS, Salim A. Statistical challenges associated\nwith detecting copy number variations with next-generation sequencing.\nBioinforma Oxf Engl. 2012;28:2711 –8.\n35. Treangen TJ, Salzberg SL. Repetitive DNA and next-generation sequencing:\ncomputational challenges and solutions. Nat Rev Genet. [Internet]. 2011\n[cited 2015 Jun 26]; Available from: http://www.nature.com/doifinder/10.\n1038/nrg3117\n36. Ulahannan D, Kovac MB, Mulholland PJ, Cazier J-B, Tomlinson I. Technical\nand implementation issues in using next-generation sequencing of cancers\nin clinical practice. Br J Cancer. 2013;109:827 –35.\n37. Sims D, Sudbery I, Ilott NE, Heger A, Ponting CP. Sequencing depth and\ncoverage: key considerations in genomic analyses. Nat Rev Genet. 2014;15:\n121–32.\n38. Carter SL, Cibulskis K, Helman E, McKenna A, Shen H, Zack T, et al. Absolute\nquantification of somatic DNA alterations in human cancer. Nat Biotechnol.\n2012;30:413–21.\n39. Oesper L, Satas G, Raphael BJ. Quantifying tumor heterogeneity in whole-\ngenome and whole-exome sequencing data. Bioinformatics. 2014;30:3532 –40.\n40. Rajagopalan H, Lengauer C. Aneuploidy and cancer. Nature. 2004;432:338 –41.\n41. Navin N, Kendall J, Troge J, Andrews P, Rodgers L, McIndoo J, et al. Tumour\nevolution inferred by single-cell sequencing. Nature. 2011;472:90 –4.\n42. Tan R, Wang Y, Kleinstein SE, Liu Y, Zhu X, Guo H, et al. An Evaluation of\nCopy Number Variation Detection Tools from Whole-Exome Sequencing\nData. Hum Mutat. 2014;35:899 –907.\n43. Li J, Lupat R, Amarasinghe KC, Thompson ER, Doyle MA, Ryland GL, et al.\nCONTRA: copy number analysis for targeted resequencing. Bioinformatics.\n2012;28:1307–13.\n44. Klambauer G, Schwarzbauer K, Mayr A, Clevert D-A, Mitterecker A,\nBodenhofer U, et al. cn.MOPS: mixture of Poissons for discovering copy\nnumber variations in next-generation sequencing data with a low false\ndiscovery rate. Nucleic Acids Res 2012;40:e69.\n45. Sathirapongsasuti JF, Lee H, Horst BAJ, Brunner G, Cochran AJ, Binder S, et\nal. Exome sequencing-based copy-number variation and loss of\nheterozygosity detection: ExomeCNV. Bioinformatics. 2011;27:2648 –54.\n46. Koboldt DC, Zhang Q, Larson DE, Shen D, McLellan MD, Lin L, et al. VarScan\n2: Somatic mutation and copy number alteration discovery in cancer by\nexome sequencing. Genome Res. 2012;22:568 –76.\n47. Amarasinghe KC, Li J, Halgamuge SK. CoNVEX: copy number variation\nestimation in exome sequencing data using HMM. BMC Bioinformatics.\n2013;14:S2.\n48. Backenroth D, Homsy J, Murillo LR, Glessner J, Lin E, Brueckner M, et al.\nCANOES: detecting rare copy number variants from whole exome\nsequencing data. Nucleic Acids Res 2014;42:e97.\n49. Plagnol V, Curtis J, Epstein M, Mok KY, Stebbings E, Grigoriadou S, et al. A\nrobust model for read count data in exome sequencing experiments and\nimplications for copy number variant calling. Bioinformatics. 2012;28:2747 –54.\n50. Bellos E, Kumar V, Lin C, Maggi J, Phua ZY, Cheng C-Y, et al. cnvCapSeq:\ndetecting copy number variation in long-range targeted resequencing data.\nNucleic Acids Res. 2014;42:e158.\n51. NabaviLab/VarSimLab [Internet]. GitHub. [cited 2016 Oct 26] Available from:\nhttps://github.com/NabaviLab/VarSimLab\n52. Lawrence M, Huber W, Pagès H, Aboyoun P, Carlson M, Gentleman R, et al.\nSoftware for Computing and Annotating Genomic Ranges. PLoS Comput\nBiol. 2013;9:e1003118.\n53. Breast cancer - Related Gene(s) [Internet]. Genet. Home Ref. 2015 [cited\n2015 Jul 7]. Available from: http://ghr.nlm.nih.gov/condition/breast-cancer/\nshow/Related+Gene%28s%29\n54. breast cancer related genes - GeneCards Search Results [Internet]. [cited\n2015 Jul 7]. Available from: http://www.genecards.org/index.php?path=/\nSearch/keyword/breast%20cancer\n55. Sakharkar MK, Chow VTK, Kangueane P. Distributions of exons and introns\nin the human genome. In Silico Biol. 2004;4:387 –93.\n56. Wang C, Evans JM, Bhagwate AV, Prodduturi N, Sarangi V, Middha M, et al.\nPatternCNV: a versatile tool for detecting copy number changes from\nexome sequencing data. Bioinformatics. 2014;30:2678 –80.\nZare et al. BMC Bioinformatics  (2017) 18:286 Page 13 of 13",
  "topic": "Copy-number variation",
  "concepts": [
    {
      "name": "Copy-number variation",
      "score": 0.7051979303359985
    },
    {
      "name": "DNA microarray",
      "score": 0.6518519520759583
    },
    {
      "name": "Exome sequencing",
      "score": 0.6253089308738708
    },
    {
      "name": "Computational biology",
      "score": 0.5921878814697266
    },
    {
      "name": "Exome",
      "score": 0.5185918807983398
    },
    {
      "name": "Biology",
      "score": 0.4916020333766937
    },
    {
      "name": "Genetics",
      "score": 0.45267558097839355
    },
    {
      "name": "Bioinformatics",
      "score": 0.321738600730896
    },
    {
      "name": "Mutation",
      "score": 0.22909364104270935
    },
    {
      "name": "Gene",
      "score": 0.2219265103340149
    },
    {
      "name": "Genome",
      "score": 0.19263988733291626
    },
    {
      "name": "Gene expression",
      "score": 0.0745275616645813
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I140172145",
      "name": "University of Connecticut",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I36258959",
      "name": "University of California, San Diego",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I3148997608",
      "name": "Institute for Systems Biology",
      "country": "US"
    }
  ]
}