{
    "title": "Comparative analysis of MAB dc-dc converters configurations in modular smart transformer",
    "url": "https://openalex.org/W2736082501",
    "year": 2017,
    "authors": [
        {
            "id": "https://openalex.org/A5078834086",
            "name": "Levy F. Costa",
            "affiliations": [
                "Christian-Albrechts-Universität zu Kiel"
            ]
        },
        {
            "id": "https://openalex.org/A5101563700",
            "name": "Felix Hoffmann",
            "affiliations": [
                "Christian-Albrechts-Universität zu Kiel"
            ]
        },
        {
            "id": "https://openalex.org/A5023412621",
            "name": "Giampaolo Buticchi",
            "affiliations": [
                "Christian-Albrechts-Universität zu Kiel"
            ]
        },
        {
            "id": "https://openalex.org/A5053880143",
            "name": "Marco Liserre",
            "affiliations": [
                "Christian-Albrechts-Universität zu Kiel"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2057175642",
        "https://openalex.org/W2616109410",
        "https://openalex.org/W1520271849",
        "https://openalex.org/W2150705456",
        "https://openalex.org/W2060472803",
        "https://openalex.org/W2158663644",
        "https://openalex.org/W2173928183",
        "https://openalex.org/W6730217688",
        "https://openalex.org/W2130353148",
        "https://openalex.org/W2525013347",
        "https://openalex.org/W2442002586",
        "https://openalex.org/W2406956442",
        "https://openalex.org/W4248371296",
        "https://openalex.org/W2557373001"
    ],
    "abstract": "In this work, the quadruple active bridge dc-dc converter (QAB) is proposed to be used as a building block to implement the dc-dc stage of a Smart Transformer. Different configuration for this converter are possible and all of them are considered for investigation. Thus, four different architectures of ST, including one based on the Dual Active Bridge (DAB) converter, are presented and compared in terms of cost, efficiency, reliability and implementation complexity. As an additional contribution, different semiconductors technology (silicon IGBT and silicon carbide MOSFETs) are evaluated in order to verify their impact on ST application. The design for each architecture is described and the results are compared. In order to validate the theoretical analysis developed in the paper, a 20 kW prototype was built and experimented.",
    "full_text": "  \n                                                                                         \n \n \n \n© 2016 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for \nall other uses, in any current or future media, including reprinting/republishing this material for \nadvertising or promotional purposes, creating new collective works, for resale or redistribution to \nservers or lists, or reuse of any copyrighted component of this work in other works.  \n \nDigital Object Identifier (DOI): 10.1109/PEDG.2017.7972558\n \n \n \nInternational Symposium on Power Electronics for Distributed Generation Systems\n  \nComparative analysis of MAB dc-dc converters configurations in modular smart transformer \n \nLevy Ferreira Costa \nFelix Horffmann \nGiampaolo Buticchi \nMarco Liserre \n \nSuggested Citation \nL. F. Costa, F. Hoffmann, G. Buticchi and M. Liserre, \"Comparative analysis of MAB dc-dc converters \nconfigurations in modular smart transformer,\" 2017 IEEE 8th International Symposium on Power \nElectronics for Distributed Generation Systems (PEDG), Florianopolis, 2017, pp. 1-8.  \nComparative Analysis of MAB DC-DC Converters\nConﬁgurations in Modular Smart Transformer\nLevy F . Costa, Felix Hoffmann, Giampaolo Buticchi and Marco Liserre\nChristian-Albrecht-University of Kiel (Uni-Kiel) / Power Electronics Chair (PE)\nKaiserstr. 2, 24143, Kiel, SH, Germany\nEmail: {lfc, hfo, gibu, ml }@tf.uni-kiel.de\nAbstract—In this work, the quadruple active bridge dc-dc\nconverter (QAB) is proposed to be used as a building block\nto implement the dc-dc stage of a Smart T ransformer . Different\nconﬁguration for this converter are possible and all of them are\nconsidered for investigation. Thus, four different architectures\nof ST , including one based on the Dual Active Bridge (DAB)\nconverter , are presented and compared in terms of cost, efﬁciency,\nreliability and implementation complexity . As an additional\ncontribution, different semiconductors technology (silicon IGBT\nand silicon carbide MOSFETs) are evaluated in order to verify\ntheir impact on ST application. The design for each architecture\nis described and the results are compared. In order to validate\nthe theoretical analysis developed in the paper , a 20 kW prototype\nwas built and experimented.\nI. I N T RO D U C T I O N\nThe high penetration of distributed generation and the\nintegration to the grid of new loads (e.g. electric vehicles) has\nchanged the distribution electric system and new challenges\nhas emerged. Among them, the reverse power ﬂow require-\nment, storage integration, management of hybrid grids (dc\nand ac) and power quality improvement are highlighted [1]–\n[4]. Smart Transformer (ST), a power electronics-based system\nwith advanced control and communication functionalities, is a\npromising solution for the aforementioned problems.\nOne of the biggest challenge of this system lays on the\nimplementation of the dc-dc stage, responsible to connect the\nmedium voltage (MV) to the low voltage (L V) dc sides with\nmedium/high frequency (MF/HF) galvanic isolation. Hence,\nthis stage has requirements, such as: high voltage capability\nin the MV side, high current in the L V side, high volt-\nage isolation, power ﬂow control and overload and short-\ncircuit protection (working as a dc breaker to protect possible\nload/source/microgrid connected to the L V dc-link) [1]–[5].\nT o meet all of them, the modular architecture bring several\nadvantages, like fault tolerant capability by using redundant\nmodules concept, scalability in power and voltage, reduced\ndv/dt and di/dt (low EMI emission and isolator stress on\nthe HF transformer) and the possibility to use standard low\nvoltage/current rating devices. For these reasons, modular\narchitectures are preferable for ST applications.\nBased on this approach, several dc-dc converters have been\ninvestigated to be used as a building-block of the dc-dc stage,\nbut the Dual-Active-Bridge (DAB) have received more atten-\ntion, due to its advantages of soft-switching, high efﬁciency\nFigure 1. Modular smart transformer architecture using the dual active bridge\nconverter as a building block of the dc-dc stage.\nand high power density [3]–[5]. Fig. 1 depicts the modular\nST using the DAB converter as a basic cell of the dc-dc\nstage. This converter, that is composed by two active bridges\nconnected to a high frequency transformer, was generalized in\n[6]–[9], where more bridges were connected to a multiwinding\ntransformer, leading to the concept of the multiple-active-\nbridge (MAB), as shown in Fig. 2 (a). The MAB converter\npresents a reduced number of transformers and modules, when\ncompared to the design based on DAB, while still preserv-\ning the same advantages. Consequently , the MAB converter\nbecame a attractive solution in ST application, as presented\nin [1], [2], [8], and this converter was deeply investigated\nin [8], where four active bridges, named Quadruple-Active-\nBridge (QAB), were employed.\nThe QAB converter has the degree of freedom to be con-\nnected symmetrically (two input and two output) or asymmet-\nrically (three input bridges and one output bridge), as shown\nin Fig. 2, but the particularities and advantages of each of\nthem have not yet been discussed on the literature. In this\ncontext, this work uses the QAB converter as a building block\nof the dc-dc stage of the modular ST , where the possible\nconﬁgurations are investigated. Therefore, the conﬁgurations978-1-5090-5339-1/17/$31.00 2017 IEEE.\nFigure 2. Multiple-Active-Bridge converter topology and its particular case of\nfour bridges (Quadruple-Active-Bridge, QAB): (a) MAB topology , (b) asym-\nmetrical conﬁguration of the QAB converter, (c) symmetrical conﬁguration\nof the QAB converter .\nare analyzed and compared in term of efﬁciency , cost, relia-\nbility and complexity , considering the ST speciﬁcations and\nrequirements. Furthermore, the classical solution based on\nthe DAB converter is included in the analysis, as a matter\nof comparison. The main goal of this work is to investigate\nthe feasibility of the QAB converter in ST application, with\nrespect to the standard solution (the QAB converter) and\nverify which conﬁguration offers more advantages to the\nsystem. As an additional contribution, Silicon (Si) IGBT and\nSilicon Carbide (SiC) MOSFETS are used on the QAB design\nand their performances are compared, in order to investigate\nthe potential of different semiconductors technology in ST\napplication.\nThe paper is divided as follow: in section II, the theoretical\nanalysis of the QAB converter is presented, where its equiva-\nlent model is shown and the main equations are derived. The\ndifferent conﬁguration of the QAB are analyzed and compared\nin section III, considering the ST scenario, while several design\naspect are discussed. In this section, the conﬁgurations are\ncompared and a discussion, showing the most promised one\nis presented. Finally , a 20 kW prototype of the QBA converter\nwas built and experimental results are provided in Section IV .\nII. O P E R AT I O N PR I N C I P L E O F T H E QAB C O N V E RT E R\nThe QAB is composed by four active bridges and for the\nanalysis, each of them is denoted by the letters a, b, c and d.\nThe elements of the bridges have sub-index i = {a,b,c,d} to\nindicate the bridge the element belongs to. T o analyze the\nconverter, an equivalent circuit based on the Y -model and\ndepicted in Fig. 4 (a) is used, in which the bridges are replaced\nby rectangular voltage sources ( va , vb , vc and vd ). The voltage\non the central point vx and the current slope of each inductor\nare given by (1) and (2), respectively , where k = {a,b,c,d}.\nT o modulate the converter, the Phase-Shift Modulation\n(PSM) strategy is employed. Using this modulation scheme,\nrectangular voltages va , vb , vc and vd with phase shift ϕ a ,\nϕ b , ϕ c and ϕ d , respectively , and constant switching frequency\nfs are applied to the transformer. The power is controlled\nby the phase difference among the bridges and it can be\ngenerally described in (3), where, i = a,b,c,d and k = a,b,c,d,\naccording to [9], [10]. The main waveform of the PSM is\nshown in Fig. 4 (b).\nThe PSM is characterized by ZVS turn-on, but this features\ndepends on the input and output voltages relation and also the\nload. As the input and output voltage are considered constant,\nFigure 4. Model of the QAB converter and main waveforms, using the PSM.\nFigure 5. Current and voltage waveforms on the L V side semiconductors\n(iS1a , vS1a , iS2a , vS2a ) and MV semiconductors ( iS1b , vS1b , iS2b , vS2b ) of the\nQAB converter.\nthe converter can be properly designed to work with ZVS\noperation for its entire range of operation. Consequently , this\nscheme offers several advantages for the converter operation.\nThe voltage and current waveforms on the semiconductors\nof the MV side bridge and L V bridge of the QAB converter are\ndepicted in Fig. 5. If properly design, the current and voltage\nwaveforms on the semiconductors will be same as depicted in\n5, regardless the conﬁguration of the QAB converter presented\nin Fig. 2 (b) and (c). T o calculated the current effort on the\nsemiconductors and transformer and consequently the losses,\nthe equations (3) and (4) are used, considering the current\nwaveforms presented in Fig. 5. As a results, the rms and avg\ncurrent in each semiconductors of the bridges connected to the\nL V and MV sides are calculated by (1) to (4).\niD(avg) = 1\nπ\n(\nAm\nφ 2\n4 + I0\nφ\n2\n)\n(1)\niD(rms) =\n√\n1\nπ\n( 1\n3 A2\nm\nφ\n2\n3\n+ Am\nφ\n2\n2\n+ I2\n0\nφ\n2\n)\n(2)\niS(avg) = Am\nπ\n( φ 2\n8\n)\n(3)\niS(rms) =\n\n\n\n√\n1\nπ\n(\n1\n3 A2\nm\n(\nφ − φ\n2\n3 )\n+ Am\n( φ\n2\n) 2\n+ I2\n0\nφ\n2 − I0\nφ\n2\n)\n(4)\nFigure 3. Smart transformer architecture based on different building blocks conﬁguration of the dc-dc converter: (a) DAB - Arch: DAB converter as the\nbuilding block, (b) AQAB - Arch: QAB converter in asymmetrical conﬁguration, (c) SQAB-V - Arch: QAB converter in symmetrical conﬁguration, preserving\nthe same voltage level of the asymmetrical conﬁguration, (d) SQAB-P - Arch: QAB converter in symmetrical conﬁguration, preserving the same power level\nof the asymmetrical conﬁguration.\nIII. S Y S T E M CO N FI G U R AT I O N A N D DE S I G N\nAs mentioned before, the main goal of this work is to\ninvestigate the potential of the QAB converter in ST ap-\nplication, besides to analyze its possible conﬁgurations and\ncompare them, considering the standard DAB as a basis of\ncomparison. Therefore, to implement the dc-dc stage of the\nST , four different architectures are investigated for in this\nwork and they are shown in Fig. 3. The ﬁrst one is a modular\narchitecture based on the standard DAB solution (see Fig. 3\n(a)), that will be used as a basis of comparison. The second\narchitecture depicted in Fig. 3 (b) is based on the QAB\nconverter conﬁgured asymmetrically . The third and fourth\ncases, shown in Fig. 3 (c) and (d), respectively , are based\non the symmetric conﬁguration of the QAB converter. The\nanalysis of the symmetrical conﬁguration was divided in two\ncases, with the purpose for making it wider: the ﬁrst one (Fig.\n3 (c)) uses more units, keeping the same voltage level over\nthe QAB cells (and over the semiconductors) in comparison\nwith the asymmetrical QAB architecture, whereas the second\ncase (Fig. 3 (c)) uses the same number of units with respect to\nthe asymmetrical QAB architecture, keeping the same power\nlevel for each unit.\nAs can be noticed, all theses architectures uses the Cascaded\nH-Bridge (CHB) topology as a front-end rectiﬁer, because it\noffers several advantages, as described in [1]. In addition, the\nCHB cells are considered part of the unit, for the repairability\npurposes. Regarding the number of units selection, three units\nare chosen for the asymmetric QAB architecture, resulting in\n9 CHB cells, and then 9 units are used in the DAB architecture\nT able I\nGR I D SP E C I FI C AT I O N\nRated Power MV AC L V AC Grid frequency L VDC\n1 MV A 10 kV 400 V 50 Hz 700 V\nT able II\nQAB S P E C I FI C AT I O N A N D DE S I G N CO N S I D E R AT I O N\nT otal MVDC link VMV DC = 10.2 kV\nL VDC link VL V DC = 700 V\nUnit Power Punit = PST /Nunit\nSwitching frequency fs = 20 kHz\nNominal PS angle ϕ nom = 35◦\nto keep the same CHB structure. This number provides a good\ntrade-of between the number of components and the usage of\nthe employed semiconductors (voltage and current rating).\nA. Design Consideration of the Units\nFor the comparative analysis, each of the architectures\npresented in Fig. 3 must be carefully design and the losses,\nefﬁciency and cost must be calculated. T o do so, a computer-\naided design approach was used, and the ﬂowchart of the\nimplement design algorithm is presented in Fig. 6. The ST\narchitectures are designed considering the grid speciﬁcation\npresented in T able I. The QAB converter is designed according\nto [9], [10]. For the design, it was considered a nominal phase\nshift angle of ϕ = 35◦ to reduce the reactive power processed\nby the converter, but still keeping the power controllability .\nFurther design considerations for the QAB converter design\nare summarized in T able II.\nFigure 6. Simpliﬁed ﬂowchart of the algorithm used to design the power\nunits of the ST architectures.\nB. Semiconductor Selection and Losses Analysis\nConsidering the voltage and power level of the converter,\nSilicon IGBT module are often used. On the other hand, the\nnew technology of Silicon-Carbide MOSFETs has emerged as\na high performance and economically viable solution. These\ndevices have been used to implement the power converters of\nthe ST architecture in [11], [12]. However, the potentialities\nof such semiconductors is still an open question in power\nelectronic ﬁeld. For these reasons, both aforementioned semi-\nconductors technologies (Si IGBT and SiC MOSFETs) are\ntaken into account on the design of the power converters,\npresented in Fig. 6.\nFor the semiconductor selection, devices from the biggest\nmarket players on IGBT modules sector and SiC MOSFETs\nsector were considered and they are: P owerex P ower Semicon-\nductors/Mitsubishi Electric and W olfspeed/CREE [13], [14].\nSeveral different devices from both manufactures were con-\nsidered on the converter’s design and they are listed in T able\nIII.\nT o estimate the efﬁciency of each architecture, the losses\nin each component must be calculated. The conduction losses\nof the SiC MOSFETs are calculated by (5), where the on-\nresistance ( Rds(on)) is function of the drain-source current ( idc ),\njunction temperature ( TJ ) and gate voltage ( Vgs ). Assuming a\nconstant junction temperature of 100 ◦C and a constant gate\nvoltage of 15 V , the equation is simpliﬁed to (6). Similarly ,\nthe losses on the IGBT are calculated by (5), in which can be\nsimpliﬁes by (8). Therefore, applying (5) in (6) and (8), the\nlosses on the MV side semiconductors are obtained for the\nSiC MOSFETs and IGBT cases, respectively . Similarly , the\nlosses on the L V side semiconductors are obtained replacing\nthe equation (6) in (6) and (8). For the HF transformer, only\nthe wire losses are considered and they are calculated using\n(6) and (9).\nT able III\nSP E C I FI C AT I O N O F T H E S E M I C O N D U C TO R S C O N S I D E R E D I N T H E D E S I G N\nSi-IGBT Power Modules\nReference V I VCE (on) r(on)(25 C)\nCM50DU-24F 50 A 1.25 V 10.71mΩ\nCM75DU-24F 75 A 1.2 V 8mΩ\nCM100DY -24A 1.2 kV 100 A 1.2 V 5mΩ\nCM150DX-24S 150 A 1.2 V 3.5mΩ\nCM200DX-24S 200 A 1 V 3.3mΩ\nCM300DX-24S1 300 A 1 V 3.1mΩ\nCM75DY -34A 1.7 kV 200 A 1.2 V 18mΩ\nQID331006 3.3 kV 100 A 1 V 32mΩ\nQIC6508001 6.5 kV 50 A 2 V 40mΩ\nSiC MOSFETs\nReference V I V(Diode) Rds(on)\nC2M0040120D 1.2 kV 60 A 3.1V 40mΩ\nC2M0025120D 90 A 3.1V 25mΩ\nC2M0045170D 1.7 kV 72 A 3.6V 45mΩ\nCree Preliminary 3.3 kV 3.3 kV 45 A 3.1V 40mΩ\nPmos f et (cond) = 1\nT\n∫ T\n0\nRds(on) (ids (t ),TJ ,Vgs ) · ids 2 (t )dt (5)\nPmos f et (cond) = Rds(on) · I2\nS1 (rms) (6)\nPIGBT (cond) = 1\nT\n∫ T\n0\nVCE (iC (t ),TJ ,Vgat e)·iC (t )dt (7)\nPIGBT (cond) = VF ·VCE (avg) + RF · I2\nC(rms) (8)\nPT r(wire) = Rwire · (IT r(rms))2 (9)\nC. Further Considerations\nFor the economic comparison of the different architectures,\nthe cost of the main components are considered. In that case,\nonly the cost of the semiconductors and also an simpliﬁed\ncost of the transformer is considered. For the IGBT , the cost\nare obtained directly with the manufacturer [15], while for the\nSiC case, the cost were obtained from the distributor (Mouser\nElectronics). T o compute the cost of the MFT , only the amount\nof cooper of the wires used to implement the transformer is\nconsidered to simplify the analysis. The required amount of\ncooper used on the winding is proportional to the rms current\nof each winding. Thus, the cost will be proportional to the\ncurrent effort in each winding of the transformer. The auxiliary\ncomponents, like gate driver unit (GDU), auxiliary power\nsupply (APS) and control and communication system (CCS),\nfor each cell, are also considered on the cost and reliability\nanalysis. It is assumed that the same components can be used\nfor each cell of the DAB and QAB converters, regardless the\nvoltage and current rating the of semiconductors employed.\nConsequently , the cost of the individual components is the\nsame, regardless the architecture that they are employed, and\nonly the quantity is different, according to the architecture.\nAdditionally , those components are also considered for the\nreliability analysis.\nIV . C O M PA R AT I V E EV A L UAT I O N\nThe results from the previous described design are presented\nin T able IV and in Figs. 7, for each architecture . As can\nbe seen, they are divided in two cases, according to the\nemployed semiconductors technology . The ﬁrst case uses Si-\nIGBT , whereas the second SiC-MOSFETs, and each case is\ndiscussed as follow .\nThe DAB - Arch has more power unit, but the power level\nof each unit is the lowest, compared to the others architectures.\nAnalyzing the parameters of the MV side, the current effort\non the semiconductor are the same for all architectures,\nindependently from the voltage and power level. Hence, the\ncurrent rating of the employed semiconductor is also the same.\nWith respect to the voltage level of the semiconductors, only\nthe SQAB-P - Arch needs to use 3.3 kV devices, while the\nothers require 1.7 kV . Then, DAB - Arch, 2 and 3 uses the\nsame devices on the MV side. In spite of the availability\nof 3.3 kV IGBT on the market, there is no SiC-MOSFET\navailable yet with this voltage rating. According to [13], [14],\nthe 3.3 kV SiC-MOSFET was already developed and it is\nunder test process to be launch on the market in the next years.\nPrevious information for such device were provided in [13],\n[14], as well as a price estimation. Thus, these information\nwere used in this investigation, to calculated the losses and\ncost of SQAB-P - Arch.\nAnalyzing the L V side, the AQAB - Arch has less cells\nconnected in this side, demanding then higher current rating\ndevices, in respect to the others architectures. As can be\nobserved in T able IV, AQAB - Arch requires devices rated\nfor 200 A and such devices are not available for the SiC-\nMOSFETs considered in this study (see T able III). Thus two\ndevices C2M0025120D (1.2 kV / 90 A) were used in parallel,\nin which is a usual practice. Regarding the voltage level, 1.2\nkV devices were used for this side in all architectures, because\nthe L V cells are in parallel in this side.\nA. Losses and Cost Comparison\nThe cost and efﬁciency are the most important parameters\nevaluated in this work and they are compared follow .\nFrom the losses analysis presented in Fig. 7, it can be\nseen that the AQAB - Arch presents the best performance,\nwhile SQAB-V - Arch the worst, regardless the employed\nsemiconductors. The fewer number of components associated\nto the high performance of this selected IGBT and MOSFETs\non the L V side of AQAB - Arch played an important role to\nprovide the best performance. The DAB - Arch, used as basis\nof comparison, has presented the second better performance,\nbut only slightly better compared to the SQAB-P - Arch.\nAs an overall analysis, it can be noticed that the losses\nfor all architecture are very similar to each other, with a\ndifference of only 10% between the best one and the worst\none. Note that this design concerns the speciﬁcations provided\nin T able I. Different grid speciﬁcation might imply in different\nresults. Still from this results, the application of SiC MOSFETs\nhas improved the performance in terms of efﬁciency of the\narchitectures 1,2 and 4, but deteriorate the efﬁciency of SQAB-\nV - Arch. Due to high number of employed modules in this\nlast architectures, the current in the L V side bridges are very\nreduced, allowing the use of lower current rating devices,\ncompared to the others. As a result from the design, the SiC\nMOSFETs C2M0040120D (1200V / 60 A) was selected for\nthe SQAB-V - Arch, while the device C2M0025120D (1200V\n/ 90 A) was selected for the others architectures, providing\nlower on resistance and better performance. Of course, the\ndevice C2M0025120D can also be used in SQAB-V - Arch,\nimproving its performance, but also increasing its cost.\nT able IV\nCO M PA R AT I V E ANA LY S I S O F T H E AR C H I T E C T U R E S\nBasic Information (per Phase)\nDAB - Arch AQAB - Arch SQAB-V - Arch SQAB-P - Arch\nNumber of Units per Phase 9 3 5 3\nPower Level of the Unit 37.04 kW 111.11 kW 66.66 kW 111.11 kW\nMVDC link 1.13 kV 1.13 kV 1.02 kV 1.7 kW\nSemiconductor V oltage Rating (MV side) 1.7 kV 1.7 kV 1.7 kV 3.3 kV\nT otal N ◦ of semiconductors (MV side) 36 36 60 36\nT otal N ◦ of semiconductors (L V Side) 36 12 20 12\nSelected Semiconductor\nSi-IGBT (MV side) CM75DY -34A CM75DY -34A CM75DY -34A QID3310006\nSi-IGBT (L V side) CM75DU-24F CM200DX-24S CM75DU-24F CM75DU-24F\nSiC-MOSFET (MV side) C2M0045170D C2M0045170D C2M0045170D Cree Preliminary 3.3 kV\nSiC-MOSFET (L V side) C2M0040120D C2M0025120D C2M0040120D C2M0025120D\nMedium-Frequency Transformer\nN◦ of MFT 9 3 5 3\nEquivalent inductance 27.3 µ 187.96 µH 54.56 µH 34.54 µH\nIsolation requirement (Prim. to Prim.) 1.7 kV 1.7 kV 1.7 kV 3.3 kV\nIsolation requirement (Prim. to Sec.) 10 kV 10 kV 10 kV 10 kV\nIsolation requirement (Sec. to Sec.) 700 V 700 V 700 V 700 V\nAuxiliary Components\nAuxiliary Power Supply 18 12 20 12\nGate Driver Unit 36 24 40 24\nControl and comm system 36 24 40 24\n12241224\n616616\n16751703\n253258\n2242\n76\n719\n1296 980\n431\n2708\n127\n616616\n253258 76\n719\n431\n127\n25352802 2535\n2434\n1 101 10 1217 649\n29602960\n15801695\n3289 3888\n1580\n2160\n2160\n860\n943\n2400\n1606\n6468\n1 183 1287\nFigure 7. Comparative results for the investigated ST architectures, considering the Si-IGBT and SiC-MOSFETs devices: (a) losses comparison, (b) cost\ncomparison.\nRegarding the cost analysis, the AQAB - Arch has also\npresented the best results, regardless the semiconductor. How-\never, when SiC-MOSFETs are employed, DAB - Arch, 2 and\n3 presented similar costs with a small difference of 1%. Only\nSQAB-P - Arch has presented a signiﬁcant high cost compared\nto the other, because of the prices of the higher voltage devices\nrequired on the MV side of this architecture.\nA more detail discussion about the QAB conﬁgurations,\nsemiconductor technologies and the feasibility to use QAB\nin comparison to DAB in ST are presented as follow .\nB. QAB Conﬁgurations\nAs can be notices from the results, the AQAB - Arch\nthat uses the asymmetric conﬁguration of the QAB converter\nis more advantageous in terms of efﬁciency and cost. The\nmain reason for that is the fewer number of cells and MFT ,\ncompared to SQAB-V - Arch, associate to the fact that lower\nvoltage rating devices are required in the MV side, compared\nto SQAB-P - Arch.\nAlthough higher current rating devices are required to\nimplemented the L V cell of the AQAB - Arch (see T able\nIV), the individual device cost does not differ much from the\ncost of the devices required by the others solutions, bringing\neconomic advantages to this solution.\nAs SQAB-P - Arch requires semiconductors with voltage\nrating of 3.3 kV on the MV side, only IGBT can be used to\nimplement currently . Besides, the price of this device is very\nhigh, increasing drastically the cost of the system. For that\nreason, SQAB-P - Arch is the most costly solution, reaching\nalmost twice the cost of the AQAB - Arch.\nC. Si-IGBT vs. SiC-MOSFETs Comparison\nAs expected, the performance of all architecture are im-\nproved in terms power dissipation, when SiC MOSFETs\nare used, demonstrating the high performance of such semi-\nconductor technology . On the other hand, its price is still very\nhigh, when compared to the classic Si-IGBT solution. Using\nthe results obtained from the AQAB - Arch, i.e. the most\npromised one, the SiC-MOSFETs offers around 10% of losses\nreduction, but the system cost increases in almost 40%. Then,\nthe energy saving throughout the system operation needs to be\neconomically evaluated according to the application, to verify\nif the additional installation investment when SiC-MOSFET\nare used is economically viable.\nD. Further Comparison\nAnother point that should be taken into account is the\nreliability and availability of the system. On one hand, the\nclassical reliability approach based on the constant failure rate\nconcept suggests that the reliability is inversely proportional\nto the number of components, because each component is a\npotential failure source. On the other hand, the reliability-\noriented approach described in [16] suggests that each com-\nponent has a speciﬁc failure rate, according to its application\nand operation condition, e.g. operation temperature, humidity ,\netc. Although the research in this last approach has advanced\nconsiderably , a very advanced study for each condition is\nrequired and the failure rate of the auxiliary components (e.g.\nGDU, APS) is still difﬁcult to compute. Hence, as a matter a\nsimplicity , the classical approach is used in this comparison,\nwhere only the number of components, including the auxiliary ,\nis considered.\nAQAB - Arch and 4 have less cell in total, 12 cells against\n18 and 20 of the DAB - Arch and 3, respectively . It implies in\nless power devices and auxiliary components, contributing to\nthe reliability improvement. Then, these architecture are more\nadvantageous from the reliability viewpoint.\nThe system can also be compared in terms of complexity\nand possibility to implement redundancy . Regarding the com-\nplexity , discussion regarding the control the QAB indicates\nhigher complexity , when compared the DAB control, mainly\nbecause of balanced power issues. The multiwinding trans-\nformer is also more complex to be designed in respect to the\nclassic two winding transformer. In this aspect, the DAB -\nArch, based on DAB solution, might be more advantageous.\nOn the other hand, such complexity can be overcome by\nincreasing the research and development in these topics. The\nDAB is also very advantageous in terms of the redundancy\nscheme implementation, because the unit is more simple to be\nFigure 8. Qualitative comparison of the standard solution based on DAB\nconverter with the proposed QAB solution, considering the most promised\nconﬁguration (asymmetric conﬁguration): (a) Si-IGBT , (b) SiC-MOSFETs.\nimplement. Then, an additional unit be used with less impact\non the system cost.\nA qualitative comparison of all architectures is presented in\nFig. 8, when Si-IGBT and SiC-MOSFETs are used. Although\nDAB might be more advantageous in terms of complexity\nand possibility do implement redundancy scheme, the QAB\nconverter is presented as a most promised in term of efﬁciency ,\nreliability and cost. Then, these results demonstrate the high\npotential of the QAB converter in ST application.\nE. QAB vs. DAB\nT o evaluate the potential of the QAB converter in ST appli-\ncation, the best conﬁguration (AQAB - Arch) is individually\ncompared to the standard solution based on DAB (DAB -\nArch). Due to the fewer number of components (Cells and\nMFT), the QAB solution is more advantageous economically ,\nas presented in Fig. 7 (b). Adopting this solution instead of\nDAB, and considering the speciﬁcation of the T able I, the\nsystem cost can be reduced in around 20%, when Si-IGBT\nare employed.\nRegarding the efﬁciency , the QAB solution presented simi-\nlar performance with the DAB, although the ﬁrst one performs\nslightly better. As the QAB operates similarly to the DAB\nconverter, when processing balanced power, then similar power\nlosses dissipation is also expected. Of course, semiconductor\nwith different electric characteristic are used in the L V cells for\nboth cases, and also the quantity of semiconductors, resulting\nin this power dissipation difference between the solutions.\nIt is important to point-out that the DAB converter might\nbe more advantageous for the implementation simplicity view-\npoint. Since it is a classic solution and it has been inten-\nsively investigated for a while, its control system and design\nprocedure is already well-known. Nevertheless, the MAB\nconverter topology has been more often investigated recently\n[8], [9]. Then, QAB converter is presented as an economically\nviable solution and its potential in ST application has been\ndemonstrated from the results obtained in this work.\nV . E X P E R I M E N TA L RE S U LT S\nIn order to evaluate experimentally the operation and per-\nformance of the QAB converter in ST , a downscaled prototype\nhas been developed and tested. As the asymmetric conﬁgura-\ntion of the QAB was presented as the most advantageous one\nfrom the theoretical studies, it was chosen to be implemented\nand experimentally investigated. Fig. 9 (a) shows the picture of\nthe implement prototype, while the speciﬁcation is presented in\nT able V . In this picture, the cells of the CHB associated to the\nQAB converter is observed, sharing the same cooling system.\nFor the implementation, the SiC MOSFETs C2M0025120D\nFigure 9. Experimental results of the implemented ST prototype: (a) picture of the implemented unit, (b) asymmetric conﬁguration used in the implementation,\n(c) main waveforms of the MV stage, (d) inductor current waveforms on the L V side ( iLa ) and MV side ( iLb , iLc and iLd ) of the QAB converter, (e) main\nvoltage and current waveforms on the L V side ( vLa , iLa ) and MV side of the QAB ( vLb , iLb ) converter.\n(1200 V / 25 mΩ ) and C2M0040120D (1200 V / 40 mΩ ) from\nCREE were used on the MV side and L V side, respectively .\nFor the previous demonstration, the experiments are run\nwith an input voltage of 230 V/50 Hz (available grid voltage)\nand a power level of 2 kW and the results are depicted in Fig.\n9 (c). However, to demonstrate the operation and potential of\nthe QAB converter, it was tested individually with power level\nof 10 kW , as presented in Fig. 9 (e).\nIn Fig. 9 (a), the main waveforms of the front-end MV\nstage is presented, where the input voltage before and after the\nac ﬁlter ( VMV A C) and the input current ( iMV A C) are observed.\nFrom this results, a high power factor operation of the system\nis observed. Fig. 9 (d) shows the main waveforms of the\ndc-dc stage, where the currents on the L V cell ( iLa ) and\nMV cells ( iLb , iLc , iLd ) are presented. From these results, the\nbalanced operation of the QAB converter is noticed, where\neach MV cell process the same amount of power. Furthermore,\nsoft-switching operation is also observed from the current\nwaveforms. Similarly , Fig. 9 (c) shows voltage and current\non the ac side of the MV bridge ( vLb and iLb ) and also on\nthe L V bridge ( vLa and iLa ), where the phase-shift operation\nof these bridges is observed.\nFinally , the efﬁciency of the QAB converter was measured\nexperimentally and a value of 97.5% was obtained.\nVI. C O N C L U S I O N\nIn this work, the multiple active bridge dc-dc converter\nusing four bridges (QAB) is proposed to be used as a building\nblock to implement the dc-dc stage of a Smart Transformer.\nFour different architectures of ST are presented and compared\nin terms of cost, efﬁciency , reliability and implementation\ncomplexity . One of this architectures are based on the standard\nDAB solution (used as a basis of comparison), while the others\nthree are based on the QAB converter with different conﬁgura-\ntion. The design for each architecture is described, as well as\nthe semiconductors employed. As an additional contribution,\ndifferent semiconductors technology (silicon IGBT and silicon\ncarbide MOSFETs) are evaluate in order to verify their impact\non ST application.\nAs a result of this analysis, the architecture based on QAB\nconverter conﬁgured asymmetrically (three bridge connected\nin the MV side and one on the L V side) has presented the\nbest performance in terms of efﬁciency and cost. Compared\nto the classic DAB solution, the architecture based on QAB\noffers a cost reduction of around 20%. The efﬁciency of both\nsolution are very similar, only a slightly improvement of 5%\nis obtained when the QAB is employed.\nRegarding the potential of SiC-MOSFETs in ST application,\nthis devices offers a losses reduction of around 10%, but is\nincrease the system cost in around 40%. Therefore, to verify\nthe economic feasibility of such devices in this application,\na study considering the energy saving over time and the\ninstallation cost should to be realized. Note that this design\nconcerns the speciﬁcations provided in T able I. Different grid\napplication might imply in different results cost and losses.\nFinally , experimental results were provided, in order to\nverify the performance of the ST architecture based on the\nQAB converter. Then, a 20 kW prototype of the ST based\non asymmetrical conﬁguration of the QAB converter was\ndeveloped and tested, providing an efﬁciency of around 97.5%.\nThen, this paper has demonstrated the high potential of the\nQAB converter as building block of the smart transformer.\nAC K N OW L E D G M E N T\nThe research leading to these results has received funding\nfrom the European Research Council under the European\nUnion’s Seventh Framework Programme (FP/2007-2013) /\nERC Grant Agreement n. [616344] - HEAR T .\nRE F E R E N C E S\n[1] M. Liserre, G. Buticchi, M. Andresen, G. D. Carne, L. F . Costa, and\nZ. X. Zou, “The smart transformer: Impact on the electric grid and\ntechnology challenges, ” IEEE Industrial Electronics Magazine , vol. 10,\nno. 2, pp. 46–58, Summer 2016.\n[2] M. Liserre, M. Andresen, L. Costa, and G. Buticchi, “Power routing\nin modular smart transformers: Active thermal control through uneven\nloading of cells, ” IEEE Industrial Electronics Magazine , vol. 10, no. 3,\npp. 43–53, Fall 2016.\n[3] X. She, A. Q. Huang, and R. Burgos, “Review of solid-state transformer\ntechnologies and their application in power distribution systems, ” IEEE\nJournal of Emerging and Selected T opics in P ower Electronics , vol. 1,\nno. 3, pp. 186–198, Sept 2013.\n[4] J. W ang, A. Q. Huang, W . Sung, Y . Liu, and B. J. Baliga, “Smart grid\ntechnologies, ” IEEE Industrial Electronics Magazine , vol. 3, no. 2, pp.\n16–23, June 2009.\n[5] X. She, X. Y u, F . W ang, and A. Q. Huang, “Design and demonstration of\na 3.6-kv 120-v/10-kva solid-state transformer for smart grid application, ”\nIEEE Trans on P ower Elect , vol. 29, no. 8, pp. 3982–3996, Aug 2014.\n[6] H. T ao, A. Kotsopoulos, J. L. Duarte, and M. A. M. Hendrix, “Family\nof multiport bidirectional dc-dc converters, ” IEE Proceedings - Electric\nP ower Applications , vol. 153, no. 3, pp. 451–458, May 2006.\n[7] J. L. Duarte, M. Hendrix, and M. G. Simoes, “Three-port bidirectional\nconverter for hybrid fuel cell systems, ” IEEE Transactions on P ower\nElectronics, vol. 22, no. 2, pp. 480–487, March 2007.\n[8] L. Costa, G. Buticchi, and M. Liserre, “Quad-active-bridge dc-dc\nconverter as cross-link for medium voltage modular inverters, ” IEEE\nTransactions on Industry Applications , vol. PP , no. 99, pp. 1–1, 2016.\n[9] L. F . Costa, G. Buticchi, and M. Liserre, “Quadruple active bridge dc-\ndc converter as the basic cell of a modular smart transformer, ” in 2016\nIEEE Applied P ower Electronics Conference and Exposition (APEC) ,\nMarch 2016, pp. 2449–2456.\n[10] S. Falcones, R. A yyanar, and X. Mao, “ A dc-dc multiport-converter-\nbased solid-state transformer integrating distributed generation and stor-\nage, ” IEEE Trans on P ower Elect , vol. 28, no. 5, pp. 2192–2203, May\n2013.\n[11] L. F . Costa, G. Buticchi, and M. Liserre, “Highly efﬁcient and reliable\ndc-dc converter for smart transformer, ” in 2017 IEEE Applied P ower\nElectronics Conference and Exposition (APEC) , March 2017.\n[12] K. Mainali, A. Tripathi, S. Madhusoodhanan, A. Kadavelugu, D. Patel,\nS. Hazra, K. Hatua, and S. Bhattacharya, “ A transformerless intelligent\npower substation: A three-phase sst enabled by a 15-kv sic igbt, ” IEEE\nP ower Electron Magazine , vol. 2, no. 3, pp. 31–43, Sept 2015.\n[13] J. Casady , “Power products commercial roadmap for sic from 2012-\n2020, ” Direct-Drive Motor W orkshop, 2014.\n[14] J. Palmour, “Power products rel data & pricing forecasts for 650v-15kv\nsic power modules, mosfets & diodes, ” Direct-Drive Motor W orkshop,\n2014.\n[15] “Powerex - power semiconductor solution, ” http://www .pwrx.com/, ac-\ncessed: 2017-03-09.\n[16] H. W ang, M. Liserre, and F . Blaabjerg, “T oward reliable power elec-\ntronics: Challenges, design tools, and opportunities, ” IEEE Industrial\nElectronics Magazine , vol. 7, no. 2, pp. 17–26, June 2013."
}