{
  "title": "Development of switchable transformer research at University of South Australia",
  "url": "https://openalex.org/W2734847021",
  "year": 2009,
  "authors": [
    {
      "id": "https://openalex.org/A3035410203",
      "name": "H A Dharmawan",
      "affiliations": [
        "University of South Australia"
      ]
    },
    {
      "id": "https://openalex.org/A2105081193",
      "name": "A.M. Ali",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W1455338463"
  ],
  "abstract": "This paper describes research development focusing on the designs of switchable transformers and their control system at University of South Australia. Research development of switchable transformer has become one of the major research interests in school of Electrical and Information Engineering, University of South Australia since year 2000. Research in this area has been carried out through undergraduate to post graduate studies. Several transformer designs, starting from the rating of 1kVA to 10kVA, have been introduced. Testing results from the designs have shown the improvement of the transformer efficiency during low or high loads. As the switchable transformers utilize several switching devices that need to be synchronously controlled, research on the development of the switchable transformer control systems has also been carried out. Now, in this school, a study of utilizing controller area network (CAN) as media to integrate modules in the control system is done. The study also focused on the remote monitoring and control system of the switchable transformer through a local area network (LAN).",
  "full_text": null,
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.48805058002471924
    },
    {
      "name": "Engineering",
      "score": 0.3241633176803589
    },
    {
      "name": "Electrical engineering",
      "score": 0.27511680126190186
    },
    {
      "name": "Voltage",
      "score": 0.06549343466758728
    }
  ]
}