{
  "title": "EXTERNAL MAGNETIC FIELD OF URBAN TRANSFORMER SUBSTATIONS AND METHODS OF ITS NORMALIZATION",
  "url": "https://openalex.org/W2766511962",
  "year": 2017,
  "authors": [
    {
      "id": "https://openalex.org/A2298598117",
      "name": "V.Yu. Rozov ",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2639284090",
      "name": "D. Ye. Pelevin",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2405114266",
      "name": "K. D. Pielievina",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2298598117",
      "name": "V.Yu. Rozov ",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2639284090",
      "name": "D. Ye. Pelevin",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2405114266",
      "name": "K. D. Pielievina",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2566487514",
    "https://openalex.org/W2142398693",
    "https://openalex.org/W2017200813",
    "https://openalex.org/W2148391039",
    "https://openalex.org/W2735081292",
    "https://openalex.org/W1969816453",
    "https://openalex.org/W2051952061",
    "https://openalex.org/W2793068516",
    "https://openalex.org/W2798234299"
  ],
  "abstract": "Целью работы является исследование внешнего магнитного поля городских трансформаторных подстанций (ТП) и методов его уменьшения в близлежащих жилых помещениях до нормативного уровня. Выполнены комплексные экспериментальные исследования магнитного поля частотой 50 Гц, создаваемого типовыми городскими ТП во внешней среде. Показано, что индукция магнитного поля в близлежащих жилых помещениях не превышает нормативного уровня (0,5 мкТл), если помещения расположены на расстояниях более 8 м от корпуса ТП. Предложена мультидипольная математическая модель для расчета внешнего магнитного поля ТП и приведен пример ее практического использования для расчета индукции внешнего магнитного поля, создаваемого в близлежащем жилом помещении ТП мощностью 715 кВА, встроенной в жилой дом. Приведено сравнение результатов расчета и эксперимента. Показано, что встроенные в жилые дома ТП могут создавать в соседних жилых помещениях опасное для здоровья населения магнитное поле с индукцией 1,5-7 мкТл, что в 3-14 раз превышает его нормативный уровень. Предложены методы нормализации внешнего магнитного поля встроенных ТП, основанные на совершенствовании конструкции ТП, а также методах внешнего пассивного и активного экранирования (компенсации).",
  "full_text": "Power Stations, Grids and Systems \n60 ISSN 2074-272X. Electrical Engineering & Electromechanics. 2017. no.5 \n© V.Yu. Rozov, D.Ye. Pelevin, K.D. Pielievina \nUDC 621.3.013:621.311                                                                                              doi: 10.20998/2074-272X.2017.5.10 \n \nV.Yu. Rozov, D.Ye. Pelevin, K.D. Pielievina \n \nEXTERNAL MAGNETIC FIELD OF URBAN TRANSFORMER SUBSTATIONS \nAND METHODS OF ITS NORMALIZATION \n \nPurpose. Research of external magnetic field of urban transformer substations and the methods it reduction to the standard leve l \nin the living quarters of ne arby. Methodology. Experiment based on the actual values the measuring magnetic flux density of the  \nalternating magnetic field. Theories of el ectromagnetic field on quasi-static formula tion is basis of external magnetic field o f \nurban transformer substations description. Results. We have made comprehensive experimental researches the magnetic field of a \n50 Hz through model urban transformer substa tions on the external environment. For calculating the external magnetic field of \ntransformer substations the math ematical model of multi-dipole is  proposed. It practical uses fo r induction external magnetic \nfield of calculating created in nearby bu ilt in house transformer substations power 715 kVA is proposed. Comparison of results \ncalculation and experiment was conducted. Originality. We have established that magnetic flux density of the magnetic field doe s \nnot exceed standard level in the li ving quarters of nearby (0.5 T) if quarters the location distan ces of more than 8 m from the \ntransformer substation on the first time. Transformer substations in the built-in houses can create the dangerous to public health \nmagnetic field which induction 1.5-7 T in neighboring living quarters.  It exceeds the normative level in 3-14 times. Practical \nvalue. We have proposed normalization me thods of the external magnetic field bu ilt-in transformer subs tations. Methods are \nbased on improving construction transforme r substations. And methods of external pa ssive and active shielding are considered. \nReferences 22, figures 9. \nKey words: transformation substation, external magnetic field, living spaces, multi-dipole model, methods of normalization.  \n \nЦелью работы является исследование внешнего магнитного поля городских трансформаторных подстанций (ТП) \nи методов его уменьшения в близлежащих жилых помещениях до нормативного уровня. Выполнены комплексные \nэкспериментальные исследования магнитного поля частотой 50 Гц, создаваемого типовыми городскими ТП во \nвнешней среде. Показано, что индукция магнитного поля в близлежащих жилых помещениях не превышает \nнормативного уровня (0,5 мкТл), если помещения расположены на расстояниях более 8 м от корпуса ТП. \nПредложена мультидипольная математическая модель для расчета внешнего магнитного поля ТП и приведен \nпример ее практического использования для расчета индукции внешнего магнитного поля, создаваемого в \nблизлежащем жилом помещении ТП мощностью 715 кВА, встроенной в жилой дом. Приведено сравнение \nрезультатов расчета и эксперимента. Показано, что встроенные в жилые дома ТП могут создавать в соседних \nжилых помещениях опасное для здоровья населения магнитное поле с индукцией 1,5-7 мкТл, что в 3-14 раз \nпревышает его нормативный уровень. Предложены методы нормализации внешнего магнитного поля встроенных \nТП, основанные на совершенствовании конструкции ТП, а также методах внешнего пассивного и активного \nэкранирования (компенсации). Библ. 22, рис. 9. \nКлючевые слова: трансформаторная подстанция, внешнее магнитное поле, жилые помещения, мультидипольная \nмодель, методы нормализации.  \n \nIntroduction. The magnetic field (MF) of the \nindustrial frequency of 50 Hz is the most dangerous for \npeople's health even with its  weak but long-lasting effect \n[1]. The main sources that  create such MF inside \nresidential premises are power facilities located in \nresidential areas – air and cable transmission lines (TL), \nas well as urban transformer substations (TS). \nThe maximum permissible level (MPL) of magnetic \nflux density of MF 50 Hz for the population created by \nelectrical installations is regulated in [2] and is 10 μT in \nthe residential area and 0.5 μT within the residential \npremises. \nThe most acute problem of the normalization of the \nexternal magnetic field (EMF) of the TS is in residential \nbuildings with integrated TS [2, 6], when the distance \nbetween the TS and living quarters is reduced to several \nmeters. Such houses (Fig. 1) are quite widespread in \nUkraine and other countries. In addition, built-in TS \nbegan to be widely used in the world to supply sections of \n10-20 floors in modern high-rise residential buildings [7] \nin order to reduce power losses. The problem of \nnormalizing their MF also needs to be solved. \nAt present, the MF of the TLs have been most \nthoroughly studied and the methods of its reduction to a \nsafe level for the population have been determined [3-5]. \nAt the same time, the study of the EMF of the TS was not \ngiven due attention, although in some cases – when the \nTS approached the living qua rters, their MF may exceed \nthe MPL. \n \n \n \nFig. 1. A typical residential building with built-in TS \n(Kharkiv, Danilevsky Str., 19) \nISSN 2074-272X. Electrical Engineering & Electromechanics. 2017. no.5 61 \nThus, the EMF of the TS is currently not sufficiently \ninvestigated, which makes it difficult to solve the actual \nand socially significant proble m of the normalization of \nthe MF at frequency of 50 Hz in the premises of \napartment houses located near the TS. \nThe goal of the work is investigation of the EMF of \nurban TS and methods for reducing it to the normative \nlevel in nearby residential premises. \nTS as a source of the MF.  Urban TSs provide \nelectricity for residential buildings. They perform the \nfunctions of converting three-phase high voltage of 6 (10) \nkV into voltage of 0.38 kV and distributing electric \nenergy of 380 V (220 V) to  end users [2, 6]. Typical \nurban TS (Fig. 2) have power from 100 kVA to 1400 \nkVA and are equipped with one or two lowering three-\nphase transformers with grounded neutral. TS contain \npartitioned switchgears (SG) from current conductors \n(buses, cables) with the necessary switching, protective \nand measuring equipment. \n \n \na \n \nb \nFig. 2. Design of urban TS (a) and its SG (b) \n \nThe main sources of the EMF of the TS are three-\nphase current conductors of the SG, each of which, with a \nsymmetrical load of different phases, generally forms \nthree current circuits [5, 8, 9], creating the MF. \nThree-phase transformers of the SG have a \nsymmetrical design theoretically excluding the creation of \nthe EMF [8]. In practice, th ey create the EMF caused by \ntechnological deviations from symmetry [8, 10]. The \nmagnetic flux density of this MF is insignificant and does \nnot exceed 10 % of the total EMF of the TS. The EMF of \nthe transformer has a dipole ch aracter [9], rapidly decays \nwhen removed from the TS (Fig. 3) and is not taken into \naccount in further analysis. \nThe other elements of the SG, including switchgear, \nprotective and measuring equipment of the TS, as well as \ninput and output twisted three-phase cables, also \npractically do not affect the EMF of the TS [9]. \n \n B, T\nr, m\nThe standard for residential \npremises 0.5 μT \n \nFig. 3. Characteristic decrease in magnetic flux density of the \nMF of the TS of type K-42-630 at removal from distance r from \nits housing (1 – total MF of the TS, 2 – MF of current \nconductors, 3 – MF of the transformer) \n \nThus, the EMF of the TS is determined by the MF of \nthree-phase current conductors  of the TS which can be \nrepresented in accordance with Fig. 4. \nExperimental investigations of the EMF of the \nTS. Experimental investigations of the EMF of the TS \nhave been performed for 42 TS of city of Kharkiv with \nnominal power ( Snom) from 100 to 1260 kVA. 36 TS \nlocated in separate buildings (inside microdistricts) and 6 \nTS built into residential buildings were investigated. \nThe research is based on direct measurements of the \neffective value of the magnetic flux density of alternating \nMF in a limited number of points using a Magnetoscop \n1.069 magnetometer by Foerster Company (magnetic flux \ndensity measurement range 0-600 μT, relative error \n2.5 %) and EMF-828 (magnetic flux density measurement \nrange 0-2000 μT, relative error 4 %). \nThe magnetic flux density of the MF at the i-th point \nof the measurement was determined from the \nmeasurements of the magnetic flux density of the MF in \nthe three orthogonal positions of the magnetometer sensor \nusing formula \n \n222\nziyixii BBBB  , (1) \nwhere xiB , yiB , ziB  are the measured effective values of \nthe spatial components of the magnetic flux density of the \nMF at the i-th measurement point along the axes of the \nmagnetometer sensors X, Y, Z. \nThe beginning of the coordinate grid was combined \nwith the surface of the TS housing. MF measurements \nwere carried out at the distance from the TS in the \n62 ISSN 2074-272X. Electrical Engineering & Electromechanics. 2017. no.5 \nhorizontal (vertical) direction corresponding to the \nmaximum values of the MF with the fixation of the actual \ncurrents in the current conductors of the TS. The resulting \nmagnetic flux density value of  the MF of the TS was \nreduced to the rated power of the TS. \nIn the residential zone, the measurement points were \nlocated on lines perpendicular to the walls of the building, \nin increments of 1 m height of 1 m. When measuring MF \nin nearby residential premises, the measurement points \nwere located in the nodes of a spatial grid parallel to the \nwalls of the premises. The ba sic grid of measurements \nhad a step of 0.5 m and was located in a horizontal plane, \nat an altitude of 0.5 m from the floor of the room. \n \n \n3.2m \n5.6m \n0.9m \n0.9m \n2m\n0.5m \n2m\n2md=0.05m \nd=0.16m \nd=0.25m \n \nFig. 4. Configuration of the current conductors of the considered two-transformer TS of power of 715 кVA \n \nThe generalized results of measurements of the \nmagnetic flux density of the MF of the TS of different \npower are shown in Fig. 5 where the value of the \nmagnetic flux density near the external wall of the room \nof the TS corresponds to r = 2 m, the distance between \nwhich and the housing of freestanding TS is 2 m. \n \n B, T \nr, m\nThe standard for residential \npremises 0.5 μT \n1260 kVA \n630 kVA \n100 kVA \n \nFig. 5. Experimental values of the magnetic flux density of the \nEMF of stand-alone TS of various power reduced to their \nnominal load when removing the measuring point from their \nhousing (r is the distance of the TS housing to the point of \nobservation) \nAn analysis of the results of experimental \ninvestigations shows the following. The magnetic flux \ndensity of the EMF of the TS falls to the MPL (0.5 μT) at \nthe distance of 8 m from the TS of maximum power \n(1260 kVA). At the minimum power of the TS \n(100 kVA), its EMF drops to  the MPL at the distance \nof 5 m. \nSince all stand-alone TS ar e located more than 15 m \nfrom residential buildings, they do not represent the \ndangers for its residents. \nThe maximum magnetic flux density of the EMF of \nthe TS under consideration (Fig . 5) occurs near the outer \nwalls of their premises and is 7 μT which does not exceed \nthe MPL for the residential development area (10 μT) in \naccordance with [2]. \nTherefore, urban TS do not pose a public health \nhazard when they are located at  the distance of more than \n8 m from residential buildings. However, this condition is \nviolated for in-built TS when the distance between the TS \nhousing and living quarters is reduced to several meters. \nThus, Fig. 6 shows the magnetic flux density \ndistribution of the MF built from the results of \nmeasurements in a residential building located on the first \nfloor of the house (Fig. 1) above the built-in two-\ntransformer TS with power of 715 kVA. The distance \nISSN 2074-272X. Electrical Engineering & Electromechanics. 2017. no.5 63 \nfrom the TShousing to the floor of a residential building \non the first floor is 1.85 m. The actual load of the TS \nduring the measurements was 45 % of the nominal \n(0.45S\nnom). \nThe results of the measurements are shown in Fig. 6. \nTheir analysis shows that the maximum level of the \nmagnetic flux density of the MF in a residential building \nabove the built-in TS even at the reduced load of the TS \n(0.45Snom) is 1.6 μT which is more than 3 times than the \nMPL. With larger installed po wer of the TS operating at \nthe rated load mode, the magnetic flux density value of \nthe MF in accordance with Fig. 5 can reach 7 μT. \nThus, the built-in TS can create in the adjacent \nresidential premises the MF with magnetic flux density in \n3-14 times exceeding the MPL which poses a danger to \npublic health and requires taking measures to normalize \ntheir EMF. \n \n \nWindow \nx, m\ny, m \nTables Refrig-r \n \nFig. 6. Experimental values of the magnetic flux density \ndistribution of the MF (μT) at an altitude of 0.5 m from the floor \nof the living space located above the built-in TS of power of \nSnom = 715 kVA at the actual load 0.45Snom \n \nModeling of the EMF of the TS.  The analysis \nshows that the EMF of the TS is normalized in the outer \nregion of space – at points remote by the distance R\nо from \nthe TS housing. This distance is at least 2 m and \nconsiderably exceeds the distance d between the axes of \nthe phase conductors of the TS (0.05-0.5 m) [6] that \ncreates the conditions for the application of the multi-\ndipole mathematical model in the calculation of the EMF \nof the TS [8, 11, 12]. This model, with a large number of \ncurrent conductors with a complex configuration, which is \ncharacteristic for TS, allows us to simplify the calculation \nof the EMP of the TS with the limited methodological \nerror (less than 10 %) in co mparison with the Biot-Savart \nmethod and numerical methods [3, 8]. In addition, the \nmulti-dipole model has a clear physical interpretation, \nwhich makes it easier to synthesize the means of reducing \nthe MF based on it [3]. \nIn order to build a multi-dipole model of the EMF of \nthe TS, the approach realized in [3] can be used when \neach linear circuit with current I of the TS (Fig. 4) with \nthe length L and the width d is arbitrarily divided into N \nelementary microcon tours with areas \ndaS ii   \ncharacterized by dipole magnetic moments im  (Fig. 7). In \nthis case, it is necessary to satisfy the following \nconditions [3, 8]: \n dR 20  ; aR 20  ; 05,0 RN\nLa  .  (2) \nIn this case, the magnetic flux density of the MF \nPHk\n\n produced by a single rectilinear single-phase \ncurrent loop (Fig. 7) at the observation point P can be \ndetermined by the expressions [3, 8] \n  \n \n\n\n\n\n\n\n\n\nN\ni i\nii\nk\nR\nRmPH\n1\n34\n,\n\n\n;  (3) \n ndaeISIm i\nj\nii\n    ,  (4) \nwhere N is the number of microc ontours in a rectangular \ncontour of the TS; iS\n\n is the vector of the square of the \ni-th microcontour; in  is the unit vector normal to Si; iR\n\n is \nthe radius-vector from the geometrical center of the i-th \nmicrocontour to the observation point Р;  is the phase of \nthe current I. \n \n \nElementary\nmicrocontour\n \nFig. 7. Multidipole representation of the elementary contour \nwith alternating current I as a source of the MF \n \nThen the magnetic flux density TSB\nof the EMF of \nthe TS (Fig. 4), containing K three-phase rectilinear TS \ncontours, can be defined as \n  \n  \n\n\n\n\n\n\n\n\nK\nl\nN\ni il\nililTS\nR\nRmPB\n1\n3\n11\n3\n0\n4\n,\n \n\n\n\n\n, (5) \nwhere  is the TS current conductor phase number \n( = 1…,3); l is the TS contour number ( l = 1, …, K); \n0 is the magnetic constant.  \nWe use the proposed multi-dipole model (5) to \ncalculate the magnetic flux density of the EMP of the \nbuilt-in TS. The calculation will be carried out for a real \nurban 2-transformer TS with power of 715 kVA built into \nthe residential house (Fig. 1). In the calculation, we \nassume that the cu rrents in the phas es of all the TS \ncircuits are sinusoidal, shifted by 120 el. degrees and form \na symmetrical system. Current  conductors of the TS are \ncurrent threads. The external environment does not \n64 ISSN 2074-272X. Electrical Engineering & Electromechanics. 2017. no.5 \ncontain sources of the MF. Th e effect on the EMP of the \nmetal parts of the TS housing and the walls of the \napartment house in accordance with [9, 13] is neglected. \nThe calculation scheme of the TS corresponds to \nFig. 4 and contains 18 re ctilinear three- phase current \ncontours (\nK = 18) with shown in Fig. 4 dimensions and \nactual currents, determined experimentally under TS load \n0.45Snom: I1 = 312 А; I2 = 208 А; I3 = 108 А; I4 = 104 А; \nI5 = 100 А; I6 = 108 А; I7 = 21 А; I8 = 174 А; I9 = 114 А; \nI10 = 62 А; I11 = 60 А; I12 = 52 А; I13 = 62 А; I14 = 12 А.  \nThe results of calculating the flux density of the MF \nin a horizontal plane located at an altitude of 2.35 m \nabove the TS were performed in accordance with (5) and \nare shown in Fig. 8. \nComparison of the calculati on results (Fig. 8) with \nthe results of the experiment (Fig. 6) shows that the \nmaximum calculated magnetic flux density value of MF \n(1.7 μT) with an error of less than 10 % coincides with \nthe experimental results (1.6 μT). This confirms the \ncorrectness of the proposed methodology for calculating \nthe magnetic flux density of the EMF of the TS and the \nassumptions made above. \nMethods of normalization of the EMF of the TS.  \nAs follows from the above an alysis, the normalization of \nthe EMF is required for TS built in residential houses, \nwhen the distance between the TS housing and the \nresidential space is less than 8 m. The main methods of \nnormalizing the EMF of the TS are shown in Fig. 9. \n \n Residential premise \nB, T y, m\nx, m  \nFig. 8. Calculated values of the magnetic flux density \ndistribution of the MF (μT) at an altitude of 0.5 m from the floor \nof the living space (Fig. 1) located above the built-in TS of \npower of Snom = 715 kVA at the actual load 0.45Snom \n \n \nMethods of normalization of EMF of the TS \nReducing the MF by distance External shielding of the MF of the TS \nTS design improvement Passive shielding of \nresidential premises from\nthe MF of the TS \nActive shielding \n(compensation) of the MF\nof the TS in residential \npremises \nReduction of the \ninterfacial distance d \nbetween the current \nconductors \nStructural and \ntechnological methods for \nreducing EMF of the TS \nContour shielding \nof the MF of main current \nconductors \n \nFig. 9. Classification of methods of normalization of EMF created by the TS in nearby residential premises \n \nThe EMF of the TS falls off intensely as a function \nof the distance (Fig. 5) wh ich allows to significantly \nreduce the MF when removing the TS from residential \npremises. However, the implementation of this method is \npossible only in the presence of free space which limits \nits use. \nA significant decrease in the EMF of the TS is \npossible due to its special design of the TS. Thus, the \nconstructive and technological methods proposed in [8, 9] \n(symmetrization, transpos ition, splitting of current \nconductors, local active and pa ssive shielding of the MF) \nallow to reduce the EMF of the TS by an order of \nmagnitude or more. A promising method of reducing the \nEMF of the TS is the contour shielding of its current leads \nin accordance with [5, 9]. Ho wever, the change in the \ndesign of existing TS is technically difficult and has legal \nlimitations, and the industrial release of TS in a special \ndesign requires significant investment. \nTherefore, methods of external shielding of the MF \nof the TS are more preferable for practical \nimplementation. Passive shield ing is carried out with the \nhelp of electrically conduc tive (ferromagnetic) materials \nplaced on walls and ceilings located near the TS of \nresidential premises [14, 15]. This method is universal but \nISSN 2074-272X. Electrical Engineering & Electromechanics. 2017. no.5 65 \nat a low frequency of 50 Hz its implementation requires \nsubstantial material means. \nOf great interest from the point of view of the cost of \nrealization for high efficiency are the methods of active \nshielding of the MF [4, 8, 9, 16-22]. However, they \nrequire their development in relation to the MF which is \nthe subject of further research. \nConclusions. \n1. Complex experimental investigations of the \ndistribution of the flux density  of the external magnetic \nfield with frequency of 50 Hz, created by 42 typical urban \ntransformer substations (TS) with installed power from \n100 kVA to 1260 kVA are performed for the first time. It \nis shown that the flux dens ity of the magnetic field in \nnearby residential premises does not exceed the \nregulatory level (0.5 μT), provided that the TS is removed \nfrom residential premises over the distance of more \nthan 8 m. \n2.\n A multi-dipole mathematical model for calculating \nthe external magnetic field of the TS is proposed and \nexperimentally justified making it possible to simplify the \ncalculation with a limited error (10 %) and having a clear \nphysical interpretation. The model is built on the basis of \ndipole sources of the magnetic field, characterized by the \nmagnetic moments of independent elementary \nmicrocontours \niad   into which all the linear sections of \nthree-phase current conductors of the TS with interphase \ndistance d are arbitrarily divided. The magnetic field at \nthe observation point distant by more than 2 d (2 ia ) is \ndefined as the superposition of  the magnetic field created \nby the magnetic moments of the elementary \nmicrocontours of all the linear sections of the TS current \nconductors.  \n3. It is theoretically substa ntiated and experimentally \nconfirmed that the greatest dange r to public health is TP \nbuilt into homes that can create in a neighboring \nresidential area a magnetic field with the flux density of \n1.5-7 μT, which is 3-14 times hi gher than the normative \nlevel. \n4.\n The methods of normalizing the external magnetic \nfield of the TS in residential premises are considered \nbased on the improvement of the TS design, the use of \nexternal shielding (compensation) of the TS magnetic \nfield, and the prospects for the development of methods \nfor external active shielding of the magnetic field are \nsubstantiated. \n \nREFERENCES \n1. Serdiuk A.М., Dumanskiy V.Yu., Bitkin S.V., Didyk N.V., \nDumanskiy Yu.D. Hygienical ground of requirements to placing \nand exploitation of cable busses of electricity transmission and \ntheir equipment in the conditions of modern municipal building. \nHygiene of populated places, 2015, no.66, pp. 20-29. (Ukr). \n2. Pravyla ulashtuvannja elektrous tanovok 5-te vyd., pererobl. \nj dopovn. (stanom na 22.08.2014) [Electrical Installation \nRegulations. 5 edition, Revised and enlarged]. Kharkiv, Fort \nPubl., 2014. 800 p. (Ukr). \n3. Rozov V.Yu., Reutskyi S.Yu ., Pelevin D.Ye., Pyliugina \nO.Yu. The magnetic field of power transmission lines and the \nmethods of its mitigation to a safe level.  Tekhnichna \nelektrodynamika, 2013, no.2, pp. 3-9. (Rus). \n4. Kuznetsov B.I., Nikitina T.B., Voloshko A.V., Bovdyj I.V., \nVinichenko E.V., Kobilyanskiy B.B.. Synthesis of an active \nshielding system of the magnetic  field of power lines based on \nmultiobjective optimization.  Electrical engineering & \nelectromechanics, 2016, no.6, pp. 26-30. (Rus). doi: \n10.20998/2074-272X.2016.6.05. \n5. Rozov V.Yu., Dobrodeyev P.N., Kvytsynskyi A.A. Double-\ncircuit passive shielding of th e magnetic field of high-voltage \ncable lines in junction zones. Tekhnichna Elektrodynamika , \n2017, no.1, pp. 23-28. (Rus). \n6. Opoleva G.N. Skhemy i podstantsii elektrosnabzheniia. \nSpravochnik [Schemes and substati ons of power supply. \nDirectory]. Moscow, Forum-Infra Publ., 2006. 480 p. (Rus). \n7. Alotto P., Guarnieri M., Moro F., Turri R. Mitigation of \nresidential magnetic fields ge nerated by MV/LV substations. \nUniversities Power Engi neering Conference, 42nd \nInternational. 2007, pp. 832-836. doi: \n10.1109/UPEC.2007.4469057. \n8. Rozov V.Yu. Vneshnie magnitnye polia silovogo \nelektrooborudovaniia i met ody ikh umen'sheniia [External \nmagnetic fields of power electr ical equipment and methods for \nreducing them]. Kiev, The Instit ute of Electrodynamics Publ., \n1995, no.772. 42 p. (Rus). \n9. Rozov V. Yu., Erisov A.V., Lupikov V.S. Osobennosti \nsnizheniia vneshnikh magnitnykh polei raspredelitel'nykh \nustroistv i poluprovodniko vykh preobrazovatelei [Features of \nreducing external magnetic fields of switchgears and \nsemiconductor converters]. Kiev, The Institute of \nElectrodynamics Publ., 1996, no.791. 46 p. (Rus). \n10. Zautner F.L., Pilyugina O.Yu., Rozov V.Yu. Probabilistic \nmethod for predicting electromagne tic interference of electrical \nequipment in the low-frequency range. Tekhnichna \nElektrodynamika, 1994, no.1, pp. 3-6. (Rus). \n11. Rozov V.Yu. Construction of systems for automatic \ncompensation of external magneti c fields of mobile objects \ncontaining ferromagnetic masses. Tekhnichna Elektrodynamika. \nThematic issue «Problems of m odern electrical engineering» , \n2002, no.2, pp. 9-14. (Rus). \n12. Rozov V.Yu., Getman А.V., Petrov S.V., Ericov А.V., \nMelanchenko А.H., Horoshilov V.S, Shmi dt I.R. Magnetism of \nspacecraft. Tekhnichna Elektrodynamik a. Thematic issue \n«Problems of modern electrical engineering» , 2010, no.2, pp. \n144-147. (Rus). \n13. Rozov V.Yu., Grinchenko V.S ., Pelevin D.Ye., Chunikhin \nK.V. Simulation of electromagnetic field in residential buildings \nlocated near overhead lines. Tekhnichna Elektrodynamika, 2016, \nno.3, pp.6-9. (Rus). \n14. Szabó J., Jánossy G., Thuróczy G. Survey of residential 50 \nHz EMF exposure from transformer stations. \nBioelectromagnetics, 2007, vol.28, no.6, pp. 48-52. doi: \n10.1002/bem.20264. \n15. Burnett J., Du Yaping P. Mi tigation of extremely low \nfrequency magnetic fields from el ectrical installations in high-\nrise buildings. Building and Environment , 2002, vol.37, no.8-9, \npp. 769-775. doi:10.1016/S0360-1323(02)00043-4. \n16. Shidlovskij A.K., Rozov V.Yu. Automatic compensation \nsystems for external magnetic fields of energy-saturated objects. \nTekhnichna Elektrodynamika, 1996, no.1, pp.3-9. (Rus). \n17. Rozov V.Yu.,\n Assuirov D.A., Reuckij S.Ju. Closed systems \nfor compensation of the magnetic field of technical objects with \ndifferent methods of feedback formation. Tekhnichna \nElektrodynamika. Thematic i ssue «Problems of modern \nelectrical engineering», 2008, no.4, pp. 97-100. (Rus). \n66 ISSN 2074-272X. Electrical Engineering & Electromechanics. 2017. no.5 \n18. Rozov V.Yu., Assuirov D.A. The method of active shielding \nof the external magnetic fi eld of technical objects. Tekhnichna \nElektrodynamika. Thematic i ssue «Problems of modern \nelectrical engineering», 2006, no.3, pp. 13-16. (Rus). \n \n19. Voloshko A.V. Synthesis of active shielding systems of \npower transmission lines magnetic field. Visnyk Nac. Akad. \nNauk Ukr., 2017, no.7, pp. 64-73. (Ukr). doi: 10.15407/ \nvisn2017.07.064. \n20. Cruz P., Riquelme J.M., de la Villa A., Martínez J.L. Ga-\nbased passive loop optimization for magnetic field mitigation of \ntransmission lines: neural networ k applications in electrical \nengineering. Neurocomputing, 2007, vol.70, no.16-18, pp. 2679-\n2686. doi:10.1016/j.neucom.2006.05.016. \n21. del-Pino-López J.C., Giaccone L., Canova A., Cruz-Romero \nP. Design of active loops for magnetic field mitigation in \nMV/LV substation surroundings. Electric Power Systems \nResearch, 2015, vol.119, pp. 337-344. doi: 10.1016/j.epsr. \n2014.10.019. \n22. Garzia F., Geri A. Active shielding design of indoor MV/LV \nsubstations using genetic algorithms optimization. IEEE \nSymposium on Electrom agnetic Compatibility , 2003, vol.1, \npp.197-202. \n \nReceived 12.08.2017 \n \nV.Yu. Rozov\n1, Doctor of Technical Science, Corresponding \nmember of NAS of Ukraine, \nD.Ye. Pelevin1, Candidate of Technical Science,  \nK.D. Pielievina1, Postgraduate Student, \n1 State Institution «Institute of Technical Problems  \nof Magnetism of the NAS of Ukraine», \n19, Industrialna Str., Kharkiv, 61106, Ukraine, \nphone: +380 572 992162, \nе-mail: pelevindmitro@ukr.net \n \nHow to cite this article: \nRozov V.Yu., Pelevin D.Ye., Pielievina K.D. External magne tic field of urban transformer substations and methods of \nits normalization. Electrical engineering & electromechanics , 2017, no.5, pp. 60-66. doi: 10.20998/2074-\n272X.2017.5.10. ",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.663231372833252
    },
    {
      "name": "Magnetic field",
      "score": 0.5940331816673279
    },
    {
      "name": "Electrical engineering",
      "score": 0.5628610849380493
    },
    {
      "name": "Engineering",
      "score": 0.48975467681884766
    },
    {
      "name": "Electromagnetic shielding",
      "score": 0.44658946990966797
    },
    {
      "name": "Magnetic flux",
      "score": 0.43316173553466797
    },
    {
      "name": "Electronic engineering",
      "score": 0.3808194398880005
    },
    {
      "name": "Physics",
      "score": 0.2741445004940033
    },
    {
      "name": "Voltage",
      "score": 0.25494712591171265
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    }
  ],
  "institutions": []
}