{
  "title": "Design and testing of a novel rotary transformer for rotary ultrasonic machining",
  "url": "https://openalex.org/W2768988459",
  "year": 2017,
  "authors": [
    {
      "id": "https://openalex.org/A5071552359",
      "name": "Jiyue Duan",
      "affiliations": [
        "Tianjin University"
      ]
    },
    {
      "id": "https://openalex.org/A5115601370",
      "name": "Bin Lin",
      "affiliations": [
        "Tianjin University"
      ]
    },
    {
      "id": "https://openalex.org/A5100719942",
      "name": "Qiang Yang",
      "affiliations": [
        "Tianjin University"
      ]
    },
    {
      "id": "https://openalex.org/A5082486448",
      "name": "Yujia Luan",
      "affiliations": [
        "Tianjin University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2041032277",
    "https://openalex.org/W2068382737",
    "https://openalex.org/W2065719857",
    "https://openalex.org/W2080166719",
    "https://openalex.org/W2030154140",
    "https://openalex.org/W2093528661",
    "https://openalex.org/W2275130444",
    "https://openalex.org/W2586557406",
    "https://openalex.org/W2131561725",
    "https://openalex.org/W2167310943",
    "https://openalex.org/W2117815612",
    "https://openalex.org/W2152221504",
    "https://openalex.org/W2143469557"
  ],
  "abstract": "This paper presents the design and testing of a novel rotary transformer for rotary ultrasonic machining (RUM). The transformer structure is innovatively designed for easy assembly and disassembly, which provides increased convenience to tool replacement in RUM. Circuit analysis shows the efficiency loss caused by the structure simplification is less than 5%. Also, the effect of the primary core angle and air gap length on coupling coefficient is studied for guiding the design. A rotary transformer with 90° primary core and 1.0 mm air gap is achieved. Contrast tests were carried out in simulation and experiment. Results show this novel rotary transformer transmission efficiency is 0.8972, which is agree with the theoretical value.",
  "full_text": "Design and testing of a novel\nrotary transformer for rotary\nultrasonic machining\nJiyue Duan, Bin Lina), Qiang Yang, and Yujia Luan\nDepartment of Mechanical Engineering, Tianjin University, Tianjin 300072, China\na) tdlinbin@126.com\nAbstract: This paper presents the design and testing of a novel rotary\ntransformer for rotary ultrasonic machining (RUM). The transformer struc-\nture is innovatively designed for easy assembly and disassembly, which\nprovides increased convenience to tool replacement in RUM. Circuit analysis\nshows the efﬁciency loss caused by the structure simpliﬁcation is less than\n5%. Also, the effect of the primary core angle and air gap length on coupling\ncoefﬁcient is studied for guiding the design. A rotary transformer with 90°\nprimary core and 1.0 mm air gap is achieved. Contrast tests were carried out\nin simulation and experiment. Results show this novel rotary transformer\ntransmission efﬁciency is 0.8972, which is agree with the theoretical value.\nKeywords: rotary transformer, structure design, circuit analysis,ﬂexibility,\nrotary ultrasonic machining\nClassiﬁcation: Power devices and circuits\nReferences\n[1] T. B. Thoe, et al.: “Review on ultrasonic machining,” Int. J. Mach. Tools\nManuf. 38 (1998) 239 (DOI: 10.1016/S0890-6955(97)00036-9).\n[2] H. Gong, et al.: “Kinematic view of toot life in rotary ultrasonic side milling\nof hard and brittle materials,” Int. J. Mach. Tools Manuf.50 (2010) 303 (DOI:\n10.1016/j.ijmachtools.2009.12.006).\n[3] P. N. H. Thomas and V. I. Babitsky: “Experiments and simulations on\nultrasonically assisted drilling,” J. Sound Vibrat. 308 (2007) 815 (DOI: 10.\n1016/j.jsv.2007.03.081).\n[4] R. Trevisan and A. Costanzo: “A 1-kw contactless energy transfer system\nbased on a rotary transformer for sealing rollers,” IEEE Trans. Ind. Electron.61\n(2014) 6337 (DOI: 10.1109/TIE.2014.2311395).\n[5] X. Zhu, et al.: “Efﬁciency-based compensations and the mechanical load\ndependencies of rotary transformer for rotary ultrasonic machining applica-\ntions,” IET Power Electron.8 (2015) 986 (DOI: 10.1049/iet-pel.2014.0253).\n[6] M. Ruviaro, et al.: “Analysis and test results of a brushless doubly fed\ninduction machine with rotary transformer,” IEEE Trans. Ind. Electron. 59\n(2012) 2670 (DOI: 10.1109/TIE.2011.2165457).\n[7] M. P. Kazmierkowski, et al.: “Inductive coupled contactless energy transfer\nsystems-a review, ” WZEE IEEE (2015) 1 ( DOI: 10.1109/WZEE.2015.\n7394025).\n[8] Y. Yu and X. Wang:“Characteristic analysis of relatively high speed, loosely\ncoupled rotating excitation transformers in HEV and EV drive motor excitation\nsystems,” IEICE Electron. Express 14 (2017) 20161218 (DOI: 10.1587/elex.\n© IEICE 2017\nDOI: 10.1587/elex.14.20171033\nReceived October 11, 2017\nAccepted November 7, 2017\nPublicized November 27, 2017\nCopyedited December 10, 2017\n1\nLETTER IEICE Electronics Express, Vol.14, No.23, 1–9\n14.20161218).\n[9] C.-S. Wang, et al.: “Power transfer capability and bifurcation phenomena of\nloosely coupled inductive power transfer systems,” PESC IEEE (2008) 3642.\n[10] K. D. Papastergiou and D. E. Macpherson:“Air-gap effects in inductive energy\ntransfer,” PESC IEEE (2008) 4092 (DOI: 10.1109/PESC.2008.4592594).\n[11] W. Zhang, et al.: “A novel transformer for contactless energy transmission\nsystems,” ECCE IEEE (2009) 3218 (DOI: 10.1109/ECCE.2009.5316365).\n[12] A. J. Moradewicz and M. P. Kazmierkowski: “Contactless energy transfer\nsystem with fpga-controlled resonant converter,” IEEE Trans. Ind. Electron.57\n(2010) 3181 (DOI: 10.1109/TIE.2010.2051395).\n[13] B. Li, et al.: “High-ﬁeld magnetic resonance imaging with reducedﬁeld/tissue\nrf artefacts— a modeling study using hybrid mom/fem and fdtd technique,”\nIEEE Trans. Electromagn. Compat.48 (2006) 628 (DOI: 10.1109/TEMC.2006.\n884539).\n1 Introduction\nWith the distinct advantages of high material removal rate, low cutting force, long\ntool life and good surface quality, rotary ultrasonic machining (RUM) is widely\nused in the processing of hard and brittle materials [1, 2]. Nowadays, in RUM, the\nmost common way to transmit electrical energy from power supply to rotatable\ntransducer is by sliding contacts, usually brushes and slip rings [3]. However, the\nlifetime of this kind of device is strongly related to the cumulated number of\nrevolutions. The friction between slip rings and brushes leads to abrasion and\ntemperature rising [4, 5]. What’s more, any fault on electrical contact can generate\nsparks [6], so such machines cannot be installed in ﬂammable and explosive\nenvironments.\nRotary transformer can be used to replace the brushes and slip rings. As the key\ncomponent of a contactless energy transfer system (CETS), a rotary transformer is\nusually composed of two windings and corresponding cores. Rotary transformers\nhave numerous applications such as electric vehicle, bio-engineering devices, and\nhandheld devices [5, 7, 8]. According to the structures, commonly used rotary\ntransformer can be divided into three types and in order to reduce leakage and\nmagnetizing energy, the air gap between two cores is small (usually 0∼1 mm). The\nstructural sketches are shown in Fig. 1.\nIn RUM, tool replacement is realized replacing tool handle together with the\ntool, so the two sides of rotary transformer needed to be assembled and separated\nfrequently. A slight jitter of the spindle or a human error in the assembly process\nFig. 1. Proﬁles of three commonly used rotary transformers\n© IEICE 2017\nDOI: 10.1587/elex.14.20171033\nReceived October 11, 2017\nAccepted November 7, 2017\nPublicized November 27, 2017\nCopyedited December 10, 2017\n2\nIEICE Electronics Express, Vol.14, No.23, 1–9\nmay lead to a collision between the cores, causing serious safety problems. In other\nwords, these rotary transformers raise the operational accuracy requirements and\nbring a lot of inconveniences to tool replacement in RUM.\nIn this paper, we propose a rotary transformer with simpliﬁed primary side for\neasy disassembly. Differing from conventional rotary transformers, the primary side\nof this rotary transformer is part of ring rather a full ring, so the primary side and\nthe secondary side can be easily assembled and separated. This structural optimi-\nzation can signiﬁcantly improve the ﬂexibility of the RUM vibration system,\nreduces the assembly accuracy requirement and simpliﬁes the tool replacement\nprocess. By analyzing the affecting regularity of primary core angle and air gap\nlength on coupling coefﬁcient, a set of parameters is determined. A rotary trans-\nformer is assembled and tested. The transmission efﬁciency of a CETS with this\nrotary transformer is about 0.9, which is veriﬁed experimentally.\n2 Structure design and conﬁguration\nIn RUM, different processing stages need different types of tool, the rotatable part\nneed to be installed and removed frequently. Conventional rotary transformer with\n360° cores can only be separated along axial direction. However if the primary core\nsimpliﬁed to no greater degrees 180°, theﬂexibility will be signiﬁcantly improved.\nThe sketch of CETS with this simpliﬁed rotary transformer for RUM is showed\nin Fig. 2. The lower left of Fig. 2 shows the conﬁguration of this simpliﬁed rotary\ntransformer, including two windings and two corresponding ferrite cores. The\nprimary winding is wound around the primary core. The secondary winding is\nlaid in the groove of the secondary core ring. The windings are copper litz wires,\nand the number of coil turns is 40 (primary) and 30 (secondary). The physical\nseparation of the rotatable transformer is ensured by adding a small air gap between\nthe ferrite cores. The primary core angleα and the air gap lengthl are two key\nparameters having close relationship with the performance of a rotary transformer.\nThe selection of the value ofα and l is discussed in section 4. The remaining\ndimension parameters of the model are designed according to a standard speciﬁ-\ncation of tool handle (bt40), so that this rotary transformer can be easily installed\nto a handle for machining application.\nFig. 2. Sketch of CETS with a novel rotary transformer\n© IEICE 2017\nDOI: 10.1587/elex.14.20171033\nReceived October 11, 2017\nAccepted November 7, 2017\nPublicized November 27, 2017\nCopyedited December 10, 2017\n3\nIEICE Electronics Express, Vol.14, No.23, 1–9\nThe primary winding is connected with the ultrasonic power and the secondary\nwinding is connected with the transducer. Ultrasonic energy is transmitted to the\ntransducer based on local electromagnetic induction effect without physical contact.\nMoreover, this rotary transformer permits easy disassembly to RUM vibration\nsystem. When the tool needs to be replaced for different producing process, the\nstatic part can be moved apart in radial direction in advance, and then the rotatable\npart be removed from machining center in axial direction without causing colli-\nsions. So this novel rotary transformer greatly reduces the operating accuracy\nrequirement and shortens the time-consume in tool replacement process.\n3 Magnetic reluctance circuit and theoretical analysis\nThe magnetic reluctance circuit of a CETS for RUM is depicted in Fig. 3-a [5].L\nP\nand LS are inductances of the coils,RP and RS represent the AC resistances.M is the\ncoefﬁcient of mutual induction.RL represents equivalent impedance of mechanical\nload. The capacitance of the piezoelectric is represented byC0 and the dielectric\nloss is reﬂected by R0. L1, C1, R1 are the transducer’s mechanical behavior,\nrepresent mechanical vibration system ’s mass, stiffness and damping. In the\nequivalent circuit, the leakage ﬂux is represented as leakage inductance which\ninevitably exchanges plenty of reactive power. Therefore, compensationsXP and\nXS (capacitance) are series connected to the circuit to set the reactance equaling to\nzero. So the magnetic reluctance circuit was simpliﬁed to Fig. 3-b.\nTo maximum electro-acoustic efﬁciency and vibration amplitude, the system is\nset to operate at series resonance frequency (!S ¼ 1= ﬃﬃﬃﬃﬃﬃﬃﬃﬃﬃL1C1\np ). The resistance and\nreactance of ultrasonic vibration system at series resonant frequency are given as:\nRT ¼ R1 þ RL\n!S2C02ðR1 þ RLÞ2 þ 1\nXT ¼/C0 !SC0ðR1 þ RLÞ2\n!S2C02ðR1 þ RLÞ2 þ 1\n8\n>>\n>\n<\n>>>:\n: ð1Þ\nWith the assumption that the circuits are under complete compensation and no-load,\nwhen considering the secondary circuit as the electrical load of the primary circuit,\nthe transmission efﬁciency of the system can be derived as:\n/C17¼ /C17\nP /C2 /C17S ¼ RRC\nRP þ RRC\n/C2 RT\nRS þ RT\n: ð2Þ\nFig. 3. Magnetic reluctance circuit\n© IEICE 2017\nDOI: 10.1587/elex.14.20171033\nReceived October 11, 2017\nAccepted November 7, 2017\nPublicized November 27, 2017\nCopyedited December 10, 2017\n4\nIEICE Electronics Express, Vol.14, No.23, 1–9\nIn which,RRC is the reﬂected resistance which represents the impact of secondary\ncircuit on primary circuit. As RRC is derived as RRC ¼ !S2M2\nRS þ RT\n[9], so the\ntransmission efﬁciency of the CETS can be deﬁned as:\n/C17¼ 1\nRPðRT þ RSÞ\n!S2M2 þ 1\n/C2 RT\nRS þ RT\n: ð3Þ\nIn Eq. (3), the efﬁciency of the CETS is expressed as two formulas in multi-\nplication. The structure of the primary winding and core change will just affectM\nand RP, the formula RT\nRS þ RT\nremains unchanged. When the primary core changes\nfrom a whole core to a portion of a ring,RP and M will decrease, because ofM\nsquared in the formulas,M decrease impact more on the value, so the value of\nformulas RPðRT þ RSÞ\n!S2M2 increases, η will decrease. Whereas, because of the differ-\nence in magnitude of numerator and denominator, the value of RPðRT þ RSÞ\n!S2M2\nusually less than 0.05. Consequently, compared with a 360° rotary transformer,\nthe efﬁciency loss of proposed rotary transformer in section 2 is less than 5%.\n4 Structure optimization\nCoupling coefﬁcient k of a transformer is a key parameter affecting the efﬁciency of\na CETS. Although circuit compensation can alleviate the problems associated with\nlarge air gap, low coupling coefﬁcient of the contactless transformer is still the\nbottleneck limiting the efﬁciency of a CETS [10, 11, 12]. The primary core angleα\nand the air gap lengthl are two key parameters, which are closely related to the\ncoupling coefﬁcient (k) of a rotary transformer. To obtain a rotary transformer with\nbetter ﬂexibility as well as higherk, we calculated the impact ofα and l on k using\nAnsoft. Situations are researched where six kinds of primary core angle (30°, 60°,\n90°, 120°, 150°, 180°) with air gap length varying from 0.02 mm to 5 mm are\nconsidered. The variation trend of coupling coefﬁcient (k) is shown in Fig. 4.\nFig. 4 shows the variation tendencies ofk and ﬁrst derivative of k, clearly\nshowing how k is affected by α and l, so that we can determine which point is\na better choice. First derivative ofk reﬂects the change speed degree ofk more\nclearly. It can be seen from the result in Fig. 4(a), large primary angle (α) and small\nair gap length (l) will both result in high coupling coefﬁcient (k). But smallα and l\nreduces theﬂexibility, because largeα core has large volume, so more workspace is\nneeded for separation; also small gap increases the operational accuracy require-\nments. So there is a contradiction between high coupling coefﬁcient and structure\nﬂexibility. Although we cannot achieve bestﬂexibility and highestk at the same\ntime, we can obtain a relative optimal structure in comprehensive coordination of\nﬂexibility and coupling coefﬁcient.\nThe air gap length is crucial to the magnetic components’operation, a longer air\ngap results in more energy loss than a short or no air gap, an air gap between\n0m m∼1 mm is recommend [10]. And in many references [4, 8, 12], the rotary\ntransformers are optimized with a gap in the range of0 mm <l ⩽ 1 mm. As there\nis no much difference in design principle of rotary transformer air gaps,0 mm <\nl ⩽ 1 mm is also appropriate for design in this paper.\n© IEICE 2017\nDOI: 10.1587/elex.14.20171033\nReceived October 11, 2017\nAccepted November 7, 2017\nPublicized November 27, 2017\nCopyedited December 10, 2017\n5\nIEICE Electronics Express, Vol.14, No.23, 1–9\nIn Fig. 4, with thel increasing in the range of 0 mm <l /C20 1 mm, the k of\nthe rotary transformer decreases in exponent, and the decrease is becoming more\nintense with primary core angle reduction. In the range ofl> 1 mm, the decline\ntends to linear, which is more directly shown in Fig. 4-b. The change of the trend\nhas something to do with the core shape and the arrangement of coils. Because\nthe primary core is a portion of ring and the coils is wounded around the primary,\nthe primary winding is not in regular shape. Whenl is small (l< 1), the leakage\nexist in both the gap area and the area of core ends. Whenl get large (l> 1 mm),\nmagnetic intensity rapid decline in the area of two ends of arc core, the leakage is\nmainly come from the gap area, so the trend become orderly. This also why a small\nα has relatively longer exponential decrease process than a largeα in Fig. 4. In\nRUM, there might be a small-amplitude vibration (small than 0.1 mm) on the\nmachine caused by the spindle rotation, which may slightly change the air gap\nlength. So, an air gapl /C21 1 is more preferable where k is less sensitive tol change.\nSimilarly, as shown in Fig. 4, smallα will seriously restrictk,s oα less than 60°\nare not recommended. Whenα is over 120°, the lines get even closer, the rate ofk\nincrease is much lower than the rate of degree increase, the promotion ofα increase\nto k is limitedly. As forﬂexibility, workspace is considered as one of the important\nindexes for evaluating the device. A core with largeα has large volume, needing\nmore workspace during separation; also by calculated the ratio of rate ofk increase\nby rate of volume increase atl ¼ 1 mm, 90° has the highest value (0.245), which\nFig. 4. Variable trend of (a) coupling coefﬁcient k (b) ﬁrst derivative\nof k\n© IEICE 2017\nDOI: 10.1587/elex.14.20171033\nReceived October 11, 2017\nAccepted November 7, 2017\nPublicized November 27, 2017\nCopyedited December 10, 2017\n6\nIEICE Electronics Express, Vol.14, No.23, 1–9\nmeans among six core angle discussed, when the primary is 90°, it has the highest\nbeneﬁto n k with the volume increase.\nConsidering all the above-mentioned factors synthetically,/C11¼ 90°, l ¼ 1:0 mm\n(the point indicated by the arrows in Fig. 4-a) is selected as a relative optimal\ndesign parameters, then a rotary transformer is fabricated.\n5 Performance testing and comparison\nSimulation and experiments were done to further determine the electrical perform-\nance of this rotary transformer. Finite-difference time-domain (FDTD), ﬁnite\nelement method (FEM) and hybrid method of moments (MoM) have been widely\nused in calculation andﬁeld analysis [13]. Ansoft is a software based on FEM,\nwhich is appropriate choice for circuit simulation [8].\nIn simulation, a transientﬁeld is calculated by using Ansoft, the magneticﬁeld\ndistribution and current density distribution are shown in Fig. 5.\nFrom theﬁeld distribution results, we can see the windings are in good mutual\ninductance effect. The primary core is a portion of ferrite ring, so on the secondary\ncore only the part faced to the primary core is ‘effective area’, the magnetic\ninduction line go through the primary core and effective area in secondary core,\nachieving a closed loop. At the edge of effective area, the magnetic line become\nsomewhat divergent. From the current density distribution, the distribution of\ncurrent is uniform. The transmission efﬁciency obtain from simulation is 0.9050,\nand more detail data is listed in Table I.\nIn the experiments, as shown in Fig. 6, two digital power meters were used\nto directly measure the power of the power supply and the transducer, so the\nFig. 5. Simulation ﬁeld result (a) magnetic line distribution (b) current\ndensity distribution\nFig. 6. Testing platform and rotary transformers\n© IEICE 2017\nDOI: 10.1587/elex.14.20171033\nReceived October 11, 2017\nAccepted November 7, 2017\nPublicized November 27, 2017\nCopyedited December 10, 2017\n7\nIEICE Electronics Express, Vol.14, No.23, 1–9\nefﬁciency was easily calculated. The practical performance of this optimized\ntransformer was obtained, which can be a comparison to simulation results.\nFurthermore, a conventional rotary transformer was assembled, the performance\nof this transformer was also obtained as control. Detailed data is listed in Table I.\nTheoretical efﬁciency of the CETS with these two rotary transformers, calcu-\nlated with Eq. (3), are 0.9209 for 360°, 0.9110 for 90°, the difference is 1.07% less\nthan 5%. Simulation result and experimental results are close in value, but slightly\nlower than theoretical value. This is because the theoretical value is based on fully-\ncompensated circuits, which is hardly to achieve in reality. Taking the deviation of\ncompensation into account, the experiment result is agree with theoretical values.\nExperimental results indicate that the performance of this novel transformer is close\nto that of a conventional one’s, two transformers both have high efﬁciency. The\ndifference between two efﬁciency values is 1.47%, also less than 5%. This also\nveriﬁed the theoretical analysis in section 3. With both highﬂexibility and good\nperformance, this novel rotary transformer can well meet practical application\nrequirements in RUM.\n6 Conclusion\nThis paper presents the design and testing of a novel rotary transformer for RUM.\nThe beneﬁts brought by this rotary transformer to RUM is discussed. Circuit\nanalysis shows the efﬁciency loss caused by the structure simpliﬁcation is less\nthan 5%. The relationship among primary core angle, air gap length and coupling\ncoefﬁcient is studied. A novel rotary transformer with 90° primary core angle and\n1 mm air gap length is presented for easy disassembly. The performance this rotary\ntransformer has been conﬁrmed in both simulations and experiments, the coupling\ncoefﬁcient is 0.66 and the transmission efﬁciency is about 0.9. This rotary trans-\nformer is a better replacement of slip rings and conventional transformers in RUM\nas well as other applications where device is desired to install and remove\nfrequently.\nThe work in this paper also inspire that it is unwise to pursue an excessive\ncoupling coefﬁcient of a rotary transformer in some applications. Optimizations in\nstructure, size or weight can be achieved with just a small loss in efﬁciency, which\nare more valuable in engineering application.\nTable I. Simulation and experiment results\nSimulation Experiments\nα 90° 90° 360°\nLP/µH 523.99 540.665 1606.2\nLS/µH 419.404 397.47 856.8\nRP/Ω 0.7655 0.8011 1.3705\nRS/Ω 0.949 0.987 0.9674\nM/µH 318.77 307.52 1120.31\nk 0.68 0.66 0.95\nTransmission\nefﬁciency 0.9050 0.8972 0.9106\n© IEICE 2017\nDOI: 10.1587/elex.14.20171033\nReceived October 11, 2017\nAccepted November 7, 2017\nPublicized November 27, 2017\nCopyedited December 10, 2017\n8\nIEICE Electronics Express, Vol.14, No.23, 1–9\nAcknowledgments\nThis work was supported by the National Basic Research Program of China\n(No. 2014CB046603).\n© IEICE 2017\nDOI: 10.1587/elex.14.20171033\nReceived October 11, 2017\nAccepted November 7, 2017\nPublicized November 27, 2017\nCopyedited December 10, 2017\n9\nIEICE Electronics Express, Vol.14, No.23, 1–9",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.7316199541091919
    },
    {
      "name": "Linear variable differential transformer",
      "score": 0.5993269085884094
    },
    {
      "name": "Ultrasonic sensor",
      "score": 0.5047961473464966
    },
    {
      "name": "Engineering",
      "score": 0.49551308155059814
    },
    {
      "name": "Machining",
      "score": 0.4915500581264496
    },
    {
      "name": "Rotary variable differential transformer",
      "score": 0.4889189302921295
    },
    {
      "name": "Mechanical engineering",
      "score": 0.46126917004585266
    },
    {
      "name": "Energy efficient transformer",
      "score": 0.4465022683143616
    },
    {
      "name": "Electronic engineering",
      "score": 0.35397517681121826
    },
    {
      "name": "Isolation transformer",
      "score": 0.3200386166572571
    },
    {
      "name": "Acoustics",
      "score": 0.2598041892051697
    },
    {
      "name": "Distribution transformer",
      "score": 0.2547350227832794
    },
    {
      "name": "Electrical engineering",
      "score": 0.23934778571128845
    },
    {
      "name": "Voltage",
      "score": 0.08987623453140259
    },
    {
      "name": "Physics",
      "score": 0.061595022678375244
    }
  ]
}