{
    "title": "Temperature rise of power transformers: comments and proposals to IEC 60076-2:2011",
    "url": "https://openalex.org/W2770091688",
    "year": 2022,
    "authors": [
        {
            "id": "https://openalex.org/A5004972464",
            "name": "Zdenko Godec",
            "affiliations": [
                null,
                "Institute of Electrical Engineering"
            ]
        },
        {
            "id": "https://openalex.org/A5052151320",
            "name": "Vjenceslav Kuprešanin",
            "affiliations": [
                null,
                "Institute of Electrical Engineering"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2058375410",
        "https://openalex.org/W2319895531",
        "https://openalex.org/W4398234915",
        "https://openalex.org/W2770091688",
        "https://openalex.org/W4239027191",
        "https://openalex.org/W4238927575"
    ],
    "abstract": "Two years ago, a new, third edition of IEC 60076-2 standard was published [1]. Over a period of two years, we have had the opportunity to evaluate this new standard in practice. In the paper, it is shown that the criterion for stagnation 1K/ h + 3h is not entirely satisfying. Better criterion is 1K/3h, or extrapolation to stagnation - as given in second edition of the standard. A formula for hot-spot determination is not complete and it is suggested how to improve it. In the new standard, three formulas for winding average temperature determination are given. Based on experiments, we conclude that the best formula is the simplest one, and two additional formulas are without any benefit. According to [1], paragraph 7.11, measurement uncertainty estimates of results should be given in test reports - but only as information. No procedure for measurement uncertainty estimation is given, and measurement uncertainty is not used in decision-making. Therefore, the third edition of the standard is uncompleted and not motivating in terms of efforts to increase the quality of the measurement results. In the paper, the procedure for measurement uncertainty estimation is proposed and suggestion is given for appropriate decision making.",
    "full_text": "22\n 1 \n   \n3rd International Colloquium Transformer Research and Asset Management  \nSplit, Croatia, October 15 – 17, 2014 \n \nZdenko Godec      Vjenceslav Kuprešanin \nKončar - Electrical Engineering Institute Inc.   Končar - Electrical Engineering Institute Inc. \nzgodec@koncar-institut.hr     vkupresa@koncar-institut.hr \nTEMPERATURE RISE OF POWER TRANSFORMERS: \nCOMMENTS AND PROPOSALS TO IEC 60076-2:2011 \nSUMMARY \nTwo years ago, a new, third edition of IEC 60076 -2 standard was published [1]. Over a period of  \ntwo years, we have had the opportunity to evaluate this new standard in practice. In the paper, it is shown \nthat the criterion for stagnation 1K/ h + 3h is not entirely satisfying. Better criterion is 1K/3h, or \nextrapolation to stagnation - as given in second edition of the standard. A formula for hot -spot \ndetermination is not complete and it is suggested how to improve it. In the new standard, three formulas \nfor winding average temperature determination are given. Based on experiments, we conclude that the \nbest formula is the simplest one, and two additional  formulas are without any benefit. According to [1], \nparagraph 7.11, measurement uncertainty estimates of results sh ould be given in test reports - but only \nas information. No procedure for measurement uncertainty estimation is given, and measurement \nuncertainty is not used in decision-making. Therefore, the third edition of the standard is uncompleted and \nnot motivatin g in terms of  efforts to increase the  quality of the  measurement results. In the paper, the \nprocedure for measurement uncertainty estimation is proposed and suggestion is given for appropriate \ndecision making.   \nKey words:  Power transformers, temperature rise test, measurement uncertainty,  \ndecision-making \n1. INTRODUCTION \nA brief overview and comments on major changes in [1] is given in [2]. This paper emphasizes \nprocedure for estimation of measurement uncertainties of characteristic temperature rises of tran sformer \nparts, and proposes some improvements in the standard [1].  \n2. THE PROCEDURE FOR ESTIMATING MEASUREMENT UNCERTAINTY OF TEMPERATURE \nRISES \n2.1. Temperature rise test in short \nThe purpose of the transformer temperature rise test is to establish steady -state t emperature \nrises of transformer characteristic parts. It is performed by the short -circuit method and consists, in \nprinciple, of two steps. In the first step, transformer is heated with total losses and steady -state oil \ntemperature rise over the external c ooling medium is determined.  In the second step, transformer is \nheated with rated current to establish average winding to oil temperature gradient. Finally, the average \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\nJournal of Energy\njournal homepage: http://journalofenergy.com/\nVOLUME 63 Number 1–4 | 2014 Special Issue\n23\n2 \ntemperature rises of windings and windings hot spots over external medium are calculate d, based on the \nsimplified thermal model of transformer [1]. \nTo evaluate the uncertainty of oil and windings temperature rises, it is necessary to  pre-estimate \nthe uncertainty of measurement of losses, alternating current, temperature and winding resistances. \n2.2. Measurement uncertainty of losses  \nIn the first part  of the temperature rise test  transformer is short -circuited and heated  with total \nlosses. Losses are measured  using instrument transformers and power analyzer (PA). Standard \nuncertainties of measured total losses (sum of load losses and no-load losses) are estimated as: \n    \n22\n)()()( NLLLLtot PuPuPu   and   \n   \nNLLLL\nNLLNLLLLLL\ntot\nPP\nPuPPuPPu \n\n2\n%\n2\n%\n%\n)()()(  (1) \nPLL are previously measured load losses at rated current  and reference temperature  \n ref , and PNLL  \nare previously measured no-load losses (corrected to a sine  waveform voltage). The standard  \nuncertainties u(PLL)% and u(P NLL)% are input parameters, which should be given in load loss and no -\nload loss test reports.  Total losses should be maintained  constant during the first part of  the test  (i.e. \nmeasured and controlled) to the  moment when the rate of the change of top -oil temperature rise has \nfallen below 1 K/h and has remained there for a period of 3 h  [1]. Due to the instability of  the electrical \nsource, losses vary and arithmetic mean value  of the measured  losses in the last hour  of the first part  of \nthe test is declared  relevant. Generally, measured and regulated heating losses PHL are:   \n totHL PhP   (2) \nwhere the parameter h is not constant with no uncertainty, but varies depending on the measurement \nuncertainty of losses and uncertainty of the arithmetic mean of losses in the last hour of the first part of \nthe test:         \n2\n%\n2\n%% )()( HLHLm PuPuhu   (3) \nThus, the total (standard) uncertainty of losses )( HLPu consists of three components: \n      \n2\n%\n2\n%\n2\n%% )()()()( HLHLmtotHL PuPuPuPu   (4) \n-  %tot )(Pu      uncertainty of the input  data on the  total losses  which should heat transformer ,  \n                              according to equation (1)   \n -  %)( HLmPu   uncertainty of loss measurement estimated according to [3] \n -  %)( HLPu     uncertainty of arithmetic mean of measured losses in the last hour of the first part  \n                                    of the test:            \n%1001\n1\n)( 1\n2\n% \n\n\n\nHL\nHLHL;\nHL\nP\nPPnnPu\nn\ni\ni\n                      (5) \nn is the number of losses measurements in the last hour of the first part of the heating. \nLosses HLP  are generally equal to the sum of PLL  and PNLL, i.e. nominally is h = 1. Because of \nlimited power of the power source, HLP  is sometimes less than required, which is taken into account by \ncorrection of steady-state oil temperature rise (19). \n \n \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\n24\n3 \n2.3. Measurement uncertainty of alternating current \nIn the second part of the temperature rise test transformer is heated with rated AC current for one \nhour with the purpose to determine winding to oil temperature rise.  \nCurrent is measured using  current transformers and PA. Standard uncertainty of current   %Iu  \nis estimated according to [3]. Rated current has no measurement uncertainty. Due to the instability of the \npower source  the component of uncertainty  caused by  variation of the  current through the  last hour of \nheating should be added:  \n    \n%1001\n1\n)( 1\n2\n% \n\n\n\nI\nIImmIu\nm\ni\ni\n  (6) \nm is the number of current measurements in the last hour.  \nTotal (standard) measurement uncertainty of the current in the last hour is equal to: \n        \n2\n%\n2\n%% IuIuIu HC  (7) \n2.4. Uncertainty of temperature measurement  \nTemperatures of the transformer parts are usually measured in three ways:  \n with thermocouples (or thermo resistances) and digital thermometers,  \n with fibre optic thermometer, and  \n indirectly, by calculating the average winding temperature  based on the change of  winding \nresistance \n2.4.1. Uncertainty of temperature measurements with thermocouples \nThe most practical temperature measurement of coolant (oil, water and air) is with thermocouples \nand digital thermometer (DTM). \nCopper-constantan thermocouples (type T) for measuring the temperature in the range from    \n- 40 C to +350 °C are classified into two classes of accuracy ( TCG ) [4]:     \n 1)  0.5 ° C, or 0.004    \n                 (relevant is the higher value; for temperature range from -40 °C to +100 °C, TCG =  0.5 ° C),  \n 2)  1.0 ° C, or  0.0075 .  \nFor a relatively accurate DTM, accuracy (maximum permissible error) DTMG  is usually  1.0 °C  \n(for a period of one year and an ambient temperature in the range from 18 °C to 28°C).  \nTotal (standard) uncertainty of temperature measurements by thermocouples and DTM is: \n CDTM\n2\nTP  64,015,0\n3\n1\n3\n1)( 222GGu    (8) \n2.4.2. Uncertainty of measurement of temperature with fibre optic thermometer \nTemperature of hot spots on transformer windings are directly measured with fibre  optic \nthermometers. Since the fibre optics are made from electrical insulating material, me asurement system is \ninsensitive to the effects of electric and magnetic fields and the temperature measurements are possible \neven in the presence of high AC voltage. Usually the accuracy of fibre optic thermometers is  2 °C in the \ntemperature range from -30 °C to +230 °C. It is a direct  measurement, and the (standard) measurement \nuncertainty according to [5] is estimated as: \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\n25\n4 \n Co\nh 2,1\n3\n2)( u  (9)  \nIn addition, for measurement of winding hot-spot temperature, an indirect method is also used [1]. \nProcedure for estimation of temperature ( or temperature rise)  combined uncertainty is described  in \nChapter 2.8.1.  \n2.4.3. Measurement uncertainty of average winding temperature determined by measurement of \nwinding resistance \nIt is an indirect method for measuring average winding temperature based on the measurements \nof winding resistance by V-C method of \"cold\" winding (to which reference temperature is associated) and \nhot winding resistance at the instant of shut down [1].  The average temperature of h ot winding is \ndetermined using the change of resistance (see Chapters 2.6 and 2.7.).  \n2.5. Measurement uncertainty of oil temperature rise   \nTemperature rise of oil is not measured directly, but is calculated as a temperature difference: \n aoiloil     (10)  \noil  is measured oil temperature, and a is measured external cooling medium temperature. \nEstimation of uncertainty  of determining the  instantaneous temperature rise  is based  on the \nassumption that  the measurements of oil temperature  and external cooling medium  temperature are \nmutually independent:  \n )(2)(  uu  oil   (11) \nAccording to [1] steady -state oil temperature rise  oil  is defined as  the average temperature \nrise in the last hour. So the uncertainty of steady-state average oil temperature rise is equal to: \n  \n2\n2 )()()( \n\n\n \nL\nuuu oilA\noiloil\n   (12) \n)( oilA u  is the component of the uncertainty of the individual measurements of temperature rise in the \nlast hour of the first part of heating , and L is the number of readings in the last hour. When estimating the \nuncertainty of steady-state temperature rise, uncertainty of type B is dominant, while the second member \nin (12) can be neglected. Thus, the  uncertainty of steady -state oil temperature rise  will be equal to a \nmeasurement uncertainty of the single temperature rise  measurement (11), because L values are \ncorrelated (as they are measured with the same sensor  and the same channel of DTM ) and the \nuncertainty caused by random influences )(A Θu  can be neglected:  \n  )(2)()(  uuu  oiloil  (13)  \nNote. The new standard [1] does not provide extrapolation  for determination of accurate steady-\nstate oil temperature rise , as the old one does. The systematic error caused by criterion 1  K / h + 3 h \ndepends on the  thermal time constants of  oil and is about -1.0 K for the  thermal time constant o f \ntransformer oil not greater than three hours [ 6, 7]. If the heat run test is carried out successively for the \ntransformer with two modes of cooling  (e.g. ONAN/ONAF), and the steady -state temperature rise is \ngreater for the first mode of cooling, the error is positive about +1.0 K.  The better criterion , with smaller \nsystematic errors, will be 1 K/ 3h [6]. This systematic error will not  be taken into  account in here \nsuggested procedure, because the standardized method [1] defines the steady-state oil temperature rise \nas average value in the last hour of heating.  \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\n26\n5 \nThe uncertainty of the instantaneous value of the top-oil temperature rise is: \n      nmuu 11  o    (14) \nbecause top-oil temperature rise is calculated as:    \n  \n\n\nn\ni\ni\nm\nj\nj\nm\nj\nj\nnmm 111\n111\natato   (15)  \nm is the number of  thermometers on top of transformer tank and  cooler inlets, and n is the number of  \nthermometers to measure external cooling medium temperature.  \nSimilarly, the uncertainty of instantaneous value of the bottom-oil temperature rise is:  \n      npuu 11  b   (16) \np is the number of thermometers on cooler outlets.  \nAnd the uncertainty of instantaneous value of the average oil temperature rise is: \n         \n2\n22\nbo\nom\n  uuu   (17) \nSteady-state oil temperature rise according to [1] is calculated as the arithmetic mean of L measurements \nin the last hour of the first part of heating with  \n  PHL:      \n\n\nL\nl\nl\nL 1\n1\noil;oil   (18) \nThis applies to  all steady-state oil temperature r ises, so index “oil” can be: “o” for top -oil \ntemperature rise, “b” for bottom-oil temperature rise, and “om” for average oil temperature rise. \nTemperature rise  is then  converted to the steady -state oil  temperature rise  at nominal total \nlosses TOTP :  \n \nx\nP\nP\n\n\n\n\n\n\nHL\nTOToilroil;   (19) \nThe exponent x depends on the type of  cooling (Table 3 in [1]), and totTOT PP   but now as a \nreference value ( %,Pu 00)( %TOT  ).  \nThe total  measurement uncertainty  of oil temperature rises at a nominal  total losses  TOTP   \n( ro; , rom; , or rb; ) may be estimated with general expression: \n   \n2\n%\n2\n% )(%100)()( HL\noil\noil\nroil;T Puxuu \n\n\n\n\n\n\n \n   and  roil;\nroil;Troil;T   %100\n)()( %uu   (20) \nThe uncertainties of steady-state oil temperature rises )( oilu  are calculated with (13). \n \n \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\n27\n6 \n2.6. Measurement uncertainty of winding resistance  \nThe winding resistance is measured by DC V-C method, i.e. using two digital voltmeters (DMMs):  \n \nS\nS\nV\nVR\nI\nVR   (21) \nV is the voltage across the winding, RS is the resistance of the shunt, and VS is the voltage on the shunt.   \nMeasurement uncertainty (type B, according to [5]) of winding resistance R is estimated as: \n      \n2\n%\n2\n%\n2\n%% )()()(\n3\n1)( SSB RGVGVGRu     and   RRuRu  %100\n)()( %B\nB  (22) \nwhere %)(VG  and %)( SVG are accuracies of DMM  and %S )(RG of shunt.  \nRepeating the measurement  of winding resistance  and calculating the average of n repeated \nmeasurements can reduce the  random component of uncertainty  and enable detection of  substantial \nerrors and transient induced voltages - which can disturb the measurement [8]. \nTotal measurement uncertainty of cold (reference) winding resistance is determined as:  \n       \n2\n%A2\n%B\n2\n%A\n2\n%B%\n)()()()()( \n\n\n\nn\nRuRuRuRuRu    (23) \nWinding resistance depends on temperature. Therefore the resistance of the winding should be \nassociated with appropriate temperature . It is a ssumed that the average temperature of  the windings is  \nequal to the average  temperature of  the oil  in the transformer  in cold steady-state condition [9].  The \nuncertainty of determination of the resistance temperature consists of the  uncertainty of determining the \naverage oil temperature (25) and the uncertainty  of association (u  is e stimated to be about 0,50 °C).  \nThe average temperature of the transformer oil is equal to: \n  \n2\nbo\nom\n   (24)  \nand, consequently, uncertainty of average oil temperature is: \n  )(\n2\n1\n2\n)(\n2\n)()(\n22\n uuuu \n\n\n\n\n\n bo\nom   (25) \nThen, total uncertainty of temperature associated to winding resistance is:  \n     \n22\n)()(  uuu omR    (26) \nThis temperature uncertainty should be transformed to the uncertainty of winding resistance: \n  )()()( R\nR\nR\nR\no\no\nR \n\n uT\nRuT\nRRu     and   %100)()( % \nR\nR\nR\n\n\n\nT\nuRu  (27) \nbecause \n   R\no\no\nR \n\n  TT\nRR . (28) \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\n28\n7 \nwhere RR  is resistance at temperature R , oR  and o are reference resistance and temperature, and T \nis constant, for copper 235 K and for aluminium 225 K [1]. \nFinally, total uncertainty of winding resistance with associated temperature is:  \n     \n2\n%\n2\n%% )()()( RT RuRuRu    (29) \n2.7. Measurement uncertainty of average winding temperature rise  \nAverage temperature rise  of winding  over environment W , which manufacturer  guarantees \nand which should be less than the agreed  or standardized limit value, is obtained by adding the  steady-\nstate average oil temperature rise at nominal total losses rom;  and winding to oil temperature  rise at \nrated current rg . So, measurement uncertainty of average winding temperature rise is: \n         \n22\nrTrom;TW guuu     (30) \nwhere )( rom;T u is total measurement uncertainty of steady -state average oil temperature rise at \nnominal total losses (20) and  rT gu  is total measurement uncertainty of winding to oil temperature rise \nat rated current rI which is calculated on the basis of \n  \ny\nI\nIgg \n\n\n\n\n\nHC\nr\nr ,  (31) \nas: \n   \n2\n%\n2\n% )(%100)()( HCrT Iuyg\ngugu \n\n\n   (32) \n)(gu is measurement uncertainty of average winding to oil temperature rise: \n \n22**\n2() ( ) ( ) omug u u          (33) \nAsterisk indicates temperatures at the instant of shutdown.  \nInstantaneous average winding temperature  2 is determined by mea surement of winding \nresistance RR at the reference temperature R and winding resistance at the instant of shutdown 2R : \n   TTR\nR  R\nR\n 2\n2    (34) \nTo make estimation of measurement uncertainty easier, expression (34) can be rewritten as:   \n R\nR\n2\n2 TR\nRT    (35) \nwhere  2TT2 , and RR TT .  \n \n \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\n29\n8 \nResistances are measured by V-C method:  \n  R\ns\nRs\nR\nR\n2s\ns\ns\nRs\nR\nR\nR TV\nV\nV\nVTV\nR\nR\nV\nV\nVTV\nI\nI\nVT\nR 2\n22\n2\n2\n2    (36)  \nand \n           \n2\n%\n2\n%\n2\n%\n2\n%\n2\n%%2 )()()()()(3\n1)( R2sRs2R TuVGVGVGVGTu    (37) \nwhere G are limits of error (accuracies) of DMM, and \n %100)(%100)()( %\nR\nR\nR\nR\nR\n\n\n  T\nu\nT\nTuTu   (38) \nAbsolute measurement uncertainty of average winding temperature is then equal to \n   2\n%2\n22\n%100\n)()()(   TTuTuu   (39) \nAs the winding resistance (average temperature) can not be measured at the instant of shutdown,  \nit is measured  several times during the cooling to permit extrapolation back to the instant of shutdown.  \nTherefore, the uncertainty of average winding temperature at the instant of shutdown is greater:   \n    \n2*\n2\n2\n2\n*\n2 )()()(  exuuu   (40) \n)( *\n2exu , uncertainty of extrapolation can be determined using the output values (mean square error and \ncovariance matrix) of Levenberg -Marquardt algorithm for the best  approximation of the  measurement \npoints on selected non-linear function using the least squares fit [10].  \nWinding temperature cooling curve is approximated as: \n      W\nom2\nT\nt\neBtt\n\n   (41) \nwhere the average temperature of  the winding   t2  depends on the  time t, which is counted  from the \nmoment of shutdown.  tom  is the average oil temperature during cooling, B is an estimate  of \ntemperature rise of windings over oil at the moment of  shutdown, and TW is the thermal time constant of \nwinding to oil temperature rise. \nThe new standard [1] allows the selection of the average oil temperature cooling curves:  \n  1.  constant      At om   (42a) \n  2.  straight line          tkAt om   (42b) \n  3.  exponential curve    O\nom\nT\nt\neAt\n\n   (42c) \nwhere A is a constant, k is the difference between the average oil temperature at the beginning and at the \nend of the  winding resistance measurement  divided by the  duration of  the measurement  of winding \nresistance during cooling ([k] = K / min), and TO is the temperature time constant of oil. \n \n \n \n \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\n30\n9 \nTable I. – Results of winding cooling curves extrapolation \nType of cooling Winding Average oil temperature \ncooling curve \n*\n2 /°C  )( *\n2exu /°C WT /min )( WTu /min \nONAN \nHV \nconstant 83.99 0.10 7.40 0.23 \nstraight line 84.09 0.10 6.24 0.19 \nexponential 84.30 0.19 4.58 0.87 \nLV \nconstant 74.59 0.21 5.08 0.26 \nstraight line 74.80 0.24 4.10 0.21 \nexponential 74.86 0.38 3.90 1.0 \nONAF \nHV \nconstant 87.58 0.13 9.30 0.16 \nstraight line 87.89 0.13 7.77 0.13 \nexponential 88.06 0.20 7.07 0.56 \nLV \nconstant 82.75 0.14 7.92 0.16 \nstraight line 83.24 0.14 6.22 0.11 \nexponential 83.68 0.22 5.19 0.33 \nOFAF \nHV \nconstant 81.41 0.055 7.58 0.084 \nstraight line 81.54 0.060 6.60 0.077 \nexponential 81.41 0.11 7.60 0.89 \nLV \nconstant 67.59 0.45 4.51 0.30 \nstraight line 67.88 0.50 3.78 0.26 \nexponential 67.50 0.71 4.80 1.85 \nODAF \nHV \nconstant 83.41 0.087 14.09 0.56 \nstraight line 83.46 0.090 11.51 0.45 \nexponential 83.46 0.17 11.43 6.60 \nLV \nconstant 74.19 0.18 6.92 0.35 \nstraight line 74.38 0.20 5.42 0.27 \nexponential 74.68 0.36 3.95 1.0 \nBecause in the new  standard [1] no recommendation is given when to apply a particular  method \nof extrapolation , we have investigated the properties of three methods. Table 1 shows the  results of \napproximations using a nonlinear  least-squares method of  Levenberg-Marquardt (LabVIEW VI: \n\"Nonlinear Curve Fit\" or \"Constrained Nonlinear Fit\"). We have concluded that the first choice is a simple \nextrapolation of the exponential curve (42a). The other two methods are redundant, without any benefit.  \n2.8. Measurement uncertainty of winding hot-spot temperature rise  \n2.8.1. Indirect hot-spot winding temperature measurement  \nWinding hot spot temperature rise is calculated as [1]: \n  rro;h gH     (43) \nro;  is steady-state temperature rise  of top-oil in the last hour  of heating with total rated losses, H is \nhot-spot factor and rg is average winding to oil temperature rise at rated current. \nMeasurement uncertainty is then: \n       \n222\n)()()()( HugguHuu  rrTro;Th   (44) \n)( ro;T u is calculated  using equation (20), )( rT gu is calculated  using equation  (32), and )(Hu  is \nassumed to be 10%. Uncertainty due to different oil temperature gradients in windings gu  (relative to the \nmeasured temperature gradient in the coolers) should be added to the expression (44). Consequently the \ntotal uncertainty of winding hot spot temperature rise is: \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\n31\n10 \n       2\nghhT uuu \n2\n)()(    (45) \nFor ON.. and OD.. cooled transformers it is estimated  that the  uncertainty due to  different \ntemperature gradients of oil in the individual windings is approximately 2 K.  For OF.. cooled transformers \noil temperature  gradient in windings is greater than  the gradient  of oil temperature in coolers, and \nsystematic error is estimated to be approximately 10 K with an uncertainty of about 2 K. \n2.8.2. Direct hot-spot winding temperature measurement \nIf the temperature of the  hot-spot is measured directly with fibre optic thermometer, the hot-spot \ntemperature rise is calculated as: \n rho;ro;h      (46) \nro;  is steady-state top-oil temperature rise  in the last hour  of heating with total losses and rho; is \nhot-spot winding temperature rise over top-oil recalculated to the rated current: \n  \nz\nI\nI\n\n\n\n\n\n\nHC\nr\nhorho;     (47) \nwhere the exponent z depends on the type of  cooling (Table 3 in [1]), and ho is winding hot -spot  \ntemperature rise over top-oil measured at current IHC: \n  *\no\n*\nhho     (48) \nMeasurement uncertainty is then: \n         \n22\nrho;Tro;Th   uuu   (49) \n)( ro;T u  is calculated using equation (20), and )( rho;T u  is on the basis of (47): \n   \n2\n%\n2\n% )(%100)(\n%100)(%100)( HC\nho\nhorho;\nrho;T\nrho;\nrho;T Iuzuuu \n\n\n\n\n \n  (50) \nMeasurement uncertainty of winding hot-spot temperature rise over oil is calculated on the basis of (48):  \n   \n2\n2 )()()( \n\n\n\nm\nuuu  hho   (51) \n3. MEASUREMENT UNCERTAINTY AND DECISION MAKING \nMeasurement is a process which product is  complete measurement result  [5]. It consists of  \nmeasured value {M}, standard measurement uncertainty {u}, coverage factor k and measurement unit [M]: \n    MukMM  .  (52) \nFigure 1 shows the complete measurement result. The curve above is probability density function \ncalled Normal or Gaussian distribution . The area that  encloses the curve above and the complete \nmeasurement result is equal to the  probability that the true value of  the measured quantity  is within the \ncomplete measurement result (which is for k = 2 approximately 95%). \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\n32\n11 \n \nFigure 1. Complete measurement result and Gaussian probability density function \nMeasurement uncertainty  is: (1) U niversal and generally accepted  numeric statement about the \nquality of  the measurement  results, (2) C ondition for acceptance of  the measurement  results, (3) M ain \nlink in the chain  of traceability, and (4) Basic  parameter for making correct  and reliable scientific and \nbusiness decisions. \nDue to measurement uncertainty, decision making on  compliance of the measurement result with \nthe specifications (limits) cannot be without risk of wrong decision. Therefore decision making is based on \nstatistical tests. Statistical tests are procedures based on mathematical statistics that enable reasonable, \nobjective and measurable decisions in cases of indeterminacy. \nFigure 2 shows possible locations of complete measurement  result in regard to a specified upper \nlimit {UL}. F or example  {UL} denotes guaranteed load losses , or guaranteed limit of top -oil or winding \ntemperature rise. Between non-compliance and compliance zone is an area, wi dth 4u, called guard band  \n(grey zone). For the measurement result in this indeterminate zone neither non -compliance nor \ncompliance was demonstrated. Preferred formulations of assessment for cases shown in Figure 2 are: \na) Compatible. Measurement result marked with the letter A is compliant with the specification. It \nis likely that the  measured property is  below the upper  specification limit value  with probability greater \nthan 95% (more specifically, 97.5%). \nb) Non-compatible. Measurement re sult marked with the letter  G is not compliant  with the \nspecification. It is likely that the  measured property is above the specified limit with probability greater \nthan 95% (more precisely, 97.5%). \nc) Indeterminate. For the measurement results marked with B, C, D, E and F  on the probability \nlevel of 95% is not possible to claim that the product meets or does not meet the specification. \n \nFigure 2. Assessment of compliance with an upper limit \nMeasurement result in  grey zone can cause confusion, misunderstandings, disputes and costs. \nPractice needs  simple solutions . A binary decision rule of conformity  or non-conformity for all possible \nmeasurement outcomes is an answer . At this time widely accepted binary rule does not exist. Traditional \ndecision rules, as well as decision r ules that take into account measurement uncertainty in various ways \n[12] are used.  \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\n33\n12 \nAccording to traditional decision rule, if the measured numerical value is less than the upper limit \nvalue, the measured result is compliant, and if  not it is non -compliant (no matter how accurate \nmeasurement result is ). I n traditional  decision rule measurement uncertainty is not taken  into account . \nThe consequence is that traditional decision rule does not guarantee  acceptance of only those  products \nthat comply with the  specification, or the  rejection of only those  products that  do not comply with  the \nspecification. For example, if the measured value is equal to the limit value, there is a 50% probability that \nthe product meets  and the same  probability that does not meet specified requirement. In addition, using \ntraditional decision rule there is possibility of unacceptably large exceeding of the limit  value (letter H in \nFigure 2).This decision -making rule is called shared-risk (in [12] is used the term \" simple acceptance \nmethod\", and in [13] \"accuracy method\").  \nThe decision rules  that take into  account the measurement uncertainty  use the so-called guard \nbands in various ways [12]. These rules are motivating to reduce measurement uncertainty and increase \nthe quality of the measurement results. Reduction of uncertainty of measurement results reduces the grey \nzone, and are consistent with two of the eight major principles of quality management standard [11], that \nthe organization must constantly improve  processes (in this case  measurement) and that the decision-\nmaking should use factual approach. \nThe new standard [1] for the first time  requires that the test reports contain expanded uncertainty \n(k = 2) of characteristic temperature rise s (steady-state temperature rise  of top-oil, average winding \ntemperature rise  and hot-spot winding temperature rise ), but the procedure  for estimation of \nmeasurement uncertainty in the standard is not given. In addition, the standard notes that the uncertainty \nis listed as information only and is not used in decision-making. This means that, based on [13] traditional \ndecision-making rule is used with all its shortcomings.  \n4. CONCLUSION  \nThe paper points out an important fact that the new standard requires measurement uncertainty \nestimation for guaranteed values of temperature rise , but gives no estimation procedure. In the paper the \nprocedure for measurement uncertainty estimation is proposed and suggestion is given for appropriate \ndecision making. Also the criterion  for stagnation 1K/ h + 3h is critici zed and it is experimentally showed \nthat two formulas for winding average temperature determination are redundant. The new standard  is \nincomplete and sketchy. It is not motivating in the sense of  reduction of  measurement uncertainty  and \nincrease of measurement results quality. In  the next version  we expect  the procedure  for estimating \nmeasurement uncertainties and if the traditional method  of decision-making will be retained, at least the \ninformation of maximum permissible uncertainty of temperature-rise measurements.   \nREFERENCES \n[1] IEC 60076-2, Power transformers – Part 2: Temperature-rise for liquid-immersed transformers, \nFebruary 2011 \n[2] V. Kuprešanin, Z. Godec, I. Roketinec, „Temperature rise tests of oil-immersed power transformers \naccording to new IEC and analysis of changes, A2-05, 11. HRO CIGRE, Cavtat, 2013. (in Croatian)   \n[3] IEC/TS 60076-19, Power transformers – Part 19: Rules for the determination of uncertainties in the \nmeasurement of the losses on power transformers and reactors, March 2013 \n[4] IEC 60584-2, Thermocouples – Part 2: Tolerances, January 1982 \n[5] ISO/IEC Guide 98-3:2008, Uncertainty of measurement -- Part 3: Guide to the expression of \nuncertainty in measurement  (GUM:1995) \n[6] Z. Godec, “Determination of steady-state temperature rises of power transformers”,  \nIEE Proceedings, Vol. 124, Pt. A, No. 10, December 1987 \n[7] Z. Godec, „Steady-state temperature rise determination“, Automatika 33(1992)3-6, 129-134 \n[8] Z. Godec, „Measurement of large power transformer winding temperature by inductive voltage \ncorrection method, ETZ Archive, 11(1989)2, 63-70 \n[9] IEC 60076-1 Power transformers, Part 1: General, April 2011 \n[10] C. M. Shakarji, „Least-Squares Fitting Algorithms of the NIST Algorithm Testing System“, National \nInstitute, 1998 \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34\n34\n13 \n[11] ISO 9001: 2008, Quality management system - Requirements \n[12] JCGM 106: 2012, Evaluation of measurement data – The role of measurement uncertainty in \nconformity assessment \n[13] IEC Guide 115: 2007, Application of uncertainty of measurement to conformity assessment \nactivities in the electrotechnical sector \nZ. Godec, V. Kuprešanin, Temperature rise of power transformers: Comments and proposals to IEC 60076-2:2011, Journal of Energy, vol. 63 Number \n1–4 (2014) Special Issue, p. 22-34"
}