{
  "title": "Analysis of control-oriented wake modeling tools using lidar field results",
  "url": "https://openalex.org/W2785343939",
  "year": 2018,
  "authors": [
    {
      "id": "https://openalex.org/A2157509091",
      "name": "Jennifer Annoni",
      "affiliations": [
        "National Renewable Energy Laboratory"
      ]
    },
    {
      "id": "https://openalex.org/A2016031082",
      "name": "Paul Fleming",
      "affiliations": [
        "National Renewable Energy Laboratory"
      ]
    },
    {
      "id": "https://openalex.org/A1975725982",
      "name": "Andrew Scholbrock",
      "affiliations": [
        "National Renewable Energy Laboratory"
      ]
    },
    {
      "id": "https://openalex.org/A1975889107",
      "name": "Jason Roadman",
      "affiliations": [
        "National Renewable Energy Laboratory"
      ]
    },
    {
      "id": "https://openalex.org/A2668736810",
      "name": "Scott Dana",
      "affiliations": [
        "National Renewable Energy Laboratory"
      ]
    },
    {
      "id": "https://openalex.org/A2781533405",
      "name": "Christiane Adcock",
      "affiliations": [
        "National Renewable Energy Laboratory"
      ]
    },
    {
      "id": "https://openalex.org/A2904223449",
      "name": "Fernando Porté‐Agel",
      "affiliations": [
        "École Polytechnique Fédérale de Lausanne"
      ]
    },
    {
      "id": "https://openalex.org/A1492586334",
      "name": "Steffen Raach",
      "affiliations": [
        "University of Stuttgart"
      ]
    },
    {
      "id": "https://openalex.org/A270228109",
      "name": "Florian Haizmann",
      "affiliations": [
        "University of Stuttgart"
      ]
    },
    {
      "id": "https://openalex.org/A1971428752",
      "name": "David Schlipf",
      "affiliations": [
        "University of Stuttgart"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1993570113",
    "https://openalex.org/W2101295624",
    "https://openalex.org/W2071562292",
    "https://openalex.org/W2530065124",
    "https://openalex.org/W2735874191",
    "https://openalex.org/W1797178173",
    "https://openalex.org/W2498863475",
    "https://openalex.org/W2026385333",
    "https://openalex.org/W2619276501",
    "https://openalex.org/W2118747680",
    "https://openalex.org/W2625027545",
    "https://openalex.org/W2586057978",
    "https://openalex.org/W2100532085",
    "https://openalex.org/W2800901701",
    "https://openalex.org/W2101655826",
    "https://openalex.org/W2164594722",
    "https://openalex.org/W2157484013",
    "https://openalex.org/W2469409513",
    "https://openalex.org/W2100006423",
    "https://openalex.org/W2108466866",
    "https://openalex.org/W2019972052",
    "https://openalex.org/W2245647937",
    "https://openalex.org/W323536346",
    "https://openalex.org/W2527313034",
    "https://openalex.org/W2766713059",
    "https://openalex.org/W2313511323",
    "https://openalex.org/W1984050823",
    "https://openalex.org/W2571352016",
    "https://openalex.org/W1953022146",
    "https://openalex.org/W2316417985",
    "https://openalex.org/W2592726534",
    "https://openalex.org/W1667277804",
    "https://openalex.org/W638013682",
    "https://openalex.org/W2623370757"
  ],
  "abstract": "Abstract. The objective of this paper is to compare field data from a scanning lidar mounted on a turbine to control-oriented wind turbine wake models. The measurements were taken from the turbine nacelle looking downstream at the turbine wake. This field campaign was used to validate control-oriented tools used for wind plant control and optimization. The National Wind Technology Center in Golden, CO, conducted a demonstration of wake steering on a utility-scale turbine. In this campaign, the turbine was operated at various yaw misalignment set points, while a lidar mounted on the nacelle scanned five downstream distances. Primarily, this paper examines measurements taken at 2.35 diameters downstream of the turbine. The lidar measurements were combined with turbine data and measurements of the inflow made by a highly instrumented meteorological mast on-site. This paper presents a quantitative analysis of the lidar data compared to the control-oriented wake models used under different atmospheric conditions and turbine operation. These results show that good agreement is obtained between the lidar data and the models under these different conditions.",
  "full_text": "Wind Energ. Sci., 3, 819–831, 2018\nhttps://doi.org/10.5194/wes-3-819-2018\n© Author(s) 2018. This work is distributed under\nthe Creative Commons Attribution 4.0 License.\nAnalysis of control-oriented wake modeling tools\nusing lidar ﬁeld results\nJennifer Annoni1, Paul Fleming1, Andrew Scholbrock1, Jason Roadman1, Scott Dana1,\nChristiane Adcock1, Fernando Porte-Agel2, Steffen Raach3, Florian Haizmann3, and David Schlipf3\n1National Wind Technology Center, National Renewable Energy Laboratory, Golden, CO, 80401, USA\n2Ecole Polytechnique Federale de Lausanne (EPFL), Wind Engineering and Renewable Energy Laboratory\n(WIRE), EPFL-ENAC-IIE-WIRE, 1015 Lausanne, Switzerland\n3Stuttgart Wind Energy (SWE), University of Stuttgart, Allmandring 5B, 70569 Stuttgart, Germany\nCorrespondence: Jennifer Annoni (jennifer.annoni@nrel.gov)\nReceived: 25 January 2018 – Discussion started: 8 February 2018\nRevised: 11 September 2018 – Accepted: 29 September 2018 – Published: 1 November 2018\nAbstract. The objective of this paper is to compare ﬁeld data from a scanning lidar mounted on a turbine to\ncontrol-oriented wind turbine wake models. The measurements were taken from the turbine nacelle looking\ndownstream at the turbine wake. This ﬁeld campaign was used to validate control-oriented tools used for wind\nplant control and optimization. The National Wind Technology Center in Golden, CO, conducted a demon-\nstration of wake steering on a utility-scale turbine. In this campaign, the turbine was operated at various yaw\nmisalignment set points, while a lidar mounted on the nacelle scanned ﬁve downstream distances. Primarily, this\npaper examines measurements taken at 2.35 diameters downstream of the turbine. The lidar measurements were\ncombined with turbine data and measurements of the inﬂow made by a highly instrumented meteorological mast\non-site. This paper presents a quantitative analysis of the lidar data compared to the control-oriented wake mod-\nels used under different atmospheric conditions and turbine operation. These results show that good agreement\nis obtained between the lidar data and the models under these different conditions.\n1 Introduction\nWind plant control can be used to maximize the power pro-\nduction of a wind plant, reduce structural loads to increase\nthe lifetime of turbines in a wind plant, and better integrate\nwind energy into the energy market (Johnson and Thomas,\n2009; Boersma et al., 2017). Typically, wind turbines in a\nwind plant operate individually to maximize their own per-\nformance regardless of the impact of aerodynamic interac-\ntions on neighboring turbines. There is the potential to in-\ncrease power and reduce overall structural loads by prop-\nerly coordinating turbine control actions. Two common wind\nplant control strategies in the literature include wake steer-\ning and axial induction control. There has been a signiﬁ-\ncant amount work done on wake steering, showing that this\nmethod has the most potential to increase power production\n(Annoni et al., 2015; Gebraad et al., 2016). Wake steering\ntypically uses the yaw misalignment of the turbines to redi-\nrect the wake around downstream turbines. Various compu-\ntational ﬂuid dynamics simulations and wind tunnel experi-\nments have shown that this method can increase power with-\nout substantially increasing turbine loads (Gebraad et al.,\n2016; Fleming et al., 2014; Jiménez et al., 2010). Yaw-based\nwake steering control has also been used in optimization\nstudies of turbine layouts to improve the annual energy pro-\nduction of a wind plant (Fleming et al., 2016; Thomas et al.,\n2015; Stanley et al., 2017). Recent computational ﬂuid dy-\nnamics (CFD) studies have determined that the shape of the\nwake and atmospheric stability are signiﬁcant factors in wake\nsteering (V ollmer et al., 2016).\nControl-oriented models are essential for developing and\ndeploying wake steering strategies in wind farms. In partic-\nular, control-oriented models can be used in an open loop\nwhereby a lookup table is generated a priori and used in\nthe ﬁeld. Alternatively, due to its computational efﬁciency,\na control-oriented model can be used to perform online op-\nPublished by Copernicus Publications on behalf of the European Academy of Wind Energy e.V.\n820 J. Annoni et al.: Analysis of control-oriented models\nFigure 1. The FLORIS tool set is comprised of three main sections: (1) physics, (2) optimization, and (3) data.\ntimization with feedback to adjust to changing conditions in\nthe atmosphere or wind farm, e.g., turbine down for main-\ntenance. Lastly, control-oriented models are also useful for\nlarge-scale analysis and assessing the impact of controls and\noptimization on annual energy production. Overall, these\nmodels are critical to the success of wind farm controllers\nand, as a result, full-scale validation of these control-oriented\nmodels is essential and a high priority in this area of research.\nA full-scale demonstration of wake steering is necessary\nto understand the beneﬁts of wake steering and to validate\nthe beneﬁts predicted by simulations. Wind tunnel tests have\nbeen conducted that show encouraging results that match\nsimulation results based on wake redirection (Campagnolo\net al., 2016; Schottler et al., 2016). In addition, there are pre-\nliminary results of the beneﬁts of wake steering from an off-\nshore commercial wind plant (Fleming et al., 2017b). The\nNational Wind Technology Center also conducted a detailed\nfull-scale demonstration in which a utility-scale turbine op-\nerated at various yaw offsets while the wake was measured\nusing a scanning lidar. In this paper, the lidar data collected\nfrom this campaign are used to validate control-oriented tools\nthat are used for wind plant control. The main contributions\nof this work include a review of control-oriented models used\nfor wake steering as well as a quantitative analysis of these\nmodels with respect to full-scale lidar results. The results\nbetween the wake models and lidar data show good agree-\nment under various atmospheric and turbine operating con-\nditions, as shown in Sect. 4. This is an encouraging result that\nprovides conﬁdence in previously reported beneﬁts of wake\nsteering. The wind plant control tools, including wake mod-\nels, turbine models, and lidar models, used in wind plant con-\ntrols are introduced in Sect. 2. The ﬁeld campaign is brieﬂy\nintroduced in Sect. 3. Finally, Sect. 5 provides conclusions\nand discusses future work.\n2 Modeling\nFLORIS is deﬁned as a set of control and optimization tools\nused for wind farm control developed at the National Re-\nnewable Energy Laboratory and TU Delft; see Fig. 1. This\ntool models the turbine interactions in a wind plant and can\nbe used to perform real-time optimizations to improve wind\nplant performance and integrate SCADA data collected at\nwind plants. This section focuses on the wake models, tur-\nbine models, and the lidar module used in this paper.\n2.1 Wake model\nThe wake models available in FLORIS include the Jensen\nmodel (Jensen, 1983), the FLORIS wake model (Gebraad\net al., 2016), and the self-similar wake model with contribu-\ntions from Bastankhah and Porté-Agel (2014, 2016), Abkar\nand Porté-Agel (2015), Niayifar and Porté-Agel (2015), and\nDilip and Porté-Agel (2017). Although only these three mod-\nels are addressed, any wake model can be substituted into this\nframework. This paper also demonstrates the modular frame-\nwork for FLORIS and will address the beneﬁts of adding\ncomplexity to wake models used to characterize the aerody-\nnamic interactions between turbines.\nWind Energ. Sci., 3, 819–831, 2018 www.wind-energ-sci.net/3/819/2018/\nJ. Annoni et al.: Analysis of control-oriented models 821\n2.1.1 Jensen model\nThe Jensen model has been used for numerous studies on\nwind plant controls (Jensen, 1983; Johnson et al., 2006; Katic\net al., 1986). This model has a low computational cost due\nto its simplicity and is based on assumptions that there is a\nsteady inﬂow, linear wake expansion, and the velocity in the\nwake is uniform at a cross section downstream. The turbine\nis modeled as an actuator disk with uniform axial loading in\na steady uniform ﬂow.\nConsider the example of a turbine operating in free-stream\nvelocity, U∞. The diameter of the turbine rotor plane is de-\nnoted by Dand the turbine is assumed to be operating at an\ninduction factor, a. A cylindrical coordinate system is placed\nat the rotor hub of the ﬁrst turbine with the streamwise and\nradial distances denoted by xand r, respectively. The veloc-\nity proﬁle at a location (x,r) is computed as\nu(x,r,a) =U∞(1 −δu(x,r,a)), (1)\nwhere the velocity deﬁcit, δu, is given by\nδu=\n\n\n\n2a\n(\nD\nD+2kx\n)2\n, if r≤D+2kx\n2 .\n0, otherwise.\n(2)\nIn this model, the velocity,u, is deﬁned in the axial (x) di-\nrection and the remaining velocity components are neglected.\nThe wake is parameterized by a tuneable nondimensional\nwake decay constant, k. Typical values of krange from 0.01\nto 0.5 depending on ambient turbulence, topographical ef-\nfects, and turbine operation. For example, if the ambient tur-\nbulence is high, then the wakes within the wind farm will\nrecover faster due to the mixing of the wake. As a result, the\nkvalue will be higher, indicating that the wake will recover\nfaster. There is no standard rule for how kvaries with turbu-\nlence intensity.\nLimitations\nThe Park model can be used to compute the power produc-\ntion and velocity deﬁcit of a turbine array. This is useful in\ndetermining the operating conditions of a wind farm to maxi-\nmize power. However, it has no notion of added turbulence in\nthe downstream wake due to varying turbine operation. The\nassumptions are based on a steady inﬂow acting on an actua-\ntor disk with uniform axial loading and as noted in Frandsen\net al. (2006); the Jensen model does not conserve momen-\ntum. Despite its limitations, the Jensen model can be com-\nputed in fractions of a second and can provide some insight\ninto turbine interaction that can be used to understand the\nresults obtained from higher-ﬁdelity models. In addition, if\nuncertainty is included, the Jensen model performs well and\npredicts wake interactions well under normal operating con-\nditions.\n2.1.2 Multi-zone\nThe multi-zone model, developed in Gebraad and\nVan Wingerden (2014), is a modiﬁcation of the Jensen\nmodel described in the previous section. Modiﬁcations were\nmade to better model the wake velocity proﬁle and effects\nof partial wake overlap, especially in yawed conditions. The\nmulti-zone model deﬁnes three wake zones,q: (1) near-wake\nzone, (2) far-wake zone, and (3) mixing-wake zone. The\neffective velocity at the downstream turbine i is found by\ncombining the effects of each of the wake zones of the\nupstream turbine j:\nui =U∞\n\n1 −2\n√∑\nj\n\najσ3\nq=1cj,q\n\nXimin\n\nAoverlap\nj,i,q\nAi\n,1\n\n\n\n\n\n\n2\n\n, (3)\nwhere Xi is the xlocation of turbine i, Aoverlap\nj,i,q is the overlap\narea of a wake zone, qof a turbine iwith the rotor of turbine\nj, and ci,q(x) is a coefﬁcient that deﬁnes the recovery of a\nzone qto the free-stream conditions.\nci,q(x) =\n( Di\nDi+2kemU,q(γi)[x−Xi]\n)2\n, (4)\nwhere mU,q is deﬁned as\nmU,q(γi) = MU,q\ncos(aU +bUγi) (5)\nfor q=1,2,3 corresponding to the three wake overlap zones,\nwhere aU and bU represents tuned model parameters, Di is\nthe rotor diameter of turbine i, γi is the yaw offset of tur-\nbine i, and MU,q are tuned scaling factors that ensure that\nthe velocity in the outer zones of the wake will recover to the\nfree-stream conditions faster than the inner zone. The param-\neters of the model were tuned to match the results from high-\nﬁdelity wake simulations (Gebraad et al., 2016). The most\ninﬂuential parameter is ke because it deﬁnes both wake ex-\npansion and wake recovery. Additional details can be found\nin Gebraad et al. (2016).\nLimitations\nThe multi-zone model was developed, in comparison with\nhigh-ﬁdelity models, to characterize turbine interactions\nwhen turbines were operating in partial wake or yawed con-\nditions. The multi-zone model is a computationally inexpen-\nsive model that is suitable for control and optimization stud-\nies to improve wind plant performance. However, there are\n13 free parameters that can be tuned in this model and the\ntuning can be sensitive depending on the parameters chosen\nto tune. Like the Jensen model, this model does not have any\nsensitivity to turbulence intensity or added turbulence gener-\nated by an upstream turbine and does not explicitly conserve\nmomentum.\nwww.wind-energ-sci.net/3/819/2018/ Wind Energ. Sci., 3, 819–831, 2018\n822 J. Annoni et al.: Analysis of control-oriented models\n2.1.3 Gaussian model\nLastly, a Gaussian model is incorporated in the overall\nFLORIS wake modeling and control tools. This model was\nintroduced by several recent papers including Abkar and\nPorté-Agel (2015), Bastankhah and Porté-Agel (2014, 2016),\nNiayifar and Porté-Agel (2015), and Dilip and Porté-Agel\n(2017). This model includes a Gaussian wake to describe the\nvelocity deﬁcit, added turbulence based on turbine operation,\nand atmospheric stability.\nVelocity deﬁcit\nThe velocity deﬁcit of a wake is computed by assuming a\nGaussian wake, which is based on self-similarity theory of-\nten used in free shear ﬂows, (Pope, 2000). An analytical ex-\npression for the three-dimensional velocity deﬁcit behind a\nturbine in the far wake can be derived from the simpliﬁed\nNavier–Stokes equations as\nu(x,y,z)\nU∞\n=1 −Ce−(y−δ)2/2σ2\nye−(z−zh)2/2σ2\nz (6)\nC=1 −\n√\n1 −(σy0σz0)M0\nσyσz\nM0 =C0(2 −C0)\nC0 =1 −\n√\n1 −CT,\nwhere C is the velocity deﬁcit at the wake center, δ is the\nwake deﬂection (see Sect. 2.2), zh is the hub height of the\nturbine, σy deﬁnes the wake width in the ydirection, and σz\ndeﬁnes the wake width in the zdirection. Each of these pa-\nrameters are deﬁned with respect to turbine i; subscripts are\nexcluded for brevity. The subscript “0” refers to the initial\nvalues at the start of the far wake, which is dependent on am-\nbient turbulence intensity, I0, and the thrust coefﬁcient, CT.\nFor additional details on near-wake calculations, the reader\nis referred to Bastankhah and Porté-Agel (2016). Abkar and\nPorté-Agel (2015) demonstrate that σy and σz grow at differ-\nent rates based on lateral wake meandering (ydirection) and\nvertical wake meandering ( zdirection). The velocity distri-\nbutions σz and σy are deﬁned as\nσz\nd =kz\n(x−x0)\nd +σz0\nd , where σz0\nd =1\n2\n√ uR\nu∞+u0\n, (7)\nσy\nd =ky\n(x−x0)\nd +σy0\nd , where σy0\nd =σz0\nd cosγ, (8)\nwhere ky deﬁnes the wake expansion in the lateral direction\nand kz deﬁnes the wake expansion in the vertical direction.\nFor this study, ky and kz are set to be equal and the wake\nexpands at the same rate in the lateral and vertical directions.\nThe wakes are combined using the traditional sum of squares\nmethod (Katic et al., 1986), although alternate methods are\nproposed in Niayifar and Porté-Agel (2015).\nAtmospheric stability\nThis model also accounts for physical atmospheric quanti-\nties such as shear, veer, and changes in turbulence inten-\nsity (Abkar and Porté-Agel, 2015; Niayifar and Porté-Agel,\n2015). Shear, veer, and turbulence intensity measurements\nare typically available in ﬁeld measurements and will be used\nto characterize atmospheric stability in this particular model.\nIt should be noted that these three parameters do not sufﬁ-\nciently characterize atmospheric stability as deﬁned in Stull\n(2012). Other parameters such as vertical ﬂux and tempera-\nture proﬁles are necessary to fully capture atmospheric sta-\nbility.\nThis model is a three-dimensional wake model that in-\ncludes shear by using the power log law of wind:\nUinit\nU∞\n=\n( z\nzhub\n)αs\n, (9)\nwhere αs is the shear coefﬁcient and Uinit indicates the ini-\ntial ﬂow ﬁeld. A high shear coefﬁcient, αs >0.2, is typi-\ncally used for stable conditions and a low shear coefﬁcient,\nαs <0.2, is typically used for unstable conditions (Stull,\n2012).\nThis wake model also takes into account veer associated\nwith wind direction change across the rotor. A rotation factor\nis added to the Gaussian wake (Eq. 6) such that\nu(x,y,z)\nUinit\n=1 −Ce−(a(y−δ)2−2b(y−δ)(z−zhub)+c(z−zhub)2)\na=cos2φ\n2σ2y\n+sin2φ\n2σ2z\nb=−sin2φ\n4σ2y\n+sin2φ\n4σ2z\nc=sin2φ\n2σ2y\n+cos2φ\n2σ2z\n, (10)\nwhere φ is the amount of veer across the rotor when this\nequation represents a standard Gaussian rotation.\nLastly, turbulence intensity is accounted for in the model\nby linking ambient turbulence intensity to wake expansion.\nAn empirical relationship is provided in Niayifar and Porté-\nAgel (2015):\nky =0.38371I+0.003678, (11)\nwhere Irepresents the turbulence intensity, andka and kb are\ntuning parameters whereka =0.38371 and kb =0.003678 in\nNiayifar and Porté-Agel (2015). As stated previously,ky and\nkz will be set equal in this study.\nAdded turbulence\nThis wake model also computes added turbulence generated\nby turbine operation and ambient turbulence conditions. For\nWind Energ. Sci., 3, 819–831, 2018 www.wind-energ-sci.net/3/819/2018/\nJ. Annoni et al.: Analysis of control-oriented models 823\nexample, if a turbine is operating at a higher thrust, this will\ncause the wake to recover faster. Conversely, if a turbine is\noperating at a lower thrust, this will cause the wake to re-\ncover slower. Conventional linear ﬂow models have a single\nwake expansion parameter that does not change under var-\nious turbine operating conditions. Niayifar and Porté-Agel\n(2015) provided a model that incorporated added turbulence\ndue to turbine operation:\nI=\n√\nN∑\nj=0\n(I+\nj )2 +I2\n0 , (12)\nwhere N is the number of turbines inﬂuencing the down-\nstream turbines, I0 is the ambient turbulence intensity, and\nthe added turbulence due to turbine i, I+\ni , is computed as\nI+=Aoverlap\n(\n0.8a0.73\ni I0.35\n0 (x/Di)−0.32\n)\n, (13)\nwhere I0 is the ambient turbulence intensity and ais the ax-\nial induction factor of the turbine, which can be deﬁned in\nterms of CT based on Burton et al. (2001) and Bastankhah\nand Porté-Agel (2016):\na≈ 1\n2cos γ\n(\n1 −\n√\n1 −CT cosγ\n)\n.\nIn Niayifar and Porté-Agel (2015), the number of turbines,\nN, used to determine the added turbulence is N=1. In this\nformulation, Nis determined based on a predeﬁned distance\nto the downstream turbine rather than only including the in-\nﬂuence of one turbine. For example, this model considers\ncontributions to the added turbulence intensity from turbines\nwithin 15D. This has been shown to be beneﬁcial, especially\nwith closely spaced turbines. Studies have shown that the\nadded turbulence intensity has reached an equilibrium point\nbetween two and three turbines downstream (Chamorro and\nPorté-Agel, 2011).\nLimitations\nThis wake model is an analytical model with approximations\nmade from the steady-state Navier–Stokes equations based\non free shear ﬂows. In addition, unlike the previous two mod-\nels, this model conserves momentum. However, it relies on\na linear wake expansion model and has six tuning parame-\nters based on empirical relationships for wake expansion and\nturbulence intensity (Eqs. 11 and 13). The main beneﬁts of\nthis model come from the ties to physical measurements in\nthe ﬁeld such as shear, veer, and turbulence intensity and its\nroots in free shear ﬂow theory.\n2.2 Wake deﬂection\nThe wake models deﬁned above include wake deﬂection\nmodels that approximate the amount of lateral movement\nbased on the yaw misalignment of the turbine. Two wake de-\nﬂection models are deﬁned in the FLORIS wind plant mod-\neling and control framework and are brieﬂy described in this\nsection.\n2.2.1 Jimenez model\nAn empirical formulation was presented in Jiménez et al.\n(2010) and used in the multi-zone formulation (Gebraad\net al., 2016). When a turbine is yawed, it exerts a force on\nthe ﬂow that causes the wake to deﬂect and deform in a par-\nticular direction. The angle at the wake centerline is deﬁned\nas\nξ(x) ≈ ξ2\ninit\n1 +2kd x\nD\nξinit(a,γ) =1\n2cos2γsinγCT, (14)\nwhere ξinit is the initial skew angle from the wake centerline\nand kd is a tuneable deﬂection parameter. In Gebraad et al.\n(2016), the wake deﬂection angle is integrated to determine\nthe amount of deﬂection, δ, achieved by yaw misalignment\nin the spanwise (y) direction:\nδ(x) =\nx∫\n0\ntanξ(x)dx (15)\nδ(x) ≈\nξinit\n(\n15\n(\n2kdx\nD +1\n)4\n+ξ2\ninit\n)\n30kd\nD\n(\n2kdx\nD +1\n)5 −ξinitD\n(\n15 +ξ2\ninit\n)\n30kd\n.\nThe deﬂection, δ, is achieved by integrating a second-order\nTaylor series approximation as shown in Gebraad et al.\n(2016).\n2.2.2 Bastankhah model\nIn Bastankhah and Porté-Agel (2016), wake deﬂection due to\nthe yaw misalignment of turbines is deﬁned by performing\na budget analysis on the Reynolds-averaged Navier–Stokes\nequations. The wake deﬂection angle at the rotor is deﬁned\nby\nθ≈0.3γ\ncosγ\n(\n1 −\n√\n1 −CT cosγ\n)\n, (16)\nand the initial wake deﬂection, δ0, is deﬁned as\nδ0 =x0 tanθ, (17)\nwhere x0 is the length of the near wake as deﬁned in Bas-\ntankhah and Porté-Agel (2016). The total deﬂection of the\nwww.wind-energ-sci.net/3/819/2018/ Wind Energ. Sci., 3, 819–831, 2018\n824 J. Annoni et al.: Analysis of control-oriented models\nwake due to wake steering is deﬁned as\nδ=δ0 +θE0\n5.2\n√σy0σz0\nkykzM0\nln\n\n\n(1.6 +√M0)\n(\n1.6\n√ σyσz\nσy0σz0\n−√M0\n)\n(1.6 −√M0)\n(\n1.6\n√ σyσz\nσy0σz0\n+√M0\n)\n\n, (18)\nwhere E0 =C2\n0 −3e1/12C0 +3e1/3. Expressions for the other\nsymbols in the above equation are provided in Sect. 2.1.3.\nSee Bastankhah and Porté-Agel (2016) for details on the\nderivation.\n2.2.3 Wake asymmetry\nWake deﬂection is known to be asymmetric based on the sign\nof the yaw misalignment. In particular, positive yaw angles\nare more effective than negative yaw angles (Fleming et al.,\n2018). Previously, it was speculated that there was a rotation-\ninduced lateral offset that is caused by the interaction of the\nwake rotation with the shear layer (Gebraad et al., 2016). An\nempirical correction used to account for asymmetry is pre-\nsented in Gebraad et al. (2016).\nFleming et al. (2018) propose that there is an asymmetry in\nthe wake that can be described by counter-rotating vortices,\nturbine rotation, and shear rather than actual deﬂection. Up-\ndates to the FLORIS wake modeling framework to reﬂect the\nasymmetry will be done in future work.\n2.3 Turbine model\nIn addition to wake modeling tools, a turbine model is used\nin the wind plant tools to provide a realistic description of\nturbine interactions in a wind plant. The turbine model con-\nsists of a CP/CT table based on wind speed and constant\nblade pitch angle generated by FAST (Jonkman, 2010). The\ncoupling between CP and CT is critical in understanding the\nbeneﬁts of wind plant controls. CP and CT can also be cou-\npled using actuator disk theory, which is based on the turbine\noperation deﬁned by an axial induction factor, a:\nCP =4a(1 −a)2 (19)\nCT =4a(1 −a).\nIt is important to note that CP and CT values are used that\ncorrespond to the local conditions each turbine is operating\nin. For example, a turbine operating in a wake has a different\nCP/CT than a turbine operating in free-stream conditions.\nThe steady-state power of each turbine under yaw mis-\nalignment conditions is given by Gebraad et al. (2016):\nP =1\n2ρACP cosγpu3, (20)\nwhere pis a tuneable parameter that matches the power loss\ndue to yaw misalignment seen in simulations. In actuator disk\ntheory (Burton et al., 2001),p=3. However, based on large-\neddy simulations, the turbine power in yaw misalignment has\nbeen shown to match the output whenp=1.88 for the NREL\n5 MW. Field observations run from p=1.4 (Fleming et al.,\n2017b) to p=2.2.\n2.4 Lidar model\nFinally, in this work a lidar model has been added to the\nFLORIS wind plant tools. This lidar model is based on the\nscanning lidar at the University of Stuttgart used in this study.\nThis allows for direct comparison between lidar data col-\nlected by the scanning lidar and the wake model used. In\nparticular, the scanning lidar used in the ﬁeld campaign takes\na weighted average of nine points along the line-of-sight tra-\njectory. A lidar model is necessary to ensure this direct com-\nparison. If any of the nine points are outside of the wake, the\nweighted average may lead to a more conservative estimate\nof the ﬂow in the wake. More details on the lidar used in the\nwake steering campaign can be found in Raach et al. (2016,\n2017) and Fleming et al. (2017a).\nThe velocity computed by the scanning lidar is based on\na line-of-sight velocity. The lidar model used in the FLORIS\nframework computes the line-of-sight velocity, vLOS, in the\nsame way that the lidar model computes the line-of-sight ve-\nlocity so that each point scanned by the lidar can be com-\npared directly to points computed by the wake model. The li-\ndar computes a line-of-sight velocity for each point scanned.\nIn particular, one scan point consists of Nweights weighted\npoints that provide a robust velocity measurement at that lo-\ncation. In other words, Nweights points are used in a weighted\nsum to provide a robust velocity measurement at that scan\npoint. The velocity at a single point can be computed as\nui =\nNweights∑\nj=0\naj˜upj, (21)\nwhere aj represents the weights assigned to each point, iin-\ndicates the scan point, and u =[ui,vi,wi]T is the weighted\nsum of the measured velocity points ˜up. Typically the\nweights are assigned in a Gaussian manner.\nFurthermore, the wind vector u =[ui,vi,wi]T is pro-\njected onto the normalized laser vector point [xi,yi,zi]T\nwith a focus distance of fi =\n√\nx2\ni,I +y2\ni,I +z2\ni,I and the re-\nsulting vLOS,i is\nvlos,i =xi,I\nfi\nui,I +yi,I\nfi\nvi,I +zi,I\nfi\nwi,I. (22)\nAdditional details are provided in Raach et al. (2016). This\nmodel can be used in conjunction with the ﬁeld data to per-\nform closed-loop wind plant controls as is done in Raach\net al. (2016). In addition, future work could use the simu-\nlated vLOS computed using this lidar model to ﬁll gaps that\nare inevitably present in real-time lidar data.\nWind Energ. Sci., 3, 819–831, 2018 www.wind-energ-sci.net/3/819/2018/\nJ. Annoni et al.: Analysis of control-oriented models 825\nFigure 2. Lidar scan pattern used at the ﬁve locations downstream of the turbine.\nTable 1. Test turbine details.\nRated power (kW) 1500\nHub height (m) 80\nNominal rotor diameter (m) 77\nRated wind speed (m s−1) 14\n3 Field campaign\nA wake steering demonstration was conducted at the Na-\ntional Wind Technology Center using a utility-scale tur-\nbine. The utility-scale turbine operated at various yaw mis-\nalignment conditions and the resulting wake was continually\nrecorded by a nacelle-mounted lidar. The campaign started\nin September 2016 and concluded in April 2017. This sec-\ntion describes the turbine, the meteorological tower used to\nrecord local conditions, and the lidar system mounted on the\nnacelle of the turbine. Details were ﬁrst reported on the lidar\nﬁeld campaign in Fleming et al. (2017a). This paper expands\nthe analysis and provides a quantitative comparison between\nthe control-oriented models presented and the lidar data col-\nlected in this campaign.\n3.1 Setup of the ﬁeld campaign\nThe turbine used in this wake steering demonstration was\nthe Department of Energy (DOE) 1.5 MW GE SLE turbine\nowned by the U.S. DOE and operated by the National Re-\nnewable Energy Laboratory. Details on the turbine are pro-\nvided in Table 1.\nThe met tower is located 161 m upstream of the turbine in\nthe predominant wind direction. The met tower was instru-\nmented in accordance with IEC 61400-12-1. Table 2 lists the\ninstrumentation used on the met tower. The turbine nacelle\nTable 2. Meteorological tower instrumentation details.\nInstrument Elevations (m)\nPrecipitation 1\nWind speed 38, 55, 80, 87, 90, 92\nWind direction 38, 87\nHumidity 90\nTemperature 38, 90\nBarometric pressure 90\nwind speed and wind direction are measured, recorded, and\nsynchronized with the met tower data.\nThe lidar data are limited to a region in which the met\ntower is upstream of the turbine. The hub-height wind speed\nand wind direction measurements from the met tower are\nused to described the mean wind speed, wind direction, and\nturbulence intensity. The wind direction recorded at 38 and\n87 m on the met tower is used to compute veer.\n3.2 Lidar speciﬁcations\nThe University of Stuttgart scanning lidar system consists of\ntwo parts: (1) a WINDCUBE V1 from Leosphere and (2) a\nscanner unit developed at the University of Stuttgart. A two-\ndegrees-of-freedom mirror is used for redirecting the beam\nto any position within the physical limitations of the mirror.\nThe lidar can scan an area of 0.75D ×0.75D using up to 49\nmeasurement points and ﬁve scan distances. The scan rate\nis dependent on the number of pulses used for each mea-\nsurement position. The lidar system has been used for lidar-\nassisted control using inﬂow and wake measurements; see\nRaach et al. (2016).\nThe lidar scans a grid pattern seen in Fig. 2. The lidar is set\nto record a measurement point every 1 s and it scans ﬁve dis-\nwww.wind-energ-sci.net/3/819/2018/ Wind Energ. Sci., 3, 819–831, 2018\n826 J. Annoni et al.: Analysis of control-oriented models\nFigure 3. Lidar data at 180.95 m downstream at different turbulence intensities ranging from 2.0 % to 14.0 %. The title of each plot indicates\nthe turbulence intensity and the number of scans used to produce each time-averaged ﬁgure.\ntances from 1D to 2.8D simultaneously. Each scan consists\nof 49 points and one scan takes 48 s on average. At each mea-\nsurement point the lidar uses 10 000 laser pulses to measure\nthe line-of-sight wind speed, vLOS, described in Sect. 2.4.\nScans of similar atmospheric conditions and turbine opera-\ntion are aggregated to produce a mean or median scan.\n4 Results\nThe results presented in this section show the comparison\nbetween the wake models described in Sect. 2 and the lidar\ndata collected in the ﬁeld campaign described Sect. 3. The re-\nsults focus on comparisons of the velocity deﬁcit behind the\nturbine, the wake deﬂection achieved in yaw misalignment\nconditions, and varying atmospheric conditions.\n4.1 Data processing\nIt is important to note how the lidar data were processed for\nthis study. The lidar data were ﬁrst processed to ﬁlter out im-\nplausible data. Speciﬁcally, several methods were applied to\ncheck for hard-target measurements, ﬁlter out lidar data with\na bad carrier-to-noise ratio, and check for plausibility of the\nmeasurement data. The data are also reduced through certain\nconsiderations, including (1) periods when the met tower is\nupstream of the turbine, (2) periods when the turbine is pro-\nducing at least 100 kW, and (3) periods when the difference\nbetween the target and realized yaw misalignment is small.\nIn particular, the instruments on the met tower that are used\nto measure wind speed and direction are more reliable when\nthey are not operating in the wake of nearby turbines or in\nthe wake of their own tower due to blockage effects. We also\nchose to only include data for which the turbine is operat-\ning normally. In this case, we deﬁne that as producing more\nthan 100 kW. The turbine operation affects the wake proper-\nties and we need to ensure that we are comparing times when\nthe turbine is performing as expected. Similarly, we only in-\nclude times when the turbine yaw controller is tracking the\nspeciﬁed offset within a few degrees to make a direct com-\nparison with models.\n4.2 Atmospheric conditions\nFirst, the lidar data collected in the ﬁeld campaign were an-\nalyzed based on atmospheric conditions. In particular, tur-\nbulence intensity was examined to understand the behavior\nof each model under varying turbulence intensity conditions.\nFigure 3 shows the lidar scans at 180.95 m downstream (ap-\nproximately 2.5D downstream). The turbulence intensity was\ncomputed for each lidar scan and separated into four bins\nwith centers of 2 %, 6 %, 10 %, and 14 % with a wind speed\nof 8 m s−1. Figure 3 shows that the wake is strongest in low\nturbulence conditions and dissipates quickly in high turbu-\nlence conditions. This is consistent with previous work in-\nvestigating the effects of atmospheric conditions on wakes\n(Smalikho et al., 2013). It is important to note that each im-\nage was generated with the maximum number of scans avail-\nable after processing the data. More scans lead to a more\nrobust measurement of the wake. A statistical analysis is pre-\nsented in Fig. 4, which indicates the effects of the limited\nnumber of scans processed.\nFigure 4 shows how the control-oriented engineering mod-\nels presented in this paper compare with the lidar data. The\nvelocity deﬁcit behind the turbine was computed by averag-\ning the velocity across a “virtual” rotor and moving this ro-\ntor across the domain in the spanwise direction (shown in\nV ollmer et al., 2016). The bands indicate a 95 % conﬁdence\ninterval. A larger band indicates that fewer scans were pro-\ncessed. Each model was tuned to a subset of the lidar data,\nwhich included primarily low turbulence intensity data with\na mean turbulence intensity of approximately 5 %. The val-\nues of each of the model parameters are shown in the Ap-\npendix. It is important to note that these values are tuned for\nthe near wake due to the close proximity of the lidar scans to\nthe turbine (2.35D). Although these measurements are near\nthe turbine, the effects of turbulence intensity can still be ob-\nserved along with wake deﬂection. Tuning the models appro-\npriately with training data from this proximity, the models are\nable to perform reasonably well under varying atmospheric\nconditions and varying turbine operations even at these close\nproximities.\nThe Jensen and multi-zone wake models are shown to have\ngood agreement in low turbulence scenarios; i.e., they fall\nWind Energ. Sci., 3, 819–831, 2018 www.wind-energ-sci.net/3/819/2018/\nJ. Annoni et al.: Analysis of control-oriented models 827\nFigure 4. Velocity deﬁcit at 180.95 m downstream computed using lidar data, the Gaussian wake model, multi-zone wake model, and the\nJensen wake model under different turbulence intensity conditions.\nFigure 5. Lidar data at 180.95 m downstream at different yaw misalignments ranging from 0 to 25◦. The title of each plot indicates the yaw\nangle and the number of scans used to produce each time-averaged ﬁgure.\nwithin the conﬁdence interval. This is expected as these mod-\nels were tuned to low turbulence scenarios. However, when\ngoing to high turbulence intensity scenarios, they underpre-\ndict the velocity deﬁcit signiﬁcantly. This is because neither\nthe Jensen nor the multi-zone model has turbulence intensity\nas an input to the model. The Gaussian model, however, is\nable to capture both low and high turbulence intensity scenar-\nios; i.e., the model lies within the conﬁdence interval bands\nunder each turbulence scenario examined. This highlights\nthe fact that, even under varying atmospheric conditions, the\nGaussian model is able to accurately capture scenarios that it\nwas not explicitly tuned for. The Jensen and multi-zone mod-\nels can be retuned to ﬁt high turbulence intensity data as well.\nThose values are also indicated in the Appendix.\n4.3 Wake deﬂection\nWake deﬂection was also analyzed using the lidar data from\nthis campaign. Figure 5 shows the wake deﬂection under tur-\nbine yaw misalignment observed by the scanning lidar at\n180.95 m downstream. Under larger yaw angles, the wake\ndeﬂects and deforms as has been reported in Howland et al.\n(2016) and Fleming et al. (2017b).\nFigure 6 shows the comparison of each control-oriented\nengineering model with the lidar data when the turbine is op-\nerating with no misalignment (left) and operating with 25 ◦\nof yaw misalignment (right) at 180.95 m downstream, or ap-\nproximately 2.5D downstream. Similar to Fig. 4, a “virtual”\nrotor is used to compute the effective wind speed at several\nspanwise locations. The data used in Fig. 6 include all tur-\nbulence intensity levels with wind speeds of 7–9 m s−1 when\nthe turbine was operating with no misalignment and a yaw\nmisalignment of 25◦. The average turbulence intensity is ap-\nproximately 7 %. The data were aggregated and normalized\nover this range of wind speeds to include more scans and pro-\nvide more robust statistics. The bands indicate a 95 % conﬁ-\ndence interval.\nAgain, the Gaussian model is better able to predict the\nconditions at no misalignment (predicts velocities within the\nconﬁdence intervals) since the multi-zone and Jensen mod-\nels were both tuned to data with a lower turbulence intensity.\nWhen the turbine is operating in misaligned conditions, the\nturbine generates a cross-ﬂow velocity component that is not\ncaptured by the lidar. This is because the lidar is operating on\na rotating platform and does not reliably measure the wake on\nthe left side due to this large cross-ﬂow velocity component.\nAs a result, only lidar data from −10 to 30 m are considered\nin the misaligned conditions. Under yaw-misaligned condi-\ntions, the Jensen, multi-zone, and Gaussian models all have\ngood agreement with lidar data. In this case, the Jensen and\nmulti-zone wake models have better agreement under yawed\nconditions than under normal conditions. One potential rea-\nson for this is that the “depth” of the wake is modiﬁed by\nwww.wind-energ-sci.net/3/819/2018/ Wind Energ. Sci., 3, 819–831, 2018\n828 J. Annoni et al.: Analysis of control-oriented models\nFigure 6. Velocity deﬁcit at 180.95 m downstream computed using lidar data, the Gaussian wake model, the multi-zone wake model, and\nthe Jensen wake model under different yaw misalignment conditions.\nthe changing yaw angle; i.e., the thrust generated by the tur-\nbine is modiﬁed. This modiﬁed thrust is able to accommo-\ndate the underpredictions in the normal operating case. With\nmore data, the analysis could be split into yaw misalignment\nconditions and turbulence intensity levels.\n5 Conclusions and future work\nThis paper compared ﬁeld data from a scanning lidar mea-\nsuring the wake of a turbine in normal operating condi-\ntions and yaw-misaligned conditions with control-oriented\nmodels. Validating these control models with ﬁeld data in\na variety of conditions is a critical step to implementing\nwind farm controls in the ﬁeld. A quantitative analysis was\ndone comparing the models in the FLORIS framework to\nthese data. The data were processed to look at the effects of\nvarying turbulence intensity levels as well as different yaw-\nmisaligned conditions. The wake models used in the com-\nparison included the Jensen model, the multi-zone model,\nand the Gaussian wake mode. Future work will incorporate\nadditional wake models that may be used in the context of\nwind farm controls. The Gaussian model provided the best\nrepresentation of wake characteristics under different atmo-\nspheric conditions and different turbine operating conditions.\nGood agreement was also seen with the Jensen and multi-\nzone wake models on a smaller subset of data that matched\nthe conditions of the tuning data.\nBased on these results, this provides more conﬁdence in\nwind farm controllers designed using these models. This\nstudy provided a ﬁrst step towards validating these models\nin the ﬁeld. In particular, this study focused on the wake of\na single turbine. An increased understanding of these models\nat the wind farm level is needed to determine the potential\nperformance of wind farm control solutions in the ﬁeld.\nData availability. The underlying research was collected as part of\na project funded by the Department of Energy to investigate wake\nsteering. Please contact the corresponding author for questions re-\ngarding the data used in this paper.\nWind Energ. Sci., 3, 819–831, 2018 www.wind-energ-sci.net/3/819/2018/\nJ. Annoni et al.: Analysis of control-oriented models 829\nAppendix A: FLORIS tuning values for near-wake\nlidar comparisons\nDue to the limitations of the ﬁeld data presented in this pa-\nper, FLORIS had to be tuned to capture the near wake be-\nhind the turbine. The wake was evaluated primarily at 2.35D\n(180.95 m) downstream. These parameters were tuned for\n5 % turbulence intensity as indicated in the analysis. Below\nare the FLORIS tuning values for the near-wake lidar com-\nparisons shown in this paper.\n– Jensen wake model\n– ke =0.055\n– kd =0.17\n– For high turbulence cases ( >10 % turbulence in-\ntensity), ke =0.1.\n– Multi-zone wake model\n– ke =0.1\n– kd =0.17\n– me =−0.5,0.3,1.0\n– MU =0.47,1.28,5.5\n– aU =11.7\n– bU =0.72\n– For high turbulence cases ( >10 % turbulence in-\ntensity), ke =0.13.\n– Gaussian wake model\n– ka =0.17\n– kb =0.06\nwww.wind-energ-sci.net/3/819/2018/ Wind Energ. Sci., 3, 819–831, 2018\n830 J. Annoni et al.: Analysis of control-oriented models\nCompeting interests. The authors declare that they have no con-\nﬂict of interest.\nAcknowledgements. The Alliance for Sustainable Energy, LLC\n(Alliance) is the manager and operator of the National Renewable\nEnergy Laboratory (NREL). NREL is a national laboratory of\nthe U.S. Department of Energy, Ofﬁce of Energy Efﬁciency and\nRenewable Energy. This work was authored by the Alliance\nand supported by the U.S. Department of Energy under contract\nno. DE-AC36-08GO28308. Funding was provided by the U.S.\nDepartment of Energy Ofﬁce of Energy Efﬁciency and Renewable\nEnergy, Wind Energy Technologies Ofﬁce. The views expressed in\nthe article do not necessarily represent the views of the U.S. De-\npartment of Energy or the U.S. government. The U.S. government\nretains, and the publisher, by accepting the article for publication,\nacknowledges that the U.S. government retains a nonexclusive,\npaid-up, irrevocable, worldwide license to publish or reproduce\nthe published form of this work, or allow others to do so, for U.S.\ngovernment purposes.\nEdited by: Raúl Bayoán Cal\nReviewed by: two anonymous referees\nReferences\nAbkar, M. and Porté-Agel, F.: Inﬂuence of atmospheric stability on\nwind-turbine wakes: A large-eddy simulation study, Phys. Fluids,\n27, 035104, https://doi.org/10.1063/1.4913695, 2015.\nAnnoni, J., Gebraad, P. M., Scholbrock, A. K., Fleming,\nP. A., and Wingerden, J.-W. v.: Analysis of axial-induction-\nbased wind plant control using an engineering and a high-\norder wind plant model, Wind Energy, 19, 1135–1150,\nhttps://doi.org/10.1002/we.1891, 2016.\nBastankhah, M. and Porté-Agel, F.: A new analytical model for\nwind-turbine wakes, Renew. Energ., 70, 116–123, 2014.\nBastankhah, M. and Porté-Agel, F.: Experimental and theoretical\nstudy of wind turbine wakes in yawed conditions, J. Fluid Mech.,\n806, 506–541, 2016.\nBoersma, S., Doekemeijer, B., Gebraad, P., Fleming, P., Annoni, J.,\nScholbrock, A., Frederik, J., and van Wingerden, J.: A tutorial\non control-oriented modeling and control of wind farms, in: Pro-\nceedings of the American Control Conference (ACC), Seattle,\nUSA, 2017.\nBurton, T., Sharpe, D., Jenkins, N., and Bossanyi, E.: Wind energy\nhandbook, John Wiley & Sons, 2001.\nCampagnolo, F., Petrovi´c, V ., Bottasso, C. L., and Croce, A.: Wind\ntunnel testing of wake control strategies, in: American Control\nConference (ACC), 2016, 513–518, IEEE, 2016.\nChamorro, L. P. and Porté-Agel, F.: Turbulent ﬂow inside and above\na wind farm: a wind-tunnel study, Energies, 4, 1916–1936, 2011.\nDilip, D. and Porté-Agel, F.: Wind Turbine Wake Mit-\nigation through Blade Pitch Offset, Energies, 10, 757,\nhttps://doi.org/10.3390/en10060757, 2017.\nFleming, P. A., Ning, A., Gebraad, P. M., and Dykes, K.: Wind plant\nsystem engineering through optimization of layout and yaw con-\ntrol, Wind Energy, 19, 329–344, 2016.\nFleming, P., Annoni, J., Scholbrock, A., Quon, E., Dana, S.,\nSchreck, S., Raach, S., Haizmann, F., and Schlipf, D.: Full-Scale\nField Test of Wake Steering, Wake Conference, Visby, Sweden,\n2017a.\nFleming, P., Annoni, J., Shah, J. J., Wang, L., Ananthan, S., Zhang,\nZ., Hutchings, K., Wang, P., Chen, W., and Chen, L.: Field test\nof wake steering at an offshore wind farm, Wind Energ. Sci., 2,\n229–239, https://doi.org/10.5194/wes-2-229-2017, 2017b.\nFleming, P. A., Gebraad, P. M., Lee, S., van Wingerden, J.-W., John-\nson, K., Churchﬁeld, M., Michalakes, J., Spalart, P., and Mori-\narty, P.: Evaluating techniques for redirecting turbine wakes us-\ning SOWFA, Renew. Energ., 70, 211–218, 2014.\nFleming, P., Annoni, J., Churchﬁeld, M., Martinez-Tossas, L.\nA., Gruchalla, K., Lawson, M., and Moriarty, P.: A simula-\ntion study demonstrating the importance of large-scale trail-\ning vortices in wake steering, Wind Energ. Sci., 3, 243–255,\nhttps://doi.org/10.5194/wes-3-243-2018, 2018.\nFrandsen, S., Barthelmie, R., Pryor, S., Rathmann, O., Larsen, S.,\nHøjstrup, J., and Thøgersen, M.: Analytical modelling of wind\nspeed deﬁcit in large offshore wind farms, Wind Energy, 9, 39–\n53, 2006.\nGebraad, P., Teeuwisse, F., Wingerden, J., Fleming, P., Ruben, S.,\nMarden, J., and Pao, L.: Wind plant power optimization through\nyaw control using a parametric model for wake effects—a CFD\nsimulation study, Wind Energy, 19, 95–114, 2016.\nGebraad, P. M. and Van Wingerden, J.: A control-oriented dynamic\nmodel for wakes in wind plants, J. Phys. Conf. Ser., 524, p.\n012186, IOP Publishing, 2014.\nHowland, M. F., Bossuyt, J., Martínez-Tossas, L. A., Meyers, J., and\nMeneveau, C.: Wake structure in actuator disk models of wind\nturbines in yaw under uniform inﬂow conditions, J. Renew. Sus-\ntain. Ener., 8, 043301, https://doi.org/10.1063/1.4955091, 2016.\nJensen, N. O.: A note on wind generator interaction, Tech. Rep.\nRisø-M-2411, Risø, 1983.\nJiménez, Á., Crespo, A., and Migoya, E.: Application of a LES tech-\nnique to characterize the wake deﬂection of a wind turbine in\nyaw, Wind Energy, 13, 559–572, 2010.\nJohnson, K. E. and Thomas, N.: Wind farm control: Addressing the\naerodynamic interaction among wind turbines, American Con-\ntrol Conference, 2104–2109, 2009.\nJohnson, K. E., Pao, L. Y ., Balas, M. J., and Fingersh, L. J.: Con-\ntrol of variable-speed wind turbines: standard and adaptive tech-\nniques for maximizing energy capture, IEEE Contr. Syst. Mag.,\n26, 70–81, 2006.\nJonkman, J.: NWTC Design Codes – FAST, https://nwtc.nrel.gov/\nFAST (last access: September 2017), 2010.\nKatic, I., Højstrup, J., and Jensen, N. O.: A simple model for cluster\nefﬁciency, in: European wind energy association conference and\nexhibition, 407–410, 1986.\nNiayifar, A. and Porté-Agel, F.: A new analytical model for wind\nfarm power prediction, J. Phys. Conf. Ser., 625, p. 012039, IOP\nPublishing, 2015.\nPope, S. B.: Turbulent ﬂows, Cambridge university press, 2000.\nRaach, S., Schlipf, D., and Cheng, P. W.: Lidar-based wake tracking\nfor closed-loop wind farm control, J. Phys. Conf. Ser., 753, p.\n052009, IOP Publishing, 2016.\nRaach, S., Boersma, S., van Wingerden, J.-W., Schlipf, D., and\nCheng, P. W.: Robust lidar-based closed-loop wake redirection\nWind Energ. Sci., 3, 819–831, 2018 www.wind-energ-sci.net/3/819/2018/\nJ. Annoni et al.: Analysis of control-oriented models 831\nfor wind farm control, IFAC-PapersOnLine, 50, 4498–4503,\n2017.\nSchottler, J., Hölling, A., Peinke, J., and Hölling, M.: Wind tunnel\ntests on controllable model wind turbines in yaw, in: 34th Wind\nEnergy Symposium, vol. 1523, 2016.\nSmalikho, I., Banakh, V ., Pichugina, Y ., Brewer, W., Banta, R.,\nLundquist, J., and Kelley, N.: Lidar investigation of atmosphere\neffect on a wind turbine wake, J. Atmos. Ocean. Tech., 30, 2554–\n2570, 2013.\nStanley, A. P., Thomas, J., Ning, A., Annoni, J., Dykes, K., and\nFleming, P.: Gradient-Based Optimization of Wind Farms with\nDifferent Turbine Heights, in: 35th Wind Energy Symposium, p.\n1619, 2017.\nStull, R. B.: An introduction to boundary layer meteorology, vol. 13,\nSpringer Science & Business Media, 2012.\nThomas, J., Tingey, E., and Ning, A.: Comparison of two wake\nmodels for use in gradient-based wind farm layout optimization,\nin: Technologies for Sustainability (SusTech), 2015 IEEE Con-\nference on, 203–208, IEEE, 2015.\nV ollmer, L., Steinfeld, G., Heinemann, D., and Kühn, M.: Estimat-\ning the wake deﬂection downstream of a wind turbine in different\natmospheric stabilities: an LES study, Wind Energ. Sci., 1, 129–\n141, https://doi.org/10.5194/wes-1-129-2016, 2016.\nwww.wind-energ-sci.net/3/819/2018/ Wind Energ. Sci., 3, 819–831, 2018",
  "topic": "Nacelle",
  "concepts": [
    {
      "name": "Nacelle",
      "score": 0.9386855363845825
    },
    {
      "name": "Wake",
      "score": 0.9051832556724548
    },
    {
      "name": "Lidar",
      "score": 0.8563476800918579
    },
    {
      "name": "Turbine",
      "score": 0.8247774839401245
    },
    {
      "name": "Marine engineering",
      "score": 0.5436103343963623
    },
    {
      "name": "Environmental science",
      "score": 0.5333855748176575
    },
    {
      "name": "Inflow",
      "score": 0.5098029971122742
    },
    {
      "name": "Ram air turbine",
      "score": 0.48820072412490845
    },
    {
      "name": "Meteorology",
      "score": 0.43144500255584717
    },
    {
      "name": "Wake turbulence",
      "score": 0.4209747314453125
    },
    {
      "name": "Remote sensing",
      "score": 0.3660874366760254
    },
    {
      "name": "Aerospace engineering",
      "score": 0.3618486523628235
    },
    {
      "name": "Engineering",
      "score": 0.28541457653045654
    },
    {
      "name": "Geology",
      "score": 0.1761941909790039
    },
    {
      "name": "Physics",
      "score": 0.10551732778549194
    }
  ]
}