{
  "title": "Design and Implementation of a Transformer Vandalism Monitoring System",
  "url": "https://openalex.org/W2781565670",
  "year": 2017,
  "authors": [
    {
      "id": "https://openalex.org/A2782092237",
      "name": "Erick Kithinji Kirunguru",
      "affiliations": [
        "University of Electronic Science and Technology of China"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2070277014",
    "https://openalex.org/W2186662541",
    "https://openalex.org/W2157722939",
    "https://openalex.org/W1973747781",
    "https://openalex.org/W2187487514"
  ],
  "abstract": "Transformer vandalism is becoming an alarming issue in the whole world. Power distribution companies are incurring losses of billions of money due to transformer vandalism. This paper is going to contributes to the design and implementation of a transformer vandalism monitoring system architecture that can be used by the power companies to deter or monitor the transformers against vandals. It is going to design a monitoring system that can be able to detect the presence of a vandal near the transformer, raise the alarm and send a message/call the control room officers or security officers in designated areas for response. The paper is going to have an algorithm that will be able to show the transformer location, transformer number and the necessary authorities near the transformer. The monitoring system will be a combination of Arduino hardware with Integrated Development Environment (IDE) program, sensors, and GSM for mobile communications. In this paper, the case study will be Kenya Power Company, a state utility company that is responsible for distributing electricity to consumers, emergency electricity services and lastly retails the electricity in Kenya.",
  "full_text": null,
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.7770698070526123
    },
    {
      "name": "Electricity",
      "score": 0.6532357931137085
    },
    {
      "name": "GSM",
      "score": 0.6159066557884216
    },
    {
      "name": "ALARM",
      "score": 0.5206598043441772
    },
    {
      "name": "Engineering",
      "score": 0.4684717059135437
    },
    {
      "name": "Mains electricity",
      "score": 0.4601190388202667
    },
    {
      "name": "Computer security",
      "score": 0.4597253203392029
    },
    {
      "name": "Architecture",
      "score": 0.4596173167228699
    },
    {
      "name": "Distribution transformer",
      "score": 0.4471280872821808
    },
    {
      "name": "Telecommunications",
      "score": 0.3557475805282593
    },
    {
      "name": "Electrical engineering",
      "score": 0.353864848613739
    },
    {
      "name": "Computer science",
      "score": 0.34693747758865356
    },
    {
      "name": "Voltage",
      "score": 0.0
    },
    {
      "name": "Art",
      "score": 0.0
    },
    {
      "name": "Visual arts",
      "score": 0.0
    }
  ]
}