{
  "title": "Chinmo prevents transformer alternative splicing to maintain male sex identity",
  "url": "https://openalex.org/W2785732193",
  "year": 2018,
  "authors": [
    {
      "id": null,
      "name": "Grmai, Lydia",
      "affiliations": [
        "New York University"
      ]
    },
    {
      "id": null,
      "name": "Hudry, Bruno",
      "affiliations": [
        "Imperial College London"
      ]
    },
    {
      "id": "https://openalex.org/A4281978645",
      "name": "Miguel-Aliaga, Irene",
      "affiliations": [
        "Imperial College London"
      ]
    },
    {
      "id": null,
      "name": "Bach, Erika A.",
      "affiliations": [
        "New York University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2080446123",
    "https://openalex.org/W2137012989",
    "https://openalex.org/W2221637813",
    "https://openalex.org/W2285270887",
    "https://openalex.org/W1783727169",
    "https://openalex.org/W2046620588",
    "https://openalex.org/W2065889778",
    "https://openalex.org/W1550326631",
    "https://openalex.org/W2155896486",
    "https://openalex.org/W2135112382",
    "https://openalex.org/W2148510288",
    "https://openalex.org/W2044522020",
    "https://openalex.org/W1999265573",
    "https://openalex.org/W2157227311",
    "https://openalex.org/W1995107777",
    "https://openalex.org/W260185833",
    "https://openalex.org/W2047088551",
    "https://openalex.org/W1911980068",
    "https://openalex.org/W1913568936",
    "https://openalex.org/W1861633139",
    "https://openalex.org/W1968170811",
    "https://openalex.org/W2151911735",
    "https://openalex.org/W2136348345",
    "https://openalex.org/W2050609151",
    "https://openalex.org/W2122326316",
    "https://openalex.org/W1996332055",
    "https://openalex.org/W318338043",
    "https://openalex.org/W2397405552",
    "https://openalex.org/W2003722130",
    "https://openalex.org/W1970750123",
    "https://openalex.org/W2025626614",
    "https://openalex.org/W2136196887",
    "https://openalex.org/W1972844374",
    "https://openalex.org/W1990022233",
    "https://openalex.org/W1971463047",
    "https://openalex.org/W2520591452",
    "https://openalex.org/W2061848524",
    "https://openalex.org/W1491598325",
    "https://openalex.org/W2044283072",
    "https://openalex.org/W2102506714",
    "https://openalex.org/W2015495840",
    "https://openalex.org/W1670105114",
    "https://openalex.org/W2114692975",
    "https://openalex.org/W1532026954",
    "https://openalex.org/W2010402064",
    "https://openalex.org/W2164991328",
    "https://openalex.org/W1645378787",
    "https://openalex.org/W1982337820",
    "https://openalex.org/W2151353762",
    "https://openalex.org/W2616448381",
    "https://openalex.org/W2167507186",
    "https://openalex.org/W1975613609",
    "https://openalex.org/W1979351753",
    "https://openalex.org/W2003116605",
    "https://openalex.org/W2264140028",
    "https://openalex.org/W2002439601",
    "https://openalex.org/W2073201794",
    "https://openalex.org/W2169715586",
    "https://openalex.org/W2261008124",
    "https://openalex.org/W2076153463",
    "https://openalex.org/W2104738805",
    "https://openalex.org/W2127863733",
    "https://openalex.org/W2021892293",
    "https://openalex.org/W1991089608",
    "https://openalex.org/W1861676737",
    "https://openalex.org/W2108198617",
    "https://openalex.org/W2100540626",
    "https://openalex.org/W2081707173",
    "https://openalex.org/W2063093796",
    "https://openalex.org/W2150904790",
    "https://openalex.org/W2059368499",
    "https://openalex.org/W2122343121",
    "https://openalex.org/W2029789055",
    "https://openalex.org/W2302553327",
    "https://openalex.org/W2052112605"
  ],
  "abstract": "Reproduction in sexually dimorphic animals relies on successful gamete production, executed by the germline and aided by somatic support cells. Somatic sex identity in Drosophila is instructed by sex-specific isoforms of the DMRT1 ortholog Doublesex (Dsx). Female-specific expression of Sex-lethal (Sxl) causes alternative splicing of transformer (tra) to the female isoform traF. In turn, TraF alternatively splices dsx to the female isoform dsxF. Loss of the transcriptional repressor Chinmo in male somatic stem cells (CySCs) of the testis causes them to \"feminize\", resembling female somatic stem cells in the ovary. This somatic sex transformation causes a collapse of germline differentiation and male infertility. We demonstrate this feminization occurs by transcriptional and post-transcriptional regulation of traF. We find that chinmo-deficient CySCs upregulate tra mRNA as well as transcripts encoding tra-splice factors Virilizer (Vir) and Female lethal (2)d (Fl(2)d). traF splicing in chinmo-deficient CySCs leads to the production of DsxF at the expense of the male isoform DsxM, and both TraF and DsxF are required for CySC sex transformation. Surprisingly, CySC feminization upon loss of chinmo does not require Sxl but does require Vir and Fl(2)d. Consistent with this, we show that both Vir and Fl(2)d are required for tra alternative splicing in the female somatic gonad. Our work reveals the need for transcriptional regulation of tra in adult male stem cells and highlights a previously unobserved Sxl-independent mechanism of traF production in vivo. In sum, transcriptional control of the sex determination hierarchy by Chinmo is critical for sex maintenance in sexually dimorphic tissues and is vital in the preservation of fertility.",
  "full_text": "RESEA RCH ARTICL E\nChinmo prevents transformer alternative\nsplicing to maintain male sex identity\nLydia Grmai\n1¤\n, Bruno Hudry\n2\n, Irene Miguel-Aliaga\n2\n, Erika A. Bach\n1,3\n*\n1 Department of Biochemi stry & Molecular Pharmaco logy, New York Univers ity School of Medicine, New\nYork, New York, United States of America, 2 MRC Clinical Sciences Centre, Imperial College London,\nLondon, United Kingdom , 3 Kimmel Stem Cell Center, New York University School of Medicine, New York,\nNew York, United States of America\n¤ Current address: Departmen t of Biology, Johns Hopkins Univers ity, Baltimore, Maryland, United States of\nAmerica\n* erika.ba ch@nyu.edu\nAbstract\nReproduction in sexually dimorphic animals relies on successful gamete production, exe-\ncuted by the germline and aided by somatic support cells. Somatic sex identity in Drosophila\nis instructed by sex-specific isoforms of the DMRT1 ortholog Doublesex (Dsx). Female-spe-\ncific expression of Sex-lethal (Sxl) causes alternative splicing of transformer (tra) to the\nfemale isoform tra\nF\n. In turn, Tra\nF\nalternatively splices dsx to the female isoform dsx\nF\n. Loss\nof the transcriptional repressor Chinmo in male somatic stem cells (CySCs) of the testis\ncauses them to “feminize”, resembling female somatic stem cells in the ovary. This somatic\nsex transformation causes a collapse of germline differentiation and male infertility. We\ndemonstrate this feminizatio n occurs by transcriptional and post-transcript ional regulation of\ntra\nF\n. We find that chinmo-deficient CySCs upregulate tra mRNA as well as transcripts\nencoding tra-splice factors Virilizer (Vir) and Female lethal (2)d (Fl(2)d). tra\nF\nsplicing in\nchinmo-deficient CySCs leads to the production of Dsx\nF\nat the expense of the male isoform\nDsx\nM\n, and both Tra\nF\nand Dsx\nF\nare required for CySC sex transformation. Surprisingly,\nCySC feminization upon loss of chinmo does not require Sxl but does require Vir and Fl(2)d.\nConsistent with this, we show that both Vir and Fl(2)d are required for tra alternative splicing\nin the female somatic gonad. Our work reveals the need for transcriptional regulation of tra\nin adult male stem cells and highlights a previously unobserved Sxl-indepen dent mecha-\nnism of tra\nF\nproduction in vivo. In sum, transcriptional control of the sex determination hierar-\nchy by Chinmo is critical for sex maintenance in sexually dimorphic tissues and is vital in the\npreservation of fertility.\nAuthor summary\nSexually dimorphic adult tissues, like ovaries and testes, require continuous sex-specific\ninstruction for proper function. Establishment of female somatic sex identity in Drosoph-\nila is controlled by an alternative splicing cascade wherein Sex-lethal (Sxl) produces the\nfemale-specific protein Transformer\nF\n(Tra\nF\n). By contrast, males lack Sxl and undergo\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 1 / 27\na1111111111\na1111111111\na1111111111\na1111111111\na1111111111\nOPEN ACCESS\nCitation: Grmai L, Hudry B, Miguel-Al iaga I, Bach\nEA (2018) Chinmo prevents transforme r alternativ e\nsplicing to maintain male sex identity. PLoS Genet\n14(2): e1007203. https:// doi.org/10.1371 /journal.\npgen.100720 3\nEditor: Artyom Kopp, University of California Davis,\nUNITED STATES\nReceived: July 18, 2017\nAccepted: January 16, 2018\nPublished: February 1, 2018\nCopyright: © 2018 Grmai et al. This is an open\naccess article distributed under the terms of the\nCreative Commons Attribution License, which\npermits unrestricte d use, distribu tion, and\nreproduction in any medium, provided the original\nauthor and source are credited.\nData Availabilit y Statement: All relevant data are\nwithin the paper and its Support ing Information\nfiles.\nFunding: This work was funded by the National\nInstitute of General Medica l Sciences https://www.\nnigms.nih.go v/Pages/defaul t.aspx (R01\nGM08507 5) (EAB); the New York State Stem Cell\nScience (NYSTEM) https://stem cell.ny.gov/\n(C028132 ) (EAB); the European Research Council\nStarting Grant https:// erc.europa.eu/ funding/\nstarting-g rants (310411) (IM-A); Medical Researc h\nCouncil intramura l funding https://ww w.mrc.ac.uk/\ndefault splicing, preventing Tra\nF\nproduction. Since Tra\nF\nexpression in males causes sex\ntransformation and impairs tissue function, males must have evolved robust protection\nagainst feminization. Here, we investigate the role of a single factor, Chinmo, in protecting\nmale sex identity in the testis: loss of Chinmo in male somatic stem cells causes them to\nacquire female identity. We demonstrate that this feminization occurs through the induc-\ntion of Tra\nF\nand its downstream targets. Surprisingly, Sxl is not induced in these sex trans-\nformed cells. Instead, two other alternative splice factors, Virilizer and Female lethal (2)d,\nare enriched in chinmo-mutant somatic cells and are required for their feminization. Our\nwork demonstrates that transcriptional repression of female-biased alternative splice fac-\ntors prevents sex transformation in the somatic gonad and that tra\nF\nproduction can occur\nindependently of Sxl. Given the importance of sex maintenance in tissue homeostasis,\nsuch protective mechanisms may exist in other tissues.\nIntroduction\nSexual dimorphism, or the differences between male and female individuals in a species, is\nobserved in many organisms, including insects, reptiles, and mammals. Sex-specific tissue\ndevelopment is essential for proper gonadogenesis, and sexual dimorphism has also been\nobserved in other tissues such as brain, adipose tissue, and intestine [1–4]. While extensive liter-\nature has dissected the mechanism of sex determination in early development, recent studies\nhave demonstrated that maintenance of sex identity is also essential for adult tissue homeostasis\n[5–7]. It is therefore critical to determine the signals that both specify and maintain sex identity.\nDifferential gene expression via alternative splicing establishes the sex-specific differences\nobserved in the fruit fly Drosophila melanogaster. In flies, the sex of an organism is determined\nby its number of X chromosomes [8–10]. In XX flies, a positive autoregulatory mechanism\nactivates and maintains expression of the RNA-recognition motif (RRM) containing protein\nSex-lethal (Sxl) [11]. In female somatic cells, Sxl binds directly to a polyuridine (poly(U)) tract\nupstream of exon 2 in transformer (tra) pre-mRNA [12, 13]. This results in the skipping of\nexon 2, which contains an early stop codon, and synthesis of full-length Tra (Tra\nF\n) in females.\nIn XY flies, which lack Sxl, tra mRNA incorporates exon 2, resulting in premature translational\ntermination and a presumptive small peptide with no known function [13]. Several other fac-\ntors have been shown to act in concert with Sxl in sex-specific alternative splicing, such as Viri-\nlizer (Vir), Female lethal (2)d (Fl(2)d), and Spenito (Nito). All three proteins have an RRM\nand are required for sex-specific and non-sex-specific functions in Drosophila [14–19].\nOne of the best characterized targets of the RNA-binding protein Tra\nF\nis doublesex (dsx),\nwhich can yield one of two functional isoforms [20]. In XX flies, Tra\nF\nis required for the alterna-\ntive splicing of dsx and fruitless (fru) pre-mRNAs, generating female-specific Dsx\nF\nand prevent-\ning Fru synthesis [21, 22]. In XY flies, which lack Tra\nF\n, dsx and fru pre-mRNA undergo default\nsplicing and generate male-specific Dsx\nM\nand Fru\nM\n. The Dsx\nF\nand Dsx\nM\ntranscription factors\nregulate the majority of known sex-specific differences in gene expression and external appear-\nance in Drosophila, often by direct transcriptional regulation of critical sex-specific genes [20,\n23, 24]. Dsx\nF\nand Dsx\nM\nhave identical DNA binding sites and bind regulatory sites in many\ncommon target genes, and it is generally believed that Dsx isoform association with sex-specific\nco-factors determines whether the target gene is activated or repressed [20, 25–28].\nLoss of sex identity in sexually dimorphic tissues has profound effects on organ develop-\nment and function [1–4, 29–31]. In the gonad, sex identity is specified autonomously in both\nthe germline and the soma; somatic gonadal cells additionally send essential non-autonomous\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 2 / 27\nabout/ins titutes-units-c entres/ (IM-A); European\nMolecular Biology Organization Young Investigator\nProgramme http://www .embo.org/fund ing-awards/\nyoung-investi gators (IM-A); United Negro College\nFund/Merck Science Initiative http://www .\nhbcuinnova tion.org/my-pr oduct/uncf-m erck-\nscience-init iative/ (LG); and European Molecular\nBiology Organiza tion Long-term Fellowship http://\nwww.embo. org/funding-aw ards/fellow ships/long -\nterm-fello wships (BH). The funders had no role in\nstudy design, data collection and analysis, decision\nto publish, or preparation of the manuscript.\nCompeting interests : The authors have declared\nthat no competing interests exist.\ncues to instruct germline sex identity [29, 31–34]. Proper gonadogenesis is impeded when the\nsex identity of the germline does not match that of the soma, and such a mismatch frequently\ncauses sterility [31, 32]. Despite the importance of maintaining sex identity for tissue develop-\nment and homeostasis, regulation of canonical sex determinants at the transcriptional level\nhas remained relatively unexplored.\nIn Drosophila gonads, germline stem cells (GSCs) divide to produce daughters that ulti-\nmately differentiate into sperm and oocytes, respectively. Proper gametogenesis proceeds\nthrough the ensheathment of GSC daughters by somatic support cells that exhibit sex-specific\ndifferences. In the testis, a niche of quiescent somatic cells termed the hub supports GSCs and\nsomatic cyst stem cells (CySCs), which produce somatic support cells (Fig 1A, left). GSCs\ndivide with oriented mitosis, and daughter cells that are displaced from the niche differentiate\nthrough 4 rounds of transit-amplifying mitotic divisions. CySCs are the only mitotically active\nsomatic cells in wild type testes, and they divide to produce post-mitotic cyst cells. Two cyst\ncells ensheath a single GSC daughter and remain associated with the germ cell cluster through-\nout its transit-amplifying divisions. During somatic differentiation, cyst cells grow dramati-\ncally to accommodate the enlarging spermatogonia [35–38].\nIn the ovary, GSCs also divide to produce differentiating daughter cells that undergo 4\nmitotic divisions to give rise to 16-cell interconnected germ cysts (Fig 1A, right). The develop-\ning germ cyst is surrounded by a layer of somatic follicle cells, which are produced by follicle\nstem cells (FSCs). CySCs and FSCs require similar self-renewal signals, and both male and\nfemale somatic gonadal cells exhibit similar cellular behaviors [39–50]. However, their differ-\nentiating offspring exhibit distinct behaviors and markers: cyst cells are quiescent as they dif-\nferentiate, while follicle cells continue to cycle. Additionally, follicle cells form an epithelium to\nensheath the germline, while cyst cells grow in volume and express tight junction proteins to\nencapsulate spermatogonia [35, 37, 38, 51–53].\nSex-specific anatomical differences are achieved by differential expression of transcription\nfactors [2]. In particular, the transcription factor Chinmo is expressed in male but not female\nsomatic gonadal cells [29, 54, 55]. Chinmo contains a Broad, Tramtrack, and Bric-à-brac/Poxvi-\nrus and Zinc finger (BTB/POZ) domain and two C\n2\nH\n2\n-Zinc fingers (ZFs). Many BTB-ZF pro-\nteins in Drosophila and mammals have characterized roles as transcriptional repressors [56–58].\nHowever, while clonal loss of chinmo from imaginal tissue leads to ectopic gene expression in a\ncell-autonomous manner [54], no direct targets of Chinmo have been identified. Congruent\nwith its dimorphic expression in the somatic gonad, chinmo has no apparent requirement in fol-\nlicle cells but is essential for CySC niche occupancy [54, 55]. Chinmo is also required for the\nmaintenance of male sex identity in CySCs, as loss of chinmo from all CySCs causes them to\nlose male sex identity, express markers of ovarian follicle cells and adopt an epithelial-like orga-\nnization [29]. These data have led to a model in which single CySC clones lacking chinmo are\noutcompeted by wild type CySC neighbors, but chinmo depletion in all CySCs removes this\ncompetitive environment and leads to sex transformation [29, 54]. We have also observed that\nchinmo-mutant CySC clones that lack the JAK/STAT and EGFR pathway inhibitor Socs36E can\nform aggregates, suggesting that CySCs lacking chinmo can feminize so long as they are given a\nchance to proliferate [59]. This sex transformation was reportedly due in part to a transcrip-\ntional loss at the dsx locus, leading to a loss of Dsx\nM\n; however, sustained expression of UAS-\ndsx\nM\ncould not prevent the acquisition of female sex identity in chinmo-mutant CySCs, indicat-\ning that the molecular mechanism by which these cells feminize is still unclear [29].\nOur work supports an alternate model whereby male sex identity is maintained not by pre-\nventing transcriptional loss of dsx\nM\n, but by preventing alternative splicing of dsx pre-mRNA\ninto dsx\nF\n. Since Tra\nF\nis responsible for dsx alternative splicing in canonical sex determination,\nwe investigated a possible role for Tra\nF\nin CySC feminization upon chinmo loss. Here, we\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 3 / 27\nreport that Chinmo maintains male sexual identity by preventing the expression of the female\nsex determinant tra\nF\nthrough a two-step mechanism. We first show that Chinmo represses\nboth expression and alternative splicing of tra pre-mRNA. Next, we demonstrate that femini-\nzation of chinmo-mutant CySCs does not require Sxl. We instead find that RNA binding pro-\nteins Vir and Fl(2)d, which are necessary to alternatively splice tra\nF\nin the adult ovary, are\nimportant for the feminization of chinmo-mutant CySCs. Thus, we uncover a novel mode of\nsex maintenance involving previously unreported regulation of tra transcription and a Sxl-\nindependent mechanism of tra\nF\nsplicing in the somatic gonad.\nResults\nChinmo is expressed dimorphically in the somatic gonad and is required\nfor male identity in CySCs\nWe found dimorphic expression of Chinmo in Drosophila gonads. While Chinmo protein was\nexpressed in all cell types of the adult testis stem cell niche (Fig 1B and 1B’, arrowheads; S1I\nFig 1. Chinmo is express ed dimorphica lly in Drosophila gonads. (A) Schematic of the adult Drosophila testis (left) and ovary (right). In the testis, the niche (green)\nsuppor ts two populati ons of stem cells, germline stem cells (GSCs, dark pink) and somatic cyst stem cells (CySCs, dark blue). The GSC divides to produce\ndiffere ntiating daughter cells (light pink) that undergo four transit-am plifying division s. The CySC divides to produce cyst daughter cells (light blue) that exit the cell\ncycle and ensheath the differentiati ng GSC daughter. Cyst cells continue to ensheath the associated spermatog onial cyst during transit-am plifying divisions. In the\novary, the niche (green) supports GSCs (dark pink), which divide to give rise to differentiati ng daught ers (light pink) that undergo 4 mitotic divisions. The\ndevelop ing germline cyst is ensheathed by an epithelial layer of follicle cells (light blue). Follicle cells are proliferativ e descend ants of follicle stem cells (FSCs, dark\nblue) located in the anterior part of the ovary. (B) Chinmo (green) is present in CySCs (B’, green arrowhead ), GSCs (B’, magenta arrowhead ), and niche cells (B’, cyan\narrowhead ) in a wild type testis. (C) Chinmo is not expressed in follicle cells of a wild type ovary. Vasa (red) marks the germline and Zfh1 (blue) marks somatic cells\nin the testis and ovary. Scale bars = 10 μm.\nhttps:// doi.org/10.1371 /journal.pgen. 1007203.g001\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 4 / 27\nFig), it was not detectable in somatic cells of the adult ovary (Fig 1C; S1J Fig). We next con-\nfirmed that loss of Chinmo expression in CySCs leads to the acquisition of female identity.\nWhen chinmo was depleted in the CySC lineage by RNAi using the somatic driver tj-gal4\n(tj>chinmo\nRNAi\n; S1K Fig), expression of the male sex determinant Dsx\nM\nwas lost (Fig 2A–2C),\nand the follicle cell marker Castor (Cas), normally absent from the testis, was ectopically\nexpressed (Fig 2D–2F). In wild type testes, Fasciclin 3 (Fas3) was expressed in niche cells but\nnot in CySCs (Fig 2G). However, in tj>chinmo\nRNAi\ntestes, we observed Fas3-expressing somatic\naggregates resembling epithelial follicle cells that eventually organized at the periphery (Fig 2H\nand 2I). A marker of late-stage follicle cell maturation, Slow border cells (Slbo), was absent from\nwild type CySCs (S1A and S1B Fig) but was ectopically expressed in tj>chinmo\nRNAi\ntestes (S1C\nFig). Finally, transcripts of the Dsx\nF\ntarget Yp1 were upregulated in chinmo-deficient testes\nFig 2. Chinmo is required in CySCs for male somatic sex identity and non-autonomo usly for germline maintenanc e. (A) In a wild type testis, Dsx\nM\n(green) is\npresent in niche cells (A’, outlined with dotted green line), CySCs (A’, arrowheads) and cyst cells (A’, arrow). (B) Dsx\nM\nis not expressed in a wild type ovary (B’, arrows\nindicate early follicle cells). (C) Dsx\nM\nis lost in the CySC lineage in a tj>chinmo\nRNAi\ntestis (C’, arrows indica te early somatic cells). (D) Castor (Cas, green) is absent from\na wild type testis (D’, arrows indicate early somatic cells). (E) In a wild type ovary, Cas (green) is express ed in early follicle cells (E’, arrowhead ) and stalk cells (E’,\narrow). (F) Cas (green) is ectopica lly expressed in feminizi ng somatic cells in the testis (F’, arrows) upon loss of Chinmo . (G) Fasciclin- 3 (Fas3, green) is normally\nrestricted to niche cells in a wild type testis. (H) In a wild type ovary, Fas3 (green) is high in early follicle cells (H’, arrowhead ) and is lower in mature follicle cells (H’,\narrow). (I) Fas3 (green) is ectopically expressed upon loss of Chinmo in CySC lineage. (J) Relative fertility of tj>chinmo\nRNAi\nmales (blue bars) is decreased at 9, 16 or 23\ndays (d) post eclosion compared with control tj>+ males (white bars). tj>chin mo\nRNAi\nmales are completely sterile by 23 days post eclosion (\n\u0003\ndenotes p<0.05;\n\u0003 \u0003 \u0003\ndenotes p<0.001;\n\u0003 \u0003 \u0003 \u0003\ndenotes p<0.0001 as determine d by single-factor ANOVA). Error bars represent SEM. In A-I, Vasa (red) marks the germline and Tj (blue)\nmarks cyst cells. Scale bars = 20 μm. Time point in A-I is 7 days post-eclosion.\nhttps://doi. org/10.1371/j ournal.pge n.1007203.g002\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 5 / 27\n(S1D Fig; [20]. This sex transformation phenotype is due to loss of chinmo in the CySC lineage\nand not the niche, as depletion of chinmo specifically in niche cells produced no overt pheno-\ntype (S1E and S1F Fig; [29]).\nBecause CySCs serve a critical role in maintaining GSCs, as well as producing somatic\nsupport cells, the stem cell niche in tj>chinmo\nRNAi\ntestes frequently becomes agametic even at\nrelatively early time points after depletion (S1G and S1H Fig; [29, 60]). Based upon these\nobservations, we hypothesized that tj>chinmo\nRNAi\nmales would become sterile. To test this, we\nmated successively tj>chinmo\nRNAi\nmales to Oregon\nR\nvirgin females and scored the number of\nprogeny. Upon each of two mating rounds, tj>chinmo\nRNAi\nmales exhibited a significant reduc-\ntion in fertility (25% and 55% compared to control males, p<0.05 and p<0.001, respectively)\n(Fig 2J). By the third successive mating, tj>chinmo\nRNAi\nmales were completely sterile whereas\ncontrol males were not (p<0.0001). Taken together, our results align with previous work\nshowing that Chinmo is required in adult CySCs to preserve male sex identity [29]. Addition-\nally, we demonstrate that CySC male identity is essential for fertility.\nCySC feminization upon loss of chinmo is dependent on the female sex\ndeterminant dsx\nF\nWe next sought to determine the mechanism by which CySCs undergo feminization upon loss\nof chinmo. According to a previous report, dsx\nM\nmis-expression in chinmo-deficient CySCs\n(c587>chinmo\nRNAi\n; >dsx\nM\n) delays feminization [29], suggesting that dsx\nM\ntranscription was\nreduced in chinmo-mutant CySCs. However, at the time point when all c587>chinmo\nRNAi\ntes-\ntes contained Fas3-positive aggregates, nearly all c587>chinmo\nRNAi\n; >dsx\nM\ntestes were also\nfeminized [29], indicating a delay but not an abrogation of the phenotype. Additionally, deple-\ntion of all dsx transcripts using an RNAi transgene (dsx\nKK111266\n) targeting the common region\nof dsx\nM\nand dsx\nF\ndid not recapitulate the defect seen upon loss of chinmo [29]. These data indi-\ncate that the loss of Dsx\nM\nalone cannot fully account for the phenotype of chinmo-mutant\nCySCs. We reasoned that the loss of Dsx\nM\nprotein observed in chinmo-mutant CySCs could\nresult from alternative splicing of the dsx pre-mRNA into dsx\nF\nrather than from a transcrip-\ntional decrease at the dsx locus (Fig 3A). If this were true, we would expect to find in chinmo-\ndeficient CySCs: 1) active transcription of the dsx locus; 2) expression of alternatively-spliced\ndsx\nF\ntranscripts; and 3) expression of Dsx\nF\nprotein. To assess dsx transcription levels, we\nsurveyed 4 independently-gene rated dsx transcriptional reporters: two Gal4 knock-in report-\ners in the dsx locus (dsx-gal4; [2] and dsx-gal4\nΔ2\n; [61]), one MiMIC allele at the dsx locus\n(dsx\nMI03050-GFSTF.1\n; [62]) and one Janelia transgene containing a 2.5 kb dsx regulatory element\n(GMR40A05-gal4; [63]. We selected dsx-gal4 for further use because it was the only line that\nwas robustly expressed in both adult testes and adult ovaries and therefore accurately reflected\ndsx transcription (Fig 3B and 3C). By contrast, the other 3 lines displayed male-biased or very\nlow expression in gonads (S2A–S2F Fig). We then assessed dsx-gal4 activity as a proxy for tran-\nscription of the dsx locus upon chinmo depletion. We used a genetic approach to remove\nchinmo from the CySC lineage by analyzing testes homozygous for the chinmo\nST\nallele [29] in\nthe dsx-gal4 background. While chinmo\nST\n/CyO testes express normal levels of Chinmo, chin-\nmo\nST\n/chinmo\nST\nmales lack Chinmo in the CySC lineage [29]. As expected, GFP was expressed\nin somatic cells in control chinmo\nST\n/CyO; dsx-gal4/UAS-GFP testes and ovaries (Fig 3B and\n3C). Importantly, GFP was also expressed in chinmo\nST\n/chinmo\nST\n; dsx-gal4/UAS-GFP mutant\ntestes (Fig 3D), demonstrating that dsx is still transcribed in chinmo-deficient cyst cells. We\nalso visualized dsx transcript abundance in tj>chinmo\nRNAi\ntestes using semi-quantitative\nRT-PCR. Primers that recognize both dsx mRNA isoforms (dsx\nCOMMON\n, or dsx\nC\n) reveal that\ndsx is still present in tj>chinmo\nRNAi\ntestes (Fig 3E). We confirmed that dsx\nF\nis produced\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 6 / 27\nspecifically by chinmo-deficient somatic cells by performing RT-PCR on FACS-sorted CySCs\nand early cyst cells. As expected, a dsx\nF\n-specific band was observed in RNA extracts from wild\ntype ovaries (Fig 3F, left lane). We also observed dsx\nF\nin FACS-purified chinmo-deficient cyst\nFig 3. Dsx\nF\nprotein is synthesiz ed in chinmo-m utant CySCs. (A) Schemati c of dsx pre-mRNA splicing. dsx\nF\nand dsx\nM\nshare the first three coding exons and differ at their\nC-termini. Exon 4 contains a non-cano nical splice acceptor, and thus under default splicing conditions, exon 3 is adjoined with exon 5 to yield the male-spec ific dsx\nM\nisoform (blue). In XX somatic cells, Tra\nF\nis expressed and binds tandem Tra\nF\n-binding sites (white dashed line) in exon 4. The Tra\nF\ncomplex then recruits the spliceo some,\nleading to synthesis of the female-spec ific dsx\nF\nisoform (pink). Pink and blue stars indica te female and male stop codons, respectively. (B) A knock- in transcrip tional\nreporter for dsx (dsx-gal4) activates UAS-GF P express ion (green) in the CySC lineage of a wild type testis. (C) dsx-gal4 activates GFP expression in both escort cells (C’,\narrow) and follicle cells (C’, arrowhead s) of wild type ovary. (D) dsx-gal4 activates GFP express ion (D’, arrowheads) in the somatic lineage of a chinmo\nST\n/chinmo\nST\ntestis.\nNote that the feminized soma in this testis is organize d at the periphery, adjacent to the muscle sheath. (E) Semi-qu antitative RT-PCR on homogeni zed wild type testes\n(left lane), wild type ovaries (middle lane), and tj>chin mo\nRNAi\ntestes (right lane). As determine d by primers that recognize both dsx mRNA isoforms (dsx\nCOMMON\n, or dsx\nC\n),\ndsx transcript s are present in both wild type testes and wild type ovaries (left and middle lanes). dsx mRNA is also expressed in tj>chinmo\nRNAi\ntestes (right lane). α-tub\n(tub) was used as a loading control. Flies were aged 9–20 days prior to dissection. (F) Semi-qua ntitative RT-PCR on RNA extracts from FACS- purified cyst cells from\ncontrol tj>+ or tj>chinmo\nRNAi\ntestes. Whole adult ovaries from yw females (labeled “WT ovary”) were homogeni zed as a positive control for dsx\nF\nmRNA detection. dsx\nF\nis\ndetected in wild type ovaries (left lane) and in tj>chinmo\nRNAi\ncyst cells (right lane) but not in tj>+ cyst cells (middle lane). β-tubulin (tub) was used as a loading control.\n(G,H) Dsx (green), as detected by the Dsx\nC\nantibody that recognizes both Dsx\nF\nand Dsx\nM\n, is present in somatic cells of a wild type testis (G) and a tj>chinmo\nRNAi\ntestis\n(H). Tj (magenta) marks cyst cells. In B-D, Vasa (red) marks germ cells and Tj (blue) marks cyst cells. Scale bars = 20 μm.\nhttps://do i.org/10.1371/j ournal.pge n.1007203.g00 3\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 7 / 27\ncells (Fig 3F, right lane). As expected, dsx\nF\nwas absent from FACS-purified wild type cyst cells\n(Fig 3F, middle lane).\nWe next visualized Dsx protein in control tj>+ and tj>chinmo\nRNAi\ntestes using an antibody\nthat detects both isoforms of Dsx (anti-Dsx\nC\n; [64]). We observed that Dsx protein is still syn-\nthesized in somatic cells lacking chinmo (Fig 3G and 3H); because Dsx\nM\nis lost from tj>chin-\nmo\nRNAi\ntestes (Fig 2C), we conclude that the Dsx protein present in chinmo-deficient somatic\ncells is Dsx\nF\n. We confirmed that anti-Dsx\nC\ndetects Dsx\nF\nby staining tj>dsx\nF\novaries (S3 Fig).\nThese results suggest that Dsx\nM\nloss in chinmo-deficient CySCs is not due to transcriptional\nloss of dsx\nM\n, but rather alternative splicing that generates the female isoform Dsx\nF\n.\nWe next tested whether Dsx\nF\nproduction is causal to feminization of CySCs lacking chinmo.\nWe took a genetic approach and blocked dsx\nF\nsplicing by using mutant alleles dsx\nD\n/dsx\n1\n. dsx\nD\ncannot be alternatively spliced into dsx\nF\nbut produces normal levels of dsx\nM\n, and dsx\n1\nis a null\nallele. dsx\nD\n/dsx\n1\nflies only produce Dsx\nM\n. XX dsx\nD\n/dsx\n1\nanimals develop male abdominal pig-\nmentation, genitalia, and sex combs due to a masculinized soma (S4A–S4D Fig; [65]). We\nintroduced dsx\nD\n/dsx\n1\ninto males homozygous for the chinmo\nST\nallele [29]. As expected, control\nchinmo\nST\n/CyO; dsx\nD\n/dsx\n1\nsibling testes appeared normal (Fig 4A; Fig 4D, second bar; S1\nTable). By contrast, 100% of chinmo\nST\n/chinmo\nST\n; TM2/TM6B testes at 7 days post-eclosion\ncontained Fas3-positive somatic aggregates outside the hub (Fig 4B; Fig 4D, first bar; S1\nTable). Strikingly, only 57% of chinmo\nST\n/chinmo\nST\n; dsx\nD\n/dsx\n1\ntestes contained Fas3-positive\naggregates (Fig 4C; Fig 4D, purple bar; S1 Table), a significant reduction compared to chin-\nmo\nST\n/chinmo\nST\nflies (p<0.001). Taken together, our results reveal that (1) acquisition of female\nidentity in chinmo-mutant CySCs occurs by dsx alternative splicing that generates Dsx\nF\nand\n(2) dsx\nF\nproduction is required in part for CySC feminization upon loss of chinmo.\nTra\nF\nis required for feminization in CySCs lacking chinmo\nGiven that Dsx\nF\nis produced in chinmo-deficient CySCs, these cells must also express a factor\nthat promotes alternative splicing of dsx pre-mRNA. In female somatic cells, this alternative\nsplicing is mediated by Tra\nF\n[22]. We hypothesized that tj>chinmo\nRNAi\ntestes express ectopic\nTra\nF\nthat produces dsx\nF\n. To test this, we performed semi-quantitative (Fig 5A) and quantitative\nRT-PCR (Fig 5B and 5C) analysis on the tra locus in tj>chinmo\nRNAi\ntestes. We found that total\ntra mRNA abundance significantly increased (3.6-fold) in tj>chinmo\nRNAi\ntestes compared\nwith tj>+ testes (p<0.05) (Fig 5A, blue arrowhead; Fig 5B, compare blue to white bar). Fur-\nthermore, tra\nF\n-specific primers revealed a 6.1-fold enrichment of tra\nF\nmRNA in tj>chinmo\nR-\nNAi\ntestes compared to tj>+ controls (p<0.001) (Fig 5A, red arrowhead; Fig 5C, compare blue\nto white bar). These data demonstrate that the ectopic tra in chinmo-deficient CySCs is indeed\nspliced into the female tra\nF\nisoform.\nTo confirm these results, we monitored tra alternative splicing in vivo using a transgene\nthat yields GFP expression when tra pre-mRNA is alternatively spliced (UAS-traF\nΔ\nT2AGFP).\nIn this transgene, the third exon of tra (which is adjoined with exon 1 in the female isoform) is\nreplaced by the coding sequences for self-cleaving T2A peptide and GFP (S5 Fig). As expected,\nwe detected little to no GFP expression in wild type (male) cyst cells (Fig 5D), while wild type\n(female) follicle cells expressed high levels (Fig 5E’, arrowheads). Notably, we also observed\nhigh levels of GFP in the soma of tj>chinmo\nRNAi\ntestes (Fig 5F’, arrowheads), demonstrating\nthat tra pre-mRNA is alternatively spliced to tra\nF\nin these feminized somatic cells. We con-\nclude that Chinmo normally represses tra transcription and alternative splicing in the male\nsomatic gonad.\nTo determine if ectopic Chinmo is sufficient to repress tra transcription, we mis-expressed\nit in adult ovarian follicle cells using tj-gal4. To evade lethality caused by Chinmo mis-\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 8 / 27\nexpression [54], we used a temperature-sensitive gal80 allele (tj-gal4, tub-gal80\nTS\nor tj\nTS\n) and\nreared flies at the permissive temperature (18˚C). Adult F1 females were then shifted to the\nrestrictive temperature (29˚C) for 5 days before ovaries were homogenized. We observed a\n2.2-fold decrease in total tra mRNA abundance (p<0.001) and a 1.8-fold decrease in tra\nF\nFig 4. Dsx\nF\nis required for feminizatio n in chinmo-m utant CySCs. (A-C) Representa tive confocal images of testes\nfrom chinmo\nST\n/chinmo\nST\n; dsx\nD\n/dsx\n1\nflies. In a testis from a chinmo\nST/\nCyO; dsx\nD\n/dsx\n1\nsibling male, only niche cells\nexpress Fas3 (A’). By contrast, in a chinmo\nST\n/chinmo\nST\ntestis most of the somatic lineage is positive for Fas3 (B’). In a\ntestis from a “rescue d” chinmo\nST\n/chinmo\nST\n; dsx\nD\n/dsx\n1\nmale, Fas3 is again restricted to niche cells (C’). Results are\nquantified in Fig 4D and S1 Table. Vasa (red) marks germ cells and Tj (blue) marks cyst cells. Scale bars = 20 μm.(D)\nQuantifi cation of Fas3-positi ve aggregates as a readout of feminizati on. 100% of chinmo\nST\n/chinmo\nST\n; TM2/TM6B testes\ncontain Fas3-positi ve aggregates (dark blue bar) at 7 days post-ec losion. By contrast, none of the testes from chinmo\nST\n/\nCyO; dsx\nD\n/dsx\n1\nsibling males contain aggregates (second bar). There is a significant reduction in the percentage of\ntestes from chinmo\nST\n/chinmo\nST\n; dsx\nD\n/dsx\n1\n(purple bar) or chinmo\nST\n/chinmo\nST\n; tra\n1\n/Df(3L)st- j7 (green bar) containing\nFas3-pos itive aggregates, indicating a partial rescue of the feminizati on. However, testes from the various sibling\ncontrols are still feminized (light blue and yellow bars). Sample sizes are indicated within bars.\n\u0003 \u0003 \u0003\ndenotes p<0.001\nand\n\u0003 \u0003 \u0003 \u0003\ndenotes p<0.0001 as determined by two-tailed Student ’s t-test (for qRT-PC R, compared with tj>+ controls)\nor Fisher’s Exact Test (for quantificati ons, compared with chinmo\nST\n/chinmo\nST\n). n.s. means not significant. See S1 Table\nfor percentage values.\nhttps://d oi.org/10.1371/j ournal.pge n.1007203.g0 04\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 9 / 27\nFig 5. The female sex determinant Tra\nF\nis require d for feminiza tion of chinmo-m utant CySCs. (A) Semi-qu antitative RT-PCR of total tra and tra\nF\nmRNA in control\ntj>+ testes (first lane), control tj>+ ovaries (second lane) and tj>chinmo\nRNAi\ntestes (third lane). All three samples contain a band for total tra (first row, blue arrowhead ).\nHowever, a tra\nF\nband is detected in ovaries, as expected, and in tj>chinmo\nRNAi\ntestes (second row, red arrowhead ) but not in control tj>+ testes. rpl15 was used as a\nloading control (third row). Flies were aged 9–20 days prior to dissection. (B-C) qRT-PCR of total tra (B) or tra\nF\n(C) in control tj>+ testes (white bars), control tj>+\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 10 / 27\nabundance (p<0.001) in tj\nTS\n>chinmo ovaries compared with tj\nTS\n>+ ovaries (S6A Fig). dsx\nF\nwas also decreased 5.8-fold (p<0.001) in tj\nTS\n>chinmo ovaries compared with tj\nTS\n>+ ovaries,\npresumably as a result of reduced Tra\nF\n(S6A Fig). Taken together, our results demonstrate that\nChinmo is both necessary and sufficient to prevent somatic expression of the female sex deter-\nminants tra\nF\nand dsx\nF\n.\nThese findings suggest that sex transformation in chinmo-deficient cyst cells is due to\nectopic Tra\nF\n. To test this, we concomitantly depleted both tra and chinmo in the somatic line-\nage of the testis. Whereas 98% of tj>chinmo\nRNAi\ntestes contained Fas3-positive aggregates out-\nside of the niche, only 48% of tj>tra\nRNAi\n; chinmo\nRNAi\ntestes had such aggregates, indicating a\nsignificant block in feminization (p<0.0001) (Fig 5I; Fig 5J, purple bar; S1 Table). In these res-\ncued tj>tra\nRNAi\n; chinmo\nRNAi\ntestes, CySCs no longer expressed Fas3, and the germline\nappeared normal (Fig 5I). We also performed epistatic experiments with tra mutant alleles,\nsimilar to the dsx\nD\n/dsx\n1\nexperiment. XX tra\n1\n/Df(3L)st-j7 animals develop male somatic struc-\ntures due to loss of Tra\nF\n(S4E–S4H Fig; [66]). Whereas 100% of chinmo\nST\n/chinmo\nST\ntestes were\nfeminized as assessed by Fas3-positive aggregates, only 61% of chinmo\nST\n/chinmo\nST\n; tra\n1\n/Df(3L)\nst-j7 testes were feminized (p<0.001) (Fig 4D, green bar; S1 Table). The phenotype was not\nsensitive to tra dose as chinmo\nST\n/chinmo\nST\n; tra/+ testes were still feminized (Fig 4D, yellow\nbars; S1 Table). These results demonstrate that Chinmo prevents both tra transcription and\nalternative splicing in CySCs and that feminization of male somatic cells in the absence of\nchinmo is due to ectopic tra\nF\n.\nEctopic Tra\nF\nimpairs somatic differentiation but is not sufficient for CySC\nfeminization\nGlobal expression of Tra\nF\nin XY flies during development causes female somatic differentia-\ntion [67]. To test whether Tra\nF\nexpression alone is sufficient to cause male-to-female sex trans-\nformation in adult CySCs, we over-expressed tra\nF\ncDNA in tj-gal4 expressing cells and used\ngal80\nTS\nto restrict expression to only adult CySCs (tj\nTS\n). While we observed accumulation of\nsomatic aggregates in tj\nTS\n>tra\nF\ntestes, they did not express Fas3 or Cas, in contrast to those in\ntj>chinmo\nRNAi\ntestes (compare Fig 5K and 5L to Fig 2I for Fas3 and compare Fig 5N and 5O\nto Fig 2F for Cas). These data suggest that tra\nF\n-misexpressing cyst cells have not fully acquired\na follicle-like fate. However, we found on average 121.0±8.8 somatic cells expressing Zinc fin-\nger homeodomain 1 (Zfh1), which marks CySCs and their earliest differentiating daughters\n[68], in tj\nTS\n>tra\nF\ntestes compared with 40.1±1.6 cells in control tj\nTS\n>+ testes (p<0.0001) (S7A,\nS7B and S7I Fig). Upon somatic tra\nF\nmis-expression, we also observed accumulation of\novaries (gray bars) and tj>chinmo\nRNAi\ntestes (blue bars). There is significantly more total tra mRNA (B) and tra\nF\n(C) in tj>chinmo\nRNAi\ntestes compared to control tj>+\ntestes. Values represent the average of three biological replicates.\n\u0003\ndenotes p<0.05;\n\u0003 \u0003 \u0003\ndenotes p<0.001 as determined by two-tailed Student’s t-test (compared with tj>+\ntestes). Error bars represent SEM. Flies were aged 9–20 days prior to dissection. (D-F) GFP caused by alternative splicing of traF\nΔ\nT2AGFP pre-mRNA is not observed in\ncontrol tj>traF\nΔ\nT2AGFP testes (D’). By contrast, GFP indicative of tra\nF\nsplicing is robustly observed in follicle cells of a control tj>traF\nΔ\nT2AGFP ovary (E’, arrowheads)\nand in somatic cells of a tj>traF\nΔ\nT2AGFP; chinmo\nRNAi\ntestis (F’, arrowheads). Tj (blue) marks somatic cells. Fas3 (red) marks hub cells in wild type testes, follicle cells in\nwild type ovaries and feminized cyst cells in tj>chinmo\nRNAi\ntestes. (G-I) In a control tj>+ testis, only niche cells express Fas3 (G’). By contrast, in a tj>chinmo\nRNAi\ntestis,\nmost of the somatic lineage is positive for Fas3 (H’). In a “rescued” tj>tra\nRNAi\n; chinmo\nRNAi\ntestis, Fas3 is again restricted to niche cells (I’). Vasa (red) marks germ cells, Tj\n(blue) marks cyst cells, and Fas3 (green) marks niche cells and feminizi ng somatic cells. Results are quantified in Fig 4J and S1 Table. (J) Quantificati on of CySC\nfeminizati on in tj>GFP; chinmo\nRNAi\ntestes and various genotyp es. 100% of tj>GFP; chinmo\nRNAi\ntestes contain Fas3-positi ve aggregates (dark blue bar). There is a\nsignifican t reduction in the percentage of feminized testes when tra is concomitan tly depleted from tj>chinmo\nRNAi\ntestes (purple bar). There is also a significan t reduction\nwhen vir or fl(2)d is depleted from tj>chinmo\nRNAi\ntestes (green and yellow bars, respectively). However, there is no rescue of male sex identity in tj>chinmo\nRNAi\ntestes\nwhen Sxl\n,\nor nito is concomitan tly depleted (light blue and red bars, respective ly). Sample sizes are indicated within bars.\n\u0003 \u0003 \u0003\ndenotes p<0.001;\n\u0003 \u0003 \u0003 \u0003\ndenotes p<0.0001 as\ndetermine d by Fisher’s Exact Test (for rescue quantificati ons, compared with tj>GFP; chinmo\nRNAi\n). n.s. means not significant . See S1 Table for percentag e values. (K-M)\nFas3 is not ectopically express ed in CySCs from control (tj\nTS\n>+) testes (K’), testes with somatic mis-expres sion of tra\nF\n(tj\nTS\n>tra\nF\n) (L’), or testes with somatic mis-\nexpression of fl(2)d (tj\nTS\n>fl(2)d) (M’). (N-P) Cas is not expressed in control (tj\nTS\n>+) (N’), tj\nTS\n>tra\nF\ntestes (O’), or tj\nTS\n>fl(2)d testes (P’). In K-P, Vasa (red) marks germ\ncells, and Zfh1 or Tj (blue) mark cyst cells. Scale bars = 20 μm.\nhttps://do i.org/10.1371/j ournal.pge n.1007203.g00 5\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 11 / 27\nsomatic cells expressing Tj, which marks a broader population of CySCs and early cyst cells\n[69] (S7C and S7D Fig). tj\nTS\n>tra\nF\ntestes contained 158.7±14.5 Tj-positive cells compared with\n80.3±3.9 cells in tj\nTS\n>+ testes (p<0.001) (S7J Fig). We interpret the accumulation of Zfh1-po-\nsitive, Tj-positive cells in tj\nTS\n>tra\nF\ntestes as a delay in somatic differentiation. Because cyst\ncells must exit the cell cycle in order to support the developing male germline, there are no\nsomatic cells located away from the niche in wild type testes that are positive for 5-ethynyl-2’-\ndeoxyuridine (EdU), an S-phase marker. We previously showed that when somatic differentia-\ntion is delayed, EdU-positive cyst cells are observed several cell diameters away from the niche\n[36]. Consistent with our prior results, in control tj\nTS\n>+ testes, only Tj-positive cells near the\nhub incorporated EdU (S7E Fig, arrowheads; n = 0/20 testes with EdU-positive cyst cells\nlocated away from the niche). By contrast, in tj\nTS\n>tra\nF\ntestes we detected EdU-positive somatic\ncells located many cell diameters away from the niche, suggesting that these cells had delayed\ndifferentiation (S7F Fig, arrows; n = 20/26 testes with EdU-positive cyst cells located away\nfrom the niche).\nConsistent with a defect in somatic differentiation, cyst cells mis-expressing tra\nF\nwere\nimpaired in their ability to support the germline. In tj\nTS\n>tra\nF\ntestes, early germ cells accumu-\nlated (identified by dot- and dumbbell-shaped α-spectrin-positive fusomes) at the expense of\nmore differentiated spermatogonia, as fewer germ cysts with branched fusomes were observed\n(S7G and S7H Fig). tj\nTS\n>tra\nF\ntestes also contained significantly fewer EdU-positive, 4- and\n8-cell spermatogonial cysts than tj\nTS\n>+ testes (S7E, S7F and S7K Fig). These results demon-\nstrate that ectopic Tra\nF\nin CySCs is deleterious to their differentiation, but alone cannot drive\nCySCs to assume a follicle-like fate. Taken together with our previous finding that tra is down-\nstream of chinmo in CySC feminization, we conclude while Tra\nF\ninduction is important for\nCySC feminization upon loss of chinmo, it is not sufficient.\nSxl is not required for feminization of chinmo-deficient CySCs\nOur finding that chinmo-deficient CySCs produce tra\nF\n(Fig 5A and 5C) reveals that they pos-\nsess machinery to splice tra pre-mRNA into the female isoform. We considered the possibility\nthat wild type CySCs might be competent to alternatively splice tra. However, somatic mis-\nexpression of UAS-traF\nΔ\nT2AGFP in wild type somatic cells did not lead to tra alternative splic-\ning, since GFP was absent from the somatic lineage (Fig 5D). Thus, wild type CySCs are intrin-\nsically unable to generate tra\nF\nmRNA, precluding this model.\nIt follows, then, that one or more factors are ectopically expressed upon loss of chinmo that\nalternatively splice tra pre-mRNA into tra\nF\n. Since Sxl is required for tra\nF\nproduction in wild\ntype females (Fig 6A; [12]), we investigated whether Sxl is ectopically expressed in chinmo-\nmutant CySCs. As expected, Sxl protein was absent from wild type testes but was detectable in\nwild type ovaries (Fig 6B and 6C). Importantly, we did not observe Sxl in chinmo-mutant testes\n(Fig 6D). These results were validated by assessing Sxl mRNA isoform abundance in adult\ngonads. Semi-quantitative RT-PCR demonstrated that control tj>+ testes express male-spe-\ncific Sxl\nM\n(Fig 6E, left lane), which contains an early stop codon and encodes no functional\nprotein, while control tj>+ ovaries express female-specific Sxl\nF\n(Fig 6E, middle lane), which\nencodes functional Sxl. tj>chinmo\nRNAi\ntestes still express Sxl\nM\n(Fig 6E, right lane), consistent\nwith the absence of Sxl protein in these testes (Fig 6D). We also tested whether mis-expression\nof chinmo in female follicle cells could prevent Sxl alternative splicing; however, both tj\nTS\n>+\nand tj\nTS\n>chinmo ovaries expressed only the female-specific Sxl\nF\nisoform (S6B Fig).\nFurthermore, unlike depletion of tra, depletion of Sxl in feminizing, chinmo-deficient\nsomatic cells did not suppress Fas3 expression or the epithelial organization of somatic cells\n(Fig 5J, light blue bar; S1 Table). [As expected, somatic depletion of Sxl in an otherwise wild\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 12 / 27\nFig 6. Sxl is not required for feminizatio n of chinmo-m utant CySCs. (A) Schematic of tra pre-mRNA splicing. The poly(U ) tract upstream\nof exon 2 is bound by the RRM domain of Sxl in females, causing skipping of exon 2. In wild type males, exons 1–4 comprise tra mRNA and\ntranslation terminate s at the early stop codon in exon 2 (red star). Pink dashed lines indicate female-sp ecific alternative splicing and blue\ndashed lines indicate non-sex- specific default splicing . (B-D) Sxl is not expressed in a control tj>+ testis (B’) but is expressed in follicle cells\n(C’, arrowheads) and in an early germ cell (C’, arrow) of a control tj>+ ovary. Sxl protein is not detected in a tj>chinmo\nRNAi\ntestis (D’). (E)\nSemi-quant itative RT-PCR on Sxl in homogeni zed control tj>+ testes (left lane), control tj>+ ovaries (middle lane), and tj>chinmo\nRNAi\ntestes (right lane). Contr ol tj>+ testes express Sxl\nM\ntranscripts (blue arrowhead ), while control tj>+ ovaries express Sxl\nF\ntranscrip ts (red\narrowhead ). Sxl\nM\nis still present and Sxl\nF\nis undetectabl e in tj>chinmo\nRNAi\ntestes (right lane). Sxl\nJYR\nprimers were used to differentiate between\nSxl\nM\nand Sxl\nF\nmRNA isoforms in this experimen t. α-tubulin (tub) was used as a loading control . (F) Quantificati on of CySC feminization in\nSxl; chinmo\nST\nbackgrounds . Sample sizes are indicated within bars.\n\u0003 \u0003 \u0003 \u0003\ndenotes p<0.0001 as determine d by Fisher’s Exact Test (compar ed to\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 13 / 27\ntype background produced no testis phenotype (S1 Table). We confirmed that the UAS-Sxl-\nRNAi line was effective at knockdown because somatic depletion of Sxl in females led to only a\nrudimentary ovary with 100% penetrance, n = 23.] Consistent with this, none of three distinct\nmutant alleles of Sxl prevented feminization in chinmo\nST\n/chinmo\nST\ntestes (Fig 6F–6K; S1\nTable). Taken together, these data support a model where the ectopic tra pre-mRNA in\nchinmo-mutant CySCs is alternatively spliced into tra\nF\nvia a non-canonical, Sxl-independent\nmechanism.\nvir and fl(2)d are upregulated in chinmo-deficient CySCs and are required\nfor sex transformation\nWe next examined a potential role for other candidates with known roles in female-specific\nalternative splicing of tra. We found that vir, fl(2)d, and nito transcripts were 1.5-fold\n(p<0.05), 3.4-fold (p<0.001), and 5.7-fold (p<0.0001) higher in adult ovaries compared with\nadult testes, respectively, suggesting sex-biased expression in adult gonads (Fig 7A and 7B).\nThis observation is consistent with ModENCODE RNA-seq data demonstrating that vir, fl(2)d,\nand nito transcripts are present at very low levels in wild type testes [70]. However, levels of all\nthree transcripts significantly increased (2.3-fold, 1.7-fold, and 1.8-fold for vir, fl(2)d, and nito,\nrespectively) in tj>chinmo\nRNAi\ntestes compared with control tj>+ testes (Fig 7A and 7B;\np<0.05 for vir and nito, p<0.01 for fl(2)d). While depleting vir or fl(2)d had no effect on testis\ndevelopment or spermatogenesis (S8A–S8C Fig), we found that depletion of vir in the female\nsomatic gonad caused severe defects in ovary development. tj>vir\nRNAi\nfemales develop some\nfemale reproductive structures and contain an oviduct, but lack ovaries (S8D and S8E Fig).\nBoth tj>vir\nRNAi\nand tj>fl(2)d\nRNAi\nfemales failed to lay fertilized eggs. To test whether vir or\nfl(2)d are necessary for tra\nF\nsplicing in adult ovaries, we depleted vir or fl(2)d in the female\nsomatic gonad using tj\nTS\n, rearing flies at the permissive temperature to prevent vir or fl(2)d\nknockdown during development. After eclosion, adult females were then reared at the restric-\ntive temperature to allow for vir and fl(2)d depletion. While wild type follicle cells express GFP\nproduced by UAS-traF\nΔ\nT2AGFP (Fig 7D), GFP is dramatically reduced in the follicle cells of\ntj\nTS\n>vir\nRNAi\nand tj\nTS\n>fl(2)d\nRNAi\novaries (Fig 7C, 7E and 7F). These results demonstrate that vir\nand fl(2)d are both female-biased in the adult gonad and are required for tra\nF\nalternative splic-\ning in follicle cells.\nTo test whether vir or fl(2)d are required for sex transformation upon somatic loss of\nchinmo, we depleted each factor concomitantly with chinmo and monitored the frequency of\nCySC feminization. Depletion of vir or fl(2)d in tj>chinmo\nRNAi\ntestes significantly reduced the\npercentage of feminized testes (p<0.001 and p<0.0001, respectively) (Fig 7G and 7H; Fig 5J,\ngreen and yellow bars, respectively; S1 Table). In contrast, depletion of nito did not prevent\nfeminization (Fig 7I; Fig 5J, red bar; S1 Table). As expected, somatic depletion of vir, fl(2)d or\nnito in an otherwise wild type testis had no effect (S1 Table). We also tested the sufficiency of fl\n(2)d for CySC sex transformation. We found that mis-expression of fl(2)d in the adult CySC\nlineage (tj\nTS\n>fl(2)d) did not cause Fas3-positive aggregates to accumulate (Fig 5M). Further-\nmore, the follicle cell marker Cas was not induced in tj\nTS\n>fl(2)d testes (Fig 5P). Due to the lack\nof a UAS-vir transgenic Drosophila line, we were unable to test the sufficiency of vir for CySC\nfeminization. Based on these findings, we conclude that Vir and Fl(2)d are epistatic to chinmo\nand are required, but not sufficient, for feminization of chinmo-mutant CySCs. Taken together\nFM7/Y; chinmo\nST\n/chinmo\nST\n). See S1 Table for percentage values. (G-K) Represent ative images for Sxl; chinmo\nST\nepistasis experimen ts. Genetic\nloss of Sxl by 3 different alleles–S xl\nf1\n(I), Sxl\nf2\n(J), or Sxl\nf18\n(K)–does not prevent feminizati on of chinmo\nST\n/chinmo\nST\ncyst cells (G’), defined by\nthe accumulati on of Fas3-pos itive aggregates. Control FM7/Y; chinmo\nST\n/CyO cyst cells do not feminize (H’). Scale bars = 20 μm.\nhttps://do i.org/10.1371/j ournal.pge n.1007203.g00 6\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 14 / 27\nwith our previous results, this strongly implicates Vir and Fl(2)d in alternative splicing of the\nectopic tra pre-mRNA observed in sex-transformed CySCs.\nDiscussion\nChinmo prevents female sex identity in adult male CySCs\nHere, we show that that one single factor, Chinmo, preserves the male identity of adult CySCs\nin the Drosophila testis by regulating the levels of canonical sex determinants. We demonstrate\nthat CySCs lacking chinmo lose Dsx\nM\nexpression not by transcriptional loss but rather by alter-\nnative splicing of dsx pre-mRNA into dsx\nF\n. These chinmo-mutant CySCs ectopically express\nFig 7. Vir and Fl(2)d, but not Nito, are required for feminizatio n of chinmo-de ficient CySCs. (A) Semi-quant itative RT-PCR of vir, fl(2)d, and nito in homogeni zed\ncontrol tj>+ testes (left lane), control tj>+ ovaries (middle lane) and tj>chinmo\nRNAi\ntestes (right lane). vir, fl(2)d, and nito are expressed at higher levels in ovaries (middle\nlane) than in tj>+ testes (left lane). vir, fl(2)d, and nito are expressed at higher levels in tj>chinmo\nRNAi\ntestes (right lane) than in control tj>+ testes (left lane). α-tubulin\n(tub) was used as a loading control. Flies were aged 9–20 days prior to dissectio n. (B) qRT-PC R analysi s of vir, fl(2)d, and nito in homogeniz ed control tj>+ testes (white\nbars), control tj>+ ovaries (gray bars) and tj>chinmo\nRNAi\ntestes (blue bars). vir, fl(2)d, and nito are expressed at significan tly higher levels in ovaries and tj>chinmo\nRNAi\ntestes compa red to control testes.\n\u0003\ndenotes p<0.05;\n\u0003 \u0003\ndenotes p<0.01;\n\u0003 \u0003 \u0003\ndenotes p<0.001;\n\u0003 \u0003 \u0003 \u0003\ndenotes p<0.0001 as determine d by two-tailed Student’s t-test. Error\nbars represent SEM. Flies were aged 9–20 days prior to dissection. (C) Quantifi cation of GFP levels (synthesized from UAS-traF\nΔ\nT2AGFP transgene) in tj>+, tj>vir\nRNAi\n,\nand tj>fl(2)d\nRNAi\novaries represented in D-F. Errors represent SEM.\n\u0003 \u0003 \u0003 \u0003\ndenotes p<0.0001 as determined by Studen t’s t-test. (D-F) Represen tative images of control tj>+\n(D’), tj>vir\nRNAi\n(E’), and tj>fl(2)d\nRNAi\n(F’) ovaries in a UAS-tra F\nΔ\nT2AGFP backgroun d. GFP expressed from UAS-traF\nΔ\nT2AGFP is detectable in escort cells (D’, arrow) and\nfollicle cells (D’, arrowhead ). GFP levels are dramatical ly reduced upon vir or fl(2)d depletion (E’ and F’, respective ly) compared with wild type follicle cells (D’). Tj (blue)\nmarks escort/folli cle cells and Fas3 (red) marks follicle cells. (G-I) Depletion of nito (I’) does not reduce Fas3-pos itive (green) aggregates (a readout for feminizati on) in\ntj>chinmo\nRNAi\ntestes. By contrast, depletion of vir (G’) or fl(2)d (H’) in tj>chinmo\nRNAi\nreduces the percentage of testes with these aggrega tes. Results are quantified in Fig\n5J and S1 Table. Vasa (red) marks germ cells and Tj (blue) marks somatic cells. Scale bars = 20 μm.\nhttps://do i.org/10.1371/j ournal.pge n.1007203.g00 7\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 15 / 27\nTra\nF\nand Dsx\nF\n, and both factors are required for their feminization. Furthermore, our results\ndemonstrate that tra alternative splicing in cyst cells lacking chinmo is achieved independently\nof Sxl. Instead, our work strongly suggests that tra\nF\nproduction in the absence of chinmo is\nmediated by splicing factors Vir and Fl(2)d. We propose that male sex identity in CySCs is\nmaintained by a two-step mechanism whereby tra\nF\nis negatively regulated at both transcrip-\ntional and post-transcriptional levels by Chinmo (Fig 8). In this model, loss of chinmo from\nmale somatic stem cells first leads to transcriptional upregulation of tra pre-mRNA as well as\nof vir and fl(2)d. Then the tra pre-mRNA in these cells is spliced into tra\nF\nby the ectopic Vir\nand Fl(2)d proteins. The ectopic Tra\nF\nin chinmo-deficient CySCs then splices the dsx pre-\nmRNA into dsx\nF\n, resulting in loss of Dsx\nM\nand gain of Dsx\nF\n, and finally induction of target\ngenes usually restricted to follicle cells in the ovary.\nChinmo regulates levels of tra, vir and fl(2)d\nChinmo has motifs associated with transcriptional repression and its loss clonally is associated\nwith ectopic transcription [54]. One interpretation of our data is that Chinmo directly\nrepresses tra, vir, and fl(2)d in male somatic gonadal cells. As the binding site and potential co-\nfactors of Chinmo are not known, future work will be needed to determine whether Chinmo\ndirectly regulates expression of these genes. We also note that ~50% of chinmo-mutant testes\nstill feminize in the genetic absence of tra or dsx\nF\n. These latter data indicate that Chinmo regu-\nlates male sex identity through another, presumably parallel, mechanism that does not involve\ncanonical sex determinants. However, this tra/dsx-independent mode of sex maintenance\ndownstream of Chinmo is not characterized and will require the identification of direct\nChinmo target genes.\nRegulation of chinmo expression in adult CySCs\nWe previously showed that JAK/STAT signaling promotes chinmo in several cell types, includ-\ning CySCs [54]. Since JAK/STAT signaling is itself sex-biased and restricted to the embryonic\nmale gonad, we presume that activated Stat92E establishes chinmo in male somatic gonadal\nprecursors, perhaps as early as they are specified in the embryo [33, 71]. Because loss of\nStat92E from CySCs does not result in an apparent sex transformation phenotype [29, 40, 60],\nwe favor the interpretation that Stat92E induces expression of chinmo in CySCs but that other\nsexually biased factors maintain it. One potential candidate is Dsx\nM\n, which is expressed specifi-\ncally in early somatic gonads and at the same time when Stat92E activation is occurring in\nthese cells [72]. In fact, multiple Dsx\nM\nChIP-seq peaks were identified in the chinmo locus, sug-\ngesting potential regulation of chinmo by Dsx\nM\n[26]. Taken together with our findings, this\nsuggests a potential autoregulatory feedback loop whereby Dsx\nM\npreserves its own expression\nin adult CySCs by maintaining Chinmo expression, which in turn prevents tra\nF\nand dsx\nF\nproduction.\nNon-canonical mechanisms of sex-specific cell fate and tissue homeostasis\nRecent studies on tissue-specific sex maintenance demonstrate that while the Sxl/Tra/Dsx hier-\narchy is an obligate and linear circuit during embryonic development, at later stages it is more\nmodular than previously appreciated. For example, Sxl can regulate female-biased genes in a\ntra-independent manner [73, 74]. Additionally, Sxl and Tra\nF\nregulate body size and gut plastic-\nity independently of the only known Tra\nF\ntargets, dsx and fru [3, 4]. We find that negative reg-\nulation of the Tra\nF\n-Dsx\nF\narm of this cascade is required to preserve male sexual identity in\nCySCs but unexpectedly is independent of Sxl. Because depletion of Vir or Fl(2)d significantly\nblocks sex transformation and both are required for tra alternative splicing in the ovary, our\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 16 / 27\nwork reveals they can alternatively splice tra pre-mRNA even in the absence of Sxl. To the best\nof our knowledge, this is the first demonstration of Sxl-independent, Tra-dependent feminiza-\ntion. These results raise the broader question of whether other male somatic cells have to safe-\nguard against this novel mechanism. Because recent work has determined that sex\nmaintenance is important in systemic functions regulated by adipose tissue and intestinal stem\ncells [3, 4], it will be important to determine whether Chinmo represses tra\nF\nin these settings.\nFinally, since the transcriptional output of the sex determination pathway is conserved from\nDrosophila (Dsx) to mammals (DMRT1), it is possible that transcriptional regulation of sex\ndeterminants plays a similar role in adult tissue homeostasis and fertility in higher organisms.\nMaterials and methods\nFly stocks and husbandry\nThe following fly stocks were used and are described in FlyBase: Oregon\nR\n; yw; tj-gal4; tub-\ngal80\nTS\n; dsx-gal4; dsx-gal\nΔ2\n; GMR40A05-gal4; dsx\nMI03050-GFSTF.1\n; dsx\n1\n; dsx\nD\n; chinmo\nST\n; tra\n1\n; Df\n(3L)st-j7; UAS-GFP\nnls\n; UAS-dcr2; UAS-chinmo\nRNAi\n(HMS00036); UAS-tra\nRNAi\n(HMS02830);\nUAS-tra\nF\n; UAS-3xHAfl(2)d; UAS-dsx\nF\n; UAS-5’UTR-chinmo-3’UTR; UAS-Sxl\nRNAi\n(HMS00609);\nSxl\nf1\n; Sxl\nf2\n; Sxl\nf18\n; UAS-vir\nRNAi\n(HMC03908); UAS-fl(2)d\nRNAi\n(HMC03833); UAS-nito\nRNAi\n(HMS00166).\nFor RNAi-mediated depletion of chinmo, Sxl, tra, vir, fl(2)d, and nito, flies were reared at an\nambient temperature (21˚C). Adult males were collected twice a week and aged at 29˚C to\nincrease Gal4 activity. For temporal control of gene expression, tj-gal4, tub-gal80\nTS\nvirgins\nwere crossed to UAS-tra\nF\nor UAS-3xHAfl(2)d males and progeny were reared at the permissive\nFig 8. Model for adult somatic sex maintenan ce in the Drosoph ila somatic gonad. Left: In XX animals, the\nproductio n of Sxl leads to alternative splicing of tra pre-mRNA into tra\nF\n. Tra\nF\nprotein then alternativel y splices dsx\npre-mRN A into dsx\nF\n. The Dsx\nF\nprotein promotes female-speci fic transcription al change s. Right: In XY animals, Sxl is\nnot produced . Neither tra nor dsx pre-mRNA are alternativel y spliced, resulting in the productio n of Dsx\nM\nprotein,\nwhich ensures male-spec ific transcrip tion of target genes. In addition to the absence of Sxl in XY cells, adult somatic\nstem cells of the Drosophi la testis have an extra level of insurance of male sex identity. Chinmo, which is expressed only\nin male but not female somatic gonadal cells, represses expression of tra, vir and fl(2)d in CySCs. This safeguards male\nidentity by reducing the availabili ty of tra pre-mRNA and of factors (i.e., Vir and Fl(2)d)) that can splice it into tra\nF\n.\nThus, in addition to the canonical sex determinati on pathway that establishe s male and female programs from early\ndevelop ment, adult male, sexually dimorphic cells protect their sexual identity by transcription al repression of tra and\nits splice factors.\nhttps://d oi.org/10.1371/j ournal.pge n.1007203.g0 08\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 17 / 27\ntemperature (18˚C) to prevent tra\nF\nor fl(2)d mis-expression during embryonic, larval, and\npupal development. Adult males of the correct genotype were collected twice a week and\nshifted to the restrictive temperature (29˚C) to inactivate Gal80.\nGeneration of UAS-traF\nΔ\nT2AGFP\nIn this transgene, most of the third exon of tra is replaced by the coding sequences for self-\ncleaving T2A peptide and GFP. Specifically, the coding sequences of T2A and GFP were\ncloned in frame immediately downstream of the 26\nth\nnucleotide (nt) of tra exon 3 and imme-\ndiately upstream of the last 18 nt of this exon. PCR was performed with Q5 high-fidelity poly-\nmerase from New England Biolabs (M0491S). The PCR product was digested with EcoRI and\nXhoI before cloning into the pUASTattb vector [75]. The construct was verified by sequencing,\nand a transgenic line was established through FC-31 integrase mediated transformation (Best-\ngene, attP site VK05, BDSC#9725).\nAntibodies\nThe following primary antibodies were used: rat anti-Chinmo (1:1000; gift of N. Sokol, Indiana\nUniversity, IN, USA), goat anti-Vasa (1:50, dC-13, Santa Cruz), rabbit anti-Vasa (1:1500; gift\nof R. Lehmann, Skirball Institute/NYU School of Medicine, NY, USA), guinea pig anti-Tj\n(1:5000; gift of D. Godt, University of Toronto, ON, Canada), rabbit anti-Zfh1 (1:5000; gift of\nR. Lehmann), mouse anti-Fasciclin-3 (1:50; Developmental Studies Hybridoma Bank\n(DSHB)), mouse anti-Eya (1:20; DSHB), rat anti-Dsx\nM\n(1:200; gift of B. Oliver, National Insti-\ntutes of Health, MD, USA), rat anti-Dsx\nC\n(1:50; gift of M. Arbeitman, Florida State University,\nFL, USA), rabbit anti-Castor (1:50; gift of W. Odenwald, National Institutes of Health, MD,\nUSA), mouse anti-α-spectrin (1:20, DSHB), mouse anti-Sxl\nM18\n(1:5; DSHB), rabbit anti-GFP\n(1:500; Invitrogen). Secondary antisera used were all raised in donkey (Jackson\nImmunoResearch).\nImmunofluorescence\nTestes and ovaries were dissected in 1x PBS and fixed in 4% paraformaldehyde in 1x PBS for\n30 minutes at room temperature (RT). Fixed tissue was washed twice at RT in 0.5% PBST (1x\nPBS with 0.5% Triton X-100) and blocked in PBTB (1x PBS, 0.2% Triton X-100, 1% BSA) for 1\nhour at RT or overnight at 4˚C. Primary antibodies were incubated overnight at 4˚C and\nwashed off twice at RT in PBTB. Secondary antibodies were incubated for 2 hours at RT in the\ndark and washed off twice in 0.2% PBST (1x PBS with 0.2% Triton X-100). Tissue was\nmounted in Vectashield Medium (Vector Laboratories) prior to confocal analysis, and confo-\ncal images were captured using a Zeiss LSM 510 confocal microscope, 63x objective.\nDIC microscopy on whole ovaries\nDIC images of adult female reproductive structures (at 5x) were obtained using a Zeiss Axio-\nplan microscope with a Retiga Evi (QImaging) digital camera and QCapture Pro 6.0 software.\nImmunofluorescence using anti-Dsx\nC\nTestes and ovaries were dissected in 1x PBS and fixed in 20% EM-grade paraformaldehyde\n(Electron Microscopy Sciences) in 1x PBS for 20 minutes at RT. Fixed tissue was washed 3\ntimes for 15 minutes each in TNT (0.1M Tris-HCl, 0.3M NaCl, 0.05% Tween-20) and blocked\nusing Image-iT FX Signal Enhancer (ThermoFisher) for 30 minutes at RT, then washed 3\ntimes for 15 minutes each in TNT. Primary anti-Dsx\nC\nwas incubated overnight at 4˚C. After\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 18 / 27\nanti-Dsx\nC\nincubation, tissue was blocked in PBTB for 1 hour and then treated with anti-Vasa\nand anti-Tj. Primary antibodies were washed twice for 15 minutes each in PBTB, then second-\nary antibodies were incubated overnight at 4˚C in PBTB. Finally, the Dsx\nC\nsignal was amplified\nby TSA (see below) and testes were mounted in Vectashield prior to analysis.\nTyramide signal amplification (TSA)\nTSA (Perkin Elmer) was performed to amplify Dsx\nM\nand Dsx\nC\nsignals. HRP anti-rat (Jackson\nImmunoResearch) was used as a secondary antibody and the tertiary Cy3-conjugated tyramide\nreaction was performed per the manufacturer’s instructions.\nCySC purification by fluorescence-activate d cell sorting (FACS)\nTo purify CySCs and early cyst cells, the somatic cell lineage was labeled using tj-gal4 to drive\nUAS-GFP\nnls\nexpression. Testes were dissociated in trypsin/collagenase for 15 minutes and the\ncell suspension was passed through 70μm filters (Falcon). GFP-expressing somatic cells were\npurified from the resulting filtrate by FACS using a Sony SY3200 highly automated parallel\nsorting (HAPS) cell sorter into TRIzol LS (ThermoFisher), and RNA was extracted according\nto the manufacturer’s instructions. Post-sort purity of samples was confirmed by immunocyto-\nchemistry and the absence of Vasa-positive germ cells.\n5-ethynyl-2’-deox yuridine (EdU)-labeling of adult testes\nEdU-labeling of testes was performed using the Click-iT EdU Alexa Fluor 647 Imaging Kit\n(ThermoFisher). Testes were dissected in S2 cell culture medium (Life Technologies) then\nincubated in 10 μM EdU for 30 minutes. Testes were then fixed, washed, and stained as\ndescribed above. The cycloaddition reaction was performed per the manufacturer’s instruc-\ntions. Testes were mounted in Vectashield prior to confocal analysis.\nQuantitative and semi-quantitative RT-PCR\nTo detect mRNA levels of canonical sex determinants by PCR, whole ovaries (n = 5–10) or\nwhole testes (n = 55–200) were isolated and homogenized into TRIzol (ThermoFisher). RNA\nwas extracted and DNase-treated (Ambion) per the manufacturer’s instructions. Reverse tran-\nscription was performed using Maxima reverse transcriptase (ThermoFisher) according to the\nmanufacturer’s instructions and 1–2 μg of RNA as template. qRT-PCR was performed using\nSYBR Green PCR Master Mix (ThermoFisher) and a Biorad CFX96 Real-Time PCR Machine.\nSemi-quantitative RT-PCR was performed on a Biorad iCycler. Because the proportion of\nsomatic cells is significantly increased in tj>chinmo\nRNAi\ntestes compared to tj>+ controls, the\nqRT-PCR values were normalized first to tubulin and second to zfh1, an early somatic marker.\nPrimers\ntotal tra: fwd-GAGCCCGCATCGGTA TAATC; rev-GACGTGGTAG CCTTTGGTATC\ntra\nF\n: fwd-AACCCAGCA TCGAGATTCC; rev-CGAACCTCGTCT GCAAAGTA\ndsx\nC\n: fwd-GAAAGAACGGCGC CAAT; rev-GGCGTCTGCGTCC TTTAATA\ndsx\nM\n: fwd-GAGCTGATGCCACT CATGTAT; rev-CTGGGCTACAGTGCGA TTTA\ndsx\nF\n: fwd-GAATGAGTACTCCCG TCAACAT; rev-GGGCAAAGTAGTATTCGT TACTCTA\nrpl15: fwd-AGGATGCACTT ATGGCAAGC; rev-GCGCAATCCAATACGAGTT C\nα-tub84b: fwd-CAACCAGATGGTCAAGTGCG ; rev-ACGTCCTTGGGCAC AACATC\nβ-tub56d: fwd-CTCAGTGCTCGAT GTTGTCC; rev-GCCAAGGGAGTGTGTGA GTT\nSxl\nJYR\n: fwd-ACACAAGAAAGTTGA ACAGAGG; rev-CATTCCGGATGGCA GAGAATGG\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 19 / 27\nSxl\nEM\n: fwd-CGCTGCGAGTC CATTTCC; rev-GTGGTTATCCCCCATATGG C\nvir: fwd-CATGAGGAAGT GACGGACATC; rev-GGAAAGTCTGCCTGG ACTCG\nfl(2)d: fwd-GGCCAACAAGGAG CAAGAA; rev-CGCTCGAACAGGA GATTGAC\nnito: fwd-GGTGTACAAGTCCACA ACCAGA; rev-CGACGGTGATCCAAAGGA A\nFertility assays\nThe fertility of adult males was assayed by mating individual males with two wild type (Ore-\ngon\nR\n) virgin females (between 5–10 days old) for 48 hours at 25˚C. After a 2-day mating\nperiod, males were recovered and preserved for subsequent matings using fresh virgin Ore-\ngon\nR\nfemales. Fertility was scored by counting the number of F1 offspring produced by each\nindividual cross and reported as the average number of F1 offspring for each genotype.\nStatistical analysis\nStatistical parameters for each experiment are reported in the figure legends. Data were ana-\nlyzed using Microsoft Excel and are reported to be statistically significant when p<0.05 by the\nappropriate statistical test. For qRT-PCR data, significance was determined by two-tailed Stu-\ndent’s t-test. For fertility assays and cyst cell quantifications, significance was determined using\nsingle-factor ANOVA. For rescue of CySC feminization (Fas3-positive aggregates), signifi-\ncance was determined using Fisher’s Exact Test.\nSupporting information\nS1 Table. Quantification of testes with Fas3-positive somatic aggregates (referred to as\n“feminized”). Data are presented as the percentage of testes with Fas-3-positive aggregates in\ntestes of the indicated genotypes from the total number of testes examined.\n(DOCX)\nS1 Fig. Loss of chinmo in the CySC lineage causes sex transformation and loss of the germ-\nline. (A-C) A transcriptional reporter for slow border cells (slbo-GFP) is not expressed in a wild\ntype testis (A’, arrowhead). slbo-GFP (green) is expressed in mature follicle cells (B’, arrow-\nhead). slbo-GFP is ectopically expressed in the CySC lineage upon loss of chinmo (C’, arrow-\nhead). Time point is 11 days post-eclosion. Tj (blue) marks cyst cells. Vasa (red) marks the\ngermline.\n(D) Semi-quantitative RT-PCR on Yp1 using RNA extracts from homogenized control tj>+\ntestes (left lane), control tj>+ ovaries (middle lane), and tj>chinmo\nRNAi\ntestes (right lane). Yp1\nis expressed in control tj>+ ovaries (middle lane), but not in control tj>+ testes (left lane). In\ntj>chinmo\nRNAi\ntestes (right lane), Yp1 is expressed. α-tubulin (tub) was used as a loading con-\ntrol. Timepoint is 9–14 days post-eclosion.\n(E-F) Loss of chinmo in male niche cells using upd-gal4, gal80\nTS\n(upd\nTS\n) causes no overt defects\nin testis development or spermatogenesis. Time point is 8 days post-eclosion. TOPRO (blue)\nmarks DNA. Fas3 (green) marks niche cells.\n(G-H) Representative images of agametic tj>chinmo\nRNAi\ntestes at 7 days post-eclosion. Fas3--\npositive somatic aggregates (green) fill the apex of the testis, which is devoid of Vasa-positive\n(red) germ cells. Zfh1 (blue) marks somatic cells.\n(I-K) Expression of Chinmo in adult gonads. Chinmo is expressed in the CySC lineage of the\nadult testis (I’, arrowheads) but is absent from follicle cells in the adult ovary (J’, arrowheads).\nUpon chinmo depletion in the testis (tj>chinmo\nRNAi\n), Chinmo protein is lost from feminizing\ncyst cells (K’, arrowheads). The remaining Chinmo protein observed in K’ represents Chinmo\nexpression in the male germline. Vasa (red) marks germ cells and Tj (blue) marks somatic\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 20 / 27\ncells.\nScale bars = 20 μm.\n(TIF)\nS2 Fig. Three different dsx transcriptional reporters show variable expression in adult\ngonads. (A-B) Expression of dsx-gal4\nΔ2\nin adult gonads. In the testis, dsx-gal4\nΔ2\nis expressed in\nthe entire CySC lineage (A). In the ovary, dsx-gal4\nΔ2\nis expressed in escort cells, but not follicle\ncells (B).\n(C-D) Expression of GMR40A05-gal4 in adult gonads. In the testis, GMR40A05-gal4 is\nexpressed in the entire CySC lineage (C). In the ovary, GMR40A05-gal4 is expressed in escort\ncells, but not follicle cells (D).\n(E-F) Expression of dsx\nMI03050-GFSTF.1\nin adult gonads. In the testis, dsx\nMI03050-GFSTF.1\nis\nexpressed weakly in the CySC lineage (E) and is undetectable in adult ovaries (F).\nFas3 (red) marks testicular niche cells and ovarian follicle cells. Tj (blue) marks somatic cells in\nboth gonads. Time point for all adults is 5 days post eclosion. Scale bars = 20 μm.\n(TIF)\nS3 Fig. Dsx\nC\nantibody detects Dsx\nF\nprotein. Immunostaining of tj>dsx\nF\novaries reveals that\nDsx\nF\nprotein is detectable by Dsx\nC\nantibody (magenta). Tj (green) marks somatic cells. Scale\nbars = 20 μm.\n(TIF)\nS4 Fig. Blocking Dsx\nF\nor Tra\nF\nproduction genetically in females causes masculinization of\nthe soma. (A-D) Blocking dsx\nF\nproduction using the dsx\nD\n/dsx\n1\nheteroallelic combination mas-\nculinizes the soma of XX animals. Chromosomal sex of flies was determined based on inheri-\ntance of X-linked traits (eye color, w; cuticle color, y). Genotype for A (XX animal) is yw/y\n+\nw\n+\n;\nchinmo\nST\n/chinmo\nST\n; dsx\n1\n/TM2; for B (XX animal) is yw/y\n+\nw\n+\n; chinmo\nST\n/chinmo\nST\n; dsx\nD\n/dsx\n1\n;\nfor C (XY animal) is yw/Y; chinmo\nST\n/chinmo\nST\n; dsx\n1\n/TM2; for D (XY animal) is yw/Y; chin-\nmo\nST\n/chinmo\nST\n; dsx\nD\n/dsx\n1\n.\n(E-H) Blocking tra\nF\nproduction using tra\n1\n/Df(3L)st-j7, Ki\n1\nmasculinizes the soma of XX ani-\nmals. Chromosomal sex of flies was determined based on inheritance of X-linked traits (eye\ncolor, w). Genotype for E (XX animal) is w/w\n+\n; chinmo\nST\n/chinmo\nST\n; tra\n1\n/TM6B, Tb; for F (XX\nanimal) is w/w\n+\n; chinmo\nST\n/chinmo\nST\n; tra\n1\n/Df(3L)st-j7, Ki\n1\n; for G (XY animal) is w/Y; chinmo\nST\n/\nchinmo\nST\n; tra\n1\n/TM6B, Tb; for H (XY animal) is w/Y; chinmo\nST\n/chinmo\nST\n; tra\n1\n/Df(3L)st-j7, Ki\n1\n.\n(TIF)\nS5 Fig. Diagram of tra pre-mRNA and UAS-traF\nΔ\nT2AGFP. In the transgene, most of the\nthird exon of tra is replaced with self-cleaving T2A peptide and GFP, followed by a poly-ade-\nnylation signal (pA). Black shaded regions indicate exons. Red star indicates early stop codon\nin exon 2. Pink dashed lines indicate female-specific alternative splicing, and blue dashed lines\nindicate non-sex-specific default splicing.\n(TIF)\nS6 Fig. Chinmo mis-expression in ovaries leads to reduced tra\nF\nand dsx\nF\nlevels. (A)\nqRT-PCR analysis of homogenized ovaries demonstrates that mis-expression of chinmo in fol-\nlicle cells leads to decreased levels of total tra, tra\nF\n, and dsx\nF\n. Lower transcript levels were not\ndue to a change in the relative abundance of somatic cells, as zfh1 levels were unaffected in\ntj\nTS\n>chinmo ovaries. The values were normalized to tubulin. Data are presented as the mean\nof three biological replicates.\n\u0003 \u0003 \u0003\ndenotes p<0.001 as determined by two-tailed Student’s t-test.\nError bars represent SEM.\n(B) Semi-quantitative RT-PCR on RNA extracts from 5 male or 5 female larvae (first two\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 21 / 27\nlanes), tj\nTS\n>+ adult ovaries (third lane), and tj\nTS\n>chinmo adult ovaries (last lane). RNA from\nmale larvae express Sxl\nM\n(first lane), while RNA from female larvae express Sxl\nF\n(second lane).\nBoth tj\nTS\n>+ (third lane) and tj\nTS\n>chinmo (last lane) ovaries express Sxl\nF\nexclusively. Sxl\nEM\nprimers were used to differentiate between Sxl\nM\nand Sxl\nF\nmRNA isoforms in this experiment.\nα-tubulin (tub) was used as a loading control.\n(TIF)\nS7 Fig. Tra\nF\nis necessary but not sufficient for CySC feminization. (A-B) Zfh1 (blue) expres-\nsion in tj\nTS\n>+ (A) versus tj\nTS\n>tra\nF\n(B) testes. A and B represent single Z slices; A’ and B’ show\nmaximal Z-projections (Z-max) of Zfh1-expressing cells in the entire confocal stack. Fas3\n(green) marks the niche.\n(C-D) Tj (blue) expression in tj\nTS\n>+ (C) versus tj\nTS\n>tra\nF\n(D) testes. C and D represent single\nZ slices; C’ and D’ show Z-max projections of Tj-expressing cells.\n(E-F) EdU (blue)-labeled tj\nTS\n>+ (E) and tj\nTS\n>tra\nF\n(F) testes. EdU-positive spermatogonial\ncysts are outlined. Tj (green) marks cyst cells. Arrowheads (E’) point to EdU-positive CySCs.\nArrows (F’) point to EdU-positive differentiating cyst cells away from the niche. Asterisk\nmarks the niche.\n(G-H) Visualization of germ cell stages in tj\nTS\n>+ (G) and tj\nTS\n>tra\nF\n(H) testes. α-spectrin\n(green) marks fusomes, which are dot- and dumbbell-shaped in early germ cells (G’, arrow-\nheads) and become branched in later differentiating spermatogonia (G”, arrows). Note that\nthe niche is not in the plane in G’. Tj (blue) marks cyst cells. Arrowheads in H’ indicate sper-\nmatogonia away from the niche that have dot and dumbbell shape fusomes in tj\nTS\n>tra\nF\ntestes.\nAsterisk marks the niche.\n(I-J) Quantification of Zfh1-expressing (I) and Tj-expressing (J) cells in tj\nTS\n>+ (gray bars) ver-\nsus tj\nTS\n>tra\nF\n(green bars) testes. tj\nTS\n>tra\nF\ntestes contain significantly more Zfh1-expressing\nand Tj-expressing somatic cells than tj\nTS\n>+ testes, as determined by single-factor ANOVA.\n(K) Quantification of EdU-positive germ cells upon somatic tra\nF\nmis-expression. tj\nTS\n>tra\nF\ntes-\ntes contain significantly fewer EdU-positive 4-cell and 8-cell spermatogonia than tj\nTS\n>+ testes.\nFor quantifications,\n\u0003\ndenotes p<0.05;\n\u0003 \u0003\ndenotes p<0.01;\n\u0003 \u0003 \u0003\ndenotes p<0.001;\n\u0003 \u0003 \u0003 \u0003\ndenotes\np<0.0001 as determined by single-factor ANOVA.\nQuantification data are presented as mean ± SEM.\nVasa (red) marks the germline in A-H. Scale bars = 20 μm.\n(TIF)\nS8 Fig. Loss of vir and fl(2)d causes defects in the ovary but not the testis. (A-C) tj>vir\nRNAi\n(B) and tj>fl(2)d\nRNAi\n(C) testes resemble control tj>+ (A) testes, showing no overt defects in\ntestis development or spermatogenesis. Vasa (red) marks the germline, Tj (blue) marks\nsomatic cells, and Fas3 (green) marks niche cells. Scale bars = 20 μm.\n(D-E) Reproductive structures in adult tj>+ (D) and tj>vir\nRNAi\n(E) females. Ovaries (D, brack-\nets) and accessory structures like spermathecae (SP) (D, arrows) can be observed in tj>+\nfemales. Ovaries, but not somatic accessory structures like SP and oviduct, fail to develop in\nfemales lacking vir in the somatic gonad (E, arrows).\n(TIF)\nAcknowledgmen ts\nWe acknowledge the Bloomington Drosophila Stock Center, TRiP and DSHB for stocks and\nantibodies. We thank E. Rideout for providing dsx-gal4, tra\n1\nand Df(3L)st-j7 stocks, M. Van\nDoren for dsx-gal4\nΔ2\nand D. Montell for slbo-GFP. We also thank N. Sokol, D. Godt, R. Leh-\nmann, B. Oliver, M. Arbeitman, and W. Odenwald for generously sharing antibodies. We\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 22 / 27\nthank M. Fuller for kindly providing the FACS protocol. Additionally, we are incredibly grate-\nful to J. Treisman and H.D. Ryoo for insightful conversations, and M. Amoyel and T. Hurd for\nmanuscript feedback.\nAuthor Contributions\nConceptualization: Lydia Grmai, Erika A. Bach.\nFormal analysis: Lydia Grmai, Erika A. Bach.\nFunding acquisition: Lydia Grmai, Bruno Hudry, Irene Miguel-Aliaga, Erika A. Bach.\nInvestigation: Lydia Grmai, Erika A. Bach.\nMethodology: Lydia Grmai, Erika A. Bach.\nProject administration: Erika A. Bach.\nResources: Lydia Grmai, Bruno Hudry, Irene Miguel-Aliaga, Erika A. Bach.\nSupervision: Irene Miguel-Aliaga, Erika A. Bach.\nValidation: Lydia Grmai, Erika A. Bach.\nVisualization: Lydia Grmai, Erika A. Bach.\nWriting – original draft: Lydia Grmai, Erika A. Bach.\nWriting – review & editing: Lydia Grmai, Bruno Hudry, Irene Miguel-Aliaga, Erika A. Bach.\nReferences\n1. Lee G, Hall JC, Park JH. Doublesex gene expression in the central nervous system of Drosophil a mela-\nnogaster . Journal of neurogeneti cs. 2002; 16(4):229– 48. PMID: 12745633.\n2. Rideout EJ, Dornan AJ, Neville MC, Eadie S, Goodwi n SF. Control of sexual differe ntiation and behav-\nior by the doubles ex gene in Drosophil a melanog aster. Nature neuroscie nce. 2010; 13(4):458– 66.\nhttps://doi.or g/10.103 8/nn.2515 PMID: 20305646; PubMed Central PMCID: PMC309242 4.\n3. Rideout EJ, Narsaiya MS, Grewal SS. The Sex Determinati on Gene transforme r Regulates Male-\nFemale Differences in Drosophil a Body Size. PLoS genetics. 2015; 11(12):e10 05683. https://doi.or g/\n10.1371/ journal.pge n.1005683 PMID: 267100 87; PubMed Central PMCID: PMC469250 5.\n4. Hudry B, Khadayat e S, Miguel-Alia ga I. The sexual identity of adult intestinal stem cells controls organ\nsize and plasticity. Nature. 2016; 530(7590) :344–8. https://doi.or g/10.1038/ nature16953 PMID:\n26887495; PubMed Central PMCID: PMC4 800002.\n5. Mauvais-Ja rvis F. Sex differences in metabolic homeostasis, diabetes, and obesity. Biology of sex dif-\nferences. 2015; 6:14. https://doi.or g/10.1186/ s13293-015- 0033-y PMID: 26339468; PubMed Central\nPMCID: PMC455907 2.\n6. Casper AL, Van Doren M. The establishm ent of sexual identity in the Drosophila germlin e. Develop-\nment. 2009; 136(22):38 21–30. https://doi.or g/10.1242/d ev.042374 PMID: 19855024; PubMed Central\nPMCID: PMC276634 3.\n7. Sacher J, Neumann J, Okon- Singer H, Gotowiec S, Villringer A. Sexual dimorphism in the human brain:\nevidence from neuroim aging. Magnetic resonanc e imaging. 2013; 31(3):366– 75. https://doi.or g/10.\n1016/j.mr i.2012.06.007 PMID: 22921939.\n8. Camara N, Whitworth C, Van Doren M. The creation of sexual dimorph ism in the Drosophila soma. Cur-\nrent topics in developme ntal biology. 2008; 83:65–107. https:// doi.org/10.10 16/S0070-2 153(08)00 403-\n1 PMID: 191186 64.\n9. Erickson JW, Quintero JJ. Indirect effects of ploidy suggest X chromos ome dose, not the X:A ratio, sig-\nnals sex in Drosophil a. PLoS biology. 2007; 5(12):e332 . https://doi.or g/10.137 1/journal.pb io.0050332\nPMID: 181620 44; PubMed Central PMCID: PMCPMC2 222971.\n10. Salz HK, Erickson JW. Sex determinat ion in Drosophila: The view from the top. Fly. 2010; 4(1):60–70 .\nPMID: 201604 99; PubMed Central PMCID: PMC285577 2.\n11. Bell LR, Horabin JI, Schedl P, Cline TW. Positive autoregulati on of sex-lethal by alternative splicing\nmaintains the female determined state in Drosophil a. Cell. 1991; 65(2):229– 39. PMID: 2015624.\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 23 / 27\n12. Inoue K, Hoshijim a K, Sakamoto H, Shimur a Y. Binding of the Drosophil a sex-lethal gene product to the\nalternativ e splice site of transforme r primary transcrip t. Nature. 1990; 344(6265) :461–3. https:// doi.org/\n10.1038/ 344461a0 PMID: 1690860.\n13. Boggs RT, Gregor P, Idriss S, Belote JM, McKeown M. Regulatio n of sexual differe ntiation in D. mela-\nnogaster via alternative splicing of RNA from the transforme r gene. Cell. 1987; 50(5):739– 47. PMID:\n2441872.\n14. Hilfiker A, Amrein H, Dubendorf er A, Schneite r R, Nothiger R. The gene virilizer is required for female-\nspecific splicing controlled by Sxl, the master gene for sexual developme nt in Drosophil a. Developm ent.\n1995; 121(12):40 17–26. PMID: 8575302.\n15. Hilfiker A, Nothiger R. The temperatu re-sensi tive mutation vir ts(virilize r) identifi es a new gene involved\nin sex determination of Drosophila. Roux’s archives of develop mental biology: the official organ of the\nEDBO. 1991; 200(5):240 –8. https://doi.or g/10.100 7/BF00241293 PMID: 28305793.\n16. Granadin o B, Campuzano S, Sanchez L. The Drosophil a melanogas ter fl(2)d gene is needed for the\nfemale-sp ecific splicing of Sex-le thal RNA. The EMBO journal. 1990; 9(8):2597– 602. PMID: 169515 0;\nPubMed Central PMCID: PMC552292 .\n17. Granadin o B, Penalva LO, Sanche z L. The gene fl(2)d is needed for the sex-specific splicing of trans-\nformer pre-mRN A but not for double-sex pre-mRNA in Drosophil a melanogas ter. Molecular & genera l\ngenetics: MGG. 1996; 253(1–2):2 6–31. PMID: 9003283 .\n18. Yan D, Perrimon N. spenito is required for sex determinat ion in Drosophil a melanog aster. Procee dings\nof the National Academy of Sciences of the United States of America. 2015; 112(37 ):11606–11. https://\ndoi.org/10.10 73/pnas.15 15891112 PMID: 26324914; PubMed Central PMCID: PMC457717 8.\n19. Granadin o B, San Juan A, Santama ria P, Sanchez L. Evidence of a dual function in fl(2)d, a gene\nneeded for Sex-leth al express ion in Drosophil a melanog aster. Genet ics. 1992; 130(3):597 –612. PMID:\n1551580; PubMed Central PMCID: PMC12 04876.\n20. Burtis KC, Coschigano KT, Baker BS, Wensink PC. The doublesex proteins of Drosophil a melanog a-\nster bind directly to a sex-spec ific yolk protein gene enhancer. The EMBO journal. 1991; 10(9):2577 –\n82. PMID: 190791 3; PubMed Central PMCID: PMC452955 .\n21. Inoue K, Hoshijim a K, Higuchi I, Sakamoto H, Shimura Y. Binding of the Drosophil a transfor mer and\ntransforme r-2 proteins to the regulatory elements of doublesex primary transcrip t for sex-specific RNA\nprocessing . Proceedings of the National Academy of Sciences of the United States of America. 1992;\n89(17):809 2–6. PMID: 1518835; PubMed Central PMCID: PMC49862.\n22. Lynch KW, Maniatis T. Assembly of specific SR protein complexes on distinct regulatory elements of\nthe Drosophil a doubles ex splicing enhancer. Genes & develop ment. 1996; 10(16):208 9–101. PMID:\n8769651.\n23. Williams TM, Selegue JE, Werner T, Gompel N, Kopp A, Carroll SB. The regulation and evolution of a\ngenetic switch controlling sexually dimorph ic traits in Drosophil a. Cell. 2008; 134(4):610 –23. https://doi.\norg/10.1016/ j.cell.2008.06 .052 PMID: 18724934; PubMed Central PMCID: PMC259719 8.\n24. Shirangi TR, Dufour HD, Williams TM, Carroll SB. Rapid evolution of sex pherom one-produ cing enzyme\nexpression in Drosophil a. PLoS biology. 2009; 7(8):e1000 168. https://doi.or g/10.137 1/journal.pb io.\n1000168 PMID: 19652700; PubMed Central PMCID: PMC271133 6.\n25. Coschigano KT, Wensink PC. Sex-specifi c transcript ional regulation by the male and female double sex\nproteins of Drosophila. Genes & developme nt. 1993; 7(1):42–54 . PMID: 8422987.\n26. Clough E, Jimenez E, Kim YA, Whitworth C, Neville MC, Hempel LU, et al. Sex- and tissue-sp ecific\nfunctions of Drosophil a doubles ex transcrip tion factor target genes. Developm ental cell. 2014; 31\n(6):761–73 . https://doi. org/10.1016/j .devcel.201 4.11.021 PMID: 25535918; PubMed Central PMCID:\nPMC427565 8.\n27. Erdman SE, Burtis KC. The Drosophil a doubles ex proteins share a novel zinc finger related DNA bind-\ning domain. The EMBO journal. 1993; 12(2):527– 35. PMID: 8440242; PubMed Central PMCID:\nPMCPMC4 13235.\n28. Arbeitman MN, New FN, Fear JM, Howard TS, Dalton JE, Graze RM. Sex Differences in Drosophil a\nSomatic Gene Expressio n: Variation and Regulatio n by doubles ex. G3. 2016; 6(7):1799– 808. https://\ndoi.org/10.15 34/g3.116.0279 61 PMID: 27172187; PubMed Central PMCID: PMC493863 5.\n29. Ma Q, Wawers ik M, Matunis EL. The Jak-STAT target Chinmo prevents sex transforma tion of adult\nstem cells in the Drosophil a testis niche. Developm ental cell. 2014; 31(4):474– 86. https://doi.or g/10.\n1016/j.dev cel.2014.1 0.004 PMID: 254535 58; PubMed Central PMCID: PMC425458 8.\n30. Shapiro-K ulnane L, Smolko AE, Salz HK. Maintena nce of Drosophil a germline stem cell sexual identity\nin oogenes is and tumorigen esis. Developm ent. 2015; 142(6):107 3–82. https://doi.or g/10.124 2/dev.\n116590 PMID: 257582 21; PubMed Central PMCID: PMC436017 6.\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 24 / 27\n31. Yang SY, Baxter EM, Van Doren M. Phf7 controls male sex determin ation in the Drosophil a germline.\nDevelopm ental cell. 2012; 22(5):1041 –51. https://doi.or g/10.101 6/j.devcel.20 12.04.013 PMID:\n22595675; PubMed Central PMCID: PMC3 635078.\n32. Waterbury JA, Horabin JI, Bopp D, Schedl P. Sex determination in the Drosophil a germlin e is dictated\nby the sexual identity of the surround ing soma. Genetics. 2000; 155(4):174 1–56. PMID: 109244 71;\nPubMed Central PMCID: PMC146117 8.\n33. Wawersik M, Milutinovich A, Casper AL, Matunis E, Williams B, Van Doren M. Somatic control of germ-\nline sexual developme nt is mediated by the JAK/STA T pathway. Nature. 2005; 436(7050) :563–7.\nhttps://doi.or g/10.103 8/nature0384 9 PMID: 16049490; PubMed Central PMCID: PMC142137 8.\n34. Murray SM, Yang SY, Van Doren M. Germ cell sex determin ation: a collaborat ion between soma and\ngermline. Current opinion in cell biology. 2010; 22(6):722– 9. https://doi. org/10.1016/j .ceb.2010 .09.006\nPMID: 210302 33; PubMed Central PMCID: PMC299626 0.\n35. Fairchild MJ, Smendziu k CM, Tanentzap f G. A somatic permeab ility barrier around the germlin e is\nessential for Drosophil a spermatog enesis. Development. 2015; 142(2):268 –81. https://doi. org/10.1242/\ndev.1149 67 PMID: 25503408.\n36. Amoyel M, Hillion KH, Margoli s SR, Bach EA. Somatic stem cell differentiat ion is regulated by PI3K/To r\nsignaling in response to local cues. Developm ent. 2016; 143(21):39 14–25. https://doi.or g/10.124 2/dev.\n139782 PMID: 276339 89; PubMed Central PMCID: PMC511714 6.\n37. Hardy RW, Tokuyasu KT, Lindsley DL, Garavito M. The germina l proliferatio n center in the testis of Dro-\nsophila melanog aster. Journal of ultrastruc ture research. 1979; 69(2):180– 90. PMID: 114676.\n38. Zoller R, Schulz C. The Drosophil a cyst stem cell lineage: Partners behind the scenes ? Spermatogene -\nsis. 2012; 2(3):145–5 7. https://d oi.org/10.416 1/spmg.2138 0 PMID: 23087834; PubMed Central\nPMCID: PMC346943 8.\n39. Gilboa L, Lehmann R. Soma-g ermline interaction s coordinate homeost asis and growth in the Drosoph-\nila gonad. Nature. 2006; 443(7107) :97–100 . https://doi.or g/10.103 8/nature0506 8 PMID: 169367 17.\n40. Amoyel M, Sanny J, Burel M, Bach EA. Hedgehog is required for CySC self-renew al but does not con-\ntribute to the GSC niche in the Drosophil a testis. Developm ent. 2013; 140(1):56– 65. https://doi.or g/10.\n1242/dev .086413 PMID: 231756 33; PubMed Central PMCID: PMC351399 2.\n41. Kiger AA, Jones DL, Schulz C, Rogers MB, Fuller MT. Stem cell self-renew al specified by JAK-STAT\nactivation in response to a support cell cue. Science. 2001; 294(5551) :2542–5 . https://doi.or g/10.112 6/\nscience.1066 707 PMID: 11752574.\n42. Tran J, Brenner TJ, DiNardo S. Somatic control over the germline stem cell lineage during Drosophil a\nspermatog enesis. Nature. 2000; 407(6805) :754–7. https:// doi.org/10.10 38/3503 7613 PMID:\n11048723.\n43. Margolis J, Spradling A. Identificati on and behavio r of epithel ial stem cells in the Drosophil a ovary.\nDevelopm ent. 1995; 121(11):37 97–807 . PMID: 8582289.\n44. Zhang Y, Kalderon D. Hedgehog acts as a somatic stem cell factor in the Drosophil a ovary. Nature.\n2001; 410(6828) :599–60 4. https://doi.or g/10.103 8/35069099 PMID: 112795 00.\n45. Sahai-Herna ndez P, Nystul TG. A dynamic population of stromal cells contribu tes to the follicle stem\ncell niche in the Drosophil a ovary. Developm ent. 2013; 140(22):44 90–8. https://doi.or g/10.124 2/dev.\n098558 PMID: 241316 31; PubMed Central PMCID: PMC381793 9.\n46. Nystul T, Spradling A. An epithelial niche in the Drosophil a ovary undergoes long-rang e stem cell\nreplacem ent. Cell stem cell. 2007; 1(3):277–8 5. https://doi.or g/10.1016/j. stem.2007.07 .009 PMID:\n18371362.\n47. Kiger AA, White-Coo per H, Fuller MT. Somatic support cells restrict germline stem cell self-ren ewal and\npromote differentiation . Nature. 2000; 407(6805) :750–4. https://doi.or g/10.1038 /35037606 PMID:\n11048722.\n48. Tulina N, Matunis E. Control of stem cell self-renew al in Drosophil a spermatog enesis by JAK-STAT sig-\nnaling. Science. 2001; 294(5551) :2546–9 . https://doi.or g/10.112 6/science.106 6700 PMID: 11752575.\n49. Michel M, Kupinski AP, Raabe I, Bokel C. Hh signalling is essential for somatic stem cell maintenanc e in\nthe Drosophil a testis niche. Development. 2012; 139(15):26 63–9. https://doi.o rg/10.1242/de v.075242\nPMID: 227453 10.\n50. Cook MS, Cazin C, Amoyel M, Yamamoto S, Bach E, Nystul T. Neutral Competition for Drosophil a Folli-\ncle and Cyst Stem Cell Niches Require s Vesicle Trafficking Genes. Genetic s. 2017; 206(3):141 7–28.\nhttps://doi.or g/10.153 4/genetics.1 17.2012 02 PMID: 28512187.\n51. Castanieto A, Johnston MJ, Nystul TG. EGFR signaling promotes self-renew al through the establish-\nment of cell polarity in Drosophil a follicle stem cells. eLife. 2014; 3. https://doi.or g/10.755 4/eLife.04437\nPMID: 254373 06; PubMed Central PMCID: PMC429869 9.\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 25 / 27\n52. Wu X, Tanwar PS, Raftery LA. Drosophil a follicle cells: morpho genesis in an eggshell. Semina rs in cell\n& developme ntal biology. 2008; 19(3):271– 82. https://doi. org/10.1016/j .semcdb .2008.01.004 PMID:\n18304845; PubMed Central PMCID: PMC2 430523.\n53. Horne-Badov inac S, Bilder D. Mass transit: epithel ial morpho genesis in the Drosophil a egg chamber.\nDevelopm ental dynamics: an official publicati on of the American Association of Anatomists. 2005; 232\n(3):559–74 . https://doi. org/10.1002/d vdy.20286 PMID: 15704134.\n54. Flaherty MS, Salis P, Evans CJ, Ekas LA, Marouf A, Zavadil J, et al. chinmo is a functional effector of\nthe JAK/STA T pathway that regulat es eye develop ment, tumor formation , and stem cell self-re newal in\nDrosophil a. Developm ental cell. 2010; 18(4):556– 68. https://doi.or g/10.1016/ j.devcel.201 0.02.006\nPMID: 204127 71; PubMed Central PMCID: PMC285920 8.\n55. Ma Q, de Cueva s M, Matunis EL. Chinmo is sufficient to induce male fate in somat ic cells of the adult\nDrosophil a ovary. Development. 2016; 143(5):754 –63. https://doi.o rg/10.1242/de v.129627 PMID:\n26811385; PubMed Central PMCID: PMC4 813340.\n56. Siggs OM, Beutler B. The BTB-ZF transcrip tion factors. Cell cycle. 2012; 11(18):335 8–69. https:// doi.\norg/10.4161/ cc.21277 PMID: 22894929; PubMed Central PMCID: PMC34 66544.\n57. Ito H, Fujitani K, Usui K, Shimizu- Nishikawa K, Tanaka S, Yamamoto D. Sexual orientation in Drosoph-\nila is altered by the satori mutation in the sex-deter mination gene fruitless that encodes a zinc finger pro-\ntein with a BTB domain. Proceedings of the National Academy of Sciences of the United States of\nAmerica. 1996; 93(18):968 7–92. PMID: 8790392; PubMed Central PMCID: PMC38490.\n58. Xiong WC, Montell C. tramtrack is a transcript ional repres sor required for cell fate determin ation in the\nDrosophil a eye. Genes & developme nt. 1993; 7(6):1085– 96. PMID: 8504931.\n59. Amoyel M, Anders on J, Suisse A, Glasner J, Bach EA. Socs36E Controls Niche Compet ition by\nRepressing MAPK Signaling in the Drosophila Testis . PLoS genetics. 2016; 12(1):e100 5815. https://\ndoi.org/10.13 71/journal.p gen.1005815 PMID: 26807580; PubMed Central PMCID: PMC472649 0.\n60. Leatherm an JL, Dinardo S. Germline self-renew al requires cyst stem cells and stat regulates niche\nadhesio n in Drosophil a testes. Nature cell biology. 2010; 12(8):806– 11. https://doi.or g/10.1038/\nncb2086 PMID: 20622868; PubMed Central PMCID: PMC2917 891.\n61. Pan Y, Robinett CC, Baker BS. Turnin g males on: activation of male courtship behavio r in Drosophil a\nmelanog aster. PloS one. 2011; 6(6):e211 44. Epub 2011/07/07. https://doi.or g/10.1371/jour nal.pon e.\n0021144 PMID: 21731661; PubMed Central PMCID: PMCPMC3 120818.\n62. Nagarkar -Jaiswal S, DeLuca SZ, Lee PT, Lin WW, Pan H, Zuo Z, et al. A genetic toolkit for tagging intro-\nnic MiMIC containin g genes. eLife. 2015; 4. Epub 2015/06/ 24. https://doi.or g/10.7554 /eLife.08469\nPMID: 261025 25; PubMed Central PMCID: PMCPMC4 499919.\n63. Pfeiffer BD, Jenett A, Hammonds AS, Ngo TT, Misra S, Murphy C, et al. Tools for neuroanatom y and\nneurogeneti cs in Drosophil a. Proceedings of the National Academy of Sciences of the United States of\nAmerica. 2008; 105(28):97 15–20. Epub 2008/07 /16. https://doi. org/10.1073/p nas.0803 697105 PMID:\n18621688; PubMed Central PMCID: PMCPM C2447866 .\n64. Sanders LE, Arbeitm an MN. Doublesex establishe s sexual dimorphism in the Drosophil a central ner-\nvous system in an isoform-depend ent manner by directin g cell number . Developmental biology. 2008;\n320(2):378 –90. https:// doi.org/10.10 16/j.ydbio .2008.05. 543 PMID: 18599032; PubMed Central PMCID:\nPMCPMC2 631280.\n65. Duncan IW, Kaufman TC. Cytoge nic analysis of chromosom e 3 in Drosophil a melanogas ter: mapping\nof the proximal portion of the right arm. Genetics. 1975; 80(4):733– 52. PMID: 811500 ; PubMed Central\nPMCID: PMC121337 2.\n66. Le Bras S, Van Doren M. Developm ent of the male germline stem cell niche in Drosophil a. Develop-\nmental biology. 2006; 294(1):92 –103. https://doi.or g/10.101 6/j.ydbio.20 06.02.030 PMID: 165669 15.\n67. McKeown M, Belote JM, Boggs RT. Ectopic expression of the female transfor mer gene product leads to\nfemale differentiation of chromosom ally male Drosophil a. Cell. 1988; 53(6):887– 95. PMID: 2454747.\n68. Leatherm an JL, Dinardo S. Zfh-1 controls somatic stem cell self-re newal in the Drosophil a testis and\nnonautonom ously influences germline stem cell self-renew al. Cell stem cell. 2008; 3(1):44–54 . https:/ /\ndoi.org/10.10 16/j.stem.200 8.05.001 PMID: 18593558; PubMed Central PMCID: PMC26 01693.\n69. Li MA, Alls JD, Avancini RM, Koo K, Godt D. The large Maf factor Traffic Jam controls gonad morpho-\ngenesis in Drosophil a. Nature cell biology. 2003; 5(11):994– 1000. https://doi.or g/10.103 8/ncb1058\nPMID: 145789 08.\n70. Celniker SE, Dillon LA, Gerstein MB, Gunsalus KC, Henikoff S, Karpen GH, et al. Unlocking the secrets\nof the genome. Nature. 2009; 459(7249) :927–30 . https://doi.or g/10.1038 /459927a PMID: 1953625 5;\nPubMed Central PMCID: PMC284354 5.\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 26 / 27\n71. Sinden D, Badgett M, Fry J, Jones T, Palmen R, Sheng X, et al. Jak-STAT regulation of cyst stem cell\ndevelop ment in the Drosophil a testis. Developm ental biology. 2012; 372(1):5–1 6. https://doi.or g/10.\n1016/j.ydb io.2012.09. 009 PMID: 23010510; PubMed Central PMCID: PMCPM C3481170 .\n72. Hempel LU, Oliver B. Sex-speci fic Doublesex M expression in subsets of Drosophila somatic gonad\ncells. BMC developme ntal biology. 2007; 7:113. https://doi. org/10.1186/1 471-213X- 7-113 PMID:\n17935627; PubMed Central PMCID: PMC2 148063.\n73. Evans DS, Cline TW. Drosophila switch gene Sex-lethal can bypass its switch- gene target transforme r\nto regulate aspects of female behavio r. Proceedings of the National Academy of Sciences of the United\nStates of America. 2013; 110(47):E 4474–81. https://doi.o rg/10.1073/pn as.13190 63110 PMID:\n24191002; PubMed Central PMCID: PMC3 839706.\n74. Sun X, Yang H, Sturgill D, Oliver B, Rabinow L, Samson ML. Sxl-Depe ndent, tra/tra2-Inde pendent Alter-\nnative Splicing of the Drosophil a melanog aster X-Linked Gene found in neurons . G3. 2015; 5\n(12):2865– 74. https://d oi.org/10.153 4/g3.115 .023721 PMID: 265114 98; PubMed Central PMCID:\nPMCPMC4 683657.\n75. Bischof J, Maeda RK, Hediger M, Karch F, Basler K. An optimized transgen esis system for Drosophil a\nusing germ-l ine-specific phiC31 integras es. Proceeding s of the National Academy of Sciences of the\nUnited States of America. 2007; 104(9):331 2–7. https://doi.or g/10.107 3/pnas.06 11511104 PMID:\n17360644; PubMed Central PMCID: PMCPM C1805588 .\nChinmo represses transforme r altern ative splicing\nPLOS Genetics | https:// doi.org/10.13 71/journal.p gen.100 7203 February 1, 2018 27 / 27",
  "topic": "Biology",
  "concepts": [
    {
      "name": "Biology",
      "score": 0.8994676470756531
    },
    {
      "name": "Somatic cell",
      "score": 0.7793369293212891
    },
    {
      "name": "Doublesex",
      "score": 0.7097907662391663
    },
    {
      "name": "Germline",
      "score": 0.6731946468353271
    },
    {
      "name": "Alternative splicing",
      "score": 0.5930747389793396
    },
    {
      "name": "Gene isoform",
      "score": 0.5626714825630188
    },
    {
      "name": "RNA splicing",
      "score": 0.5521374344825745
    },
    {
      "name": "Genetics",
      "score": 0.5050960183143616
    },
    {
      "name": "Feminization (sociology)",
      "score": 0.44845080375671387
    },
    {
      "name": "Cell biology",
      "score": 0.4134174883365631
    },
    {
      "name": "Gene",
      "score": 0.22325846552848816
    },
    {
      "name": "RNA",
      "score": 0.06950211524963379
    },
    {
      "name": "Sociology",
      "score": 0.0
    },
    {
      "name": "Social science",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I57206974",
      "name": "New York University",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I47508984",
      "name": "Imperial College London",
      "country": "GB"
    }
  ]
}