{
  "title": "Use of nanoparticle concentration as a tool to understand the structural properties of colloids",
  "url": "https://openalex.org/W2782938904",
  "year": 2018,
  "authors": [
    {
      "id": "https://openalex.org/A5074575068",
      "name": "Lígia Nunes de Morais Ribeiro",
      "affiliations": [
        "Universidade Estadual de Campinas (UNICAMP)"
      ]
    },
    {
      "id": "https://openalex.org/A5063780626",
      "name": "Verônica Muniz Couto",
      "affiliations": [
        "Universidade Estadual de Campinas (UNICAMP)"
      ]
    },
    {
      "id": "https://openalex.org/A5080486844",
      "name": "Leonardo Fernandes Fraceto",
      "affiliations": [
        "Universidade Estadual Paulista (Unesp)",
        "Universidade de Sorocaba"
      ]
    },
    {
      "id": "https://openalex.org/A5077139192",
      "name": "Eneida de Paula",
      "affiliations": [
        "Universidade Estadual de Campinas (UNICAMP)"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2414781026",
    "https://openalex.org/W2516577345",
    "https://openalex.org/W2484186669",
    "https://openalex.org/W2528894411",
    "https://openalex.org/W6600305088",
    "https://openalex.org/W2131083445",
    "https://openalex.org/W2053648602",
    "https://openalex.org/W2086610278",
    "https://openalex.org/W2595355199",
    "https://openalex.org/W2595681585",
    "https://openalex.org/W2002759005",
    "https://openalex.org/W1943519585",
    "https://openalex.org/W2027963168",
    "https://openalex.org/W2044638539",
    "https://openalex.org/W2080724281",
    "https://openalex.org/W2618512026",
    "https://openalex.org/W2030423127",
    "https://openalex.org/W2135911681",
    "https://openalex.org/W2057653477",
    "https://openalex.org/W2053117739",
    "https://openalex.org/W2039619039",
    "https://openalex.org/W2081690763",
    "https://openalex.org/W2516651796",
    "https://openalex.org/W2683554665",
    "https://openalex.org/W1986516374",
    "https://openalex.org/W2028258807",
    "https://openalex.org/W2165726487",
    "https://openalex.org/W3169033444"
  ],
  "abstract": null,
  "full_text": "1\nSCIENTIfIC  REPORTs  |  (2018) 8:982  | DOI:10.1038/s41598-017-18573-7\nwww.nature.com/scientificreports\nUse of nanoparticle concentration \nas a tool to understand the \nstructural properties of colloids\nLígia Nunes de Morais Ribeiro  1, Verônica Muniz Couto1, Leonardo Fernandes Fraceto2 & \nEneida de Paula1\nElucidation of the structural properties of colloids is paramount for a successful formulation. However, \nthe intrinsic dynamism of colloidal systems makes their characterization a difficult task and, in \nparticular, there is a lack of physicochemical techniques that can be correlated to their biological \nperformance. Nanoparticle tracking analysis (NTA) allows measurements of size distribution and \nnanoparticle concentration in real time. Its analysis over time also enables the early detection of \nphysical instability in the systems not assessed by subtle changes in size distribution. Nanoparticle \nconcentration is a parameter with the potential to bridge the gap between in vitro characterization \nand biological performance of colloids, and therefore should be monitored in stability studies of \nformulations. To demonstrate this, we have followed two systems: extruded liposomes exposed to \nincreasing CHCl\n3 concentrations, and solid lipid nanoparticles prepared with decreasing amounts of \npoloxamer 188. NTA and dynamic light scattering (DLS) were used to monitor changes in nanoparticle \nnumber and size, and to estimate the number of lipid components per particle. The results revealed a \nstrong negative correlation between particle size (determined by DLS) and concentration (assessed by \nNTA) in diluted samples, which should be adopted to monitor nanocolloidal stability, especially in drug \ndelivery.\nColloids are defined as complex systems composed of solid particles dispersed in a liquid, governed by a high \ninternal kinetic energy\n1. They are widely studied in biological, food and environmental fields, and Ostwald said \n‘all life processes take place in a colloidal system’ 2. Characterization of these dynamic systems is the first and \nessential step for innovative nanocolloid development. However, there is still a lack of methods that can help to \npredict the in vivo performance of nanostructured colloids\n3.\nThere are many processes that can affect the physicochemical stability of colloidal systems, such as agglutina-\ntion, sedimentation and Ostwald ripening. In the case of drug delivery systems, for instance, the resulting heter-\nogeneous size distribution and larger particle size1 prevent their application. Therefore, accelerated or long-term \nstudy of physicochemical stability must be performed for those formulations 4. In general, parameters such as \nparticle size and distribution are followed over time by particle-tracking approaches based on the Brownian \nmotion principle\n5, such as photocorrelation spectroscopy/dynamic light scattering (DLS), laser diffraction analy-\nsis and nanoparticle tracking analysis (NTA). DLS is the gold standard method applied in stability monitoring of \nformulations. Its measurement considers the intensity of light scattered by spherical particles, which prevents its \napplication for highly polydisperse\n6 and non-spherical colloidal systems.\nNTA is a novel, number-based tracking approach7 that provides unique information of the dispersed nano-\nparticle concentration of a known volume in real time8. Determination of the concentration does not depend on \nthe intensity of the light scattered by the particles9 and, therefore, it can also be applied for the characterization of \nnon-spherical particles such as carbon nanotubes, clays or fluorescent aggregates. Its use and implications have \nguided different biological studies, such as cell viability, cyto- and nanotoxicity assays and in vivo efficacy studies \nin pharmaceutical and environmental fields\n10–14, as well as in clinical treatment (e.g. monitoring and diagnosis \nin chronic lymphocytic leukaemia) 15. Although promising, the use of nanoparticle concentration is still scarce \n1Department of Biochemistry and Tissue Biology, Institute of Biology, University of Campinas (UNICAMP), Campinas, \nSão Paulo, Brazil. 2São Paulo State University (UNESP), Institute of Science and Technology of Sorocaba, Laboratory \nof Environmental Nanotechnology, Sorocaba, São Paulo, Brazil. Lígia Nunes de Morais Ribeiro and Eneida de Paula \ncontributed equally to this work. Correspondence and requests for materials should be addressed to L.N.d.M.R. \n(email: nuneslica@gmail.com) or E.d.P . (email: depaula@unicamp.br)\nReceived: 6 October 2017\nAccepted: 14 December 2017\nPublished: xx xx xxxx\nOPEN\n\nwww.nature.com/scientificreports/\n2\nSCIENTIfIC  REPORTs  |  (2018) 8:982  | DOI:10.1038/s41598-017-18573-7\nin the literature, probably due to the indispensable operator training for the so-called ‘visual validation’ of NTA \ndetermination8. Until 2011, only two works had employed the number of nanoparticles as a parameter to evaluate \nnanotoxicity in ecotoxicity/environmental studies, against 18 others that compared DLS and NTA in the charac-\nterization of particle size and distribution\n9.\nIn 2016, when NTA was 10 years old, the International Standard Particle Tracking Analysis Guide (ISO 19430) \nwas launched, providing specifications for the measurement of particle size distribution and concentration in \nnanosystem characterization using NTA. The guide preconizes the use of number-based particle size distribu-\ntion and direct results interpretation, and specifies quality technical parameters, among others\n16. Nanoparticle \nconcentration seems to be the bridge over the current abyss between in vitro  characterization data and in vivo  \nperformance of nanosystems.\nIn this study, we firstly compared DLS (standard) and NTA (novel) in the evaluation of particle size and poly-\ndispersity of extruded liposomes composed of hydrogenated soy phosphatidylcholine: cholesterol (HSPC:Chol, \n2: 1 mol%). The accuracy of the NTA method for laboratorial formulations was confirmed for this (two lipid) \nheterogeneous formulation. Then, taking into account that size distribution is a good indicator of instability for \ncolloidal systems, we checked whether changes in this parameter would directly affect the number of nanoparti-\ncles in the system. For that, we intentionally destabilized unilamellar liposomes (composed of dipalmitoyl phos-\nphatidylcholine, DPPC) and solid lipid nanoparticles (SLN, composed of cetyl palmitate and poloxamer 188) to \nevaluate the correlation between particle size (measured by DLS) and nanoparticle concentration (NTA). In this \ncontext, we show here the advantages of using NTA to investigate the stability of colloidal systems, focusing on \nthose designed for the delivery of active molecules (drug delivery systems).\nResults\nFollowing the decrease in size during extrusion of liposomes. The particle size distribution of \nHSPC:Chol (2:1 mol%) liposomes was determined using DLS and NTA techniques (Fig. 1). Data were recorded \nafter each extrusion passage (from 0 to 6). The particle size of non-extruded liposomes (0 passages) was 569 ± 61.2 \nand 301 ± 51.1 nm according to DLS and NTA, respectively. For liposomes extruded once (1), the sizes decreased \nto 306 ± 4.0 nm by DLS and 188 ± 6.8 nm by NTA (Fig. 1A), with polydispersity index (PDI) and Span values \naround 0.4 and 1.3 (Fig. 1B), respectively. For liposomes submitted to the complete extrusion cycle (6 times), the \nparticle sizes observed were 162.5 ± 1.4 nm by DLS and 162.4 ± 2.8 nm by NTA (Fig. 1A), with PDI <0.150 and \nSpan <1 (Fig. 1B), respectively.\nOn the other hand, the nanoparticle concentration varied from 7.8 × 1010 particles/mL for non-extruded \nliposomes to 2.3 × 1011 particles/mL (Fig. 1A) after the complete (6) extrusion cycle. Accordingly, the estimated \nnumber of HSPC molecules per particle – taken from the lipid concentration (mol/mL) divided by the number of \nnanoparticles/mL – decreased from 9.6 × 10\n5 (non-extruded) to 3.3 × 105 after six extrusion passages (Fig. 1A).\nDestabilization of nanostructured colloidal systems. Two different colloidal systems were prepared, \nand their dispersed nanoparticles were destabilized to form larger ones. Transmission electron microscopy \n(TEM) was carried out to characterize the great morphological changes in the colloidal systems after destabiliza-\ntion. During the destabilization process, particle size and concentration (assessed by DLS and NTA, respectively) \nwere followed, and the correlation coefficient (r) between them was registered.\nDPPC liposomes. First, liposomes composed of DPPC (0.125  mM) were extruded six times through 100  nm \npolycarbonate membranes. The resulting unilamellar vesicles were then destabilized with increasing chloro-\nform (CHCl\n3) concentrations. The addition of small aliquots of CHCl3 to the extruded liposomes increased the \nFigure 1. HSPC:Chol (2: 1 mol%) liposomes. Relationship between particle size, measured by DLS (undiluted \nsamples) or NTA (200× dilution), and nanoparticle concentration (A), and polydispersity and Span indices \n(B) as a function of the number of extrusion passages. The correlation coefficients between the particle size \nvalues measured by DLS and NTA, and PDI vs. Span values through the extrusion cycle were: r = 0.98 and 0.75, \nrespectively. At the bottom of plot A, the number of HSPC molecules/liposome for the initial (non-extruded) \nand six-times extruded vesicles are given. [HSPC:Chol] = 0.125 mM.\nwww.nature.com/scientificreports/\n3\nSCIENTIfIC  REPORTs  |  (2018) 8:982  | DOI:10.1038/s41598-017-18573-7\nparticle size measured by DLS, from 116 ± 1.8 nm (CHCl3-free) to 658 ± 17 nm (Fig. 2A), in the presence of \nCHCl3 (2: 100 v/v).\nThe increase in particle size was confirmed by TEM (Fig.  2C,D,F and G), in which ImageJ software allowed \nquantification of the particle size distribution (Fig. 2E and H). Figures 2C and D show the untreated liposomes, \nand Figures 2F and G show liposomes treated with CHCl3 (2: 100 v/v).\nInversely, the nanoparticle concentration decreased with increasing CHCl3 concentrations, from 9 ± 0.7 × 1011 \nparticles/mL (without chloroform) to 2 ± 0.1 × 1011 particles/mL (CHCl 3 2: 100 v/v), as measured by NTA \n(Fig.  2A), accompanied by an increase in the number of DPPC molecules per liposome, from 8.0 × 104 to \n35.7 × 104 (Table 1). A strong negative correlation (r = −0.92) between particle size (DLS) and nanoparticle con-\ncentration (NTA) values was detected, as shown in Fig. 2B.\nSolid lipid nanoparticles. Five SLN formulations with the same lipid concentration (cetyl palmitate, CP = 10%) \nand decreasing concentrations of the non-ionic surfactant poloxamer 188 (PL = 5% to 0.1%) were prepared and \nanalysed by DLS, NTA (Fig. 3A), and TEM (Fig. 3C–F). A reduction in PL concentration induced changes in par-\nticle size – which ranged from 232 to 1644 nm – accompanied by a decrease in nanoparticle concentration – from \n6.0 × 1013 to 0.4 × 1013 particles/mL. The inverse correlation between particle size (DLS) and nanoparticle con-\ncentration (NTA) was detected (r = −0.81, Fig. 3B). Accordingly, the number of CP molecules per SLN increased \nfrom 2.0 × 106 to 2.6 × 107, as shown in Table 2.\nFigure 2. Destabilization of DPPC liposomes by chloroform. (A) Changes in particle size (measured by DLS) \nand nanoparticle concentration (assessed by NTA); (B) correlation between particle size and concentration \n(r = −0.92). TEM images of intact liposomes (C,D) and liposomes treated with CHCl3 (2: 100 v/v) (F,G), and \ntheir corresponding particle size distribution profile (E,H) calculated with ImageJ software. Magnifications and \nscale bars are displayed per sample.\nwww.nature.com/scientificreports/\n4\nSCIENTIfIC  REPORTs  |  (2018) 8:982  | DOI:10.1038/s41598-017-18573-7\nThe variation in particle size observed for SLN1 and SLN5 was also demonstrated by TEM (Fig.  3C–E). \nHowever, quantification of the particle size distribution using ImageJ software was only possible for SLN1 \n(Fig. 3F) since the polydispersity of SLN5 curbed its micrographic analysis.\nDiscussion\nA considerable number of studies have compared the DLS and NTA methods, showing the accuracy, advantages \nand drawbacks of each technique, and considering their peculiarities. However, all those studies have employed \nstandard nanoparticles, such as polystyrene beads\n8,17,18. Such ideal systems do not reproduce the size distribution \nof formulations developed in research laboratories, which have a less homogeneous size distribution. Hence, \nto compare the DLS and NTA methods, we prepared different and more realistic lipid-based colloidal systems: \nliposomes and SLN.\nCHCl3 \n(molecules/mL) Size (nm)\nLiposome concentration \n(particles/mL)\nDPPC per liposome \n(molecules/particle)\n0 116.5 ± 1.8 9.4 ± 0.7 × 10\n11 8.0 × 104\n7.2 × 1016 171.8 ± 2.3 6.4 ± 0.2 × 1011 11.7 × 104\n11.4 × 1016 491.9 ± 19.4 3.1 ± 0.6 × 1011 24.2 × 104\n15.0 × 1016 657.6 ± 17.0 2.1 ± 0.1 × 1011 35.7 × 104\nTable 1. Structural effects in liposomes destabilized by CHCl3 addition, evaluated in terms of size (DLS) and \nconcentration (NTA) of particles. The number of DPPC molecules per vesicle was calculated from the number \nof particles and DPPC concentration (mol/L) in the formulation.\nFigure 3. Destabilization of SLN formulations. (A) Changes in particle size (measured by DLS) and \nnanoparticle concentration (assessed by NTA) in SLN composed of 10% cetyl palmitate and decreasing \nconcentrations (5 to 0.1%) of poloxamer 188; (B) correlation between particle size and concentration \n(r = −0.81). (C,E) TEM images of SLN1, prepared with 5% PL, and its corresponding particle size distribution \nprofile (F), calculated with ImageJ software; (D) TEM image of SLN5, prepared with 0.1% PL, for which it was \nnot possible to obtain the distribution size profile (see text). Magnification and scale bars are displayed per \nsample.\nwww.nature.com/scientificreports/\n5\nSCIENTIfIC  REPORTs  |  (2018) 8:982  | DOI:10.1038/s41598-017-18573-7\nDLS is the gold standard method for characterizing colloidal systems, despite its poor accuracy for highly \npolydisperse samples and non-spherical particles8. This explains the differences in particle size of liposomes with \n0 or 1 extrusion passages, measured by DLS and NTA. The particle-by-particle counting approach adopted by \nthe NTA method provides robust characterization of heterogeneous particle size distribution, since – differently \nto DLS – changes in the intensity of light scattered by large and small particles do not affect determination of the \nhydrodynamic diameter by NTA\n9. This is particularly useful for the characterization of a colloidal system formed \nby a complex mixture of submicron and nanometric particles 17, such as biomimetic systems (liposomes) and \nmembrane fractions (e.g. exosomes, buddings, detergent-resistant membranes)7.\nSize vs. number of particles during extrusion of liposomes. As expected, the particle size, PDI, and \nSpan values of liposomes decreased as a function of the number of extrusion cycles, measured by both methods. \nAt the end of the extrusion cycle, the liposome diameters determined by these two techniques were very similar \nand strongly positively correlated. Accordingly, the PDI (DLS) and Span (NTA) values were lower than 0.2 and \n1, respectively, characterizing a monodisperse distribution\n19,20. Both techniques were analytical for characteriza-\ntion, but NTA has the advantage of using highly diluted samples (ca. 200 times higher than DLS). These results \ndemonstrated the accuracy of NTA in the determination of particle size and nanoparticle concentration in col-\nloidal systems.\nChanges in liposome concentration (particles/mL) during the extrusion cycle were also monitored (Fig. 1A) \nwith NTA. As expected, the extrusion process led to a higher number of small particles originated from the larger \nmultilamellar ones\n21. From non-extruded liposomes to liposomes submitted to the complete (6) extrusion cycle, \na directly proportional increase in the number of nanoparticles was registered. Y et the decrease in vesicle size was \naccompanied by enhancement in the number of liposome particles in suspension, suggesting that these parame-\nters are related and should be explored in more depth.\nEstimation of the number of lipid molecules per liposome particle. During extrusion, the number \nof lipid molecules per liposome decreased, as exemplified for HSPC molecules (Fig. 1A). The number of HSPC/\nliposome, as shown in Table 1, was taken directly from the number of lipid molecules in the 0.125 mM liposomal \nsuspension (7.5 × 1016) divided by the number of particles determined by NTA. Using an alternative method, as \nshown in Fig. 4A, we estimated the number of lipid molecules that could be loaded per liposome of a given size, \nand the values agree very well with those determined from NTA data. To estimate the number of lipids/vesicle, we \nFormulation\nPL concentration \n(%) Size (nm)\nSLN concentration \n(particles/mL)\nCP per SLN \n(molecules/\nparticle)\nSLN1 5 232.1 ± 2.7 61.3 ± 0.2 × 10\n12 2.0 × 106\nSLN2 3 284.2 ± 9.9 33.6 ± 0.6 × 1012 3.7 × 106\nSLN3 1 499.1 ± 0.4 27.2 ± 0.5 × 1012 4.6 × 106\nSLN4 0.25 540.9 ± 20.5 23.3 ± 0.8 × 1012 5.4 × 106\nSLN5 0.1 1644.3 ± 255.9 4.8 ± 0.1 × 1012 2.6 × 107\nTable 2. Structural effects in SLN prepared with different poloxamer 188 ratios, evaluated in terms of size \n(DLS) and concentration (NTA) of particles. The number of cetyl palmitate (CP) molecules per SLN was \ncalculated from the number of nanoparticles and CP concentration in the formulation (mol/L).\nFigure 4. Theoretically vs. experimentally determined number of lipid molecules/liposome (A) and number \nof particles/mL (B) during the extrusion process. The number of HSPC molecules that could be loaded per \nliposome was estimated from the surface area of HSPC:Chol liposomes (considering the average size of the \nvesicles determined by DLS or NTA) divided by the area occupied by the lipid polar head. The number of HSPC \nmolecules was also taken from the number of particles – determined by NTA – divided by the number of HSPC \nmolecules in 0.125 mM suspension (7.5 × 10\n16 molecules).\nwww.nature.com/scientificreports/\n6\nSCIENTIfIC  REPORTs  |  (2018) 8:982  | DOI:10.1038/s41598-017-18573-7\nfirst calculated the surface (sphere) area of the liposomes from their average sizes (measured during the extrusion \nprocess, either by DLS or NTA). Twice the surface area (equivalent to the internal and external monolayers of \nthe liposomes) was then divided by the area occupied by each phosphatidylcholine molecule (55 Å\n2)22 to give the \nnumber of lipids/vesicle.\nAlso, by dividing the number of lipid molecules in the 0.125 mM liposomal suspension (7.5 × 1016) by the \ntheoretical number of lipids/vesicle (estimated as indicated above – Fig.  4A), we could predict the number of \nparticles/mL – according to DLS and NTA average size – as shown in Fig. 4B. As the extrusion process proceeds \ntowards a monodisperse system, the predicted and determined numbers become closer and closer, converging at \n2 × 10\n11 particles/mL. Once more, the good agreement found between the calculated nanoparticle concentration \nand that determined by NTA confirms the certainty and applicability of this technique.\nDestabilization of nanostructured colloidal systems. The most common events affecting the phys-\nicochemical stability of nanostructured colloids are coalescence, agglutination, and the Ostwald ripening. These \nprocesses result in larger and heterogeneous-sized nanoparticles\n1, preventing their application. In an attempt \nto mimic such processes, two different colloidal systems were prepared, and their dispersed nanoparticles were \ndestabilized to form larger ones.\nLiposomes composed of DPPC (0.125 mM) were destabilized upon addition of chloroform (CHCl\n3). The dest-\nabilizing effect of CHCl3 on lipid bilayers occurs by partial solubilization of the lipid’s acyl chains23, and has been \nbroadly explored over decades 24. The addition of CHCl 3 aliquots provided a relevant increase of particle size, \nmeasured by DLS and confirmed by TEM. The absolute size measured by TEM differed to that measured by DLS \nbecause of the well-known limitations of this technique, such as shrinkage and deformation of nanoparticles \nduring the drying process\n25 in sample preparation. Nevertheless, the micrographics confirmed the formation \nof larger liposomes following the CHCl 3 treatment. Inversely, and as expected, the nanoparticle concentration \ndecreased with increased CHCl3 concentration, confirming liposome destabilization.\nIn another set of experiments, a binary, and therefore more complex, lipid-based system of SLN was prepared. \nFive formulations with the same concentration of lipid (CP = 10%) and different amounts of the non-ionic sur-\nfactant PL (5 to 0.1%) were prepared. PL is known to stabilize lipid nanoparticles, physically preventing their \nagglutination\n26. Thus, at low PL concentrations, SLN stability was not maintained, contributing to nanoparticle \naggregation (which prevented quantitative analysis by TEM). As expected, a lack of PL was accompanied by a \ndrastic increase in particle size and number of lipids/particle, and by a decrease in nanoparticle concentration in \nSLN formulations (Fig. 3 and Table 2).\nAltogether, destabilization of the nanostructured colloidal formulations was confirmed by all methods eval-\nuated. The effects of destabilization were similar in both the liposome and SLN systems: an increase/decrease in \nnanoparticle size and concentration, respectively. The correlation coefficients between these parameters were \ndetermined for liposomes (r = −0.92, Fig. 2) and SLN (r = −0.81, Fig. 3). The correlation was higher for lipos-\nomes than SLN, probably due to the complex structural molecular organization of the latter. Considering the \npotential application of nanoparticle concentration in in vitro characterization and biological and clinical studies, \nsuch achievements indicate that particle size and concentration are strictly (inversed) related in different pharma-\nceutical colloidal systems, and should be used to monitor the physicochemical stability of formulations.\nIt is worth mentioning that monitoring of nanoparticle concentration over time can also help early detection \nof system instability, such as in the case of nanoparticle degradation, evidenced by a decrease in the number of \nparticles without a concomitant increase in nanoparticle size. So far, only a few studies have adopted evaluation of \nnanoparticle concentration in the physicochemical stability analysis of pharmaceutical\n4,27,28 and environmental13 \nformulations.\nThe number of nanoparticles can be expressed as the molar concentration of colloidal particles in the formula-\ntion11, and this allows the estimation of the number of excipient molecules that compose each individual particle4, \ntwo important parameters that represent a real advance in the structural elucidation of nanocolloids.\nWe have shown here, for a single component formulation (DPPC liposomes), that the number of lipid mol-\necules per vesicle can be determined from the nanoparticle concentration data, considering the number of lipid \nmolecules in suspension (Table  1). Following the addition of solvent, the resulting destabilized liposomes (of \ngreater size and lower concentration) showed increasing numbers of DPPC molecules per nanoparticle, in com-\nparison to the initial (stable) vesicles. Similar results were observed with SLN (Table 2), for which destabilization \nwas caused by low ratios of surfactant.\nTaking into account the importance of nanoparticle concentration in determining the biological effects of \ncolloidal systems, we foresee that there should be an ideal range for the number of nanoparticles in suspension, \nand we will endeavour to identify the acceptable limits of nanoparticle concentration. In this study we have shown \nthat NTA is a simple, cost-effective, and real-time method for evaluating nanoparticle concentration. Therefore, \nit is essential to include this parameter in physicochemical stability studies of nanostructured colloidal systems \nintended for multipurpose applications, as well as to guarantee the quality of nanocolloidal products.\nConclusions\nThe simple premise that significant changes in particle size and distribution indicate instability of a colloidal \nsystem formed the basis of our hypothesis. We have shown relevant evidence to support the idea that the concen-\ntration of nanoparticles measured by NTA should be a parameter followed in determining the physicochemical \nstability of colloids. The strong negative correlation between particle size assessed by DLS and nanoparticle con-\ncentration demonstrated that both parameters serve to monitor colloidal instability. In addition, in the case of \nnanoparticle instability (erosion, disruption or degradation), which directly affects colloidal system performance, \nthe phenomenon can be prematurely predicted by monitoring the nanoparticle concentration, a measure that is \nnot currently adopted in physicochemical stability studies. This is especially relevant due to increasing interest \nwww.nature.com/scientificreports/\n7\nSCIENTIfIC  REPORTs  |  (2018) 8:982  | DOI:10.1038/s41598-017-18573-7\nin this parameter as analytical information in biological and clinical studies. The number of colloidal particles \nin suspension may be the key to crossing the abyss between in vitro data and in vivo studies, reinforcing the rele-\nvance of monitoring nanoparticle concentration over time.\nMaterials and Methods\nMaterials. HSPC:Chol (2: 1 mol%) and 1,2-dipalmitoyl-sn-glycero-3-phosphocholine (DPPC) were pur -\nchased from Avanti Polar Lipids (USA), poloxamer 188 (PL) was supplied by Sigma (USA), cetyl palmitate (CP) \nwas donated by Dhaymers Química Fina (Brazil) and 100 nm polycarbonate membrane filters were provided by \nMilipore (USA). All other reagents used were of analytical grade.\nColloidal system preparation. Liposomes. Two different liposomal formulations were prepared, at a final \nlipid concentration of 0.125 mM: i) vesicles of DPPC, which were employed in liposome destabilization tests; and \nii) vesicles of mixed composition, prepared with HSPC:Chol (2: 1 mol%), which were used to evaluate the number \nof extrusions necessary to reach a stable formulation of monodisperse particle size distribution.\nBoth formulations were prepared from stock chloroform lipid solutions. After the proper volumes of lipids \nwere pipetted, the solvent was removed under nitrogen flux to create a thin lipid film in a round-bottom flask. The \nfilm was left to dry in a vacuum for 2 h to ensure the removal of any solvent trace. After that, the thin lipid film was \nhydrated with deionized water and vortexed (5 min) to form multilamellar liposomes.\nDPPC multilamellar vesicles were extruded six consecutive times through polycarbonate membranes (100 nm \npores) in order to obtain unilamellar vesicles of homogeneous size distribution\n29; the particle size and concentra-\ntion of the final formulation were measured by DLS and NTA, respectively.\nHSPC:Chol multilamellar liposomes were also extruded six times through the (100 nm pore) polycarbonate \nmembranes, but after each extrusion, the size distribution and nanoparticle concentration were evaluated by DLS \nand NTA.\nSolid lipid nanoparticles. SLN were prepared by the emulsification-ultrasonication method\n30. Specifically, the \nsolid lipid (10% CP) was heated to 10 °C above its melting point, under magnetic stirring. The aqueous phase was \nprepared with appropriate amounts of PL in water, and heated to the same temperature as the lipid phase (64 °C). \nThis phase was then dropped into the oily phase, under high-speed agitation (10,000 rpm) using a Turrax blender \n(IKA Werke Staufen, Germany) for 2 min. The obtained microemulsion was sonicated (Vibra-Cell, Sonics & \nMaterials Inc., Danbury, USA) at 500 W and 20 kHz, in alternate 30 s cycles (on and off) for 15 min, and imme-\ndiately cooled to 25 °C.\nInduced destabilization of colloidal systems. DPPC liposomes. DPPC liposomes were used to eval-\nuate size distribution and nanoparticle concentration during destabilization induced by solvent. Briefly, small \naliquots of chloroform were added to 1 mL of the liposome suspension to a final ratio of 0.5: 100, 1: 100, 1.5: 100 or \n2: 100 (v/v), and the sealed vials were stirred for 30 s on a vortex. After 1 h, destabilization was monitored through \nDLS (particle size) and NTA (nanoparticle concentration) measurements.\nSolid lipid nanoparticles. Five different SLN formulations were prepared, with the same concentration of lipid \n(10% or 208 mmol/L CP) and decreasing surfactant concentrations: 5%, 3%, 1%, 0.25% and 0.1% PL (SLN1 to \nSLN5, respectively). All formulations were characterized in terms of particle size (DLS) and nanoparticle con-\ncentration (NTA).\nColloidal system characterization. Dynamic light scattering. Particle size and polydispersity index \n(PDI) of liposomes and SLN were analysed via laser light scattering (DLS) using Zetasizer Nano ZS90 equipment \n(Malvern Instruments, Worcestershire, UK). Liposomal samples were used without dilution but SLN samples \nwere diluted 1000 times. The results are given as mean plus standard deviation (n = 3).\nNanoparticle tracking analysis. Particle size, Span, and nanoparticle concentration were assessed by NTA, car-\nried out with a NanoSight NS300 (Malvern Instruments, Worcestershire, UK) equipped with a sample chamber \nand a 532 nm laser. The colloidal systems were diluted 200 times and 50,000 times, for liposomes and SLN, respec-\ntively, with around 2000 tracks counted in each measure. The colloidal systems were injected into the sample \nchamber with sterile syringes until the liquid extended to the tip of the syringe; measurements were performed \nin triplicate at room temperature.\nTransmission electron microscopy. Transmission electron microscopy (TEM) images of liposomes and SLN for-\nmulations were measured in a JEOL 1200 EXII microscope, operated at 80 kV . Uranyl acetate (2%) was added to \nthe diluted samples; after that, aliquots were dropped into copper grids coated with a carbon film, and dried at \nroom temperature. After drying, micrographs of the formulations were taken at different magnifications.\nData availability. All data generated or analysed during this study are included in this manuscript.\nReferences\n 1. Hiemenz, P . C. Principles of Colloid and Surface Chemistry (ed.Lagowski, J. J.) 1–55 (Marcel Dekker Inc., 1986).\n 2. Searle, A. B. Colloids in health and disease (ed. Morris, M.) 1–20 (Constable & Company LTD, 1920).\n 3. Bhattacharjee, S. DLS and zeta potential – What they are and what they are not? J. Control. Release 235, 337–351 (2016).\n 4. Ribeiro, L. N. M. et al. Nanostructured lipid carriers as robust systems for topical lidocaine-prilocaine release in dentistry. Eur. J. \nPharm. Sci. 93, 192–202 (2016).\n 5. Attama, A. A., Momoh, M. A. & Builders, P . F . In Recent advances in Drug Delivery Systems 107–140 https://doi.org/10.5772/2889 \n(2012).\nwww.nature.com/scientificreports/\n8\nSCIENTIfIC  REPORTs  |  (2018) 8:982  | DOI:10.1038/s41598-017-18573-7\n 6. Chan, M., Dowling, Q. M., Sivananthan, S. & Kramer, R. In Vaccine Adjuvants (ed. Fox, C. B.) 239–252 (Springer Protocols, 2017).\n 7. Carr, B. & Wright, M. Nanoparticle Tracking Analysis A Review of Appliations and Usage 2010–2012. 44 (2012).\n 8. Filipe, V ., Hawe, A. & Jiskoot, W . Critical evaluation of Nanoparticle Tracking Analysis (NTA) by NanoSight for the measurement of \nnanoparticles and protein aggregates. Pharm. Res. 27, 796–810 (2010).\n 9. Gallego-Urrea, J. A., Tuoriniemi, J. & Hassellöv, M. Applications of particle-tracking analysis to the determination of size \ndistributions and concentrations of nanoparticles in environmental, biological and food samples. Trends Anal. Chem. 30, 473–483 \n(2011).\n 10. Mendes, L. P . et al. Biodegradable nanoparticles designed for drug delivery: The number of nanoparticles impacts on cytotoxicity. \nToxicol. Vitr. 29, 1268–1274 (2015).\n 11. Antonow, M. B. et al. Liquid formulation containing doxorubicin-loaded lipid-core nanocapsules: Cytotoxicity in human breast \ncancer cell line and in vitro uptake mechanism. Mater. Sci. Eng. C 76, 374–382 (2017).\n 12. Guilger, M. et al. Biogenic silver nanoparticles based on trichoderma harzianum: synthesis, characterization, toxicity evaluation and \nbiological activity. Sci. Rep. 7, 44421 (2017).\n 13. Grillo, R. et al. Chitosan nanoparticles loaded the herbicide paraquat: The influence of the aquatic humic substances on the colloidal \nstability and toxicity. J. Hazard. Mater. 286, 562–572 (2015).\n 14. Charão, M. F . et al. Caenorhabditis elegans as an alternative in vivo  model to determine oral uptake, nanotoxicity, and efficacy of \nmelatonin-loaded lipid-core nanocapsules on paraquat damage. Int. J. Nanomedicine 10, 5093–5106 (2015).\n 15. Y eh, Y .-Y . Y . et al. Characterization of CLL exosomes reveals a distinct microRNA signature and the regulation of secretion by B-cell \nreceptor signaling. Blood 125, 3297–3305 (2015).\n 16. International Standard ISO 19430. Particle size analysis-Particle tracking analysis (PTA) method. ISO 19430:2016(E) (2016).\n 17. Dragovic, R. A. et al . Sizing and phenotyping of cellular vesicles using Nanoparticle Tracking Analysis. Nanomedicine \nNanotechnology, Biol. Med. 7, 780–788 (2011).\n 18. Boyd, R. D., Pichaimuthu, S. K. & Cuenat, A. New approach to inter-technique comparisons for nanoparticle size measurements; \nusing atomic force microscopy, nanoparticle tracking analysis and dynamic light scattering. Colloids Surfaces A Physicochem. Eng. \nAsp. 387, 35–42 (2011).\n 19. Ribeiro, L. N. M. et al. Natural lipids-based NLC containing lidocaine: from pre-formulation to in vivo studies. Eur. J. Pharm. Sci. \n106, 102–112 (2017).\n 20. Bender, E. A. et al. Hemocompatibility of poly(ε-caprolactone) lipid-core nanocapsules stabilized with polysorbate 80-lecithin and \nuncoated or coated with chitosan. Int. J. Pharm. 426, 271–279 (2012).\n 21. Nyqvist-Mayer, A. A., Brodin, A. F . & Frank, S. G. Drug release studies on an oil-water emulsion based on a eutectic mixture of \nlidocaine and prilocaine as the dispersed phase. J. Pharm. Sci. 75, 365–373 (1986).\n 22. Kučerka, N., Nieh, M. P . & Katsaras, J. Fluid phase lipid areas and bilayer thicknesses of commonly used phosphatidylcholines as a \nfunction of temperature. Biochim. Biophys. Acta - Biomembr. 1808, 2761–2771 (2011).\n 23. Turkyilmaz, S., Chen, W .-H., Mitomo, H. & Regen, S. L. Loosening and Reorganization of Fluid Phospholipid Bilayers by \nChloroform. J Am Chem. Soc. 131, 5068–5069 (2009).\n 24. Reigada, R. Atomistic Study of Lipid Membranes Containing Chloroform: Looking for a Lipid-Mediated Mechanism of Anesthesia. \nPLoS One 8, 1–10 (2013).\n 25. Jensen, O. A., Prause, J. U. & Laursen, H. Shrinkage in preparatory steps for SEM - A study on rabbit corneal endothelium. Albr. von \nGraefes Arch. Klin Ophalmol 215, 233–242 (1981).\n 26. Souto, E. B., Wissing, S. A., Barbosa, C. M. & Müller, R. H. Evaluation of the physical stability of SLN and NLC before and after \nincorporation into hydrogel formulations. Eur. J. Pharm. Biopharm. 58, 83–90 (2004).\n 27. Campos, E. V . R. et al . Development of stained polymeric nanocapsules loaded with model drugs: Use of a fluorescent \npoly(phenyleneethynylene). Colloids Surfaces B Biointerfaces 147, 442–449 (2016).\n 28. Rodrigues da Silva, G. H. et al. Optimised NLC: a nanotechnological approach to improve the anaesthetic effect of bupivacaine. Int. \nJ. Pharm. 529 (2017).\n 29. Mayer, L. D., Hope, M. J. & Cullis, P . R. Vesicles of variable sizes produced by a rapid extrusion procedure. BBA - Biomembr. 858, \n161–168 (1986).\n 30. Schwarz, C., Mehnert, W ., Lucks, J. S. & Müller, R. H. Solid lipid nanoparticles (SLN) for controlled drug delivery. I. Production, \ncharacterization and sterilization. J. Control. Release 30, 83–96 (1994).\nAcknowledgements\nThis work was supported by grants from the FAPESP Brazilian funding agency (#14/25372-0 and #14/14457-5).\nAuthor Contributions\nL.N.M.R. proposed the work. L.N.M.R., E.P . and L.F .F . designed the experiments. L.N.M.R. and V .M.C. performed \nall the experiments. L.N.M.R. and E.P . wrote the manuscript. All the authors contributed to the discussion and \nrevision of the manuscript.\nAdditional Information\nCompeting Interests: The authors declare that they have no competing interests.\nPublisher's note: Springer Nature remains neutral with regard to jurisdictional claims in published maps and \ninstitutional affiliations.\nOpen Access This article is licensed under a Creative Commons Attribution 4.0 International \nLicense, which permits use, sharing, adaptation, distribution and reproduction in any medium or \nformat, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Cre-\native Commons license, and indicate if changes were made. The images or other third party material in this \narticle are included in the article’s Creative Commons license, unless indicated otherwise in a credit line to the \nmaterial. If material is not included in the article’s Creative Commons license and your intended use is not per-\nmitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the \ncopyright holder. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/.\n \n© The Author(s) 2018",
  "topic": "Dynamic light scattering",
  "concepts": [
    {
      "name": "Dynamic light scattering",
      "score": 0.8395796418190002
    },
    {
      "name": "Nanoparticle",
      "score": 0.7480064034461975
    },
    {
      "name": "Dispersity",
      "score": 0.7145463228225708
    },
    {
      "name": "Nanoparticle tracking analysis",
      "score": 0.6929439902305603
    },
    {
      "name": "Colloid",
      "score": 0.6666366457939148
    },
    {
      "name": "Particle size",
      "score": 0.6145503520965576
    },
    {
      "name": "Materials science",
      "score": 0.5311825275421143
    },
    {
      "name": "Characterization (materials science)",
      "score": 0.5268914699554443
    },
    {
      "name": "Nanotechnology",
      "score": 0.5147190690040588
    },
    {
      "name": "Poloxamer",
      "score": 0.49671870470046997
    },
    {
      "name": "Liposome",
      "score": 0.49154171347618103
    },
    {
      "name": "Particle-size distribution",
      "score": 0.4344263970851898
    },
    {
      "name": "Particle (ecology)",
      "score": 0.432561457157135
    },
    {
      "name": "Drug delivery",
      "score": 0.4236508309841156
    },
    {
      "name": "Biological system",
      "score": 0.38419055938720703
    },
    {
      "name": "Chemistry",
      "score": 0.36181849241256714
    },
    {
      "name": "Chemical engineering",
      "score": 0.3344694972038269
    },
    {
      "name": "Polymer",
      "score": 0.18771874904632568
    },
    {
      "name": "Biochemistry",
      "score": 0.07413554191589355
    },
    {
      "name": "Biology",
      "score": 0.0
    },
    {
      "name": "Physical chemistry",
      "score": 0.0
    },
    {
      "name": "Engineering",
      "score": 0.0
    },
    {
      "name": "Microvesicles",
      "score": 0.0
    },
    {
      "name": "microRNA",
      "score": 0.0
    },
    {
      "name": "Composite material",
      "score": 0.0
    },
    {
      "name": "Polymer chemistry",
      "score": 0.0
    },
    {
      "name": "Copolymer",
      "score": 0.0
    },
    {
      "name": "Oceanography",
      "score": 0.0
    },
    {
      "name": "Gene",
      "score": 0.0
    },
    {
      "name": "Geology",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I181391015",
      "name": "Universidade Estadual de Campinas (UNICAMP)",
      "country": "BR"
    },
    {
      "id": "https://openalex.org/I879563668",
      "name": "Universidade Estadual Paulista (Unesp)",
      "country": "BR"
    },
    {
      "id": "https://openalex.org/I4210119971",
      "name": "Universidade de Sorocaba",
      "country": "BR"
    }
  ],
  "cited_by": 118
}