{
  "title": "GRADE guidelines: 18. How ROBINS-I and other tools to assess risk of bias in nonrandomized studies should be used to rate the certainty of a body of evidence",
  "url": "https://openalex.org/W2792308249",
  "year": 2018,
  "authors": [
    {
      "id": "https://openalex.org/A4294662430",
      "name": "Schünemann, Holger J",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Cuello, Carlos",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A4301402741",
      "name": "Akl, Elie A",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A3029515277",
      "name": "Mustafa Reem A",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Meerpohl, Jörg J.",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Thayer, Kris",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A3029458788",
      "name": "Morgan Rebecca L",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A4209011261",
      "name": "Gartlehner, Gerald",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Kunz, Regina",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Katikireddi, S Vittal",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A4318512361",
      "name": "Sterne, Jonathan",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Higgins, Julian PT",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2580709910",
      "name": "Guyatt, Gordon",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A4201025057",
      "name": "- -",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2104675861",
    "https://openalex.org/W2136403658",
    "https://openalex.org/W2124594262",
    "https://openalex.org/W2155798268",
    "https://openalex.org/W6678764218",
    "https://openalex.org/W6672848431",
    "https://openalex.org/W1968588001",
    "https://openalex.org/W1994158325",
    "https://openalex.org/W2107021177",
    "https://openalex.org/W2153715117",
    "https://openalex.org/W2472937910",
    "https://openalex.org/W2470058069",
    "https://openalex.org/W2281906779",
    "https://openalex.org/W2058941409",
    "https://openalex.org/W2343171978",
    "https://openalex.org/W2008206156",
    "https://openalex.org/W2059333369",
    "https://openalex.org/W2615921597",
    "https://openalex.org/W2287802286",
    "https://openalex.org/W2171251365",
    "https://openalex.org/W2531269403",
    "https://openalex.org/W2098060885",
    "https://openalex.org/W1247968195",
    "https://openalex.org/W2516352831",
    "https://openalex.org/W3023552461",
    "https://openalex.org/W2616456691",
    "https://openalex.org/W6682827054",
    "https://openalex.org/W2473559982",
    "https://openalex.org/W2089009990",
    "https://openalex.org/W2588681363"
  ],
  "abstract": null,
  "full_text": "(2019). GRADE guidelines: 18. How ROBINS-I and other tools to\nassess risk of bias in nonrandomized studies should be used to rate\nthe certainty of a body of evidence. Journal of Clinical Epidemiology,\n111, 105-114. https://doi.org/10.1016/j.jclinepi.2018.01.012\nPeer reviewed version\nLicense (if available):\nCC BY-NC-ND\nLink to published version (if available):\n10.1016/j.jclinepi.2018.01.012\nLink to publication record on the Bristol Research Portal\nPDF-document\nThis is the accepted author manuscript (AAM). The final published version (version of record) is available online\nvia Elsevier at https://doi.org/10.1016/j.jclinepi.2018.01.012 . Please refer to any applicable terms of use of the\npublisher.\nUniversity of Bristol – Bristol Research Portal\nGeneral rights\nThis document is made available in accordance with publisher policies. Please cite only the\npublished version using the reference above. Full terms of use are available:\nhttp://www.bristol.ac.uk/red/research-policy/pure/user-guides/brp-terms/\nCONFIDENTIAL – do not distribute \n 1 \n \nGRADE Guidelines: 18. How ROBINS-I and other tools to assess risk of \nbias in non-randomized studies should be used to rate the certainty of \na body of evidence  \n \nAuthors \nHolger J. Schünemann1,2  schuneh@mcmaster.ca \nCarlos Cuello1    cuelloca@mcmaster.ca \nElie A. Akl1,3    ea32@aub.edu.lb \nReem A. Mustafa1,4   ramustafa@gmail.com \nJörg J. Meerpohl5   meerpohl.jj@gmail.com  \nKris Thayer6    thayer.kris@epa.gov  \nRebecca L. Morgan1   morganrl@mcmaster.ca \nGerald Gartlehner7   Gerald.Gartlehner@donau-uni.ac.at  \nRegina Kunz8    Regina.Kunz@usb.ch  \nS Vittal Katikireddi9   vittal.katikireddi@glasgow.ac.uk \nJonathan Sterne10   Jonathan.Sterne@bristol.ac.uk \nJulian PT Higgins10   julian.higgins@bristol.ac.uk \nGordon Guyatt1,2   guyatt@mcmaster.ca  \nGRADE Working Group \n \n1. Department of Health Research Methods, Evidence, and Impact & McGRADE center, 1280 \nMain Street West, McMaster University, Hamilton, Ontario L8S4K1, Canada \n2. Department of Medicine, 1280 Main Street West, McMaster University, Hamilton, Ontario \nL8S4K1, Canada \n3. AUB GRADE Center, Clinical Research Institute, American University of Beirut, PO Box 11-\n0236, Riad El Solh, Beirut 1107 2020, Lebanon \n4. Department of Medicine, University of Kansas Medical Center, 3901 Rainbow Blvd, MS3002, \nKansas City, KS 66160 \n5. Cochrane Germany, Medical CenterdUniversity of Freiburg, Breisacher Strasse 153, Freiburg \n79110, Germany \n6. Integrated Risk Information System (IRIS) Division, National Center for Environmental \nAssessment. Environmental Protection Agency, USA \n7. Department for Evidence-Based Medicine and Clinical Epidemiology, Danube University \nKrems, Dr. Karl Dorrek Straße 30, 3500 Krems, Austria \nCONFIDENTIAL – do not distribute \n 2 \n8. Basel Institute of Clinical Epidemiology, University Hospital Basel, Hebelstrasse 10, Basel \n4031, Switzerland \n9. MRC/CSO Social & Public Health Sciences Unit, University of Glasgow, Top Floor, 200 Renfield \nStreet, Glasgow, G2 3QB \n10. Population Health Sciences, Bristol Medical School, University of Bristol, Canynge Hall, 39 \nWhatley Road, Bristol BS8 2PS, UK \n \n \n \n \n  \nCONFIDENTIAL – do not distribute \n 3 \nCorresponding author: \nHolger J. Schünemann, MD, PhD \nChair and Professor, Department of Health Research Methods, Evidence and Impact  \nMcMaster University Health Sciences Centre, Room 2C16 \n1280 Main Street West  \nHamilton, ON L8N 4K1, Canada  \nschuneh@mcmaster.ca \nTel: +1 905 525 9140 x 24931 \n \nWord count  \nAbstract: 200 \nBody: 4503 \n \nNumber of figures and tables \nFigures 5 \nTables 1 \n  \nCONFIDENTIAL – do not distribute \n 4 \nAbstract \nObjective: To provide guidance how systematic review authors, guideline developers, and \nhealth technology assessment practitioners should approach the use of the risk of bias in non-\nrandomized studies of interventions (ROBINS-I) tool as part of GRADE’s certainty rating process.    \nStudy Design and Setting: Iterative discussions, testing in systematic reviews, presentation at \nGRADE working group meetings with feedback from the GRADE Working Group. \nResults: We describe where to start the initial assessment of a body of evidence with the use of \nROBINS-I, and where one would anticipate the final rating would end up. GRADE accounted for \nissues that mitigate concerns about confounding and selection bias by introducing the \nupgrading domains: large effects, dose-effect relations, and when plausible residual \nconfounders or other biases increase certainty. They will need to be considered in an \nassessment of a body of evidence when using ROBINS-I.  \nConclusions: The use of ROBINS-I in GRADE assessments may allow for a better comparison of \nevidence from RCTs and NRS because they are placed on a common metric for risk of bias. \nChallenges remain that include appropriate presentation of evidence from RCTs and NRS for \ndecision-making and how to optimally integrate RCTs and NRS in an evidence assessment.  \n \n \nKey words \nGRADE, quality of evidence, certainty of the evidence, risk of bias, non-randomized studies, \nROBINS \n  \nCONFIDENTIAL – do not distribute \n 5 \nHighlights \nKey findings \nThe risk of bias in non-randomized studies of interventions (ROBINS-I) tool addresses risk of bias in \nrelation to a randomized trial presenting a number of opportunities for the GRADE approach. The \nGRADE Working Group addresses here how tools like ROBINS-I to assess risk of bias in observational or \nnon-randomized studies should be used. The GRADE approach already accounted for issues that \nmitigate concerns about confounding and selection bias by introducing the upgrading domains: large \neffects, dose-effect relations, and when plausible residual confounders or other biases increase \ncertainty. \n \nWhat this adds to what is known? \nThe separation of randomized and observational studies was primarily a result of recognition that \nrandomization is the only way to fully protect against confounding, and that confounding is always a \nconcern in even the most rigorously conducted observational studies.  \n \nWhat are the implications, what should change now? \nThe use of ROBINS-I in GRADE assessments may allow for a better comparison of evidence from RCTs \nand NRS because they are placed on a common metric for risk of bias. The article describes the initial \nassessment of a body of evidence with the use of ROBINS-I, and where one would anticipate the final \nrating would end up.  \n \n  \nCONFIDENTIAL – do not distribute \n 6 \n1. GRADE’s approach to the certainty of the evidence from observational studies  \nThe GRADE working group has developed a widely accepted approach to rating the certainty of \na body of evidence (also known as quality of evidence or confidence in evidence) in the \ncontexts of systematic reviews, developing healthcare recommendations, and supporting \ndecisions. GRADE’s approach to rating the certainty of the evidence is based on a four-level \nsystem: high, moderate, low and very low (Table 1). This is the 18th in the ongoing series of \narticles describing the GRADE approach in the Journal of Clinical of Epidemiology and \ncomplements articles in other journals. In previous GRADE articles we have described the \nreasons for decreasing and increasing the certainty of a body of evidence, how an overall rating \nof the evidence is performed, how evidence is utilized to move to recommendations and \ndecisions, dealt with particular circumstances of diagnostic, prognostic, equity-related, multiple \ntreatment comparison, environmental and public health questions, how GRADE applies to rapid \nadvice and when there is missing outcome data.(1-17)  \n \nThe current GRADE approach for a body of evidence relating to interventions begins by placing \nstudies in one of two categories: randomized controlled trials (RCT) and observational studies \n(otherwise known as non-randomized studies, or NRS). GRADE considers non-randomized trials, \ncohort studies, case-control studies, interrupted-time series (if not randomized), cross sectional \nstudies, case series, case reports and other types of non-randomized studies as observational \nstudies.  \n \nAccording to existing GRADE guidance for interventions, the process of rating a body of \nevidence (typically several or many studies) begins by classifying the design the relevant studies \nhave used.  If the relevant studies are randomized trials, the body of evidence begins as high \ncertainty.  If the relevant studies are observational, the body of evidence begins as low \ncertainty.  This initial rating is followed by consideration of eight domains, five of which may \nresult in rating down certainty, and three in rating up.(8)  \n \nCONFIDENTIAL – do not distribute \n 7 \nThe separation of randomized and observational studies was primarily a result of recognition \nthat randomization is the only way to fully protect against confounding (i.e. imbalance in \nprognostic factors between intervention and control groups), and that confounding is always a \nconcern in even the most rigorously conducted observational studies.  The imbalance in \nunknown prognostic factors that exists after statistical adjustment or stratified analysis to \naccount for known variables which are not balanced in the exposed and the control groups is \nknown as residual confounding.   \n \nThe choice of starting observational studies at low rather than moderate or very low certainty \nfollowed intense discussion in the GRADE working group’s early days, and was based on the \ngroup’s assessment of the magnitude of the potential for residual confounding, and the limited \nprotection against bias provided by adjusted analysis in observational studies. An alternative \nway of understanding GRADE is that randomization is one of the reasons for rating certainty up \nas a measure to protect against confounding and selection bias.   \n \n2. Rating risk of bias in individual observational studies \nConsider now the assessment of risk of bias in individual observational studies, which in the \nGRADE approach might lead to further rating down quality from low to very low.  Investigators \nhave developed many assessment tools for rating risk of bias in observational studies. Most of \nthe instruments address a specific type of observational or non-randomized design (e.g. cohort \nor case-control) (18), and seek to determine how well, relative to a perfect observational study \nof that particular design, the individual study at hand was conducted. An alternative approach \nis to determine risk of bias of observational studies in relation to the effect that would be seen \nin a high quality randomized trial. Such a trial avoids both confounding (through random \nallocation to interventions) as well as other sources of bias such as selection or information \nbiases.  \n \nThe risk of bias in non-randomized studies of interventions (ROBINS-I) tool, rather than using \nthe ideal observational study as a standard, addresses risk of bias using an absolute scale \nCONFIDENTIAL – do not distribute \n 8 \napproach.(19)  ROBINS-I evaluates risk of bias in estimates of the effects (harm or benefit) of \none or more interventions from studies that did not use randomization to allocate units \n(individuals or clusters of individuals) to comparison groups (in GRADE terminology \nobservational studies).  \n \nROBINS-I’s fundamental underlying principles are that (1) the study’s risk of bias is compared \nagainst a target RCT, even if this RCT may not be feasible or ethical; (2) the assessment of \nconfounding and selection bias are integral parts of the tool; and (3) for a given result for a \nspecific outcome, evidence from an NRS is assessed, addressing a number of domains and then \ngiving an overall rating per outcome for each study. Figure 1 describes the application of \nROBINS-I. Signaling questions in the ROBINS-I instrument ask respondents to rate RoB in \ndomains of 1) Bias due to confounding, 2) Bias in selection of participants into the study, 3) Bias \nin classification of interventions, 4) Bias due to departures from intended interventions, 5) Bias \ndue to missing data, 6) Bias in measurement of outcomes, and 7) Bias in selection of reported \nresults (Figure 2). In addition, ROBINS-I includes an optional judgment about the direction of \nthe bias for each domain. ROBINS-I has undergone careful development by a large group of \nexperienced investigators. It has been tested and scientists have begun to validate it, and \nexperience will continue to accumulate.  \n \n3. ROBINS-I and GRADE \nThe arrival of ROBINS-I presents a number of opportunities for the GRADE approach. First, it \noffers an alternative terminology: establishing NRS rather than observational studies. Although \nnot different in intended meaning in the GRADE approach, substituting NRS for observational \nstudies will lead to a more transparent separation of studies based on their design.  For \ninstance, some have struggled with the classification of certain types of studies, such as non-\nrandomized before-after studies as observational; in the alternative nomenclature, such studies \nare clearly non-randomized.  How to classify studies that allocate by essentially random \nprocesses such as date of birth or hospital ID number, in which the concern is lack of \nCONFIDENTIAL – do not distribute \n 9 \nconcealment rather than confounding bias per se, may remain a matter of debate that we will \nnot address here.  \n \nSecond, the use of ROBINS-I in GRADE assessments may allow for a better comparison of \nevidence from RCTs and NRS because they are placed on a common metric for risk of bias. This \narticle provides guidance regarding how systematic review authors, guideline developers, and \nhealth technology assessment practitioners using GRADE might approach the use of ROBINS-I \nas part of the certainty rating process.  The article focuses on where to start the initial \nassessment of a body of evidence with the use of ROBINS-I, and where one would anticipate \nthe final rating would end up. Implications and requirement for further work are dealt with in \nthe final sections of this article.  This article will not resolve all relevant issues, and we plan \nsubsequent articles describing the work of the GRADE RoB in NRS and environmental health \nproject groups (www.gradeworkinggroup.org).  \n \n4. Concerns about GRADE’s approach to start NRS at low certainty \nDespite GRADE’s broad acceptance in the evidence synthesis community, GRADE’s initial \ncertainty rating of outcome data from NRS as low has led to challenges for some GRADE users.  \nFirst, users of GRADE may inappropriately double count the risk of confounding and selection \nbias, initially by starting a body of evidence from NRS as low certainty of the evidence followed \nby again rating down for unknown confounders (although rating down additionally for failure to \naccurately measure known confounders and to adjust for these confounders in the analysis \nwould be appropriate (Figure 3)). Second, those working in fields in which RCTs are sparse or \nnot feasible have expressed concerns that NRS in their fields will seldom be rated as high or \nperhaps even moderate certainty. GRADE has accepted that criticism, highlighted how one may \nrate up certainty for large effects, a dose-response gradient, and if all plausible biases will \nstrengthen rather than undermine inferences from study results. In this article, we note the \nmerits of a rating system that follows the underlying logic of ROBINS-I and thus may better \nintegrate RCTs and NRS and allow for more detailed assessment of different types of NRS. \n \nCONFIDENTIAL – do not distribute \n 10 \nWhile best evidence must be used for decision-making, relying on the best available or \nachievable rather than least biased evidence as a reference standard would lead to differing \ncertainty in decisions based on the questions asked (20). Picture the following: in one scenario \nfor a health care decision RCTs are neither ethical nor feasible and we, therefore, accept that \npossible confounded NRS are the reference standard for highest feasible certainty. If these \nstudies are available we would express that we have high certainty in the decision despite the \nfact that confounding may bias the results. In the second scenario, RCTs are feasible and ethical \nand they become our reference standard for highest feasible certainty. If for this situation, only \nNRS are available, we would label our health care decision as based on low certainty. Should \nthe certainty of the decision that is based on the respective evidence differ because of what \nevidence is available or should the certainty depend on what would be the highest possible \ncertainty? It would be illogical to express different certainty for the same degree of bias \nbecause of feasibility and ethical reasons. A comparison on an absolute rather than relative (to \nthe feasibility and ethics of an RCT) provides greater transparency. A decision can still be made \nfor both scenarios and for both we should acknowledge the (same) degree of uncertainty. In \nfact, in most, if not all, areas of health care some interventions are supported by evidence from \nRCTs and others are not, requiring a common reference standard in order to ensure \nappropriate communication with target populations.  \n \nThird, by beginning the rating of evidence from a body of NRS studies as low certainty, the \ncurrent GRADE approach fails to consider that a body of evidence from particular NRS designs \nmay more appropriately be rated higher than conventional NRS designs.  For instance, \ninterrupted time series with multiple periods and measurements during each period and no \nother limitations may constitute moderate quality evidence without meeting any of the criteria \nfor rating up (though our efforts to identify examples for such a body of evidence have not yet \nproved successful) (21). \n \nCONFIDENTIAL – do not distribute \n 11 \n5.  Certainty of evidence for a body of evidence from NRS when using ROBINS-I \nfor assessing risk of bias in individual NRS \nHere, we provide general guidance for the use of GRADE in the context of ROBINS-I.  ROBINS-I \ncompares an assessment of an individual NRS against a target RCT. The initial description of the \nunderlying study design, such as cohort, case-control, case series or cross sectional study, is not \nconsidered as a risk of bias feature in ROBINS-I. Thus, when using ROBINS-I for assessing risk of \nbias in NRS, given that assessment of selection bias and confounding is an integral part of the \nROBINS-I tool, the initial GRADE certainty in the evidence from a body of studies using an NRS \ndesign would be high (Figures 4 and 5).  This does not mean that GRADE has changed the view \nthat randomization is the only secure way to guard against confounding bias; that view remains \nthe same.  Thus, we would anticipate that whether one begins with a body of evidence from \nNRS studies as low certainty and looks for reasons to rate up or down, or starts with that \nevidence as high quality and looks for reasons to rate down, the final certainty rating should be \nthe same.  \n \nThis approach implies that ROBINS-I users rating conventional NRS of any design (e.g. cohort, \ncase-control) following their assessment of confounding and selection bias, will often arrive at a \nrating of high risk of bias.  Using ROBINS-I it nevertheless remains possible that a body of \nevidence from NRS studies will receive a final rating of high or moderate certainty of evidence.  \nThis could result from rating up for large effect, dose-response, or the direction of plausible \nconfounding.  Or it could result from use of NRS designs and analyses with greater protection \nBox 1. Clarification of terminology \nGRADE uses the term “criteria” for all criteria in the evidence to decision frameworks of \nGRADE. Within these criteria the “certainty in the evidence” (or quality or strength of \nevidence) is one criterion. Certainty of the evidence is assessed based on “certainty \ndomains” with individual items within each domain. RoB is one domain, therefore we will, in \nthe context of GRADE, use the term RoB items to describe the 7 areas of judgment that \nROBINS-I calls domains.  \nCONFIDENTIAL – do not distribute \n 12 \nagainst risk of bias – for instance, interrupted time series – that would lead to rating down by \nonly 1 level or not at all.  As we have already noted, however, while we have many examples of \nrating up certainty, efforts to identify a body of evidence from innovative designs meriting, \nsimply for design considerations, moderate quality evidence, have thus far proved unsuccessful \n(Figure 4). Methodological developments in this area that describe how NRS may have greater \nprotection against risk of bias than those typically available should help making such judgments \nbut GRADE requires careful examination of these examples.(22)     \n \n6. What makes us confident in results of NRS and does GRADE already account \nfor this? \nAt the end of the previous section we have noted how, within current GRADE thinking, a body \nof evidence from NRS studies may emerge from the rating exercise as moderate or high quality \nevidence.  We will now expand on these issues. \n6.1. All plausible residual confounders or other biases increase our certainty in the estimated \neffect \nGRADE allows higher certainty ratings for bodies of evidence when all plausible residual \nconfounders or other biases increase our conﬁdence in the range of an estimated effect, that is \nthe effect is either larger or smaller than that observed (23, 24).  GRADE suggests that \njudgments about the direction of the possible bias are important to assess certainty of the \nevidence from NRS. One example from the public health field comes from a systematic review \nof NRS including a total of 38 million patients that demonstrated a very small relative increase \n(relative risk 1.020, 95% confidence interval 1.003-1.038) in death rates in private for-proﬁt \ncompared with private not-for-proﬁt hospitals (23, 25). The evaluation of risk of bias across \nstudies revealed that all residual plausible confounding – the major issues being that for-profit \nhospitals have on average higher income patients and greater resources - would have \ndecreased the observed effect (further towards a RR of 1.0). Despite the biases in favour of for-\nprofit hospitals, those hospitals demonstrated higher mortality – therefore the true effect, if it \ndiffers from the estimate, is almost certain to be greater.   \n \nCONFIDENTIAL – do not distribute \n 13 \nCurrently, ROBINS-I allows for an optional judgment regarding the direction of confounding and \nselection bias (“Risk of bias judgment. Optional: What is the predicted direction of the of bias \ndue to confounding/selection …”).  If this optional judgment is indeed used in ROBINS-I, in \nscenarios such as the hospital profit status example, not rating an individual NRS as high risk of \nbias (and thus not rating the body of evidence from a number of such studies as low certainty) \nis justified.  This may happen, albeit rarely, even in the context of small effects such as the one \nobserved for the mortality risk in for-profit private hospitals.  \n \nWhile GRADE has accounted for this situation in its approach, when users of GRADE apply \nROBINS-I to assess risk of bias, the direction and degree of residual plausible confounding \nrequires considering during the risk of bias assessment.  Rather than rating up NRS from low to \nmoderate at the study and body of evidence level, raters using ROBINS-I may not rate risk of \nbias as very serious, but only rate it as moderate. Whether or not one starts at low certainty in \nthe traditional GRADE approach and rates up or does not rate down to low when using ROBINS-\nI, the end result is identical and depends on the risk of bias judgment (Figure 5).  \n \n6.2. Large effects and dose responses \nGRADE suggests that large effects and dose-response relations mitigate concerns regarding \nresidual confounding.  In one of our prior articles we described that a systematic review of NRS \ninvestigating the effect of cyclooxygenase-2 inhibitors on cardiovascular events found that the \nsummary estimate of RR with rofecoxib of 1.33 (95% CI: 1.00 to 1.79) with doses less than \n25mg/d and 2.19 (95% CI: 1.64 to 2.91) with doses more than 25 mg/d. Can we infer that \nrofecoxib will increase the risk for cardiovascular events?  Although only NRS are available to \naddress the question, we can have moderate, or perhaps even high, certainty of the causal \nconnection.  The reasons are that, although residual confounding is likely to exist in the NRS \nthat address this issue, the existence of a dose-response gradient and the large apparent effect \nof higher doses of rofecoxib markedly increase our strength of inference that the association \ncannot be explained by residual confounding, and is therefore likely to be both causal and, at \nCONFIDENTIAL – do not distribute \n 14 \nhigh levels of exposure, substantial.1  Given the large effect and the observed dose-response \nrelation this could lead to a high certainty rating, for the outcome of increasing cardiovascular \nevents.  \n \nThe previous paragraph dealt with evaluation of the entire body of evidence, which begs the \nquestion of how the rating of individual NRS of rofecoxib using ROBINS-I would impact on a \nGRADE assessment of the body of evidence .  The rater, in dealing with the confounding and \nselection bias domains would rate individual study as high risk of bias because of the possibility \nthat residual confounding or selection bias may be influencing the estimates of association.  \nHow would one then deal with the dose-response and large effect size considerations when \ndealing with the body of evidence?   \n \nIn one way of looking at the situation, the subsequent rating up for large effects for the higher \ndoses of rofecoxib would make, in retrospect, some of the items on the ROBINS-I tool \npotentially irrelevant.  The possible solutions are to a) rate the confounding in ROBINS-I as \nmoderate or low risk of bias because large effects are observed and the larger the effect the \nstronger the confounding would have to be to explain the effect which makes an explanation by \nconfounding unlikely; or b) leave the initial grading as low following the guidance above, and \nthen rate up for large effects when one considers the entire body of evidence.  The same \noptions exist with respect to dose-response relationships.  GRADE has thus accounted for issues \nthat mitigate concerns about confounding and selection bias by introducing the upgrading \ndomains. They will need to be considered in an assessment of a body of evidence when using \nROBINS-I. \n  \n7. Advantages and disadvantages of, in the context of GRADE, assessing risk of \nbias for individual studies using the ROBINS-I approach of specifying target trials  \n7.1. Advantages  \n                                                      \n1 GRADE guidance suggests the possibility of rating up one level for a large effect if the relative effect is greater \nthan 2.0.  Here, the fact that the point estimate of the relative effect is greater than 2.0, but the confidence \ninterval is appreciably below 2.0 might make some hesitate in the decision to rate up for a large effect.  \nCONFIDENTIAL – do not distribute \n 15 \nAmong other features, ROBINS-I allows review authors to assess how failure to use \nrandomization in individual studies has impacted on risk of bias. For example, ROBINS-I allows a \ncategorization of the magnitude of bias from lack of randomization through the selection and \nconfounding bias domains, allows application of this assessment across risk of bias domains, \nand evaluation of how this differs across individual studies that address different health care \nquestions. Furthermore, ROBINS-I will facilitate assessment of a study that has been described \nas randomized but when assessed in detail is found to be not appropriately randomized. In \nthose cases, users of GRADE have struggled with whether to start the certainty of evidence as \nhigh and then rate it down, or ignore descriptions of the study authors and treat the studies as \nNRS by starting the certainty of evidence as low.  All these features of the assessment of \nindividual studies can then be taken into account when evaluating a group of individual studies \nthat constitute a body of evidence. \n \nAnother potential advantage of using an approach such as ROBINS-I is that it may harmonize \nGRADE approaches across different study types for different types of questions such as \nprognosis or test accuracy. In the current GRADE approach, observational studies for these \ntypes of questions begin with high certainty ratings.  In particular, with prognostic studies, in \nwhich the issue is association and not causation, prognostic NRS begin as high certainty \nevidence. If GRADE assessments for  all types of studies were to start at high certainty, \nquestions of intervention, prognosis, values and preferences, and test accuracy, would not \nrequire different initial certainty ratings.  What will be required, however, are different versions \nof ROBINS, such as ROBINS tool for prognosis.   \n \nFinally, those applying GRADE in fields where RCTs are sparse such as environmental and \ncertain areas of public health, reframing the certainty assessment with a focus on the actual \nitems that randomization addresses, i.e. confounding and selection bias, rather than labeling a \nstudy design feature, i.e. randomization, will find GRADE more acceptable.  \n \nCONFIDENTIAL – do not distribute \n 16 \n6.2. Disadvantages \nThe disadvantages of offering an alternative to the existing GRADE system include mistakes if \nusers of GRADE do not follow the approach appropriately. First, ROBINS-I is currently the only \navailable tool that explicitly includes a comparison against RCTs (and this situation is unlikely to \nchange) and thus this guidance only applies to the situations when ROBINS-I is used. Second, \nbecause of the advantage of assessing risk of bias on an absolute scale, use of ROBINS-I may \nfacilitate combining results of RCTs and NRS. However, under what conditions one should \ncombine results from randomized and non-randomized studies remains uncertain (this \nuncertainty also applies whether one uses ROBINS-I or other instruments for assessing risk of \nbias in NRS) (Figure 4).  \nThird, there is a possibility of misuse by those wanting to assign a higher certainty of the \nevidence to a body of evidence from NRS than is appropriate. Evaluators of evidence may rate \nthe risk of bias from a group of NRS as moderate risk of bias if they are not appropriately \ncautious about the impact of confounding and selection bias or if reporting is poor.  Users of \nGRADE may then take the results of such studies and classify them as moderate certainty (if no \nproblems in other GRADE domains exist) when, following current GRADE guidance, they should \nbe classified as low certainty.  This may result from a higher threshold and requirement for \ndocumenting upgrading rather than a potentially higher threshold for rating down NRS when \nusing ROBINS-I. Fourth, further, detailed guidance is required for appropriate application of \nROBINS-I with more examples as concerns about the amount of time required and the lack of \ndetailed reporting of risk of bias related items in current NRS. Fifth, until now there is no \npractical example on which to base a rating of initial high or even moderate certainty in the \nevidence that comes from a body of evidence from NRS where no traditional GRADE upgrading \ndomain applies.   \n \n8. Unresolved Issues \nGRADE recognizes that there are a number of unresolved issues related to the arrival of \nROBINS-I. The GRADE working group is addressing those in the near future. The unresolved \nissues are as follows: \nCONFIDENTIAL – do not distribute \n 17 \n1. If systematic review authors use ROBINS-I, should the results from NRSs and RCTs be \nconsidered together, including potentially in a meta-analysis (Figure 4).  If RCTs and NRS are \nindeed considered together, when should they be combined? Should non-randomized studies \nbe utilized to provide more precise estimates in summary effects when in fact NRS may \ndominate such estimates? Should they be used to alleviate concerns about indirectness \nbecause they are often including broader populations and more practice oriented \ninterventions? Should we continue to follow GRADE guidance to generally separate randomized \nand non-randomized study results in GRADE summary tables such as evidence profiles and \nSummary of Findings tables or should the guidance be modified? Until clear advice on when to \ncombine data form randomized and non-randomized studies is available, we suggest following \ncurrent GRADE guidance: if certainty of evidence differs in a body of randomized trials and a \nbody of observational studies, one need only present in summary of findings (SoF) tables, the \nhigher certainty evidence (almost invariably that from RCTs).  If certainty ratings are the same \n(typically low certainty) one presents results from the two bodies of evidence separately.  If the \nresults are consistent, then the overall certainty assessment is that of the two bodies of \nevidence (typically low certainty).  If the results are inconsistent, and one believes both bodies \nof evidence should be taken into consideration, then one will rate down further for this \ninconsistency, and the final rating will be one category lower (typically very low certainty).  \n2. How should we deal with publication bias in the context of including NRS, clearly posing more \nchallenges than evaluating publication bias in RCTs (available evidence suggests publication bias \nis a greater problem in NRS than in RCTs)?   \n3. Under what circumstances should evidence syntheses broaden their scope of search and \nconsider NRS routinely? \n4. GRADE needs to develop more detailed guidance than currently exists regarding the \npresence of large effects and dose-effect relations. With regards to large effects, if a body of \nevidence from NRS is indeed rated as high-certainty in the evidence prior to the consideration \nof size of effect and very large effects exist, no further rating up is possible or required. This is \nalso the situation regarding how GRADE currently deals with large effects observed in a body of \nevidence from RCTs. For instance, the large relative risk reduction observed with oral \nCONFIDENTIAL – do not distribute \n 18 \nanticoagulation for the treatment of DVT for prevention of stroke in patients with atrial \nfibrillation does not lead to an ultimate rating of the certainty of the evidence beyond high. \n5. Currently GRADE has only three labels for risk of bias: not serious, serious or very serious on \nthe risk of bias domain levels. For RCTs, this corresponds to a rating of the body of evidence as \nhigh, moderate or low certainty of evidence after considering risk of bias; for NRS is means that \nwhen GRADE currently uses serious risk of bias for observational studies they are rated down \nfrom low initial certainty to very low. When raters use ROBINS-I with NRS beginning at high \ncertainty, three levels for rating down for risk of bias are required so that NRS can arrive at a \nrating of very low certainty after considering risk of bias. GRADE is now exploring the best \nlabelling options which include the use of not serious, serious, very serious and very, very \nserious leading to certainty ratings of high, moderate, low and very low after risk of bias \nassessment. \n9. Summary and next steps \nRisk of bias can be best mitigated by a well conducted RCT that balances known and unknown \nconfounders, and using the Cochrane RoB 2.0 tool or similar assessment tools for RCTs to assess \nrisk of bias.  For situations in which NRS are used instead or in addition to RCTs, the arrival of \nROBINS-I poses a number of opportunities and challenges to summarizing RoB in GRADE, and \nraises a need for clarification about how ROBINS-I and GRADE are used together.  Given the \ninherent limitations of studies that do not use randomization, a body of evidence from NRS \nstudies should generally not lead to moderate or high certainty in the evidence in relation to \nrisk of bias. Raters using GRADE should always consider confounding and selection bias as \nreasons for rating down a body of evidence, and this is achieved in the current GRADE by \nassigning an initial rating of low certainty.  \nFor studies of interventions that are assessed with ROBINS-I in the context of GRADE, we \nsuggest that an initial rating of high is used, with appropriate consideration of the impact of \nlack of randomization leading to rating down for risk of bias according to the ROBINS-I tool. In \npractice this will generally lead to rating down by at least two levels to low or very low certainty \nfor NRS. However, for results with large effects, or dose response, or results in which inference \nis strengthened by the plausible biases that exist, the extent of rating down may be lowered. \nCONFIDENTIAL – do not distribute \n 19 \nWe have not identified bodies of evidence in which a ROBINS-I assessment alone leads to no \nrating down, or rating down by only one level. We therefore invite users of ROBINS-I and those \nwho produce summary of findings tables or evidence profiles to submit to the GRADE working \ngroup any examples of when they believe that NRS studies without reasons for rating up \nwarrant moderate or high certainty evidence.  \n \n \n \n \n \n  \nCONFIDENTIAL – do not distribute \n 20 \nAcknowledgment and conflict of interest \nThe members of the GRADE Working Group who contributed to writing this article are: Holger J. \nSchünemann, Carlos Cuello, Elie A. Akl, Reem Mustafa, Kris Thayer, Rebecca Morgan, Joerg \nMeerpohl, Julian Higgins, Gordon Guyatt. We would like to acknowledge from the GRADE \nWorking Group for input on the work. Article history: Slides presented at GRADE meetings in \nBarcelona (2014), Amsterdam (2015), Philadelphia (2016) and Seoul (2016);  Approved at \nGRADE meeting May 2017 \nHJS has no direct financial conflict of interest and other authors have not declared financial \nconflicts of interest. Part of the work has been presented scientific conferences and at GRADE \nWorking Group meetings. This article has been officially endorsed by the GRADE Working \nGroup.  \n \nAuthor Contributions \nHJS conceived and designed of the article and wrote the first draft of this manuscript. All other \nauthors contributed to the writing. All authors have read and commented on the manuscript, \nand have given written agreement of their authorship. \n \n  \nCONFIDENTIAL – do not distribute \n 21 \nReferences \n1. Guyatt G, Oxman AD, Akl EA, Kunz R, Vist G, Brozek J, et al. GRADE guidelines: 1. \nIntroduction-GRADE evidence profiles and summary of findings tables. J Clin Epidemiol. \n2011;64(4):383-94. \n2. Guyatt GH, Oxman AD, Schunemann HJ, Tugwell P, Knotterus A. GRADE guidelines: A \nnew series of articles in the Journal of Clinical Epidemiology. J Clin Epidemiol. 2010. \n3. Puhan MA, Schunemann HJ, Murad MH, Li T, Brignardello-Petersen R, Singh JA, et al. A \nGRADE Working Group approach for rating the quality of treatment effect estimates from \nnetwork meta-analysis. BMJ. 2014;349:g5630. \n4. Schunemann HJ, Best D, Vist G, Oxman AD, Group GW. Letters, numbers, symbols and \nwords: how to communicate grades of evidence and recommendations. CMAJ. \n2003;169(7):677-80. \n5. Schunemann HJ, Oxman AD, Brozek J, Glasziou P, Bossuyt P, Chang S, et al. GRADE: \nassessing the quality of evidence for diagnostic recommendations. ACP J Club. 2008;149(6):2. \n6. Spencer FA, Iorio A, You J, Murad MH, Schunemann HJ, Vandvik PO, et al. Uncertainties \nin baseline risk estimates and confidence in treatment effects. BMJ. 2012;345:e7401. \n7. Schunemann HJ, Oxman AD, Brozek J, Glasziou P, Jaeschke R, Vist GE, et al. Grading \nquality of evidence and strength of recommendations for diagnostic tests and strategies. BMJ. \n2008;336(7653):1106-10. \n8. Guyatt G, Oxman AD, Sultan S, Brozek J, Glasziou P, Alonso-Coello P, et al. GRADE \nguidelines: 11. Making an overall rating of confidence in effect estimates for a single outcome \nand for all outcomes. J Clin Epidemiol. 2013;66(2):151-7. \n9. Alonso-Coello P, Oxman AD, Moberg J, Brignardello-Petersen R, Akl EA, Davoli M, et al. \nGRADE Evidence to Decision (EtD) frameworks: a systematic and transparent approach to \nmaking well informed healthcare choices. 2: Clinical practice guidelines. BMJ. 2016;353:i2089. \n10. Alonso-Coello P, Schunemann HJ, Moberg J, Brignardello-Petersen R, Akl EA, Davoli M, \net al. GRADE Evidence to Decision (EtD) frameworks: a systematic and transparent approach to \nmaking well informed healthcare choices. 1: Introduction. BMJ. 2016;353:i2016. \n11. Schunemann HJ, Mustafa R, Brozek J, Santesso N, Alonso-Coello P, Guyatt G, et al. \nGRADE Guidelines: 16. GRADE evidence to decision frameworks for tests in clinical practice and \npublic health. J Clin Epidemiol. 2016;76:89-98. \n12. Burford BJ, Rehfuess E, Schunemann HJ, Akl EA, Waters E, Armstrong R, et al. Assessing \nevidence in public health: the added value of GRADE. J Public Health (Oxf). 2012;34(4):631-5. \n13. Thayer KA, Schunemann HJ. Using GRADE to respond to health questions with different \nlevels of urgency. Environ Int. 2016;92-93:585-9. \n14. Schunemann HJ, Hill SR, Kakad M, Vist GE, Bellamy R, Stockman L, et al. Transparent \ndevelopment of the WHO rapid advice guidelines. PLoS Med. 2007;4(5):e119. \n15. Iorio A, Spencer FA, Falavigna M, Alba C, Lang E, Burnand B, et al. Use of GRADE for \nassessment of evidence about prognosis: rating confidence in estimates of event rates in broad \ncategories of patients. BMJ. 2015;350:h870. \n16. Guyatt GH, Ebrahim S, Alonso-Coello P, Johnston BC, Mathioudakis AG, Briel M, et al. \nGRADE guidelines 17: assessing the risk of bias associated with missing participant outcome \ndata in a body of evidence. J Clin Epidemiol. 2017. \nCONFIDENTIAL – do not distribute \n 22 \n17. Morgan RL, Thayer KA, Bero L, Bruce N, Falck-Ytter Y, Ghersi D, et al. GRADE: Assessing \nthe quality of evidence in environmental and occupational health. Environ Int. 2016. \n18. Anderson S TI, Higgins JPT. Tools for assessing quality and susceptibility to bias in \nobservational studies in epidemiology: a systematic review and annotated bibliography. Int J \nEpidemiol. 2007;36(3):666-76. \n19. Sterne JA, Hernan MA, Reeves BC, Savovic J, Berkman ND, Viswanathan M, et al. \nROBINS-I: a tool for assessing risk of bias in non-randomised studies of interventions. BMJ. \n2016;355:i4919. \n20. Katikireddi SV, Egan M, Petticrew M. How do systematic reviews incorporate risk of bias \nassessments into the synthesis of evidence? A methodological study. J Epidemiol Community \nHealth. 2015;69(2):189-95. \n21. Atkins D, Best D, Briss PA, Eccles M, Falck-Ytter Y, Flottorp S, et al. Grading quality of \nevidence and strength of recommendations. BMJ. 2004;328(7454):1490. \n22. Craig P, Katikireddi SV, Leyland A, Popham F. Natural Experiments: An Overview of \nMethods, Approaches, and Contributions to Public Health Intervention Research. Annu Rev \nPublic Health. 2017;38:39-56. \n23. Guyatt GH, Oxman AD, Sultan S, Glasziou P, Akl EA, Alonso-Coello P, et al. GRADE \nguidelines: 9. Rating up the quality of evidence. J Clin Epidemiol. 2011;64(12):1311-6. \n24. Hultcrantz M, Rind D, Akl EA, Treweek S, Mustafa RA, Iorio A, et al. The GRADE Working \nGroup clarifies the construct of certainty of evidence. J Clin Epidemiol. 2017. \n25. Devereaux PJ, Choi PT, Lacchetti C, Weaver B, Schunemann HJ, Haines T, et al. A \nsystematic review and meta-analysis of studies comparing mortality rates of private for-profit \nand private not-for-profit hospitals. CMAJ. 2002;166(11):1399-406. \nCONFIDENTIAL – do not distribute \n 23 \nTable 1. Use of GRADE not considering ROBINS-I and similar tools: According to GRADE, certainty, quality, strength of the evidence \nor the confidence in the estimate of effect, is determined for each outcome based on a systematic review of the evidence for each \noutcome.  For recommendations, the overall certainty is determined across outcomes based on the lowest quality outcome among \nthose critical for decision-making for the specific context.   \n \n1.  \nEstablish initial \nlevel of certainty (as implemented in \ncurrent GRADE) \n 2.  \nConsider lowering or raising \nlevel of certainty \n 3.  \nFinal level of  \ncertainty rating  \nStudy design Initial certainty \nin the evidence \n Reasons for considering lowering  \nor raising certainty  \n Certainty in the evidence  \nacross those considerations \n   Lower if    Higher if* \nRandomized trials➔ High \ncertainty \nRisk of Bias \nInconsistency \nIndirectness \nImprecision \nPublication bias \nLarge effect \nDose response \nAll plausible  \nconfounding and \nbias \n• would reduce a \ndemonstrated effect  \n   or \n• would suggest a \nspurious effect if no \neffect was observed \nHigh \n \n  Moderate \n \nObservational studies➔ Low \ncertainty \nLow \n \n  Very low \n \n \n*Criteria for upgrading the quality are usually only applicable to observational studies without any reason for rating down. \n \n \n  \nCONFIDENTIAL – do not distribute \n 24 \nFigure 1. The process for using ROBINS-I \n \n \n \n  \n\nCONFIDENTIAL – do not distribute \n 25 \nFigure 2. ROBINS-I risk of bias domains  \n \n \n \nFigure caption: In GRADE risk of bias is a domain and ROBINS-I domains are called items) \n  \n\nCONFIDENTIAL – do not distribute \n 26 \nFigure 3. The current GRADE approach for certainty of evidence: initial certainty and rating domains \n \n \n  \n• RCTs\tÅÅÅÅ\t|\thigh\t\n• observa onal\tstudies\tÅÅ  \t|\tlow\t\n• 5\tdomains\tthat\tcan\tlower\tcertainty\t\n1. limita ons\tin\tdetailed\tstudy\tdesign\tand\texecu on\t\n(risk\tof\tbias\titems)\t\n2. Inconsistency\t(or\theterogeneity)\t\n3. Indirectness\t(PICO\tand\tapplicability)\t\n4. Imprecision\t\n5. Publica on\tbias\t\t\n• 3\tdomains\tcan\tincrease\tcertainty\t\n1. large\tmagnitude\tof\teffect\t\n2. opposing\tplausible\tresidual\tbias\tor\tconfounding\t\n3. dose-response\tgradient\t\nRisk\tof\tbias\t\nDeterminants\tof\tcertainty\tof\tevidence\t\nCONFIDENTIAL – do not distribute \n 27 \nFigure 4. Assessing randomized trials and non-randomized studies with GRADE \n \nFigure caption: *In practice this will generally lead to rating down by at least two levels to low or very low certainty for NRS. \nHowever, for results with large effects, or dose response, or results in which inference is strengthened by the plausible biases that \nexist, the extent of rating down may be lowered. We have not identified bodies of evidence in which a ROBINS-I assessment alone \nleads to no rating down, or rating down by only one level. How to integrate RCTs and NRS will be further discussed in upcoming \nGRADE guidance articles. \n** For GRADE the corresponding terminology is not serious, serious, very serious and a fourth level of risk of bias. GRADE is currently \nexploring the appropriate term for the fourth level  \n \n \n  \nRCTs\nROBINS-I\nStart\thigh*\nNRS\nRCT\tRoB Tool\t\nStart\tHigh\nRisk\tof\tbias\non\tstudy\tlevel\nGRADE\tRoB\n(each\tbody\tof\t\nevidence)\nLow\trisk\tof\tbias\t(no\t\ndowngrading)\nModerate\trisk\tof\tbias\t\n(downgrade\tby\tone\tlevel)\nSerious\trisk\tof\tbias\t\n(downgrade\tby\ttwo\tlevels)\nCritical\trisk\tof\tbias**\n(downgrade\tby\tthree\tlevels)\nNo\tserious\trisk\tof\tbias\nSerious\trisk\tof\tbias\t\n(downgrade)\nVery\tserious\trisk\tof\tbias\n(downgrade\tby\ttwo\tlevels)\nRisk\tof\tbias\nacross\tRCTs\t\nand\tNRS\nGRADE\tRoB\n(body\tof\t\nevidence)\nRisk\tof\tbias\nacross\t\nstudies\nNo\tserious\trisk\tof\t\nbias\nSerious\trisk\tof\tbias\t\n(downgrade\tby\tone\t\nlevel)\nVery\tserious\trisk\tof\t\nbias\t(downgrade\tby\t\ntwo\tlevel)\n**More\tthan\tvery\t\nserious\t(downgrade\t\nby\tthree\tlevels)\n❓\nCONFIDENTIAL – do not distribute \n 28 \n \nFigure 5. GRADE approach for certainty of evidence with tools like ROBINS-I \n \n \n \n \n• RCTs\tand\tNRS\tÅÅÅÅ\t|\thigh\t\n• Domains\tthat\tcan\tlower\tcertainty\t\n1. limita ons\tin\tdetailed\tstudy\tdesign\tand\texecu on\t\n(risk\tof\tbias\titems)\t\n• \tLack\tof\trandomiza on\tlowers\tcertainty\tto\tlow\tunless\topposing\t\nplausible\tresidual\tbias\tstrengthens\tcertainty\tor\tspecial\tstudy\t\ndesigns\tthat\treduce\tconfounding\tand\tselec on\tbias\t\t\n2. Inconsistency\t(or\theterogeneity)\t\n3. Indirectness\t(PICO\tand\tapplicability)\t\n4. Imprecision\t\n5. Publica on\tbias\t\t\n• Domains\tcan\tincrease\tcertainty\tor\tmi gate\trisk\tof\t\nbias\t\n1. large\tmagnitude\tof\teffect\t\n2. dose-response\tgradient\t\nCertainty\tof\tevidence\twith\ttools\tlike\tROBINS-I\t",
  "topic": "Randomized controlled trial",
  "concepts": [
    {
      "name": "Randomized controlled trial",
      "score": 0.5785853862762451
    },
    {
      "name": "Confounding",
      "score": 0.5697834491729736
    },
    {
      "name": "Medicine",
      "score": 0.5361625552177429
    },
    {
      "name": "Guideline",
      "score": 0.531721830368042
    },
    {
      "name": "Psychological intervention",
      "score": 0.5072841048240662
    },
    {
      "name": "Systematic review",
      "score": 0.5011155605316162
    },
    {
      "name": "Metric (unit)",
      "score": 0.48328784108161926
    },
    {
      "name": "Evidence-based practice",
      "score": 0.41472870111465454
    },
    {
      "name": "MEDLINE",
      "score": 0.3724508285522461
    },
    {
      "name": "Physical therapy",
      "score": 0.3640146553516388
    },
    {
      "name": "Psychology",
      "score": 0.34063854813575745
    },
    {
      "name": "Alternative medicine",
      "score": 0.18570160865783691
    },
    {
      "name": "Operations management",
      "score": 0.1355239748954773
    },
    {
      "name": "Surgery",
      "score": 0.12428820133209229
    },
    {
      "name": "Psychiatry",
      "score": 0.0947408676147461
    },
    {
      "name": "Economics",
      "score": 0.0
    },
    {
      "name": "Pathology",
      "score": 0.0
    },
    {
      "name": "Law",
      "score": 0.0
    },
    {
      "name": "Political science",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I4210161256",
      "name": "Impact",
      "country": "CA"
    },
    {
      "id": "https://openalex.org/I98251732",
      "name": "McMaster University",
      "country": "CA"
    },
    {
      "id": "https://openalex.org/I98635879",
      "name": "American University of Beirut",
      "country": "LB"
    },
    {
      "id": "https://openalex.org/I4210128618",
      "name": "University of Kansas Medical Center",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I2801240073",
      "name": "University Medical Center Freiburg",
      "country": "DE"
    },
    {
      "id": "https://openalex.org/I161046081",
      "name": "University of Freiburg",
      "country": "DE"
    },
    {
      "id": "https://openalex.org/I1302368450",
      "name": "Environmental Protection Agency",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I4210108595",
      "name": "National Center for Environmental Assessment (EPA)",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I132976966",
      "name": "Universität für Weiterbildung Krems",
      "country": "AT"
    },
    {
      "id": "https://openalex.org/I2802542264",
      "name": "University Hospital of Basel",
      "country": "CH"
    },
    {
      "id": "https://openalex.org/I4210112050",
      "name": "MRC/CSO Social and Public Health Sciences Unit",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I7882870",
      "name": "University of Glasgow",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I36234482",
      "name": "University of Bristol",
      "country": "GB"
    }
  ]
}