{
  "title": "Nonsinusoidal load current effect on the electrical and thermal operating parameters of oil filled power distribution transformers",
  "url": "https://openalex.org/W2808017938",
  "year": 2018,
  "authors": [
    {
      "id": "https://openalex.org/A1985697200",
      "name": "Emil CAZACU",
      "affiliations": [
        "Universitatea Națională de Știință și Tehnologie Politehnica București"
      ]
    },
    {
      "id": "https://openalex.org/A4310008177",
      "name": "Maria-Cătălina Petrescu",
      "affiliations": [
        "Universitatea Națională de Știință și Tehnologie Politehnica București"
      ]
    },
    {
      "id": "https://openalex.org/A145585675",
      "name": "Valentin Ionita",
      "affiliations": [
        "Universitatea Națională de Știință și Tehnologie Politehnica București"
      ]
    },
    {
      "id": "https://openalex.org/A2082323987",
      "name": "Lucian Petrescu",
      "affiliations": [
        "Universitatea Națională de Știință și Tehnologie Politehnica București"
      ]
    },
    {
      "id": "https://openalex.org/A1985697200",
      "name": "Emil CAZACU",
      "affiliations": [
        "Universitatea Națională de Știință și Tehnologie Politehnica București"
      ]
    },
    {
      "id": "https://openalex.org/A4310008177",
      "name": "Maria-Cătălina Petrescu",
      "affiliations": [
        "Universitatea Națională de Știință și Tehnologie Politehnica București"
      ]
    },
    {
      "id": "https://openalex.org/A145585675",
      "name": "Valentin Ionita",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2082323987",
      "name": "Lucian Petrescu",
      "affiliations": [
        "Universitatea Națională de Știință și Tehnologie Politehnica București"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2011218917",
    "https://openalex.org/W2028916270",
    "https://openalex.org/W2583490343",
    "https://openalex.org/W2026834139",
    "https://openalex.org/W2061229211",
    "https://openalex.org/W2704798100",
    "https://openalex.org/W2056390225",
    "https://openalex.org/W2612097614",
    "https://openalex.org/W2736283708",
    "https://openalex.org/W1980563516",
    "https://openalex.org/W2398082527",
    "https://openalex.org/W2140721288",
    "https://openalex.org/W1238487998",
    "https://openalex.org/W6648885967",
    "https://openalex.org/W2552762412",
    "https://openalex.org/W1994703669"
  ],
  "abstract": "Most of the in-service power distribution transformers from the industrial electric facilities were designed to operate under pure sinusoidal state conditions. Nevertheless, the majority of the loads from modern electric installations are intrinsically nonlinear and consequently, they generate nonsinusoidal currents. These high-order harmonics (present into the current waveform spectrum) have a negative impact on the transformers thermal and electrical operating parameters and, ultimately, limit the machine loading capability. The paper quantitatively investigates the transformer behavior under distorted current conditions by developing a procedure for evaluating different relevant operating quantities (maximum permissible current, the hottest spot temperature, aging acceleration factor and the machine remaining lifetime). The computation relays on the international standard recommendation and mainly uses the load current harmonic spectrum and the transformer rated data. To reveal the proposed procedure performance, a distribution transformer of 400 kVA from an industrial plasterboard facility is investigated.",
  "full_text": "Nonsinusoidal Load Current Effect on the Electrical \nand Thermal Operating Parameters of Oil Filled \nPower Distribution Transformers   \nEmil CAZACU, Maria-Cătălina PETRESCU, Valentin IONIŢĂ, Lucian PETRESCU \nElectrical Engineering Department \nUniversity POLITEHNICA of Bucharest \nBucharest, Romania \nemil.cazacu@upb.ro, catalina.petrescu@upb.ro, valentin.ionita@upb.ro, lucian.petrescu@upb.ro  \n \n \nAbstract— Most of the in-service power distribution \ntransformers from the industrial electric facilities were designed \nto operate under pure sinusoidal state conditions. Nevertheless, \nthe majority of the loads from modern electric installations are \nintrinsically nonlinear and consequently, they generate \nnonsinusoidal currents.  These high-order harmonics (present \ninto the current waveform spectrum) have a negative impact on \nthe transformers thermal and electrical operating parameters \nand, ultimately, limit the machine loading capability. The paper \nquantitatively investigates the transformer behavior under \ndistorted current conditions by developing a procedure for \nevaluating different relevant operating quantities (maximum \npermissible current, the hottest spot temperature, aging \nacceleration factor and the machine remaining lifetime). The \ncomputation relays on the international standard \nrecommendation and mainly uses the load current harmonic \nspectrum and the transformer rated data. To reveal the \nproposed procedure performance, a distribution transformer of \n400 kVA from an industrial plasterboard facility is investigated. \nIndex Terms — Derating, Distribution transformers, Harmonics, \nHot spot Temperature, Power Quality.  \nI. INTRODUCTION \nOne of the most common power quality issue encountered \nin the modern electric power grids is the distortion of the \ncurrent or voltage waveforms. That is mainly caused by the \nproliferation of the nonlinear loads, which are to be found in \nany industrial or domestic low-voltage installations [1-3]. One \ncould rightly state, that due to the extensive electronic device \nusage, the linear loads are nowadays increasingly rare. \nAdditionally, the high penetration of photovoltaic plants, \nvarious energy storage systems or the electric vehicles \ncharging devices, significantly contribute to the current \nharmonics dispersion into the electric network [4-6]. These \nnon-sinusoidal load currents adversely impact all the electric \nequipments involved into powe r delivery process. Thus, the \ncurrent harmonics increase the equipment intrinsic losses, rise \ntheir normal operating temperatures and, finally, reduce their \nlife time expectation. Consequently, the international standard \nregulations [7] recommend specific values for various power \nquality factors ( e.g. total harmonic distortion) in order to \nmaintain all function parameters (electrical and thermal) of the \nappliances or installation under their rated values.  \nThe power distribution transformers from many industrial \nfacilities were design to serve linear loads. Therefore, they are \nseverely affected by the non-sinusoidal load currents. \nConsequently, the reduction of their loading capability \n(derating) is commonly adopted [8-10]. It is useful to mention \nthat other remedial measures to harmonic problems could also \nbe considered: installing harmonic filters, nonlinear load \naggregation or even replacing of the actual transformer with a \nK-rated unit (specially designed to work under non-sinusoidal \ncondition) [11, 12]. These measures are to be applied only if \nthe electric installation allows network topology changes or a \nmajor maintenance action is scheduled. Unfortunately, these \nsituations are rare, and hence, the transformer is to be derated. \nThe most advanced derating techniques and thermal models of \nthe transformer use numerical computation methods, which \ndemand detailed constructive data and active materials \nproperties [13, 14]. The latter are mostly unavailable for \nin-service distribution transformers. Thus, for the energy audit \nstudies and proactive maintenance actions, this paper suggests \nan efficient determination practice of the transformer electrical \nand thermal parameters, suitable for field measurements. \nThe suggested method considers the international standard \nrecommendations [15, 16] and requires the load current \nharmonic spectrum (easy to measure and acquire) and the \ntransformer rated data. Thus, the transformer main critical \nthermal and electrical operating parameters are continuously \nmonitored. The developed procedure is also able to predict the \ntransformer’s maximum loading capability and its life \nexpectancy under the non-sinusoidal steady-state regime. The \nhere proposed investigation procedure was exemplified on a \n400 kVA power distribution transformer that supplies an \nindustrial plasterboard facility. \n978-1-5386-0517-2/18/$31.00 ©2018 IEEE \nII. THE TRANSFORMER NON-SINUSOIDAL STEADY –STATE \nOPERATION CONDITION \nA. Losses Distribution within the Transformer  \nThe total losses within a distribution transformer under \ndistorted current condition P T are commonly categorized in \ntwo classes [2, 15]: no load losses P NL (excitation losses) and \nload losses PLL (impedance losses). The latter comprises \nohmic winding losses or DC losses P DC and the total stray \nlosses PTSL, which could be further subdivided into the \nwinding eddy current losses PEC and other than winding eddy \ncurrent losses POSL (that come out in core, core clamps, \nmagnetic shield, tank or other transformer constructive parts). \nThis power losses division is presented in Fig. 1. \nConsequently, one could write:  \n.,, OSLECTSLTSLDC LL LL NL T P P P P P P P P P+ =+ =+ =   (1) \nThe DC losses in the windings conductors PDC are \nproperly considered to be directly proportional with the square \nof the load effective current value. It has been also proven [15] \nthat the eddy current losses P\nEC are proportional with the \nsquare of the effective value of the load current and \nconsidered proportional with the square of the frequency. \nAdditionally, the other stray losses P\nOSL increase with the \nsquare of the winding current effective value too and with an \nexponential factor for the frequency, conservatively adopted \nas 0.8 [15]. Therefore, to account the harmonic effect of the \ntransformer operation, two power quality factors have been \ndefined: the harmonic loss factor F\nHL and the harmonic loss \nfactor for other stray losses FHL-STR, respectively [15]: \n     ,1,1\n1\n2 8 . 0\n2\n1\n2 2\n2 \n=\n−\n=\n==\nN\nk\nkSTR HL\nN\nk\nkHL I k\nI\nF I k\nI\nF       (2) \nwhere \n=\n=\nN\nk\nkI I\n1\n2  is the root mean square of the transformer \ncurrent of N harmonic components with effective values Ik. In \nour further computation, we consider N =50.  \nConsidering the above-mentioned factors, one can express \nthe load losses for any non-sinusoidal current in terms of \ntransformer rated DC losses P\nDC-R, rated eddy current losses \nPEC-R and rated other stray losses POSL-R:  \n()\n() ,\n and,\n,with ,\n2\n2\n2\n0\n2 8 . 0\n2\n20\n2 2\n2\n2\n0\n2\n2\n2\nSTR HL R OSLHL R EC R DC\nSTR HL R OSLHL R EC R DC\nR\nLL\nN\nk\nk\nR\nR OSL\nOSL\nN\nk\nk\nR\nR EC\nEC\nN\nk\nk\nR\nR DC\nDCOSLEC DC LL\nF P F P P\nF P F P PI\nIP\nI k\nI\nPP I k\nI\nPP\nI\nI\nPPP P P P\n− −−−\n− −−−\n=\n−\n=\n−\n=\n−\n++ β =\n=++\n\n\n\n\n=\n==\n=+ + =\n\n\n (3) \nwhere β is the load factor defined as the root mean square \ncurrent of the load I relative to transformer rated sinusoidal \ncurrent at the secondary winding IR2: β=I/IR2. \n \nFigure 1.  Power losses categorisation within a power distribution \ntransformer under non-sinusoidal operating condition. \nTo compute the transformer rated DC losses, the primary \n(R1) and secondary ( R2) windings per-phase DC resistances \nare required along with the machine rated currents ( IR1 and \nIR2). These data are to be taken from the transformer’s \nmanufacturer tests report, which indicate also the no load \nlosses PNL and rated load losses PLL-R. Thus, one may write: \n.\n),( 3 2\n2 2\n2\n1 1\nR DC R LL R TSL\nRRR DC\nP P P\nI R I RP\n−−−\n−\n− =\n+ =                         (4)  \nAdditionally, according to the international standard \nrecommendations [15], for oil filled distribution transformers, \nthe rated winding eddy current losses P\nEC-R and rated other \nstray losses POSL-R could be conservatively estimated: \n. 67 . 0, 33 . 0 R TSLR OSL R TSLR EC PP PP −−−− ==       (5) \nThe transformer loading capability or the transformer \nmaximum permissible current (I MPC) is to be determined by \nconstraining the transformer load losses PLL (when supplying \nnon-sinusoidal load currents) to equal its initial rated load \nlosses P\nLL-R (indicated under pure sinusoidal state):  \n.2\nSTR HL R OSLHL R EC R DC\nR LL\nRMPC F P F P P\nPI I\n− −−−\n−\n++=       (6) \nThe transformer corresponding maximum load factor βmax, \nthe reduction in apparent power rating ( RAPR) and its \ncorresponding maximal operating capacity SM can be derived: \n[]\n,\n%. 1001 % 100\n,\nmax\nmax\n2max\nRM\nR\nM R\nR MPC\nS S\nS\nS SRAPR\nI I\nβ =\n⋅ β − = ⋅−=\n= β\n    (7) \nwhere SR is the transformer rated power indicated by the \nmachine manufacturer under normal (sinusoidal) condition. \n \nB. Transformer Hot Spot Temperature Estimation \nThe constructive parts of the transformer are constantly \nsubjected to thermal stress of different intensity during the \nnormal machine operation. Supplementary, the non-sinusoidal \nload currents, due to the harmonic content, significantly \ncontribute to the transformer temperature rise and could \ngenerate its premature failure or malfunction [15-18]. The \nmost important (dominant) parameter that causes the \ndestruction of the transformer insulation materials and finally \nestablishes the machine lifetime expectancy is the hot spot \ntemperature θ\nH of the windings. The latter could be expressed \nin terms of the oil temperature rise with respect to ambient \ntemperature θTO, conductor hot spot temperature rise relative \nto oil temperature θg, and the ambient temperature θA [15]: \n.A g TO Hθ + θ + θ = θ                      (8) \nThe terms involved in the hot spot temperature relation \ncould be evaluated considering the current harmonic spectrum \n(F\nHL), the load factor (β) and the transformer rated data [15]: \n() ,\nor\n,\n8 . 022\n8 . 022\n8 . 0\n\n\n\n\n\n\n+\nβ + βθ − θ = θ\n\n\n\n\n\n\n+\nβ + βθ = θ\n\n\n\n\n\n\n+\n+θ = θ\n−−\n−−\n−\n−−\n−−\n−\n−\n−\nR EC R DC\nR EC HLR DC\nR TO w g\nR EC R DC\nR EC HLR DC\nR g g\nNL R LL\nNL LL\nR TO TO\nP P\nP FP\nP P\nP FP\nP P\nP P\n     (9) \nwhere θTO-R is the rated oil temperature rise with respect to the \nambient temperature, θg-R is the rated conductor temperature \nrise, relative to oil temperature, and θw is the rated winding \n(conductor) rise over the ambient temperature.  \nC. Thermal Aging and Transformer Lifetime Expectacy  \nTo appreciate the transformer conductor insulation \ndeterioration level due to the hot spot temperature, an aging \nacceleration factor FAA was adopted [16]. This mainly \nindicates the rate at which the transformer insulation aging is \naccelerated compared with the aging rate at a reference hot \nspot temperature (θHref). Its expression mainly depends on the \ninsulation type and the transformer by a material constant B \nand the operating hot spot temperature θH [16]: \n.273273exp \n\n\n\n\n\n+ θ−+ θ=\nHHref\nAA\nBBF               (10) \nThe aging acceleration factor F AA will have values less \nthan unity for hot spot temperatures under the reference value \n(θH < θHref). This restriction will keep the transformer operating \nparameters under their rated va lues maintaining its initial life \ntime estimation (also under distorted current conditions). \nThe transformer life span is mainly a function of the \nmachine hot spot temperature and it is directly associated with \nthe conductor insulation degradation [17, 18]. Thus, the \ninsulation life time expectancy is formulated as an adaptation \nof Arrhenius reaction rated theory (indicated relative to the \nnormal insulation life) [16]:     \n,273exp ) ( \n\n\n\n\n\n+ θ=\nH\nBA pu Life                      (11) \nwhere A and B are constants evaluated according to insulation \nmaterial and the reference hot spot temperature defined for the \nmaterial normal insulation life. That is usually considered \n20.55 years for transformers with an average winding \ntemperature rise relative to ambient temperature of 65 ºC and \ncommon insulation type (not thermally upgraded). This \ncorresponds to a reference hot spot temperature of 110 ºC and \nmaterial constants values of A = 9.8·10\n–18 and B =15000 [16]. \nSupplementary, the transformer percent loss of life % LOL \nfor a certain time t (indicated in years) and the machine \nremaining life RL prediction could be also evaluated [16-18]: \n, ) (\n,100%\nNIL pu LifeF\nNILRL\nNIL\nt FLOL\nAA\nAA\n= =\n⋅ ⋅=\n                    (12) \nwhere NIL represents the transformer normal insulation life.  \nThe here presented transformer investigation method was \nimplemented in a computation procedure, whose flowchart is \nillustrated in Fig. 2. That enables an in-situ, fast and \ncontinuous operating parameters computation for in-service \ndistribution transformers that supply nonlinear loads. The load \ncurrent harmonic spectrum and the transformer rated data are \nthe only required input data.  \n \nFigure 2.  The flowchart for proposed procedure of computing the \ntransformer electrical and thermal operating parameters. \nIII. DERATING AND THERMAL STRESS PARAMETER \nCOMPUTATION – CASE-STUDY  \nThe derating procedure and the thermal stress computation \nfor a distribution transformer subjected to distorted currents \nare further exemplified on an oil-filled 400 kVA unit. The \nmachine feeds both linear and nonlinear loads of an electrical \nindustrial plasterboard facility. The loads are operating \ncontinuously and do not change their main electric features \nduring operation. They are illustrated in Fig. 3, where the \ninvestigated transformer is also exposed. The main \ntransformer rated parameters are indicated in the Appendix. \nAn electric energy audit study on this in-service power \ndistribution transformer is performed, mainly focusing on the \npotential power quality issues encountered at the machine \nlow-voltage windings (installations’ point of common \ncoupling). Accordingly, the main features of the electric \nquantities are properly acquired by a high performance (IEC-\nclass A) power quality analyzer [19] connected at the main \nelectric panel installation. Additionally, the investigation \nintends to establish whether the entire load could be safely \nincreased with 30% considering that the harmonic spectrum of \nthe current through the transformer secondary windings is \npreserved. Consequently, a software package was developed, \nmainly implementing the derating and thermal computation \nprocedures presented in the previous section, and exploiting \nthe transformer manufacturer’s test report and the power \nquality parameters (current harmonic spectrum) at the \ntransformer low-voltage side. Thus, the electrical and thermal \noperating parameters of the machine are continuously \ncomputed and monitored. The measured currents waveforms, \ntheir harmonic spectrum and unbalance level are presented in \nFigs. 4-6, while Fig. 7 depicts the measured absorbed active, \nreactive and apparent power with the associated power factors.   \n \nFigure 3.  The analysed three-phase power distribution transformer serving  \na mixture of linear and nonlinear loads. \n \nFigure 4.  The phase currents waveforms through the transformer’s \nsecondary windings (at low-voltage side). \n \nFigure 5.  The harmonic spectrum of phase currents at transformer’s \nsecondary part.  \n \nFigure 6.  The unbalance level of the low-voltage phase currents.  \n \nFigure 7.  Active, reactive and apparent power. \nThe most relevant transformer operating parameters \n(electrical and thermal) are continuously computed in \naccordance to the load factor and current harmonic spectrum \nchanges. Thereby, in Table I the values of the power losses \ndistribution within the transformer and the machine significant \ntemperatures values are indicated for two different load \nfactors. Thus, the first load factor β\n1 = 0.623 corresponds to \nthe transformer actual state (characterized by the parameters \npresented in Figs. 4 – 7) and the second one β\n2 = 0.810 is \nachieved when the load is increa sed with 30 % relative to the \nfirst state, maintaining its harmonic spectrum.  \nIn the actual harmonic steady-state ( β1 = 0.623), the load \ngenerates a hot spot temperature value  θH1 = 96.139 ºC, that \nstill lies under the acceptable reference value of θ Href =110 ºC \n(the other transformer rated temperatures are indicated in the \nAppendix). Correspondingly, the insulation relative aging \nacceleration factor has a subunit value ( F\nAA1 = 0.229) and the \npercent loss of life per year is insignificant. Accordingly, the \ntransformer preserves its initial estimated life time expectancy \nthat equals the machine normal insulation life: 22.5 years. For \nthe second load factor β\n2 = 0.81, the thermal operating \nparameters of the transforme r exceed their rated values: \nθH2 = 120.94 ºC, FAA2 = 2.969 (super unit value) and the \npercent loss of life pro year reaches 14.45 %. Therefore, the \ntransformer remaining life dram atically declines to only \nRL\n2 = 6.92 years. These phenomena are properly illustrated in \nFig. 8, Fig. 9 (semi-log plot) and Fig. 10, where the maximal \nacceptable load factor of βmax = 0.743 with θHref = 110 ºC, \nFAA = 1 and RL= NIL is also presented.  \nTABLE I.  THE COMPUTED TRANSFORMER OPERATING PARAMETERS \nA) Losses and temperatures within the transformer  \nType of losses in \nthe transformer \n(W) \n \nRated linear load \n(sinusoidal \ncurrents) \n \nDifferent nonlinear loads \n(non-sinusoidal currents) \nLoad factor β = I/I2R \nβ = 1 β1 = 0.623 β2 = 0.810  \nNo load PNL  980 980 980 \nDC Ohmic PDC  3933.333 1530.352 2586.295 \nEddy current \nPEC 649 1865.262 3152.293 \nOther stray POSL 1317.666 754.198 1274.595 \nTotal PT 6880 5129.813 7993.185 \nThe top-oil-rise over the ambient \ntemperature θTO (ºC) 50.170 71.866 \nThe hottest spot conductor rise over  \ntop-oil temperature θ\ng (ºC) 5.968 9.082  \nThe transformer hottest spot \nwinding temperature θH (ºC) 96.139 120.948 \nAging acceleration factor FAA 0.229 2.969 \nThe percent loss of life (% LOL) pro \nyear  1.118 14.450 \nRemaining life RL (years) 20.55 6.922 \nB) Transformer maximal acceptable operating parameters \nMaximum load factor                   βmax   = 0.743   \nMaximum permissible current  IMPC = 429.404 A  \nMaximal operating capacity  SM   = 297.500 kVA  \nReduction in apparent power rating   RAPR = 25.624 % \nPractically, the transformer maximal operating capacity is \nrestrained, due to the harmonics effects, at SM = 297.5 kVA, \nwhich corresponds to a reduction of the apparent power rating \n(RAPR) of more than 25 %. The maximum permissible current \nreaches IMPC = 429.404 A (βmax = 0.743).   \n \nFigure 8.  The transformer hot spot temperature dependency of the load \nfactor.  \n \nFigure 9.  The relative aging acceleration factor of the transformer versus \nload factor (semilogarithmic plot).  \n \nFigure 10.  The real life estimation of the transformer versus load factor .  \nIV. CONCLUSIONS \nThe steady-state functionality of an in-service power \ndistribution transformer that feeds a mixture of linear and \nnonlinear loads was quantitatively examined and analyzed. \nThe study comprises the computation of both the electrical \nand thermal operating parameters of the transformers using \non-site measured power quality data, non-invasively acquired \nat the machine low-voltage side. The method principle mainly \nfollows the international standard recommendations and only \ndemands the harmonic current spectrum at the transformer \nsecondary part along with machine manufacturer test report \ndata. The whole computation procedure for evaluating the \nlosses and temperature distribution within the transformer was \nimplemented in a very flexible general-purpose software \npackage. The developed code allows farther extensions and \nchanges to increase its computation potential and \ninterconnectivity with various power quality analyzers. Thus, \nthe main transformer thermal and electrical parameters are \ncontinuously monitored, and th eir abnormal values are to be \nsignaled to the protection equipments. Consequently, the \ntransformer normal life span (indicated under pure sinusoidal \ncondition) is preserved. The here adopted derating and thermal \ncomputation technique is to be improved in terms of its \naccuracy by a more precise determination of the winding eddy \ncurrent losses and other stray losses and by considering also \nother commonly encountered power quality issues (e.g. load \nunbalances or voltage waveform distortion).  \nA\nPPENDIX  \nTABLE II.  RATED DATA FOR INVESTIGATED TRANSFORMER  \nRated power capacity SR = 400 kVA \nCooling type Oil Natural Air Natural (ONAN) \nVector group Dy0-11 \nPrimary rated voltage U1R = 20 kV \nSecondary rated voltage U2R = 0.4 kV \nNo load power losses PNL = 0.98 kW \nRated load losses at 75 ºC (Short \ncircuit power losses) PLL-R = 5.9 kW \nMagnetization current i0 = 1.9 % \nShort circuit voltage (Impedance \nvoltage at rated current) usc = 6 % \nPer-phase DC resistance of \nprimary winding at 75 \nºC R1 = 7.375 Ω \nPer-phase DC resistance of \nsecondary winding at 75 \nºC R2 = 2.950 mΩ \nAmbient temperature θA = 40 ºC \nTop-oil-rise over ambient \ntemperature under rated conditions   θTO-R = 60 ºC \nWinding rise over  ambient \ntemperature under rated condition θw-R = 65 ºC \nACKNOWLEDGMENT \nThis work has been funded by University Politehnica of \nBucharest, through the “Excellence Research Grants” \nProgram, UPB – GEX 2017. Identifier: UPB- GEX 2017, \nCtr. No. 3 /2017”. The authors would like also to thank \nELNET INSTAL Ltd. Company- Romania for providing all \nthe necessary high-performance measurement equipment. \nR\nEFERENCES \n[1] M. S. Rad, M. Kazerooni, M. J. Ghorbany and H. Mokhtari, \"Analysis \nof the grid harmonics and their impacts on distribution transformers,\" in \nProc. 2012 IEEE Power and Energy Conference at Illinois, \nChampaign, IL, pp. 1-5. \n[2] J. Faiz, M. Ghazizadeh and H. Oraee, \"Derating of transformers under \nnon-linear load current and non-sinusoidal voltage – an overview,\" IET \nElectric Power Applications, vol. 9, no. 7, pp. 486-495, 8, 2015. \n[3] E. Cazacu, L. Petrescu and V. Ioni ţă, \"Derating of power distribution \ntransformers serving nonlinear industrial loads,\" in  Proc. 2017 IEEE \nInternational Conference on Optimization of Electrical and Electronic \nEquipment (OPTIM) & 2017 Intl Aegean Conference on Electrical \nMachines and Power Electronics (ACEMP), Brasov , pp. 90-95. \n[4] K. D. McBee, \"Transformer Aging due to High Penetrations of PV, EV \nCharging, and Energy Storage Applications,\" in  Proc . 2017 IEEE 9\nth \nAnnual Green Technologies Conference (GreenTech), Denver, CO , pp. \n163-170. \n[5] M. A. Awadallah, T. Xu, B. Venkatesh and B. N. Singh, \"On the \nEffects of Solar Panels on Distribution Transformers,\" IEEE Trans. on \nPower Delivery, vol. 31, no. 3, pp. 1176-1185, June 2016. \n[6] H. Turker, S. Bacha and A. Hably, \"Rule-Based Charging of Plug-in \nElectric Vehicles (PEVs): Impacts on the Aging Rate of Low-Voltage \nTransformers,\" IEEE Trans. on Power Delivery , vol. 29, no. 3, pp. \n1012-1019, June 2014. \n[7] IEEE Recommended Practice and Requirements for Harmonic Control \nin Electric Power Systems,\" IEEE Std 519-2014 (Revision of IEEE Std \n519-1992), June 2014. \n[8] S. A. Deokar and L. M. Waghmare, \"Impact of power system \nharmonics on insulation failure of distribution transformer and its \nremedial measures,\" in  Proc. 2011 IEEE 3\nrd International Conference \non Electronics Computer Technology, Kanyakumari, pp. 136-140. \n[9] P. M. Nicolae, I. Daniel Smărăndescu, M. S. Nicolae, D. L. Popa and I. \nD. Nicolae, \"Considerations on a MV/LV Transformer which Supplies \na Distorting Load,\" in  Proc . 2016 IEEE Int. Po wer Electronics and \nMotion Control Conference (PEMC), Varna, pp. 354-359. \n[10] R. Singh and A. Singh, \"Aging of distribution transformers due to \nharmonics,\" in  Proc.  2010 14\nth IEEE International Conference on \nHarmonics and Quality of Power - ICHQP, Bergamo, pp. 1-8. \n[11] M. Costea and T. Leonida, \"The effect of using isolation transformers \nto supply small nonlinear loads,\" in Proc. 2014 16\nth IEEE International \nConference on Harmonics and Quality of Power (ICHQP) , Bucharest, \npp. 337-341. \n[12] M. A. Taher, S. Kamel and Z. M. Ali, \" K-Factor and transformer losses \ncalculations under harmonics,\" in Proc. 2016 IEEE 18 th Intert. Middle \nEast Power Systems Conference (MEPCON), Cairo, pp. 753-758. \n[13] S. Taheri, A. Gholami, I. Fofanaa, H. Taheri, “Modeling and simulation \nof transformer loading capability and hot spot temperature under \nharmonic conditions,” Electric Power Systems Research , vol. 86, pp. \n68– 75, 2012. \n[14] O. A. Amoda, D. J. Tylavsky, G. A. McCulla and W. A. Knuth, \n\"Acceptability of Three Transformer Hottest-Spot Temperature \nModels,\" IEEE Transactions on Power Delivery, vol. 27, no. 1, pp. 13-\n22, Jan. 2012. \n[15] IEEE Recommended Practice for Establishing Liquid-Filled and Dry-\nType Power and Distribution Transformer Capability When Supplying \nNonsinusoidal Load Currents, IEEE Std. C57.110-2008, Aug. 2008. \n[16] IEEE Guide for Loading Mineral-Oil-Immersed Transformers and \nStep-Voltage Regulators ,\" IEEE Std C57.91-2011 (Revision of IEEE \nStd C57.91-1995), March 2012. \n[17] E. Cazacu, L. Petrescu and V. Ioni ţă, \"Losses and temperature rise \nwithin power transformers subjected to distorted currents,\" in Proc. \n2017 IEEE 15\nth International Conference on Electrical Machines, \nDrives and Power Systems (ELMA), Sofia, pp. 362-365. \n[18] D .  M .  S a i d ,  K .  M .  N o r  a n d  M .  S .  M a j i d ,  \" A n a l y s i s  o f  d i s t r i b u t i o n  \ntransformer losses and life expectancy using measured harmonic data,\" \nin in Proc. 2010 14\nth IEEE International Conference on Harmonics and \nQuality of Power - ICHQP, Bergamo, pp. 1-6. . \n[19] *** Fluke 435 - IEC Class A - Three-Phase Power Quality Analyzer -  \nUser Manual, Fluke Corporation, 2010 \n ",
  "topic": "Electrical engineering",
  "concepts": [
    {
      "name": "Electrical engineering",
      "score": 0.5920194983482361
    },
    {
      "name": "Distribution transformer",
      "score": 0.5500208735466003
    },
    {
      "name": "Transformer",
      "score": 0.5192880034446716
    },
    {
      "name": "Thermal",
      "score": 0.4917943775653839
    },
    {
      "name": "Current transformer",
      "score": 0.4886660873889923
    },
    {
      "name": "Current (fluid)",
      "score": 0.46167632937431335
    },
    {
      "name": "Power (physics)",
      "score": 0.4508880078792572
    },
    {
      "name": "Environmental science",
      "score": 0.35157084465026855
    },
    {
      "name": "Materials science",
      "score": 0.3251291513442993
    },
    {
      "name": "Automotive engineering",
      "score": 0.3215361535549164
    },
    {
      "name": "Engineering",
      "score": 0.31568077206611633
    },
    {
      "name": "Voltage",
      "score": 0.28540271520614624
    },
    {
      "name": "Physics",
      "score": 0.19868534803390503
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    },
    {
      "name": "Meteorology",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I61641377",
      "name": "Universitatea Națională de Știință și Tehnologie Politehnica București",
      "country": "RO"
    }
  ],
  "cited_by": 16
}