{
    "title": "Numerical Study of Estimating the Arrival Time of UHF Signals for Partial Discharge Localization in a Power Transformer",
    "url": "https://openalex.org/W2801619804",
    "year": 2018,
    "authors": [
        {
            "id": "https://openalex.org/A2931043207",
            "name": "Sang-Gyu Ha",
            "affiliations": [
                "Hanyang University"
            ]
        },
        {
            "id": "https://openalex.org/A2123220824",
            "name": "Jeahoon Cho",
            "affiliations": [
                "Hanyang University"
            ]
        },
        {
            "id": "https://openalex.org/A2097108958",
            "name": "Juneseok Lee",
            "affiliations": [
                "Hanyang University"
            ]
        },
        {
            "id": "https://openalex.org/A2644639817",
            "name": "Byoung Woon Min",
            "affiliations": [
                "Hyundai Engineering (South Korea)"
            ]
        },
        {
            "id": "https://openalex.org/A2141081630",
            "name": "Jae-Hoon Choi",
            "affiliations": [
                "Hanyang University"
            ]
        },
        {
            "id": "https://openalex.org/A2172287929",
            "name": "Kyung-Young Jung",
            "affiliations": [
                "Hanyang University"
            ]
        },
        {
            "id": "https://openalex.org/A2931043207",
            "name": "Sang-Gyu Ha",
            "affiliations": [
                "Hanyang University"
            ]
        },
        {
            "id": "https://openalex.org/A2123220824",
            "name": "Jeahoon Cho",
            "affiliations": [
                "Hanyang University"
            ]
        },
        {
            "id": "https://openalex.org/A2097108958",
            "name": "Juneseok Lee",
            "affiliations": [
                "Hanyang University"
            ]
        },
        {
            "id": "https://openalex.org/A2644639817",
            "name": "Byoung Woon Min",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2141081630",
            "name": "Jae-Hoon Choi",
            "affiliations": [
                "Hanyang University"
            ]
        },
        {
            "id": "https://openalex.org/A2172287929",
            "name": "Kyung-Young Jung",
            "affiliations": [
                "Hanyang University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2108929535",
        "https://openalex.org/W2168931656",
        "https://openalex.org/W2156989309",
        "https://openalex.org/W2106843899",
        "https://openalex.org/W2134853691",
        "https://openalex.org/W2165358416",
        "https://openalex.org/W2399997911",
        "https://openalex.org/W2518184519",
        "https://openalex.org/W2604123296",
        "https://openalex.org/W2025711769",
        "https://openalex.org/W2144420934",
        "https://openalex.org/W134376647",
        "https://openalex.org/W2104752620"
    ],
    "abstract": "Partial discharges (PDs) are electrical sparks that occur inside insulation between two conducting electrodes and can lead to the disastrous failure of insulation systems. To determine the location of a PD, a distributed array of UHF PD sensors is used to detect the electromagnetic (EM) signals emitted from the PD source, and the localization of the PD source can be estimated using the time difference of arrival (TDOA) between EM signals captured by the UHF PD sensor array. There are four popular methods to estimate the TDOA—the first peak method, the cross-correlation method, the energy criterion method, and the average time window threshold method. In this work, we numerically investigate the influence of noise on estimating the TDOA for the four different methods. Numerical results show that the energy criterion method is more robust against noise than other methods.",
    "full_text": "JOURNAL OF ELECTROMAGNETIC ENGINEERING AND SCIENCE, VOL. 18, NO. 2, 94~100, APR. 2018 \nhttps://doi.org/10.26866/jees.2018.18.2.94  \nISSN 2234-8395 (Online) ∙ ISSN 2234-8409 (Print) \n94 \n     \n \nI. INTRODUCTION \nPartial discharges (PDs) are electrical sparks that occur inside \ninsulation between two conducting electrodes. This phenome-\nnon causes physical damage to the insulator inside a power \ntransformer and seriously degr ades the performance of the \ntransformer. Therefore, the localization of PD signals is critical \nto maintain the insulation condition of high-voltage insulation \nsystems. The ultra-high frequency (UHF) technique is a useful \nmethod to detect PD signals [1–3]. One advantage of this tech-\nnique is that it is less susceptible to external environments and is \nless affected by external noise compared to the ultrasonic meth-\nod. A distributed array of UHF PD sensors is used to detect PD \nsignals simultaneously, and the localization of PD signals can be \nestimated using the time difference of arrival (TDOA) between \nelectromagnetic (EM) signals captured by the sensor array. \nEM propagation from a PD source is very complicated due to \nmultiple reflections inside a power transformer. Therefore, an \naccurate estimation of the TDOA is essential for precise locali-\nzation of the PD source. Four methods are commonly used to \nestimate the TDOA—the first peak method [4], the cross-\ncorrelation method [5], the energy criterion method [6], and the \naverage time window threshold method [7, 8]. In practice, PD \nsignals received by UHF sensor s are usually contaminated by \nunwanted signals, such as digital radio signals, thermal noise in \ndetection systems, and telecommunication signals. These noise \ndegrades the accuracy of estimating the TDOA and therefore \nmay result in a false PD location. \n \nNumerical Study of Estimating the Arrival Time  \nof UHF Signals for Partial Discharge Localization  \nin a Power Transformer  \nSang-Gyu Ha1 · Jeahoon Cho1 · Juneseok Lee1 · Byoung-Woon Min2 ·  \nJaehoon Choi1 · Kyung-Young Jung1,* \n \n \n   \nAbstract \n \nPartial discharges (PDs) are electrical sparks that occur inside insulation between two conducting electrodes and can lead to t he disastrous \nfailure of insulation systems. To determine the location of a PD , a distributed array of UHF PD sensors is used to detect the e lectromag-\nnetic (EM) signals emitted from the PD source, and the localization of the PD source can be estimated using the time difference  of arri-\nval (TDOA) between EM signals captured by the UHF PD sensor array. There are four popular methods to estimate the TDOA—the \nfirst peak method, the cross-correlation method, the energy crit erion method, and the average time window threshold method. In this \nwork, we numerically investigate the influence of noise on estima ting the TDOA for the four different methods. Numerical result s show \nthat the energy criterion method is more robust against noise than other methods. \nKey Words: Finite-Difference Time-Domain Method, Partial Discharges, Time Difference of Arrival.\n \n \n \nManuscript received July 24, 2017 ; Revised December 8, 2017 ; Accepted February 5, 2018. (ID No. 20170724-033J)  \n1Department of Electronics and Computer Engineering, Hanyang University, Seoul, Korea. \n2Research & Development Dept., Hyundai Electric & Energy Systems Co., Ltd., Korea. \n*Corresponding Author: Kyung-Young Jung (e-mail: kyjung3@hanyang.ac.kr)   \n \n \nThis is an Open-Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http://creativecommons.org/licenses/by-nc/4.0) which permits \nunrestricted non-commercial use, distribution, and reproduction in any medium, provided the original work is properly cited. \nⓒ Copyright The Korean Institute of Electromagneti c Engineering and Science. All Rights Reserved. \nHA et al.: NUMERICAL STUDY OF ESTIMATING THE ARRIV AL TIME OF UHF SIGNALS FOR PARTIAL DISCHARGE LOCALIZATION IN A POWER TRANSFORMER  \n95 \n  \n \nThe purpose of this work is to determine a robust method of \naccurately ascertaining the TDOA of PD signals in the pres-\nence of noise. As stated, UHF signals captured by PD sensors \nhave complex waveforms due to non-line-of-sight (NLOS) \npropagation. Therefore, a full-wave EM analysis method is re-\nquired to accurately obtain UHF signals emitted from PD \nsources. Of the many EM analysis methods, this study employs \nthe finite difference time domain (FDTD) method because of \nits versatility, robustness, and accuracy [9–13]. In contrast to the \nmethod of moment [14] and the finite element method [15], in \nthe FDTD method it is not necessary to perform the inverse \nFourier transformation to obtain time-domain EM signals to \nestimate the TDOA.  \nII. NUMERICAL SIMULAION \nNumerical simulation of UHF signal propagation from a PD \nsignal in an actual oil-immersed power transformer that is 7,000 \n× 4,000 × 5,000 mm3 in volume is performed using the CST \nMicrowave Studio time-domain solver, which is based on \nFDTD. The transformer configuration is shown in Fig. 1. The \ntransformer mainly consists of an iron core, a coil, and a tank. \nThe iron core and coil are colored yellow and grey, respectively, \nin Fig. 1. The tank is used to hold oil and to isolate components \nfrom the external environment. The dimension of the tank is \nthe same as the simulation area. The diameter of the coil is \n2,774 mm, and the width and length of the core are 1,320 mm \nand 6,520 mm, respectively. All components are set as perfect \nelectric conductor in the FDTD simulation. The PD signal is \nmodelled with an exponential function [1]. Note that the die-\nlectric constant of oil was measured using an Agilent 85070E \ndielectric probe kit and an 8719ES network analyzer and was \ndetermined to be 1.7. In this work, we simulate many scenarios \nby changing the location of a PD source. To this end, the trans-\nformer structure is divided into 140 (7 × 4 × 5) subdomains, as \nshown in Fig. 2. The dimension of each subdomain is 1,000 × \n1,000 × 1,000 mm3. The PD source is placed at the center of \neach subdomain, and then 80 scenario simulations are per-\nformed by changing the PD source position. The last 60 scenar-\nios are excluded because each center of the 60 subdomains is \nenclosed or located in windings and iron core.  \nDisc-type UHF PD sensors [16] are located on the inner sur-\nface of the power transformer to receive the propagated EM \nwaves from the PD emitting source. The positions of the UHF \nPD sensors are given in Table 1.  \nIII. NUMERICAL RESULTS \nIn the power transformer tank, the localization of the PD \nsource can be estimated using the TDOA between EM signals \n \n(a) \n \n \n(b) \nFig. 1. The power transformer configuration. (a) perspective view \nand (B) top view. \n \n  \nFig. 2. The subdomain configuration. \n \nTable 1. Positions of UHF PD sensors \nNumber of sensor X (mm) Y (mm) Z (mm) \nUHF Sensor 1 935 3,390 5,000 \nUHF Sensor 2 2,435 340 5,000 \nUHF Sensor 3 6,632 970 5,000 \nUHF Sensor 4 5,005 340 5,000 \n \ncaptured by the UHF PD sensor array. Usually, four methods—\nthe first peak method, the cross- correlation method, the energy \ncriterion method, and the average time window threshold \nmethod—are used to estimate the TDOA. In an actual power \ntransformer environment, the main cause of TDOA errors is \nnoise. Therefore, we investigate the influence of noise on the \narrival time of UHF signals. In this work, white Gaussian noise \n(WGN) with three different intensities is used. In this work, \n\nJOURNAL OF ELECTROMAGNETIC ENGINEERING AND SCIENCE, VOL. 18, NO. 2,APR. 2018 \n96 \n   \n  \n \nFig. 3. Time-domain UHF PD signals received at Sensor 1. \n \nsignals with a signal-to-noise ratio (SNR) of -5 dB, -10 dB, and \n-20 dB are used. Fig. 3 shows the time-domain PD signals re-\nceived at UHF sensor 1 with and without noise when the PD \nsource is located at P1. The power of the PD signal in Fig. 3 \nwas -38.95 dBm, and power of the noise was set to -43.95 dBm, \n-48.95 dBm, and -58.95 dBm for the SNRs of -5 dB, -10 dB, \nand -20 dB, respectively. To ev aluate the robustness of each \nmethod, the noise-added PD signals are compared with the \noriginal PD signal.  \n \n1. First Peak Method \nIn the first peak method, the arrival time of UHF signals is \ndefined as the first occurrence of a peak whose signal amplitude \nexceeds a specific threshold. The threshold value chosen is arbi-\ntrary and depends on visual inspection to determine the first \npeak. In this work, 10% of the normalized PD signal was cho-\nsen as the threshold value. Fig. 4 illustrates how the first peak \nmethod determines arrival time from the received signal. The \ntime difference of the PD signals was calculated using the first \npeak method for 80 scenarios. Fig. 5 shows the results of the \nfirst peak method between the signal captured by reference sen-\nsor 4 and that captured by sensor 1 (i.e., TD14). When the \nstronger noise (SNR = -10 dB and -5 dB) are added, the time \nlags show nearly 0 seconds in Fi g. 5, as the level of the first \npeaks is smaller than the noise level (refer to Fig. 3). Table 2 \nshows the average error of arrival time difference versus the \nSNR for the first peak method. Note that the first peak method \nis not at all robust against noise. \n \n2. Cross-Correlation Method \nThe cross-correlation method is used to find the similarity of \ntwo received UHF signals. This method gradually shifts the \nreference signal over the others to find a matching signal. The \ncross-correlation value is maximum when signals are most com-\nparable to each other. The cross-correlation is defined as [5]: \n \n1\n0\n1Xcorr( ) ( ) ( )\nNn\nm\nng m h n mN\n\n\n  ,            (1) \n \nFig. 4. Determining the arrival time using the first peak method \n(Sensor 1). \n \n \nFig. 5. Arrival time difference using the first peak method (TD14). \n \nTable 2. Average error of arrival ti me difference for the first peak \nmethod  \nUHF PD signal \nOriginal + WGN \n-5 dB -10 dB -20 dB \nAverage \nerrors (%)\nTD12 40.53 40.47 42.38 \nTD13 50.15 50.11 52.34 \nTD14 40.93 40.89 38.83 \nTD23 80.70 80.72 110.3 \nTD24 34.09 34.03 78.19 \nTD34 40.81 40.86 89.54 \n \n \nFig. 6. Determining the arrival time difference using the cross-\ncorrelation method (TD14). \n\nHA et al.: NUMERICAL STUDY OF ESTIMATING THE ARRIV AL TIME OF UHF SIGNALS FOR PARTIAL DISCHARGE LOCALIZATION IN A POWER TRANSFORMER  \n97 \n  \n \n \nFig. 7. Arrival time difference using the cross-correlation method \n(TD14).  \n \nTable 3. Average error of arrival time difference for the cross-\ncorrelation method  \nUHF PD signal \nOriginal + WGN \n-5 dB -10 dB -20 dB \nAverage \nerrors (%) \nTD12 10.98 10.02 4.29 \nTD13 10.72 3.97 0.88 \nTD14 11.38 6.46 3.99 \nTD23 8.86 2.98 0.95 \nTD24 9.56 3.29 2.74 \nTD34 14.71 7.55 2.29 \n \n \nFig. 8. Determining the arrival time using the energy criterion \nmethod (Sensor 1). \n \nwhere N is the total number of data points. The maxima will \nnot be located at the center of the similarity graph when the \nsignals are not identical. Fig. 6 shows how much the maxima far \nfrom the center line represents the TDOA between two sensors. \nFig. 7 shows the result of the cross-correlation between the sig-\nnal captured by reference sensor 4 and that captured by sensor 1 \nfor 80 scenarios. Table 3 shows the average error of arrival time \ndifference for the cross-correlation method. The cross-corre-\nlation method is not particularly robust against noise. \n \n3. Energy Criterion Method \nThe energy criterion method is based on the energy content \nof the signal, and the energy criterion signal is defined as [6]: \n2\n1\n1EC( )\nn\ni\ni\nnv nN \n\n  ,                   (2) \nwhere N is the total number of data points and 2\n1\n/\nn\ni\ni\nvN\n\n . \nThe minimum of the energy criterion signal corresponds with \nt h e  a r r i v a l  t i m e  o f  t h e  P D  s i g n a l s ,  a s  s h o w n  i n  F i g .  8 .  F i g .  9  \nshows the result of the energy criterion between the signal cap-\ntured by reference sensor 4 and that captured by sensor 1 for 80 \nscenarios. Table 4 shows the average error of arrival time differ- \n \n \nFig. 9. Arrival time difference using the energy criterion method \n(TD14). \n \n \nFig. 10. Determining the arrival time using the average time win-\ndow threshold method (Sensor 1). \n \nTable 4. Average error of arrival time difference for the energy cri-\nterion method  \nUHF PD signal \nOriginal + WGN \n-5 dB -10 dB -20 dB \nAverage \nerrors (%)\nTD12 6.28 4.79 0.50 \nTD13 4.05 2.21 0.91 \nTD14 3.71 1.39 0.18 \nTD23 8.04 5.90 1.41 \nTD24 8.31 4.44 0.27 \nTD34 5.87 2.03 0.89 \n\nJOURNAL OF ELECTROMAGNETIC ENGINEERING AND SCIENCE, VOL. 18, NO. 2,APR. 2018 \n98 \n   \n  \n \nFig. 11. Arrival time difference using the average time window \nthreshold method (TD14). \n \nence for the energy criterion method. As shown in the figure \nand table, the energy criterion m e t h o d  i s  v e r y  r o b u s t  a g a i n s t  \nnoise. \n \n4. Average Time Window Threshold Method \nThe average time window threshold method is used to gener-\nate an average signal over a shifting window on the time axis. \nNote that this method more robust against noise than the first \npeak method because it eliminates some oscillations. This \nmethod is defined as [7, 8]: \n \n1\n1ATWT( ) ,\nt\nn\nit\ninwt\nnv n ww  \n  ,             ( 3 )  \n \nwhere tw  is the width of the time window. Eqs. (4) and (5) are \nused to determine the value of tw  using the frequency spec-\ntrum of the UHF signal.  \n \n                  1\n2\nt\na\nw f                           ( 4 )  \n              1\n1\n()\n()\nN\nii\ni\na N\ni\ni\nfV f\nf\nVf\n\n\n\n\n\n                       \n(5)\n \n \nwhere, af  is the average frequency of the UHF signal calculat-\ned using its frequency spectrum ()Vf . In this work, the \nthreshold value chosen is 10% of the time window averaged \nsignal, as shown in Fig. 10. Fig. 11 shows an example of the av-\nerage time window threshold between the signal captured by \nreference sensor 4 and that captured by sensor 1 for 80 scenarios. \nTable 5 shows the average error of arrival time difference for the \naverage time window threshold method. We confirmed that the \naverage time window threshold method is not robust to noise. \nIV.\n CONCLUSION \nWe have studied estimating the arrival time of UHF signals \nfor PD localization in a power transformer. Four methods—the \nfirst peak method, the cross-co rrelation method, the energy  \nTable 5. Average error of arrival time difference for the average \ntime window threshold method \nUHF PD signal \nOriginal + WGN \n-5 dB -10 dB -20 dB \nAverage \nerrors (%)\nTD12 51.47 4.84 1.51 \nTD13 55.67 5.00 1.26 \nTD14 45.10 4.72 1.25 \nTD23 91.34 9.27 3.49 \nTD24 47.98 6.77 2.88 \nTD34 72.61 9.41 2.46 \n \ncriterion method, and the average time window threshold \nmethod—are used to estimate the accuracy of arrival time dif-\nference. We have investigated the influence of noise with three \ndifferent intensities on the arrival time of UHF signals and have \nconfirmed that the energy criterion method is the most robust \nto noise. \n  \nThis research was partly supported by the Hyundai Electric \n& Energy System Co., Ltd. and the Basic Science Research \nProgram through the National Research Foundation of Ko-\nrea (NRF) funded by the Ministry of Education (No. \n2017R1D1A1B03034537). We thank colleagues from the \nTransformer R&D Center who provided partial discharge \ninformation about the power transformer. \nREFERENCES \n[1] M. D. Judd, L. Yang, and I. B. B. Hunter, \"Partial dis-\ncharge monitoring for power transformers using UHF sen-\nsors part 1: Sensors and signal interpretation,\" IEEE Electri-\ncal Insulation Magazine, vol. 21, no. 2, pp. 5–14, 2005. \n[2] M. D. Judd, O. Farish, and B. F. Hampton, \"The excitation \nof UHF signals by partial discharges in GIS,\" IEEE Trans-\nactions on Dielectrics and Electrical Insulation, vol. 3, no. 2, pp. \n213–228, 1996. \n[3] L. Yang and M. D. Judd, \"P ropagation characteristics of \nUHF signals in transformers for locating partial discharge \nsources,\" in Proceedings of the 13th International Symposium \non High Voltage Engineering, Delft, Netherlands, 2003. \n[4] P. Kakeeto, M. D. Judd, J.  Pearson, and D. Templeton, \n\"Experimental investigation of positional accuracy for UHF \npartial discharge location,\" in Proceedings of the International \nConference on Condition Monitoring and Diagnosis, Beijing, \nChina, 2008, pp. 1070–1073. \n[5] Y. Sun, B. G. Stewart, and I. J. Kemp, \"Alternative cross-\ncorrelation techniques for location estimating of PD from \nRF signals,\" in Proceedings of the 39th International Universi-\n\nHA et al.: NUMERICAL STUDY OF ESTIMATING THE ARRIV AL TIME OF UHF SIGNALS FOR PARTIAL DISCHARGE LOCALIZATION IN A POWER TRANSFORMER  \n99 \n  \n \nties Power Engineering Conference , Bristol, UK, 2004,  pp. \n143–148. \n[6] S. Markalous, T. Strehl, C. Herold, and T. Leibfried, \"En-\nhanced signal processing for conventional and unconven-\ntional PD measuring methods: wavelet de-noising, auto-\nmatic detection algorithms and averaging for arrival time-\nbased PD location in transformers and power cables,\" in \nProceedings of 2008 International Conference on Condition \nMonitoring and Diagnosis, Beijing, China, 2008, pp. 1115–\n1118. \n[7] X. Song, M. D. Judd, and C. Zhou, \"An optimal algorithm \nfor applying wavelet transform in identifying the arrival time \nof PD pulse in a UHF detection system,\" in Proceedings of \nthe 42nd International Universities Power Engineering Confer-\nence, Brighton, UK, 2007, pp. 495–498. \n[8] X. Song, C. Zhou, and D. M. Hepburn, \"An algorithm for \nidentifying the arrival time of PD pulses for PD source loca-\ntion,\" in Proceedings of Annual Report Conference on Electrical \nInsulation Dielectric Phenomena, Quebec, Canada, 2008, pp. \n379–382. \n[9] A. Taflove and S. C. Hagness, Computational Electrodynam-\nics: The Finite Difference Time Domain Method, 3rd ed. Nor-\nwood, MA: Artech House, 2005. \n[10] K. Y. Jung, F. Teixeira, and R. Reano, \"Au/SiO2 nanoring \nplasmon waveguides at optical communications band,\" \nJournal of Lightwave Technology, vol. 25, no. 9, pp. 2757– \n \n \n \n \nSang-Gyu Ha \nreceived a B.S. degree in Electrical and Computer \nEngineering from Ajou University, Suwon, South \nKorea and a Ph.D. degree in Electronics and Com-\nputer Engineering from Hanyang University, Seoul, \nKorea in 2011 and 2017, respectively. Since July \n2017, he has been with LG Electronics. His current \nresearch areas are finite-difference time-domain \n(FDTD), non-Foster antennas, and 5G millimeter \nwaves.  \n \n \n \n \n \n \n \n \n \n \n \n2765, 2007. \n[ 1 1 ]  S .  G .  H a ,  J .  C h o ,  J .  C h o i ,  H .  K i m ,  a n d  K .  Y .  J u n g ,  \n\"FDTD dispersive modeling of human tissues based on \nquadratic complex rational function,\" IEEE Transactions on \nAntennas and Propagation, vol. 61, no. 2, pp. 966–999, \n2013. \n[12] A. K. Lee, Y. Yoon, S. Lee, B. Lee, S. E. Hong, H. D. \nChoi, and E. Cardis, \"Numerical implementation of repre-\nsentative mobile phone models for epidemiological studies,\" \nJournal of Electromagnetic Engineering and Science, vol. 16, \nno. 2, pp. 87–99, 2016. \n[13] G. Alsharahi, A. M. M.  Mostapha, A. Faize, and A. \nDriouach, \"Modelling and simulation resolution of ground-\npenetrating radar antennas,\" Journal of Electromagnetic En-\ngineering and Science, vol. 16, no. 3, pp. 182–190, 2016. \n[14] K. G. Kim, S. Lim, and J. W. Kim, \"Near fields around \nmetallic walls due to a nearby dipole source with applica-\ntions to EMC,\" Journal of Electrical Engineering & Technol-\nogy, vol. 12, no. 1, pp. 329–334, 2017. \n[15] J. M. Jin, The Finite Element Method in Electromagnetics, \n2nd ed. New York, NY: John Wiley & Sons, 2002. \n[16] A. M. Ishak, P. C. Baker, W. H. Siew, and M. D. Judd, \n\"Characterizing the sensitivity of UHF partial discharge \nsensors using FDTD modeling,\" IEEE Sensors Journal, vol. \n13, no. 8, pp. 3025–3031, 2013. \n \n \n \n \n \n \nJeahoon Cho \nreceived a B.S. degree in Communication Engineer-\ning from Daejin University, Pocheon, Korea and \nM.S. and Ph.D. degrees in Electronics and Comput-\ner Engineering from Hanyang University, Seoul, \nKorea in 2004, 2006, and 2015, respectively. From \n2015 to August 2016, he was a Postdoctoral Re-\nsearcher at Hanyang University. Since September \n2016, he has worked at Hanyang University, Seoul, \nKorea, where he is currently a Research Professor. His current research \ninterests include computational electromagnetics and electromagnetic \npulse/electromagnetic interference/electromagnetic compatibility analysis. \n \n \n \n \n \n \n \n \n \n \n \n\nJOURNAL OF ELECTROMAGNETIC ENGINEERING AND SCIENCE, VOL. 18, NO. 2,APR. 2018 \n100 \n   \n  \nJuneseok Lee \nreceived a B.S. in Electrical Engineering from \nChungnam National University, Daejeon, Korea in \n2010. He also received an M.S. degree from the \nDepartment of Electronics and Computer Engi-\nneering at The University of Queensland, Brisbane, \nAustralia in 2011. He has also conducted research \nfor a Ph.D. at Hanyang University, Seoul, Korea. \nHe is interested in RF components, including an-\ntenna design, wireless communication systems, wireless power transferring, \nand wireless body area networks. Currently, his research is focused on de-\nsigning microwave components for wireless body area network applications \nand antennas for next-generation wireless communication systems.  \n \n \n \n \n \n \n \n \nByoung-Woon Min \nreceived B.S., M.S., and Ph.D. degrees in Electrical \nEngineering from Myoungji University, Yongin, \nSouth Korea, in 1997, 1999, and 2004, respectively. \nSince April 2004, he has been with the Research & \nDevelopment Dept., Hyundai Electric & Energy \nSystems Co., Ltd., Korea, where he is currently a \nsenior researcher. His current research interests in-\nclude the analysis and diagnosis of partial discharge \nin high-voltage equipment. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nJaehoon Choi  \nreceived a B.S. degree from Hanyang University, \nKorea and M.S. and Ph.D. degrees from Ohio State \nUniversity, Columbus, Ohio in 1980, 1986, and \n1989, respectively. From 1989–1991, he was a re-\nsearch analyst with the Telecommunication Research \nCenter at Arizona State University, Tempe, Arizona. \nHe worked for Korea Telecom as a team leader of \nthe Satellite Communication Division from 1991–\n1995. Since 1995, he has been a professor in the Department of Electronic \nEngineering at Hanyang University, Korea. He has published more than \n200 peer-reviewed journal articles and has contributed to numerous confer-\nence proceedings. He holds over 50 patents. His research interests include \nantennas, microwave circuit design, and EMC. His current research is \nmainly focused on the design of compact, multi-band antennas for mobile \nwireless communication and various biomedical applications. \n  \n \n \n \n \nKyung-Young Jung \nreceived B.S. and M.S. degrees in Electrical Engi-\nneering from Hanyang University, Seoul, Korea in \n1996 and 1998, respectively and a Ph.D. degree in \nElectrical and Computer Engineering from Ohio \nState University, Columbus, Ohio in 2008. From \n2008–2009, he was a postdoctoral researcher at The \nOhio State University, and from 2009–2010 he was \nan Assistant Professor with the Department of Elec-\ntrical and Computer Engineering, Ajou University, Korea. Since 2011 he \nhas worked at Hanyang University, where he is now an Associate Professor \nin the Department of Electronic Engineering. Dr. Jung was a recipient of \nthe Graduate Study Abroad Scholarship from the National Research \nFoundation of Korea, the Presidential Fellowship from The Ohio State \nUniversity, the Best Teacher Award from Hanyang University, and the \nOutstanding Research Award from the Korean Institute of Electromagnet-\nic Engineering Society. His current research interests include computation-\nal electromagnetics, bio electromagnetics, and plasmonics. \n"
}