{
  "title": "The identification and appraisal of assessment tools used to evaluate metatarsus adductus: a systematic review of their measurement properties",
  "url": "https://openalex.org/W2805703870",
  "year": 2018,
  "authors": [
    {
      "id": "https://openalex.org/A2103169186",
      "name": "Nicole Marshall",
      "affiliations": [
        "University of South Australia"
      ]
    },
    {
      "id": "https://openalex.org/A2115262525",
      "name": "Emily Ward",
      "affiliations": [
        "University of South Australia"
      ]
    },
    {
      "id": "https://openalex.org/A4212472479",
      "name": "Cylie M. Williams",
      "affiliations": [
        "Peninsula Health",
        "University of South Australia",
        "Monash University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W6600283524",
    "https://openalex.org/W2012500404",
    "https://openalex.org/W2232443722",
    "https://openalex.org/W83243537",
    "https://openalex.org/W6602480240",
    "https://openalex.org/W6679327860",
    "https://openalex.org/W2074098069",
    "https://openalex.org/W1968177729",
    "https://openalex.org/W2016313941",
    "https://openalex.org/W2316009351",
    "https://openalex.org/W2101002030",
    "https://openalex.org/W2217247844",
    "https://openalex.org/W6689680569",
    "https://openalex.org/W61884449",
    "https://openalex.org/W1997853552",
    "https://openalex.org/W49437421",
    "https://openalex.org/W2590084699",
    "https://openalex.org/W2007872832",
    "https://openalex.org/W2464541908",
    "https://openalex.org/W2036060563",
    "https://openalex.org/W2171762906",
    "https://openalex.org/W7007155",
    "https://openalex.org/W2037897342",
    "https://openalex.org/W2108833504",
    "https://openalex.org/W2032412486",
    "https://openalex.org/W1968279635",
    "https://openalex.org/W2043809260",
    "https://openalex.org/W1985484323",
    "https://openalex.org/W1998512889",
    "https://openalex.org/W2463668192",
    "https://openalex.org/W1998001980",
    "https://openalex.org/W4256210701",
    "https://openalex.org/W1999263795",
    "https://openalex.org/W2131656965",
    "https://openalex.org/W2054287352",
    "https://openalex.org/W2335144793",
    "https://openalex.org/W4319308361",
    "https://openalex.org/W1913131808",
    "https://openalex.org/W2066380436",
    "https://openalex.org/W1959670754",
    "https://openalex.org/W2156098321",
    "https://openalex.org/W1940412714",
    "https://openalex.org/W2118779846"
  ],
  "abstract": "Abstract Background Metatarsus adductus is the most common congenital foot deformity in newborns. It involves adduction of the metatarsals at the Lisfranc joint. A systematic literature review was conducted to investigate the following question: What tools are used to identify and quantify metatarsus adductus and how reliable, valid and responsive are they? Methods The following electronic databases were searched for studies describing tools for the identification and quantification of metatarsus adductus in adults and children published from inception to June 2016: Ovid MEDLINE, Embase, CINAHL, Scopus, Web of Science and AMED. Two researchers initially searched all articles by screening titles and abstracts. If there was any doubt as to an article's eligibility, the full text paper was retrieved. Reference lists and citations of all retained studies were examined in an attempt to locate further studies. Articles were excluded if they were not in English or described other congenital foot conditions that did not include metatarsus adductus. Studies included in the review reporting measurement properties of measurement tools were critically appraised using the Consensus‐based Standards for the selection of health Measurement Instruments (COSMIN) critical appraisal tool. Results There were 282 articles screened by title and abstract and 28 articles screened from full text. Fifteen articles were included and nine had data that were extractable for appraisal using the COSMIN critical appraisal tool. Techniques to measure metatarsus adductus included the heel bisector method, photocopies, ultrasound, footprints, dynamic foot pressure and radiographs. There was a paucity of quality data reporting the reliability, validity or responsiveness for measuring metatarsus adductus. Several radiographic angles showed good reliability (intraclass correlation (ICC) – 0.84, 0.97) in adults during pre‐operative planning. Conclusion There have been multiple assessment techniques proposed for quantification of metatarsus adductus, but there is paucity of reliability, validity or responsiveness to measurement data about these techniques, especially in relation to the paediatric population. Further consideration of measurement testing is required to determine if the most common non‐radiographic measures of metatarsus adductus are acceptable for clinical use.",
  "full_text": "REVIEW Open Access\nThe identification and appraisal of\nassessment tools used to evaluate\nmetatarsus adductus: a systematic review\nof their measurement properties\nNicole Marshall 1*, Emily Ward 1 and Cylie M. Williams 1,2,3\nAbstract\nBackground: Metatarsus adductus is the most common congenital foot deformity in newborns. It involves\nadduction of the metatarsals at the Lisfranc joint. A systematic literature review was conducted to investigate the\nfollowing question: What tools are used to identify and quantify metatarsus adductus and how reliable, valid and\nresponsive are they?\nMethods: The following electronic databases were searched for studies describing tools for the identification and\nquantification of metatarsus adductus in adults and children published from inception to June 2016: Ovid MEDLINE,\nEmbase, CINAHL, Scopus, Web of Science and AMED. Two researchers initially searched all articles by screening\ntitles and abstracts. If there was any doubt as to an article ’s eligibility, the full text paper was retrieved. Reference\nlists and citations of all retained studies were examined in an attempt to locate further studies. Articles were\nexcluded if they were not in English or described other congenital foot conditions that did not include metatarsus\nadductus. Studies included in the review reporting measurement properties of measurement tools were critically\nappraised using the Consensus-based Standards for the selection of health Measurement Instruments (COSMIN)\ncritical appraisal tool.\nResults: There were 282 articles screened by title and abstract and 28 articles screened from full text. Fifteen\narticles were included and nine had data that were extractable for appraisal using the COSMIN critical appraisal\ntool. Techniques to measure metatarsus adductus included the heel bisector method, photocopies, ultrasound,\nfootprints, dynamic foot pressure and radiographs. There was a paucity of quality data reporting the reliability,\nvalidity or responsiveness for measuring metatarsus adductus. Several radiographic angles showed good reliability\n(intraclass correlation (ICC) – 0.84, 0.97) in adults during pre-operative planning.\nConclusion: There have been multiple assessment techniques proposed for quantification of metatarsus adductus,\nbut there is paucity of reliability, validity or responsiveness to measurement data about these techniques, especially\nin relation to the paediatric population. Further consideration of measurement testing is required to determine if\nthe most common non-radiographic measures of metatarsus adductus are acceptable for clinical use.\nKeywords: Metatarsus adductus, Assessment, Paediatric, Child\n* Correspondence: Marnj008@mymail.unisa.edu.au\n1University of South Australia, School of Health Science, Adelaide, SA 5000,\nAustralia\nFull list of author information is available at the end of the article\n© The Author(s). 2018 Open Access This article is distributed under the terms of the Creative Commons Attribution 4.0\nInternational License ( http://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and\nreproduction in any medium, provided you give appropriate credit to the original author(s) and the source, provide a link to\nthe Creative Commons license, and indicate if changes were made. The Creative Commons Public Domain Dedication waiver\n(http://creativecommons.org/publicdomain/zero/1.0/) applies to the data made available in this article, unless otherwise stated.\nMarshall et al. Journal of Foot and Ankle Research  (2018) 11:25 \nhttps://doi.org/10.1186/s13047-018-0268-z\nBackground\nMetatarsus adductus is the most common congenital\nfoot deformity in newborns with a reported prevalence\nof one to two cases per 1000 births [ 1]. The deformity\nappears as an adduction or medial deviation of the fore-\nfoot at the tarsometatarsal joints (Lisfranc joint) with\nassociated soft tissue contractures that may lead to osse-\nous changes over time [ 2– 4]. The metatarsals are devi-\nated medially in the transverse plane resulting in a\nconvex lateral border of the foot and a prominent styloid\nprocess [ 3, 5, 6]. Metatarsus adductus can be differenti-\nated from other congenital foot conditions as it is purely\na forefoot condition that does not involve the hindfoot\nunlike talipes equinovarus or skewfoot [ 3]. The exact\naetiology of metatarsus adductus is unknown, however,\nit has been suggested that increased intrauterine\npressure, osseous abnormality and abnormal muscle at-\ntachments may be potential causes [ 7– 12]. Between 87\nand 90% of flexible metatarsus adductus cases resolve\nspontaneously without the need for further treatment\n[10, 11, 13, 14].\nThere is inconclusive evidence on the long term effect\nof metatarsus adductus on the adult foot [ 15]. Some au-\nthors propose that if metatarsus adductus persists into\nadulthood it can lead to the development of hallux val-\ngus, skewfoot or hammer toes, intoeing, increased med-\nial tibial torsion, fifth metatarsal stress fractures,\ndifficulty fitting into shoes and can contribute to in-\ncreased falling or tripping later in life [ 7, 12, 16– 18].\nMetatarsus adductus is commonly diagnosed accord-\ning to the presence and severity of the deformity and the\ndegree of flexibility using the Bleck manual assessment\n[3, 4, 19– 21]. Clinically, assessments are used to deter-\nmine if treatment is required, the method of treatment,\nmonitoring progress and to ensure the child ’s foot has\nreturned to a normal foot alignment post intervention\n[22]. Whilst there are numerous assessment techniques\npublished to quantify the presence of metatarsus adduc-\ntus, there is little research assessing validity, reliability or\nresponsiveness of these measures. This is potentially\nproblematic for clinicians, as quantification of the condi-\ntion drives treatment and management decisions [ 15].\nThere have been several assessment techniques pro-\nposed in the literature for the assessment of the deform-\nity to quantify the severity. In 1983, Bleck created a\nvisual assessment called the ‘heel bisector method ’. It in-\nvolves firstly visually identifying the severity of the de-\nformity and categorising it as mild, moderate or severe\naccording to the heel bisector and secondly making a\nclassification of flexibility as fully flexible, partially\nflexible or severe. This simple method requires minimal\ntime for both the clinician and patient and as it was ob-\nservation based, and cost effective [ 3]. This measure has\nbeen modified and used in numerous studies since its\ndevelopment and continues to be clinically utilised to\nreassure parents that their child ’sf o o tp o s i t i o nw i l lr e s o l v e\nwith time or to drive treatment initiation [ 4, 19, 20].\nOther assessment methods described within the litera-\nture to grade severity include a multitude of radio-\ngraphic angles [ 23– 25], photocopies of the child ’s foot\n[19] and the V-finger test [ 16, 17]. Radiographs may be\nconsidered time consuming and unnecessary given\npotential risk to the child. Photocopying the child ’s foot\nposes potential risk due to glass breakage. Recent studies\nsuggest the use of ultrasound as a measurement\ntechnique as it allows for the imaging of cartilaginous\nstructures [ 21].\nAs previously discussed, many treatment options are\ninitiated based on the observed presence of deformity, to\nmeasure severity and flexibility of the condition. There-\nfore if the tool used to measure these components was\nnot adequate, this has implications for the initiation of\ntreatment where needed, or potentially unnecessary\ntreatment leading to a potential poor prognosis for that\nchild. [ 16]. The primary aim of this systematic review\nwas to identify, and where possible, appraise the meas-\nurement properties of all known methods for identifying\nthe severity and/or flexibility of metatarsus adductus.\nMethods\nSearch strategy\nThe PRISMA guidelines for systematic reviews were\nfollowed [ 26]. The question and search terms were de-\nveloped using the broad concepts of the PICO (Popula-\ntion, Intervention Comparison and Outcomes) model\n[27]. The systematic review was registered with Prospero\n(CRD42016039622). The following electronic databases\nwere searched for studies describing assessment tools for\nthe identification and quantification of metatarsus\nadductus in adults and children published from incep-\ntion to June 2016: Ovid MEDLINE, CINAHL, Scopus,\nWeb of Science and AMED. Broad MeSH terms and\nkeywords were used to identify the articles of interest\n(e.g. Metatarsus adductus) and quantification termin-\nology (e.g. measure, assess). Additional file 1 contains\nthe full search terms and truncation used within each\ndatabase. Citation chaining was undertaken to identify\nany articles that may have been missed in the initial\nsearch strategy. It involved employing a forward and\nbackward searching strategy using Google Scholar cita-\ntions to identify relevant articles using a single paper as\na starting point which creates a ‘chain’ of references\nlinked backward and forward from the original article.\nThe inclusion and exclusion criteria used for search\nstrategy is listed in Table 1.\nTwo researchers (NM & CMW) initially screened the\ntitle and abstract of all articles. If there was any doubt as\nto an article ’s eligibility, the full text paper was retrieved.\nMarshall et al. Journal of Foot and Ankle Research  (2018) 11:25 Page 2 of 10\nArticles were imported into Covidence for screening\n[28]. The full text of included study abstracts were inde-\npendently screened against the inclusion criteria by two\nreviewers (NM & EW). Any disagreement was resolved\nby discussion or through consultation with the third\nauthor. Figure 1 displays the search process.\nData extraction\nData were extracted by the first author and where there\nwere queries, these were resolved with all authors. Data\nextracted included the study design, population,\nassessment measure/description, sample size, reliability\n(inter/intra rater reliability), statistical quality, available\nTable 1 Inclusion and exclusion criteria for articles included in the systematic review\nInclusion Criteria: Exclusion Criteria:\n Studies describing a tool measuring metatarsus adductus.  Studies describing congenital foot deformities with no inclusion of\nmetatarsus adductus These included but were not limited to: skewfoot,\ncongenital talipes equinovarus, metatarsus primus varus, congenital\nmetatarsus varus or serpentine foot.\n Studies reporting any measurement properties of measurement tools\nfor assessing metatarsus adductus as defined by the COSMIN tool.\n All study designs\n Studies based on both adults and children\n Non-English publications.\n Grey literature\nFig. 1 PRISMA flow of article inclusion\nMarshall et al. Journal of Foot and Ankle Research  (2018) 11:25 Page 3 of 10\ndomains of the COSMIN and author derived measure-\nment [ 29].\nCritical appraisal of study methodology quality\nWhere studies reported measurement properties, they\nwere critically appraised using the Consensus-based\nStandards for the selection of health Measurement\nInstruments (COSMIN) critical appraisal tool [ 29]. The\nCOSMIN was developed in an international Delphi\nstudy to improve the selection of health measurement\ninstruments [ 29]. This was found to have adequate\ncontent validity [ 30]. COSMIN assessed the internal\nconsistency, reliability, measurement error, hypothesis\ntesting, content and structural validity, responsiveness\nand interpretability of a measurement [ 31]. Articles\nchosen for inclusion in the synthesis were subject to\nappraisal by two independent reviewers.\nThe COSMIN may be utilised as a modular tool and\nused to assess the quality of measurement based studies\nincluding patient reported outcome measures, scales and\nsimple measures such as those appraised in this present\nstudy. Therefore only relevant parts of the checklist were\nused for quality evaluation of measurements [ 29] included:\nbox B (reliability), D (content validity), H (criterion validity)\nand I (responsiveness). For ex ample, if the study reported\non the measurement properties involving reliability then\nb o xBw a st h eo n l yp a r to ft h eC O S M I Nc o m p l e t e d[29].\nCOSMIN also requires generalizability to be assigned for\neach measure. The results of these modules were then\nassessed using a 4 point scale to allow calculation of the\noverall methodological quality score for each study. This\nmethodological quality score per box was obtained by\nassigning the lowest rating of any item in a box ( ‘worse\nscore counts’).\nResults\nIncluded studies\nThere were 15 studies included in this review. Of these\n15 articles, nine reported on measurement properties\nthat were able to be critically appraised for quality using\nthe COSMIN and six reported methods of measurement\nthat were unable to be appraised. Table 2 provides a\ndescription of the 15 included studies. A meta-analysis\nwas not performed as studies were heterogeneous. Each\nstudy varied in terms of participant age, country the\nstudy was conducted, gender and measurement tool\nused. Out of the 15 studies, two studies were conducted\non an adult population, eight studies had a paediatric\npopulation and five studies did not mention age. The\nmajority of studies were cohort study designs (Table 2).\nThere were six methods of measurement described to\nassess the severity or flexibility of metatarsus adductus\n(Table 3).\nReliability of measures employed to quantify metatarsus\nadductus\nThere were three studies assessing the reliability of three\ndifferent individual radiographic angles to assess meta-\ntarsus adductus [ 23, 32, 33]. These measures (Table 3)\nincluded the traditional and modified metatarsus adduc-\ntus angle, the Engel and/or modified Engel angles and\nthe rearfoot-second metatarsal angle [ 32, 33]. Only\nradiological measures reported any intra-rater reliability\nintra-class correlation coefficient (ICC). These ranged\nfrom 0.85 – 0.97 and the inter-rater reliability ICC ranged\nfrom 0.84 – 0.972 [ 32, 33] (Table 4).\nThe Berg ’s classification system reported diagnostic\nagreement ranging from 66.7 – 81% for inter-rater\nconsistency and 61.9 – 66.7% for intra-rater consistency.\nDuring reliability testing, authors removed five radio-\ngraphs that produced high disagreement between re-\nviewers from results, the administrations were not\nindependent and there was no time interval between\nreviewing the images.\nMethodology quality of the included studies\nThe COSMIN criterion was applied to the nine studies\nreporting measurement properties to determine their\nmethodological quality (Table 5). Three reported the\nreliability of the measure and assessed as fair to good\nmethodological quality [ 23, 32, 33]. One included\nreported content validity which rated poorly for methodo-\nlogical quality [ 34], one included criterion validity which\nalso rated poorly for methodological quality [ 35]. There\nwere five of the nine included studies assessed for respon-\nsiveness. All five studies were rated poorly for methodo-\nlogical properties relating to responsiveness according to\nthe COSMIN criterion [ 2, 4, 20, 25, 34]. There were no\nstudies reporting specific data on sensitivity or specificity\nin any included research.\nThere were several other measurement techniques\nidentified for assessing metatarsus adductus. These were\nunable to be critically appraised using the COSMIN due\nto a lack of reported measurement properties. These\nmeasures included Bleck ’s heel bisector method [ 3],\nphotocopying the child ’s foot [ 19], ultrasound [ 21], and\ndynamic foot pressure [ 13].\nDiscussion\nMetatarsus adductus has been described as the most\ncommon congenital foot deformity presenting in new-\nborns [ 1]. While this condition is self limiting in the vast\nmajority of cases, there is time when treatment is war-\nranted and guided by measurements assessed within this\nreview. Several measurement techniques are reported for\nassessment of this condition, but there was limited high\nquality evidence supporting the measurement properties\nof many of these measurements.\nMarshall et al. Journal of Foot and Ankle Research  (2018) 11:25 Page 4 of 10\nTable 2 Studies included within review\nPrimary\nAuthor\nStudy Design Country Sample Size Gender\nMale/ Female\nAge\n(Age (SD), Range)\nMeasure Inclusion\nCriteria\nExclusion\nCriteria\nData collection\nmethod\nTool developed\nby author:\nEngel [ 35] Retrospective\ncohort\nUSA 571 radiographs Not stated Not stated 1. Traditional metatarsus\nadductus angle (intersection\nof longitudinal axis of lesser\ntarsus with bisector of second\nmetatarsal)\n2. Simplified metatarsus angle\n(intersection of longitudinal\nbisector of 2nd metatarsal\nand medial cuneiform)\nFoot radiographs\nfrom Oxford hospital.\nNot stated Weight-bearing\nfoot radiographs\nYes\nDawoodi [ 38] Literature\nreview\nUnited\nKingdom\nNot stated Not stated Not stated 1. Traditional metatarsus\nadductus angle (intersection\nof longitudinal axis of lesser\ntarsus with bisector of second\nmetatarsal)\n2. Engel ’s angle (bisection of\nmiddle cuneiform with\nlongitudinal axis of second\nmetatarsal)\n3. Modified Engel ’s angle\nusing the base of the middle\ncuneiform as a reference line\nNot stated Not stated Not stated No\nDawoodi [ 32] Validation\nstudy\nUnited\nKingdom\n130 patients\n(50 randomly\nselected\nradiographs)\n119/14 50.6 (15.4) years,\n14– 80 years\n1. Sgarlarto ’s angle/traditional\nmetatarsus adductus angle\n(angle between 2nd\nmetatarsal and longitudinal\naxis of the lesser tarsus using\n4th metatarso-cuboid joint\nas reference)\n2. Rearfoot-2nd meta-tarsal\nangle\n3. Engel ’s angle (bisection\nof middle cuneiform with\nlongitudinal axis of second\nmetatarsal)\n4. Modified Engel ’s angle\nusing the base of the middle\ncuneiform as a reference line\nSymptomatic hallux\nabductovalgus, listed\nfor corrective surgery\nEvidence of\ntrauma,\nPrevious\nsurgery\nDorsoplantar\nradiographic views.\nNo\nFrench [ 34] Non-Controlled\nTrial\nUSA 42 (68 ft) 29/13 9.1 months\n1– 3 years\n1. Lateral calcaneal 5th\nMetatarsal angle (line\nrepresenting the lateral\naspect of calcaneus and the\nlongitudinal bisector of the\nfifth metatarsal)\n2. Inter-metatarsal angle\n(angle formed by longitudinal\nbisectors of 1st and 2nd\nmetatarsals)\n3. Talus first metatarsal angle\n(longitudinal bisectors of talus\nand the first metatarsals)\nClinical observation\nof metatarsus adductus\nNot stated AP and lateral\nradiographs\nFirst metatarsal\n-5th metatarsal\nangle only\nwas author\ndriven.\nMarshall et al. Journal of Foot and Ankle Research  (2018) 11:25 Page 5 of 10\nTable 2 Studies included within review (Continued)\nPrimary\nAuthor\nStudy Design Country Sample Size Gender\nMale/ Female\nAge\n(Age (SD), Range)\nMeasure Inclusion\nCriteria\nExclusion\nCriteria\nData collection\nmethod\nTool developed\nby author:\n4. Talocalcaneal angle\n(Kite’s angle) (longitudinal\nbisector of the talus and the\ncalcaneus)\n5. First metatarsal fifth metatarsal\nangle (angle formed by l\nongitudinal bisection of 1st\nand 5th metatarsals)\n6. Talocaneal angle lateral\nview (bisection of talus and\na line representing inferior\naspect of the calcaneus)\nHutchinson\n[39]\nExpert Opinion USA Not stated Not stated Not stated Describes Kite ’s talocalcaneal\nangle and calcaneal metatarsal\nangle without labeling of method\nNot applicable Not\napplicable\nRadiographs No\nWidhe [ 13] Prospective\ncohort\nSweden 2, 401 Not stated 0 – 16 years Dynamic foot pressure and\ngait analysis\nNot specifically stated. Not stated EMED\ndynamometric\nsystem\nNo\nKnörr [ 4] Prospective\ncohort\nSpain 26 (34 ft) 16/10 5.7 years,\n3– 8.5 years\n1. Heel bisector method\n(undescribed)\n2. First cuneiform metatarsal\nangle (medial angulation of\nfirst cuneometatarsal joint)\n3. Metatarsal-metaphyseal\nangle (metatarsal\nmetaphyseal incurvation)\nRigid Metatarsus\nadductus scheduled\nfor surgery\nNot stated Weight bearing\nradiographs\nNo\nMiron [ 21] Expert Opinion Canada N/A Not stated Not stated Lateral displacement of the\nmedial (first) cuneiform over\nthe navicular as the single feature.\nNot applicable Not\napplicable\nUltrasonography Yes\nLepow [ 25] Retrospective\ncohort\nUSA 15 7/8 6 months,\n(2– 15 months)\n1. Traditional metatarsus adductus\nangle (intersection of longitudinal\naxis of lesser tarsus with bisector\nof second metatarsal).\nDiagnosed with\nmetatarsus adductus\nNo\ntreatment\nNo\nradiography\nWB AP\nradiographs\nNo\nHerzenberg\n[20]\nProspective\ncohort\nUSA 27 (43 ft) Not stated 3 – 9 months. 1. Footprints analysed using\nmodification of Bleck ’s heel\nbisector method. A transparent\ntemplate with longitudinal\nbisector was applied over\nfootprint and graded\n2. Talocalcaneal angle\n(Kite’s angle) (longitudinal\nbisector of the talus\nand the calcaneus)\n< 9 months, Failed\nprogram of parent\nstretching\nChildren\nolder than\n9 months\nof age\nFootprints Yes\nSmith [ 19] Expert Opinion USA Not applicable Not\napplicable\nNot applicable Heel bisector drawn\nonto photocopy of a\nchild’s footprint. A\nsecond copy in\nmaximum correction\nN/A N/A Photocopied\nfootprint\nYes\nMarshall et al. Journal of Foot and Ankle Research  (2018) 11:25 Page 6 of 10\nTable 2 Studies included within review (Continued)\nPrimary\nAuthor\nStudy Design Country Sample Size Gender\nMale/ Female\nAge\n(Age (SD), Range)\nMeasure Inclusion\nCriteria\nExclusion\nCriteria\nData collection\nmethod\nTool developed\nby author:\nfor quantification\nof flexibility\nDominguez\n[33]\nRetrospective\ncohort\nSpain 121\n(20 randomly\nselected\nradiographs)\n106/103 23.88 years (2.85),\n20– 29 years\nMetatarsus adductus\nangle - cuboid and\nthe 4th metatarsal\nand cuboid and the\n5th metatarsal\n> 20 years\nNo history of foot\nsurgery or alteration\nin plantar pressures\ndistribution\nDisease or\ntrauma\ncausing foot\npathology,\npain, toe\ndeformities\nDorsoplantar\nradiographs\nweight bearing\nNo\nCook [ 23] Retrospective\ncohort\nUSA 40 ft Not stated 9 weeks –\n9 months\nBerg classification -\ntalus-first metatarsal\ndeviation, calcaneal\nline to cuboid, AP\ntalocalcaneal line, lateral\ntalocalcaneal angle\nMetatarsus adductus\ndiagnosis on clinical\nexamination\nPoor quality\nradiograph\nRadiographs no\nBerg [ 2] Prospective\ncohort\nUSA 84 50/34 2.5 years\n2.2– 3.8\nTalocalcaneal angle\n(Kite’s angle) (longitudinal\nbisector of the talus\nand the calcaneus)\nStretches failed to\nresolve metarasus\nadductus\nNeurological\nconditions\nAP weight-bearing\nradiographs\nYes\nBleck [ 3] Retrospective\ncohort\nUSA 160 93/67 5 – 36 months Heel bisector method:\nSeverity measure: The\nheel bisector centres\nof the hindfoot plantar\nsurface. Line crosses\nbetween the 2nd and\n3rd toes = normal,\nthrough the 3rd toe\n(mild deformity), between\n3rd and 4th toes\n(moderate), between\n4th and 5th toes\n(severe deformity).\nFlexibility measure:\nAbduction beyond the\nmidline heel bisector\n(mild classification), only\nto the midline (partially\nflexible), no abduction\npossible (severe)\nMetatarsus adductus\ndiagnosis on clinical\nexamination\nDynamic\nhallux varus,\nmetatarsus\nprimus varus\nor serpentine\nfoot.\nObservation and\nphysical\nassessment\nYes\n*N/A Not applicable\nMarshall et al. Journal of Foot and Ankle Research  (2018) 11:25 Page 7 of 10\nRadiographic angles had high levels of reliability for\nmeasuring metatarsus adductus in adults when taken\nduring pre-operative planning. However, these studies\nshould be interpreted with caution as they were con-\nducted with adult participants with no history of\nmetatarsus adductus. Therefore, results may not be\ntransferable to the paediatric population. Furthermore,\nradiographs measure and quantify the severity of\nmetatarsus adductus but do not take into account the\nflexibility of the condition. There is little benefit for\nsupporting using this measurement technique in\nchildren unless surgical management is recommended\n[16, 36, 37]. One study assessed radiographic angles\nin children however, the author developed their own rat-\ning tool and it scored poorly for quality on the COSMIN\nfor both content validity and responsiveness [ 34].\nMetatarsus adductus is primarily identified and treated\nconservatively in the paediatric population where the\nbenefits and risks of measurement technique must be\nconsidered [ 15]. Radiographs and the associated angles\nmeasure the osseous deviation and change. In the youn-\nger population, the lack of tarsal bone ossification does\nnot allow many of these angles to be easily calculated\n[21]. The radiographic angles with the highest reliability\n[32, 33] identified in this review were calculated and reli-\nant on osseous structures that appear after the age of\nfive [ 38]. Ultrasonography was utilised as a dynamic im-\naging modality for quantification of metatarsus adductus\nin infants as it allows for the imaging of the cartilaginous\nstructures. It also differentiates between metatarsus\nadductus and skewfoot, as in metatarsus adductus the\nmedial cuneiform will be displaced laterally over the\nnavicular [ 21]. Whilst this is a new imaging modality, no\nstudies have assessed the measurement properties of this\nmethod. This has the potential to be a costly measure-\nment technique requiring additional skills by clinicians\nfor interpretation, however, would negate the radiation\nexposure that radiographs impose.\nThe Bleck ’s heel bisector method was the most fre-\nquently reported measurement for assessing metatarsus\nadductus in the paediatric population. It is the measure\nthat appears most frequently within studies relating to\nmetatarsus adductus [ 3, 4, 19– 21, 38]. The Bleck meas-\nurement was also recently used to assess the treatment\noutcome of stretching for metatarsus adductus versus no\ntreatment [ 22]. This simple measure requires a short\ntime for the clinician to assess both any flexibility and\nseverity of the adduction deformity. As this measure is a\nmanual assessment that requires no equipment, it is\nconsidered simple and is less costly than radiological\nmeasurement. No studies have assessed the measure-\nment properties of this measurement. Due to the com-\nmonality of this measure and clinical use to guide\ntreatment and success of treatment, further research\nshould be considered to determine the measurement\nproperties of this assessment.\nTable 3 Identified measurement techniques for measuring\nmetatarsus adductus\nType of measure: Frequency of measure\nn =1 5\nVisual – heel bisector method [ 3, 4, 19– 21, 38] 6 (40%)\nRadiographs [ 2, 4, 20, 23, 25, 32– 35, 38, 39] 11 (73%)\nUltrasound [ 21] 1 (7%)\nPhotocopier [ 19] 1 (7%)\nFootprints [ 20] 1 (7%)\nDynamic foot pressure and gait analysis [ 13] 1 (7%)\nTable 4 Intra and inter-rater reliability of radiographic angles used to assess metatarsus adductus\nRadiographic angles: Description of measurement: Study Intra-rater ICC: Inter-rater ICC:\nTraditional metatarsus\nadductus angle (5th)\nAngle between the second metatarsal and longitudinal axis of\nthe lesser tarsus using the fifth metatarso-cuboid joint as a reference\n[32] 0.92 0.87\n[33] 0.970 0.962\nModified metatarsus\nadductus angle (4th)\nAngle between the second metatarsal and longitudinal axis of the\nlesser tarsus using the forth metatarso-cuboid joint as a reference\n[38] 0.91 0.93\n[33] 0.962 0.972\nRearfoot-2nd\nmetatarsal angle\nAngle between the longitudinal bisection of the second metatarsal\nbone and the line parallel to the lateral border of the calcaneum\n[32] 0.85 0.87\nEngel’s angle Angle between the longitudinal axis of the middle cuneiform and\nthe longitudinal axis of the second metatarsal\n[32] 0.90 0.84\nModified Engel Angle between the longitudinal axis of the second metatarsal and\na line perpendicular to the proximal articular surface of the middle\ncuneiform and the angle between the rearfoot reference line (line\nparallel to the lateral border of the calcaneum) and the longitudinal\naxis of the second metatarsal\n[32] 0.92 0.91\nThe Berg\nClassification system\nFour radiographic measurements that categorises foot deformities\ninto; metatarsus adductus, complex metatarsus adductus,\nsimple skewfoot and complex skewfoot\nThis includes the following: talus-first metatarsal deviation, calcaneal\nline to cuboid, AP talocalcaneal line, lateral talocalcaneal angle\n[23] Average intra-rater\nconsistency: 74%\n(ranged from 66.7 – 81%).\nAverage inter-rater\nconsistency: 64%\n(ranged from 61.9 – 66.7%).\nMarshall et al. Journal of Foot and Ankle Research  (2018) 11:25 Page 8 of 10\nThere are a number of limitations within this\nreview that impact findings and recommendations.\nEnglish only articles were included and due to limited\nand varied data extracted, no meta-analysis was per-\nformed. A broader search encompassing grey litera-\nture may have found additional papers reporting the\nquality of measures. They may have included hospital\nor department protocols or g uidelines. Future studies\nshould consider encompassing these within the\nreview. The generalisability of radiological reliability\nfindings to the paediatric population was not possible\ndue to osseous development and the methodology of\nmeasure development did not always include the\npaediatric population.\nSensitivity and specificity was not specifically men-\ntioned in any of the measurement tools analysed in this\nreview which impacted on the responsiveness criterion\nof the COSMIN. This also limited the number of items\nthat could be selected from the COSMIN appraisal tool\nand used to analyse each study. Additionally, there was\nno cost-benefit analysis of any of the measures found\nwithin the literature.\nConclusion\nThere have been multiple assessment techniques proposed\nfor quantification of metatarsus adductus but there is a pau-\ncity of quality data on reliability, validity or responsiveness of\nthese techniques, especially in relation to the paediatric popu-\nlation. There have been several radiographic measures shown\nto have good reliability in adult participants and are used for\nsurgical guidance. Further research is required to determine\nif simple measures commonly guiding reassurance or imple-\nmentation of conservative treatment are a reliable way of\nmeasuring metatarsus adductus in the paediatric population.\nAdditional file\nAdditional file 1: Search terms and truncation used within each\ndatabase. (DOCX 89 kb)\nTable 5 COSMIN critical appraisal tool used for studies that could be analysed for their measurement properties\nStudy: Measurement tool: Author driven: Reliability (B): Content Validity (D): Criterion Validity (H): Responsiveness (I):\nBerg et al. [ 2] Radiographs: Berg\nclassification system\nYes n/a n/a n/a Poor\nCook et al. [ 23] Radiographs: Berg\nclassification system\nNo Poor n/a n/a n/a\nDawoodi et al. [ 32] Radiographs: metatarsal\nangle (4th), modified\nmetatarsal angle (5th),\nrearfoot – 2nd metatarsal\nangle, Engel ’s Angle,\nmodified Engel ’s angle.\nNo Good n/a n/a n/a\nDominguez et al. [ 33] Radiographs: Traditional\nmetatarsus adductus angle\n(cuboid and the 4th\nmetatarsal as reference),\nmodified metatarsus\nadductus angle (cuboid\nand the 5th metatarsal).\nNo Fair n/a n/a n/a\nEngel, et al. [ 35] Radiographs: Traditional\nmetatarsus adductus angle\nand the modified metatarsus\nadductus angle\nModified metatarsus\nadductus angle only.\nn/a n/a Fair n/a\nFrench, et al. [ 34] Radiographs: Lateral\ncalcaneal 5th metatarsal\nangle, inter-metatarsal angle,\ntalus first metatarsal angle,\ntalocalcaneal angle (Kite ’s\nangle), first metatarsal fifth\nmetatarsal angle, talocaneal\nangle (lateral view).\nFirst-metatarsal\nfifth-metatarsal\nangle was author\ndriven. All other\nangles were not.\nn/a Poor n/a Poor\nHerzenberg et al. [ 20] Footprints analysed using a\nmodified version of\nBleck’s measurement.\nYes n/a n/a n/a Poor\nKnörr et al. [ 4] Radiographs: First cuneiform\nmetatarsal angle, metatarsal-\nmetaphyseal angle.\nNo n/a n/a n/a Poor\nLepow et al. [ 25] Radiographs: Paediatric\nmetatarsus adductus angle\nYes n/a n/a n/a Poor\nMarshall et al. Journal of Foot and Ankle Research  (2018) 11:25 Page 9 of 10\nAbbreviations\nCOSMIN: Consensus-based Standards for the selection of health\nMeasurement INstruments; ICC: Intraclass correlation coefficient; IRT: Item\nresponse theory\nFunding\nCMW is supported by a National Health and Medical Research early career\nhealth professional research fellowship.\nAvailability of data and materials\nData sharing not applicable to this article as no datasets were generated or\nanalysed during the study. All relevant data has been included within the review.\nAuthors’ contributions\nNM, EW and CMW conceived and designed this systematic review, NM and\nCMW contributed to the screening and processing of articles, EW and NM\ncritically appraised the data, NM drafted the manuscript, all authors reviewed\ncritically the final manuscript and approved for submission.\nEthics approval and consent to participate\nNot applicable.\nCompeting interests\nThe authors declare that they have no competing interests.\nPublisher’sN o t e\nSpringer Nature remains neutral with regard to jurisdictional claims in\npublished maps and institutional affiliations.\nAuthor details\n1University of South Australia, School of Health Science, Adelaide, SA 5000,\nAustralia. 2Department of Physiotherapy, Monash University, Frankston, VIC\n3199, Australia. 3Peninsula Health, Allied Health, Frankston, VIC 3199,\nAustralia.\nReceived: 13 October 2017 Accepted: 22 May 2018\nReferences\n1. Dietz F: Intoeing - fact, fiction and opinion. Am Fam Physician 1994, 50 :\n1249– 1259.\n2. Berg EE. A reappraisal of metatarsus adductus and skewfoot. J Bone Joint\nSurg – Ser A. 1986;68:1185 – 96.\n3. Bleck EE. METATARSUS ADDUCTUS - CLASSIFICATION AND RELATIONSHIP\nTO OUTCOMES OF TREATMENT. J Pediatr Orthop. 1983;3:2 – 9.\n4. Knörr J, Soldado F, Pham TT, Torres A, Cahuzac JP, De Gauzy JS.\nPercutaneous correction of persistent severe metatarsus adductus in\nchildren. J Pediatr Orthop. 2014;34:447 – 50.\n5. Ponseti IB,J. Congenital metatarsus adductus: the results of treatment. J\nBone Joint Surg – Am Vol. 1966;48:702 – 11.\n6. Galluzzo AJ, Hugar DW. Congenital metatarsus adductus: clinical evaluation\nand treatment. J Foot Surg. 1979;18:16 – 22.\n7. Sass P, Hassan G. Lower extremity abnormalities in children. Am Fam\nPhysician. 2003;68:461 – 8.\n8. Morcuende JAPI. Congenital metatarsus adductus in early human fetal\ndevelopment: a histologic study. Clin Orthop Relat Res. 1996;333:261 – 266.\n9. Robb J. Intoeing and out-toeing gait. In: Paediatric orthopaedic diagnosis:\nasking the right questions. India: Springer; 2015. p. 207 – 20.\n10. Geddis C, Jones S. Foot disorders in childhood. Surgery. 2011;29:187 – 90.\n11. Hart ES, Grottkau BE, Rebello GN, Albright MB. The newborn foot: diagnosis\nand management of common conditions. Orthop Nurs. 2005;24:313 – 21.\nquiz 322-313\n12. Wan SC. Metatarsus adductus and skewfoot deformity. Clin Podiatr Med\nSurg. 2006;23:23 – 40.\n13. Widhe T. Foot deformities at birth: a longitudinal prospective study over a\n16- year period. J Pediatr Orthop. 1997;17:20 – 4.\n14. Feng L, Sussman M. Combined medial cuniform osteotomy and multiple\nmetatarsal osteotomies for correction of persistent metatarsus adductus in\nchildren. J Pediatr Orthop. 2016;36:730 – 5.\n15. Williams C, James A, Tran T. Metatarsus adductus: development of a non-\nsurgical treatment pathway. J Paediatr Child Health. 2013;49:428 – 33.\n16. Connors J, Wernick E, Lowy L, Falcone J, Volpe R. Guidelines for evaluation\nand management of five common podopediatric conditions. J Am Podiatr\nMed Assoc. 1998;88:206 – 22.\n17. Gore AI, Spencer JP. The newborn foot. Am Fam Physician. 2004;69:865 – 72.\n18. Theodorou D, Theodorou S, Boutin R, Chung C, Fliszar E, Kakitsubata Y,\nResnick D. Stress fractures of the lateral metatarsal bones in metatarsus\nadductus foot deformity: a previously unrecognized association. Skelet\nRadiol. 1999;28:679 – 84.\n19. Smith JT, Bleck EE, Gamble JG, Rinsky LA, Pena T. Simple method of\ndocumenting metatarsus adductus. J Pediatr Orthop. 1991;11:679 – 80.\n20. Herzenberg JE, Burghardt RD. Resistant metatarsus adductus: prospective\nrandomized trial of casting versus orthosis. J Orthop Sci. 2014;19:250 – 6.\n21. Miron M, Grimard G. Ultrasound evaluation of foot deformities in infants.\nPediatr Radiol. 2016;46:193 – 209.\n22. Eamsobhana P, Rojjananukulpong K, Ariyawatkul T, Chotigavanichaya C,\nKaewpornsawan K. Does the parental stretching programs improve\nmetatarsus adductus in newborns? J Orthop Surg. 2017;25:1 – 5.\n23. Cook DA, Breed AL, Cook T, Desmet AD, Muehle CM. Observer variability in\nthe radiographic measurement and classification of metatarsus adductus. J\nPediatr Orthop. 1992;12:86 – 9.\n24. Farsetti P, Weinstein SL, Ponseti IV. The long-term functional and\nradiographic outcomes of untreated and non-operatively treated\nmetatarsus adductus. J Bone Joint Surg (Am Vol). 1994;76A:257 – 65.\n25. Lepow GM, Lepow RS, Lepow RM, Hillman L, Neville R. Pediatric metatarsus\nadductus angle. J Am Podiatr Med Assoc. 1987;77:529 – 32.\n26. Moher D, Liberati A, Tetzlaff J, Altman D, Group TP. Preferred reporting\nitems for systematic reviews and meta-analyses: the PRISMA statement. Int J\nSurg. 2010;8:336 – 41.\n27. Huang X, Lin J, Demner-Fushman D. Evaluation of PICO as a knowledge\nrepresentation for clinical questions. AMIA Annu Symp Proc Arch. 2016;2006:\n359– 63.\n28. Veritas Health Innovation. Covidence systematic review software.\nMelbourne: Veritas Health Innovation; 2017.\n29. Mokkink L, Terwee C, Patrick D, Alonso J, Stratford P, Knol D, Bouter L, De\nVet H, COSMIN checklist manual , http://www.cosmin.nl/images/upload/files/\nCOSMIN%20checklist%20manual%20v9.pdf, Accessed 28th June, 2017\n30. Mokkink L, Terwee C, Gibbons E, Stratford P, Alonso J, Patrick D, Knol D,\nBouter L, De Vet H. Inter-rater reliability of the COSMIN (COnsensus-based\nstandards for the selection of health status measurement instruments)\nchecklist. BMC Med Res Methodol. 2010;10:25.\n31. Mokkink L, Terwee C, Patrick D, Alonso J, Stratford P, Knol D, Bouter L, De\nVet H. International consensus on taxonomy, terminology and definitions of\nmeasurement properties: results of the COSMIN study. J Clin Epidemiol.\n2010;63:737– 45.\n32. Dawoodi A, Perera A. Reliability of metatarsus adductus angle and\ncorrelation with hallux valgus. Foot Ankle Surg. 2012;18:180 – 6.\n33. Dominguez G, Munuera PV. Metatarsus adductus angle in male and female\nfeet - normal values with two measurement techniques. J Am Podiatr Med\nAssoc. 2008;98:364 – 9.\n34. French S, Niespodziany J, Wysong D, Zahari D. A radiographic study of\ninfant metatarsus adductus treatment by serial casting. J Foot Surg. 1985;24:\n222– 9.\n35. Engel E, Nelson E, Krems I. A simplified metatarsus adductus angle. J Am\nPodiatry Assoc. 1983;73:620 – 8.\n36. Applegate K, Cost N. Image gently: a campaign to reduce Children ’s\nAdolescents’ risk for Cancer during adulthood. J Adolesc Health. 2013;52:93 – 7.\n37. Australian Government. Medicare Benefits Schedule. Canberra: Department\nof Health; 2017.\n38. Dawoodi A, Perera A. Radiological assessment of metatarsus adductus. Foot\nAnkle Surg. 2012;18:1 – 8.\n39. Hutchinson B. Pediatric metatarsus adductus and skewfoot deformity. Clin\nPodiatr Med Surg. 2010;27:93 – 104.\nMarshall et al. Journal of Foot and Ankle Research  (2018) 11:25 Page 10 of 10",
  "topic": "Critical appraisal",
  "concepts": [
    {
      "name": "Critical appraisal",
      "score": 0.8270193934440613
    },
    {
      "name": "CINAHL",
      "score": 0.7168028354644775
    },
    {
      "name": "Medicine",
      "score": 0.7109646797180176
    },
    {
      "name": "MEDLINE",
      "score": 0.5713691115379333
    },
    {
      "name": "Scopus",
      "score": 0.5600360035896301
    },
    {
      "name": "Foot (prosody)",
      "score": 0.4274328947067261
    },
    {
      "name": "Web of science",
      "score": 0.4188231825828552
    },
    {
      "name": "Systematic review",
      "score": 0.4162621796131134
    },
    {
      "name": "Physical therapy",
      "score": 0.41300496459007263
    },
    {
      "name": "Orthodontics",
      "score": 0.36197948455810547
    },
    {
      "name": "Meta-analysis",
      "score": 0.30061647295951843
    },
    {
      "name": "Alternative medicine",
      "score": 0.17009374499320984
    },
    {
      "name": "Pathology",
      "score": 0.13780876994132996
    },
    {
      "name": "Psychological intervention",
      "score": 0.0
    },
    {
      "name": "Law",
      "score": 0.0
    },
    {
      "name": "Linguistics",
      "score": 0.0
    },
    {
      "name": "Political science",
      "score": 0.0
    },
    {
      "name": "Psychiatry",
      "score": 0.0
    },
    {
      "name": "Philosophy",
      "score": 0.0
    }
  ]
}