{
  "title": "Production of Plant Secondary Metabolites by Using Biotechnological Tools",
  "url": "https://openalex.org/W2889628716",
  "year": 2018,
  "authors": [
    {
      "id": "https://openalex.org/A2026777632",
      "name": "Sandra Gonçalves",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2102680293",
      "name": "Anabela Romano",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2757030362",
    "https://openalex.org/W2318422327",
    "https://openalex.org/W2767918751",
    "https://openalex.org/W2033588393",
    "https://openalex.org/W2319548481",
    "https://openalex.org/W2171620999",
    "https://openalex.org/W2209568904",
    "https://openalex.org/W2126101511",
    "https://openalex.org/W2131296354",
    "https://openalex.org/W2732799033",
    "https://openalex.org/W1977294506",
    "https://openalex.org/W2025404024",
    "https://openalex.org/W2337083032",
    "https://openalex.org/W2085917889",
    "https://openalex.org/W2035401676",
    "https://openalex.org/W2021716755",
    "https://openalex.org/W2179150377",
    "https://openalex.org/W2084616269",
    "https://openalex.org/W2002692802",
    "https://openalex.org/W2330466093",
    "https://openalex.org/W1973060237",
    "https://openalex.org/W1998053211",
    "https://openalex.org/W2010649966",
    "https://openalex.org/W2082302072",
    "https://openalex.org/W2288741841",
    "https://openalex.org/W2061553594",
    "https://openalex.org/W2057870931",
    "https://openalex.org/W2020257498",
    "https://openalex.org/W2040521152",
    "https://openalex.org/W4288400169",
    "https://openalex.org/W2256982982",
    "https://openalex.org/W2005119610",
    "https://openalex.org/W2118677758",
    "https://openalex.org/W2198957065",
    "https://openalex.org/W2023505657",
    "https://openalex.org/W572268322",
    "https://openalex.org/W1960625203",
    "https://openalex.org/W1982783237",
    "https://openalex.org/W2554465582",
    "https://openalex.org/W1669895398",
    "https://openalex.org/W4211155517",
    "https://openalex.org/W1528163365",
    "https://openalex.org/W2224260097",
    "https://openalex.org/W195544592",
    "https://openalex.org/W130328831",
    "https://openalex.org/W1902850362",
    "https://openalex.org/W1969171959",
    "https://openalex.org/W1541218827",
    "https://openalex.org/W1509637498",
    "https://openalex.org/W2095002148",
    "https://openalex.org/W428023115",
    "https://openalex.org/W2167741612",
    "https://openalex.org/W2028300518",
    "https://openalex.org/W2073682960",
    "https://openalex.org/W2021218197",
    "https://openalex.org/W2076938093",
    "https://openalex.org/W2019679695",
    "https://openalex.org/W2495917372",
    "https://openalex.org/W1967554176",
    "https://openalex.org/W2266152765",
    "https://openalex.org/W2118884515",
    "https://openalex.org/W2090605902",
    "https://openalex.org/W2561857005",
    "https://openalex.org/W2018137090",
    "https://openalex.org/W2914676175",
    "https://openalex.org/W2170190609",
    "https://openalex.org/W2003647499",
    "https://openalex.org/W1979977348",
    "https://openalex.org/W2072821756",
    "https://openalex.org/W2007303384",
    "https://openalex.org/W1963778789",
    "https://openalex.org/W2016498728",
    "https://openalex.org/W2085651324",
    "https://openalex.org/W2172985628",
    "https://openalex.org/W1968122321",
    "https://openalex.org/W2115174442",
    "https://openalex.org/W2071629717",
    "https://openalex.org/W2045990270",
    "https://openalex.org/W2340425591",
    "https://openalex.org/W2077012536",
    "https://openalex.org/W1976905763",
    "https://openalex.org/W2003014161",
    "https://openalex.org/W2334500006",
    "https://openalex.org/W2038537809",
    "https://openalex.org/W2011015838",
    "https://openalex.org/W2121098452",
    "https://openalex.org/W1559919694",
    "https://openalex.org/W4285719527",
    "https://openalex.org/W1996133279",
    "https://openalex.org/W2130690218"
  ],
  "abstract": "Plants are a remarkable source of high-value secondary metabolites with applications in various domains. Plant cell and tissue culture techniques appear as environmentally friendly alternatives for the production of secondary metabolites when natural supply is limited or chemical synthesis is unviable. In this chapter, the main advantages of using plant cell and tissue culture techniques for the production of plant secondary metabolites are presented as well as the different biotechnological approaches available to improve their production. In addition, the production of anticancer compounds (camptothecin, podophyllotoxin, taxol, vinblastibe, and vincristine) and metabolites from Lamiaceae spp. (phenolics as rosmarinic acid) were selected as examples to be highlighted. The study reviewed shows that undifferentiated cells are the preferred culture system used for the production of high-value secondary metabolites in vitro although there are many examples reporting the production in differentiated tissues particularly in hairy roots. Efforts have been made to scale up the production, and several strategies have been successfully applied to increase the production yields at the laboratorial scale. Nevertheless, there are only few examples of plant secondary metabolites production at commercial level, and further in-depth studies are still required.",
  "full_text": "Chapter 5\nProduction of Plant Secondary Metabolites by Using\nBiotechnological Tools\nSandra Gonçalves and Anabela Romano\nAdditional information is available at the end of the chapter\nhttp://dx.doi.org/10.5772/intechopen.76414\nProvisional chapter\nDOI: 10.5772/intechopen.76414\n© 2016 The Author(s). Licensee InTech. This chapter is distributed under the terms of the Creative Commons  \nAttribution License (http://creativecommons.org/licenses/by/3.0), which permits unrestricted use,  \ndistribution, and reproduction in any medium, provided the original work is properly cited. \nProduction of Plant Secondary Metabolites by Using \nBiotechnological Tools\nSandra Gonçalves and Anabela Romano\nAdditional information is available at the end of the chapter\nAbstract\nPlants are a remarkable source of high-value secondary metabolites with applications \nin various domains. Plant cell and tissue culture techniques appear as environmentally \nfriendly alternatives for the production of secondary metabolites when natural supply is \nlimited or chemical synthesis is unviable. In this chapter, the main advantages of using \nplant cell and tissue culture techniques for the production of plant secondary metabolites \nare presented as well as the different biotechnological approaches available to improve \ntheir production. In addition, the production of anticancer compounds (camptothecin, \npodophyllotoxin, taxol, vinblastibe, and vincristine) and metabolites from Lamiaceae spp. \n(phenolics as rosmarinic acid) were selected as examples to be highlighted. The study \nreviewed shows that undifferentiated cells are the preferred culture system used for the \nproduction of high-value secondary metabolites in vitro although there are many exam -\nples reporting the production in differentiated tissues particularly in hairy roots. Efforts \nhave been made to scale up the production, and several strategies have been successfully \napplied to increase the production yields at the laboratorial scale. Nevertheless, there are \nonly few examples of plant secondary metabolites production at commercial level, and \nfurther in-depth studies are still required.\nKeywords: alkaloids, anticancer compounds, cell suspension cultures, elicitation, \nLamiaceae, metabolic engineering, phenolics\n1. Introduction\nPlant kingdom, comprising about 250,000 species, is a repository of probably hundreds \nof thousands of low-molecular-weight structurally complex chemical compounds known \nas secondary metabolites [ 1]. These high-value metabolites are biosynthesized through \n© 2018 The Author(s). Licensee IntechOpen. This chapter is distributed under the terms of the Creative\nCommons Attribution License (http://creativecommons.org/licenses/by/3.0), which permits unrestricted use,\ndistribution, and reproduction in any medium, provided the original work is properly cited.\n\nphenylpropanoid, mevalonate, 2-C-methyl- d-erythritol-4-phosphate, amino acid, glucose, \nacetate-malonate pathway, or combined pathways. Secondary metabolites have an impor -\ntant role in the interaction between plants and their environment (e.g., defense against her -\nbivores and pathogens, protection against ultraviolet light, etc.) and, thus, are vital for their \nexistence and subsistence. They are accumulated in specific tissues and structures (e.g., \nvacuoles, specialized glands, trichomes, etc.), and their production is affected by several \nfactors, like genotype, plant physiology, climate, environmental conditions, and pathogens; \nin some cases, they are only produced during certain developmental stages [ 2, 3].\nOver the past decades, efforts have been directed at the extraction, structure elucidation, \nand evaluation of biological activity of many plant secondary metabolites. Plants continue \nto be the main source for many important bioactive molecules/pharmacophores [4, 5]. About \n25–28% of modern medicines are derived from higher plants [ 6], and over 60% of anticancer \ndrugs are directly or indirectly derived from plants [ 7]. According to a recent report of the \nBritish Broadcasting Corporation (BBC), plant-derived drugs will grow from $29.3 billion in \n2017 to around $39.2 billion by 2022 with an annual growth rate of 5.9% [8].\nIn the last decades, considerable progress has been made concerning the production of second-\nary metabolites by using plant tissue culture techniques owing to the advantages of this plat-\nform over other production systems as discussed in the next section of this chapter. The most \nstudied classes of plant secondary metabolites using plant cell and tissue culture production \nsystems are alkaloids and the landmark example is the anticancer-registered drug Taxol® [3]. \nPlant tissue culture techniques were even endorsed by Food and Agriculture Organization as \nsafe for the production of compounds for food application [ 9]. This chapter aims to discuss \nthe main advantages of using plant cell and tissue culture techniques for the production of \nplant secondary metabolites as well as the different biotechnological approaches available to \nimprove their production. Important and representative examples produced through these \nmethods, as is the case of plant anticancer compounds and metabolites from Lamiaceae spp., \nare addressed.\n2. Advantages of plant tissue culture techniques for the production \nof secondary metabolites\nIn a context where consumers demand for safe natural products increases, because synthetic \nchemicals are perceived as potentially toxic, the interest in plant secondary metabolites from \nresearch and industry also increases [10]. Few important plant products with simple chemical \nstructures can be produced via chemosynthesis; however, many compounds like alkaloids are \ndifficult to be synthesized or the cost of their synthesis outweighs their commercial availabil-\nity [11, 12]. Some compounds can be obtained from naturally grown plants, but sometimes \nthere are regional and environmental restrictions, which can limit the commercial production \n[13]. Also, traditional cultivation of some plant species is difficult or takes several years. In \nthis context, plant cell and tissue culture techniques appear as environmentally friendly alter-\nnative methods for the production of secondary metabolites when natural supply is limited \nSecondary Metabolites - Sources and Applications82\nand traditional methods are unfeasible. The mass propagation of plants in aseptic and envi -\nronmental controlled conditions, and the large-scale production of secondary metabolites in \na year-round system without seasonal constraints, are some of the advantages of plant tissue \nculture techniques [ 3]. Moreover, cultures can be established in any part of the world inde -\npendently of the plant growth requisites and are free of microbes and insects avoiding the \nuse of pesticides and herbicides [14, 15]. Plant tissue culture techniques provide a reliable and \npredictable method for isolating the secondary metabolites at a high efficiency within a short \ntime when compared to the extraction from wild plant populations [ 16]. Also, the simplicity \nin the extraction of the metabolites from in vitro-produced tissues makes the method appella-\ntive for commercial application [17].\nApart from the abovementioned advantages, there are metabolites that are generally not \nfound in the intact plant but can be produced by in vitro cultures [18]. Biotechnology opens \nthe opportunity to apply traditional or metabolic engineering strategies to promote the accu-\nmulation of desired compounds by in vitro cultures. Products from in vitro cultures can still \nbe used as models of whole plants, and cell cultures can be radiolabeled so that secondary \nproducts can be traced metabolically [19].\nThe massive and indiscriminate collection of plant material from plants producing impor -\ntant bioactive compounds has threatened the survival of some species. In vitro propagation \nthrough plant tissue culture techniques allows the large-scale multiplication of true-to-type \nplants within a short span of time and without a negative impact on the natural resources \n[16]. This method is particularly valuable for plants difficult to propagate by conventional \ntechniques or with slow propagation rates. In this context, in the last years, there has been an \nincreased interest on the use of these methodologies for the propagation and conservation of \nmedicinal plants.\n3. Culture systems\nThe production of secondary metabolites by in vitro cultures usually occurs in a two-step pro-\ncess, biomass accumulation and secondary metabolites synthesis, in which both steps need \nto be optimized independently [3, 14]. Production could be accomplished by using undiffer -\nentiated calli, cell suspension cultures, or organized structures like shoots, roots, or somatic \nembryos. In some cases, a certain degree of differentiation may be needed for the biosynthesis \nto occur [20]. The use of differentiated organ cultures is required, for instance, when the target \nmetabolite is only produced in specialized plant tissues or glands as is the case of essential \noils [20, 21].\nAmong differentiated tissues, hairy roots culture offers new opportunities for the in vitro  \nproduction of plant-valuable compounds [ 22]. Hairy roots are induced by the infection of \nplants with Agrobacterium rhizogenes , a Gram-negative soil bacterium. During the infection, \na DNA segment (T-DNA) from the large root-inducing (Ri) plasmid of the bacterium is \ntransferred into the genome of the infected plant. The higher level of cellular differentiation, \nrapid growth, genetic and biochemical stability, and maintenance facility are some of the \nProduction of Plant Secondary Metabolites by Using Biotechnological Tools\nhttp://dx.doi.org/10.5772/intechopen.76414\n83\nadvantages of hairy roots [ 22]. Also, they can accumulate metabolites in the aerial parts of \nthe plant. However, the difficulties in cultivating hairy roots in an industrial system limit \ntheir commercial use to produce valuable plant secondary metabolites.\nAlthough there are many studies reporting the production of secondary metabolites using \ncallus cultures and differentiated tissues [ 3, 14, 23], in most cases, undifferentiated cells \nare the preferred culture system [ 13]. Cell suspension culture is a simple and cost-effective \nmethod that has been extensively used to overcome the problems of large-scale production. \nPlant cell is biosynthetically totipotent, which means that under suitable conditions, each cell \nhas theoretically the capacity to produce compounds identical to those present in the parent \nplant [13]. Plant cell cultures have more immediate potential for commercial application than \ntissue or organ cultures [ 21, 24]. They are considered as a stable system for the continuous \nproduction of secondary metabolites of uniform quality and yield. Another great advantage \nof plant cell cultures is the possibility to synthesize novel products not usually produced by \nthe native plant [ 25, 26]. This is the preferable biotechnological platform to produce high-\nvalue secondary metabolites, as taxol [27, 28], resveratrol [29], artemisinin [30], ginsenosides \n[31], and ajmalicine [32].\n4. Strategies to improve the production of secondary metabolites\nIn the commercial exploitation of plant cell cultures for the production of high-value sec -\nondary metabolites, it is fundamental to achieve high yields and consistent productions. \nThe production of secondary metabolites in plants is genotype-dependent; thus, the first \nstep to initiate cell or organ cultures is the choice of the parent plant containing higher \ncontents of the secondary product of interest for callus or organ induction, and the selec -\ntion of high-producing cell/organ lines [ 14]. The selection is made by analyzing cell/organ \ngrowth and then by quantifying the desired product by chromatographic and spectroscopic \ntechniques [14]. Nevertheless, even selecting a highly productive line, the production yields \nare not always adequate, and after long periods of cultivation they lose their production effi-\nciency. Thus, many alternative strategies can be used to stimulate the production of second -\nary metabolites and obtain efficient yields including traditional and metabolic engineering \nstrategies [3, 19].\n4.1. Traditional strategies\nThere are several factors that can be optimized to improve the growth and metabolites pro -\nductivity of the in vitro cultures. Among them, the following can be appointed: the culture \nmedium composition, the medium pH, the inoculum density, the culture medium environ -\nment (e.g., temperature, light density and quality, etc.), the agitation and aeration, etc. [3, 14, 15].  \nThe culture medium strongly affects the biomass and metabolites productivity, and thus the \nselection of the suitable culture medium formulation is an imperative step [ 3]. It must be \nselected according to the physiological requirements of the plant species, and there are sev -\neral parameters that can be optimized, namely nutrients composition, salt strength, nitrate \nSecondary Metabolites - Sources and Applications84\nand phosphate levels, plant growth regulators type and concentration, carbon source, etc. \nFor instance, carbon source plays significant roles in the signal transduction systems through \nregulating gene expression and developmental processes [3].\nSecondary metabolites are produced by plant cells in response to environmental stimuli or \nas defensive mechanisms against invading pathogens. In this sense, the strategy available to \nimprove the productivity of secondary metabolites, elicitation, aims to misguide the cells or \ntissues for a possible biotic/abiotic attack by using agents that trigger the defense response \n[33]. Elicitors have the ability to control an array of cellular activities at the biochemical and \nmolecular level since they induce the upregulation of genes [33]. The elicitors can be biotic or \nabiotic and may comprise signaling molecules like methyl jasmonate, salicylic acid, microbial \ncell wall extracts (e.g., yeast extract, chitosan), inorganic salts, heavy metals, physical agents \n(e.g., UV radiation) among others [ 1, 34]. Methyl jasmonate and its related signal molecules, \nand salicylic acid are probably the most extensively used elicitors [ 5]. The combination of \nsome elicitors with physical factors (e.g., UV light, temperature regime, and pulsed electric \nfield) yielded good results for secondary metabolite production [35]. As reviewed by Giri and \nZaheer [5], cell suspension culture is the most used culture system for elicitation treatment and \nsecondary metabolites production. Due to its inherent characteristics of hormone autotrophy, \nuncontrolled growth, biosynthetic, and genetic stability distinctiveness, hairy root cultures \nhave proved to be also a valuable culture system for elicitation experiments. In addition, there \nare some secondary metabolites that are synthesized only in the roots [ 14, 36, 37]. Multiple \nshoots culture is a less used culture system for elicitation treatments for the production of \nsecondary metabolites which is particularly useful in the case of metabolites present in the \nleaves [5]. The elicitors can change the secondary metabolites production quantitatively and \nalso qualitatively [5]. For extra information, consult the recent reviews on this subject [1, 5].\nNutrient and precursor feeding are also used to improve the yields of secondary metabolites \nproduction. Nutrient feeding involves the replenishment of nutrient medium, and in pre -\ncursor feeding, plant cell cultures are used to convert precursors into products by utilizing \npreexisting enzyme systems [ 14]. Immobilization of plant cells is another strategy used to \novercome problems of low shear resistance and cell aggregation. This procedure can be done \nby several methods, and the most widely used are surface immobilization or gel entrapment. \nIn this technique, the cells are entrapped in a specific gel or a combination of gels. Examples \nof matrices used are calcium alginate (the most used), agarose, gelatin, carrageenan, or poly -\nacrylamide [14]. This strategy has several advantages, such as the extension of cells’ viability \nin the stationary stage, the simplification of downstream processing, the high-cell density \nwithin small bioreactors reducing the costs and risk of contamination, an increased product \naccumulation, the minimization of fluid viscosity, among others [38].\nThe permeabilization of plant cell membranes with chemicals, the use of electric field stress, \nand ultrasound techniques are strategies used to facilitate the removal of secondary metabo -\nlites from vacuoles and membrane systems of the plant cell, facilitating the secretion of prod-\nucts into the culture medium and thus simplifying the purification process [14, 17].\nThe cultivated cells have the capacity for biotransformation of supplied compounds, which \nare not necessarily natural intermediaries of plant metabolism, into high-value compounds. \nProduction of Plant Secondary Metabolites by Using Biotechnological Tools\nhttp://dx.doi.org/10.5772/intechopen.76414\n85\nThis can occur through different reactions as hydroxylation, oxidation of hydroxyl group, \nreduction of carbonyl group, hydrogenation of carbon-carbon double bond, glycosyl conju -\ngation, and hydrolysis, catalyzed by plant enzymes [ 14]. This is probably one of the most \ncommercially realistic approaches; however, in some cases, the costly precursors may limit \nthe economic viability [38].\n4.2. Metabolic engineering\nMetabolic engineering offers a new perspective to understand the expression of genes \ninvolved in the biosynthesis of secondary metabolites through overexpression studies allow-\ning the alteration of biosynthetic pathways [ 39, 40]. This involves the study of enzymatic \nreactions and biosynthetic processes at gene, transcriptomic, and proteomic levels, and the \nmanipulation of the genes encoding the critical and rate-limiting enzymes in the biosynthetic \npathways [41, 42]. Theoretically, the secondary metabolites productivity of plant cell cultures \ncan be improved through the overexpression of genes encoding regulatory enzymes involved \nin their biosynthetic pathways [ 16]. However, the overexpression of certain genes may not \nalways improve production [16].\nMetabolic engineering approach also uses the inhibition of competitive pathways to increase \nmetabolic flux of targeted biosynthetic pathway intermediates for a higher production through \na variety of approaches. Certain steps in the biosynthetic pathway could be inhibited to induce \nthe accumulation of preceding intermediates. The understanding of phenylpropanoyl biosyn-\nthetic pathway that is involved in the biosynthesis of several plant secondary metabolites is \nthe most successful and recent application [43, 44].\nThe in-depth understanding of the biosynthetic pathways is still a barrier to the practical use \nof this strategy to enhance production [ 45, 46]. For the large-scale production of important \nsecondary metabolites to meet industry demand, more studies are needed to identify rate-\nlimiting steps and regulation along with bottlenecks on the lack of clarity of their biosynthetic \npathways.\n5. Scale-up production\nOwing to the importance of some plant secondary metabolites, efforts have been made to \nstudy the feasibility of their production at the industrial scale. This is not always a simple \nprocess because plant cells have a relatively unstable productivity, a high shear sensitivity, a \nslow growth rate, and low oxygen requirements [ 14]. The scale-up involves the use of biore -\nactors of varying sizes and features, and cell suspension culture is the better culture system \nhaving several advantages in comparison with the other. The simplicity, predictability, and \nhigh efficiency at which the metabolites can be isolated from biomass or cultivation media are \nsome of these advantages. Nevertheless, there are some examples of the use of differentiated \ntissues like shoots and somatic embryos [47].\nSecondary Metabolites - Sources and Applications86\nSome important milestones in the production of secondary metabolites by plant cell cul -\ntures are the production of shikonin [ 48] and ginseng [49], and the most successful example \nof the scale-up process is probably the production of taxol by Phyton Biotech Company \n(Germany) to supply part of the demands of Bristol-Meyers Squibb Company during the \nyear 2002 [ 50]. Phyton Biotech operates the largest cGMP plant cell culture facility in the \nworld designed for large-scale production of Taxanes in 75,000 L-size bioreactors that run up \nto 880,000  L per year [ 51]. Berberine, ginsenosides, shikonin, scopolamine, and rosmarinic \nacid are also examples of plant secondary metabolites presently produced at the commercial \nscale (Figure 1) [3, 17].\nSeveral factors should be considered in scaling up the production of secondary metabolites \nusing bioreactors, namely the optimization of culture conditions, biomass production mea -\nsurement (especially with tissue and organ cultures), and so on [ 52, 53]. Several bioreactor \ndesigns have been tested and used for plant cell cultures. Some of them as is the case of \nstirred tank reactors, bubble column reactors, airlift reactors, and ebb and flood reactors \nare merely extension of microbial culture. For plant cells with a high shear sensitivity, \nWang and Zhong [ 54] develop the centrifugal impeller bioreactors that are based on the \nprinciples of a centrifugal pump. Mechanically driven “wave reactors,” “slug bubble reac -\ntor,” and “undertow reactor” are also adequate for high shear-stress-sensitive cells [ 14]. \nOn the other hand, airlift bioreactors are suitable for not highly shear-sensitive cells and \nFigure 1. Structures of some relevant plant secondary metabolites produced on a commercial scale.\nProduction of Plant Secondary Metabolites by Using Biotechnological Tools\nhttp://dx.doi.org/10.5772/intechopen.76414\n87\nfor hairy and adventitious root cultures [ 14]. The interested reader can find more impor -\ntant details about the scale-up process in the works by Murphy et  al. [14], Yue et  al. [13], \nand Isah et  al. [3].\n6. Selected examples\nThere are several plant secondary metabolites including among others alkaloids, terpenes, \nflavonoids, and glycosides, which can be produced by plant tissue culture techniques using \ndifferent strategies [ 3, 13, 14]. Two examples were selected to be described in this chapter: \nthe production of important anticancer compounds and the production of metabolites from \nLavandula spp.\n6.1. Anticancer compounds\nAs mentioned before in this chapter, over 60% of anticancer drugs are directly or indirectly \nderived from plants [ 7]. The search for anticancer compounds from plants started in the \n1950s when the alkaloids vinblastine and vincristine from Catharanthus roseus (L.) G. Don and \npodophyllotoxin from Podophyllum spp. were discovered. The United States National Cancer \nInstitute initiated an extensive program in 1960 that led to the discovery of many novel che -\nmotypes with cytotoxic activities [55], taxanes and camptothecins being some of the examples \n[7]. Camptothecin, podophyllotoxin, taxol, vinblastine, or vincristine are the most important \nplant-derived anticancer compounds [ 19, 56]. Most compounds with anticancer properties \nare alkaloids, and some of them have a complex structure, with multiple rings and chiral cen-\nters, and therefore the chemical synthesis is prohibitively expensive [17]. Plant cell and tissue \nculture techniques appear as environmentally friendly alternative methods for the produc -\ntion of these secondary metabolites [17, 19].\nTaxanes from Taxus spp., terpenoid indole alkaloids from C. roseus , camptothecin from \nCamptotheca acuminata Decne among other species, and podophyllotoxin from Podophyllum \nand Linum spp. are the main compounds produced by using biotechnological approaches \n(Table 1). For the production of taxanes, cell suspension cultures are definitively the most \nadequate culture system. However, some studies demonstrated that differentiated tissues \nare more adequate than undifferentiated cells to produce other anticancer compounds. For \ninstance, intact plants of C. acuminata contain around 0.2–5 mg/g dry weight (DW) of camp -\ntothecin while callus and suspension cultures produced only 0.002–0.004  mg/g DW or lesser \n[57]. Hairy root cultures have also proven to be a good option for in vitro production of sec-\nondary metabolites as indole alkaloids due to their higher level of cellular differentiation and \nimproved genetic or biochemical stability. The hairy roots of Ophiorrhiza pumila Champ. ex \nBenth showed a high capacity to produce camptothecin (0.1% DW), although the callus cul -\nture failed to produce this compound [58].\nSeveral researchers have focused on studies aiming for the optimization of biomass growth \nconditions and on the application of biotechnological strategies to increase production yields \nof anticancer compounds. By manipulating empirical factors related to plant cell and organ \nSecondary Metabolites - Sources and Applications88\ncultures, it has been possible to enhance production yields. Several factors have been opti -\nmized, such as nutrients, carbon source, plant growth regulators, or culture environmental \nconditions, and several biotic and abiotic elicitors have been tested. Studies have also been \nfocused on the elucidation and regulation of biosynthetic pathways and on aiming the increase \nof production yields of anticancer compounds as taxanes [ 41] and indole alkaloids [ 59] by \nusing elicitors to activate genes involved in metabolic pathways. In spite of all the advantages \nof producing anticancer compounds by using plant cell and tissue culture techniques and the \nsignificant advancements in the last years, the examples of the production of plant anticancer \ncompounds on an industrial level are scarce. As previously mentioned in this chapter, the best \nsuccess example is the production of taxanes by the Germany company Phyton Biotech [51].\nPlant cell and tissue culture techniques have also been applied for the propagation of several \nanticancer plants. In vitro propagation allows the rapid mass multiplication of true-to-type \nplants within a short span of time which is particularly important in the case of endangered \nspecies. Some recently selected examples comprise plants producing the important anticancer \ncompounds camptothecin [60, 61] and podophyllotoxin [62, 63].\nCompound(s) Group Source (plant species) Culture \nsystem\nReference(s)\nCamptothecin Monoterpene indole \nalkaloid\nCamptotheca acuminata Decne HRC [75]\nCamptotheca acuminata Decne CSC [76]\nNothapodytes foetida (Wight) \nSleumer\nCC [77]\nNothapodytes nimmoniana \n(J. Grah.)\nCSC [78]\nOphiorrhiza alata Craib HRC [79]\nOphiorrhiza mungos Linn. CSC [80]\nOphiorrhiza prostata D. Don ARC [81]\nOphiorrhiza pumila Champ. \nex Benth.\nHRC [58]\nPodophyllotoxin Aryltetralin lignan Linum spp. HRC [82, 83]\nLinum album Kotschy ex \nBoiss.\nCSC [84]\nTaxanes (taxol) Diterpene alkaloids Taxus spp. CSC [27, 28]\nCorylus avellana L. CSC [85]\nVinblastine and vincristine Terpene indole alkaloids Catharanthus roseus (L.) \nG. Don\nHRC [86, 87]\nARC: adventitious root culture; HRC: hairy root culture; CSC: cell suspension cultures; CC: callus culture.\nTable 1. Some examples of studies reporting the production of plant anticancer compounds using biotechnological \napproaches.\nProduction of Plant Secondary Metabolites by Using Biotechnological Tools\nhttp://dx.doi.org/10.5772/intechopen.76414\n89\n6.2. Lamiaceae spp. metabolites\nThe mint family ( Lamiaceae ) contains about 236 genera and more than 7000 species with \ncosmopolitan distribution [ 64]. Some of the most important genera are Hyptis, Lavandula , \nNepeta, Salvia, Scutellaria , Thymus, and Teucrium. Species from the family inhabit different \nnatural ecosystems, and many are already cultivated. Most of the species belonging to this \nfamily are aromatic (possess essential oils) and are widely used in traditional medicine \nto cure various disorders. They also have great economic value due to their use in culi -\nnary or as ornamentals, and for cosmetic, flavoring, fragrance, perfumery, pesticide, and \npharmaceutical applications [ 65]. Many Lamiaceae  contain high levels of phenolics, which \nare probably the most relevant group of secondary metabolites synthesized by plants due \nto their health promotion effects [ 64]. Among phenolic compounds, rosmarinic acid is \npresent in the tissues of many of these species being used as a chemical marker of the \nfamily [ 64, 66, 67]. In some species, this compound is accumulated as the main phenolic \ncompound at a concentration above 0.5% dry weight [ 64]. Several species in the Lamiaceae  \nfamily can also accumulate high levels of other phenolic acids, flavonoids, or phenolic \nterpenes [ 64]. There are some phenolic compounds as carnosic and clerodendranoic acids \nthat are exclusive from this family [ 68, 69]. The interested reader can find an excellent \noverview on the phytochemical characterization and biological effects of Lamiaceae  species \nin Trivellini et  al. [64].\nPhenolic compounds are generally produced as a defense mechanism or as a response to \nstressful environment conditions [9]. The activation of these protective mechanisms by apply-\ning stress stimulus can be used as a strategy to increase the production of phenolic com -\npounds in plant cell and organ cultures [70]. Recently, several attempts were made regarding \nthe production of secondary metabolites by several Lamiaceae species (mainly phenolics) \nusing plant tissue cultures particularly applying elicitation as a strategy to achieve higher \nproduction yields [64]. These studies involve mainly the use of chemical elicitors like jasmonic \nacid (or methyl jasmonate), or physical elicitors as UV-B and ozone (O 3), to increase the pro-\nduction of many compounds as essential oil constituents, phenylpropanoids, flavonoids, and \nphenolic acids. Overall, the results demonstrated that these elicitors had an immediate effect \non enhancing the production of phenolics [64].\nThe revised study showed that a high number of studies reported an increase in the pro -\nduction of rosmarinic acid after elicitation of cultures of several Lamiaceae, such as Coleus, \nLavandula, and Salvia genera [64, 66, 71]. Several studies reported the increase in rosmarinic \nacid production through the application of elicitors ( Table 2). Elicitation with jasmonic acid \ninduces a 4.6-fold increase of rosmarinic acid production in L. officinalis  L. cell suspension \ncultures [72], and elicitation with methyl jasmonate induces a 3.4-fold increase in C. forskohlii \n(Willd.) Briq. hairy root cultures [ 73]. The production of this compound also increased (2.3-\nfold) in leaves of Rosmarinus officinalis  L. after 14  days of UV-B exposure [ 74]. Recently, \nrosmarinic acid attracted the attention of the scientists due to its broad range of biologi -\ncal activities, such as anti-inflammatory, antioxidant, cognitive-enhancing, cancer chemo -\nprotection effects, among others [ 71]. In the last years, there are many progresses in the \nSecondary Metabolites - Sources and Applications90\nbiotechnological production of this compound but its large-scale production still requires \nfurther optimization. The molecular understanding of its biosynthesis and the application \nof metabolic engineering tools are crucial to improve the biotechnological production.\n7. Conclusions and prospects\nPlant cell and tissue culture techniques are an attractive system for the cultivation of a broad \nrange of secondary metabolites, including important alkaloids with anticancer properties \nand bioactive phenolics. This alternative provides a continuous, sustainable, economical, and \nviable production of secondary metabolites, independent of geographic and climatic condi -\ntions, which is particularly useful for the production of species at risk. Despite the great pro -\ngresses in this area in the last decades, in some cases, production occurs at very low yields, \nand there are many difficulties in scaling up the production, and limited commercial success \nis achieved. Incomplete knowledge about the biosynthetic pathways of bioactive molecules \nlimited the improvement of the production yields. Exploiting modern molecular biology tech-\nniques emerged as an alternative that needs to be harnessed to improve production efficiency \nby engineering biosynthetic pathway(s) of the molecules in plant cells. Also promising are \nnew elicitors and permeabilizing agents such as coronatin or cyclodextrins. The production of \nbioactive molecules in endophytes also appears as an attractive alternative, although till date, \nthere is no reported commercial exploitation.\nAcknowledgements\nThis work is supported by National Funds—FCT (Fundação para a Ciência e a Tecnologia, \nI.P.), through the project UID/BIA/4325/2013. S.  Gonçalves acknowledges a grant from the \nFCT (SFRH/BPD/84112/2012) financed by POPH-QREN and subsidized by the European \nScience Foundation.\nPlant species Tissue Elicitor Reference\nColeus blumei Benth. HRC Methyl jasmonate [88]\nColeus forshohlii (Willd.) Briq. HRC Methyl jasmonate [73]\nLavandula officinalis Chaix CSC Jasmonic acid [72]\nLavandula vera MM CSC Vanadyl sulphate [89]\nLavandula vera MM CSC Methyl jasmonate [90]\nMentha × piperita CSC Methyl jasmonate [91]\nRosmarinus officinalis L. L UV-B [74]\nHRC: hairy root culture; CSC: cell suspension cultures; L: leaves.\nTable 2. Selected examples of elicitation treatments applied in cultures of Lamiaceae species to increase the production \nof rosmarinic acid.\nProduction of Plant Secondary Metabolites by Using Biotechnological Tools\nhttp://dx.doi.org/10.5772/intechopen.76414\n91\nAuthor details\nSandra Gonçalves and Anabela Romano*\n*Address all correspondence to: aromano@ualg.pt\nFaculty of Sciences and Technology, MeditBio, University of Algarve, Faro, Portugal\nReferences\n[1] Narayani M, Srivastava S. Elicitation: A stimulation of stress in in vitro plant cell/tissue \ncultures for enhancement of secondary metabolite production. Phytochemistry Reviews. \n2017;16:1227-1252. DOI: 10.1007/s11101-017-9534-0\n[2] Shitan N.  Secondary metabolites in plants: Transport and self-tolerance mechanisms.  \nBioscience, Biotechnology and Biochemistry. 2016;80:1283-1293. DOI: 10.1080/09168451. \n2016.1151344\n[3] Isah T, Umar S, Mujib A, Sharma MP, Rajasekharan PE, Zafar N, Frukh A.  Secondary \nmetabolism of pharmaceuticals in the plant in vitro cultures: Strategies, approaches, and \nlimitations to achieving higher yield. Plant Cell Tissue and Organ Culture. 2018;132:239-\n265. DOI: 10.1007/s11240-017-1332-2\n[4] Dias DA, Urban S, Roessner U. A historical overview of natural products in drug discov-\nery. Metabolites. 2012;2:303-336. DOI: 10.3390/metabo2020303\n[5] Giri CC, Zaheer M.  Chemical elicitors versus secondary metabolite production in vitro \nusing plant cell, tissue and organ cultures: Recent trends and a sky eye view appraisal. \nPlant Cell Tissue and Organ Culture. 2016;126:1-18. DOI: 10.1007/s11240-016-0985-6\n[6] Samuelsson G. Drugs of Natural Origin: A Textbook of Pharmacognosy. 5th ed. Stock-\nholm: Swedish Pharmaceutical Press; 2004\n[7] Cragg GM, Newman DJ. Plants as a source of anticancer agents. Journal of Ethnopharma-\ncology. 2005;100:72-79. DOI: 10.1016/j.jep.2005.05.011\n[8] British Broadcasting Corporation (BBC) Research. Plant-derived Drugs: Global Markets. \n2017. Available from: https://www.bccresearch.com/market-research/biotechnology/\nbotanical-and-plant-derived-drugs-global-markets-bio022h.html [Accessed: 2018-02-08]\n[9] Dias MI, Sousa MJ, Alves RC, Ferreira ICFR.  Exploring plant tissue culture to improve \nthe production of phenolic compounds: A review. Industrial Crops and Products. \n2016;82:9-22. DOI: 10.1016/j.indcrop.2015.12.016\n[10] Lucera A, Costa C, Conte A, Del Nobile MA. Food applications of natural antimicrobial \ncompounds. Frontiers in Microbiology. 2012;3:287. DOI: 10.3389/fmicb.2012.00287\nSecondary Metabolites - Sources and Applications92\n[11] Stevenson DD, Szczeklik A.  Clinical and pathologic perspectives on aspirin sensitiv -\nity and asthma. Journal of Allergy and Clinical Immunology. 2006; 118:773-786. DOI: \n10.1016/j.jaci.2006.07.024\n[12] Greger H. Phytocarbazoles: Alkaloids with great structural diversity and pronounced \nbiological activities. Phytochemistry Reviews. 2017; 16:1095-1153. DOI: 10.1007/s11101-  \n017-9521-5\n[13] Yue W, Ming Q-L, Lin B, Rahman K, Zheng C-J, Han T, Qin L-P.  Medicinal plant cell \nsuspension cultures: Pharmaceutical applications and high-yielding strategies for the \ndesired secondary metabolites. Critical Reviews in Biotechnology. 2016;36:215-232. DOI: \n10.3109/07388551.2014.923986\n[14] Murthy HN, Lee EJ, Paek KY. Production of secondary metabolites from cell and organ \ncultures: Strategies and approaches for biomass improvement and metabolite accumula-\ntion. Plant Cell Tissue and Organ Culture. 2014;118:1-16. DOI: 10.1007/s11240-014-0467-7\n[15] Ochoa-Villarreal M, Howat S, Hong S, Jang MO, Jin Y-W, Lee E-K, Loake GJ.  Plant cell \nculture strategies for the production of natural products. BMB Reports. 2016;49:149-158. \nDOI: 10.5483/BMBRep.2016.49.3.264\n[16] Verpoorte R, Contin A, Memelink J.  Biotechnology for the production of plant second -\nary metabolites. Phytochemistry Reviews. 2002;1:13-25. DOI: 10.1023/A:1015871916833\n[17] Kolewe ME, Gaurav V, Roberts SC. Pharmaceutical active natural product synthesis and \nsupply via plant cell culture technology. Molecular Pharmaceutics. 2008;5:243-256. DOI: \n10.1021/mp7001494\n[18] Pavlov A, Popov S, Kovacheva E, Milen Georgiev M, Ilieva M.  Volatile and polar com-\npounds in Rosa damascena  Mill 1803 cell suspension. Journal of Biotechnology. 2005;  \n118:89-97. DOI: 10.1016/j.jbiotec.2005.03.005\n[19] Khani S, Barar J, Movafeghi A, Omidi Y. Production of anticancer secondary metabolites: \nImpacts of bioprocess engineering. In: Orhan IE, editor. Biotechnological Production of \nSecondary Metabolites. Benthan eBooks; 2012. pp. 215-240\n[20] Karuppusamy S. A review on trends in production of secondary metabolites from higher \nplants by in vitro tissue, organ and cell cultures. Journal of Medicinal Plants Research. \n2009;3:1222-1239\n[21] Rao SR, Ravishankar GA.  Plant cell cultures: Chemical factories of secondary metabo -\nlites. Biotechnology Advances. 2002;20:101-153. DOI: 10.1016/S0734-9750(02)00007-1\n[22] Chandra S, Chandra R.  Engineering secondary metabolite production in hairy roots. \nPhytochemical Reviews. 2011;10:371-395. DOI: 10.1007/s11101-011-9210-8\n[23] Ali M, Isah T, Mujib A, Dipti. Climber plants: Medicinal importance and conservation \nstrategies. In: Shahzad A, Sharma S, Siddiqui SA, editors. Biotechnological Strategies \nfor the Conservation of Medicinal and Ornamental Climbers. New York: Springer; 2016. \npp. 101-138\nProduction of Plant Secondary Metabolites by Using Biotechnological Tools\nhttp://dx.doi.org/10.5772/intechopen.76414\n93\n[24] Xu J, Ge X, Dolan MC. Towards high-yield production of pharmaceutical proteins with \nplant cell suspension cultures. Biotechnology Advances. 2011;29:278-299. DOI: 10.1016/j.\nbiotechadv.2011.01.002\n[25] Zhang X, Ye M, Dong Y, Hu HB, Tao SJ, Yin J, Guo DA. Biotransformation of bufadieno-\nlides by cell suspension cultures of Saussurea involucrata. Phytochemistry. 2011;72:1779-\n1785. DOI: 10.1016/j.phytochem.2011.05.004\n[26] de Pádua RM, Meitinger N, Filho JDS, Waibel R, Gmeiner P, Braga FC, Kreis W.   \nBiotransformation of 21- O-acetyl-deoxycorticosterone by cell suspension cultures of \nDigitalis lanata (strain W. 1.4). Steroids. 2012; 77:1373-1380. DOI: 10.1016/j.steroids.2012.  \n07.016\n[27] Patil RA, Lenka SK, Normanly J, Walker EL, Roberts SC.  Methyl jasmonate represses \ngrowth and affects cell cycle progression in cultured Taxus cells. Plant Cell Reports. \n2014;33:1479-1492. DOI: 10.1007/s00299-014-1632-5\n[28] Sharma K, Zafar R. Optimization of methyl jasmonate and β-cyclodextrin for enhanced \nproduction of taraxerol and taraxasterol in Taraxacum officinale Weber cultures. Plant \nPhysiology and Biochemistry. 2016;103:24-30. DOI: 10.1016/j.plaphy.2016.02.029\n[29] Cai Z, Knorr D, Smetanska I.  Enhanced anthocyanins & resveratrol production in \nVitis vinifera cell suspension culture by indanoyl-isoleucine, N-linolenoyl-l-glutamine, \nand insect saliva. Enzyme and Microbial Technology. 2012; 50:29-34. DOI: 10.1016/j.\nenzmictec.2011.09.001\n[30] Baldi A, Dixit VK. Yield enhancement strategies for artemisinin production by suspen -\nsion cultures of Artemisia annua. Bioresource and Technology. 2008; 99:4609-4614. DOI: \n10.1016/j.biortech.2007.06.061\n[31] Jeong C, Murthy HN, Hahn E, Paek K. Improved production of ginsenosides in suspen-\nsion cultures of ginseng by medium replenishment strategy. Journal of Bioscience and \nBioengineering. 2008;105:288-291. DOI: 10.1263/jbb.105.288\n[32] Ten Hoopen HJG, Vinke JL, Moreno PRH, Verpoorte R, Heijnen JJ. Influence of tempera-\nture on growth and ajmalicine production by Catharantus roseus  suspension cultures. \nEnzyme and Microbial Technology. 2002;30:56-65. DOI: 10.1016/S0141-0229(01)00456-2\n[33] Zhao J, Davis LC, Verpoorte R. Elicitor signal transduction leading to the production of \nthe plant secondary metabolite. Biotechnology Advances. 2005;23:283-333. DOI: 10.1016/j.  \nbiotechadv.2005.01.003\n[34] Ramirez-Estrada K, Vidal-Limon H, Hidalgo D, Moyano E, Golenioswki M, Cusidó RM, \nPalazon J. Elicitation, an effective strategy for the biotechnological production of the \nbioactive high-added value compounds in plant cell factories. Molecules. 2016; 21:182 \nhttps://doi.org/10.3390/molecules21020182\n[35] Saw NMMT, Riedel H, Cai Z, Kutuk O, Smetanska I. Stimulation of anthocyanin synthe-\nsis in grape (Vitis vinifera) cell cultures by pulsed electric fields and ethephon. Plant Cell, \nTissue and Organ Culture. 2012;108:47-54. DOI: 10.1007/s11240-011-0010-z\nSecondary Metabolites - Sources and Applications94\n[36] Srivastava S, Srivastava AK. Hairy root culture for mass-production of high-value sec -\nondary metabolites. Critical Reviews in Biotechnology. 2007; 27:29-43. DOI: 10.1080/  \n07388550601173918\n[37] Zaheer M, Reddy VD, Giri CC.  Enhanced daidzin production from jasmonic and ace -\ntyl salicylic acid elicited hairy root cultures of Psoralea corylifolia L. (Fabaceae). Natural \nProduct Research. 2016;30:1542-1547. DOI: 10.1080/14786419.2015.1054823\n[38] Dicosmo F, Misawa M. Plant cell and tissue culture: Alternatives for metabolite produc-\ntion. Biotechnology Advances. 1995;13:425-453. DOI: 10.1016/0734-9750(95)02005-N\n[39] Verpoorte R, Alfermann AW. Metabolic Engineering of the Plant Secondary Metabolism. \nNew York: Springer; 2000. pp. 1-29\n[40] O’Connor SE.  Engineering of secondary metabolism. Annual Reviews in Genetics. \n2015;49:71-94. DOI: 10.1146/annurev-genet-120213-092053\n[41] Cusido RM, Onrubia M, Sabater-Jara AB, Moyano E, Bonfill M, Goossens A, Pedreño \nMA, Palazon J.  A rational approach to improving the biotechnological production of \ntaxanes in plant cell cultures of Taxus spp. Biotechnology Advances. 2014;32:1157-1167. \nDOI: 10.1016/j.biotechadv.2014.03.002\n[42] Lu X, Tang K, Li P. Plant metabolic engineering strategies for the production of pharma-\nceutical terpenoids. Frontiers in Plant Science. 2016;7:1647. DOI: 10.3389/fpls.2016.01647\n[43] Dudareva N, Andersson S, Orlova I, Gatto N, Reichelt M, Rhodes D, Boland W, \nGershenzon J.  The nonmevalonate pathway supports both monoterpene and sesqui -\nterpene formation in snapdragon flowers. Proceedings of the National Academy of \nSciences USA. 2005;102:933-938. DOI: 10.1073/pnas.0407360102\n[44] Nanda S, Mohanty JN, Mishra R, Joshi RK. Metabolic engineering of phenyl propanoids \nin plants. In: Jha S, editor. Transgenesis and Secondary Metabolism: Part of the Series \nReference Series in Phytochemistry. New York: Springer; 2016. pp. 1-26\n[45] Verpoorte R, Van der Heijden R, Ten Hoopen HJG, Memelink J.  Metabolic engineering \nof plant secondary metabolite pathways for production of fine chemicals. Biotechnology \nLetters. 1999;21:467-479. DOI: 10.1023/A:1005502632053\n[46] Oksman-Caldentey KM, Arroo R.  Regulation of tropane alkaloid metabolism in plants \nand plant cell cultures. In: Verpoorte R, Alfermann AW, editors. Metabolic Engineering \nof Plant Secondary Metabolism. New York: Springer; 2000. pp. 253-281\n[47] Park SY, Paek KY.  Bioreactor culture of shoots and somatic embryos of medicinal \nplants for production of bioactive compounds. In: Paek KY, Murthy HN, Zhong JJ, edi -\ntors. Production of Biomass and Bioactive Compounds Using Bioreactor Technology. \nNew York: Springer; 2014. pp. 337-368\n[48] Tabata M, Fujita Y. Production of shikonin by the plant cell cultures. In: Zatlin M, Day P, \nHollaender A, editors. Biotechnology in the Plant Science. Cambridge: Academic Press; \n1985. pp. 207-218\nProduction of Plant Secondary Metabolites by Using Biotechnological Tools\nhttp://dx.doi.org/10.5772/intechopen.76414\n95\n[49] Hibino K, Ushiyama K.  Commercial production of ginseng by the plant tissue culture \ntechnology. In: Fu TJ, Singh G, Curtis WR, editors. Plant Cell & Tissue Culture for \nProduction of Food Ingredients. New York: Springer; 1999. pp. 215-224\n[50] Wink M, Alfermann AW, Franke R, Wetterauer B, Distl M, Windhövel J, Krohn O, Fuss \nE, Garden H, Mohagheghzadeh A, Wildi E, Ripplinger P.  Sustainable bioproduction of \nphytochemicals by plant in vitro cultures: Anticancer agents. Plant Genetic Resources: \nCharacterisation and Utilisation. 2005;3:90-100\n[51] Yesil-Celiktas O, Gurel A, Vardar-Sukan F.  Large Scale Cultivation of Plant Cell and \nTissue Culture in Bioreactors. Trivandrum: Transworld Research Network; 2010. pp. 1-54\n[52] Ruffoni B, Pistelli L, Bertoli A, Pistelli L. Plant cell cultures: Bioreactors for industrial pro-\nduction. In: Giardi MT, Rea G, Berra B, editors. Bio-Farms for Nutraceuticals. New York: \nSpringer; 2010. pp. 203-221\n[53] Steingroewer J, Bley T, Georgiev V, Ivanov I, Lenk F, Marchev A, Pavlov A. Bioprocessing \nof differentiated plant in vitro systems. Engineering in Life Sciences. 2013;13:26-38. DOI: \n10.1002/elsc.201100226\n[54] Wang SJ, Zhong JJ. A novel centrifugal impeller bioreactor. I.  Fluid circulation, mixing, \nand liquid velocity profiles. Biotechnology and Bioengineering. 1996; 51:511-519. DOI: \n10.1002/(SICI)1097-0290(19960905)51:5<511::AID-BIT2>3.0.CO;2-F\n[55] Cassady JM, Douros JD. Anticancer Agents Based on Natural Product Models. New York: \nAcademic Press; 1980\n[56] Fridlender M, Kapulnik Y, Koltai H.  Plant derived substances with anti-cancer activ -\nity: From folklore to practice. Frontiers in Plant Science. 2015:6-799. DOI: 10.3389/\nfpls.2015.00799\n[57] Lopez-Meyer M, Nessler CL, McKnight TD.  Sites of accumulation of the antitumor \nalkaloid camptothecin in Camptotheca acuminata. Planta Medica. 1994; 60:558-560. DOI: \n10.1055/s-2006-959571\n[58] Saito K, Sudo H, Yamazaki M, Koseki-Nakamura M, Kitajima M, Takayama H, Aimi \nN. Feasible production of camptothecin by hairy root cultures of Ophiorrhiza pumila . \nPlant Cell Reports. 2001;20:267-271. DOI: 10.1007/s002990100320\n[59] Almagro L, Fernández-Pérez F, Pedreño MA. Indole alkaloids from Catharanthus roseus: \nBioproduction and their effect on human health. Molecules. 2015; 20:2973-3000. DOI: \n10.3390/molecules20022973\n[60] Roja G.  Micropropagation and production of Camptothecin from in vitro  plants of \nOphiorrhiza rugosa  var. decumbens. Natual Product Research. 2008; 22:1017-1023. DOI: \n10.1080/14786410802006165\n[61] Dandin VS, Murthy HN.  Enhanced in vitro multiplication of Nothapodytes nimmoniana \nGraham using semisolid and liquid cultures and estimation of camptothecin in the \nregenerated plants. Acta Physiologiae Plantarum. 2012; 34:1381-1386. DOI: 10.1007/\ns11738-012-0934-x\nSecondary Metabolites - Sources and Applications96\n[62] Kim YS, Lim S, Choi YE, Anbazhagan VR.  High frequency plant regeneration via \nsomatic embryogenesis in Podophyllum peltatum L., an important source of anticancer \ndrug. Current Science. 2017;92:662-666\n[63] Rajesh M, Sivanandhan G, Jeyaraj M, Chackravarthy R, Manickavasagam M, Selvaraj \nN, Ganapathi A. An efficient in vitro system for somatic embryogenesis and podophyl -\nlotoxin production in Podophyllum hexandrum Royle. Protoplasma. 2014; 251:1231-1243. \nDOI: 10.1007/s00709-014-0632-1\n[64] Trivellini A, Lucchesini M, Maggini R, Mosadegh H, Villamarin TSS, Vernieri P, Mensuali-\nSodi A, Pardossi A. Lamiaceae phenols as multifaceted compounds: Bioactivity, industri-\nalprospects and role of “positive-stress”. Industrial Crops and Products. 2016;83:241-254. \nDOI: 10.1016/j.indcrop.2015.12.039\n[65] Ozkan M. Glandular and eglandular hairs of Salvia recognita Fisch. & Mey. (Lamiaceae) \nin Turkey. Bangladesh Journal of Botany. 2008;37:93-95. DOI: 10.3329/bjb.v37i1.1571\n[66] Gonçalves S, Romano A. In vitro culture of lavenders ( Lavandula spp.) and the produc -\ntion of secondary metabolites. Biotechnology Advances. 2013;31:166-174. DOI: 10.1016/j.\nbiotechadv.2012.09.006\n[67] Gonçalves S, Moreira E, Grosso C, Andrade PB, Valentão P, Romano A. Phenolic profile, \nantioxidant activity and enzyme inhibitory activities of extracts from aromatic plants \nused in Mediterranean diet. Journal of Food Science and Technology. 2017; 54:219-227. \nDOI: 10.1007/s13197-016-2453-z\n[68] Zheng Q, Sun Z, Zhang X, Yuan J, Wu H, Yang J, Xu X. Clerodendranoic acid, a new phe-\nnolic acid from Clerodendranthus spicatus. Molecules. 2012;17:13656-13661. DOI: 10.3390/\nmolecules171113656\n[69] Birtić S, Dussort P, Pierre FX, Bily AC, Roller M.  Carnosic acid. Phytochemistry. \n2015;115:9-19. DOI: 10.1016/j.phytochem.2014.12.026\n[70] Matkowski A.  Plant in vitro  culture for the production of antioxidants—A review. \nBiotechnology Advances. 2008;26:548-560. DOI: 10.1016/j.biotechadv.2008.07.001\n[71] Khojasteh A, Mirjalili MH, Hidalgo D, Corchete P, Palazon J.  New trends in biotechno-\nlogical production of rosmarinic acid. Biotechnology Letters. 2014; 36:2393-2406. DOI: \n10.1007/s10529-014-1640-0\n[72] Stehfest K, Boese M, Kerns G, Piry A, Wilhelm C.  Fourier transform infrared spectros -\ncopy as a new tool to determine rosmarinic acid in situ. Journal of Plant Physiology. \n2004;161:151-156. DOI: 10.1078/0176-1617-01099\n[73] Li W, Koike K, Asada Y, Yoshikawa T, Nikaido T. Rosmarinic acid production by Coleus \nforskohlii hairy root cultures. Plant Cell Tissue and Organ Culture. 2005;80:151-155. DOI: \n10.1007/s11240-004-9541-x\n[74] Luis JC, Martın Perez R, Valdes Gonzalez F. UV-B radiation effects on foliar concentra -\ntions of rosmarinic and carnosic acids in rosemary plants. Food Chemistry. 2007;101:1211-\n1215. DOI: 10.1016/j.foodchem.2006.03.023\nProduction of Plant Secondary Metabolites by Using Biotechnological Tools\nhttp://dx.doi.org/10.5772/intechopen.76414\n97\n[75] Lorence A, Medina-Bolivar F, Nessler CL.  Camptothecin and 10-hydroxycamptoth -\necin from Camptotheca acuminata hairy roots. Plant Cell Reports. 2004; 22:437-441. DOI: \n10.1007/s00299-003-0708-4\n[76] Pi Y, Jiang K, Hou R, Gong Y, Lin J, Sun X, Tang K.  Examination of camptothecin and \n10-hydroxycamptothecin in Camptotheca acuminata  plant and cell culture, and the \naffected yields under several cell culture treatments. Biocell. 2010;34:139-143\n[77] Fulzele DP, Satdive R, Kamble S, Singh S, Singh S.  Improvement of anticancer drug \ncamptothecin production by gamma irradiation on callus cultures of Nothapodytes foetida. \nInternational Journal of Pharmaceutical Research and Allied Sciences. 2015;4:19-27\n[78] Karwasara MVS, Dixit VK. Culture medium optimization for camptothecin production \nin cell suspension cultures of Nothapodytes nimmoniana (J.  Grah.). Plant Biotechnology \nReports. 2013;7:357-369\n[79] Ya-ut P, Chareonsap P, Sukrong S. Micropropagation and hairy root culture of Ophiorrhiza \nalata Craib for camptothecin production. Biotechnology Letters. 2011;33:2519-2526. DOI: \n10.1007/s10529-011-0717-2\n[80] Deepthi S, Satheeshkumar K.  Enhanced camptothecin production induced by elicitors \nin the cell suspension cultures of Ophiorrhiza mungos Linn. Plant Cell Tissue and Organ \nCulture. 2016;124:483-493. DOI: 10.1007/s11240-015-0908-y\n[81] Martin KP, Zhang C-L, Hembrom ME, Slater A, Madassery J.  Adventitious root induc-\ntion in Ophiorrhiza prostrata: A tool for the production of camptothecin (an anticancer \ndrug) and rapid propagation. Plant Biotechnology Reports. 2008;2:163-169. DOI: 10.1007/\ns11816-008-0057-4\n[82] Bahabadi SE, Sharifi M, Chashmi NA, Murata J, Satake H.  Significant enhancement of \nlignan accumulation in hairy root cultures of Linum album using biotic elicitors. Acta \nPhysiolgiae Plantarum. 2014;36:3325-3331. DOI: 10.1007/s11738-014-1700-z\n[83] Cong LH, Dauwe R, Lequart M, Vinchon S, Renouard S, Fliniaux O, Colas C, Corbin \nC, Doussot J, Hano C, Lamblin F, Molinié R, Pilard S, Jullian N, Boitel M, Gontier E, \nMesnard F, Laberche J-C.  Kinetics of glucosylated and non-glucosylated aryltetralin \nlignans in Linum hairy root cultures. Phytochemistry. 2015; 115:70-78. DOI: 10.1016/j.\nphytochem.2015.01.001\n[84] Yousefzadi M, Sharifi M, Behmanesh M, Ghasempour A, Moyano E, Palazon J. Salicylic \nacid improves podophyllotoxin production in cell cultures of Linum album by increasing \nthe expression of genes related with its biosynthesis. Biotechnology Letters. 2010;32:1739-\n1743. DOI: 10.1007/s10529-010-0343-4\n[85] Jamshidi M, Ghanati F. Taxanes content and cytotoxicity of hazel cells extract after elici-\ntation with silver nanoparticles. Plant Physiology and Biochemistry. 2017; 110:178-184. \nDOI: 10.1016/j.plaphy.2016.04.026\nSecondary Metabolites - Sources and Applications98\n[86] Li M, Peebles CAM, Shanks JV, San K-Y.  Effect of sodium nitroprusside on growth \nand terpenoid indole alkaloid production in Catharanthus roseus  hairy root cultures. \nBiotechnology Progress. 2011;27:625-630. DOI: 10.1002/btpr.605\n[87] Rizvi NF, Cornejo M, Stein K, Weaver J, Cram EJ, Lee-Parsons CWT.  An efficient trans-\nformation method for estrogen-inducible transgene expression in Catharanthus roseus  \nhairy roots. Plant Cell Tissue and Organ Culture. 2015;120:475-487. DOI: 10.1007/s11240- \n014-0614-1\n[88] Bauer N, Kiseljak D, Jelaska S.  The effect of yeast extract and methyljasmonate on ros -\nmarinic acid accumulation in Coleus blumei hairy roots. Biologia Plantarum. 2009;53:650-\n656. DOI: 10.1007/s10535-009-0118-8\n[89] Georgiev M, Kuzeva S, Pavlov A, Kovacheva E, Ilieva M. Enhanced rosmarinic acid pro-\nduction by Lavandula vera MM cell suspension culture through elicitation with vanadyl \nsulfate. Zeitschrift für Naturforschung C. 2006;61:241-244. DOI: 10.1515/znc-2006-3-414\n[90] Georgiev MI, Kuzeva SL, Pavlov AI, Kovacheva EG, Ilieva MP. Elicitation of rosmarinic \nacid by Lavandula vera MM cell suspension culture with abiotic elicitors. World Journal \nof Microbiology and Biotechnology. 2007;23:301-304. DOI: 10.1007/s11274-006-9214-5\n[91] Krzyzanowska J, Czubacka A, Pecio L, Przybys M, Doroszewska T, Stochmal A, Oleszek \nW. The effects of jasmonic acid and methyl jasmonate on rosmarinic acid production \nin Mentha  × piperita  cell suspension cultures. Plant Cell Tissue and Organ Culture. \n2012;108:73-81. DOI: 10.1007/s11240-011-0014-8\nProduction of Plant Secondary Metabolites by Using Biotechnological Tools\nhttp://dx.doi.org/10.5772/intechopen.76414\n99\n",
  "topic": "Rosmarinic acid",
  "concepts": [
    {
      "name": "Rosmarinic acid",
      "score": 0.8651278018951416
    },
    {
      "name": "Secondary metabolite",
      "score": 0.5605846047401428
    },
    {
      "name": "Biotechnology",
      "score": 0.5263881683349609
    },
    {
      "name": "Biology",
      "score": 0.4942488968372345
    },
    {
      "name": "Secondary metabolism",
      "score": 0.46067675948143005
    },
    {
      "name": "Podophyllotoxin",
      "score": 0.44779396057128906
    },
    {
      "name": "Plant tissue culture",
      "score": 0.4130121171474457
    },
    {
      "name": "Chemistry",
      "score": 0.36091744899749756
    },
    {
      "name": "Tissue culture",
      "score": 0.3473755717277527
    },
    {
      "name": "Biochemical engineering",
      "score": 0.3328292965888977
    },
    {
      "name": "Biochemistry",
      "score": 0.30843794345855713
    },
    {
      "name": "In vitro",
      "score": 0.22430890798568726
    },
    {
      "name": "Biosynthesis",
      "score": 0.11807200312614441
    },
    {
      "name": "Engineering",
      "score": 0.11617568135261536
    },
    {
      "name": "Organic chemistry",
      "score": 0.07763129472732544
    },
    {
      "name": "Gene",
      "score": 0.0
    },
    {
      "name": "Enzyme",
      "score": 0.0
    },
    {
      "name": "Antioxidant",
      "score": 0.0
    }
  ],
  "institutions": []
}