{
    "title": "Research on mechanical fault diagnosis method of power transformer winding",
    "url": "https://openalex.org/W2898216041",
    "year": 2018,
    "authors": [
        {
            "id": "https://openalex.org/A1824028532",
            "name": "Zhang Bin",
            "affiliations": [
                "Electric Power Research Institute",
                "Shanghai Electric (China)"
            ]
        },
        {
            "id": "https://openalex.org/A1900778446",
            "name": "Zhao Dan",
            "affiliations": [
                "Electric Power Research Institute",
                "Shanghai Electric (China)"
            ]
        },
        {
            "id": "https://openalex.org/A1623527381",
            "name": "Wang Feiming",
            "affiliations": [
                "Shanghai Electric (China)",
                "Electric Power Research Institute"
            ]
        },
        {
            "id": "https://openalex.org/A2358757562",
            "name": "Shi Kejian",
            "affiliations": [
                "State Nuclear Power Technology Company (China)"
            ]
        },
        {
            "id": "https://openalex.org/A2336686201",
            "name": "Zhao Zhenyang",
            "affiliations": [
                "Electric Power Research Institute",
                "Shanghai Electric (China)"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2389248004",
        "https://openalex.org/W2378848459",
        "https://openalex.org/W2380101072",
        "https://openalex.org/W2392457779",
        "https://openalex.org/W2035211726",
        "https://openalex.org/W2380525239",
        "https://openalex.org/W2353285583"
    ],
    "abstract": "Today, the accuracy of the fault mechanical diagnosis of transformer winding is low and the fault types cannot be judged, this study proposes a machine condition diagnosis method of transformer winding based on the combination of short‐circuit reactance and mechanical vibration. During the process of diagnosis, first of all, from a power transformer's one and two side current and voltage, it can calculate the internal short‐circuit reactance of the winding to judge the winding state. Then, it uses the wavelet transform to analyse the vibration signals of the transformer windings under different conditions and it uses the signal spectrum entropy as the input feature vector. Finally, using multi class support vector machine to train and test the feature vector, it realises the classification diagnosis of transformer winding in different states. By setting the actual different transformer winding faults of type S11‐M‐500/35, it gathers the corresponding parameter data and it tests the diagnosis method for the fault diagnosis of transformer winding verification. The diagnosis results are consistent with the actual fault, which verifies the validity and accuracy of the proposed method that is applied to the transformer winding fault diagnosis.",
    "full_text": null
}