{
  "title": "Word2Vec model for sentiment analysis of product reviews in Indonesian language",
  "url": "https://openalex.org/W2890103383",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A2173419977",
      "name": "M Ali Fauzi",
      "affiliations": [
        "University of Brawijaya"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2044933868",
    "https://openalex.org/W6601865948",
    "https://openalex.org/W2132163478",
    "https://openalex.org/W1990627567",
    "https://openalex.org/W104703790",
    "https://openalex.org/W1980085292",
    "https://openalex.org/W2126581536",
    "https://openalex.org/W2951278869",
    "https://openalex.org/W6678923525",
    "https://openalex.org/W2077563243",
    "https://openalex.org/W2783180099",
    "https://openalex.org/W6647662589",
    "https://openalex.org/W2907225684",
    "https://openalex.org/W2800030089",
    "https://openalex.org/W1975428268",
    "https://openalex.org/W2912490202",
    "https://openalex.org/W6671598539",
    "https://openalex.org/W2112251034",
    "https://openalex.org/W2017016179",
    "https://openalex.org/W2089987740",
    "https://openalex.org/W2111620038",
    "https://openalex.org/W2158139315",
    "https://openalex.org/W2921621939",
    "https://openalex.org/W6624822662",
    "https://openalex.org/W2141599568",
    "https://openalex.org/W2083606554",
    "https://openalex.org/W1560851690",
    "https://openalex.org/W2529281176",
    "https://openalex.org/W2251404238",
    "https://openalex.org/W6735984405",
    "https://openalex.org/W2153579005",
    "https://openalex.org/W2469089237",
    "https://openalex.org/W6680532216",
    "https://openalex.org/W2753402513",
    "https://openalex.org/W2594120709",
    "https://openalex.org/W1515087027",
    "https://openalex.org/W1550206324",
    "https://openalex.org/W6675354045",
    "https://openalex.org/W2140679639",
    "https://openalex.org/W4307613132",
    "https://openalex.org/W4301518613",
    "https://openalex.org/W1614298861",
    "https://openalex.org/W1988772356",
    "https://openalex.org/W2084046180",
    "https://openalex.org/W4247707017",
    "https://openalex.org/W2101234009",
    "https://openalex.org/W2126581182",
    "https://openalex.org/W46305997",
    "https://openalex.org/W2045874802",
    "https://openalex.org/W2963864161",
    "https://openalex.org/W4294170691",
    "https://openalex.org/W2604880942"
  ],
  "abstract": "&lt;span lang=\"EN-US\"&gt;Online product reviews have become a source of greatly valuable information for consumers in making purchase decisions and producers to improve their product and marketing strategies. However, it becomes more and more difficult for people to understand and evaluate what the general opinion about a particular product in manual way since the number of reviews available increases. Hence, the automatic way is preferred. One of the most popular techniques is using machine learning approach such as Support Vector Machine (SVM). In this study, we explore the use of Word2Vec model as features in the SVM based sentiment analysis of product reviews in Indonesian language. The experiment result show that SVM can performs well on the sentiment classification task using any model used. However, the Word2vec model has the lowest accuracy (only 0.70), compared to other baseline method including Bag of Words model using Binary TF, Raw TF, and TF.IDF. This is because only small dataset used to train the Word2Vec model. Word2Vec need large examples to learn the word representation and place similar words into closer position.&lt;/span&gt;",
  "full_text": "International Journal of Electrical and Computer Engineering (IJECE) \nVol. 9, No. 1, February 2019, pp. 525~530 \nISSN: 2088-8708, DOI: 10.11591/ijece.v9i1.pp525-530      525 \n  \nJournal homepage: http://iaescore.com/journals/index.php/IJECE \nWord2Vec model for sentiment analysis of product reviews in \nIndonesian language \n \n \nM. Ali Fauzi  \nFaculty of Computer Science, Brawijaya University, Indonesia \n \n \nArticle Info  ABSTRACT  \nArticle history: \nReceived Feb 3, 2018 \nRevised Jun 22, 2018 \nAccepted Jul 6, 2018 \n \n Online product reviews have become a source of greatly valuable \ninformation for consumers in making purchase decisions and producers to \nimprove their product and marketing strategies. However, it becomes more \nand more difficult for people to understand and evaluate what the general \nopinion about a particular product in manual way since the number of \nreviews available increases. Hence, the automatic way is preferred. One of \nthe most popular techniques is using machine learning approach such as \nSupport Vector Machine (SVM). In this study, we explore the use of \nWord2Vec model as features in the SVM based sentiment analysis of product \nreviews in Indonesian language. The experiment result show that SVM can \nperforms well on the sentiment classification task using any model used. \nHowever, the Word2vec model has the lowest accuracy (only 0.70), \ncompared to other baseline method including Bag of Words model using \nBinary TF, Raw TF, and TF.IDF. This is because only small dataset used to \ntrain the Word2Vec model. Word2Vec need large examples to learn the word \nrepresentation and place similar words into closer position. \nKeywords: \nSentiment analysis \nSupport vector machine \nText classification \nWord embedding \nWord2Vec \nCopyright © 2019 Institute of Advanced Engineering and Science.  \nAll rights reserved. \nCorresponding Author: \nM. Ali Fauzi,  \nFaculty of Computer Science, Brawijaya University, \nJl. Veteran, Malang, Indonesia. \nEmail: moch.ali.fauzi@ub.ac.id \n \n \n1. INTRODUCTION  \nSince the rise of Web 2.0, the internet has become more user centric [1]. People are participating in \nmaking more and more content on the Internet through social media, discussion boards, Web forums, and \nblogs. Concurrently with such trends, an increasing number of websites where consumers can write and read \nreviews, and express their experiences, feeling, opinions, views, and complaints about various products and \nservices has emerged [2]. From a consumer behavior perspective, it can be called as one of the greatest \ndevelopments on the Internet. \nOnline platforms has become a source of greatly valuable information for both consumers and \nproducers. In making purchase decisions, consumers often seek advice and purchase recommendations from \nothers [3-4]. Previously, consumers commonly refer to advertisements in mass media to make this \ndecision [5]. However, with the growth of e-commerce and increasing number of online review platforms, \nonline reviews have become a reference for consumers they can rely on in finding information about the \nproduct to be purchased [6-7]. Consumers tend to learn how others like or dislike a product before buying. In \nfact, previous research found that consumers believe that online reviews provided by other users are more \ncredible and trustworthy than the traditional sources [8].  \nFor producer, online reviews can become a reference about what people think about their products \nor services to predict public acceptance level of their products. This information can help to forecast product \nsales. Furthermore, negative reviews can be the basis in product improvement and marketing strategies [9]. \n                ISSN: 2088-8708 \nInt J Elec & Comp Eng, Vol. 9, No. 1, February 2019 :  525 - 530 \n526\nTherefore, understanding such sentiment and opinion information has become more and more \nprominent for both producers and customers. However, it becomes more and more difficult for people to \nunderstand and evaluate what the general opinion about a particular product in manual way since the number \nof reviews available increases. Hence, the automatic way is preferred. \nSentiment analysis, also known as sentiment or polarity classification, is a work of analyzing \npeople’s opinion or sentiment from a piece of text - for example to decide whether the sentiment is positive \nor negative [10]. We can consider sentiment analysis as text classification problem with sentiment as its \nclasses.  Nevertheless, sentiment classification is more challenging than traditional topic-based classification \ndue to the necessity to extract more implicit information, instead of only keywords [11]. \nOne of the most popular techniques is using machine learning approach. In recent years, sentiment \nclassification using machine learning methods have been widely adopted and proven to provide supreme \nperformance [12-17]. Prior research conducted by [10] also showed that machine learning techniques have \nquite good performance with SVMs tend to do the best. Two key issues in machine learning approach are \nhow to extract complex features and finding out which kinds of features are more valuable [18]. Several \nfeature extraction methods have been proposed such as single words [19-20], n-grams [21-22], lexicon [23], \ntextual features [24], and many other new models [25-27]. However, semantic features have been \ninfrequently employed in this field. Semantic features can disclose the implicit semantic relationships \nbetween words, which is should be useful for improving the sentiment classification performance. \nWord embedding, also known as distributed word representation [28], is feature learning technique \nin Natural Language Processing (NLP) where words from the vocabulary are represented to low-dimensional \nvectors of real numbers [29]. By using word embedding, the semantic and syntactic information of words can \nbe captured from a large number of unlabeled corpora [30-31]. Word embedding have been employed in \nmany works in Natural Language Processing (NLP) to produce more effective word representations [32-36]. \nOne of the most popular example of word embedding is Word2Vec model.  Word2Vec [37] maps each words \nin the vocabulary into a dense vectors of real numbers using a shallow neural probabilistic language \nmodel [38]. By using Word2vec, words that similar will be close to each other in the embedding space [39]. \nIn this study, we will explore the use of Word2Vec model for sentiment analysis of product reviews \nin Indonesian language. Word2Vec will be used as feature representation. For the classification task, we will \nuse Support Vector Machine due its supreme performance. We will also explore the use of Bag of Word \n(BOW) model utilizing several term weighting methods including Term Frequency (TF) and Term \nFrequency-Inverse Document Frequency (TF.IDF). \n \n \n2. RESEARCH METHOD  \nThe general flowchart of the sentiment analysis system in this study is shown in Figure 1. There are \nthree main stages in this system i.e. preprocessing, building Word2Vec model and classification using SVM. \nEach review will be classified into positive or negative class. \n \n \n  \nFigure 1. System main flowchart \n\nInt J Elec & Comp Eng  ISSN: 2088-8708  \n \nWord2Vec model for sentiment analysis of product reviews in Indonesian language (M. Ali Fauzi) \n527\n2.1. Preprocessing \nPreprocessing is conducted before the main process begin. Some steps conducted in this stage \nincluding tokenization, case folding and cleaning [40-43]. In tokenization, each review is splitted into smaller \nunits called tokens or terms [44]. Case folding is a task of converting all of characters in review text become \nlowercase [45]. Meanwhile, in cleaning, characters outside of the alphabet such as punctuation, numbers, and \nhtml tag is omitted. In this study, stemming and filtering are not conducted because in some previous studies, \nstemming and filtering cannot improve sentiment analysis performance. \n \n2.2. Building Word2Vec model \nAfter the preprocessing stage was done, we build word vector representation using Word2Vec. First, \nthe Word2Vec model builds a vocabulary from training data. Then, it learns and determines the vector \nrepresentation of each words. There are two training algorithms in word2vec, i.e. continuous bag-of-words \n(CBOW) and skip-gram [46]. In this study, CBOW is employed. In CBOW, the word vector is built by \npredicting each word cooccurance based on its neighboring words. The resulting word vector will be \nemployed as the classification features. Word2Vec generally can help to improve classification performance \nbecause in Wor2Vec, the similar words have similar vectors. \n \n2.3. Sentiment classification using support vector model \nFinally, in the last stage, the reviews are classified into positive or negative class. In this study, \nsupport vector machines (SVMs) is used for the classification task. Despite its high computational \ncomplexity [47], SVM has become a popular algorithm in the last decade because of its excellent \nperformance in text classification field [48]. \nBased on the representation of training data in feature space, SVM finds a hyperplane that separates \nthe positive and negative data with maximum margin. Then, the testing data are then mapped into that same \nfeature space and predicted to belong to positive or negative category based on which side they fall. In this \nstudy, we use linear kernel because based on the work of Mc Callum and Nigam [49], linear SVM has the \nbest performance in text classification. The other benefit of linear kernel is that it is faster and require fewer \nparameters than other kernels in SVM. \n \n \n3. RESULTS AND ANALYSIS \nExperiment is conducted by using 772 product reviews extracted from FemaleDaily website. The \ntext reviews and their ratings were collected and labelled manually from the website \n(https://femaledaily.com/). There are 386 reviews labelled as positive and 386 reviews labelled as negative. \nAll of the reviews is in Indonesian language. Scikit-Learn [50] was used to implement the experiments. In the \nexperiments, we compared the results of sentiment classification using Word2Vec with the other methods \nincluding Bag of Words (BOW) using Binary TF, Raw TF, and TF.IDF. We use 10-fold cross validation, \nwhich means the product reviews dataset is equally divided into 10 folds. We iterate the experiment 10 times. \nIn each iteration, reviews from 9 folds were used as training data and the remaining one-fold was used as \ntesting data. Average accuracy was used as the evaluation method. Experiment results can be seen in \nFigure 2.  \nFigure 2 depict that sentiment analysis using SVM generally have good performance with average \nclassification accuracy value 0.81. The best result is obtained when using BOW features with TF.IDF by \naccuracy value 0.85. In the second place, BOW features with Binary TF have slightly diferent result with \naccuracy value 0.84. Meanwhile, BOW features with Raw TF comes in third place with accuracy value 0.83. \nSurprisingly, our proposed method has the lowest accuracy value, only 0.70. \n \n \n  \nFigure 2. Experiment results \n\n                ISSN: 2088-8708 \nInt J Elec & Comp Eng, Vol. 9, No. 1, February 2019 :  525 - 530 \n528\nThe dataset used in this experiment can be said as small dataset. In a small dataset, Word2Vec \ncannot capture the the semantic and syntactic information of words very well. When Word2Vec learn the \nword representation, each word starts at random position in the vector space. The words will be moved closer \ninto the position of words that similar to them gradually based on their neigbors in training data. If we have \nvery large dataset, all the words can be arranged so that all those pairwise similarities are simultaneously \nupheld because it have so many varied examples to gradually moved them all into better positions. \nOtherwise, in small dataset, there are very few examples where the words that sould be similar are neighbors \nin training data. With very few examples where there are shared nearby-words, there's few bases for moving \nthe all those pairwise similarities to the same position. Hence, Word2Vec cannot trained well using \nsmall dataset. \n \n \n4. CONCLUSION  \nIn this study, we used Word2Vec model to represent the features for product review sentiment \nclassification in Indonesian language. We used SVM for the classification method. We also compared the \nWor2Vec based classification performance with Bag of Words features using Binary TF, Raw TF, and \nTF.IDF. In general, SVM can performs well on the sentiment classification. However, the Word2vec model \nhave the lowest accuracy value than other method. This is because we only have small dataset to train the \nWord2Vec model. Word2Vec need large example to learn the word representation and place similar words \ninto closer position. Otherwise, in a small dataset, there too many examples to move the words into the \nbetter place. \nIn the future work, we can use larger dataset to build the Word2Vec model. This dataset does not \nneed to be labeled first as positive or negative. This dataset also does not need to be sentiment analysis \ndataset. We can use another dataset such as news, articles, wikipedia, and so on. \n \n \nREFERENCES  \n[1] Dang, Yan, Yulei Zhang, and Hsinchun Chen. \"A Lexicon-Enhanced Method for Sentiment Classification: An \nExperiment on Online Product Reviews.\" IEEE Intelligent Systems 25, no. 4: 46-53, 2010. \n[2] Bailey, Ainsworth Anthony. \"Thiscompanysucks.com: The Use of the Internet in Negative Consumer‐To‐\nConsumer Articulations.\" Journal of Marketing Communications 10, no. 3: 169-182, 2004. \n[3] Armstrong, Arthur, and John Hagel. \"The Real Value of Online Communities.\" Knowledge and communities 74, \nno. 3 (2000): 85-95, 2000. \n[4] West, Patricia M., and Susan M. Broniarczyk. \"Integrating Multiple Opinions: The Role of Aspiration Level on \nConsumer Response to Critic Consensus.\" Journal of Consumer Research25, no. 1: 38-51, 1998. \n[5] Tsang, Alex SL, and Gerard Prendergast. \"Is a “star” Worth a Thousand Words? The Interplay between Product-\nReview Texts and Rating Valences.\" European Journal of Marketing 43, no. 11/12, 1269-1280, 2009. \n[6] Hu, Nan, Indranil Bose, Noi Sian Koh, and Ling Liu. \"Manipulation of Online Reviews: An Analysis of Ratings, \nReadability, and Sentiments.\" Decision Support Systems 52, no. 3: 674-684, 2012. \n[7] Cui, Hang, Vibhu Mittal, and Mayur Datar. \"Comparative Experiments on Sentiment Classification for Online \nProduct Reviews.\" In AAAI, vol. 6, pp. 1265-1270. 2006. \n[8] Bickart, Barbara, and Robert M. Schindler. \"Internet Forums as Influential Sources of Consumer \nInformation.\" Journal of interactive marketing 15, no. 3: 31-40, 2001. \n[9] Basuroy, Suman, Subimal Chatterjee, and S. Abraham Ravid. \"How Critical Are Critical Reviews? The Box Office \nEffects of Film Critics, Star Power, and Budgets.\" Journal of marketing 67, no. 4: 103-117, 2003. \n[10] Pang, Bo, Lillian Lee, and Shivakumar Vaithyanathan. \"Thumbs up?: Sentiment Classification Using Machine \nLearning Techniques.\" In Proceedings of the ACL-02 conference on Empirical methods in natural language \nprocessing-Volume 10, pp. 79-86. Association for Computational Linguistics, 2002. \n[11] Liu, Bing. \"Sentiment Analysis and Subjectivity.\" Handbook of natural language processing 2: 627-666, 2010. \n[12] Zhang, Dongwen, Hua Xu, Zengcai Su, and Yunfeng Xu. \"Chinese Comments Sentiment Classification Based on \nWord2vec and SVM Perf.\" Expert Systems with Applications42, no. 4: 1857-1863, 2015. \n[13] Fauzi, M. Ali, and Tri Afirianto. \"Improving Sentiment Analysis of Short Informal Indonesian Product Reviews \nusing Synonym Based Feature Expansion.\" TELKOMNIKA (Telecommunication Computing Electronics and \nControl) 16, no. 2, 2018. \n[14] Rofiqoh, Umi, Rizal Setya Perdana, and M. Ali Fauzi. \"Sentiment Analysis of Indonesian Cellular \nTelecommunication Service Provider User Satisfaction Levels on Twitter with Supporting Vector Machine and \nLexicon Based Features (in Bahasa: Analisis Sentimen Tingkat Kepuasan Pengguna Penyedia Layanan \nTelekomunikasi Seluler Indonesia Pada Twitter Dengan Metode Support Vector Machine dan Lexicon Based \nFeatures.),\" Jurnal Pengembangan Teknologi Informasi dan Ilmu Komputer e-ISSN 2548: 964X. \n[15] Lestari, Agnes Rossi Trisna, Rizal Setya Perdana, and M. Ali Fauzi. \"Sentiment Analysis of DKI 2017 Regional \nHead Election Opinions on Indonesian Language Twitter Documents Using Näive Bayes and Emoji Weighting (in \nBahasa: Analisis Sentimen Tentang Opini Pilkada Dki 2017 Pada Dokumen Twitter Berbahasa Indonesia \nInt J Elec & Comp Eng  ISSN: 2088-8708  \n \nWord2Vec model for sentiment analysis of product reviews in Indonesian language (M. Ali Fauzi) \n529\nMenggunakan Näive Bayes dan Pembobotan Emoji),\" Jurnal Pengembangan Teknologi Informasi dan Ilmu \nKomputer e-ISSN 2548: 964X. \n[16] Nurjanah, Winda Estu, Rizal Setya Perdana, and Mochammad Ali Fauzi. \"Sentiment Analysis of Television Shows \nBased on Community Opinion on Twitter Social Media using the K-Nearest Neighbor Method and Weighting \nRetweet Number (in Bahasa: Analisis Sentimen Terhadap Tayangan Televisi Berdasarkan Opini Masyarakat pada \nMedia Sosial Twitter menggunakan Metode K-Nearest Neighbor dan Pembobotan Jumlah Retweet.)\" Jurnal \nPengembangan Teknologi Informasi dan Ilmu Komputer e-ISSN 2548: 964X. \n[17] Antinasari, Prananda, Rizal Setya Perdana, and M. Ali Fauzi. \"Sentiment Analysis of Film Opinion on Indonesian \nLanguage Twitter Documents Using Naive Bayes with Non-Standard Word Repair (in Bahasa: Analisis Sentimen \nTentang Opini Film Pada Dokumen Twitter Berbahasa Indonesia Menggunakan Naive Bayes Dengan Perbaikan \nKata Tidak Baku)\" Jurnal Pengembangan Teknologi Informasi dan Ilmu Komputer e-ISSN 2548: 964X. \n[18] Zhai, Zhongwu, Bing Liu, Hua Xu, and Peifa Jia. \"Clustering Product Features for Opinion Mining.\" \nIn Proceedings of the fourth ACM international conference on Web search and data mining, pp. 347-354. ACM, \n2011. \n[19] Fauzi, M.A., “Random Forest Approach for Sentiment Analysis in Indonesian Language,” Indonesian Journal of \nElectrical Engineering and Computer Science, 12(1), 2018. \n[20] Fauzi, M.A. and Yuniarti, A., “Ensemble Method for Indonesian Twitter Hate Speech Detection,” Indonesian \nJournal of Electrical Engineering and Computer Science, 11(1), 2018. \n[21] Ghiassi, Manoochehr, James Skinner, and David Zimbra. \"Twitter Brand Sentiment Analysis: A Hybrid System \nUsing N-Gram Analysis and Dynamic Artificial Neural Network.\" Expert Systems with applications 40, no. 16: \n6266-6282, 2013. \n[22] Prasanti, A.A., Fauzi, M.A. and Furqon, M.T., “Neighbor Weighted K-Nearest Neighbor for Sambat Online \nClassification,” Indonesian Journal of Electrical Engineering and Computer Science, 12(1), 2018. \n[23] Taboada, Maite, Julian Brooke, Milan Tofiloski, Kimberly Voll, and Manfred Stede. \"Lexicon-based Methods for \nSentiment Analysis.\" Computational linguistics 37, no. 2: 267-307, 2011. \n[24] Davidov, Dmitry, Oren Tsur, and Ari Rappoport. \"Enhanced Sentiment Learning Using Twitter Hashtags and \nSmileys.\" In Proceedings of the 23rd international conference on computational linguistics: posters, pp. 241-249. \nAssociation for Computational Linguistics, 2010. \n[25] Agarwal, Basant, Soujanya Poria, Namita Mittal, Alexander Gelbukh, and Amir Hussain. \"Concept-level Sentiment \nAnalysis With Dependency-Based Semantic Parsing: A Novel Approach.\" Cognitive Computation 7, no. 4: 487-\n499, 2015. \n[26] Lizhen, Liu, Song Wei, Wang Hanshi, Li Chuchu, and Lu Jingli. \"A Novel Feature-Based Method for Sentiment \nAnalysis of Chinese Product Reviews.\" China communications 11, no. 3: 154-164, 2014. \n[27] Singh, Vivek Kumar, Rajesh Piryani, Ashraf Uddin, and Pranav Waila. \"Sentiment Analysis of Movie Reviews: A \nNew Feature-Based Heuristic for Aspect-Level Sentiment Classification.\" In Automation, computing, \ncommunication, control and compressed sensing (iMac4s), 2013 international multi-conference on, pp. 712-717. \nIEEE, 2013. \n[28] Turian, Joseph, Lev Ratinov, and Yoshua Bengio. \"Word Representations: A Simple and General Method for Semi-\nSupervised Learning.\" In Proceedings of the 48th annual meeting of the association for computational linguistics, \npp. 384-394. Association for Computational Linguistics, 2010. \n[29] Seok, Miran, Hye-Jeong Song, Chan-Young Park, Jong-Dae Kim, and Yu-seop Kim. \"Named Entity Recognition \nUsing Word Embedding As a Feature.\" International Journal of Software Engineering and Its Applications 10, no. \n2: 93-104, 2016. \n[30] Lai, Siwei, Kang Liu, Shizhu He, and Jun Zhao. \"How to Generate a Good Word Embedding.\" IEEE Intelligent \nSystems31, no. 6: 5-14, 2016. \n[31] Mikolov, Tomas, Wen-tau Yih, and Geoffrey Zweig. \"Linguistic Regularities in Continuous Space Word \nRepresentations.\" In hlt-Naacl, vol. 13, pp. 746-751. 2013. \n[32] Xue, Bai, Chen Fu, and Zhan Shaobin. \"A Study on Sentiment Computing and Classification of Sina Weibo with \nword2vec.\" In Big Data (BigData Congress), 2014 IEEE International Congress on, pp. 358-363. IEEE, 2014. \n[33] Lilleberg, Joseph, Yun Zhu, and Yanqing Zhang. \"Support Vector Machines and Word2vec for Text Classification \nwith Semantic Features.\" In Cognitive Informatics & Cognitive Computing (ICCI* CC), 2015 IEEE 14th \nInternational Conference on, pp. 136-140. IEEE, 2015. \n[34] Joshi, Aditya, Vaibhav Tripathi, Kevin Patel, Pushpak Bhattacharyya, and Mark Carman. \"Are Word Embedding-\nbased Features Useful for Sarcasm Detection?.\" arXiv preprint arXiv:1610.00883, 2016. \n[35] Sienčnik, Scharolta Katharina. \"Adapting word2vec to Named Entity Recognition.\" In Proceedings of the 20th \nNordic Conference of Computational Linguistics, NODALIDA 2015, May 11-13, 2015, Vilnius, Lithuania, no. 109, \npp. 239-243. Linköping University Electronic Press, 2015. \n[36] Liu, Haixia. \"Sentiment Analysis of Citations Using Word2vec.\" arXiv preprint arXiv:1704.00177 (2017). \n[37] Mikolov, Tomas, Ilya Sutskever, Kai Chen, Greg S. Corrado, and Jeff Dean. \"Distributed Representations of Words \nand Phrases and Their Compositionality.\" In Advances in neural information processing systems, pp. 3111-3119. \n2013. \n[38] Yang, Xiao, Craig Macdonald, and Iadh Ounis. \"Using Word Embeddings In Twitter Election \nClassification.\" arXiv preprint arXiv:1606.07006, 2016. \n[39] Bengio, Yoshua, Réjean Ducharme, Pascal Vincent, and Christian Jauvin. \"A Neural Probabilistic Language \nModel.\" Journal of machine learning research 3, no. Feb (2003): 1137-1155, 2003. \n                ISSN: 2088-8708 \nInt J Elec & Comp Eng, Vol. 9, No. 1, February 2019 :  525 - 530 \n530\n[40] Fauzi, M. Ali, Agus Zainal Arifin, and Sonny Christiano Gosaria. \"Indonesian News Classification Using Naïve \nBayes and Two-Phase Feature Selection Model.\" Indonesian Journal of Electrical Engineering and Computer \nScience 8, no. 3, 2017. \n[41] Suharno, Claudio Fresta, M. Ali Fauzi, and Rizal Setya Perdana. \"Indonesian Language Classification on Sambat \nOnline Complaint Documents Using the K-Nearest Neighbors And Chi-Square Method (in Bahasa: Klasifikasi \nTeks Bahasa Indonesia Pada Dokumen Pengaduan Sambat Online Menggunakan Metode K-Nearest Neighbors Dan \nChi-Square.)\" Systemic: Information System and Informatics Journal 3, no. 1: 25-32, 2017. \n[42] Fauzi, M. Ali, Agus Zainal Arifin, and Anny Yuniarti. \"Arabic Book Retrieval using Class and Book Index Based \nTerm Weighting.\" International Journal of Electrical and Computer Engineering (IJECE) 7, no. 6: 3705-3710, \n2017. \n[43] Fauzi, M. Ali, Djoko Cahyo Utomo, Eko Sakti Pramukantoro, and Budi Darma Setiawan. \"Automatic Essay \nScoring System Using N-Gram And Cosine Similarity For Gamification Based E-Learning.\" \n[44] Pramukantoro, Eko Sakti, and M. Ali Fauzi. \"Comparative Analysis of String Similarity and Corpus-Based \nSimilarity for Automatic Essay Scoring System on E-Learning Gamification.\" In Advanced Computer Science and \nInformation Systems (ICACSIS), 2016 International Conference on, pp. 149-155. IEEE, 2016. \n[45] Fauzi, M. Ali, Agus Arifin, and Anny Yuniarti. \"Term Weighting Based on Index of Books and Classes for \nRanking of Arabic Documents (in Bahasa: Term Weighting Berbasis Indeks Buku dan Kelas untuk Perangkingan \nDokumen Berbahasa Arab.)\" Lontar Komputer: Jurnal Ilmiah Teknologi Informasi 5, no. 2, 2013. \n[46] Mikolov T, Chen K, Corrado G, Dean J. Efficient Estimation Of Word Representations In Vector Space. arXiv \nPreprint arXiv:1301.3781. 2013 Jan 16. \n[47] Burges, Christopher JC. \"A Tutorial on Support Vector Machines for Pattern Recognition.\" Data mining and \nknowledge discovery 2, no. 2: 121-167, 1998. \n[48] Liu, Bing. Web data mining: exploring hyperlinks, contents, and usage data. Springer Science & Business Media, \n2007. \n[49] McCallum, Andrew, and Kamal Nigam. \"A Comparison of Event Models for Naive Bayes Text Classification.\" \nIn AAAI-98 workshop on learning for text categorization, vol. 752, no. 1, pp. 41-48. 1998. \n[50] Pedregosa F, Varoquaux G, Gramfort A, Michel V, Thirion B, Grisel O, Blondel M, Prettenhofer P, Weiss R, \nDubourg V, Vanderplas J. “Scikit-learn: Machine Learning in Python.” Journal of Machine Learning Research. \n2011;12(Oct):2825-30, 2011. \n \n \nBIOGRAPHY OF AUTHOR \n \n \nM. Ali Fauzi, male, is a lecturer in Faculty of Computer Science, Universitas Brawijaya. His \nresearch interest is Text Mining and Natural Language Processing  \n \n \n",
  "topic": "Word2vec",
  "concepts": [
    {
      "name": "Word2vec",
      "score": 0.9715840816497803
    },
    {
      "name": "Sentiment analysis",
      "score": 0.7857863903045654
    },
    {
      "name": "Computer science",
      "score": 0.7754311561584473
    },
    {
      "name": "Support vector machine",
      "score": 0.6930007934570312
    },
    {
      "name": "Product (mathematics)",
      "score": 0.6239838600158691
    },
    {
      "name": "Artificial intelligence",
      "score": 0.5485596656799316
    },
    {
      "name": "Machine learning",
      "score": 0.46647483110427856
    },
    {
      "name": "Word (group theory)",
      "score": 0.4344315528869629
    },
    {
      "name": "Indonesian",
      "score": 0.4244404137134552
    },
    {
      "name": "Natural language processing",
      "score": 0.38297832012176514
    },
    {
      "name": "Mathematics",
      "score": 0.08951404690742493
    },
    {
      "name": "Embedding",
      "score": 0.0
    },
    {
      "name": "Philosophy",
      "score": 0.0
    },
    {
      "name": "Linguistics",
      "score": 0.0
    },
    {
      "name": "Geometry",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I177055848",
      "name": "University of Brawijaya",
      "country": "ID"
    }
  ],
  "cited_by": 74
}