{
  "title": "Enhancing the effectiveness of calculation of parameters for short circuit of threephase transformers using field simulation methods",
  "url": "https://openalex.org/W2896633955",
  "year": 2018,
  "authors": [
    {
      "id": "https://openalex.org/A5013888699",
      "name": "D. S. Yarymbash",
      "affiliations": [
        "National University Zaporizhzhia Polytechnic"
      ]
    },
    {
      "id": "https://openalex.org/A5028622237",
      "name": "S. T. Yarymbash",
      "affiliations": [
        "National University Zaporizhzhia Polytechnic"
      ]
    },
    {
      "id": "https://openalex.org/A5081805215",
      "name": "M. Kotsur",
      "affiliations": [
        "National University Zaporizhzhia Polytechnic"
      ]
    },
    {
      "id": "https://openalex.org/A5082248333",
      "name": "T. E. Divchuk",
      "affiliations": [
        "National University Zaporizhzhia Polytechnic"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4248474687",
    "https://openalex.org/W4236872095",
    "https://openalex.org/W2797162552",
    "https://openalex.org/W2167913033",
    "https://openalex.org/W2127566146",
    "https://openalex.org/W1980074048",
    "https://openalex.org/W2737977871",
    "https://openalex.org/W2782653256",
    "https://openalex.org/W2809072439",
    "https://openalex.org/W2046242732",
    "https://openalex.org/W2774106137",
    "https://openalex.org/W2753927822",
    "https://openalex.org/W2784031231",
    "https://openalex.org/W2797752822",
    "https://openalex.org/W2111215387",
    "https://openalex.org/W2073937806",
    "https://openalex.org/W1965432615",
    "https://openalex.org/W4242611972",
    "https://openalex.org/W2612902074",
    "https://openalex.org/W2810254842",
    "https://openalex.org/W1829564559",
    "https://openalex.org/W2652965813",
    "https://openalex.org/W2546764600",
    "https://openalex.org/W2017683372",
    "https://openalex.org/W2741889495",
    "https://openalex.org/W579558559"
  ],
  "abstract": "We conducted theoretical research into electromagnetic processes when testing power transformers under the mode of the test short circuit based on a three-dimensional model of the magnetic field in the frequency statement. Reliability and accuracy of determining the parameters for the test short circuit of the power transformer for frequency-domain statements were substantiated with the use of verification of the data of calculation of frequency-domain and time dependent models of the magnetic field for frequency statements. The main regularities of the magnetic field distribution in the volume of the active part of the transformer were determined. In the magnetic field localization zones, 3D intensity distribution is uniform and is determined by the 2D distribution in the horizontal cross section of the active part in the middle of the phase windings height. The values of the axial component of the magnetic field intensity approach 96–97 % of the intensity vector module. An effective approach to field modeling was implemented based on decomposition of the computational domain into spatial zones. Each calculation zone is put in compliance with an electrical circuit of the substitution scheme. Distribution of electric potentials in the horizontal cross-sections of the conductors between the coils or between the turns of windings was accepted as uniform. The superposition of magnetic fields in spatial zones was implemented by means of dynamic synthesis by the criteria of minimal current error for electric circuits of the substitution scheme. The decomposition of the 3D area of field simulation area into the central and end zones is implemented at a distance of 10–15 % of the height of the phase windings, which ensures high accuracy of the magnetic field calculation with the error not exceeding 1.62 %. Time consumption for field simulation of electromagnetic processes under the mode of the test short circuit decreased by 5 times and requirements for the capacity of computing hardware resources decreased by 4 times. High accuracy of identification of parameters of the test short circuit of three-phase transformers was proved by comparing the calculation data to the results of tests at the private company \"Eltiz\" (Zaporizhzhia, Ukraine). Calculation errors do not exceed 1.42 % for active losses and 1.39 % for short circuit voltage. The proposed approach with the use of the methods of decomposition and of dynamic synthesis makes it possible to significantly improve the effectiveness of the preliminary stage of design preparation of production and can be used for solving the problems of design solutions optimization",
  "full_text": "Eastern-European Journal of Enterprise Technologies  ISSN 1729-3774 4/5 ( 94 ) 2018\n22\n D. Yarymbash, S. Yarymbash, M. Kotsur, T. Divchuk, 2018\n1. Introduction\nPower transformers are some of the most common elec -\ntrical devices that play a major role in the transportation of \nelectricity from the place of its generation to its users. The es-\ntablished capacity of power transformers can by order of mag-\nnitude exceed the capacity of electricity generation, the trans-\nformation multiplicity of which can be equal to 7–8 [1, 2].  \nThat is why there are high requirements to technical and \neconomic indicators and reliability of power transformers \nthat must be provided even at the stage of design preparation \nof production [3].\nUnder the steady operating modes of power systems and \ndistribution networks, the main effect of transformer equip -\nment is determined by the parameters of the replacement \nscheme for the test short circuit (SC) [3–5]. Resistances of \nSC are calculated according by specifications of the trans -\nformer for voltage and short circuit losses [1, 2].\nEngineering design techniques based on the methods for \nresearching linear systems fragmentally take into consider -\nation design features of the active part of power transformer \nand its other structural elements [1, 2]. This can lead to a dis-\ntortion of real processes of electromagnetic conversion of AC \nenergy in power transformers [4, 5]. Therefore, the accuracy \nENHANCING THE \nEFFECTIVENESS OF \nCALCULATION OF \nPARAMETERS FOR \nSHORT CIRCUIT \nOF THREE-PHASE \nTRANSFORMERS \nUSING FIELD \nSIMULATION \nMETHODS\nD. Yarymbash\nDoctor\tof\tTechnical\tSciences,\t\t\nAssociate\tProfessor*\nE-mail:\tyarymbash@gmail.com\nS. Yarymbash\nPhD,\tAssociate\tProfessor*\nE-mail:\tkstj06@gmail.com\nM. Kotsur\nPhD,\tAssociate\tProfessor\nDepartment\tof\telectrical\tand\t\t\nelectronic\tapparatuses**\nE-mail:\tkotsur8@gmail.com\nT. Divchuk\nSenior\tLecturer\nDepartment\tof\telectrical\tmachines**\nE-mail:\tDIV2009@i.ua\n*Department\tof\telectrical\tmachines**\n**Zaporizhzhya\tNational\tTechnical\tUniversity\nZhukovskoho\tstr.,\t64,\t\t\nZaporizhzhya,\tUkraine,\t69063\nПроведено теоретичні дослідження електромагнітних про-\nцесів при випробуваннях силових трансформаторів в режимі \nдослідного короткого замикання на основі чисельної реалізації \nтривимірної моделі магнітного поля у частотному формулю-\nванні. Шляхом верифікації даних розрахунків частотних і змін-\nних у часі моделей магнітного поля обґрунтовано достовірність \nі точність визначення параметрів дослідного короткого зами-\nкання силового трансформатора у частотному формулюван-\nні. Визначено основні закономірності розподілу магнітного поля \nв об'ємі активної частини трансформатора. В зонах локаліза-\nції магнітного поля 3D розподіл напруженості є рівномірним і \nвизначається 2D розподілом у горизонтальному перерізі актив-\nної частини на середині висоти фазних обмоток. Значення осьо-\nвої компоненти напруженості магнітного поля наближають-\nся до 96–97 % від модуля вектора напруженості. Реалізовано \nефективний підхід до польового моделювання на основі деком-\nпозиції розрахункової області на просторові зони. Кожній роз-\nрахунковій зоні поставлено у відповідність електричний контур \nсхеми заміщення. Розподіл електричних потенціалів у горизон-\nтальних перерізах провідників між котушками або між витка-\nми обмоток прийнято рівномірним. Суперпозицію магнітних \nполів у просторових зонах здійснено засобами динамічного син-\nтезу за критеріями мінімальної струмової похибки для елек -\nтричних контурів схеми заміщення. Декомпозиція 3D області \nпольового моделювання на центральну і торцеві зони здійсню-\nється на відстані 10–15 % висоти фазних обмоток, що забез-\nпечує високу точність розрахунку напруженості магнітного \nполя із похибкою не більше 1,62 %. Витрати часу для польово-\nго моделювання електромагнітних процесів у режимі дослідно-\nго короткого замикання зменшено у 5 раз, а вимоги до потуж-\nності обчислювальних апаратних ресурсів знижено у 4 рази. \nВисоку точність ідентифікації параметрів дослідного корот-\nкого замикання трифазних трансформаторів підтвердже -\nно порівнянням даних розрахунків із результатами випробу -\nвань в умовах приватного підприємства «Елтіз» (Запоріжжя, \nУкраїна). Похибки розрахунків не перевищують 1,42 % для \nактивних втрат і 1,39 % для напруги короткого замикання. \nЗапропонований підхід із використанням методів декомпозиції \nта динамічного синтезу дозволяє значно підвищити ефектив-\nність попереднього етапу конструкторської підготовки вироб-\nництва і може бути використаний при реалізації задач оптимі-\nзації конструктивних рішень\nКлючові слова: електромагнітне поле, трифазний тран -\nсформатор, дослідне коротке замикання, декомпозиція, дина-\nмічний синтез\nUDC 621.314.21\nDOI: 10.15587/1729-4061.2018.140236\nApplied physics\n23\nof the design calculations of specifications of short circuit of \nthe transformer is low, and permissible errors can approximate \n10–15 % [3]. This causes the relevance of development of \nhigh-precision and high-performance methods for calculation \nof the transformer parameters in the mode of the studied SC.\n2. Literature review and problem statement\nTo determine the parameters and characteristics of pow -\ner transformers, the schematic models based on the theory \nof electric and magnetic circuits are normally used [6, 7]. \nComparative simplicity of the algorithms of computer imple-\nmentation caused the use of schematic models in engineering \ncalculations at the stage of design preparation of production  \n[4, 5]. However, a number of assumptions and simplifications, \nwhich laid the basis of schematic models, lead to deviations \nfrom the actual electromagnetic processes of energy con -\nversion of AC during its transformations [8, 9]. Simplified \ndescriptions of surface effects, nonlinear properties of active \nand structural materials [10], disregarding the peculiarities \nof a multi-component spatial structure of the active part of \ntransformers [11] can lead to significant calculation errors \n[12–14]. It imposes a limitation to the application of these \nmethods for calculation of currents, voltage and electrical re-\nsistance under the dynamic conditions of short circuit with \nthe shock electro-dynamic efforts and thermal loads [15, 16].\nIt is possible to take into consideration the influence of \nstructural factors on parameters of a short circuit of power \ntransformers more completely, using field simulation [17–19]. \n3D field simulation can ensure high accuracy in determining \nthe parameters of power transformers. However, its computer \nimplementation, based on the methods of finite elements in \nmulti-component areas of the active part with non-linear elec-\ntro-physical properties, is complicated by great consumption \nof time and requirements for computational resources [17]. \nPaper [20, 21] proposed the 3D model of electromagnetic pro-\ncesses to determine electrical and electro-power parameters of \nelectro-technical systems of the AC transformation. However, \nits application is limited only to systems that have linear mag-\nnetic properties of materials. In papers [22–24], it is proposed \nto use the differentiation of dimensions of finite elements \nand approximation by Lagrange first order polynomials for \neffective numerous implementations of the field models. The \napplication of this approach to power transformers is compli-\ncated by the significant nonlinearity of magnetic properties \nand the difference of geometric dimensions of separate ele -\nments [25–27]. Some authors try to introduce simplifications \ninto the geometric model [28, 29], neglect nonlinearity of the \nmagnetic properties of materials [24] or to apply 2D models \n[30, 31]. These assumptions and simplifications decrease the \naccuracy of results of simulation and in some cases can distort \na real picture of electromagnetic processes. The field calcula-\ntion model of the power transformer in the mode of the studied \nshort circuit should in detail display the multi-component \nstructure of the active part and take into consideration the \nnonlinearity of electro-physical and magnetic properties of \nthe active materials. The effectiveness of the numerical imple-\nmentation of the field model must meet the requirements of \nthe problems of design parameters optimization. This causes \nthe need for development of specific approaches that improve \nthe computation accuracy and efficiency and ensure adapta -\ntion of 3D-field simulation to the tasks of optimum design of \npower transformers.\n3. The aim and objectives of the study\nThe aim of this study is to develop an effective approach \nto field simulation of the electromagnetic processes of the \nthree-phase transformer through the decomposition of the \n3D area of the active parts into sub-areas for the synthesis \nof parameters of the corresponding electric circuits in SC \nparameters with high precision.\nTo accomplish the aim, the following tasks have been set:\n– to determine mathematical statement of the AC field \nmodel that reflects the features of electromagnetic energy con-\nversion in the mode of the studied SC of the power transformer \nwith the multicomponent active part of a complex structure; \n– to determine parameters of decomposition of the cal -\nculation region of the active parts of the transformer in the \nspatial zones of the reduced volume in order to reduce the \nnumber of finite elements, to ensure the accuracy and effec -\ntiveness of the computation processes; \n– to develop the method of synthesis of field zones into \nthe electric circuit by the criterion of current error minimi -\nzation for the refined determining of SC parameters.\n4. Statement of the mathematical model of \nelectromagnetic processes in the transformer for the \nmode of the studied short circuit\nThe 3D area of the field simulation of electromagnetic \nprocesses in the power transformer includes the active part, \nwhich is placed in the tank – 6 (Fig. 1, a). The active part \nconsists of the systems of windings, the magnetic system, the \nsystems of longitudinal and main electric insulation. The sys-\ntem of windings consists of the main and adjusted windings \non the high voltage side (HV) – 1 and the winding on the low \nvoltage side (LV) – 2 with coils, turns, layers, etc. [33]. In the \ncharged magnetic system of the transformer – 3, one distin -\nguishes limbs and yokes that are brought together by yoke \nbeams. The system of electric insulation of the transformer \nconsists of solid insulation from electric cardboard – 4, paper \nelectric insulation and transformation oil – 5 (Fig. 1, a).\n \n \n \n \n \n \n \n \n \n \n \n \n \nа                                   b  \n \n \n \n \n \n \nc                                    d \t\nFig.\t1.\tThree-phase\tpower\ttransformer:\tа\t–\tcalculation;\t\nb,\tc,\td\t–\tupper,\tcentral\tand\tlower\tdecomposition\tzones\n  \n \n  \n \n\nEastern-European Journal of Enterprise Technologies  ISSN 1729-3774 4/5 ( 94 ) 2018\n24\nAccording to data from [17], electro-physical processes \nin dielectric materials can be considered similar to the pro -\ncesses of electrical conductivity in materials with relatively \nlow electrical conductivity. That is why electromagnetic \nfields in the calculation region Ω (Fig. 1, a) can be described \nby Maxwell equations in frequency statements [20, 21]:\n( ) ( )( )\n( ) ( )( )\n1\n0э ;\n, \nj j jj j j\njj j jj j\njV\nVj\n− ∇× m m ∇× =−σ θ ω +∇ \n∇⋅ σ θ ⋅∇⋅ = − ω⋅∇⋅ σ θ ⋅\nAA\nA\n  (1)\nwith potentiality conditions [20]:\n( ){ ( ); ,=− =E grad B rot Aj jj V   (2)\nrelationships of form [20]:\n( ) ( ){\n1\n0 ; ,\njj j j j j jj j e\n−\n= mm =σ θ +H B BJ E J       (3)\nwhere A, V are the vector and magnetic potentials, B is the \ninduction of the magnetic field, E, H are the voltages of elec-\ntric and magnetic fields, J is the density of current, σ(θ) is the \ntemperature dependence of specific electric conductivity, θ is \nthe temperature, μ0 is the magnetic permeability of vacuum, \nμ(|B|) is the equivalent relative magnetic permeability, ω is \nthe angular frequency. \nThe system of the field equations (1) is supplemented by \nconditions of combination of magnetic and electric fields on \nthe boundaries of the cells with different electro-physical \nproperties [21]:\n \n( ) ( ){ 0; 0,+ − +−× − = ⋅−=n H H nJ J   (4)\nand homogeneous boundary conditions at the external \nsurface of the tank [26] or impedance conditions [32] at its \ninternal side.\nFor calculation region Ω, the temperature mode of the \npower transformer is accepted as stationary. The tempera -\ntures of the elements of the active parts are determined by \nthe project or by the data, which are admissible for heating \nresistance A [1]. The anisotropy of magnetic properties of \ncold rolled electro-technical steel was taken into account \naccording to [25]. \nFor the elements of the power transformer in the 3D \nfield Ω, densities of currents, active losses (for electrically \nconductive materials) and energy of the magnetic field are \ncalculated [20]:\n( ) ( )\n( )\n( )( )\n*\n0\n1*\n1 , ddd;4\n, ddd;  \n,\nj\nj\nj\njjj\nV\njjj\nV\njj j j\nW xyz\nP xyz\nVj\n−\n = mm\n\n =σ ⋅\n\n\n= −σ ⋅ + ω\n\n∫∫∫\n∫∫∫\njjHB B\nJJ\nJ grad A\n \n\n \n (5)\nas well as currents in the phase windings of HV and LL.\nPhase high-voltage windings are attached to the three-\nphase power supply source by scheme Y, and low-voltage \nwindings, connected by scheme A, are shunted by branches \nwith small active resistance. The restrictions for the power \nsource of test voltage are taken into account using linear \nresistances between this source and the windings of the \ntransformer. This will not lead to any significant increase \nin current error provided that these resistances are by \nseveral orders of magnitude lower than resistance of SC, \ndetermined by specifications. Under the mode of the studied \nSC, currents in the windings are equal to the rated values, \nin accordance with the phase voltage at the HV side { }k ,DU  \n1 ,2 ,3k = :\nk , 1 ,2 ,3 ;\n0 , 4 ,5 ,6 .\nk kk\nk kk\nj IR k\nj IR k\nD = − ωΨ + ⋅ = = − ωΨ + ⋅ =\nU \n   (6)\nComputer implementation of the field model (1) to (4) \nis carried out in the structure of the specialized software \nof field simulation COMSOL Multiphysics [33]. 3D area \nis divided into three-dimensional finite elements – tetra -\nhedrons with edges, which are approximated by Lagrange \nsecond order polynomials. To increase effectiveness of the \nnumerical implementation of the model, differentiation of \ndimensions of finite elements is performed. In sub-regions \nwith distinctly pronounced nonlinearity of magnetic prop -\nerties and localization of magnetic field, dimensions of finite \nelement decrease and increase near the outer boundary of \nthe calculation region.\n5. Results of the study of magnetic fields of the \ntransformer under the mode of test short circuit. \nStatement of criteria for the decomposition of active part \nand the synthesis of electric circuits of field zones\nField simulation of electromagnetic fields in the area of \nthe active part was carried out for the three-phase power \ntransformer of voltage class of 35 kV and power of 1,600 kWA. \nThe windings are connected by Y/Y0–0 circuit. Rated values \nof linear voltages on the side of HV and LV were 20 kV and  \n0.4 kV. For the mode of the test CS, the amplitudes of phase \nvoltages were determined by specified value of SC voltage, \nwhich amounted to 6.5 % of the rated phase voltage from the \nHV side of the transformer. The symmetric three-phase sys -\ntem of electrical voltages with the phase shift vector [0; 2 π/3; \n4 π/3] for frequency of 50 Hz of AC was used.\nThe results of 3D simulation are represented by distri -\nbutions of voltage of the magnetic field and its axial compo -\nnents in vertical and horizontal cross sections of the active \npart of the power transformer (Fig. 2, a).\nAccording to field calculations, it was determined that \nfor the mode of the test SC the localization of the magnetic \nfield occurs in the phase windings systems. In the deter -\nmined localization areas, directions and module of vectors \nof magnetic field intensity almost never change. The biggest \ncomponent is the projection of Hz, the value of which is  \n96–97 % of the module of magnetic intensity vector. This al-\nlows us to consider that the 3D distribution of the magnetic \nfield intensity in the area of its localization is determined by \nthe 2D distribution in the horizontal plane of cross section \nof the active part. The change in electrical potentials on the \nsurface of horizontal cross-sections of the conductors be -\ntween the coils or between the turns of the windings can be \nneglected and we can accept the assumption of the uniform \ndistribution of electrical potentials.\nThe features of the magnetic fields distribution allow ap -\nplying for calculation region Ω the principle of superposition \nof electromagnetic fields, calculated separately in the central \n(Fig. 1, c) and end zones (Fig. 1, b, d). \nApplied physics\n25\nTo reduce the number of finite elements and dimension -\nality of equations of the finite element model, it is advisable \nto apply the distribution of the active part structure into the \nsubsystems with separate operating elements or components \n[33]. This will significantly reduce the number of functional \nrelations between the parameters of each subsystem and the \nnumber of independently varied parameters to minimize \ncurrent errors for phase currents of the studied SC.\nа\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t b\t\nFig.\t2.\tMagnetic\tfield\tof\tthe\tactive\tpart\tof\tthe\tpower\t\ntransformer:\ta\t–\tamplitudes\tof\tmagnetic\tfield\tintensity;\t\t\nb –\tamplitudes\tof\tthe\tprojection\tof\tmagnetic\tfield\tintensity\t\nonto\tthe\tvertical\taxis\tof\tthe\ttransformer\nDecomposition of the calculation region Ω implies the \ndivision into several calculation areas, each of which can \nbe put in conformity with the circuits of the replacement \nscheme. These areas are separated from each other by hor -\nizontal cross sections that are perpendicular to axis 0z and \npass through the axial insulating channels between the \ncoils or between the turns of the windings. The distance of \nhorizontal cross-sections from the upper and lower ends is  \n10–15 % of the height of the windings.\nThe central area includes the central part of phase wind -\nings of HV, LV and limbs, main insulation, transformer oil and \nthe central part of the tank (Fig. 1, c). The end zones include \nthe upper or the lower part of the tank, the upper or the lower \nyokes, relevant parts of HV, LV windings and limbs of differ-\nent phases, solid insulation and transformer oil (Fig. 1, b, d). \nDivision of the field of simulation Ω into the zones ensures a re-\nduction of time of implementation of the field models due to the \nfewer number of finite elements in the zones of smaller volume. \nIt is possible to display the volume of the region of \nelectromagnetic energy conversion Ω by the sum of the vol-\numes of zones and to determine electrical losses and mag-\nnetic energy by the sum of values in the respective areas. \nFor the synthesis of electric circuits on the boundar-\nies of connection of the areas of phase windings, we ac -\ncept the conditions of the equality of electric potentials:\n{ ,1 ,1\n1 ,, 1const , ,\nji ji\nj,i j,i j i i j j,i j,iVV U VV\n++\n++ ΓΓ\n= = D =−   (7)\nfor which system of equations (6) will take the form:\n{ } { }\n( )\n,k\n1,2,3 4,5,6\nk,i , , ,\n,0 ,\n, 1, 6 ,\nВН i, j ikkii kk\nki ki kij I Rk\n==\nD =D =D\n\nD = − ωΨ + ⋅ ∈\n∑∑UU U\nU\n \n \n  (8)\nwhere { }k,iDU  is the voltage drop in the sections of phase \nwindings; i is the number of sequential branches in the cir -\ncuit of the phase winding, indices ( )1 ,2,3k ∈  belong to the \nHV windings of A, B, C phases, indices ( )4,5,6k ∈  belong to \nLV windings of A, B, C phases, respectively.\nIn conditions (7), each value of const is “free”. That is why \na voltage drop in the section of phase windings { } ( )k 1.6i, j ∈\nDU    \ncannot be assigned in advance and should be determined \nfrom the solution of the problem of current errors minimiza -\ntion. For the synthesis of electric circuits and superposition \nof magnetic fields, in the calculation region, it is possible \nto state objective function with the components that are \ndetermined by the sum of the squares of current errors for \ncurrents in the sections of windings:\n( )( ) ( )( )\n6\n22\n1\n26\n,\n1\nmin min\nmin .\nk\nk\nik k\nki j\nMM\n=\n=\n ==\n =−  \n∑\n∑∑\nD,R D,R\nII\n  (9)\nIn the general case, component of the vector of objective \nfunction M2(D,R)k is the function of vectors of independent-\nly varying D and dependent R parameters for each winding \nof the transformer. A voltage drop on the section of the cir -\ncuit of the winding is considered as projections of the vector, \nirrespective varying parameters D. This makes it possible to \nconvert the components of objective function M2(D,R)k into \ncomponents of function 2( ).D\nkM\nTo implement conditions (9), it is advisable to apply the \nmethod of dynamic programming [34]. The vector of optimi-\nzation parameters with components \n{ } ( ) ( )i i 1,3 ,k 1,6∈∈\n=DDU   \ncan be represented as the sum of vectors of initial approxi -\nmation \n{ } ( )0 0, k 1,6i ∈\n=DDU   \nand its specification \n{ } ( )1, k 1,6\n.i k ∈\nδ = δDDU \n That is why optimality conditions (9) can be put in con-\nformity with the system of recurrent equations of Bellman \n[9] for each winding of the transformer:\nRelations (9), (10) determine the conditions for dynamic \nconnections of “free” parameters in equations (7) for the \ncentral and end 3D zones of region Ω. The iteration calcu -\nlation process of the method of dynamic programming is \nimplemented in the assigned limits for current εI≤0.1 % and \nangular errors εφ≤0.5 %.\nFor the mode of the studied SC, we applied the conditions \nthat the sum of instantaneous values of voltage drop in the \ncircuits of the parts of phase windings of each decomposition \nzone must be equal to instantaneous values of SC voltage for \n   \n \n( )\n( ) ( )( )\n( )\n11\n2\n0,k\n22\n0, 1, 1, ,\n1,6\nmin\n. (10)\nmin min\nmm\nk k m k mk\nk\nM\nMM\nΣ\n−δδ ∈\n D =Φ = = D δ +D δ  DD\nD\nD ,D D ,D\n\n\nEastern-European Journal of Enterprise Technologies  ISSN 1729-3774 4/5 ( 94 ) 2018\n26\neach phase. Spatial distribution of magnetic field intensity in \nsub-areas of the upper – I, central – II and lower – III zone \nof the decomposition was compared with the distribution of \nintensity in the 3D area of the active part (Fig. 3). For the \ndecomposition method, the largest deviations of calculations \nof magnetic field intensity are characteristic of horizontal \nsurfaces of the areas that cross windings (Fig. 3). However, \nthe maximum value did not exceed 1.62 %.\nFig.\t3.\tDistribution\tof\tnormal\tcomponent\tof\tthe\tmagnetic\t\nfield\tintensity\tin\tthe\tcalculation\tarea\tand\tzones\n6. Discussion of results of simulation of \nelectromagnetic processes in the mode of \nthe test short circuit of the three-phase \ntransformer\nVerification of SC parameters by the data \nof field simulation of the parameters of SC of \nthe transformer was performed for SC volt -\nage, the value of which was 740.2 V (6.41 %) \nfor the frequency-domain model and 741.7 V \n(6.42 %) for the time-dependent model. Cor -\nresponding calculation values of SC losses \nwere equal to 17.745 kW and 17.815 kW. \nThus, relative discrepancies in frequency calculations did \nnot exceed 0.4 % for losses and 0.2 % for voltage of short cir -\ncuit. The relative error in calculation of losses and short-cir -\ncuit voltage did not exceed 1.5 %.\nErrors of calculation of active power losses, magnetic field \nenergy and voltage drops using the method of decomposition \nof the 3D area of the active part of the power transformer are \nshown in Table 1. The relative errors in the decomposition \nareas do not exceed: 0.47 % for magnetic field energy, 0.53 % \nfor electric losses, 0.51 % for the voltage drop module, 0.29 % \nfor the voltage drop phase. The relative errors of calculation \nof SC parameters make up 1.42 % for losses and 1.39 % for \nSC voltage. Validation of calculation parameters of the short \ncircuit was carried out by comparing the calculation data \nusing technique [26] with the results of tests, obtained at \nprivate enterprise “Eltiz” (Zaporizhye, Ukraine).\nReliability and accuracy of the results of simulation us -\ning the methods of decomposition and of dynamic synthesis \nof the windings sections circuits are ensured provided that \nthe distribution of electrical potential in the connection \nboundaries approaches the uniform one. In this case, the sum \nof active losses and magnetic field energy in the calculation \nregions will correspond with high accuracy to active losses \nand magnetic energy for the 3D area of the active part.\nThe proposed combination of the methods of decompo -\nsition and of dynamic synthesis with “free” conditions of \nconnection of electric circuits of phase windings sections \nensures effective implementation of the 3D modeling of \nmagnetic fields in the regions of a complex spatial form. High \nreliability and accuracy of the data of modeling and deter -\nmining parameters of a short circuit are achieved thanks to \ntaking into account of finite dimensions of the magnetic sys -\ntem, the winding system and features of reciprocal location. \nTime consumption decreases by 5 times, and requirements \nfor capacity of computation resources for the refined calcu -\nlation of the SC parameters decrease by 4 times.\nThe application area of the results of the conducted re -\nsearch is limited to the most common types of three-phase \npower transformers of voltage classes of up to 35 kV including \nthe circuits of connection of windings Y/Y 0–0, Y/D–11,  \nD/Y0–11 [1]. For the transformers of voltage class of 110 kV \nand above, the linear input inside HV windings is applied, \nwhich is performed by an electric circuit with two parallel \nbranches [1]. In addition, high voltage classes require a sub -\nstantial increase in dimensions of axial insulation gaps in the \nmiddle of LV windings, which leads to a multiple increase in the \nnumber of decomposition zones for calculation of the SC of the \ntransformer. That is why effective approaches to high-precision \ndetermining the SC parameters for transformers with voltage \nclass of 110 kV and above require further development.\nIn the future, the proposed methods of decomposition \nand of dynamic synthesis can be adapted for studying \nhigh-voltage reactors and rotating electric machinery and \ndetermining their parameters in test modes.\n7. Conclusions\n1. It was found that mathematical statements for the \nmodel of the magnetic field reflect the features of the elec -\ntromagnetic energy conversion in the mode of the test SC of \nthe power transformer with the multicomponent active part \nof a complex structure. Using the verification of the data of \ncalculation of frequency-domain and time dependent models \nof the magnetic field, we substantiated validity and accuracy \nof results when using frequency statements for determining \nthe parameters of the studied SC of the power transformer. \nThe relative discrepancies of frequency calculations did not \nexceed 0.4 % for losses and 0.2 % for short circuit voltage. \nComparison of calculation data with test results from the \nprivate enterprise “Eltiz” (Zaporizhye, Ukraine) is proved \nby high accuracy of identification of the parameters of the \ntest SC. Relative error of calculation of losses and voltage of \nshort circuit does not exceed 1.5 %.\n2. It was established that in the test SC, the magnetic \nfield is located in phase windings. In the localization areas, \n \nTable\t1\nErrors\tof\tthe\tmethod\tof\tdynamic\tsynthesis\tof\tfield\tmodels\tfor\tthe\tcriterion\tof\t\nminimum\tcurrent\terror\nCalculation \nregions (zones) Upper zone Central zone Lower zone Area of active \npart \nMagnetic field \nenergy 0.47 % 0.19 % 0.25 % 0.76 %\nActive power \nlosses 0.53 % 0.31 % 0.48 % 1.42 %\nVoltage drop \n(module/phase) 0.51 %/0.29 % 0.38 %/0.18 % 0.46 %/0.28 % 1.39 %/0.78 %\nApplied physics\n27\ndirections and the module of the vector of magnetic field \nalmost never change. The axial component, the value of \nwhich is 96–97 % of the module of the magnetic tension \nvector, is the largest. This makes it possible to determine \nthe 3D distribution of the magnetic field intensity in the \nlocalization area according to the data of 2D distribution in \nthe horizontal plane of the cross section of the active part in \nthe middle of the phase windings height. The change in elec -\ntrical potential on the surface of horizontal cross-sections of \nthe conductors between the coils or between the turns of the \nwindings can be neglected and the assumption of uniform \ndistribution can be accepted. The calculation area is divided \ninto the central and end zones. Each of the zones was set in \ncompliance with the electrical circuit in the substitution \nscheme. Decomposition of the 3D area of field simulation \ninto the zones at the distance of 10...15 % of the height of \nthe phase windings from their ends ensures high precision \nof calculation of the spatial distribution of the magnetic field \nintensity with the error of not more than 1.62 %.\n3. It was found that the dynamic synthesis of field areas \nwith electric circuits in the substitution scheme by the cri -\nterion of a minimum current error significantly increases \ncomputational efficiency of determining SC parameters. In \nthe set restrictions for current εI≤0.1 % and angular errors \nεφ≤0.5 %, relative calculation errors do not exceed 1.42 % \nfor active losses and 1.39 % for SC voltage. Application of \nthe methods of decomposition and of dynamic synthesis of \nelectric circuits make it possible to decrease time consump -\ntion by 5 times and decrease the requirements for computing \nresources by 4 times.\nReferences\n1. Biki M. A. Proektirovanie silovyh transformatorov. Raschet osnovnyh parametrov. Moscow: Znak, 2013. 612 p.\n2. Khaparde S., Kulkarni S. Transformer Engineering: Design and Practice. CRC Press, 2004. 496 p. doi: https://doi.org/  \n10.1201/9780203970591 \n3. C57.12.90-2006 – IEEE Standard Test Code for Liquid-Immersed Distribution, Power, and Regulating Transformers. doi: https://\ndoi.org/10.1109/ieeestd.2006.320496 \n4. Lul’e A. I. Process vklyucheniya silovogo transofrmatora na holostoy hod i korotkoe zamykanie // Elektrotekhnika. 2008. Issue 2. \nP . 2–18.\n5. Leytes L. V. Elektromagnitnye raschety trasnfomatorov i reaktorov. Moscow: Energiya, 1981. 365 p.\n6. Novash I. V., Rumiantsev Y. V. Three-phase transformer parameters calculation considering the core saturation for the matlab-sim-\nulink transformer model // ENERGETIKA. Proceedings of CIS higher education institutions and power engineering associations. \n2015. Issue 1. P . 12–24.\n7. Schiop A., Popescu V. Pspice simulation of power electronics circuit and induction motor drives // Revue Roumaine des Sciences \nTechniques–Serie Electrotechnique et Energetique. 2007. Vol. 52, Issue 1. P . 33–42.\n8. Speed synchronization methods of the energy-efficient electric drive system for induction motors / Kotsur M., Yarymbash D., Kot-\nsur I., Bezverkhnia Y., Andrienko D. // 2018 14th International Conference on Advanced Trends in Radioelecrtronics, Telecommu-\nnications and Computer Engineering (TCSET). 2018. doi: https://doi.org/10.1109/tcset.2018.8336208 \n9. Jamali M., Mirzaie M., Asghar-Gholamian S. Calculation and Analysis of Transformer Inrush Current Based on Parameters of Trans-\nformer and Operating Conditions // Electronics and Electrical Engineering. 2011. Vol. 109, Issue 3. doi: https://doi.org/10.5755/\nj01.eee.109.3.162 \n10. Singh A. K., Patel S. Mitigation of Inrush Current For Single Phase Transformer by Control Switching Method // International \nJournal of Electronics, Electrical and Computational System. 2015. Vol. 4. P . 146–150.\n11. Taghikhani M. A., Sheikholeslami A., Taghikhani Z. Harmonic Modeling of Inrush Current in Core Type Power Transformers Using \nHartley Transform // IJEEE. 2015. Vol. 11, Issue 2. P . 174–183 doi: https://doi.org/10.22068/IJEEE.11.2.174\n12. Chiesa N., Mork B. A., H−idalen H. K. Transformer Model for Inrush Current Calculations: Simulations, Measurements and Sen -\nsitivity Analysis // IEEE Transactions on Power Delivery. 2010. Vol. 25, Issue 4. P . 2599–2608. doi: https://doi.org/10.1109/\ntpwrd.2010.2045518 \n13. Khederzadeh M. Mitigation of the impact of transformer inrush current on voltage sag by TCSC // Electric Power Systems Re -\nsearch. 2010. Vol. 80, Issue 9. P . 1049–1055. doi: https://doi.org/10.1016/j.epsr.2010.01.011 \n14. Tykhovod S. M. Transients modeling in transformers on the basis of magnetoelectric equivalent circuits // Electrical Engineering \nand Power Engineering. 2014. Issue 2. P . 59–68. doi: https://doi.org/10.15588/1607-6761-2014-2-8 \n15. Increasing of thermal reliability of a regulated induction motor in non-standard cycle time conditions / Kotsur M., Kotsur I., \nBezverkhnia Y., Andrienko D. // 2017 International Conference on Modern Electrical and Energy Systems (MEES). 2017.  \ndoi: https://doi.org/10.1109/mees.2017.8248960 \n16. Lazarev N. S., Shul’ga R. N., Shul’ga A. R. Toki vklyucheniya silovyh transformatorov // Elektrotekhnika. 2010. Issue 11. P . 11–17.\n17. Podol’cev A. D., Kontorovich L. N. Chislenniy raschet elektricheskih tokov, magnitnogo polya i elektrodinamicheskih sil v silovom \ntransformatore v avariynyh rezhimah s ispol’zovaniem MATLAB/SIMULINK i COMSOL // Tekhnichna elektrodynamika. 2011. \nIssue 6. P . 3–10.\n18. Majumder R., Ghosh S., Mukherjee R. Transient Analysis of Single Phase Transformer Using State Model // International Journal \nof Innovative Research in Science, Engineering and Technology. 2016. Vol. 5, Issue 3. P . 3300–3306. \n19. Computer simulation of electromagnetic field with application the frequency adaptation method / Yarymbash D. S., Yarym -\nbash S. T., Kotsur M. I., Litvinov D. O. // Radio Electronics, Computer Science, Control. 2018. Issue 1. P . 65–74. doi: https://  \ndoi.org/10.15588/1607-3274-2018-1-8 \nEastern-European Journal of Enterprise Technologies  ISSN 1729-3774 4/5 ( 94 ) 2018\n28\n20. Yarymbash D. S., Oleinikov A. M. On specific features of modeling electromagnetic field in the connection area of side busbar \npackages to graphitization furnace current leads // Russian Electrical Engineering. 2015. Vol. 86, Issue 2. P . 86–92. doi: https://  \ndoi.org/10.3103/s1068371215020121 \n21. Yarymbash D. S. The research of electromagnetic and thermoelectric processes in the AC and DC graphitization furnaces // Nau -\nkovyi Visnyk Natsionalnoho Hirnychoho Universytetu. 2015. Issue 3. P . 95–102.\n22. A New Approach of the Induction Motor Parameters Determination in Short-Circuit Mode by 3D Electromagnetic Field Simula -\ntion / Kotsur M., Yarymbash D., Yarymbash S., Kotsur I. // 2017 IEEE International Y oung Scientists Forum on Applied Physics \nand Engineering (YSF). 2017. P . 207–210. doi: https://doi.org/10.1109/ysf.2017.8126620 \n23. A New Simulation Approach of the Electromagnetic Fields in Electrical Machines / Yarymbash D., Kotsur M., Subbotin S., \nOliinyk A. // 2017 International Conference on Information and Digital Technologies (IDT). 2017. P . 452–457. doi: https://  \ndoi.org/10.1109/dt.2017.8024332 \n24. Milykh V. I., Polyakova N. V. An analysis of harmonic composition the AC magnetic field associated with a rotating rotor turbine \ngenerator, at idle speed and short circuit modes // Electrical Engineering And Power Engineering. 2013. Issue 2. P . 5–13. \n25. Features of Defining Three-Phase Transformer No-Load Parameters by 3D Modeling Methods / Yarymbash D., Yarymbash S., \nKylymnyk I., Divchuk T., Litvinov D. // 2017 International Conference on Modern Electrical and Energy Systems (MEES). 2017.  \nP . 132–135. doi: https://doi.org/10.1109/mees.2017.8248870 \n26. An Application of Scheme and Field Models for Simulation of Electromagnetic Processes of Power Transformers / Yarymbash D., \nKotsur M., Yarymbash S., Kylymnyk I., Divchuk T. // 2018 14th International Conference on Advanced Trends in Radioelecrtron-\nics, Telecommunications and Computer Engineering (TCSET). 2018. P . 308–313. doi: https://doi.org/10.1109/tcset.2018.8336209 \n27. Dual Reversible Transformer Model for the Calculation of Low-Frequency Transients / Jazebi S., de Leon F ., Farazmand A., \nDeswal D. // IEEE Transactions on Power Delivery. 2013. Vol. 28, Issue 4. P . 2509–2517. doi: https://doi.org/10.1109/tpwrd.  \n2013.2268857 \n28. Tang Q., Guo S., Wang Z. Magnetic flux distribution in power transformer core with mitred joints // Journal of Applied Physics. \n2015. Vol. 117, Issue 17. P . 17D522. doi: https://doi.org/10.1063/1.4919119 \n29. Cundeva S. A transformer model based on the Jiles-Atherton theory of ferromagnetic hysteresis // Serbian Journal of Electrical \nEngineering. 2008. Vol. 5, Issue 1. P . 21–30. doi: https://doi.org/10.2298/sjee0801021c \n30. Rashtchi V., Rahimpour E., Fotoohabadi H. Parameter identification of transformer detailed model based on chaos optimisation \nalgorithm // IET Electric Power Applications. 2011. Vol. 5, Issue 2. P . 238. doi: https://doi.org/10.1049/iet-epa.2010.0147 \n31. Paikov I. A., Tikhonov А. I. Analysis of power transformer electromagnetic calculation models // Vestnik IGEU. 2015. Issue 3.  \nP . 38–43. doi: https://doi.org/10.17588/2072-2672.2015.3.038-043 \n32. Ostrenko M. V., Tykhovod S. М. Calculation of losses in elements of construction of power transformers and reactors by finite \nelement method with surface impedance boundary conditions // Electrical Engineering and Power Engineering. 2016. Issue 2.  \nP . 33–42. doi: https://doi.org/10.15588/1607-6761-2016-2-4 \n33. Analysis of inrush currents of the unloaded transformer using the circuit field modelling methods / Yarymbash D., Yarymbash S., \nKotsur M., Divchuk T. // Eastern-European Journal of Enterprise Technologies. 2018. Vol. 3, Issue 5 (93). P . 6–11. doi: https://  \ndoi.org/10.15587/1729-4061.2018.134248\n34. Avetisyan D. A., Sokolov V. S., Han V. H. Optimal’noe proektirovanie elektricheskih mashin na EVM. Moscow: Energiya, \n1976. 215 p.",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.6511611938476562
    },
    {
      "name": "Electromagnetic coil",
      "score": 0.6419229507446289
    },
    {
      "name": "Superposition principle",
      "score": 0.5924609899520874
    },
    {
      "name": "Electromagnetic field",
      "score": 0.5034920573234558
    },
    {
      "name": "Magnetic field",
      "score": 0.48852765560150146
    },
    {
      "name": "Electronic engineering",
      "score": 0.42063283920288086
    },
    {
      "name": "Electrical engineering",
      "score": 0.4107154309749603
    },
    {
      "name": "Engineering",
      "score": 0.3299974501132965
    },
    {
      "name": "Computer science",
      "score": 0.32437774538993835
    },
    {
      "name": "Voltage",
      "score": 0.2679261565208435
    },
    {
      "name": "Mathematics",
      "score": 0.21086671948432922
    },
    {
      "name": "Mathematical analysis",
      "score": 0.2057412564754486
    },
    {
      "name": "Physics",
      "score": 0.20423930883407593
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I168036236",
      "name": "National University Zaporizhzhia Polytechnic",
      "country": "UA"
    }
  ],
  "cited_by": 14
}