{
  "title": "Integrating a New Software Tool Used for Tool Path Generation in the Numerical Simulation of Incremental Forming Processes",
  "url": "https://openalex.org/W2893924252",
  "year": 2018,
  "authors": [
    {
      "id": "https://openalex.org/A5006790310",
      "name": "Daniel Nasulea",
      "affiliations": [
        "Transylvania University of Brașov"
      ]
    },
    {
      "id": "https://openalex.org/A5067631951",
      "name": "Gheorghe Oancea",
      "affiliations": [
        "Transylvania University of Brașov"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2567727878",
    "https://openalex.org/W2742879501",
    "https://openalex.org/W1978103441",
    "https://openalex.org/W2320041402",
    "https://openalex.org/W2085024733",
    "https://openalex.org/W2089055202",
    "https://openalex.org/W182754367",
    "https://openalex.org/W2200500743",
    "https://openalex.org/W2566275019",
    "https://openalex.org/W4288400169",
    "https://openalex.org/W2279208334",
    "https://openalex.org/W1989081911",
    "https://openalex.org/W1645129188",
    "https://openalex.org/W2002326800",
    "https://openalex.org/W76900675",
    "https://openalex.org/W2317956162",
    "https://openalex.org/W2573582228",
    "https://openalex.org/W2885002574",
    "https://openalex.org/W2609613645",
    "https://openalex.org/W2771202129",
    "https://openalex.org/W2005331400",
    "https://openalex.org/W2773225720",
    "https://openalex.org/W2007702367",
    "https://openalex.org/W2325875206",
    "https://openalex.org/W1986444838",
    "https://openalex.org/W2728899382",
    "https://openalex.org/W2279659925",
    "https://openalex.org/W2273824830",
    "https://openalex.org/W2508028522"
  ],
  "abstract": "In the incremental sheet forming simulation, finite element modelling typically was used to anticipate material behaviour, predict deformation forces, thickness reduction or to identify other information.Because the forming tool motions are difficult to be implemented in finite element method (FEM) software systems, and because of the large number of points that describe the tool path, in order to reduce data preparation time, this paper presents the implementation of a new software tool conceived by the authors in the process of the numerical simulation of incremental sheet forming.The software tool uses a CNC file in G-code format to reveal the interpolation point coordinates of the tool motions and the positioning time in a specific ANSYS format.Usually, a tool path for an incremental sheet forming process consists of thousands of interpolation points and is very difficult and time-consuming to implement manually into a FEM software system.The new software tool solves this issue, at least for ANSYS software, being swift and easy to use.The paper also presents how the software tool is integrated and validated in a case study of an incremental sheet forming process simulation concerning different part configurations.",
  "full_text": "*Corr. Author’s Address: Transilvania University of Brasov, Department of Manufacturing Engineering, Mihai Viteazul 5, Brasov, Romania, gh.oancea@unitbv.ro 643\nStrojniški vestnik - Journal of Mechanical Engineering 64(2018)10, 643-651 Received for review: 2018-05-03\n© 2018 Journal of Mechanical Engineering. All rights reserved.  Received revised form: 2018-06-27\nDOI:10.5545/sv-jme.2018.5475 Original Scientific Paper Accepted for publication: 2018-08-13\n0  INTRODUCTION\nIn recent years, flexible manufacturing processes \nhave gained increased attention from researchers and \nproducers. Incremental sheet forming (ISF) is a “die-\nless” and flexible manufacturing process from the \ncold-pressing industry, used for customized products, \nrapid prototyping, and small batch production series \nof sheet metal parts \n[1] and [2].\nThe ISF working principle presented in Fig. \n1 entails the sheet metal blank mounted on a fixing \ndevice consisting of a blank holder with or without a \nbacking plate to support the part flange, and a clamping \nplate which is placed over the blank, fixing it most \noften by the tightening of several screws. The pack of \nplates is lifted to a greater height than the part depth, \nusing various configurations of auxiliary components \nto ensure enough space below the blank to enable the \npart forming. Plastic forming is performed locally, \nusually by a simple shape tool with a hemispherical \nhead \n[3], which is rotated by its axis, following a \nnumerically controlled path. The part is divided into a \nnumber of layers from top to bottom, and at each layer \nthe tool follows the CNC path, which is, in fact, the \nouter contour of the part. The distance between two \nconsecutive layers is called an incremental step down \n(Δz). When one layer is completed, the tool descends \nby an incremental step and follows the part contour \nagain. This operational stage is repeated until the final \npart is obtained \n[2] and [3]. The ISF process undergoes \nIntegrating a New Software Tool Used for Tool Path Generation  \nin the Numerical Simulation of Incremental Forming Processes\nNasulea, D. – Oancea, G.\nDaniel Nasulea – Gheorghe Oancea*\nTransilvania University of Brasov, Department of Manufacturing Engineering, Romania\nIn the incremental sheet forming simulation, finite element modelling typically was used to anticipate material behaviour, predict deformation \nforces, thickness reduction or to identify other information. Because the forming tool motions are difficult to be implemented in finite element \nmethod (FEM) software systems, and because of the large number of points that describe the tool path, in order to reduce data preparation \ntime, this paper presents the implementation of a new software tool conceived by the authors in the process of the numerical simulation of \nincremental sheet forming. The software tool uses a CNC file in G-code format to reveal the interpolation point coordinates of the tool motions \nand the positioning time in a specific ANSYS format. Usually, a tool path for an incremental sheet forming process consists of thousands of \ninterpolation points and is very difficult and time-consuming to implement manually into a FEM software system. The new software tool solves \nthis issue, at least for ANSYS software, being swift and easy to use. The paper also presents how the software tool is integrated and validated \nin a case study of an incremental sheet forming process simulation concerning different part configurations.\nKeywords: incremental sheet forming, FEM, numerical simulation, tool path, software tool\nHighlights\n• The paper states the necessity of reducing the FEM model preparation time for ISF processes by reducing the difficulty of \ndescribing the forming tool motions for numerical simulation applications. \n• A new stand-alone software tool is developed to convert a CNC G-code file into a format specific for ANSYS, in order to \nfacilitate swift tool path description in ISF processes.\n• The new software tool can be easily used by any user without additional software skills. \n• The software tool is integrated into an ISF numerical simulation process.\n• A case study proves the utility of the developed software tool.\nFig. 1.  ISF working principle [2], adapted from [3]\nStrojniški vestnik - Journal of Mechanical Engineering 64(2018)10, 643-651\n644 Nasulea, D. – Oancea, G.\ncontinuous development, and for its improvement, \nin addition to experimental research, more modern \ntechniques for the design of experiments (DOE) or \nfinite element methods (FEM) are used [1] and [4]. \nFEM analysis has increased in confidence and can \nprovide a first check on what works in the real world \nand what does not \n[5]. Various topics are simulated, \nstarting with the most common mechanical issues \nup to thermal analysis, vibration frequency, forming \nsimulations \n[6] to [8], fluid flow or injection moulding \nof plastic parts. Indeed, recently numerous specialists \nand users around the world have come to understand \nand implement FEM analysis. These make FEM \nsuitable to be used and to improve many aspects: save \ntime and money in a product lifecycle, simulation \nand validation of parts behaviour, force prediction, \ngeometric deviations or parts stiffness.\n1  FEM IMPLEMENTATION IN ISF PROCESSES\nISF processes have multiple applications in different \nindustries \n[2] and [3], i.e. instrument and body panels \nin the aerospace industry, door and hood panels in \nthe automotive industry, low volume or unique sheet \nmetal products, products in medical industry: denture \nplates, ankle supports, metal helmets, and so on. This \nis one of the reasons that FEM is frequently used in \nISF process simulation. Usually software systems \nlike ABAQUS, LS-DYNA, or ANSYS are used to \nanalyse or simulate the process and to study \n[2]; \nstrains, forces, thickness reduction [9], the influence \nof tool parameters and path on deformation behaviour \n[10], springback amplitude and tool path correction \n[11], or the wrinkling phenomena of thin-walled parts \nmanufactured with ISF or other processes [12] and \n[13]. The main steps for implementing FEM analysis \nfor an incremental forming process are [2] and [14] \ndesign of the part and fixing device and devising the \ncomputer-aided design (CAD) models, generating \nthe tool movements or the tool path, designing \nfinite element assembly in FEM software, defining \nmaterials and apply boundary conditions, solving the \nmodel, and obtaining the results.\nOne of the main problems in FEM simulation \nin ISF processes is the considerable CPU time, an \nissue mentioned by many researchers. This is because \nof many nonlinear problems \n[14], because of tool \ntrajectory complexity that consists of thousands of \nintegration points, and because of a fine mesh or an \nadaptive meshing that has to be devised in the contact \narea between the tool and the sheet metal blank to \nobtain results as accurate as possible. Many solutions \nhave been found for reducing this computational time. \nRobert et al. \n[15] used the incremental deformation \ntheory of plasticity as a solution to improve the central \nprocessing unit (CPU) time in the ABAQUS FEM \nsimulation of a cup made from aluminium sheet of 1.5 \nmm thickness. Computational time can also be reduced \nby using explicit instead of an implicit solver \n[14]. \nTwo other solutions used very often entail applying \ntime scaling or mass scaling to the prepared FEM \nmodel, without affecting the results to a significant \nextent \n[16]. Benedetti et al. [17] applied mass scaling in \nSPIF numerical simulation, using ABAQUS explicit \ncode, in order to achieve a user-specified time step \nsize, reducing analysis computational cost and time. \nNaranjo et al. \n[18] concluded that a medium size blank \nmesh used in the FEM simulation of an incremental \nforming process in ANSYS, is in good agreement \nwith the experimentally obtained values, while at the \nsame time, by using this medium size mesh, CPU time \nwas reduced. A simplified numerical approach was \ndeveloped by Ben Ayed et al. \n[19] to simulate the ISF \nprocess. This approach called ISF-SAM is a simplified \nfinite element model that succeeds to reduce the \ncomputation time by more than 50 % in comparison \nto the time required when using ABAQUS implicit \ncode, with sufficiently accurate results prediction. A \ndecoupling algorithm that separates the finite element \nmodel into two zones, the elastic and elasto-plastic \ndeformation zones is proposed by Sebastiani et al. \n[20]. \nTo reduce the computation time, during simulation \nthis algorithm concentrates on the small elasto-plastic \ncontact zone between tool and sheet, simplifying in \nthis way the model solving. Bambach [21] applied a \nFEM simulation onto the asymmetrical incremental \nsheet forming, using an adaptive remeshing strategy \nbased on a multi-mesh method combined with \nsubcycling. It was concluded that by using these \nmethods the calculation time is reduced by up to 80 \n%. Zhang et al. \n[22] proposed a new selective element \nfission approach (SEF) to improve CPU time, reducing \nthe unnecessary calculations of the area outside \nthe plastic deformation zone. These methods entail \ndifferent mesh densities for blank areas: a fine mesh \nin the tool-sheet contact area to improve the accuracy \nof results, and a coarse mesh outside the contact area \nto reduce unnecessary calculation. It was concluded \nthat the SEF approach could save up to 74 % in terms \nof computational time with satisfactory accuracy for \nISF processes. Therefore, many researchers aim to \nimprove the computational time for FEM simulations \nof incremental sheet forming processes; in literature, \nmany other implemented solutions can be found for \nthis issue.\nStrojniški vestnik - Journal of Mechanical Engineering 64(2018)10, 643-651\n645Integrating a New Software Tool Used for Tool Path Generation in the Numerical Simulation of Incremental Forming Processes \nA time-consuming phase in FEM implementation \nin ISF processes is not only the computational time \nbut also the FEM model preparation time. In model \npreparation, because in ISF processes the tool path \nis not a simple one, the most difficult and time-\nconsuming phase is to specify the tool movements. \nThe described tool path should be the same as for the \nmanufacturing process. Usually, tool path generation \nis achieved by computer-aided manufacturing (CAM) \nsoftware systems, which yield a computer numerical \ncontrol (CNC) file, where the trajectories are described \nusing G code format. However, FEM software \nsystems usually do not allow introducing the CNC file \nor the G-codes directly as input, in order to describe \nthe tool movements. Thus, solutions are required to \ndescribe the tool trajectories for incremental forming \nprocesses in FEM simulation. The input file of the tool \ntrajectory for numerical simulation should be defined \nin terms of two parameters: tool points coordinates for \neach X, Y and Z direction, and time position. In simple \ncases, the tool path point coordinates can be manually \nprocessed by means of simple spreadsheets \n[14], [16] \nand [23]. For complex shapes, the point coordinates \nhave to be extracted from the CAM programmed tool \npath or from the CNC G-code file manually or by \nother complex methods. Another research team \n[24] \nused LS-DYNA for the simulation of the incremental \nforming process, dedicated FEM software, and in \norder to specify the input of tool movement, started \nwith the CNC program from which, using in a first \nstage a programming software called Python, an \nordered file was extracted containing an array of five \ncolumns with the coordinates of tool positions for \nlinear interpolations and two circle centre coordinates \nfor circular interpolations \n[24]. This ordered file has \nbeen processed using Matlab software, in order to \ngenerate the final output for LS-DYNA simulation, the \nfile which contains the tool position versus time data. \nUsing more than one software tool to transfer data \nfrom a CNC to a FEM format, as used in reference \n[24] can be difficult, errors can occur, and the users \ncertainly need special knowledge to work with such \nsoftware systems. In this paper, the authors propose \nto solve this generation issue with a new software tool \nthat can be integrated into ISF numerical simulation. \nFrom the user viewpoint, this software tool is a stand-\nalone application and generates an input file for the \nANSYS software system, which describes the tool \nmovements in terms of tool points coordinates by all \ndirections X, Y, Z and the tool movement time in each \ninterpolation point. \n2  METHOD DESCRIPTION\nThe FEM model preparation stage for an ISF process \nis a complex and time-consuming operation, especially \nbecause of the enormous working volume required \nto describe the tool motions in FEM software. This \nstage can be improved in terms of preparation time \nreduction. Thus, a software application named tool \nmotion points generator (TMPG) has been developed \nby the authors and integrated into a numerical \nsimulation of an ISF process. The objective of this \nsoftware tool is to convert a CNC G-code file obtained \nfrom a CAM software system into a file which \ncontains the necessary input data in ANSYS format \nfor ISF simulation. This software tool allows users, \nwith no specialized software knowledge, to perform \nthe quick conversion of a CNC G-code file into a text \nfile that contains the tool motion points coordinates \nand time position necessary as inputs in ANSYS, for \nthe description of the complete tool trajectories in ISF \nprocesses. It reduces the FEM model preparation time \nwith a beneficial impact on the total implementation \ntime of a numerical simulation for an ISF process. The \nTMPG software tool flow is presented in the block \ndiagram in Fig. 2.\nFig. 2.  Software tool block diagram\nStrojniški vestnik - Journal of Mechanical Engineering 64(2018)10, 643-651\n646 Nasulea, D. – Oancea, G.\n2.1  Software Tool Description\nMany programming languages and systems allow \nthe development of new customized software tools, \nsuch as LISP, Python, C++, Delphi, Matlab, Visual \nBasic and so on \n[24] to [26]. The software tool was \nconceived in the Delphi environment which uses the \nObject Pascal programming language. The graphical \nuser interface (GUI) of the TMPG application shown \nin Fig. 3 is divided into four separate functional zones \nby their role in the software tool. Those areas which \nare different windows are highlighted with black \nframes. In the left upper corner area, coordinates of the \ninterpolation points extracted from the CNC G-code \nfile are displayed. Another text window displays the \ntime values for each interpolation tool position. The \narea where the final output is displayed is the right \nupper corner. Thus, in this area, four successive arrays \nare written, one for each parameter, X, Y, Z coordinates \nand position time for all points. The fourth area is used \nfor launching commands, is placed below the display \nzone and consists of eight buttons and an input box for \nthe feed rate.\nEach button from the GUI associated to the \nTMPG software tool has a specific role. When \n“Extract coordinates from CNC file” is pressed, first \na warning message is displayed which warns the user \nthat the CNC input file has to include in the first row \nwith tool motion G-codes, all three coordinates X, \nY, Z, otherwise the initial tool position is unknown. \nOnce this aspect has been verified, the CNC file to \nbe processed can be selected from a dialogue box. \nThe X, Y, and Z coordinates for each interpolation \npoint will be further displayed in the first zone of the \nTMPG interface. All coordinates are counted, and \ntheir numbers are displayed below each correspondent \nwindow. These numbers have to be equal; otherwise, \nerrors occur in the final file. Taking into consideration \nthe extracted points coordinates, the time for each \npoint can be calculated by pressing the “Time \ncalculation” button. This process uses the feed rate \nspecified by the user and the distance between the \nprevious and the current point in order to calculate \nthe specific time for each tool position. The distance \nbetween two points A(x\na, ya, za) and B(x b, yb, zb) is \ncalculated using Eq. (1) [27].\n AB xx yy zzba ba ba=− () +−() +−()\n22 2\n. (1)\nThe obtained tool movement times are displayed \nin the “Calculated time” window. The button \n“Generate ANSYS format” generates and displays \nin the right upper area all four arrays in a specific \nformat, needed as input into ANSYS for tool motion \ndescription. While running the software application \nallows saving additional files as follows: only the \npoints coordinates, points coordinates and calculated \ntime in intermediary files. The final ANSYS format \noutput is also generated. The “Restart” has to be used \nfor the processing of a new CNC file. \nFig. 3.  TMPG software tool interface\nStrojniški vestnik - Journal of Mechanical Engineering 64(2018)10, 643-651\n647Integrating a New Software Tool Used for Tool Path Generation in the Numerical Simulation of Incremental Forming Processes \n2.2  TMPG Input and Output Files\nConsidering that TMPG aims to generate the tool \nmovements for an incremental forming process in \na format that can be specified in ANSYS software, \nthe software tool needs an input file. This input is a \nCNC G-code generated by a CAM software system. \nFig. 4 presents a sequence of a G-code structure for \na CNC file generated by using CATIA “Advanced \nMachining” workbench. \nIn this example, the file extension is “NCCode”. \nThere can be linear or circular interpolations. For \ncircular interpolations, the trajectory is also described \nas a sum of very small linear movements, which at the \nend describe a circular motion. Thus, first, the CNC \nfile has to be generated by using a CAM software \nsystem, to ensure an input data for the TMPG software \ntool.\nThe CNC input file will be processed by using \nthe developed TMPG software tool, the final result \nbeing the obtained ANSYS output file. The data that \ncan be accepted by ANSYS are a set of lines or arrays \nin a specific format for each position point parameter \nX, Y and Z and also for the tool position time. Fig. 5 \nshows the text format for each parameter that will be \nspecified as input in the ANSYS software system.\nFig. 4.  CNC G-code structure\na) \n   b) \nc) \n   d) \nFig. 5.  Text format for ANSYS input; a) for the X-axis;  \nb) for the Y-axis; c) for the Z-axis; d) for the tool position time\nThe symbols used in these files have the following \nmeanings:\n• UUX, UUY, UUZ and TTime are the names for \neach set of lines or arrays;\n• n is the number of interpolation points in the \nCNC file;\n• X1...Xn, Y1...Yn, Z1...Zn, T1...Tn - are the values \nfor the X, Y, Z coordinates and time for each \ninterpolation point.\nIn ANSYS parametric design language (APDL) \nthere are two methods by that the available commands \nin ANSYS software can be used. The first method is to \nuse the GUI to access the commands, and the second \nmethod is to use the “command prompt” to run the \nspecific commands by writing the codes that are the \nabbreviation of these commands \n[28]. For specifying \nthe generated parameters for tool movements, the \nproper way is to use the “command prompt” to input \nthe generated data by using the developed TMPG \nsoftware tool. Thus, the TMPG software tool generates \nfour arrays, one for each parameter X, Y, Z and Time. \nAll these arrays are automatically written by the \ndeveloped software tool in a single text file which can \nbe introduced as input for tool movements, or simply \ncopy the text file to ANSYS “command prompt”.\n3 INTEGRATING AND VALIDATING  \nTHE NEW SOFTWARE TOOL IN AN ISF PROCESS -  \nA CASE STUDY\nThe objective of the case study is to integrate the new \nsoftware tool into an ISF process, to verify if various \ndimensional configurations of a frustum of the cone \ncan be manufactured without fracture and, at the same \ntime, to predict the values of the developed forces. \nThese force values will be used to determine whether \na Victor Vcentre-55 CNC milling machine can be \nused for experimental research in incremental sheet \nforming. In incremental forming, the forming tool \napplies force on the sheet blank, thus producing a local \nplastic deformation of the contact surface between \ntool and sheet. The three components of the force are \nthe radial force Fx, the tangential force Fy and the \naxial force Fz that typically is the largest \n[2] and [29]. \nFurther determined in this case study whether this \nmilling machine is capable of applying enough force in \nX, Y and Z directions, for an incremental deformation \nof the experimental sheet metal parts manufactured \nfrom DC05 deep drawing steel of 1mm thickness. To \ncheck if the part configurations can be manufactured \nand to estimate the values of the forces, a numerical \nsimulation in ANSYS/LS-DYNA FEM software was \nperformed, using the TMPG software tool to obtain, \nStrojniški vestnik - Journal of Mechanical Engineering 64(2018)10, 643-651\n648 Nasulea, D. – Oancea, G.\nin a short time, the time tool movements and points \ncoordinates. For a better overview of the process \nbehaviour and the force variation, six numerical \nsimulations were performed for different geometrical \nconfigurations of the experimental part presented in \nFig. 6.\nFig. 6.  Experimental frustum of a cone\nDifferent parts variants with different wall angles \nϕ (40°, 50° and 60°) and height values (35 mm, 45 mm \nand 50 mm) are analysed, manufactured from deep \ndrawing sheet metal blank DC05 of 1 mm thickness. \nFor each variant, two step depth Δz were used: 0.5 \nmm and 1 mm. The FEM models for simulation were \nprepared in ANSYS APDL and solved using an LS-\nDYNA explicit solver \n[30] and [31]. Fig. 7 presents the \nmain steps for the implementation of FEM simulation \nin the incremental forming process. The 3D model of \nthe part was designed in CATIA V5 CAD workbench, \nand then the tool trajectories were generated also in \nCATIA V5 Advanced machining workbench, from \nwhere the CNC file was obtained. Then, the CNC \nfile was processed by using the developed TMPG \nsoftware tool to obtain the needed ANSYS file. Thus \nin a few minutes, the application generated all four \narrays with a minimum effort, which serve as input \nfor ANSYS to describe the tool motion. Furthermore, \nin ANSYS, the materials were defined, the boundary \nconditions were applied, and an output K type file \n“Ansys_output.k” was obtained. This K file serves as \ninput for the LS-DYNA explicit solver that will run \nand solve the simulation \n[30] and [31]. As an example \nof the obtained final result, Fig. 8 presents the plots \nfor the frustum of a cone with a wall angle ϕ = 60° and \nH = 50 mm formed by using a step depth Δz = 1 mm.\nThe results for all the six studied parts were \nsummarized in Table 1 that features the maximum \nvalues for the axial and radial forces. Because the \nfrustum of a cone is an axis-symmetric part, the \nmaximum force in the X direction is equal to the \nmaximum force value in the Y direction. For this \nreason, the radial force is measured only in one \ndirection, in this case in the X direction. Only the \nlargest values of the forces from all six simulations \nresults are necessary to check if the selected CNC \nTable 1.  Axial and radial forces for each part configuration\nPart configuration\nMaximum \naxial force \n[N]\nMaximum \nradial force \n[N]\nϕ = 40°, H = 35 mm, Δz = 0.5 mm 2062.2 711.17\nϕ = 40°, H = 35 mm, Δz = 1 mm 2189.3 786.44\nϕ = 50°, H = 45 mm, Δz = 0.5 mm 2516.0 1104.8\nϕ = 50°, H = 45 mm, Δz = 1 mm 2760.7 1196.7\nϕ = 60°, H = 50 mm, Δz = 0.5 mm 2650.2 1443.2\nϕ = 60°, H = 50 mm, Δz = 1 mm 2931.9 1624.1\nFig. 7.  Main steps for the implementation of FEM simulation\na) \nb)\nc)\nFig. 8.  Obtained results for ϕ = 60°, H = 50 mm and Δz = 1 mm \npart configuration;  a) resulted FEM model; b) axial force plot;  \nc) radial force plot\nStrojniški vestnik - Journal of Mechanical Engineering 64(2018)10, 643-651\n649Integrating a New Software Tool Used for Tool Path Generation in the Numerical Simulation of Incremental Forming Processes \na) \nb) \n c) \nFig. 9.  Setup used for ISF process implementation; a) Victor Vcentre-55 CNC milling machine; b) sheet metal fixing device;  \nc) elements for ISF implementation, adapted from [33]\na) \nb) \nc) \nFig. 10.  Experimental parts; a) FEM model and manufactured part for ϕ = 40°, H = 35 mm, Δz = 0.5 mm configuration; \nb) FEM model and manufactured part for ϕ = 50°, H = 45 mm, Δz = 0.5 mm configuration; \nc) FEM model and manufactured part for ϕ = 60°, H = 50 mm, Δz = 1 mm configuration\nStrojniški vestnik - Journal of Mechanical Engineering 64(2018)10, 643-651\n650 Nasulea, D. – Oancea, G.\nmilling machine can be used for the ISF process. \nFrom Table 1, it follows that in order to be deformed \nthe part configuration with wall angle 60̊, height 50 \nmm and step depth 1 mm requires the largest forces \nboth axial and radial. These values are 2931.9 N for \nthe axial force and 1624.1 N for the radial force.\nThe CNC milling machine Victor Vcentre-55 \nis capable of developing, based on its X, Y, Z axis \nball screws transmission, over 22000 N force along \nthe X and Y axes and over 33500 N force along the \nZ axis [32]. To avoid damaging the CNC machine \nmechanisms over time, the manufacturer recommends \nthat in ISF processes, the developed forces do not \nexceed half of the above-specified values. In this case, \nthe maximum radial and axial forces resulted from \nFEM simulation are smaller than the recommendation \nof the milling machine manufacturer. Fig. 9 shows the \nCNC milling machine, the sheet metal blank fixing \ndevice and a short overview of the setup used to \nimplement the ISF process \n[33].\nWith regard to parts forming, the numerical \nsimulation prediction that all the part configurations \ncan be manufactured without fracture was validated \nby machining the parts. Fig. 10 presents both the \nnumerically simulated and the manufactured parts for \nthree configurations using a step depth of 0.5 mm. \nThe conclusion of the case study is that the new \nsoftware tool is successfully integrated into an ISF \nprocess, and the selected part configurations were \nmanufactured without fracture in accordance with the \nnumerical simulation prediction. The considered CNC \nmilling machine can be used safely for machining the \npresented parts within future experimental research in \nthe field of incremental sheet metal forming.\n4  CONCLUSIONS\nIn the numerical simulation of incremental forming \nprocesses, the preparation of the FEM models is a \ntime-consuming stage because the FEM software \nsystems do not allow introducing the CAM \nprogrammed tool paths directly as inputs. The paper \npresents an original software tool named TMPG \nwhich ensures an easy way to obtain the tool path \npoints coordinates and their position time that \nhave to be introduced into ANSYS software for \nthe description of the tool motion. This software \ntool allows any user with no specialized software \nknowledge, the quick processing of the tool path \nCNC file, finalized with the generation of a text file \nthat contains the information needed to describe the \nsame tool trajectories in ANSYS software. The TMPG \nutility was proved in a case study of simulating an \nISF process of a different frustum of cone geometrical \nconfigurations, highlighting the importance of the \nsoftware tool in the FEM model preparation process. \nThe special utility of the new software tool developed \nby the authors consists in the fact that the ANSYS file \nfor tool movement description is obtained in a very \nshort time. By using the TMPG application, the FEM \nmodel preparation time is reduced substantially, thus \navoiding the manual processing or other complex \nsoftware tools that require additional knowledge and \nspecial skills.\n5  REFERENCES\n[1] Mulay, A., Ben S., Ismail S., Kocanda A. (2017). Experimental \ninvestigations into the effects of SPIF forming conditions on \nsurface roughness and formability by design of experiments. \nJournal of the Brazilian Society of Mechanical Sciences and \nEngineering, vol. 39, no. 10, p. 3997-4010, \nDOI:10.1007/\ns40430-016-0703-7.\n[2] Nasulea, D., Oancea, G. (2017). Incremental deformation: \nA literature review. 8\nth International Conference on \nManufacturing Science and Education, p. 03017, \nDOI:10.1051/matecconf/201712103017.\n[3] Jeswiet, J., Geiger, M., Engel, U., Kleiner, M., Schikorra, M., \nDuflou, J., Neugebauer, R., Bariani, P., Bruschi, S. (2008). \nMetal forming progress since 2000. CIRP Journal of \nManufacturing Science and Technology, vol. 1, no. 1, p. 2-17, \nDOI:10.1016/j.cirpj.2008.06.005.\n[4] Sharma, V., Gohil, A., Modi, B. (2017). Experimental \ninvestigation of single point incremental forming of aluminum \nsheet in groove test. Applied Mechanics and Materials, \nvol. 867, p. 177-183, \nDOI:10.4028/www.scientific.net/\nAMM.867.177.\n[5] Felippa, C. (2015) Introduction to Finite Element Methods, \nAppendix O index: The Origins of the Finite Element Method. \nfrom: http://www.colorado.edu/engineering/CAS/courses.d/\nIFEM.d/Home.html, accessed on 2018-26-04.\n[6] Pepelnjak, T., Milutinović, M., Plančak, M., Vilotić, D., \nRandjelović, S., Movrin D. (2016). The influence of extrusion \nratio on contact stresses and die elastic deformations in \nthe case of cold backward extrusion. Strojniški vestnik - \nJournal of Mechanical Engineering, vol. 62, no. 1, p. 41-50, \nDOI:10.5545/sv-jme.2015.3051.\n[7] Deng, W.J., Zhang, J.Y., Liu, L.W., He, D., Xia, W. (2017). \nSimulation analysis of a new chips recycling process termed \nforming extrusion cutting. International Journal of Simulation \nModelling, vol. 16, no. 4, p. 694-706, \nDOI:10.2507/\nIJSIMM16(4)CO16.\n[8] Trzepiecinski, T., Lemu, H.G., Fejkiel, R. (2017). Numerical \nsimulation of effect of friction directionality on forming \nof anisotropic sheets. International Journal of Simulation \nModelling, vol. 16, no. 4, p. 590-602, \nDOI:10.2507/\nIJSIMM16(4)3.392.\n[9] Blaga, A., Oleksik, V. (2013). A study of the influence of the \nforming strategy on main strains, thickness reduction and \nforces in single point incremental forming process. Advances \nStrojniški vestnik - Journal of Mechanical Engineering 64(2018)10, 643-651\n651Integrating a New Software Tool Used for Tool Path Generation in the Numerical Simulation of Incremental Forming Processes \nin Materials Science and Engineering, art. id. 382635, \nDOI:10.1155/2013/382635.\n[10] Gatea, S., Ou, H., McCartney, G. (2016). Review on the \ninfluence of process parameters in incremental sheet \nforming. The International Journal of Advanced Manufacturing \nTechnology, vol. 87, no. 1-4, p. 479-499, DOI:10.1007/s00170-\n016-8426-6.\n[11] Fu, Z., Mo, J., Han, F., Gong, P. (2013). Tool path correction \nalgorithm for single-point incremental forming of sheet \nmetal. The International Journal of Advanced Manufacturing \nTechnology, vol. 64, no. 9-12, p. 1239-1248, \nDOI:10.1007/\ns00170-012-4082-7.\n[12] Lemeš, S., Zaimović-Uzunović, N. (2008). Using buckling \nanalysis to predict wrinkling in incremental sheet metal \nforming. Strojniški vestnik - Journal of Mechanical Engineering, \nvol. 54, no. 2, p. 115-121.\n[13] Liu, N., Yang, H., Li, H., Yan, S. (2016). Plastic wrinkling \nprediction in thin-walled part forming process: A review. \nChinese Journal of Aeronautics, vol. 29, no. 1, p. 1-14, \nDOI:10.1016/j.cja.2015.09.004.\n[14] Nimbalkar, D.H., Nandedkar, V.M. (2013). Review of \nincremental forming of sheet metal components. International \nJournal of Engineering Research and Application, vol. 3, no. \n5, p. 39-51.\n[15] Robert, C., Dal Santo, P., Delamézière, A., Potiron, A., Batoz, JL. \n(2008). On some computational aspects for incremental sheet \nmetal forming simulations. International Journal of Material \nForming, vol. 1, p. 1195-1198, \nDOI:10.1007/s12289-008-\n0155-4.\n[16] Senthil, R., Gnanavelbabu, A. (2014). Numerical analysis on \nformability of AZ61A magnesium alloy by incremental forming. \nProcedia Engineering, vol. 97, p. 1975-1982, \nDOI:10.1016/j.\nproeng.2014.12.352.\n[17] Benedetti, M., Fontanari, V., Monelli, B., Tassan, M. \n(2015). Single-point incremental forming of sheet metals: \nExperimental study and numerical simulation. Proceedings \nof the Institution of Mechanical Engineers, Part B: Journal \nof Engineering Manufacture, vol. 231, no. 2, p. 301-312, \nDOI:10.1177/0954405415612351.\n[18] Naranjo, J., Miguel, V., Martínez-Martínez, A., Gómez-López, \nL.M., Manjabacas, M.C., Coello, J. (2015). Analysis and \nsimulation of single point incremental forming by ANSYS. \nProcedia Engineering, vol. 132, p. 1104-1111, DOI:10.1016/j.\nproeng.2015.12.602.\n[19] Ben Ayed, L., Robert, C., Delamézière, A., Nouari, M., Batoz, \nJ.L. (2014). Simplified numerical approach for incremental \nsheet metal forming process. Engineering Structures, vol. 62-\n63, p. 75-86, \nDOI:10.1016/j.engstruct.2014.01.033.\n[20] Sebastiani, G., Brosius, A., Tekkaya, A.E., Homberg, W., Kleiner, \nM. (2007). Decoupled simulation method for incremental \nsheet metal forming. AIP Conference Proceedings, vol. 908, p. \n1501-1506, \nDOI:10.1063/1.2741021.\n[21] Bambach, M. (2016). Fast simulation of incremental sheet \nmetal forming by adaptive remeshing and subcycling. \nInternational Journal of Material Forming, vol. 9, no. 3, p. 353-\n360, \nDOI:10.1007/s12289-014-1204-9.\n[22] Zhang, M.H., Lu, B., Chen, J., Long, H., Ou, H. (2015). \nSelective element fission approach for fast FEM simulation of \nincremental sheet forming based on dual-mesh system. The \nInternational Journal of Advanced Manufacturing Technology, \nvol. 78, no. 5-8, p. 1147-1160, \nDOI:10.1007/s00170-014-\n6723-5.\n[23] Salah, B.M.E., Hrairi, M. (2011). Process simulation and quality \nevaluation of incremental sheet forming. IIUM Engineering \nJournal, vol. 12, no. 3, p. 185-196.\n[24] Suresh, K., Khan, A., Regalla, S.P. (2013). Tool path definition \nfor numerical simulation of single point incremental forming. \nProcedia Engineering, vol. 64, p. 536-545, \nDOI:10.1016/j.\nproeng.2013.09.128.\n[25] Gusel, L., Rudolf, R., Brezocnik, M. (2015). Genetic based \napproach to predicting the elongation of drawn alloy. \nInternational Journal of Simulation Modelling, vol. 14, no. 1, p. \n39-47, \nDOI:10.2507/IJSIMM14(1)4.277.\n[26] Aguado, S., Velazquez, J., Samper, D., Santolaria, J. (2016). \nModelling of computer-assisted machine tool volumetric \nverification process. International Journal of Simulation \nModelling, vol. 15, no. 3, p. 497-510, \nDOI:10.2507/\nIJSIMM15(3)9.353.\n[27] Distance formula – MATHEMATICS (2018). from https://\nwww.britannica.com/science/distance-formula, accessed on \n2018-12-06.\n[28] ANSYS Documentation (2018). from http://www.ansys.stuba.\nsk/html/elem_55/chapter1/ES1-1.htm, accessed on 2018-\n26-04.\n[29] Behera, A. K., De Sousa, R.A., Ingarao, G., Oleksik, V. (2017). \nSingle point incremental forming: An assessment of the \nprogress and technology trends from 2005 to 2015. Journal \nof Manufacturing Processes, vol. 27, p. 37-62, \nDOI:10.1016/j.\njmapro.2017.03.014.\n[30] Oleksik, V. (2016). Numerical study about the influence of wall \nangle about main strains, thickness reduction and forces on \nsingle point incremental forming process. ACTA Universitatis \nCibiniensis - Technical Series, vol. 68, p. 1-6, \nDOI:10.1515/\naucts-2016-0001.\n[31] Oleksik, V. (2005). Theoretical and Experimental Research on \nIncremental Forming of Indigenous Metal Sheets, PhD thesis. \nLucian Blaga University of Sibiu, Sibiu. (in Romanian)\n[32] Balls screws - technical information (2018) from http://pdf.\ndirectindustry.com/pdf/hiwin/ballscrews/14370-67561.\nhtml, accessed on 2018-26-04.\n[33] Nasulea, D., Oancea, G. Design and manufacturing of a \nfixing device for incremental sheet forming process. 22\nnd \nInternational Conference on Innovative Manufacturing \nEngineering and Energy, vol. 178, art. no. 2004, \nDOI:10.1051/\nmatecconf/201817802004.",
  "topic": "Tool path",
  "concepts": [
    {
      "name": "Tool path",
      "score": 0.7531710267066956
    },
    {
      "name": "Computer science",
      "score": 0.6286864280700684
    },
    {
      "name": "Path (computing)",
      "score": 0.5414765477180481
    },
    {
      "name": "Software",
      "score": 0.5215896964073181
    },
    {
      "name": "Software tool",
      "score": 0.4688640236854553
    },
    {
      "name": "Software engineering",
      "score": 0.32726484537124634
    },
    {
      "name": "Process (computing)",
      "score": 0.16533103585243225
    },
    {
      "name": "Programming language",
      "score": 0.12110745906829834
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I3123573182",
      "name": "Transylvania University of Brașov",
      "country": "RO"
    }
  ]
}