{
    "title": "An IPT Battery Charger With Near Unity Power Factor and Load-Independent Constant Output Combating Design Constraints of Input Voltage and Transformer Parameters",
    "url": "https://openalex.org/W2900951799",
    "year": 2018,
    "authors": [
        {
            "id": "https://openalex.org/A2021104500",
            "name": "Xiaohui Qu",
            "affiliations": [
                "Southeast University"
            ]
        },
        {
            "id": "https://openalex.org/A2804451350",
            "name": "Chu Haijun",
            "affiliations": [
                "Southeast University"
            ]
        },
        {
            "id": "https://openalex.org/A2288445958",
            "name": "Siu Chung Wong",
            "affiliations": [
                "Hong Kong Polytechnic University"
            ]
        },
        {
            "id": "https://openalex.org/A2463691564",
            "name": "Chi K. Tse",
            "affiliations": [
                "Hong Kong Polytechnic University"
            ]
        },
        {
            "id": "https://openalex.org/A2021104500",
            "name": "Xiaohui Qu",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2804451350",
            "name": "Chu Haijun",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2288445958",
            "name": "Siu Chung Wong",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2463691564",
            "name": "Chi K. Tse",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W1982094904",
        "https://openalex.org/W2427848313",
        "https://openalex.org/W2322331227",
        "https://openalex.org/W2078070169",
        "https://openalex.org/W2460912126",
        "https://openalex.org/W2312550405",
        "https://openalex.org/W2555718399",
        "https://openalex.org/W2795809188",
        "https://openalex.org/W2107367628",
        "https://openalex.org/W2169922733",
        "https://openalex.org/W2095356712",
        "https://openalex.org/W3150014388",
        "https://openalex.org/W2098810578",
        "https://openalex.org/W2463504052",
        "https://openalex.org/W2099387901",
        "https://openalex.org/W2116324484",
        "https://openalex.org/W2037726546",
        "https://openalex.org/W2075323265",
        "https://openalex.org/W2765088853",
        "https://openalex.org/W2577508101",
        "https://openalex.org/W2139508499",
        "https://openalex.org/W2805021888"
    ],
    "abstract": "Inductive power transfer (IPT) techniques are becoming popular in battery charging applications due to some unique advantages compared to the conventional plug-in systems. A high-performance IPT charger should provide the battery with an efficient charging profile consisting of constant charging current and constant charging voltage. However, with a wide load range, it is hard to realize the initial load-independent constant current (CC) and the subsequent load-independent constant voltage (CV) using a single IPT converter while maintaining nearly unity power factor and soft switching of power switches simultaneously. This paper systematically analyzed the characteristics of an LCC-LCC compensated IPT converter and proposed a design method to realize the required load-independent CC and CV outputs at two zero-phase angle frequencies. The design also combats the constraints of an IPT transformer and input voltage, thus facilitating the use of a simple duty cycle control operating at two fixed frequencies for both CC and CV operations. The design criteria, control logic, and sensitivities of compensation parameters to the input impedance and load-independent output are discussed. Finally, an IPT battery charger prototype with 1 A charging current and 24 V battery voltage is built to verify the analysis.",
    "full_text": "FINAL ACCEPTED VERSION: IEEE TRANSACTIONS ON POWER ELECTRONICS, VOL XX, NO. X, MONTH 2019\nAn IPT Battery Charger With Near Unity Power\nFactor and Load-Independent Constant Output\nCombating Design Constraints of Input\nV oltage and Transformer Parameters\nXiaohui Qu , Member , IEEE, Haijun Chu , Siu-Chung Wong , Senior Member , IEEE,\nand Chi K. Tse, Fellow, IEEE\nAbstract—Inductive power transfer (IPT) techniques are becom-\ning popular in battery charging applications due to some unique\nadvantages compared to the conventional plug-in systems. A high-\nperformance IPT charger should provide the battery with an efﬁ-\ncient charging proﬁle consisting of constant charging current and\nconstant charging voltage. However, with a wide load range, it is\nhard to realize the initial load-independent constant current (CC)\nand the subsequent load-independent constant voltage (CV) using\na single IPT converter while maintaining nearly unity power factor\nand soft switching of power switches simultaneously. This paper\nsystematically analyzed the characteristics of an LCC–LCC com-\npensated IPT converter and proposed a design method to realize\nthe required load-independent CC and CV outputs at two zero-\nphase angle frequencies. The design also combats the constraints\nof an IPT transformer and input voltage, thus facilitating the use\nof a simple duty cycle control operating at two ﬁxed frequencies for\nboth CC and CV operations. The design criteria, control logic, and\nsensitivities of compensation parameters to the input impedance\nand load-independent output are discussed. Finally, an IPT bat-\ntery charger prototype with 1 A charging current and 24 V battery\nvoltage is built to verify the analysis.\nIndex T erms—Inductive power transfer (IPT) battery charger,\nLCC–LCC compensation, load-independent outputs, soft switch-\ning, unity power factor.\nI. I NTRODUCTION\nT\nHE use of inductive power transfer (IPT) techniques has\ngained popularity in battery charging applications, from\nthe low-power battery charging of cell phones [1]–[3] to high-\npower battery charging of electric vehicles (EVs) [4]–[7]. Cur-\nManuscript received June 22, 2018; revised August 24, 2018 and October\n22, 2018; accepted November 9, 2018. This work was supported in part by the\nNatural\n Science Foundation of Jiangsu Province, China (BK20181280), in part\nby the Fundamental  Research Funds for Central Universities of China, and  in\npart by the Hong Kong RGC General Research Fund (PolyU 152082/17E).\nRecommended for publication by Associate Editor J. Acero. (Corresponding\nauthor: Xiaohui Qu.)\nX. Qu and H. Chu are with the School of Electrical Engineering,  South-\neast University, Nanjing 210096, China (e-mail:,xhqu@seu.edu.cn; chuhaij@\n163.com).\nS. C. Wong and C. K. Tse are with the Department of Electronic and Informa-\ntion Engineering, The Hong Kong Polytechnic University, Hong Kong (e-mail: ,\nenscwong@polyu.edu.hk; michael.tse@polyu.edu.hk).\nColor versions of one or more of the ﬁgures in this paper are available online\nat http://ieeexplore.ieee.org.\nDigital Object Identiﬁer 10.1109/TPEL.XXX\nFig. 1. Typical charging proﬁle of a lithium-ion battery.\nrently, the high-performance lithium-ion battery is being widely\nused in various energy storage applications with the advantages\nof high energy density, negligible memory effect, and low self-\ndischarge rate. Fig. 1 shows a typical lithium-ion battery charg-\ning proﬁle, where two dominant charging modes occur with an\ninitial constant current (CC) mode and a subsequent constant\nvoltage (CV) mode. The battery charging starts with CC mode\nwhile the battery voltage increases. When the battery voltage\nreaches a speciﬁed level, the charging process will change from\nCC to CV . The charging ends until the current decreases to near\nzero. Both the charging current for CC mode and the charging\nvoltage for CV mode are speciﬁed by the material properties\nand inner connection of battery cells. To extend the battery life-\ntime and recycle time, an IPT charger should deliver current\nefﬁciently to the battery according to the charging proﬁle.\nThe transmitter and receiver in an IPT battery charger are\nthe primary and secondary windings of a loosely coupled trans-\nformer, which has a relatively large amount of uncoupled mag-\nnetic ﬂux ﬂeeing into the air. It is well known that the output\npower can be dramatically maximized by operating the reso-\nnant transmitter and receiver at the same resonant frequency.\nThus, the compensation circuits, which facilitate the formation\nof resonance tanks, are crucial in an IPT converter. As a res-\nonant converter, the IPT converter has complex characteristics\nof output voltage, output current, input impedance, efﬁciency,\netc., all of which involve transformer coupling and load varia-\ntion. In the cell phone battery charging application, a charging\nplatform with the uniform magnetic ﬁeld is usually designed\nto avoid coupling variation [8], [9]. In the EV battery charging\napplication, new technologies in smart EVs with self-driving\nand parking capabilities [10], [11] can minimize variations of\nThis is the Pre-Published Version.\n The following publication X. Qu, H. Chu, S. Wong and C. K. Tse, \"An IPT Battery Charger With Near Unity Power Factor and Load-Independent Constant \nOutput Combating Design Constraints of Input Voltage and Transformer Parameters,\" in IEEE Transactions on Power Electronics, vol. 34, no. 8, pp. 7719-7727, \nAug. 2019, is available at https://doi.org/10.1109/TPEL.2018.2881207.\n© 2018 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including \nreprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse \nof any copyrighted component of this work in other works.\nmisalignment and coupling in both stationary and dynamic IPT\ncharging applications. These technologies can be readily used\nin the existing IPT systems to improve the performance. How-\never, the equivalent load of a battery in the charging process\nis always varying. From Fig. 1, the equivalent resistance as a\nratio of the battery voltage to the charging current is increasing\ncontinuously and signiﬁcantly from CC mode to CV mode of\noperations, which complicates the design of the IPT charger.\nTo achieve the required output charging voltage and current, a\nvariable frequency control is usually used to regulate the out-\nput voltage or current, whereas the input impedance may not\nbe resistive, causing a large reactive power and increasing the\ncomponent volt–ampere (V A) ratings. To eliminate the reactive\npower within the circuit, the variable frequency control may aim\nto realize a zero-phase angle (ZPA) between the input voltage\nand current, whilst the output voltage and current are regulated\nby a front-end converter or a downstream converter. Obviously,\nthe additional power conversion stage makes the whole system\nuneconomical, bulky, and inefﬁcient, although it has a wide\nrange of regulation [7].\nIn view of the aforementioned issues, a well-designed com-\npensation circuit of an IPT charger is expected to have a near\nresistive input impedance for decreasing component power rat-\nings and load-independent CC and CV outputs for providing the\ninherent regulation against load variation. Moreover, a slight\ntwist of frequency or modulation can achieve a slightly in-\nductive input impedance for zero-voltage switching (ZVS) of\nMOSFETs and a slightly capacitive input impedance for zero-\ncurrent switching of IGBTs that the converter efﬁciency can be\nfurther improved. At the input ZPA frequency, the series–series\n(SS) and parallel–parallel compensation networks can realize\nload-independent CC output, whereas the series-parallel and\nparallel-series compensation can realize load-independent CV\noutput [12], [13]. However, the converter transfer function and\nthe load-independent CC and CV properties of IPT converters\nusing any of the four basic compensation networks are greatly\nrestricted by the transformer parameters. Given a set of input\nvoltage and transformer parameters, higher order compensation\nnetworks are introduced with greater design freedom for achiev-\ning the required CC and CV outputs [14]–[17]. To achieve the\nbattery required initial CC and the subsequent CV charging, an\nIPT converter can operate at two separate frequencies. However,\nonly one operating frequency can achieve input ZPA, and the\nother operating frequency will be reactive. Such a design has\nbeen implemented in [18] by using the SS compensation and in\n[19] by using the LCC–LCC compensation to realize the load-\nindependent CC output at ZPA frequency and load-independent\nCV output at non-ZPA frequency that may come with signiﬁ-\ncant reactive power and large component stresses. Some hybrid\ntopologies are proposed by integrating two sets of compensa-\ntion circuits operating at a single ZPA frequency, where one\nset of compensation circuits realizes the load-independent CC\noutput and the other set of compensation circuits realizes the\nload-independent CV output [20], [21]. The mode transition\ndepends on some bidirectional power switches, usually imple-\nmented by two\nMOSFETs or IGBTs in anti-series or anti-parallel\nconﬁguration. These bidirectional power switches are dissipa-\nIEEE TRANSACTIONS ON POWER ELECTRONICS, VOL XX, NO. X, MONTH 2019\ntive components on the power path that their losses can be\nsigniﬁcant.\nIt is desirable that an IPT converter has at least two load-\nindependent ZPA operating frequencies, one with a CC out-\nput and the other with a CV output, satisfying the charging\nproﬁle of the battery. Vu et al. [22] have proved that the LCC–\nLCC compensated IPT converter has ZPA operating frequencies\nfor both CC and CV outputs. However, transformer parame-\nters in [22] must be designed for the required set of design\nconstraints, which include two ZPA operating frequencies, and\nload-independent CC and CV outputs. In many applications,\nthe IPT transformer is often space constrained, and the trans-\nformer parameters should be included the set of design con-\nstraints instead of the set of design parameters in [22], which\nalso makes it impossible to perform optimization in CC and\nCV output amplitudes. Without an additional front-end con-\nverter or a downstream converter, the output charging current\nand voltage cannot be regulated for the required battery charging\nproﬁle. To address these issues, this paper gives a systematical\nanalysis of the LCC–LCC compensated IPT charger. From the\ncharacteristics analyzed, a design method for the IPT charger\nis proposed. Given a set of design constraints that includes the\nrequired load-independent CC and CV outputs for charging the\nbattery, an IPT transformer, and an input dc voltage with a small\nvariation, compensation components in the LCC–LCC network\nare designed by using a simple duty cycle control operating\nat two ﬁxed frequencies to realize the initial CC charging and\nthe subsequent CV charging of the battery. The sensitivities of\ninput impedance, output current and voltage to the variations\nof compensation parameters, and their effects on achieving soft\nswitching for the required outputs are also discussed in detail.\nFinally, a prototype of the IPT charger with 1 A charging current\nand 24 V battery voltage is built to verify the analysis in this\npaper.\nSpeciﬁcally, Section II analyzes the construction method of\nthe LCC–LCC compensation network with at least two ZPA\nfrequencies for both load-independent CC output and load-\nindependent CV output. The design to combat the constraints\ndue to the IPT transformer and input voltage are derived theoret-\nically for battery chargers. Section III shows the detailed imple-\nmentation of the system with frequency selection, control logic,\nsensitivity analysis, and ZVS realization. The performance\nof the LCC–LCC compensated IPT charger is evaluated in\nSection IV. Finally, Section V concludes this paper.\nII. CONSTRUCTION OF LCC–LCC COMPENSATION\nNETWORK WITH TWO ZPA FREQUENCIES FOR\nLOAD-INDEPENDENT CC AND CV OUTPUTS\nAs discussed in Section I, for battery charging applications,\nan LCC–LCC compensated IPT converter should be designed\nwith input ZPA at two operating angular frequencies ωCC and\nωCV for load-independent CC and load-independent CV out-\nputs, given any input dc voltage and transformer parameters.\nTo facilitate the analysis, the IPT converter using LCC–LCC\ncompensation is driven by a pure sinusoidal ac voltage source\nvIN with an angular frequency ω, and delivers power to an\nQU et al.: IPT BA TTERY CHARGER WITH NEAR UNITY POWER FACTOR AND LOAD-INDEPENDENT CONSTANT\nFig. 2. Schematic of an LCC–LCC compensated IPT converter as a two-port\nnetwork, where the T model of loosely coupled transformer is in shaded area.\nFig. 3. Typical T network.\nequivalent load RE , as shown in Fig. 2. The loosely coupled\ntransformer is modeled as a three-parameter T network where\nLP and LS are the self-inductances of the primary side and\nsecondary side, and M is the mutual inductance. LP and LS\nare independent. The primary LCC network is composed by the\nexternal elements L1, CP 1, and CP 2, whereas the secondary\nLCC network is composed by L2, CS1, and CS2. ˙Vin , ˙Iin , ˙Vo,\nand ˙Io are phasor variables of vIN , iIN , vO , and iO , respectively.\nA. Acquisition of ωCC With Load-Independent CC Output\nThe IPT converter can be simpliﬁed as a two-port network\nwith the transmission matrix A, as shown in Fig. 2, where A\nsatisﬁes\n[\n˙Vin , ˙Iin\n]T\n= A\n[\n˙Vo,− ˙Io\n]T\n. (1)\nThe network can be further decomposed into three cascading\nsubnetworks with the transfer matrices satisfying\nA = A\n1A2A3. (2)\nEach subnetwork is a typical T network. It is known that the\ninput impedance of a T network is purely resistive under the\ncondition of Z\n1 = −Z2 = Z3, as shown in Fig. 3. Besides, by\napplying Th ´ evenin’s and Norton’s theorems, ifL1 and CP 1 in\nthe subnetwork of A1 are in resonance at ω, subnetwork A1\nfed by the input voltage source ˙Vin can be converted to a load-\nindependent current source, as shown in Fig. 4. Because M and\n−M in subnetwork A2 must be in resonance at some frequency,\nsubnetwork A2 fed by a current source can be transformed to\na load-independent voltage source. If L2 and CS1 in subnet-\nwork A3 are in resonance at ω, subnetwork A3 fed by a voltage\nsource can be transformed to a load-independent current source\nM ˙Vin\njω CC L1 L2\n, which can charge the battery load directly. Consid-\nering the ZPA realization condition of Z1 = −Z2 = Z3 for a\nT network, the LCC–LCC compensation parameters should sat-\nisfy (3), where the resonant angular frequency ω is rewritten as\nωCC , i.e.,\n{\nωCC L1 = 1\nωCC CP 1\n= ωCC LP − 1\nωCC CP 2\nand\nωCC L2 = 1\nωCC CS 1\n= ωCC LS − 1\nωCC CS 2\n. (3)\nThus, the angular frequency ω of vIN should be tuned at ωCC\nfor the CC mode charging. The charging current ˙Io is given by\n˙Io = − M ˙Vin\njωCC L1L2\n. (4)\nObviously, more design freedom of the output CC can be\nachieved by adjusting the external inductors L1 and L2.\nB. Acquisition of ωCV With Load-Independent CV Output\nTo ﬁnd another operating frequency that achieves the load-\nindependent voltage output, it is assumed that the operating\nangular frequency ω = αω\nCC . The external inductors L1 and\nL2 are further deﬁned as\nL1 = ξ1LP , and L2 = ξ2LS . (5)\nUsing (3), the external capacitors CP 1, CP 2, CS1, and CS2 can\nbe expressed as α2\nω2 LP ξ1\n, α2\nω2 LP (1−ξ1 ) , α2\nω2 LS ξ2\n, and α2\nω2 LS (1−ξ2 )\nat αωCC . Here, ξ1 and ξ2 are restricted by inequalities given\nby 0 <ξ 1 < 1 and 0 <ξ 2 < 1 to ensure that CP 2 and CS2 are\nnon-zero capacitors. If ξ1 = 1 and ξ2 = 1, impedances of CP 2\nand CS2 are zero, which is actually the LC–LC compensation\n[24], [25]. The equivalent parameters operating at αωCC are\nshown in Fig. 5. Thus, matrices A1, A2, and A3 are given by\n⎧\n⎪⎪\n⎪\n⎪\n⎪⎪⎪\n⎪\n⎪\n⎪\n⎪\n⎪\n⎪\n⎨\n⎪⎪\n⎪\n⎪\n⎪\n⎪\n⎪\n⎪⎪⎪\n⎪\n⎪\n⎪\n⎩\nA\n1 =\n⎡\n⎣1 − α2 jωLP\n(\n2 − α2 − 1−ξ1\nα2\n)\njα 2\nξ1 ωL P\n(1−α2 )\nξ1\n⎤\n⎦\nA\n2 =\n[\n0 −jωM\n1\njωM 0\n]\nA3 =\n⎡\n⎣\n(1−α2 )\nξ2\njωLS\n(\n2 − α2 − 1−ξ2\nα2\n)\njα 2\nξ2 ωL S\n1 − α2\n⎤\n⎦.\n(6)\nIt is found that all elements in the diagonal of A\n1, A2, and\nA3 are real and all off-diagonal elements are imaginary. Thus,\nA in (2) can be expressed as\nA =\n[ a11 ja12\nja21 a22\n]\n(7)\nwhere a11 , a12 , a21 , and a22 are all real. Substituting (6) into\n(2), we have\n⎧\n⎪⎪\n⎪\n⎪⎪⎪\n⎪\n⎪\n⎪\n⎪\n⎪\n⎨\n⎪⎪\n⎪\n⎪\n⎪\n⎪\n⎪\n⎪\n⎪⎪⎪\n⎩\na\n11 =\n[\nLP\nξ2 M\n(\n2 − α2 − 1−ξ1\nα2\n)\n+ M\nξ2 LS\nα2\n]\n(1 − α2)\na12 = ωLP LS\nM\n(\n2 − α2 − 1−ξ1\nα2\n)(\n2 − α2 − 1−ξ2\nα2\n)\n−ωM(1 − α2)2\na21 = −(1−α2 )2\nωξ 1 ξ2 M + α4 M\nωξ 1 ξ2 LP LS\na22 =\n[\nLS\nξ1 M\n(\n2 − α2 − 1−ξ2\nα2\n)\n+ M\nξ1 LP\nα2\n]\n(1 − α2).\n(8)\nIEEE TRANSACTIONS ON POWER ELECTRONICS, VOL XX, NO. X, MONTH 2019\nFig. 4. Derivation of the load-independent CC output for an LCC–LCC compensated IPT converter.\nFig. 5. Schematic of the IPT converter in Fig. 2 operating at another angular\nfrequency αωCC .\nTo have ω qualiﬁed as an input ZPA frequency, the input\nimpedance is obtained as\nZIN =\n˙Vin\n˙Iin\n= a11 RE + ja12\na22 + ja21 RE\n(9)\n= (a11 a22 + a21 a12 )RE + j(a12 a22 − a11 a21 R2\nE )\na22 2 + a21 2R2\nE\n.\n(10)\nZIN is expected to be purely resistive, which implies a12 a22 −\na11 a21 R2\nE =0 for any RE . Hence, we have\na12 a22 =0 and a11 a21 =0 . (11)\nAs the two-port network A only consists of linear passive\ninductors, capacitors, and parasitic resistors, it is a reciprocal\nnetwork. By the principle of reciprocity, the elements of A\nsatisfy\na11 a22 + a12 a21 =1 . (12)\nSolving (11) and (12), two possible solutions are given as fol-\nlows: {\nCase 1: a\n11 =0 and a22 =0 .\nCase 2: a12 =0 and a21 =0 . (13)\nFor Case 1, a11 =0 and a22 =0 ,w eh a v e a12 a21 =1 .T h e\nmatrix is rewritten as⎡\n⎣\n˙Vin\n˙Iin\n⎤\n⎦ = A\n⎡\n⎣\n˙V\no\n− ˙Io\n⎤\n⎦ =\n[ 0 ja\n12\nja21 0\n] ⎡\n⎣\n˙V\no\n− ˙Io\n⎤\n⎦. (14)\nThe corresponding solution is given by\n˙I\no = −\n˙Vin\nja12\n= ja21 ˙Vin . (15)\nObviously, in Case 1, there is no ZPA frequency for the load-\nindependent CV output. Substituting a11 =0 and a22 =0 into\n(8) and solving, the only solution is α =1 , i.e., ω = ωCC .\nIn addition, if ξ1 = ξ2 = ξ, load-independent CC output can\nbe achieved at two frequencies α1ωCC and α2ωCC , where\nα1,2 =\n√\n1 ±\n√\n1 −(1 −k 2 )(1 −ξ )\n1 −k 2 . Here, k is the coupling coefﬁcient of\nFig. 6. Three frequencies fCC , fCC1 ,a n df CC2 for (a) load-independent CC\noutput, and (b) input ZPA as an example of k = 0.367 and ξ1 = ξ2 = 0.1.\nthe loosely coupled transformer given by k = M√LP LS\n.F i g .6\nshows an example with fCC = ωCC\n2π = 200 kHz and k = 0.367.\nIf ξ1 and ξ2 are designed equal to 0.1, there are another two\nfrequencies fCC1 = α1fCC = 156 kHz and fCC2 = α2fCC =\n260 kHz to satisfy the load-independent CC output and input\nZPA simultaneously.\nFor Case 2, a12 =0 and a21 =0 ,w eh a v e a11 a22 =1 .T h e\nmatrix is rewritten as\n⎡\n⎣\n˙Vin\n˙Iin\n⎤\n⎦ = A\n⎡\n⎣\n˙V\no\n− ˙Io\n⎤\n⎦ =\n[ a\n11 0\n0 a22\n] ⎡\n⎣\n˙V\no\n− ˙Io\n⎤\n⎦ . (16)\nThe corresponding solution is given by\n˙V\no =\n˙Vin\na11\n= a22 ˙Vin . (17)\nSubstituting a12 =0 and a21 =0 into (8) and solving, solutions\nexist under two conditions of 1\nξ1\n+ 1\nξ2\n= (1±k)2\nk2 .\n1) If 1\nξ1\n+ 1\nξ2\n= (1−k)2\nk2\n˙Vo = −\n√\nLS\nLP\nξ2\nξ1\n˙Vin and αCV =\n√\n1\n1 − k > 1. (18)\nQU et al.: IPT BA TTERY CHARGER WITH NEAR UNITY POWER FACTOR AND LOAD-INDEPENDENT CONSTANT\nFig. 7. LCC–LCC compensated IPT charger.\n2) If 1\nξ1\n+ 1\nξ2\n= (1+ k)2\nk2\n˙Vo =\n√\nLS\nLP\nξ2\nξ1\n˙Vin and αCV =\n√\n1\n1+k < 1. (19)\nC. Design Criteria for Battery Charging\nFrom the above-mentioned analysis, the selection of ξ1 and\nξ2, i.e., L1 and L2 plays an important role in the compensation\ncharacteristics. For a given input voltage, output charging pro-\nﬁle, and IPT transformer, ξ1, ξ2, ωCC , and ωCV can be uniquely\ndetermined by solving the following equations:\n⎧\n⎪⎪\n⎪\n⎪⎪⎨\n⎪⎪\n⎪\n⎪⎪⎩\n˙I\no = − M ˙Vin\njω CC LP LS ξ1 ξ2\n1\nξ1\n+ 1\nξ2\n= (1±k)2\nk2\n˙Vo = ±\n√\nLS\nLP\nξ2\nξ1\n˙Vin\nωCV = ωCC\n√\n1\n1±k .\n(20)\nWith the calculated values of ξ1 and ξ2, L1 and L2 can be\nfound by (5). Then, the other compensation components of CP 1,\nCP 2, CS1, and CS2 can be obtained by solving (3). In this way,\nan LCC–LCC compensated IPT charger can realize the input\nZPA and output initial CC and subsequent CV operations, sat-\nisfying the constraints imposed by the input voltage and trans-\nformer parameters. Here, two groups of ωCC , ωCV and their\ncorresponding compensation parameters are available, whose\nselection depends on the application and its speciﬁed frequen-\ncies. If the frequencies are conﬁrmed, a simple ﬁxed frequency\ncontrol operating at two frequencies ωCC and ωCV for both\ncharging modes can fulﬁll all design requirements.\nIII. D ESIGN AND IMPLEMENTATION OF AN LCC–LCC\nCOMPENSATED IPT C HARGER\nAs analyzed in Section II, an IPT charger using LCC–LCC\ncompensation, as shown in Fig. 7, can be designed. The full-\nbridge switches Q\n1,2,3,4 operate at ωCC or ωCV to generate\na square voltage vAB . Here, the input dc voltage VDC can be\nmodulated by Q1,2,3,4 with D being the duty cycle of vAB half\ncycle. The fundamental component of vAB , denoted as vIN ,i s\ngiven as\nvIN (t)= 4VDC\nπ sin πD\n2 sin (ωt + θ). (21)\nA full-bridge diode rectiﬁer and C ﬁlter are used to rectify the\nac output current and ﬁlter the ripple voltage before connecting\nto the output battery. The speciﬁed voltage and current of the\nbattery are VBAT and IBAT , respectively. Fig. 8 shows the input\nand output waveforms of the secondary rectiﬁer.\nFig. 8. Waveforms of the IPT secondary rectiﬁer.\nUsing (4) and (21), the equivalent output current after the\nfull-bridge rectiﬁcation in CC mode is given by\nIBAT = 2IOpeak\nπ = 8\nπ2\nVDC sin πD\n2\nωCC LP LS ξ1ξ2\n. (22)\nUsing (18), (19), and (21), the output voltages in CV mode under\nboth conditions are the same and given as\nV\nBAT = πVOpeak\n4 =\n√\nLS\nLP\nξ2\nξ1\nVDC sin πD\n2 . (23)\nGiven an IPT transformer, input voltage, and the required battery\nvoltage and current, the design of ξ\n1, ξ2, and ωCC is achieved by\nsolving (22), (23), and 1\nξ1\n+ 1\nξ2\n= (1±k)2\nk2 . The results are given\nby\n⎧\n⎪⎪\n⎪\n⎪\n⎪\n⎪\n⎨\n⎪⎪\n⎪\n⎪\n⎪\n⎪\n⎩\nξ\n1 = L1\nLP\n= k2\n(1±k)2\n(\n1+VDC sin πD\n2\nVBAT\n√\nLS\nLP\n)\nξ2 = L2\nLS\n= k2\n(1±k)2\n(\n1+ VBAT\nVDC sin πD\n2\n√\nLP\nLS\n)\nωCC = 8\nπ 2 I BAT k 3\n(1 ±k )4\n( √\nL S\nV BAT\n+\n√\nL P V BAT\nV DC sin πD\n2\n) 2 .\n(24)\nSubstituting ξ1, ξ2, and ωCC into (3), the LCC–LCC param-\neters of L1, CP 1, CP 2, L2, CS1, and CS2 can be calculated.\nTo permit the ZVS turning- ON of MOSFETs Q1,2,3,4, the input\nimpedance should be slightly inductive in both modes of CC\nand CV . Fig. 9 shows the phase angles of input impedance ver-\nsus the different normalized parameters and load conditions for\nthe two modes of operation. During the charging process, the\nbattery equivalent load R\nBAT increases from Rmin in CC mode,\nRmid at the mode transition, to Rmax in CV mode. From Fig. 9,\nin both CC and CV modes, a slight increment of L1 and decre-\nments of CP 1 and CP 2 will fulﬁll the objective. Additionally,\nthe sensitivity of parameters to the converter output voltage and\ncurrent should be inspected. The normalized output current in\nCC mode and the normalized output voltage in CV mode versus\nthe normalized parameters of L\n1, CP 1, and CP 2 are shown in\nFig. 10. Obviously, the variation of L1 is not sensitive to both the\noutput current and output voltage in the two modes of operation.\nThus, a small increment of L\n1 facilitates the ZVS realization of\nQ1,2,3,4.\nThe operating frequency ωCV in CV mode can also be calcu-\nlated by ωCV = ωCC\n√\n1\n1±k . Thus, the duty cycle control under\nIEEE TRANSACTIONS ON POWER ELECTRONICS, VOL XX, NO. X, MONTH 2019\nFig. 9. Phase angle of input impedance versus normalized parameters. (a) CC\nmode: RBAT = Rmin . (b) CC mode: RBAT = Rmid . (c) CV mode: RBAT =\nRmid . (d) CV mode: RBAT = Rmax .\nFig. 10. Normalized output with varying normalized parameters. (a) CC\nmode: RBAT = Rmin . (b) CC mode: RBAT = Rmid . (c) CV mode: RBAT =\nRmid . (d) CV mode: RBAT = Rmax .\ntwo ﬁxed switching frequencies fCC and fCV can be used to\nadjust the required output battery current and voltage. Fig. 11\nshows the control logic, where the ﬁrst CC operation enables\nthe current loop to realize the required CC charging, i.e., venCC\n= 1 and venCV = 0. The duty cycle is generated by a saw-\ntooth waveform with frequency fCC . When the battery voltage\nrises to the speciﬁed level Vref , the current loop is closed with\nvenCC = 0 and the voltage control loop with venCV = 1 is ac-\ntivated with operating frequency fCV . In this way, any small\nvariation in input voltage, transformer parameters, and compen-\nsation parameters and output voltage or current drop due to the\nFig. 11. Schematic of control logic for the IPT charger.\nFig. 12. Photo of the prototype IPT charger.\nTABLE I\nCALCULA TEDPARAMETERS FOR TWO CONDITIONS IN CV M ODE\ncomponent parasitic resistance can be easily compensated by\nthe feedback controller with the required charging current and\nvoltage and ZVS operation.\nIV . E XPERIMENTAL EVA L UAT I O N\nTo verify the above-mentioned analysis, a prototype IPT\ncharger using LCC–LCC compensation has been built to charge\na battery with 1 A charging current and 24 V battery voltage,\nas shown in Fig. 12. The input dc voltage is 32 V and the duty\ncycle D is designed as 0.95. An arbitrary IPT transformer is con-\nstructed, which is measured with parameters L\nP = 16.18 μH,\nLS = 15.52 μH, M = 5.82 μH, and k = 0.367. The calculated\nξ1, ξ2, fCC , and fCV for both conditions of CV mode opera-\ntion are given in Table I. Here, fCC = 206.6 kHz and fCV =\n259.9 kHz are chosen, where the design of inverter and mag-\nnetic components is relatively easy. In some applications, the\nfrequency may be within a design speciﬁcation, such as cell\nphone battery charging with Qi standard. If the two operating\nfrequencies do not fall within a design speciﬁcation, inductances\nL\nP and/or LS can be adjusted with smaller values for higher\nfCC and fCV , and vice versa, according to analytical equations\n(20) and (24). This may not be possible or can be very time con-\nsuming by using the numerical iteration given in [22]. Here, we\nQU et al.: IPT BA TTERY CHARGER WITH NEAR UNITY POWER FACTOR AND LOAD-INDEPENDENT CONSTANT\nTABLE II\nCALCULA TED AND MEASURED PARAMETERS FOR LCC–LCC\nCOMPENSA TIONNETWORK\nFig. 13. Experimental waveforms of vGS1 , vAB , iIN ,a n di BAT in CC charg-\ning mode and RBAT of (a) 12 Ω and (b) 24 Ω.\naccept the designed values of LP and LS and thus the operat-\ning frequencies fCC and fCV . The calculated and experimental\nparameters in the LCC–LCC compensation circuit are listed in\nTable II according to the equations given in Section III. To re-\nalize the ZVS, the experimental value of L1 is chosen to be\nslightly larger than the calculated value. From the sensitivity\nanalysis of these components, the experimental values of C\nP 1,\nCP 2, L2, CS1, and CS2 are consistent with the calculated results\nfor the required battery charging current and voltage. The output\nﬁlter uses C\nO of 220 μF. Switches Q1,2,3,4 are IRF530 and sec-\nondary rectiﬁer diodes are MBRB3030CT. A dc electronic load\nfrom Chroma is used to emulate the EV battery. A phase-shift\ncontrol is used here with a ﬁxed frequency duty cycle control.\nA feedback control using the digital controller TMS320F28335\nis applied to realize the two ﬁxed frequencies transition. The\nsensed signals can be feed back wirelessly using the mature\nwireless communication technology in [7] and [26].\nAt the beginning of charging, the battery current should be\nkept at 1 A with the equivalent battery load R\nBAT = vBAT\niBAT\nin-\ncreasing, whereas the battery voltage is increasing toward the\nrequired 24 V . During the CC charging phase, venCV is 0 and\nvenCC is 1, as shown in Fig. 11. The controller enables the cur-\nrent feedback loop at operating frequency fCC .F i g .1 3s h o w s\nthe measured waveforms of gate drive voltage vGS1 , modulated\nvoltage vAB , input current iIN , and output current iBAT in CC\nFig. 14. Transient waveforms from CC mode to CV mode with mode enable\nsignal venCV and (a) vAB , iIN and (b) iBAT and vBAT .\nFig. 15. Transient waveforms from CC mode to CV mode with mode enable\nsignal venCV and (a) vCP1 , vCP2 , iL1 and (b) vCS1 , vCS2 , iL2 .\ncharging mode for two values of RBAT , i.e., 12 Ω and 24 Ω.T h e\nbattery current is kept at 1 A under CC charging. The waveform\nof iIN is always nearly in phase with vAB , which illustrates\nthat the IPT charger has been well compensated with nearly\nzero reactive power, and the small phase angle of iIN lagging\nvAB ensures the ZVS of the full-bridge switches. When RL\nreaches 24 Ω, i.e., vBAT arrives at the required 24 V , and the\ncharging process transits from CC mode to CV mode. V oltage\nvenCV is 1 and venCC is 0. The controller in Fig. 11 disables\nthe current loop and enables the voltage feedback loop at oper-\nating frequency f\nCV . Fig. 14(a) shows the operating frequency\nchanging from fCC to fCV , whereas the battery voltage vBAT\nIEEE TRANSACTIONS ON POWER ELECTRONICS, VOL XX, NO. X, MONTH 2019\nFig. 16. Experimental waveforms of vGS1 , vAB , iIN ,a n d vBAT in CV\ncharging mode and RBAT of (a) 24 and (b) 48 Ω.\nFig. 17. Measured charging process versus the equivalent battery load.\nand current iBAT change smoothly during the mode transition,\nas shown in Fig. 14(b). The current across each compensation\ninductor and the voltage over each compensation capacitor be-\nfore and after the mode transition are also given in Fig. 15.\nThe steady-state waveforms of vGS1 , vAB , iIN , and vBAT in CV\ncharging mode are shown in Fig. 16(a) and (b) for RBAT being\n24 and 48 Ω. At the new operating frequency fCV , the required\nload-independent CV output, near ZPA input and ZVS realiza-\ntion of Q\n1,2,3,4 are all achieved, giving low power stresses and\nhigh transfer efﬁciency.\nThe whole charging process is shown in Fig. 17. The experi-\nmental data are consistent with the theoretical piecewise-linear\ncurve. The measured efﬁciency using Yokogawa WT1800E\npower analyzer is shown in Fig. 18 for the whole charging\nprocess, where the efﬁciency sag at the mode transition is due\nto the smaller current ﬂowing into primary and secondary wind-\nings of the transformer in CC mode as a result of the changing\nimpedance at different operating frequencies. The power loss\nbreakdown among the circuit components is shown in Fig. 19,\nwhen the power transfer efﬁciency is highest at R\nBAT of 24 Ω in\nCC mode. The power losses in the compensation inductors, IPT\ntransformer primary and secondary windings, M\nOSFETs, and\nrectiﬁer diodes can be calculated by their inner resistances and\nFig. 18. Measured efﬁciency versus the equivalent battery load.\nFig. 19. Power loss breakdown among circuit components at RBAT of 24 Ω\nin CC mode.\nthe measured resonant currents. Fig. 19 shows that the primary\nand secondary windings of loosely coupled transformer dissi-\npate most of the power loss because of their relatively larger\nresonant currents than the other components at the CC mode\ncharging condition.\nV. C\nONCLUSION\nIn this paper, an LCC–LCC compensated IPT converter is\ndesigned to achieve the ZPA and load-independent CC and CV\noutput for battery charging applications. This paper also pro-\nposed a design method to combat the constraints imposed by\nthe IPT transformer and input dc voltage. The characteristic of\nload-independent output permits the implementation of a sim-\nple duty cycle control at two ﬁxed frequencies. Moreover, the\nsensitivity of the converter output and input impedance against\nvariation of compensation components is analyzed. It is found\nthat near zero reactive power and soft switching of the power\nswitches with high output current and voltage accuracy can be\nmaintained over a wide operating range. The design method in\nthis paper can be extended to the other higher order compensa-\ntion topologies with more design freedom.\nR\nEFERENCES\n[1] Y . Jang and M. M. Jovanovi ´c, “A contactless electrical energy transmis-\nsion system for portable-telephone battery chargers,” IEEE Trans. Ind.\nElectron., vol. 50, no. 3, pp. 520–527, Jun. 2003.\n[2] B. Choi, J. Nho, H. Cha, T. Ahn, and S. Choi, “Design and implementation\nof low-proﬁle contactless battery charger using planar printed circuit board\nwindings as energy transfer device,” IEEE Trans. Ind. Electron., vol. 59,\nno. 1, pp. 140–147, Feb. 2004.\n[3] S. Y . Hui, “Planar wireless charging technology for portable electronic\nproducts and Qi,” Proc. IEEE , vol. 101, no. 6, pp. 1290–1301, Jun. 2013.\n[4] J. Sall ´an, J. L. Villa, and J. F. Sanz, “Optimal design of ICPT system\napplied to electric vehicle battery charge,” IEEE Trans. Ind. Electron.,\nvol. 56, no. 6, pp. 2140–2149, Jun. 2009.\nQU et al.: IPT BA TTERY CHARGER WITH NEAR UNITY POWER FACTOR AND LOAD-INDEPENDENT CONSTANT\n[5] G. A. Covic and J. T. Boys, “Inductive power transfer,” Proc. IEEE,\nvol. 101, no. 6, pp. 1276–1289, Jun. 2013.\n[6] S. Li and C. C. Mi, “Wireless power transfer for electric vehicle applica-\ntions,”IEEE J. Emerg. Sel. Topics Power Electron. , vol. 3, no. 1, pp. 4–17,\nMar. 2015.\n[7] Z. Li, C. Zhu, J. Jiang, K. Song, and G. Wei, “A 3-kW wireless power\ntransfer system for sightseeing car supercapacitor charge,” IEEE Trans.\nPower Electron., vol. 32, no. 5, pp. 3301–3316, May 2017.\n[8] X, Liu and S. Y . R. Hui, “Equivalent circuit modeling of a multilayer planar\nwinding array structure for use in universal contactless battery charging\nplatform,” IEEE Trans. Power Electron., vol. 22, no. 1, pp. 21–29, Jan.\n2007.\n[9] J, Achterberg, E. A. Lomonova, and J. de Boeij, “Coil array structures\ncompared for contactless battery charging platform,” IEEE Trans. Magn. ,\nvol. 44, no. 5, pp. 617–622, May 2008.\n[10] Popular Sci., “Tesla car can be summoned and park itself,” 2016. [On-\nline] Available: https://www.popsci.com/creeping-toward-kitt-now-tesla-\ncan-be-summoned-and-park-itself-video\n[11] Nissan Motor Corporation, Yokohama, Japan, “Wireless charging\nsystem,” 2017. [Online] Available: https://www.nissan-global.com/EN/\nTECHNOLOGY/OVERVIEW/wcs.html\n[12] W. Zhang, S. C. Wong, C. K. Tse, and Q. Chen, “Load-independent duality\nof current and voltage outputs of a series or parallel compensated inductive\npower transfer converter with optimized efﬁciency,” IEEE J. Emerg. Sel.\nTopics Power Electron., vol. 3, no. 1, pp. 137–146, Mar. 2015.\n[13] W. Zhang and C. C. Mi, “Compensation topologies of high-power wire-\nless power transfer systems,” IEEE Trans. V eh. Technol., vol. 65, no. 6,\npp. 4768–4778, Jun. 2016.\n[14] X. Qu, Y . Jing, H. Han, S. C. Wong, and C. K. Tse, “Higher order com-\npensation for inductive-power-transfer converters with constant voltage\nor constant-current output combating transformer parameter constraints,”\nIEEE Trans. Power Electron., vol. 32, no. 1, pp. 394–405, Jan. 2017.\n[15] S. Li, W. Li, J. Deng, T. D. Nguyen, and C. Mi, “A double-sided LCC\ncompensation network and its tuning method for wireless power transfer,”\nIEEE Trans. V eh. Technol., vol. 64, no. 6, pp. 2261–2273, Jun. 2015.\n[16] H. Feng et al., “An LCC-compensated resonant converter optimized for\nrobust reaction to large coupling variation in dynamic wireless power\ntransfer,” IEEE Trans. Ind. Electron., vol. 63, no. 10, pp. 6591–6601, Oct.\n2016.\n[17] T. Kan, T. D. Nguyen, J. C. White, R. K. Malhan, and C. Mi, “A new\nintegration method for an electric vehicle wireless charging system using\nLCC compensation topology: Analysis and design,” IEEE Trans. Power\nElectron., vol. 32, no. 2, pp. 1638–1650, Feb. 2017.\n[18] Z. Huang, S. C. Wong, and C. K. Tse, “Design of a single-stage inductive-\npower-transfer converter for efﬁcient EV battery charging,” IEEE Trans.\nV eh. Technol., vol. 66, no. 7, pp. 5808–5821, Jul. 2017.\n[19] J. Lu, G. Zhu, D. Lin, S. C. Wong, and J. Jiang, “Load-independent voltage\nand current transfer characteristics of high-order resonant network in IPT\nsystem,” IEEE J. Emerg. Sel. Topics Power Electron. , to be published.\n[20] X. Qu, H. Han, S. C. Wong, and C. K. Tse, “Hybrid IPT topologies with\nconstant-current or constant-voltage output for battery charging applica-\ntions,” IEEE Trans. Power Electron., vol. 30, no. 11, pp. 6129–6337, Nov.\n2015.\n[21] R. Mai, Y . Chen, Y . Li, Y . Zhang, G. Cao, and Z. He, “Inductive power\ntransfer for massive electric bicycles charging based on hybrid topology\nswitching with a single inverter,” IEEE Trans. Power Electron., vol. 32,\nno. 8, pp. 5897–5906, Aug. 2017.\n[22] V . B. Vu, D. H. Tran, and W. J. Choi, “Implementation of the constant\ncurrent and constant voltage charge of inductive power transfer systems\nwith the double-sided LCC compensation topology for electric vehicle\nbattery charge applications,” IEEE Trans. Power Electron., vol. 33, no. 9,\npp. 7398–7410, Sep. 2018.\n[23] Wireless Charging of Electric and Plug-in Hybrid V ehicles , SAE Int. Stan-\ndard J2954, 2010. [Online] Available: http://standards.sae.org/wip/j2954/\n[24] U. K. Madawala and D. J. Thrimawithana, “A bidirectional inductive\npower interface for electric vehicles in V2G systems,” IEEE Trans. Ind.\nElectron., vol. 58, no. 10, pp. 4789–4796, Oct. 2011.\n[25] X. Qu et al., “Wide design range of constant output current using double-\nsided LC compensation circuits for inductive power transfer applications,”\nIEEE Trans. Power Electron., to be published.\n[26] O. Knecht and J. W. Kolar, “Performance of series-compensated IPT sys-\ntems for high power transcutaneous energy transfer,” IEEE Trans. Power\nElectron., to be published.\nXiaohui Qu (S’08–M’10) received the B.Eng. and\nM.Eng. degrees in electrical engineering from the\nNanjing University of Aeronautics and Astronautics,\nNanjing, China, in 2003 and 2006, respectively, and\nthe Ph.D. degree in power electronics from The Hong\nKong Polytechnic University, Hong Kong, in 2010.\nIn 2010, she joined the School of Electrical Engi-\nneering, Southeast University, Nanjing, China, where\nshe is currently a Full Professor with research focus\non power electronics. From January 2015 to January\n2016, she was a Visiting Scholar with the Center of\nReliable Power Electronics, Aalborg University, Denmark. Her current research\ninterests include LED lighting systems, wireless power transfer, and power elec-\ntronics reliability.\nDr. Qu was a recipient of the Outstanding Reviewer Award and the Prize\nPaper Award from IEEE Transactions on Power Electronics in 2017 and 2018.\nHaijun Chu received the B.Eng. degree in electrical\nengineering from the Nanjing Institute of Technol-\nogy, Nanjing, China, in 2016. He is currently working\ntoward the M.Eng. degree in electrical engineering at\nSoutheast University, Nanjing, China.\nHis current research interest mainly includes wire-\nless power transfer.\nSiu-Chung Wong (M’01–SM’09) received the B.Sc.\ndegree in physics from the University of Hong\nKong, Hong Kong, in 1986, the M.Phil. degree in\nelectronics from The Chinese University of Hong\nKong, Hong Kong, in 1989, and the Ph.D. degree\nfrom the University of Southampton, Southampton,\nU.K., in 1997.\nHe is currently an Associate Professor with\nthe Department of Electronic and Information En-\ngineering, The Hong Kong Polytechnic University,\nHong Kong, where he conducts research in power\nelectronics.\nDr. Wong is an Associate Editor for the IEEE T\nRANSACTIONS ON CIRCUITS\nAND SYSTEMS II, an Editor for the Energy and Power Engineering Journal ,\nand a Member of the editorial board of the Journal of Electrical and Control\nEngineering.\nChi K. Tse (M’90–SM’97–F’06) received the B.Eng.\n(Hons.) degree in electrical engineering and the\nPh.D. degree from the University of Melbourne, Mel-\nbourne, VIC, Australia, in 1987 and 1991, respec-\ntively.\nHe is currently the Chair Professor with Hong\nKong Polytechnic University, Hong Kong, where he\nserved as the Head of the Department of Electronic\nand Information Engineering, from 2005 to 2012. His\nresearch interests include power electronics, nonlin-\near systems, and complex network applications.\nProf. Tse was a recipient of a number of research and industry awards,\nincluding Prize Paper Awards by IEEE T\nRANSACTIONS ON POWER ELECTRON-\nICS in 2001, 2015, and 2018, RISP Journal of Signal Processing Best Paper\nAward in 2014, Best paper Award by International Journal of Circuit Theory\nand Applications in 2003, two Gold Medals at the International Inventions Ex-\nhibition in Geneva in 2009 and 2013, and a Silver Medal at the International\nInvention Innovation Competition in Canada in 2016. He is currently serving\nas an Editor-in-Chief for the IEEE T\nRANSACTIONS ON CIRCUITS AND SYSTEMS\nII (2016–2019). He has also served as an Editor-in-Chief for IEEE C IRCUITS\nAND SYSTEMS MAGAZINE (2012–2015), IEEE C IRCUITS AND SYSTEMS SOCI-\nETY NEWSLETTER (since 2007), and is on the editorial boards of a few other\njournals."
}