{
  "title": "Smart Transformer Based Loop Power Controller in Radial Power Distribution Grid",
  "url": "https://openalex.org/W2904764542",
  "year": 2018,
  "authors": [
    {
      "id": "https://openalex.org/A2075450994",
      "name": "Chandan Kumar",
      "affiliations": [
        "Indian Institute of Technology Guwahati"
      ]
    },
    {
      "id": "https://openalex.org/A1993071709",
      "name": "Xiang Gao",
      "affiliations": [
        "Kiel University"
      ]
    },
    {
      "id": "https://openalex.org/A1981475371",
      "name": "Marco Liserre",
      "affiliations": [
        "Kiel University"
      ]
    },
    {
      "id": "https://openalex.org/A2075450994",
      "name": "Chandan Kumar",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A1993071709",
      "name": "Xiang Gao",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A1981475371",
      "name": "Marco Liserre",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2688604271",
    "https://openalex.org/W1834350974",
    "https://openalex.org/W2100682478",
    "https://openalex.org/W2617819196",
    "https://openalex.org/W6731638876",
    "https://openalex.org/W2082226269",
    "https://openalex.org/W2537453777",
    "https://openalex.org/W2161180722",
    "https://openalex.org/W2030371713",
    "https://openalex.org/W1973629023",
    "https://openalex.org/W2101409276",
    "https://openalex.org/W2567008272",
    "https://openalex.org/W2174897738",
    "https://openalex.org/W2442002586",
    "https://openalex.org/W1484104892",
    "https://openalex.org/W1763243278",
    "https://openalex.org/W2567349745"
  ],
  "abstract": "In electric distribution grid, increased penetration of renewable energy sources (RES) and electric vehicles (EV) will create several challenging issues such as voltage limits violation in the feeder, line congestion, transformer overloading, etc. These issues could be mitigated using a loop power controller (LPC), by looping the radial distribution system. The LPC is realized either using a back-to-back power converter or with a combination of tap changer and phase shifter transformers. This paper introduces smart transformer (ST), an alternative of line frequency transformer (LFT), to additionally achieve the features of conventional LPC. The ST can achieve operational features of the conventional LPC with effective control and communication functionalities. The ST controls the active and reactive power flow in the radial distribution feeders to achieve voltage regulation in the feeder, loading balancing in the feeders, prevents LFT overloading, etc. Moreover, DC links of the ST also provide an opportunity to integrate energy storage and it allows the ST in the proposed configuration to support the grid during the peak load demand. These advantages of ST in a two feeder radial grid are validated through PSCAD based simulation studies.",
  "full_text": "  \n                                                                                         \n \n \n \n© 2018 IEEE. Personal use of this material is permitted . Permission from IEEE must be obtained for \nall other uses, in any current or future media, including reprinting/republishing this material for \nadvertising or promotional purposes, creating new collective works, for resale or redistribution to \nservers or lists, or reuse of any copyrighted component of this work in other works.  \n \nDigital Object Identifier (DOI): 10.1109/ISGTEurope.2018.8571844 \n \n2018 IEEE PES Innovative Smart Grid Technologies Conference Europe (ISGT -Europe), Sarajevo, \nBosnia and Herzegovina, 2018 \n \nSmart Transformer Based Loop Power Controller in Radial Power Distribution Grid \nChandan Kumar \nXiang Gao \nMarco Liserre \n \nSuggested Citation \nC. Kumar, X. Gao and M. Liserre, \"Smart Transformer Based Loop Power Controller in Radial Power \nDistribution Grid,\" 2018 IEEE PES Innovative Smart Grid Technologies Conference Europe (ISGT-\nEurope), Sarajevo, Bosnia and Herzegovina, 2018, pp. 1-6. \nSmart Transformer Based Loop Power Controller in\nRadial Power Distribution Grid\nChandan Kumar, Senior Member, IEEE Xiang Gao*, Student Member, IEEE\nDepartment of Electronics and Electrical Engineering Marco Liserre**, Fellow, IEEE\nIndian Institute of Technology Guwahati, India Christian-Albrechts-University of Kiel, Germany\nchandank@iitg.ac.in *xg@tf.uni-kiel.de,**ml@tf.uni-kiel.de\nAbstract—In electric distribution grid, increased penetration\nof renewable energy sources (RES) and electric vehicles (EV)\nwill create several challenging issues such as voltage limits\nviolation in the feeder, line congestion, transformer overloading,\netc. These issues could be mitigated using a loop power controller\n(LPC), by looping the radial distribution system. The LPC is\nrealized either using a back-to-back power converter or with a\ncombination of tap changer and phase shifter transformers. This\npaper introduces smart transformer (ST), an alternative of line\nfrequency transformer (LFT), to additionally achieve the features\nof conventional LPC. The ST can achieve operational features of\nthe conventional LPC with effective control and communication\nfunctionalities. The ST controls the active and reactive power ﬂow\nin the radial distribution feeders to achieve voltage regulation\nin the feeder, loading balancing in the feeders, prevents LFT\noverloading, etc. Moreover, DC links of the ST also provide an\nopportunity to integrate energy storage and it allows the ST in\nthe proposed conﬁguration to support the grid during the peak\nload demand. These advantages of ST in a two feeder radial grid\nare validated through PSCAD based simulation studies.\nIndex Terms—Loop power control, smart transformer, radial\ndistribution grid.\nI. I NTRODUCTION\nPower generation through renewable energy sources such\nas photovoltaic (PV) and wind are highly unpredictable in\nnature, and it is difﬁcult to maintain feeder voltage within\nthe allowable range [1]. A radial power distribution system\nconsisting of two feeders is shown in Fig. 1. Feeder 1 has\nmany distribution generators (DG) installed, whereas feeder 2\nconsists of only loads. In this scenario, it is possible that line\nfrequency transformer (LFT) of feeder 2 may be overloaded\nduring the peak load demand with signiﬁcant voltage reduction\nat the end of the feeder. Moreover, the feeder 1 LFT may get\noverloaded during the peak DG power generation with increase\nin feeder voltage. With this type of voltage unbalance, it is\ndifﬁcult for power utility to set the voltage at the medium\nvoltage grid for satisfactory operation of the distribution\ngrid [2]. Moreover, it is important to achieve load balancing\nbetween the feeders so that the load demand can be distributed\nequally between the feeder and the LFTs, and the LFTs are\nnot overloaded.\nGrid reconﬁguration schemes are used to eliminate the\neffects of load unbalancing and line congestion [3]. How-\nHV DG DG DG\nM\nMV LV\nFeeder 2\nFeeder 1\nLoads\nLoads\nFig. 1. Schematic of two-feeder radial distribution grid.\never, these are not suitable for highly variable DG power\nsources. Power electronics solutions such as distribution static\ncompensator (DSTATCOM), static var compensation (SVC),\netc, are proposed and found to be suitable for realizing the\nload balancing and voltage regulation [4], [5]. But, these are\nnot effective in multifeeder system. Loop power controller\n(LPC) is one of the most potential solutions for power control\nbetween the feeders while ensuring allowable voltage in the\nfeeders [6]–[8]. The LPC, where two radial feeders are looped\ntogether, is realized either by using a back-to-back (BTB)\npower converter or with a combination of tap changer and\nphase shifter transformers. The LPC can provide reactive\npower compensation in the feeders independently to reduce\nthe voltage variation, and also controls the power ﬂow between\nthe feeders such that the feeder LFTs are not overloaded.\nRecently, power electronic based transformer called smart\ntransformer (ST) is demonstrated for its application in power\ndistribution grid as an alternative of LFT [9], [10]. Control,\ncommunication, and power management are essential features\nof an ST, which sets it apart from the LFT. The most suitable\nconﬁguration of ST in electric grid is three stage power\nconversion with two intermediate DC links. Besides the basic\noperation of voltage transformation and isolation between\nmedium voltage (MV) and low voltage (LV) grid, the ST\nhas more functionalities for improving the performance of\nelectric grid. [9] introduces the additional capability of ST,\nsuch as resonance damping, voltage improvement and load\ncompensation features in MV grid, load voltage control in LV\ngrid, etc. These applications of ST in distribution grid show\nthat the ST can control the waveforms of currents in MV side\nand voltages in LV side independently depending upon the\n978-1-5386-4505-5/18/$31.00 c⃝2018 IEEE\nµT\nHV\nMV\nAC LV\nST-fed AC feederPV\nµW\n3\n2\nB\nA\nC\nD\n4\nM\nNo ST fed feeder\nAC LV\nMV DC link\n4\n2\n2\n4\n2\n2\n2\n3\n3\nLV DC link\nµT\nHV\nMV\nAC LV\nPV\nµW\n3\n2\nB\nA\nC\nD\n4\nM\n4\n2\n2\n4\n2\n2\n2\n3\n3\nBESS\nBESS\nµT\nHV\nMV\nAC LV\nPV\nµW\n3\n2\nB\nA\nC\nD\n4\nM\n4\n2\n2\n4\n2\n2\n2\n3\n3\nBESS\nLPC\nFig. 2. Schematic of two-feeder radial distribution grid. (a) Feeders without any control. (b) LPC connected between the feeders. (c) ST based system where\none of the LFT and LPC is replaced be an ST.\nrequired services.\nConsidering the potentials of ST in the distribution grid, this\npaper proposes its application not only to realize features of\nLFT but also to achieve the advantages of conventional LPC.\nIn the proposed conﬁguration, the ST replaces one of the LFT\nand the LPC.\nThis paper is organized as follows: descriptions of conven-\ntional LPC integrated radial feeder and proposed ST based\nradial feeder conﬁguration are explained in Section II; in\nSection III the control mechanism of power converters of\nST is provided. Different operating modes of ST in proposed\nconﬁguration are explained in Section IV . Simulation results\nare given in Section V . Conclusions are drawn in Section VI.\nII. D ESCRIPTION OF DISTRIBUTION GRID\nCONFIGURATION\nA. Conventional LPC Integrated Distribution Grid\nThe conventional radial electric grid is shown in Fig. 2(a).\nIn this conﬁguration, each of the feeder uses an LFT. The\nprimary of LFT is connected to 11 kV MV side grid, whereas\nsecondary is connected to LV side of 400 V . One feeder has\nsigniﬁcantly large installed DG whereas other feeder has more\nloads including electrical vehicles charging station. These\ncreate voltage variations throughout the feeder at peak DG\ngeneration or peak load demand and additionally overload the\nfeeders/LFTs. For power balancing and maintaining voltage\nthroughout the feeders, loop power ﬂow control is realized\nusing LPC. The schematic is shown in Fig. 2(b) where the LPC\nis connected at the furthest end of the line. The LPC is realized\neither using back-to-back power converters or through the\nphase shift and tap changer transformers [7]. Depending upon\nthe distance between the feeders, the LPC can be connected\nwith or without the step up LFTs [8]. The back-to-back power\nconverters control active and reactive powers in both the\nfeeders to maintain allowable voltage magnitude throughout\nthe feeders. Moreover, power balancing between the feeders\nis also achieved which avoids overloading of the two LFTs.\nThe LPC is installed at the point where generally open switch\nis provided. During high penetration of DG in one feeder,\nthe LPC transfers the active from to the feeder with loads.\nMoreover, during peak load conditions, the LPC uses the\nlightly loaded feeder to support the loads.\nB. Proposed ST based Radial Distribution Grid Conﬁguration\nThe proposed radial grid conﬁguration is shown in Fig.\n2(c). In this conﬁguration, the ST replaces one of the feeder\nLFT and the two feeders are connected through the conven-\ntional open switch scheme. Moreover, the LPC is completely\nremoved from the electric grid. The ST, used in this work,\nis a three stage transformer and can control the power ﬂow\nfrom MV to LV grid and vice versa. The both MV ac-dc\nconverter and LV dc-ac converter of ST can control active\nand reactive powers in the MV and LV grid. Moreover, the\nST can modify the voltage magnitude of the LV ac grid so\nthat the voltage level does not violate the operating limits.\nThe only constraints that the ST must respect is the active\npower demand from the LV grid, while voltage amplitude and\nfrequency in LV side and reactive power injection in MV side\nrepresent degrees of freedom for the grid management. Unlike\nother power electronics devices such as inverter of DG, where\nthe maximum capability of reactive power supply is restricted\nby a certain power factor, e.g. 0.95 (inductive/capacitive), the\nAC\nDC AC\nDCDC\nDC\nLmv\nMV AC \nGrid\nist-mv\nvt\nist-mv\nvt\nVdc-mv*\n* Current  \nController\nVdc-mv\nCdc-mv Cdc-lv\nVdc-mv\nMVDC link and \nPower Controller \nfor Reference \nGeneration\n *\nPST-MV\n*\nPower Flow and \nLVDC Link \nVoltage Control\nVdc-lv\nVdc-lv*\nVoltage-Current \nCascaded \nController\nClv\nLlv\nvl\nil\nvl\nil\nLV AC \nGrid\nVdc-lv\nvl*\nist-mv\nQST-MV\nFig. 3. Smart transformer control scheme in the proposed conﬁguration.\ncapability of reactive power supply by ST is only limited by\nthe maximum current and active power demand.\nThe dc-dc converter of ST has two main tasks: adapting the\nvoltage from MV to LV and controlling the voltage level of\nthe LV DC link. This is regulated by means of a power ﬂow\ncontroller and it regulates the power ﬂow between the two DC\nstages to keep the LV DC link voltage at its nominal value.\nThe power constraints are set between Pmax, determined by\nthe ST sizing, and Pmin, that can be set or equal to −Pmax.\nThe ST LV side converter controls the voltage waveform in\nthe LV grid. The ST provides a symmetrical voltage waveform\nwith ﬁxed amplitude and frequency independently from the\nload power request. The current waveform is instead decided\nsolely by the load.\nThe LV converter of ST, having ﬂexibility of providing\nvoltage magnitude at LV AC grid, can regulate its terminal\nvoltages at a suitable magnitude which will provide an allow-\nable voltage throughout both the feeders. Another important\nfeature is that the MV converter of ST will compensate for the\nremaining reactive power requirement of the feeders resulting\nin exchange of only active power from the MV grid. During\nthe high DG penetration, the ST can store the surplus power\nin the battery energy storage system (BESS) installed at the\nLVDC link of the ST. In case of peak load demand, the ST\ncontrol action can again limit the power ﬂow from the LFT\nby extracting appropriate active power from the BESS.\nIII. C ONTROL MECHANISM OF ST IN PROPOSED\nCONFIGURATION\nFig. 3 shows the control block diagram for ST in the\nproposed conﬁguration. The MV side converter regulates the\nvoltage of the MVDC link capacitor and controls the active\nas well as reactive powers exchanged with the MV grid.\nMoreover, the reactive power is a degree of freedom for the\nST MV converter: the ST can work at unity power factor,\nprovide reactive power compensation, or support the voltage\nby providing reactive power. In this paper, voltage at the MV\ngrid is assumed to be ﬁxed by utility. The reactive power\ncontrol in MV grid is limited to support the reactive power\nrequirement of feeder with LFT [11].\nThe dc-dc converter steps down the MVDC link voltage to a\nregulated lower voltage at LVDC link. The power ﬂow balance\nin the converter circuit is maintained by controlling the phase\nshift angle of the pulsed voltages of the two converters linked\nthrough the high frequency transformer [9].\nThe ST LV converter maintains appropriate voltages at the\nLV AC terminals. The control of the LV stage is cascaded\nvoltage-current control [11].\nIV. D IFFERENT OPERATING MODES OF ST IN PROPOSED\nCONFIGURATION\nIn the proposed conﬁguration, the ST provides several op-\nerational features by operating in different modes. Generation\nof reference active and reactive powers are important for ST\nMV converter operation, whereas appropriate load voltage\nmagnitude and angle is important for maintaining allowable\nvoltage throughout the feeders. The ﬂow chart for control\nscheme implementation is shown in Fig. 4. The control scheme\ngives ﬁrst priority to maintain feeder voltages within the\nallowable limits. In this paper, a variation of 5% from the rated\nvalue is taken as allowable limits. Using Newton Raphson\nload ﬂow method [12], voltages at the different buses are\ncomputed. If the feeder voltages violates the predeﬁned limit,\nminimization of voltage variations scheme is implemented\nusing the voltage sensitivity analysis as reported in [13]. Based\non the analysis, appropriate active and reactive powers is\nsupplied by the ST LV converter. However, in case the voltage\nvariations are within the limits with the active power balancing\nmethod, the same is implemented.\nA. Power Balancing Control Scheme\nConventionally, the power balancing control algorithm en-\nsures that the active and reactive powers in both the feeders are\nbalanced. In the proposed scheme, not only the advantages of\nconventional LPC is preserved, but additionally, the reactive\npower demand of the feeder 2 is compensated by the MV\nconverter of ST. Therefore, MV grid only exchanges active\npower. Let the active power demands of feeder 1 and 2 arePL1\nand PL2, respectively. Also, DG power generation by feeder\n1 and 2 are PDG1 and PDG2, respectively. For the power\nbalancing in the feeders, the power ﬂow through the each\nfeeder (same through ST and LFT) is computed as follows:\nPST = PDG1 + PDG2\n2 − PL1 + PL2\n2 − Ploss\n2 (1)\nwhere Ploss is losses in MV converter. If this power ( PST )\nis limited by the ST, the LFT will also exchange same power\nwith the MV grid.\nLet the reactive power demands of feeders 1 and 2 are QL1\nand QL2, respectively. Moreover, a fraction of the reactive\npower demand will be met by the ST LV converter. The\nremaining reactive power demand of loads will be supplied by\nStart of  \noptimization\nLoad flow \ncalculation  \nCheck for \nvoltage \nlimits  \nviolations\nCompute power \nbalance set point\nYes Compute the set point \nfor  minimization of \ntotal voltage \nvariations \nNo\nImplement the \npower balancing \ncontrol scheme \nImplement the \nminimization of total \nvoltage variations \ncontrol scheme \nFig. 4. Flow chart for control scheme implementation.\nDG\nDG\nDG\nDG\nL1\nL2\nL3\nL4\nL5\nL6\nL7\nL8\nL9\nL10\nT1 T2\nBESSST\nS1\nS2\nFig. 5. Radial distribution system under consideration.\nthe ST MV converter. Let QST −LV is reactive power supplied\nby the LV converter then MV convertor reactive power is\ncomputed as follows:\nQST −MV = (QL1 + QL2) − QST −LV . (2)\nB. Minimization of Voltage Variations Control\nFor the three-phase system, let the total buses in the\nsystem are M. In the LV AC grid with three-phase four-wire\nconﬁguration, each phase can be considered separately and\ntherefore, an unbalanced network be analyzed with single\nphase computations. Node equation relating voltage at each\nbus and current injected to each bus, for three phases a, b,\nand c, is given as\n[\n¯Ij\nabc]\n=\n[¯Yabc][\n¯Vj\nabc]\n(3)\nwhere\n[¯Yabc]\nis bus admittance matrix. Conventional load\nﬂow analysis using Newton Rapshon method is implemented\nto compute the voltages at the different buses of the feeder. If\nthe power balancing control scheme can not maintain feeder\nvoltages within limits, then minimization of voltage variations\nalgorithm is implemented. The voltage at the ST LV converter\nterminal is maintained such that the voltage throughout the\nfeeders 1 and 2 remains within the allowable limits, by\nsupplying appropriate active and reactive powers.\nBased on the sensitivity analysis outlined in [13], [14],\nvoltage sensitivity coefﬁcients for the different buses are\ncomputed.\nkP,m = ∂Vm\n∂PST\n, m = 1, . . . , M. (4)\nkQ,m = ∂Vm\n∂QST\n, m = 1, . . . , M. (5)\nThese coefﬁcients are computed with respect to the pre-\ndeﬁned voltage at the LV AC terminal, which is maintained by\nthe ST LV converter. Based on the iteration process, a suitable\nvoltage is computed which helps to minimize the total voltage\nvariations along the feeder within the allowable range.\nmin\n△QMV−ST\n{ M∑\nm=1\n(VMV,m + KQ,m∆QMV−ST − V ∗)2\n}\n(6)\nMoreover, this voltage is maintained through appropriate\ninjection of active and reactive powers into the LV distribution\ngrid with the restriction of the size of ST.\nP2\nST + Q2\nST ≤ S2\nST. (7)\nC. ST based BESS Grid Supporting Control\nThe BESS connected at the LVDC of ST can support the\nactive power demand of loads during the peak load demand. In\nthat case, both the LV and MV converters of ST can be utilized\nto inject active power to the loads. The amount of support\ndepends upon the capacity of the battery bank. In general if\nthe MV and LV converters support active power of PST −MV\nand PLV −ST , respectively then the power supplied by the MV\ngrid is as follows:\nPMV = (PL1 + PL2) − (PDG1 + PDG2)\n−(PST −MV + PST −LV ). (8)\nWhen BESS is activated for supporting the loads during\npeak demand, it is necessary to maintain feeder voltages within\nthe allowable limits. Therefore, the ST LV converter active\npower is computed based on the minimization of voltage\nvariations control action. After injecting active power through\nLV power converter, the additional available BESS power is\nsupplied into the MV grid through the ST MV converter.\nTherefore, the ST MV converter power injection is\nPST −MV = PBESS −rated − PST −LV . (9)\nIn addition to supporting the electric grid during peak\nload demand, active power support from both MV and LV\nconverters also improves utilization of ST in this proposed\nconﬁguration.\nTABLE I\nLOAD OF FEEDER I\nBus No. Peak penetraion Low penetration\nDG generation (kV A) Load (kV A) DG generation (kV A) Load (kV A)\nL1 0 10+j2 0 20+j4\nL2 30 20+j4 10 30+j6\nL3 10 20+j4 0 20+j4\nL4 50 10+j2 25 20+j4\nL5 100 20+j4 50 20+j4\nTABLE II\nLOAD OF FEEDER II\nBus No. Peak load (kV A) Low load (kV A)\nL6 30+j6 15+j3\nL7 80+j16 40+j8\nL8 50+j10 25+j5\nL9 25+j5 12.5+j2.5\nL10 60+j12 30+j6\nV. C ASE STUDY\nThe conﬁguration of radial distribution system considered\nin this paper is shown in Fig. 5. Both feeders are derived from\n[15]. Both the LFTs and ST are rated for 220 kV A. Feeder 1\nconsists of signiﬁcant DG whereas feeder 2 has mainly loads.\nLoads and DG penetration information for both the feeders\nare given in Tables I and II. The system is implemented using\npower system computer aided design (PSCAD) software. Four\ncases are considered and explained as follows.\nCase I: High DG Penetration and High Load Demand\nThe ﬁrst case considers the high DG penetration and high\nload demand case simultaneously. The voltage magnitude at\ndifferent buses are in Fig. 6(a). Firstly, both the feeders use\nLFT without loop and it can be seen that the voltages at bus\nL4, L5, L7, L8, L9, and L10 are outside the allowable limits.\nFor buses L4 and L5, the voltage is higher than the limit.\nMoreover, the voltages are lower than the minimum threshold\nfor other buses. When the LFT is replaced by ST in feeder 1\nand power balancing control is activated, the voltage at all the\nbuses are within the limits. In the power balancing control, the\nactive power in the ST is set as given by (1). It ensures that the\nfeeder with LFT also exchanges same amount of power. The\npower balancing is able to bring bus voltages within the limits.\nThe minimization of voltage variations scheme is implemented\nto see the effects of this control action. It can be observed\nthat the voltages are more close to the nominal value when\nthe minimization of voltage variations scheme is activated.\nCase II: Low DG Penetration and High Load Demand\nIn this case, low DG penetration and high load demand is\nassumed. The voltages are shown in Fig. 6(b). The voltages at\nbuses L7, L8, L9, L10 are below the minimum value required.\nWith the power balancing control action, the voltages at all\nthe buses are improved and brought within the limits, except,\nthe voltage at bus L7 is still below 0.95 p.u. Therefore, the\npower balance control scheme is not sufﬁcient to maintain an\n(a) \n(b)\n(c)\n1.05\n0.95\n1.05\n0.95\n1.05\n0.95\nNo loop\nPower balancing \ncontrol\nMin. of voltage \nvariations control\nVoltage (pu)Voltage (pu)Voltage (pu)\nL1 L2 L3 L4 L5 L6 L7 L8 L9 L10\nBus No.\nL1 L2 L3 L4 L5 L6 L7 L8 L9 L10\nBus No.\nL1 L2 L3 L4 L5 L6 L7 L8 L9 L10\nBus No.\n1.0\n1.00\n1.0\nFig. 6. V oltage proﬁle at different buses for different control schemes. (a)\nHigh DG penetration and high load demand. (b) Low DG penetration and\nhigh load demand. (c) High DG penetration and low load demand.\nallowable voltage in the feeders. However, once the minimiza-\ntion of voltage variations control action is realized, all the bus\nvoltages are improved, brought within the limits and are more\nclose to the nominal value.\nCase III: High DG Penetration and Low Load Demand\nThis case investigates high DG penetration and low load\ndemand scenario. Without any control with open lines, the\nvoltages at bus L4 and L5 are more than 1.05 p.u as shown\nin Fig. 6(c). Activating the loop power control strategy, the\nvoltages are within the limits. If the minimization of voltage\nvariations control is considered, the bus voltages are more\nNo loop, no BESS\nNo loop, with BESS\nST based BESS grid \nsupporting control\n1.05\n0.95\nVoltage (pu)\nBus No.\nL1 L2 L3 L4 L5 L6 L7 L8 L9 L10\n1.0\nFig. 7. V oltage proﬁle at different buses for different control schemes with\nhigh load demand with BESS (without DG penetration.)\ncloser to the nominal voltage.\nFrom the above results, it can be concluded that the loop\npower control with the ST can improve the voltage proﬁle in\nthe feeders. In case this method is not sufﬁcient, minimization\nof voltage variations control action brings the bus voltages\nwithin the allowable limits.\nCase IV: High Load Demand with BESS (No DG Available)\nThe voltages at different buses in the feeders are shown\nin Fig. 7. Both the feeders are heavily loaded and the DG\npenetration is negligible. As a ﬁrst scenario when two feeders\nare operating independently without loop, the feeders are\nsupplied through the LFTs and the BESS was not activated.\nAll the power was supplied by grid. In this case, the voltages\nat buses L7, L8, L9, L10 are below 0.95 p.u.\nIn the second scenario, the BESS is pressed into the service\nhaving a rating of 200 kW. However, the feeders are still\nnot looped. In this scenario, the power extraction from the\nelectric grid reduces. However, as can be seen from Fig. 7,\nthe voltages of buses are not improved. Since the MV grid\nvoltage is assumed constant, supplying power from BESS has\nsame effect as extracting power from electric grid and does\nnot affect the voltage variations.\nThe BESS connected at the LVDC of ST in proposed\nscheme is activated as a third scenario. The minimization of\nvoltage variations scheme is implemented to ﬁnd out amount\nof active and reactive power injections from the ST LV\nconverter. This can be seen that the voltage in the feeder is\nimproved and brought within the allowable limits. Moreover,\nthis conﬁguration also allows MV power converter of the ST\nto utilize the remaining BESS power capacity to support the\nactive power demand in MV grid.\nVI. C ONCLUSIONS\nIn this paper, the ST has been proposed to achieve the\nadvantages of loop power ﬂow controller in the radial distri-\nbution grid. The proposed conﬁguration replaces one of the\nLFT from the grid as well as BTB converter based LPC.\nWith estimation of ST LV converter active and reactive powers\ninjection for total voltage improvement, the ST maintains the\nvoltage throughout the feeders within the allowable limits even\nduring the extreme loading scenarios. Moreover, the power\nbalancing control action allows the ST to balance the load\npower of the feeders which avoids the overloading of the LFT.\nThe integration of BESS at the DC link of ST in the proposed\nconﬁguration allows injection of active power from both MV\nand LV converters of ST, enhancing the ST utilization.\nVII. A CKNOWLEDGMENT\nThis work is supported by the Alexander von Humboldt\nFoundation, Germany, the European Research Council un-\nder the European Unions Seventh Framework Programme\n(FP/2007-2013) / ERC Grant Agreement no. [616344]-\nHEART and INTERREG 5a. European Union/Interreg V-\nAGermany-Denmark, under PE:Region Project.\nREFERENCES\n[1] P. Khamphakdi, M. Nitta, M. Hagiwara, and H. Akagi, “Zero-voltage\nride-through capability of a transformerless back-to-back system using\nmodular multilevel cascade converters for power distribution systems,”\nIEEE Trans. Power Electron., vol. 31, no. 4, pp. 2730–2741, April 2016.\n[2] X. Xing, J. Lin, C. Wan, and Y . Song, “Model predictive control of lpc-\nlooped active distribution network with high penetration of distributed\ngeneration,” IEEE Trans. on Sustain. Energy , vol. 8, no. 3, pp. 1051–\n1063, July 2017.\n[3] M. Saradarzadeh, S. Farhangi, J. L. Schanen, P. O. Jeannin, and D. Frey,\n“The beneﬁts of looping a radial distribution system with a power\nﬂow controller,” in 2010 IEEE International Conference on Power and\nEnergy, Nov 2010, pp. 723–728.\n[4] C. Kumar and M. K. Mishra, “A voltage-controlled dstatcom for power-\nquality improvement,”IEEE Trans. Power Del., vol. 29, no. 3, pp. 1499–\n1507, June 2014.\n[5] M. Badoni, A. Singh, and B. Singh, “Variable forgetting factor recursive\nleast square control algorithm for dstatcom,” IEEE Trans. Power Del. ,\nvol. 30, no. 5, pp. 2353–2361, Oct 2015.\n[6] N. Okada, “Veriﬁcation of control method for a loop distribution system\nusing loop power ﬂow controller,” in 2006 IEEE PES Power Systems\nConference and Exposition , Oct 2006, pp. 2116–2123.\n[7] C. S. Chen, C. T. Tsai, C. H. Lin, W. L. Hsieh, and T. T. Ku, “Loading\nbalance of distribution feeders with loop power controllers considering\nphotovoltaic generation,” IEEE Trans. Power Sys. , vol. 26, no. 3, pp.\n1762–1768, Aug 2011.\n[8] S. K. Chaudhary, J. M. Guerrero, and R. Teodorescu, “Enhancing the\ncapacity of the ac distribution system using dc interlinks - a step toward\nfuture dc grid,” IEEE Trans. Smart Grid , vol. 6, no. 4, pp. 1722–1729,\nJuly 2015.\n[9] M. Liserre, G. Buticchi, M. Andresen, G. D. Carne, L. F. Costa, and\nZ. X. Zou, “The smart transformer: Impact on the electric grid and\ntechnology challenges,” IEEE Ind. Electron. Mag. , vol. 10, no. 2, pp.\n46–58, June 2016.\n[10] S. Bhattacharya, “Transforming the transformer,” IEEE Spectrum ,\nvol. 54, no. 7, pp. 38–43, July 2017.\n[11] R. Teodorescu, M. Liserre, and P. Rodriguez, Grid converters for\nphotovoltaic and wind power systems . John Wiley & Sons, 2011,\nvol. 29.\n[12] P. Kundur, Power system stability and control , vol. 7.\n[13] K. Christakou, J. Y . LeBoudec, M. Paolone, and D. C. Tomozei,\n“Efﬁcient computation of sensitivity coefﬁcients of node voltages and\nline currents in unbalanced radial electrical distribution networks,” IEEE\nTrans. Smart Grid , vol. 4, no. 2, pp. 741–750, June 2013.\n[14] F. Sossan, K. Christakou, M. Paolone, X. Gao, and M. Liserre, “Enhanc-\ning the provision of ancillary services from storage systems using smart\ntransformer and smart meters,” in IEEE 26th International Symposium\non Industrial Electronics (ISIE) , June 2017, pp. 1715–1720.\n[15] S. Papathanassiou, N. Hatziargyriou, K. Strunz et al., “A benchmark low\nvoltage microgrid network,” in Proceedings of the CIGRE symposium:\npower systems with dispersed generation , 2005, pp. 1–8.",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.6130587458610535
    },
    {
      "name": "AC power",
      "score": 0.5735496282577515
    },
    {
      "name": "Smart grid",
      "score": 0.5687679052352905
    },
    {
      "name": "Distribution transformer",
      "score": 0.5262281894683838
    },
    {
      "name": "Tap changer",
      "score": 0.49899888038635254
    },
    {
      "name": "Engineering",
      "score": 0.4767671227455139
    },
    {
      "name": "Electrical engineering",
      "score": 0.47093382477760315
    },
    {
      "name": "Voltage",
      "score": 0.4484654366970062
    },
    {
      "name": "Electric power system",
      "score": 0.44834041595458984
    },
    {
      "name": "Grid",
      "score": 0.4215732216835022
    },
    {
      "name": "Voltage regulation",
      "score": 0.41439610719680786
    },
    {
      "name": "Computer science",
      "score": 0.3866454064846039
    },
    {
      "name": "Electronic engineering",
      "score": 0.351338267326355
    },
    {
      "name": "Power (physics)",
      "score": 0.18558269739151
    },
    {
      "name": "Geometry",
      "score": 0.0
    },
    {
      "name": "Physics",
      "score": 0.0
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    },
    {
      "name": "Mathematics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I1317621060",
      "name": "Indian Institute of Technology Guwahati",
      "country": "IN"
    },
    {
      "id": "https://openalex.org/I32021983",
      "name": "Christian-Albrechts-Universität zu Kiel",
      "country": "DE"
    }
  ],
  "cited_by": 12
}