{
  "title": "Orangutans (Pongo abelii) make flexible decisions relative to reward quality and tool functionality in a multi-dimensional tool-use task",
  "url": "https://openalex.org/W2912737211",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A5057035810",
      "name": "I. B. Laumer",
      "affiliations": [
        "University of Vienna"
      ]
    },
    {
      "id": "https://openalex.org/A5052062558",
      "name": "Alice M. I. Auersperg",
      "affiliations": [
        "Medical University of Vienna",
        "University of Veterinary Medicine Vienna"
      ]
    },
    {
      "id": "https://openalex.org/A5026966258",
      "name": "Thomas Bugnyar",
      "affiliations": [
        "University of Vienna"
      ]
    },
    {
      "id": "https://openalex.org/A5044389898",
      "name": "Josep Call",
      "affiliations": [
        "Max Planck Institute for Evolutionary Anthropology",
        "University of St Andrews"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4239850587",
    "https://openalex.org/W2085042836",
    "https://openalex.org/W2059011990",
    "https://openalex.org/W1520036242",
    "https://openalex.org/W148491138",
    "https://openalex.org/W1585749120",
    "https://openalex.org/W2113281951",
    "https://openalex.org/W2008808558",
    "https://openalex.org/W2037867121",
    "https://openalex.org/W1987998509",
    "https://openalex.org/W2068652283",
    "https://openalex.org/W2121878884",
    "https://openalex.org/W2137985479",
    "https://openalex.org/W2024968092",
    "https://openalex.org/W2049049709",
    "https://openalex.org/W1985538593",
    "https://openalex.org/W2159887989",
    "https://openalex.org/W2475206328",
    "https://openalex.org/W2898302614",
    "https://openalex.org/W2046813029",
    "https://openalex.org/W2019418365",
    "https://openalex.org/W2019944329",
    "https://openalex.org/W2146623775",
    "https://openalex.org/W2112922372",
    "https://openalex.org/W7021264618",
    "https://openalex.org/W6677222214",
    "https://openalex.org/W2118957726",
    "https://openalex.org/W2121247660",
    "https://openalex.org/W2030848505",
    "https://openalex.org/W2106107098",
    "https://openalex.org/W1984912141",
    "https://openalex.org/W2156051121",
    "https://openalex.org/W2002664886",
    "https://openalex.org/W4230488537",
    "https://openalex.org/W1982585722",
    "https://openalex.org/W2506440519",
    "https://openalex.org/W2115569083",
    "https://openalex.org/W1919427389",
    "https://openalex.org/W16316178"
  ],
  "abstract": "Making economic decisions in a natural foraging situation that involves the use of tools may require an animal to consider more levels of relational complexity than merely deciding between an immediate and a delayed food option. We used the same method previously used with Goffin´s cockatoos to investigate the orangutans' flexibility for making the most profitable decisions when confronted with five different settings that included one or two different apparatuses, two different tools and two food items (one more preferred than the other). We found that orangutans made profitable decisions relative to reward quality, when the task required the subjects to select a tool over an immediately accessible food reward. Furthermore, most subjects were sensitive to work-effort when the immediate and the delayed option (directly accessible by using a tool) led to the same outcome. Most subjects continued to make profitable decisions that required taking into account the tool functionality. In a final multidimensional task design in which subjects had to simultaneously focus on two apparatuses, two reward qualities and two different tools, the orangutans chose the functional tool to access the high quality reward.",
  "full_text": "RESEA RCH ARTICL E\nOrangutans (Pongo abelii) make flexible\ndecisions relative to reward quality and tool\nfunctionality in a multi-dimensional tool-use\ntask\nIsabelle B. Laumer\nID\n1\n*, Alice M. I. Auersperg\n2\n, Thomas Bugnyar\n1\n, Josep Call\n3,4\n1 Department of Cognitive Biology, Universit y of Vienna, Vienna, Austria , 2 Messerli Research Institute,\nUniversity of Veterinary Medicine, Vienna, Medical University of Vienna, University of Vienna, Vienna, Austria,\n3 School of Psychology and Neurosc ience, University of St. Andrews, St. Andrew s, United Kingdom, 4 Max\nPlanck Institute for Evolutionary Anthropolo gy, Leipzig, Germany\n* isabelle .laumer@u nivie.ac.at\nAbstract\nMaking economic decisions in a natural foraging situation that involves the use of tools may\nrequire an animal to consider more levels of relational complexity than merely deciding\nbetween an immediate and a delayed food option. We used the same method previously\nused with Goffin´s cockatoos to investigate the orangutans’ flexibility for making the most\nprofitable decisions when confronted with five different settings that included one or two dif-\nferent apparatuses, two different tools and two food items (one more preferred than the\nother). We found that orangutans made profitable decisions relative to reward quality, when\nthe task required the subjects to select a tool over an immediately accessible food reward.\nFurthermore, most subjects were sensitive to work-effort when the immediate and the\ndelayed option (directly accessible by using a tool) led to the same outcome. Most subjects\ncontinued to make profitable decisions that required taking into account the tool functional-\nity. In a final multidimensiona l task design in which subjects had to simultaneously focus on\ntwo apparatuses, two reward qualities and two different tools, the orangutans chose the\nfunctional tool to access the high quality reward.\nIntroduction\nMaking rational economic decisions in natural foraging situations requires balancing costs\n(such as time spent to travel to a feeding patch) and benefits (such as gaining food of higher\nquality). Moreover, such decisions often require individuals to consider several factors simul-\ntaneously including the predictability of finding a more valued/ ripe food source, the reachabil-\nity of the food source as well as the presence of the proper means /tools to open up an\nextractable food.\nThe aim of this study was to investigate how orangutans´ decision-making processes are\naffected by tool-use. Orangutans are the largest predominantly arboreal frugivores that\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 1 / 13\na1111111111\na1111111111\na1111111111\na1111111111\na1111111111\nOPEN ACCESS\nCitation: Laumer IB, Auersperg AMI, Bugnyar T,\nCall J (2019) Oranguta ns (Pongo abelii) make\nflexible decisions relative to reward quality and tool\nfunctiona lity in a multi-dimens ional tool-use task.\nPLoS ONE 14(2): e0211031. https://doi.o rg/\n10.1371/ journal.pone. 0211031\nEditor: Darrell A. Worthy, Texas A&M University,\nUNITED STATES\nReceived: September 9, 2018\nAccepted: January 7, 2019\nPublished: February 13, 2019\nCopyright: © 2019 Laumer et al. This is an open\naccess article distributed under the terms of the\nCreative Commons Attribution License, which\npermits unrestricte d use, distribu tion, and\nreproduction in any medium, provided the original\nauthor and source are credited.\nData Availabilit y Statement: The dataset\nsupporting this article has been uploaded as part of\nthe supporting information.\nFunding: This work was supported by the\nUniversity of St Andrew s and the Max Planck\nInstitute for Evolutionary Anthro pology. Isabelle\nLaumer was supporte d by a uni:docs fellowshi p of\nthe University of Vienna, Alice Auersperg was\nsupported by by FWF grants J 3404-B19 and P\n29084, and Thomas Bugnyar by Y366-B17 .\nregularly use tools in the wild and captivity (e.g. [1–4]). Nevertheless, in their natural habitat,\nsuch as the Bornean peatland forest of Central Kalimantan which is home to the largest popu-\nlation of orangutans in Indonesia [5], fruits are distributed in patches and are available in ripe\nform only during a rather short, unpredictable and fluctuating period of time. In extreme cases\nBornean orangutans have to face periods with only <3% of trees fruiting for durations up to\nalmost one year. Optimality models [6] predict that orangutans should adopt different forag-\ning strategies depending on the fruit availability: When high quality food is scarce (such as\nfruits), they will react either by including lesser-quality food into their diet (bark and leaves) or\nby travelling further to find a high quality food patch [7]. Thus, testing orangutans in a con-\ntrolled setting allows us to better understand their natural tendencies and decision-making\nprocesses.\nThe ability to forego an immediate reward for the prospect of receiving a delayed but quali-\ntatively or quantitative better option for more than a couple of seconds has so far only been\nfound in orangutans as well as several other large brained animals, like some other primate\nspecies, dogs, corvids and parrots (e.g. [8–15]). Interestingly there are only a few primate stud-\nies that included the effect of tool use on a delayed decision-making process in their task\ndesign: Tufted capuchin monkeys inhibited eating a rod-shaped piece of celery in order to use\nit as a tool to push peanut butter out of a tube. In contrast, all subjects immediately ate the\npiece of celery when the tube was unbaited [16]. Furthermore tufted capuchin monkeys\nexchanged a piece of food for a tool only when they could use it to get access to a higher quality\nfood [17]. When given the choice between a likable food reward (a grape) and a straw tool,\nchimpanzees and an orangutan chose the tool if they could use it 70 minutes later to sip the\nmore preferred fruit soup [18]. Thus, it seems that at least one orangutan and some other pri-\nmate species can inhibit eating an immediate food reward for the prospect of getting another\nfood item of a higher quality by using a tool, even if this involves waiting for more than one\nhour [18].\nIn order to gain a better understanding of the different aspects of orangutans´ decision-\nmaking processes, we used a standardized method that was recently used on a bird species, the\nGoffin’s cockatoo (Cacatua goffiniana). Although these birds are not habitual tool users in the\nwild, they have proved to be skilled tool users in captivity [19]. Both Goffin cockatoos and\norangutans are opportunistic generalists that incorporate a large variety of fruits into their diet\nthat require extractive foraging [20, 21]. Furthermore both are largely arboreal and live in ever-\ngreen Indonesian tropical rain forests characterized by high annual fluctuation of flower and\nfruit production [22]. Therefore, both animals might face similar ecological pressures in terms\nof finding and exploiting fruit patches, making optimal decisions in terms of weighing costs\nand benefits of staying or moving to find another high quality food patch.\nThe Goffin cockatoos were tested in five different setups that included two different appara-\ntuses and their respective tools and two food qualities. When required to make decisions\nbetween using a tool in order to access a food reward inside an apparatus or eating an immedi-\nate food reward, Goffin cockatoos were able to make profitable decisions relative to reward\nquality, tool functionality and work effort [19]. Nevertheless, as task complexity increased (all\ntask components, two tools, two apparatuses and two food qualites were present), Goffin cock-\natoos were not able to focus on the profitable option anymore. A detailed study on the trap-\ntube-problem in chimpanzees, bonobos and orangutans showed that when subjects were\nrequired to process two spatial object-object relations simultaneously (here: tool-reward and\nreward-surface relation) their task success deteriorated, presumably because their cognitive\nresources were overtaxed [23]. Therefore, it would be interesting to test whether a habitual\ntool using ape species would be able to choose the profitable option in this tool-use task.\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 2 / 13\nCompeting interests : The authors have declared\nthat no competing interests exist.\nOrangutans should be able to make profitable decisions relative to reward quality since they\nwere able to inhibit eating preferred food for more than one minute in order to maximize their\nprofit [9] and one orangutan was even able to choose a tool over an immediate preferred food\nitem if she could access a more preferred food by using the tool [18]. Furthermore they should\nbe able to integrate the factor tool functionality into their decision-making process, since they\nproved to be able to select a functional tool based on rigidity, length and diameter [24, 25] and\nwere able to use up to five tools sequentially in order to obtain a functional tool [26]. Thus, we\nexpected them to make profitable decisions in regard to the functionality of the available tool\nand at the same time to be able to choose a tool over an immediate food item to obtain a higher\nquality food reward. Since the ability of Goffin’s cockatoos to maximize their profit was con-\nstrained when the complexity of the task increased and orangutans’ performance was nega-\ntively affected when they were required to process two spatial relations simultaneously [23], it\nwas unclear whether orangutans would increase their pay-off in this task.\nMethods\nSubjects and housing\nSix orangutans participated in this study, four adult females, one adult male and one juvenile\nmale (S1 Table). All subjects were born in captivity and were housed in a social group in a\nlarge, enriched indoor (approx. 200m\n2\n) and outdoor enclosure (approx. 1800m\n2\n) at the Wolf-\ngang Ko ¨ hler Primate Research Center in Zoo Leipzig, Germany. The enclosures were equipped\nwith various enrichment items and natural climbing structures. Food and water were available\nad libitum. During the three main meals, the orangutans received fresh fruits, vegetables, eggs,\ncereals, leaves and sometimes meat. All experiments were non-invasive and based purely on\nbehavioural tests. The research was approved by the ethics joint committee of the Max Planck\nInstitute for Evolutionary Anthropology and Zoo Leipzig and the methods were carried out in\naccordance with the relevant guidelines and regulations. Animal husbandry and research com-\nply with the EAZA minimum standards for the accommodation and care of animals in zoos\nand aquaria and the WAZA ethical guidelines for the conduct of research on animals by zoos\nand aquariums. The research adhered to all German laws regarding animal testing and hold-\ning. All orangutans participated on a voluntary basis, were and were never food or water\ndeprived and returned after testing to their enclosure. All orangutans were tested individually.\nPrior to this study subjects had participated in a variety of non-invasive cognitive tasks. All\napes had experience in inserting compact and stick tools and some of them had experience\nusing the ball- and stick-apparatus (unpublished data) but not in the presented context.\nApparatuses and training\nWe used two apparatuses (ball, stick) and their respective tools (ball, stick) (see Fig 1). Each\napparatus could only be operated with their corresponding tool. The apparatuses were similar\nto the ones used in the Goffin cockatoo study [19]. The ball-apparatus consisted of a transpar-\nent box whose interior contained with a collapsible platform upon which the food item rested\non. When the ball tool was inserted, it fell through a vertical tube, it hit and collapsed the plat-\nform and releasing the food item (see Fig 1). The stick-apparatus was a transparent box with a\nsmaller opening (ca. 15 mm; only the stick could be inserted). The food reward rested inside a\nmovable transparent cup. By inserting the stick tool the cup could be pushed towards the\nopening to a slanted platform, thereby releasing the food (see Fig 1).\nPrior to testing subjects received a total of 40 training trials with each apparatus (stick- and\nball-apparatus), in which they were given the functional tool and successfully operated the\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 3 / 13\nrespective apparatus. Furthermore, subjects also experienced that only one tool was functional\nin the corresponding apparatus (for more details see SI, chapter B).\nTesting procedure and design\nA single apparatus was attached to the mesh panel (semi-randomly balanced across sessions\nfor each testing condition) in all tests except in the TSQAT in which both the stick and ball\napparatuses were attached to the mesh. The experimenter (IBL) baited the apparatus/es in\nfront of the subjects and immediately placed two items on a sliding table. Depending on the\ntest/condition, the orangutans faced binary choices between two tools, or a tool and a food\nitem. Subjects signalled their choice by pointing with the finger. After three seconds (in the\nTSQAT 9 seconds) the experimenter moved the sliding table towards the mesh and the subject\ncould select one of the two items on the platform. The other item was immediately removed. If\nsubjects chose the non-functional tool they had to wait in front of the apparatus for 30 seconds\nuntil the next trial began. The side of presentation was semi-randomly balanced across sessions\nfor all conditions. During testing the experimenter wore mirrored sunglasses, avoided any\nhead movements, and remained silent.\nPrior to testing, we assessed subjects’ preferences for highly desirable food items that were\nusually always eaten straight away (apple, grape, banana-pellet). For the test we used only two\nFig 1. Left: A) Ball-apparatu s 1) Insertion hole 2) vertical tube shaft 3) position of food reward on collapsible platform 4) reward opening . Right: B) Stick-\napparatu s 1) Insertion hole 2) moveabl e tube-cup (open at the bottom) , food reward is located inside of it 3) opening to slanted panel 4) reward opening.\nhttps://do i.org/10.1371/j ournal.pone .0211031.g00 1\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 4 / 13\nof these foods. The high quality food had to be chosen over the lower food quality in at least\n80% of binary choices. We used subject´s most preferred food as the high quality food and the\nthird preferred food as the lower quality food in the test. All orangutans chose the banana-fla-\nvoured pellet (high quality) over the apple (lower quality) in more than 90% of binary choices.\nFor the adult male we used grape as lower quality and banana-pellet as high quality food. To\ncontrol for potential preference changes during testing, we re-assessed food preferences during\nand at the end of the testing phase. Food preferences remained unchanged (S2 Table).\nDue to the small sample size of available orangutans, which prevented us from conducting\nstatistical group comparisons, we kept the same order of the tests for all subjects (note that in\nthe Goffin cockatoos there was no difference in performance in the order in which the tests\nwere conducted). Thus, subjects received the five tests in the following order: Tool selection\ntest (TST), Quality allocation test (QAT), Motivation test (MT), Tool functionality test (TFT)\nand Tool selection/quality allocation test (TSQAT; for an overview of all tests see Fig 2 and\ndetailed description of all tests below).\n1) Tool selection test (TST)\nThis test assessed subjects´ knowledge about the functionality of the tools. The apparatus\n(stick- or ball-apparatus) always contained the subject´s high quality food (see Fig 2. 1). The\norangutans had to choose between the ball and the stick tool. Although we only analyzed the\nfirst 12 trials in each condition, subjects received as many 12-trial sessions as needed until they\nreached the criterion of selecting the correct tool in at least 83% of the trials in two consecutive\nFig 2. Overview of the conditions within each of the five tests. High quality food is banana- pellet, lower quality food is apple. 1) TST (Tool selection test):\nboth tools are present while the high quality food is inside the apparatus. 2a) QAT (Quality allocation test): the tool is functional in each of the conditions. Left:\nHigh quality food is inside the apparatus. Immediate food option is the lower quality food. Right: Lower quality food is inside the apparatus. The high quality\nfood is the immediate food option. 2b) MT (Motivat ion test): tool is always function al. High quality food is inside and outside the apparatu s. 2c) TFT (Tool\nfunctional ity test): High quality food is inside the apparatus in each condition. Left: Functio nal tool is present. Right: Non-functional tool is present. 2d)\nTSQAT (Tool selection quality allocation test): both tools and both apparatu ses are present. Left: High quality food is located in the stick-apparat us. Right: High\nquality food is located in the ball-appa ratus.\nhttps://do i.org/10.1371/j ournal.pone .0211031.g00 2\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 5 / 13\nsessions. We did this to ensure that all subjects possessed the prerequisite knowledge needed\nfor subsequent tests.\n2a) Quality allocation test (QAT)\nThis test investigated whether subjects responded flexibly by choosing either the tool or the\nfood item depending on the location of the high quality food. There were two conditions: the\nhigh quality food was either inside or outside the apparatus (see Fig 2. 2a). Thus, the apparatus\ncontained either the subject´s high or lower quality food (in 50% of the trials, semi-randomly\nbalanced). Depending on the condition, subjects had to decide between the tool and the lower\nquality food or the tool and the high quality food. The combination of the high quality food\n(inside or outside of the apparatus) and type of apparatus (ball- or stick-apparatus) generated\nfour possible conditions that we presented in a semi-randomized fashion across four sessions.\nEach orangutan received a total of four 12-trial sessions.\n2b) Motivation test (MT)\nThis test tested whether subjects had acquired a preference for either the immediate food or\nthe food inside the apparatus. There were two conditions (stick- and ball-apparatus condition)\nthat were presented in a semi-randomized order across sessions (see Fig 2. 2b). Either the\nstick- or the ball-apparatus was attached to the mesh. The high quality food was located inside\nas well as outside of the apparatus. The tool was always functional. The orangutans had to\nchoose between the immediate food reward or the tool. Subjects received a total of two 12-trial\nsessions.\n2c) Tool functionality test (TFT)\nThis test investigated whether subjects could maximize their profit by correctly assessing the\nfunctionality of the present tool. We administered two conditions that were presented in a\nsemi-randomized order across sessions (functional vs. non-functional tool condition; see Fig\n2. 2c). The apparatus (stick- or ball-apparatus) contained the high quality food reward in all\ntrials while the orangutans could choose between the lower quality food reward and depending\non the condition either a functional or non-functional tool. The tools were functional in 50%\nof trials and the trials were semi-randomly balanced across sessions. The combination of type\nof apparatus (stick- or ball-apparatus) and the type of tool (functional vs non-functional) gen-\nerated four possible conditions that we presented in a semi-randomized fashion across four\nsessions. Each orangutan received a total of four 12-trial sessions.\n2d) Tool selection/quality allocation test (TSQAT)\nThis test investigated whether subjects could maximize their profit when all task components\nwere present (two apparatuses, two tools, two food qualities). Both apparatuses were attached\nto the mesh panel. The side of presentation was semi-randomly balanced across sessions (see\nFig 2. 2d). We set up two possible conditions in which the high quality food was either located\ninside the stick- or ball-apparatus while the other apparatus was baited with the lower quality.\nThe orangutans had to choose between the stick- or ball-tool. After 15 seconds of apparatus\ninspection, both tools were placed on the platform. After nine seconds subjects could make\ntheir choice. The TSQAT comprised two 12-trial sessions.\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 6 / 13\nAnalysis\nAll data was HD video recorded and coded in situ as well as from the videos. As the data did\nnot meet the criteria for parametric analysis we used non-parametric two-tailed statistics. Sta-\ntistical tests were conducted in IBM SPSS using exact procedures. Further T\n+\nvalues were cal-\nculated and if required the p-values were adjusted according to recommended procedures for\nsmall sample sizes [27]. To investigate a possible learning effect we ran a pairwise comparison\n(Wilcoxon signed rank tests, p<0.05) for the first and last six trials of each condition for each\ntest. Although testing was carried out until criterion in the Tool selection test, only performance\nin the first two sessions was analysed.\nResults\n1) Pretest tool selection test (TST)\nFig 3.1 presents the percent of trials in which orangutans selected the stick tool (over the ball)\nas a function of the type of apparatus. Orangutans selected the stick tool significantly more\noften when facing the stick apparatus than the ball apparatus (Wilcoxon test: T\n+\n= 21,\np = 0.031). Analyses at the individual level confirmed this result for four of the six individuals\n(Fisher test: P<0.01, S3 Table). Five and three of the six orangutans significantly chose the\nFig 3. Mean percentages of tool choices per condition within each test. 1) TST (Tool selection test), 2a) MT (Motivation test), 2b) QAT (Quality allocation\ntest), 2c) TFT (Tool functionality test), 2d) TSQAT (Tool selection quality allocation test); (n = 6).\n�\np<0.05.\nhttps://do i.org/10.1371/j ournal.pone .0211031.g00 3\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 7 / 13\nstick tool and ball tool above chance (Binomial test: p<0.05) in the stick and ball apparatus,\nrespectively (S3 Table). The three subjects who did not initially reach the criterion (Dokana,\nSuaq, Bimbo) needed up to seven sessions to reach it (S3 Table).\nThe orangutans’ performance did not significantly differ between the stick- and ball-appa-\nratus condition in any of the tests (Wilcoxon tests, all p>0.05 in all cases; S8 Table). Further-\nmore there were no learning effects detectable when comparing the first six trials to the last six\ntrials of each test (Wilcoxon signed rank tests, all p>0.05, S9 Table). Consequently, we col-\nlapsed the data with regard to apparatus type and trial number in subsequent analyses.\n2a) Quality allocation test (QAT)\nFig 3.2a presents the percent of trials in which orangutans picked the tool as a function of the\nhigh quality food’s location. Orangutans did not select the tool significantly more often when\nthe high quality reward was inside compared to outside the apparatus (Wilcoxon test: T\n+\n= 20,\np = 0.063). However, this result was caused by Bimbo who selected the tool only once (out of\n24 trials) when the high quality food was outside the apparatus. Individual analyses confirmed\nthat all other five orangutans selected the tool significantly more often when the high quality\nreward was inside compared to outside the apparatus (Fisher´s exact tests: all p<0.001, S4\nTable).\n2b) Motivation test (MT)\nFig 3.2b presents the percentage of trials in which orangutans chose the tool over the immedi-\nate food option when the food outside and inside the apparatus was of the same quality (high\nquality). Orangutans did not select the tool over the immediate food option above chance level\n(Wilcoxon test: T\n+\n= 12, p = 0.844). On an individual level four orangutans significantly chose\nthe immediate food option over the tool, whereas two individuals significantly chose the tool\nover the immediate food reward (Binomial test; all p<0.05; S5 Table).\n2c) Tool functionality test (TFT)\nFig 3.2c presents the percentage of trials in which the orangutans selected the functional tool\n(over the lower quality food) and the lower quality reward (over the non-functional tool).\nOrangutans did not select the tool significantly more often when the tool was functional or\nnon-functional (Wilcoxon test: T\n+\n= 15; p = 0.063). On an individual level four out of the six\nindividuals selected the tool more often when it was functional (Fisher´s exact tests: all\np<0.05; S6 Table).\n2d) Tool selection quality allocation test (TSQAT)\nFig 3.2d presents the percentage of trials in which the orangutans selected the correct tool as a\nfunction of the high quality food´s location (either in the stick- or ball-apparatus). Subjects did\nselect the correct tool above chance level (Wilcoxon test: T\n+\n= 21, p = 0.031). On an individual\nlevel five orangutans chose the profitable tool above chance levels (Binomial tests: all p<0.01;\nS7 Table).\nDiscussion\nOrangutans maximized the quality of their food intake by flexibly choosing between a food\nitem and a tool depending on the conditions. In particular, they chose a tool over an immedi-\nately accessible food item to obtain a more preferred food item (using the tool) but they chose\nthe immediate food item over the tool if the apparatus contained the food item of a lower\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 8 / 13\nquality (Quality allocation test). Additionally, the majority of subjects showed work-effort sen-\nsitivity by choosing the immediate food option over the tool if the food inside the apparatus\nwas of the same quality (Motivation test). Four of the six orangutans made profitable decisions\nwhen the task required the subjects to simultaneously focus on the functionality of the tool as\nwell as on the reward quality (Tool functionality test). Furthermore, when subjects faced both\napparatuses (each baited with food items that differed in quality) and both tools (Tool selection\nquality allocation test), all orangutans chose the functional tool to operate the apparatus con-\ntaining the higher quality food.\nAfter subjects consistently selected the appropriate tools in the pretest (Tool selection test),\nwe found no evidence that subjects learned to select the correct alternatives over the course of\nthe testing phase. Prior to the test phase, two males and a female needed some training to\nreach above performance in the ball apparatus. A possible explanation for this difference\nbetween apparatuses is that the orangutans were, prior to this experiment, tested in several\ntasks requiring the use of sticks but not the insertion of balls (e.g. [25]). The other three sub-\njects immediately reached the criterion for both the stick- and ball-apparatus condition, which\nis consistent with studies in great apes and capuchin monkeys that selected tools based on\ntheir properties [25, 28–31].\nIn the Quality allocation test, all subjects except Bimbo flexibly chose the profitable option\nin all test conditions. These findings are consistent with the results of previous primate studies,\nalthough these studies only investigated certain aspects of our Quality allocation test. More\nspecifically, tufted capuchin monkeys used a lower quality food as a tool to obtain high quality\nfood from a tube if it was baited [16] and they only exchanged a lower quality food for a tool if\nthey could access a higher quality food with it [17]. Moreover, chimpanzees and one orangutan\nselected a tool over an immediate food item if they could use it to obtain a higher quality food\n70 minutes later [18]. On an individual level ten out of 13 Goffin cockatoos that were tested in\nthe Quality allocation test were able to choose the profitable option (data of stick and ball appa-\nratus pooled, note that in the original paper by Laumer et al. 2016 the data was not pooled;\nOne Goffin was able to be successful above chance expectation in all test conditions of the\nQuality allocation test).\nOptimality models [6] predict that orangutans should adopt different foraging strategies\ndepending on the fruit availability: When high quality food is scarce (such as fruits), they will\nreact either by including lesser-quality food into their diet (bark and leaves) or by travelling\nfurther to find a high quality food patch [7].\nSimilar to the Goffin cockatoos, the majority of subjects chose the immediate food option\nin the Motivation test when the reward inside and outside of the apparatus was of the same\nquality (high quality). Only two females (Pini and Raja) chose the tool over the immediately\naccessible high quality food. It is conceivable that the choices of those two females (and those\nof the Goffin cockatoos that chose similarly), do not necessarily reflect a lack of understanding\nor efficiency but they might simply reflect a preference for using tools.\nHowever, such preference has its limits as evidenced by the results of the Quality allocation\ntest. Here the same two orangutans “sacrificed” the tools and instead chose a food item which\nquality was higher than the quality of the item that they would have obtained using the tool.\nIn the Tool functionality test four of the six orangutans simultaneously considered the func-\ntionality of the tool as well as the reward quality. This was particularly clear in the case of Raja,\nalthough she did not perform above chance level in both conditions of the ball-apparatus con-\ndition. Besides Raja, three other orangutans (Dokana, Padana and Suaq) chose the tool (as\nopposed to the lower quality food item) more often when it was functional, thus confirming\napes’ and capuchin monkeys’ appreciation of tool functionality even in the absence of trial-\nand-error [28–29]. However, unlike those other studies, orangutans in the present study still\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 9 / 13\nselected the non-functional tool in a sizable number of trials. In contrast, three of the cocka-\ntoos were able to select the correct option in both conditions when confronted with the stick-\napparatus and two of them were able to successfully maximize their profit in all conditions of\nthe Tool functionality test [19]. It is possible that most apes failed to inhibit choosing a tool in\nthis task due to a strong quality difference between apple (low quality) and the banana-fla-\nvoured pellet (high quality). In cockatoos two different types of nuts were used (pecan and\ncashew) and the quality gap between the two was arguably smaller. If that was the case, it is\npossible that the orangutans might rather accept losing the apple piece in order to try to oper-\nate the incompatible apparatus. Note also that they inserted the stick-tools into the ball-appara-\ntus in 72% of failed trials. They may have experienced successes with stick tools through\npersistence in previous studies (e.g. [32–34]). Since none of the subjects was ever successful at\ndoing that, they began to choose the apple piece more often when the tool was non-functional\nin order to avoid obtaining nothing at all.\nIn contrast to the parrots that were unable to focus on the profitable option in the Tool\nselection quality allocation test [19], all four female orangutans performed significantly above\nchance level by choosing the correct tool to access the high quality food. This result is consis-\ntent with a study showing that apes were able to select suitable tools for three different appara-\ntuses presented sequentially in different days [25]. Unlike that study, however, orangutans in\nthe current study had to select one of two tools to use in one of two baited apparatuses that\nwere presented simultaneously. Keeping track of multiple tools and multiple baited appara-\ntuses may have caused the difficulties that the male orangutans experienced here. Although\nthey selected the stick when the high quality food was in the stick-apparatus above chance\nlevel, Bimbo only tended to select the ball-tool when the ball-apparatus was baited with the\nhigh quality food. The subadult (seven-year-old) Suaq chose the profitable option only at\nchance level (note that it took him already seven sessions to reach the criterion for the ball-\napparatus in the pretest). Vo ¨ lter and Call (2014) found that the performance of chimpanzees,\nbonobos and orangutans dropped when facing a trap-tube problem that required the subjects\nto simultaneously consider two spatial object-object relations (tool-reward and reward-surface\nrelation). The authors suggested that this failure might be due to a cognitive overload in the\nattentional system. Nevertheless, in the present study the multidimensional task design that\nrequired the subjects to simultaneously focus on two apparatuses, two reward qualities and\ntwo different tools seemed to fall below the orangutans limit in information processing.\nTaken together the orangutans were able to make profitable decisions relative to reward\nquality and the use of a tool and even considered the additional work-effort of using a tool.\nAlthough orangutans previously showed problems when processing two spatial relations at the\nsame time in another task design [24], subjects could maximize their profit in a multi-dimen-\nsional task that required them to take into account the apparatuses, the food items, and the\ntools. Future studies could systematically investigate orangutans´ limits of information pro-\ncessing by including more levels of relational complexity. Furthermore in order to investigate\nthe mechanisms of decision-making relative to the use of tools into further detail, applying\npresent task design in other large-brained human and non-human habitually tool-using spe-\ncies would be highly desirable.\nSupporting information\nS1 Table. Names, sex and year of birth and rearing history of the six orangutans (Pongo\nabelii).\n(PDF)\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 10 / 13\nS2 Table. Results of the preference tests in percent (%) including all combinations\n(a = apple, g = grape, p = banana pellet, r = rusk; TPF = third preferred food, MPF = most\npreferred food). Preference test 1 was conducted before subjects entered the test, Preference\ntest 4 was conducted after all subjects had received all test trials. Preference test 2 &3 was only\nconducted with Bimbo due to reasons explained above.\n(PDF)\nS3 Table. Number of correct trials out of a total of 12 trials for each condition in the TST\nfor each individual. Binomial probabilities:\n�\n= p<0.05 (10/12 correct),\n� �\n= p<0.01 (11/12\ncorrect);\n� � �\n= p<0.001 (12/12 correct).\n(PDF)\nS4 Table. Number of correct trials out of a total of 12 trials for each condition in the QAT\nfor each individual. Binomial probabilities:\n�\n= p<0.05 (10/12 correct),\n� �\n= p<0.01 (11/12\ncorrect);\n� � �\n= p<0.001 (12/12 correct).\n(PDF)\nS5 Table. Number of correct trials out of a total of 12 trials for each condition in the MT\nfor each individual. Binomial probabilities:\n�\n= p<0.05 (10/12 correct),\n� �\n= p<0.01 (11/12\ncorrect);\n� � �\n= p<0.001 (12/12 correct).\n(PDF)\nS6 Table. Number of correct trials out of a total of 12 trials for each condition in the TFT\nfor each individual. Binomial probabilities:\n�\n= p<0.05 (10/12 correct),\n� �\n= p<0.01 (11/12\ncorrect);\n� � �\n= p<0.001 (12/12 correct).\n(PDF)\nS7 Table. Number of correct trials out of a total of 12 trials for each condition in the\nTSQAT for each individual. Binomial probabilities:\n�\n= p<0.05 (10/12 correct),\n� �\n= p<0.01\n(11/12 correct);\n� � �\n= p<0.001 (12/12 correct).\n(PDF)\nS8 Table. Results of the paired Wilcoxon tests for subjects´ performance in the ball- and\nstick- apparatus condition for each condition and for each test (n = 6).\n(PDF)\nS9 Table. Results of the paired Wilcoxon tests for the first and last six trials of each condi-\ntion for each test (n = 6).\n(PDF)\nS1 Movie. Movie of the Tool selection test (TST), Motivation test (MT), Quality allocation\ntest (QAT), Tool functionality test (TFT) and Tool selection quality allocation test\n(TSQAT).\n(MOV)\nAcknowledgmen ts\nWe thank the animal keepers of the WKPRC and Johannes Grossmann for their help during\nthe data collection process and Raik Pieszek for constructing the apparatuses.\nAuthor Contributions\nConceptualization: Isabelle B. Laumer, Alice M. I. Auersperg.\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 11 / 13\nFormal analysis: Isabelle B. Laumer, Josep Call.\nMethodology: Isabelle B. Laumer.\nWriting – original draft: Isabelle B. Laumer.\nWriting – review & editing: Alice M. I. Auersperg, Thomas Bugnyar, Josep Call.\nReferences\n1. Galdikas BMF. Orangutan tool use. Science 1989, New Series, Vol; 243, 4888:152. PMID: 291172 6\n2. Van Schaik CP, Fox EA. Manufactur e and use of tools in wild Sumatran orangutans . Naturwiss enschaf-\nten 1996; 83: 186–188. PMID: 864312 6\n3. Nakamich i M. Tool-u se and tool-makin g by captive, group-living orangut ans (Pongo pygmaeus abelii)\nat an artificia l termite mound. Behavioural Processes 2004; 65: 87–93. PMID: 147445 50\n4. Shumaker RW, Walkup KR, Beck BB, Burghard t GM. Animal Tool Behavior: The Use and Manufac ture\nof Tools by Animals. The Johns Hopkins Univers ity Press, Baltimore, MD; 2011. pp. 1–304.\nISBN:142 1401282, 978142 1401287\n5. Ancrenaz M. Orangutan aerial survey in Sebangau National Park, Central Kalimantan Indonesia ,\nSebangau Project, Kalimantan Tengah ; 2007, pp. 1–40. Jakarta, Indonesia : WWF Indonesia .\n6. Dunbar RIM. Modelling primate behavioral ecology. Internat ional Journal of Primatology 2002; 23,\n4: pp. 785–81 8.\n7. Morrogh-B ernard HC, Husson SJ, Knott CD, Wich SA, van Schaik CP, van Noordwijk MA et al. Orangu-\ntan activity budgets and diet: A comparis on between species, populations and habitats. In Wich SA,\nUtami Atmoko S, Mitra Setia T, & van Schaik CP, (Eds.), Orangutan s: Geograph ic variatio n in behav-\nioral ecology and conservatio n; 2009; pp. 119–13 3. New York: Oxford Univers ity Press.\n8. Rosati AG, Stevens JR, Hare B, Hauser MD. The evolutionary origins of human patience: temporal pref-\nerences in chimpanzees, bonobos and human adults. Curr Bio 2007; 17: 1663–1668.\n9. Beran MJ. Maintena nce of self-impose d delay of gratificat ion by four chimpanzees (Pan troglo dytes)\nand an orangutan (Pongo pygmaeus ). J Gen Psychol 2002; 129; 1: 49–66. https://doi.or g/10.108 0/\n00221300209 602032 PMID: 12038494\n10. Dufour V, Pele ´ M, Sterck EHM, Thierry B. Chimpanz ee (Pan troglodytes ) anticipati on of food return:\nCoping with waiting time in an exchange task. J Comp Psych 2007; 121; 2: 145–155.\n11. Pele ´ M, Dufour V, Micheletta J, Thierry B. Long-tailed macaques display unexpected waiting abilities in\nexchange tasks. Anim Cogn 2010; 13: 263–271. https://d oi.org/10.100 7/s10071 -009-0264 -6 PMID:\n19597853\n12. Leonardi RJ, Vick S-J, Dufour V. Waiting for more: the performanc e of domestic dogs (Canis familiar is)\non exchange tasks. Anim Cogn 2012; 15: 107–120. https:// doi.org/10.10 07/s1007 1-011-043 7-y PMID:\n21769501\n13. Dufour V, Wascher CAF, Braun A, Miller R, Bugnya r T. Corvids can decide if a future exchange is worth\nwaiting for. Biol Lett 2011; 8; 2: 201–20 4. https://doi.or g/10.109 8/rsbl.2011. 0726 PMID: 21920957\n14. Hillemann F, Bugnya r T, Kotrschal K, Wascher CAF. Waiting for better, not for more: corvids respond to\nquality in two delay maintenanc e tasks. Anim Behav 2014; 90:1–10 . https://doi.or g/10.1016 /j.anbehav.\n2014.01. 007 PMID: 25892738\n15. Auersperg AMI & Laumer IB, Bugnya r T. Goffin cockatoos wait for qualitat ive and quantitat ive gains but\nprefer ‘better’ to ‘more’. Biol Lett 2013; 9: 20121092. https:// doi.org/10.10 98/rsbl.2 012.1092 PMID:\n23485873\n16. Evans TA, Westerga ard GC. Self-co ntrol and tool use in tufted capuchin monkey s (Cebus apella). J\nComp Psych 2006; 120; 2: 163–166.\n17. Westerga ard GC, Liv C, Rocca AM, Cleveland A, Suomi SJ. Tufted capuchins (Cebus apella) attribute\nvalue to foods and tools during voluntary exchanges with humans. Anim Cogn 2004; 7: 19–24. https://\ndoi.org/10.10 07/s10071-003 -0181-z PMID: 12884078\n18. Osvath M, Osvath H. Chimpanzee (Pan troglody tes) and orangutan (Pongo abelii) forethought: self-\ncontrol and pre-ex perience in the face of future tool use. Anim Cogn 2008; 11: 661–674. https://doi.or g/\n10.1007/ s10071-008- 0157-0 PMID: 18553113\n19. Laumer IB, Bugnyar T, Auersperg AMI. Flexible decision- making relative to reward quality and tool func-\ntionality in Goffin cockatoos (Cacatua goffinia na). Scientific Reports 2016; 6: 28380. https:// doi.org/10.\n1038/sre p28380 PMID: 27334699\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 12 / 13\n20. O´Hara M, Mioduszew ska B, Haryok o T, Prawiradila ga DM, Huber L, Auersperg A Extraction without\ntooling around–Th e first comprehe nsive description of the foraging- and socio-ecol ogy of wild Goffin´s\ncockatoos (Cacatua goffiniana). Behavio ur; 2018 https://doi.or g/10.1163 /1568539X- 00003523\n21. Meulman EJM, van Schaik CP Orangutan tool use and the evolution of technolog y. In Sanz CM, Call J,\n& Boesch C (eds.), Tool use in animals: Cognition and ecology; 2013. pp. 89–119 . Cambridge , UK:\nCambridge University Press.\n22. van Schaik CP, Pfannes KR. Tropical climates and phenology: A primate perspective . In Brockman D.\nK., & van Schaik CP, (Eds.), Seasonality in primates: Studies of living and extinct human and nonhuma n\nprimates. New York: Camb ridge Univ Press; 2005. pp. 23–54.\n23. Vo ¨ lter CJ, Call J. The cognitive underpinni ngs of flexible tool use in Great Apes. Journal of Experime ntal\nPsychology : Animal Learning and Cognition 2014; 40; 3: 287–30 2.\n24. Walkup KR, Shumae r RW, Pruetz JD. Orangutan s (Pongo spp.) may prefer tools with rigid properties to\nflimsy tools. Journal of Comparativ e Psychology 2010; 124; 4: 351–355. https:// doi.org/10.10 37/\na0019566 PMID: 21090889\n25. Martin-Ord as G., Atance C. M., Call J. Rememb ering in tool-use tasks in childre n and apes: The role of\nthe informati on at encodin g. Memory 2014; 22: 129–14 4. https://doi.or g/10.1080 /09658211.201 3.\n806553 PMID: 237679 28\n26. Martin-Ord as G., Schumac her L., Call J. Sequential Tool Use in Great Apes. PLoS ONE 2012; 7; 12:\ne52074. https:// doi.org/10.13 71/journal.p one.005 2074 PMID: 2330059 2\n27. Siegel S. and Castellan N.J. Jr. Nonparame tric Statistics for the Behavioral Sciences. 2nd Edition,\nNew York: McGraw Hill; 1988. http://dx .doi.org/10.11 77/0146 62168901300 212\n28. Manrique H.M., Gross A.N.M., & Call J. Great apes select tools on the basis of their rigidity . Journal of\nExperime ntal Psychology: Animal Behavior Processes 2010; 36: 409–422. https://doi.o rg/10.1037/\na0019296 PMID: 20718558\n29. Manrique H.M., Sabbatini G., Call J., & Visalberghi E. Tool choice on the basis of rigidity in capuchin\nmonkeys . Animal Cognition 2011; 14: 775–78 6. https://doi.or g/10.100 7/s10071-011- 0410-9 PMID:\n21547581\n30. Mulcahy N. J., Call J., & Dunbar R. I. M. Gorillas and orangutans encode relevant problem features in a\ntool-using task. Journal of Comparative Psycholog y 2005; 119: 23–32. https://doi.or g/10.1037/ 0735-\n7036.119. 1.23 PMID: 15740427\n31. Visalberghi E., Addessi E., Spagnolett i N., Truppa V., Ottoni E., Izar P., et al. Selection of effectiv e\nstone tools by wild capuchin monkeys . Current Biology 2009; 19: 213–217. https://do i.org/10.1016 /j.\ncub.2008 .11.064 PMID: 19147358\n32. Martin-Ord as G, Jaeck F, Call J. Barriers and traps: Great apes’ perform ance in two functional ly equiva-\nlent tasks. Animal Cognition 2012; 15: 1007–1013 . https://doi.or g/10.1007/ s10071-012- 0504-z PMID:\n22544302\n33. Mulcahy NJ, Call J. How great apes perform on a modified trap-tube task. Animal Cognition 2006; 9:\n193–199. https:// doi.org/10.10 07/s1007 1-006-001 9-6 PMID: 16612632\n34. Martin-Ord as G, Call J, Colmenare s F. Tubes, tables and traps: great apes solve two functionally -equiv-\nalent trap tasks but show no evidence of transfer across tasks. Animal Cognition 2008; 11: 423–430.\nhttps://doi.or g/10.100 7/s10071 -007-0132-1 PMID: 18183433\nOrangutan s make flexible decisions relative to reward quality in a multi-dime nsional tool-use task\nPLOS ONE | https://doi.or g/10.137 1/journal.po ne.02110 31 February 13, 2019 13 / 13",
  "topic": "Flexibility (engineering)",
  "concepts": [
    {
      "name": "Flexibility (engineering)",
      "score": 0.7945984601974487
    },
    {
      "name": "Task (project management)",
      "score": 0.7653850317001343
    },
    {
      "name": "Foraging",
      "score": 0.7054219245910645
    },
    {
      "name": "Quality (philosophy)",
      "score": 0.59088134765625
    },
    {
      "name": "Computer science",
      "score": 0.5187316536903381
    },
    {
      "name": "Reward system",
      "score": 0.4152721166610718
    },
    {
      "name": "Cognitive psychology",
      "score": 0.35047370195388794
    },
    {
      "name": "Psychology",
      "score": 0.33824896812438965
    },
    {
      "name": "Statistics",
      "score": 0.15745007991790771
    },
    {
      "name": "Biology",
      "score": 0.1388411521911621
    },
    {
      "name": "Mathematics",
      "score": 0.12349596619606018
    },
    {
      "name": "Engineering",
      "score": 0.11786630749702454
    },
    {
      "name": "Ecology",
      "score": 0.11450526118278503
    },
    {
      "name": "Psychotherapist",
      "score": 0.0
    },
    {
      "name": "Philosophy",
      "score": 0.0
    },
    {
      "name": "Epistemology",
      "score": 0.0
    },
    {
      "name": "Systems engineering",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I129774422",
      "name": "University of Vienna",
      "country": "AT"
    },
    {
      "id": "https://openalex.org/I76134821",
      "name": "Medical University of Vienna",
      "country": "AT"
    },
    {
      "id": "https://openalex.org/I150540706",
      "name": "University of Veterinary Medicine Vienna",
      "country": "AT"
    },
    {
      "id": "https://openalex.org/I4210118560",
      "name": "Max Planck Institute for Evolutionary Anthropology",
      "country": "DE"
    },
    {
      "id": "https://openalex.org/I16835326",
      "name": "University of St Andrews",
      "country": "GB"
    }
  ]
}