{
  "title": "A Chebyshev Transformer-Based Microstri-to-Groove-Gap-Waveguide Inline Transition for MMIC Packaging",
  "url": "https://openalex.org/W2921582601",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A5017499241",
      "name": "José M. Pérez-Escudero",
      "affiliations": [
        "Universidad Publica de Navarra"
      ]
    },
    {
      "id": "https://openalex.org/A5071053899",
      "name": "Alicia E. Torres‐García",
      "affiliations": [
        "Universidad Publica de Navarra"
      ]
    },
    {
      "id": "https://openalex.org/A5090346030",
      "name": "R. Gonzalo",
      "affiliations": [
        "Universidad Publica de Navarra",
        "Universidad de Navarra"
      ]
    },
    {
      "id": "https://openalex.org/A5060204159",
      "name": "Íñigo Ederra",
      "affiliations": [
        "Universidad Publica de Navarra",
        "Universidad de Navarra"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2565628863",
    "https://openalex.org/W6646191361",
    "https://openalex.org/W2123359922",
    "https://openalex.org/W2201418669",
    "https://openalex.org/W1989964448",
    "https://openalex.org/W2333681360",
    "https://openalex.org/W2623420144",
    "https://openalex.org/W2521363240",
    "https://openalex.org/W2734664631",
    "https://openalex.org/W2084735108",
    "https://openalex.org/W2138295021",
    "https://openalex.org/W2100279623",
    "https://openalex.org/W2155684415",
    "https://openalex.org/W2101466704",
    "https://openalex.org/W2053559124",
    "https://openalex.org/W2053370387",
    "https://openalex.org/W2019433993",
    "https://openalex.org/W2050982928",
    "https://openalex.org/W1965153108",
    "https://openalex.org/W1579851625",
    "https://openalex.org/W2322764112",
    "https://openalex.org/W2107819128",
    "https://openalex.org/W2793400551",
    "https://openalex.org/W2890525029",
    "https://openalex.org/W969604265",
    "https://openalex.org/W2903136240",
    "https://openalex.org/W1984050798"
  ],
  "abstract": "The gap waveguide technology has become an alternative to millimeter- and submillimeter-wave electronic circuit packaging thanks to the loss reduction associated with its use. In this paper, a simplified design of an inline transition between a microstrip and a groove gap waveguide (GGW) operating at the W-band is presented. The transition consists of a tapered microstrip line and a Chebyshev adapter that couple the quasi-TEM mode of the microstrip line to the so-called vertical mode of the GGW. The simplicity of this design makes this transition appropriate for monolithic microwave integrated circuit (MMIC) packaging at millimeter frequencies and above. The simulation results have been experimentally validated in the W-band. A good performance has been achieved, resulting in a return loss better than 10 dB and a mean insertion loss lower than 2 dB.",
  "full_text": "JOURNAL OF 1\nA\nChebyshev Transformer Based Microstrip to\nGroove Gap W aveguide Inline Transition for MMIC\nPackaging\nJos ´ e M. P´ erez-Escudero, Alicia E. T orres-Garc´ ıa, Ram ´ on Gonzalo, Member , IEEE, and I ˜ nigo\nEderra, Member , IEEE\nAbstract—Gap waveguide technology has become an alterna-\ntive for millimetre and sub-millimetre wave electronic circuit\npackaging thanks to the loss reduction associated to its use. In\nthis paper a simpliﬁed design of an inline transition between\nmicrostrip and groove gap waveguide operating at W-band is\npresented. The transition consists of a tapered microstrip line\nand a Chebyshev adapter that couple the quasi-TEM mode of\nthe microstrip line to the so-called vertical mode of the groove\ngap waveguide. The simplicity of this design makes this transition\nappropriate for MMIC packaging at millimetre frequencies and\nabove. The simulation results have been experimentally validated\nin the W-band. Good performance has been achieved: return loss\nbetter than 10 dB and mean insertion loss lower than 2 dB.\nIndex T erms—Groove Gap W aveguide, Microstrip, Chebyshev\nT ransformer , W aveguide T ransition.\nI. I N T RO D U CT IO N\nThe number of applications at millimetre, sub-millimetre\nand terahertz frequencies is constantly growing. In the com-\nmunications ﬁeld, due to the saturation of the spectrum at\nlow frequencies and the increasing demand for bandwidth in\npoint-to-point wireless links, occupation of higher frequency\nbands becomes a good alternative for wireless backhaul, the\nnext generation wireless 5G and wireless HDMI [ ?]. More-\nover, high performance sensors at W -Band can be used for\nautomotive radar [ ?]. In addition, the high resolution of mm-\nwaves, their penetration through some materials (e.g. clothes,\nwood...), and the fact that, on the contrary to X-rays, they\nare not a threat for human health, allow their use for security\nimaging, e.g. for concealed weapon detection in airports [ ?].\nThe development of these applications requires efﬁcient\npackaging solutions which allow integration of microstrip\nand waveguide based components. Packaging is important\nto protect the circuit not only from environmental hazards\nbut also from mechanical stress that components may suffer.\nIn addition, RF packaging allows isolating the circuits from\nexternal interferences. However, standard enclosings are liable\nto create resonant cavities if not properly controlled, which\nproduces additional losses [ ?].\nRecently, a novel approach for packaging has been pro-\nposed, based on the so-called bed of nails [ ?]. These are\nThe authors are with the Department of Electrical, Electronic and\nCommunication Engineering, Public University of Navarra, Spain, 31006\nand with the Institute of Smart Cities, Public University of Navarra, Spain,\n31006\nE-mail: josemanuel.perez@unavarra.es, aliciaelena.torres@unavarra.es,\ninigo.ederra@unavarra.es and ramon@unavarra.es.\nperiodic metallic structures which avoid propagation of elec-\ntromagnetic waves in a certain frequency range. Thanks to this\nproperty they have found its application for parasitic mode\nsuppression [ ?]-[?]. In addition, pin surfaces allow creating\nwaveguides if a linear defect is introduced [ ?]-[?]. These\nstructures resemble metallic rectangular or ridge waveguides\nand a family of components are being developed based on\nthem [ ?]-[?].\nHowever, integration of MMIC components in these novel\nwaveguide solutions requires transitions between them and\nplanar technology transmission lines, such as microstrip or\ncoplanar waveguide. Several of the proposed solutions are\nbased on inline conﬁgurations. However, they require full-\nwave optimization, since they either rely on complex geome-\ntries [ ?]-[?] or are meant for low frequency operation [ ?].\nIn this paper, out of the several bed of nails based waveguide\nimplementations [ ?], we will focus on the so-called Groove\nGap W aveguide (GGW). This waveguide consists of an air\nchannel in between two bed of nails sections. A simple\nalternative for an inline transition between this waveguide\nand microstrip working at W -Band will be presented. The\ntransition design follows an analytical approach, similar to that\nin [ ?] and [ ?] but adjusting the design to the GGW propagation\ncharacteristics. As a consequence, since the dimensions are\ncomputed by means of the standard Chebyshev transformer\ndesign formulae, full wave optimization is avoided.\nThe structure of the paper is organized as follows. First,\nSection ?? describes the proposed transition, the analytic\nmethod for the design and the full wave simulation results.\nAfterwards, the manufacturing procedure and the experimental\nvalidation are presented in Section ??. Finally, conclusions are\ndrawn in Section ??.\nII. T RA N S IT IO N DE S IG N A N D SIM U L AT IO N RE S U LT S\nThe proposed inline transition is presented in Fig. ??.\nThe transition consists of two sections: a linear transition\nfrom microstrip to dielectric ﬁlled GGW and a Chebyshev\ntransformer from dielectric ﬁlled GGW to standard (air ﬁlled)\nGGW . The operating principle is based on the high similitude\nbetween the ﬁeld distribution of the so-called vertical mode of\nthe GGW [ ?] and the rectangular waveguide T E10 mode. This\nallows employing a technique for the design of this transition\nsimilar to that used in [ ?]. Even though this principle and\nthe design procedure presented for this kind of transition is\nThis is the author's version of an article that has been published in this journal. Changes were made to this version by the publisher prior to publication.\nThe final version of record is available at  http://dx.doi.org/10.1109/TCPMT.2019.2904430\nCopyright (c) 2019 IEEE. Personal use is permitted. For any other purposes, permission must be obtained from the IEEE by emailing pubs-permissions@ieee.org.\nJOURNAL OF 2\n(a)\n(b)\nF\nig. 1: (a)Perspective view the proposed microstrip to groove\ngap waveguide (GGW) transition. (b) Explosion view of\nthe microstrip to GGW transition. Note that the Chebyshev\ntransformer is not an independent piece.\napplicable to any frequency band, in this case the transition\nwill be realized to work at W -Band.\nA. Groove Gap W aveguide Design\nThe GGW consists of an air channel in between two\nperiodic metallic pin sections. This periodic metallic pin\ndistribution that surrounds the waveguide, also referred to as\nbed of nails, is designed to have its band-gap in the desired\nfrequency range [ ?], [ ?]. In this case, the pin parameters were\noptimized so that the band-gap covers from 50 GHz to 110\nGHz, which includes the W -band, and the ﬁnal dimensions\nare gathered in T able ??. The resulting dispersion diagram,\ncomputed with Ansys HFSS eigenmode solver, is shown in\nFig. ??, where we can observe that the band-gap, determined\nby the highest frequency of the ﬁrst mode of the dispersion\ndiagram and the lowest frequency of the second mode of the\ndispersion diagram, covers the full W -band.\nBased on this pin structure a GGW was created by leaving\nan air channel in between them. This creates a propagation\nband in the band-gap of the periodic structure. In order to\nmake the resulting GGW compatible with a W -band WR10\nrectangular waveguide, the height of the GGW will be the\nsame as that of the WR10 waveguide, i.e. 1.27 mm. Regarding\nthe width, w in the inset in Fig. ??, it will be adjusted\nT ABLE I: Dimensions of the unit cell of the bed of nails, see\nFig. ??.\nParameter Description V alue ( µ m )\nd Pin height 1190\na Pin size 600\nh Air gap 80\np Period 1240\nFig. 2: Dispersion diagram of the periodic unit cell. The\nv\nertical lines represent the limits of the band-gap.\nfor monomode operation in the desired frequency range. In\nour case, in order to facilitate testing, it should also provide\ngood matching to a WR10 waveguide. The best result was\nobtained for w = 2 .45 mm and the performance of this direct\nconnection is shown in Fig. ??. The return loss is higher than\n25 dB within the W -band operational bandwidth (75-110 GHz)\nand the insertion loss is negligible, below 0.1 dB. The different\nwidth between GGW and standard waveguide is caused by the\ndifferent boundary condition at the waveguide walls, which\nallow evanescent ﬁelds to penetrate the lateral pin regions. In\nthis case ﬁve periods of pins surround the waveguide. Even\nthough a smaller number of pins would be enough to prevent\nleakage, the whole available area was covered with pins.\nB. T ransition design\nAs mentioned, the transition is divided into two parts: a\nmicrostrip linear taper and a Chebyshev transformer between\ndielectric ﬁlled and air ﬁlled GGW (see Fig. ?? for details).\nThe ﬁrst part corresponds to a microstrip linear taper,\nwhose top view is shown in Fig. ????. This line, which\nmatches the 50 Ω microstrip line to the dielectric ﬁlled\nGGW (DFGGW) impedance, is calculated using the standard\nmicrostrip impedance formulae and a 3λg/4 length [ ?]. It is\nprinted on 100 µm thick Rogers CuClad 233 ( ǫr = 2.34 and\ntan δ = 0.009) where the required width to obtain the 50 Ω\ncharacteristic impedance is 300 µm.\nThis is the author's version of an article that has been published in this journal. Changes were made to this version by the publisher prior to publication.\nThe final version of record is available at  http://dx.doi.org/10.1109/TCPMT.2019.2904430\nCopyright (c) 2019 IEEE. Personal use is permitted. For any other purposes, permission must be obtained from the IEEE by emailing pubs-permissions@ieee.org.\nJOURNAL OF 3\nFig. 3: Performance of a direct connection between a groove\ng\nap waveguide and a WR-10 rectangular waveguide.\nThe second part of the transition follows a similar approach\nto that proposed in [ ?]. The impedances of the Chebyshev\ntransformer sections are calculated by the standard formulation\n[?].\nFirst, the order of the transition necessary to satisfy the\nmaximum value of reﬂection coefﬁcient, A, is calculated as:\nA = log\n( RL\nZ0\n) 1\n2TN ( sec θM ) (1)\nwhere TN is Chebyshev polynomial of order N, N is the order\nof the Chebyshev transformer, RL is the load impedance (in\nthis case the impedance of the air ﬁlled GGW), Z0 is the input\nimpedance (in this case, the dielectric ﬁlled GGW).\nThe parameter θM is given by:\nθM = π\n2 ( 1 − ∆ f\n2f0\n) ( 2)\nwhere ∆ f is the transformer bandwidth and f0 is the central\nfrequency.\nThe impedance of the different waveguide sections are\ncalculated as the waveguide electric impedance [ ?].\nZwg = 2 η0\n√ ǫr\nb\nw ( 3)\nwhere η0 is the vacuum impedance, ǫr is the dielectric constant\nof the GGW ﬁlling medium (the microstrip dielectric substrate\nfor the DFGW and air for the rest of them), b is the height of\nthe GGW section and w is the width of the GGW , 2.45 mm.\nThe reﬂection coefﬁcients are calculated by equating the\nterms.\nρ(θ) = 2 e− jNθ [ρ0cosNθ + ρ1cos(N − 2)θ + . . . +\nρncos(N − 2n)θ + . . .] = Ae(− jNθ )TN (secθmcosθ)\n(4)\nFor this design a three section transformer is enough to\nobtain return loss higher than 15 dB in the full W -band and\nthese values are calculated as\nρ0 = A sec3 θM\n2 ( 5)\nρ1 = 3A(sec3 θM − sec θM )\n2 ( 6)\nand ρ2 = ρ1 because of the symmetry of the Chebyshev\ntransformer. Finally, the impedance of the n-th section, Zn,\nis obtained as:\nZn = Zn− 1e2ρn− 1 (7)\nThese impedances correspond to the electric impedance of a\nwaveguide and their heights are calculated from ( ??):\nbn = w Zwg,n\n2\n√ ǫr\nη0\n( 8)\nwhere Zwg,n is the impedance of the n-th GGW section.\nFig. ???? shows a perspective view of the three steps of\nthe half-split Chebyshev transformer with waveguide height\nbn and length ln, which corresponds to λg/4. The input GGW\nsection is ﬁlled with dielectric, and its height corresponds to\nthe substrate thickness plus the metal cladding. Note that there\nis no restriction on its length, since this section is not strictly a\npart of the Chebyshev transformer. The same value as for the\nother sections has been taken. In addition, given the change\nof dielectric, the required impedance of the ﬁrst section is\nobtained with the same height, i.e. b1 = b0.\nThe dimensions of the whole transition can be seen in\nT able ??. The structure has been simulated using the com-\nmercial Finite Element Method solver Ansys HFSS. First,\nthe two different parts, i.e. the microstrip to dielectric ﬁlled\nGGW and the Chebyshev transformer between dielectric ﬁlled\nGGW and air ﬁlled GGW , have been simulated separately.\nThese results are presented in Fig. ??. It can be seen that the\nreturn loss is better than 20 dB for both cases. On the other\nhand, the insertion loss are lower than 0.5 dB for both cases.\nNonetheless, in the microstrip case the losses are higher, due\nto the dielectric and radiation losses. Note that these results\nhave been obtained with the analytic procedure above, without\nany full-wave optimization.\nThe back-to-back transition includes a 5.18 mm microstrip\nline in between the two transitions; the model used for\nsimulation is shown in Fig. ??. When the whole transition is\nanalysed, the insertion and return loss results shown in Fig. ??\nare obtained. In this ﬁgure, the microstrip to GGW single and\nback-to-back transitions are compared.\nThe mean insertion loss is 0.66 dB for the single transition\nand 1 dB for the back-to-back conﬁguration. The higher\ninsertion loss in the back-to-back conﬁguration is ascribed\nto the substrate losses in the longer microstrip line. The\nlosses in the microstrip line have been calculated by full wave\nsimulation in HFSS taking into account the loss tangent of the\ndielectric material at high frequencies ( tanδ = 0 .009). For the\nsingle transition these losses are 0.33 dB. Therefore, the losses\nof the transition can be estimated as 0.66 − 0.33 = 0 .33 dB.\nThe mean return loss is 24.1 dB and 17.2 dB for the single\nand back-to-back transitions, respectively. The back-to-back\nThis is the author's version of an article that has been published in this journal. Changes were made to this version by the publisher prior to publication.\nThe final version of record is available at  http://dx.doi.org/10.1109/TCPMT.2019.2904430\nCopyright (c) 2019 IEEE. Personal use is permitted. For any other purposes, permission must be obtained from the IEEE by emailing pubs-permissions@ieee.org.\nJOURNAL OF 4\n(a)\n(b)\nF\nig. 4: Microstrip to groove gap waveguide transition: (a)T op\nV iew and (b) Perspective view of the half-split transition.\n75 80 85 90 95 100 105 110−30\n−25\n−20\n−15\n−10\nS11 (dB)\nFrequency (GHz)\n \n \n75 80 85 90 95 100 105 110−1\n−0.5\n0\nFrequency (GHz)\nS21 (dB)\n \n \nuStrip to DFGGW\nChebyshev GGW\nuStrip to DFGGW\nChebyshev GGW\nFig. 5: Simulation of the scattering parameters of the mi-\nc\nrostrip to dielectric ﬁlled GGW (solid line) and the GGW\nChebyshev transformer (dashed line).\nFig. 6: 3D perspective view of the back-to-back transition\nm\nodel used for HFSS simulation.\nT ABLE II: Dimensions of the transition ( µm).\nParameter Description Design Fabricated\nlt Microstrip taper length 1500 1467\nwt Microstrip taper width 1300 1256\nb0 Input GGW height 116 158\nb1 GGW Section 1 height 116 158\nb2 GGW Section 2 height 380 407\nb3 GGW Section 3 height 950 953\nl0 Input GGW length 830 859\nl1 GGW Section 1 length 830 821\nl2 GGW Section 2 length 830 810\nl3 GGW Section 3 length 830 810\nw GGW width 2450 2290\nb WR-10 waveguide height 1270 1280\ntransition presents worse S1 1 due to the non perfect matching\nat both ports. Anyway, return loss is better than 15 dB for\nalmost the whole band in both conﬁgurations. In Fig. ?? the\nelectric ﬁeld distribution at 92.5 GHz is shown. It can be\nobserved that the Quasi-TEM mode of the microstrip line\ncouples to the vertical mode of the GGW . Furthermore, the\nmode conﬁnement in the GGW region thanks to the bed of\nnails can be also appreciated, although the ﬁeld evanescently\ndecays in the pin areas.\nC. T olerance analysis\nThe effect of different manufacturing and assembly errors\nwill be evaluated in this section. First, the effect of the air\ngap between the bed of nails and the lid on the performance\nof the transition will be studied. As a matter of fact, one of\nthe main problems when rectangular waveguides are split in\nthe H-Plane is the tight contact required between both parts\nin order to reduce losses. This problem is alleviated by the\nuse of the bed of nails, since no contact is required. In our\ndesign an 80 µm air gap has been considered at the end of\nthe pins. T o evaluate the error tolerance on this air gap the pin\nlength has been swept around the nominal value. The results\nare shown in Fig. ??. W e can observe that when the air gap is\nThis is the author's version of an article that has been published in this journal. Changes were made to this version by the publisher prior to publication.\nThe final version of record is available at  http://dx.doi.org/10.1109/TCPMT.2019.2904430\nCopyright (c) 2019 IEEE. Personal use is permitted. For any other purposes, permission must be obtained from the IEEE by emailing pubs-permissions@ieee.org.\nJOURNAL OF 5\n75 80 85 90 95 100 105 110−50\n−40\n−30\n−20\n−10\n0\nFrequency(GHz)\nS11 (dB)\n \n \n75 80 85 90 95 100 105 110−5\n−4\n−3\n−2\n−1\n0\nFrequency(GHz)\nS21 (dB)\n \n \nSingle\nBacktoBack\nSingle\nBacktoBack\nFig. 7: Simulation of the scattering parameters for the mi-\nc\nrostrip to groove gap waveguide single (solid line) and back-\nto-back transitions (dashed line).\nFig. 8: E-Field distribution of the microstrip to GGW transit ion\nat 92.5 GHz.\nsmaller than the nominal value, the transition behavior remains\nhardly unaffected. The performance gets worse at the central\nfrequency but in any case the reﬂection coefﬁcient is below\n-18 dB. However, when the air gap increases, there is a certain\ndegradation of the performance and the bandwidth below -15\ndB is reduced. Nonetheless, the performance is still acceptable\nand represents a good solution for H-plane splits.\nIn addition, different errors related to misalignments of\nthe microstrip substrate have been considered. First, the\nmisalignment in the waveguide longitudinal direction, i.e. z\ndirection according to Fig. ?? has been analysed. In this\nFig. 9: Evaluation of the effect on the transition performanc e of\nerrors in the fabrication of the metallic pins, given by different\nvalues of h.\ncase the misalignment produces the microstrip taper length\nto be shorter than designed and the substrate enters into the\nsecond Chebyshev transformer step, see the inset in Fig. ??\nfor clariﬁcation.\nThe simulation results for different values of misalignment\nare shown in Fig. ??. The response is still acceptable for\n100 µm, with S11 ≤ − 12 dB for almost the whole band.\nHowever, for 500 µm the performance is not satisfactory. This\ndegradation is produced by two effects: on the one hand the\nmicrostrip taper line becomes shorter than required and its ﬁnal\nimpedance is different from the impedance of the DFGGW;\non the other one, the dielectric enters the second step and\nmodiﬁes its impedance and wavelength. Both effects modify\nthe response of the Chebyshev adapter.\nAnother effect that has been taken into account is the\nmisalignment in the transverse direction, i.e. in the x direction\naccording to Fig. ??. This positioning error implies that the\npins touch the dielectric substrate and therefore the air gap\nat their end becomes equal to the substrate thickness, i.e.\n0.127 mm. Therefore, the nominal case corresponds to the\nsubstrate centred with the GGW , but with this value of h,\ndifferent from the optimum, 80 µm. In this case, the effect\nis more important than in the previous one, see Fig. ??,\nmainly because, due to the loss of symmetry, the displace-\nment prevents the microstrip taper line to excite properly the\nGGW mode. As a matter of fact, a high order resonance is\nexcited for misalignments larger than 30 µm. Nonetheless,\nthe performance is still acceptable until the displacement is\n100 µm. Thus, the alignment pins in the microstrip substrate\nare necessary in order to guarantee accurate assembly.\nFinally, the effect that the substrate has a cutting error so\nThis is the author's version of an article that has been published in this journal. Changes were made to this version by the publisher prior to publication.\nThe final version of record is available at  http://dx.doi.org/10.1109/TCPMT.2019.2904430\nCopyright (c) 2019 IEEE. Personal use is permitted. For any other purposes, permission must be obtained from the IEEE by emailing pubs-permissions@ieee.org.\nJOURNAL OF 6\nFig. 10: Evaluation of the effect on the misalignment of the\nm\nicrostrip substrate in the z direction, given by different values\nof misz. The inset shows the displaced microstrip substrate\nand its nominal position (in dashed line).\nFig. 11: Evaluation of the effect on the misalignment of the\nm\nicrostrip substrate in the x direction, given by different values\nof misz. The inset shows the displaced microstrip substrate\nand its nominal position (in dashed line). The nominal case\ncorresponds to h = 127 µm.\nFig. 12: Evaluation of the effect on the substrate length, giv en\nby different values of tolz. The inset shows the microstrip\nsubstrate and its nominal dimensions (in dashed line).\nthat it is longer than the designed one has been evaluated .\nThe effect is shown in Fig. ??. This error is not so critical,\nsince it just affects the impedance and propagation constant\nof the second transformer section. The S11 is below -10 dB\nfor all cases; thus the circuit is tolerant to this misalignment.\nIII. M A N U FACT U RIN G A N D EX P E RIM E N TA L V A L IDAT IO N\nIn order to verify the transition performance, the back-to-\nback conﬁguration was manufactured and tested. As explained\npreviously, the two transitions were separated by a 5.18 mm\nlong microsrip line. The behaviour of the whole structure is\nnot affected by this microstip length; however, the longer the\nmicrostrip the higher the circuit global losses. The GGWs were\n9 mm long and were connected directly to the WR10 rectan-\ngular waveguides of the W -band millimetre wave extenders.\nThe metallic block was micromachined in aluminium and\nsplit in the H-Plane. The pins are machined just in one of the\nmetallic blocks, the other one being ﬂat. Proper alignment was\nguaranteed by eight screws and eight alignment pins. Since a\ntight contact between the upper and bottom metallic parts is\nnot required, the manufacturing tolerances can be relaxed.\nThe microstrip transition was manufactured by a stan-\ndard photolithography procedure at the Public University of\nNavarra’s facilities. First, the bare substrate is cleaned, and\nafterwards coated with a 7 µm layer of AZ nlof 2070 negative\nphotoresist. The photoresist is baked at 110 o and exposed to\nultraviolet light. After exposing, the photoresist is developed\nwith the AZ726 chemical developer. The photoresist that has\nnot been exposed to UV light is removed and then the substrate\nis metallized with 2 µm of copper. Finally, a technical stripper,\nNI555, is applied to the substrate, removing the metallized\nphotoresist. The ﬁnal step consists on cutting the circuit with\nThis is the author's version of an article that has been published in this journal. Changes were made to this version by the publisher prior to publication.\nThe final version of record is available at  http://dx.doi.org/10.1109/TCPMT.2019.2904430\nCopyright (c) 2019 IEEE. Personal use is permitted. For any other purposes, permission must be obtained from the IEEE by emailing pubs-permissions@ieee.org.\nJOURNAL OF 7\n(a)\n(b)\nF\nig. 13: Photographs of the fabricated prototype and measure-\nment set-up. (a) Microstrip line printed on Rogers CuClad\n233 substrate on the bottom metallic block and the two bed\nof pins. (b) Back-to-back transition connected to the VDI W -\nBand extenders.\nthe required shape. For this purpose, a LPKF ProtMatH100\nmilling machine was been used. Photographs of the fabricated\nprototype can be seen in Fig. ????.\nThe circuit assembly is simple. The substrate is placed in\nthe bottom metallic block with the help of the alignment pins.\nIt is then tightly screwed and ﬁnally the circuit is closed with\nthe top metallic block. It is not necessary to weld or glue any\npart.\nOnce assembled, the back-to-back transition was measured\nwith an Agilent PNA-X E3861 Microwave Network Analyser\nwith two VDI W -Band VNA Extenders. Previously the equip-\nment was calibrated using the standard TRL (Through, Reﬂect,\nLine) calibration kit. Fig. ???? shows a photograph of the\nmeasurement setup. A comparison between the measurements\nand the back-to-back simulation, for the ideal case and for\nthe case taking into account the deviation of the dimensions\nproduced by the tolerance error in the fabrication process is\nplotted in Fig. ??. These dimensions have been measured with\na Mitutoyo Hyper MF-U 176-402-43 measuring microscope.\nComparing with the simulation results, shown with point-\ndash line, where manufacturing errors are not taken into\naccount, the cut-off frequency and the response is blueshifted\nand there is certain degradation in terms of performance.\nThe frequency shift is ascribed to the narrower manufactured\nGGW channel, which is 2.39 mm wide instead of 2.45 mm.\nNonetheless, the predicted response, once the fabricated values\nare introduced in the simulation model, is in good agreement\nwith the measured performance. The best measured insertion\n75 80 85 90 95 100 105 110−50\n−40\n−30\n−20\n−10\n0\nFrequency(GHz)\nS11 (dB)\n \n \n75 80 85 90 95 100 105 110−10\n−8\n−6\n−4\n−2\n0\nFrequency(GHz)\nS21 (dB)\n \n \nsim fab\nmeas\nsim\nsim fab\nmeas\nsim\nFig. 14: Comparison between the predicted performance (poin t\ndashed line), the simulation taking into account fabrication\nerrors (solid line) and measurement results (dashed line) of\nthe back-to-back transition.\nloss is 1.5 dB at 90.4 GHz, with 3 dB mean value if the full\nW -band is considered. In addition, in the 85 - 105 GHz band\nthe insertion loss is better than 2 dB. These losses include\nthose in the transition and in the microstrip line. For the 5.18\nmm long microstrip line the losses computed by HFSS are\n0.66 dB. If the transition is considered symmetric and the\nlosses of the microstrip line are removed, the transition losses\ncan be estimated as 1.17 dB for each single transition, i.e. the\ntaper and the Chebyshev transformer. Finally, the return loss\nis better than 10 dB from 83.9 GHz to 109 GHz, except for a\nresonant peak at 105 GHz.\nIV . C O N CL U S IO N\nAn inline microstrip to groove gap waveguide transition\nwhich allows for analytic design has been presented in this\npaper. This solution provides a good alternative for MMIC\npackaging and connection to GGW components. In order to\nprove this concept, a W -band transition based on the back-\nto-back conﬁguration has been validated, presenting good\nagreement with the simulations: return loss better than 10 dB\nand insertion loss lower than 2 dB.\nACK N OW L E D G M E N T\nThe authors would like to thank ﬁnancial support by the\nSpanish MINECO, Project No. TEC2013-47753-C3-1-R and\nProject No. TEC2016-76997-C3-1-R.\nRE F E RE N CE S\n[1] B. Panzner, “In-band wireless backhaul for 5G millimeter wave cellular\ncommunications - interactive live demo” 2015 IEEE Conference on\nComputer Communications W orkshops, Hong Kong, 2015, pp. 21-22.\nThis is the author's version of an article that has been published in this journal. Changes were made to this version by the publisher prior to publication.\nThe final version of record is available at  http://dx.doi.org/10.1109/TCPMT.2019.2904430\nCopyright (c) 2019 IEEE. Personal use is permitted. For any other purposes, permission must be obtained from the IEEE by emailing pubs-permissions@ieee.org.\nJOURNAL OF 8\n[\n2] J. Hasch, E. T opak, R. Schnabel, T . Zwick, R. W eigel and C. W ald-\nschmidt, “Millimeter-W ave T echnology for Automotive Radar Sensors in\nthe 77 GHz Frequency Band, ” IEEE Trans. Microw . Theory T ech., vol.\n60, no. 3, pp. 845–860, March 2012.\n[3] D. M. Sheen, D. L. McMakin and T . E. Hall, “Three-dimensional\nmillimeter-wave imaging for concealed weapon detection, ” IEEE Trans.\nMicrow . Theory T ech., vol. 49, no. 9, pp. 1581–1592, Sep. 2001.\n[4] T . A. Midford, J. J. W ooldridge, and R. L. Sturdivant, “The evolution of\npackages for monolithic microwave and millimeter-wave circuits, ” IEEE\nTrans. Antennas Propag., vol. 43, no. 9, pp. 983—991, Sep. 1995.\n[5] E. Rajo-Iglesias and P .-S. Kildal, “Numerical studies of bandwidth of\nparallel plate cut-off realized by bed of nails, corrugations and mushroom-\ntype EBG for use in gap waveguides, ” IET Microw . Antennas Propagat.,\nvol. 5, no. 3, pp. 282-–289, Mar . 2011.\n[6] E. Rajo-Iglesias, A. U. Zaman, and P .-S. Kildal, “Parallel plate cavity\nmode suppression in microstrip circuit packages using a lid of nails, ”\nIEEE Microw . W ireless Compon. Lett., vol. 20, no. 1, pp. 31-–33, Jan.\n2010.\n[7] E. Rajo-Iglesias, E. Pucci, A. A. Kishk, and P .-S. Kildal, “Suppression of\nparallel plate modes in low frequency microstrip circuit packages using\nlid of printed zigzag wires, ” IEEE Microw . W ireless Compon. Lett., vol.\n23, no. 7, pp. 359-–361, Jul. 2013.\n[8] A. U. Zaman, M. Alexanderson, T . V ukusic, and P .-S. Kildal, “Gap\nwaveguide PMC packaging for improved isolation of circuit components\nin high-frequency microwave modules, ” IEEE Trans. Compon. P ackag.\nManuf. T echnol., vol. 4, no. 1, pp. 16—25, Jan. 2014.\n[9] A. Rebollo, R. Gonzalo, and I. Ederra, “Optimization of a Pin Surface as\na Solution to Suppress Cavity Modes in a Packaged W-band Microstrip\nReceiver, ” IEEE Trans. Compon. P ackag. Manuf. T echnol., vol. 4, no. 6,\npp. 975–982, Jun. 2014\n[10] Y . Shi, M. Zhou, and J. Zhang, “Parallel plate mode suppression in low\nfrequency microwave circuit packages using lid of 3-D cross by a 3-D\nprinting technique, ” IEEE Trans. Electromagn. Compat ., vol. 59, no. 4,\npp. 1268—1271, Aug. 2017.\n[11] P . S. Kildal, “Three metamaterial-based gap waveguides between parallel\nmetal plates for mm/submm waves, ” 2009 3rd European Conference on\nAntennas and Propagation , Berlin, 2009, pp. 28–32.\n[12] P . S. Kildal, E. Alfonso, A. V alero-Nogueira and E. Rajo-Iglesias, “Local\nMetamaterial-Based W aveguides in Gaps Between Parallel Metal Plates, ”\nIEEE Antennas W ireless Propag. Lett., vol. 8, pp. 84–87, 2009.\n[13] A. Berenguer, V . Fusco, D. E. Zelenchuk, D. S ´ anchez-Escuderos, M.\nBaquero-Escudero, and V . E. Boria-Esbert, “Propagation characteristics\nof groove gap waveguide below and above cutoff, ” IEEE Trans. Microw .\nTheory T echn., vol. 64, no. 1, pp. 27-–36, Jan. 2016.\n[14] A. U. Zaman, P .-S. Kildal, and A. A. Kishk, “Narrow-band microwave\nﬁlter using high-Q groove gap waveguide resonators with manufacturing\nﬂexibility and no sidewalls, ” IEEE Trans. Compon. P ackag., Manuf.\nT echnol., vol. 2, no. 11, pp. 1882-–1889, Nov . 2012.\n[15] A. V osoogh, A. A. Braz´ alez, and P .-S. Kildal, “ A V -band inverted\nmicrostrip gap waveguide end-coupled bandpass ﬁlter, ” IEEE Microw .\nW ireless Compon. Lett., vol. 26, no. 4, pp. 261—263, Apr . 2016.\n[16] A. Farahbakhsh, D. Zariﬁ, and A. U. Zaman, “60-GHz groove gap\nwaveguide based wideband H-plane power dividers and transitions: For\nuse in high-gain slot array antenna, ” IEEE Trans. Microw . Theory T echn.,\nvol. 65, no. 11, pp. 4111-–4121, Nov . 2017.\n[17] B. Ahmadi and A. Banai, “Substrateless ampliﬁer module realized by\nridge gap waveguide technology for millimeter-wave applications, ” IEEE\nTrans. Microw . Theory T echn., vol. 64, no. 11, pp. 3623—3630, Nov .\n2016.\n[18] U. Nandi, A. U. Zaman, A. V osoogh and J. Y ang, “Novel Millimeter\nW ave Transition From Microstrip Line to Groove Gap W aveguide for\nMMIC Packaging and Antenna Integration, ” IEEE Microw . W ireless\nComp. Lett. , vol. 27, no. 8, pp. 691–693, Aug. 2017.\n[19] Y . Zhou, H. Liu, E. Li, G. Guo and T . Y ang, “Design of a wideband tran-\nsition from double-ridge waveguide to microstrip line, ” 2010 International\nConference on Microwave and Millimeter W ave T echnology , Chengdu,\n2010, pp. 737–740.\n[20] A. Algaba Braz´ alez, J. Flygare, J. Y ang, V . V assilev , M. Baquero-\nEscudero and P . Kildal, “Design of F -Band Transition From Microstrip\nto Ridge Gap W aveguide Including Monte Carlo Assembly T olerance\nAnalysis, ” IEEE Trans. Microw . Theory T ech., vol. 64, no. 4, pp. 1245-\n1254, April 2016.\n[21] Y . Shi, J. Zhang, S. Zeng and M. Zhou, “Novel W-band Millimeter W ave\nTransition From Microstrip Line to Groove Gap W aveguide for MMIC\nIntegration and Antenna Application, ” IEEE Trans. Antennas Propag. ,\nvol. 66, no. 6, pp. 3172–3176, jun. 2018.\n[22] Y . Zhang, J. A. Ruiz-Cruz, K. A. Zaki and A. J. Piloto, “ A W aveguide\nto Microstrip Inline Transition With V ery Simple Modular Assembly , ”\nIEEE Microw . W ireless Comp. Lett., vol. 20, no. 9, pp. 480-482, Sept.\n2010.\n[23] A. Rebollo, R. Gonzalo and I. Ederra, “ An Inline Microstrip-to-\nW aveguide Transition Operating in the Full W-Band”, J. Infrared Millim.\nT erahertz W aves, V ol. 36, pp. 734-744, 2015.\n[24] J. M. P ´ erez-Escudero, A.E. T orres-Garc´ ıa, R. Gonzalo and I. Ederra, “ A\nSimpliﬁed Design Inline Microstrip-to-W aveguide Transition”, Electron-\nics, vol. 7, no 10, pp. 215, 2018.\n[25] D. M. Pozar, “Microwave engineering”, 4th ed., John W iley & Sons,\n2011.\n[26] S. J. Orfanidis, “Electromagnetic W aves and Antennas”, NJ,\nPiscataway , Online Book., Aug. 2016, [online] A vailable:\nhttp://www .ece.rutgers.edu/ orfanidi/ewa/.\n[27] I. A. Eshrah, A. A. Kishk, A. B. Y akovlev and A. W . Glisson, “Rectan-\ngular waveguide with dielectric-ﬁlled corrugations supporting backward\nwaves, ” IEEE Trans. Microw . Theory T ech., vol. 53, no. 11, pp. 3298-\n3304, Nov . 2005.\nJose M. P ´e rez-Escudero was born in Murcia, Spain,\nin 1988. He received the Degree in T elecommuni-\ncation Engineering from the Universidad Polit´ ecnica\nde Cartagena, Murcia, Spain.\nFrom September of 2013 to March of 2014 he\nwas with Fraunhofer Institute for High Frequency\nPhysics and Radar T echniques FHR, Bonn, Ger-\nmany , where he was working on waveguide and\nplanar technology ﬁlters and their applications in\nRadar systems. Since April 2015 he is with the\nAntenna Group at the Electrical, Electronic and\nCommunication Department of the Public University of Navarra as Predoctoral\nResearch Fellow .\nHis interests include T erahertz components, antennas and their applications\nin the millimeter and sub-millimeter wave ranges.\nAlicia E. T orres-Garc´ ıa w as born in Cuba in 1990.\nShe received the Degree in T elecommunication En-\ngineering from the Instituto Superior Polit´ ecnico\nJos ´ e Antonio Echeverr´ ıa (ISPJAE), Havana, Cuba,\nin 2013.\nShe is currently working as a Predoctoral Re-\nsearch Fellow in the Antenna Group in the Electrical,\nElectronic and Communication Engineering Depart-\nment of the Public University of Navarre (UPNA),\nSpain.\nHer interests include millimeter wave and THz\ncomponents and antennas, metamaterials, planar antennas and different re-\nsearch ﬁelds in the microwave range.\nRam ´o n Gonzalo (M’94) received the M.Sc. and\nPh.D. degrees (Hons.) in Ingeniero de T elecomu-\nnicaci ´ on from the Public University of Navarra\n(UPNA), Pamplona, Spain.\nSince 1995, he has been with the Antenna Group,\nElectrical and Electronic Engineering Department,\nUPNA, where he is currently a Full Professor .\nFrom 1997 to 1998, he was a Research Fellow\nof the Antenna Section, ESA-ESTEC, Noordwijk,\nThe Netherlands. From 2008 to 2010, he was the\nHead of the Electrical and Electronic Engineering\nDepartment. He is a member of the Institute of Smart Cities, UPNA,\nPamplona. He has authored over 60 journal publications in peer-reviewed\nmagazines and 100 conference papers related to his research lines.\nDr . Gonzalo was a co-recipient of the LAPC 2006, LAPC 2007, and IW A T\n2007 Best Paper A ward.\nThis is the author's version of an article that has been published in this journal. Changes were made to this version by the publisher prior to publication.\nThe final version of record is available at  http://dx.doi.org/10.1109/TCPMT.2019.2904430\nCopyright (c) 2019 IEEE. Personal use is permitted. For any other purposes, permission must be obtained from the IEEE by emailing pubs-permissions@ieee.org.\nJOURNAL OF 9\nI ˜n igo Ederra (M’2015) received the Ingeniero de\nT elecomunicaci ´ on and Ph.D. degrees from the Uni-\nversidad P ´ ublica de Navarra, Pamplona, Spain, in\n1996 and 2004, respectively .\nIn 1997, he joined the Microwave and Millime-\ntre W ave Group, Universidad Pu ´ ublica de Navarra.\nFrom 1999 to 2000 he was with the European\nSpace Research and T echnology Centre (ESTEC),\nESA, Noordwijk, The Netherlands, where he was\nworking on Electromagnetic Bandgap materials and\ntheir applications in the ﬁeld of antennas. Since 2001\nhe is with the Antenna Group, Universidad P ´ ublica de Navarra. From June to\nOctober 2002 he was visitor scientist at the Rutherford Appleton Laboratory ,\nChilton, Didcot, UK, participating in ESA ’ s Startiger I project. Currently , he\nholds an Associate Professor position at the Universidad P ´ ublica de Navarra\nand is a member of its Institute of Smart Cities.\nHis research interests are in the ﬁeld of Metamaterials and Metasurfaces\nand their applications in microwave, millimetre wave and THz components\nand antennas.\nThis is the author's version of an article that has been published in this journal. Changes were made to this version by the publisher prior to publication.\nThe final version of record is available at  http://dx.doi.org/10.1109/TCPMT.2019.2904430\nCopyright (c) 2019 IEEE. Personal use is permitted. For any other purposes, permission must be obtained from the IEEE by emailing pubs-permissions@ieee.org.",
  "topic": "Monolithic microwave integrated circuit",
  "concepts": [
    {
      "name": "Monolithic microwave integrated circuit",
      "score": 0.8453367352485657
    },
    {
      "name": "Microstrip",
      "score": 0.8208311796188354
    },
    {
      "name": "Insertion loss",
      "score": 0.7472344040870667
    },
    {
      "name": "Chebyshev filter",
      "score": 0.6520588397979736
    },
    {
      "name": "Return loss",
      "score": 0.598182201385498
    },
    {
      "name": "Materials science",
      "score": 0.5593201518058777
    },
    {
      "name": "Microwave",
      "score": 0.5467062592506409
    },
    {
      "name": "Optoelectronics",
      "score": 0.4739147424697876
    },
    {
      "name": "Transformer",
      "score": 0.4652467966079712
    },
    {
      "name": "Extremely high frequency",
      "score": 0.45693933963775635
    },
    {
      "name": "Integrated circuit packaging",
      "score": 0.452575147151947
    },
    {
      "name": "Electrical engineering",
      "score": 0.41355788707733154
    },
    {
      "name": "Integrated circuit",
      "score": 0.37802648544311523
    },
    {
      "name": "Optics",
      "score": 0.31791743636131287
    },
    {
      "name": "Engineering",
      "score": 0.23460522294044495
    },
    {
      "name": "Telecommunications",
      "score": 0.20641452074050903
    },
    {
      "name": "Physics",
      "score": 0.1986803412437439
    },
    {
      "name": "Voltage",
      "score": 0.10086831450462341
    },
    {
      "name": "Antenna (radio)",
      "score": 0.08762335777282715
    },
    {
      "name": "Amplifier",
      "score": 0.08650991320610046
    },
    {
      "name": "CMOS",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I175051016",
      "name": "Universidad Publica de Navarra",
      "country": "ES"
    },
    {
      "id": "https://openalex.org/I88155538",
      "name": "Universidad de Navarra",
      "country": "ES"
    }
  ],
  "cited_by": 16
}