{
  "title": "System-Level Efficiency Evaluation of Isolated DC/DC Converters in Power Electronics Transformers for Medium-Voltage DC Systems",
  "url": "https://openalex.org/W2931989794",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A5100430213",
      "name": "You Wang",
      "affiliations": [
        "Tsinghua University",
        "ORCID"
      ]
    },
    {
      "id": "https://openalex.org/A5037912035",
      "name": "Kui Wang",
      "affiliations": [
        "Tsinghua University"
      ]
    },
    {
      "id": "https://openalex.org/A5100351589",
      "name": "Chi Li",
      "affiliations": [
        "Tsinghua University"
      ]
    },
    {
      "id": "https://openalex.org/A5100664806",
      "name": "Zedong Zheng",
      "affiliations": [
        "Tsinghua University"
      ]
    },
    {
      "id": "https://openalex.org/A5014965312",
      "name": "Yongdong Li",
      "affiliations": [
        "Tsinghua University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2166967631",
    "https://openalex.org/W2071303620",
    "https://openalex.org/W2299934370",
    "https://openalex.org/W2741026795",
    "https://openalex.org/W2791367555",
    "https://openalex.org/W2150682005",
    "https://openalex.org/W2799142996",
    "https://openalex.org/W2173928183",
    "https://openalex.org/W1993447000",
    "https://openalex.org/W2097227114",
    "https://openalex.org/W2614033278",
    "https://openalex.org/W2609064953",
    "https://openalex.org/W2519904480",
    "https://openalex.org/W2343423779",
    "https://openalex.org/W2017397145",
    "https://openalex.org/W2799338297",
    "https://openalex.org/W2345302533",
    "https://openalex.org/W2779884740",
    "https://openalex.org/W2547719158",
    "https://openalex.org/W2344312116",
    "https://openalex.org/W2611515257",
    "https://openalex.org/W2899002170",
    "https://openalex.org/W2795227909",
    "https://openalex.org/W2599188969",
    "https://openalex.org/W2268315293",
    "https://openalex.org/W2936651239",
    "https://openalex.org/W2003821750",
    "https://openalex.org/W2898622277",
    "https://openalex.org/W2800031938",
    "https://openalex.org/W2796332325",
    "https://openalex.org/W2091254012",
    "https://openalex.org/W1970816228",
    "https://openalex.org/W2805848997",
    "https://openalex.org/W2558041348",
    "https://openalex.org/W2547786642",
    "https://openalex.org/W2346954480",
    "https://openalex.org/W1973078327"
  ],
  "abstract": "This paper presents system-level efficiency evaluation of the suitable isolated dc/dc converters in input-series-output-parallel power electronics transformers (PET) applied for medium-voltage dc systems and provides engineering insights into the design of PETs from a system perspective. To this end, three candidates-a single-stage dual active bridge (DAB) converter, a boost converter plus a DAB with a constant boost output voltage, and a boost converter plus a DAB with a constant DAB voltage gain-are selected and evaluated from a system-level aspect. Comprehensive system-level efficiency comparisons are done with the chosen candidates, considering numbers of normal and hot standby submodules, different working conditions, rated voltages and power of the PET, switching frequencies, and commercial devices. Analysis with detailed loss breakdowns clearly shows the distribution of losses and elaborates the profound reasons behind the efficiency differences. In the comparison, the boost and DAB with a constant boost output voltage have higher or similar efficiency than the other two candidates, verified by simulation and experimental results. Considering its advantages in redundancy in the PET, the boost and DAB with constant boost output voltage are a preferable choice for submodules in input-series-output-parallel PETs.",
  "full_text": "Received February 28, 2019, accepted March 26, 2019, date of publication April 3, 2019, date of current version April 22, 2019.\nDigital Object Identifier 10.1 109/ACCESS.2019.2909014\nSystem-Level Efficiency Evaluation of Isolated\nDC/DC Converters in Power Electronics\nTransformers for Medium-Voltage DC Systems\nYOU WANG\n , (Student Member, IEEE), KUI WANG\n, (Senior Member, IEEE),\nCHI LI\n , (Member, IEEE), ZEDONG ZHENG\n, (Senior Member, IEEE),\nAND YONGDONG LI, (Member, IEEE)\nDepartment of Electrical Engineering, Tsinghua University, Beijing 100084, China\nCorresponding author: Zedong Zheng (zzd@mail.tsinghua.edu.cn)\nThis work was supported in part by the Natural Science Foundation of Beijing Municipality, China, under Grant 3161001.\nABSTRACT This paper presents system-level efﬁciency evaluation of the suitable isolated dc/dc converters\nin input-series-output-parallel power electronics transformers (PET) applied for medium-voltage dc systems\nand provides engineering insights into the design of PETs from a system perspective. To this end, three\ncandidates—a single-stage dual active bridge (DAB) converter, a boost converter plus a DAB with a constant\nboost output voltage, and a boost converter plus a DAB with a constant DAB voltage gain—are selected\nand evaluated from a system-level aspect. Comprehensive system-level efﬁciency comparisons are done\nwith the chosen candidates, considering numbers of normal and hot standby submodules, different working\nconditions, rated voltages and power of the PET, switching frequencies, and commercial devices. Analysis\nwith detailed loss breakdowns clearly shows the distribution of losses and elaborates the profound reasons\nbehind the efﬁciency differences. In the comparison, the boost and DAB with a constant boost output voltage\nhave higher or similar efﬁciency than the other two candidates, veriﬁed by simulation and experimental\nresults. Considering its advantages in redundancy in the PET, the boost and DAB with constant boost output\nvoltage are a preferable choice for submodules in input-series-output-parallel PETs.\nINDEX TERMSDual active bridge, efﬁciency, input series output parallel, medium-voltage dc, redundancy,\npower electronics transformer.\nI. INTRODUCTION\nMedium-voltage (MV) DC systems have been new research\ndirections nowadays [1]–[3]. In MVDC systems, DC dis-\ntribution is one of the key elements [4], and requires for\nhigh voltage ratio conversion, high efﬁciency and high relia-\nbility [5]–[7]. Power Electronics Transformers (PETs) have\nprovided an attracting solution for MVDC power distribu-\ntion, and have been a widespread study interest in recent\nyears [8]–[10]. In MVDC applications, in order to extend\nvoltage and power levels, 2 major kinds of alternative topolo-\ngies were proposed based on the former in order to meet\nthe system requirements, as shown in Fig.1. In Fig. 1(a),\nthe full bridge on one side of the isolated DC/DC converter\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Sing Kiong Nguang.\nis replaced by cascaded modular multilevel submodules\nand high ratio transformers are adopted [11]–[13]. How-\never, problems remain in practical applications that high-\nfrequency transformers with a high turn ratio as well as a\nhigh-power capacity are difﬁcult and expensive for massive\ncommercial production. Although improved solutions were\nproposed [14], its disadvantages of complexity in voltage,\npower and balancing control considering the circulation prob-\nlems between the bridge arms on the MVDC side [11] and\nlack in redundancy on the LVDC side are still obstacles\nin practical applications. In Fig. 1(b), multiple LV isolated\nDC/DC converters are connected in an input-series-output-\nparallel (ISOP) conﬁguration [15], [16]. This topology is of\nhigh modularity, and from control point of view, there is no\nworry about the circulation problems because there are no\nsuspended capacitors in the submodules as all the DC buses\nVOLUME 7, 2019\n2169-3536 \n 2019 IEEE. Translations and content mining are permitted for academic research only.\nPersonal use is also permitted, but republication/redistribution requires IEEE permission.\nSee http://www.ieee.org/publications_standards/publications/rights/index.html for more information.\n48445\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nFIGURE 1. Topology of PET in MVDC application. (a) DC PET with\ncascaded modular multilevel submodules in MVDC side. (b) DC PET with\nISOP LV isolated DC/DC converters.\ncapacitors are connected in series and directly connected to\nthe MVDC side, so the control strategies are relatively simple\ncompared with the topology in Fig. 1(a).\nThe advantages of the ISOP topology make it more\nsuitable for practical MVDC applications, and on this\nbasis, DC ISOP PETs using varies kinds of LV isolated\nDC/DC converters were studied [17]–[19], among which dual\nactive bridges (DAB) are considered to be a more suitable\nchoice [20]. Although there are plenty of studies on the\ncontrol and modulation strategies of the DAB-based ISOP\nPET [17], [21], [22], the practical design in MVDC appli-\ncations from a system-level perspective are little discussed\nin literature and far from comprehensive. Existing works on\nthe PET design mostly focuses on submodule-level parameter\ndesigns for speciﬁc submodule options [23], without consid-\nering system-level redundancy and other possible submodule\noptions, which are very important design considerations in\npractical applications. Admittedly, system-level designs have\nbeen carried out in limited literatures, which however, either\nFIGURE 2. Topology of DAB based DC ISOP PET with separate DC buses.\nare for MV AC applications [24], [25] or lack of redundancy\nconsiderations [26], [27], and very few of them considered the\nselection and comparison of the submodule options. That is to\nsay, the existing literatures lack the engineering insight into\nhow the submodules are selected when satisfying practical\nconstraints and what tradeoffs to consider in design from a\nsystem perspective.\nIn terms of submodule selection in a system perspective,\nredundancy and safe response to submodule failure is a must.\nFor DAB-based DC ISOP PETs, the series connected DC bus\ncapacitors on the MVDC side will be directly short circuited\nwhen a submodule is to be bypassed, causing large over-\ncurrent on the MVDC side. One solution is bypass circuits\nand post-failure strategy improvements [28], which added to\nthe complexity of the bypass circuit and strategy. Another\nis submodule topology improvements [29], shown in Fig. 2.\nIn Fig. 2, cascaded boost converters are connected before\nthe DAB stage in the submodule (referred as BDAB in\nthis paper). In BDAB, the DC buses are isolated and will\nbe blocked by the boost stage to avoid direct short circuit\nwhen bypassing the submodule. However, for DC PETs, the\nadditional DC/DC stage may enjoy limited beneﬁts, because\nvoltage or power regulation can be achieved by DABs, and the\nswitching devices in the boost stage are hard switched, bring\nadditional losses to the system. Furthermore, in the boost\nstage, although the switching frequency is kept low to reduce\nthe losses and additional voltage control was proposed to keep\nthe voltage gain of the DAB stage constant and to improve\nefﬁciency, its inﬂuences on system-level parameter design\nand efﬁciency of the PET system have not been mentioned\nin existing works to the best knowledge of the authors. With\nthat being said, when taking speciﬁcations and redundancy of\nsubmodules and the overall system efﬁciency into account,\nthe choice of submodules in DAB-based DC ISOP PETs for\nMVDC distribution is worth further discussions.\nAmong DAB-based submodule alternatives in the DC\nISOP PETs, single stage DAB (referred as SDAB in this\npaper) presented in Fig. 1(b) and the BDAB presented\n48446 VOLUME 7, 2019\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nin Fig. 2 are commonly used topologies. For the BDAB,\nthe boost stage brings additional voltage control freedom,\nbut different control objectives may have different effects\non the overall system design and efﬁciency, so apart from\nto keep a constant DAB voltage gain like in [29], another\ncommonly used control strategy that to keep constant boost\noutput voltage is also adopted in this paper for a compre-\nhensive evaluation of the BDAB topology. Along this line,\nthree DAB-based submodule candidates are discussed in this\npaper: SDAB, BDAB with a constant boost output voltage\n(referred as BDABV) and BDAB with a constant DAB volt-\nage gain (proposed in [29] and referred as BDABG). In the\ncomparison, efﬁciency is taken as the main objective, and\ndifferent operating conditions of the PET are considered in\nthe evaluation of strengths and weaknesses of each candidate.\nSi IGBTs are selected as the switching devices in the sub-\nmodules, and IGBTs from different manufacturers, voltage\nand current level are considered in order to draw generic\nconclusions. For fair comparison, parameters of the 3 candi-\ndates are accordingly optimized in the corresponding target\nvoltages and power ratings. In the paper, the comparison of\nefﬁciency among the 3 candidates is performed in rated volt-\nage and power, load, frequency and types of devices points of\nview.\nIn this paper, section II gives the system level parameter\ndesign method for the comparison. In section III, system-level\nefﬁciency comparisons are done with respect to different\nrated voltages and power, different operating points, switch-\ning frequencies in the DAB stage, and different devices.\nSection IV shows the simulation and experimental results,\nwhich validate the conclusions drawn in section III.\nII. SYSTEM-LEVEL PARAMETER DESIGN\nIn MVDC applications, 3 aspects need to be considered dur-\ning system-level parameter design, as shown below.\n• The voltage ﬂuctuations of the grids. As the PET is\nconnected to DC grids on both sides, the DC bus voltages\nare determined by the voltages of the MV and LV grid.\nIn practical applications, ±10% voltage ﬂuctuations on\nboth sides need to be considered 30], for the cable volt-\nage drop and transient voltage ﬂuctuations in the grids.\n• The redundancy of the ISOP PET. To ensure reliability,\nredundant submodules need to be added to the ISOP\nPET. In this paper, the following redundancy control\nstrategy is adopted in order to quickly recover the PET\nfrom fault transients. In normal conditions, all the sub-\nmodules including the redundant ones are put into oper-\nation. When any failure occurs, the fault submodule is\nquickly bypassed and all the other submodules operate\nin a new steady state after a short dynamic process. The\nPET stops operating when all the added submodules are\nbypassed. 20% more hot standby submodules are added\nto the system according to engineering experiences in\nthis paper.\n• The overload ability of the PET. Considering short-term\noverload conditions may occur in the grids, the PET is\ndesigned with the ability of transferring 110% of rated\nfull load at all possible working conditions in this paper.\nA. THE NUMBER OF SUBMODULES\nIn this paper, the number of submodules without redundancy\nN and the added hot standby submodules M are functions\nof rated voltage of MV grid UMV and the maximum DC\nbus voltage Umax which is decided by the switching devices.\nSince M is determined to be 20% of N in this paper, and can\nbe derived by N in equation (1), only the derivation of N of\nthe 3 candidates are shown in the following.\nM =⌈0.2N⌉ (1)\nFor the SDAB, the voltage of DC bus should not exceed\nUmax when all the redundant module is bypassed with +10%\nvoltage ﬂuctuation in the MVDC side.\nNSDAB =\n⌈\n1.1UMV\n/\nUmax\n⌉\n(2)\nFor the BDABV , as the output of boost stage is controlled\nto be constant and the voltage of the DC bus should not exceed\nUmax , the output voltage of the boost stage is set to be Umax\nfor maximum voltage utilization of the devices. Meanwhile,\nthe duty cycle DBDABV of boost stage should not exceed\n1 with +10% voltage ﬂuctuation in the MVDC side and all\nthe redundant module bypassed.\nNBDABV =\n⌈\n1.1UMV\n/\nUmaxDBDABV\n⌉\n(3)\nFor loss and cost considerations of the entire system, N\nshould be as small as possible to reduce the number of devices\nand transformers, so in this paper, DBDABV in equation (3) is\nset to be its maximum allowable value 1 when +10% voltage\nﬂuctuation occurs in the MVDC side.\nNBDABV =\n⌈\n1.1UMV\n/\nUmax\n⌉\n(4)\nFor the BDABG, the DAB voltage gain is set to 1 to ensure\nminimum current stress and RMS current [29]. When the\nLVDC side voltage reaches the maximum value, the output\nvoltage of the boost stage in the submodule should not exceed\nUmax , while the duty cycle DBDABG of boost stage should not\nexceed 1 with +10% voltage ﬂuctuation in the MVDC side\nas well as -10% voltage ﬂuctuation in the LVDC side and all\nthe redundant module bypassed.\nNBDABG =\n⌈\n1.12UMV\n/\n0.9UmaxDBDABG\n⌉\n(5)\nSimilarly, like equation (4), DBDABG in equation (5) is set to\nbe its maximum allowable value 1 in this paper when +10%\nvoltage ﬂuctuation occurs in the MVDC side as well as −10%\nvoltage ﬂuctuation in the LVDC side.\nNBDABG =\n⌈\n1.12UMV\n/\n0.9Umax\n⌉\n(6)\nVOLUME 7, 2019 48447\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nB. TURN RATIO OF THE TRANSFORMER\nAs mentioned in II.A, because the minimum current stress\nand RMS current is achieved in the DAB when the DAB volt-\nage gain is 1, in order to optimize the working conditions of\nthe DAB, the turn ratio of transformer is designed to match the\nDAB voltage ratio under the rated operating conditions, with\nno submodules bypassed and no grid voltage ﬂuctuations on\nboth the MVDC and the LVDC sides.\nFor the SDAB, the MVDC side voltage is shared by all\nthe submodules including redundant ones, and the turn ratio\nof transformer n is derived in equation (7), where ULV is the\nrated voltage of the LVDC grid.\nnSDAB =UMV\n/\n[(1 +20%)NDABULV ] (7)\nFor the BDABV , according to II.A, as the boost stage\noutput voltage is set to Umax , n is derived in equation (8).\nnBDABV =Umax\n/\nULV (8)\nFor the BDABG, according to section II.A, Umax is\nachieved when +10% voltage ﬂuctuation occurs in the LVDC\nside to keep constant voltage gain in the DAB stage, which is\n1.1 times the rated output voltage of the boost stage, and n is\naccordingly derived in equation (9).\nnBDABD =Umax\n/\n1.1ULV (9)\nC. LEAKAGE INDUCTANCE OF THE DAB STAGE\nOptimizations are done to make sure that the 3 candidates\noperate with the minimum current stress in the most extreme\nworking condition. As the value of Ls and the modulation\nmethod will affect the current waveforms as well as the efﬁ-\nciency of the DAB under given operation points [31], optimal\ncurrent-stress phase-shift modulation [22] is adopted in order\nto ensure the zero voltage switching and the minimum current\nstress of the DAB compared with other modulation methods\nin the optimization. According to the current stress using the\nabove modulation method under the most extreme working\ncondition, an optimal value of Ls can therefore be selected,\nwith the current stress reaches minimum when adopting this\noptimal value. Because the parameter design of Ls is not\nthe key point in this paper, the design method will not be\ndescribed in detail in the paper, for there are similar design\nmethods introduced in many other articles [28], [32].\nAccording to the system requirements mentioned above,\nDABs in the submodules should be able to transfer 110%\nrated power. As Ls also inﬂuences the power transmission in\nthe DAB, the ﬁnal value of Ls also guarantees 110% rated\npower transmission under all possible working conditions.\nD. BOOST INDUCTANCE\nThe boost stages of all the submodules in the PET operate in\nthe phase shifting mode to increase the equivalent switching\nfrequency and decrease the equivalent value of boost induc-\ntance. With the maximum ripple current ratio ε, the boost\ninductance Lb is determined by (10) [24], where Uboost refers\nto the output voltage of boost stage in the submodule, pr refers\nto the rated full power, N refers to the number of the sub-\nmodules without redundancy, and fs refers to the switching\nfrequency of the boost stage.\nLb =Uboost UMV\n4εNfspr\n(10)\nIn the BDABV , Uboost equals to Umax, while in the\nBDABG, Uboost equals to Umax/1.1, and thus, Lb is deter-\nmined by (11)-(12) respectively.\nLb,BDABV =UmaxUMV\n4εNfspr\n(11)\nLb,BDABG = UmaxUMV\n1.1 ×4εNfspr\n(12)\nIII. SYSTEM EFFICIENCY COMPARISON\nA. SYSTEM SPECIFICATIONS AND LOSS ESTIMATION\nIn order to characterize the operating conditions of the sub-\nmodules in PET, d, the voltage gain of the submodule is\ndeﬁned in (13), where Uout and Uin are the input and output\nvoltage of the submodules, and n refers to the transformer turn\nratio of the transformers in the DABs.\nd =nUout\nUin\n(13)\nIn this paper, 3 most representative working conditions\nduring operation are considered.\n• Matching State: d =1, with no voltage ﬂuctuations on\nthe both side of the PET and no failure module bypassed.\nEach submodule operates under the ideal working con-\ndition in this state.\n• Over-voltage State: d > 1, with a voltage ﬂuctuation\nof −10% on the MVDC side and +10% on the LVDC\nside and no module bypassed. The voltage gain of the\nsubmodule reaches maximum in this state.\n• Under-voltage State: d < 1, with a voltage ﬂuctuation of\n+10% on the MVDC side and −10% on the LVDC side\nand all redundant module bypassed. The voltage gain of\nthe submodule reaches minimum in this state.\nAccording to section II, the operation of the PET is majorly\ndetermined by 5 aspects: DC bus voltages on the MVDC and\nthe LVDC side ( UMV and ULV ), the rated full power Pr , and\nthe maximum DC bus voltage Umax allowed by the device\nand the switching frequency fs of the devices, which will be\nevaluated one by one within reasonable ranges as follows.\nFirst, UMV and ULV are determined according to the volt-\nage levels of the MVDC and LVDC grids, and pr is chosen\naccording to the system speciﬁcations of the PET. Next,\nSi IGBTs are chosen as the switching devices in the PET\nfor they are commonly used devices in practical MVDC\napplications. Then, the voltage levels of the devices are cho-\nsen among those from commercial IGBTs, and thus Umax\nis determined. And then, fs is chosen to be 2 kHz-20 kHz,\nwhich is the commonly used switching frequency range for\nSi IGBT [33]–[35]. In DABs, due to the reactive power in the\nhigh frequency link and voltage gain mismatch, the current\nstress of the switching devices may be 2-3 times the input\n48448 VOLUME 7, 2019\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nFIGURE 3. Efficiency comparisons with different rated voltage and power.\ncurrent value [36], which limits the current rating selection.\nAt last, the minimum current level of the devices is deter-\nmined according to pr , and the model of devices will be\ntherefore be chosen with the determined voltage and current\nlevels.\nIn the loss estimation, because losses of magnetic compo-\nnents and transformers are relatively small compared with the\nlosses of switching devices with high switching frequency\nin medium-voltage high-power applications [37]–[39], only\nthe losses of IGBT will be considered in the loss model.\nThe switching losses of IGBT are seen as a function of\nthe switching current, and is expressed using Eon(Ion) or\nEoff (Ioff ). Similarly, IGBT collector-emitter saturation volt-\nage UCEsat (ICE ), freewheeling diode forward voltage Uf (If )\nand reverse recover loss Erec(Ion) can be expressed as func-\ntions of the current at switching time or during conduction\ntime. According to datasheets provided by the manufac-\nturers, Eon(Ion), Eoff (Ioff ) and Erec(Ion) are determined by\nswitching characteristics under the DC bus voltage Utest ,\nrepresented by Eon−test (Ion), Eoff −test (Ioff ) and Erec−test (Ion).\nSimilarly, UCEsat (ICE ) is determined by output characteris-\ntics of IGBTs, and Uf (If ) by those of freewheeling diodes.\nWhen calculating switching losses, Ioff or Ion is determined\nby the switching time current. As to conduction losses,\nUCEsat and Uf are considered to be constant during a short\nenough calculation period [ ti, ti +1t], and ICE or If is\ndetermined by the current at time ti +1t/2. From the\nanalysis above, loss estimations of the devices are shown\nin (14)-(18).\nPsw−IGBT = fs\nUtest\n[Eoff −test\n(\nIoff\n)\nUoff +\nEon−test (Ion)Uon\n]\n(14)\nPsw−Diode = fs\nUtest\nErec−test (Ion)Uon (15)\nPcon−IGBT =\n∑[\nUCEsat\n(ICE (ti) +ICE (ti +1t)\n2\n)\n×\n∫ ti+1t\nti\nICE (t)dt\n]\n(16)\nPcon−Diode =\n∑[\nUf\n(If (ti) +If (ti +1t)\n2\n)\n×\n∫ ti+1t\nti\nIf (t)dt\n]\n(17)\nPloss =Psw−IGBT +Psw−Diode\n+Pcon−IGBT +Pcon−Diode (18)\nB. COMPARISONS UNDER DIFFERENT RATED VOLTAGE\nAND POWER\nIn this comparison, IGBT FF300R17ME4 (Inﬁneon) of\n1.7kV/300A is chosen with Umax of 950V and fs of 5 kHz on\nthe DAB stage and 1 kHz on the boost stage. To make a fair\ncomparison, the 3 candidates will use the same device, and the\nmaximum value of pr is determined by the maximum current\nstress among the 3 candidates, less than 300A. In the com-\nparison, the MVDC side voltage (input voltage) is calculated\ncorresponding to the base value of the LVDC side voltage for\na more concise and general expression. The rated power of\nthe PET is represented by the input current at the rated input\nvoltage and power.\nEfﬁciency of the 3 candidates under the matching state, the\nover-voltage state and the under-voltage state are compared in\nFig. 3. In Fig. 3, the input voltage has limited inﬂuences on\nefﬁciency regardless of candidates and working conditions\nunder the same rated input current, and the efﬁciency of\nthe 3 candidates under the 3 considered working conditions\nis very close, with efﬁciency differences less than 0.5%.\nWhile compared with input voltage, the efﬁciency of the\n3 candidates varies with different rated input current under\nthe same input voltage. Hence, the voltage level of 20kV in\nthe MVDC side and 750V in the LVDC side is chosen in the\nfollowing comparison, which are common voltage levels in\nMVDC distribution applications.\nIn Fig. 4, efﬁciency comparisons under different rated\npower are shown. At each rated working point, parameters\nare designed separately according to section II. When the\nPET operates at full load with the input current near the\nmaximum allowed value of the device, there is no signiﬁcant\ndifference in efﬁciency among the 3 candidates. The BDABV\nhas slightly higher efﬁciency than the SDAB in the extreme\nconditions, while the BDABG has the smallest efﬁciency\ndifference when the rated current varies.\nVOLUME 7, 2019 48449\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nFIGURE 4. Efficiency comparisons under different rated power (UMV =20kV, andULV =750V).\nFIGURE 5. Efficiency comparisons under different loads (UMV =20kV, ULV =750V, andIin−rated =100A).\nTABLE 1. Designed parameters for theoretical results in Section III.C.\nC. LOSS BREAKDOWN COMPARISIONS\nFrom IV .A, the 3 candidates show no signiﬁcant differences\nin efﬁciency under different design voltage and power, so in\nthis comparison, input current of 100A at the rated power is\nchosen for the parameter design, and the design parameters\nare shown in Table 1. Efﬁciencies under different loads are\nshown in Fig. 5, with the range between 96%-98% except for\nlight loads, and efﬁciency under full load is chosen as the\nworking point for loss breakdown analysis.\nLoss breakdown at full load is shown in Fig. 6 in order\nto study the loss distribution of the submodule in details.\nIn Fig. 6, the losses of boost stage only amount for a small\npart of the system losses in 2 BDAB candidates because\nthe switching frequency of the boost stage is kept low, and\nconclusion can be made that losses in the DAB stage have\nthe major effect on the system efﬁciency. According to [22],\nwhen adopting the optimal current-stress phase-shift modu-\nlation in the DAB stage, the current waveforms at the same\nload varies as the DAB stage voltage gain changes, which are\nstrongly related to the system loss and efﬁciency. So for the\nBDABG, as the DAB voltage gain is kept at 1, the efﬁciency\ncurves shown in Fig. 5 have little difference except for the\ndifference caused by the loss in the boost stage that only\namount for a small part of the system losses. While for the\nSDAB and the BDABV , the DAB voltage gain differs under\ndifferent working conditions, leading to different efﬁciency\ncurves in Fig. 5. In the DAB stage, system losses consist of\nIGBT switching losses and conduction losses of IGBTs and\nfreewheeling diodes, which will be further discussed below.\n1) SWITCHING LOSSES\nThe switching losses of Si IGBT modules, among which are\nturn-off losses, takes the main part of the total system losses\nin Fig. 6, because ZVS turn on is achieved in this paper.\nIn other words, loss differences of the 3 candidates are mainly\ndetermined by the IGBT turn-off loss. From section III.A,\nthe switching losses of IGBTs are highly related to the DC\nbus voltage and the current at the switching moment at a\ngiven IGBT switching frequency. In Fig.7, output voltage and\ncurrent waveforms of the primary and secondary sides of the\nDAB stage are shown for the 3 candidates respectively and\ntheir effects on the loss of IGBT. In the ﬁgure, the output\n48450 VOLUME 7, 2019\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nFIGURE 6. System loss breakdown comparisons (UMV =20kV, ULV =750V, Iin−rated =100A, full load).\nFIGURE 7. Current and voltage waveforms of the DAB stage under (UMV =20kV, ULV =750V, Iin−rated =100A, full load).\nvoltage waveforms of the DAB primary and secondary sides\nare shown in thin blue and red lines, with magnitudes of DC\nbus voltage on the DAB primary and secondary sides.\nWhen the system is in the over-voltage state, for\nthe BDABG, the current waveform remains trapezoidal as the\nDAB voltage gain is kept at 1, while for the SDAB and the\nBDABV , the current waveforms are no longer trapezoidal.\nCompared with the SDAB, the 2 BDAB candidates have\nsmaller turn-off current (see points C and D in Fig.7) on the\nDAB secondary side, and thus with the same DC bus voltages\non the DAB secondary side, they have smaller IGBT turn-off\nloss on the DAB secondary side. As for the DAB primary side,\nbecause of smaller primary side DC bus voltage, the IGBT\nturn-off current (see points A and B in Fig. 7) of the SDAB is\nstill higher than the other 2 BDAB candidates. While taking\nboth the DC bus voltage and the turn-off current into con-\nsiderations, the loss differences on the primary side are not\nsigniﬁcant compared with those on the DAB secondary side.\nFrom the analysis above, IGBT turn-off losses on the DAB\nprimary side in a submodule between the 3 candidates are\nsimilar, while the system IGBT turn-off loss on the primary\nside of the BDABG is larger due to more submodules in the\nsystem. Considering the IGBT turn-off loss on both the sides\nof DAB, the overall switching loss is reduced with the BDAB\ncandidates, more from the secondary side, as shown in Fig. 8,\nand the BDABV is of the minimal system losses, followed by\nthe BDABG.\nSimilarly, in the under-voltage state, on the DAB primary\nside, the BDAB candidates reduce the IGBT turn-off current\ndue to less DAB bus voltage differences, while on the DAB\nsecondary side, the IGBT turn-off loss of the SDAB is the\nsmaller than the other 2 candidates due to the smallest turn-off\ncurrent. Considering the IGBT turn-off loss on the both sides\nof the DAB stage, as shown in Fig. 8, the overall switching\nloss is still reduced with candidates with BDAB, majorly\nfrom the primary side in the over-voltage state, although the\nloss reduction are not so signiﬁcant as in the over-voltage\nstate.\nVOLUME 7, 2019 48451\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nFIGURE 8. IGBT switching losses on the DAB stage in the extreme states\n(UMV =20kV, ULV =750V, Iin−rated =100A, full load).\nFIGURE 9. Conduction losses on the DAB stage in the extreme states\n(UMV =20kV, ULV =750V, Iin−rated =100A, full load).\n2) CONDUCTION LOSSES\nAs shown in Fig. 6, there are small yet nonnegligible loss\ndifferences in the conduction losses among the 3 candidates.\nFrom section III.A, the conduction losses in the DAB are\nmainly determined by the current during the conduction time\nand can be evaluated with the RMS current on the DAB\nprimary and secondary side, also shown in Fig. 7. In Fig.7,\nthe RMS current of the BDABG is smaller than the other\n2 candidates on both the sides of the DAB stage, because there\nare more submodules and the rated power in one submodule\nis less with the same rated system power. But considering\nconduction loss on the system level, conduction losses on the\nDAB stage has limited difference compared with the BDABV ,\nas shown in Fig. 9.\nFor the SDAB and the BDABV , the number of submodules\nand transmitting power per submodule are the same, and as\nshown in Fig. 7, in the over-voltage state, the RMS current of\nthe SDAB is larger than the BDABV on both DAB primary\nand secondary sides. Speciﬁcally, on the DAB primary side,\nbecause the DC bus voltage is much lower, the RMS current in\nthe SDAB is larger than that in the BDABV when transmitting\nthe same power, leading to much larger conduction losses\non the DAB primary side. In the under-voltage state, similar\nconclusions can be made, but as the DC bus voltages on the\nDAB secondary side are the same in the 2 candidates, the loss\ndifference are mainly determined by the conduction losses on\nthe DAB primary side, and the conductions loss reduction in\nthe BDAB candidates are not that obvious than that in the\nover-voltage state.\nIn summary, the BDAB candidates reduce both switching\nlosses and conduction losses on the DAB stage, compared\nwith the SDAB. Due to relatively low losses from the boost\nstage, the losses of the BDAB candidates are smaller than,\nor similar to the SDAB in most cases.\nD. COMPARISONS WITH DIFFERENT DAB STAGE\nSWITCHING FREQUENCIES\nFrom section III.B, IGBT switching losses in the DAB stage\ntake the majority of the system losses, and the 2 BDAB\ncandidates have smaller switching losses than the SDAB on\nthe DAB stage. As switching frequency is another factor\ndetermining the IGBT switching losses, system losses of\ndifferent DAB stage switching frequencies are compared in\nFig. 10. When the DAB stage switching frequency is low,\nthe loss differences of the 2 BDAB candidates and the SDAB\nis not obvious, but the losses of the 2 BDAB candidates are\nsmaller than the SDAB with higher DAB stage switching fre-\nquency. From the analysis in section III.B, the loss reduction\nof the 2 BDAB candidates are mainly on the large switching\nlosses of Si IGBT modules, and according to section III.A,\nbecause the switching losses are linearly related to the switch-\ning frequency, when conduction losses and the differences\nin Psw−IGBT are ﬁxed, the loss reduction of the 2 BDAB\ncandidates is more signiﬁcant as the switching frequency in\nthe DAB stage increases.\nIn the 2 BDAB candidates, the loss reduction in the DAB\nstage compared with the SDAB (the yellow bars) and the\nadditional loss brought by the boost stage (the green bars)\nunder d > 1 condition is shown in Fig. 11, where the upper\ndigit of the histogram is the inﬂuence of the loss of each stage\non the system efﬁciency. It can be seen in Fig. 11 that with the\nswitching frequency in boost stage kept low, the system losses\nof the 2 BDAB candidates are much smaller than the SDAB\nwhen the DAB switching frequency gets higher. Compared\nwith the BDABG, the BDABV showed a greater effect on the\nDAB stage and system efﬁciency.\nE. COMPARISONS WITH DIFFERENT SWITCHING DEVICES\nIn the section, efﬁciency comparisons are made between\ndevices of different voltage level and brands. In the com-\nparison, voltage level of 20kV in the MVDC side and 750V\nin the LVDC side is chosen with the rated power of 2MW\n(input current of 100A at the rated power). IGBTs of 1.2kV ,\n1.7kV , 3.3kV and 6.5kV are adopted in the boost stage and\non the primary side in the DAB stage, and IGBTs of 1.7kV\nis adopted on the DAB secondary side, listed in Table 2. The\ncurrent level is chosen using the same method as in section\nIII.A. Additionally, in order to keep an acceptable system\nefﬁciency, lower switching frequencies of the boost and the\nDAB stage is chosen for devices with higher voltage levels,\nbecause the switching losses of the device increase rapidly\nwhen the voltage level of the devices gets high.\n48452 VOLUME 7, 2019\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nFIGURE 10. Loss breakdown at different DAB stage switching frequency (UMV =20kV, ULV =750V, Iin−rated =100A, full load).\nTABLE 2. Type of devices used in the comparisons.\nIn Fig. 12, efﬁciency comparisons of different devices at\ndifferent switching frequencies are shown, with the DAB\nstage switching frequency of 5 kHz and 10 kHz adopted for\nIGBTs of 1.2kV and 1.7kV , 2 kHz and 5 kHz for IGBTs\nof 3.3kV , and 2 kHz for 6.5kV . As the DAB stage switching\nfrequency increasing, the system efﬁciency reduces signiﬁ-\ncantly due to the IGBT switching losses that take the majority\nof system losses. In Fig. 12, when using IGBTs of 1.2kV\nand 1.7kV , although applying devices of different brands\nmay inﬂuence the value of system efﬁciency, the relative\nrelationship of efﬁciency of the 3 candidates is consistent. On\nthe other hand, for IGBTs of 3.3kV and 6.5kV , the previous\nconclusions are true for the under-voltage state, while excep-\ntion exists in the over-voltage state, where the BDABG has\nthe lowest efﬁciency among the 3 candidates and the BDABV\nhas similar or higher efﬁciency than the SDAB.\nThere are 2 reasons for the exception. First, because\nthe switching losses of the IGBTs on the DAB primary\nside (3.3kV or 6.5kV) are much higher than those on the\nFIGURE 11. Loss differences of the 2 BDAB candidates compared with the\nSDAB (UMV =20kV, ULV =750V, Iin =100A, full load,d > 1).\nFIGURE 12. Efficiency comparisons with different devices (UMV =20kV,\nULV =750V, Iin =100A, full load).\nsecondary side (1.7kV), loss reductions on the DAB sec-\nondary side become no longer obvious compared with those\non the primary side. From section III.C, in the under-voltage\nVOLUME 7, 2019 48453\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nFIGURE 13. Simulation results of efficiency under different loads.\nstate, the BDAB candidates reduce system losses mainly by\nreducing the IGBT switching losses on the DAB primary\nside, while the BDAB candidates reduce the IGBT switching\nlosses on the DAB secondary side in the over-voltage state.\nAs a result, the previous conclusions hold for the under-\nvoltage state, but not the over-voltage state, when using\nIGBTs of higher voltage levels. In the over-voltage state,\nthe BDABG has the lowest efﬁciency because it has the\nhighest IGBT switching loss on the DAB primary side, and\nthe BDABV has similar or higher efﬁciency than the SDAB\nfor it has similar IGBT switching loss on the DAB primary\nside compared with the SDAB, which echoes the conclusions\nin Fig. 8. Second, losses in the boost stage increases when\nreplacing IGBTs of 1.7kV with those of 3.3kV and 6.5kV ,\nthe overall system losses of the BDABV may be slightly\nhigher than the SDAB in some conditions, but the efﬁciency\ndifference of the of the BDABV and the SDAB are not\nsigniﬁcant in the over-voltage state, as shown in Fig. 12.\nIn conclusion, the efﬁciency of the BDABV is similar or\nhigher than the SDAB regardless of the brands or voltage\nlevels of the applying devices, while for the BDABG, the pre-\nvious conclusions are established under certain conditions,\nand exceptions exist in the over-voltage state when using\nIGBTs of higher voltage levels like 3.3kV or 6.5kV .\nF. CONCLUSIONS ON SYSTEM-LEVEL EFFICIENCY\nIn summary, the following 4 conclusions can be made.\n• There is no signiﬁcant difference in efﬁciency among\nthe 3 candidates with different rated voltage.\n• The 2 BDAB candidates have smaller system-level\nlosses than the SDAB for the reduction on both con-\nduction losses and switching losses of the DAB stage,\nbecause of improved current waveforms.\n• The loss reduction of the 2 BDAB candidates on the\nDAB stage is more signiﬁcant with increasing switching\nfrequency on the DAB stage, because of the switching\nlosses taking a major part in IGBT modules.\n• The efﬁciency of the BDABV is similar or higher than\nthe SDAB regardless of the brands or voltage levels of\nthe applying devices, while for the BDABG, the pre-\nvious conclusions are established under certain con-\nFIGURE 14. Loss breakdown in simulation (d > 1, full load).\nditions that exceptions exist in the over-voltage state\nwhen using IGBTs of higher voltage levels like 3.3kV\nor 6.5kV .\nIV. SIMULATION AND EXPERIMENTAL RESULTS\nIn this section, simulations and experiments were done to\nverify the theoretical analysis in the previous part of the paper.\nIGBT modules were adopted in the simulation to verify the\nloss reduction of the 2 BDAB candidates on IGBT switch-\ning losses, for IGBT switching losses are much higher than\nconduction losses and account for the majority of the system\nlosses. On the other hand, to verify the loss reduction of the\n2 BDAB candidates on IGBT conduction losses, high speed\ndiscrete IGBTs were used in the experiments, due to higher\non-state voltage drop and much smaller switching losses of\nhigh speed discrete IGBTs, which leads to greater proportions\nof conduction losses in system losses.\nA. SIMULATION RESULTS\nSimulations were done in PLECS comparing efﬁciencies of\nthe 3 candidates in 3 working conditions. In the simulation,\nthe conduction and switching characteristics of the Si IGBT\n48454 VOLUME 7, 2019\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nFIGURE 15. Experimental prototype.\nmodules were determined using the data provided on the\nofﬁcial websites of the manufacturers. The spurious parame-\nter, dead time of the switches and the inﬂuence of temperature\nare also considered in the simulation. The simulation param-\neter is shown in Table 3, and the results are shown in Fig. 13.\nIn Fig. 13, the efﬁciencies of the 3 candidates were roughly\nidentical, for the efﬁciency differences were less than 0.5%\nnear full load, and the BDAB candidates had higher efﬁciency\nthan the SDAB near full load. The simulation results of the\nefﬁciency curves show great agreement with the theoretical\nresults in Fig 5.\nIn Fig. 14, loss breakdown at full load is compared in the\nover-voltage state at different switching frequencies. In the\nsystem losses, IGBT switching loss took the main part due\nto the high switching loss of the IGBT modules, while the\nboost stage only amounted for a small part, and the BDAB\ncandidates had smaller switching losses as well as conduction\nlosses in the DAB stage compared with the SDAB. When the\nswitching frequency in the DAB stage increased to 10 kHz,\nthe system losses increased rapidly, and the loss reduction\nof the 2 BDAB candidates on the DAB stage were more\nsigniﬁcant. Among the 3 candidates, the BDABV had the\nleast system losses and the highest efﬁciency. Fig. 13 and Fig.\n14 show that the 2 BDAB candidates had smaller switching\nlosses on the DAB stage and thus on the system losses, and\nthe reduction was more signiﬁcant with a higher DAB stage\nswitching frequency.\nTABLE 3. Simulation parameters.\nTABLE 4. Experiment parameters.\nB. EXPERIMENTAL RESULTS\nIn order to verify the conduction loss reduction with the\n2 DAB candidates, experiments were carried out on a scaled-\ndown prototype, shown in Fig. 15. The experiment param-\neters are shown in Table 4, and the efﬁciency compar-\nisons among different candidates and working conditions are\nshown in Fig. 16. In the under-voltage state and the matching\nstate, the efﬁciency of the 3 candidates were similar, with\ndifferences less than 1%, while in the over-voltage state, and\nthe efﬁciency of the BDAB candidates was higher than the\nSDAB, with difference more than 1.5%. Loss breakdown at\nfull load and half load is shown in Fig.17, and the conduction\nlosses accounted for the majority of the system losses due\nto the adoption of high-speed discrete IGBTs. In the over-\nvoltage state, the BDAB candidates has much smaller con-\nduction losses than the SDAB with both full load and half\nload, validating the conduction loss reduction in the analysis\nin section III.C.\nCompared with efﬁciency curves of the simulation and\ntheoretical results in Fig 5 and 13, the efﬁciency curves of\nthe experimental results show different values and trends,\nbecause of the different characters of the devices. In the the-\noretical analysis and simulation, the IGBT switching losses\nof the IGBT modules are much higher and account for the\nmajority of the system losses, while in the experiment, the\nIGBT switching losses of the high speed discrete IGBTs are\nmuch smaller than the conduction losses, leading to greater\nVOLUME 7, 2019 48455\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nFIGURE 16. Experimental results of efficiency under different load.\nFIGURE 17. Loss breakdown in experiment (d > 1, full load). The\nsimulation results were in good agreement with the theoretical analysis\nin section III.B and III.C.\nproportions of conduction losses in system losses. The IGBT\nswitching losses are basically proportional to the load current,\nwhile the IGBT conduction losses are proportional to the\nsquare of the load current, leading to efﬁciency curves of\ndifferent gradients in the experiment and the simulation.\nBy adopting IGBTs with different characters, the loss\nreduction of the 2 BDAB candidates in switching losses and\nconduction losses are demonstrated respectively in simula-\ntion and experiment, and combining the results, the relative\nrelationship of efﬁciency of the 3 candidates is consistent\nwith different devices, validating the analysis in section III.D.\nV. CONCLUSION\nThis paper presents system-level efﬁciency evaluation of the\nsuitable isolated DC/DC converters in input-series-output-\nparallel Power Electronics Transformers (PET) applied\nfor medium-voltage DC systems and provides engineering\ninsights into the design of PETs from a system perspec-\ntive. Three feasible submodule candidates, namely the sin-\ngle stage dual active bridge (SDAB), boost and DAB with\nconstant boost output voltage (BDABV), and boost and DAB\nwith constant DAB voltage gain (BDABG) were compared,\nconsidering normal and hot standby submodules, and based\non the design, the system-level efﬁciency comparisons are\ndone in the aspects of rated voltages and power, operating\npoints, switching frequencies in the DAB stage, and different\ndevices. The following conclusions were drawn from the\ncomparisons.\nFirst, there is no signiﬁcant difference in efﬁciency\namong the 3 candidates with different rated voltage. Second,\nthe 2 BDAB candidates have smaller system losses than the\nSDAB in the DAB stage, and have similar or higher efﬁciency\nthan SDAB. It is because the additional boost stage improved\nthe currents in the DAB stage, reducing both the conduction\nlosses and the switching losses. Third, the loss reduction of\nthe 2 BDAB candidates on the DAB stage is more signiﬁcant\nwith the switching frequency increasing on the DAB stage,\nand the BDABV performs the best. Fourth, the efﬁciency of\nthe BDABV is similar or higher than the SDAB regardless of\nthe brands or voltage levels of the applying devices, while\nfor the BDABG, the previous conclusions are established\nunder certain conditions. Between the 2 BDAB candidates,\nthe BDABV has better performance in efﬁciency compared\nwith the BDABG, for the efﬁciency of the BDABV is higher\nthan or similar to the SDAB regardless of the types of devices,\nand the BDABV is of slightly higher efﬁciency than the\nBDABG in the most of the working conditions. Considering\nthe advantages in redundancy compared with the SDAB,\nthe BDABV is the preferred choice for submodules in the\nISOP DC PETs among the 3 candidates.\nREFERENCES\n[1] Y . Ji et al., ‘‘Hierarchical control strategy for MVDC distribution network\nunder large disturbance,’’ IET Gener., Transmiss. Distrib. , vol. 12, no. 11,\npp. 2557–2565, Jun. 2018.\n[2] U. Javaid, F. D. Freijedo, D. Dujic, and W. van der Merwe, ‘‘MVDC\nsupply technologies for marine electrical distribution systems,’’ CPSS\nTrans. Power Electron. Appl. , vol. 3, no. 1, pp. 65–76, Mar. 2018.\n[3] X. Yang, H. Hu, Y . Ge, S. Aatif, Z. He, and S. Gao, ‘‘An improved droop\ncontrol strategy for VSC-based MVDC traction power supply system,’’\nIEEE Trans. Ind. Appl. , vol. 54, no. 5, pp. 5173–5186, Sep./Oct. 2018.\n[4] B. Zhao, Q. Song, J. Li, X. Xu, and W. Liu, ‘‘Comparative analysis\nof multilevel-high-frequency-link and multilevel-DC-link DC–DC trans-\nformers based on MMC and dual-active bridge for MVDC application,’’\nIEEE Trans. Power Electron. , vol. 33, no. 3, pp. 2035–2049, Mar. 2018.\n48456 VOLUME 7, 2019\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\n[5] X. Zhang, M. Tian, X. Xiang, J. Pereda, T. C. Green, and X. Yang, ‘‘Large\nstep ratio input-series–output-parallel chain-link DC–DC converter,’’IEEE\nTrans. Power Electron., vol. 34, no. 5, pp. 4125–4135, May 2019.\n[6] T. Li and L. Parsa, ‘‘Design, control, and analysis of a fault-tolerant soft-\nswitching DC–DC converter for high-power high-voltage applications,’’\nIEEE Trans. Power Electron. , vol. 33, no. 2, pp. 1094–1104, Feb. 2018.\n[7] P. Czyz, T. Guillod, F. Krismer, and J. W. Kolar, ‘‘Exploration of the design\nand performance space of a high frequency 166 kW/10 kV SiC solid-state\nair-core transformer,’’ in Proc. Int. Power Electron. Conf. (IPEC-Niigata\nECCE Asia), Niigata, Japan, May 2018, pp. 396–403.\n[8] H. Fan and H. Li, ‘‘High-frequency transformer isolated bidirectional\nDC–DC converter modules with high efﬁciency over wide load range for\n20 kV A solid-state transformer,’’ IEEE Trans. Power Electron. , vol. 26,\nno. 12, pp. 3599–3608, Dec. 2011.\n[9] X. She, X. Yu, F. Wang, and A. Q. Huang, ‘‘Design and demonstration of a\n3.6-kV-120-V/10-kV A solid-state transformer for smart grid application,’’\nIEEE Trans. Power Electron. , vol. 29, no. 8, pp. 3982–3996, Aug. 2014.\n[10] X. Wang, J. Liu, S. Ouyang, T. Xu, F. Meng, and S. Song, ‘‘Control and\nexperiment of an H-bridge-based three-phase three-stage modular power\nelectronic transformer,’’ IEEE Trans. Power Electron. , vol. 31, no. 3,\npp. 2002–2011, Mar. 2016.\n[11] S. Shao, M. Jiang, J. Zhang, and X. Wu, ‘‘A capacitor voltage balancing\nmethod for a modular multilevel DC transformer for DC distribution\nsystem,’’ IEEE Trans. Power Electron. , vol. 33, no. 4, pp. 3002–3011,\nApr. 2018.\n[12] Y . Shi and H. Li, ‘‘Isolated modular multilevel DC–DC converter with\nDC fault current control capability based on current-fed dual active bridge\nfor MVDC application,’’ IEEE Trans. Power Electron. , vol. 33, no. 3,\npp. 2145–2161, Mar. 2018.\n[13] J. Zhang, Z. Wang, and S. Shao, ‘‘A three-phase modular multilevel\nDC–DC converter for power electronic transformer applications,’’ IEEE\nJ. Emerg. Sel. Topics Power Electron. , vol. 5, no. 1, pp. 140–150,\nMar. 2017.\n[14] B. Zhao, Q. Song, J. Li, Y . Wang, and W. Liu, ‘‘Modular multilevel high-\nfrequency-link DC transformer based on dual active phase-shift principle\nfor medium-voltage DC power distribution application,’’ IEEE Trans.\nPower Electron., vol. 32, no. 3, pp. 1779–1791, Mar. 2017.\n[15] A. Mohammadpour, L. Parsa, M. H. Todorovic, R. Lai, R. Datta, and\nL. Garces, ‘‘Series-input parallel-output modular-phase DC–DC converter\nwith soft-switching and high-frequency isolation,’’ IEEE Trans. Power\nElectron., vol. 31, no. 1, pp. 111–119, Jan. 2016.\n[16] L. Qu, D. Zhang, and B. Zhang, ‘‘Input voltage sharing control scheme\nfor input series and output parallel connected DC–DC converters based\non peak current control,’’ IEEE Trans. Ind. Electron. , vol. 66, no. 1,\npp. 429–439, Jan. 2019.\n[17] P. Zumel et al., ‘‘Modular dual-active bridge converter architecture,’’ IEEE\nTrans. Ind. Appl. , vol. 52, no. 3, pp. 2444–2455, May/Jun. 2016.\n[18] M. Jaritz, T. Rogg, and J. Biela, ‘‘Analytical modeling and controller design\nof a modular series parallel resonant converter system for a solid state 2.88-\nMW/115-kV long pulse modulator,’’ IEEE Trans. Power Electron., vol. 33,\nno. 10, pp. 9047–9063, Oct. 2018.\n[19] K. Kroics, J. Zakis, A. Suzdalenko, and G. Gaigals, ‘‘A simpliﬁed approach\nto input voltage balancing for series connected isolated DC-DC convert-\ners,’’ in Proc. 18th Eur. Conf. Power Electron. Appl. , Karlsruhe, Germany,\nSep. 2016, pp. 1–10.\n[20] M. J. Carrizosa, A. Benchaib, P. Alou, and G. Damm, ‘‘DC transformer for\nDC/DC connection in HVDC network,’’ in Proc. 15th Eur. Conf. Power\nElectron. Appl. (EPE) , Sep. 2013, pp. 1–10.\n[21] S. Luo and F. Wu, ‘‘Hybrid modulation strategy for IGBT-based isolated\ndual-active-bridge DC–DC converter,’’ IEEE J. Emerg. Sel. Topics Power\nElectron., vol. 6, no. 3, pp. 1336–1344, Sep. 2018.\n[22] C. Gu, Z. Zheng, L. Xu, K. Wang, and Y . Li, ‘‘Modeling and con-\ntrol of a multiport power electronic transformer (PET) for electric\ntraction applications,’’ IEEE Trans. Power Electron. , vol. 31, no. 2,\npp. 915–927, Feb. 2016.\n[23] Y . Lee, G. Vakil, R. Feldman, A. J. Watson, and P. W. Wheeler, ‘‘A high-\npower DC-DC converter based dual active bridge for MVDC grids on\noffshore wind farms,’’ in Proc. 18th Eur. Conf. Power Electron. Appl. ,\nKarlsruhe, Germany, Sep. 2016, pp. 1–10.\n[24] M. Kasper, D. Bortis, G. Deboy, and J. W. Kolar, ‘‘Design of a highly efﬁ-\ncient (97.7%) and very compact (2.2 kW/dm 3) isolated AC–DC telecom\npower supply module based on the multicell ISOP converter approach,’’\nIEEE Trans. Power Electron. , vol. 32, no. 10, pp. 7750–7769, Oct. 2017.\n[25] B. Zhao, Q. Song, W. Liu, and Y . Sun, ‘‘A synthetic discrete design method-\nology of high-frequency isolated bidirectional DC/DC converter for grid-\nconnected battery energy storage system using advanced components,’’\nIEEE Trans. Ind. Electron. , vol. 61, no. 10, pp. 5402–5410, Oct. 2014.\n[26] C. Gammeter, F. Krismer, and J. W. Kolar, ‘‘Comprehensive conceptualiza-\ntion, design, and experimental veriﬁcation of a weight-optimized all-SiC 2\nkV/700 V DAB for an airborne wind turbine,’’ IEEE J. Emerg. Sel. Topics\nPower Electron., vol. 4, no. 2, pp. 638–656, Jun. 2016.\n[27] T. Jimichi, M. Kaymak, and R. W. de Doncker, ‘‘Design and experimental\nveriﬁcation of a three-phase dual-active bridge converter for offshore wind\nturbines,’’ in Proc. Int. Power Electron. Conf. , Niigata, Japan, May 2018,\npp. 3729–3733.\n[28] T. Fang, L. Shen, W. He, and X. Ruan, ‘‘Distributed control and redundant\ntechnique to achieve superior reliability for fully modular input-series-\noutput-parallel inverter system,’’ IEEE Trans. Power Electron. , vol. 32,\nno. 1, pp. 723–735, Jan. 2017.\n[29] B. Zhao, Q. Song, J. Li, W. Liu, G. Liu, and Y . Zhao, ‘‘High-frequency-\nlink DC transformer based on switched capacitor for medium-voltage DC\npower distribution application,’’ IEEE Trans. Power Electron. , vol. 31,\nno. 7, pp. 4766–4777, Jul. 2016.\n[30] Voltage Characteristics of Electricity Supplied by Public Electricity Net-\nworks, CENELEC Standard EN 50160, 2010.\n[31] R. Liu, L. Xu, Y . Kang, Y . Hui, and Y . Li, ‘‘Decoupled TAB converter with\nenergy storage system for HVDC power system of more electric aircraft,’’\nJ. Eng., vol. 2018, no. 13, pp. 593–602, 2018. doi: 10.1049/joe.2018.0033.\n[32] V . M. Iyer, S. Gulur, and S. Bhattacharya, ‘‘Optimal design method-\nology for dual active bridge converter under wide voltage variation,’’\nin Proc. IEEE Transp. Electriﬁc. Conf. Expo (ITEC) , Chicago, IL, USA,\nJun. 2017, pp. 413–420.\n[33] M. A. Bahmani, T. Thiringer, A. Rabiei, and T. Abdulahovic, ‘‘Compar-\native study of a multi-MW high-power density dc transformer with an\noptimized high-frequency magnetics in All-DC offshore wind farm,’’ IEEE\nTrans. Power Del., vol. 31, no. 2, pp. 857–866, Apr. 2016.\n[34] G. Ortiz, H. Uemura, D. Bortis, J. W. Kolar, and O. Apeldoorn, ‘‘Modeling\nof soft-switching losses of IGBTs in high-power high-efﬁciency dual-\nactive-bridge DC/DC converters,’’ IEEE Trans. Electron Devices , vol. 60,\nno. 2, pp. 587–597, Feb. 2013.\n[35] X. She, X. Yu, F. Wang, and A. Q. Huang, ‘‘Design and demonstration of a\n3.6-kV–120-V/10-kV A solid-state transformer for smart grid application,’’\nIEEE Trans. Power Electron. , vol. 29, no. 8, pp. 3982–3996, Aug. 2014.\n[36] C. Song, A. Chen, J. Chen, C. Du, and C. Zhang, ‘‘Optimized modulation\nscheme for dual active bridge DC-DC converter,’’ in Proc. IEEE Appl.\nPower Electron. Conf. Expo. (APEC) , Mar. 2018, pp. 3569–3574.\n[37] H. Akagi, T. Yamagishi, N. M. L. Tan, S. I. Kinouchi, Y . Miyazaki,\nand M. Koyama, ‘‘Power-loss breakdown of a 750-V , 100-kW, 20-kHz\nbidirectional isolated DC-DC converter using SiC-MOSFET/SBD dual\nmodules,’’IEEE Trans. Ind. Appl. , vol. 51, no. 1, pp. 420–428, Jan. 2015.\n[38] G. Ortiz, M. Leibl, J. W. Kolar, and O. Apeldoorn, ‘‘Medium frequency\ntransformers for solid-state-transformer applications—Design and experi-\nmental veriﬁcation,’’ in Proc. IEEE 10th Int. Conf. Power Electron. Drive\nSyst. (PEDS), Kitakyushu, Japan, Apr. 2013, pp. 1285–1290.\n[39] R. L. Steigerwald, R. W. De Doncker, and M. H. Kheraluwala, ‘‘A com-\nparison of high-power DC-DC soft-switched converter topologies,’’\nIEEE Trans. Ind. Appl. , vol. 32, no. 5, pp. 1139–1145, Sep./Oct. 1996.\nYOU WANG (S’17) received the B.S. degree\nin electrical engineering from the Department\nof Electrical Engineering, Tsinghua University,\nBeijing, China, in 2016, where she is currently pur-\nsuing the master’s degree. Her research interests\ninclude power electronics transformers and dc/dc\nconverters.\nVOLUME 7, 2019 48457\nY. Wanget al.: System-Level Efficiency Evaluation of Isolated DC/DC Converters in PETs for Medium-Voltage DC Systems\nKUI WANG (M’11–SM’19) was born in Hubei,\nChina, in 1984. He received the B.S. and\nPh.D. degrees in electrical engineering from the\nDepartment of Electrical Engineering, Tsinghua\nUniversity, Beijing, China, in 2006 and 2011,\nrespectively, where he is currently an Assis-\ntant Researcher. His research interests include\ntopology and control of multilevel converters,\nrenewable energy generation, and wide band-gap\nsemiconductors.\nCHI LI (S’14–M’18) received the B.S. degree in\nelectrical engineering from Tsinghua University,\nBeijing, China, in 2012, and the M.S. and Ph.D.\ndegrees in electrical engineering from Virginia\nTech, Blacksburg, V A, USA, in 2015 and 2018,\nrespectively.\nFrom 2012 to 2018, he was a Research Assistant\nwith the Center for Power Electronics Systems\n(CPES), Virginia Tech. In 2018, he returned to\nTsinghua University, where he is currently a Post-\ndoctoral Researcher with the Department of Electrical Engineering. His\nresearch interest includes control and stability of power electronics convert-\ners and systems.\nZEDONG ZHENG (M’09–SM’19) was born in\nborn in Shandong, China, in 1980. He received the\nB.S. and Ph.D. degrees in electrical engineering\nfrom the Department of Electrical Engineering,\nTsinghua University, Beijing, China, in 2003 and\n2008, respectively, where he is currently an Asso-\nciate Professor.\nHis current research interests include power\nelectronics converters and high-performance\nmotor-control systems.\nYONGDONG LI (M’08) was born in Hebei,\nChina, in 1962. He received the B.S. degree from\nthe Harbin Institute of Technology, Harbin, China,\nin 1982, and the M.S. and Ph.D. degrees from\nthe Department of Electrical Engineering, Insti-\ntut National Polytechnique de Toulouse, Toulouse,\nFrance, in 1984 and 1987, respectively.\nSince 1996, he has been a Professor with the\nDepartment of Electrical Engineering, Tsinghua\nUniversity, Beijing, China. He is currently the\nLead Developer of the Power Electronics and Motor Control (PEMC) Lab-\noratory, Tsinghua University. He was also an Invited Professor with the\nInstitut National Polytechnique de Toulouse and the Dean of the School\nof Electrical Engineering, Xinjiang University, Ürümqi, China. His current\nresearch interests include power electronics, machine control, and wind\npower generation.\nDr. Li is also a Senior Member of the China Electro-Technique Society and\nthe Vice Chairman of the China Power Electronics Society and the Electrical\nAutomation Committee of the China Automation Association.\n48458 VOLUME 7, 2019",
  "topic": "Converters",
  "concepts": [
    {
      "name": "Converters",
      "score": 0.7417094707489014
    },
    {
      "name": "Transformer",
      "score": 0.601225733757019
    },
    {
      "name": "Electrical engineering",
      "score": 0.5914109945297241
    },
    {
      "name": "Power electronics",
      "score": 0.5573168992996216
    },
    {
      "name": "Voltage",
      "score": 0.49152860045433044
    },
    {
      "name": "Power engineering",
      "score": 0.47958245873451233
    },
    {
      "name": "Electric power system",
      "score": 0.46461784839630127
    },
    {
      "name": "Electronics",
      "score": 0.43447816371917725
    },
    {
      "name": "Charge pump",
      "score": 0.4282425045967102
    },
    {
      "name": "Switched-mode power supply",
      "score": 0.42743125557899475
    },
    {
      "name": "Computer science",
      "score": 0.3335002660751343
    },
    {
      "name": "Power (physics)",
      "score": 0.31337547302246094
    },
    {
      "name": "Engineering",
      "score": 0.2609483599662781
    },
    {
      "name": "Power factor",
      "score": 0.2224816381931305
    },
    {
      "name": "Capacitor",
      "score": 0.19808974862098694
    },
    {
      "name": "Physics",
      "score": 0.09828346967697144
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I99065089",
      "name": "Tsinghua University",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I4210142152",
      "name": "ORCID",
      "country": "US"
    }
  ],
  "cited_by": 26
}