{
    "title": "Research on Capacitance Voltage Transformer Harmonic Measurement",
    "url": "https://openalex.org/W2945701850",
    "year": 2019,
    "authors": [
        {
            "id": "https://openalex.org/A2076176403",
            "name": "Xin Shen",
            "affiliations": [
                "Kunming University of Science and Technology"
            ]
        },
        {
            "id": "https://openalex.org/A2577480221",
            "name": "Hong Chun Shu",
            "affiliations": [
                "Kunming University of Science and Technology"
            ]
        },
        {
            "id": "https://openalex.org/A2096756796",
            "name": "Min Cao",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W6815922546",
        "https://openalex.org/W6600341180",
        "https://openalex.org/W6600281192"
    ],
    "abstract": "According to the issue of transmission characteristics of a capacitor voltage transformer (CVT), which leads to the inaccuracy of power grid voltage harmonics values, a new test system and a method of measuring the capacitive current of a CVT were proposed.A comparison of the results of the conventional test method and actual power grid harmonics verified the validity and accuracy of the proposed test method, and a test of the voltage harmonics in the actual power grid showed that the test system can completely satisfy the requirements of testing the voltage harmonics.",
    "full_text": "1499\nSensors and Materials , Vol. 31, No. 5 (2019) 1499–1512\nMYU Tokyo\nS & M 1874\n*Corresponding author: e-mail: 23755803@qq.com\nhttps://doi.org/10.18494/SAM.2019.2270\nISSN 0914-4935 © MYU K.K.\nhttps://myukk.org/\nResearch on Capacitance Voltage Transformer \nHarmonic Measurement\nXin Shen,1* Hong-Chun Shu,1 and Min Cao2\n1Mechanical and Electrical Engineering College, Kunming University of Science and Technology, \nNo. 727 Jingming South Road, Chenggong District, Kunming 650500, China\n2Yunnan Electric Power Research Institute,\nNo. 105, Yunda West Road, Guandu District, Kunming 650217, China\n(Received April 20, 2018; accepted March 20, 2019)\nKeywords: CVT, harmonic measurement, transmission characteristics, capacitive current method\n According to the issue of transmission characteristics of a capacitor voltage transformer (CVT), \nwhich leads to the inaccuracy of power grid voltage harmonics values, a new test system and \na method of measuring the capacitive current of a CVT were proposed.  A comparison of the \nresults of the conventional test method and actual power grid harmonics verified the validity \nand accuracy of the  proposed test method, and a test of the voltage harmonics in the actual \npower grid showed that the test system can completely satisfy the requirements of testing the \nvoltage harmonics.\n1. Introduction\n Currently, 110 kV measurement systems are widely used to monitor the grid voltage on the \nsecondary side of a transformer.  Owing to disadvantages such as the ferromagnetic resonance \nwith line distributed capacitance, large size, and high cost, electromagnetic voltage transformers \n(VTs) cannot meet the needs of a power system.  Compared with electromagnetic VTs, a \ncapacitor voltage transformer (CVT) has a large electric field strength margin and a reliable \ninsulation.  A voltage-dividing capacitor also serves as a coupling capacitor in a high-frequency \ncarrier channel and does not form a ferromagnetic resonance with the switch port capacitance.  \nIn addition, the advantages of small size, light weight, less maintenance work, and low cost \nresult in the wide use of the CVT.  In foreign countries, CVTs are mostly used at voltages above \n72.5 kV.  In China, CVTs are widely used at 110 kV and above.(1)\n Although CVTs meet the requirements of the system used in the fundamental voltage \nmeasurement, system protection, and fundamental signal conversion of automatic devices, \nowing to the characteristics of CVT transmission, CVTs cannot correctly reflect the actual \nsituation in the system with harmonic components.  In measuring the voltage harmonics of \nthe system, the secondary side voltage signal obtained by a CVT transformation device has \na large error and the harmonic measurement data cannot be adopted.  Therefore, the national \nstandard GB/T 14549-1993 “grid harmonic” appendix D7 (2) states that “a CVT cannot be used \nfor harmonic measurement,” and IEC standards and other related technical reports are also \n1500 Sensors and Materials , Vol. 31, No. 5 (2019)\nprovided.  Therefore, how to test and grasp accurate grid harmonic levels and exact voltage \ndistortion data through CVTs, what measurement method to adopt, and what test equipment \nto use for harmonic voltage testing have become the focus of power quality supervision of the \npower grids, and this is the primary problem that should necessarily be solved. (3)\n2. Analysis of the Harmonic Characteristics of CVT\n The CVT composed of voltage dividing capacitors, compensation reactors, intermediate \ntransformers, dampers, and loads is shown in Figs. 1 and 2. (4–6)  In essence, it is mainly a \ncapacitive voltage divider; in Fig. 1, C 1 is a high-voltage capacitor and C 2 is a medium-voltage \ncapacitor.  The partial pressure ratio of the CVT is\n 1 12\n2\n21 1\n1u CCn uC CLω\n+= = + . (1)\n Compared with the partial pressure of the capacitive divider, the partial pressure ratio of the \nCVT is higher by Δ n, that is, Δ n = 1/(ω2C1L), as shown in Eq. ( 1 ).  Δn is equal to the ratio of \nthe capacitive reactance of the CVT low-voltage arm to the inductive reactance of the TV and \nis related to the frequency, i.e., when the frequency is different, the ratio of Δ n is also different.  \nThe TV equivalent inductor L is a nonlinear element whose size varies with the operating \nvoltage and frequency.  Therefore, the CVT variable ratio differs at different frequencies.  \nFrom Eq. (1), the amplitude- and phase-frequency characteristics of the transfer functions of a \nmultiple 220 kV CVT are obtained and shown in Fig. 3.\nFig. 1. Structure of CVT.\nSensors and Materials , Vol. 31, No. 5 (2019) 1501\n According to the amplitude- and phase-frequency characteristics of the CVT, it can be seen \nthat the CVT has different transformation ratios at different frequencies.  Therefore, both low-  \nand high-order harmonics have a certain filtering effect, which is essentially a band-pass filter \nsystem, and for different CVTs, owing to the different components of the parameter values, the \ninitial and cut-off frequencies are different.  Therefore, it is inevitable that distortion occurs in \nthe harmonic measurement when the voltage signal is collected from the secondary side of the \nCVT.(7–9)\n3. CVT Harmonic Measurement Based on Capacitive Current\n At present, the method of measuring grid voltage harmonics based on the CVT is to \nobtain the voltage signal from the secondary side of the CVT and combine the harmonic \nmeasurement and analysis instrument for harmonic analysis. (10–12)  To prevent the distortion of \nthe harmonic components caused by the CVT transmission characteristics, some scholars have \nproposed a method of obtaining the CVT transfer function and then correcting the harmonic \nmeasurement offline.  Commonly used methods of obtaining the CVT transfer function are the \nnetwork analyzer method, high-voltage harmonic injection method, and the like.  Owing to the \ndifferent transmission characteristics of different CVTs, this method should test the transfer \nfunction of each CVT, which is theoretically feasible, but the project is actually not suitable for \ngeneralization.  \nFig. 2. Equivalent circuit diagram.\nFig. 3. (a) Amplitude- and (b) phase-frequency characteristics of transfer functions of multiple 220 kV CVT. \n(a) (b)\n1502 Sensors and Materials , Vol. 31, No. 5 (2019)\n To solve the technical problem that a CVT cannot be used in harmonic measurement, a \nmethod of calculating the grid voltage by measuring high- and medium-voltage capacitive \ncurrents flowing through a CVT is proposed according to the principle of a CVT and the \nanalysis of the characteristics of capacitive reactance that changes with frequency.  The \nfeasibility and limitation of this method are verified.  Finally, a CVT harmonic measurement \nsystem based on the capacitive current method is designed.\n3.1 Measuring principle\n The method of testing CVT harmonics based on capacitive current follows Kirchhoff’s \nvoltage principle, a high-precision current sensor is loaded on the CVT capacitor branch to test \nthe high- and medium-voltage capacitive currents flowing through the CVT, (13–16) and the grid \nvoltage is calculated by combining the CVT high- and medium-voltage capacitive reactances for \nfurther analysis.  The equivalent circuit is shown in Fig. 4.\n In Fig. 3, the high-precision current sensors A and B respectively measure the currents \nflowing in the high-voltage capacitor C 1 and medium-voltage capacitor C 2, and the voltage \nU1(jω) on the primary side is calculated as\n 1 1 12 2() () () ccU j I j jX I j jXωω ω= + . (2)\n Here, U1(jω) is the primary-side voltage; I1(jω) is the total current flowing through the high- \nand medium-voltage capacitors and the internal circuit at the frequency point, which can be \nmeasured by the current coil B; Ic2 is the in-ground current flowing through the medium-voltage \ncapacitor C2 at the frequency point, which can be measured by the current coil A.  X c1(jω) is the \nFig. 4. Equivalent circuit diagram of capacitive current method.\nSensors and Materials , Vol. 31, No. 5 (2019) 1503\nreactance of the high-voltage capacitor C1 at the frequency point, and Xc2(jω) is the reactance of \nthe medium-voltage capacitor C2 at this frequency point.\n3.2 Test of CVT high- and medium-voltage capacitors C1 and C2\n The realization of the CVT harmonic testing method based on capacitive current requires \nthat the capacitive reactance has a linear relationship with the reciprocal of the frequency in the \nconcerned harmonics test frequency band (up to 5 kHz).\n To verify this requirement, the impedance of the 110 kV CVT (TYD110 / 3 -0.02H) used for \ntesting was measured using an impedance analyzer, Agilent 4294A (working frequency: 40–110 \nMHz and resolution: 1 mHz).\n The test method is described as follows.  During the test, disconnect the connection line \nbetween the electromagnetic unit and the midpoint of the capacitor, and connect the impedance \nanalyzer to the CVT high-voltage capacitor C 1 and middle-voltage capacitor C 2.  As shown in \nFig. 5, the capacitances of the test high-voltage capacitor C 1 and medium-voltage capacitor C 2 \nvary with frequency.\n Impedance parameters of TYD110 / 3 -0.02H were tested using Agilent 4294A.  The test \nfrequency range is 40–5 kHz.\n The impedance test results of the high- and medium-voltage capacitors C 1 and C2 are shown \nin Fig. 6.  By using these test results, the changes in C 1 and C2 capacitances with the frequency \nare obtained and shown in Fig. 7.\nFig. 5. Principle diagram of the CVT capacitive reactance measurement.\n\n1504 Sensors and Materials , Vol. 31, No. 5 (2019)\n The test results show that the capacitance of the CVT high-voltage capacitor C 1 is 0.028 \n087 μF, which is in accordance with the value of the given parameter C 1 ( 0.028095 μF).  The \ncapacitance of the CVT medium voltage capacitor C 2 is 0.067 485 μF, which is consistent with \nthe value of the given parameter C2 (0.06755 μF).\nFig. 6. (Color online) Test results of CVT high- and medium-voltage capacitor C1 and C2 impedances.\nFig. 7. (Color online) Changes in frequency capacitances of CVT high- and medium-voltage capacitosr C1 and C2: (a) \nhigh-pressure side of C1 and (b) high-pressure side of C 2.\n(a) (b)\n(a) (b)\n(c) (d)\n\nSensors and Materials , Vol. 31, No. 5 (2019) 1505\n Note that there is a resistive component in the measurement due to the existence of the lead \nduring the test, but the maximum resistance does not exceed 1.4 mΩ, and the test result is not \naffected compared with the capacitive reactance exceeding 1 kΩ at 5 kHz.  In the frequency \nband below 5 kHz, the capacitance is not affected by stray parameters, lead resistance and \ninductance, but only the capacitance characteristics.  Therefore, the currents flowing through \nCVT high- and medium-voltage capacitors are tested; moreover, it is feasible to measure \nthe grid voltage by calculating the capacitive reactances of CVT high- and medium-voltage \ncapacitors.\n3.3 Design of CVT harmonic testing system based on capacitive current\n According to the test principle of CVT harmonics based on the capacitive current method, \nthe harmonic test system designed in this study is shown in Fig. 8.  Because the currents of CVT \nhigh- and medium-voltage capacitors are at the microlevel, the current sensor used is an Agilent \nN2820A probe.  The Agilent N2820A probe offers a high sensitivity that is 200 times higher \nthan the sensitivity of a clamp-on current probe that can only measure sub-milliamps current.  \nThe probe bandwidth ranges from DC to 500 kHz and the minimum measurable current is 250 \nμA, which will be wound on the wire under test for many turns to amplify the measured current \nin the test, simultaneously reducing the space circuit area, to prevent external interference.  A \ndata acquisition card is used for each channel 250 kHz sampling rate, 12-bit resolution, with the \nsimultaneous sampling of the 4-channel data acquisition card.\n The CVT equivalent circuit is simplified, and the secondary load is equivalent to the primary \nside, the simplified equivalent circuit shown in Fig. 9.  Here, U1 is the primary-side line voltage, \nU2 is the primary voltage of the electromagnetic unit, C 1 and C2 are partial pressure capacitors, \nL is the compensation reactor, LM is the intermediate transformer excitation reactance, and R x is \nthe equivalent load impedance.  According to the simplified equivalent circuit, U 1 is calculated \nfrom U2 and the current IL of the compensation reactor L is obtained as\nFig. 8. Structure diagram of CVT harmonic test \nsystem based on capacitive current method.\nFig. 9. CVT simplified equivalent circuit diagram.\n1506 Sensors and Materials , Vol. 31, No. 5 (2019)\n \n22\n2L\nM\nUUI Rx fL j= + π . (3)\nThe voltage Uc2 of the capacitor C2 is\n 22\n22 22c\nM\nUUU U fLjRx fL j\n= + + ×π π\n. (4)\nThe current Ic2 of the capacitor C2 is\n \n22\n2\n2\n2\n22\n22\n11\n22\nMc\nc\nUUU fLjRx fL jUI\njjfC fC\n+ + ×π π= =\n−−ππ\n. (5)\nThe current Ic1 of the capacitor C1 is\n \n22\n2\n22\n12\n2\n22\n1 2\n2\nM\ncc L\nM\nUUU fLjRx fL j UUIII Rx fL jjfC\n+ + ×π π= += + + π− π\n. (6)\nThe primary-side voltage U1 is\n \n22\n2\n22\n112\n2\n22\n2\n1\n22\n1 2\n2\n1                      2.22\nM\ncc\nM\nM\nUUU fLjRx fL j UUUU U Rx fL jjfC\nUUj U fLjfC Rx fL j\n + + ×π  π=+= ++ π− π\n  ×− + + + ×π  ππ  \n (7)\nAssuming that the transformation ratio of the electromagnetic unit is the P electromagnetic unit , the \noverall transformation ratio of the CVT is\nSensors and Materials , Vol. 31, No. 5 (2019) 1507\n \n \n1\n2\n1\n2\n1112 2 11 1 11 121 22 2\n2\nelectromagnetic unit\nelectromagnetic u t\nCVT\nM\nMM\nni\nUPP U\nP\nfLjRx fL j j fLjRx fL j fC Rx fL jjfC\nππ πππ π\nπ\n= ×\n=\n   ++ ×      × + +× −+ + +×       − \n \n1\n2\n1112 2 11 1 11 121 22 2\n2\nelectromagnetic\nM\nMM\nunit\nfLjRx fL jP j fLjRx fL j fC Rx fL jjfC\nπ\n   ++ ×   π    = × + +× −+ + +× π    ππ π    − π \n \n1\n2\n1112 2 11 1 11 121 22 2\n2\nelectromagnetic\nM\nMM\nunit\nfLjRx fL jP j fLjRx fL j fC Rx fL jjfC\nπ\n   ++ ×   π    = × + +× −+ + +× π    ππ π    − π \n. (8)\n By using this equation, the variation characteristics of the overall transformation ratio P CVT \nof the CVT with the frequency are experimentally studied under saturation and nonsaturation \nconditions.\n4. Experiment and Test\n Several 110 and 220 kV CVTs were tested with the CVT harmonic current measurement \nsystem based on capacitive current.  The principle of the test is shown in Fig. 10.(17–22)\n The test method is described as follows.  The high-voltage harmonic source is used to inject \nthe harmonic with a ratio of 10% into the CVT.  The order of the harmonic is 2–50.  Owing to \nFig. 10. Testing connection diagram.\n1508 Sensors and Materials , Vol. 31, No. 5 (2019)\nspace limitation, the article lists only one 220 kV CVT test result.  The test result of the CVT \nthrough the high- and medium-voltage capacitor currents is shown in Fig. 11.\n The CVT primary voltage after injection and the CVT primary voltage calculated using Eq. (2) \nare shown in Fig. 12.\n The frequency spectrum of the voltage shown in Fig. 12 is analyzed, and the obtained results \nare shown in Fig. 13.\n It can be concluded that, when the percentage of primary harmonic voltage is 10%, the \ncalculated percentage of primary voltage harmonic is close to 10% with a small error.  Table \n1 gives the numerical results of the harmonic test.  The harmonic percentage measured by the \ncapacitive current method is close to the harmonic level of the primary side of the CVT injected \nat the time of testing.  The maximum deviation of the harmonic percentage is 1.89%.\nFig. 12. Comparison of CVT high voltages (time domain). (a) CVT primary voltage after injection. (b) CVT \nprimary voltage calculated using Eq. (2).\n(a) (b)\nFig. 11. (Color online) Curve diagram of current flowing through (a) high- and (b) medium-voltage capacitors.\n(a) (b)\nSensors and Materials , Vol. 31, No. 5 (2019) 1509\nFig. 13. (Color online) Comparison of CVT high voltages (frequency domain). (a) CVT primary voltage after \ninjection.  (b) CVT primary voltage calculated using Eq. (2).\n(a) (b)\nTable 1\nHarmonic errors.\nHarmonic \n(order) U1(jw) (V) U2(jw) (V) δ (%) Harmonic \n(order) U1(jw) (V) U2(jw) (V) δ (%)\n 1  220.00  220.00 —  27  22.07  22.21  0.62\n 3  21.99  22.41  1.89  29  21.99  22.13  0.63\n 5  21.99  22.24  1.12  31  22.02  22.33  1.43\n 7  21.99  22.21  0.99  33  22.03  22.08  0.24\n 9  21.98  22.30  1.46  35  22.00  22.07  0.34\n 11  21.98  22.01  0.12  37  22.05  22.37  1.43\n 13  21.96  22.18  0.98  39  22.04  22.21  0.77\n 15  22.03  22.37  1.56  41  22.00  22.32  1.44\n 17  22.03  22.20  0.76  43  22.01  22.03  0.08\n 19  22.02  22.22  0.91  45  21.93  22.05  0.56\n 21  22.02  22.04  0.1  47  21.97  22.12  0.67\n 23  22.02  22.31  1.31  49  21.93  22.05  0.54\n 25  22.01  22.04  0.13\nNote: U1(jw) is the primary-side injection voltage of the CVT during the test, U 2(jw) is the calculated CVT primary-\nside voltage, and δ is the relative deviation of the harmonic ratio.\n4.1 Comparison with traditional harmonic testing methods\n To further analyze the validity of the CVT harmonic detection method based on capacitive \ncurrent, the harmonic test of the above 220 kV CVT is carried out by using the conventional \ntest method, that is, the same high-voltage harmonic is injected into the primary side of the \nCVT as the CVT harmonic testing method based on capacitive current.  The CVT secondary \nvoltage signal is derived for harmonic analysis.  Finally, the test results of the two methods are \ncompared.  The results of such a comparison are shown in Figs. 14 and 15.\n From Figs. 14 and 15, it can be seen that the results obtained by the traditional test methods \nhave larger deviations than those obtained by the method of injecting the voltage with a \nharmonic content of 10% into the primary side of the CVT during the test.  However, the results \n1510 Sensors and Materials , Vol. 31, No. 5 (2019)\nTable 2\nComparison of test results of two methods.\nHarmonic (order) 1 3 5 7 9\nError of traditional \n method (%) — 23.45 35.98 24.58 36.70\nError of capacitive \n current method (%) — 1.89 1.12 0.99 1.46\nHarmonic (order) 11 13 15 17 19\nError of traditional \n method (%) 21.23 21.56 27.67 18.34 16.21\nError of capacitive \n current method (%) 0.12 0.98 1.56 0.76 0.91\nHarmonic (order) 21 23 25 27 29\nError of traditional \n method (%) 2.94 3.41 1.92 3.15 2.29\nError of capacitive \n current method (%) 0.10 1.31 0.13 0.62 0.63\nHarmonic (order) 31 33 35 37 39\nError of traditional \n method (%) 12.56 19.67 18.33 11.25 17.68\nError of capacitive \n current method (%) 1.43 0.24 0.34 1.43 0.77\nHarmonic (order) 41 43 45 47 49\nError of traditional \n method (%) 17.32 13.13 16.43 17.85 15.53\nError of capacitive \n current method (%) 1.44 0.08 0.56 0.67 0.54\nFig. 15. (Color online) Comparison of conventional \nharmonic test data.\n(a) (b)\nFig. 14. Comparison of CVT high voltages (frequency domain). (a) Test results of traditional test method. (b) \nCapacitive current test results.\nof the CVT harmonic test based on capacitive current have a very small deviation from those \nobtained by the method of injecting the harmonic into the primary side of the CVT during \nthe test.  Table 2 shows the numerical results of the comparison of the two test methods.  The \nmaximum deviation of the harmonic content obtained by the traditional method is 35.98%.  The \nharmonic content measured based on the capacitive current method is close to the harmonic \nlevel of the primary side of the CVT injected during the test, with a maximum deviation of 1.89%.\nSensors and Materials , Vol. 31, No. 5 (2019) 1511\n5. Conclusions\n We focus on solving the problem that a traditional high-voltage system voltage harmonic \nmeasurement method does not consider the wide-band characteristics of a CVT and leads to \ninaccurate measurement results.  On the basis of the principle of a CVT and the characteristic \nof capacitive reactance that changes with frequency, a capacitive current method for accurately \nmeasuring the voltage harmonics of the power grid by a CVT is proposed.  By comparing \nthe test results of the traditional harmonic test method and the actual harmonics of the power \ngrid, the correctness and accuracy of the capacitive current method are verified.  Finally, a \ntest system based on the capacitive current method to accurately test the voltage harmonics \nof the power grid is designed.  The harmonic test method based on capacitive current is safe \nand reliable, shows an anti-interference ability, accurately measures the harmonic level of the \npower system by a CVT, and eliminates the distortion and drift caused by a CVT in harmonic \nmeasurements, providing reliable data for harmonic control.  The maximum deviation of the \nharmonic content obtained by the traditional method is 35.98%.  The harmonic content based \non the capacitive current method is close to that of the primary side of the CVT injected under \ntest, with a maximum deviation of 1.89%.  The method can be applied to the random testing \nand on-line monitoring of the harmonics of EHV, HV, and MV grids.  The testing method is \nsimple, reliable, and safe, and has solved the problem that a CVT cannot be applied to harmonic \nmeasurements, as specified in the GB/T14549-1993 “Power Quality Utility Harmonic”.\nReferences\n 1 X. Ni, Y. Yan and H. Lin: High Voltage Eng. 32 (2006) 104.\n 2 Standard Voltages, Current Ratings and Frequencies. GB/T 14549—1993 Quality of electric energy supply \nharmonics in public supply network (Standards Press of China, Beijing, 1994).\n 3 M. Xu, H. Gao, and G. Zou: Autom. Electric Power Syst. 35  (2011) 71.\n 4 M. H. Zare, A. Mirzaei, and H. A. Abyaneh: 20th Iranian Conf. Electr. Eng. (ICEE, 2012) 523–528.\n 5 Q. Ma, X. Cui, and C. Ren: High Voltage Eng. 40 (2014) 1828.\n 6 Y. Wen and S. Chen: Power Capacitor React. Power Compensation 35 (2014) 45.\n 7 H. Wang, X. Wang, and X. Chen: Electr. Meas. Instrum. 47  (2010) 39.\n 8 D. Wang and J. Wang: High Voltage Eng. 27 (2001) 66.\n 9 T. Ding, Z. Chen, and J. Zhang: Electr. Meas. Instrum. 46  (2009) 9.\n 10 F. Ghassemi and PhilipGale: IEEE Trans. Power Delivery 20  (2005) 443.\n 11 L. Li, X. Duan, and G. Liu: Hebei Electr. Power 23  (2014) 52.\n 12 G. Liu and L. Li: Heilongjiang Electr. Power 36 (2014) 100.\n 13 W. Si, L. He, and H. Jin: Adv. Technol. Elect. Eng. Energy 32 (2013) 43.\n 14 M. Kezunovic, C. W. Fromen, and S. L. Nilsson: IEEE Trans. Power Delivery 7 (1992) 1927.\n 15 L. Kojovicl, M. Kezunovic, and C. W. Fromen: IEEE Trans. Power Delivery 9 (1994) 1907.\n 16 H. Gao, Q. Li, and X. Yu: Power Syst. Technol. 33 (2013) 3125.\n 17 R. Wang: Research on Distortion Measurement Using CVT (North China Electric Power University, Baoding, \n2008).\n 18 Y. Zhang: Research on Transient Overreach of Capacitor Voltage Transformer (Zhejiang University, \nHangzhou, 2005).\n 19 L. Wang and B. Fang: High Voltage Eng. 38 (2012) 2389.\n 20 S. Wu, X. Wang, and X. Li: High Voltage Eng. 35 (2009) 973.\n 21 X. Hw: Modern Power Quality Measurement Technology (Fluke Corporation, Beijing, 2012) 208.\n 22 C. Zhou: Power Capacitor 2 (2005) 43.\n 23 E. Mohns: 2012 Conf. Precision Electromagnetic Measurements (CPEM) (IEEE, 2012) 304–305.\n1512 Sensors and Materials , Vol. 31, No. 5 (2019)\nAbout the Authors\nXin Shen  received his B.S. and M.S. degrees from Kunming University of \nScience and Technology, China, in 2003 and 2012 respectively.  From 2003 to \n2009, he was an assistant professor at Yunnan Electric Power Research \nInstitute, China.  Since 2017, he has been a professor at Yunnan Electric \nPower Research Institute.  His research interests are in sensors, electric \nenergy metering, and engineering.\nHongchun Shu  received his Ph.D. degree from the Harbin Institute of \nTechnology, China, in 1997.  From 1997 to 1998, he was an assistant professor \nat Kunming University of Science and Technology, China.  Since 1998, he has \nbeen a professor at Kunming University of Science and Technology, China.  \nHis research interests are in power system automation, sensors, HVDC and \nflexible dc transmission, and distribution network fault detection and \nprotection.\nMin Cao received his B.S. degree from Kunming University of Science and \nTechnology, China, in 1982.  From 1988 to 2012, he was an assistant professor \nat Yunnan Electric Power Research Institute, China.  Since 2012, he has been \na professor at Yunnan Electric Power Research Institute, China.  His research \ninterests are in electric energy metering, engineering, and sensors."
}