{
  "title": "The Use of Instagram as a Mobile-Assisted Language Learning Tool",
  "url": "https://openalex.org/W2957568197",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A2766035127",
      "name": "Talip Gönülal",
      "affiliations": [
        "Erzincan University"
      ]
    },
    {
      "id": "https://openalex.org/A2766035127",
      "name": "Talip Gönülal",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2339313454",
    "https://openalex.org/W2344105103",
    "https://openalex.org/W1500548936",
    "https://openalex.org/W2029614475",
    "https://openalex.org/W4246344059",
    "https://openalex.org/W2249595199",
    "https://openalex.org/W2647395545",
    "https://openalex.org/W2128389066",
    "https://openalex.org/W2941630799",
    "https://openalex.org/W2125510672",
    "https://openalex.org/W1537839732",
    "https://openalex.org/W2152113185",
    "https://openalex.org/W4233781735",
    "https://openalex.org/W2156112062",
    "https://openalex.org/W2118735598",
    "https://openalex.org/W2023968475",
    "https://openalex.org/W6741798423",
    "https://openalex.org/W2129636576",
    "https://openalex.org/W2061511330",
    "https://openalex.org/W6697280659",
    "https://openalex.org/W2156267802",
    "https://openalex.org/W2766468579",
    "https://openalex.org/W2884129468",
    "https://openalex.org/W4249696084",
    "https://openalex.org/W2345834047",
    "https://openalex.org/W2792947095",
    "https://openalex.org/W1986607664",
    "https://openalex.org/W1934229963",
    "https://openalex.org/W1575920512",
    "https://openalex.org/W2295644056",
    "https://openalex.org/W275495156",
    "https://openalex.org/W1914972138",
    "https://openalex.org/W2461535142",
    "https://openalex.org/W2739524744",
    "https://openalex.org/W2612166593",
    "https://openalex.org/W2129427526"
  ],
  "abstract": "The present study sought to explorehow English language learners (ELLs) used Instagram, a popular socialnetworking site, for language learning purposes and to reveal their attitudestowards and experiences in using it as a mobile-assisted language learning (MALL)tool. Special interest was also placed on whether there were any distinct ELLprofiles in using Instagram for independent and informal language learning. In thismixed-methods study, both quantitative and qualitative data were concurrentlycollected through an online comprehensive survey consisting of three sections.Ninety-seven Instagram using ELLs took part in this study. Basic descriptivestatistics and a cluster analysis were conducted on the quantitative data, anda thematic analysis on the qualitative data. The results showed that Instagramhas the potential to help ELLsto improve overall language skills in general, and vocabulary and communicationskills in particular. Further, ELLs’ experiences in using Instagram as aMALL tool for informal language learning were largely positive. Additionally,two different language learner profiles (i.e., novice and experienced) emergedbased on Instagram use habits and orientations. Overall, this study indicatedthat social networking platforms and MALL applications can be used as aneffective mobile language learning tool.&amp;nbsp;",
  "full_text": "CONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n309 \n \nThe Use of Instagram as a Mobile-Assisted Language Learning \nTool \n \n \nTalip Gonulal \nErzincan Binali Yildirim University, Turkey \n ORCID: 0000-0001-6441-4278  \n \n \nReceived: 27.10.2018 Accepted: 31.05.2019 Published: 12.07.2019 \n \n \nAbstract \nThe present study sought to explore how English language learners (ELLs) used Instagram, \na popular social networking site,  for language learning  purposes and to reveal their \nattitudes towards and experiences in using it as a mobile-assisted language learning (MALL) \ntool. Special interest was also placed on whether there were any distinct ELL profiles in \nusing Instagram for independent and informal language learning. In this mixed-methods \nstudy, both quantitative and qualitative data were concurrently collected through an online \ncomprehensive survey consisting of three sections. Ninety-seven Instagram using ELLs took \npart in this study. Basic descriptive statistics and a cluster analysis were conducted on the \nquantitative data, and a thematic analysis on the qualitative data. The results showed that \nInstagram has the potential to help ELLs to improve overall language skills in general, and \nvocabulary and commu nication skills in particular . Further, ELLs’ experiences in using \nInstagram as a MALL tool for informal language learning were largely positive. Additionally, \ntwo different language learner profiles  (i.e., novice and experienced)  emerged based on \nInstagram use habits and orientations . Overall, this study indicated that  social networking \nplatforms and MALL applications can be used as an effective mobile language learning tool.  \n \nKeywords: Social networking sites; Mobile-assisted language learning; English language \nlearning; Instagram \n \n \nIntroduction \n \nThe use of internet and digital technology has become an inevitable part of daily life in the recent \nyears. This increased use of and dependence on digital technology has influenced , to a greater \nor lesser extent, not only the lives of people but also the ways languages are learned and taught \n(Mazer, Murphy , & Simonds, 2007).  A current trend that combines  digital technology and \nlanguage learning is mobile-assisted language learning (MALL). MALL broadly refers to anytime, \nanywhere language learning activities undertaken through mobile devices without being limited \nto a physical location or a determined time (Kukulska-Hulme, 2009; Kukulska-Hulme & Shiled, \n2008). In line with this trend, several MALL apps (e.g., Duolingo, Babbel, Busuu, Wlingua and so \nforth) have slowly appeared as alternative language learning tools for those who want to learn \nlanguages in self-directed and informal ways.  \n \nIn addition to MALL-oriented apps, common social networking platforms such as Facebook and \nTwitter have recently found their ways into  MALL, as well . For instance, r esearch provided \nevidence that Facebook (e.g., Alm, 2015; Kabilan, Ahmad , & Abidin, 2010; Mitchell, 2012)  and \nTwitter (e.g., Lomicka & Lord, 2012; Solmaz, 2017; Taskiran, Gumusoglu, & Aydin, 2018)  have \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n310 \n \nthe potential to provide language learning opportunities by enabling language  learners to \ninteract in and through the target language . However, relatively few studies focused on \nInstagram despite the fact that it is one of the popular social networking platforms with effective \nMALL potentials. Further, there is limited research investigating  the fully learner-led and self-\ndirected mobile language learning in informal settings outside of class because almost all studies \nlooking at the language learning potentials of social networking platforms are either teacher-led \nor carried out as part of formal language learning . It is highly likely that learner profile, \nexperience and motivation may vary when mobile language learning takes place in a n informal \nand learner-led setting. Given that, the present study aimed to examine how English language \nlearners (ELLs) used a popular social networking platform (i.e., Instagram) as a mobile language \nlearning tool, particularly in informal learning settings , and whether any different learner \nprofiles exist among ELLs . Further, ELLs’ attitudes towards and experiences in using Instagram \nas a MALL tool for independent language learning were also explored. \n \n \nLiterature Review \n \nThe field of foreign and second language learning has witnessed a shift from the traditional \nlanguage learning to a more technology-enhanced language learning over the last three decades \n(Chapelle, 1997; Golonka, Bowles, Frank, Richardson , & Freynik, 2014). The integration of \ntechnology in language classrooms has been mostly welcomed since it can boost language \nlearners’ linguistic and digital competences by enhancing the language learning process  and \nlearner motivation. Motivation, a key element in the process  of acquiring a new language \n(Dörnyei, 1994), warrants further attention and constitutes a crucial part when it comes  to the \nintegration of technology in language learning environments  (Stockwell, 2013; Ushioda, 2011, \n2013). For instance, Stockwell (2013) argues that there can be a bilateral relationship between \ntechnology use and the motivation in language learning. In other words, a learner with high \nmotivation to use technology may develop motivation to learn a language. In the same way, a \nlearner with high motivation to learn a language may want to utilize technology  to reach his or \nher goals. \n \nWith the rapid development in technology and contemporary language learning methods, \nmobile devices (e.g., mobile phones, personal digital assistants [PDAs and tablet PCs]) have also \nfound their way into formal and informal  language learning. This new trend is broadly called \nmobile-assisted language learning  (Kukulska-Hulme & Shield, 2008) . There are a number of \naffordances attributed to MALL in the literature.  Spontaneity, individuality, flexibility, \npersonalized and self -paced learning figure notably (Kukulska-Hulme, 2009 , 2012 ). Arguably, \none of the important characteristics of MALL is that it can t ake language learning out of the \nclassroom and provide sustained language practice  by enabling anytime, anywhere language \nlearning. That is, contrary to more conventional and formal methods of learning, MALL provides \nopportunities for learning ‘out in the world’ (Brown, 2010 , as cited in Kukulska-Hulme, 2012). \nFor instance, watching a movie in the target language when travelling, listening to a foreign -\nlanguage radio channel while going to work or playing language-related games while waiting for \nthe bus are some examples of learning in the wild.  \n \nOne popular way of language learning out in the world is to use social networking sites (SNSs) \nsuch as Facebook and Twitter. Although such SN Ss are not designed specifically for MALL \npurposes, they can serve as an easy and useful venue for enhancing  language learning  and \nimproving cultural awareness as well . For instance, Lee and Ranta (2014) argue that SNSs can \nprovide opportunities for interaction between native speakers of English and ELLs, especially \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n311 \n \nconsidering that it is quite challenging for English as a foreign language (EFL) learners to interact \nwith native speakers outside the classroom.  Given the language learning potentials of SN Ss, a \nnumber of scholars (e.g., Al-Ali, 2014; Alm, 2015; Chartrand, 2012; Gamble & Wilkins , 2014; \nKabilan et al., 2010; Lee & Ranta, 2014; Lomicka & Lord, 2012, 2016; Mitchell, 2012; Solmaz, \n2017, 2018) have paid more attention to SN Ss. As an example, Kabilan et al. (2010) conducted \nan attitudinal study with 300 Malaysian colleg e students to examine the role of Facebook in \nEnglish language learning. The results indicated that Facebook could be utilized as a useful tool \nto improve learners’ English language skills, to increase learners’ motivation to communicate in \nEnglish, and to boost their confidence in practicing their English. In a similar vein, Mitchell (2012) \nattempted to explore ESOL learners’ motivation for using Facebook as well as their Facebook \nuse behaviors. Mitchell conducted a qualitative study with seven students attending an intensive \nEnglish course at an American u niversity. The results indicated that apart from social benefits \nsuch as making new friends or keeping in touch with existing friends, Facebook appeared to be \nan effective pe ripheral language learning tool. That is, almost all ESOL students reported that \nthey improved their English language skills through using Facebook even though they did not \nintend to use it for language learning purposes.  However, the only concern that was  raised in \nthe study was pertinent to the inaccurate and informal English language use on Facebook.  \n \nSimilar perceptions and benefits were also reported when Twitter was employed in the English \nlanguage learning environments (e.g., Kim, Park , & Baek , 2011; Mompean & Fouz -González, \n2016; Taskiran et al., 2018). To illustrate, Taskiran et al. (2018) investigated Turkish EFL college \nstudents’ perceptions regarding the use of Twitter in extra -curricular activities which were \nneither part of the curricula nor evaluated but guided by instructors.  The results showed that \nTurkish EFL students perceived Twitter to be motivating and engaging. In addition, Twitter was \nreported to help improve overall language -learning skills, and grammar and vocabulary, in \nparticular. In sum, the studies on Facebook and Twitter collectively suggested that they could \nbe used as an effective mobile language learning tool. \n \nAlthough there is a considerable body of research investigating the pedagogical functions of \nFacebook and Twitter, relatively little research to date has focused on the use of Instagram in \nEnglish language learning. Especially considering that young generation are slowly migrating to \nInstagram from other popular SN Ss (Lomicka & Lord, 2016), it is important to examine the \npotentials of Instagram as a mobile language learning tool. As a photo- and video-sharing social \nmedia tool, Instagram was introduced in early October in 2010 and then became one of the most \npopular social networking platforms with 1 billion monthly active users as of June 2018 \n(Statistica, 2018a). In looking at the countries with the highest Instagram users, the United States \nis ranked first with 120 million monthly users, followed by India (67 million), Brazil (63 million), \nIndonesia (59 million) and Turkey (36 million; see Statistica, 2018b for further details).  \n \nYet, d espite its popularity, particularly among young adults,  and its high potential for \ncontextualized visual data,  only a few scientific studies have so far examined  the roles and \nfunctions of Instagram  in language learning contexts.  A r are example of this focus is  Al-Ali’s \n(2014) study. More specifically, Al-Ali explored the integration of Instagram in EFL classrooms as \na mobile learning tool. In this teacher-led study, the primary focus was on speaking and writing \nskills. Al-Ali reported that Instagram provided un ique opportunities to create more \nindividualized learning experiences for language learners. In addition, Instagram was found quite \neffective in forming a strong sense of community among learners.  \n \nWhen viewed in its entirety, although the foci in previous SNS studies was to make  language \nlearning more learner-centered, they were predominantly teacher-led. In other words, teachers \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n312 \n \nor instructors appeared to play a significant role, for instance, in asking learners to engage with \nthe SNS under investigation. Conceived in this way, these SNS-based mobile language learning \nstudies seem to belong more to teachers than learners. Given that, there is a lack of research on \nhow social networking platforms can be effectively utilized in a fully learner -led fo rmat in \ninformal language learning environment, which is as important as formal language learning \nenvironment. An emphasis on fully learner -led mobile language learning might lead to new \nlearning perspectives and practices since a self-directed and self-paced mobile language learning \nmight result in different learning experiences than a teacher -led mobile language learning  in \nformal learning environment. Further, language learners who adopt self-instructed and informal \nmobile language learning might differ from other language learners who are more familiar with \nformal and teacher -led language learning. For instance, some mobile language learners might \nhave a high degree of autonomy, motivation or digital literacy. Therefore, the primary purpose \nof this fully learner-led study wa s to examine  the learner characteristics of a group of \nexperienced Instagram using English language learners (ELLs), with a special focus on the extent \nto which they use d it to improve their English language  skills in informal learning settings . \nAnother purpose wa s to  explore ELLs’ beliefs and experiences regarding the potentials of \nInstagram as a MALL tool. The following research questions guided the present study. \n \nRQ1: What different profiles exist among English language learners in using Instagram as a MALL \ntool? \n \nRQ2: What are English language learners’ attitudes towards and experiences of using Instagram \nas a MALL tool? \n \n \nMethod \n \nIn this study, m ixed-methods research design was chosen to answer the research questions. \nMore specifically, a convergent parallel mixed-methods research design was used (Creswell & \nPlano-Clark, 2011). That is, both quantitative and qualitative data were concurrently collected \nbut analyzed separatel y. Then, the results were merged and interpreted collectively. This \nmethod was the most suitable one to better explore distinct Instagram user profiles and  the \npotentials of Instagram as a MALL tool for informal learning. \n \n \nInstrument \n \nA survey consisting of three parts was used to collect data (see Appendix A). The first part \nincluded 15 questions addressing background information and Instagram use habits. The second \npart was a 6-point Likert-type scale developed by the researcher following Kabilan et al.’s (2010) \nand Gamble and Wilkins’ (2014) questionnaires on learners’ perceptions of Facebook. This scale \ninitially included 18 statements addressing learners’ perceptions of and attitudes towards using \nInstagram as a language learning tool . A fter consulting with two selected experts, several \nchanges and edits were made, and the final version consisted of 15 statements. The Cronbach’s \nalpha level was .94, which was quite high and therefore suitable for data collection (D örnyei & \nTaguchi 2009; F ield, 2013). Finally, the last part of the survey included three open -ended \nquestions to further explore learners’ views of MALL in general, and Instagram as a MALL tool in \nparticular. \n \n \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n313 \n \nProcedures \n \nSince the study targeted Instagram users who used it for English language learning purposes, \nthe first step was to identify the potential participants. Thus, several tags (e.g., #englishlanguage, \n#learnenglish, #englishlesson) were searched on Instagram to locate the groups which learners \nfollow to improve their English language skills. Then, an online version of the survey was created \nusing Qualtrics survey tool, and the survey link was sent to the followers of groups devoted to \nEnglish language learning and teaching. Further, survey circle website was also used  to reach \nmore eligible participants who could take the survey. The data collection period lasted 8 weeks. \n \n \nParticipants \n \nOne hundred and twenty-eight participants initially took part in the present study. However, 26 \nparticipants did not answer any questions on the survey and therefore did not provide any data. \nFurther, 5 more participants were excluded from the analyses because they reported that they \nhad very little experience  (i.e., less than a month)  in using Instagram since they had recently \ncreated their Instagram account s. After excludin g those participants, the total number of \nparticipants were reduced to 97 (33 males and 64 females) users of Instagram. Participants were \nall experienced users. Th at is, almost half of them (51 %) had been using  Instagram for 3 to 7 \nyears and about a quarter (25%) 1 to 2 years. Further, a great majority of the participants (81%) \nreported using Instagram on a daily basis. More specifically, participants reported spending \nalmost two hours on Instagram on average (M = 1.88, SD = 1.73) for educational and leisure \npurposes. Additionally, more than half (53%) of participants’ communication on Instagram (e.g., \nsharing a post, commenting on a post, sending and replying messages) was solely in English. \nFurther, a quarter of participants’ followings on Instagram was related to English language per \nse (e.g., an English idioms page). \n \nParticipants’ self-rated English language proficiency indicated that no skill averaged below 4 out \nof 6, with reading being the highest (M = 4.93, SD = 1.26, 95% CI [4.66, 5.19]) and speaking being \nthe lowest (M = 4.32, SD = 1.52, 95% CI [4.08, 4.68]). Participants were mostly adult learners in \nthat the mean age was 26 years old (SD = 7.52) . In addition, participants were coming from 42 \ndifferent countries: Brazil (8); Turkey (7); Finland, Germany (6); Azerbaijan, Indonesia, Iran, \nSpain, Ukraine (5); China, India, Russia (3); France, Hungary, Italy, Japan, Kazakhstan, \nNetherlands, USA (2); Albania, Algeria, Armenia, Belarus, Czech  Republic, Egypt, Greece, Iraq, \nKenya, Lithuania, Malaysia, Moldova, Poland, Portugal, Puerto Rico, Serbia, Sudan, Syria, Taiwan, \nTajikistan, Thailand, and Venezuela (1). Most frequent first languages were Russian, Portuguese, \nTurkish, Spanish, German, Fin nish and Arabic.  Participants were majoring in a variety of \ndisciplines (e.g., TESOL, linguistics, accounting, engineering, psychology, sociology, pharmacy , \nmedicine and so on ), with majority (35%) in TESOL, linguistics or English -related programs. \nFurther, most participants were in either MA (31%) or PhD (13%) programs or just earned their \nBA degrees (11%).  \n \n \nAnalysis \n \nFrequencies, percentages and other basic descriptive statistics were calculated to analyze the \nresults of the background questionnaire, learners’ Instagram use habits  and orientations, and \ntheir attitudes towards Instagram as a MALL tool. As a routine data screening procedure, before \nperforming any statistical tests, the data went through a comprehensive missing value analysis \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n314 \n \n(MVA). The M VA results s howed that 75 participants (77 %) completed all the items on the \nquestionnaire whereas 22 participants (23%) missed some items. In looking at the rate of missing \nvalues, 7% (n = 226) was missing out of the total values (n = 2,878) on the survey. Considering \nthat the proportion of missing data was larger than the suggested cut -off level (i.e., 5%; see  \nGonulal, 2019 and Schafer & Graham, 2002), multiple imputation method was used to remedy \nthe missing data issue. In the multiple imputation method, the data were imputed 5 times and \nthen the returned estimates were averaged. \n \nIn order to identify any distinct Instagram user profiles, a cluster analysis was run. The purpose \nof cluster analysis is “to create a new categorical variable that minimizes the amount of variation \nwithin categories, while maximizing the differences among categories” (Staples & Biber, 2015, \np. 243). Simply put, cluster analysis is highly effective in identifying homogenous clusters or \ngroups in a dataset.  Given the exploratory nature of this study, a hierarchical cluster analysis \n(HCA) was conducted in that there was no prior expectation regarding the number and \ncharacteristics of the clusters. The HCA was performed on SPSS 21.0, with the following \nsuggested options se lected: agglomeration schedule —Ward’s method —squared E uclidean \ndistance. After the identification of clusters, basic descriptive statistics , 95% confidence \nintervals, independent t -tests and Mann -Whitney U tests were calculated to compare the \nclusters. Since multiple comparisons were made between the clusters, a Bon ferroni correction \nwas applied to decrease Type 1 error.  Therefore, the new adj usted alpha level was .01 (i.e., \n.05/5). Finally, for the qualitative data, a thematic analysis was conducted. \n \n \nResults \n \nInstagram User Profiles \n \nThe first research question focused specifically on whether there would be distinct user profiles \nin terms of  using the application as a MALL tool. The hierarchical cluster analysis suggested a \ntwo-cluster solution, which is illustrated in the dendrogram (see Appendix B). However, since it \nis also highly suggested to examine the distances between the clusters (i. e., the fusion \ncoefficients) to determine the optimal number of cl usters (Staples & Biber, 2015), an \nexamination of the distance between the coefficients indicated that a two-cluster solution was \nthe better cluster model. \n \nThe results of the two -cluster analysis showed that Cluster 1 consists of 46 ELLs (16 males and \n30 females) and Cluster 2 51 ELLs (17 males and 34 females). Cluster 1 (M = 27.51, SD = 7.87) \nand Cluster 2 (M = 25.16, SD = 7.09) were almost identical in age, t(95) = 1.541, p = .127. Cluster \n1 were m ostly in their senior year (20 %), in their MA (37%) or PhD (13%) program. Likewise, \nCluster 2 were also mostly in their senior year (22%), in their MA (26 %) or PhD (12%) program. \nAdditionally, Cluster 1 and Cluster 2 did not statistically differ i n their self -rated English \nproficiency, t(95) = .705, p = .483. However, there are some differences between Cluster 1 and \nCluster 2 in terms of their Instagram use habits and orientations. For example, only 24% of \nCluster 1 used the Instagram application i n English whereas the rate was 77% in Cluster 2. In \nregards to the length of Instagram use, there were no striking differences but it might be noted \nthat there were more experienced Instagram users (i.e., using Instagram at least for 5 years) in \nCluster 2 (20%) than in Cluster 1 (11%).  \n \n \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n315 \n \nTable 1. Comparison of ELLs’ Instagram Use Habits and Orientations by Cluster Membership \n Cluster 1 Cluster 2 Mann-Whitney U \nTest \n M SD 95%CI M SD 95% CI U p \nTime spent on \nInstagram (hrs.) \n1.29 1.09 [.96, \n1.62] \n2.41 2.03 [1.84, \n2.98] \n1.595 .002 \nCommunication in \nEnglish (%) \n30.02 27.99 [21.61, \n38.43] \n57.35 24.19 [50.54, \n64.15] \n1.856 .001 \nLanguage content \nfollowed (%) \n13.20 16.68 [8.18, \n18.21] \n36.19 29.10 [28.01, \n44.38] \n1.717 .001 \n \nFurther, almost all the members of Cluster 2 appeared to be an ardent daily user of Instagram  \nas a MALL tool (see Table 1). Indeed, Cluster 2 reported using Instagram approximately two and \nhalf hours on average (SD = 2.03) whereas Cluster 1’s average time of Instagram use was around \none hour (SD = 1.09). This difference was statistically significant (U = 1.595, p = .002). In the same \nvein, Cluster 2 reported that the majority (57%) of their communication in Instagram was in \nEnglish. On the other hand, only 30% of Cluster 1’s communication was in English. This difference \nwas also statistically significant (U = 1.856, p < .001).  Similarly, Cluster 2 seemed to significantly \nfollow more English-related posts, pages, groups and so forth on Instagram when compared to \nCluster 1 (U = 1.717, p < .0 01). Overall, in looking at the Instagram use orientations and habits \nof Cluster 1 and Cluster 2, it is obvious that Cluster 1 is at a low level in terms of using Instagram \nfor English language learning purposes while Cluster 2 is at a higher level. Put it  another way, \nmembers in Cluster 1 are novice but members in Cluster 2 are experienced users of Instagram \nas a MALL tool. \n \n \nAttitudes Towards and Experiences of Using Instagram as a MALL Tool \n \nThe second research question dealt  with ELLs’  attitudes towards and perceptions of using \nInstagram for English language learning purposes (see Table 2). Both Likert -scale and open -\nended questions were used to answer this research question . Descriptive statistics for the \nInstagram attitude questionnaire are presented in Table 2. Overall, ELLs had relatively positive \nattitudes towards the use of Instagram for language learning purposes (M = 4.21 out of 6, SD = \n.78). When looking more closely at the potential educational use of Instagram, ELLs  largely \nperceived that Instagram can be a good platform to learn new English words (M = 4.86, SD = .95) \nand to read in English (M = 4.82, SD = .99). Similarly, ELLs considered Instagram suitable for \nimproving English communication skills (M = 4.46, SD = .96).  \n \nFurther, ELLs believed that Instagram has the potential to make learning English a fun activity \n(M = 4.69, SD = 1.09), to motivate learners to read more English-related materials (M = 4.45, SD \n= 1.09), and to motivate learners to communicate more using English (M = 4.42, SD = 1.30). On \nthe other hand, ELLs had marginally negative perceptions of using Instagram to improve English \ngrammar knowledge (M = 3.81, SD = 1.31) or to overcome language mistakes (M = 3.45, SD = \n1.19). Additionally, ELLs considered that Instagram should not be the only, or rather, main source \nof learning English (M = 3.93, SD = 1.24) but it might be used as a peripheral language learning \ntool. \n \n \n \n \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n316 \n \nTable 2. Descriptive Statistics for ELLs’ Attitudes towards and Perceptions of Using Instagram \n M SD 95% CI \n6. Instagram is a good platform to learn new words in English 4.86 .95 [4.67, 5.05] \n3. Instagram is a good platform to read in English \n10. Instagram makes learning English more interesting \n4.82 \n4.69 \n.99 \n1.09 \n[4.62, 5.02] \n[4.47, 4.91] \n4. Instagram is a good platform to develop English communication \nskills \n13. Instagram increases my motivation to read English materials \n12. Instagram increases my motivation to communicate using English  \n11. Instagram makes learning English easier \n14. Instagram increases my motivation to write in English \n4.46 \n4.45 \n4.42 \n4.27 \n4.26 \n.96 \n1.09 \n1.30 \n1.12 \n1.28 \n[4.26, 4.65] \n[4.23, 4.67] \n[4.16, 4.69] \n[4.05, 4.50] \n[4.00, 4.52] \n1. Instagram is suitable for educational purposes 4.20 1.13 [3.97, 4.42] \n8. Instagram is a good platform to improve overall English skills 4.16 .96 [3.97, 4.36] \n9. Instagram is a good platform to reach authentic English materials 4.11 1.21 [3.86, 4.35] \n2. Instagram is a good platform to practice writing in English \n15. Instagram encourages me to spend more time learning English \n4.06 \n3.93 \n1.13 \n1.24 \n[3.83, 4.29] \n[3.68, 4.18] \n7. Instagram is a good platform to improve English grammar \nknowledge \n3.81 1.31 [3.55, 4.07] \n5. Instagram is a good platform to overcome language mistakes 3.45 1.19 [3.21, 3.69] \n  Note. 1= strongly disagree, 6 = strongly agree. \n \nIn addition to the scale data, the open -ended questions were also analyzed. Forty -nine \nparticipants answered the open -ended questions  at the end of the survey  and shared their \nopinions, attitudes and experiences regarding the use of Instagram as a mobile English language \nlearning tool. Participants’ responses generated 3,102 words of quantitative data. As can be seen \nin Table 3, a thematic analysis revealed five broad yet mostly interrelated themes: (a) practicing \nEnglish, (b) improving vocabulary knowledge, (c) reach ing native speakers, (d) interesting \nlanguage learning experience, and (e) informal language use.  Although the majority of the \nthemes address the positive and advantageous aspects of Instagram, a non -ignorable portion \nalso highlighted the disadvantages linked to the use of Instagram.  \n \nTable 3. The List of Themes Generated in the Qualitative Data \nThemes Frequency % \nPracticing English 14 26.4 \nImproving vocabulary knowledge 13 24.5 \nReaching native speakers 10 18.9 \nInteresting language learning experience 9 17.0 \nInformal language use 7 13.2 \n \nThe first theme concerns the opportunities Instagram offers to ELLs to practice their English in \ngeneral. For instance, an Indonesian learner of English highlighted this important functionality \nof Instagram in EFL settings stating  that “I learned English from elementary school till college, \nbut I can't speak English very well, because I don’t have much chance to practice my English \nexcept in English class. That's why I think Instagram is a great way to improve my overall English \nskills and to find people to practice my English.” Additionally, a Puerto Rican learner highlighted \na similar point: “It mainly gives me the opportunity to practice my language skills that I can’t \npractice any other way since I live in a Spanish -speaking island.” In the same vein , a Spanish  \nlearner of English  elaborated on the opportunities that Instagram offers to ELLs stating that \n“since you are having real conversations and interactions with real people from the rest of the \nworld, I think that it’s an outstanding way of practicing English.” \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n317 \n \n \nThe second theme relates to one particular aspect of language learning. To put it another way, \nInstagram is reported to help ELLs improve their vocabulary knowledge. For instance, an Indian \nlearner explained how he used Instagram to learn new words in English: “I have followed many \npages and they daily upload a new word along  with its meaning and how to use that word \nappropriately in real life.” Several participants also commented on why Instagram could be an \nideal way to learn new vocabulary. To illustrate, an Italian learner stated that “ the association \nof images to words makes it easier for learners to learn new vocabulary more efficiently.” \n \nAnother theme that emerged from the qualitative data is pertinent to the effectiveness of  \nInstagram in helping ELLs reach more native speakers or advanced speakers of English to practice \ntheir communication skills. A Venezuelan learner mentioned that “I have been using Instagram \nsince 2015 to follow native speakers and non-native English teachers”. A Russian learner stated \nthat “it helps me communicate with more native speakers of English. This is an effective way t o \nimprove conversational skills .” In a slightly different vein, a Brazilian learner stated that “ My \nnative speaker friends on Instagram help me learn new ways to express my feelings.” \n \nThe fourth theme concerns the ways Instagram can make English language learning experience \nmore interesting and fun. A Portuguese learner pointed out that “ Instagram certainly has the \nelement of combining pictures with texts, which can be very helpful. Also, it’s a way of making \nlearning more fun and relatable to the students .” A Spanish learner “I think it’s a great way to \nmake language learning as practical, fun and authentic. It can increase students’ motivation and \nexigencies to communicate in English. It gives students access to so many different cultural \naspects.” \n \nContrary to the previous themes, the last theme addresses that Instagram might not be an ideal \nplatform to improve English skills, in particular grammar knowledge simply because slang or \ninappropriate English use is pretty common on Instagram. As an example, an Indonesian learner \nexpressed that “it will be disadvantageous in learning grammar because not every Instagram \nusers and accounts display accurate grammar.” Likewise, a Finnish learner also highlighted the \nvery same point: “The English language used on Instagram is not always proper or grammatically \ncorrect, so I don't think it is good for this purpose .” If English learners do not be careful when \nchoosing the pages to follow to improve their English, Instagram may do more harm than good. \nRegarding this point, an Italian learner explained that “I think it motivates to learn but it might \nbe backfiring because the English learned there is no formal language.” \n \n \nDiscussion and Conclusion \n \nStudies looking at mobile language learning within a fully learner-led and informal setting are \nrelatively rare. As an initial foray into this type of mobile language learning research, the primary \npurposes of the  current study conducted with experienced Instagram end-users were (a) to \nreveal ELLs’ Instagram use habits for educational purposes and identify any distinct profiles \namong ELLs when using Instagram as a MALL tool, and (b) to investigate  ELLs’ opinions and \nexperiences regarding  the employment of  Instagram as a MALL tool. The quantitative and \nqualitative data gathered from a diverse group of Instagram using English learners revealed \nsome important findings.  \n \nEven though Instagram per se was not designed for use as an educational application, most ELLs \nreported that they were actively used it for English language learning purposes. Similarly, using \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n318 \n \nsocial networking platforms for such purposes were also examined or reported in other studies \n(e.g., Lomicka & Lord, 2012; Mitchell, 2012). Further, a great majority of ELLs detailed different \nmethods of utilizing Instagram as a mobile language learning tool. To illustrate, almost half of \nELLs pointed out that they strived to use only  English when communicating (e.g., posting a \ncomment, replying and sending direct messages) on  Instagram. Additionally, another trend in \nInstagram use that figured remarkably among ELLs was to follow and make use of certain  \nInstagram pages devoted to English language development (e.g., BBC l earning English, daily \nEnglish learning, English online coach, learn English myself).  \n \nFirst, the cluster analysis uncovered two similar yet different groups of Instagram-as-a-mobile-\nlanguage-learning users.  Although both groups considered Instagram as an effective way of \nimproving English language skills, they differed in their Instagram use habits and orientations. \nMost notably, Cluster 2 appeared to be more experienced and passionate Instagram users than \nCluster 1. For instance, Cluster 2 tended to spend considerably more time on Instagram, \nexclusively use English to interact with other people and subscribe to noticeably more English-\nrelated pages and groups on Instagram, and reported to use or have used other MALL tools (e.g., \nDuolingo) and social networking platforms (e.g., Facebook and Twitter) to improve their English \nproficiency. That is, members in Cluster 2 are arguably more technology -savvy. On the other \nhand, Cluster 1 seem to be highly determined  to improve their English skills by making use of \nthe readily available tools such as Instagram even if their d igital literacy levels were on the \nmiddle ground. This means that there is a relationship between the use of technology and  the \nincreased language learning motivation (as in Cluster 2), and between the high language learning \nmotivation and the increased use of technology (as in Cluster 1).  \n \nAs far as the literature review suggests there are no published studies with which to compare \nthis finding directly. However, a few scholars (e.g., Stockwell, 2013; Ushioda, 2011, 2013) have \ndrawn attention to this point. For instance, Stockwell (2013) clearly noted that “motivation to \nuse a technology could very well lead learners to develop motivation to learn  a language \n(although unlikely automatically) and, conversely, sustained motivation to learn a language \ncould result in a desire to use technology” (p. 163). In a similar way, Ushioda (2013) put forward \nthat thanks to intrinsic characteristics of mobile le arning such as flexibility, freedom and \nautonomy, “internalised motivation for independent learning” can be promoted (p. 2). Overall, \nthis finding suggests that a bi -directional relationship between technology use and language \nlearning motivation is possible. \n \nThe second purpose of the current study was to explore ELL’s attitudes towards and experiences \nin using Instagram for informal language learning. ELLs’ overall attitudes towards using \nInstagram for language learning purposes were largely positive due to its suitability for sustained \nEnglish language learning . Further, ELLs mostly considered Instagram to be a motivating and \ninteresting mobile language learning tool. To be more specific, Instagram appeared to motivate \nELLs to read enjoyable material s including authentic language use, and to use the target \nlanguage more often. S ome other affordances Instagram offer s to English learners are that it \ncan be a great venue for vocabulary development thanks to its suitability for contextualizing text \nwith visual data. Indeed, several ELLs explicitly stated in the open-ended questions section that \nthey particularly used the application  to improve their vocabulary knowledge. This inclination \namong the ELLs is in line with the other SNS studies of similar nature (e.g., Alm, 2015; Kabilan et \nal., 2010; Taskiran et al., 2018), which reported that such social networking platforms can serve \nan ideal place to learn and practice new words.  \n \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n319 \n \nFurthermore, based both on the quantitative and the qualitative data,  there seemed to be  \nalmost a consensus among the ELLs that Instagram is an easy and convenient way of improving \noverall communication skills simply because it promotes a sense of community where ELLs can \nhave the opportunity to interact and socialize with other ELLs, a nd provides ELLs with an \nopportunity to readily reach  and communicate with native speakers or advanced speakers of \nEnglish synchronously or asynchronously. Similar affordances were also highlighted in other SNS \nstudies (e.g., Blattner & Fiori, 2009; Lee & Ranta, 2014; Mitchell, 2012; Solmaz, 2017). As an \nexample, Blattner and Fiori (2009) reported that “…[Facebook] develop relationships with native \nspeakers who share similar interests and who will interact on a regular basis in L2” (p. 22).  \nApropos of this particular affordance, Instagram and other social networking platforms can be a \nvaluable source  for English as a foreign language learning contexts where it can be quite \nchallenging to interact with native speakers or speakers with good command of English.  \n \nUsing Instagram as a mobile language learning tool is, of course, not with out issues. One \ndrawback that was frequently expressed especially in the qualitative data concerns the \nprevalence of informal language used on Instagram. Therefore, a number of ELLs had relatively \nnegative attitudes towards utilizing the application to improve grammar  knowledge or to \novercome structure-related mistakes. Given that, several ELLs suggested that Instagram should \nnot be the sole way of learning English in an informal way but can be a peripheral language \nlearning tool. In looking at other similar social networking studies (e.g., Mitchell, 2012), the same \nissue has been reported.  Another potential problem with Instagram is that it may not be an \noptimal mobile language learning method for contents or skills that are more cognitively \ndemanding. In such cases, learners might need well-designed mobile learning applications and \neven larger digital devices. \n \nBefore concluding, it is important to note that there are several limitations that should be kept \nin mind. First, even though the sample is considered to be representative of ELLs, a larger sample \nsize might have yielded more generalizable findings. However, considering the nature and the \nfocus of this study,  the current sample size  was adequate enough to provide  reliable and \nsignificant results. Second, only one type of social networking platform s was examined in this \nstudy. It is likely that ELLs, especially those with higher levels of digital literacy, might use other \nsites (e.g., Twitter and  Facebook) or mobile -assisted language learning tools (e.g.,  Duolingo, \nBabbel, and Busuu) in different and effective ways. Third, this small-scale study adapted a brief \nquestionnaire in order to reach more experienced Instagram users. Future studies might use a \nmore comprehensive survey to better measure language learners’ mobile language learning \norientations and habits. Further, MALL -oriented researchers might do well to focus on the \nrelationship between learner motivation and autonomy, and the use of MALL tools for long-term \nlanguage learning. \n \nYet, in spite of these limitations, the current study shed light on the fully learner-initiated and-\nled mobile language learning in informal settings, an area that we know so little about. In doing \nso, the current study showed that when used as a MALL tool, Instagram, and probably other \nsimilar social networking sites, have the potential to help language learners to improve overall \nlanguage skills in g eneral, and vocabulary and communication skills in particular , probably \nbecause social networking platforms can be readily utilized anywhere, anytime to increase the \namount of input and output in the target language.  Although English language learners’  \nexperiences in using Instagram as an informal language learning tool were largely positive, some \nconcerns were raised regarding that Instagram can also be appropriate  to employ in formal \nlanguage learning contexts probably because Instagram was not specially designed for \neducational purposes. Although social networking sites may not serve as panacea for language \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n320 \n \nlearning and teaching issues, they can serve as a bridge between formal and informal language \nlearning environments (Kukulska-Hulme, 2009) or as an effective peripheral language learning \ntool. Therefore, language teachers might consider supporting language learners to use available \nMALL applications and social networking platforms  as a language learning tool so that their \nexposure to the target language can be sustained even outside the classroom.  \n \n \nReferences \nAl-Ali, S. (2014). Embracing the selfie craze: Exploring the possible use of Instagram as a \nlanguage mLearning tool. Issues and Trends in Educational Technology, 2(2), 1-16. \nAlm, A. (2015). \"Facebook\" for Informal Language Learning: Perspectives from Tertiary \nLanguage Students. The EuroCALL Review, 23(2), 3-18. \nBlattner, G. & Fiori, M. (2009). Facebook in the language classroom: Promises and \npossibilities. International Journal of Instructional Technology and Distance \nLearning, 6(1), 17-28. \nChapelle, C. (1997). CALL in the year 2000: Still in search of research paradigms? Language \nLearning & Technology, 1(1), 21-35. \nChartrand, R. (2012). Social networking for language learners: Creating meaningful output with \nWeb 2.0 tools. Knowledge Management & E-Learning, 4(1), 97-101. \nCreswell, J. W. & Plano Clark, V. L. (2011). Designing and conducting mixed methods \nresearch (2nd ed.). Los Angeles: SAGE Publications. \nDörnyei, Z. (1994). Motivation and motivating in the foreign language classroom. Modern \nLanguage Journal, 78(3), 273-284. \nDörnyei, Z. & Taguchi, T. (2009). Questionnaires in second language research: Construction, \nadministration, and processing. London: Routledge. \nField, A. (2013). Discovering statistics using IBM SPSS statistics. London: Sage. \nGamble, C. & Wilkins, M. (2014). Student attitudes and perceptions of using Facebook for \nlanguage learning. Dimension, 49-72. doi: 10.7763/IJIET.2016.V6.820 \nGolonka, E. M., Bowles, A. R., Frank, V. M., Richardson, D. L., & Freynik, S. (2014). Technologies \nfor foreign language learning: a review of technology types and their effectiveness. \nComputer Assisted Language Learning, 27(1), 70-105.  \nGonulal, T. (2019). Missing data management practices in L2 research: The good, the bad and \nthe ugly. Erzincan University Education Faculty Journal, 21(1), 1-18. \nKabilan, M. K., Ahmad, N., & Abidin, M. J. Z. (2010). Facebook: An online environment for \nlearning of English in institutions of higher education? The Internet and Higher \nEducation, 13(4), 179-187. \nKim, E. Y., Park, S. M., & Baek, S. H. (2011). Twitter and implications for its use in EFL \nlearning. Multimedia Assisted Language Learning, 14(2), 113-137. \nKukulska-Hulme, A. (2009). Will mobile learning change language learning? ReCALL, 21(2), 157-\n165. \nKukulska-Hulme, A. (2012). Mobile-assisted language learning. In C. Chapelle (Ed.), The \nencyclopedia of applied linguistics (pp. 3701-3709). New York: Wiley. \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n321 \n \nKukulska-Hulme, A. & Shield, L. (2008). An overview of mobile assisted language learning: From \ncontent delivery to supported collaboration and interaction. ReCALL, 20(3), 271-289. \nLee, K. & Ranta, L. (2014). Facebook: Facilitating social access and language acquisition for \ninternational students? TESL Canada Journal, 31(2), 22-50. \nLomicka, L. & Lord, G. (2012). A tale of tweets: Analyzing microblogging among language \nlearners. System, 40(1), 48-63. \nLomicka, L. & Lord, G. (2016). Social networking and language learning. In F. Farr, & L. Murray \n(Eds.), The Routledge handbook of language learning and technology (pp. 255-268). New \nYork, NY: Routledge. \nMazer, J. P., Murphy, R. E., & Simonds, C. J. (2007). I'll see you on “Facebook”: The effects of \ncomputer-mediated teacher self-disclosure on student motivation, affective learning, \nand classroom climate. Communication Education, 56(1), 1-17. \nMitchell, K. (2012). A social tool: Why and how ESOL students use Facebook. Calico \nJournal, 29(3), 471-493. \nMompean, J. A. & Fouz-González, J. (2016). Twitter-based EFL pronunciation instruction. \nLanguage Learning & Technology, 20 (1), 166-190.  \nSchafer, J. L. & Graham, J. W. (2002). Missing data: our view of the state of the art. \nPsychological Methods, 7(2), 147-177. \nSolmaz, O. (2017). Autonomous language learning on Twitter: Performing affiliation with target \nlanguage users through# hashtags. Journal of Language and Linguistic Studies, 13(2), \n204-220. \nSolmaz, O. (2018). A critical review of research on social networking sites in language teaching \nand learning. Contemporary Educational Technology, 9(3), 315-330. \nStaples, S. & Biber, D. (2015). Cluster analysis. In Plonsky, L. (Ed), Advancing quantitative \nmethods in second language research. New York: Routledge. \nStatistica (2018a). Number of active monthly Instagram users from January 2013 to June 2018. \nRetrieved on 3 August 2018 from https://www.statista.com/statistics/253577/number-\nof-monthly-active-instagram-users/. \nStatistica (2018b). Leading countries based on number of Instagram users as of July 2018. \nRetrieved on 3 August 2018 from https://www.statista.com/statistics/578364/countries-\nwith-most-instagram-users/. \nStockwell, G. (2013). Technology and motivation in English-language teaching and learning. In \nE. Ushioda (Ed.), International perspectives on motivation: Language learning and \nprofessional challenges (pp. 156-175). Basingstoke, UK: Palgrave Macmillan. \nTaskiran, A. Gumusoglu, E. K., & Aydin, B. (2018). Fostering foreign language learning with \nTwitter: Reflections from English Learners. Turkish Online Journal of Distance \nEducation, 19(1), 100-116. \nUshioda, E. (2011). Language learning motivation, self and identity: Current theoretical \nperspectives. Computer Assisted Language Learning, 24(3) 199-210. \nUshioda, E. (2013). Motivation matters in mobile language learning: A brief commentary \nLanguage Learning & Technology, 17(3), 1-5. \n \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n322 \n \nAppendix A \nThe potentials of Instagram as a MALL Tool Survey \n \nA) Please fill out the following background information \n1. Age: _________   \n2. Gender: Male ____ Female ____ \n3. Country of origin: ________________ \n4. Mother tongue (first language): ________________  \n5. Year in college:  \n __Freshman    __Sophomore      __Junior      __Senior     __MA   __PhD       Other___ \n6. a. Major (e.g., TESOL, Engineering): ____________________ \nb. Minor: ____________________ \n7. Please circle your proficiency level for English in the following areas. \n                               Beginning                                                                                         Advanced \nReading         1                   2                   3                   4                   5                   6 \nWriting          1                   2                   3                   4                   5                   6 \nListening         1                   2                   3                   4                   5                   6 \nSpeaking         1                   2                   3                   4                   5                   6 \n8. Do you have an Instagram account? Yes ___ No___  \n9. What language is your Instagram account in? __First Language __English   Other_____ \n10. How long have you been using Instagram? \n__Less than 6 months      __6 months -1 year     __1-2 Years     __3-4 years  __5-7 years \n11. How often do you log into Instagram? \n __Every day    __3-4 Times a Week     __Once a week __Once a Month      Other___ \n12. How many hours do you spend on Instagram per day? ____ \n13. What language do you use the most to communicate on Instagram?  \n__First Language     __English    __Both first language and English   Other ___ \n14. Approximately what percentage of your communication on Instagram is in English? _____ \n15. Approximately what percentage of your followings is related to language learning? ______ \n \nB) Attitudes towards and perceptions of using Instagram     \n  \n          1 = Strongly Disagree  6 = Strongly Agree  \n1. Instagram is suitable for educational purposes. 1 2 3 4 5 6 \n2. Instagram is a good platform to practice writing in English. 1 2 3 4 5 6 \n3. Instagram is a good platform to read in English. 1 2 3 4 5 6 \n4. Instagram is a good platform to develop English communication skills. 1 2 3 4 5 6 \n5. Instagram is a good platform to overcome language mistakes. 1 2 3 4 5 6 \n6. Instagram is a good platform to learn new words in English. 1 2 3 4 5 6 \n7. Instagram is a good platform to improve English grammar knowledge. 1 2 3 4 5 6 \n8. Instagram is a good platform to improve overall English skills. 1 2 3 4 5 6 \n9. Instagram is a good platform to reach authentic English materials. 1 2 3 4 5 6 \n10. Instagram makes learning English more interesting. 1 2 3 4 5 6 \n11. Instagram makes learning English easier. 1 2 3 4 5 6 \n12. Instagram increases my motivation to communicate using English. 1 2 3 4 5 6 \n13. Instagram increases my motivation to read English materials. 1 2 3 4 5 6 \n14. Instagram increases my motivation to write in English. 1 2 3 4 5 6 \n15. Instagram encourages me to spend more time learning English. 1 2 3 4 5 6 \nCONTEMPORARY EDUCATIONAL TECHNOLOGY, 2019, 10(3), 309-323 \nDOI: https://doi.org/10.30935/cet.590108 - TYPE: Research Article \n323 \n \n \nC) Open-ended questions: \n1. As an experienced user of Instagram for language learning purposes, could you briefly describe \nyour experiences? \n2. Do you think Instagram can be a useful pedagogical tool in English classrooms? Why? Or \nwhy not? \n3. What are your opinions regarding learning English through such social networking \nplatforms?  \n \n \nAppendix B \nDendrogram \n \n \n \n \nCorrespondence: Talip Gonulal, Assistant Professor, Department of Foreign Languages \nTeaching, Faculty of Education, Erzincan Binali Yildirim University, Erzincan, Turkey \n \n",
  "topic": "Ell",
  "concepts": [
    {
      "name": "Ell",
      "score": 0.7930564880371094
    },
    {
      "name": "Vocabulary",
      "score": 0.6080925464630127
    },
    {
      "name": "Thematic analysis",
      "score": 0.5772095918655396
    },
    {
      "name": "Language acquisition",
      "score": 0.551733672618866
    },
    {
      "name": "Mathematics education",
      "score": 0.5118881464004517
    },
    {
      "name": "Qualitative property",
      "score": 0.5028685927391052
    },
    {
      "name": "Computer science",
      "score": 0.5009706020355225
    },
    {
      "name": "Multimethodology",
      "score": 0.49327415227890015
    },
    {
      "name": "Descriptive statistics",
      "score": 0.472025066614151
    },
    {
      "name": "Psychology",
      "score": 0.4209533631801605
    },
    {
      "name": "Qualitative research",
      "score": 0.4151044487953186
    },
    {
      "name": "Multimedia",
      "score": 0.3481445908546448
    },
    {
      "name": "Vocabulary development",
      "score": 0.326926052570343
    },
    {
      "name": "Teaching method",
      "score": 0.28585296869277954
    },
    {
      "name": "Sociology",
      "score": 0.16033804416656494
    },
    {
      "name": "Linguistics",
      "score": 0.13278347253799438
    },
    {
      "name": "Mathematics",
      "score": 0.08890530467033386
    },
    {
      "name": "Statistics",
      "score": 0.0
    },
    {
      "name": "Philosophy",
      "score": 0.0
    },
    {
      "name": "Machine learning",
      "score": 0.0
    },
    {
      "name": "Social science",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I176037994",
      "name": "Erzincan Binali Yıldırım University",
      "country": "TR"
    }
  ]
}