{
  "title": "iAgent: When AI Meets Mobile Agent",
  "url": "https://openalex.org/W2955615712",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A5101434488",
      "name": "Jiayi Lu",
      "affiliations": [
        "Huazhong University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5045486208",
      "name": "Wenjing Xiao",
      "affiliations": [
        "Huazhong University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5084444817",
      "name": "Enmin Song",
      "affiliations": [
        "Huazhong University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5085933596",
      "name": "Mohammad Mehedi Hassan",
      "affiliations": [
        "King Saud University"
      ]
    },
    {
      "id": "https://openalex.org/A5089600920",
      "name": "Ahmad Almogren",
      "affiliations": [
        "King Saud University"
      ]
    },
    {
      "id": "https://openalex.org/A5027778889",
      "name": "Ayman Altameem",
      "affiliations": [
        "King Saud University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2786134370",
    "https://openalex.org/W2399345027",
    "https://openalex.org/W2791694051",
    "https://openalex.org/W2963889363",
    "https://openalex.org/W2884532903",
    "https://openalex.org/W4307979480",
    "https://openalex.org/W2166130341",
    "https://openalex.org/W2624941835",
    "https://openalex.org/W2888704015",
    "https://openalex.org/W2050212562",
    "https://openalex.org/W2790975665",
    "https://openalex.org/W2763913275",
    "https://openalex.org/W2946933691",
    "https://openalex.org/W2799126587",
    "https://openalex.org/W2908084908",
    "https://openalex.org/W2792318059",
    "https://openalex.org/W2766940648",
    "https://openalex.org/W2966935339",
    "https://openalex.org/W2908368370",
    "https://openalex.org/W2889386526",
    "https://openalex.org/W2528425633",
    "https://openalex.org/W2131235803",
    "https://openalex.org/W2799932776",
    "https://openalex.org/W2942476636",
    "https://openalex.org/W2590418862",
    "https://openalex.org/W2924972509",
    "https://openalex.org/W2913296295",
    "https://openalex.org/W2756446956",
    "https://openalex.org/W2790688089",
    "https://openalex.org/W2906272523",
    "https://openalex.org/W2320517083",
    "https://openalex.org/W2918087949",
    "https://openalex.org/W2733384076",
    "https://openalex.org/W2795613961",
    "https://openalex.org/W2804426336",
    "https://openalex.org/W2468438421",
    "https://openalex.org/W6759697723",
    "https://openalex.org/W2289646899",
    "https://openalex.org/W2895298544",
    "https://openalex.org/W1720804347",
    "https://openalex.org/W2338037132",
    "https://openalex.org/W2122410182",
    "https://openalex.org/W2915149867",
    "https://openalex.org/W2623902153"
  ],
  "abstract": "The past few decades have seen the rapid development of artificial intelligence (AI) technology in diverse industries. Inspired by the fact that an agent is the central part of AI, we combine AI with the technology of the mobile agent. A mobile agent used in wireless sensor networks (WSNs) is popular for its mobility, executability, and autonomy. To improve the intelligence of the mobile agent, we proposed a conceptual theoretical framework named iAgent, where i means intelligent, and the agent refers to the mobile agent. Four designs of iAgent are detailed. Compared with the old mobile agent, the iAgent has a learning ability, which means that it can dynamically plan the path according to the external environment in order to reduce energy consumption. Based on iAgent, we also proposed a method to determine the number of iAgents and their visiting areas in a multi-iAgent WSN environment. The extensive simulation indicates that the multi-iAgent algorithm can significantly improve the performance of the WSNs, especially in saving energy and balancing network load.",
  "full_text": "SPECIAL SECTION ON ARTIFICIAL INTELLIGENCE AND COGNITIVE\nCOMPUTING FOR COMMUNICATION AND NETWORK\nReceived June 13, 2019, accepted June 21, 2019, date of publication July 4, 2019, date of current version August 5, 2019.\nDigital Object Identifier 10.1 109/ACCESS.2019.2926286\niAgent: When AI Meets Mobile Agent\nJIAYI LU1, WENJING XIAO\n 1, ENMIN SONG1, MOHAMMAD MEHEDI HASSAN\n2,\nAHMAD ALMOGREN\n 2, AND AYMAN ALTAMEEM3\n1School of Computer Science and Technology, Huazhong University of Science and Technology, Wuhan, China 430074\n2College of Computer and Information Sciences, King Saud University, Riyadh 11543, Saudi Arabia\n3Department of Natural and Engineering Sciences, College of Applied Studies and Community Services, King Saud University, Riyadh 11543, Saudi Arabia\nThere is’t any funding or ﬁnancial support. Corresponding author: Enmin Song (esong@hust.edu.cn)\nThis work was supported by the Deanship of Scientiﬁc Research at King Saud University under Grant RGP-1437-35.\nABSTRACT The past few decades have seen the rapid development of artiﬁcial intelligence (AI) technology\nin diverse industries. Inspired by the fact that an agent is the central part of AI, we combine AI with the\ntechnology of the mobile agent. A mobile agent used in wireless sensor networks (WSNs) is popular for\nits mobility, executability, and autonomy. To improve the intelligence of the mobile agent, we proposed a\nconceptual theoretical framework named iAgent, where i means intelligent, and the agent refers to the mobile\nagent. Four designs of iAgent are detailed. Compared with the old mobile agent, the iAgent has a learning\nability, which means that it can dynamically plan the path according to the external environment in order\nto reduce energy consumption. Based on iAgent, we also proposed a method to determine the number of\niAgents and their visiting areas in a multi-iAgent WSN environment. The extensive simulation indicates that\nthe multi-iAgent algorithm can signiﬁcantly improve the performance of the WSNs, especially in saving\nenergy and balancing network load.\nINDEX TERMS Mobile agent, artiﬁcial intelligence, wireless sensor network.\nI. INTRODUCTION\nWSNs originate from applications in the military ﬁeld and\nhave characteristics of self-organization, high fault-tolerance,\nwide coverage, high detection accuracy and so on. Now it\nhas been widely used in agriculture, forestry monitoring,\nmedical and health ﬁelds [1], [2]. Compared with traditional\nwireless communication networks that focus on the quality of\nwireless communication service, WSNs concentrate on how\nto improve energy efﬁciency due to its limited energy and\nbandwidth resources [3]. As the scale of the WSN becomes\nlarger and larger, the energy consumption of the traditional\nclient/server computing model has increased and the delay\ngrows longer due to the centralized data processing by sensor\nnodes. Another important aspect of constraint is that sensor\nnodes have limited energy and cannot deal with multiple\napplications. To solve these problems, Chen et al. [4] pro-\nposed a mobile-agent-based WSN model for reducing the\nenergy consumption in a planar sensor network architecture.\nThe concept of the mobile agent was ﬁrst proposed by\nGeneral Magica in a commercial mobile agent system called\nTelescript. In WSNs, the mobile agent is allowed to carry\nprocessing codes for a speciﬁc task. For instance, the mobile\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Yin Zhang.\nagent can be a vehicular terminal equipped with communica-\ntion and computing power [5]. It automatically migrates from\none sensor node to another sensor node according to an estab-\nlished route and performs a speciﬁed task on the target node.\nReference [6] proposed a route optimization method based on\nreinforcement learning. This kind of WSNs is efﬁcient and\nrobust for collaborative signal and information processing\namong multiple sensor nodes. Another signiﬁcant advantage\nof the mobile agent is that it reduces the risk of network\ncrashes when some of the sensor nodes are out of power.\nCurrent researches on mobile-agent-based WSNs mainly\nfocus on routing path planning. Several researchers designed\ntheir route algorithms based on clustering approaches for\nefﬁcient data aggregation [7], [8]. However, most of these\nstudies have suffered from an unbalanced load, large delays,\nand weak reliability [9]. A considerable amount of literature\nadopts itinerary planning approaches based on some classic\nroute protocol [10], [11]. A major problem with this kind of\napplication is the lack of intelligence [12].\nIntelligence refers to the degree to which one can under-\nstand its own internal state and external environment, which\nis mainly reﬂected in three aspects: reaction, adaptation, and\nactive capability [13]. An agent can react means that it has\nan autonomous choice to execute an action when it wants to.\nThe adaptation implies the ability to learn. An active agent\n97032 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see http://creativecommons.org/licenses/by/4.0/VOLUME 7, 2019\nJ. Luet al.: iAgent: When AI Meets Mobile Agent\ncan decide if it is necessary to adopt new or different\nintentional actions by recognizing the need to achieve goals.\nWith many successful applications of artiﬁcial intelli-\ngence in various ﬁelds, such as UA V scheduling [14], [15],\nSmart city services [16], [17], wireless sensor network [18],\nemotion recognition [19], [20], healthcare system [21]–[24],\napplying AI techniques to mobile agents has become a new\nidea and has a promising application prospect. Reference [25]\nimproved the Q-learning algorithm to overcome the dimen-\nsionality problem in a multi-agent system. Reference [26]\nreviewed recent studies in mobile-agent-based healthcare to\nprovide a deep insight into future applications. And wireless\ncommunication technology based on edge computing is pro-\nposed in [27]. [28] presented a mobile-agent-based system\nfor assigning different modular robots to a ﬁxed number\nof tasks using the ant colony algorithm. Reference [29] has\ndeveloped a framework for information fusion and estimation\nover distributed multi-agent networks, which can improve the\nperception and intelligence of mobile agents. While all of the\nabove work is creative, there is still a long way to go from AI.\nThe deﬁnition of artiﬁcial intelligence has been the sub-\nject of intense debate for decades of years. Computers are\nfaster and more accurate than human brains, but few peo-\nple say that computers have more intelligence than humans.\nSince the Industrial Revolution, human beings have been\nthinking about this problem. In 1948, Alan Mathison Tur-\ning outlined the ﬁeld of artiﬁcial intelligence for the ﬁrst\ntime [30]. He conceived an abstract device called Turing\nMachine, which could perform calculations that any human\nmathematician could perform with the aid of algorithms in\ninﬁnite time, power consumption, paper and pen, and per-\nfect concentration. Artiﬁcial intelligence refers to more than\nthe computing ability, which needs more information about\nworld cognition and autonomy of choice [31].\nWith the development of artiﬁcial intelligence technology,\nmany problems that need to be solved urgently can be opti-\nmized and solved [32]–[34]. In WSNs, mobile agents corre-\nspond to agents in AI. Agents constantly perform actions to\nreceive the status and rewards from the environment. Mobile\nagents moving in the environment will inevitably affect the\nstate of the external environment. Therefore, mobile agents\nneed to change their strategies in real time. This paper com-\nbines the two, called iAgent, to improve the intelligence of\nthe mobile agent. The key contributions of this article can be\nlisted as follows.\n1) Artiﬁcial intelligence technology is applied to mobile-\nagent-based wireless sensor networks, and an iAgent\nframework is proposed to increase the intelligence of\nmobile agents in routing. We design four iAgents in\nwireless sensor networks.\n2) A new multi-iAgent algorithm is applied to reduce\nthe energy consumption of the mobile-agent-based\nWSN and improve the lifetime of the wireless sensor\nnetwork.\n3) We conduct a simulation experiment to compare the\nperformance of four iAgents and energy-efﬁciency of\nFIGURE 1. Mobile-agent-based wireless sensor network.\nour proposed multi-iAgent algorithm.\nThe remaining part of this paper is arranged as follows.\nSection II provides a brief introduction of the mobile agent\nin WSNs and then goes on to four types of iAgents when\nmobile agent combines with AI. Section III proposes a new\nmulti-iAgent algorithm. Section IV is the experimental part.\nFour iAgents are compared and the multi-iAgent algorithm is\ndemonstrated to be effective.\nII. DESIGNS OF IAGENT\nSensor nodes, sink nodes, management nodes and mobile\nagents form a mobile-agent-based WSN by self-organization,\nas shown in Fig 1. A mobile agent starts from the sink\nnode, migrates autonomously in the WSN to collect data\nand returns to the original sink node ﬁnally. The routing\nalgorithm of the mobile agent is implemented in the network\nlayer. The structure of a mobile agent has four attributes,\nas shown in the lower right corner of Fig 1. Identiﬁcation is\nunique for each mobile agent. The data part stores the data\nthe mobile agent collects from source nodes. Itinerary refers\nto the route path, which is the most important part. Differ-\nent mobile agents carry different processing codes to ﬁnish\ndifferent tasks, which are written before a mobile agent is\nsent out.\nThe main reason that mobile-agent-based WSNs are more\nefﬁcient is that mobile agents have the ability to plan routes.\nSource nodes store the collected data locally. When mobile\nnodes reach the communication range of sensor nodes, sensor\nnodes transmit data to mobile nodes without using interme-\ndiate forwarding nodes. This can minimize the energy con-\nsumption of data forwarding and ensure the reliability of data.\nIn this case, the main problem is to get the optimal trajectory\nof mobile agents to ensure coverage of all source nodes.\nVOLUME 7, 2019 97033\nJ. Luet al.: iAgent: When AI Meets Mobile Agent\nAlgorithm 1Simple-Reﬂex iAgent\nInitialize state-action rules\nfor t =1,2,...,N do\nperceive current state st\nget action at of st by state-action rules\nend for\nWSNs are designed to monitor the physical environment\nand gather the information that users are interested in. The\nlimited capacity and power supply of sensor nodes make\nit unsuitable for WSNs to be a general service network\nsystem. Plus the strict real-time requirements of monitoring\napplications, WSNs must be closely coupled with speciﬁc\napplications in order to design an efﬁcient application system.\nCompleting different networks requires dispatching different\nagents without changing the procedures of sensor nodes.\nAiming at different application requirements and combin-\ning artiﬁcial intelligence [35], we proposed four different\nagent programs for the mobile agent in WSNs to realize the\nmapping from perception to action.\nA. SIMPLE-REFLEX IAGENT\nThis is the simplest iAgent, usually used in small-scale\nWSNs. The tasks issued by sink nodes are so easy that the\naction of iAgent can be decided by a series of rules. These\nrules have to do with the changes in WSNs, thus restricting\nthe scale of WSNs. The simple-reﬂex iAgent can observe the\noutside environment and make a decision based on the current\nstate. For example, the rule can be that when the iAgent\narrives at a source node and ﬁnishes its task, it will search\nthe nearest unvisited source node as the next node. Once the\niAgent perceives that it has arrived at an unvisited source\nnode, it will start to carry out the collecting job. Before the job\nis done, the state is set to have no impact on the iAgent. That\nis to say, as soon as the iAgent completes the task, it will look\naround and update its current state. The program is shown in\nAlgorithm 1.\nThe route of the simple-reﬂex iAgent is ﬁxed, pre-\ndictable and controllable, thus resulting in more stable WSNs.\nHowever, this kind of iAgent only considers the current state,\nwhich will easily lead to many problems such as data load\nimbalance, delay, and security. The other disadvantage is that\nthe iAgent moves along speciﬁed lines, leading to high energy\nconsumption in local areas of the WSN. When some nodes\nhave problems, it may even fall into endless circles.\nB. MODEL-BASED IAGENT\nThe premise of simple-reﬂex iAgent is to be able to predict\nall possible changes in order to make rules, but this is impos-\nsible in practical applications. In WSNs, though the envi-\nronment is not fully observable, the iAgent can enhance its\nperception by inference from knowledge base which stores\nthe past experience. To improve the perception, multiple\niAgents can also share their individual knowledge locally\nvia existing self-organized communication technologies [36].\nAlgorithm 2Model-Based iAgent\nInitialize state-action rules, environment model E\nfor t =1,2,...,N do\nperceive current state st\nget new state s′\nt from E\nget action at of s′\nt by state-action rules\nupdate E\nend for\nThe inferred information can be divided into two parts. One\nis about how the world changes in the absence of the iAgent.\nFor example, source nodes will generate data by observing\nthe outside physical environment ceaselessly and weather\nmay affect the quality of data. These are all unmeasurable\nfactors and can only be obtained by rational thinking. The\nother part is the inﬂuence of the iAgent on the environment.\nThe iAgent needs to know what the world will be once it\ntakes action. If it moves to the node i and collects data,\nthe environment will become that the node i is marked visited.\nOverall, an environment model is established to get these\ninferences from the knowledge base and then an action is\ndecided based on the output of the model. The iAgent which\nhas the environment model is called model-based iAgent,\nas shown in Algorithm 2.\nModel-based iAgent can not only perceive the real-time\ninformation of monitoring nodes but also learn from the past\nexperience by the environment model. For example, the den-\nsity of sensor nodes will affect the quality of communica-\ntion in WSN, when iAgent passes through congested areas\nor areas with poor signals, it will automatically decelerate\nand prolong transmission time. Another example is to adjust\nthe motion scheme according to the communication range\nof monitoring nodes which set the power of the communi-\ncation module to different levels according to their resid-\nual energy. When the communication range of each node\nchanges, the route of the iAgent can be adjusted in time. This\nmethod can ensure the integrity of data collection and reduce\nenergy consumption.\nC. GOAL-BASED IAGENT\nDifferent tasks of different applications have different\nrequirements for data acquisition. If periodic monitoring data\nsuch as temperature and humidity are needed, source nodes\nwill temporarily store data locally to reduce communica-\ntion energy consumption and prolong network life. For high\nreal-time data, such as environmental detection, battleﬁeld\nassessment, and other applications, it is necessary to collect\ndata ceaselessly. Model-based iAgent cannot adjust to differ-\nent tasks, so a goal-based agent is proposed, which sets a\ngoal according to the tasks announced by sink nodes, such\nas minimizing energy consumption or gathering data from\nseveral nodes, as shown in Algorithm 3.\nCompared with the model-based iAgent, the goal-based\niAgent has added a goal. Even at the same state, the iAgent\n97034 VOLUME 7, 2019\nJ. Luet al.: iAgent: When AI Meets Mobile Agent\nAlgorithm 3Goal-Based iAgent\nInitialize environment model E, action model A, goal G\nfor t =1,2,...,N do\nperceive current state st\nget new state s′\nt from E\nget candidate actions ˆat of s′\nt from A\nget action at from ˆat by G\nupdate E, A\nend for\ncan make different choices according to different targets,\na goal can guide the iAgent toward the correct direction.\nSupposing the goal is to traverse all source nodes and collect\ndata, the iAgent will tend to move to as many unvisited source\nnodes as possible. If the goal is changed to minimize energy\nconsumption, then the iAgent may learn to choose the action\nthat minimizes energy consumption.\nAnother difference to the previous iAgent is the way that\nthe goal-based iAgent chooses an action. The simple-reﬂex\niAgent and the model-based iAgent follow the established\nrules, while the goal-based iAgent has an action model. The\naction model is built to ensure that the iAgent has optional\nchoices. Combined with the goal, the goal-based iAgent can\nchoose the most suitable action from the available actions\nto achieve the goal. The objective is optimized by updat-\ning the environment model and the action model. Although\ngoal-based iAgent is sometimes inefﬁcient, it can increase\nﬂexibility which means that there is no need to change the\ncode for different tasks. At this stage, search and plan are\ncommonly used.\nD. UTILITY-BASED IAGENT\nThe iAgent in WSNs often carries more than one goal to\nachieve. For example, sometimes they not only need to\nreduce energy consumption but also hope to collect more\ndata, and safety is a considerable problem. It is common that\nthese goals are interrelated. When there are conﬂicting goals,\nwe weight these goals together as a utility. The aim of this\niAgent is to maximize the utility of the goals.\nThe utility-based iAgent is similar to the goal-based iAgent\nexcept for the ways of choosing actions. The utility-based\niAgent concentrates on the utility which reﬂects the perfor-\nmance of the iAgent more comprehensively. If all the goals\nare consistent and coordinate with each other, the perfor-\nmance will be improved greatly. The utility function can\nalso be learned like the action model and the environment\nmodel. The iAgent updates the utility model to understand\nwhat beneﬁt it will get in such a state if it takes some action.\nIn WSNs, there are various types of data that need\nto be collected in the same monitoring range. Therefore,\niAgents in the network will undertake a variety of monitoring\ntasks. Obviously, different monitoring objects have different\nrequirements for real-time data transmission. In multi-task\nWSNs, the usage of sensor networks can be changed by\nreallocating targets. If the data collected by sensor nodes\nAlgorithm 4Utility-Based iAgent\nInitialize environment model E, action model A, utility\nmodel U\nfor t =1,2,...,N do\nperceive current state st\nget new state s′\nt from E\nget candidate actions ˆat of s′\nt from A\nget action at from ˆat by U\nupdate E, A, U\nend for\nneed an immediate response, such as ﬁre warning, the data\nwill be sent back to sink through the real-time routing in the\nnode routing table to meet the real-time requirements of the\nnetwork. The algorithm of utility-based iAgent is shown in\nAlgorithm 4.\nWe summarize these four kinds of iAgents for selecting\nactions, as shown in Fig 2. What’s in the gray frame is\nthe iAgent. The four iAgents interact with the environment.\nAll iAgents have sensors and actuators that are physical\ncomponents. They perceive the environment by sensors and\nmake actions by actuators. Different colors represent different\niAgents. The black line is the common ﬂow that all iAgents\nwill go through except for the part of the knowledge base\nand the environment model which are not possessed by the\nsimple-reﬂex iAgent.\nIntuitively, the simple-reﬂex iAgent is easiest to implement\nbut the hardest to apply in real life for making rules that\nmap states to actions is not an easy task. The model-based\niAgent makes up for this deﬁciency and builds an environ-\nment model to reason the unknown information. In addi-\ntion to the environment, the goal of the iAgent is critical\nto assist in completing tasks. The goal-based iAgent acts\nto achieve the goal. The one-goal situation is rare, most\noccasions have multiple goals, thus the utility-based iAgent\nis proposed to balance these goals so that the utility can be\nmaximized.\nEach of the four iAgent has the ability to learn and can\nchoose the best actions through learning. The environment\nmodel, the action model, and the utility model are the com-\nponents that can learn from the knowledge base. It is hard to\nconclude which is the best since only a speciﬁc application\nhas the best iAgent.\nIII. MULTIPLE IAGENTS\nThough the iAgent achieves good performs in WSNs, when\nthe network scale becomes larger, some problems have arisen\nas below.\n• The iAgent has to visit all source nodes in one round,\nwhich increases the data delay.\n• Data load is unbalanced. Sensor nodes located at the\nend of the path need more power to receive and transmit\nbecause the size of the mobile agent is larger than that at\nthe start of the path.\n• It is hard to guarantee security. When the gathered data\nVOLUME 7, 2019 97035\nJ. Luet al.: iAgent: When AI Meets Mobile Agent\nFIGURE 2. Four designs of iAgent.\nbecome bigger and bigger, the cost to ensure safety has\nincreased.\nTaking these problems into consideration, most iAgent-\nbased WSNs are designed to be multi-iAgent-based WSNs.\nIn multi-iAgent-based WSNs, each iAgent carries a task,\nstarts from the sink node, accesses a series of source nodes\nthat are assigned to the iAgent before the trip, and returns\nto the starting point eventually. It can also be regarded as an\niterative version of single-iAgent-based WSNs. It is usually\ndivided into the following steps.\n1) Determine the number of iAgents N.\n2) Divide the source nodes into N groups.\n3) Assign the groups to corresponding iAgents.\n4) Determine the visiting order of the source nodes for each\niAgent.\nThe last step can be regarded as the routing procedure of\nsingle iAgent as mentioned before. We can choose different\ntypes of iAgents to execute different tasks. The third step\nis taken after the source nodes are grouped. For the ﬁrst\nand second steps, we propose a method to decide the number\nof iAgents and a cluster-based algorithm to divide the areas\ninto several regions for iAgents.\nThe number of the iAgents is restricted to many fac-\ntors such as the iAgents’ physical capabilities, the size of\nthe deploy area, the number of the source nodes, the size\nof the generated data by source nodes, the communication\nquality and so on. Here we choose several key elements\nx1,x2,..., xm to build a linear model that outputs the number\nof the iAgents. The features of the model are designed accord-\ning to a speciﬁc situation. The linear model tries to learn a\nlinear combination of the features to predict the number of\nthe iAgents, that is,\nL =α0 +α1x1 +α2x2 +... +αmxm (1)\nTherein α1,α2,...,α m represent the importance of the\nattributes in prediction. α0 is added as bias. These parameters\ncan be estimated by the least square method.\nThe training data are produced by many past experiences.\nBefore the iAgent sets out from the sink node, the linear\nmodel has been trained for several iterations and has achieved\na certain degree of reliability. After the iAgent returns to the\nsink node, its itinerary can be added to the training materials\nto update the model.\nThe second step is to divide the source nodes into N\ngroups. The main criterion for partition is the angle θ,\nas depicted in Fig 3. Establishing a coordinate system,\nwhat we want to get for each source node is the angle\nbetween the y-axis and a straight line connecting the sensor\nnode and the source node. Then we can sort the source\nnodes by small to large order of the angle. Source nodes\nwith similar angles are grouped together no matter how far\nthey are. Once the groups of source nodes are determined,\nwe can assign source nodes in the same group to the same\niAgent.\nIt is expected that after collecting data from distant nodes,\nthe path can be shorter so that less energy is spent on the\n97036 VOLUME 7, 2019\nJ. Luet al.: iAgent: When AI Meets Mobile Agent\nFIGURE 3. Multi-iAgent wireless sensor network.\nAlgorithm 5Multiple Iagent Algorithm\nInput sink node ( x0,y0), source nodes\nfor i =1,2,..., M do\n1x =xi −x0\n1y =yi −y0\nθi =arccos( 1x√\n1x2+1y2 )\nend for\nsort the source nodes by θi\ntrain a linear model L =∑m\ni αixi\nget the number of iAgent N from L\nfor i =0,1,2,..., N −1 do\nchoose source nodes i ×⌊M\nN ⌋,..., (i +1) ×⌊M\nN ⌋\nperform single-iAgent algorithm\nend for\nroad. It means that the routing path from the sink node to the\nfarthest node is preferably a straight line. Thus nodes with\nsimilar angles tend to be grouped together.\nThe algorithm combining the ﬁrst step and the second step\nis as follows.\nIV. SIMULATION AND PERFORMANCE EVALUATION\nWe have established a simulation system to simulate the\nWSN environment. They are made up of a set of sensor\nnodes, a sink node, and multiple iAgents. The purpose of\nour experiment is to demonstrate the energy-effective per-\nformance of our proposed methods. There are two groups of\nexperiments. One is to compare four single iAgents includ-\ning simple-reﬂex iAgent, model-based iAgent, goal-based\niAgent, and utility-based iAgent. The other is to show the\nadvantages of the multi-iAgent system over the single-iAgent\nsystem.\nTABLE 1. The main parameter settings.\nA. SIMULATION SETTING\nDue to the high cost and difﬁculty of deploying large-scale\nWSNs, most of the current research work on WSNs is carried\nout in the simulation environment. In our experiment, the\nfollowing assumptions are made.\n• The sensor nodes are ﬁxed all the time.\n• Each node has the same communication capability and\ninitial energy and knows its location information.\n• The sink node knows the information of source nodes.\n• The sensor nodes are independent of each other.\n• The iAgents act independently and do not inﬂuence each\nother.\n• There are no overlapping sensor nodes.\nThe experiments are conducted in a square area of 500 m×\n500m. The sink node is situated in the right center edge of the\nmonitoring region. The sensor nodes are randomly deployed\nbefore the simulation begins and do not move during the\nexperiment. Each source sensor generates the same amount\nof data.\nThe iAgent has localization function, so it knows where it\nis. It gathers data generated by sensor nodes in a certain range\nrather than collecting data from the environment. Starting\nfrom the sink node, the iAgent collects data from source\nnodes by the multi-hop method. Eventually, the iAgent will\ncome back to the base node to hand the data to the sink\nnode. When it is at the sink node, it can supplement energy,\nso the energy is regarded as inﬁnite. The initial size of a\nmobile agent is 1K bytes. The parameters are as summarized\nin Table 1.\nWe use energy consumption as a metric to compare differ-\nent methods. The energy consumption refers to the sum of\nenergy consumed during transmission and receiving in one\nround. In the multi-iAgent environment, the energy consump-\ntion of each iAgent is added together as the total energy con-\nsumption. Since the sink node is thought to have a sufﬁcient\nenergy supply, the energy consumption of the sink node can\nbe ignored. The WSN is affected by many factors, we choose\nthe number of source nodes and the size of the sensed data\nto observe their effect on energy consumption. The number\nVOLUME 7, 2019 97037\nJ. Luet al.: iAgent: When AI Meets Mobile Agent\nFIGURE 4. Comparison of energy consumption by the number of source\nnodes.\nof source nodes is increased to show the trend of energy con-\nsumption. We also change the size of the sensed data packets\nat each sensor to make comparisons. To make the results more\nintuitive, two routing diagrams of the single-iAgent method\nand the multi-iAgent method are plotted.\nB. COMPARISON OF FOUR IAGENTS\nIn this section, we compare the energy consumption of the\nfour iAgents by different numbers of source nodes and differ-\nent sizes of the sensed data packet. There are at least 5 source\nnodes, then 10 source nodes, and from 10 source nodes,\nwe increase to 80 source nodes in 10 intervals. The size of\nthe sensed data packet starts at 0.5K bytes, then increases to\n1K bytes, and then increases by the step size of 1kbytes. The\nlargest size of the packet can be 8K bytes. The experiment\nresults are shown in Fig 4 and Fig 5.\nFrom the above two ﬁgures, we can infer that the\nsimple-reﬂex iAgent consumes the most energy. The per-\nformance of the model-based iAgent is at the medium level\nof the four iAgents. The goal-based iAgent outperforms\nother iAgents in most situations, probably because that the\ngoal-based iAgent targets at minimizing the energy con-\nsumed. The energy consumption is one part of the objects\nof the utility-based iAgent, it is not devoted to minimizing\nenergy consumption. What’s more, the utility-based iAgent\nis easily affected by other things, this type of iAgent may be\nunstable in terms of energy consumption.\nIn Fig 4, energy consumption increases as the number of\nsource nodes increases. When the number of source nodes is\nlower than 30, the performance of the four iAgents is com-\nparable. But when the number of source nodes exceeds 30,\nthe energy consumption of the simple-reﬂex iAgent begins\nto increase sharply, and the other three methods are left far\nbehind. This is because the simple-reﬂex iAgent requires us\nto specify rules beforehand. However, as the source nodes\nincreases, the network becomes more and more complex, it is\ndifﬁcult for us to observe all the cases, so this method begins\nto show deﬁciencies.\nThe trend of energy consumption in Fig 5 is consistent\nwith that in Fig 4. As the amount of sensed data in the\nWSN increases, the energy consumption becomes larger\nFIGURE 5. Comparison of energy consumption by the size of sensed data.\nand larger. Except for utility-based iAgent, the energy con-\nsumed by the other three iAgents is linearly related to the size\nof the perceived data packet. The goal-based iAgent can be\nsaid to be an improved version of model-based iAgent for it\nadds a goal to make iAgent act purposefully.\nAlthough these four iAgents have obvious advantages and\ndisadvantages in our simulation experiments, the model-\nbased iAgent is often the ﬁrst choice for many WSNs\nbecause of its simple and fast characteristics in practical\napplication. The simple-reﬂex iAgent can have very good\nresults when the state-action rules are carefully designed.\nFrom simple-reﬂex iAgent, model-based iAgent, goal-based\niAgent to utility-based iAgent, the complexity gradually\nincreases. In practice, it is still necessary to choose the\nproper iAgent according to the speciﬁc scenario design\nrequirements.\nC. COMPARISON OF SINGLE-IAGENT SYSTEM\nAND MULTI-IAGENT SYSTEM\nTo demonstrate the performance of the multi-iAgent\nalgorithm, we compare it with the single-iAgent algorithm.\nTo study the impact of the number of source nodes on energy\nconsumption, We increase the number of source nodes from\n10 to 80 by steps of 10 under the condition that the size of the\nsensed data packet is 4K bytes. When the source nodes are\nﬁxed, we change the size of the sensed data to compare two\nalgorithms. The results are shown in Fig 6 and Fig 7.\nIn Fig 6, it is obvious and normal that when the number\nof source nodes increases, the energy consumption grows\nhigher. When the number of source nodes is ﬁxed, the single-\niAgent always performs better than multi-iAgent except when\nthe number of source nodes is below 10. Inferring from the\nmulti-iAgent algorithm, we can ﬁnd that when the number of\nsource nodes is below 10, the number of iAgents determined\nby the multi-iAgent algorithm is 1, so the performance of the\ntwo are the same. At ﬁrst, the gap between the two sides was\nnot obvious. But when source nodes increase, the gap grows\nlarger. The reason may be that the accumulated energy will\ncost more energy.\nIn Fig 7, the multi-iAgent always consumes less energy\nthan the single-iAgent. Even when the sensor data is\n97038 VOLUME 7, 2019\nJ. Luet al.: iAgent: When AI Meets Mobile Agent\nFIGURE 6. Comparison of energy consumption by the number of source\nnodes.\nFIGURE 7. Comparison of energy consumption by the size of sensed data.\nvery small, the energy consumption of multi-agent is obvi-\nously larger than that of single-iAgent, and the gap between\nthem is widening with the increase of sensor data.\nD. ROUTING DIAGRAMS\nTo make it clear, we plot the routing diagrams of the two\nalgorithms, as depicted in Fig 8 and Fig 9. The number of\nsources node is 40 and the size of the sensed data for each\nsource node is 4K bytes. The right blue point represents the\nsink node, and there are 1000 sensor nodes in gray color in\nthe ﬁgure. The red ones are source nodes. Each iAgent starts\nfrom the sink node, collects data from the source nodes and\nﬁnally returns to the sink node.\nThe energy consumption for the single-iAgent WSN and\nthe multi-iAgent WSN are 15.1J and 4.7J, respectively. Not\nonly the energy consumption of the single-iAgent is higher\nthan that of the multi-iAgent, but the sum of the routing\nlengths in the single-iAgent WSN is also longer than that\nin the multi-iAgent WSN. So it can be inferred that the\nrouting length and the energy consumption have a positive\ncorrelation.\nDue to the limited energy of sensor nodes, energy saving\nis the most important task of WSNs. From the above routing\ndiagram, we can reduce energy consumption by reducing the\nlength of the routing, or we can send an appropriate number\nof iAgents to save energy.\nFIGURE 8. Routing diagram of single-iAgent WSN.\nFIGURE 9. Routing diagram of multi-iAgent WSN.\nV. CONCLUSION\nIn this paper, we have discussed the development and\napplication of mobile agents in WSNs and proposed four\ndesigns of iAgent combined with artiﬁcial intelligence. Due\nto the limit of the single-iAgent WSN, we also proposed\na new multi-iAgent WSN. The experiments show that the\ngoal-based iAgent performs best with respect to energy con-\nsumption. The multi-iAgent WSN is demonstrated to per-\nform better than the single-iAgent WSN. Many experiments\nshow that these methods can save signiﬁcant energy and thus\nsigniﬁcantly reduces costs on a large scale.\nIn the near future, we will expand our work from three\naspects. The ﬁrst is security, which is an inevitable problem\nin mobile agents [37]–[39]. We will study how to ensure the\nVOLUME 7, 2019 97039\nJ. Luet al.: iAgent: When AI Meets Mobile Agent\nsecurity of data carried by the iAgents. The second problem is\nabout the interaction between iAgents [40]. In the simulation\nenvironment, we assume that iAgents are not related to each\nother, but it certainly will not be so in practical application.\nWhat’s more, the combination of mobile agents and AI can\nbring good beneﬁts, but the lack of exchange of information\nbetween iAgents will lead to loss of information. We will\nstudy the interaction of the iAgents in the multi-iAgent envi-\nronment in the next step. The last one is about the mobility\nof the iAgents. To simplify the problem, we assume that\nthe sensor nodes in the WSNs are static while the sensor\nnodes in some WSNs can move. To generalize our model,\nwe will abandon this simulation hypothesis and conduct deep\nresearch on mobility [41].\nREFERENCES\n[1] C. Wang, H. Lin, and H. Jiang, ‘‘CANS: Towards congestion-adaptive and\nsmall stretch emergency navigation with wireless sensor networks,’’ IEEE\nTrans. Mobile Comput. , vol. 15, no. 5, pp. 1077–1089, May 2016.\n[2] H. Jiang, C. Cai, X. Ma, ‘‘Smart home based on WiFi sensing: A survey,’’\nIEEE Access, vol. 6, pp. 13317–13325, 2018.\n[3] M. Ezhilarasi and V . Krishnaveni, ‘‘A survey on wireless sensor network:\nEnergy and lifetime perspective,’’ Taga J. Graphic Technol. , vol. 14,\npp. 3099–3113, Apr. 2018.\n[4] M. Chen, T. Kwon, Y . Yuan, and V . C. M. Leung, ‘‘Mobile agent based\nwireless sensor networks,’’ J. Comput., vol. 1, no. 1, pp. 14–21, 2006.\n[5] J. Zhou, D. Tian, Y . Wang, Z. Sheng, X. Duan, and V . C. M. Leung,\n‘‘Reliability-optimal cooperative communication and computing in con-\nnected vehicle systems,’’ J. Comput., to be published. doi: 10.1109/TMC.\n2019.2907491.\n[6] P. Sun, Y . Hu, J. Lan, L. Tian, and M. Chen, ‘‘TIDE: Time-\nrelevant Deep Reinforcement Learning for Routing Optimization,’’ Future\nGener. Comput. Syst. , vol. 99, pp. 401–409, Oct. 2019. doi: 10.1016/j.\nfuture.2019.04.014.\n[7] S. Sasirekha and S. Swamynathan, ‘‘Cluster-chain mobile agent rout-\ning algorithm for efﬁcient data aggregation in wireless sensor network,’’\nJ. Commun. Netw. , vol. 19, no. 4, pp. 392–401, 2017.\n[8] N. Y . SreeRanjani, A. G. Ananth, and L. S. Reddy, ‘‘An energy efﬁcient\ndata gathering scheme in wireless sensor networks using adaptive opti-\nmization algorithm,’’ J. Comput. Theor. Nanosci. , vol. 15, nos. 11–12,\npp. 3456–3461, 2018.\n[9] Y . Zhang, H. Wen, F. Qiu, Z. Wang, and H. Abbas, ‘‘iBike: Intelligent\npublic bicycle services assisted by data analytics,’’ Future Gener. Comput.\nSyst., vol. 95, pp. 187–197, Jun. 2019.\n[10] J. Wang, Y . Zhang, Z. Cheng, and X. Zhu, ‘‘EMIP: Energy-efﬁcient\nitinerary planning for multiple mobile agents in wireless sensor network,’’\nTelecommun. Syst., vol. 62, no. 1, pp. 93–100, May 2016.\n[11] K. Lingaraj, R. V . Biradar, and V . C. Patil, ‘‘OMMIP: An optimized\nmultiple mobile agents itinerary planning for wireless sensor networks,’’\nJ. Inf. Optim. Sci. , vol. 38, no. 6, pp. 1067–1076, 2017.\n[12] Y . Zhang, X. Ma, J. Zhang, M. S. Hossain, G. Muhammad, and\nS. U. Amin, ‘‘Edge intelligence in the cognitive Internet of Things:\nImproving sensitivity and interactivity,’’ IEEE Netw. , vol. 33, no. 3,\npp. 58–64, May/Jun. 2019.\n[13] M. Chen, F. Herrera, and K. Hwang, ‘‘Cognitive computing: Architec-\nture, technologies and intelligent applications,’’ IEEE Access , vol. 6,\npp. 19774–19783, 2018.\n[14] J. Yang, X. You, G. Wu, M. M. Hassan, A. Almogren, and J. Guna,\n‘‘Application of reinforcement learning in UA V cluster task scheduling,’’\nFuture Gener. Comput. Syst. , vol. 95, no. 1, pp. 140–148, 2019.\n[15] Y . Zhao, J. Ma, X. Li, and J. Zhang, ‘‘Saliency detection and deep learning-\nbased wildﬁre identiﬁcation in UA V imagery,’’ Sensors, vol. 18, no. 3,\np. 712, 2018.\n[16] S. Xiao, H. Yu, Y . Wu, Z. Peng, and Y . Zhang, ‘‘Self-evolving trading\nstrategy integrating Internet of Things and big data,’’ IEEE Internet Things\nJ., vol. 5, no. 4, pp. 2518–2525, Aug. 2018.\n[17] M. Chen and Y . Hao, ‘‘Label-less learning for emotion\ncognition,’’ IEEE Trans. Neural Netw. Learn. Syst. , 2019. doi:\n10.1109/TNNLS.2019.2929071.\n[18] J. Lu, L. Feng, J. Yang, M. M. Hassan, A. Alelaiwi, and I. Humar,\n‘‘Artiﬁcial agent: The fusion of artiﬁcial intelligence and a mobile agent for\nenergy-efﬁcient trafﬁc control in wireless sensor networks,’’ Future Gener.\nComput. Syst., vol. 95, pp. 45–51, Jun. 2019.\n[19] Y . Qian, Y . Zhang, Y . Ma, H. Yu, and L. Peng, ‘‘EARS: Emotion-aware\nrecommender system based on hybrid information fusion,’’ Inf. Fusion ,\nvol. 46, pp. 141–146, Mar. 2019.\n[20] M. S. Hossain and G. Muhammad, ‘‘Emotion recognition using deep\nlearning approach from audio–visual emotional big data,’’ Inf. Fusion ,\nvol. 49, pp. 69–78, Sep. 2019.\n[21] M. Chen, W. Li, Y . Hao, Y . Qian, and I. Humar, ‘‘Edge cognitive computing\nbased smart healthcare system,’’ Future Gener. Comput. Syst. , vol. 86,\npp. 403–411, Sep. 2018.\n[22] M. S. Hossain, G. Muhammad, and A. Alamri, ‘‘Smart healthcare monitor-\ning: A voice pathology detection paradigm for smart cities,’’ in Multimedia\nSystems. Berlin, Germany: Springer-Verlag, 2017. doi: 10.1007/s00530-\n017-0561-x.\n[23] M. S. Hossain, S. U. Amin, G. Muhammad, and M. Al Sulaiman, ‘‘Apply-\ning deep learning for epilepsy seizure detection and brain mapping visual-\nization,’’Future Gener. Comput. Syst. , vol. 86, pp. 403–411, Sep. 2018.\n[24] Y . Zhang, R. Gravina, H. Lu, M. Villari, and G. Fortino, ‘‘PEA: Paral-\nlel electrocardiogram-based authentication for smart healthcare systems,’’\nJ. Netw. Comput. Appl. , vol. 117, pp. 10–16, Sep. 2018.\n[25] D. Luviano-Cruz, F. Garcia-Luna, L. Pérez-Domínguez, and S. K. Gadi,\n‘‘Multi-agent reinforcement learning using linear fuzzy model applied to\ncooperative mobile robots,’’ Symmetry, vol. 10, no. 10, p. 461, 2018.\n[26] S. Iqbal, W. Altaf, M. Aslam, W. Mahmood, and M. U. G. Khan, ‘‘Appli-\ncation of intelligent agents in health-care,’’ Artif. Intell. Rev., vol. 46, no. 1,\npp. 83–112, 2016.\n[27] D. Wang, Y . Peng, X. Ma, W. Ding, H. Jiang, F. Chen, and J. Liu, ‘‘Adap-\ntive wireless video streaming based on edge computing: Opportunities\nand approaches,’’ IEEE Trans. Services Comput. , to be published. doi:\n10.1109/TSC.2018.2828426.\n[28] B. Qian and H. H. Cheng, ‘‘A mobile agent-based coalition formation\nsystem for multi-robot systems,’’ in Proc. 12th IEEE/ASME Int. Conf.\nMechtron. Embedded Syst. Appl. (MESA) , Aug. 2016, pp. 1–6.\n[29] D. Tian, J. Zhou, and Z. Sheng, ‘‘An adaptive fusion strategy for dis-\ntributed information estimation over cooperative multi-agent networks,’’\nIEEE Trans. Inf. Theory , vol. 63, no. 5, pp. 3076–3091, May 2017.\n[30] A. M. Turing, ‘‘Computing machinery and intelligence,’’ in Parsing the\nTuring Test. Dordrecht, The Netherlands: Springer, 2009, pp. 23–65.\n[31] M. Chen and V . Leung, ‘‘From cloud-based communications to cognition-\nbased communications: A computing perspective,’’ Comput. Commun. ,\nvol. 128, pp. 74–79, Sep. 2018.\n[32] M. Chen, Y . Hao, H. Gharavi, and V . Leung, ‘‘Cognitive information\nmeasurements: A new perspective,’’ Inf. Sci. , 2019. [Online]. Available:\nhttps://arxiv.org/abs/1907.01719\n[33] R. Liu, B. Yang, E. Zio, and X. Chen, ‘‘Artiﬁcial intelligence for fault\ndiagnosis of rotating machinery: A review,’’ Mech. Syst. Signal Process. ,\nvol. 108, pp. 33–47, Aug. 2018.\n[34] M. Chen, W. Li, G. Fortino, Y . Hao, L. Hu, and I. Humar, ‘‘A dynamic\nservice migration mechanism in edge cognitive computing,’’ ACM Trans.\nInternet Technol., vol. 19, no. 2, P. 30, 2019.\n[35] S. J. Russell, P. Norvig, Artiﬁcial Intelligence: A Modern Approach ,\nMalaysia: Pearson Education Limited, 2016.\n[36] D. Tian, J. Zhou, Z. Sheng, M. Chen, Q. Ni, and V . C. M. Leung, ‘‘Self-\norganized relay selection for cooperative transmission in vehicular ad-hoc\nnetworks,’’ IEEE Trans. Veh. Technol. , vol. 66, no. 10, pp. 9534–9549,\nOct. 2017.\n[37] N. Borselius, ‘‘Mobile agent security,’’ Electron. Commun. Eng. J., vol. 14,\nno. 5, pp. 211–218, 2002.\n[38] Y . Hedin and E. Moradian, ‘‘Security in multi-agent systems,’’ Procedia\nComput. Sci., vol. 60, pp. 1604–1612, Dec. 2015.\n[39] P. Zhao, J. Li, F. Zeng, F. Xiao, C. Wang, and H. Jiang, ‘‘ILLIA: Enabling\nk-anonymity-based privacy preserving against location injection attacks\nin continuous LBS queries,’’ IEEE Internet Things J. , vol. 5, no. 2,\npp. 1033–1042, Apr. 2018.\n[40] M. M. Gulzar, S. T. H. Rizvi, M. Y . Javed, U. Munir, and H. Asif, ‘‘Multi-\nagent cooperative control consensus: A comparative review,’’ Electronics,\nvol. 7, no. 2, p. 22, 2018.\n[41] M. Chen, Y . Hao, C. Lai, D. Wu, Y . Li, and K. Hwang, ‘‘Opportunistic task\nscheduling over co-located clouds in mobile environment,’’ IEEE Trans.\nService Comput., vol. 11, no. 3, pp. 549–561, May/Jun. 2018.\n97040 VOLUME 7, 2019",
  "topic": "Computer science",
  "concepts": [
    {
      "name": "Computer science",
      "score": 0.8404868245124817
    },
    {
      "name": "Mobile agent",
      "score": 0.8380775451660156
    },
    {
      "name": "Distributed computing",
      "score": 0.5850846767425537
    },
    {
      "name": "Wireless sensor network",
      "score": 0.5352410078048706
    },
    {
      "name": "Energy consumption",
      "score": 0.5279447436332703
    },
    {
      "name": "Mobile computing",
      "score": 0.5120378136634827
    },
    {
      "name": "Intelligent agent",
      "score": 0.5087259411811829
    },
    {
      "name": "Plan (archaeology)",
      "score": 0.48137667775154114
    },
    {
      "name": "Artificial intelligence",
      "score": 0.45578211545944214
    },
    {
      "name": "Wireless",
      "score": 0.41363051533699036
    },
    {
      "name": "Computer network",
      "score": 0.3066413998603821
    },
    {
      "name": "Telecommunications",
      "score": 0.17056992650032043
    },
    {
      "name": "Engineering",
      "score": 0.08171561360359192
    },
    {
      "name": "History",
      "score": 0.0
    },
    {
      "name": "Archaeology",
      "score": 0.0
    },
    {
      "name": "Electrical engineering",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I47720641",
      "name": "Huazhong University of Science and Technology",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I28022161",
      "name": "King Saud University",
      "country": "SA"
    }
  ]
}