{
    "title": "Frequency Response Modeling of Transformer Windings Utilizing the Equivalent Parameters of a Laminated Core",
    "url": "https://openalex.org/W2952034234",
    "year": 2019,
    "authors": [
        {
            "id": "https://openalex.org/A5014116562",
            "name": "Konstanty Marek Gawrylczyk",
            "affiliations": [
                "West Pomeranian University of Technology"
            ]
        },
        {
            "id": "https://openalex.org/A5083850432",
            "name": "Katarzyna Trela",
            "affiliations": [
                "West Pomeranian University of Technology"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2346313263",
        "https://openalex.org/W2767916211",
        "https://openalex.org/W1558576074",
        "https://openalex.org/W2546685163",
        "https://openalex.org/W2027632555",
        "https://openalex.org/W2541526644",
        "https://openalex.org/W2131449031",
        "https://openalex.org/W2123863889",
        "https://openalex.org/W2922189455",
        "https://openalex.org/W2544924162",
        "https://openalex.org/W2147602330",
        "https://openalex.org/W2059938594",
        "https://openalex.org/W2020232956",
        "https://openalex.org/W2156914432",
        "https://openalex.org/W2140694990",
        "https://openalex.org/W2133017165",
        "https://openalex.org/W1966703828"
    ],
    "abstract": "The aim of the article is to present the method for modeling transformer winding inductance, taking into account the complex magnetic permeability and equivalent electric conductivity of the magnetic core. In the first stage of the research, a physical model of a 24-turn coil wound on the distribution transformer core was prepared. The Frequency Response Analysis (FRA) measurements of the coil were taken; then, the inductance of the coil as a function of frequency was calculated from the received frequency response curves. In the second stage, two-dimensional (2D) and three-dimensional (3D) computer models of the coil based on the finite element method (FEM) were established. In order to obtain the equivalent inductance characteristics of the winding modeled in 2D and 3D in a wide frequency range, the equality of the reluctance of the limbs and yokes in both models was assured. In the next stage of the research, utilization of the equivalent properties for the laminated magnetic material simulations was proposed. This outcome can be used to calculate the frequency response of the winding of the power transformer. The other obtained result is the method for modeling the resonance slope, which is visible on the inductance curve received from the FRA measurement.",
    "full_text": null
}