{
  "title": "Design of working bodies for tillage tools using the methods of bionics",
  "url": "https://openalex.org/W2953732802",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A2955518324",
      "name": "Hennadii Tesliuk",
      "affiliations": [
        "Dnipro State Agrarian and Economic University"
      ]
    },
    {
      "id": "https://openalex.org/A2954158502",
      "name": "Boris Volik",
      "affiliations": [
        "Dnipro State Agrarian and Economic University"
      ]
    },
    {
      "id": "https://openalex.org/A2954143475",
      "name": "Sergey Sokol",
      "affiliations": [
        "Dnipro State Agrarian and Economic University"
      ]
    },
    {
      "id": "https://openalex.org/A2900094657",
      "name": "Nataliia Ponomarenko",
      "affiliations": [
        "Dnipro State Agrarian and Economic University"
      ]
    },
    {
      "id": "https://openalex.org/A2955518324",
      "name": "Hennadii Tesliuk",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2954158502",
      "name": "Boris Volik",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2954143475",
      "name": "Sergey Sokol",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2900094657",
      "name": "Nataliia Ponomarenko",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W6785432836",
    "https://openalex.org/W2183093624",
    "https://openalex.org/W2915264299",
    "https://openalex.org/W2195860331",
    "https://openalex.org/W3102427007"
  ],
  "abstract": "This paper reports a procedure for borrowing the principles of body structure of sea creatures to design tillage tools. Work of tillage tools under conditions of low soil consolidation necessitates improving the streamlining, that is, the crushing and loosening must be ensured not by undercutting, but by cutting with sliding. The adopted criterion for design rationality is the magnitude of traction resistance. The analytical part of the general procedure makes it possible to calculate its magnitude. The novelty is the fact that the overall traction resistance is split into components whose magnitudes is calculated separately. This element is important because it makes it possible to proceed, during calculation, to rectilinear infinitesimal sections of the perimeter and to separately adapt the components of a cutting perimeter to the tilled environment.\\n\\nThe following elements in the identification of a biological analog and a technical prototype are given: frontal part (snout) → chisel-shaped ripper’s tip; lateral fins → pointed wings; vertical keel fin → crumbler. The result from identifying a biological analog and a technical prototype is the derived regression model of the cutting perimeter and working surface.\\n\\nBased on the results of analytical studies, a mathematical model has been proposed of the interaction between a working body and soil. Special feature of the analytical model of interaction with a soil environment is that it is based on the conditions for unsupported cutting. The main provisions of the performed analytical studies have been confirmed by results from model experimental research, which showed a decrease in the traction resistance by 20 % on average, compared with the model of a standard working body. Such a result can only be obtained by reducing the friction forces, that is by improving the streamline capacity of a working surface. The novelty of the scientific results obtained is the complete adaptation of the working surfaces of a biological analog to working under conditions of a soil environment.",
  "full_text": "Engineering technological systems : Reference for Chief Designer at an industrial enterprise\n49\n H. Tesliuk, B. Volik, S. Sokol, N. Ponomarenko, 2019 \nDESIGN OF \nWORKING \nBODIES FOR \nTILLAGE TOOLS \nUSING THE \nMETHODS OF \nBIONICS\nH.  Tesliuk\nPhD,\tAssociate \tProfessor*\nE-mail:\n\tsuper-shm@ukr.net\nB.  Volik\nPhD,\tAssociate \tProfessor*\nE-mail:\n\tvolikb@ukr.net\nS.  Sokol\nPhD,\tAssociate \tProfessor*\nE-mail:\n\tsokol.sp.63@gmail.com\nN.  Ponomarenko\nPhD,\tAssociate \tProfessor*\nE-mail:\n\tnanagieva@ukr.net\n*\nDepartment\n\tof\n\tTractors\n\tand\nAgricultural\n\tMachinery\nDnipro\n\tState\n\tAgrarian\n\tand\nEconomic\n\tUniversity\nSerhiya\n\tYefremova\n\tstr.,\n\t25,\nDnipro,\n\tUkraine,\n\t49600\nВ роботі наведена методика запозичення принципів будо­\nви тіла морських істот для розробки ґрунтообробних знарядь. \nРобота ґрунтообробних знарядь в умовах заниженої консолі­\nдації ґрунту вимагає саме покращення обтічності, тобто кри­\nшення та розпушення треба забезпечити не за рахунок під­\nпірного різання, а за рахунок різання з ковзанням. За критерій \nраціональності конструкції прийнята величина тягового опору. \nАналітична частина загальної методики дозволяє обчислити \nйого величину. Новизна полягає в тому, що загальний тяговий  \nопір розбитий на складові елементи, величина яких обчислю­\nється окремо. Цей елемент є важливим, бо дозволяє при роз­\nрахунках перейти до прямолінійних нескінченно малих ділянок \nпериметра і окремо виконувати адаптацію складових ріжучого \nпериметра до оброблюваного середовища. \nНаведені елементи подібності біологічного аналогу і тех­\nнічного прототипу: лобова частина (рильце)\n \n→ \nдолотоподіб­\nний наконечник розпушувача; бокові плавники\n \n→ \nстрільчасті \nкрила; вертикальний кильовий плавник\n \n→ \nкомкоподрібнювач.  \nВ результаті ідентифікації біологічного аналогу і технічного \nпрототипу була отримана регресійна модель ріжучого перимет­\nра і робочої поверхні.\nЗа результатами аналітичних досліджень запропонова­\nна математична модель взаємодії робочого органа з ґрунтом. \nОсобливість аналітичної моделі взаємодії з ґрунтовим середови­\nщем полягає в тому, що вона базується на умовах безпідпірного \nрізання. Основні положення виконаних аналітичних досліджень \nпідтверджені результатами модельних експериментальних \nдосліджень, які показали зниження тягового опору у порівнян­\nні з моделлю серійного робочого органа в середньому на 20\n \n%. \nТакий результат можна отримати тільки за рахунок зменшен­\nня сил тертя, тобто покращенням обтічності робочої поверхні. \nОригінальність отриманих наукових результатів полягає в пов­\nній адаптації робочих поверхонь біологічного аналогу до роботи \nв умовах ґрунтового середовища\nКлючові слова: обробіток ґрунту, робоча поверхня, тяговий \nопір, обтічність форми, методи біоніки, ґрунтообробні знаряддя\nUDC 631.312.32\nDOI: 10.15587/1729-4061.2019.169156\n1. Introduction\nThe \ndesign of tillage working bodies is defined by soil \nconditions under which they are planned to be used, as well \nas by the anticipated result of their interaction, and by the \nquality of crushing and loosening, as well as traction resis-\ntance. The working body under consideration is planned to \nbe used under conditions of organic farming.\nOrganic agriculture is characterized by the presence in \na surface layer of 0–15\n \ncm of large amounts of plant residue, \nwhich have not yet fully undergone the stage of humification. \nTherefore, the surface layer demonstrates weak consolidation \nand its mechanical properties differ significantly from deeper \nhorizons. Thus, there is a differentiation of soil layers by \ndepth; this differentiation has clear boundaries. This point \nis important because a deep-ripper gives rise to cleavage \nlines that propagate along longitudinally-vertical and trans-\nversely-vertical planes. The character of the propagation of \nthese cracks defines the crushing and loosening of a tilled \nenvironment.\nOrganic farming implies vertical tillage to a depth of \n10\n \ncm; at the same time, the root system of such crops as \ncorn, sunflower, sugar beet needs deep loosening. Annual use \nof screw shelf working organs is not appropriate because they \nplow plant debris for deep tillage thereby compromising the \nvery essence of the farming system. Thus, chisel cultivation \nis mandatory.\n2. Literature review and problem statement\nPaper\n \n[3] reports results from analytical studies into the \ninteraction between soil and the cutting perimeter of an arbi-\ntrary geometric shape. Underlying the research is the theory \nof internal stress. The theory makes it possible to estimate \na value for the predicted traction resistance. However, the \nvery notion of a cutting perimeter does not make it possible \nto describe the design in detail, which prevents its adaptation \nto operation in a specific soil environment. In study\n \n[4], the \nshortcoming was partially eliminated by the transition to the \ninfinitely small, but the integrated shape of working surface \nmust satisfy a series of requirements: it must be described by \nstandard algebraic equations, that is, the stochastic models \nare not applicable. This significantly limits the possibilities \n Received date: 15.04. 2019     Accepted date:  27.05.2019     Published date:  21.06.2019 \nEastern-European Journal of Enterprise T echnologies ISSN 1729-3774 3/1 ( 99 ) 2019\n50\nto adapt the working body to soil conditions. Paper [2] pro-\nposed a mathematical model that relates to the chisel-shaped  \nworking body; however, the working surface is imposed with \nan essential constraint: a model must be rectilinear. The \nmo del proposed in [5] does not account for branching in \ncleavage lines, which is why the derived estimated values for \ntraction resistance and crushing are typically underestimated \nby 25–30 %. Study [6] describes the elements of a mathe-\nmatical model for soil loosening based on the volumetric \naction of a force field created by a working body. However, \nthe model cannot take into consideration changes in the \ncurvature of the surface while passing the neutral position \nof a supporting wall. In paper [7], the estimated model was \nconstructed based on building a continuous closed working \nperimeter of the tool, that is, by method of fitting. Article [8] \nreports a model of the directional wear of a working surface \nof the pointed paw. That provides opportunities to form a ra-\ntional cutting surface, including the substantiation based on \nmethods of bionics. The reported procedure can be extended \nto working surfaces of almost any shape. Thus, article [8] is \nthe closest to the considered tasks.\nFeature of the modern technologies of soil cultivation is \nan effort to minimize the mechanical effect on the tilted envi-\nronment. Such an approach retains the biological activity of \nsoil environment that increases the yield of farmed crops [9]. \nEspecially sensitive to cultivation is corn [10]. A hallmark \nof the structure of its root system is that it requires that soil \nshould be loose to depth of up to 25 cm. In this case, crushing \nshould be within the range of obtaining the maximum pos-\nsible amount of agronomically valuable units, with a reduced \ndiameter of 0.25–10 mm. Working bodies with enhanced \nstreamlining capacity enable the minimization of mechanical \naction while maintaining the required quality of crushing. \nSomewhat similar problems arise in the process of cultivating \nrice and wheat [11], but these crops require a smaller cultiva-\ntion depth, which is 10–12 cm.\nAmong the recent significant innovations, one \nshould note a system of organic farming. A special fea-\nture of this system is as follows. During conventional \ntillage by screw-shelf working bodies (ploughs), vege-\ntable remnants of predecessor, or siderite, are plowed \nto a great depth of up to 25 cm. The system of organic \nfarming implies that plant residue is immersed by \nvertical working bodies (turbo-disks) to a depth of \n10–12 cm. The consequence is the presence in the \nsoil environment of a large amount of plant remains, \nwhich have not undergone the stage of humification \nin full, that is the amount of sticky substances de-\ncreases. This leads to a corresponding reduction of soil \nconsolidation, which is characterized by the specific \nparticle adhesion [12]. The study conducted has con-\nfirmed a decrease in С\nP under conditions of the black \nearth in Ukraine’s steppe zone from 2.5–3 kN/m 2 to \n1.1–1.2 kN/m2.\nThe essence relates to that the proper use of \norganic farming can reduce the need for fertilizers \nof inorganic origin and partially refuse the means of \nchemical protection. The result could mean obtaining \nenvironmentally-friendly produce. \nThe above analysis makes it possible to assert that it is \nnecessary to change approaches to designing tillage tools. \nTherefore, an option for solving the specified tasks could \nbe to design tillage working bodies applying the methods  \nof bionics.\n3. The aim and objectives of the study\nThe aim of this study is to adapt a tillage working body \nto an environment with the design parameters to be substan-\ntiated on the basis of an analysis into the structure of a bio-\nlogical analog’s body. That would make it possible to improve \nthe technical and economic indicators for the technological \nprocess of soil cultivation.\nThe study objectives:\n– to establish the elements of functional similarity; \n– to construct the geometric, numeric, and regression \nmodel of the surface of a biological analog; \n– to derive a mathematical model of the interaction bet-\nween soil and the working surface of a tillage tool; \n– to design an effective prototype and to test it practically.\n4. Mathematical model of a working body’s surface\nA comparative analysis of the design of deep-rippers and \nthe structure of a body of marine animals has revealed that \nthe biological analog that could be used is the body of a ham-\nmerhead fish [14].\nBased on results of the visual analysis of a series of pho-\ntographic images of the body of a biological analog, in accor-\ndance with the basic criteria of similarity, we have designed  \na structural scheme of the chisel (Fig. 1).\nA mathematical model can be only regressive in charac-\nter. Why so? The fact is that the equation should be modi-\nfied in accordance with calculations based on the analytical \nmodel of interaction between a blade and soil. Modification \nis based on a numerical method, and a regression equation is \nderived exactly in this way. The input parameter is coordi-\nnate Х\nі, or the length of a body from the frontal part to the \ni-th cross-section, the output parameter is Yi, or the working \nwidth of the i-th cross-section (Fig. 1).\nThe dimensions of the body of a biological analog in \nFig. 1 are scaled to the adopted working width of 170 mm \nbased on the results from a dimensional analysis into the \nseries of photographic images of an actual animal, they are \ntherefore conditional. \n \nFig.\t1.\tEstimation\tscheme\tfor\tdesigning\ta\tregression\tmodel\t\t\nof\tthe\tsurface\tof\ta\tworking\tbody\nEngineering technological systems : Reference for Chief Designer at an industrial enterprise\n51\nThe resulting numerical array (Table 1) is processed by \nthe method of least squares to derive a regression equation of \nthe surface profile.\nTable\t1\nNumerical\tmodel\tof\tthe\tsurface\tprofile\t\t\nof\ta\tbiological\tanalog\nХ, \nmm\nMeasured \nvalue 1.0 50 100 150 200 250 300\nY, \nmm\nMeasured \nvalue 1.0 40 55 65 75 105 170\nEstimated \nvalue 0.88 39.85 56.32 63.35 75.11 105.82 169.92\nCriterion of \nsimilarity 0.006 0.24 0.32 0.35 0.44 0.62 1.0\nThe number of gradations of a cell grid is 8. Based on \nthe results of calculations from [16], the cubic regression \nequation has high correlation coefficients, greater than 0.99, \nincreasing the number of gradations to 12 leads to that the \ncorrelation coefficient increases by not more than 0.002. It \nshould be noted that there is no need for a complete match \nbetween the profile of a prototype’s blade and the analog. \nBodies operate under different environments, and therefore \none needs only an approximate dependence, which, further, \nat the next step, based on the analytical model of interaction \nwith soil, would be adapted to work in the soil environment. \nThus, the chosen cell size of the grid is enough.\nA model would adequately reproduce an analog only if it \nis constructed in accordance with the criteria of similarity. \nIn order to obtain a geometric model, it would suffice to use \nthe trivial criteria that represent the ratio of two basic di-\nmensions. For a given level of modeling, the trivial criterion \nof similarity is:\nK B\nY\nBT\ni\n= ,  (1)\nwhere B is the structural working width of a working body;  \nYi is the width of an analog at the i-th cross-section. \nTo derive an estimation scheme, one must use the in-\ntegrated criteria of similarity, which is obtained using the \nmethod of analysis of dimensionalities of the analytical model \nof interaction between soil and a cutting perimeter of arbi-\ntrary geometrical shape [4],\nCP b\nVP a\nCP b\nVP a K\nPg\ngV R H\nn\nPg\ngV R M\nm\np\n⋅⋅\n⋅⋅ ⋅\n\n\n\n = ⋅⋅\n⋅⋅ ⋅\n\n\n\n =γγ 22 ,  (2)\nwhere СP is the specific adhesion among soil particles;  \nγg is the specific weight of soil; V is the operating speed of  \na tillage tool; Рg is the horizontal component of the traction \nresistance of a working body; РVR is the vertical component \nof traction resistance; B is the reduced working width of  \na working body [4]; a is the depth of stroke by a tillage tool. \nThe calculation result is the derived cubic regression \nequation (3).\nY = –0.00001892Х3–0.007564Х 2+1.1328Х–0.2377. (3)\nCorrelation coefficient KC =  0.9995; determination coeffi-\ncient Kd =  0.999; systematic error E =  4.9 %. \nFor the estimated scheme, we accept the basic structural \nelement to be a working width B =  170 mm; according to the \nsecond theorem of similarity, equation (3) is represented \nin the form of a criterial equation – it will act as a working \nequation hereafter.\nK\nП =  (0.11X3–43.74X2+0.6446X+3515)⋅10–6. (4)\nThe essence is the fact that, when proceeding to design \nan actual tool, it would suffice to adopt the size of a base \nelement, that is, its working width, and, according to the cri-\nterial equation, to build the entire working surface.\n5. Mathematical model of interaction between soil  \nand the designed working body\nThere is a model [4], which makes it possible to calculate \nthe predicted traction resistance of a tool, although it relates \nto a group of tools of a specific geometric shape, which is \nwhy it does not seem possible to extend the procedure for an \narbitrary geometric shape.\nUnderlying the procedure proposed here is the theory \nof internal stress [3], which in turn is continuation of re-\nsearch [1]. \nThe essence of the model is as follows. The process of \ninteraction that involves a working body of an arbitrary geo-\nmetrical shape is divided into two stages:\n– the cutting perimeter of a tool separates a prism of soil \nfrom the entire array; \n– the subsequent crushing of a chipped prism occurs by \novercoming the internal stress with working surfaces of the \ntool; internal stress has previously existed in the consoli-\ndated soil.\nThus, we introduce two concepts:\n– the cutting perimeter as a projection of all cutting \nedges of the tool onto the plane perpendicular to motion \ndirection [1]; \n– the internal stress, which is defined as the vector sum \nof all adhesion forces operating in an environment, from the \nmolecular to aggregate level [4].\nA working body is regarded to be a geometrical sum of \nsurfaces, oriented in space in a certain manner. \nTraction resistance of the cutting perimeter is condi-\ntionally divided into the following components: Р\nCK is the \nstrength of chipping a prism of soil by a frontal part; РT is the \nforce of soil pressure on working surfaces; РTR are the forces \nof soil friction against working surfaces; РD is the dynamic \ncomponent of resistance force. \nNext, we determine analytically those forces that were \napplied to the working body.\n5. 1. The strength of chipping a prism of soil by a fron-\ntal part\nA prism of soil is chipped by the cutting edge of the chisel. \nOther elements of the working surface, including the wings, \ndo not participate in chipping because cleavage lines overlap \ntheir working width.\nA procedure for determining the chipping force was tho-\nroughly analyzed in papers [3, 6, 15]. \nThe procedure implies that the profile of the blade  \nof a working body is divided into infinitesimal sections \nthat give rise to the propagation of cleavage lines that form  \na prism. \nEastern-European Journal of Enterprise T echnologies ISSN 1729-3774 3/1 ( 99 ) 2019\n52\nThe strength of chipping a prism is determined from formula:\nPC FCK PC K= ,  (5)\nwhere FCK is the total chipped area. \nThus, determining the strength implies defining the area \nof the chipped prism [4].\n5. 2. Force of pressure and friction of soil against wor-\nking surfaces\nFor the designed tool, one must separately consider the \nsurface of the chisel and the surface of the wings. For both \ncomponents, in line with recommendations from [3], one can \napplied the equation of a supporting wall [6]. \nFor the positive angle β of the wall tilt, the pressure along \nthe normal to the surface Ea is determined from formula [13]:\nE H\na = ⋅ ⋅− +\n\n\n +\n\n\n ⋅γj β ββ\n2 2\n2 45 2tg tg cos,  (6)\nwhere γ is the specific weight of soil; H is the depth of the \nwall immersion; β is the wall inclination angle to the vertical;  \nj is the angle of internal friction. \nConsider the estimation scheme (Fig. 2) relative to the \ndesigned tillage tool. Coordinate origin is at a chisel’s tip.\nThe surface regression equation (3) was derived in  \nthe XOY coordinates. We represent the surface of the chisel \nas a sum of infinitesimal sections dx. Such sections can be \nconsidered flat with the angles of setting them up vertically \nand the motion direction. \nIn the XOY coordinates, the tangent of angle e of the sec-\ntion’s tilt to the bottom of the furrow would equal the first \nderivative at point Х\nі:\ne= arctg( ).dY dX  (7)\nHowever, the working body is installed at angle of at-\ntack α to the bottom of the furrow. Let us turn coordinate \naxes at angle α – the angle of attack of the working body in \ngeneral, and obtain a new coordinate system X ′OY′ in which \nthe Х′ axis coincides with the motion direction of the chisel. \nThen the angle of setting an elementary section to the \nvertical in a moving coordinate system is:\nβπ eα=− −05..  (8)\nDetermine the force acting on a randomly selected sec-\ntion, located at a distance Хі from the tip:\ndP Yb dxT\ni= ⋅⋅ ⋅− +\n\n\n +\n\n\n ⋅⋅\n−\nγ jβ ββ\n2\n2\n2\n2 45 2tg tg cos.  (9)\nThe general surface response is:\nP Yb xT\ni\nx\nxL\n= ⋅⋅ ⋅− +\n\n\n +\n\n\n ⋅⋅\n=\n= −\n∫\nγ jβ ββ\n2\n2\n0\n2\n2 45 2tg tg dcos,  (10)\nPPTP T= tgj,  (11)\nwhere L is the total length of the working section; j is the \nangle of the external soil friction against steel.\nThe instantaneous direction of action of force РT \nis the normal to the surface profile; force Р TR – tan-\ngentially to the profile. Knowledge of the predicted \nvalue for forces РCK, РT, РTR according to the theory \nof internal stress [3] is a necessary and sufficient con-\ndition for the project calculation of the degree of soil \ncrushing by a tool.\n6. Results of studying the model of an \nexperimental sample of a tillage tool\nThe experimental study was performed under con-\nditions of a soil channel the size of 50 × 500 × 7,000 m, \nfilled with a model environment (Fig. 3). The model en-\nvironment was a mixture of sand of different fractional \ncomposition. The mechanical-technological properties \nwere evaluated based on the specific adhesion of parti-\ncles, which was taken as an integrated index [12].\nA design feature of the channel is that the riser \nof the examined working body is fixed on a cart with \ntwo springs, which makes it possible to measure both \nlongitudinal and transverse components of the forces \nof tractional resistance. The components of traction \nresistance were measured using a tensor chain in line \nwith common procedures.\nFor this experiment, we printed, at a 3D printer, the ex-\nperimental and standard deep-rippers with a scale ratio M1:2. \nThe experimental study has confirmed the proper choice of  \na biological analog, as well as the research concept in general. \nThe accepted criterion of rationality was the measured va-\nlue for traction resistance of the experimental and standard \ndeep-rippers. The models were made from plastic material, \nthat is the coefficients of external friction did not match \nactual conditions, but the simulation of interaction was con-\nducted in full compliance with the criteria of similarity [1];  \nin other words, they are easily reproduced. The research re-\nsults are given in Table 2. The procedures for determining soil \nproperties are given in [12].\n \nFig.\t2.\tEstimation\tscheme\tfor\tdetermining\tsoil\tpressure\ton\tthe\ttool’s\t\nworking\tsurfaces:\tα\tis\tthe\tangle\tof\tattack\nEngineering technological systems : Reference for Chief Designer at an industrial enterprise\n53\nFig.\t3.\tA\tstage\tof\tresearch\tin\ta\tsoil\tchannel\n \nTable\t2\nResults\tof\tresearch\tinto\tthe\ttraction\t\t\nresistance\tof\tmodels\nVariant of the \nmodel of  \na deep-ripper\nС, kN/m2 V, m/s\nР, Н  \n(measured \nvalue)\nР, Н  \n(estimated \nvalue)\nExperimental \nsample\n1.05 0.35 120 138\n1.3 0.36 136 144\nStandard\n1.05 0.35 155 163\n1.3 0.36 170 181\nNotes: C – specific adhesion of soil particles; V – operating ve-\nlocity; P – traction resistance\nAn analysis of data from the Table reveals that the \ndesigned model of a deep-ripper ensures a decrease in the \nabsolute value for traction resistance in the range of 20 %, \nand improves the structure of tilled soil by 7 %. Accor-\nding to the theory of similarity, it can be argued that the \nspecified trend would also be valid for the field sample of  \na working body.\n7. Discussion of results of studying the interaction \nbetween soil and the experimental sample  \nof a deep-ripper\nA decrease in the traction resistance of the model of an \nexperimental sample of a working body in comparison with \na standard model is explained by that soil streamlines the \nworking surfaces better. The result is the reduced forces of \npressure and friction. The positive effect is that it reduces \nthe total traction resistance of a unit and, consequently, fuel \nconsumption. In addition, we predict improvement in per-\nformance due to the possibility to increase working velocity. \nHowever, this issue requires additional research into the fea-\nsibility of velocity acceleration in terms of compliance with \nfarming operations.\nAn analysis of data from Table 2 shows that the es-\ntimated values outperform, by 5–7 % on average, those \nthat were obtained experimentally. This can be explained \nby certain assumptions, adopted in the model, such as the \nintroduction of an integrated index for mechanical-tech-\nnological properties [4]. The quality of crushing was esti-\nmated based on the coefficient of structure arrangement, \nwhich was defined as a ratio of the mass of agronomically \nvaluable units to the total mass of an individual sample. For  \na standard paw, this indicator is 0.57–0.62, for the designed  \none – 0.65–0.75.\nThe limitations of the study that should be noted relate \nto that the resulting shape of the surface of a working body \nis complex and would change under the influence of abra-\nsive wear, which could decrease the efficiency of the design. \nHowever, under conditions of industrial production the issue \nof a shape is easily solved. Abrasive wear can be minimized \nby cementing the surface or by applying a wear-resistant \ncoating. It should be noted that the current work has \nsolved the task on the basic, that is deep, tillage, which is \nperformed in autumn. As regards the surface, that is spring, \ntillage, then, subject to maintaining the basic principles, as \nwell as the substantiation of an appropriate biological ana-\nlog, the current procedure could be extended to the tools  \nof surface cultivation.\nRegarding the further advancement of our research, \nthere are the following considerations. First, it is promising \nto generalize the procedure for the entire group of marine \nanimals. Second, it is necessary to extend the procedure for \nearth-moving animals. Third, it is necessary to summarize the \nmethodology of experimental research, aimed at adapting the \ntools to soil conditions.\n8. Conclusions\n1. By means of a visual analysis of body structure of the \nmost common species of marine animals it was found that \nthe body structure of hammerhead fish corresponds best, in \nterms of functionally, to the structure of a deep-ripper of the \nchisel type; and, therefore, hammerhead fish can be accepted \nas a biological analog. The elements of identification are: \nanalog’s body → riser; vertical fin → crumbler; side fins – \nblades-razors.\n2. The geometric model of a working body corresponds \nto the area of the wetted surface of the analog. The regres-\nsion model of the cutting perimeter: Y =  0.00001892Х\n3– \n–0.007564Х2+1.1328Х–0.2377, where Y is the transverse,  \nX is the longitudinal coordinates.\n3. We have designed an analytical model of interaction \nbetween a soil environment and a working body with ele-\nvated streamlining capacity. The main differences of the \nmodel are in the representation of the cutting perimeter of \na working body as the totality of infinitely small rectilinear \nsections, in determining the response of soil to the effect of \nthese sections, and their subsequent integration along the \nactual profile of the cutting perimeter.\n4. Based on the model, we have designed an actual \nstructure of a deep-ripper. The main difference from the \nprototype is that we rejected the straightness of working \nsections and passed to the profiles that were obtained \nbased on a regression analysis of the body of a marine ani-\nmal. The performed model study in a soil channel confirms \nthat our design makes it possible to lower, by up to 20 %, \nthe overall traction resistance when working under soil \nconditions of the model environment in comparison with  \nthe prototype.\nEastern-European Journal of Enterprise T echnologies ISSN 1729-3774 3/1 ( 99 ) 2019\n54\nReferences\n1. Vetrov Yu. A. Rezanie gruntov zemleroynymi mashinami: monografiya. Moscow: Mashinostroenie, 1971. 357 p.\n2. Vetokhin V., Getman O., Bilytska N. To the issue of creating the form of working surface taking into account the exchange of \nthe volume between the working body and a soil // Pratsi Tavriyskoho derzhavnoho ahrotekhnolohichnoho universytetu. 2011.  \nVol. 51, Issue 4. P. 87–94.\n3. Modeliuvannia yakosti rozpushennia hruntu dolotom / Kobets O., Tesliuk H., Volyk B., Lepet Y e. // Tekhnika i tekhnolohiyi APK. \n2015. Issue 6. P. 31–33.\n4. Panchenko A. N. Teoriya izmel’cheniya pochv pochvoobrabatyvayuschimi orudiyami. Dnepropetrovsk: DGAU, 1999. 140 p.\n5. Kobets A. S., Volyk B. A., Puhach A. M. Gruntoobrobni mashyny: teoriya, konstruktsiya, rozrakhunok: monohrafiya. Dnipro-\npetrovsk: Svidler A. L., 2011. 140 p.\n6. Semeniuta A. M., Bilokopytov O. V., Volyk B. A. Metodyka rozrakhunku zahalnoi reaktsiyi rizannia gruntu poverkhneiu dovilnoi \nheometrychnoi formy // Pratsi Tavriyskoho derzhavnoho ahrotekhnolohichnoho universytetu. 2010. Vol. 2, Issue 10. P. 161–167.\n7. Chuyko I. S., Volik B. A., Kolbasin V. A. Obosnovanie konstruktivnih parametrov V-obraznogo orudiya dlya chizelevaniya pochvy //  \nProblemy ta perspektyvy rozvytku ahrarnoi mekhaniky. Materialy Mizhnarodnoi naukovo-praktychnoi konferentsiyi. Dnipro-\npetrovsk: DDAU, 2004. P. 29–33.\n8. Kobets A. S., Pugach A. M., Kharytonov M. M. Justification of the cultivator sweep and strengthening elements on the working \nsurface // INMATEG Agricultural Engineering. 2018. Vol. 54, Issue 1. P. 161–170.\n9. Conservation tillage impacts on soil, crop and the environment / Busari M. A., Kukal S. S., Kaur A., Bhatt R., Dulazi A. A. // Inter-\nnational Soil and Water Conservation Research. 2015. Vol. 3, Issue 2. P. 119–129. doi: https://doi.org/10.1016/j.iswcr.2015.05.002 \n10. Rotary zone tillage improves corn establishment in a kura clover living mulch / Dobbratz M., Baker J. M., Grossman J.,  \nWells M. S., Ginakes P. // Soil and Tillage Research. 2019. Vol. 189. P. 229–235. doi: https://doi.org/10.1016/j.still.2019.02.007 \n11. Sustainability issues on rice–wheat cropping system / Bhatt R., Kukal S. S., Busari M. A., Arora S., Yadav M. // International Soil \nand Water Conservation Research. 2016. Vol. 4, Issue 1. P. 64–74. doi: https://doi.org/10.1016/j.iswcr.2015.12.001 \n12. Mekhaniko-tekhnolohichni vlastyvosti silskohospodarskykh materialiv: navch. pos. / Kobets A. S., Ishchenko T. D., Volyk B. A., \nDemydov O. A. Dnipropetrovsk: RVV DDAU, 2009. 84 p.\n13. Tsytovich N. A. Mekhanika gruntov (kratkiy kurs): ucheb. 4-e izd., pererab. i dop. Moscow: Vysshaya shkola, 1983. 288 p.\n14. An analysis of the structure of the body of marine animals for the possibility of accepting it as a biological analogue /  \nVolyk B., Tesliuk H., Zolotovska O., Maistryshyn R. // Tekhnika i tekhnolohiyi v APK: naukovo-vyrobnychyi zhurnal. 2018.  \nIssue 5 (104). P. 7–9. \n15. Tesluk G. V., Volik B. A., Maistrishin R. M. Improvement of technological processes and technical means soil treatment in organic \nfarming system // Inzheneriya pryrodokorystuvannia. 2016. Issue 1. P. 48–52.\n16. Approksimatsiya funktsii odnoy peremennoy. URL: https://planetcalc.ru/5992/",
  "topic": "Bionics",
  "concepts": [
    {
      "name": "Bionics",
      "score": 0.565768301486969
    },
    {
      "name": "Traction (geology)",
      "score": 0.5207540988922119
    },
    {
      "name": "Engineering",
      "score": 0.485806941986084
    },
    {
      "name": "Tillage",
      "score": 0.44064390659332275
    },
    {
      "name": "Consolidation (business)",
      "score": 0.43582624197006226
    },
    {
      "name": "Mechanical engineering",
      "score": 0.425171434879303
    },
    {
      "name": "Structural engineering",
      "score": 0.41564011573791504
    },
    {
      "name": "Marine engineering",
      "score": 0.3760263919830322
    },
    {
      "name": "Computer science",
      "score": 0.3315826952457428
    },
    {
      "name": "Artificial intelligence",
      "score": 0.17306563258171082
    },
    {
      "name": "Accounting",
      "score": 0.0
    },
    {
      "name": "Business",
      "score": 0.0
    },
    {
      "name": "Ecology",
      "score": 0.0
    },
    {
      "name": "Biology",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I3019264281",
      "name": "Dnipro State Agrarian and Economic University",
      "country": "UA"
    }
  ],
  "cited_by": 7
}