{
    "title": "Study of Transformer Lifetime Due to Loading Process on 20 KV Distribution Line",
    "url": "https://openalex.org/W2963477019",
    "year": 2018,
    "authors": [
        {
            "id": "https://openalex.org/A5021407482",
            "name": "Anak Agung Ngurah Amrita",
            "affiliations": [
                "Udayana University"
            ]
        },
        {
            "id": "https://openalex.org/A5005532500",
            "name": "Wayan Gede Ariastina",
            "affiliations": [
                "Udayana University"
            ]
        },
        {
            "id": "https://openalex.org/A5053472775",
            "name": "Ida Bagus Gede Manuaba",
            "affiliations": [
                "Udayana University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W1680369125",
        "https://openalex.org/W2408079969",
        "https://openalex.org/W3151923273"
    ],
    "abstract": "Power transformer is very important in electric power system due to its function to raise or lower the voltage according to its designation. On the power side, the power transformer serves to raise voltage to be transmitted to the transmission line. On the transmission side, the power transformer serves to distribute the voltage between the main substations or down to the distribution voltage. On the distribution side, the stresses are channeled to large customers or lowered to serve small and medium customers. As the power transformer is so importance, it is necessary to protect against disturbance, as well as routine and periodic maintenance, so that the power transformer can operate in accordance with the planned time. Some factors that affect the duration of the power transformer is the ambient temperature, transformer oil temperature, and the pattern of load. Load that exceeds the maximum efficiency of the transformer which is 80% of its capacity will cause an increase in transformer oil temperature. Transformer oil, other than as a cooling medium also serves as an insulator. Increasing the temperature of transformer oil will affect its ability as an isolator that is to isolate the parts that are held in the transformer, such as iron core and the coils. If this is prolonged and not handled properly, it will lead to failure / breakdown of insulation resulting in short circuit between parts so that the power transformer will be damaged. PLN data indicates that the power transformer is still burdened exceeding maximum efficiency especially operating in the work area of PLN South Bali Area. The results of this study, on distribution transformers with different loads, in DS 137, DS 263 and DS 363, show that DS 363 transformer with loading above 80% has the shortest residual life time compared to DS 263 and DS 137 which loading less than 80%.",
    "full_text": "Journal of Electrical, Electronics and Informatics, Vol. 2 No. 2, August 2018 \n25 \nAbstract Power transformer is very important in electric power system due to its function to raise or lower the voltage according \nto its designation. On the power side, the power transformer serves to raise voltage to be transmitted to the transmission line. On \nthe transmission side, the power transformer serves to distribute the voltage between the main substations or down to the \ndistribution voltage. On the distribution side, the stresses are channeled to large customers or lowered to serve small and medium \ncustomers. As the power transformer is so importance, it is necessary to protect against disturbance, as well as routine and \nperiodic maintenance, so that the power transformer can operate in accordance with the planned time. Some factors that affect the \nduration of the power transformer is the ambient temperature, transformer oil temperature, and the pattern of load. Load that \nexceeds the maximum efficiency of the transformer which is 80% of its capacity will cause an increase in transformer oil \ntemperature. Transformer oil, other than as a cooling medium also serves as an insulator. Increasing the temperature of \ntransformer oil will affect its ability as an isolator that is to isolate the parts that are held in the transformer, such as iron core and \nthe coils. If this is prolonged and not handled properly, it will lead to failure / breakdown of insulation resulting in short circuit \nbetween parts so that the power transformer will be damaged. PLN data indicates that the power transformer is still burdened \nexceeding maximum efficiency especially operating in the work area of PLN South Bali Area. The results of this study, on \ndistribution transformers with different loads, in DS 137, DS 263 and DS 363, show that DS 363 transformer with loading above \n80% has the shortest residual life time compared to DS 263 and DS 137 which loading less than 80%. \nI\nndex Terms— Current, Voltage, Duration of Time, Distribution Transformer. \nI. INTRODUCTION1 \nPower transformer is used to transform power. In power \nplant, this is used to increase power transferred to \ntransmission line. In transmission line, however, this is used \nto transfer power between substations. In the distribution \nside, power is distributed to main customers or reduced to \nbecome low power to serve middle-level or low-level \ncustomer. As power transformer is so importance, it is \nhighly required to protect and maintain it, therefore, their \nlifetime can be extended. \nThere are factors to influence lifetime of power \nt\nransformer: ambient temperature, transformer’s oil \ntemperature, and loading pattern. Loading process in \ndistribution transformer influences voltage and current in \ntransformer’s coil. In ideal condition, transformer is loaded \nup to 80% of its capacity due to its efficiency and losses. \nPower transformer management is related to the routine \nmaintenance, for preventive, corrective, or detective. \nShorten lifetime or damaged transformer caused by isolation \nfail in parts of transformer such as iron core and coils. This \ncan happen due to the function of isolation to break parts \nwith voltage to avoid flash over or spark over. Isolation fail \ncan be caused by some factors, such as time, reduced-\n1 Electrical Engeneering Departement, Faculty of Engeneering \nUdayana University (UNUD) \nBadung, Bali, Indonesia \n ngr_amrita@unud.ac.id, \n2Electrical Engeneering Departement, Faculty of Engeneering \nUdayana University (UNUD) \nBadung, Bali, Indonesia \nw.ariastina@unud.ac.id, \n3 Electrical Engeneering Departement, Faculty of Engeneering \nUdayana University (UNUD) \nBadung, Bali, Indonesia \nibgmanuaba@unud.ac.id \nStudy of Transformer Lifetime Due to Loading \nP\nrocess on 20 KV Distribution Line  \nA.A.N. Amrita1, W.G. Ariastina2, and I.B.G. Manuaba3 \nJournal of Electrical, Electronics and Informatics, p-ISSN: 2549 - 8304 e-ISSN : 2622 - 0393 \n26 \ndielectric strength, extra voltage and high current. Extra \nvoltage in isolator, is a stress that must be counter by \nisolator for not being fail when isolating current. Inside \nisolation, electrons hardly link to their molecule, where this \nlink forces stress caused by voltage. If this link is broken, \nisolation is disappeared, and it is fulfilled with power, there \nare moving electrons from one molecule to the others, \nwhere therefore, leaked current is created. On the other \nhand, High voltage that constantly flows inside coils cause \ntemperature escalation. \nPLN Area Bali Selatan says that in 2016, there are \ndistribution transformers with load more than 80%, exceeds \ntheir capacity. Based on these facts, this research aims to \nanalyze effect of loading to life time of power transformer \nby comparing power transformer with load of 50% - 60%, \n70% - 80%, and 80% - 90% of its capacity. Results of this \nresearch can be used as a base of power transformer \nreplacement or mutation, therefore power transformer \ndamage that influences service continuity can be minimized. \nThere are previous studies related to power transformer \nlifetime and its load factor: \n1. Janny Olny Wuwung, 2010. Here, effect of loading\nprocess to temperature increment in oil-submerged \ntransformer is studied. Results of this study show \nthat increment of loading factor raises aging factor \nthat decrease the lifetime of a transformer. \n2. Syafriyudin, 2011. In this study, transformer time of\nuse prediction is calculated from daily voltage and \ncurrent. Results of this study is that time of use of a \ntransformer is reduced 8 months out of its normal \ntime. \n3. Sofyan and Afryastuti Herawati, 2015, studied effect\nof, loading process to efficiency and lifetime of \ntransformer based on IEC 60076-7. Results of their \nresearch show that the highest efficiency of \n96.66% occurs in peak load. \n4. Winarso, 2014. Time of use of a transformer is\npredicted from daily voltage and current \ncalculation. Results of this paper shows that for \ntransformer with 5 years lifetime, it can be used for \nonly 4 years and 7 months.    \nII. B\nASIC CONCEPT\nTransformer is a robust magnetoelectric tool used to \nchange voltage. In general, Transformer composed by core \nformed by iron plate and two coils, primary and secondary \ncoil. Ratio of voltage change depends ratio of those two \ncoils (Abdul Kadir). Turn ratio of transformer is a deciding \nfactor of the transformer type. If the turn ratio is lower than \none, it is a step-up transformer. Otherwise, turn ratio that is \nhigher than one means that the transformer is a step down \none (Sumanto). \nDistribution transformer used to distribute power to \ncustomers. A proper election of distribution transformer \ncapacity is highly decided by the supplied load; therefore, it \ncan support the continuity of service, reliability, and \ntransformer lifetime. Distribution transformer reach \nmaximum efficiency when it is loaded until 80 percent of its \ncapacity. When the load is too high, it is required to change \nthe transformer, to insert new transformer, or to shift \ntransformer (low-loaded transformer is shifted to serve \nhigh-loaded transformer or vice versa). Equation 1 is used \nto calculate distribution transformer rating where pf is \npower factor (cos phi = 0.85). \nDistribution transformer rating (KVA) = Load (KW)/pf  (1) \nPrediction of Transformer lifetime can be analyzed \nthrough error value of transformer load. Error value of \ntransformer is counted by using Equation 2. \n%  100  *xP\nP PE −=  (2) \nw\nhere : \nE   = Error value ( % ) \nP   = Threshold value of transformer usage (80%) \nP* = I ( % ) + V ( % ) + P ( % ) \nMeanwhile, each percentage value of I, V, and P can be \ncalsulated by these methods: \n%) (   100     (%)  xInom\nIbebanInomI −=  (3) \n%) (   100   (%)  xVinput\nVoutputVinputV −= (4) \n%) (   100   (%)  xPnom\nPbebanPnomiP −= (5) \nV\nSInom\n3\n=  (6) \nW\nhere : \nS  = Pnom = Power of power transformer ( KVA ) \nInom = Phase current (A) \nV  = Vinput = Phase voltage ( V ) \nVoutput  = V\nL = Load voltage from experiment ( V ) \nIbeban  = I L = Current from experiment ( A ) \nPbeban  = Load power ( KW ) \nLoad power is calculated by using equation 7. \nφcos 3L Lbeban I V P=   (7) \nJournal of Electrical, Electronics and Informatics, Vol. 2 No. 2, August 2018 \n27 \nIf load current IL is current that transfers power to load in \na balance mode, therefore, in the curent power \ntransmission with unbalance mode, value of load current \ncan be stated with a, b, and c coefficients as it are shown \nin equation 8 where I\nR, IS, dan IT  are load current in each \nphase, R, S, and T. \n[ ] [ ]\n[ ] [ ]\n[ ] [ ] I a I\nI a I\nI a I\nT\nS\nR\n=\n=\n=\n  (8) \nIf power factors in these three phases is equal, even each \ncurrent is different, transmitted power can be stated by \nequation 9. \nφcos 3  ) (L Lbeban I V c b a P+ + =   (9) \nDue to the imbalanced load in each phase of secondary \ntransformer, it is current to traverse the neutral of \ntransformer, where this current causes losses. Losses \nvalue in the neutral of transformer can be calculated using \nequation 10. In this equation, P\nN is losses in the neutral \nconductor of transformer (Watt), I N is current arises in \nneutral conductor (Ampere), and R N is resistance in \nneutral conductor (Ohm) \nN N NR I P\n2\n=  (10) \nAfterwards, percentage of transformer lifetime is \nc\nalculated through equation 11 \nTransformer lifetime (%) = 100(%) – E(%)  (11) \nIf it is predicted that transformer can be used until 10 \nyears, therefore its lifetime is calculated as folows. \nLifetime (day) is lifetime(%) multiply by 3600 days. Or it \ncan be calculated by lifetime (year) which is lifetime(day) \ndivide by 3600 days. \nIII. M\nETHODOLOGY\nT\nhis research was conducted in three distribution \ntransformers: DS 137 located in Tirta Nadi street, DS 263 in \nDanau Tamblingan street, and DS 363 which is located in \nPulau Serangan street. These transformers are selected due \nto the early data from PT. PLN Bali South Regian in 2016., \nwhich is corresponding to the loading criteria of this \nresearch, 50% - 60%, 70% - 80%, and 80% - 90%. Data of \neach transformer is: \n• DS 137 brand of B.D, installed in 2011, capacity\nof 250 KVA, 380/220 V, load of 47.91%. \n• DS 263 brand of Unindo, installed in 2011,\ncapacity of 250 KVA, 380/220 V, load of \n71.37%. \n• DS 363 brand of Trafindo, installed in 2011,\ncapacity of 250 KVA, 380/220 V, load of \n83.24%. \nMeasurement was conducted from 19.00 until 20.00, \nwhich is time of peak load. This schedule was repeated for \nseven days. The tool used is Clamp Power Meter. \nIV. R\nESULTS\nR\nesults of our research are shown in Table 1, 2, and 3, \nfor DS 137, DS 263, and DS 363 respectively. \nTable 1 \nMeasurement results of DS 137 \nIR IS IT IN RS RT ST RN SN TN\n1 163 178 185 57 391 401 398 227 225 231\n2 184 193 205 47 391 400 397 227 225 229\n3 114 124 223 95 398 390 400 223 231 227\n4 98 67 81 37 403 397 409 228 235 231\n5 193 151 163 58 387 398 395 225 223 229\n6 193 151 163 58 387 398 395 225 223 229\n7 123 48 122 80 394 387 401 223 230 226\nT\notal 1068 912 1142 432 2751 2771 2795 1578 1592 1602\nAverage 152.57 130.29  163.14 61.714 393 395.86 399.29 225.43 227.43 228.86\nDay\nMEASUREMENT RESULTS\nCURRENT  (AMPERE) VOLTAGE  ( VOLT )\nPHASE NEUTRAL PHASE\nTable 2 \nMeasurement results of DS 263 \nIR IS IT IN RS RT ST RN SN TN\n1 282 265 251 46 385 397 392 223 221 227\n2 196 246 260 90 383 394 391 223 220 225\n3 199 216 269 91 395 387 397 224 226 225\n4 324 257 186 143 389 403 398 227 225 230\n5 259 258 273 112 388 380 397 220 227 226\n6 266 339 266 125 380 397 387 224 218 227\n7 267 197 303 164 388 380 396 219 229 224\nTotal 1793 1778 1808 771 2708 2738 2758 1560 1566 1584\nAverage 256.14 254.00  258.29 110.14 386.86 391.14 394.00  222.86 223.71 226.29\nDAY\nMEASUREMENT RESULTS\nCURRENT  (AMPERE) VOLTAGE  ( VOLT )\nPHASE NEUTRAL PHASE\nT\nable 3 \nMeasurement results of DS 363 \nIR IS IT IN RS RT ST RN SN TN\n1 323 301 284 134 402 397 405 224 233 231\n2 300 362 318 103 391 387 397 223 227 224\n3 253 339 375 158 399 404 401 232 228 232\n4 291 370 306 123 396 390 398 225 226 228\n5 300 318 384 135 391 383 396 222 228 223\n6 389 296 401 130 390 398 395 228 224 227\n7 375 378 308 174 395 392 401 224 230 228\nTotal 2231 2364 2376 957 2764 2751 2793 1578 1596 1593\nAverage 318.71 337.71  339.43 136.71 394.86 393 399.00  225.43 228 227.57\nDAY CURRENT  (AMPERE) VOLTAGE  ( VOLT )\nPHASE NEUTRAL PHASE\nMEASUREMENT RESULTS\nV\n. DISCUSSION \nResults of lifetime calculation in each distribution \ntransformer are shown in Table 4, 5, and 6, for DS 137, DS \n263, and DS 363 respectively. \nJournal of Electrical, Electronics and Informatics, p-ISSN: 2549 - 8304 e-ISSN : 2622 - 0393 \n28 \nTable 4 \nDS 137 with 50% - 60% load \nPnominal, (250 KVA = 250000 VA) 250,000.00   VA\n294,117.65   Watt\nPower faktor 0.85   \nV input 220.00   V/phase\nI nominal  (eq. 6) 379.69   A/phase\nI load 148.67   A/phase\nVoutput 227.24   V/phase\nPload (eq. 7) 49,677.50   Watt\n49.68   KW\nPercentage value :\nI (%), eq. 3 60.84   %\nV (%), eq. 4 (3.29)   %\nP (%), eq. 5 83.11   %\nP*, e1. 6 140.66   %\nError, eq 1 (75.83)   %\nLifetime, eq 11 175.83   %\nLifetime in day 6,329.90   day\nLifetime in year 17.58   year\nTable 5. DS 263 with 70% - 80% load \nPnominal, (250 KVA = 250000 VA) 250,000.00   VA\n294,117.65   Watt\nPower faktor 0.85   \nV input 220.00   V/phase\nI nominal  (eq. 6) 379.69   A/phase\nI load 256.14   A/phase\nVoutput 224.29   V/phase\nPload (eq. 7) 84,479.02   Watt\n84.48   KW\nPercentage value :\nI (%), eq. 3 32.54   %\nV (%), eq. 4 (1.95)   %\nP (%), eq. 5 71.28   %\nP*, e1. 6 101.87   %\nError, eq 1 (27.33)   %\nLifetime, eq 11 127.33   %\nLifetime in day 4,584.03   day\nLifetime in year 12.73   year\nTable 6 \nDS 363 with 80% - 90% load \nPnominal, (250 KVA = 250000 VA) 250,000.00  VA\n294,117.65  Watt\nPower faktor 0.85   \nV input 220.00   V/phase\nI nominal  (eq. 6) 379.69   A/phase\nI load 331.95   A/phase\nVoutput 227.00   V/phase\nPload (eq. 7) 110,806.87  Watt\n110.81   KW\nPercentage value :\nI (%), eq. 3 12.57   %\nV (%), eq. 4 (3.18)   %\nP (%), eq. 5 62.33   %\nP*, e1. 6 71.72   %\nError, eq 1 10.36   %\nLifetime, eq 11 89.64   %\nLifetime in day 3,227.21   day\nLifetime in year 8.96   year\nT\nhese calculation results show that the higher the given \nload, affects to the diminished of lifetime of distribution \ntransformer. Finally, Figure 1 shows the relations between \nlifetime and loading factor of power transformer. \nFig. 1. Relation between loading factor and lifetime. \nVI. CONCLUSIONS\nL\noading in power transformer affects lifetime. The higher \nthe load the shorter the lifetime. If it is assumed that power \ntransformer can be used for 10 years, transformer DS 137 \nwith brand of B.D then can be used for 11.58 years when it \nis loaded only 50% to 60% of its capacity. Meanwhile, DS \n263 with brand of Unindo with load of 70% to 80% of its \ncapacity, can be used for 6.73 years. Lastly, DS 363 with \nbrand of Trafindo, where it is loaded with 80% to 90% of \nits capacity, its lifetime is only 2.96 years. \nVII. A\nCKNOWLEDGMENT\nW\ne would like to express our sincere gratitude to: \n1.Rector of Udayana University, through Dean of Faculty\nof Engineering for the grant with value of 25.000.000\nIDR, where therefore this research can be finished.\n2.Head and secretary of the Electrical Engineering\nDepartment, students, colleges who have collaborated to\nfinish this research.\nR\nEFERENCES \n[1] Abdul Kadir, 1989. Transformator. Penerbit PT. Elex Media \nKomputindo – Kelompok Gramedia, Jakarta \n[2] Janny Olny Wuwung, (2010). Pengaruh Pembebanan terhadap \nKenaikan Suhu pada Belitan Transformator Daya Jenis Terendam \nMinyak. Jurnal Tekno, Volume 07, No. 52, April 2010. \n[3] Sumanto, 1991. Teori Transformator. Edisi Pertama, Cetakan \nPertama. Penerbit Andi Offset, Yogjakarta. ISBN : 979–533–047-0. \n[4] Syafriyudin, (2011). Perhitungan Lama Waktu Pakai Trasformator \nJaringan 20 kV di APJ Yogjakarta. Jurnal Teknologi, Volume 4 \nNomor 1, Juni 2011, 88-95. \n[5] Sofyan, Afriyastuti Herawati, (2015). Pengaruh Pembebanan \nterhadap Effisiensi dan Usia Transformator (Studi Kasus \nTransformator IV Gardu Induk Sukamerindu Bengkulu) Berdasarkan \nStandar IEC 60076-7. Jurnal Amplifier, Vol. 5 No.2 Nopember \n2015. ISSN : 2089-2020. \n[6] Winarso, (2014). Estimasi Umur Pakai dan Rugi Daya \nTransformator. Jurnal Techno, ISSN 1410-8607, Volume 15, No. 2, \nOktober 2014. Hal. 50-55. "
}