{
  "title": "Characteristics of Tin Oxide Chromatographic Detector for Dissolved Gases Analysis of Transformer Oil",
  "url": "https://openalex.org/W2963443584",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A2437715549",
      "name": "Jingmin Fan",
      "affiliations": [
        "Guangdong University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2098541740",
      "name": "Zhe Liu",
      "affiliations": [
        "Guangdong University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2125554493",
      "name": "Anbo Meng",
      "affiliations": [
        "Guangdong University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2074142434",
      "name": "Hao Yin",
      "affiliations": [
        "Guangdong University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2169149184",
      "name": "Qiuqin Sun",
      "affiliations": [
        "Hunan University"
      ]
    },
    {
      "id": "https://openalex.org/A1844404117",
      "name": "Feng Bin",
      "affiliations": [
        "Hunan University"
      ]
    },
    {
      "id": "https://openalex.org/A2564039668",
      "name": "Qinji Jiang",
      "affiliations": [
        "Hunan Entry-Exit Inspection and Quarantine Bureau"
      ]
    },
    {
      "id": "https://openalex.org/A2437715549",
      "name": "Jingmin Fan",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2098541740",
      "name": "Zhe Liu",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2125554493",
      "name": "Anbo Meng",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2074142434",
      "name": "Hao Yin",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2169149184",
      "name": "Qiuqin Sun",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A1844404117",
      "name": "Feng Bin",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2564039668",
      "name": "Qinji Jiang",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2268544019",
    "https://openalex.org/W2468506054",
    "https://openalex.org/W2742135976",
    "https://openalex.org/W1541794730",
    "https://openalex.org/W2020659689",
    "https://openalex.org/W2045220271",
    "https://openalex.org/W2084315560",
    "https://openalex.org/W2520372397",
    "https://openalex.org/W2059694873",
    "https://openalex.org/W2186931981",
    "https://openalex.org/W1676292264",
    "https://openalex.org/W2773555592",
    "https://openalex.org/W2810543390",
    "https://openalex.org/W2740550225",
    "https://openalex.org/W2564154840",
    "https://openalex.org/W1975343535",
    "https://openalex.org/W2769207572",
    "https://openalex.org/W2070496415",
    "https://openalex.org/W4298371199",
    "https://openalex.org/W561982180",
    "https://openalex.org/W2496143465",
    "https://openalex.org/W2623582121",
    "https://openalex.org/W2781785412",
    "https://openalex.org/W2486438534",
    "https://openalex.org/W2076648724",
    "https://openalex.org/W2117078830",
    "https://openalex.org/W2770049107",
    "https://openalex.org/W2093216892",
    "https://openalex.org/W1549061400",
    "https://openalex.org/W1964484746",
    "https://openalex.org/W2104790361",
    "https://openalex.org/W2759312067",
    "https://openalex.org/W2475364033",
    "https://openalex.org/W2809176070",
    "https://openalex.org/W2773421469",
    "https://openalex.org/W2624986515",
    "https://openalex.org/W2797352045"
  ],
  "abstract": "The analysis of dissolved gases in insulation oil is of great significance to transformer status evaluation. In this paper, a chromatographic detector based on the nano-tin oxide fiber as well as a chromatography system is developed. The mechanism of the sensor for detecting six component feature gases (i.e., H<sub>2</sub>, CO, CH<sub>4</sub>, C<sub>2</sub>H<sub>4</sub>, C<sub>2</sub>H<sub>6</sub>, and C<sub>2</sub>H<sub>2</sub>) in transformer oil is expounded, on basis of which the exponent-logarithmic model between conductance and gas concentrations is proposed. Then, the repeatability and accuracy of the nano-tin oxide detectors are tested. The experimental results show that the gases mixture can be separated well by the designed gas chromatography system, and six component gases mixture detection can be realized by the developed detector. Meanwhile, by using the proposed model, high precision of dissolved gas measurement can be achieved, thus the validity of the presented model is verified. Moreover, compared with other chromatographic detectors, i.e., flame ionization detector, the only carrier gas needed for the nano-tin oxide chromatographic detector is the synthetic air, the hardware cost and complexity of system are reduced largely, showing promising applicable value in the engineering practice.",
  "full_text": "Received May 26, 2019, accepted July 9, 2019, date of publication July 17, 2019, date of current version July 30, 2019.\nDigital Object Identifier 10.1 109/ACCESS.2019.2928869\nCharacteristics of Tin Oxide Chromatographic\nDetector for Dissolved Gases Analysis\nof Transformer Oil\nJINGMIN FAN\n 1, (Member, IEEE), ZHE LIU1, ANBO MENG1, HAO YIN1,\nQIUQIN SUN\n 2, FENG BIN2, AND QINJI JIANG3\n1School of Automation, Guangdong University of Technology, Guangzhou 510012, China\n2College of Electrical and Information Engineering, Hunan University, Changsha 410082, China\n3State Grid Hunan Maintenance Company, Changsha 41007, China\nCorresponding author: Qiuqin Sun (sunqq@hnu.edu.cn)\nThis work was supported by the National Natural Science Foundation of China under Grant 61876040 and Grant 51677061.\nABSTRACT The analysis of dissolved gases in insulation oil is of great signiﬁcance to transformer\nstatus evaluation. In this paper, a chromatographic detector based on the nano-tin oxide ﬁber as well\nas a chromatography system is developed. The mechanism of the sensor for detecting six component\nfeature gases (i.e., H 2, CO, CH 4, C 2H4, C 2H6, and C 2H2) in transformer oil is expounded, on basis of\nwhich the exponent-logarithmic model between conductance and gas concentrations is proposed. Then,\nthe repeatability and accuracy of the nano-tin oxide detectors are tested. The experimental results show\nthat the gases mixture can be separated well by the designed gas chromatography system, and six component\ngases mixture detection can be realized by the developed detector. Meanwhile, by using the proposed model,\nhigh precision of dissolved gas measurement can be achieved, thus the validity of the presented model is\nveriﬁed. Moreover, compared with other chromatographic detectors, i.e., ﬂame ionization detector, the only\ncarrier gas needed for the nano-tin oxide chromatographic detector is the synthetic air, the hardware cost and\ncomplexity of system are reduced largely, showing promising applicable value in the engineering practice.\nINDEX TERMS Power transformer, chromatography, dissolved gas analysis, nano-tin oxide detector.\nI. INTRODUCTION\nIn the past decades, with the construction of intelligent power\ngrid [1], as well as the digitalization and informatization\nof substations [2], [3], the periodical maintenance of power\ntransformer will be replaced by the condition based mainte-\nnance gradually [4], [5]. To achieve this, it is the basis that\nthe data of the power transformer status is collected [6], [7].\nDissolved gas analysis (DGA) of transformer oil is one of\nthe most important methods to detect the latent fault of\noil-immersed power transformers [8]. It is worth mentioned\nthat the accuracy and stability of the measuring instrument\nare affected by gas sensors greatly [9]–[12].\nNowadays, the on-line monitoring devices of DGA based\non various gas sensors [13]–[17] have been widely used in\nthe ﬁeld of transformer status evaluation. Researchers around\nthe world have made a lot of progresses in the development of\ngas sensors for on-line DGA monitoring. However, there also\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Hui Ma.\nexist many defects, such as the SOFC detector [17], [18] has\nhigh sensitivity but limited detection range, thermal conduc-\ntivity sensor [19] are responsive to all gases, but the sensitivity\nis low, and high-cost helium is needed to be carrier gas. Flame\nionization detector (FID) [20], has both high sensitivity and\nrelative wide detection range, but three types of carrier gases\nare needed, including hydrogen which is not allowed to be\nused in substation. Moreover, too many carrier gases lead\nto complex pipeline system. The photoacoustic spectroscopy\nsensor (PSS) [6], [9] does not need any carrier gas, nor does\nthe separation of mixed gas, but the sensitivity is low, and the\ninterference of electromagnetic noises is heavy. Meanwhile,\nthe cost of PSS is high.\nIn order to monitor the status of the oil-immersed power\ntransformers more efﬁciently and economically, the defects\nof these gas sensors, i.e., the measuring accuracy, cross sensi-\ntivity, long-term stability, and high cost of gas sensors should\nbe improved. Hence, new types of gas sensors are needed\nto be designed. Recently, with the development of non-\nmaterial technology [21], sensors developed by nanometer\n94012 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see http://creativecommons.org/licenses/by/4.0/VOLUME 7, 2019\nJ. Fanet al.: Characteristics of Tin Oxide Chromatographic Detector for Dissolved Gases Analysis of Transformer Oil\nsemiconductor materials have been applied to the gas detec-\ntion ﬁeld, such as Zhou [22], [23] et al. studied CO gas sen-\nsors based on SnO 2 nanomaterials with different dopant, and\nhigh sensitivity CO gas sensor was developed; Lin [24] et al.\ninvestigated the H2 sensing properties of Pt-loaded SnO 2 hol-\nlow microspheres, and hydrogen sensor at room temperature\nis obtained with fast response properties. However, only one\nkey characteristic gas is studied in these studies.\nActually, the semiconductor gas sensor is sensitive to most\nof the fault gases dissolved in transformer oil. This phe-\nnomenon is called cross-sensitivity. In practical application\nof DGA, the gases are mixtures. Hence, the selectivity and\nquantitative accuracy problem of semiconductor gas sensor\nis still to be solved for the detection of mixed gas. To address\nthis problem, Fan [15], [25] et al. applied the SnO 2 sen-\nsor as a chromatographic detector which is used for DGA,\npromising experimental results are obtained. The above stud-\nies mainly concentrate on low concentration gases detection,\ni.e., H 2 <100ppm. For practical engineering application,\nthere may be higher concentrations, e.g., hydrocarbons may\nrise up to 1000ppm (0.1%) due to partial discharge faults.\nTo promote the performance of SnO 2 detector further,\nin this work, the detection characteristics of nanometer tin\noxide sensor are studied; then, a quantitative mathematical\nmodel on basis of exponent-logarithmic model is constructed.\nFurther, the preparation process, test steps of the developed\nnanometer tin oxide sensor is introduced. To promote the\ndetection limit of SnO 2 detector, the chromatographic signal\nnoise reduction algorithms based on different wavelet are\nstudied. The experiment results show that the gas chromatog-\nraphy detection technology of nanometer tin oxide can realize\ndetection of the fault characteristic gases, i.e., H 2, CH4, CO,\nC2H4, C 2H6, and C 2H2 without cross-sensitivity. Based on\nthe mathematical model as well as the noise reduction algo-\nrithm constructed in this paper, wide measurement range as\nwell as high precision can be achieved simultaneously. Mean-\nwhile, only air is needed to be carrier gas, the overall cost\nof the system is reduced, which has important popularization\nvalue.\nII. DETECTOR FABRICATION AND\nQUANTIFICATION MODEL\nGiven that the SnO 2 gas sensors is used as an chromato-\ngraphic detector in this paper, namely, H 2, CO, CH 4, C 2H4,\nC2H6, C 2H2 are separated though chromatographic column\nand detected simultaneously. Hence, considering the sen-\nsitivity equilibrium for all gases, none speciﬁc dopant is\nadded and pure SnO 2 is adopted. In this work, the tin\noxide nano-materials are prepared by electrospinning [26].\nTo verify the nanostructures of the samples, XRD, TEM and\nHRTEM are performed; the corresponding images are shown\nin Figs.1 (a)-(c). The diffraction peaks match well with the\nstandard data of rutile structured SnO 2 crystal (JCPDS ﬁle\nno.41-1445). It is notably that the diameter of SnO 2 ﬁber is\nabout 100∼200nm and the lattice distance on (110) surface is\n0.334nm. The nanometer tin oxide materials are fully grinded\nFIGURE 1. SnO2 fiber characterization images and schematic diagram of\nNano-SnO2 sensor.\nin the agate mortar, adding the appropriate anhydrous ethanol\nand deionized water to make the slurry, brushing on the\nalumina ceramic tube with electrode leads which are welded\non the surface of the tube.\nThe package with the sensor is installed in a gas chromato-\ngraphic instrument developed in this paper. The schematic\ndiagram of Nano-SnO 2 sensor is shown in Fig.1. When act-\ning as a chromatographic detector, the characteristic gases\nextracted from transformer oil is brought into chromato-\ngraphic column (CC) by carrier gas (99.999% synthetic air),\nand the temperature of CC as well as the sensor package\nare set to 60 ◦C. Due to the difference of the distribution\ncoefﬁcients between the gas and the CC [28], the charac-\nteristic gases are separated in sequence. The separated six\ngases ﬂow into the sensor package as shown in Fig.2, and\nthen ﬂow out after a sensitive reaction occurs on the surface\nof the detector. When the combustible gases react with the\noxygen adsorbed on the surface of the sensor, the electrons are\nreleased into the depletion layer of the sensing material, hence\nleading to augment of the conductivity [16], and the output\nvoltage becomes larger. Hence, the output voltage signal is\nproportional to the conductance of the nanometer tin oxide\ndetector.\nAccording to the theoretical analysis, the detector is mostly\nused to detect reductive gases; it is not sensitive to other\ngases such as nitrogen, carbon oxide, et al. For the anal-\nysis of dissolved gas in oil, gas detection is performed\nVOLUME 7, 2019 94013\nJ. Fanet al.: Characteristics of Tin Oxide Chromatographic Detector for Dissolved Gases Analysis of Transformer Oil\nFIGURE 2. Simulated chromatogram without noise.\nafter separation, which avoids the cross sensitivity of tra-\nditional detection method. In terms of quantitative model,\nthe mathematical model proposed in [15] is mainly applied\nfor hydrogen <100ppm, as well as hydrocarbons <300ppm.\nHowever, hydrogen may rise up to 0.1% due to partial\ndischarge faults. Hence, the measurement range should be\nfurther improved. Considering that the inverse equation of\nEq.(15) in Ref. [15] contains the Lambert W function [27],\nwhich is complicated in practical application. Meanwhile,\nthe fault feature gases are limited within a certain concentra-\ntion interval (<1000ppm usually), hence the relation between\nconductance and gas concentration can be approximated well\nby exponent-logarithmic model, which is :\nG =a1 exp(a2 ln(C)) +a3 (1)\nIn Eq.(6), a 1, a 2 and a 3 are the parameters determined by\ndifferent gases. When none combustible gases exist on the\nsurface of the sensor, electrons transferred to adsorbed oxy-\ngen, the number of electrons on the semiconductor surface\ndecreases, leading to increment of the gas sensor’s resistivity.\nOn the other hand, when combustible gases contact with the\nsensor, reactions between the tested gas and oxygen ions\nrelease electrons, leading to increment of the gas sensor’s\nconductivity. Correspondingly, the change amount of con-\nductivity is proportional to the concentration of combustible\ngas (CG), the higher concentration of the CG, the greater\nchange of the conductivity.\nGenerally, peak height or peak area is used as the quanti-\ntative method of gas chromatography, according to the linear\nrelationship between peak height (or peak area) and gas con-\ncentration. Based on which, the unknown gas concentration\nis determined by the look-up-table method. According to\nEq.(1) which is not linear, shows that the conductivity of\nthe semiconductor tin oxide sensor is exponent-logarithmic\nrelated to the gas concentration change, and there would be\nlarge error if using the traditional peak height or peak area\nlinear ﬁtting method. For semiconductor tin oxide sensor,\nthe change of peak height or peak area is the change of\nconductance. In practical application, to determine the three\nparameters: a1, a2, a3, the sensor should be calibrated. When\nthe gas concentration is C 1 which corresponds to the con-\nductance of the sensor is G 1, the gas concentration is C 2\nwhich corresponds to the conductance of the sensor is G 2,\nhence, for n different concentrations of standard gases, the\ncorresponding concentration and conductance of vectors can\nbe written as: G =(G1, G 2 ... Gn), C =(C1, C 2 ... Cn).\nSubstitute the two vectors into Eq.(1), an equation group can\nbe obtained:\n\n\n\nG1 =a1 exp(a2 ln(C1)) +a3\nG2 =a1 exp(a2 ln(C2)) +a3\n...\nGn =a1 exp(a2 ln(Cn)) +a3\n(2)\nBy using least square method, the nonlinear equation group\ncan be solved, and the value of the parameters a 1, a2, a3 can be\ndetermined. On this basis, the unknown concentration C can\nbe obtained according to the measured conductance change\nG. For DGA application of this paper, the sensor is calibrated\nby using ﬁve sets of standard gases to determine the model\nparameters.\nIII. EXPERIMENT\nDue to the cross sensitivity of the semiconductor sensor, the\ncharacteristic gases must be separated before detection. The\nseparation of gas mixtures using GC is based on the fact\nthat that the adsorption coefﬁcient is different between gases\nand stationary phases [28], and the separation is realized by\nthe chromatographic column. There are two factors, namely,\namount of sampling gas and separation degree which affect\nperformance of the GC system directly. The consistency of\nformer has great inﬂuence on the measurement repeatability,\nwhile the later is evaluated by the retention time (RT) differ-\nences of each component.\nIn order to validate the correctness of the proposed model\non the developed sensor, a chromatography instrument is\ndeveloped. The sensor is integrated with the temperature\ncontrol as well as data acquisition module [25], the latter\nconvert resistance of the sensor into the voltage. The collected\ndata is sent to the special chromatographic software. When\nthe test process is performed, the package of the sensor and\nCC are set to 60 ◦C. Prepare the standard gas from high to low\nconcentration as different samples. After the temperature of\nCC stabilized at 60 ±0.1◦C, as well as the ﬂuctuation of base-\nline is less than 0.5mV/min, the prepared samples are then\ntransferred to the sampling loop, and then the chromatogram\nis sampled and recorded by utilizing the data acquisition\nunit. There may exist trace concentration of propane in the\nmixture gases extracted from the oil. Its concentration is so\nlow that there may be only a slight ﬂuctuation of the baseline.\nConsidering the baseline stabilization, after the last peak,\ni.e., C2H2, ﬂows out from the column, another 15min are\nreserved before next experiment so that propane can ﬂow out\nas one single peak in this period.\nA. SIGNAL PROCESSING\nTo separate small peaks from the chromatographic signal (for\ndetection of incipient transformer faults), signal denoising is\ncrucial to promote signal-noise-ratio (SNR) [28]. In terms\n94014 VOLUME 7, 2019\nJ. Fanet al.: Characteristics of Tin Oxide Chromatographic Detector for Dissolved Gases Analysis of Transformer Oil\nof chromatographic signal denoising, discrete wavelet the-\nory (DWT) is used largely, and the detail of which can refer\nto [29], [30]. Actually, the denoising is based on the fact that\nthe DWT decomposition coefﬁcients of the chromatogram\nare restricted to approximation coefﬁcients, the signal com-\nponents are large, while the amplitude of noises’ coefﬁcients\nare small and distributed in detailed coefﬁcients [29], [30].\nHence, though thresholding the small coefﬁcients, the denois-\ning of the signal can be realized. When the DWT is per-\nformed for denoising, many parameters are needed to be\ndetermined [31].\nIn order to reconstruct the signal perfectly after wavelet\ndenoising, orthogonal mother wavelet should be chosen [31],\ne.g., Coiﬂet, Symlet and Daubechies, et al. In terms of the\nsecond parameter, namely, the decomposition levels should\nbe determined carefully such that the noise components can\nbe eliminated efﬁciently. The wavelet and decomposition\nlevel k can be determined by the method proposed in [32]\nin practical application.\nThe third parameter is threshold value, which is critical\nin DWT. A small threshold value is ineffective to eliminate\nnoises, while the useful signal components would be lost if\na large value of threshold is selected. Presently, the most\nwidely used methods for threshold estimation [31], [33] are\n‘rigrsure’, ‘heursure’, ‘sqtwolog’, and ‘minimaxi’, respec-\ntively. The ‘sqtwolog’ method determines the threshold by\nthe length of the signal, but content of the signal is not\ntaken into account. ‘minimaxi’ is evaluated by minimizing the\nmaximum risk of estimation error, and it is a ﬁxed threshold\nmethod. In terms of ‘rigrsure’ method, a threshold value is\ndetermined by minimizing the Steins unbiased risk estima-\ntion (SURE). For ‘heursure’ method, one of ‘sqtwolog’ or\n‘rigrsure’ method is selected after SNR estimation. In fact,\ndifferent methods yield to different results [34].\nThe threshold function is the fourth parameter, it deter-\nmines the way to for wavelet coefﬁcients treatment based on\nthe threshold value. Commonly, there are two types of thresh-\nold functions, namely soft and hard functions. For two types\nof threshold functions, the coefﬁcients which are smaller than\nthe thresholds are set to zeros. The other coefﬁcients are\nshrunk by using soft threshold function. However, in hard\nthreshold function they remain unchanged. Generally, larger\nSNR value can be obtained by using hard threshold function;\nhowever, there are discontinuities in the reconstructed signal.\nHence, soft threshold function is applied in this paper.\nIn this paper, the genetic threshold wavelet algorithm\n(GTWA) [25] is adopted for signal denoising. To determine\noptimal parameters for weak signal extraction, the noisy chro-\nmatogram is simulated using the following expression [28]:\nf (t)=\nN∑\ni=1\nAi\nσ\n√\n2π\nexp[−1\n2(t −tRi\nσ )2], i =1,2,... N. (3)\nwhere A i is the area of i th peak, t Ri is the retention time\nof the i th peak. Because the characteristic gas dissolved in\ntransformer oil have six components, i.e., H 2, CO, CH 4,\nTABLE 1. Parameters of simulated chromatogram.\nFIGURE 3. Simulated noise.\nFIGURE 4. Simulated chromatogram with noise addition.\nCH4, C2H6, and C 2H2, six chromatographic peaks have been\nsimulated and produced. Similar to the actual application,\nall chromatographic peaks are concentrated in 15 minutes,\nthe baseline is set to 200mV . The detailed parameters of\nthe simulation are shown in Table 1, and the corresponding\nsimulated chromatogram is shown in Fig.2.\nIn the actual engineering application, due to the noises\nin chromatogram, random noises are added to the chro-\nmatogram in the simulation. The additive noises are simulated\nas follows:\ns(t) =f (t) +0.5 −b ∗randn\na (4)\nwhere s(t) is the produced noisy chromatogram curve; a, b are\nthe constants to control SNR, randn is the Gaussian white\nnoise generated using MATLAB, when a =2, b =3, the sim-\nulated noise and corresponding chromatogram are shown\nin Figs.3∼4, respectively.\nIt can be seen from Fig.3 that the positive maximum value\nof noise amplitude is 6.4017mV , and the negative maximum\nvalue is -5.5696mV . In terms of the region 13 ∼15min where\nacetylene locates, the noises are 3.3908mV and -4.2067mV ,\nrespectively. However, the peak height of acetylene is only\nsetup to 2mV , which is drowned out by noise pollution. As a\nresult, Fig.4 is the simulated chromatogram which can be\nVOLUME 7, 2019 94015\nJ. Fanet al.: Characteristics of Tin Oxide Chromatographic Detector for Dissolved Gases Analysis of Transformer Oil\nFIGURE 5. Validity of signal denosing algorithm.\nFIGURE 6. Actual measured chromatogram (dissolved gas in oil) with\nnoise.\nused to verify the validity of denosing algorithm. On basis\nof this chromatogram, the signal extraction ability of the\nGTWA can be maximized, and the optimal parameters can\nbe obtained, which are as follows: decomposition level k =6,\nsym4, soft threshold function, the results are shown in Fig.5.\nAs shown in Fig.5, the weak acetylene peak can be\nextracted from the noisy chromatogram; the peak height is\n1.99mV after denosing, which almost keep the same height\n(2mV) with original signal and indicates validity of the pro-\nposed signal denosing algorithm. After the optimal wavelet\nparameters for denoising are determined by the simulated\nchromatogram, the signal extraction ability of the algorithm\non the actual measured chromatogram is needed to be ver-\niﬁed. Unlike the simulated chromatogram, the actual chro-\nmatogram is often with a baseline drift. Moreover, for most of\nthe transformer oil, the gas concentration of each component\n(especially acetylene) is low; hence the corresponding peak\nis weak, which is usually submerged by noises.\nThe actual measured chromatographic signals of four\ndeveloped detectors in this work are shown in Fig.6.\nAs shown in Fig.6, the baseline of the chromatographic\nSnO2 detector is somewhat oblique. The reason is that there\nis ‘‘baseline stabilization time’’ for any chromatographic\ndetectors, including the SnO 2 chromatographic detector.\nIt is notable that the baseline drifts are in the range\nof 0.14 ∼0.3mV/min, within which the measurement accu-\nracy is not affected.\nThe corresponding denoised chromatogram using common\nthreshold wavelet algorithm (CTWA) with sqtwolog rule and\nFIGURE 7. Sqtwolog rule of wavelet threshold denoising result vs. genetic\nwavelet algorithm using soft threshold function.\nTABLE 2. Comparison of different denoising algorithm.\nFIGURE 8. Repeatability tests using the same concentration.\nTABLE 3. Standard gas concentration for calibration (ppm).\nGTWA are shown in Fig.7. As seen from Fig.7, the GTWA\nhas better denoising effect. Compared with CTWA method,\nthe obtained chromatogram using GTWA is smoother, indi-\ncating higher SNR. However, there still exist noises after\nusing the ‘sqtwolog’ rule of CTWA, especially when the\ngas concentration is low and the noise is large. With the\nincrement of gas concentration, the peak height becomes\nlarger while the noise is unchanged, SNR becomes higher,\nthe differences between the CTWA and the GTWA decreases,\nhence GTWA is especially suitable for the extraction of the\nweak signals in the chromatograms with large noises and low\ngas concentration.\nTake acetylene for example, after wavelet denoising,\nthe SNR with different wavelet algorithm are shown\nin Table 2, from which it can be seen that the SNR with\n94016 VOLUME 7, 2019\nJ. Fanet al.: Characteristics of Tin Oxide Chromatographic Detector for Dissolved Gases Analysis of Transformer Oil\nFIGURE 9. Correlation of peak height versus logarithm of\nconcentration (H2).\nFIGURE 10. Correlation of peak height versus logarithm of\nconcentration (CO).\nGTWA is increased more than three times. Hence, the min-\nimum detection limit of acetylene will be promoted the cor-\nresponding multiples when the sensor’s sensitivity remains\nunchanged, thus providing a good foundation for discovering\nthe early faults of power transformer.\nB. QUANTITATIVE RESULTS\nFor chromatographic detector, quantitative repeatability is\nimportant for performance evaluation. The stability of peak\nheight or peak area is usually used to evaluate the repeatabil-\nity. According to reference [35], the relative standard devi-\nation (RSD) can be calculated from Eq.(5) for the sequence\nG =(G1,G2 ... Gn):\nRSD =\n√\nn∑\ni=1\n(Gi −G)2\n(n −1)G\n×100% (5)\nIn Eq.(5), n indicates the number of detection records;\nG represents the average peak height; G i represents the\nconductance of the i th records; i is the numerical record of\ntesting number. In order to test the repeatability, the standard\ngas is analyzed using the developed instrument, the standard\ngas concentrations are as follows: H 2 is 480.63 µL/L, CO is\n1835.98µL/L, CH 4 and 530.61 µL/L, C 2H4 is 578.1 µL/L,\nC2H6 is 576.51µL/L, C2H2 is 592.2µL/L. Repeat the test ﬁve\ntimes, the peak height of the chromatogram are recorded, as\nshown in Fig.8. The RSD values of the six gases tested are:\nH2:8.5%, CO:7.5%, CH 4:4.7%, C 2H4:5.6%, C 2H6:6.2%,\nC2H2:3.4%, meeting the requirements that less than 10% in\nIEC 60599-2015.\nIn order to examine performance of the detector, and verify\nvalidity of the quantitative algorithm proposed in this paper,\nbased on Eq.(1), the detector’s response to six characteristic\ngases at different concentrations shown in Table 3 were care-\nfully tested in this work, and the standard gases are stored in\ngas cylinders and produced by commercial gas company. The\ncorrelations of the logarithm of the concentration versus the\npeak height were obtained, as shown from Figs.9 ∼12.\nFrom Figs.9∼12, the ﬁtting curves show well coincidence\nfor the proposed model of which corresponding regression\nequations (RE) are listed in Table 4, as well as correlation\ncoefﬁcient, linear range, and detection limits for six char-\nacteristic gases. As shown in the Table 4, the responses of\nthe detector agrees well with the established model with a\ncorrelation coefﬁcient >0.9 for all gases (larger than 0.99 for\nfour hydrocarbons). Based on the REs, the detection lim-\nits (DL) were calculated by using double amplitude of noise\n(i.e., obtained results in Table 2) in the REs. The purpose of\nthe detector and the corresponding GC system is designed\nfor relative large concentration measurement, the DL is about\n1 ppm to hydrocarbons, e.g., 1ppm (v/v) for acetylene.\nFIGURE 11. Correlation of peak height versus logarithm of concentration (CH4\\C2H4).\nVOLUME 7, 2019 94017\nJ. Fanet al.: Characteristics of Tin Oxide Chromatographic Detector for Dissolved Gases Analysis of Transformer Oil\nFIGURE 12. Correlation of peak height versus logarithm of concentration (C2H6/C2H2).\nTABLE 4. Parameters of fitting curve and performance of the detector.\nUsually, regarding DGA for power transformer, FID +\nTCD is the frequent used detector in laboratory, whose results\ncan be taken as references for other sensors, e.g., SnO 2 sensor,\nSOFC, or PSS. In order to compare the results with FIDs,\nexperiments are performed to test the same sample gas using\nthe developed detector. Compared with FID +TCD, all of the\nrelative errors are less than 10%, which indicates that similar\nmeasurement precision can be achieved by utilizing the chro-\nmatographic detector of this work and proposed quantitative\nalgorithm. Notably, only air is needed to be the carrier gas,\nbased on which the hardware cost of the GC is reduced.\nUnlike FID +TCD, no hydrogen which is ﬂammable gas\nis needed, hence the structure of the system is simpliﬁed\nand the security can be improved. It is worth mentioning\nthat the degassing process of transformer oil is not consid-\nered in the calculation process, in the practical application\nof engineering, gas extraction methods, e.g., shaking tech-\nnique [36], or vacuum degasiﬁcation [37] are commonly used\ntechniques, in which the degassing rate and oil temperature\nshould be considered, and the gas-in-gas value should be\ncorrected to obtain the ﬁnal gas-in-oil results.\nIV. CONCLUSION\n(1) The gas sensing mechanism for measuring six-\ncomponent gases dissolved in transformer oil by\nnanometer tin oxide semiconductor chromatographic\ndetector is expounded. A GC system based on one-\ndimensional nanometer tin oxide ﬁber material is\ndeveloped.\n(2) To extract small peaks from the chromatographic sig-\nnal, GTWA method is adopted for chromatogram\ndenoising. The exponent-logarithmic model between\nthe conductance of SnO 2 sensor and combustible gas\nconcentration has been proposed, based on which the\nrepeatability and accuracy are tested, and the validity\nof the proposed model was validated.\n(3) Combined gas chromatographic system with nanome-\nter tin oxide detector, the cross-sensitivity problem\nof mixture detection can be effectively solved. Mean-\nwhile, the exponent-logarithmic quantitative model\nproposed in this paper is more suitable than the tradi-\ntional linear ﬁtting method on basis of chromatographic\npeak height or peak area. Only air is needed to be\ncarrier gas, which reduces the cost and complexity of\nthe hardware system, has important engineering appli-\ncation value.\nREFERENCES\n[1] H. Faria, Jr., J. G. S. Costa, and J. L. M. Olivas, ‘‘A review of monitor-\ning methods for predictive maintenance of electric power transformers\nbased on dissolved gas analysis,’’ Renew. Sustain Energy Rev. , vol. 46,\npp. 201–209, Jun. 2015.\n[2] Y .-C. Huang and H.-C. Sun, ‘‘Dissolved gas analysis of mineral oil\nfor power transformer fault diagnosis using fuzzy logic,’’ IEEE Trans.\nDielectr. Electr. Insul., vol. 20, no. 3, pp. 974–981, Jun. 2013.\n[3] J. Fan, F. Wang, Q. Q. Sun, F. Bin, F. Liang, and X. Xiao, ‘‘Hybrid\nRVM–ANFIS algorithm for transformer fault diagnosis,’’ IET Gener.,\nTransmiss. Distrib., vol. 11, no. 14, pp. 3637–3643, 2017.\n[4] F. C. Sica, F. G. Guimarães, R. de Oliveira Duarte, and A. J. R. Reis,\n‘‘A cognitive system for fault prognosis in power transformers,’’ Electr.\nPower Syst. Res. , vol. 127, pp. 109–117, Oct. 2015.\n94018 VOLUME 7, 2019\nJ. Fanet al.: Characteristics of Tin Oxide Chromatographic Detector for Dissolved Gases Analysis of Transformer Oil\n[5] S. A. Khan, M. D. Equbal, and T. Islam, ‘‘A comprehensive compara-\ntive study of DGA based transformer fault diagnosis using fuzzy logic\nand ANFIS models,’’ IEEE Trans. Dielectr. Elect. Insul. , vol. 22, no. 1,\npp. 590–596, Feb. 2015.\n[6] J. Jiang, M. Zhao, G.-M. Ma, H.-T. Song, C.-R. Li, X. Han, and C. Zhang,\n‘‘TDLAS-based detection of dissolved methane in power transformer oil\nand ﬁeld application,’’IEEE Sensors J., vol. 18, pp. 2318–2325, Mar. 2018.\n[7] D. Jiejie, S. Hui, and S. Gehao, ‘‘Dissolved gas analysis of insulating oil for\npower transformer fault diagnosis with deep belief network,’’ IEEE Trans.\nDielectr. Electr. Insul., vol. 24, no. 5, pp. 2828–2835, Oct. 2017.\n[8] R. Naresh, V . Sharma, and M. Vashisth, ‘‘An integrated neural fuzzy\napproach for fault diagnosis of transformers,’’ IEEE Trans. Power Del. ,\nvol. 23, no. 4, pp. 2017–2024, Oct. 2008.\n[9] Z. Mao and J. Wen, ‘‘Detection of dissolved gas in oil-insulated electrical\napparatus by photoacoustic spectroscopy,’’ IEEE Trans. Dielectr. Electr.\nInsul., vol. 31, no. 4, pp. 7–14, Apr. 2015.\n[10] Q. Zhou, W. Chen, L. Xu, and S. Peng, ‘‘Hydrothermal synthesis of various\nhierarchical ZnO nanostructures and their methane sensing properties,’’\nSensors, vol. 13, no. 5, pp. 6171–6182, 2013.\n[11] A. I. Uddin, U. Yaqoob, and G.-S. Chung, ‘‘Dissolved hydrogen gas\nanalysis in transformer oil using Pd catalyst decorated on ZnO nanorod\narray,’’Sens. Actuators B, Chem. , vol. 226, pp. 90–95, Jan. 2016.\n[12] J. Lu, X. Zhang, X. Wu, Z. Dai, and J. Zhang, ‘‘A Ni-doped carbon nan-\notube sensor for detecting oil-dissolved gases in transformers,’’ Sensors,\nvol. 15, no. 6, pp. 13522–13532, 2015.\n[13] M. Fisser, R. A. Badcock, P. D. Teal, and A. Hunze, ‘‘Optimizing the sen-\nsitivity of palladium based hydrogen sensors,’’ Sens. Actuators B, Chem. ,\nvol. 259, pp. 10–19, Apr. 2018.\n[14] B. Jang, M. Kim, J. Baek, W. Kim, and W. Lee, ‘‘Highly sensitive hydrogen\nsensors: Pd-coated Si nanowire arrays for detection of dissolved hydrogen\nin oil,’’ Sens. Actuator B, Chem , vol. 273, pp. 809–814, Nov. 2018.\n[15] J. Fan, F. Wang, Q. Sun, F. Bin, H. Ye, and Y . Liu, ‘‘An online monitoring\nsystem for oil immersed power transformer based on SnO 2 GC detector\nwith a new quantiﬁcation approach,’’ IEEE Sensors J. , vol. 17, no. 20,\npp. 6662–6671, Oct. 2017.\n[16] F. Wang, J. Fan, Q. Sun, Q. Jiang, S. Chen, and W. Zhou, ‘‘Adsorption\nmechanism of cu-doped SnO 2 (110) surface toward H 2 dissolved in power\ntransformer,’’J. Nanomater., vol. 2016, Nov. 2016, Art. no. 3087491.\n[17] J. Ding, X. Li, J. Cao, L. Sheng, L. Yin, and X. Xu, ‘‘New sensor for\ngases dissolved in transformer oil based on solid oxide fuel cell,’’ Sens.\nActuators B, Chem. , vol. 202, pp. 232–239, Oct. 2014.\n[18] J. Fan, F. Wang, Q. Sun, F. Bin, J. Ding, and H. Ye, ‘‘SOFC detector for\nportable gas chromatography: High-sensitivity detection of dissolved gases\nin transformer oil,’’ IEEE Trans. Dielectr. Electr. Insul. , vol. 24, no. 5,\npp. 2854–2863, Oct. 2018.\n[19] F. Rastrello, P. Placidi, A. Scorzoni, E. Cozzani, M. Messina, I. Elmi,\nS. Zampolli, and G. C. Cardinali, ‘‘Thermal conductivity detector for\ngas chromatography: Very wide gain range acquisition system and exper-\nimental measurements,’’ IEEE Trans. Instrum. Meas. , vol. 62, no. 5,\npp. 974–981, May 2013.\n[20] J. Jalbert and R. Gilbert, ‘‘Decomposition of transformer oils: A new\napproach for the determination of dissolved gases,’’ IEEE Trans. Power\nDel., vol. 20, no. 2, pp. 754–760, Feb. 1997.\n[21] Z. Jiang, R. Zhao, B. Sun, G. Nie, H. Ji, J. Lei, and C. Wang, ‘‘Highly\nsensitive acetone sensor based on Eu-doped SnO 2 electrospun nanoﬁbers,’’\nCeramics Int., vol. 42, no. 14, pp. 15881–15888, 2016.\n[22] Q. Zhou, L. Xu, A. Umar, W. Chen, and R. Kumar, ‘‘Pt nanoparticles\ndecorated SnO 2 nanoneedles for efﬁcient CO gas sensing applications,’’\nSens. Actuators B, Chem. , vol. 256, pp. 656–664, Mar. 2018.\n[23] Q. Zhou, W. Chen, L. Xua, R. Kumar, Y . Gui, Z. Zhao, C. Tang, and\nS. Zhu, ‘‘Highly sensitive carbon monoxide (CO) gas sensors based\non Ni and Zn doped SnO 2 nanomaterials,’’ Ceramics Int. , vol. 44,\npp. 4392–4399, Mar. 2018.\n[24] B. Lin, F. Jia, B. Lv, Z. Qin, P. Liu, and Y . Chen, ‘‘Facile synthesis\nand remarkable hydrogen sensing performance of Pt-loaded SnO 2 hollow\nmicrospheres,’’Mater. Res. Bull., vol. 106, pp. 403–408, Oct. 2018.\n[25] J. Fan, F. Wang, Q. Sun, H. Ye, and Q. Jiang, ‘‘Application of polycrys-\ntalline SnO 2 sensor chromatographic system to detect dissolved gases\nin transformer oil,’’ Sens. Actuator B, Chem. , vol. 267, pp. 636–646,\nAug. 2018.\n[26] F. Li, T. Zhang, X. Gao, R. Wang, and B. Li, ‘‘Coaxial electrospinning\nheterojunction SnO 2/Au-doped In 2O3 core-shell nanoﬁbers for acetone\ngas sensor,’’ Sens. Actuator B, Chem. , vol. 252, pp. 822–830, Nov. 2017.\n[27] C. Schultealbert, T. Baur, A. Schütze, S. Böttcher, and T. Sauerwald,\n‘‘A novel approach towards calibrated measurement of trace gases using\nmetal oxide semiconductor sensors,’’ Sens. Actuators B, Chem. , vol. 239,\npp. 390–396, Feb. 2017.\n[28] H. M. McNair and J. M. Miller, Basic Gas Chromatography , 2nd ed.\nHoboken, NJ, USA: Wiley, 2009, pp. 140–144.\n[29] K. K. Shukla and A. K. Tiwari, Efﬁcient Algorithms for Discrete Wavelet\nTransform. London, U.K.: Springer, 2013.\n[30] M. Jansen, Noise Reduction by Wavelet Thresholding . New York, NY ,\nUSA: Springer, 2001.\n[31] P. K. Jain and A. K. Tiwari, ‘‘An adaptive thresholding method for the\nwavelet based denoising of phonocardiogram signal,’’ Biomed. Signal\nProcess. Control, vol. 38, pp. 388–399, Sep. 2017.\n[32] M. Srivastava, C. L. Anderson, and J. H. Freed, ‘‘A new wavelet denoising\nmethod for selecting decomposition levels and noise thresholds,’’ IEEE\nAccess, vol. 4, pp. 3862–3877, 2016.\n[33] M. S. Sadooghi and S. E. Khadem, ‘‘A new performance evaluation scheme\nfor jet engine vibration signal denoising,’’ Mech. Syst. Signal Process. ,\nvols. 76–77, pp. 201–212, Aug. 2016.\n[34] P. Nguyen and J.-M. Kim, ‘‘Adaptive ECG denoising using genetic\nalgorithm-based thresholding and ensemble empirical mode decomposi-\ntion,’’Inf. Sci., vol. 373, pp. 499–511, Oct. 2016.\n[35] H. Meng, W. Yang, X. Yan, Y . Zhang, L. Feng, and Y . Guan, ‘‘A highly\nsensitive and fast responsive semiconductor metal oxide detector based\non In2O3 nanoparticle ﬁlm for portable gas chromatograph,’’ Sens. Actua-\ntor B, Chem. , vol. 216, pp. 511–517, Sep. 2015.\n[36] G. M. C. Vinicius, A. L. H. Costa, and M. L. L. Paredes, ‘‘Development\nand evaluation of a new DGA diagnostic method based on thermodynam-\nics fundamentals,’’ IEEE Trans. Dielectr. Electr. Insul. , vol. 22, no. 2,\npp. 888–894, Apr. 2015.\n[37] A. Zhao, X. Tang, J. Liu, and Z. Zhang, ‘‘The on-site DGA detecting\nand analysis system based on the Fourier transform infrared instrument,’’\nin Proc. IEEE Int. Instrum. Meas. Technol. Conf. (IMTC) , May 2014,\npp. 1036–1040.\nJINGMIN FAN received the B.Eng. and M.Eng.\ndegrees in electronic science and technology\nfrom Central South University, Changsha, China,\nin 2007 and 2010, respectively. He received the\nPh.D. degree in electrical engineering from Hunan\nUniversity, Changsha, China, in 2018. He is cur-\nrently an Associate Professor with the Guangdong\nUniversity of Technology. His research interests\ninclude intelligent algorithm and state evaluation\nof power equipment.\nZHE LIU received the B.Sc. degree in electrical\nengineering from Hunan Institute of Engineering,\nXiangtan, China, in 2016. He is currently pursuing\nthe M.Sc. degree with the School of Automation,\nGuangdong University of Technology, Guang-\ndong, China. His research interests include state\nevaluation of power equipment, microgrids, and\nintelligent control.\nANBO MENG received the B.Eng. and M.Eng.\ndegrees in water conservancy and hydropower\nengineering from North China University of Water\nResources and Electric Power, Zhengzhou, China,\nin 1995 and 2001, respectively. He received the\nPh.D. degree in automation from Université Paul\nVerlaine-Metz, Metz, France, in 2008. He is\ncurrently a Professor in electrical engineering\nwith the Guangdong University of Technology,\nGuangzhou, China. His research interests include\nintelligent algorithm and state evaluation of power equipment.\nVOLUME 7, 2019 94019\nJ. Fanet al.: Characteristics of Tin Oxide Chromatographic Detector for Dissolved Gases Analysis of Transformer Oil\nHAO YINreceived the B.Eng. and M.Eng. degrees\nin water conservancy and Hydropower Engi-\nneering from North China University of Water\nResources and Electric Power, Zhengzhou, China,\nin 1996 and 1999, respectively. She is currently\nan Associate Professor in electrical engineering\nwith the Guangdong University of Technology,\nGuangzhou, China. Her research interest includes\nstate evaluation of power equipment.\nQIUQIN SUN received the B.Eng. degree in\nelectrical engineering from Chongqing University,\nChonqing, China, in 2006 and the Ph.D. degree in\nelectrical engineering from Shandong University,\nJinan, China, in 2012. He is currently an Assis-\ntant Professor with Hunan University, Changsha,\nChina.\nFENG BINreceived the B.Sc. and M.Sc. degrees\nfrom School of Physical and electronic science,\nChangsha University of Science & Technology,\nChangsha, China, in 2012 and 2015, respec-\ntively. He is currently pursuing the Ph.D. degree\nwith the College of Electrical and Information\nEngineering, Hunan University, Changsha, China.\nHis research interests include state evaluation of\npower equipment, partial discharge detection, and\nsignal processing.\nQINJI JIANG received the B.Eng. and M.Eng.\ndegrees in electrical engineering from Hunan\nUniversity, Changsha, China, in 2013 and 2016,\nrespectively. He is currently a Junior Engineer\nwith the State Grid Hunan Maintenance Company,\nChangsha, China. His research interest includes\nthe electric power planning.\n94020 VOLUME 7, 2019",
  "topic": "Transformer oil",
  "concepts": [
    {
      "name": "Transformer oil",
      "score": 0.7511976957321167
    },
    {
      "name": "Dissolved gas analysis",
      "score": 0.7117187976837158
    },
    {
      "name": "Tin oxide",
      "score": 0.6726133823394775
    },
    {
      "name": "Detector",
      "score": 0.5942569375038147
    },
    {
      "name": "Tin",
      "score": 0.5659540891647339
    },
    {
      "name": "Transformer",
      "score": 0.5006663799285889
    },
    {
      "name": "Materials science",
      "score": 0.4807993471622467
    },
    {
      "name": "Oxide",
      "score": 0.42457810044288635
    },
    {
      "name": "Chromatography",
      "score": 0.36759835481643677
    },
    {
      "name": "Chemistry",
      "score": 0.2809586226940155
    },
    {
      "name": "Computer science",
      "score": 0.20257842540740967
    },
    {
      "name": "Electrical engineering",
      "score": 0.15683433413505554
    },
    {
      "name": "Metallurgy",
      "score": 0.14471575617790222
    },
    {
      "name": "Voltage",
      "score": 0.12001579999923706
    },
    {
      "name": "Engineering",
      "score": 0.10045471787452698
    },
    {
      "name": "Telecommunications",
      "score": 0.0792900025844574
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I139024713",
      "name": "Guangdong University of Technology",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I16609230",
      "name": "Hunan University",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I4210135052",
      "name": "Hunan Entry-Exit Inspection and Quarantine Bureau",
      "country": "CN"
    }
  ],
  "cited_by": 26
}