{
  "title": "Identification and Location of PD Defects in Medium voltage Underground Power Cables Using High Frequency Current Transformer",
  "url": "https://openalex.org/W2963438157",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A5042343212",
      "name": "Muhammad Shafiq",
      "affiliations": [
        "University of Vaasa"
      ]
    },
    {
      "id": "https://openalex.org/A5047114488",
      "name": "Ivar Kiitam",
      "affiliations": [
        "Tallinn University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5030317703",
      "name": "Paul Taklaja",
      "affiliations": [
        "Tallinn University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5039086540",
      "name": "Lauri Kütt",
      "affiliations": [
        "Tallinn University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5066292801",
      "name": "Kimmo Kauhaniemi",
      "affiliations": [
        "University of Vaasa"
      ]
    },
    {
      "id": "https://openalex.org/A5054682324",
      "name": "Ivo Palu",
      "affiliations": [
        "Tallinn University of Technology"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W6616291041",
    "https://openalex.org/W2136788973",
    "https://openalex.org/W2296269852",
    "https://openalex.org/W2593392134",
    "https://openalex.org/W2900264474",
    "https://openalex.org/W2503284723",
    "https://openalex.org/W2919638255",
    "https://openalex.org/W1971716999",
    "https://openalex.org/W581065322",
    "https://openalex.org/W2244097931",
    "https://openalex.org/W2508286755",
    "https://openalex.org/W6602590400",
    "https://openalex.org/W2564070425",
    "https://openalex.org/W2115383907",
    "https://openalex.org/W6758733010",
    "https://openalex.org/W2208016695",
    "https://openalex.org/W1987905669",
    "https://openalex.org/W2194077082",
    "https://openalex.org/W2011188657",
    "https://openalex.org/W2153695397",
    "https://openalex.org/W2677362728",
    "https://openalex.org/W6694202479",
    "https://openalex.org/W2273509067",
    "https://openalex.org/W571605820",
    "https://openalex.org/W64808545",
    "https://openalex.org/W2914179190"
  ],
  "abstract": "Fault location is an important diagnostic task in condition monitoring of underground medium voltage cables. Available solutions are well capable of determining the location of a single partial discharge (PD) defect on a cable section. In case several PD defects are active simultaneously along a cable section, the interpretation of the measured data becomes complex to identify the presence of more than one PD sources. In this paper, experimental investigation of two PD defects/sources at different locations on a medium voltage (MV) cable section is presented. A high frequency current transformer is used for single end PD measurements. Time domain reflectometry-based in-depth study of the reflected pulses provides the most valuable information to identify the presence of PD sources which further leads to the location of the individual PD sources. In this paper, the proposed solution is presented for two PD sources, however, the same methodology can be extended to locate multiple PD sources on the cable.",
  "full_text": "Received June 17, 2019, accepted July 11, 2019, date of publication July 24, 2019, date of current version August 13, 2019.\nDigital Object Identifier 10.1 109/ACCESS.2019.2930704\nIdentification and Location of PD Defects in\nMedium voltage Underground Power Cables\nUsing High Frequency Current Transformer\nMUHAMMAD SHAFIQ\n 1, IVAR KIITAM2, PAUL TAKLAJA2, LAURI KÜTT2,\nKIMMO KAUHANIEMI1, AND IVO PALU2, (Member, IEEE)\n1School of Technology and Innovations, Electrical Engineering, University of Vaasa, 65200 Vaasa, Finland\n2Department of Electrical Power Engineering and Mechatronics, Tallinn University of Technology, 19086 Tallinn, Estonia\nCorresponding author: Muhammad Shaﬁq (muhammad.shaﬁq@uwasa.ﬁ)\nThis work was supported by the Project Smart Condition Monitoring of Power Grid, funded by the Academy of Finland, under\nGrant No. 309412.\nABSTRACT Fault location is an important diagnostic task in condition monitoring of underground\nmedium voltage cables. Available solutions are well capable of determining the location of a single partial\ndischarge (PD) defect on a cable section. In case several PD defects are active simultaneously along a cable\nsection, the interpretation of the measured data becomes complex to identify the presence of more than one\nPD sources. In this paper, experimental investigation of two PD defects/sources at different locations on a\nmedium voltage (MV) cable section is presented. A high frequency current transformer is used for single\nend PD measurements. Time domain reﬂectometry-based in-depth study of the reﬂected pulses provides the\nmost valuable information to identify the presence of PD sources which further leads to the location of\nthe individual PD sources. In this paper, the proposed solution is presented for two PD sources, however,\nthe same methodology can be extended to locate multiple PD sources on the cable.\nINDEX TERMSCable insulation, power distribution lines, partial discharges, time domain analysis, sensors,\ncondition monitoring.\nI. INTRODUCTION\nOverhead power lines are highly vulnerable to various exter-\nnal and climatic factors, such as faults initiated by accidents,\nadverse weather conditions and natural disasters. Unfortu-\nnately, extreme weather events, including hurricanes, storms,\nsnow, and ﬂoods usually cause signiﬁcant damage every year.\nThe operation of overhead power lines is severely affected\nby this. To minimize the occurrence of faults in the future,\nseveral initiatives have been made around the world to replace\noverhead lines with underground power cables. For example,\nstudies made by Consolidated Edison, Inc. and Florida Public\nService Commission have suggested converting the overhead\nlines to underground cables and provided estimated costs\nin the range of billions of dollars to accomplish this con-\nversion for New York and Florida [1]. Similarly, in Europe,\nunderground cabling has been adopted as a preferred solution\nfor a reliable and secure means of power distribution [2].\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Taha Selim Ustun.\nIn Finland, the replacement of underground cable installations\nin distribution network is in progress; reaching an estimated\n70% installation in 2023; the target is to complete the replace-\nment by 2028 [3].\nThis trend is likely to continue, as the security of supply is\na top priority for grid utilities and underground installations\nwill signiﬁcantly reduce the frequency of power outages\ncompared to overhead lines in a vast majority of operat-\ning conditions. However the aging, operational stresses, and\nabnormal situations in the installed underground distribution\ncables is a looming issue. Therefore, upgrades in the condi-\ntion monitoring of power cables are needed to pre-emptively\navoid fault occurrences in expensive cable installations and\nthe associated critical infrastructure.\nDielectric insulation is one of the most critical components\nin power equipment, ranging from low voltage to high voltage\napplications. In all the major network components such as\npower transformers, cables, switchgear, machines, etc. the\npurpose of the insulation materials (which can be in either\nsolid, liquid or gaseous state), is to electrically separate the\n103608 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see http://creativecommons.org/licenses/by/4.0/VOLUME 7, 2019\nM. Shafiqet al.: Identification and Location of PD Defects in MV Underground Power Cables Using HFCT\nFIGURE 1. Insulation defects depicted in the MV cable insulation.\nenergized conductors of different phases from each other\nand from earth. However, when the insulation material has\nsome defects (cracks, voids, or cavities) as depicted in Fig. 1,\nthe dielectric strength of the defective part decreases, which\ncauses the occurrence of partial discharges (PD). PD activity\nwithin solid insulation is initiated in the defective locations\nunder suitably high electric ﬁeld stress. PD activity pro-\ngresses in time and may lead to the development of car-\nbonized paths inside the insulation, so-called ‘electric trees’,\nwhich tend to expand and after a certain amount of time lead\nto insulation failure if not attended to in a timely manner.\nAlthough PD activity is a gradual process of degradation\nand it may follow a certain pattern to failure, however an event\nof elevated stress may lead to an accelerated rate of degrada-\ntion and cause sudden failure [4]. To prevent the unexpected\noutages, PD-based online condition monitoring is an effective\ntool to observe the PD proﬁle of the most failure-prone grid\ncomponents. Cables are of particular interest in this regard as\nthe most vulnerable components of the electric grid regarding\ninsulation faults [5], [6]. Cable repairs are time-consuming\nand accurate fault location is not always straightforward.\nPD is accompanied by electromagnetic activity, which can\nbe used to identify its occurrence. In case of cables, the PD\npulse emitted from the defect site propagates along the cable\nline and can be monitored using appropriate sensors and\nsuitable techniques. Over the past few decades, there has been\nincreasing interest in improving the available monitoring and\ndiagnostic solutions. A lot of work has been done in order to\nimprove the detection and location of the PD defects. How-\never, most of the efforts are aimed at detecting and locating\nthe presence of a single PD defect on the section of a cable.\nAn ample amount of research has been conducted on the\ninvestigation of multiple PD faults initiated by different types\nof PD sources [7]–[10] in different power components. The\ndeveloped techniques are used to detect and identify the pres-\nence of multiple PD sources which may present as corona,\ndischarges in dielectric liquids, surface discharges or internal\ndischarges using phase-resolved PD (PRPD) patterns. These\ntypes of discharges can be identiﬁed based on PRPD analysis\nbecause each type of PD activity appears during certain phase\nangles of the voltage cycle. However, when two PD sources\nof same type are active simultaneously, they will appear at\nthe same phase location and identiﬁcation of these sources is\ngenerally not possible by PRPD analysis. It is important to\ninvestigate the individual PD signals to analyze the presence\nof single or multiple PD-causing defects of the same type.\nAntenna and acoustic sensor based techniques have been\nused for the location of multiple PDs of the same type using\nPD pulse analysis in the substation equipment such as power\ntransformers, switchgear, and similar types of enclosed sys-\ntem components. These techniques are often, however, not\neffective when investigating cables. The fact that the cable\nmay span over several kilometers renders the methods based\non measurements using multiple antenna and acoustic sensors\nunfavorable [11]–[13]. A detailed explanation of the capabil-\nities of sensors speciﬁc to the type of power equipment has\nbeen discussed in detail in [14].\nThe location of single PD faults in power cables has been\ntraditionally accomplished using the time domain reﬂectom-\netry (TDR) method [15]. However, its application to multiple\nPD sources in a single cable has rarely been considered\nthus far. The TDR technique is usually implemented using\none-end measurements (single sensor) or two-ends measure-\nments (two sensors). Both of these methodologies are based\non observing the time of arrival (ToA) of the original PD pulse\narriving at the sensors, its subsequent reﬂected pulses arriving\nat the sensors, the wave propagation speed, and the total\nlength of the cable. However, when two or more PD sources\nare active simultaneously on a cable section, the sensor(s)\nat the end(s) of the cable record the emitted (original) PD\nsignals indiscriminately together with the reﬂected pulses\npropagating along the line. This makes the implementation of\nlocation techniques a complex task. These recorded signals\nhave to be separated from one another in order to correctly\nrecognize each PD source.\nRecently, the work presented in [16] describes how to\ndetect the presence of multiple PD sources along the cable\nsection using power spectral separation. The use of this tech-\nnique can provide adequate results. However, its implementa-\ntion needs high expertise in signal processing techniques and\nprior knowledge and assumptions regarding the number of\nPD sources to aid the experts in making the correct evaluation.\nTherefore, there is need to keep developing the conventional\nand speedy techniques.\nThis paper proposes a simple approach based on time\ndomain analysis for identiﬁcation and separation of PD\npulses from different sources, conﬁguring the number of PD\nsources, and the location of the PD sources in power cables.\nThe work is based on experimental investigations carried\nout in a laboratory environment using a high frequency cur-\nrent transformer (HFCT) sensor and single-end measurement.\nTDR based analysis is used to localize the PD signals.\nII. TIME DOMAIN REFLECTOMETRY (TDR) BASED\nFAULT LOCATION\nWhen PD activity is initiated, PD occurs at particular\nphase angles over the power frequency voltage cycles.\nVOLUME 7, 2019 103609\nM. Shafiqet al.: Identification and Location of PD Defects in MV Underground Power Cables Using HFCT\nThe amplitude and polarity of these PD pulses depend on\ncharacteristics of the PD source, the instantaneous value of\nthe applied voltage, and its polarity. PD presents at a certain\nrepetition rate. The PD initiates an electric pulse, which\npropagates towards both ends of the cable. The signals are\nreﬂected from one end of the cable and propagate towards the\nother end. When using single end measurement, the signal\nwhich ﬁrst reaches the measurement sensor (HFCT in this\ncase) is designated as the original pulse and the signal reach-\ning the sensor after reﬂection from the far end is designated as\nthe reﬂected pulse. The time difference between the original\nand the reﬂected pulse can be used to determine the location\nof the PD source using TDR.\nFIGURE 2. PD pulses and their reflections propagating in the cable.\nFIGURE 3. Output of PD sensor illustrating time difference of arrival\nbetween incident (original) and reflected PD pulse.\nAs illustrated in Fig. 2, the PD pulse generated from P\nstarts to travel towards End 1 of the cable with length l\nand is recorded with the HFCT (installed at End 1) at a\ndistance x from point P at time t1. Simultaneously, the other\nPD pulse from P starts to travel towards End 2 of the cable\nby ﬁrst covering the distance l-x. It is reﬂected from End 2\nand reaches End 1 after also covering the distance l and is\neventually recorded by the same HFCT sensor at time t2 as\nshown in Fig. 3. Considering the wave propagation speed in\nthe cable v, the time t1 at which the ﬁrst PD pulse reaches the\nHFCT can be expressed as :\nt1 =x\nv (1)\nCovering the direct distance (l-x) towards End 2 and ‘reﬂected\ndistance’ l, the time t2 can be expressed as :\nt2 =l +(l −x)\nv (2)\nThe time difference of arrival 1t between the pulses is\ndetermined as:\n1t =t2 −t1 (3)\n1t =l +(l −x)\nv −x\nv (4)\nThe distance x of PD source at point P from End 1 can be\ncalculated as:\nx =l −1tv\n2 (5)\nIII. PRACTICAL CONSIDERATIONS REGARDING\nREFLECTION OF PD SIGNALS ON A CABLE\nWhile using TDR based fault location methods, it is important\nto consider the measurement arrangements, i.e. the length of\nthe cable being tested, the response of the measurement sen-\nsors, data acquisition system (DAS) and apply this knowledge\nwhen interpreting the data. In this section, practical issues\nregarding cable length and the capabilities of the measuring\nsensor are discussed brieﬂy while DAS and data interpreta-\ntion will be discussed in the following sections.\nA. CABLE LENGTH\nA PD signal has a certain pulse width Pw, which ranges\nfrom a few nanoseconds to microseconds. Based on the wave\npropagation velocity and the length of the cable, the reﬂected\npulse arrives at the sensor after a certain time difference and\nis captured by the sensor. It is very important to capture the\ncomplete reﬂected PD pulse, particularly the ﬁrst part of the\npulse. The ﬁrst peak of the pulse can be considered more\nreliable for determining the time difference of arrival between\nthe pulses. If the cable length is not sufﬁcient to cause a\nsuitably long time delay between the original and reﬂected\npulse, the reﬂected pulse will arrive at the measuring sensor\nduring the time interval when the original pulse is being\ncaptured. This will cause superposition of the reﬂected pulse\nand the original pulse, which causes ambiguity and in many\ncases it is impossible to reliably distinguish or separate the\ntwo pulses in the obtained signals.\nFIGURE 4. Experimentally measured PD signal (pulse).\nIn Fig. 4, a PD pulse measured on a medium voltage (MV)\ncable of 10 m length is presented, in which the wave prop-\nagation velocity has been measured at 1.54 ×108 m/s.\nPerforming TDR on such a short length of cable may not\nbe useful, because the PD pulse width is approximately\n0.142 µs (see Fig. 3), while the reﬂection appears after a\nshort time, 0.064 µs. The pulses have been superimposed and\nthe reﬂected pulse cannot be distinguished from the original\npulse as illustrated in Fig. 4. The PD pulses undergo multiple\nreﬂections, but due to attenuation, the subsequent reﬂections\nmay not have a high enough amplitude to be measured.\nIn Fig. 5, no reﬂections can be identiﬁed even until 20 µs\n103610 VOLUME 7, 2019\nM. Shafiqet al.: Identification and Location of PD Defects in MV Underground Power Cables Using HFCT\nFIGURE 5. PD signal superposition due to short cable length;\ntop- individual waveforms of original and reflected pulse, bottom- the\nresultant waveform of original and reflected pulse.\nFIGURE 6. Experimentally measured PD signal with post-pulse\noscillations.\nFIGURE 7. Effect of the longer oscillation due to sensor’s response;\ntop-individual wave shape of original and reflected signal, bottom- the\nresultant waveform of original and reflected pulse.\nhas passed, while a measurement done on a longer cable\nof 200 m in length would present the ﬁrst reﬂection after\napproximately 2 µs.\nFor the sake of argument, it can be stated that for a reli-\nable location diagnostic the minimum cable length should\nbe approximately 25 m or more. However, even cables in\nthis length category can experience problems with PD source\nlocation diagnostics. This is caused by problems associated\nwith the response characteristics of the measurement sensor.\nB. MEASUREMENT SENSOR\nA sensor with suitable sensitivity and bandwidth is impor-\ntant for measurement of PD that leads to a reliable loca-\ntion diagnostic in MV cables. Based on their geometrical\ndesign and materials used, the cable and HFCT sensor pos-\nsess intrinsic RLC parameters (resistance, inductance, and\ncapacitance) [14], [17], [18], which affect the waveform of\nthe measured signals.\nOscillations may appear in the sensor output following the\nPD pulse and are damped after a certain period of time as\nshown in Fig. 6. It can be seen that the oscillations remain\nquite signiﬁcant until the time interval of 12 µs after the\nappearance of the ﬁrst PD pulse. Therefore, ideally the study\nof reﬂected PD pulses will be reliable if they appear after\nthe oscillatory part. If the sensors have better sensitivity,\nthe amplitude of the measured reﬂected wave is high enough\nthat the pulse can be identiﬁed even if it appears during the\noscillatory part. However, a sensor with higher bandwidth\nhas reduced oscillatory time that leads to better measuring\nperformance.\nIV. EXPERIMENTAL SETUP FOR FAULT LOCATION\nON MV CABLES\nConsidering the real cases in the MV network, the usual\nlength of cables is in the range of hundreds of meters up to\nsome kilometers. This is sufﬁciently long for reﬂections to\nbe easily seen during real world diagnostic measurements.\nIn this study, an experimental investigation is performed at\nHigh V oltage laboratory in Tallinn University of Technology.\nA 20 kV single phase MV cable, type HXCMK with a con-\nductor cross-section of 35 mm 2 and 199.3 m in length, is used\nfor the investigation. The investigation is performed in two\nstages.\n1) Determining the wave propagation velocity of the cable,\n2) PD measurement at AC voltage (50 Hz).\nA. WAVE PROPAGATION VELOCITY OF THE CABLE\nUnder fault conditions, cable maintenance is time consuming\nand expensive due to digging, repairing, and reﬁlling the site\nwhile on the other hand inconvenience to the general public\nis an added burden. Therefore, accuracy of the location of the\nfault site is imperative. While performing TDR based location\ndiagnostics, accurate information of the propagation velocity\nis important so that time and velocity based calculations can\nprovide accurate distance and location.\nThe velocity of wave propagation for a transmission line\nhaving air as insulation between its conductors can be\ncalculated as:\nva = 1√εoµo\n=3 ×108 m\ns ≈c (6)\nwhich is approximately the velocity of light in vacuum. How-\never, when the insulation is not air or another low-pressure\ngaseous medium, the velocity is reduced by the velocity\nfactor (VF) which is determined as :\nVF = 1√εr µr\n≈ 1√εr\n(7)\nThe relative permeability µr ≈1 for dielectric materials due\nto their non-ferrous properties, so the VF primarily depends\non the relative permittivity of the dielectric εr . VF is deﬁned\nas the ratio of the propagation speed of light or electromag-\nnetic waves in a medium to the speed in vacuum. Therefore,\nthe calculated wave propagation speed of a cable vc,c can be\nexpressed as:\nvc,c =c ×VF (8)\nVOLUME 7, 2019 103611\nM. Shafiqet al.: Identification and Location of PD Defects in MV Underground Power Cables Using HFCT\nThe diameter of the cable used in the study is 26 mm,\ncross-linked polyethylene (XLPE) is the main insulation\nwhile a semiconducting compound material is used in con-\nductor and insulation screens. The data sheet does not provide\nany information on the wave propagation speed for this cable.\nConsidering the εr =2.2...2.4 for XLPE, the vc,c is in the\nrange of 2.02 ×108...1.93 ×108 m/s. However, in order to\nverify the propagation speed, it is necessary to determine the\npulse velocity experimentally as well.\nFIGURE 8. Laboratory test setup for online measurement of PDs in the\nMV cable (electrical layout); CC- coupling capacitor; MI- measuring\nimpedance of commercial system.\nThe propagation velocity can be measured using a PD\ncalibration device, which is connected in parallel to the tested\ncable, as illustrated in Fig. 8. The PD calibrator is connected\nto End 1 and the HFCT used to detect PD signals is installed\nin series with the coupling capacitor (CC) and the measuring\nimpedance of the commercial PD measurement system. The\noriginal (the PD pulse injected into End 1) and the reﬂected\nsignal (from End 2) are captured by the HFCT (see Fig. 9),\nthe time difference of arrival (TDoA) is determined, and\nconsidering the distance the pulse travels is twice the length\nof the cable, the experimental propagation velocity vc,m is\ndetermined as:\nvc,m =2lc\ntd\n= 2 ×199.3\n2.285 ×10−6 =1.745×108 m\ns (9)\nThe difference between the calculated and measured speed\nis 9%. The difference can be mainly attributed to the presence\nof semiconducting screens on the conductor and insulation.\nThe aging of XLPE insulation has also been shown to have\nan effect on the wave propagation speed, although the cable\nused in this investigation is manufactured in 2016 and has not\nexperienced aging in ﬁeld service. The effect of the semicon-\nducting screens and aging has been investigated in [19], [20].\nIn further analysis, the experimentally acquired value will\nbe used, as it takes into account all the possible effects\ninﬂuencing propagation speed and provides the most accurate\ninformation of pulse velocity.\nB. EXPERIMENTAL SETUP FOR PD INVESTIGATIONS\nON MV CABLES\nThe test setup used for measuring PDs is depicted in Fig. 10\n(physical layout) while the principle electric schematic is\nshown in Fig. 8. For measurement of wave propagation veloc-\nity, the PD calibrator was used as shown with dotted line\nconnection. For PD measurements, the PD calibrator was\nFIGURE 9. Original and reflected pulses injected with PD calibrator in the\ntested cable.\nFIGURE 10. Laboratory test setup for online measurement of PDs in the\nMV cable (physical layout).\nreplaced by the high voltage source as shown in Fig. 8. The\nsource has a variable power supply and at the voltage level\n13.5 kV the PD started to emerge. In order to have a better\nsignal-to-noise ratio, the applied voltage was raised to 20 kV .\nThe cable terminations are designated as End 1 and End 2 of\nthe cables. A coupling capacitor (1 nF) was connected at\nEnd 1 of the cable while the cable is open ended at End 2.\nThe HFCT has a 15-mm round primary window, the HFCT\nparameters are:\n• Transfer ratio 1:10;\n• Bandwidth 0.5 to 80 MHz (-3 dB).\nThe HFCT output was connected to a digital storage oscillo-\nscope (DSO) with sampling frequency 2 GS/s.\nIn addition to the equipment used for recording the wave-\nforms of PD pulses, a commercial PD measuring system was\nused for simultaneously monitoring other parameters, such\nas PD apparent charge magnitude, repetition rate etc. The\ncommercial system included a coupling capacitor (CC) which\nwas connected in series with the measuring impedance (MI).\nThe impedance and CC in combination work effectively as a\nvoltage divider and the signal acquired from the measuring\nimpedance was used to record the applied voltage waveform\nusing above mentioned high frequency DSO.\nIn this work, single end measurements are used and the\ncaptured data is shown in Fig. 11. The data is recorded\n103612 VOLUME 7, 2019\nM. Shafiqet al.: Identification and Location of PD Defects in MV Underground Power Cables Using HFCT\nFIGURE 11. PD data of the MV cable measured with HFCT at 20 kV over\none voltage quarter-cycle.\nwith a sampling period of 5 ×10−9 s and is stored in\ncomma-separated values (CSV) format that can easily be\nimported to Matlab for further analysis on a personal\ncomputer.\nV. DETECTION AND LOCATION OF THE PD SOURCES\nSeveral measurements have been taken in order to analyze the\nPD activity. The measurements are recorded subject to the\nlimitation of the number of points (1,000,000 samples) that\nthe DSO can store for a single measurement and a suitable\nsampling frequency (0.2 GHz) is used to capture the PD\nsignals reliably.\nFIGURE 12. Spectra of noise and PD signal [21].\nPresence of noise is a critical issue during ﬁeld measure-\nments and extracting useful signals having lower amplitude\nis a major challenge. The common sources of noise are:\ndiscrete spectral interference (DSI), periodical pulses, ran-\ndom pulses, white noise, and reﬂections. Figure 12 describes\nthe presence of the noise and PD signals based on their\nfrequency ranges and dB levels [21]. A variety of methods\nhave been reported based on digital signal processing (DSP)\ntechniques denoising such as ﬁnite impulse response (FIR)\nﬁlters, inﬁnite impulse response (IIR) ﬁlters, fast Fourier\ntransform (FFT) [21]–[23]. In this work, discrete wavelet\ntransform (DWT) technique presented in [21] has been used.\nThe denoised signal, which presented a better signal-to-noise\nratio, is shown in Fig. 13.\nFor analyzing the individual PD pulses in the time\ndomain, two PD signals have been chosen as shown circled\nin Fig. 13. These PD signals have been identiﬁed based on\nthe post-ﬁrst pulse behavior that mainly includes reﬂections\nand the distances at which they occur. Figure 14 presents PD\nFIGURE 13. Denoising of the measured PD data.\nFIGURE 14. PD type 1, PD data identified as potential PDs from a PD\nsource.\nFIGURE 15. PD type 2, PD data identified as potential PDs from a PD\nsource.\ntype 1 having two reﬂections at certain intervals following the\nﬁrst (original) PD pulse while in case of the PD type 2 shown\nin Fig. 15, three pulses are observed following the original\nPD pulse. Considering the apparent behavior, further investi-\ngation is made based on TDR principles. The analysis can be\nproceeded further with two basic ﬁndings. Firstly, PD activity\nis present on the cable line, which means there is at least one\ninsulation defect. Secondly, two types of reﬂection behaviors\nindicate the presence of two PD sources at different locations.\nHowever, further investigation will explore the PD happening\nalong the line in more detail.\nA. PD TYPE 1\nFigure 16 is re-plotted starting with time zero for better under-\nstanding of the TDR analysis. It is observed that Pulse 1 or the\nVOLUME 7, 2019 103613\nM. Shafiqet al.: Identification and Location of PD Defects in MV Underground Power Cables Using HFCT\nFIGURE 16. TDR based analysis of PD type 1.\noriginal pulse appears at t =2.63 µs, Pulse 2 appears at t =\n4.88 µs while Pulse 3 appears at t =7.17 µs. Considering\nthe length of the cable (two way length) is 398.6 m and the\npropagation velocity is 1.745 ×108 m/s, it can be assumed\nthat any pulse appearing within the time frame 2.284 µs,\nwhich is the time it takes for the pulse to travel twice the\nlength of the cable, after Pulse 1 will be the 1 st reﬂection of\nPulse 1. The time difference between Pulse 1 and Pulse 2 is\n1t12 =2.25 µs. Recalling equation (5), the fault location can\nbe determined as :\nx1 =l −1t12vp\n2 =2.56 m (10)\nwhere x1 is the distance of the PD fault from the cable End 1,\nat which the HFCT is connected for PD measurements. It can\nbe seen that Pulse 3 appears at a time difference 1t23 =\n2.285 µs after the second pulse. The lattice diagram presented\nin Fig. 17 for the located PD defect can be used to further\nexplore the observed propagation behavior.\nFIGURE 17. Lattice diagram to study the propagation behavior of PD\ntype 1 along the cable.\nConsidering the PD defect is located at a distance of 2.56 m\nfrom End 1, the PD pulse is incepted at the defect site and\nstarts to propagate towards both ends of the cable. Assigning a\nreference time, the pulse covering the distance of 2.56 m\nreaches the HFCT at t1 =0 s as Pulse 1 while towards the\nother end of the cable, the pulse is reﬂected from End 2,\ncontinues its propagation towards End 1, is measured by the\nHFCT as Pulse 2 at a time of t2 =2.255 µs. The time 2.255 µs\ncorresponds to a distance of 2.255 µs ×1.745 ×108 m/s ==\n393.5 m. After having been recorded and the reﬂection from\nEnd 1, it travels towards End 2 and reaches End 1 (as Pulse 3)\nagain.\nOn the other hand, when Pulse 1 is measured by HFCT\nat instant t1 =0 s, it also reﬂects from End 1 and travels\ntowards End 2. Having reﬂected from End 2, it also travels\ntowards End 1. This is a time when both the pulses are moving\ntowards End 1 with Pulse 1 following the Pulse 2 at a distance\nof 5.12 m and reaches End 1 at a time of 2.28 µs. The\ndifference of the ToA is 0.029 µs between Pulse 2 and Pulse 1,\nwhich is so small that the two pulses cannot be distinguished\nduring the whole measurement time frame. In addition, com-\nparing the amplitude of the PD pulses after each reﬂection,\nsigniﬁcant attenuation can be observed and after Pulse 3,\nthe PD pulse amplitude is so small that it is merged into the\nnoise and cannot be observed any further.\nThis propagation continues under the effect of two critical\ncharacteristic factors of the cable: attenuation and disper-\nsion. These two factors affect the PD pulses in two ways\nrespectively: the decrease in amplitude of the pulse and the\nincrease of the pulse width [24], [25]. After a certain amount\nof distance travelled along the cable, the pulses ‘disappear’\ndue to decreased amplitude. The number of reﬂections after\nwhich the pulses disappear also depends on the length of the\ncable. In other words, the attenuation and dispersion depend\non the distance that the pulses travel along the cable.\nB. PD TYPE 2\nThe second type of PD signals are shown in Fig. 18. Consid-\nering the zero reference point in the plot, the ﬁrst (original)\nPD signal Pulse 1 is measured at 2.61 µs and its ﬁrst reﬂec-\ntion Pulse 2 is captured at 4.585 µs. Similarly, the further\nreﬂections Pulse 3 and Pulse 4 are measured at times 4.895 µs\nand 6.87 µs, respectively. As analyzed above for PD type 1,\nthe ﬁrst pulse and its ﬁrst reﬂection are used to determine the\nlocation of the PD fault, while the rest of the reﬂections are\nFIGURE 18. TDR based analysis of PD type 2.\n103614 VOLUME 7, 2019\nM. Shafiqet al.: Identification and Location of PD Defects in MV Underground Power Cables Using HFCT\nimportant to conﬁrm the determined location and to further\nstudy the propagation behavior of these PD pulses between\nthe cable ends. The TDoA between Pulse 1 and Pulse 2 is\n1t12 =1.97 µs. Due to differences in ToA as compared to\nPD type 1, the location of the corresponding PD fault from\nEnd 1 (measuring point) x2 is calculated using (5) as :\nx2 =l −1t12vp\n2 =27.42 m\nFIGURE 19. Lattice diagram to study the propagation behavior of PD\ntype 2 along the cable.\nThe lattice diagram for PD type 2 is shown in Fig. 19 and\nbecause of the relatively greater distance from the measuring\nend as compared to PD type 1, the reﬂected pulses can be\ndistinguished visually. Incepted at the defect site (27.42 m\nfrom End 1), Pulse 1 reaches the measuring point at t =0\nand at the same time Pulse 2 was travelling towards End 2.\nIn the meanwhile, Pulse 1 is reﬂected from End 1 and starts\nto propagate towards End 2 following the Pulse 2 at a distance\nof 54.84 (2 ×27.42 m). After being reﬂected, Pulse 2 and\nPulse 3 reach End 1 and are captured at times 1.97 µs and\n2.28 µs, respectively. Similarly, continuing after their reﬂec-\ntions from End 1 and returning after reﬂections from End 2,\nthe pulses are captured as Pulse 4 and Pulse 5 at times 6.53 µs\nand 6.84 µs. The lattice diagram explains the propagation\nbehavior of PD type 2 and conﬁrms the location of the PD\nfault at 27.42 m from cable End 1.\nIn summary, PD emission is a continuous activity that\nemits numerous PD pulses during each voltage cycle. This is\nobvious and it has been analyzed that the time delay between\nall the pulses and their respective reﬂected pulses is the same\nfor the same PD source. In case there are two or more PD\nsources located at different locations, there should be two\nor more sets of PD pulses and the time differences of the\nrespective PD pulses should be the same. A study encom-\npassing more reﬂections provides further insight about the\nPD sources. In this paper, the experimental investigation is\npresented that encompasses a cable having two PD sources\nat different locations. Analysis is made to differentiate the\nPD signals coming from different PD sources and a location\ndiagnostic is performed.\nVI. FAULT LOCATION ACCURACY AND DISCUSSION\nThe location of both PD defects has been determined and they\nappear to be at a distance of 24.86 m from each other ( x2 - x1),\nbased on investigation of their individual pulses. Comparing\nboth signals of PD type 1 and PD type 2 in a time reference\nwhere the original (ﬁrst) pulses are simultaneous, it can be\nseen that the time difference of the reﬂected pulses ( 1t =\n0.286 µs) conﬁrms the distance between both faults on the\ncable as shown in Fig. 20. Having dual conﬁrmation of the\nlocation of the PD defects, the experimental ﬁndings have\nto be compared with the real location of the defects which\ncaused the PD.\nFIGURE 20. Comparison of PD type 1 and PD type 2 signals for location\nvalidation.\nThe MV cable used in this experimental investigation has\ntwo defects. The locations of both defects have been manually\nmeasured at x1m =2.4 m and x2m =27.8 m while the\nexperimentally inferred distances are x1 =2.56 m and x2 =\n27.42 m. The comparison of the manually measured and\nlocated using TDR distances shows an error of 1x1 =0.16 m\nand 1x2 =0.38 m. This still indicates a good match of the\nreal and determined location of the PD faults.\nThe slight mismatch in defect locations can be due to\neffective length of the cable, taking into account the ter-\nmination part and the end of the cable shielding; the ﬁnite\nsignal sampling rate as well. Although the distance of the\ndefect points from the cable end was measured diligently, it is\nstill subjected to various measurement errors. The manually\nmeasured distances were determined using the sequential\nnumeric meter markings inscribed on the cable sheath during\nmanufacturing and a tape measure to determine the distance\nof the cable lugs and the defective spots from the nearest\nmeter marker. The cable ends were unrolled from a drum,\ntherefore some residual bending is also a possible source of\nmeasurement errors. To account for these factors, the man-\nually measured distances are presented with a conservative\naccuracy of 0.1 m.\nApart from the aforementioned sources of error, the sam-\npling period can also cause minor errors in a systemic manner.\nIn this work, the measurements have been recorded with a\nVOLUME 7, 2019 103615\nM. Shafiqet al.: Identification and Location of PD Defects in MV Underground Power Cables Using HFCT\nsampling period of 5 ×10−9 s. This means the measurements\nare recorded with a spatial resolution of 0.872 m. Therefore,\nthere is always a possibility of an error of 0.872 m in terms\nof distance inherent to the measured waveforms. The issue of\nthe sampling period can also affect the location diagnostics in\nanother way. Assuming that two or more PD sources are at a\nvery small distance from each other on the cable, for example\nat a distance of less than a meter. Because of the limitation of\nthe sampling period, most likely they will be identiﬁed as the\nsame PD source. Considering the particle aspects, such PD\nsources should be considered as the ‘parts’ of the same defect\nsite while digging or repair is being made and visual analyses\nwill be important for further conﬁrmation.\nThe individual PD pulse analysis presented in this work\ndescribes the basic idea and methodology of the proposed\ntechnique of PD source detection and their location. The\nanalyses are made for several data frames of half power cycles\nspanning 10 ms. Regarding continuous PD monitoring, one\nmight raise concerns about the feasibility of the proposed\ntechnique regarding processing of such a huge amount of\ndata having a high number of PD pulses. When it comes to\ncontinuous online condition monitoring of the cables, a com-\nprehensive approach can be developed based on the measure-\nment/data acquisition system and algorithm based processing\nfor automated detection of the PD signals, identiﬁcation of\nthe number of PD sources, and their location.\nWhile using DSO, a trigger can be adjusted at a certain\nthreshold level to capture the data when a PD pulse appears.\nThe length of the data (of PD signals) to be captured can be\nselected considering the length of the cable and the sampling\nperiod. The length of the data segment should be long enough\nto accommodate the reﬂections of the pulses, considering\nattenuation in the cable. The algorithm can be developed to\nmark the time of peaks appearing for incident and reﬂected\npulses. The TDoA of the ﬁrst two pulses (original and the\nreﬂected) determines the location of the defects. The data\nframes, presenting the same TDoA, will belong to the same\nPD source. Similarly, analysis encompassing all of the incom-\ning data frames will continuously determine if there is a single\nPD fault or more and where they are located.\nIn this work, single cable/phase is used to implement\nthe proposed location technique. In case of three phase\ncable installations which is the usual case in the real net-\nworks, the presented technique can be extended accordingly.\nAt the joints and terminations, the shielding of each of the\ncable/phase is separated and three HFCT sensors should be\ninstalled i.e., one sensor for each shielding. During faulty con-\nditions, the emerged PD signals from defective cable/phase\nwill be measured by the corresponding sensor and the fault\nlocation can be determined by using TDR techniques as\npresented above. It should be noted that in this case, the cor-\nresponding sensor (installed around the shielding of defective\ncable) will measure the strongest amplitude of the PD signal,\nwhile the other two sensors may measure a weak PD signal\ninduced due to capacitive /inductive coupling between the\nthree phases.\nVII. CONCLUSIONS\nDue to aging and operational stresses insulation defects\ndevelop in cable insulation which cause PD. PD location\nin underground cable networks is of critical importance.\nAccuracy of fault location can improve the efﬁciency of\nthe maintenance system for underground cable assets sig-\nniﬁcantly, especially considering the factors such as repair\ntime, cost, and discomfort to the general public due to power\ninterruptions and on-site repairs. A cable section or branch\ncan be long up to 500-1000 m and can have multiple defects,\nwhich can cause PDs simultaneously. When the PD mea-\nsurements are made, it contain all the information of the\nongoing PD activity along the affected cable. If multiple\nPD sources are active, analysis of the PD signals is quite\ncomplex. Reﬂections of the PD signals plays important role\nfor separation of the PD sources while performing TDR based\nanalysis.\nIn this work, experimental investigation was made on a\n200 m long MV power cable that has two PD sources at differ-\nent locations. It is proposed that the wave propagation veloc-\nity of the cable should be determined experimentally which\nwill enable to locate the PD faults with increase accuracy.\nTDR based measurement methodology has been adopted by\nusing single end measurements using HFCT sensor installed\nat one end of the cable. The presented study describes the\nmethodology for two PD sources. However, in case several\nPD sources are present at several locations, a brief discussion\nis presented for implementation of an ‘automated’ monitoring\nsystem based on principles of the proposed technique.\nAlthough XLPE has emerged as a robust dielectric insu-\nlation that makes the insulation of a cable sections quite\nreliable. However, joints and terminations are always needed\nand are the most vulnerable components of an MV cable.\nWhen the PD measurements are performed at a certain part of\nthe cable feeder having number of joints/terminations, there\nis a possibility that more than one locations are suffering\nwith the PD defects simultaneously. In this case, the pre-\nsented methodology will be useful to identify and locate the\nPD sources efﬁciently. This scenario is more likely in the\npaper insulated cable that are installed decades ago and have\nincreased number of joints due to number of repairs during\noperation.\nAs the networks are reaching to their capacity limits, high\ntemperature superconducting (HTS) cables are introduced as\na potential solution for carrying signiﬁcantly higher voltage\nand currents along with much lower losses as compared to\nconventional power cables. The presence of liquid nitrogen\nbased cooling in the HTS cable is an added capability that\nreduces the thermal stresses signiﬁcantly to avoid the defects\nin dielectric insulation layers. Similarly, the dielectric insu-\nlation is mechanically more protected because of inner and\nouter cryostat. Such features can improve the issues of dielec-\ntric deterioration in these cables to a great extent. However,\nthe cable joints and terminations are still the threat of the PD\ninception. Being new installations, it is proposed to ‘embed’\nthe PD sensors at the suitable locations along the cable feeder\n103616 VOLUME 7, 2019\nM. Shafiqet al.: Identification and Location of PD Defects in MV Underground Power Cables Using HFCT\nduring HTS cable installation that will improve the reliability\nof the network by early detection and location of the possible\nPD defects using proposed location technique.\nACKNOWLEDGEMENT\nThe authors would like to thank Prof. Guillermo Robles from\nUniversity Carlos III de Madrid, Spain for valuable discus-\nsions while working on the similar topics there.\nREFERENCES\n[1] Utilization of Underground and Overhead Power Lines in the City of\nNew York, Ofﬁce Long-Term Planning Sustainability, New York, NY ,\nUSA, Dec. 2013.\n[2] S. Swingler, J. Daly, and R. Woschitz, ‘‘Statistics of AC underground\ncables in power networks,’’ CIGRE Brochure, vol. 338, 2007.\n[3] Finland’s Seventh National Communication under the United Nations\nFramework Convention on Climate Change, Ministry Environ., Helsinki,\nFinland, 2017.\n[4] R. Sarathi, K. H. Oza, C. L. G. P. Kumar, and T. Tanaka, ‘‘Electrical\ntreeing in XLPE cable insulation under harmonic AC voltages,’’ IEEE\nTrans. Dielectr. Electr. Insul., vol. 22, no. 6, pp. 3177–3185, Dec. 2015.\n[5] P. L. Lewin, J. Steele-Davies, S. M. Rowland, V . Catterson, C. Johnstone,\nand C. Walton, ‘‘The state of the art of condition monitoring: Where do we\ngo from here?’’ in Proc. INSUCON, May 2013, pp. 58–66.\n[6] E. F. Steennis, P. Wagenaars, P. van der Wielen, P. Wouters, Y . Li,\nT. Broersma, and P. Bleeker, ‘‘Guarding MV cables on-line: With travelling\nwave based temperature monitoring, fault location, PD location and PD\nrelated remaining life aspects,’’ IEEE Trans. Dielectr. Electr. Insul., vol. 23,\nno. 3, pp. 1562–1569, Jun. 2016.\n[7] W. J. K. Raymond, H. A. Illias, A. H. A. Bakar, and H. Mokhlis, ‘‘Par-\ntial discharge classiﬁcations: Review of recent progress,’’ Measurement,\nvol. 68, pp. 164–181, May 2015.\n[8] H. Illias, G. Altamimi, N. Mokhtar, and H. Arof, ‘‘Classiﬁcation of\nmultiple partial discharge sources in dielectric insulation material using\nCepstrum analysis–artiﬁcial neural network,’’ IEEJ Trans. Elect. Electron.\nEng., vol. 12, no. 3, pp. 357–364, 2017.\n[9] C. Boya, M. Ruiz-Llata, J. Posada, and J. A. Garcia-Souto, ‘‘Identiﬁcation\nof multiple partial discharge sources using acoustic emission technique and\nblind source separation,’’IEEE Trans. Dielectr. Electr. Insul., vol. 22, no. 3,\npp. 1663–1673, Jun. 2015.\n[10] L. Hao, A. Contin, J. Hunter, P. L. Lewin, D. J. Swafﬁeld, C. Walton,\nand M. Michel, ‘‘A new method for automatic multiple partial discharge\nclassiﬁcation,’’ in Proc. 17th Int. Symp. High Voltage Eng., Hanover,\nGermany, 2011, pp. 1–6.\n[11] M. M. Yaacob, M. A. Alsaedi, J. R. Rashed, A. M. Dakhil, and S. F. Atyah,\n‘‘Review on partial discharge detection techniques related to high voltage\npower equipment using different sensors,’’ Photonic Sensors, vol. 4, no. 4,\npp. 325–337, 2014.\n[12] A. R. Mor, P. H. F. Morshuis, P. Llovera, V . Fuster, and A. Quijano,\n‘‘Localization techniques of partial discharges at cable ends in off-line\nsingle-sided partial discharge cable measurements,’’ IEEE Trans. Dielectr.\nElectr. Insul., vol. 23, no. 1, pp. 428–434, Feb. 2016.\n[13] G.-Y . Kwon, C.-K. Lee, Y . H. Lee, S. J. Chang, C.-K. Jung, and Y . J. Shin,\n‘‘Ofﬂine fault localization technique on HVDC submarine cable via time–\nfrequency domain reﬂectometry,’’ IEEE Trans. Power Del., vol. 32, no. 3,\npp. 1626–1635, Jun. 2017.\n[14] M. Shaﬁq, K. Kauhaniemi, G. Robles, M. Isa, and L. Kumpulainen,\n‘‘Online condition monitoring of MV cable feeders using Rogowski\ncoil sensors for PD measurements,’’ Electr. Power Syst. Res., vol. 167,\npp. 150–162, Feb. 2019.\n[15] M. Bawart, M. Marzinotto, and G. Mazzanti, ‘‘Diagnosis and location of\nfaults in submarine power cables,’’ IEEE Elect. Insul. Mag., vol. 32, no. 4,\npp. 24–37, Jul./Aug. 2016.\n[16] G. Robles, M. Shaﬁq, and J. M. Martínez-Tarifa, ‘‘Multiple partial dis-\ncharge source localization in power cables through power spectral separa-\ntion and time-domain reﬂectometry,’’ IEEE Trans. Instrum. Meas., to be\npublished.\n[17] H. N. Johnson, ‘‘Propagation of high frequency partial discharge signal in\npower cables,’’ Ph.D. dissertation, Univ. New South Wales, Sydney, NSW,\nAustralia, 2009.\n[18] M. Shaﬁq, M. Lethonen, L. Kutt, G. A. Hussain, and M. Hashmi, ‘‘Effect\nof terminating resistance on high frequency behaviour of Rogowski coil\nfor transient measurements,’’ Elektronika Elektrotechnika, vol. 19, no. 7,\npp. 22–28, 2013.\n[19] M. Gavita, ‘‘Inﬂuence of the semi-conducting screens on the wave propa-\ngation characteristics of medium voltage extruded cables,’’ Ph.D. disserta-\ntion, Royal Inst. Technol., Stockholm, Sweden, 2003.\n[20] Y . Li, P. A. A. F. Wouters, P. Wagenaars, P. C. J. M. van der Wielen,\nand E. F. Steennis, ‘‘Temperature dependent signal propagation velocity:\nPossible indicator for MV cable dynamic rating,’’ IEEE Trans. Dielectr.\nElectr. Insul., vol. 22, no. 2, pp. 665–672, Apr. 2015.\n[21] G. A. Hussain, M. Shaﬁq, L. Kumpulainen, F. Mahmood, and M. Lehtonen,\n‘‘Performance evaluation of noise reduction method during on-line moni-\ntoring of MV switchgear for PD measurements by non-intrusive sensors,’’\nInt. J. Elect. Power Energy Syst., vol. 64, pp. 596–607, Jan. 2015.\n[22] C. F. F. C. Cunha, A. T. Carvalho, M. R. Petraglia, and A. C. Lima, ‘‘A new\nwavelet selection method for partial discharge denoising,’’ Electr. Power\nSyst. Res., vol. 125, pp. 184–195, Aug. 2015.\n[23] N. A. Yusoff, M. Isa, H. Hamid, M. R. Adzman, M. N. K. H. Rohani,\nC. C. Yii, and N. N. Ayop, ‘‘Denoising technique for partial discharge\nsignal: A comparison performance between artiﬁcial neural network, fast\nFourier transform and discrete wavelet transform,’’ in Proc. IEEE Int. Conf.\nPower Energy (PECon), Nov. 2016, pp. 311–316.\n[24] D. Clark, R. Mackinlay, R. Giussani, L. Renforth, and R. Shuttleworth,\n‘‘Partial discharge pulse propagation, localisation and measurements in\nmedium voltage power cables,’’ in Proc. 48th Int. Univ. Power Eng. Conf.\n(UPEC), Sep. 2013, pp. 1–6.\n[25] M. Tozzi, ‘‘Partial discharge in power distribution electrical systems: Pulse\npropagation models and detection optimization,’’ Ph.D. dissertation, Dept.\nElect. Eng., Univ. Bologna, Bologna, Italy, 2010.\nMUHAMMAD SHAFIQ received the M.Sc.\ndegree from UET, Lahore, Pakistan, in 2007, and\nthe Ph.D. degree from Aalto University, Finland,\nin 2014. From 2001 to 2009, he was a Lecturer\nand an Assistant Professor with IUB, Pakistan, and\nfrom 2015 to 2017, he was a Researcher within\nindustrial organizations in Finland. He is currently\nan Assistant Professor with the Department of\nElectrical Engineering and Energy Technology,\nUniversity of Vaasa, Finland. His research interests\ninclude power systems and high voltage engineering while the topics of his\nresearch interest include, partial discharge diagnostics, condition monitoring\nof power system components, and design of sensors for high frequency\nmeasurements.\nIVAR KIITAM was born in Tallinn, Estonia,\nin 1992. He received the B.Sc. and M.Sc. degrees\nin electrical power engineering from the Tallinn\nUniversity of Technology (TalTech), in 2014 and\n2017, respectively, where he is currently pursuing\nthe Ph.D. degree with the Department of Elec-\ntrical Power Engineering and Mechatronics. His\nmain research interests include medium voltage\npower cable and covered conductor insulation\ndiagnostics.\nPAUL TAKLAJA received the M.Sc. and Ph.D.\ndegrees in electrical power engineering from the\nTallinn University of Technology, Tallinn, Estonia,\nin 2007 and 2012, respectively, where he is\ncurrently a Senior Lecturer Teaching Assistant\nwith the Department of Electrical Power Engi-\nneering. His research interest includes essentially\nhigh-voltage engineering issues.\nVOLUME 7, 2019 103617\nM. Shafiqet al.: Identification and Location of PD Defects in MV Underground Power Cables Using HFCT\nLAURI KÜTT received the B.Sc. degree in\ncomputer and automation technology and the\nM.Sc. degree in electrical power engineering from\nthe Tallinn University of Technology, Estonia,\nin 2002 and 2004, respectively, where he is cur-\nrently a Professor with the Department of Electri-\ncal Power Engineering. His current research topics\ninclude partial discharge measurements and power\nquality in distribution networks.\nKIMMO KAUHANIEMIwas born in Kankaanpää,\nFinland, in 1963. He received the M.Sc. and\nDr.Tech. degrees in electrical engineering from\nthe Tampere University of Technology, Finland,\nin 1987 and1993, respectively. He was with the\nVTT Technical Research Centre of Finland. He is\ncurrently a Professor and the Head of the Smart\nElectric Systems (SES) Research Group in elec-\ntrical engineering with the University of Vaasa,\nFinland. He has long-term experience on transient\nsimulation of various power systems. His research interests include electric-\nity distribution systems, relay protection, smart grids, and microgrids.\nIVO PALUwas born in Rakvere, Estonia, in1979.\nHe graduated from the Tallinn University of Tech-\nnology (TalTech). He received the Ph.D. degree\nin electrical power engineering, in 2009. He has\ntaught various courses, including wind energy and\nelectrical materials. He is currently a Professor\nand the Director of the Department of Electrical\nPower Engineering and Mechatronics, TalTech.\nHis main research interests include wind turbine\nco-operation with thermal power plants and grid\nintegration of new energy sources. He is a member of the Board of Estonian\nSociety for Electrical Power Engineering and the supervisory Board of\nEstonian Power Company Eesti Energia AS.\n103618 VOLUME 7, 2019",
  "topic": "Reflectometry",
  "concepts": [
    {
      "name": "Reflectometry",
      "score": 0.7145659923553467
    },
    {
      "name": "Partial discharge",
      "score": 0.7020760178565979
    },
    {
      "name": "Transformer",
      "score": 0.6332986354827881
    },
    {
      "name": "High voltage",
      "score": 0.6280664205551147
    },
    {
      "name": "Voltage",
      "score": 0.582195520401001
    },
    {
      "name": "Power cable",
      "score": 0.568774402141571
    },
    {
      "name": "Current transformer",
      "score": 0.4850679934024811
    },
    {
      "name": "Materials science",
      "score": 0.46764466166496277
    },
    {
      "name": "Electrical engineering",
      "score": 0.43700259923934937
    },
    {
      "name": "Computer science",
      "score": 0.43396836519241333
    },
    {
      "name": "Acoustics",
      "score": 0.35246753692626953
    },
    {
      "name": "Electronic engineering",
      "score": 0.33483046293258667
    },
    {
      "name": "Time domain",
      "score": 0.2808228135108948
    },
    {
      "name": "Engineering",
      "score": 0.21864086389541626
    },
    {
      "name": "Physics",
      "score": 0.16262894868850708
    },
    {
      "name": "Composite material",
      "score": 0.0
    },
    {
      "name": "Computer vision",
      "score": 0.0
    },
    {
      "name": "Layer (electronics)",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I79765343",
      "name": "University of Vaasa",
      "country": "FI"
    },
    {
      "id": "https://openalex.org/I111112146",
      "name": "Tallinn University of Technology",
      "country": "EE"
    }
  ],
  "cited_by": 34
}