{
  "title": "Fingerprinting tooling used for SSH compromisation attempts",
  "url": "https://openalex.org/W2971604521",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A2569710030",
      "name": "Vincent Ghiëtte",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2807851710",
      "name": "Harm Griffioen",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2144589931",
      "name": "Christian Doerr",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2888919071",
    "https://openalex.org/W2773671833",
    "https://openalex.org/W2148725298",
    "https://openalex.org/W2612544399",
    "https://openalex.org/W2158880761",
    "https://openalex.org/W2138779530",
    "https://openalex.org/W2885419983"
  ],
  "abstract": "&lt;p&gt;In SSH brute forcing attacks, adversaries try a lot of different username and password combinations in order to compromise a system. As such activities are easily recognizable in log files, sophisticated adversaries distribute brute forcing attacks over a large number of origins. Effectively finding such distributed campaigns proves however to be a difficult problem. In practice, when adversaries would spread out brute-forcing over multiple sources, they would likely reuse the same kind of software across all of these origins to simplify their operation and reduce cost. This means if we are able to identify the tooling used in these attempts, we could cluster similar tool usage into likely collaborating hosts and thus campaigns. In this paper, we demonstrate that it is possible to utilize cipher suites and SSH version strings to generate a unique fingerprint for a brute-forcing tool used by the attacker. Based on a study using a large honeynet with over 4,500 hosts, which received approximately 35 million compromisation attempts over the period of one month, we are able to identify 49 tools from the collected data, which correspond to off-the-shelf tools, as well as custom implementations. The method is also able to fingerprint individual versions of tools, and by revealing mismatches between advertised and actually implemented features detect hosts that spoof identifying information. Based on the generated fingerprints, we are able to correlate login credentials to distinguish distributed campaigns. We uncovered specific adversarial behaviors, tactics and procedures, frequently exhibiting clear timing patterns and tight coordination.&lt;/p&gt;",
  "full_text": null,
  "topic": "Computer science",
  "concepts": [
    {
      "name": "Computer science",
      "score": 0.8130980134010315
    },
    {
      "name": "Forcing (mathematics)",
      "score": 0.7043464183807373
    },
    {
      "name": "Brute-force attack",
      "score": 0.6184899806976318
    },
    {
      "name": "Fingerprint (computing)",
      "score": 0.5416072607040405
    },
    {
      "name": "Computer security",
      "score": 0.4804234504699707
    },
    {
      "name": "Implementation",
      "score": 0.4608267545700073
    },
    {
      "name": "Password",
      "score": 0.45056501030921936
    },
    {
      "name": "Software",
      "score": 0.4496862292289734
    },
    {
      "name": "Cryptography",
      "score": 0.4300905466079712
    },
    {
      "name": "Dictionary attack",
      "score": 0.42732322216033936
    },
    {
      "name": "Data mining",
      "score": 0.32799217104911804
    },
    {
      "name": "Operating system",
      "score": 0.18997004628181458
    },
    {
      "name": "Programming language",
      "score": 0.11971992254257202
    },
    {
      "name": "Climatology",
      "score": 0.0
    },
    {
      "name": "Geology",
      "score": 0.0
    }
  ],
  "institutions": []
}