{
    "title": "A Magnetic Integration Half-Turn Planar Transformer and its Analysis for LLC Resonant DC-DC Converters",
    "url": "https://openalex.org/W2971535912",
    "year": 2019,
    "authors": [
        {
            "id": "https://openalex.org/A2103156450",
            "name": "Siqi Li",
            "affiliations": [
                "Kunming University of Science and Technology"
            ]
        },
        {
            "id": "https://openalex.org/A2781660554",
            "name": "Qingyun Min",
            "affiliations": [
                "Kunming University of Science and Technology"
            ]
        },
        {
            "id": "https://openalex.org/A2781675728",
            "name": "Enguo Rong",
            "affiliations": [
                "Kunming University of Science and Technology"
            ]
        },
        {
            "id": "https://openalex.org/A311940369",
            "name": "Rui Zhang",
            "affiliations": [
                "Kunming University of Science and Technology"
            ]
        },
        {
            "id": "https://openalex.org/A2118650554",
            "name": "Xiao Du",
            "affiliations": [
                "Chongqing University"
            ]
        },
        {
            "id": "https://openalex.org/A2119175987",
            "name": "Sizhao Lu",
            "affiliations": [
                "Kunming University of Science and Technology"
            ]
        },
        {
            "id": "https://openalex.org/A2103156450",
            "name": "Siqi Li",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2781660554",
            "name": "Qingyun Min",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2781675728",
            "name": "Enguo Rong",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A311940369",
            "name": "Rui Zhang",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2118650554",
            "name": "Xiao Du",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2119175987",
            "name": "Sizhao Lu",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2343554252",
        "https://openalex.org/W2764000272",
        "https://openalex.org/W2989077469",
        "https://openalex.org/W2781820314",
        "https://openalex.org/W2738738521",
        "https://openalex.org/W2802026651",
        "https://openalex.org/W6764010518",
        "https://openalex.org/W2041804496",
        "https://openalex.org/W2587980601",
        "https://openalex.org/W2267906907",
        "https://openalex.org/W2324560218",
        "https://openalex.org/W2624232654",
        "https://openalex.org/W2807785660",
        "https://openalex.org/W2901882470",
        "https://openalex.org/W2775764216",
        "https://openalex.org/W2136967699",
        "https://openalex.org/W2771667497",
        "https://openalex.org/W2798903009",
        "https://openalex.org/W2787428195",
        "https://openalex.org/W2770528695",
        "https://openalex.org/W1981446187",
        "https://openalex.org/W2171112454",
        "https://openalex.org/W2786051200",
        "https://openalex.org/W6678247880",
        "https://openalex.org/W2783337029",
        "https://openalex.org/W2171886847",
        "https://openalex.org/W2588447273",
        "https://openalex.org/W2115067661",
        "https://openalex.org/W1977589576",
        "https://openalex.org/W2461298332",
        "https://openalex.org/W2591444556",
        "https://openalex.org/W2769601230",
        "https://openalex.org/W2553847369",
        "https://openalex.org/W3203050822",
        "https://openalex.org/W2774484102",
        "https://openalex.org/W2947993217",
        "https://openalex.org/W2123045138"
    ],
    "abstract": "A high frequency planar transformer with integrated leakage inductance and half-turn secondary windings is proposed for LLC isolated DC-DC converters. The primary windings are wound on both the center leg and the sides leg of an EI planar ferrite core to integrate the leakage inductance. With the proposed method, the magnetizing inductance is constant while adjusting the leakage inductance, thus the design of the magnetizing inductance and the leakage inductance can be decoupled. To adapt the high voltage transform ratio from 380V to 12V, the number of turns of the secondary windings is designed to be 0.5. The output voltage ripple of the LLC converter equipped with the proposed transformer is analyzed and its output filter is designed. The characteristics of the proposed transformer are simulated by ANSYS Maxwell and Simplorer. Finally, a 360V<sub>~</sub>400V input, regulated 12V output, 750W LLC resonant converter with silicon carbide (SiC) devices was built with the proposed transformer. The evaluated converter realized a power density of 23.1W/cm<sup>3</sup> and a peak efficiency of 97% with all the auxiliary power and control circuit included.",
    "full_text": "Received August 22, 2019, accepted August 28, 2019, date of publication September 3, 2019, date of current version September 20, 2019.\nDigital Object Identifier 10.1 109/ACCESS.2019.2939274\nA Magnetic Integration Half-Turn Planar\nTransformer and Its Analysis for\nLLC Resonant DC-DC Converters\nSIQI LI\n1, (Member, IEEE), QINGYUN MIN1, ENGUO RONG1, (Student Member, IEEE),\nRUI ZHANG1, XIAO DU2, AND SIZHAO LU\n1, (Member, IEEE)\n1Department of Electrical Engineering, Kunming University of Science and Technology, Kunming 650500, China\n2State Key Laboratory of Power Transmission Equipment & System Security and New Technology, Chongqing University, Chongqing 400044, China\nCorresponding author: Sizhao Lu (lusz10@kmust.edu.cn)\nThis work was supported in part by the National Natural Science Foundation of China under Grant 51607081 and Grant 51707088 and in\npart by the Program of Science and Technology Department of Yunnan Province under Grant 2018BA061.\nABSTRACT A high frequency planar transformer with integrated leakage inductance and half-turn\nsecondary windings is proposed for LLC isolated DC-DC converters. The primary windings are wound\non both the center leg and the sides leg of an EI planar ferrite core to integrate the leakage inductance. With\nthe proposed method, the magnetizing inductance is constant while adjusting the leakage inductance, thus\nthe design of the magnetizing inductance and the leakage inductance can be decoupled. To adapt the high\nvoltage transform ratio from 380V to 12V, the number of turns of the secondary windings is designed to\nbe 0.5. The output voltage ripple of the LLC converter equipped with the proposed transformer is analyzed\nand its output ﬁlter is designed. The characteristics of the proposed transformer are simulated by ANSYS\nMaxwell and Simplorer. Finally, a 360V∼400V input, regulated 12V output, 750W LLC resonant converter\nwith silicon carbide (SiC) devices was built with the proposed transformer. The evaluated converter realized\na power density of 23.1W/cm 3 and a peak efﬁciency of 97% with all the auxiliary power and control circuit\nincluded.\nINDEX TERMS Half-turn planar transformer, magnetic integration, LLC converter.\nI. INTRODUCTION\nWith the developing of new semiconductor power devices\nand topologies, the efﬁciency and power density of the iso-\nlated DC/DC converters are increasing continuously [1], [2].\nThe LLC resonant converter, which can achieve zero volt-\nage switching (ZVS) for primary switches and zero current\nswitching (ZCS) for secondary synchronous rectiﬁers (SRs)\nto lower the switching losses [3]–[5], is very attractive in high\nswitching frequency applications. The design of the isolated\ntransformer is critical for an LLC converter. The planar shape\ntransformer has been proved to have superior performance\nthan traditional wire wound transformers in high power den-\nsity converters [6]–[9]. For a planar transformer, it is easy\nto achieve high coupling coefﬁcient and low leakage induc-\ntance between the primary and secondary windings [10], [11].\nA resonant inductor is necessary in a regulated LLC con-\nverter to keep the output voltage constant within the input\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Giambattista Gruosso.\nvoltage range and under different load conditions [12]–[14].\nIt is easy to integrate the resonant inductor into a traditional\ntransformer by increasing the leakage inductance. However,\nthe primary and secondary side windings are close to each\nother in the planar transformer. It is difﬁcult to increase the\nleakage inductance. Usually, an extra independent inductor is\nintroduced [15], which means there are at least two magnetic\ncomponents in the converter.\nOnly a few papers have demonstrated how to integrate\nthe leakage inductance into a planar transformer. In [16],\nthe primary and secondary side windings are conﬁgured at\na distance to create the leakage inductance with a simple EE\nplanar ferrite core. The gap between the two windings may\nlower the power density of the transformer. In [17], different\ncenter and side air gaps are designed to generate the leakage\ninductance. The leakage and magnetic inductance change at\nthe same time when air gaps change, which increases the\ndesign difﬁculty.\nWhen the switching frequency increases, the number of\nturns can be reduced. However, the minimum turn of the\n128408 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see http://creativecommons.org/licenses/by/4.0/ VOLUME 7, 2019\nS. Li et al.: Magnetic Integration Half-Turn Planar Transformer and Its Analysis for LLC Resonant DC–DC Converters\nwindings in the low-voltage side for a conventional trans-\nformer is one, which prevents the number of turns from being\nfurther reduced. To take advantage of the high frequency,\nthe core size should be reduced. Otherwise, the magnetic ﬂux\ndensity in the ferrite would be so small that the core is not\nfully utilized. This leads to the design of multi-core matrix\ntransformer which is formed by several small transform-\ners [18]–[22]. A two-core matrix transformer is proposed\nfor high frequency and high power density LLC convert-\ners [18], [20]. The primary windings are connected in series\nfor high voltage. The secondary windings are connected in\nparallel for high current. The turn ratio of each transformer\nis 8:1 to realize an overall voltage ratio of 16:1. The current\nsharing between the two transformers should be specially\nhandled since the core and winding parameters are not exactly\nidentical [23]–[25]. To better take the advantage of high\nfrequency, a half-turn transformer is proposed to further\nreduce the number of turns to 0.5 [26], [27]. A larger core\ncan be used with the half-turn winding conﬁguration with full\nutilization of the core. Using the half-turn winding conﬁgu-\nration, a single transformer with turns ratio 8:0.5 could take\nplace of the two-core matrix transformer. One beneﬁt of the\nhalf-turn winding conﬁguration is that the number of trans-\nformers can be reduced. The other is that the currents in the\nparalleled secondary side windings for half-turn transformer\nare induced from the same primary side altering current,\nso the secondary side current sharing is much easier to realize.\nIn this paper, a half-turn planar transformer with integrated\nleakage inductance is proposed. A simple EI ferrite core is\nadopted. The leakage inductance is increased and adjusted by\ndistributing the primary side windings to both the center and\nthe side legs of the ferrite core. Meanwhile, the main mag-\nnetizing inductance can be kept almost constant to decouple\nthe leakage inductance design. The terminal effects of the\nhalf-turn transformer are also analyzed. A CLC type output\nﬁlter, which can take advantage of the stray inductance of the\nterminal effect, is introduced to reduce the voltage ripple.\nThe structure of the rest of the paper is organized as fol-\nlows. In Section II, the structure and working principle of the\nproposed transformer are introduced. The simulation results\nof the proposed transformer and its application in an LLC\nconverter are given in Section III. In Section IV, a prototype\nLLC converter with 750W output power, 360∼400V input\nvoltage range and 12V regulated output voltage was built and\ntested based on the proposed transformer. The experimental\nresults are given to verify the analysis and the simulation.\nConclusions are drawn in Section V.\nII. PROPOSED MAGNETIC INTEGRATION TRANSFORMER\nThe LLC converter with the magnetic integration half-turn\nplanar transformer is shown in Fig. 1. Vin is the DC input\nvoltage. Q1 and Q2 are two power MOSFETs in the primary\nhalf-bridge. Cr is the resonant capacitor. Lr is the leakage\ninductance of the transformer, which is used as the resonant\ninductor. Lm is the magnetizing inductance. The turns of\nthe transformer is 8:0.5:0.5:0.5:0.5 to adapt dc input voltage\nFIGURE 1. An LLC converter with the proposed transformer.\nrange 360∼400V, output voltage 12V. w1∼w4 are the four\nwindings of the transformer secondary side. SR1∼SR4 are\nsynchronous rectiﬁer MOSFETs. V0 is the output voltage.\nP is the positive output point of the synchronous rectiﬁer, and\nG is the negative output point of the synchronous rectiﬁer.\nA. MAGNETIC INTEGRATION\nThe primary windings in the most conventional planar trans-\nformer are wound on the center leg of the EI core M2,\nas shown in Fig. 2(a) [6], [11], [26]. As the secondary wind-\nings are also on the center leg which are near the primary\nwindings, the leakage inductance is low. To increase the\nleakage inductance, the primary windings can be wound on\nthe two-side legs of the magnetic core M1 and M3, as shown\nin Fig. 2(b), which will increase leakage magnetic ﬂux in the\nair and generate the largest leakage inductance. By changing\nthe distribution of the primary windings on the three legs,\nthe leakage inductance can be adjusted [28]. When the pri-\nmary windings are wound on all the three legs, as shown in\nFig. 2(c), the leakage inductance is higher than the leakage\ninductance in Fig.2(a) and lower than leakage inductance\nin Fig.2(b). In this case, the direction of the magnetic ﬂux\ndensity B in M1 and M3 is the same, but it is opposite in M2.\nThe distributions of magnetic line of force for this case are\nshown in Fig. 2(d).\nThe magnetic circuit of the primary windings in Fig. 2(c)\nis shown as Fig. 2(e). The magnetic paths I and II contain\nreluctance Rm, Rair and Rair2. Rm is the reluctance in the\ncore, Rair represents the air-gap reluctance of the two-side\nlegs, and Rair2 is the air-gap reluctance of the center leg. The\nmagnetic paths III, IV represent the paths of ﬂux in the air.\nThe magnetic paths III, IV contain three reluctances Rσm1,\nRair and Rσ_air1. Rσm1 is reluctance in the core, Rσ_air1 is the\nequivalent reluctance of ﬂux in the air. The magnetic paths\nV , VI contain three reluctances Rair2, Rσm2 and Rσ_air2. Rσm2\nis reluctance in the core and Rσ_air2 is reluctance in the air.\nAs magnetic conductivity in the air µair is far lower than\nthat in the core µcore, and the width of the air gap in the\nmagnetic core is far less than the air length of the magnetic\npaths III, IV, V and VI, the relations of the reluctances can be\nVOLUME 7, 2019 128409\nS. Li et al.: Magnetic Integration Half-Turn Planar Transformer and Its Analysis for LLC Resonant DC–DC Converters\nFIGURE 2. Primary side winding methods with different leakage inductance, (a) minimum leakage inductance,\n(b) maximum leakage inductance, (c) medium leakage inductance, (d) the distribution of magnetic line of force\n(e) magnetic circuit of primary windings, (f) magnetic circuit of secondary windings.\nexpressed as\nRair ≈2 ·Rair2 ≫Rm (1)\nRσ_air1 ≫Rair ≫Rσm1 (2)\nRσ_air2 ≫Rair2 ≫Rσm2 (3)\nWhen the secondary windings are wound on the center\nleg, the ﬂux are linked with magnetic paths I, II, III, IV ,\nV and VI. The magnetic circuit of secondary windings is\nshown as Fig. 2(f). The magnetic paths III, IV contain three\nreluctances Rσm1, Rair and Rσ_air4. Rσ_air4 is reluctance in\nthe air. The magnetic paths V , VI contain three reluctances\nRair, Rσm2 and Rσ_air3. Rσ_air3 is reluctance in the air. As the\nmagnetic line in the air is related to both the core shape and\ncoil structure, Rσ_air3 and Rσ_air4 can be expressed as\nRσ_air3 ̸=Rσ_air2 ≫Rair2 ≫Rσm2 (4)\nRσ_air4 ̸=Rσ_air1 ≫Rair ≫Rσm1 (5)\nAccording to Faraday’s law, the magnetic ﬂux φm in\npaths I and II generated by the primary current can be\ndiminished by the magnetic ﬂux generated by the secondary\ncurrent. So I and II are main magnetic paths, and φm gen-\nerates magnetizing inductance Lm. As the magnetic reluc-\ntances in the air are different, some of the magnetic ﬂux\nin path V and VI generated by the primary current can’t\n128410 VOLUME 7, 2019\nS. Li et al.: Magnetic Integration Half-Turn Planar Transformer and Its Analysis for LLC Resonant DC–DC Converters\nbe diminished, and the remain magnetic ﬂux φσ1 generates\nleakage inductance Lσ1. When air gap increases, φσ1 and\nLσ1 will increase. Flux fringing and proximity effects will\nbe more serious, which will increase the winding AC resis-\ntance [20]. Lσ1 should be decreased to improve the efﬁciency.\nThe primary and secondary side windings in Fig.2 (c) are\noverlapped to achieve perfect interleaving, so low Lσ1 can\nbe achieved.\nAs the secondary windings are coiled on the center legs,\nthere is only magnetic motive force Ts ·is, and Rσ_air4 ≫\nRair ≫Rm, so magnetic ﬂux generated by secondary cur-\nrent in paths III and IV is very little. However, the primary\nwindings coiled on the M1 and M3 can generate magnetic\nmotive force T1 ·ip and T3 ·ip, the magnetic ﬂux φσ generated\nby primary current in paths III and IV is much larger than\nthe magnetic ﬂux generated by secondary current despite\nRσ_air1 ≫Rair ≫Rσm1, so magnetic ﬂux generated by sec-\nondary current in paths III and IV can be ignored. Therefore,\nIII and IV can be regarded as leakage magnetic paths and φσ\ngenerates leakage inductance Lσ2. φσ ﬂows into the primary\nwindings coiled on the M1 and M3, litz wire is chosen for pri-\nmary windings to lower ﬂux fringing and proximity effects.\nφσ doesn’t link with the secondary windings, which means\nthe loss brought by ﬂux fringing and proximity effects is low.\nThe area of the center leg is twice that of either of the two-\nside legs, so the equivalent turns of windings on the two-side\nlegs are half of their actual number of turns [29]. The overall\nturns of the primary windings Tp are calculated as\nTp =T1 ·1\n2 +T2 +T3 ·1\n2 =T1 +T2 (6)\nwhere T1, T3 and T2 are the number of turns of the windings\non the side legs and on the center leg, respectively. T1 and T3\nare designed the same for symmetry magnetic ﬂux.\nMain magnetic paths I and II contain Rm,Rair and Rair2,\nRair2 ≫Rm and Rair ≫Rm, so magnetizing inductance Lm is\ncalculated as\nLm = Tp2\n(Rm +Rair)/2 +Rair2\n≈ Tp2\nRair/2 +Rair2\n(7)\nIt can be seen from (7) that if air gap and TP is constant,\nLm is constant. If air gap increases, Lm will decrease.\nLeakage inductance Lσ contains Lσ1 and Lσ2. Lσ2 is gener-\nated by φσ. Leakage magnetic paths III and IV contain Rσm1,\nRair and Rσ_air1. Because of Rσ_air1 ≫Rair ≫Rσm1, the\ntransformer leakage inductance Lσ is calculated as\nLσ =Lσ2 +Lσ1\n= T12\nRσm1 +Rσ_air1 +Rair\n·2 +Lσ1\n≈ T12\nRσ_air1 +Rair\n·2 +Lσ1 (8)\nFor a planar transformer, Lσ1 is low. Air gap is usually\nsmall, and the change of air gap is small. When air gap\nchange, the impact of the change of Lσ1 on Lσ is low.\nLσ1 can be treated as constant. So if T1 increases, Lσ will\nincrease. Meanwhile, the relation of Lσ and T12 is linear.\nSince Rσ_air1 ≫Rair, the impact of the gap changing on the\nleakage inductance is very low.\nB. HALF-TURN SECONDARY WINDINGS\nIn this paper, the half-turn secondary conﬁguration using\ntwo U-shape windings proposed in [30] is employed. They\nare overlapped in the opposite direction to form a complete\nsecondary current loop. The secondary windings are shown\nin Fig. 3. SR1, SR2, SR3 and SR4 are synchronous rectiﬁca-\ntions and C1, C2, C3 and C4 are output capacitors. P1 and P2\nare positive output terminals. G1, G2, G3 and G4 are the nega-\ntive output terminals. All the positive terminals are connected\ntogether through a printed circuit board (PCB) or copper\nsheet, so do the negative terminals.\nFIGURE 3. Transformer structure of the secondary windings [30].\nAccording to [30], w1 and w3 output current in positive\nhalf cycle, and w2 and w4 output current in the negative half\ncycle. For the convertional transformer, the minimum number\nof turns is one, which can be considered as two half-turn\nwindings connected in series. For half-turn transformer, two\nhalf-turn windings outputs are connected in parallel, which\ncan reduce the copper loss. Therefore, half-turn transformer\nis very suitable for the high output current applications.\nIII. MAGNETIC SIMULATIONS\nSimulations are conducted to evaluate the proposed magnetic\nintegration method for an LLC converter. A three dimension\n(3D) transformer model is built and simulated using ANSYS\nMaxwell. The relations between the winding distributions\nand the main/leakage inductances are investigated. To eval-\nuate the performance of the proposed transformer in the\nLLC resonant converter, ANSYS Maxwell and Simplorer are\nemployed to perform the circuit-magnetic co-simulation. The\nsimulation and analysis results for the leakage inductances,\nmagnetic ﬂux density distributions, the current sharing per-\nformance and the terminal effects will be presented in the\nfollowing parts.\nVOLUME 7, 2019 128411\nS. Li et al.: Magnetic Integration Half-Turn Planar Transformer and Its Analysis for LLC Resonant DC–DC Converters\nA. SIMULATIONS AND MEASUREMENTS OF THE\nLEAKAGE INDUCTANCES\nThe structure of the proposed transformer is shown in Fig. 4.\nPrimary windings include the windings T1, T3 and T2, which\nare wound on the two-side legs M1, M3 and the center\nleg M2. Sec.1 and Sec.2 are the secondary windings. In the\nproposed transformer, the two sets of secondary windings\nconduct alternatively. The equivalent leakage inductance can\nbe measured with one secondary winding shorted [31]. In this\ncase, the secondary side forms a closed loop circuit. In order\nto analyze the leakage inductance, an equivalent transformer,\nwhose secondary windings are shorted circuit, is modeled in\nthe Maxwell and simulated by using Magnetic Eddy Current\nsolver. Meanwhile, a planar transformer is also built with\nEILP32, whose material is N49 from TDK. It is suitable for\n300 kHz∼1MHz operating frequency. Litz wire 0.04 ∗400 is\nchosen as primary windings and wound on all the three\nlegs. A 0.2mm thickness copper sheet is processed into\nthe U shape secondary windings by a Computer Numerical\nControl (CNC) machine, which is shown in Fig. 4.\nFIGURE 4. The structure of the transformer.\nTo measure the leakage inductance, we ﬁrstly keep the\nair-gap constant to 0.08mm and change the primary winding\ndistributions among T1, T2 and T3. Fig. 5 shows the simu-\nlation and measurement results of the relationships between\nthe primary leakage/magnetizing inductances and T12. The\nleakage inductance can be easily adjusted by changing T1\nand the adjustment has little impact on the main magnetizing\ninductance. Meanwhile, the relationship between the leakage\ninductance and T12 is about linear and the goodness of ﬁt R2\nis above 0.993. The simulation and measurement results agree\nFIGURE 5. Relationship between the primary leakage inductance or\nmagnetizing inductance andT12.\nwell with equation (8). The conﬁguration of the transformer\ntested in this paper is also marked in Fig. 5.\nThen, the inﬂuence of the air gap on leakage/magnetizing\ninductances under three different primary winding distribu-\ntions are investigated. Fig. 6 shows simulation results of\nthe relationships between leakage inductance or magnetizing\ninductances and the air gap. When the air gap increases,\nleakage inductance is almost constant, but the magnetic\ninductance decreases a lot. Meanwhile, it can be seen from\nFig. 6 that the inﬂuence of the distributions of primary side\nwindings on the magnetic inductance is small.\nFIGURE 6. Relationship between the primary leakage inductance or\nmagnetizing inductance and air gap.\nIn summary, the leakage inductance can be adjusted by the\nturns of windings on the two-side legs, while the magnetizing\ninductance is almost constant. When the air gap increases,\n128412 VOLUME 7, 2019\nS. Li et al.: Magnetic Integration Half-Turn Planar Transformer and Its Analysis for LLC Resonant DC–DC Converters\nthe magnetizing inductance will decrease, but the leakage\ninductance keeps almost constant. Therefore, the design of\nthe leakage inductance and the main magnetizing inductance\ncan be decoupled to ease the transformer design procedure.\nB. THE DISTRIBUTIONS OF MAGENETIC FLUX DENSITY\nAND CURRENT DENSITY\nA 3D model of the proposed transformer structure shown\nin Fig. 2(c) is built in Maxwell as shown in Fig. 7. It shows\nthat a 6-turn primary winding is coiled on the each outer\nleg and a 2-turn primary winding is coiled on the center\nleg to generate the desirable leakage inductance for the LLC\nconverter. Primary windings are designed as octagon and the\ncurrent excitations are set to ‘‘Stranded’’ for a litz winding\nin the simulation. Four secondary windings are designed as\nrectangle and the current excitations are set to ‘‘Solid’’ for\nthe copper sheet.\nFIGURE 7. 3D simulation model for Maxwell.\nFig. 8 shows the magnetic-electric co-simulation results of\nmagnetic ﬂux density distributions of the core and current\ndensity distributions of the windings with w2 and w4 con-\nducting current. The current density in the secondary winding\nw2 and w4 is high, while the current density in the secondary\nwinding w1 and w3 is almost zero. The magnetic ﬂux density\nB is symmetry and below 80 mT. The utilization of the core\nis balanced with reasonable losses.\nFIGURE 8. FEA simulation results of magnetic flux density distributions of\nthe core and current density distributions of the windings.\nFig. 9 shows current density distributions of the secondary\nwindings w1 and w2. At this moment, w2 and w4 output cur-\nrents. From the simulation results, we can see that the current\nin w2 is evenly distributed, which indicates the ﬂux fringing\nand the proximity effects are low. At the terminal, the pri-\nmary and secondary windings are not perfect overlapped\nto cancel the magnetic ﬂux in each other, the current den-\nsity becomes much higher (about 100%) in a small portion.\nFIGURE 9. FEA simulation results of current density distributions of the\nsecondary windings.\nFurther optimization can be studied to reduce the terminal\nconnection loss.\nC. CURRENT SHARING PERFORMANCE OF THE\nWINDINGS\nTo observe the current waveforms in each winding, Simplorer\nis adopted to conduct the magnetic-electric co-simulation.\nThe currents in each secondary side winding are shown\nin Fig. 10.\nFIGURE 10. Currents in each secondary winding.\nIn Fig. 10, the current in w1 I.SR1 and the current in w3\nI.SR3 output simultaneously during the positive half cycle,\nand the current in w2 I.SR2 and the current in w4 I.SR4 output\ncurrent simultaneously during the negative half cycle. The\ndifference of I.SR1 and I.SR3 or I.SR2 and I.SR4 is very small,\nbelow 0.96%, which shows excellent current sharing of the\nparalleled windings. The difference of primary current in the\npositive half cycle and the negative half cycle is about 1.05%,\nso the primary current is also symmetry in one cycle. The sim-\nulation results of mutual inductors and the winding inductors\nare shown in Table 1. The mutual inductors MP1 and MP3\ndiffer only about 1.67%, and L1 and L3 differ only 0.9%.\nVOLUME 7, 2019 128413\nS. Li et al.: Magnetic Integration Half-Turn Planar Transformer and Its Analysis for LLC Resonant DC–DC Converters\nTABLE 1. Simulation results of mutual inductors and winding inductors.\nA good current sharing is achieved because all the windings\nare in one core, the primary windings is symmetrical and four\nhalf turn windings are the same, which makes the parameters\nvariations relatively small.\nAccording to the analysis in Section II, w1 and w3 output\ncurrent simultaneously, forming a complete magnetic circuit,\nand w2 and w4 output current simultaneously, forming a\ncomplete magnetic circuit. So, the equivalent inductor Leq in\na half cycle is calculated as\nLeq =L1 +L3 +2 ·M13 (9)\nCoupling coefﬁcient k and leakage inductor Lσ are calcu-\nlated as\nk = Mp1 +Mp3\n√Lp ·√Leq\n(10)\nLσ =Lp ·\n(\n1 −k2\n)\n(11)\nThe calculated results of the leakage inductors are shown\nin the TABLE 2. The parameters during a half cycle and the\nother cycle differ little, so the difference of current is little.\nTABLE 2. The calculated results of leakage inductors.\nD. TERMINAL EFFECTS\nAs shown in Fig. 3, the transformer has two positive out-\nput terminals and four negative output terminals. These two\npositive output terminals and four negative output terminals\nshould be connected, respectively. However, the connect-\ning terminals have some inductance about tens of nH, (e.g.\n18nH based on the simulation result in this paper), as shown\nin Fig. 11. The voltage on the inductance is tens of mV, even\nhundreds of mV, which induces the output voltage ripples.\nThe load is connected to the output terminals as shown\nin Fig. 12(a). C1, C2, C3 and C4 are ﬁlter capacitors. L1, L2,\nL3 and L4 are the connecting terminal inductors, which will\ninduce large ripple on the output voltage. In order to reduce\nFIGURE 11. 3D simulation model of Maxwell.\nFIGURE 12. Output filter Configurations, (a) CL filter, (b) CLC filter.\nthe output voltage ripples, a capacitor C5 is added to form a\nCLC ﬁlter, as shown in Fig. 12(b).\nTo make a fair comparison, we keep the same total ﬁlter\ncapacitances for the CL and CLC ﬁlter. The results of the\nsimulations are shown in Fig. 13. The output voltage with\nCL ﬁlter is ﬂuctuant and the voltage ripple is high. When the\noutput power increases, the voltage ripple will also increase.\nWhen the output power is 400W, the output voltage ripple is\n63mV; when the output power is 600W, the output voltage\nripple increases to 120mV. However, output voltage with\n128414 VOLUME 7, 2019\nS. Li et al.: Magnetic Integration Half-Turn Planar Transformer and Its Analysis for LLC Resonant DC–DC Converters\nFIGURE 13. The simulation results of the CL and CLC filters.\nCLC ﬁlter is smooth and the output voltage ripple is\nonly 10mV.\nIV. EXPERIMENTAL RESULTS\nA 500-kHz LLC converter with the proposed transformer\nis designed to verify the analysis and simulation results.\nAn integrated controller NCP1398 from Onsemi is selected\nas the controller. The operation frequency of the NCP1398 is\nfrom 50kHz to 750kHz. In this paper, the nominal switch-\ning frequency is selected at about 500kHz. SiC MOSFET\nC3M0120090J is chosen as the primary side switches for\nsuperior high frequency switching performance than silicon\nMOSFET. Besides the lower switching loss, the reverse\nrecovery of SiC MOSFET’s internal diode is much faster\nthan Si MOSFET’s [2], which makes the SiC converter more\nreliable when ZVS is lost during the transient process.\nFor designing the converter parameters the fundamental\nharmonic approximation (FHA) method is considered. The\nturns of the transformer is designed as 8:0.5 to adapt 380/12V.\nAccording to [3], the parameters of the LLC converter is\ndesigned, which is listed in Table 3.\nTABLE 3. Parameters of LLC converter with the proposed transformer.\nThe picture of the LLC converter with the proposed\nmagnetic integration half-turn planar transformer is shown\nin Fig. 14. Its size is 5.8cm length, 5.6cm width and 1.0cm\nthickness. An output peak power of 750 W at such a dimen-\nsion is equivalent to a power density of around 23.1W/cm 3.\nFig. 15 shows the measured voltage and current waveforms\nat output power 375W. The MOSFET Vds falls to zero before\nFIGURE 14. Picture of the LLC converter with the proposed transformer.\nFIGURE 15. Measured voltage and current waveforms.\nVgs triggers, which means ZVS for primary switches is\nachieved.\nThe parameters of different ﬁlters are shown in the Table 4.\nCf is the ﬁrst capacities, which is total of C1, C2, C3 and C4\nin Fig.12. Cs is the second capacities, which is C5 in Fig.12(b)\nand Ct is the total capacities. The output voltage ripple is\nmeasured on RL in Fig. 12.\nTABLE 4. The parameters of three filter designs.\nWhen output power is 375W, output voltage ripple wave-\nforms with three ﬁlter designs are shown in Fig. 16. For the\nCLC ﬁlter 1, its capacitance is the same as CL ﬁlter’s, but\nit can reduce the voltage ripple more than 40% compared\nwith the CL ﬁlter. For the CLC ﬁlter 2, its total capacitance\nis 60 µF less than that of other two cases, but the voltage\nVOLUME 7, 2019 128415\nS. Li et al.: Magnetic Integration Half-Turn Planar Transformer and Its Analysis for LLC Resonant DC–DC Converters\nFIGURE 16. Output voltage ripple waveforms with different filters.\nripple is less about 22% than the CL ﬁlter’s. And the CLC\nﬁlter 1 waveform is similar to the waveform of the CLC\nﬁlter 2. The relationship between the voltage ripple peak to\npeak value and the output power is shown in Fig. 17. It can\nbe seen from Fig. 17 that the CLC ﬁlter 1 has the lowest\nvoltage ripple, and the curve is the most smooth when the\noutput power is increased. Although the capacitance of the\nCLC ﬁlter 2 is 60µF less than CL ﬁlter’s, the voltage ripple\nof CLC ﬁlter 2 is still lower than CL ﬁlter’s, which shows the\nadvantage of the CLC ﬁlter compared with the CL ﬁlter.\nFIGURE 17. Output voltage ripple vs output power.\nFig. 18 is thermal image of the LLC converter at output\npower 450W after 5 minutes, with a 150 LFM horizontal\nairﬂow. The highest temperature is 62.9 ◦C. When the power\ndissipation of the auxiliary power supplies and all control\ncircuits are taken into consideration, the measured efﬁciency\nof the LLC converter is shown in Fig. 19, in which a peak\nefﬁciency of 97% is achieved at half load condition.\nThe performance comparisons with some other regulated\nLLC converters are shown in Table 5. The proposed converter\nis quite competitive in both efﬁciency and power density.\nIn order to easily adjust the turns of primary windings\non the three legs and discuss the characteristcs of the trans-\nformer, litz wire is adopted for the primary side windings.\nFIGURE 18. Thermal image.\nFIGURE 19. Measured efficiency of the converter.\nTABLE 5. The performance comparisons with four similar DC/DC\nconverters.\nLitz is wound on the legs of the ferrite core, which isn’t per-\nfect. Litz is wound in the model regularly, and the primary and\nsecondary windings inside the ferrite cores and terminal areas\nare overlapped to achieve more perfect interleaving, which\ncan reduce Lσ1, reduce the eddy current loss of secondary\nwindings and improve the efﬁcieny [34]. Some advanced con-\ntrol methods can be introduced to improve the efﬁciency of\nthe proposed converter further. Simpliﬁed optimal trajectory\ncontrol (SOTC) can improve light-load effeciency [35]. The\nadaptive synchronous rectiﬁer (SR) driving schemes can also\nbe applied to reduce the secondary side conduction loss [36].\nV. CONCLUSION\nA half-turn planar transformer with integrated leakage induc-\ntance for LLC resonant converters is proposed in this paper.\n128416 VOLUME 7, 2019\nS. Li et al.: Magnetic Integration Half-Turn Planar Transformer and Its Analysis for LLC Resonant DC–DC Converters\nIn the proposed transformer, a simple EILP32 ferrite core\nis employed and the primary windings are wound on both\nthe center and two-side legs of the magnetic core to gener-\nate desirable leakage inductance. The relation between the\nleakage inductance and the side leg number of turns T1 is\npresented. The magnetizing inductance is almost constant\nwhen T1 changes with the total equivalent number of turns Tp\nkeeping constant. In addition, the terminal effect of the half\nturn transformer is analyzed. CLC type ﬁlter is recommended\nto reduce the output voltage ripple.\nThe proposed transformer can be suitable for an LLC\nconverter. So the performance of the proposed transformer\nis evaluated by both the simulations and the experimental\ntests based on an input voltage 360 ∼400V, output regulated\nvoltage 12V, 750W, LLC converter, which achieves a peak\nefﬁciency of 97% at half load condition and a power density\nof 23.1W/cm3 including all control circuits and the auxiliary\npower supplies.\nACKNOWLEDGMENT\nThe authors sincerely thank Liyan Zhu and Hailin Tang for\ntheir help in debugging the circuit.\nREFERENCES\n[1] X. Huang, Z. Liu, Q. Li, and F. C. Lee, ‘‘Evaluation and application of\n600 V GaN HEMT in cascode structure,’’ IEEE Trans. Power Electron.,\nvol. 29, no. 5, pp. 2453–2461, May 2014.\n[2] J. Biela, M. Schweizer, S. Wafﬂer, and J. W. Kolar, ‘‘SiC versus\nSi—Evaluation of potentials for performance improvement of inverter and\nDC–DC converter systems by SiC power semiconductors,’’ IEEE Trans.\nInd. Electron., vol. 58, no. 7, pp. 2872–2882, Jul. 2011.\n[3] B. Lu, W. Liu, Y. Liang, F. C. Lee, and J. D. van Wyk, ‘‘Optimal design\nmethodology for LLC resonant converter,’’ in Proc. 21st Annu. IEEE\nAppl. Power Electron. Conf. Expo. (APEC), Dallas, TX, USA, Mar. 2006,\npp. 1–6.\n[4] Y. Murakami, T. Sato, and K. Nishijima, ‘‘Small signal parameter of\nLLC converter,’’ in Proc. IEEE 12th Int. Conf. Power Electron. Drive\nSyst. (PEDS), Honolulu, HI, USA, Dec. 2017, pp. 1200–1205.\n[5] A. S. Ragab, N. H. Saad, and A. A. El-Sattar, ‘‘LLC resonant DC–DC\nconverter for grid-connected PV system,’’ in Proc. 12th Int. Conf. Comput.\nEng. Syst. (ICCES), Cairo, Egypt, Dec. 2017, pp. 279–285.\n[6] Z. Ouyang, O. C. Thomsen, and M. A. E. Andersen, ‘‘Optimal design and\ntradeoffs analysis for planar transformer in high power DC–DC convert-\ners,’’ in Proc. Int. Power Electron. Conf. (ECCE ASIA), Sapporo, Japan,\nJun. 2010, pp. 3166–3173.\n[7] C. Ropoteanu, P. Svasta, and C. Ionescu, ‘‘A study of losses in pla-\nnar transformers with different layer structure,’’ in Proc. IEEE 23rd Int.\nSymp. Design Technol. Electron. Packag. (SIITME), Constanta, Romania,\nOct. 2017, pp. 255–258.\n[8] Q. Yu, Z. Liu, Y. Geng, and H. Wang, ‘‘Research on the coupling factor\nimprovement of low proﬁle planar transformer with FEA method,’’ in Proc.\n37th IEEE Power Electron. Spec. Conf., Jeju, South Korea, Jun. 2006,\npp. 1–4.\n[9] Y. Guan, N. Qi, Y. Wang, X. Zhang, D. Xu, and W. Wang, ‘‘Analysis\nand design of planar inductor and transformer for resonant converter,’’ in\nProc. IEEE Energy Convers. Congr. Expo. (ECCE), Milwaukee, WI, USA,\nSep. 2016, pp. 1–7.\n[10] Z. Ouyang, O. C. Thomsen, and M. A. E. Andersen, ‘‘Optimal design\nand tradeoff analysis of planar transformer in high-power DC–DC con-\nverters,’’ IEEE Trans. Ind. Electron., vol. 59, no. 7, pp. 2800–2810,\nJul. 2012.\n[11] M. A. Saket, N. Shaﬁei, and M. Ordonez, ‘‘Planar transformer winding\ntechnique for reduced capacitance in LLC power converters,’’ in Proc.\nIEEE Energy Convers. Congr. Expo. (ECCE), Milwaukee, WI, USA,\nSep. 2016, pp. 1–6.\n[12] J.-B. Lee, J.-K. Kim, J.-I. Baek, J.-H. Kim, and G.-W. Moon, ‘‘Res-\nonant capacitor on/off control of half-bridge LLC converter for high-\nefﬁciency server power supply,’’ IEEE Trans. Ind. Electron., vol. 63, no. 9,\npp. 5410–5415, Sep. 2016.\n[13] X. Wu, H. Chen, and Z. Qian, ‘‘1-MHz LLC resonant DC transformer\n(DCX) with regulating capability,’’ IEEE Trans. Ind. Electron., vol. 63,\nno. 5, pp. 2904–2912, May 2016.\n[14] H. Wang and Z. Li, ‘‘A PWM LLC type resonant converter adapted to wide\noutput range in PEV charging applications,’’ IEEE Trans. Power Electron.,\nvol. 33, no. 5, pp. 3791–3801, May 2018.\n[15] W. Water and J. Lu, ‘‘Performance comparison of integrated magnetics\nused in LLC resonant DC–DC converter for low voltage energy storage\nsystem,’’ in Proc. IEEE Innov. Smart Grid Technol.-Asia (ISGT-Asia),\nAuckland, New Zealand, Dec. 2017, pp. 1–5.\n[16] P. He, A. Mallik, G. Cooke, and A. Khaligh, ‘‘High-power-density high-\nefﬁciency LLC converter with an adjustable-leakage-inductance planar\ntransformer for data centers,’’ IET Power Electron., vol. 12, no. 2,\npp. 303–310, Feb. 2019.\n[17] C. W. Park and S. K. Han, ‘‘Design of an integrated magnetics structure for\nLLC resonant converter,’’ in Proc. 43rd Annu. Conf. IEEE Ind. Electron.\nSoc. (IECON), Beijing, China, Oct./Nov. 2017, pp. 1888–1893.\n[18] D. Huang, S. Ji, and F. C. Lee, ‘‘LLC resonant converter with matrix\ntransformer,’’ in Proc. IEEE Appl. Power Electron. Conf. Expo. (APEC),\nFort Worth, TX, USA, Mar. 2014, pp. 1118–1125.\n[19] M. Pajnić, P. Pejović, Ž. Despotović, M. Lazić, and M. Skender, ‘‘Design\nconsideration for high frequency LLC resonant converter with matrix\ntransformer,’’ in Proc. Int. Symp. Power Electron. (Ee), Novi Sad, Serbia,\nOct. 2017, pp. 1–6.\n[20] D. Huang, S. Ji, and F. C. Lee, ‘‘Matrix transformer for LLC reso-\nnant converters,’’ in Proc. 28th Annu. IEEE Appl. Power Electron. Conf.\nExpo. (APEC), Long Beach, CA, USA, Mar. 2013, pp. 2078–2083.\n[21] C. Fei, F. C. Lee, and Q. Li, ‘‘High-efﬁciency high-power-density\nLLC converter with an integrated planar matrix transformer for high-\noutput current applications,’’ IEEE Trans. Ind. Electron., vol. 64, no. 11,\npp. 9072–9082, Nov. 2017.\n[22] M. Mu and F. C. Lee, ‘‘Design and optimization of a 380-12 V high-\nfrequency, high-current LLC converter with GaN devices and planar matrix\ntransformers,’’ IEEE J. Emerg. Sel. Topics Power Electron., vol. 4, no. 3,\npp. 854–862, Sep. 2016.\n[23] H. Wang, Y. Chen, Y.-F. Liu, J. Afsharian, and Z. Yang, ‘‘A passive\ncurrent sharing method with common inductor multiphase LLC resonant\nconverter,’’IEEE Trans. Power Electron., vol. 32, no. 9, pp. 6994–7010,\nSep. 2017.\n[24] H. Wang, Y. Chen, Y.-F. Liu, Z. A. Yang, J. Afsharian, and B. Gong,\n‘‘LLC resonant converter with shared power switches and dual coupled\nresonant tanks to achieve automatic current sharing,’’ in Proc. IEEE\nEnergy Convers. Congr. Expo. (ECCE), Cincinnati, OH, USA, Oct. 2017,\npp. 5712–5719.\n[25] K. Yu, J. Du, and H. Ma, ‘‘A novel current sharing method for multi-module\nLLC resonant converters,’’ in Proc. 43rd Annu. Conf. IEEE Ind. Electron.\nSoc. (IECON), Beijing, China, Oct./Nov. 2017, pp. 613–618.\n[26] M. K. Ranjram, I. Moon, and D. J. Perreault, ‘‘Variable-inverter-\nrectiﬁer-transformer: A hybrid electronic and magnetic structure enabling\nadjustable high step-down conversion ratios,’’ in Proc. IEEE 18th Work-\nshop Control Modeling Power Electron. (COMPEL), Stanford, CA, USA,\nJul. 2017, pp. 1–8.\n[27] K. V. Iyer, M. Cai, D. Murthy-Bellur, B. Palmer, and N. Mohan,\n‘‘A half-turn winding for compact, high-current, high-turns-ratio, low-\nleakage-inductance transformer,’’ in Proc. IEEE Energy Convers. Congr.\nExpo. (ECCE), Cincinnati, OH, USA, Oct. 2017, pp. 3222–3227.\n[28] E. Rong, S. Li, R. Zhang, X. Du, Q. Min, and S. Lu, ‘‘A magnetic integra-\ntion half-turn planar transformer for LLC resonant DC–DC converters,’’ in\nProc. IEEE Appl. Power Electron. Conf. Expo. (APEC), San Antonio, TX,\nUSA, Mar. 2018, pp. 484–488.\n[29] X. Zhou, D. Chen, and C. Jamerson, ‘‘Applications of half-turn on E-core\nin switching power supplies,’’ in Proc. 14th Annu. Appl. Power Electron.\nConf. Expo. (APEC), Dallas, TX, USA, vol. 2, Mar. 1999, pp. 1210–1215.\n[30] S. Li, E. Rong, Q. Min, and S. Lu, ‘‘A half-turn transformer with symme-\ntry magnetic ﬂux for high-frequency-isolated DC/DC converters,’’ IEEE\nTrans. Power Electron., vol. 33, no. 8, pp. 6467–6470, Aug. 2018.\n[31] X. Margueron and J. P. Keradec, ‘‘Identifying the magenetic part of the\nequivalent circuit of n-winding transformer,’’ IEEE Trans. Instrum. Meas.,\nvol. 56, no. 1, pp. 146–152, Feb. 2007.\nVOLUME 7, 2019 128417\nS. Li et al.: Magnetic Integration Half-Turn Planar Transformer and Its Analysis for LLC Resonant DC–DC Converters\n[32] K.-W. Kim, H.-S. Youn, J.-I. Baek, Y. Jeong, and G.-W. Moon, ‘‘Analysis\non synchronous rectiﬁer control to improve regulation capability of high-\nfrequency LLC resonant converter,’’ IEEE Trans. Power Electron., vol. 33,\nno. 8, pp. 7252–7259, Aug. 2018.\n[33] D.-K. Kim, S. Moon, C.-O. Yeon, and G.-W. Moon, ‘‘High-efﬁciency LLC\nresonant converter with high voltage gain using an auxiliary LC resonant\ncircuit,’’ IEEE Trans. Power Electron., vol. 31, no. 10, pp. 6901–6909,\nOct. 2016.\n[34] M. H. Ahmed, A. Nabih, F. C. Lee, and Q. Li, ‘‘High-efﬁciency, high-\ndensity isolated/regulated 48 V bus converter with a novel planar magnetic\nstructure,’’ in Proc. IEEE Appl. Power Electron. Conf. Expo. (APEC),\nAnaheim, CA, USA, Mar. 2019, pp. 468–475.\n[35] C. Fei, Q. Li, and F. C. Lee, ‘‘Digital implementation of light-load efﬁ-\nciency improvement for high-frequency LLC converters with simpliﬁed\noptimal trajectory control,’’ IEEE J. Emerg. Sel. Topics Power Electron.,\nvol. 6, no. 4, pp. 1850–1859, Dec. 2018.\n[36] C. Fei, Q. Li, and F. C. Lee, ‘‘Digital implementation of adaptive syn-\nchronous rectiﬁer (SR) driving scheme for high-frequency LLC convert-\ners with microcontroller,’’ IEEE Trans. Power Electron., vol. 33, no. 6,\npp. 5351–5361, Jun. 2018.\nSIQI LI (M’11) received the B.S. and Ph.D.\ndegrees in electrical engineering from Tsinghua\nUniversity, Beijing, China, in 2004 and 2010,\nrespectively. He was a Postdoctoral Fellow with\nthe University of Michigan–Dearborn, Dearborn,\nMI, USA, from 2011 to 2013. In 2013, he\njoined the faculty of Electric Power Engineering,\nKunming University of Science and Technology\n(KUST), Kunming, China, where he is currently\nan Associate Professor with the Department of\nElectrical Engineering and the Director of the Advanced Power Electronics\nand New Energy Laboratory. He was a Visiting Scholar with San Diego\nState University, from 2018 to 2019. His research interests include battery\nmanagement systems, high performance wired, wireless battery chargers for\nelectric vehicles, and solid state transformers.\nQINGYUN MIN received the B.S. degree in\nelectrical engineering from the Kunming Univer-\nsity of Science and Technology, Kunming, China,\nin 2018, where he is currently pursuing the M.S.\ndegree with the Department of Electrical Engi-\nneering. His research interests include DC–DC\nconverters and wireless power transfer (WPT)\nsystems.\nENGUO RONG (S’17) received the B.S. and\nM.S. degrees in electrical engineering from the\nKunming University of Science and Technology,\nKunming, China, in 2016 and 2019, respectively.\nHis current research interests include DC–DC con-\nverters, digital control, and magnetics.\nRUI ZHANGreceived the B.S. degree in electrical\nengineering from the Kunming University of Sci-\nence and Technology, Kunming, China, in 2018,\nwhere he is currently pursuing the M.S. degree\nwith the Department of Electrical Engineering. His\nresearch interests include DC–DC converters and\nDC–AC converters.\nXIAO DU received the B.S. degree in electrical\nengineering and automation from the Kunming\nUniversity of Science and Technology, Kunming,\nChina, in 2018. He is currently pursuing the M.S.\ndegree in electrical engineering with Chongqing\nUniversity, Chongqing, China. His research inter-\nest includes the reliability of power electronics\nsystems.\nSIZHAO LU (M’16) received the B.S. and\nM.S. degrees in electrical engineering from the\nHarbin Institute of Technology, Harbin, China,\nin 2008 and 2010, respectively, and the Ph.D.\ndegree in electrical engineering from Tsinghua\nUniversity, Beijing, China, in 2016. He joined the\nfaculty of Electric Power Engineering, Kunming\nUniversity of Science and Technology (KUST),\nKunming, China, in 2016, where he is currently an\nAssistant Professor with the Department of Elec-\ntrical Engineering. He was a Visiting Scholar with the Center for Power\nElectronics Systems, Virginia Tech, Blacksburg, V A, USA, from Febru-\nary 2012 to November 2013. His research interests include high-frequency\nhigh-power DC–DC converters, modular multilevel converters (MMC), and\nwireless power transfer (WPT) systems.\n128418 VOLUME 7, 2019"
}