{
  "title": "Calculation of Hot Spot Temperature of Transformer Bushing Considering Current Fluctuation",
  "url": "https://openalex.org/W2970492856",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A5101489619",
      "name": "Zhifei Yang",
      "affiliations": [
        "Wuhan University"
      ]
    },
    {
      "id": "https://openalex.org/A5074537183",
      "name": "Jiangjun Ruan",
      "affiliations": [
        "Wuhan University"
      ]
    },
    {
      "id": "https://openalex.org/A5101806598",
      "name": "Daochun Huang",
      "affiliations": [
        "Wuhan University"
      ]
    },
    {
      "id": "https://openalex.org/A5100677753",
      "name": "Zhiye Du",
      "affiliations": [
        "Wuhan University"
      ]
    },
    {
      "id": "https://openalex.org/A5019371692",
      "name": "Liezheng Tang",
      "affiliations": [
        "Wuhan University"
      ]
    },
    {
      "id": "https://openalex.org/A5008967696",
      "name": "Taotao Zhou",
      "affiliations": [
        "Wuhan University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2083250862",
    "https://openalex.org/W1991572404",
    "https://openalex.org/W2118565143",
    "https://openalex.org/W2107218962",
    "https://openalex.org/W2094582652",
    "https://openalex.org/W2076604313",
    "https://openalex.org/W2286343138",
    "https://openalex.org/W2160066571",
    "https://openalex.org/W2610670406",
    "https://openalex.org/W2546197057",
    "https://openalex.org/W2913079153"
  ],
  "abstract": "The transformer bushing hot spot temperature (HST) seriously affects its performance and design. In this paper, a novel method for calculating the hot spot temperature of bushing is proposed, in which the principle of constant joule heat is adopted to transform the fluctuating current into the steady-state current. Firstly, the fluctuating current based on time is segmented. Then, the fluctuating current in each period of time is transformed into steady-state current which is used as heat source. Next, the Finite Element Method (FEM) is used to determine a typical bushing's temperature distribution and specify its hot spot. According to the calculation results of hot spot temperature rise, the time interval is adjusted. Finally, the optimal time interval and the steady-state equivalent current are obtained by solving the hot spot temperature of the transformer bushing iteratively. In addition, the method is used to calculate the hot spot temperature of a 220kV Oil Impregnated Paper (OIP) bushing. Compared with the results of traditional transient calculation method, the validity of the proposed method is verified, and the computing time is greatly reduced.",
  "full_text": "Received May 27, 2019, accepted August 16, 2019, date of publication August 26, 2019, date of current version September 9, 2019.\nDigital Object Identifier 10.1 109/ACCESS.2019.2937510\nCalculation of Hot Spot Temperature of\nTransformer Bushing Considering\nCurrent Fluctuation\nZHIFEI YANG\n , JIANGJUN RUAN, (Member, IEEE),\nDAOCHUN HUANG\n , (Senior Member, IEEE), ZHIYE DU\n,\nLIEZHENG TANG\n , AND TAOTAO ZHOU\nSchool of Electrical Engineering and Automation, Wuhan University, Wuhan 430072, China\nCorresponding author: Daochun Huang (huangdc99@163.com)\nThis work was supported by the National Natural Science Foundation of China under Grant 51477120 and Grant 51741708.\nABSTRACT The transformer bushing hot spot temperature (HST) seriously affects its performance and\ndesign. In this paper, a novel method for calculating the hot spot temperature of bushing is proposed, in which\nthe principle of constant joule heat is adopted to transform the ﬂuctuating current into the steady-state current.\nFirstly, the ﬂuctuating current based on time is segmented. Then, the ﬂuctuating current in each period of time\nis transformed into steady-state current which is used as heat source. Next, the Finite Element Method (FEM)\nis used to determine a typical bushing’s temperature distribution and specify its hot spot. According to the\ncalculation results of hot spot temperature rise, the time interval is adjusted. Finally, the optimal time interval\nand the steady-state equivalent current are obtained by solving the hot spot temperature of the transformer\nbushing iteratively. In addition, the method is used to calculate the hot spot temperature of a 220kV Oil\nImpregnated Paper (OIP) bushing. Compared with the results of traditional transient calculation method,\nthe validity of the proposed method is veriﬁed, and the computing time is greatly reduced.\nINDEX TERMS Transformer bushing, hot spot temperature, FEM, steady-state current equivalence.\nI. INTRODUCTION\nBushings are essential component of power transformers.\nWithout bushings, large power transformers are unthinkable.\nA bushing’s main roles are to conduct and electrically insu-\nlate. However, the function of dividing different insulation\nmedia is of the same importance because the bushing plays\na signiﬁcant role in determining the oil-ﬁlled transformer\nﬁre protection properties. With the voltage level and capacity\nof power grid increasing, the heat release would also rise.\nThermal problem would become one of the most serious\nproblems because of the operation condition of transformer\nbushings [1]. If the bushing is overheated or its exposure\nto the high temperatures is elongated, the chemical nature\nof the insulator can alter, which in turn leads to changes\nin the physical characteristics of the bushing and intensiﬁes\nits wearing rate. The bushing lifetime is inversely related to\nits Hot Spot Temperature (HST). Therefore, the temperature\nThe associate editor coordinating the review of this article and approving\nit for publication was Md. Moinul Hossain.\ndistribution and the HST are prominent factors for elongating\nthe bushings’ lifetime and their optimal performance [2].\nFor HST calculation of transformer bushing,\nMcNutt et al. [3] employed the analog thermal model to\nobtain the HST. Model constants could be derived from\na set of ‘‘Overload Qualiﬁcation’’ tests and recommenda-\ntions were made for the parameters of signiﬁcance to these\ntests. Meanwhile, limitations on environmental factors which\ninﬂuence the bushing HST were also discussed. In [4], The\nmodel of McNutt was improved, and the more accurate\nmethod for calculating the axial temperature of bushing was\nproposed. However, this method was only suitable for steady\nstate. Hebert and Steed [5] made a detailed analysis of the\n[3] and deduced the thermal circuit model by using the\nﬁnite difference method. Based on the method of McNutt,\nthe IEEE Std. C57.19.100-1995 added coefﬁcient n to cal-\nculate HST in the transient state. However, this applica-\ntion was only based on a rough overall assessment rather\nthan an accurate transient temperature calculation. In [6],\nthe heat capacity was added, and Zhang used ATP (Alter-\nnative Transient Program) and equivalent thermal circuit\nVOLUME 7, 2019 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see http://creativecommons.org/licenses/by/4.0/ 120441\nZ. Yanget al.: Calculation of HST of Transformer Bushing Considering Current Fluctuation\nmodel to calculate the transient temperature distribution\nof the transformer bushing. Jyothi et al.[7] established an\nanalog model to specify the bushing temperature distribution\nin presence of the Resin Impregnated Paper (RIP) bush-\ning considering the relationship between conductivity and\ntemperature.\nIn the last ﬁve years, many scholars used ﬁnite ele-\nment method (FEM) to calculate the temperature ﬁeld dis-\ntribution and hot spot temperature rise of equipment. The\nFEM was used in [6] to obtain the temperature and elec-\ntric ﬁeld distribution law of RIP bushing. Allahbakhshi and\nAkbari [8] calculated the temperature ﬁeld distribution of\na two-dimensional axisymmetric model of a typical OIP\nbushing using FEM and COMSOL, and studied the posi-\ntion of hot spots under different load. ErdenA et al. [9]\ncalculated the temperature distribution of the wall bushing\nusing FEM considering the change of material parameters.\nAkbariM et al.[2] used FEM to calculate the transient tem-\nperature ﬁeld of the 110 kV transformer bushing. At the\nsame time, three overload scenarios were simulated two\nof which are from the IEEE C57.19.100 and IEC 60076-7\nstandards.\nIn the actual operation of the bushing, the current is always\nﬂuctuating. Most researchers only study on the calculation of\ntransient temperature ﬁeld in the case of step current. How-\never, there are few reports considering the effect of current\nﬂuctuation.\nIn this paper, the paraments δand ϕare set. The ﬂuctuat-\ning current in a certain time range is equivalent to steady -\nstate current based on the principle of constant joule heat.\nIn addition, the HST rise under different loads is calcu-\nlated, according to the loads curve of the bushing in one\nday.\nII. MATHEMATICAL MODEL\nA. GOVERNING EQUATION OF TRANSIENT\nTEMPERATURE FIELD\n1) HEAT SOURCE OF TRANSFORMER BUSHING\nThe heat source of transformer bushing mainly comes from\ntwo aspects [8] :\n1) The joule heat generated by the current passing through\nthe conductor is shown in the following equation.\nW1 =I2 ·R (1)\nwhere W1 is the joule heat of the conductor per unit time; I is\nthe current passing through the conductor per unit time and R\nis resistance of the conductor.\n2) The dielectric loss of the condenser body under alter-\nnating voltage, which is shown in equation (2). The calcu-\nlation of heat value of dielectric loss by using FEM can be\ndescribed in the following equation\nP =\nM∑\ni=1\n2πf ε0εr tan δ·E2 ·Vi (2)\nFIGURE 1. Finite element grid of simple model.\nwhere, V is the volume of each capacitor core element in\nﬁnite element calculation as shown in Figure 1; E is the\nelectric ﬁeld intensity; ε0 and εr are the permittivity in vac-\nuum and relative permittivity of the capacitor core respec-\ntively; f is frequency and M is the number of elements of\nthe capacitor core.\n2) HEAT TRANSFER GOVERNING EQUATION OF INTERNAL\nTEMPERATURE FIELD IN BUSHING\nThe heat passing through a given section per unit time is\nproportional to the temperature change rate perpendicular to\nthe direction of the cross section and cross-sectional area,\nwhich can be obtained from equation (3).\n8=−λS ∂T\n∂x (3)\nwhere, 8is the heat ﬂux, W; λis the heat conduction con-\nstant, W/(m ·K), S is the cross-sectional area, m 2 and ∂T /∂x\nis the temperature gradient in the direction of the heat ﬂow;\nThe negative sign indicates that the heat ﬂow direction is\nalways opposite to the positive direction of the temperature\ngradient.\nThe heat ﬂux in any direction can be decomposed into\nthe components of the direction of x, y and z coordinate\naxes,\n\n\n\n(8x )x =−λ\n(∂T\n∂x\n)\nx\ndydz\n(\n8y\n)\ny =−λ\n(∂T\n∂y\n)\ny\ndxdz\n(8z)z =−λ\n(∂T\n∂z\n)\nz\ndxdy\n(4)\nwhere (8x )x is the value of 8x at x point, and so on. The heat\nof the inﬁnitesimal element derived from the three surfaces\nx =x +dx, y =y +dy, z =z +dz can also be written in\n120442 VOLUME 7, 2019\nZ. Yanget al.: Calculation of HST of Transformer Bushing Considering Current Fluctuation\nequation (5) according to Fourier’s law.\n\n\n\n(8x )x+dx =(8x )x +∂(8x )x\n∂x dx\n=(8x )x + ∂\n∂x\n[\n−λ\n(∂T\n∂x\n)\nx\ndydz\n]\ndx\n(\n8y\n)\ny+dy =\n(\n8y\n)\ny +\n∂\n(\n8y\n)\ny\n∂y dy\n=\n(\n8y\n)\ny + ∂\n∂y\n[\n−λ\n(∂T\n∂y\n)\ny\ndxdz\n]\ndy\n(8z)z+dz =(8z)z +∂(8z)z\n∂z dz\n=(8z)z +∂\n∂z\n[\n−λ\n(∂T\n∂z\n)\nz\ndxdy\n]\ndz.\n(5)\nFor inﬁnitesimal element, according to the law of con-\nservation of energy, there are the following thermal balance\nrelations at any time interval. The total heat ﬂux ﬂowing\ninto the inﬁnitesimal element +the heat generation in the\ninﬁnitesimal element =the total heat ﬂux ﬂowing out of\nthe inﬁnitesimal element +the increment of the thermal\nmechanical energy (i.e. internal energy) of the inﬁnitesimal\nelement. Where\nthe increment of internal energy =ρc∂T\n∂t dxdydz\nthe heat generation =Qdxdydz (6)\nwhere ρ, is the density, kg·m−3, c is the speciﬁc heat capacity,\nJ·(kg·K)−1, Q is the heat generation of heat source in a unit\nvolume per unit time, W ·m−3, and t is the time, s.\nAccording to the law of conservation of energy, equa-\ntion (7) can be given\n(8x )x +\n(\n8y\n)\ny +(8z)z +Qdxdydz\n=(8x )x +\n(\n8y\n)\ny +(8z)z + ∂\n∂x\n[\n−λ\n(∂T\n∂x\n)\nx\ndydz\n]\ndx\n+∂\n∂y\n[\n−λ\n(∂T\n∂y\n)\ny\ndxdz\n]\ndy +∂\n∂z\n[\n−λ\n(∂T\n∂z\n)\nz\ndxdy\n]\ndz\n+ρc∂T\n∂t dxdydz (7)\nThe equation (7) is transformed to equation (8).\nρc∂T\n∂t = ∂\n∂x\n(\nλ∂T\n∂x\n)\n+ ∂\n∂y\n(\nλ∂T\n∂y\n)\n+∂\n∂z\n(\nλ∂T\n∂z\n)\n+Q\n(8)\nUnder constant physical properties conditions, equation (8)\ncan be changed into equation (9)\n∂T\n∂t =α\n(∂2T\n∂x2 +∂2T\n∂y2 +∂2T\n∂z2\n)\n+Q\nρc (9)\nMathematically, equation (9) is Three-dimensional tran-\nsient heat transfer differential equation. For the cylindrical\nstructure of the bushing model, equation (9) can be trans-\nformed to equation (10)\nFIGURE 2. Typical daily load current curve of a substation.\nρc∂T\n∂t =1\nr\n∂\n∂r\n(\nαr ∂T\n∂r\n)\n+1\nr2\n∂\n∂ϕ\n(\nα∂T\n∂ϕ\n)\n+∂\n∂z\n(\nα∂T\n∂z\n)\n+Q (10)\nIn order to avoid the trivial solutions and achieve the com-\nplete solution, both Dirichlet and Neumann boundary con-\nditions should be applied [7], [11]. Equations (11) and (12)\nshow the Dirichlet and Neumann boundary conditions,\nrespectively\nT (r) |r=r∞ =Ta (11)\n∂T\n∂r\n⏐⏐r=r0 = −P1\n2πr1k (12)\nwhere Ta is the ambient temperature and P1 is the produced\nheat in the unit length of the conductor. If the conductor and\nbushing radii are a and b respectively, then:\nr∞=2b −a (13)\nr1 =b −a (14)\nB. PRINCIPLE OF EQUIVALENT STEADY-STATE CURRENT\nIn power system, the load current through transformer bush-\ning ﬂuctuates at any time. As shown in Figure 2, the cur-\nrent data is measured by current transformer (CT) in every\n5 minutes, and a total of 289 current data points are measured\nin 24h. Each current data in the daily load current curve is\nused as the heat source, although the HST calculation is accu-\nrate, it still requires a large amount of data, a long calculation\ntime and a high requirement for computer conﬁguration.\nIn this paper, according to the principle of constant joule\nheat, the transient current is equivalent to the steady-state\ncurrent, as shown in Figure 3. The current is regarded as a\nconstant value in a certain time interval, and the joule heat is\nthe same regardless of the transient or the steady-state current.\nAccording to this principle, the equation of the steady-state\nequivalent current in this time interval is :\nI2\neq−st ·R ·t =R ·\n∫ t\n0\nI2dt (15)\nVOLUME 7, 2019 120443\nZ. Yanget al.: Calculation of HST of Transformer Bushing Considering Current Fluctuation\nFIGURE 3. Typical daily load current curve of a substation.\nFIGURE 4. Calculation flow chart.\nwhere, Ieq−st is the steady-state equivalent current in a certain\ntime interval, A. I is the transient current in a certain time\ninterval, A. t is the time, min. R is the resistance, .\nThe CT measures the current data every 5 minutes. Because\nthe time interval is very short, the temperature rise of the\nhot spot does not change much. It is considered that the\ncurrent does not change in 5 minutes. The equation (15) can\nbe equivalent to equation (16)\nIeq−st =\n√1\nN\nN∑\ni=1\nI2\ni (16)\nwhere Ii is the transient current at this moment, A; N is the\nnumber of transient current data in the interval.\nIn the process of equivalence, if the difference between the\nmaximum and minimum of transient current is large, the error\nof HST after equivalence will be large. Therefore, the range of\ntransient current ﬂuctuation is the key issue to be considered\nin the process of equivalence.\nC. CALCULATION FLOW\nThe calculation ﬂow is shown in Figure 4. In this paper, the\nsteady-state current equivalence method and ﬁnite element\nmethod simulation are used to solve the HST in bushing.\nFirstly, the model of bushing is built, and the materials\nFIGURE 5. The model of transformer bushing.\nare assigned to the designed geometry. Then, the voltage\nand electrical ﬁeld distribution are obtained by using FEM,\ndielectric loss of each element is calculated by equation (2).\nThe transient temperature ﬁeld is solved by using dielectric\nloss and transient current as heat resource, and the HST x\nin this interval is obtained. In addition, the boundary condi-\ntions of (13) (14) have to be considered. At the same time,\nthe transient current in this time interval is divided into time\ngroups. The division principle is to compare the value of\ntransient current I1 at the starting point of the interval with\nthe next value I2, if the absolute error between the two value\nis less than δ, the value I1 is compared with the next value I3.\nIf the absolute error between the value I1 and In is greater\nthan δ, the time from the value of transient current I1 to\nIn−1 is recorded as X1. The next time interval begins at the\ntime point where the value In is located and continues to be\ndivided according to the above method, which is denoted as\nXi (i=1, 2, 3, ...).\nFor a time interval Xi, it needs to be subdivided. The\nsubdivision principle is that if the difference between the\nmaximum Ii_max and minimum Ii_min in this time interval\nis less than ϕ, the time interval should not be subdivided.\nOtherwise, starting from Ii_a (where i represents the i-th\ntime group Xi, a represents the a-th transient current in this\ntime interval, a ≥3), it should be compared with the previous\ntransient current Ii_b (b<a) in turn. If the absolute error\nbetween Ii_a and Ii_b is greater than ϕ, it will be subdivided\ninto time interval, which is recorded as Xi_c, and so on. The\ntransient temperature ﬁeld is solved by using dielectric loss\nand steady-state equivalent current, and the HST y in this\ninterval is obtained. Compared the HST x with the HST y,\nif the maximum temperature error of the two is greater than\n0.1 degree, the values of δ and ϕ should be adjusted and\ncalculated iteratively until the temperature error is less than\n0.1 degree.\nIII. STEADY-STATE CURRENT EQUIVALENCE\nA. THE MODEL OF OIP\nThis paper takes a 220kV/1600A oil impregnated paper insu-\nlation (OIP) transformer bushing as the research object. The\nlength of the bushing is 4.7m. The number of layers of\naluminum foil is 57. The thickness of each layer of aluminum\nfoil is 0.007mm.\nThe bushing model is a strict axisymmetric model,\nas shown in Figure 5.\nIn order to reduce the difﬁculty of modeling, shorten the\ncalculation time and ensure the correctness of the calcula-\ntion results, two-dimensional axisymmetric model is adopted\nhere, as shown in Figure 6.\n120444 VOLUME 7, 2019\nZ. Yanget al.: Calculation of HST of Transformer Bushing Considering Current Fluctuation\nFIGURE 6. 2-D axisymmetric model of the bushing.\nTABLE 1. The material parameters of the bushing.\nFIGURE 7. The temperature field of bushing at the initial time.\nB. HST CALCULATION OF OIP IN THE TRANSIENT STATE\nThe heat source of the transformer bushing mainly comes\nfrom the joule heat generated by the current passing through\nthe conductor, the top oil temperature of transformer and a\nsmall amount of dielectric loss.\nThe material parameters of each part are shown in Table 1.\nIn this paper, the time interval of the transient current with\nthe largest ﬂuctuation range from 0 to 600mins in Figure 2 is\nextracted, during which the transient HST of the transformer\nbushing is calculated.\nIn the process of the transient temperature ﬁeld calculation,\nit is necessary to set the temperature ﬁeld distribution of the\nbushing at the initial time. It is assumed that the transformer\nbushing has been running steadily for a long time. The tem-\nperature ﬁeld distribution of the transformer bushing at the\ninitial time is shown in Figure 7. It can be seen from the ﬁg-\nure that the hot spot is located in the middle and lower part of\nthe transformer bushing, which is the same as the result of [8].\nThe change of HST in 0-600mins is shown in Figure 8,\nand the total calculation time is 3h30min. It can be seen from\nFigure 8, the change trend of HST is basically consistent with\nthat of current.\nFIGURE 8. Transient current and HST of bushing in 0-600min.\nFIGURE 9. Absolute error of HST under differentδ.\nC. HST CALCULATION OF BUSHING AFTER STEADY-STATE\nCURRENT EQUIVALENCE\n1) SETTING PARAMETERDELTA\nIn order to make the steady-state current equivalent accu-\nrately, it is necessary to divide the transient current into time\ngroups reasonably. The division principle is to compare the\nvalue of transient current I1 at the starting point of the interval\nwith the next value I2, if the absolute error between the two\nvalues is less than δ, then the value I1 is compared with the\nnext value I3. If the absolute error between the value I1 and In\nis greater than δ, the time from the value of transient current\nI1 to In−1 is recorded as X1. The next time interval begins at\nthe time point where the value In is located and continues to\nbe divided according to the above method, which is denoted\nas Xi (i =1,2,3,... ).\nThe transient current in 0-600min is equivalent to the\nsteady-state, and the time is grouped according to the change\nrange of the transient current. The parameter δis set to 100,\n70, 50 and 30 respectively to verify the most appropriate\nnumber of time groups in turn. The steady-state equivalent\ncurrent of each time group is obtained by using equation (16).\nThe transient temperature ﬁeld is solved by using dielectric\nloss and steady-state equivalent current, and the HST in this\ninterval is obtained. The results are compared with the tran-\nsient HST in Figure 9, and the absolute error is obtained. The\nresults are shown in Figure 9 and Table 2 respectively.\nVOLUME 7, 2019 120445\nZ. Yanget al.: Calculation of HST of Transformer Bushing Considering Current Fluctuation\nTABLE 2. Calculation results under differentδ.\nFIGURE 10. Steady-state current equivalence in 10h.\nIt can be seen from the Figure 9 and Table 2, when\nthe parameter δ is 100 and 70, the number of time group is\nthe least and the calculation time is the shortest. however, the\nabsolute error is the largest, and the maximum absolute error\nreaches 0.89 degree. When the parameter δis 30, although the\nmaximum absolute error of HST is the smallest, which is only\n0.06 degree, the number of time groups is the largest, which\nleads to the longest calculation time. Thus, the parameter δis\nset to 50.\nAccording to the value of parameter δ, the transient current\nin 0 ∼600 minutes is divided into 12 groups, which are\nrecorded as X1, X2,..., X12, as shown in Figure 10, The\nsteady-state equivalent current of each time group is obtained\nby using equation (16).\nThe steady-state equivalent current of each group is used\nas heat resource to calculate the HST of bushing. The\nresults of calculation and temperature difference are shown\nin Figure 11.\nIt can be seen from Figure 11, the temperature differ-\nence curve ﬂuctuates greatly from 101 min to 405 min. The\nmaximum temperature difference is 0.4 degree and locate at\n295 min. The transient current waveform in 90-425 min is\nextracted, as shown in Figure 12. It can be seen from that\nthe transient current decreases rapidly from the maximum\nvalue 1082A to 699A within 90-300 min, while the equivalent\ncurrent is 898A, which makes the temperature difference in\nthis area larger. Although the amplitude of current ﬂuctu-\nates obviously in 300-370min, it ﬂuctuates near the value of\nequivalent current, which reduces the temperature difference.\nIt can be seen that the transient current cannot be completely\nFIGURE 11. The calculation results of HST.\nFIGURE 12. Transient current waveform in 90-425min.\nequivalent to the steady-state current only when the parameter\nδis set.\n2) SETTING PARAMETERPHI\n12 groups of equivalent steady-state currents are subdivided\nand the initial value of parameter ϕis set to be 100. By iter-\nation calculation, the parameter ϕ is ﬁnally determined to\nbe 80, according to the convergence criterion. steady-state\nequivalent current is shown in Figure 13. The equivalent\ncurrent of each group is used as heat source of temper-\nature ﬁeld to calculate the HST of bushing. The calcu-\nlation time is 27 minutes, and the results are shown in\nFigure 14. It can be seen from Figure 14, the HST calculation\nresults solved by transient current and equivalent steady-state\ncurrent are basically in agreement. The maximum tem-\nperature difference is 0.078 degree, which is located at\n547 min.\nIV. CALCULATION VERIFICATION OF THE BUSHING HST\nThe daily load current curve in Figure 2 is taken as an example\nto calculate the change HST of bushing in a day. Since the\nbushing type and parameters have not changed, the values\nof parameter δ and parameter ϕ are 50 and 80 obtained\nfrom 3.3 section respectively, and the number of time groups\nis 42. The calculation results are shown in Table 3. The HST\n120446 VOLUME 7, 2019\nZ. Yanget al.: Calculation of HST of Transformer Bushing Considering Current Fluctuation\nFIGURE 13. Transient and equivalent steady-state current.\nFIGURE 14. The calculation results of HST using two methods.\nTABLE 3. Comparisons of calculation methods for HST.\ncalculation results of the two methods are compared as shown\nin Figure 15.\nThe calculation results show that the HST of bush-\ning obtained by using the steady-state current equivalence\nmethod described in this paper is consistent with the calcu-\nlation results of the transient current, and the maximum error\nis 0.104%. The computing time is only a quarter of that of\ntraditional method. Therefore, the steady-state current equiv-\nalence method used in this paper is effective and reliable in\ncalculating the HST of transformer bushing under ﬂuctuating\nload current.\nFIGURE 15. Comparisons of HST calculation methods.\nV. CONCLUSION\nIn this paper, a novel method for calculating the HST of\nbushing is proposed, in which the principle of constant joule\nheat is adopted to transform the ﬂuctuating current into the\nsteady-state current.\nFirstly, the time-harmonic electric ﬁeld of bushing is cal-\nculated by the ﬁnite element method, and the internal dielec-\ntric loss is obtained. The transient current and the internal\ndielectric loss are used as the heat source for calculating the\ntransient temperature ﬁeld of bushing. The transient HST\nis calculated and used as the benchmark. Then, the values\nof parameters δ and ϕ are set and the transient current is\ndivided into time groups. According to the steady-state cur-\nrent equivalence equation, the transient current in each time\ninterval is equivalent to the steady-state current. The equiva-\nlent steady-state and dielectric loss are used as the heat source\nfor calculating the transient temperature ﬁeld of bushing. The\ntransient HST is extracted and compared with the benchmark.\nIf the maximum temperature difference of the two is greater\nthan 0.1 degree, the values of δ and ϕ should be adjusted\nand calculated iteratively until the temperature difference is\nless than 0.1 degree. The daily load current curve of certain\ntransformer substation is taken as an example to calculate the\nchange HST of bushing in a day.\nCompared with the standard value, the maximum absolute\nerror is 0.09 degree, which veriﬁes the correctness of the\nmethod and the computation time was reduced by 78%.\nREFERENCES\n[1] Z. Wu, H. Tian, H. Wang, S. Zhou, R. Shi, L. Peng, and Z. Peng, ‘‘Numer-\nical calculation of static temperature distribution of transformer bushings\nand analysis of inﬂuential factors,’’ in Proc. IEEE Int. Conf. High Voltage\nEng. Appl. (ICHVE), Athens, Greece, Sep. 2018, pp. 1–4.\n[2] M. Akbari, M. Allahbakhshi, and R. Mahmoodian, ‘‘Heat analysis of the\npower transformer bushings in the transient and steady states considering\nthe load variations,’’ Appl. Therm. Eng., vol. 121, pp. 999–1010, Jul. 2017.\n[3] W. J. McNutt and J. K. Easley, ‘‘Mathematical modelling—A basis for\nbushing loading guides,’’IEEE Trans. Power App. Syst., vol. PAS-97, no. 6,\npp. 2393–2404, Nov. 1978.\n[4] D. Zeng, ‘‘An improved method for estimating temperature rise of a\nbushing loaded above nameplate rating,’’ IEEE Trans. Power Del., vol. 14,\nno. 3, pp. 986–995, Jul. 1999.\nVOLUME 7, 2019 120447\nZ. Yanget al.: Calculation of HST of Transformer Bushing Considering Current Fluctuation\n[5] P. P. Hebert and R. C. Steed, ‘‘A high voltage bushing thermal performance\ncomputer model,’’ IEEE Trans. Power App. Syst., vol. PAS-97, no. 6,\npp. 2219–2224, Nov. 1978.\n[6] S. Zhang, ‘‘Evaluation of thermal transient and overload capability of\nhigh-voltage bushings with ATP,’’ IEEE Trans. Power Del., vol. 24, no. 3,\npp. 1295–1301, Jun. 2009.\n[7] N. S. Jyothi, T. S. Ramu, and M. Mandlik, ‘‘Temperature distribution in\nresin impregnated paper insulation for transformer bushings,’’ IEEE Trans.\nDielectr. Electr. Insul., vol. 17, no. 3, pp. 931–938, Jun. 2010.\n[8] M. Allahbakhshi and M. Akbari, ‘‘Heat analysis of the power transformer\nbushings using the ﬁnite element method,’’ Appl. Therm. Eng., vol. 100,\npp. 714–720, May 2016.\n[9] I. Erden, A. Ozdemir, and S. Ilhan, ‘‘Improvement of thermal performance\nof 36 kV DAF-30 type bushing,’’ in Proc. 3rd Int. Conf. Electr. Power\nEnergy Convers. Syst. (EPECS), Istanbul, Turkey, Oct. 2013, pp. 1–6.\n[10] H. I. Septyani, I. Ariﬁanto, and A. P. Purnomoadi, ‘‘High voltage\ntransformer bushing problems,’’ in Proc. Int. Conf. Elect. Eng. Inform.,\nBandung, Indonesia, Jul. 2011, pp. 1–4.\n[11] S. Zhang, Z. Peng, and P. Liu, ‘‘Inner insulation structure optimization of\nUHV RIP oil-SF 6 bushing using electro-thermal simulation and advanced\nequal margin design method,’’ IEEE Trans. Dielectr. Electr. Insul., vol. 21,\nno. 4, pp. 1768–1777, Aug. 2014.\nZHIFEI YANGwas born in Henan, China, in 1990.\nHe is currently pursuing the Ph.D. degree in\nelectrical engineering with the School of Electri-\ncal Engineering and Automation, Wuhan Univer-\nsity, Wuhan, China. His research interests include\nnumerical calculation of electromagnetic ﬁeld,\nhigh voltage and insulation technology.\nJIANGJUN RUAN (M’03) was born in Zhe-\njiang, China, in 1968. He received the B.S. and\nPh.D. degrees in electric machine engineering\nfrom Huazhong University of Science and Tech-\nnology, Wuhan, China, in 1990 and 1995, respec-\ntively, and ﬁnished his Postdoctoral Research from\nthe Wuhan University of Hydraulic and Electri-\ncal Engineering, Wuhan, in 1998. He is currently\na Professor with the School of Electrical Engi-\nneering and Automation, Wuhan University. His\nresearch interests include electromagnetic ﬁeld numerical simulation, high\nvoltage, and insulation technology.\nDAOCHUN HUANG (S’08–M’10–SM’18) was\nborn in Heilongjiang, China, in 1976. He received\nthe B.S. degree in electrical engineering and its\nautomation and the Ph.D. degree in high volt-\nage and insulation technology from the School of\nElectrical Engineering, Wuhan University, Wuhan,\nChina, in 2003 and 2009, respectively, where he is\ncurrently a Professor with the School of Electrical\nEngineering and Automation. His research inter-\nests include external insulation of transmission and\ntransformation equipment, high voltage apparatus, and numerical analysis\nof electromagnetic ﬁeld and its applications in engineering. Dr. Huang is\nalso a member of IEEE Dielectrics and Electrical Insulation Society and the\nInternational Council on Large Electric Systems (CIGRE).\nZHIYE DU was born in Xuchang, China.\nHe received the M.S. and Ph.D. degrees in electri-\ncal engineering from Wuhan University, Wuhan,\nChina, in 2004 and 2007, respectively, where he\nis currently a Professor with the School of Elec-\ntrical Engineering and Automation. His current\nresearch interests include high voltage technology,\nnumerical analysis of electromagnetic problems in\nengineering.\nLIEZHENG TANG was born in Beijing, China,\nin 1993. He received the B.S. degree in electrical\nengineering and automation from the School of\nElectrical Engineering, Wuhan University, Wuhan,\nChina, in 2015, where he is currently pursu-\ning the Ph.D. degree in electrical engineering.\nHis research interests include condition monitor-\ning and insulation design of the cable joint, and\ndielectric breakdown voltage prediction.\nTAOTAO ZHOU was born in Hubei, China,\nin 1990. He is currently pursuing the Ph.D. degree\nin electrical engineering with the School of Electri-\ncal Engineering and Automation, Wuhan Univer-\nsity, Wuhan, China. His research interests include\nnumerical calculation of electromagnetic ﬁeld,\nhigh voltage and insulation technology.\n120448 VOLUME 7, 2019",
  "topic": "Bushing",
  "concepts": [
    {
      "name": "Bushing",
      "score": 0.9909037351608276
    },
    {
      "name": "Transformer",
      "score": 0.6548227071762085
    },
    {
      "name": "Hot spot (computer programming)",
      "score": 0.6524592041969299
    },
    {
      "name": "Finite element method",
      "score": 0.5323066711425781
    },
    {
      "name": "Temperature measurement",
      "score": 0.48824170231819153
    },
    {
      "name": "Materials science",
      "score": 0.48727285861968994
    },
    {
      "name": "Steady state (chemistry)",
      "score": 0.48050105571746826
    },
    {
      "name": "Mechanics",
      "score": 0.4797576665878296
    },
    {
      "name": "Current transformer",
      "score": 0.456829309463501
    },
    {
      "name": "Joule heating",
      "score": 0.43594372272491455
    },
    {
      "name": "Current (fluid)",
      "score": 0.4127998948097229
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.395256370306015
    },
    {
      "name": "Voltage",
      "score": 0.36597877740859985
    },
    {
      "name": "Computer science",
      "score": 0.2876240015029907
    },
    {
      "name": "Electrical engineering",
      "score": 0.281986266374588
    },
    {
      "name": "Engineering",
      "score": 0.26308971643447876
    },
    {
      "name": "Structural engineering",
      "score": 0.21364286541938782
    },
    {
      "name": "Thermodynamics",
      "score": 0.20150047540664673
    },
    {
      "name": "Physics",
      "score": 0.1868627369403839
    },
    {
      "name": "Composite material",
      "score": 0.1468082070350647
    },
    {
      "name": "Chemistry",
      "score": 0.09214311838150024
    },
    {
      "name": "Control (management)",
      "score": 0.0
    },
    {
      "name": "Operating system",
      "score": 0.0
    },
    {
      "name": "Physical chemistry",
      "score": 0.0
    },
    {
      "name": "Artificial intelligence",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I37461747",
      "name": "Wuhan University",
      "country": "CN"
    }
  ]
}