{
  "title": "Assessment of Hydraulic Network Models in Predicting Reverse Flows in OD Cooled Disc Type Transformer Windings",
  "url": "https://openalex.org/W2976043092",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A5032182382",
      "name": "Xiang Zhang",
      "affiliations": [
        "University of Manchester"
      ]
    },
    {
      "id": "https://openalex.org/A5001115381",
      "name": "Zhongdong Wang",
      "affiliations": [
        "University of Manchester"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2769508646",
    "https://openalex.org/W2765877506",
    "https://openalex.org/W2015525403",
    "https://openalex.org/W1519999986",
    "https://openalex.org/W2052706045",
    "https://openalex.org/W2435084515",
    "https://openalex.org/W2114707893",
    "https://openalex.org/W4252874104",
    "https://openalex.org/W2755161876",
    "https://openalex.org/W2124953251",
    "https://openalex.org/W2167742005",
    "https://openalex.org/W2507726202",
    "https://openalex.org/W2005225147",
    "https://openalex.org/W4241940087",
    "https://openalex.org/W2323740702",
    "https://openalex.org/W2139349550"
  ],
  "abstract": "Predicting liquid flow distribution in the winding is crucial for transformer thermal design and hydraulic network models are usually used to guarantee reasonable liquid flow distribution. This paper is a continuation of the research effort in using computational fluid dynamics (CFD) to calibrate and improve the network modelling approach. The possibility is assessed of hydraulic network models in predicting the occurrence of reverse flows in pump-driven oil directed (OD) cooling modes. CFD modelling shows that the occurrence of reverse flows requires both high Reynolds number at the winding pass inlet and the &#x201C;real&#x201D; pass inlet velocity profile. To reflect the effect of pass inlet velocity profile on flow distribution, a winding pass is added beneath dividing and merging junctions in deriving minor pressure loss correlations. In addition, hybrid minor loss correlations are used to incorporate the effect of pass inlet velocity profile and to mitigate the inaccuracy of minor pressure loss segregation introduced by the inclusion of a winding pass beneath the junctions. Even with the above mentioned improvements, a conventional network model with one node for each junction still cannot predict reverse flows because of its architecture limit, hence a 3-node junction network model is then proposed. It is demonstrated that the newly developed 3-node junction hydraulic network model can predict the occurrence of reverse flows in OD cooled disc-type transformer windings.",
  "full_text": "Received August 24, 2019, accepted September 22, 2019, date of publication September 24, 2019, date of current version October 7, 2019.\nDigital Object Identifier 10.1 109/ACCESS.2019.2943566\nAssessment of Hydraulic Network Models in\nPredicting Reverse Flows in OD Cooled\nDisc Type Transformer Windings\nXIANG ZHANG\n , (Member, IEEE), AND ZHONGDONG WANG\n, (Senior Member, IEEE)\nSchool of Electrical and Electronic Engineering, The University of Manchester, Manchester M13 9PL, U.K.\nCorresponding author: Zhongdong Wang (zhongdong.wang@manchester.ac.uk)\nABSTRACT Predicting liquid ﬂow distribution in the winding is crucial for transformer thermal design and\nhydraulic network models are usually used to guarantee reasonable liquid ﬂow distribution. This paper is a\ncontinuation of the research effort in using computational ﬂuid dynamics (CFD) to calibrate and improve\nthe network modelling approach. The possibility is assessed of hydraulic network models in predicting the\noccurrence of reverse ﬂows in pump-driven oil directed (OD) cooling modes. CFD modelling shows that the\noccurrence of reverse ﬂows requires both high Reynolds number at the winding pass inlet and the ‘‘real’’ pass\ninlet velocity proﬁle. To reﬂect the effect of pass inlet velocity proﬁle on ﬂow distribution, a winding pass\nis added beneath dividing and merging junctions in deriving minor pressure loss correlations. In addition,\nhybrid minor loss correlations are used to incorporate the effect of pass inlet velocity proﬁle and to mitigate\nthe inaccuracy of minor pressure loss segregation introduced by the inclusion of a winding pass beneath\nthe junctions. Even with the above mentioned improvements, a conventional network model with one node\nfor each junction still cannot predict reverse ﬂows because of its architecture limit, hence a 3-node junction\nnetwork model is then proposed. It is demonstrated that the newly developed 3-node junction hydraulic\nnetwork model can predict the occurrence of reverse ﬂows in OD cooled disc-type transformer windings.\nINDEX TERMS Hydraulic network model, hybrid correlation, junction 3-node, reverse ﬂow, transformer.\nI. INTRODUCTION\nLiquid-immersed power transformers with disc-type wind-\nings are the most common transformer type in the transmis-\nsion power network, where the liquid servers as a dielectric\nas well as a coolant. The liquid ﬂow distribution in the\nwinding pass has a direct impact on the cooling performance\nand affects the highest temperature in the winding, which\ndetermines the highest thermal ageing rate of the cellulose\ninsulation and therefore the normal life expectancy of the\ntransformer [1], [2].\nFor pump-driven oil directed (OD) cooling modes,\nthe effect of buoyancy force is negligible [3], leaving the\nhydraulic design being the focus. Ideally, the liquid ﬂow\ndistribution should match the power loss distribution in the\nwinding. However, in reality, an even ﬂow distribution is\ndesired to avoid localized overheating arising from uneven\nﬂow distribution.\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Tao Wang\n .\nThe hydraulic design of the transformer may be based on\nempirical formulae and evolutions of manufacturer experi-\nence. However, it becomes more challenging as new design\nfeatures can well emerge outside the empirical comfort zone.\nModelling of the hydraulic system is therefore increasingly\nrecognized as a trend.\nTwo modelling methods are available: hydraulic network\nand computational ﬂuid dynamics (CFD). The two methods\nshare the same principles of mass and momentum conser-\nvation, with network models being composed of nodes and\nbranches reduced from original ﬂow topology and using\ncorrelations to describe pressure drops in relation to geom-\netry and ﬂow conditions [4]–[9] and, on the other hand,\nCFD models solving the governing differential equations in\na direct numerical manner [10], [11]. CFD models provide\nmore reliable and detailed results over network models at the\nexpense of much more complicated model setting-up process\nand much higher computational requirement.\nOff-the-shelf correlations for the so called ‘‘minor pressure\nlosses’’ from ﬂuid mechanics literature are found inaccurate\nVOLUME 7, 2019 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see http://creativecommons.org/licenses/by/4.0/ 139249\nX. Zhang, Z. Wang: Assessment of Hydraulic Network Models in Predicting Reverse Flows\nand lead to signiﬁcant discrepancies in ﬂow and pressure\ndrop results between network models using these correlations\nand CFD models. CFD calibration of the correlations follow-\ning the literature correlation format is implemented in [12]\nand the resulted pressure drop prediction over the winding\nis greatly improved [13]. Pronounced improvements of the\n‘‘minor loss’’ correlations from CFD are achieved by multi-\nlayer curve ﬁtting of the ‘‘minor pressure loss’’ coefﬁcients\nwith their controlling parameters derived from dimensional\nanalysis [14]. A typical hydraulic network model equipped\nwith the ‘‘minor loss’’ correlations from [14] proves to be\ncapable of generating ﬂow distribution and winding total\npressure drop results that are comparable with CFD results.\nCFD simulations and experimental tests show that for OD\ncooling modes with the increase of the Reynolds number (Re)\nat the winding pass inlet the liquid ﬂow distribution becomes\nincreasingly uneven with higher ﬂow rates in the top horizon-\ntal ducts and lower ﬂow rates in the bottom horizontal ducts.\nIn addition, reverse ﬂows can occur at high Re’s [3], [8], [15],\nand it is detrimental to the insulation as the reverse ﬂow\nregion has a low net ﬂow rate that causes localized overheat-\ning. To avoid reverse ﬂows in a transformer the hydraulic\ndesign tool needs to be capable of predicting its occurrence in\nthe ﬁrst place. For a network model to predict the occurrence\nof reverse ﬂows, it needs to be equipped with minor loss\ncorrelations corresponding to reverse ﬂow scenarios, and it\nshould switch to the right correlations when the ﬂow pattern\nchanges and reverse ﬂows occur.\nThis paper is a continuation of the effort in improving\nnetwork modelling by CFD calibration. It assesses hydraulic\nnetwork models in predicting reverse ﬂows in OD cooled\ndisc-type transformer windings and proves that a hydraulic\nnetwork model, if set in a proper format, can predict this\nphenomenon. Section II presents the development of a con-\nversional hydraulic network model and compares ﬂow dis-\ntribution and winding total pressure drop results from the\ndeveloped model with those obtained from the network model\nin [14] and a CFD model. The developed model and its\nmodiﬁed versions are then applied to predicting the occur-\nrence of reverse ﬂows in section III, followed by conclusion\nin section IV .\nII. DEVELOPMENT OF HYDRAULIC NETWORK MODEL\nA. HYDRAULIC NETWORK MODEL FRAMEWORK\nIn a conventional hydraulic network model [4]–[9], the wind-\ning hydraulic topology is reduced to a network of nodes at\njunctions and branches connecting the nodes. Mass conser-\nvation is applied to each node or the sum of pressure drop\nin a closed loop is equalized to 0. The ﬂow rate in a branch\nis determined by the pressure drop over the branch and the\nhydraulic resistance of the branch.\nThere are two types of hydraulic resistance, one relating to\nthe so-called major pressure loss due to friction and the other\nrelating to the so-called minor pressure losses due to changes\nof ﬂow direction.\nThe hydraulic resistance in a planar 2D duct due to fric-\ntion (Rf ) for a hydraulically fully developed ﬂow is\nRf =96 ·µ·l\nD3\nh\n(1)\nwhere µstands for dynamic viscosity, l for duct length, Dh for\nduct hydraulic diameter (twice the duct height). The friction\nresistance for fully developed ﬂow is only related to the\ngeometry and the dynamic viscosity of the liquid.\nThe minor hydraulic resistance, on the other hand,\nis related to the geometry, the liquid properties (density and\nviscosity) and the mass ﬂow split. In disc-type windings,\nthere are ﬁve types of ﬂow conﬁgurations relating to the\nso-called minor pressure losses, as shown in Fig. 1. Taking the\ndividing scenario as an example, the dividing pressure drops\nin the radial ( 1pdr ) and axial ( 1pda) directions are related to\nthe corresponding pressure loss coefﬁcients and the dynamic\npressure at the axial inlet,\n1pdr =Kdr ·1\n2ρv2\n1 (2)\n1pda =Kda ·1\n2ρv2\n1 (3)\nwhere Kdr and Kda stand for dividing pressure loss coefﬁcient\nin radial and axial direction respectively, ρfor density and v1\nfor average inlet velocity.\nFIGURE 1. Flow configurations relating to ‘‘minor’’ pressure losses.\n(a) dividing, (b) merging, (c) elbow with inlet at axial duct, (d) elbow with\ninlet at radial duct, (e) reverse dividing.\nThe dividing radial resistance ( Rdr ) and dividing axial\nresistance ( Rda) as shown in Fig. 2 (b) are in the following\nformat\nRdr =2 ·Kdr ·˙m2\nD2\nh ·β2 =2 ·Kdr ·˙m2\ninlet\nD2\nh ·˙m2\n(4)\nRda = 2 ·Kda ·˙m3\nD2\nh ·(1 −β)2 =2 ·Kdr ·˙m2\ninlet\nD2\nh ·˙m3\n(5)\nwhere ˙minlet , ˙m2 and ˙m3 is the mass ﬂow rate in the inlet,\nthe radial and axial dividing ducts, respectively, βis the mass\nﬂow fraction in the radial duct, as denoted in Fig. 2 (a).\nThe pressure loss coefﬁcients (e.g. Kdr and Kda) are con-\ntrolled by the geometry ( α = Hr /Ha, the ratio of radial\nduct height to axial duct width), the ﬂow split ( β) and the\nReynolds number ( Re) at the inlet [14]. It is worth noting that\nthe effect of rounding radius of the winding discs on pressure\nloss and ﬂow distribution in the winding is found negligible\nand therefore it is not included in the analysis.\n139250 VOLUME 7, 2019\nX. Zhang, Z. Wang: Assessment of Hydraulic Network Models in Predicting Reverse Flows\nFIGURE 2. Hydraulic resistances in a flow dividing scenario. (a) Dividing\nflow configuration, (b) Network representation of the flow dividing\nscenario.\nThe minor hydraulic resistances are related to the ﬂow rates\nin the branches, indicating that iterations must be conducted\nto solve a hydraulic network model. A typical hydraulic\nnetwork model for a 4-radial-duct winding pass is shown\nin Fig. 3.\nFIGURE 3. A typical hydraulic network of a 4-radial-duct winding pass.\nRf for friction resistance,Rdr for dividing radial resistance,Rda for\ndividing axial resistance,Rmr for merging radial resistance,Rma for\nmerging axial resistance,Reai for elbow resistance with axial inlet flow,\nReri for elbow resistance with radial inlet flow.\nB. MINOR LOSS COEFFICIENT CORRELATIONS\nDimensional analyses show that the minor loss coefﬁcients\nfor dividing, merging and ﬂows over elbows are controlled\nby Re at the inlet, geometry ( α), and ﬂow split ( β for ﬂows\nover elbows is 1) [14]. To quantify the minor loss coefﬁcients,\nisothermal CFD simulations of the ﬂow conﬁgurations,\nshown in Fig. 1, are performed. In the CFD simulations,\nthe inlet velocity proﬁle is set fully developed and the other\nbranches are long enough so that the ﬂows after passing the\njunction can regain fully developed conditions. With fully\ndeveloped conditions maintained at the outlets the minor\nlosses over the junction can be segregated from the friction\nlosses. The drawback of this arrangement is that the interac-\ntions between ducts in affecting minor losses are dismissed.\nDetailed simulation strategies follow closely that presented\nin [12], [14]. It is worth mentioning that a pass-by-pass\nconsideration of the liquid ﬂow distribution accounting for\nthe duct ﬂow interaction was proposed in [15] to correlate\nﬂow fraction with pass inlet Re directly.\nCFD parametric sweeps of Re, α and β for the 5 minor\nloss related conﬁgurations are summarized in Table 2. Re is\ndeﬁned at the branch with the total ﬂow rate and α is the\nratio of radial duct height to axial duct width. In conventional\nscenarios, β refers to the ratio of radial duct ﬂow rate to\nthe total ﬂow rate. In reverse dividing scenarios, which are\nnot included in conventional hydraulic network models, β\nrefers to the mass ﬂow ratio of the lower axial duct to that\nof the radial duct and this ratio is limited to 0.5 because of\nthe symmetry of the ﬂow conﬁguration. The pressure loss\ncoefﬁcient for lower axial duct with β >0.5 is identical to\nthat of upper axial duct with lower axial duct mass ﬂow ratio\nbeing 1 −β.\nMultilayer least-square curve ﬁtting strategy is adopted to\nform a correlation between the pressure loss coefﬁcient and\nits controlling parameters. The ﬁtting functional format set\nfor a generic pressure loss coefﬁcient is shown in (6).\n\n\n\nK =a1\nRe +a2 ·ln(Re) +a3\nai =bi1α3 +bi2α2 +bi3α+bi4 (i ∈{1, 2, 3})\nbij =cij1β3 +cij2β2 +cij3β+cij4 (j ∈({1, 2, 3, 4})\n(6)\nwhere a and b coefﬁcients are dummy coefﬁcients and\n48 c-coefﬁcients are generated. For elbow pressure loss coef-\nﬁcients the third layer is not included and 12 b-coefﬁcients\nare generated.\nSince the minor loss coefﬁcients for (a)-(d) in Fig. 1 are\nalmost identical to those shown in [14], only the results for\nreverse dividing with α being 0.3 are shown in Fig. 4 and\nFig. 5 as representative results. It is worth noting that reverse\ndividing junctions are not included in traditional network\nmodel. However, it is needed to model reverse ﬂow scenarios.\nThe data points shown in black circle are CFD results and\nthe meshes are generated by correlation equation sets. The\nmaximum errors between the CFD results and those from\nthe correlations are 0.029 for pressure loss coefﬁcient in the\nlower axial duct and 0.028 for the upper axial duct, and these\nerrors are negligible in affecting ﬂow predicting.\nC. IMPLEMENTATION OF HYDRAULIC NETWORK MODEL\nFor a conventional 1-pass network model, when the number\nof horizontal ducts is n, there will be 2n +2 nodes and 3n\nbranches. The topmost node is usually set as a reference node\nwith the pressure assigned to be 0. Each branch has a ﬂow\nrate and the hydraulic resistance of the branch is contributed\nby both ‘‘major’’ and ‘‘minor’’ pressure losses. The formats\nof ‘‘major’’ and ‘‘minor’’ resistances are shown by (1), (4)\nor (5) respectively.\nVOLUME 7, 2019 139251\nX. Zhang, Z. Wang: Assessment of Hydraulic Network Models in Predicting Reverse Flows\nFIGURE 4. Pressure loss coefficients in the lower axial duct for reverse\ndividing T-junctions. Black circles are data points from CFD and the mesh\nis generated by the correlation equation set.\nTABLE 1. Parametric sweep ranges for minor loss related configurations.\nNodal analysis is adopted for the 2n +1 nodes. If we assume\nthe hydraulic conductance (reciprocal of hydraulic resistance)\nbetween nodes i and j is Yij, we can write the nodal equations\nas\nY ·⃗P =⃗Q\nwhere Y is a (2n +1)×(2n+1) hydraulic conductance matrix;\n⃗P and ⃗Q are (2n +1) ×1 pressure vector and ﬂow source\nvector respectively. It is worth noting that the ⃗Q elements are\nall zeros except for the bottom node, which has a ﬂow source\nof the pass inlet ﬂow rate.\nSince the ‘‘minor’’ hydraulic resistance is ﬂow rate and\nﬂow distribution dependent as described in section II A,\nthe hydraulic conductance matrix needs to be updated iter-\natively when a new ﬂow distribution is obtained until the\nchange of the hydraulic conductance matrix ( Y) is negligible.\nThe ﬂow chart of implementing the network model is shown\nin Fig. 6.\nD. COMPARISONS\nThe hydraulic network model developed is compared with\nthat in [14] and a CFD model for an isothermal OD ﬂow\nFIGURE 5. Pressure loss coefficients in the upper axial duct for reverse\ndividing T-junctions.\nFIGURE 6. Flow chart for hydraulic model implementation.\nover a 1-pass disc-type winding. The winding has 8 discs of\nthe dimension of 88 ×12 mm, two axial ducts both being\n6 mm wide, 9 radial ducts with radial ducts 1-8 at the bottom\nbeing 4 mm high and the top radial duct being 2 mm high.\nThe Reynolds number at the pass inlet is 1001. The results\nfor mass ﬂow distribution in the winding and static pressure\ndrop over the winding are compared and shown in Fig. 7 and\nTABLE 2, respectively. The network models developed in\nthis paper and that in [14] give comparable ﬂow distribution\nand pressure drop results to those obtained from the CFD\nmodel. The so-called minor pressure losses have signiﬁcant\ninﬂuence on the ﬂow distribution and the total pressure drop.\nThis is shown by a network model that ignores the minor\npressure losses and gives totally different ﬂow distribution\nand pressure drop results.\n139252 VOLUME 7, 2019\nX. Zhang, Z. Wang: Assessment of Hydraulic Network Models in Predicting Reverse Flows\nFIGURE 7. Comparisons of mass flow distributions from 3 network\nmodels and a CFD model.\nTABLE 2. Comparisons of pressure drops over the winding model.\nFIGURE 8. Changes of junction types when a reverse flow occurring at the\nbottom of the pass. The red boxes denote the changes of junction type.\nIII. PREDICTING REVERSE FLOWS\nFor OD cooling modes when Re at the winding pass inlet is\nhigh enough, reverse ﬂows occur in the bottom radial ducts of\nwinding passes, which are observed in both CFD simulations\n[8], [15], [16] and experimental measurements [3], [17].\nFor a hydraulic network model, reverse ﬂows occur in one\nof the two conditions: (1) the static pressure drop over the\nradial duct is reversed and the total hydraulic resistance in\nthe radial duct is positive; (2) the static pressure drop over the\nradial duct is not reversed and the total hydraulic resistance is\nnegative. When a reverse ﬂow occurs, some junction types\nchange accordingly, e.g. when a reverse ﬂow occur at the\npass bottom radial duct, the junction type changes are shown\nin Fig. 8.\nIn this section we explore the possibility of predicting ﬂow\nreversal by 3 types of modiﬁed hydraulic network models:\na conventional 1-node junction network model with reverse\ndividing minor loss correlations, 1-node junction network\nmodel with hybrid minor loss correlations, and a new 3-node\njunction hydraulic network model and hybrid minor loss\ncorrelations. The following 3 sub-sections present the perfor-\nmance of the three types of models in predicting the occur-\nrence of reverse ﬂow.\nA. CONVENTIONAL 1-NODE JUNCTION NETWORK MODEL\nLiquid ﬂow distributions for a 2-pass winding model,\nas shown in Fig. 9 (a), are investigated by planar 2D CFD\nsimulations. The reason to choose this winding model is that\nthe CFD ﬂow distribution results have been veriﬁed by exper-\nimental tests using particle image velocimetry techniques [3].\nFIGURE 9. 2-pass winding model. (a) Geometry (b) Velocity contour at\nRe=1200.\nCFD shows that pass 1 and pass 2 have different ﬂow pat-\nterns. When pass inlet Re is 1200, pass 2 experiences reverse\nﬂow at the bottom horizontal duct but no reverse ﬂows in\npass 1, as shown by the velocity proﬁles in Fig. 9 (b). In fact,\neven when pass inlet Re increases to 2000, pass 1 experiences\nno reverse ﬂows. In addition, CFD shows that for the ﬂow\nreversed radial duct at the bottom of pass 2, the pressure\ndrop is reversed, i.e. the average pressure at the expected duct\ninlet is lower than that at the expected outlet, indicating the\ntotal hydraulic resistance in the ﬂow reversed radial duct is\nstill positive. Therefore, the ﬁrst condition speciﬁed at the\nbeginning of this section is the reality.\nThe occurrence of reverse ﬂows requires not only high\nRe but also the pass inlet velocity proﬁle from the upstream\npass outlet, which is a velocity proﬁle with its peak shifted\naway from the middle of the duct to the wall side, as shown\nby the upper-right close-up in Fig. 9 (b). For pass 1 or a\n1-pass CFD winding model, the pass inlet velocity proﬁle is\nusually prescribed to be uniform or parabolic and herein lies\nthe reason why pass 1 or a 1-pass CFD model cannot have\nreverse ﬂows.\nNetwork models share the same physical principles with\nCFD but with lower spatial resolution, and the way minor loss\nVOLUME 7, 2019 139253\nX. Zhang, Z. Wang: Assessment of Hydraulic Network Models in Predicting Reverse Flows\nFIGURE 10. Dividing and merging junctions with the modified inlet\ncondition of a winding pass located beneath. In CFD simulations,\nthe axial branch is longer than that shown in the figure to guarantee fully\ndeveloped condition at the outlet.\ncorrelations are extracted, as shown in [12], [14], cannot take\ninto account the effect of winding pass inlet velocity proﬁles.\nTherefore, a conventional hydraulic network model even with\nreverse dividing minor loss correlations cannot describe or\npredict the occurrence of reverse ﬂow.\nB. 1-NODE JUNCTION NETWORK MODEL WITH\nHYBRID CORRELATIONS\nTo make a hydraulic network model capable of predicting the\noccurrence of reverse ﬂow, the effect of winding pass inlet\nvelocity proﬁle has to be taken into account in establishing\nthe pressure loss correlations. Therefore, a winding pass is\nadded to the bottom of the dividing and merging junction\naxial inlets, as shown in Fig. 10. It is worth noting that the\nnumber of horizontal ducts in the winding pass beneath and\nthe distance between the pass outlet to the junction affect\nthe minor pressure losses. However, results from a typical\ncondition of 11 horizontal ducts and pass outlet to junction\ndistance being 10 mm are representative. Planar 2D CFD\nparametric sweeps of Re, α and β in the ranges shown in\nTABLE 1 for dividing and merging junctions with a pass of\nthe typical conditions attached beneath are implemented to\ntake into account the effect of junction inlet velocity proﬁle.\nThe drawback of having the upstream pass outlet velocity\nproﬁle is that the pressure at the junction inlet (the pass out-\nlet), shown as red lines in Fig. 10, is not uniform, and average\npressures have to be taken when deriving the minor pres-\nsure losses. Because of this approximation the minor pres-\nsure losses cannot be segregated exactly from the friction\npressure losses. To mitigate this uncertainty, hybrid minor\npressure loss correlations derived from junction CFD simu-\nlations with and without a winding pass beneath are used in\nthe network model developed, as shown in TABLE 3. For the\nwinding pass inlet, it is essential to use dividing radial and\naxial pressure loss correlations derived from junctions with\na pass beneath. In addition, the merging radial pressure loss\ncorrelations derived from junctions with a pass beneath can\nTABLE 3. Hybrid minor loss correlations.\nbe used as well because it is not directly related to the junction\naxial inlet.\nThe comparisons of ﬂow distributions in pass 1 and pass 2\nfor pass inlet Re being 1200 from CFD and network models\nwith conventional and hybrid minor loss correlations are\nshown in Fig. 11. The ducts in a pass are named from\nbottom to top. Flow distributions in pass 1 from CFD and\nconventional network model show no reverse ﬂows with the\nmaximum ﬂow deviation of 3.32% at the penultimate duct\nbetween the two models. Flow distributions in pass 2 from\nCFD and the network model with hybrid correlations show\nsimilar trend with maximum deviation being 1.3% at the\nbottom of the winding pass. CFD shows the reverse ﬂow at\nthe bottom duct ( −1.3%), and the network model with hybrid\ncorrelations shows the lowest ﬂow rate at the bottom duct\n(1.5 ×10−9 %) very close to 0 but not reversed. Since the\nﬂow is not reversed, the changes of junction type shown in\nFig. 8 are not triggered in the network model developed. The\nso close to 0 ﬂow rate in the bottom radial duct is caused\nby the inverse proportional relationship between the minor\nloss resistance and the ﬂow rate in the branch as shown\nby (4) and (5). The lower the radial duct ﬂow rate, the higher\nthe radial dividing resistance and this higher resistance feeds\nback into an even lower radial duct ﬂow rate and so on.\nIt is worth emphasizing that the hydraulic network model\nwith the hybrid minor loss correlations compares well with\nCFD results, though the occurrence of reverse ﬂow cannot be\ncaptured.\nC. 3-NODE JUNCTION HYDRAULIC NETWORK MODEL\nWITH HYBRID CORRELATIONS\nTo enable a hydraulic network model to predict the occur-\nrence of reverse ﬂow, extra nodes at the junction need to be\nadded to allow detailed liquid ﬂow split at the junction and\npressure drop reversal over radial ducts without violating the\nprinciple of the sum of the pressure drops in a closed loop\nbeing 0. Instead of using 1 node at the center of the junction,\n3 nodes are prescribed for 3 types of junctions: dividing,\nmerging and reverse dividing, as shown in Fig. 12. No extra\nnodes are needed for the two types of elbow junctions because\nﬂows in elbows are not split.\nWith 3 nodes prescribed, 6 minor loss hydraulic resistances\nare generated. 5 scenarios, each with 6 minor loss correla-\ntions, are involved, including dividing with and without a\npass beneath the junction, merging with and without a pass\n139254 VOLUME 7, 2019\nX. Zhang, Z. Wang: Assessment of Hydraulic Network Models in Predicting Reverse Flows\nFIGURE 11. Flow distribution comparisons with pass inlet Re being 1200.\n(a) Pass 1 flow distributions from CFD and a network model with\nconventional minor pressure loss correlations; (b) Pass 2 flow\ndistributions from CFD and a network model with hybrid minor pressure\nloss correlations.\nFIGURE 12. Three-node dividing, merging and reverse dividing junctions.\nSubscript f stands for friction, d for dividing m for merging and rd for\nreverse dividing.\nbeneath the junction, and reverse dividing without a pass\nattached to the junction. For each junction type or scenario,\nCFD parametric sweeps of Re, αand β shown in TABLE 1\nare used and correlations for the corresponding 6 minor loss\ncoefﬁcients are formed.\nSimilar to the 1-node junction network model with hybrid\ncorrelations, the 3-node junction network model adopts\nhybrid correlations as well. The hybrid correlations are\nshown in TABLE 4. All the 6 minor loss correlations for\nthe pass inlet dividing junction are from the CFD paramet-\nric sweeps of junctions with a pass beneath to modify its\ninlet condition, while the other dividing junction correla-\ntions are from CFD sweeps without inlet condition mod-\niﬁcations. For the merging junctions, minor loss 2, 4 and\n6 correlations, which are related to the radial ﬂow path\nas shown in Fig. 12, are from sweeps with modiﬁed inlet\nTABLE 4. Hybrid minor loss correlations.\nFIGURE 13. Flow distribution comparisons with pass inletRe being 1200.\nconditions and minor loss 1, 3, 5 correlations are from sweeps\nwith fully developed inlet conditions (with no pass attached\nbeneath).\nWith 3 nodes for the dividing, merging and reverse dividing\njunctions, a winding pass with n radial ducts ends up with\n6n-2 nodes and 9 n-6 branches. The network is solved with\nthe same procedures shown in Fig. 6. The comparison of ﬂow\ndistributions for pass 2 in the 2-pass winding model with Re\nbeing 1200 from CFD and the 3-node junction network model\nis shown in Fig. 13. The 3-node junction network model\npredicts the occurrence of reverse ﬂow at the bottom radial\nduct (-0.59%), which triggers the changes of junction type in\nthe bottom of the pass.\nThe maximum ﬂow fraction deviation between the CFD\nand the 3-node junction network model is 2.89% at the\npenultimate duct. Compared to the 1-node junction network\nmodel in section III B, the 3-node junction network model\nresults in slightly higher maximum ﬂow discrepancy with the\nCFD results because the 6 minor losses cannot be exactly\nsegregated from friction losses.\nThe pressure distribution and ﬂow pattern in the bottom of\nthe pass from the 3-node junction network model are shown\nin Fig. 14. The reverse ﬂow in the bottom radial duct is caused\nby pressure drop reversal across the radial duct. In addition,\nﬂows across some branches can gain pressure due to negative\nminor pressure loss coefﬁcients associated with the ﬂow\nsplitting or merging. The ﬂow fractions in the branches in\nFig. 14 are shown in TABLE 5. The higher than 100% ﬂow\nVOLUME 7, 2019 139255\nX. Zhang, Z. Wang: Assessment of Hydraulic Network Models in Predicting Reverse Flows\nFIGURE 14. Node pressure distribution and flow pattern in the bottom\ntwo radial ducts. p stands for pressure, b for branch, and×indicates no\nflow passing the branch.\nTABLE 5. Flow distribution in the bottom 2 radial ducts.\nFIGURE 15. Velocity profiles at the bottom of pass 2 from the CFD model.\nThe inlet axial duct scale factor is 0.008, radial ducts scale factor 0.035,\noutlet axial duct scale factor 0.1.\nrates in branch 3 and branch 6 are due to the occurrence of\nreverse ﬂows in branch 2, 5, 7 and 12.\nThe network model ﬂow pattern in Fig. 14 is like the\nﬂow pattern shown by the CFD velocity proﬁles in Fig. 15,\nfor example, the recirculation ﬂow pattern at the entrance\nof duct 2, reverse dividing at the exit of duct 2 and the\nreverse merging at the entrance of duct 1. These similar ﬂow\ndistribution and ﬂow pattern prove that the 3-node junction\nnetwork model can mimic the ﬂow pattern revealed by CFD.\nIt is worth noting that different scale factors are used in\nFig. 15 to show velocity proﬁles of different parts of the\nwinding together.\nIV. CONCLUSION\nCFD and hydraulic network models are usually used in trans-\nformer thermal design to control the liquid ﬂow distribution\nin the winding. Hydraulic network models with proper minor\npressure loss correlations can produce comparable ﬂow dis-\ntribution results to those from CFD models.\nReverse ﬂows cause localized overheating and are detri-\nmental to insulation. To avoid the occurrence of reverse ﬂow,\nthe thermal design tool should be capable of predicting its\noccurrence. Studies here show the occurrence of reverse ﬂow\nrequires high Re at the winding pass inlet and the inlet\nvelocity proﬁle from the outlet of the upstream pass. Con-\nventional 1-node junction hydraulic network models do not\nhave reverse dividing junctions and cannot consider the effect\nof the pass inlet velocity proﬁle and therefore cannot predict\nreverse ﬂows.\nTo equip a hydraulic network model the ability to predict\nreverse ﬂows, correlations for reverse dividing junctions are\nadded and a winding pass is positioned beneath dividing\nand merging junctions to consider the effect of inlet velocity\nproﬁles. To mitigate the inaccuracy in determining the minor\nlosses introduced by the inclusion of a winding pass beneath\na junction, hybrid correlations from conventional junctions\nand junctions with a pass beneath are adopted. However,\nreverse ﬂows still cannot be predicted due to the limit of the\narchitecture of conventional 1-node junction network model,\nthough the ﬂow rate at the bottom radial duct is predicted to\nbe very close to 0.\nThe architecture of conventional hydraulic network model\nis updated with junctions (apart from elbows) represented\nby 3 nodes to allow representation of pressure drop reversal\nacross radial ducts. The introduction of 3 nodes in the junction\nbrings 6 minor loss related resistances as compared to 2 minor\nloss related resistances for conventional 1-node junction net-\nwork. By adopting a similar hybrid correlation strategy, the\nnewly proposed 3-node junction hydraulic network model\npredicts the occurrence of reverse ﬂow in the winding pass.\nAPPENDIX\nA 3-node junction generates 6 minor loss related hydraulic\nresistances. The variation of the 6 minor loss coefﬁcients for\na dividing junction with the condition of a pass beneath and\nαbeing 0.3 are presented in Fig. 16.\nACKNOWLEGMENT\nXiang Zhang would like to acknowledge Mr Marcio Quintela\nof Efacec for the technical discussion which later on inspired\n139256 VOLUME 7, 2019\nX. Zhang, Z. Wang: Assessment of Hydraulic Network Models in Predicting Reverse Flows\nFIGURE 16. Dividing minor loss coefficientKd1, Kd2, Kd3, Kd4, Kd5, Kd6\nvariations withRe and α is fixed to be 0.3. The black circles are data\npoints from CFD parametric sweeps and the mesh is generated by\ncorrelation equation sets.\nhim to research the feasibility of using network models to\npredict reverse ﬂows. The authors would also like to express\ntheir gratitude to their colleagues Dr Qiang Liu and Prof. Paul\nJarman for various internal technical discussions.\nREFERENCES\n[1] Loading Guide for Oil-Immersed Power Transformers, Standard 60076-7,\n2018.\n[2] Guide for Loading Mineral-Oil-Immersed Transformers and Step-Voltage\nRegulators, IEEE Standard C57.91, 2011.\n[3] X. Zhang, M. Daghrah, Z. Wang, Q. Liu, P. Jarman, and M. Negro, ‘‘Exper-\nimental veriﬁcation of dimensional analysis results on ﬂow distribution\nand pressure drop for disc-type windings in OD cooling modes,’’ IEEE\nTrans. Power Del., vol. 33, no. 4, pp. 1647–1656, Aug. 2018.\n[4] A. J. Oliver, ‘‘Estimation of transformer winding temperatures and coolant\nﬂows using a general network method,’’ IEE Proc. C Gener. Transmiss.\nDistrib., vol. 127, no. 6, pp. 395–405, Nov. 1980.\n[5] J. Zhang and X. Li, ‘‘Coolant ﬂow distribution and pressure loss in ONAN\ntransformer windings Part I: Theory and model development,’’ IEEE Trans.\nPower Del., vol. 19, no. 1, pp. 186–193, Jan. 2004.\n[6] Z. R. Radakovic and M. S. Sorgic, ‘‘Basics of detailed thermal-hydraulic\nmodel for thermal design of oil power transformers,’’ IEEE Trans. Power\nDel., vol. 25, no. 2, pp. 790–802, Apr. 2010.\n[7] E. Rahimpour, M. Barati, and M. Schäfer, ‘‘An investigation of parameters\naffecting the temperature rise in windings with zigzag cooling ﬂow path,’’\nAppl. Therm. Eng., vol. 27, nos. 11–12, pp. 1923–1930, 2007.\n[8] H. M. R. Campelo, M. A. Quintela, F. Torriano, P. Labbé, and P. Picher,\n‘‘Numerical thermoﬂuid analysis of a power transformer disc-type wind-\ning,’’ in Proc. IEEE Elect. Insul. Conf. (EIC), Montreal, QC, Canada,\nJun. 2016, pp. 362–365.\n[9] H. M. R. Campelo, L. Braña, and X. M. Lopez-Fernandez, ‘‘Thermal\nhydraulic network modelling performance in real core type transformers,’’\nin Proc. Int. Conf. Elect. Mach. (ICEM), Sep. 2014, pp. 2275–2281.\n[10] A. Santisteban, F. Delgado, A. Ortiz, I. Fernández, C. J. Renedo, and\nF. Ortiz, ‘‘Numerical analysis of the hot-spot temperature of a power trans-\nformer with alternative dielectric liquids,’’ IEEE Trans. Dielectr. Electr.\nInsul., vol. 24, no. 5, pp. 3226–3235, Oct. 2017.\n[11] X. Zhang, Z. Wang, Q. Liu, P. Jarman, and M. Negro, ‘‘Numerical inves-\ntigation of oil ﬂow and temperature distributions for ON transformer\nwindings,’’Appl. Therm. Eng., vol. 130, pp. 1–9, Feb. 2018.\n[12] W. Wu, Z. D. Wang, A. Revell, H. Iacovides, and P. Jarman, ‘‘Compu-\ntational ﬂuid dynamics calibration for network modelling of transformer\ncooling oil ﬂows—Part I heat transfer in oil ducts,’’ IET Electr. Power\nAppl., vol. 6, no. 1, pp. 19–27, 2012.\n[13] A. Weinläder, W. Wu, S. Tenbohlen, and Z. Wang, ‘‘Prediction of the\noil ﬂow distribution in oil-immersed transformer windings by network\nmodelling and computational ﬂuid dynamics,’’ IET Electr. Power Appl.,\nvol. 6, no. 2, pp. 82–90, 2012.\n[14] J. Coddé, W. Van der Veken, and M. Baelmans, ‘‘Assessment of a hydraulic\nnetwork model for zig-zag cooled power transformer windings,’’ Appl.\nTherm. Eng., vol. 80, pp. 220–228, Apr. 2015.\n[15] X. Zhang, Z. Wang, and Q. Liu, ‘‘Prediction of pressure drop and ﬂow\ndistribution in disc-type transformer windings in an OD cooling mode,’’\nIEEE Trans. Power Del., vol. 32, no. 4, pp. 1655–1664, Aug. 2017.\n[16] A. Weinläder and S. Tenbohlen, ‘‘Thermal-hydraulic investigation of trans-\nformer windings by CFD-modelling and measurements,’’ in Proc. 16th Int.\nSymp. High Voltage Eng., Cape Town, South Africa, 2009.\n[17] M. Nakadate, K. Toda, K. Sato, D. Biswas, C. Nakagawa, and T. Yanari,\n‘‘Gas cooling performance in disc winding of large-capacity gas-insulated\ntransformer,’’ IEEE Trans. Power Del., vol. 11, no. 2, pp. 903–908,\nApr. 1996.\nXIANG ZHANG received the B.Eng. degree in\nelectrical and electronic engineering from Xi’an\nJiaotong University, China, in 2012, and the\nPh.D. degree in electrical engineering from The\nUniversity of Manchester, U.K., in 2017, where\nhe is currently a Research Associate with the\nSchool of Electrical and Electronic Engineering.\nHis research interest includes transformer thermal\nmodeling. He is a member of CIGRE A2.60 work-\ning group on dynamic thermal behavior of power\ntransformers.\nZHONGDONG WANG received the B.Sc.\nand M.Sc. degrees in high voltage engineering\nfrom Tsinghua University, in 1991 and 1993,\nrespectively, and the Ph.D. degree in electrical\nengineering from UMIST, in 1999. She is cur-\nrently a Professor of high voltage engineering with\nthe School of Electrical and Electronic Engineer-\ning, The University of Manchester. Her research\ninterests include power transformers covering all\naspects of modeling and simulation, materials and\nsystems, and asset management policies.\nVOLUME 7, 2019 139257",
  "topic": "Inlet",
  "concepts": [
    {
      "name": "Inlet",
      "score": 0.6527085304260254
    },
    {
      "name": "Electromagnetic coil",
      "score": 0.6287104487419128
    },
    {
      "name": "Mechanics",
      "score": 0.6213008165359497
    },
    {
      "name": "Computational fluid dynamics",
      "score": 0.6081064343452454
    },
    {
      "name": "Transformer",
      "score": 0.5561679601669312
    },
    {
      "name": "Pressure drop",
      "score": 0.48565804958343506
    },
    {
      "name": "Reynolds number",
      "score": 0.45999443531036377
    },
    {
      "name": "Node (physics)",
      "score": 0.4212576746940613
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.32294583320617676
    },
    {
      "name": "Computer science",
      "score": 0.3120071291923523
    },
    {
      "name": "Mechanical engineering",
      "score": 0.2781267762184143
    },
    {
      "name": "Engineering",
      "score": 0.20333325862884521
    },
    {
      "name": "Electrical engineering",
      "score": 0.17164981365203857
    },
    {
      "name": "Physics",
      "score": 0.16184738278388977
    },
    {
      "name": "Structural engineering",
      "score": 0.11494848132133484
    },
    {
      "name": "Turbulence",
      "score": 0.08594134449958801
    },
    {
      "name": "Control (management)",
      "score": 0.0
    },
    {
      "name": "Voltage",
      "score": 0.0
    },
    {
      "name": "Artificial intelligence",
      "score": 0.0
    }
  ]
}