{
  "title": "Multi-objective Pareto and GAs nonlinear optimization approach for flyback transformer",
  "url": "https://openalex.org/W2976009329",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A2975082785",
      "name": "Sobhi Barg",
      "affiliations": [
        "Mid Sweden University"
      ]
    },
    {
      "id": "https://openalex.org/A1907496019",
      "name": "Kent Bertilsson",
      "affiliations": [
        "Mid Sweden University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1579307233",
    "https://openalex.org/W2482891568",
    "https://openalex.org/W1536164530",
    "https://openalex.org/W2141903073",
    "https://openalex.org/W2161763865",
    "https://openalex.org/W4234556755",
    "https://openalex.org/W2515428233",
    "https://openalex.org/W1977853135",
    "https://openalex.org/W2519453876",
    "https://openalex.org/W2789309885",
    "https://openalex.org/W2154328305",
    "https://openalex.org/W2502024002",
    "https://openalex.org/W1992905888",
    "https://openalex.org/W2586872921",
    "https://openalex.org/W2342958339",
    "https://openalex.org/W1490830175",
    "https://openalex.org/W2338539395",
    "https://openalex.org/W4236419031",
    "https://openalex.org/W4249993574",
    "https://openalex.org/W2097214191",
    "https://openalex.org/W2178700401",
    "https://openalex.org/W2149521553",
    "https://openalex.org/W2140540762",
    "https://openalex.org/W2493844470",
    "https://openalex.org/W2129238421",
    "https://openalex.org/W2330760851",
    "https://openalex.org/W2101385784",
    "https://openalex.org/W2105428225",
    "https://openalex.org/W2783932625",
    "https://openalex.org/W2098352844",
    "https://openalex.org/W2542631174",
    "https://openalex.org/W2528001685",
    "https://openalex.org/W1543489919",
    "https://openalex.org/W224410869",
    "https://openalex.org/W1589194756",
    "https://openalex.org/W615245385",
    "https://openalex.org/W1491443178",
    "https://openalex.org/W2159389468",
    "https://openalex.org/W615998659",
    "https://openalex.org/W1635349345",
    "https://openalex.org/W604703897",
    "https://openalex.org/W2109185194"
  ],
  "abstract": "Abstract Design and optimization of high-frequency inductive components is a complex task because of the huge number of variables to manipulate, the strong interdependence and the interaction between variables, the nonlinear variation of some design variables as well as the problem nonlinearity. This paper proposes a multi-objective design methodology of a 200-W flyback transformer in continuous conduction mode using genetic algorithms and Pareto optimality concept. The objective is to minimize loss, volume and cost of the transformer. Design variables such as the duty cycle, the winding configuration and the core shape, which have great effects on the former objectives but were neglected in previous works, are considered in this paper. The optimization is performed in discrete research space at different switching frequencies. In total, 24 magnetic materials, 6 core shapes and 2 winding configurations are considered in the database. Accurate volume and cost models are also developed to deal with the optimization in the discrete research space. The bi-objective (loss–volume) and tri-objective (loss–volume–cost) optimization results are presented, and the variations of the design variables are analyzed for the case of 60 kHz. An example of a design (30 kHz) is experimentally verified. The registered efficiency is 88% at full load.",
  "full_text": "Vol.:(0123456789)1 3\nElectrical Engineering (2019) 101:995–1006 \nhttps://doi.org/10.1007/s00202-019-00836-3\nORIGINAL PAPER\nMulti‑objective Pareto and GAs nonlinear optimization approach \nfor flyback transformer\nSobhi Barg1  · Kent Bertilsson1\nReceived: 16 February 2019 / Accepted: 11 September 2019 / Published online: 25 September 2019 \n© The Author(s) 2019\nAbstract\nDesign and optimization of high-frequency inductive components is a complex task because of the huge number of variables \nto manipulate, the strong interdependence and the interaction between variables, the nonlinear variation of some design \nvariables as well as the problem nonlinearity. This paper proposes a multi-objective design methodology of a 200-W flyback \ntransformer in continuous conduction mode using genetic algorithms and Pareto optimality concept. The objective is to \nminimize loss, volume and cost of the transformer. Design variables such as the duty cycle, the winding configuration and \nthe core shape, which have great effects on the former objectives but were neglected in previous works, are considered in \nthis paper. The optimization is performed in discrete research space at different switching frequencies. In total, 24 magnetic \nmaterials, 6 core shapes and 2 winding configurations are considered in the database. Accurate volume and cost models are \nalso developed to deal with the optimization in the discrete research space. The bi-objective (loss–volume) and tri-objective \n(loss–volume–cost) optimization results are presented, and the variations of the design variables are analyzed for the case \nof 60 kHz. An example of a design (30 kHz) is experimentally verified. The registered efficiency is 88% at full load.\nKeywords Genetic algorithms · NSGAII · Pareto front · Flyback converter · Transformer · Core loss · Winding loss\nList of symbols\nV\nin, Vout, Pin, Pout  Input and output voltage and power\nPt, Pc, Pw  Transformer, core and winding losses\nD, lg, J  Duty cycle, air gap, current density\nVp, Vs, Ip, Is  Primary and secondary voltage and \ncurrent\nN\nlp, Nls, Ntp, Nts  Primary and secondary number of lay -\ners and number of turns per layer\nCc, Wc  Core cost and winding configuration\ndp, ds  Primary and secondary diameters\nlc, lm  Mean core length and mean turn length\nIpmax, Ismax  Primary and secondary maximum \ncurrents\nIpavg, Isavg  Primary and secondary average \ncurrents\nI\npr, Isr  Primary and secondary currents ripple\nRdcp, Rdcs  Primary and secondary DC resistance\nFr, Ac  Ac-to-dc resistance ratio, core section\nx  Diameter-to-skin depth ratio\nLp, Ls  Primary and secondary inductance\nBac, Bmax  Swing and maximum flux density\nNp, Ns  Primary and secondary number of \nturns\nVtr, Vc, Vw  Transformer, core and winding \nvolumes\nµ\n0, µr  Vacuum and relative permeability\nIprms, Isrms  Primary and secondary RMS currents\nf, fu  Frequency and winding filling factor\n1 Introduction\nFlyback converter is widely used in low-power applications \nsuch as laptop and mobile chargers. It has several advan-\ntages compared to other topologies, especially for low-power \napplications. On the other side, this topology presents one \nmajor inconvenient which is its limited power capability. \nThe converter is only suitable for low power (< 150 W), and \nits efficiency degrades as the power increases. This is due to \nthe conflict in the inductance design requirements. From one \nside, the inductance needs to be increased in order to allow \nmore power storage capability during the on-time, and from \nthe other side, it needs to be decreased because it is inversely \n * Sobhi Barg \n Sobhi.Barg@miun.se\n1 Mid Sweden University, Sundsvall, Sweden\n996 Electrical Engineering (2019) 101:995–1006\n1 3\nproportional to the output power [1 –6]. Several parameters \nand interdependent variables contribute in the design of \nthe flyback transformer. The conflict in the design of the \ntransformer inductance makes the optimization process a \ncomplex task which needs advanced design and optimization \ntechniques to improve its performance.\nClassical design techniques of inductive components are \nmainly the area product method and the core geometry coef-\nficient [6 , 7]. Both design approaches do not consider the \nnonlinearity of the design variables or/and the nonlinearity \nof the complete problem. Moreover, the variables are very \ndependent on each other which make the problem impos-\nsible to be solved accurately using these methods. Some \nother techniques were presented to optimize the magnetic \ndevices by determining the optimum magnetic flux density; \nhowever, they do not solve the nonlinearity issue [ 8–10]. \nThe limitations of these methods are discussed more deeply \nin Sect. 2.1.\nThe consideration of more than one objective in the opti-\nmization transforms the problem to a multi-objective prob-\nlem which cannot be solved by the previous presented tech-\nniques. Some methods like the weighted sum method and the \nMin/Max method were used for this kind of problems [11]. \nHowever, they can only deal with convex and continuous \nfunctions which is not the case of the inductive components \ndesign problem.\nGenetic algorithms and Pareto optimality concept starts \nto be a common solution in the design of electromagnetic \ndevices in the last decade [11– 22]. The main feature of the \nGAs is their capability to handle numerous optimization \nvariables and objective functions without losing accuracy in \nthe convergence to the optimum Pareto front. They are also \nvery effective in solving problems with discontinuous vari-\nables, concave and convex, linear and nonlinear, constrained \nand non-constrained objective functions. Additionally, GAs \nallow also reducing the design time and eventually the cost. \nAll the previous advantages make of the GAs a good can -\ndidate for the multi-objective optimization of the inductive \ncomponents.\nFrom another side, the convergence to the optimum set \nof solutions doesn’t only depend on the performance of the \noptimization algorithms but more importantly on the prob-\nlem formulation. This later includes the selection of the \ndesign variables, the design equations, the design constraints \nand the sequences between them. As an example, in some \ntypes of nonlinear problems, one variable or more can be at \nthe same time an objective function and a design variable or \nit can also be a constraint. Few works were achieved to opti-\nmize the inductive components for power electronics such \nas [13] and [14]; however, no one of them addressed these \nissues. The goal of this paper is to deal with this problem. \nParticularly in this work, some crucial variables such as the \nduty cycle, which has a great effect on the transformer loss, \nthe efficiency, the magnetic material and the winding con-\nfigurations, are considered as main design variables. Finally, \nto improve the design objectives, reliable and accurate mod-\nels of the objective functions, the design constraints and the \nintermediate design functions, such as core loss, winding \nloss and leakage inductance, are developed.\n1.1  Research contributions\nThe main contributions of this work are:\n1. To develop a multi-objective optimization approach to \ndesign a flyback transformer in continuous conduction \nmode using GAs and Pareto optimality concept.\n2. To solve the nonlinearity of the design problem resulting \nfrom the interdependence between the design variables, \nthe objective functions and the design constraints.\n3. To include the effect of some crucial variables in the \noptimization process such as the duty cycle and the effi-\nciency which are neglected in the previous works.\n4. To analyze the variation of the design and optimiza-\ntion variables with respect to the Pareto front for the bi-\nobjective (loss–volume) optimization and tri-objective \n(loss–volume–cost) optimization problems in order to \nget a clear picture on the variation of these variables \nwith respect to the objective functions.\n5. To verify the optimization results of the transformer \ndesigned for 30 kHz by experiments and comparison \nwith existing approaches.\n6. To give an insightful picture on the state-of-the-art on \nthe design and optimization of inductive components.\nThis paper is organized as follows. A review of the opti -\nmization and design methods of inductive components is \npresented in the second section. The third section details the \nmulti-objective design and optimization approach. The opti-\nmization results are highlighted and analyzed in the fourth \nsection. The experimental verification and comparison with \nclassical methods of a design case are shown in the fifth \nsection. Finally, the advantages of the future works of the \nproposed design are summarized in the conclusion.\n2  Review of the high‑frequency inductive \ncomponents design and optimization \nmethods\n2.1  Challenges in the design of HF transformer\nThe major challenges faced today by designers of high-\nfrequency transformers are the selection of: the appropriate \nmagnetic material, the suitable core shape, the required core \nsize and the winding configuration. All the former variables \n997Electrical Engineering (2019) 101:995–1006 \n1 3\nare generally chosen based on the designer experience to \nsatisfy the design constraints and requirements which can \nreduce the design efficiency. The selection of the switching \nfrequency and the duty cycle is defined arbitrarily. How -\never, it was shown in the literature that the duty cycle pre-\nsents a great effect on the core loss and the winding loss \n[22–32]. The frequency has also an important role in the \ntransformer loss and volume. Thus, the consideration of \nthese variables as main design and optimization variables is \ncrucial. The determination of the number of turns, the calcu-\nlation of the air gap and some other intermediate functions \nis derived from the relationships between the inductance \nreluctance model, the energy storage equation and Fara-\nday’s and Ampere’s laws. These variables have nonlinear \nrelationships between each other. Furthermore, the design \nof high-frequency transformers needs to take into considera-\ntion some constraints such as the leakage inductance and the \ntemperature rise. In general, there is a huge interdependence \nand interaction between the design variables, the intermedi-\nate design functions, the design constraints and the objec-\ntive functions which makes the problem very complex to \nbe solved.\nIn a given design problem, one combination or more of \nthe previous discussed design variables can be the optimum \nset of solutions for the objective functions such as the effi-\nciency, the cost and the volume. In the following, the exist-\ning methods are analyzed and their limitations to solve the \nformer issues are figured out. The existing methods can be \nclassified into two categories: single-objective methods and \nmulti-objective methods.\n2.2  Single‑objective methods\nThe area product method was early developed to select the \nsuitable magnetic core for a given application [6 , 7, 33]. It \nis a geometry dimensional factor of magnetic cores which \nhas an equivalent term of electrical variables of the power \nconverter. The equivalent term depends on the maximum \nmagnetic flux density. The geometry term is the product of \nthe core window area and the core cross section. In the lit-\nerature, there are several forms of the area product. Some \ncorrection factors are adopted by industrials in order to meet \nthe design requirements [34–36]. For example, author in [34, \n35] has proposed that the volume of the flyback transformer \nis twice the one for forward. This correction factor is used \nbecause the flyback transformer needs to store energy dur -\ning the on-time. In [2 ], a monogram of the area product \nas a function of the stored energy is given in [36], and the \narea product was expressed as a function of the magnetizing \ninductance to take into consideration the effect of the DC \ncurrent and the stored energy.\nThe first drawback of the area product (AP) method is that \nit includes the filling factor which is an unknown and usually \nestimated to 0.3 or 0.4. Secondly, the product between the \ncore section and the window area doesn’t give a real pic -\nture and an accurate characterization of the core shape. In \nother terms, the area product does not take into account the \ncore shape effect on the design because two different core \nshapes can have the same AP. Furthermore, the area prod-\nuct method allows only getting an idea about the required \ncore size; however, all the remaining variables, such as the \nmaterial and the winding configuration, are chosen by the \ndesigner using his own experience. In addition to that, this \nmethod does not minimize the transformer loss because it \ndoesn’t include the eddy currents effect at high frequency.\nThe core geometry coefficient method is also a geom-\netry dimensional factor. The expression of the core geom-\netry coefficient is derived from the formula of the optimum \nmagnetic flux density that yields to minimum transformer/\ninductance loss. It includes the core length in addition to the \ncore window and the core cross section which can improve \nthe accuracy in the selection of the suitable magnetic core. \nIt also includes the Steinmetz parameters, characterizing the \ncore loss of the magnetic materials. This feature offers the \npossibility to consider the effect of the magnetic material \nloss in the design process, and therefore the selection of the \nbest material becomes achievable [37].\nAlthough the core geometry coefficient offers better accu-\nracy in the selection of the suitable magnetic core than the \narea product, it still presents major limitations which are \nsummarized as follows: (1) the method is a single-objective \ndesign approach used to improve the efficiency and not the \ncost or the volume, (2) the method is only suitable at fixed \nfrequency and fixed duty cycle, and (3) the method needs \nan iterative approach to include the effect of the core shape \nbecause magnetic core with different shapes might have the \nsame core geometry.\nHurley developed an improved expression of the equiva-\nlent term of the area product to include high-frequency \neffects such as the skin and the proximity effects as well as \nthe temperature effect. This was achieved by calculating the \noptimum magnetic flux density instead of using the maxi -\nmum magnetic flux density [9, 10].\nA similar approach based on the determination of the \noptimum magnetic flux density was presented by Petkov \nbut without consideration of the high-frequency effects [8 ].\nIn [38], the weighted efficiency method was applied to \noptimize the flyback inverter, including the transformer com-\nponent, for photovoltaic applications. The optimization of \nthe weighted function was solved by the differential evolu-\ntion method.\n2.3  Multi‑objective methods\nIn the former design approaches, the efficiency is the \nonly objective to deal with as it is the major concern of \n998 Electrical Engineering (2019) 101:995–1006\n1 3\nthe designer. In the last decade, designers are much more \ninterested to optimize, not only the converter efficiency, but \nalso the cost and the volume in order to meet the standards \nand clients requirements. This is called a multi-objective \noptimization problem. Genetic algorithms are powerful \noptimization methods to solve this kind of problems. Pareto \nfront is also one insightful and effective tool to represent \nthe optimum solution in the objectives space or variables \nspace. Using Pareto optimality concept, the decision maker \ncan move along the Pareto front to select one of the optimal \nsolutions that meets the required needs. It is also possible \nto know the evolution of the optimization variables and any \nintermediate function with respect to Pareto front. Hence, \nthe effect of every variable can be well understood and ana-\nlyzed. In fact, using GAs and Pareto concept of optimality, \nwe can get a clear picture of the full problem in the objective \nspace and the intrinsic variation of the design variables can \nbe seen at any optimal operating point [11, 19–21]. In [12], \nGAs was used to achieve the best tradeoff between volume \nand loss of PWM inverter output filters. In [13], the loss \nand weight optimization of medium frequency transform-\ners was performed using genetic algorithms (NSGAII). The \nmain limitation of this work is that the capability of the \nGAs to solve nonlinear problems is not fully utilized. As an \nexample, in [13], the value of the required inductance was \ninitialized in the design of LLC and DAB converter. GAs \nwas applied to determine the optimum set of the variables \ngiven by the inductance reluctance model independently of \nthe converter operation constraints. However, to be more \naccurate, the value of the required inductance depends on \nseveral other variables, depending on the converter topology, \nsuch as the duty cycle, the frequency and the efficiency. In \na similar way in [14], the magnetizing inductance was con-\nsidered as a fixed parameter for LLC converter which is not \nenough accurate design approach.\nGenerally speaking, in the previous discussed works, the \ndependency of required inductance on the converter require-\nments (efficiency, duty cycle, frequency, etc.) was neglected \nand this can reduce the design accuracy. Another important \nissue which was not clearly explained and formulated in \nprevious work is the relationship between the different opti-\nmization variables, the objective functions and the design \nconstraints which all contribute in the nonlinearity of the \ndesign problem. Additionally, the models of the objective \nfunctions present lack of accuracy such as the negligence of \nthe temperature effect on the core loss.\nIn [15], two kinds of evolutionary algorithms (GA and \nPSO) have been tested to optimize the volume and the mass \nof EI and UI core inductor, respectively. A continuation of \nthe work presented in [15] is exhibited in [16]. The single \noptimization (volume) and the bi-objective optimization \n(loss vs. volume and loss vs. cost) of the EI inductor are per-\nformed. The tri-objective optimization is also presented by \noptimizing the cost and the volume constrained to the objec-\ntive function loss. The single-objective optimization is pre-\nsented with continuous and discrete variables. GOSET opti-\nmization tool, developed by authors in [17, 18], was used to \nachieve the optimization process. It was shown that GOSET \ntool allows achieving better minimization with discrete vari-\nables. The structure of GOSET is similar to NSGAII but \nwith more optional function that improves its performance. \nIn [19], a multi-objective optimization approach was pre-\nsented to minimize the losses, the weight and the volume of \npower inductors for three-phase high power density inverter.\n2.4  200‑W flyback converter design complexity\nDesigning a 200-W flyback converter is very complicated \ndue to the reasons discussed previously. In the literature, \nthere are few attempts done to realize a flyback converter \nat this power level. The only industrial 200-W flyback con-\nverter was designed by Texas Instruments. The adopted solu-\ntion consists in using two interleaved transformers with an \ninductance of 500 µH each, and the switching frequency is \n100 kHz. The value of the inductance reflects the signifi-\ncant volume of the used transformers [39]. Another company \ndeveloped a 140-W flyback converter, but it can supply a \nmaximum power of 200 W [40]. The inductance of the trans-\nformer is 300 µH. Another study in [41] showed the design \nof a 180-W flyback converter using a regenerative snubber \ncircuit concept. The magnetizing inductance is 102 µH, and \nthe switching frequency is 80 kHz.\nIn all the previous designs, the use of a big inductance is \nnecessary to reach the 200-W output. In the following, GAs \nand Pareto front optimality concept is used to optimize the \n200-W flyback transformer.\n3  Design approach\n3.1  Problem description\nThe objective is to perform the bi-objective (loss–volume) \nand tri-objective (loss–volume–cost) optimization of high-\nfrequency transformer for a 200-W flyback converter. The \ncharacteristics of the converter are summarized in Table  1.\nTable 1  Converter \ncharacteristics Output voltage 120 V\nInput voltage 48 V\nOutput power 200 W\nMaximum tem-\nperature rise\n60 °C\nFrequency 10–20–30–\n40–50–\n60 kHz\n999Electrical Engineering (2019) 101:995–1006 \n1 3\nSeveral variables and constraints contribute in the design \nof flyback transformer. As per our knowledge, still there is \nno study solving the optimization of this magnetic problem \nwith consideration of all variables due to the issues dis-\ncussed in Sect. 2. Using the advantages of GAs, the optimi-\nzation of the flyback transformer with consideration of all \nthe design variables becomes possible. All the data of the \nmagnetic cores and magnetic materials are summarized in \nTables 5, 6 and 7.\n3.2  Core loss prediction\nSeveral empirical models have been developed to calculate \nmagnetic core loss of high-frequency inductive components \nused in switching power supplies. These models, which are \nthe modified Steinmetz equation, the generalized Steinmetz \nequation (GSE), the improved GSE and the  improved\n2 GSE, \nare derived from the Steinmetz equation [23– 27]. They \npresent some limitations which are explained in [22]. The \nmodel given in [22] [Eq. (1 )] solves the limitations of the \nformer models. Its main features are: high accuracy espe -\ncially at low duty cycle, compact, reliable and easy to apply.\nIn this work, the Steinmetz parameters are expressed as \na function of the frequency in order to improve the reli-\nability of the optimization algorithm [ 22]. Figure  1 shows \nhow accurately the Steinmetz parameters are derived and \nthe high consistency between the manufacturer data and the \ndeveloped model for material N27.\n(1)\n⟨Pc⟩ = /u1D70B\n4\n⎡\n⎢\n⎢⎣\nk1D\n�\nf\n2D\n�/u1D6FC1 �Bac\n�/u1D6FD1\n+k2(1 − D )\n�\nf\n2(1−D )\n�/u1D6FC2 �Bac\n�/u1D6FD2\n⎤\n⎥\n⎥⎦\nVc\nTo include the effect of the temperature, the following \nequation was developed using curve fitting technique of the \ncore loss given in manufacturer’s catalogs. It is multiplied to \nEq. (1):\n3.3  Winding loss\nAt high frequency, the skin effect and the proximity effect are \nsignificant and their impact on the AC resistance is very huge. \nIn the literature, there are various models to account the effect \nof these phenomena such as Dowel’s formula and Ferreira’s \nformula [28, 29]. Dowell’s formula has shown a good accuracy \nand consistency with measurements [30–32]. For this reason, \nit is applied in our design. The winding loss can be expressed \nas follows:\n3.4  Volume modeling\nThe volume models presented in the literature are not enough \naccurate and cannot be applied for all geometries. The wind-\ning configuration and the core reference are two optimization \nvariables as it is given in Sect. 3.6. For that reason, a volume \nmodel was developed for each configuration and each core \ngeometry. In the following, we detail the volume model using \nEE core with split winding (see Fig. 2). The objective is that \nthe developed model should be expressed as a function of the \noptimization variables to improve the algorithm reliability.\n(2)\nf(T )= a0T 2 + a1T + a2\n(3)Pw = RdcpFrpI2\nprms + RdcsFrsI2\nsrms\n(4)\nFr = x\n/bracketleft.s4\ne2x − e−2x + 2 sin 2x\ne2x − e−2x − 2 cos 2x +\n2/parenleft.s1N 2 − 1/parenright.s1\n3\ne2x − e−2x − 2 sin 2x\ne2x − e−2x + 2 cos 2x\n/bracketright.s4\n(5)Vc = LcAc\n(6)Ac = DF\nFig. 1  Modeling of core loss curves for N27\n Fig. 2  Core type EE with split winding configuration\n1000 Electrical Engineering (2019) 101:995–1006\n1 3\nThe primary winding volume is equal to:\nSimilarly, the secondary winding is calculated.\n3.5  Transformer cost modeling\nThe cost model is derived using curve fitting technique from \nthe data in [39, 42]. It is a function of the volume, the mag-\nnetic material and the geometry.\nParameter k represents the geometry cost effect, and a, b \nand c are parameters depending on the magnetic material.\n3.6  Problem formulation\nThe objective of this work is to minimize the loss, the vol-\nume and the cost of the flyback transformer. Their models \nare given in the previous subsections. In order to achieve an \naccurate design, a good understanding of the design equa-\ntions as well as the dependency and interaction between the \noptimization variables, the design constraints and objective \nfunctions is mandatory.\nThe full design equations of the flyback converter are given \nin Eqs. (9–13). As it can be seen in Eq. (10), the efficiency is a \ndesign variable. Simultaneously, it represents the first objec-\ntive function as it reflects the total loss. This later appears also \nin Eq. (19) as a design constraint of the temperature rise. This \nclearly represents one aspect of nonlinear problem. In order \nto deal with this issue, an optimization variable referred to as \n“effective efficiency” is generated as shown in Table 2. Then, \nby imposing an equality constraint between the efficiency \n(objective function) and the effective efficiency (variable), \nthe problem can be solved. The same idea is performed for \n(7)\nVwp = 2Ntpd2\np\n/parenleft.s1F + D + 2Nlpdp\n/parenright.s1\n(8)C c = k/parenleft.s1aVb\nc + c/parenright.s1\nthe air gap which has an effect on the inductance and the core \nsaturation as given in Eqs. (9 and 16).\nGOSET optimization tool, discussed in Sect. 2.3, is used \nin our work. The optimization flowchart is given in Fig.  3. \nFor one iteration, a set of variables, given in Table 2, is ran-\ndomly chosen by the algorithm and applied for the different \ncalculation steps. The calculation phase includes the design \nequations, the design constraint, the objective functions and \nthe intermediate functions. Solutions which do not satisfy the \ndesign constraints are discarded; however, those which fulfill \nthe requirements are ranked to form the Pareto front of the \nith iteration. The process is repeated until the Pareto front is \nreached. The needed number of iteration is defined by the user.\n3.6.1  Design equations of the transformer\nThe design equations of the flyback transformer are sum -\nmarized below.\n(9a)\nLp =\n/u1D7070 /u1D707rN 2\np Ac\n/parenleft.s1lc + lg /u1D707r\n/parenright.s1;\n(9b)Ls =\n/u1D7070 /u1D707rN 2\ns Ac\n/parenleft.s1lc + lg /u1D707r\n/parenright.s1\n(10)Pin = Pout\n/u1D702i\n(11)\nIs = Pout\nVout\n; Isavg = Is\n(1 − D ); Isrms = Is\n√\n(1 − D )\nIsr = Vout(1 − D )\nLsf ; Ismax = Isr\n2 + Isavg\n(12a)Ip = Pin\nVin\n;\n(12b)Ipavg =\nIp\nD ;\nTable 2  Design space for the discrete research spaces\nVariable Unit Type Interval\nMagnetic material U Integer [1–24]\nDuty cycle – Integer [1–72]\nCore reference U Integer [1–n]\nWc U Integer [1–2]\nNp U Integer [1–100]\nNs U Integer [1–100]\ndp U Integer [1–60]\nds U Integer [1–60]\nlg M Real [1e−4, 4e−3]\nηi – Real [0.95–0.99]\n Fig. 3  Flowchart of the optimization tool\n1001Electrical Engineering (2019) 101:995–1006 \n1 3\n3.6.2  Design constraints\nThe design constraints are summarized as follows:\n• The core saturation, the gain and the air gap are as fol-\nlows:\n \n \n• Conductor diameters: They are determined by [31].\n• The winding area Aw should be capable of allocating the \ntwo windings. fu is equal to 0.4.\n• Temperature rise Tr:\n• Currents ripple factor: it should be lower than rmax.\n(12c)Ipr = VinD\nLp f\n(12d)Iprms =\nIp\n√\nD\n;\n(12e)Ipmax =\nIpr\n2 + Ipavg\n(13a)Bac = VinD\nfNp Ac\n;\n(13b)B max =\nB acIpmax\nIpr\n(14)Bmax ≤ 0.7Bs\n(15)Gain = NsD\nNp(1 − D)\n(16)lg =\n/u1D7070I2\npmax Lp\nA sB 2\nmax\n− lc\n/u1D707r\n(17)dp =\n/uni221A.s3\nIpmax\n7.2 ; ds =\n/uni221A.s2\nIsmax\n7.2\n(18)Aw ≥\n/u1D70B\n/parenleft.s2\nN pd2\np + N sd2\ns\n/parenright.s2\nfu\n(19)Tr =\n53/parenleft.s1Pc + Pw\n/parenright.s1\nV0.53\nc\n≤ 60 ◦C\n• Peak MOSFET voltage: the maximum allowable voltage \nacross the MOSFET time must be lower than 400 V.\n• Leakage inductance: it is kept lower than 2% of the mag-\nnetizing inductance. Model presented in [42] is used.\n3.6.3  Optimization variables\nThe optimization variables are highlighted in Table 2. They \nare of two types: integer and real.\n4  Multi‑objective optimization in discrete \nresearch space\n4.1  Bi‑objective optimization\nThe results of the GA-based optimization for different \nfrequencies are shown in Fig.  4. The first important thing \nthat can be noticed is the intersection of the Pareto fronts \nbetween each other which shows that the dominance of each \none depends on the design region in the volume–loss plan. \nUsing Pareto front, the designer has the ability to select the \nbest switching frequency depending on the requirements in \nterm of loss and volume. Generally, 60 kHz can be consid-\nered as the optimum frequency. The second optimum fre -\nquency is 50 kHz. In the volume region [50–600]  cm\n3, the \ndominant Pareto front is in the descendant frequency order \nexcept around 200 cm\n3 where 30 kHz dominates 40 kHz. The \nminimum optimum volume that can be achieved is 21 cm 3 \nrealized with 60 kHz. This volume yields to a total loss of \n5.9 W. The minimum total loss is 1.8 W achievable either \nwith 500 cm\n3 and 50 kHz or with lower volume and 60 kHz.\nThe best magnetic material that offers minimum loss \nand minimum volume is F of type ferrite manufactured by \n(20)Ipr ≤ rmax ; Isr ≤ rmax Isavg\nFig. 4  Pareto fronts of loss versus volume\n1002 Electrical Engineering (2019) 101:995–1006\n1 3\nMagnetics (Fig.  5). This material has the second highest \npermeability (3000) among all the ferrite materials in the \ndatabase, which helps to reduce the magnetizing current and \ntherefore minimize the core loss. It has also the second least \nspecific core loss among all ferrite materials at 60 kHz.\nEE and ETD shapes are the best geometries for small vol-\nume (< 100 cm\n3) and UU and Toroid for big volume (Fig. 6). \nThe choice of UU and Toroid shape for big volume is not \nbecause of their performances but because they are the only \nshapes available with this volume (Table 7).\nThe diameter of the primary winding increases with the \nincrease in the transformer volume and the decrease in the \ntotal loss (Fig. 7).\nThe results of the tri-objective optimization are depicted \nin Fig. 8. It can be seen that the 60 kHz keeps almost the best \nsolution. A better way to see the distribution of the Pareto set \nis to use a 2D plan for two objective functions, and the third \none can be read using color bar tool as given in Fig. 9 for the \ncase of 60 kHz. The loss decreases with respect to volume; \nhowever, the cost is not (Fig. 10).\nUsing the normalized Euclidean distance to ideal solution \n(Eq. 21), the best optimum solution can be determined for the \ndifferent cases. Their details are shown in Table 3\n(21)\nd is =\n/uni221A.t/uni221A.x/uni221A.x\n/uni221A.x/uni221A.s4\nn/uni2211.s1\ni=1\n/parenleft.s4\nfi(x)− fmin\ni\nfmin\ni\n/parenright.s42\nFig. 5  Magnetic material versus Pareto front\nFig. 6  Core shape versus Pareto front (see Table 7)\nFig. 7  Primary diameter versus Pareto front\nFig. 8  3D Pareto front of loss–volume and cost\n1003Electrical Engineering (2019) 101:995–1006 \n1 3\n5  Comparison with classical area product \nmethod and experimental verification\nThe optimum magnetic material that is selected by the opti-\nmization algorithm is F material provided by Magnetics. \nBut, at the time of the experimental implementation, this \nselected core was not available in the market. For that rea-\nson, the optimization process was run a second time and the \nresults show that R material is the new optimum one. No \nchanges were registered for other variables (core reference, \nnumber of turns, duty cycle, etc.).\n5.1  Comparison with the area product methods\nThe objective of this section is to compare the outputs of the \ndesign case 30 kHz with the outputs of two single-objective \ndesign approaches in order to verify the reliability and the \naccuracy of our results and to get an approximated idea \nabout the efficiency of the design.\nThe two classical design techniques are the approach of \nLloyd from Texas Instruments and the Approach of Sanjaya \n[34–36]. To give a fair comparison between the different \napproaches, we have used the same magnetic material which \nis the optimal one selected by the proposed approach (ferrite \nF). The duty cycle was fixed to 0.5 for the classical tech-\nniques. For the brevity of the paper, we highlight the most \nimportant steps of the design in Table 4.\nIt is clear from Table 4 that the proposed approach yields \nto better theoretical efficiency than other design techniques. \nHowever, Sanjaya approach leads to the worst efficiency \nresulting from the high number of winding layers. The sec-\nond approach of Lloyd allows getting the same magnetic \ncore as the one selected by the proposed approach; however, \nthe transformer loss is bigger because of the reduced size \nof the winding conductors. The first approach of Lloyd has \ncomparable efficiency to our design but with bigger mag-\nnetic core.\nIn comparison with the design solutions given in \nSect.  2.3, the inductance of the designed transformer is \n233 µH at 30 kHz which is much lower than the one designed \nby Texas and the one proposed by ON Semiconductor.\n5.2  Experimental results\nAn IGBT STGFW30V60F is used, and it is controlled using \na driver TC4429. A capacitor of 63 V 2200uF is used in the \ninput, and a 400 V 47 μF for the output filter. The rectifier \ndiode is Mur1560. The sensing resistors in the input and \noutput are 0.1 Ω, 5 W.\nThe obtained waveforms of the input and output currents, \nthe IGBT voltage and the diode voltage are shown in Fig. 8. \nFig. 9  Pareto front loss–volume–cost for the case of 60 kHz\nVGS :10V /D IV\nVDS :100 V/ DIV\nIp :5A/ DIVI o :2A/DIV\nVD :50V/D IV\nFig. 10  Experimental flyback converter waveforms at 30  kHz (time \ndivision is 6.66 μs/div)\nTable 3  Details of the design solutions\n30 kHz 40 kHz 50 kHz 60 kHz\nLosses (W) 4.88 4.37 4.02 3.66\nCost ($) 5.68 3.9764 3.96 3.32\nVolume  (cm3) 63.41 44.11 44.12 42.75\nMaterial/Wc F/2 F/2 F/2 F/2\nShape/Ref ETD/7 ETD/6 ETD/6 ETD/6\ndp (mm) 1.82 1.8 1.82 2.05\nds (mm) 0.91 1.02 1.02 0.91\nNp/Ns 23/47 24/27 17/32 9/37\nlg (mm) 1 0.7 0.6 0.5\n1004 Electrical Engineering (2019) 101:995–1006\n1 3\nThe efficiency reaches up to 88% at full load. This efficiency \nis very acceptable for a 200-W flyback converter operating \nat 30 kHz. The obtained results can be improved by better \nselection of the switching devices. However, we are limited \nto use only devices available in the laboratory because it is \nnot the objective of this work to optimize the full converter.\n6  Conclusion\nThe paper proposes a multi-objective optimization approach \nof flyback transformers in discrete research space using \nGAs. The key conclusions of this paper are summarized as \nfollows:\n• The approach solves the limitations of the existing works \nby considering the effect of the duty cycle and the effi-\nciency as main optimization variables. The approach \ntakes also into account the nonlinear relationships \nbetween variables, objective functions and design con-\nstraints.\n• The proposed approach allows better minimization of the \nloss and volume in comparison with existing classical \nmethods.\n• The approach is very effective as it improves the accu-\nracy of the results compared to other techniques, and it \nreduces the design time. The optimization needs 30 min \nto get the optimum Pareto fronts which can take longer \ntime using classical techniques.\n• Results show that the optimal magnetic material and opti-\nmal core shape depend on the switching frequency.\n• Pareto fronts of the objective functions (loss, cost and vol-\nume) are inversely proportional to the switching frequency.\nAcknowledgements Open access funding provided by Mid Sweden \nUniversity.\nOpen Access This article is distributed under the terms of the Crea-\ntive Commons Attribution 4.0 International License (http://creat iveco \nmmons .org/licen ses/by/4.0/), which permits unrestricted use, distribu-\ntion, and reproduction in any medium, provided you give appropriate \ncredit to the original author(s) and the source, provide a link to the \nCreative Commons license, and indicate if changes were made.\nAppendix\nSee Tables 5, 6 and 7.\nTable 4  Comparison of the \ndesign outputs between the \nproposed approach and the \nclassical techniques (30 kHz \ndesign case)\nProposed approach Lloyd approaches [36] Sanjaya \napproach \n[34]1st approach 2nd approach\nPrimary inductance (μH) 233 216.45 216.45\nMaximum swing flux (T) 0.1 0.1 0.1\nArea product  (cm\n4) – 17.78 10.24 2.09\nSelected core ETD59 EE 65 ETD59 ETD49\nSelected material F F F\nTurns ratio 0.48 0.4 0.4\nPrimary/secondary number of turns 23/47 15/38 22/55 38/95\nPrimary/secondary diameter (mm) 1.82/1.45 1.28/0.77 1.28/0.77\nPrimary/secondary number of layers 1/1 1/1 2/2\nPrimary/secondary resistance (mΩ) 81.12/327.52 76.54/396 112.25/574 663/2100\nWinding loss (W) 4.72 5.44 7.94 39\nCore loss (W) 0.17 0.27 0.17 0.08\nTransformer loss (W) 4.88 5.71 8.11 39.08\n1005Electrical Engineering (2019) 101:995–1006 \n1 3\nReferences\n 1. Billings KL (1989) Switchmode power supply handbook. \nMcGraw-Hill, New York\n 2. Pressmann AI, Billings KL, Morey T (2009) Switchmode power \nsupply design, 3rd edn. McGraw-Hill, New York\n 3. Maniktala S (2006) Switching power supplies A to Z. Elsevier, \nAmsterdam\n 4. Lenk R (2005) Practical design of power supplies. Wiley, New \nYork\n 5. Brown M (1990) Practical switching power supply design. Aca-\ndemic Press, London\n 6. Kazimierczuk MK (2008) Pulse-width modulated DC–DC power \nconverters. Wiley, New York\n 7. McLyman CT (2004) Transformer and inductor design handbook. \nMarcel Dekker, New York\n 8. Petkov R (1996) Optimum design of a high-power, high-frequency \ntransformer. IEEE Trans Power Electron 11(1):33–42\n 9. Hurley WG, Wölfle WH, Breslin JG (1998) Optimized transformer \ndesign: inclusive of high-frequency effects. IEEE Trans Power \nElectron 13(4):651–659\n 10. Hurley WG, Wolfle WH (2013) Transformers and inductors for \npower electronics: theory, design and applications. Wiley, New \nYork\n 11. Bosshard R, Kolar JW (2016) Comparative multi-objective opti-\nmization of 50 kW/85 kHz IPT system for public transport. IEEE \nJ Emerg Sel Top Power Electron 4(4):1370–1382\nTable 5  Magnetic material \ncharacteristics [43–47]\nMaterial Type Provider Permeability Bs Tc (°C)\nN27 Ferrite EPCOS 2000 0.5 220\nN87 EPCOS 2200 0.49 210\nR Magnetics 2300 0.47 210\nP 2500 0.47 210\nF 3000 0.47 210\nM75 Ferroxcube 5000 0.43 140\nA1 Tape wound core (nickel iron \nalloy) similar to amorphous\nMagnetics 40,000 1.58 500\nD1 100,000 0.82 460\nF1 40,000 0.82 460\nA2 40,000 1.58 500\nD2 100,000 0.82 460\nF2 40,000 0.82 460\nH2 50,000 1.4 500\nF3M Crystalline Hitachi 40,000 1.23 570\nKool mu 26u Powder Magnetics 26 1 500\nKool mu 40u 40 1 500\nKool mu 60u 60 1 500\nKool mu 90u 90 1 500\nKool mu 125u 125 1 500\nMPP 14u 14 0.75 460\nMPP 26u 26 0.75 460\nMPP 125u 125 0.75 460\nMPP 147u 147 0.75 460\nMPP 200u 200 0.75 460\nTable 6  Availability of magnetic materials with respect to core shape\na Materials not considered in this study because they are available \nwith narrow volume range\nE ETD U Toroid (Tc)\nFerrite X X X X\nNano-crystalline Xa X\nAmorphous Xa X\nPowder X\nTable 7  Volume range  (mm3) of magnetic cores for ferrite materials \nused in the discrete optimization [43–48]\nCore EPCOS ferrite materials Magnetics ferrite materials\nSmallest core Biggest core Smallest core Biggest core\nEE 33 71,800 78 72,300\nEI 1920 11,900\nETD 5350 51,200 5470 51,500\nUU 159,000 508,950 350 199,000\nUI 116,000 198,000 283 158,000\nToroid 3 172,440 4.3 161,086\n1006 Electrical Engineering (2019) 101:995–1006\n1 3\n 12. Muhlethaler J, Schweizer M, Blattmann R, Kolar JW, Ecklebe A \n(2013) Optimal design of LCL harmonic filters for three-phase \nPFC rectifiers. IEEE Trans Power Electron 28(7):3114–3125\n 13. Garcia-Bediaga A, Villar I, Rujas A, Mir L, Rufer A (2017) Multi-\nobjective optimization of medium-frequency transformers for iso-\nlated soft-switching converters using a genetic algorithm. IEEE \nTrans Power Electron 32:2995–3006\n 14. Zou S, Lu J, Mallik A, Khaligh A (2018) Modeling and optimi-\nzation of an integrated transformer for electric vehicle on-board \ncharger applications. IEEE Trans Transp Electrif 4(2):355–363\n 15. Cassimere BN, Chan RR, Cale J, Cramer AM, Sudhoff SD \n(2007) Evolutionary design of electromagnetic and electrome-\nchanical devices. In: IEEE\n 16. Cale J, Sudhoff SD, Chan RR (2009) Ferrimagnetic inductor \ndesign using population-based design algorithms. IEEE Trans \nPower Electron 45(2):726–734\n 17. Sudhoff SD (2014) Power magnetic devices: a multi-objective \ndesign approach. Wiley-IEEE Press\n 18. Shane GM, Sudhoff SD (2013) Design paradigm for permanent–\nmagnet–inductor-based power converters. IEEE Trans Energy \nConvers 28(4):880–893\n 19. Hilal A, Cougo B (2016) Optimal inductor design and material \nselection for high power density inverters used in aircraft appli-\ncations. In: International conference on electrical systems for \naircraft, railway, ship propulsion and road vehicles & interna -\ntional transportation electrification conference (ESARS-ITEC)\n 20. Burkart RM, Kolar JW (2017) Comparative η–ρ–σ Pareto opti-\nmization of Si and SiC multilevel dual-active-bridge topolo-\ngies with wide input voltage range. IEEE Trans Power Electron \n32(7):5258–5270\n 21. Andersen TM, Krismer F, Kolar JW, Toifl T, Menolfi C, Kull \nL, Morf T, Kossel M, Brändli M, Francese PA (2017) Modeling \nand Pareto optimization of on-chip switched capacitor convert-\ners. IEEE Trans Power Electron 32(1):363–377\n 22. Mejbri H, Ammous K, Abid S, Morel H, Ammous A (2014) Bi-\nobjective sizing optimization of power converter using genetic \nalgorithms application to photovoltaic systems. Int J Comput \nMath Electr Electron Eng 33(1/2):398–422\n 23. Barg S, Ammous K, Mejbri H, Ammous A (2017) An improved \nempirical formulation for magnetic core losses estimation \nunder nonsinusoidal induction. IEEE Trans Power Electron \n32(3):2146–2154\n 24. Reinert J, Brockmeyer A, De Doncker RW (2001) Calculation of \nlosses in ferro- and ferrimagnetic materials based on the modified \nSteinmetz equation. IEEE Trans Ind Appl 37(4):1055–1061\n 25. Li J, Abdallah T, Sullivan C (2001) Improved calculation of core \nloss with nonsinusoidal waveforms. In: IEEE industry applications \nsociety annual meeting, pp 2203–2210\n 26. Li J. Abdallah T, Sullivan C (2002) Accurate prediction of fer -\nrite core loss with nonsinusoidal waveforms using only Steinmetz \nparameters. In: IEEE workshop on computers in power electronics\n 27. Mühlethaler J, Bielay J, Kolar JW, Ecklebez A (2012) Improved \ncore loss calculation for magnetic components employed in power \nelectronic systems. IEEE Trans Power Electron 27(2):964–973\n 28. Shen W, Wang F, Boroyevich D, Tipton C (2008) Loss char -\nacterization and calculation of nanocrystalline cores for high-\nfrequency magnetics applications. IEEE Trans Power Electron \n23(1):475–484\n 29. Dowell PL (1966) Effects of eddy currents in transformer wind-\nings. Proc IEEE 113(8):1387–1394\n 30. Ferreira JA (1994) Improved analytical modeling of conduc-\ntive losses in magnetic components. IEEE Trans Power Electron \n9(1):127–131\n 31. Nan X, Sullivan CR (2003) An improved calculation of proximity-\neffect loss in high-frequency windings of round conductors. In: \nIEEE\n 32. Nan X, Sullivan CR (2004) Simplified high-accuracy calculation \nof eddy-current losses in round-wire windings. In: IEEE power \nelectron specialists conference\n 33. Erickson RW (2000) Fundamentals of power electronics. Colo-\nrado Power Electronics Center University of Colorado, Boulder \nUpdated May 21\n 34. Maniktala S (2013) Switching power supply design and optimiza-\ntion (chapter 12). McGraw-Hill, New York\n 35. Microsemi (2013) Forward and flyback core selection using the \nLX7309 and industry recommendations, Technical Note\n 36. Texas Instruments, Magnetics design handbook: power trans-\nformer design, power.ti.com/seminars\n 37. Barg S, Alahdal A, Ammous K, Mejbri H, Ammous A (2016) \nOptimum design approach of high frequency transformer. In: \nAsia-Pacific international symposium on electromagnetic com-\npatibility (APEMC)\n 38. Nanakos AC, Tatakis EC, Papanikolaou NP (2012) A weighted-\nefficiency-oriented design methodology of flyback inverter \nfor ac photovoltaic modules. IEEE Trans Power Electron \n27(7):3221–3233\n 39. Texas Instruments, 120-V AC, 200-W, 90% efficiency, interleaved \nflyback for battery charging applications reference design. www.\nti.com\n 40. ON Semicondcutor, 200 W, Single Output Power Supply, www.\nonsem i.com\n 41. Vartak C, Abramovitz A, Smedley KM (2014) Analysis and \ndesign of energy regenerative snubber for transformer isolated \nconverters. IEEE Trans Power Electron 29(11):6030–6040\n 42. Dimitrakakis GS, Tatakis EC (2009) High-frequency copper \nlosses in magnetic components with layered windings. IEEE Trans \nMagn 45(8):3187–3199\n 43. Handbook of chemistry and physics, HCP, 58th edition, p F-163\n 44. Epcos data book 2013, Ferrite and accessories. www.epcos .com\n 45. Magnetics, Ferrite cores. www.mag-inc.com\n 46. Magnetics, Powder cores. www.mag-inc.com\n 47. Ferroxcube, Product selection guide 2013. www.ferro xcube .com\n 48. Finmet, EMC components\nPublisher’s Note Springer Nature remains neutral with regard to \njurisdictional claims in published maps and institutional affiliations.",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.6324251890182495
    },
    {
      "name": "Flyback transformer",
      "score": 0.6123603582382202
    },
    {
      "name": "Multi-objective optimization",
      "score": 0.6081936955451965
    },
    {
      "name": "Duty cycle",
      "score": 0.5533051490783691
    },
    {
      "name": "Mathematical optimization",
      "score": 0.5222383737564087
    },
    {
      "name": "Nonlinear system",
      "score": 0.48001474142074585
    },
    {
      "name": "Pareto principle",
      "score": 0.45761576294898987
    },
    {
      "name": "Nonlinear programming",
      "score": 0.4527684450149536
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.4388185441493988
    },
    {
      "name": "Optimization problem",
      "score": 0.4224499464035034
    },
    {
      "name": "Volume (thermodynamics)",
      "score": 0.41981497406959534
    },
    {
      "name": "Engineering",
      "score": 0.37609824538230896
    },
    {
      "name": "Electronic engineering",
      "score": 0.3560068607330322
    },
    {
      "name": "Computer science",
      "score": 0.33208298683166504
    },
    {
      "name": "Voltage",
      "score": 0.30940258502960205
    },
    {
      "name": "Mathematics",
      "score": 0.28428852558135986
    },
    {
      "name": "Electrical engineering",
      "score": 0.13061419129371643
    },
    {
      "name": "Physics",
      "score": 0.08022424578666687
    },
    {
      "name": "Control (management)",
      "score": 0.0
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    },
    {
      "name": "Artificial intelligence",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I56475706",
      "name": "Mid Sweden University",
      "country": "SE"
    }
  ]
}