{
    "title": "Thermal error compensation in CNC machine tools using measurement technologies",
    "url": "https://openalex.org/W2989920668",
    "year": 2019,
    "authors": [
        {
            "id": "https://openalex.org/A2071920463",
            "name": "A. N. Polyakov",
            "affiliations": [
                "Orenburg State University"
            ]
        },
        {
            "id": "https://openalex.org/A2128058724",
            "name": "I. V. Parfenov",
            "affiliations": [
                "Orenburg State University"
            ]
        },
        {
            "id": "https://openalex.org/A2071920463",
            "name": "A. N. Polyakov",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2128058724",
            "name": "I. V. Parfenov",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W6724271429",
        "https://openalex.org/W2063088346",
        "https://openalex.org/W2310317449",
        "https://openalex.org/W2742095648",
        "https://openalex.org/W2556287423",
        "https://openalex.org/W2890279520",
        "https://openalex.org/W2036977187",
        "https://openalex.org/W2088675379",
        "https://openalex.org/W2565154232",
        "https://openalex.org/W2042507770",
        "https://openalex.org/W2061402329",
        "https://openalex.org/W2036251009",
        "https://openalex.org/W1977077940",
        "https://openalex.org/W2002480829",
        "https://openalex.org/W2029997362",
        "https://openalex.org/W2130315941",
        "https://openalex.org/W2809949023",
        "https://openalex.org/W2500250399"
    ],
    "abstract": "Abstract The required machining accuracy can be realized by compensating the thermal error of the machine tool. The paper presents a method of constructing a system of compensation for the thermal error of the machine tool. The method is based on the part measurement system installed on the machine. A review of studies in the field of precision machining was conducted. The review showed that the methods of correction of machining errors caused by dynamic and static factors using OMM-technology (On Machine Measurement) is presented in the literature. At the same time, the methods of compensation of the thermal error of machine tool built on the use of OMM-technology are poorly represented. Therefore, the practical implementation of control algorithms of the working bodies of the machine allowing one to compensate for its thermal error using OMM-technology is in demand. The methodology contains seven main stages, methodologically covering four areas of research. In addition to the experimental, mathematical and measurement areas of research, they also distinguish the area of software development (preparation of NC programs for CNC machines). It is proved that the presented methodology allows one to develop own automated system of compensation of a thermal error for any machine tool. It is shown that the most important directions of the framework for the improvement of the effectiveness of such system are to ensure the completeness of the experimental base and the accuracy of the adjustment of the thermal error compensation algorithms of the machine tool.",
    "full_text": null
}