{
  "title": "A Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With Power Electronic Transformer",
  "url": "https://openalex.org/W2981487005",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A5101939208",
      "name": "Lei Dong",
      "affiliations": [
        "North China Electric Power University"
      ]
    },
    {
      "id": "https://openalex.org/A5100756388",
      "name": "Tao Zhang",
      "affiliations": [
        "North China Electric Power University"
      ]
    },
    {
      "id": "https://openalex.org/A5100960504",
      "name": "Tianjiao Pu",
      "affiliations": [
        "China Electric Power Research Institute",
        "North China Electric Power University"
      ]
    },
    {
      "id": "https://openalex.org/A5049806536",
      "name": "Naishi Chen",
      "affiliations": [
        "China Electric Power Research Institute",
        "North China Electric Power University"
      ]
    },
    {
      "id": "https://openalex.org/A5100321734",
      "name": "Yingyun Sun",
      "affiliations": [
        "North China Electric Power University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2536826432",
    "https://openalex.org/W2146790143",
    "https://openalex.org/W2285686016",
    "https://openalex.org/W2011393317",
    "https://openalex.org/W2614995925",
    "https://openalex.org/W2029075710",
    "https://openalex.org/W2151795203",
    "https://openalex.org/W2589898154",
    "https://openalex.org/W2157110120",
    "https://openalex.org/W2528969357",
    "https://openalex.org/W2770876975",
    "https://openalex.org/W1991053377",
    "https://openalex.org/W2621637440",
    "https://openalex.org/W2782876185",
    "https://openalex.org/W2072107584",
    "https://openalex.org/W2803590724",
    "https://openalex.org/W2508744910",
    "https://openalex.org/W2743413514",
    "https://openalex.org/W2952022136",
    "https://openalex.org/W2742717540",
    "https://openalex.org/W2320346668",
    "https://openalex.org/W2608703863",
    "https://openalex.org/W2326874813",
    "https://openalex.org/W1995029496",
    "https://openalex.org/W2787445098",
    "https://openalex.org/W2514119088",
    "https://openalex.org/W2562166267",
    "https://openalex.org/W2156866471",
    "https://openalex.org/W2080315331",
    "https://openalex.org/W2005099607",
    "https://openalex.org/W2079894633",
    "https://openalex.org/W1994440383",
    "https://openalex.org/W2311260476",
    "https://openalex.org/W2609397731",
    "https://openalex.org/W2781022622",
    "https://openalex.org/W2789281204",
    "https://openalex.org/W2898116035",
    "https://openalex.org/W1970816228",
    "https://openalex.org/W2590053116",
    "https://openalex.org/W2921686909",
    "https://openalex.org/W2619336812",
    "https://openalex.org/W2909991675",
    "https://openalex.org/W2286895476",
    "https://openalex.org/W1976852391",
    "https://openalex.org/W6656237320",
    "https://openalex.org/W2744051429",
    "https://openalex.org/W6641850113",
    "https://openalex.org/W2612226230",
    "https://openalex.org/W2137975885",
    "https://openalex.org/W1964759724",
    "https://openalex.org/W1999302015",
    "https://openalex.org/W2783972781",
    "https://openalex.org/W2023823900",
    "https://openalex.org/W2809249143",
    "https://openalex.org/W1966390776",
    "https://openalex.org/W3104243370"
  ],
  "abstract": "In the AC/DC hybrid microgrids equipped with power electronic transformer (PET), different AC grids and DC grids are connected through multiport PET to operate the entire network in a secure and economic manner. This paper proposes a decentralized optimal power flow model, considering the multiport coordinated control strategy of PET, for running autonomous AC/DC hybrid microgrids. To optimize the power flow in the network, the steady state model of PET is established, including voltage source converter power injection model and Kriging model. By introducing a secondary droop control layer can realize the autonomous operation of AC/DC hybrid microgrids and increase the utilization efficiency of distributed generations. Then using the analytical target cascading approach, each AC/DC sub-microgrid is regarded as different autonomous subjects. The distributed PET is as power coupling node and information interaction node to decompose the optimal problem of AC/DC hybrid microgrids equipped with PET which is solved in parallel. The obtained subproblems for these grid levels are solved with a nested solution process. The simulation results verify the correctness and effectiveness of the proposed model in this paper.",
  "full_text": "Received October 8, 2019, accepted October 18, 2019, date of publication October 24, 2019, date of current version November 11, 2019.\nDigital Object Identifier 10.1 109/ACCESS.2019.2949378\nA Decentralized Optimal Operation of\nAC/DC Hybrid Microgrids Equipped\nWith Power Electronic Transformer\nLEI DONG1, TAO ZHANG\n1, TIANJIAO PU2, NAISHI CHEN2, AND YINGYUN SUN\n1\n1State Key Laboratory of Alternate Electrical Power System with Renewable Energy Sources, North China Electric Power University, Beijing 102206, China\n2China Electric Power Research Institute, Beijing 100192, China\nCorresponding author: Tao Zhang (ztncepu639@126.com)\nThis work was supported in part by the National Key Research and Development Program of China under Grant 2017YFB0903300, and in\npart by the Beijing Natural Science Foundation under Grant 3161002.\nABSTRACT In the AC/DC hybrid microgrids equipped with power electronic transformer (PET), different\nAC grids and DC grids are connected through multiport PET to operate the entire network in a secure and\neconomic manner. This paper proposes a decentralized optimal power ﬂow model, considering the multiport\ncoordinated control strategy of PET, for running autonomous AC/DC hybrid microgrids. To optimize the\npower ﬂow in the network, the steady state model of PET is established, including voltage source converter\npower injection model and Kriging model. By introducing a secondary droop control layer can realize the\nautonomous operation of AC/DC hybrid microgrids and increase the utilization efﬁciency of distributed\ngenerations. Then using the analytical target cascading approach, each AC/DC sub-microgrid is regarded as\ndifferent autonomous subjects. The distributed PET is as power coupling node and information interaction\nnode to decompose the optimal problem of AC/DC hybrid microgrids equipped with PET which is solved\nin parallel. The obtained subproblems for these grid levels are solved with a nested solution process. The\nsimulation results verify the correctness and effectiveness of the proposed model in this paper.\nINDEX TERMS AC/DC hybrid microgrids, power electronic transformer, steady state model, autonomous\noperation, decentralized optimal power ﬂow.\nI. INTRODUCTION\nThe power electronic transformer (PET) is also called solid\nstate transformer (SST) or energy router [1], [2]. As the inter-\nface device between the distribution system and the electricity\nconsumers in future smart grid, the PET with the capability to\nactively manage the power has received widespread attention\n[3]–[5]. The AC/DC hybrid microgrids equipped with PET\nprovide a new method for the easy connection of the distribu-\ntion resources in a large scale.\nThe optimal power ﬂow (OPF) problem has great sig-\nniﬁcance to the optimization and operation of microgrids.\nTo optimize the power ﬂow in the network, the steady state\nmodel of PET should be established. It acts as the basic\nequation for the power ﬂow calculations and optimizations.\nHowever, there are few literatures have researched about it.\nRefer to Fig.1, the power ﬂow model of the energy router is\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Yanbo Chen\n.\nFIGURE 1. Configuration of the generalized PET.\nderived based on the circuit equations of the voltage source\nconverter (VSC) [6]. On this basis, the steady state model\nfor PET has been proposed with considering the power loss\ncharacterization of VSC, and it can be applied to the AC/DC\nhybrid microgrids [7]. Recent research has demonstrated that\nthe number of PET power conversion stage can be three-\nstage, four-stage, and ﬁve-stage [8]–[10]. Furthermore, PET\nhas a variety of circuit topologies, in which the low voltage\nAC and DC ports of mixed frequency modulation PET topol-\nogy coupled together [11]. Therefore, the PET steady state\nmodel based on Fig.1 suffers some open problems such as\n157946 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see http://creativecommons.org/licenses/by/4.0/VOLUME 7, 2019\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nthe lack of ability to consider different PET structures, which\nlimits its usefulness in practical applications.\nWith the intermittent and uncertain renewable energy\nincreasingly penetrates into the hybrid microgrids, great chal-\nlenges arise for system operators to keep the microgrids\nsafe and reliable. To manage the DGs in the multiport net-\nwork some existing literatures have studied various control\nstrategies such as master-slave control and droop control.\nCompared with master-slave control strategy, the droop con-\ntrol strategy, with no critical communication links among\nthe parallel-connected inverters, has been extensively imple-\nmented to operate DGs for sharing the powers of the load in\nautonomous [12].\nThe droop control strategy is proposed for power shar-\ning between AC/DC hybrid microgrids by the interlinking\nconverter [13]. However, these given strategies might not\nsatisfy different microgrid operational requirements, such as\naccurate power sharing in DGs, appropriate load sharing\namong different phases of AC microgrids etc. Notice that\nthe secondary control layer with low communication require-\nments is adopted to compensate frequency and voltage devi-\nations produced by conventional primary control [14]–[16].\nIt can attain more complex operational objectives, such as the\npower and voltage references of each phase set independently\nand adequate power supply on heavily loaded phases [17].\nAt present, research on the PET is mainly concentrated on its\ninner power electronic topology. An appropriate coordinated\ncontrol strategy for multiport PET can improve the opera-\ntion effect of AC/DC hybrid microgrids, which has not been\nresearched yet.\nOptimal operation strategy is of great importance to the\neconomic and safe operation of the microgrid. Plenty of\npublications have discussed the optimal operation in AC/DC\nhybrid microgrids in recent years, including robust optimiza-\ntion approach to address the uncertainties [18]–[20] and opti-\nmal scheduling strategy to make multi-source coordination\n[21], [22]. A few researches have investigated the solve\napproach in a hybrid AC/DC system, including traditional\nmathematical programming methods and the intelligent algo-\nrithms [23], [24]. However, these works usually solve the\noptimization problem in a centralized manner, whereas the\nidea of centralized control in the traditional power system will\nbecome impractical once the size of microgrids grows to a\ncertain extent. Because in a centralized control requires a very\nhigh communication capacity which can result in commu-\nnication bottlenecks [25]–[27]. Furthermore, the expanding\nnetwork scale will make it difﬁcult to solve the optimiza-\ntion problems efﬁciently [28]–[30]. Notice that the existing\ndecentralized operation models are usually applied in dis-\ntribution systems, multiple AC microgrid systems or their\nhybrid systems [31]–[33]. The AC/DC hybrid microgrids\nand its autonomous operation control strategy are not being\nconsidered.\nIn fact, the AC/DC hybrid microgrids equipped with PETs\ncan integrate DGs in a large scale. The distributed nature\nof AC/DC microgrid makes its optimal operation problem\nvery suitable to be solved in a decentralized manner. Fur-\nthermore, decentralized control for autonomous microgrids\ncan also satisfy the demand of decentralized autonomous\nand centralized coordinated scheduling mode in the future\npower grid [34]. Various decomposition solution techniques\nhave been proposed to solve the multi-area distribution net-\nworks optimal operation problem, including auxiliary prob-\nlem principle (APP) [35], alternating direction method of\nmultipliers (ADMM) [36], and analytical target cascading\n(ATC) [37]. However, considering AC/DC hybrid microgrids\nequipped with PET is a new form of distribution networks,\nits network topology and operation scheme are very different\nfrom conventional microgrids. To the best of our knowledge,\nthe decentralized optimization problem about it has not been\nfully researched.\nOn this basis, this paper proposes a decentralized optimal\npower ﬂow model for running autonomous AC/DC hybrid\nmicrogrids equipped with PET. ATC method provides a hier-\narchical structure with certain ﬂexibilities on the coordination\nof subproblems, which is suitable as the framework of decen-\ntralized operation scheme for the AC/DC hybrid microgrids\nequipped with PET.\nThe contributions of this paper include:\n• We proposed a Kriging model for multiport PET, which\nhas not been investigated yet. This power ﬂow model can\nbe applied to the low voltage AC/DC hybrid microgrids\nto optimize calculations.\n• The OPF model of AC/DC hybrid microgrids is pro-\nposed with considering the coordinated control strategy\nof PET ports and DGs. Facilitating an optimization of\nthe operating state of the hybrid microgrids via the coor-\ndination of DGs and PET.\n• Application of the ATC method to solve the OPF prob-\nlem of AC/DC hybrid microgrids with considering the\nautonomous operation strategy. The distributed PET is\nas power coupling node and information interaction\nnode to realize decentralized autonomous and central-\nized coordinated scheduling mode for multi-microgrids\nin a large scale.\nThe rest of this paper is organized as follows: Section II\noutlines the generalized steady state mathematical model of\nthe PET and derives the Kriging model. The OPF formulation\nwith the application of PET is proposed in Section III. The\ndecentralized optimal operation problem of hybrid micro-\ngrids is given in Section IV. Section V presented the simu-\nlation results, and the conclusions are listed in Section VI.\nII. STEADY STATE MODEL OF PET\nGenerally, the conﬁguration of the generalized PET is shown\nin Fig.1. The PET has multiple ports, including AC port and\nDC port, that could be connected to different AC grids and\nDC grids. Each port is made of a ﬂexible AC/DC or DC/DC\nconverter, and they are linked using a DC/DC transformer.\nIn the generalized conﬁguration of the PET, the active and\nreactive injection power of each AC port are expressed by\nPm\nac and Qm\nac, respectively, and the magnitude of the AC port\nVOLUME 7, 2019 157947\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nFIGURE 2. External performance equivalent model of PET.\nvoltage is expressed by Um\nac; the equivalent resistance and\nreactance of the AC/DC converter are expressed by Rm\nac and\nXm\nac, respectively. The active injection power and the voltage\nmagnitude of each DC port are expressed by Pn\ndc and Un\ndc,\nrespectively; the equivalent resistance of the DC/DC con-\nverter is expressed by Rn\ndc. m,n ={1,2,... }are the numbers\nof AC and DC port, respectively. The parameters on the AC\ngrid side and DC grid side, including the injection power and\nthe voltage, of each port can be independently controlled by\nthe ﬂexible VSC-based AC/DC and DC/DC converter.\nA. VSC POWER INJECTION MODEL\nThe current mathematical models for PET proposed in pub-\nlished literatures are the power ﬂow equation of the equiv-\nalent circuit of the AC/DC and DC/DC converter. However,\nthe research has demonstrated that using the modular mul-\ntilevel matrix converters technology the AC/AC converter\ncan replace the conventional AC/DC/AC converter to form\nAC port [38], [39]. Furthermore, the efﬁciency of the entire\nmicrogrids is improved by optimizing the power injection\nand the voltage magnitude of each port. Thus, the external\nperformance equivalent model of multiport PET, with consid-\nering the power loss characterization equation of the convert,\nis proposed in this paper.\nThe external performance equivalent model of multiport\nPET, improved from Fig.1, is shown in Fig.2. Without consid-\nering the power ﬂow equation of the VSC equivalent circuit,\nand it can be applied to a variety of PET topologies. The total\npower loss of PET is described by Ploss.\nThe active power balance equation of the multiport PET is\ndescribed as:\nm∑\ni=1\nPi\nac +\nn∑\nj=1\nPj\ndc −Ploss =0 (1)\nLoss model of the converter developed in this paper,\nincluding the switching losses and conduction losses of power\nelectronic devices, are written as a function of the phase\ncurrent magnitude. The overall converter losses can be split\nup into three aggregated loss components containing no load\nlosses, losses linearly and quadratically depending on the\nphase current [40], [41].\nPi,ϕ\nloss.ac =k0i +k1iIi.ϕ\nac +k2i(Ii,ϕ\nac )2 (2)\nPj\nloss.dc =k0j +k1jIj\ndc +k2j(Ij\ndc)2 (3)\nIi,ϕ\nac =\n√\n(Pi,ϕ\nac )2 +(Qi,ϕ\nac )2/Ui,ϕ\nac (4)\nIj\ndc =Pj\ndc/Uj\ndc (5)\nwhere Pi,ϕ\nloss.ac and Pj\nloss.dc represent the power loss of the\nPET AC and DC port, respectively; ϕ = {a,b,c}is the\nthree-phase system; k0,k1,k2 are the ﬁtting parameters of\nthe loss, the current of PET AC and DC port are expressed\nby Ii,ϕ\nac and Ij\ndc, respectively, and they are deﬁned by (4)\nand (5), respectively. Actually, the loss model of isolation\nDC/DC transformer, including the DC/AC converter losses\nand high frequency transformer losses, also can be written as\na function of the phase current magnitude [42], [43]. And the\nlow voltage AC/DC ports of PET are obtained from the low\nvoltage DC bus of DC/DC isolation transformer in general\n[4], [44], [45]. Thus, loss of isolation DC/DC transformer is\nadded to the high voltage AC port of PET in this paper.\nEquation (2), (3) shows the power loss characterization\nformulation of the PET AC and DC port, respectively. The\nloss of multiport PET is the sum of each port, which can be\ndeﬁned as:\nPloss =\nm∑\ni=1\nc∑\nϕ=a\nPi,ϕ\nloss.ac +\nn∑\nj=1\nPj\nloss.dc (6)\nIn summary, the VSC power injection model of the PET\ncan be formulated by using (1)-(6). However, notice that low\nvoltage AC and DC port of the mixed frequency modulation\nPET are coupled together. The above loss characterization\nformulation of the PET AC and DC port cannot be applied to\nit. Moreover, as the research continues to deepen, an increas-\ning number of PET topologies are proposed. This will make it\ndifﬁcult to describe the loss characterization of different PET\ntopologies with a certain formulation. Hence, the Kriging\nmodel is derived based on the VSC power injection model\nof PET in this paper.\nB. THE KRIGING MODEL\nThe power injection and voltage magnitude of each port as\nwell as the loss changes with the operation states for the\nPET, and there is a complicated function relationship between\nthem. It can be analyzed by the nonlinear ﬁtting method such\nas the Kriging model, which is suitable for the nonlinear\nproblem and has received extensive attention in published\nliteratures [46], [47]. A Kriging model predicts the response\nfunction y(x) is the linear weighting of known sample func-\ntion. It can be expressed by [48], [49]:\nˆy(x) =\nr∑\ni=1\nω(i)y(i) (7)\nwhere x is the unknown observation point parameters, ˆy(x)\nis the ﬁtting function, r is the number of known sampling\n157948 VOLUME 7, 2019\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nFIGURE 3. The Kriging equivalent process of PET.\npoints, ωis the weighting coefﬁcient, y is the response value\nof the known sampling points.\nTo calculate the weighting coefﬁcient, the Kriging model\nintroduces statistical assumptions and regards the unknown\nfunction as a gaussian stochastic process. This stochastic\nprocess is deﬁned as:\nY (x) =β0 +Z(x) (8)\nMSE[ˆy(x)] =E[(ωTY −Y (x))] (9)\nwhere β0 is an unknown constant, representing the mathe-\nmatical expectation of Y (x), Z(x) is a static random process\nwith the mean is 0 and the variance is σ2. On the gaussian\nstochastic process basis, the Kriging model can be obtained\nby minimizing the mean square error with the optimal weight-\ning coefﬁcient, as shown in (9).\nThe Kriging equivalent process of external characterization\nfor PET is shown in Fig.3. To establish the steady state model\nof multiport PET, large amount of sampling data related to\nloss should be obtained during operation. After that the ﬁtting\nformulation of loss function can be expressed as:\nPloss =f (Pϕ\nac,Qϕ\nac,Uϕ\nac,Pdc,Udc) (10)\nIt can be seen that the total loss of PET can be calcu-\nlated with known power injection and the voltage magnitude\nof each AC and DC port by the ﬁtting formulation. Equa-\ntion (10), together with (1), form the Kriging model of the\nPET, which is used as a basis in formulating the OPF model\nin the next section.\nThe established Kriging model of PET could be adapted to\na variety of PET topologies without being affected by changes\nof the loss characterization curve. Furthermore, it can also\nbe applied to three-phase asymmetric microgrid, which is\nconvenient for multiport PET to optimize and analyze. This\npaper adopts the DACE toolbox of MATLAB to construct the\nKriging model of PET.\nIII. OPF FORMULATION OF HYBRID MICROGRIDS\nIn the AC/DC hybrid microgrids equipped with PET, different\nAC grids and DC grids are connected through the multiport to\nform a network topology in a large scale [50], [2], as shown\nin Fig.4.\nUnder the normal condition, the operation goal of the\nAC/DC hybrid microgrids equipped with PET could be to\nminimize the operating cost. The PET is able to regulate\nthe network power ﬂow by setting the power injection and\nFIGURE 4. The structure of AC/DC microgrids with PET.\nvoltage of each port, compare with the conventional inter-\nlinking converter based microgrids, the PET provides extra\nﬂexibility in controlling the distribution. We note that the\npower injection for the port x,|,},~ of PET as well as the\nport x,y,z,{ connected to the AC/DC microgrids should be\nbalancing at any time. Therefore, an appropriate coordinated\ncontrol strategy for multiport PET to operate safely and stably\nof the hybrid microgrids is particularly important. At present,\nthe constant voltage control is adopted to keep the power\nbalance for a single PET, however it cannot apply to the\nhybrid networks contain multiple PETs, and which has not\nbeen studied yet.\nIn this section, an OPF model, with considering the coor-\ndinated control strategy for multiport PET, is presented.\nA. OBJECTIVE FUNCTION\nPET is composed of power electronic devices, which has\nhigher power loss than the conventional transformer. The\nmaximum efﬁciency of the PET in operation, proposed by\nthe North Carolina State University [51], was only 94%. Low\nefﬁciency is also one of the reasons that limit PET difﬁculty\nin large scale application. However, the PET can regulate\nnetwork power ﬂow to reduce the line power losses in the\ndistribution system. Therefore, an optimal operation model,\nwith considering the power loss of the network, is proposed\nto improve the utilization efﬁciency of PET and DGs. The\nobjective function can then be mathematically formulated as:\nmin f =Ploss.PET +Ploss.AC +Ploss.DC (11)\nwhere Ploss.PET is the power loss of the multiport PET;\nPloss.AC and Ploss.DC are the active power loss of AC micro-\ngrid and DC microgrid, respectively. In this paper, the loss of\nPET is shown in Section II and the loss of AC/DC microgrids\ncan be formulated by the difference between total generation\npower and sum of load power which is given by:\nPloss.AC =\n∑\nNac\nc∑\nϕ=a\nPϕ\nac +\n∑\nnac\nPac.dg −Pload.ac (12)\nPloss.DC =\n∑\nNdc\nPdc +\n∑\nndc\nPdc.dg −Pload.dc (13)\nwhere Nac and nac are the number of PET AC port and DGs in\nAC microgrid, respectively; Pac.dg is the power output of DGs\nVOLUME 7, 2019 157949\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nand the Pload.ac is the sum of load power in AC microgrid.\nNdc and ndc are the number of PET DC port and DGs in DC\nmicrogrid, respectively; Pdc.dg is the power output of DGs\nand the Pload.dc is the sum of load power in DC microgrid.\nB. CONSTRAINTS\nThis formulation is subject to the following constraints:\n1) POWER FLOW EQUATIONS\nPϕ\ni −\n⏐⏐Uϕ\ni\n⏐\n⏐\nM∑\nk=1\nc∑\nm=a\n⏐\n⏐Um\nk\n⏐\n⏐(Gϕm\nik cos θϕm\nik +Bϕm\nik sin θϕm\nik ) =0\n(14)\nQϕ\ni −\n⏐⏐Uϕ\ni\n⏐\n⏐\nM∑\nk=1\nc∑\nm=a\n⏐\n⏐Um\nk\n⏐\n⏐(Gϕm\nik sin θϕm\nik −Bϕm\nik cos θϕm\nik ) =0\n(15)\nPi −Uidc\nN∑\nj=1\nGijUjdc =0 (16)\nFor an unbalanced AC microgrid comprising M set of\nbuses, the phase active powers Pϕ\ni and reactive powers Qϕ\ni\ninjected at any phase of an arbitrarily selected bus i can\nbe given by (14) and (15), where Gϕm\nik ,Bϕm\nik are the bus\nadmittance matrix element’s conductivity and admittance,\nrespectively, θϕm\nik is the voltage phase angle. Meanwhile, for\na DC microgrid comprising N buses, the power Pi injected\nat any arbitrary bus i can be obtained by (16), where Uidc is\nthe DC bus i voltage, Gij is the conductance of the DC bus\nadmittance matrix.\n2) COORDINATED CONTROL EQUATIONS OF PET\nTo maintain power balance in a multiport network formed by\nseveral VSC stations, the master-slave control and droop con-\ntrol, have been investigated in current literatures. Compared\nwith the former, the droop control, without communication,\ncan operate DGs for sharing the powers of the load. This\nmakes the microgrid operate autonomously and increase the\nabsorption level of DGs. Furthermore, because the renewable\nenergy generation is intermittent and uncertain, all ﬂuctua-\ntions are caused by DGs or loads, result in the deviation of\nthe power, should be supplied by PET under the master-slave\ncontrol. Notice that the PET with an intermediate DC/DC link\nseparates the high and low voltage AC systems to operate\nat different frequencies. A coordinated control strategy for\nmultiport PET is proposed in this paper. The high voltage\nAC port of PET is connected with the main grid, and the\nfrequency is determined by it. Constant voltage control is\nadopted to provide power support for low voltage networks.\nThe low voltage AC/DC ports of PET are connected to the\nhybrid microgrids, and the droop control is adopted to operate\nautonomously.\nThe droop control characterization curve for AC and DC\nport of PET is shown in Fig.5. In this paper the secondary con-\ntrol layer with low communication requirements is adopted\nFIGURE 5. The droop control characterization curve.\nto attain more complex operational objectives. The droop\ncharacterization of PET AC port is obtained as:\nPϕ\nac =kp\npet(ω0 +δωϕ\npet −ω) (17)\nQϕ\nac =kq\npet(Uac\npet,0 +δUϕ\npet −Uϕ\nac) (18)\nkp\npet =ωmax −ωmin\nPac.max\n(19)\nkq\npet =Uac.max −Uac.min\nQac.max\n(20)\nwhere kp\npet and kq\npet are the active and reactive power droop\ncoefﬁcients, respectively, ω0 and ωare the PET AC port no\nload and output angular frequencies, respectively, ωmin,ωmax\nare the minimum and maximum permissible angular fre-\nquencies of AC microgrid, respectively, Uac\npet,0 and Uϕ\nac are\nthe PET AC port no load and output voltage, respectively,\nUac.min,Uac.max are the minimum and maximum permissible\nvoltage magnitude of AC port, respectively, δωϕ\npet and δUϕ\npet\nare the bias values that can be optimized, Pac.max,Qac.max\nare the maximum output active and reactive power of the\nPET AC port, respectively. Since the controller can bias the\nactive and reactive power references of each phase individ-\nually, the power can be set ﬂexibly which can improve the\nutilization efﬁciency of DGs.\nThe droop characterization of PET DC port is obtained as:\nPdc =kdc\npet(Udc\npet,0 +δUdc\npet −Udc) (21)\nkdc\npet =Udc.max −Udc.min\nPdc.max\n(22)\nwhere kdc\npet is the power droop coefﬁcients of DC port, Udc\npet,0\nand Udc are the PET DC port no load and output voltage,\nrespectively, Udc.min,Udc.max are the minimum and maxi-\nmum permissible voltage of DC port, respectively, δUdc\npet is\nthe bias values, Pdc.max is the maximum output power of the\nDC port.\n3) DROOP CONTROL EQUATIONS OF DGS\nThe DGs in the AC/DC microgrid that controlled by power\nelectronics converters are all adopted droop control strategy\nto make the sub-microgrid operate autonomously. They can\nbe described as:\nPac.dg =\nc∑\nϕ=a\nPϕ\nac.dg =kp\nac(ω0 +δωac −ω) (23)\n157950 VOLUME 7, 2019\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nQac.dg =\nc∑\nϕ=a\nQϕ\nac.dg =kq\nac(Uac,0 +δUac −Uac.dg) (24)\nPdc.dg =kdc(Udc,0 +δUdc −Udc.dg) (25)\nwhere δωac,δUac are the frequency and voltage bias values\nof DGs in AC microgrid that can be optimized, respectively;\nUac,0,Uac,dg are the AC DGs bus no load and output voltage,\nrespectively; δUdc is the voltage bias values of DGs in DC\nmicrogrid that can be optimized; Udc,0,Udc,dg are the DC\nDGs bus no load and output voltage, respectively.\nUa\nac.dg =Ub\nac.dg =Uc\nac.dg (26)\nGenerally, the three-phase voltages at the DG bus are\nstrictly balanced by employing negative sequence compen-\nsators. Therefore, the output power of DGs in AC microgrid\nis the three-phase total power Pac.dg, Qac.dg. The droop coef-\nﬁcients kp\nac,kq\nac,kdc of DGs are obtained as:\nkp\nac =ωmax −ωmin\nPmax\nac.dg\n(27)\nkq\nac =\nUmax\nac.dg −Umin\nac.dg\nQmax\nac.dg\n(28)\nkdc =\nUmax\ndc.dg −Umin\ndc.dg\nPmax\ndc.dg\n(29)\nwhere Pmax\nac.dg,Qmax\nac.dg are the maximum output active and\nreactive power of the DGs in AC microgrid, respectively;\nUmax\nac.dg,Umin\nac.dg are the maximum and minimum of the AC DGs\nbus output voltage, respectively; Pmax\ndc.dg is the maximum out-\nput active power of the DGs in DC microgrid; Umax\ndc.dg,Umin\ndc.dg\nare the maximum and minimum of the DC DGs bus output\nvoltage, respectively.\n4) INEQUALITY EQUATION\nThe problem must satisfy the set of (30)-(35), which describe\nthe AC/DC bus voltages, DGs output power for both AC/DC\nmicrogrid and the AC microgrid frequency as inequality\nconstraints.\nUϕ\ni.min ≤Uϕ\ni ≤Uϕ\ni.max (30)\nUidc.min ≤Uidc ≤Uidc.max (31)\nPmin\nac.dg ≤Pac.dg ≤Pmax\nac.dg (32)\nQmin\nac.dg ≤Qac.dg ≤Qmax\nac.dg (33)\nPmin\ndc.dg ≤Pdc.dg ≤Pmax\ndc.dg (34)\nωmin ≤ω≤ωmax (35)\nwhere Uϕ\ni.max,Uϕ\ni.min are the maximum and minimum of the\nAC nodes, respectively; Uidc.max,Uidc.min are the maximum\nand minimum of the DC nodes, respectively; Pmax\nac.dg,Pmin\nac.dg\nare the maximum and minimum of the DGs active power\noutput in AC network, respectively; Qmax\nac.dg,Qmin\nac.dg are the\nmaximum and minimum of the DGs reactive power output\nin AC network, respectively; Pmax\ndc.dg,Pmin\ndc.dg are the maximum\nFIGURE 6. ATC top-down and bottom-up process.\nand minimum of the DGs active power output in DC network,\nrespectively; ωmax,ωmin are the maximum and minimum of\nthe frequency, respectively.\nMoreover, the output power for both AC and DC port\nof PET should be accounted for by inequality constraints\nrepresented by:\nPϕ\nac.min ≤Pϕ\nac ≤Pϕ\nac.max (36)√\n(Pϕ\nac)2 +(Qϕ\nac)2 ≤Sϕ\nac (37)\nPdc.min ≤Pdc ≤Pdc.max (38)\nwhere Pϕ\nac.max,Pϕ\nac.min are the maximum and minimum of\nthe active power output of PET AC port, respectively; Sϕ\nac is\nthe power capacity of PET AC port; Pdc.max,Pdc.min are the\nmaximum and minimum of the active power output of PET\nDC port, respectively.\nThe overall OPF formulation is discussed above. To solve\nit, a decentralized optimization algorithm can be adopted to\nsatisfy the demand of decentralized autonomous and cen-\ntralized coordinated scheduling mode in the future power\ngrid.\nIV. FORMULATION OF DECENTRALIZED PROBLEM\nA. GENERAL DESCRIPTION OF ATC METHOD\nIn this section, a hierarchical architecture to solve decentral-\nized OPF in AC/DC hybrid microgrids equipped with PET\nvia ATC is proposed in which the centralized network is split\ninto sub-networks including the AC grid, DC grid, and PET.\nFig.6 shows the ATC top-down and bottom-up target and\nresponse iterative process.\nThe design target problem is partitioned into a hierarchical\nset of sub-problems associated with the systems, subsystems,\nand components. Given the initial values of targets from com-\nponents, the subsystems run OPF and determine responses for\nthe components. Then, given the responses from subsystems\nand targets from systems, the components run OPF to assign\ntargets for subsystems and responses to systems. Finally,\nusing responses from components the systems run OPF to\ndetermine targets for components. The iterative process is\nrepeated until targets and responses converge for all the sub-\nnetworks [52].\nVOLUME 7, 2019 157951\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nFIGURE 7. The target and response variables of hybrid grids.\nB. PET SUBPROBLEM\nThe two-hierarchy of AC/DC hybrid microgrids equipped\nwith PET is illustrated in Fig.7 to clearly show the optimize\nvariables in the proposed OPF model.\nAs shown in Fig.7, the Ypet, Yac and Ydc are the local vari-\nables of subproblem PET, AC microgrid, and DC microgrid,\nrespectively, the coupling variables [P ϕ\nac,Qϕ\nac,Uϕ\nac,Pdc,Udc]\nare decomposed into target variables ηac,ηdc and response\nvariables µac,µdc,and a set of consistency constraints are\ndescribed as:\nc =η−µ=0 (39)\nWe relax the consistency constraints in the objective func-\ntion using a penalty term. Now the optimization objective of\nthe PET subproblem is formulated as:\nmin fPET\n=f (Pϕ\npet.ac,Qϕ\npet.ac,Uϕ\npet.ac,Ppet.dc,Upet.dc)\n+vp\npet\n(\nPϕ\npet.ac −Pϕ\nac.pet\n)\n+\n(\nwp\npet\n(\nPϕ\npet.ac −Pϕ\nac.pet\n))2\n+vq\npet\n(\nQϕ\npet.ac −Qϕ\nac.pet\n)\n+\n(\nwq\npet\n(\nQϕ\npet.ac −Qϕ\nac.pet\n))2\n+vpet\n(\nPpet.dc −Pdc.pet\n)\n+\n(\nwpet\n(\nPpet.dc −Pdc.pet\n))2\n+vu.ac\npet\n(\nUϕ\npet.ac −Uϕ\nac.pet\n)\n+\n(\nwu.ac\npet\n(\nUϕ\npet.ac −Uϕ\nac.pet\n))2\n+vu.dc\npet\n(\nUpet.dc −Udc.pet\n)\n+\n(\nwu.dc\npet\n(\nUpet.dc −Udc.pet\n))2\n(40)\nwhere, the target variables Pϕ\npet.ac,Qϕ\npet.ac,\nUϕ\npet.ac,Ppet.dc,Upet.dc are the optimization variables and the\nresponse variables Pϕ\nac.pet,Qϕ\nac.pet,Uϕ\nac.pet,Pdc.pet,Udc.pet are\nthe constant variables. v is the vector of Lagrangian multipli-\ners, and w is the vectors of penalty weight. The equality con-\nstraints including (1) and the inequality constraints including\n(36)-(38).\nC. AC/DC MICROGRID SUBPROBLEM\nThe AC and DC microgrids exchange power with the multi-\nport PET, and the optimization objective can be formulated\nas:\nThe AC sub-problem\nmin fAC\n=\n∑\nNac\nc∑\nϕ=a\nPϕ\nac +\n∑\nnac\nPac.dg −Pload.ac\nvp\nac\n(\nPϕ\npet.ac −Pϕ\nac.pet\n)\n+\n(\nwp\nac\n(\nPϕ\npet.ac −Pϕ\nac.pet\n))2\n+vq\nac\n(\nQϕ\npet.ac −Qϕ\nac.pet\n)\n+\n(\nwq\nac\n(\nQϕ\npet.ac −Qϕ\nac.pet\n))2\n+vu\nac\n(\nUϕ\npet.ac −Uϕ\nac.pet\n)\n+\n(\nwu\nac\n(\nUϕ\npet.ac −Uϕ\nac.pet\n))2\n(41)\nNote that the target variables Pϕ\npet.ac,Qϕ\npet.ac,Uϕ\npet.ac\nis the constant variables and the response variables\nPϕ\nac.pet,Qϕ\nac.pet,Uϕ\nac.pet is the optimize variables here. The\nequality constraints include (14), (15), (17)-(20), (23), (24),\n(26)-(28) and the inequality constraints include (30), (32),\n(33), (35).\nThe DC sub-problem\nmin fDC\n=\n∑\nNdc\nPdc +\n∑\nndc\nPdc.dg −Pload.dc\n+vdc\n(\nPpet.dc −Pdc.pet\n)\n+\n(\nwdc\n(\nPpet.dc −Pdc.pet\n))2\n+vu\ndc\n(\nUpet.dc −Udc.pet\n)\n+\n(\nwu\ndc\n(\nUpet.dc −Udc.pet\n))2\n(42)\nAs mentioned, the target variables Ppet.dc,Upet.dc is the\nconstant variables and the response variables Pdc.pet,Udc.pet\nis the optimize variables in the DC sub-problem. And the\nequality constraints are the (16), (21), (22), (25), (29). The\ninequality constraints are the (31), (34).\nD. DECENTRALIZED SOLUTION PROCEDURE\nA nest solution process which consists of an inner loop and an\nouter loop is adopted to solve the decentralized OPF problem\nis shown in Fig.8 [53]. Note that as there is no direct links\nbetween AC and DC microgrid, their optimization problems\ncan be solved in parallel.\nThe process is explained as follows:\nStep 1: Set the iteration indexes ko,kI = 0. Given the\ninitial values for the penalty parameters vko ,wko and the target\nvariables ηkI\nac,ηkI\ndc.\nStep 2: Update kI = kI +1. Solve the AC and DC\nmicrogrid sub-problem with response variables µkI\nac,µkI\ndc as\noptimize variables and the target variables ηkI−1\nac ,ηkI−1\ndc from\nthe previous iteration.\nStep 3:Solve the PET sub-problem with target variables\nηkI\nac,ηkI\ndc as optimize variables and response variables from\nµkI\nac,µkI\ndc step 2. The solution process of subproblem is shown\nin Fig.9.\nStep 4:Check the inner loop convergence criterion (43).\nIf satisﬁed, go to step 5; otherwise, return to step 2. The\nf kI ,f kI−1 are the objective functions between two consecutive\ninner loop iterations and the ε1 is the predeﬁned tolerance.\n⏐⏐\n⏐f kI −f kI−1\n⏐\n⏐\n⏐≤ε1 (43)\nStep 5:Check the output loop convergence criterion (44),\n(45). If it is satisﬁed, the optimal solution is obtained and\n157952 VOLUME 7, 2019\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nFIGURE 8. The decentralized solution process.\nFIGURE 9. The solution process of PET subproblem.\niteration is stopped; otherwise, go to step 6.\ncko\n≤ε2 (44)\n\ncko −cko−1\n≤ε3 (45)\nStep 6:Set ko =ko +1. Update the values of the penalty\nfunction parameters according to:\nvko+1 =vko +2 ∗wko ◦wko ◦cko (46)\nwko+1 =\n{\nβwko ,\ncko\n≥γ\n\ncko−1\n\n\nwko ,\ncko\n\n≤γ\n\ncko−1\n\n (47)\nwhere, β,γ are the constant, and ‘‘◦’’ represents the\nHadamard product.\nV. SIMULATION RESULTS\nIn this section, an AC/DC hybrid microgrids equipped with\nPET system is used to investigate to test the effectiveness\nof the proposed operation approach. The MATLAB 2017a\nsoftware with YALMIP toolbox is employed and all testing\ncases in this paper are run on a PC with Intel(R) Core(TM)\ni7-8550CPU @1.8GHz with 8GB RAM.\nFIGURE 10. The simulation system of hybrid microgrids.\nFIGURE 11. The simulation results of the Kriging model.\nA. HYBRID MICROGRIDS SYSTEM\nFig.10 shows the test AC/DC hybrid microgrids equipped\nwith PET where the 380V unbalanced AC 24-bus grid and\nthe 750V DC 10-bus grid are connected through the PET. The\nhigh voltage AC port of PET is connected to the main grid and\nprovides power support for low voltage AC/DC microgrids.\nThe impedance of the line conductor of each phase in AC\nmicrogrid is Z1 =(0.240 +0.077j)/km, and the resistance\nof the line conductor in DC microgrid is R1 =0.0754/km.\nThe total loads of the AC and DC grid are Sac =(1.547 +\n0.805j)MV A and Pdc =0.47 WM, respectively. As shown\nin Table 1 and Table 2.\nIn this paper the no load voltage Udc\npet,0,Uac,0 = 1.05\nand Udc,0 = 1.02, no load angular frequency ω0 =\n1.004pu. The permissible voltage of AC and DC micro-\ngrid are [0.95, 1.05]pu and [0.95, 1.02]pu, respectively. The\nVOLUME 7, 2019 157953\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nTABLE 1. The load of unbalanced AC microgrid (kW, kVar).\nFIGURE 12. The power loss in different networks.\nTABLE 2. The load of DC microgrid (kW).\npermissible angular frequency is [0.996,1.004]pu. The initial\nvalues of the target variables are all set as 0. The penalty\nparameters are set as v0 = 0, w0 = 0.3, β = 1.3 and\nγ =0.25. The ﬁtting parameters of the loss k0 =0.001,\nk1 =0.005 and k2 =0.02. The permissible output power of\nPET and DGs are listed in Table 3.\nB. EFFECTIVENESS ANALYSIS OF PET KRIGING MODEL\nAt present, the research on the PET is still in the labora-\ntory stage, and it has not been applied to the distribution\nFIGURE 13. The results of Kriging model with variable parameters.\nFIGURE 14. The output active power of DGs in AC/DC microgrids.\nTABLE 3. The permissible output power of PET and DGs (kW, kVar).\nnetwork to operate. In this paper the proposed Kriging model\nis compared with the VSC power injection model of multiport\nPET, in order to validate its effectiveness. Large amount of\nsampling data {x,y} =\n{\n(Pϕ\nac,Qϕ\nac,Uϕ\nac,Pdc,Udc),(Ploss)\n}\n157954 VOLUME 7, 2019\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nFIGURE 15. The coupling variables changes process.\ncan be obtained by Monte-Carlo method according to the\n(1)-(6). On this basis, the simulation results of the steady state\nmodel are as follows:\nThe 100 test points have been selected randomly to\ncompare the Kriging model with the VSC power injec-\ntion model. The results are shown in Fig.11, where the\nhorizontal coordinate-axis X is the sampling data x =\n(Pϕ\nac,Qϕ\nac,Uϕ\nac,Pdc,Udc), and the vertical coordinate-axis Y\nis the power loss of PET y =Ploss. We observed that the\nsimulation results of the Kriging model agree with the VSC\npower injection model. The average error between them,\nshow in Fig.11(b), is only 0.39%. This shows that the pro-\nposed Kriging model has good ﬁtting accuracy to the loss\ncharacterization formulation which is a quadratic function.\nFor the more complex loss characterization functions, con-\nsidering the quadratic ﬁtting parameters is not a constant\nduring the operation. The power loss curve of AC micro-\ngrid, DC microgrid, and PET varying with the quadratic\nﬁtting parameters is shown in Fig.12. Losses in different net-\nworks increase as the quadratic ﬁtting parameters increase.\nVOLUME 7, 2019 157955\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nFIGURE 16. The AC/DC hybrid microgrids with more PETs and DGs.\nTABLE 4. The power loss of AC/DC hybrid microgrids (kW).\nHowever, the ﬁtting parameters have different effects on the\nsubgrid. Furthermore, the variable ﬁtting parameters mean\nthat the steady state model formulation of PET is a piece-\nwise function, which is difﬁcult to solve. We assumed that\nwhen the transmission power of PET is more than 0.4pu, the\nquadratic ﬁtting parameters of the loss changes from 0.018 to\n0.02. The results of Kriging model are as follows:\nAs shown in Fig.13, the Kriging model still has good\nﬁtting accuracy, with only 2.6% average error, to the complex\nloss characterization functions. Therefore, the steady state\nmodel, Kriging model, proposed in this paper can apply to\ndifferent topologies PET with various loss characterization.\nThe Kriging model of PET can be established as long as\nthere is large amount of sampling data, which is convenient\nto optimize and analyze.\nC. ANALYSIS OF COORDINATED CONTROL STRATEGY\nThe secondary control layer with low communication\nrequirements can attain more complex operational objectives.\nThe results are shown as follows:\nFig.14 shows the output active power of DGs in AC/DC\nmicrogrids. Case1, the DGs in AC/DC microgrids and the\nAC/DC ports of PET are all without secondary control layer.\nCase 2, the DGs in AC/DC microgrids without secondary\ncontrol layer and the AC/DC ports of PET with secondary\ncontrol layer. Case 3, the DGs in AC/DC microgrids and the\nAC/DC ports of PET are all with secondary control layer. It is\nworth mentioning that the secondary control layer can satisfy\nthe power interaction needs by moving the droop curves.\nBy introducing the secondary droop control layer, the output\npower of DGs in AC/DC microgrids in case3 is more than\n32.7% that in case1.\nThe power loss of AC/DC hybrid microgrids equipped\nwith PET is shown in Table 4. We observed that improving\nthe utilization efﬁciency of DGs in AC/DC microgrids helps\nto reduce the power loss. Therefore, the loss of the hybrid\nmicrogrid is 94kW in case 3, which is the lowest.\nTABLE 5. Results of variables in decentralized and centralized OPF.\nD. RESULT OF THE ATC APPROACH\nFig.15 (a)-(e) shows the coupling variables between PET and\nAC/DC hybrid microgrids in each outer loop. It can be seen\nthat the target variables and response variables converge to\nthe same operating point after 9 iterations. The case system\nin this paper contains 2 PETs with 22 coupling variables. The\nsimulation results show that the ATC algorithm has good con-\nvergence to AC/DC hybrid microgrids equipped with PET,\nwhich can be applied to the large-scale networks with large\namounts of renewable energy.\nThe results of the decentralized approach and centralized\napproach are shown in Table 5. In scenario 1, PET adopts\nVSC power injection model and the AC/DC hybrid micro-\ngrids equipped with PET adopts centralized OPF. In sce-\nnario 2, PET adopts VSC power injection model and the\nAC/DC hybrid microgrids equipped with PET adopts decen-\ntralized OPF. In scenario 3, PET adopts Kriging model and\nthe AC/DC hybrid microgrids equipped with PET adopts\ndecentralized OPF.\nTable 5 shows the loss of AC, DC, and PET subgrid,\naverage output power of DGs in AC/DC microgrid, frequency\nof AC microgrid and output power of PET AC/DC port.\nWe observed that the results are very close among three\nscenarios. These results show the effectiveness of the decen-\ntralized approach.\nE. AC/DC HYBRID MICROGRIDS WITH MORE PETS AND\nDGS IN A LARGE SCALE\nIn order to verify the method proposed in this paper can be\napplied to systems with different number of PET ports and\nDGs, the AC/DC hybrid microgrids simulation with more\nPETs and DGs in a large scale is analyzed here. In fact,\nthe research on the PET is still in the laboratory, and there is\ncurrently no actual operating system or demonstration project\nfor AC/DC hybrid microgrids equipped with PET. Therefore,\nthe simulation case based on the structure of Fig.4 is shown\nas follows:\nAs shown in Fig.16, the AC/DC hybrid microgrids consists\nof 4 multiple PETs and 8 sub-microgrids, where the 380V AC\nmicrogrid, 750V DC microgrid and 1500V DC microgrid are\nconnected through the 4-port PET to integrate DGs in a large\nscale. The simulation results are shown as follows:\nThe coupling variables, including the voltage, active power\nof 8 DC ports and the voltage, active power and reactive\npower of 4 AC ports, between PET and AC/DC microgrid\nin each outer loop iteration are shown as Fig.17 (a)-(e).\nIt is obvious that all target variables and response variables\n157956 VOLUME 7, 2019\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nFIGURE 17. The optimization results of multiple microgrids network.\nconverge to the same operating point after 8 iterations. This\nshows that the method proposed in this paper can be applied\nto the microgrid system with more PETs and DGs. It provides\nideas for the decentralized optimization operation of the new\nnetwork structure of AC/DC hybrid autonomous microgrids\nequipped with PET to consume renewable energy in a large\nscale.\nActually, the AC/DC hybrid microgrid with multiport\nPET is conducive to the integration of distributed renewable\nenergy sources in a large scale. Compared with the\ncentralized optimization approach the subnet in decen-\ntralized optimization approach can be optimized indepen-\ndently without communication bottlenecks. It will improve\nthe stability of the hybrid system. The different sub-\nnets are coupled together through multiport PET, decen-\ntralized algorithm requires more iterations in order to\nobtain the optimum. However, the AC and DC micro-\ngrid subproblem can be solved in parallel, this can\nVOLUME 7, 2019 157957\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\nimprove the efﬁciency of solution while in a large hybrid\nnetwork.\nVI. CONCUSION\nThe AC/DC hybrid microgrids equipped with PET is a multi-\nple region network which is composed of interconnected AC\nand DC microgrids. As the plug-and-play ports for DGs, PET\nallows convenient control of active and reactive power and\nprovides ﬂexibilities on the coordination of AC/DC micro-\ngrid. This paper proposed a decentralized OPF approach\nbased on ATC frame to optimize the operation of autonomous\nAC/DC hybrid microgrids equipped with PET. The simula-\ntion results refer to conclusions which can be summarized as\nfollows:\n• The proposed Kriging model of PET has good ﬁtting\naccuracy to the complex loss characterization functions\nwhich can be applied to different topologies PET with\nvarious loss formulations.\n• The coordinated control strategy for multiport PET,\nwith low communication requirements, presented in this\npaper can realize the microgrid operate autonomously\nand improve the utilization efﬁciency of DGs in AC/DC\nmicrogrids.\n• The ATC method is adopted to solve the decentral-\nized optimization problem and coordinate the operating\npoints of the interconnected autonomous AC/DC hybrid\nmicrogrids equipped with PET in a large scale. It can\nsatisfy the demand of decentralized autonomous and\ncentralized coordinated scheduling mode in the future\npower grid.\nREFERENCES\n[1] J. Ge, Z. Zhao, L. Yuan, and T. Lu, ‘‘Energy feed-forward and direct feed-\nforward control for solid-state transformer,’’ IEEE Trans. Power Electron.,\nvol. 30, no. 8, pp. 4042–4047, Aug. 2015.\n[2] M. Gao, K. Wang, and L. He, ‘‘Probabilistic model checking and schedul-\ning implementation of an energy router system in energy Internet for\ngreen cities,’’ IEEE Trans Ind. Informat., vol. 14, no. 4, pp. 1501–1510,\nApr. 2018.\n[3] C. Gu, Z. Zheng, L. Xu, K. Wang, and Y. Li, ‘‘Modeling and con-\ntrol of a multiport power electronic transformer (PET) for electric\ntraction applications,’’ IEEE Trans. Power Electron., vol. 31, no. 2,\npp. 915–927, Feb. 2016.\n[4] Y. Yang, W. Pei, W. Deng, and S. Zhang, ‘‘Beneﬁt analysis of using multi-\nport and multi-function power electronic transformer connecting hybrid\nAC/DC power grids,’’J. Eng., vol. 2019, no. 16, pp. 1076–1080, Mar. 2019.\n[5] J. Tian, D. Hu, C. Zhou, Y. Yang, W. Wu, C. Mao, and D. Wang,\n‘‘Individual DC voltage balance control for cascaded H-bridge electronic\npower transformer with separated DC-link topology,’’ IEEE Access, vol. 7,\npp. 38558–38567, 2019.\n[6] J. Miao, N. Zhang, C. Kang, J. Wang, Y. Wang, and Q. Xia, ‘‘Steady-\nstate power ﬂow model of energy router embedded AC network and its\napplication in optimizing power system operation,’’ IEEE Trans. Smart\nGrid, vol. 9, no. 5, pp. 4828–4837, Sep. 2018.\n[7] D. Lei, Z. Tao, P. Tianjiao, C. Naishi, and S. Yingyun, ‘‘Optimal scheduling\nof asymmetrical AC/DC micro-grid based on PET,’’ in Proc. Int. Conf.\nPower Syst. Technol., Guangzhou, China, Nov. 2018, pp. 1757–1763.\n[8] H. Chen and D. Divan, ‘‘Soft-switching solid-state transformer,’’ IEEE\nTrans. Power Electron., vol. 33, no. 4, pp. 2933–2947, Apr. 2018.\n[9] M. Sabahi, S. H. Hosseini, M. B. Shariﬁan, A. Y. Goharrizi, and\nG. B. Gharehpetian, ‘‘Zero-voltage switching bi-directional power elec-\ntronic transformer,’’ IET Power Electron., vol. 3, no. 5, pp. 818–828\nSep. 2010.\n[10] F. Briz, M. Lopez, A. Rodriguez, and M. Arias, ‘‘Modular power electronic\ntransformers: Modular multilevel converter versus cascaded H-Bridge\nsolutions,’’IEEE Ind. Electron. Mag., vol. 10, no. 4, pp. 6–9, Dec. 2016.\n[11] L. Shu, W. Chen, C. Wang, D. Ma, X. Jiang, and X. Wei, ‘‘Power\nelectronic transformer based on mixed-frequency modulation,’’ Automat.\nElectr. Power Syst., vol. 42, no. 7, pp. 146–152, Apr. 2018.\n[12] N. L. Diaz, T. Dragičević, J. C. Vasquez, and J. M. Guerrero, ‘‘Intelli-\ngent distributed generation and storage units for DC microgrids—A new\nconcept on cooperative control without communications beyond droop\ncontrol,’’IEEE Trans. Smart Grid, vol. 5, no. 5, pp. 2476–2485, Sep. 2014.\n[13] N. Eghtedarpour and E. Farjah, ‘‘Power control and management in\na hybrid AC/DC microgrid,’’ IEEE Trans. Smart Grid, vol. 5, no. 3,\npp. 1494–1505, May 2014.\n[14] L. Che and M. Shahidehpour, ‘‘DC microgrids: Economic operation and\nenhancement of resilience by hierarchical control,’’ IEEE Trans. Smart\nGrid, vol. 5, no. 5, pp. 2517–2526, Sep. 2014.\n[15] Q. Shaﬁee, S. Member, J. M. Guerrero, S. Member, and J. C. Vasquez,\n‘‘Distributed secondary control for islanded microgrids—A novel\napproach,’’ IEEE Trans. Power Electron., vol. 29, no. 2, pp. 1018–1031,\nFeb. 2014.\n[16] P. Wang, X. Lu, X. Yang, W. Wang, and D. Xu, ‘‘An improved distributed\nsecondary control method for DC microgrids with enhanced dynamic\ncurrent sharing performance,’’ IEEE Trans. Power Electron., vol. 31, no. 9,\npp. 6658–6673, Sep. 2015.\n[17] M. A. Allam, A. A. Hamad, M. Kazerani, and E. F. El-Saadany, ‘‘A novel\ndynamic power routing scheme to maximize loadability of islanded hybrid\nAC/DC microgrids under unbalanced AC loading,’’ IEEE Trans. Smart\nGrid, vol. 9, no. 6, pp. 5798–5809, Nov. 2017.\n[18] A. Hussain, V.-H. Bui, and H.-M. Kim, ‘‘Robust optimal operation of\nAC/DC hybrid microgrids under market price uncertainties,’’ IEEE Access,\nvol. 6, pp. 2654–2667, Dec. 2017.\n[19] H. Qiu, B. Zhao, W. Gu, and R. Bo, ‘‘Bi-level two-stage robust optimal\nscheduling for AC/DC hybrid multi-microgrids,’’ IEEE Trans. Smart Grid,\nvol. 9, no. 5, pp. 5455–5466, Sep. 2018.\n[20] B. Zhao, H. Qiu, R. Qin, X. Zhang, W. Gu, and C. Wang, ‘‘Robust optimal\ndispatch of AC/DC hybrid microgrids considering generation and load\nuncertainties and energy storage loss,’’ IEEE Trans. Power Syst., vol. 33,\nno. 6, pp. 5945–5957, Nov. 2018.\n[21] B. Papari, C. S. Edrington, I. Bhattacharya, and G. Radman, ‘‘Effective\nenergy management of hybrid AC-DC microgrids with storage devices,’’\nIEEE Trans. Smart Grid, vol. 10, no. 1, pp. 193–203, Jan. 2019.\n[22] C. Battistelli, Y. P. Agalgaonkar, and B. C. Pal, ‘‘Probabilistic dispatch\nof remote hybrid microgrids including battery storage and load manage-\nment,’’IEEE Trans. Smart Grid, vol. 8, no. 3, pp. 1305–1317, May 2017.\n[23] M. Manbachi and M. Ordonez, ‘‘AMI-based energy management for\nislanded AC/DC microgrids utilizing energy conservation and optimiza-\ntion,’’IEEE Trans. Smart Grid, vol. 10, no. 1, pp. 293–304, Jan. 2019.\n[24] A. Oulis-Rousis, I. Konstantelos, and G. Strbac, ‘‘A planning model for\na hybrid AC/DC microgrid using a novel GA/AC OPF algorithm,’’ IEEE\nTrans. Power Syst., to be published, doi:10.1109/TPWRS.2019.2924137.\n[25] W. Lu, M. Liu, S. Lin, and L. Li, ‘‘Fully decentralized optimal power ﬂow\nof multi-area interconnected power systems based on distributed interior\npoint method,’’ IEEE Trans. Power Syst., vol. 33, no. 1, pp. 901–910,\nJan. 2018.\n[26] Y. Wang, L. Wu, and S. Wang, ‘‘A fully-decentralized consensus-based\nADMM approach for DC-OPF with demand response,’’ IEEE Trans. Smart\nGrid, vol. 8, no. 6, pp. 2637–2647, Nov. 2017.\n[27] W. T. Elsayed and E. F. El-Saadany, ‘‘A fully decentralized approach for\nsolving the economic dispatch problem,’’ IEEE Trans. Power Syst., vol. 30,\nno. 4, pp. 2179–2189, Jul. 2015.\n[28] T. Xu, W. Wu, W. Zheng, H. Sun, and L. Wang, ‘‘Fully distributed quasi-\nNewton multi-area dynamic economic dispatch method for active distribu-\ntion networks,’’ IEEE Trans. Power Syst., vol. 33, no. 4, pp. 4253–4263,\nJul. 2018.\n[29] T. Xu, W. Wu, H. Sun, and L. Wang, ‘‘Fully distributed multi-area dynamic\neconomic dispatch method with second-order convergence for active dis-\ntribution networks,’’ IET Gener., Transmiss. Distrib., vol. 11, no. 16,\npp. 3955–3965, Nov. 2017.\n[30] Z. Weiye, W. Wu, B. Zhang, Z. Li, and Y. Liu, ‘‘Fully distributed multi-area\neconomic dispatch method for active distribution networks,’’ IET Gener.,\nTransmiss. Distrib., vol. 9, no. 12, pp. 1341–1351, Sep. 2015.\n[31] C. Qi, K. Wang, Y. Fu, G. Li, B. Han, R. Huang, and T. Pu, ‘‘A decentralized\noptimal operation of AC/DC hybrid distribution grids,’’ IEEE Trans. Smart\nGrid, vol. 9, no. 6, pp. 6095–6105, Nov. 2018.\n157958 VOLUME 7, 2019\nL. Donget al.: Decentralized Optimal Operation of AC/DC Hybrid Microgrids Equipped With PET\n[32] E. Dall’Anese, H. Zhu, and G. B. Giannakis, ‘‘Distributed optimal power\nﬂow for smart microgrids,’’ IEEE Trans. Smart Grid, vol. 4, no. 3,\npp. 1464–1475, Sep. 2013.\n[33] Z. Wang, B. Chen, J. Wang, and J. Kim, ‘‘Decentralized energy man-\nagement system for networked microgrids in grid-connected and islanded\nmodes,’’IEEE Trans. Smart Grid, vol. 7, no. 2, pp. 1097–1105, Mar. 2016.\n[34] A. Kargarian, J. Mohammadi, J. Guo, S. Chakrabarti, M. Barati, G. Hug,\nS. Kar, and R. Baldick, ‘‘Toward distributed/decentralized DC optimal\npower ﬂow implementation in future electric power systems,’’ IEEE Trans.\nSmart Grid, vol. 9, no. 4, pp. 2574–2594, Jul. 2018.\n[35] A.-K. Ali, A. J. Conejo, and R. Cherkaoui, ‘‘Multi-area unit scheduling\nand reserve allocation under wind power uncertainty,’’ IEEE Trans. Power\nSyst., vol. 29, no. 4, pp. 1701–1710, Jul. 2014.\n[36] Y. Zhang, M. Hong, E. Dall’Anese, S. V. Dhople, and Z. Xu, ‘‘Distributed\ncontrollers seeking AC optimal power ﬂow solutions using ADMM,’’ IEEE\nTrans. Smart Grid, vol. 9, no. 5, pp. 4525–4537, Sep. 2018.\n[37] A. K. Marvasti, Y. Fu, S. DorMohammadi, and M. Rais-Rohani, ‘‘Optimal\noperation of active distribution grids: A system of systems framework,’’\nIEEE Trans. Smart Grid, vol. 5, no. 3, pp. 1228–1237, May 2014.\n[38] M. Glinka and R. Marquardt, ‘‘A new AC/AC multilevel converter family,’’\nIEEE Trans. Ind. Electron., vol. 52, no. 3, pp. 662–669, Jun. 2005.\n[39] N. Hugo, P. Stefanutti, M. Pellerin, and A. Akdag, ‘‘Power electron-\nics traction transformer,’’ in Proc. EPE, Aalborg, Denmark, Sep. 2007,\npp. 1–10.\n[40] J. Beerten, S. Cole, and R. Belmans, ‘‘Generalized steady-state VSC\nMTDC model for sequential AC/DC power ﬂow algorithms,’’ IEEE Trans.\nPower Syst., vol. 27, no. 2, pp. 821–829, May 2012.\n[41] J. Cao, W. Du, H. F. Wang, and S. Q. Bu, ‘‘Minimization of transmission\nloss in meshed AC/DC grids with VSC-MTDC networks,’’ IEEE Trans.\nPower Syst., vol. 28, no. 3, pp. 3047–3055, Aug. 2013.\n[42] H. R. Karampoorian, G. Papi, and A. Zadehgol, ‘‘Volume and loss opti-\nmization of high frequency transformer for compact switch mode power\nsupply considering corrected waveform factor,’’ in Proc. Power India\nConf., Apr. 2006, p. 6.\n[43] Q. Yue, C. Li, Y. Cao, Y. He, B. Cai, Q. Wu, and B. Zhou, ‘‘Comprehensive\npower losses model for electronic power transformer,’’ IEEE Access, vol. 6,\npp. 14926–14934, 2018.\n[44] T. Zhao, G. Wang, S. Bhattacharya, and A. Q. Huang, ‘‘Voltage and\npower balance control for a cascaded H-bridge converter-based solid-state\ntransformer,’’IEEE Trans. Power Electron., vol. 28, no. 4, pp. 1523–1532,\nApr. 2013.\n[45] J. E. Huber and J. W. Kolar, ‘‘Applicability of solid-state transformers in\ntoday’s and future distribution grids,’’ IEEE Trans. Smart Grid, vol. 10,\nno. 1, pp. 317–326, Jan. 2019.\n[46] B. Xia, Z. Ren, and C.-S. Koh, ‘‘Comparative study on Kriging sur-\nrogate models for metaheuristic optimization of multidimensional elec-\ntromagnetic problems,’’ IEEE Trans. Magn., vol. 51, no. 3, Mar. 2015,\nArt. no. 9400704.\n[47] J. Jung, ‘‘Optimal design of plasmonic nanoslit array sensor using Kriging\nmodel,’’ IEEE Photon. Technol. Lett., vol. 29, no. 12, pp. 1039–1041,\nJun. 15, 2017.\n[48] B. Xia, N. Baatar, Z. Ren, and C.-S. Koh, ‘‘A numerically efﬁcient multi-\nobjective optimization algorithm: Combination of dynamic Taylor Kriging\nand differential evolution,’’ IEEE Trans. Magn., vol. 51, no. 3, Mar. 2015,\nArt. no. 9400604.\n[49] B. Xia, T.-W. Lee, K. Choi, and C.-S. Koh, ‘‘A novel adaptive dynamic\nTaylor Kriging and its application to optimal design of electromagnetic\ndevices,’’IEEE Trans. Magn., vol. 52, no. 3, Mar. 2016, Art. no. 7208704.\n[50] P. Yi, T. Zhu, B. Jiang, R. Jin, and B. Wang, ‘‘Deploying energy routers in\nan energy Internet based on electric vehicles,’’ IEEE Trans. Veh. Technol.,\nvol. 65, no. 6, pp. 4714–4725, Jun. 2016.\n[51] P. Tatcho, H. Li, Y. Jiang, and L. Qi, ‘‘A novel hierarchical section protec-\ntion based on the solid state transformer for the future renewable electric\nenergy delivery and management (FREEDM) system,’’ IEEE Trans. Smart\nGrid, vol. 4, no. 2, pp. 1096–1104, Jun. 2013.\n[52] A. R. Malekpour, A. Pahwa, and B. Natarajan, ‘‘Hierarchical architecture\nfor integration of rooftop PV in smart distribution systems,’’ IEEE Trans.\nSmart Grid, vol. 9, no. 3, pp. 2019–2029, May 2018.\n[53] A. Mohammadi, M. Mehrtash, and A. Kargarian, ‘‘Diagonal quadratic\napproximation for decentralized collaborative TSO+DSO optimal power\nﬂow,’’IEEE Trans. Smart Grid, vol. 10, no. 3, pp. 2358–2370, May 2019.\nLEI DONG received the M.S. degree in electric\nengineering and automation from Tianjin Univer-\nsity (TJU), Tianjin, China, in 1996.\nShe is currently an Associate professor with\nthe School of Electrical and Electronic Engi-\nneering, North China Electric Power University\n(NCEPU), Beijing, China. Her research interests\ninclude power system analysis and control, renew-\nable energy integration, and smart grids.\nTAO ZHANGreceived the B.E. degree in electrical\nengineering from the Hefei University of Tech-\nnology (HFUT), Hefei, China, in 2016, and the\nM.S. degree in electric engineering and automa-\ntion from North China Electric Power University\n(NCEPU), Beijing, China, in 2019. He is currently\npursuing the Ph.D. degree in electrical engineering\nwith Tianjin University (TJU), Tianjin, China. His\nresearch interests include power system analysis,\nrenewable energy, and microgrids.\nTIANJIAO PUreceived the M.S. degree in electric\nengineering and automation from Tianjin Univer-\nsity (TJU), Tianjin, China, in 1996.\nHe is currently with the China Electric Power\nResearch Institute, Beijing, China. His research\ninterests include power system analysis, renewable\nenergy integration, active distribution networks,\nand smart grid.\nNAISHI CHEN received the M.S. degree in elec-\ntric engineering and automation from North China\nElectric Power University (NCEPU), Beijing,\nChina, in 2007.\nHe is currently with the China Electric Power\nResearch Institute, Beijing. His research interests\ninclude automation of power system scheduling,\nrenewable energy integration, and active distribu-\ntion networks.\nYINGYUN SUNreceived the B.E. degree in elec-\ntrical engineering from Shanghai Jiao Tong Uni-\nversity (SJTU), Shanghai, China, in 1996, and the\nM.E. and Ph.D. degrees in electrical engineering\nfrom Tsinghua University (THU), Beijing, China,\nin 2007.\nHe is currently a Professor with the School\nof Electrical and Electronic Engineering, North\nChina Electric Power University (NCEPU), Bei-\njing. His research interests include power system\noperation and planning, renewable energy integration, smart grids, and ac/dc\nhybrid microgrids.\nVOLUME 7, 2019 157959",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.6386017799377441
    },
    {
      "name": "Computer science",
      "score": 0.6306780576705933
    },
    {
      "name": "Microgrid",
      "score": 0.5893166661262512
    },
    {
      "name": "Voltage droop",
      "score": 0.555338442325592
    },
    {
      "name": "Correctness",
      "score": 0.5155258178710938
    },
    {
      "name": "Grid",
      "score": 0.5002830028533936
    },
    {
      "name": "Power flow",
      "score": 0.4936269521713257
    },
    {
      "name": "AC power",
      "score": 0.44444751739501953
    },
    {
      "name": "Distributed generation",
      "score": 0.42508822679519653
    },
    {
      "name": "Voltage",
      "score": 0.39392703771591187
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.38905972242355347
    },
    {
      "name": "Power (physics)",
      "score": 0.33933037519454956
    },
    {
      "name": "Electric power system",
      "score": 0.2982015013694763
    },
    {
      "name": "Voltage source",
      "score": 0.2721274793148041
    },
    {
      "name": "Engineering",
      "score": 0.22535401582717896
    },
    {
      "name": "Electrical engineering",
      "score": 0.22525382041931152
    },
    {
      "name": "Control (management)",
      "score": 0.14177769422531128
    },
    {
      "name": "Renewable energy",
      "score": 0.1342501938343048
    },
    {
      "name": "Mathematics",
      "score": 0.0
    },
    {
      "name": "Physics",
      "score": 0.0
    },
    {
      "name": "Programming language",
      "score": 0.0
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    },
    {
      "name": "Geometry",
      "score": 0.0
    },
    {
      "name": "Artificial intelligence",
      "score": 0.0
    }
  ]
}