{
  "title": "ACID: a free tool for drug repurposing using consensus inverse docking strategy",
  "url": "https://openalex.org/W2990367205",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A2080195193",
      "name": "Fan Wang",
      "affiliations": [
        "Central China Normal University",
        "Ministry of Education"
      ]
    },
    {
      "id": "https://openalex.org/A4289898105",
      "name": "Feng-Xu Wu",
      "affiliations": [
        "Central China Normal University",
        "Ministry of Education"
      ]
    },
    {
      "id": "https://openalex.org/A2333130886",
      "name": "Cheng-Zhang Li",
      "affiliations": [
        "Central China Normal University",
        "Ministry of Education"
      ]
    },
    {
      "id": "https://openalex.org/A2245929140",
      "name": "Chen‐Yang Jia",
      "affiliations": [
        "Ministry of Education",
        "Central China Normal University"
      ]
    },
    {
      "id": "https://openalex.org/A5012625306",
      "name": "Sun Wen-su",
      "affiliations": [
        "Central China Normal University",
        "Ministry of Education"
      ]
    },
    {
      "id": "https://openalex.org/A4214129843",
      "name": "Ge‐Fei Hao",
      "affiliations": [
        "Guizhou University"
      ]
    },
    {
      "id": "https://openalex.org/A3199525178",
      "name": "Guang‐Fu Yang",
      "affiliations": [
        "Ministry of Education",
        "Collaborative Innovation Center of Chemical Science and Engineering Tianjin",
        "Central China Normal University"
      ]
    },
    {
      "id": "https://openalex.org/A2080195193",
      "name": "Fan Wang",
      "affiliations": [
        "Ministry of Education",
        "Central China Normal University",
        "Ministry of Education of the People's Republic of China"
      ]
    },
    {
      "id": "https://openalex.org/A4289898105",
      "name": "Feng-Xu Wu",
      "affiliations": [
        "Central China Normal University",
        "Ministry of Education",
        "Ministry of Education of the People's Republic of China"
      ]
    },
    {
      "id": "https://openalex.org/A2333130886",
      "name": "Cheng-Zhang Li",
      "affiliations": [
        "Ministry of Education of the People's Republic of China",
        "Ministry of Education",
        "Central China Normal University"
      ]
    },
    {
      "id": "https://openalex.org/A2245929140",
      "name": "Chen‐Yang Jia",
      "affiliations": [
        "Ministry of Education",
        "Ministry of Education of the People's Republic of China",
        "Central China Normal University"
      ]
    },
    {
      "id": "https://openalex.org/A5012625306",
      "name": "Sun Wen-su",
      "affiliations": [
        "Ministry of Education of the People's Republic of China",
        "Central China Normal University",
        "Ministry of Education"
      ]
    },
    {
      "id": "https://openalex.org/A4214129843",
      "name": "Ge‐Fei Hao",
      "affiliations": [
        "Guizhou University"
      ]
    },
    {
      "id": "https://openalex.org/A3199525178",
      "name": "Guang‐Fu Yang",
      "affiliations": [
        "Ministry of Education of the People's Republic of China",
        "Collaborative Innovation Center of Chemical Science and Engineering Tianjin",
        "Central China Normal University",
        "Ministry of Education"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2765587792",
    "https://openalex.org/W2028279608",
    "https://openalex.org/W2402506318",
    "https://openalex.org/W2558217333",
    "https://openalex.org/W2155157373",
    "https://openalex.org/W2604527271",
    "https://openalex.org/W2896002881",
    "https://openalex.org/W2118226640",
    "https://openalex.org/W2398478519",
    "https://openalex.org/W2078653892",
    "https://openalex.org/W2055147198",
    "https://openalex.org/W2171482501",
    "https://openalex.org/W1993554808",
    "https://openalex.org/W2006667691",
    "https://openalex.org/W2075673943",
    "https://openalex.org/W2092285329",
    "https://openalex.org/W2050456292",
    "https://openalex.org/W1969017960",
    "https://openalex.org/W2404280981",
    "https://openalex.org/W2105668062",
    "https://openalex.org/W2134967712",
    "https://openalex.org/W2042572511",
    "https://openalex.org/W1988437166",
    "https://openalex.org/W2058120003",
    "https://openalex.org/W2052030759",
    "https://openalex.org/W2311078281",
    "https://openalex.org/W2025116694",
    "https://openalex.org/W2470899874",
    "https://openalex.org/W2128332459",
    "https://openalex.org/W2002025649",
    "https://openalex.org/W1972148009",
    "https://openalex.org/W2166765429",
    "https://openalex.org/W1966677073",
    "https://openalex.org/W2002733813",
    "https://openalex.org/W2147421370",
    "https://openalex.org/W2767891136",
    "https://openalex.org/W2161732286",
    "https://openalex.org/W2109872885",
    "https://openalex.org/W2145126338",
    "https://openalex.org/W1977056833",
    "https://openalex.org/W2104916446",
    "https://openalex.org/W2116490460",
    "https://openalex.org/W2168938595",
    "https://openalex.org/W2169678694",
    "https://openalex.org/W1994892123",
    "https://openalex.org/W2557144746",
    "https://openalex.org/W2484532874",
    "https://openalex.org/W2279376656"
  ],
  "abstract": null,
  "full_text": "Wang et al. J Cheminform           (2019) 11:73  \nhttps://doi.org/10.1186/s13321-019-0394-z\nRESEARCH ARTICLE\nACID: a free tool for drug repurposing using \nconsensus inverse docking strategy\nFan Wang1,2†, Feng‑Xu Wu1,2†, Cheng‑Zhang Li1,2, Chen‑Yang Jia1,2, Sun‑Wen Su1,2, Ge‑Fei Hao3*  \nand Guang‑Fu Yang1,2,4*\nAbstract \nDrug repurposing offers a promising alternative to dramatically shorten the process of traditional de novo develop‑\nment of a drug. These efforts leverage the fact that a single molecule can act on multiple targets and could be ben‑\neficial to indications where the additional targets are relevant. Hence, extensive research efforts have been directed \ntoward developing drug based computational approaches. However, many drug based approaches are known to \nincur low successful rates, due to incomplete modeling of drug‑target interactions. There are also many technical \nlimitations to transform theoretical computational models into practical use. Drug based approaches may, thus, still \nface challenges for drug repurposing task. Upon this challenge, we developed a consensus inverse docking (CID) \nworkflow, which has a ~ 10% enhancement in success rate compared with current best method. Besides, an easily \naccessible web server named auto in silico consensus inverse docking (ACID) was designed based on this workflow \n(http://chemy ang.ccnu.edu.cn/ccb/serve r/ACID).\nKeywords: ACID, Web server, Drug repurposing, Consensus inverse docking\n© The Author(s) 2019. This article is distributed under the terms of the Creative Commons Attribution 4.0 International License \n(http://creat iveco mmons .org/licen ses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium, \nprovided you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, \nand indicate if changes were made. The Creative Commons Public Domain Dedication waiver (http://creativecommons.org/\npublicdomain/zero/1.0/) applies to the data made available in this article, unless otherwise stated.\nIntroduction\nIn recent years, the productivity challenge facing the \npharmaceutical industry has become particularly diffi ‑\ncult to overcome [1]. By many estimates, the number of \nnew molecular entity approved to market per billion US \ndollars spent on (research and development) R&D has \nhalved roughly every one decade, falling around 80‑fold \nin inflation‑adjusted terms [2]. To increase drug‑dis\n‑\ncovery productivity, more and more attention has been \npaid to exploring the relationship between drug and \ndisease, which can advance our knowledge of molecular \nmechanism of disease indication and lead to new strat\n‑\negies to treat productivity challenge [3, 4]. Nevertheless, \ntraditional strategies which typically oriented on a search \nfor a novel therapeutic compound combined with dis\n‑\ncovery of a new therapeutic target are time consuming, \nexpensive and risky because of the necessity for multiple \nexperimental and clinical validation [5].\nDrug repurposing/repositioning/rescue, the application \nof an existing drug to a new disease indication, is a prom\n‑\nising approach to address the ‘productivity gap’ , especially \nthe demand of rapid clinical impact at a lower cost by the \n‘starting‑from‑scratch’ drug development [6]. Compared \nwith brand new drug discovery for a given disease indica\n‑\ntion, this method has several advantages. First, due to the \nexisting drug has already been proved to be sufficiently \nsafe in humans, the safety risk of clinical failure is much \nlower at least from a safety point of view. Second, due to \nthe safety assessment and most of formulation task have \nalready been completed, the development cycle should be \nlargely reduced. Third, the investment is always less [7]. \nThese advantages have made the development of repur\n‑\nposed drugs into a task of low risk investments with \nfaster and higher returns. Hence, Drug repurposing is \ndrowning widespread attention from the pharmaceutical \nindustry, government agencies and academic institutes, \nOpen Access\nJournal of Cheminformatics\n*Correspondence:  gfhao@mail.ccnu.edu.cn; gfyang@mail.ccnu.edu.cn\n†Fan Wang and Feng‑Xu Wu co‑first authors.\n1 Key Laboratory of Pesticide & Chemical Biology, Ministry of Education, \nCollege of Chemistry, Central China Normal University, Wuhan 430079, \nPeople’s Republic of China\n3 State Key Laboratory Breeding Base of Green Pesticide and Agricultural \nBioengineering, Key Laboratory of Green Pesticide and Agricultural \nBioengineering, Ministry of Education, Research and Development \nCenter for Fine Chemicals, Guizhou University, Guiyang 550025, People’s \nRepublic of China\nFull list of author information is available at the end of the article\nPage 2 of 11Wang et al. J Cheminform           (2019) 11:73 \nsuch as ‘Discovering New Therapeutic Uses for Existing \nMolecules Plan’ by NIH (USA). However, drug repurpos ‑\ning is vastly more complicated than typically imagined \nand to date there has not been a systematic approach to \nidentify repurposing opportunities.\nIn order to reduce the number of “wet” experiments and \nthereby reduce cost, extensive research efforts have been \ndirected toward developing computational (virtual or in \nsilico) approaches, which have been proved extremely valu\n‑\nable in identifying potential opportunities in these fields. Of \nthe several techniques for generating computational repo\n‑\nsitioning hypotheses, inverse/reverse docking, involved \ndocking an existing drug in the potential binding cavities of \na set of clinically relevant disease targets, is proving to be a \npowerful tool for drug repositioning [8, 9]. Inverse docking \nis ‘one ligand‑many targets’ scenario, representing a struc\n‑\nture‑based computational strategy. Different with the con‑\nventional drug virtual screening, inverse virtual screening \nwas performed for a small‑molecule against a large collec\n‑\ntion of binding‑sites of clinically relevant macromolecular \ntargets. The top‑ranking targets based on the binding com‑\nplementarity (shape and electrostatics) with the drug are \nlikely to result in potential drug repositioning. Hence, effi\n‑\ncient tools were developed for inverse docking, for example, \nINVDOCK [10], TarFisDock [11], PDTD [12], and idTar\n‑\nget [13]. Moreover, successful drug repurposing examples \nalong with these tools are steadily grows, such as sildenafil \nand thalidomide [14]. Since the basic philosophy behind \nreverse docking is the same with docking and the critical \nparameters of the docking programs were always optimized \nbased on some of the specific ligand and target systems, the \nperformance in docking pose search itself and scoring of \nthe docked poses may, thus, still face challenges for reverse \ndocking methods. Up to date, many studies have proved \nthat the consensus strategy that combining several types of \ndocking algorithm can achieve higher success rates in pose \nprediction than single docking algorithm [15]. Hence, devel\n‑\nopment of consensus inverse docking algorithms to address \nthe inherent difficulties involved in the molecular docking, \nis extremely valuable in identifying potential opportunities \nof drug repurposing [9]. In addition, due to that almost all \ncurrent docking tools are designed for ‘one ligand‑many \ntargets’ scenario, the usability of tools for inverse virtual \nscreening task is occasionally restricted by code‑ writing \ndependencies and tedious operation steps, which bring \nchallenges for non‑expert users. Therefore, there is still a \nstrong demand for a new free server of inverse docking.\nHence, we developed a computational protocol by \ncombining the results of several dissimilar types of free \ndocking method into a consensus inverse docking (CID) \nscheme. Here, we selected AutoDock Vina, LEDOCK, \nPLANTS, and PSOVina for binding pose search as they \nrepresent significantly different docking methodologies \n(i.e., different conformational search algorithm, different \nglobal and local optimizers, and different scoring func\n‑\ntions) and have employed different collections of crystal \ncomplexes and binding data to calibrate their optimiza\n‑\ntion algorithms. In addition, we used Molecular Mechan‑\nics/Poisson–Boltzmann Surface Area (MM/PBSA) and \nX‑SCORE for final binding energy calculation as they \nare more rigorous than the intrinsic scoring function in \nprinciple. The intention was to investigate whether inte\n‑\ngration of these to develop a consensus strategy to the \ninverse docking problem would result in improvements \nin posing accuracy and prediction of binding modes. \nBesides, in order to significantly reduce user time for data \ngathering and multi‑ step analysis for drug repurposing \ntask, an comprehensive web platform named Auto in sil\n‑\nico consensus inverse docking (ACID) (http://chemy  ang.\nccnu.edu.cn/ccb/serve r/ACID) with a user‑friendly inter‑\nface was also designed for an easy evaluation and appli ‑\ncation of this strategy, which consists of the following \nthree tools: (i) an automated consensus inverse docking \nworkflow program, (ii) a compound database containing \n2086 approved drugs with original therapeutic informa\n‑\ntion, (iii) a known target database containing 831 protein \nstructures from PDB covering 30 therapeutic areas.\nMethods\nSelection of test set\nThe PDB‑bind database is a large collection of protein−\nligand crystal complexes with associated experimentally \ndetermined binding data [16]. A total of 16,151 protein–\nligand entries are contained in the PDB‑bind database. \nIn all protein–ligand entries, there are 4463 entries with \ngood quality structural and binding data. The experimen\n‑\ntal resolution of any chosen crystal structure should be \nlower than 3.0 Å, because adopting structures with poor \nresolution may generate false predicted conformations \n[17]. No NMR ‑solved structures were selected in our \nbenchmark dataset. Any complexes with ligands contain\n‑\ning off‑standard atom types (like Si or Be) were rejected. \nFinally, we only chose complexes with a single drug like \nmolecule bound in the active site. Hence, a subset con\n‑\ntains 195 complex structures of these have been selected \nas the “core set” , aiming to provide high‑quality com\n‑\nplexes that represents a broad cross ‑section of the data ‑\nbase. This is of appropriate size for evaluation studies of \ndocking and scoring performance [18].\nPreparation of structures for inverse docking\nFor each complex, the original conformation of ligand \nwas extracted from the PDB file; similarly, the 3D struc\n‑\nture of corresponding protein was generated. As for the \nproteins, water molecules were removed and the program \nPDB2PQR 1.6 21 was used to assign position‑optimized \nPage 3 of 11\nWang et al. J Cheminform           (2019) 11:73 \nhydrogen atoms under the protonation state simulated to \npH = 7.0. The AMBER ff14SB [19] force field were adopted \nfor charge assignment. The MOL2 format representation \nof each receptor was prepared by SPORES tool in Plants \nsoftware package. The Autodock Tools 1.5.4 utility pre\n‑\npare_receptor4.py was used to assign Gasteiger charges \nto atoms. The Autodock Tools utility prepare_ligand4.py \nwas used to assign Gasteiger charges and rotatable bonds. \nThe input grid files were prepared by dms and sphgen_cpp \ntools of DOCK software package.\nSelection of docking softwares\nSeven docking softwares were carefully evaluated to build \nconsensus strategy, including AUTODOCK [20], VINA \n[21], DOCK [22], PLANTS [23], PSOVINA [24], LEDOCK \n(http://www.lepha r.com) and GOLD [25]. This selection \ncovers a wide variety of conformation search algorithm and \nscoring function (Additional file  1: Table  S1), thus repre\n‑\nsenting an abundant source for optimizing the consensus \nprotocol. The docking calculation was performed on the \nprepared dataset of 195 receptors and ligands by using \nthese seven docking softwares based on default param\n‑\neters. The box within the surrounding 12.5 Å of the bound \nligand was defined as active site. 100 conformations for \neach ligand versus its corresponding active site were pro\n‑\nduced by each software. The one with highest score were \nselected as the final pose.\nBinding free energy calculation\nBefore binding free energy calculation, the Sander module \nin Amber16 [26] program was used to perform the three‑\nstep optimization of the ligand‑receptor complex. Firstly, \nonly waters, ions and hydrogens were allowed to move. \nSecondly, the backbone atoms of the protein were fixed \nwhile others were allowed to move. Thirdly, all the atoms \nof the system were free to move. In the three optimization \nprocess, 2000 steps steepest descent method followed by \n2000 steps conjugated gradient method were used for each \nligand‑receptor binding system. Finally, the binding free \nenegy (ΔG\nbind) is calculated by using the MM/PBSA [27, \n28] and X‑score methods [29, 30].\nAs for the X‑score method, it is assumed that the over ‑\nall binding free energy in a protein‑ligand binding process \ncan be divided into several terms (shown in Eq.  1) [31]. \nHere, ΔG\nvdw represents the van der Waals interaction \nbetween the receptor and the ligand; ΔG H‑bond represents \nthe hydrogen bonding between the receptor and the ligand; \nΔG\ndeformation represents the deformation effect; ΔGhydrophobic \nrepresents the hydrophobic effect; ΔG0 represents a regres‑\nsion constant. ΔG bind value between the receptor and \nligand could be calculated simply by the X‑score software \npackage.\nIn the MM/PBSA method [32], the free energy of \nthe receptor/protein‑inhibitor binding, ∆G bind, is \nobtained from the difference between the free energies \nof the receptor/protein‑ligand complex (G\ncpx) and the \nunbound receptor/protein (G rec) and ligand (G lig). The \nbinding free energy (ΔG bind) was evaluated as a sum \nof the changes in the binding energy (ΔE bind), solva ‑\ntion entropy (− TΔSsol), and conformational entropy \n(−TΔSconf) (shown in Eq.  2) [33]. Where ∆E bind is \ninteraction energies between a ligand and a protein, \nwhich were computed using the Sander modules of the \nAmber16 program. The entropy contribution to the \nbinding free energy (− T∆S) was obtained by using a \nlocal program developed in our own laboratory [33].\nServer implementation\nAs shown in Additional file  1: Figure S1, ACID web \nserver mainly consists of three parts: Model (M), View \n(V) and Controller(C). Model is an object, which can \nprovide a series of convenient APIs to access data\n‑\nbase. View represents the web service available for \nusers. Controller is a Perl script program to control \nthe whole consensus inverse docking protocol. A dedi\n‑\ncated Linux machine in the high‑ performance com ‑\nputer cluster is used to run ACID web server. PHP \n(version 5.6), Apache (version 2.0.51), HTML5 and \nJavascript are used in the web application to provide \nonline web service. The web server was established \nin the ‘Linux + Apache + MySQL + PHP + Javascript’ \nframework. The web interface is written in JavaScript \nusing the React.js (input page, output page, and dataset \nvisualization) and Ember.js (results and analysis pages) \nframeworks. The server side is written as a Python Cor\n‑\nnice Web Framework with a GO component for rapid \nsearching. A Torque management system is used to \nqueue submitted jobs. The database which stores cor\n‑\nresponding messages and results of each task is imple ‑\nmented by using MySQL (version 5.1.73). Results are \nstored for one month before deletion. The JSmol inter\n‑\nactive molecular viewer plugin (http://www.jmol.org/) \nis applied in structure visualization. Firefox or Chrome \nexplorer is recommended for browsing the server. Com\n‑\nputer Screen with resolution higher than 1440 × 900 is \nrecommended for displaying the web pages.\n(1)\n/Delta1Gbind = /Delta1Gvdw + /Delta1GH−bond + /Delta1Gdeformation\n+ /Delta1Ghydrophobic+ /Delta1G0\n(2)/Delta1Gbind = /Delta1Ebind −T/Delta1Ssol−T/Delta1Sconf\nPage 4 of 11Wang et al. J Cheminform           (2019) 11:73 \nResults and discussion\nConsensus inverse docking strategy\nConsensus strategy may have relatively higher pose pre ‑\ndiction performance than single docking software [34]. \nHence, to select suitable docking methods to construct \nconsensus inverse docking protocol, conformation pre\n‑\ndiction performance of these softwares was carefully \nevaluated. The final pose of each software was selected \naccording to docking score. The RMSD value between \neach pose and its original conformation in complex \ncrystal were calculated. If the RMSD < 2.0  Å, the cor\n‑\nresponding pose prediction was success. The testing \nresults are shown in Additional file  1: Figure S2. In our \nbenchmark, GOLD software with GoldScore showed \na slightly higher accuracy 66%. Taking the commercial \ncopyright restriction into account, four academically \nfree softwares, including VINA (63%), PLANTS (62%), \nPSOVINA (64%), and LEDOCK (64%) were selected to \nconstruct the consensus inverse docking method.\nThe consensus strategy can simulate a real‑life voting \nprocess, because a wide range of voting processes can \neffectively avoid mistakes in decisions. Hence, a well‑\ndesigned conformational cluster‑vote strategy was opti\n‑\nmized by using these four softwares (shown in Fig. 1). The \ndetailed process of CID is like the following: First, initial \n3D conformations of the given active molecule was gen\n‑\nerated and optimized by using MMFF94 force field [35]. \nSecondly, the optimized conformation was docked into \nthe active site of each protein and four subsets of dock\n‑\ning conformations were produced, which contain the \nposes independently predicted by a certain docking pro\n‑\ngram. Third, the conformational clustering is performed \nin each conformational group. We calculate the RMSD \nvalue between each pose and create a similarity matrix in \na conformational group. The conformations with RMSD \nvalue lower than 2.0  Å can be considered as the same \nconformational cluster. The vote value of each conforma\n‑\ntional cluster is equal to the pose number in this cluster. \nThe conformation with best score can be used as a repre\n‑\nsentative of this conformational cluster. Finally, the num‑\nber of conformational cluster of each individual docking \nmethod could be obtained.\nA set of representative conformations from each dock\n‑\ning algorithm were selected to efficiently inspect different \nguided search algorithms for correct conformation of a \nprotein–ligand complex. The representative conforma\n‑\ntion of each conformational cluster from the four dock ‑\ning methods was used to make up a new conformational \nFig. 1 Workflow of consensus inverse docking protocol. The arrows denote the computational process\nPage 5 of 11\nWang et al. J Cheminform           (2019) 11:73 \nensemble, and then the same clustering method is per ‑\nformed to select the strongly binding conformations. \nThe number of conformation is the number of votes. For \nexample, if a conformation cluster from LEDOCK was \nalso predicted by PSOVina, Vina, and PLANTS, that has \nthe RMSD value lower than the threshold value of 2.0 Å, \nsuch a conformation cluster is qualified as 4 votes. The \nhigher the vote number, the higher the support rate of \nthe conformational cluster. In the case of vote dataset, \nthe highest quality predicted conformation cluster has 4 \nvotes. However, if there are two or more top clusters have \nthe same votes, the pose number obtained by each dock\n‑\ning method will be taken into account to judge. Finally, \nthe highest vote conformational cluster was used to per\n‑\nform binding affinity calculation with X ‑score and MM/\nPBSA methods [29, 30].\nPerformance and comparison with existing tools\nA collection of target structures with the information of \napproved therapeutic drugs and potential ligand bind\n‑\ning cavities is the prerequisite of drug repurposing. Since \nthis database is used to search the probable binding pro\n‑\nteins for existing drugs by using inverse docking, it only \ncontains the proteins with 3D structures. The target pro\n‑\nteins were selected from several online databases such as \nDrugBank [36], Uniprot [37], and PDB [38]. In order to \nintegrate with consensus inverse docking protocol, drug \ntarget structure database should be constructed to store \neach protein in both PDB format and mol2 format with \nbasic information, including docking parameters and \nactive site information. Finally, we collected a database \nof experimentally confirmed 831 drug targets and 2086 \ndrug compounds. To evaluate the performance of CID \nprotocol, the screening was performed on the 831 experi\n‑\nmentally confirmed drug targets and 51 out of the 2086 \ncollected commercial drugs were selected to compose a \ntest set according to the two criterias. (1) The cocrystal \nstructures of the drug and its targets should be available. \n(2) The drugs in the test set should have a wide represen\n‑\ntation of the whole commercial drug dataset. The ligand \nflexibility, which can be assessed by the number of rotat\n‑\nable bond, can have a major impact on the performance \nof docking method. According to number of rotatable \nbonds, the distribution of whole commercial drug data\n‑\nset and 51 sampled drugs were quite similar (shown in \nAdditional file 1: Figure S3), which demonstrated that our \ntesting samples have a wide representation.\nTo analyze of the performance of the prediction, we \nperformed the receiver operating curve (ROC) analysis \n[39], which is a graphical plot to illustrate the diagnostic \nability of a binary classifier system. According to its dis\n‑\ncrimination threshold, the area under the ROC (AUC) \nvalues can be used to evaluate the ability to distinguish \nbetween target and non‑ target. The known targets of \neach drug were considered as positive samples, the other \nproteins in our screening dataset were considered as \nnegative set. Although it does not eliminate the possi\n‑\nbility that some of them may interact with these drugs, \nthe number of this kinds of protein is less. In our per\n‑\nformance test, ROC analysis was used to compare the \nperformance of the prediction between MM/PBSA and \nXscore. The AUC was computed based on the follow\n‑\ning: If the true targets are ranked in the top 10%, it was \nconsidered as true positive. If the true targets are ranked \nout side of the top 10%, it was considered as false nega\n‑\ntive. If the non‑ targets are ranked in the top 10%, it was \nconsidered as false positive. If the non‑ targets are ranked \nout side of the top 10%, it was considered as true nega ‑\ntive. Figure 2 shows the ROC curves and the AUC, which \nis used to assess the discriminative performance of MM/\nPBSA (AUC = 0.842) and XScore (AUC = 0.713). It \nshows that MM/PBSA outperforms XScore in our per\n‑\nformance test, which could be due to the nature of the \ngeneral applicability and the universal physical scale of \nthe energy calculation methods [40]. In addition, we also \nretain a higher false positive rate for MM/PBSA (21.4%) \nand Xscore (40.9%). It may probably due to that the num\n‑\nber of negative sample is much larger, hence even a low \nerror rate of negative samples may cause many false posi\n‑\ntive predictions.\nThe binding free energies calculated by MM/PBSA \nmethod were further analyzed to examine the bind ‑\ning of a variety of proteins to drug (listed in Additional \nfile  1: Table  S2). The “TRUE” value under “2%, 5%, and \nFig. 2 The specificity and sensitivity of ACID performance on \ndistinguishing target and non‑target of drugs based on MM/PBSA \nand X‑Score\nPage 6 of 11Wang et al. J Cheminform           (2019) 11:73 \n10%” column means that the known targets of the test ‑\ning drug are identified in the top 2%, 5%, and 10% of the \ncorresponding results. While “FALSE” means the known \ntargets are identified out of the top 10%. As shown in \nAdditional file  1: Table  S3, 35 assessed drugs showed \nsignificant enrichment of their known targets in the top \n10%. In addition, 18 assessed drugs were identified in the \ntop 2%. Therefore, the top 2%, top 5% and top 10% predic\n‑\ntion success rate were 35.29%, 52.94% and 68.63% respec‑\ntively. Taking the tricyclic antidepressants Amitriptyline \nas an example, 9 known targets out of 11 extracted from \nliteratures and other databases was identified in top 10%. \n5J03 appeared among top 11% ranked proteins. 4PMP is \na false negative as it did not appear among the 100 best \nranked structures.\nIn order to evaluate if there is an improvement, the con\n‑\nformation prediction performance of CID protocol was \ncompared with individual docking method. According \nto the criterion of top 10%, CID protocol showed signifi\n‑\ncant higher pose prediction performance (74.4%), which \nis around 10% improvement in comparison with the best \nresult obtained from LEDOCK (64%). The prediction \nperformance of other individual docking method is 64% \n(PSOVina), 63% (Vina), 42% (PLANTS), which are statis\n‑\ntically analyzed according to the successfully predicted \ndrugs of 30 in LEDOCK, 30 in PSOVina、29 in Vina, 20 \nin PLANTS. In addition, it is important to evaluate that \nif the docking accuracy can be improved on ligands with \nmore rotatable bonds. The novel CID protocol showed a \nhigher successful rate in a wider range of rotatable bonds \ncompared with any individual docking method. The dis\n‑\ntribution of the docking results according to the number \nof rotatable bonds are shown in Fig.  3. Therefore, it was \nproved that CID protocol may have relatively higher pre\n‑\ndiction performance than these single docking methods.\nFig. 3 Pose prediction performance of consensus inverse docking and individual methods\nPage 7 of 11\nWang et al. J Cheminform           (2019) 11:73 \nMeanwhile, we also compared the prediction perfor ‑\nmance of ACID with other drug repurposing prediction \ntools. Due to the different requirement in drug repurpos ‑\ning study, there was not a uniform standard or a same \ndataset to evaluate drug repurposing prediction perfor\n‑\nmance. Hence, we use several criterion like AUC and \nTOP as indicators to evaluate the predictive performance \nof these studies. Compared with other drug repurpos\n‑\ning prediction tools, the AUC indicator of ACID is 0.84, \nwhich is a little lower than idTarget. But the sample set \nof ACID is 51 drugs and 91 known targets, which much \nlarger than idTarget and TarFisDock. In addition, ACID \ncan find 62 known targets in Top 2%, 76 known targets in \nTop 5%, and 91 known targets in Top 10%, which is bet\n‑\nter than TarFisDock. Compared with similarity compari ‑\nson based approaches, the prediction accuracy of ACID \nare still dominant. However, due to the nature of struc\n‑\ntural comparison between small molecules, the similar ‑\nity comparison based approaches may offer advantages \nsuch as faster computations and a larger tested sam\n‑\nple number. While, docking based approaches includes \nthree dimentional structures, structural optimization, \nconformational search, and binding energy calculation, \nwhich would obviously increase the computational cost. \nThus the test sample set is much smaller than similarity \napproach. However, they can potentially identify novel \ntargets for the drug which may be relevant for its mecha\n‑\nnism of action or side effect profile. Based on the above \nanalysis, we can infer that ACID keeps better or compar\n‑\native predictive ability compared with similar tools. The \ndetailed methods, sample sets, and accuracy of compari\n‑\nson were summarized in Table 1 [10, 11, 13, 41–44].\nServer usage and case study\nIn order to make online consensus inverse docking avail ‑\nable, we build a public web server ACID. The bench‑\nscientists can take advantage of the consensus inverse \ndocking method. Data collection, integration, web inter\n‑\nface, and applications of ACID were shown in Fig.  4. One \ncan search a commercial drug automatically by entering \nkeywords in the keyword search box, such as drug name, \nCAS no or InChI key. As shown in Fig.  5, the drug repur\n‑\nposing tasks can be submitted either by uploading or \ndrawing molecule in the JSME plugin. Then, each ligand \nwas converted into the Simplified Molecular Input Line \nEntry Specification (SMILES) representation by OpenBa\n‑\nbel [45] tools (http://openb abel.sourc eforg e.net/). The 3D \ninput of each ligand was produced from its SMILES using \nCorina (http://www.mol‑net.de) [46]. In addition, the \nuser need to customize target list from target database. \nTable 1 Several drug repurposing tools compared with ACID\na The sample set is number of positive/negative interactions for the similarity comparison based approaches, and is number of drugs/known targets/decoys for \ndocking algorithm based approaches\nb The AUC (Area Under Curve) is used to represent the prediction performance in the references cited, the closer the AUC value is to 1, the better the prediction \nperformance is\nc The TOP is the percentage of the top 2%/5%/10% candidates identified by the tools (except INVDOCK) to represent the prediction performance in the references \ncited, the higher the value of the TOP , the better the performance\nd For HitPick, a sensitivity of 60.94%, a specificity of 99.99% and a precision of 92.11% is indicated in the references cited, normally, we can infer that the AUC of this \ntool is smaller than 0.61\ne For INVDOCK, the TOP is the percentage of candidates identified by the tool, but the top percentage isn’t indicated in the references cited, the maximum value 50 is \nindicated\nName Method Sample  seta Prediction performance Date of last update Refs.\nAUC b TOP(2%/5%/10%)c\nSimilarity comparison based approaches\n ChemMapper 3D similarity approach 216/7069 0.7 – Dec 2016 [25]\n ChemProt 3.0 2D similarity approach 248/1700 0.827 – Jan 2015 [26]\n HitPick 1NN similarity search \napproach\n3430/3116926 0.61d – May 2013 [27]\n SwissTarget‑prediction Combination of 2D and 3D \nsimilarity approach\n346/1730 0.87 – Apr 2014 [28]\nDocking algorithm based approaches\n idTarget Divide and conquer based \ndocking approach\n1/3/1161, 1/4/1161 0.89, 0.91 – Aug 2015 [13]\n INVDOCK Inverse docking approach 2/23/2700 – 50%e May 2001 [10]\n TarFisDock Reverse docking approach 1/10/37, ··· 1/12/371 – 33%/33%/58%, \n30%/20%/50%\nAug 2014 [11]\n ACID Consensus inverse docking \napproach\n51/133/831 0.84 47%/57%/68% Dec 2018\nPage 8 of 11Wang et al. J Cheminform           (2019) 11:73 \nFig. 4 Schematic diagram describing data collection, integration, web interface, and applications of ACID web server\nFig. 5 A screenshot montage of some usages of ACID. The screenshot of browse, submit, and jobs modules of ACID, including basic target‑drug \ninformation, target classification, job submitting, and task management\nPage 9 of 11\nWang et al. J Cheminform           (2019) 11:73 \nAn ID number is generated for the submitted job. The \nuser can use the ID to check the status of the job on this \nweb server. The binding models (in PDB format) of the \nmolecule bound with the candidate targets can be down\n‑\nloaded through the “Download” hyperlink or browsed \nafter clicking the “Show” hyperlink.\nTo evaluate the usage of the ACID web server, two \nexamples are presented here. First, we show a test case \nusing Citalopram as the query structure to find its poten\n‑\ntial target proteins via ACID server. Table  S3 gives the \nresults of predicted binding affinities. The protein tar\n‑\nget of Citalopram, namely sodium‑dependent serotonin \ntransporter (Rank 1, top 2%) as validated in the scien\n‑\ntific report [47] are identified by ACID. Interestingly, the \nbinding pose of Citalopram against sodium‑dependent \nserotonin transporter with the rmsd of 0.98 Å compared \nto the crystal pose, indicating the reliability of this server. \nAnother example shows that not only the intended tar\n‑\ngets could be identified by ACID, but also other proteins, \nleading to ‘off‑target’ effects, which may have pharmaco\n‑\nlogical consequences for drug repurposing. Amitriptyline \nis a classic medicine with multiple targets. The primary \nuse is to treat a number of mental illnesses. It is particu\n‑\nlarly noteworthy that a very novel Amitriptyline repur ‑\nposing is for treatment of triple‑negative breast cancer \nby targeting on Poly (ADP‑ribose) polymerase‑1 (PARP1) \n[48], which is also predicted in the top 10% (rank 59) \nby ACID server. In addition, other uses include preven\n‑\ntion of migraines, treatment of neuropathic pain such as \nfibromyalgia and postherpetic neuralgia.\nConclusion\nAt the end of block ‑buster era for drug discovery, drug \nrepurposing is a promising approach to address the ‘pro ‑\nductivity gap’ that the global pharmaceutical giants are \ncurrently facing, which will improve the drug‑discovery \nproductivity. Inverse docking is proving to be a powerful \ntool for drug repurposing, which involves docking a drug \nin the potential binding cavities of a set of clinically rele\n‑\nvant macromolecular targets. The critical issues related to \ninverse docking part are the prediction of correct binding \npose and the estimation of some measure of the binding \naffinity. We have evaluated of several docking methods for \ninverse docking applications since the effectiveness of these \nmethods in multiple target identification is unclear. A con\n‑\nsensus inverse docking protocol was developed, which has \na ~ 10% enhancement in success rate compared with the \nbest single docking algorithm. Finally, an comprehensive \nweb platform with a user ‑friendly interface was designed \nbased on this protocol for drug repurposing to significantly \nreduce user time for data gathering and multi‑step analysis \nwithout human intervention, which consists of the follow\n‑\ning three tools: (i) an automated consensus inverse docking \nworkflow program, (ii) a compound database containing \n2086 approved drugs with original therapeutic informa\n‑\ntion, (iii) a known target database containing 831 protein \nstructures from PDB covering 30 therapeutic areas. Differ\n‑\nentiated with other tools, ACID outperforms other stan ‑\ndalone algorithm in a better accuracy and more efficient \nway in summary.\nSupplementary information\nSupplementary information accompanies this paper at https ://doi.\norg/10.1186/s1332 1‑019‑0394‑z.\nAdditional file 1. Additional tables and figures.\nAbbreviations\nADP‑ribose: adenosine diphosphate ribose; AUC : area under the ROC curve; \nCAS: chemical abstracts service; CID: consensus inverse docking; JSME: \nJavaScript Molecule Editor; InChI: international chemical identifier; MM/PBSA: \nmolecular mechanics/Poisson–Boltzmann surface are; NIH: The National Insti‑\ntutes of Health; PDB: protein data bank; NMR: nuclear magnetic resonance; \nPDTD: potential drug target database; RMSD: root‑mean‑square deviation; \nROC: receiver operating characteristic curve; SMILES: simplified molecular \ninput line entry specification.\nAcknowledgements\nThe authors thank Prof. C. Y. Hu from University of Hawaii for advice during the \nwriting.\nAuthors’ contributions\nG‑FH and G‑FY initiated the consensus inverse docking study. FW, C‑ZL, and \nS‑WS developed the protocol of consensus inverse docking. FW and F‑XW \ntested the performance described in the paper. FW and C‑ZL developed the \nserver and performed the analyses. FW, F‑XW, and C‑YJ set up the server. G‑FH, \nG‑FY, and FW wrote the manuscript. All authors read and approved the final \nmanuscript.\nFunding\nThis research was supported in part by the National Key R&D Program \n(2017YFD0200501), the National Natural Science Foundation of China (Nos. \n21772059, 91853127, and 31960548).\nAvailability of data and materials\nAll source code is available under open licenses on GitHub repository: https ://\ngithu b.com/fwang ccnu/ACID. All datasets of this study can be downloaded \nunder open licenses from the download page of the free web server http://\nchemy ang.ccnu.edu.cn/ccb/serve r/ACID.\nCompeting interests\nThe authors declare that they have no competing interests.\nAuthor details\n1 Key Laboratory of Pesticide & Chemical Biology, Ministry of Education, Col‑\nlege of Chemistry, Central China Normal University, Wuhan 430079, People’s \nRepublic of China. 2 International Joint Research Center for Intelligent Biosen‑\nsor Technology and Health, Central China Normal University, Wuhan 430079, \nChina. \n3 State Key Laboratory Breeding Base of Green Pesticide and Agri‑\ncultural Bioengineering, Key Laboratory of Green Pesticide and Agricultural \nBioengineering, Ministry of Education, Research and Development Center \nfor Fine Chemicals, Guizhou University, Guiyang 550025, People’s Republic \nof China. \n4 Collaborative Innovation Center of Chemical Science and Engineer‑\ning, Tianjing 300072, People’s Republic of China. \nReceived: 22 August 2019   Accepted: 9 November 2019\n\nPage 10 of 11Wang et al. J Cheminform           (2019) 11:73 \nReferences\n 1. Shih HP , Zhang XD, Aronov AM (2018) Drug discovery effectiveness from \nthe standpoint of therapeutic mechanisms and indications. Nat Rev Drug \nDiscov 17:19–33\n 2. Scannell JW, Blanckley A, Boldon H, Warrington B (2012) Diagnosing \nthe decline in pharmaceutical R&D efficiency. Nat Rev Drug Discov \n11:191–200\n 3. Anighoro A, Bajorath J, Rastelli G (2014) Polypharmacology: challenges \nand opportunities in drug discovery. J Med Chem 57:7874–7887\n 4. Santos R, Ursu O, Gaulton A, Bento AP , Donadi RS, Bologa CG, Karlsson A, \nAl‑Lazikani B, Hersey A, Oprea TI, Overington JP (2017) A comprehensive \nmap of molecular drug targets. Nat Rev Drug Discov 16:19–34\n 5. Dudley JT, Deshpande T, Butte AJ (2011) Exploiting drug‑disease relation‑\nships for computational drug repositioning. Brief Bioinform 12:303–311\n 6. Corsello SM, Bittker JA, Liu Z, Gould J, McCarren P , Hirschman JE, Johnston \nSE, Vrcic A, Wong B, Khan M et al (2017) The drug repurposing hub: \na next‑generation drug library and information resource. Nat Med \n23:405–408\n 7. Pushpakom S, Iorio F, Eyers PA, Escott KJ, Hopper S, Wells A, Doig A, Guil‑\nliams T, Latimer J, McNamee C et al (2018) Drug repurposing: progress, \nchallenges and recommendations. Nat Rev Drug Discov 18:41–58\n 8. Kharkar PS, Warrier S, Gaud RS (2014) Reverse docking: a powerful tool for \ndrug repositioning and drug rescue. Futur Med Chem 6:333–342\n 9. Lee A, Lee K, Kim D (2016) Using reverse docking for target identification \nand its applications for drug discovery. Expert Opin Drug Dis 11:707–715\n 10. Chen YZ, Zhi DG (2001) Ligand‑protein inverse docking and its potential \nuse in the computer search of protein targets of a small molecule. Pro‑\nteins 43:217–226\n 11. Zhang H, Li H, Jiang H, Shen J, Chen K, Yang K, Yu K, Kang L, Zhu W, Luo \nX et al (2006) TarFisDock: a web server for identifying drug targets with \ndocking approach. Nucleic Acids Res 34:W219–W224\n 12. Gao Z, Li H, Zhang H, Liu X, Kang L, Luo X, Zhu W, Chen K, Wang X, Jiang \nH (2008) PDTD: a web‑accessible protein database for drug target identi‑\nfication. BMC Bioinf 9:104–111\n 13. Wang JC, Chu PY, Chen CM, Lin JH (2012) idTarget: a web server for iden‑\ntifying protein targets of small chemical molecules with robust scoring \nfunctions and a divide‑and‑conquer docking approach. Nucleic Acids Res \n40:W393–W399\n 14. Liu Z, Fang H, Reagan K, Xu X, Mendrick DL, Slikker W, Tong W (2013) In \nsilico drug repositioning—what we need to know. Drug Discov Today \n18:110–115\n 15. Plewczynski D, Łażniewski M, Grotthuss MV, Rychlewski L, Ginalski K \n(2011) VoteDock: consensus docking method for prediction of protein–\nligand interactions. J Comput Chem 32:568–581\n 16. Wang R, Fang X, Lu Y, Wang S (2004) The PDBbind database: collection of \nbinding affinities for protein–ligand complexes with known three‑dimen‑\nsional structures. J Med Chem 47:2977–2980\n 17. Jones G, Willett P , Glen RC, Leach AR, Taylor R (1997) Development \nand validation of a genetic algorithm for flexible docking. J Mol Biol \n267:727–748\n 18. Li Y, Liu Z, Li J, Han L, Liu J, Zhao Z, Wang R (2014) Comparative assess‑\nment of scoring functions on an updated benchmark: 1. Compilation of \nthe test set. J Chem Inf Model 54:1700–1716\n 19. Maier JA, Martinez C, Kasavajhala K, Wickstrom L, Hauser KE, Simmerling \nC (2015) ff14SB: improving the accuracy of protein side chain and back‑\nbone parameters from ff99SB. J Chem Theory Comput 11:3696–3713\n 20. Garrett MM, Ruth H (2009) Software news and updates AutoDock4 and \nAutoDockTools4: automated docking with selective receptor flexibility. J \nComput Chem 30:2785–2791\n 21. Trott O, Olson AJ (2010) Software news and UPDATE AutoDock Vina: \nimproving the speed and accuracy of docking with a new scoring \nfunction, efficient optimization, and multithreading. J Comput Chem \n31:455–461\n 22. Allen WJ, Balius TE, Mukherjee S, Brozell SR, Moustakas DT, Lang PT, \nCase DA, Kuntz ID, Rizzo RC (2015) DOCK 6: impact of new features and \ncurrent docking performance. J Comput Chem 36:1132–1156\n 23. Korb O, Stutzle T, Exner TE (2009) Empirical scoring functions for \nadvanced protein‑ligand docking with plants. J Chem Inf Model \n49:84–96\n 24. Ng MCK, Fong S, Siu SWI (2015) PSOVina: the hybrid particle swarm \noptimization algorithm for protein‑ligand docking. J Bioinf Comput \nBiol 13:1–18\n 25. Verdonk ML, Cole JC, Hartshorn MJ, Murray CW, Taylor RD (2003) \nImproved protein‑ligand docking using GOLD. Proteins 52:609–623\n 26. Case DA (2016) Kollman PA Amber 2016. University of California, San \nFrancisco\n 27. Sun H, Li Y, Tian S, Xu L, Hou T (2014) Assessing the performance of \nMM/PBSA and MM/GBSA methods. 4. Accuracies of MM/PBSA and \nMM/GBSA methodologies evaluated by various simulation protocols \nusing PDBbind data set. Phys Chem Chem Phys 16:16719–16729\n 28. Chen F, Liu H, Sun H, Pan P , Li Y, Li D, Hou T (2016) Assessing the \nperformance of the MM/PBSA and MM/GBSA methods. 6. Capability \nto predict protein‑protein binding free energies and re ‑rank binding \nposes generated by protein–protein docking. Phys Chem Chem Phys \n18:22129–22139\n 29. Wang R, Lai L, Wang S (2002) Further development and validation of \nempirical scoring functions for structure ‑based binding affinity predic‑\ntion. J Comput Aided Mol Des 16:11–26\n 30. Cristian OP , Jaime RM (2007) Comparative evaluation of MMPBSA and \nXSCORE to compute binding free energy in XIAP ‑peptide complexes. J \nChem Inf Model 47:134–142\n 31. Wang R, Lu Y, Wang S (2003) Comparative evaluation of 11 scoring \nfunctions for molecular docking. J Med Chem 46:2287–2303\n 32. Hou TJ, Wang JM, Li YY, Wang W (2011) Assessing the performance \nof the molecular mechanics/poisson boltzmann surface area and \nmolecular mechanics/generalized born surface area methods. II. The \naccuracy of ranking poses generated from docking. J Comput Chem \n32:866–877\n 33. Hao GF, Zhu XL, Ji FQ, Zhang L, Yang GF, Zhan CG (2009) Understanding \nthe mechanism of drug resistance due to a codon deletion in protopor‑\nphyrinogen oxidase through computational modeling. J Phys Chem B \n113:4865–4875\n 34. Paul N, Rognan D (2002) ConsDock: a new program for the consensus \nanalysis of protein–ligand interactions. Proteins 47:521–533\n 35. Halgren TA (1996) Merck molecular force field. I. Basis, form, scope, param‑\neterization, and performance of MMFF94. J Comput Chem 17:490–519\n 36. Wishart DS, Feunang YD, Guo AC, Lo EJ, Marcu A, Grant JR, Sajed T, John‑\nson D, Li C, Sayeeda Z et al (2018) DrugBank 5.0: a major update to the \nDrugBank database for 2018. Nucleic Acids Res 46:D1074–D1082\n 37. Wu CH, Apweiler R, Bairoch A, Natale DA, Barker WC, Boeckmann B, Ferro \nS, Gasteiger E, Huang HZ, Lopez R et al (2006) The universal protein \nresource (UniProt): an expanding universe of protein information. Nucleic \nAcids Res 34:D187–D191\n 38. Berman H, Henrick K, Nakamura H, Markley JL (2007) The worldwide \nprotein data bank (wwPDB): ensuring a single, uniform archive of PDB \ndata. Nucleic Acids Res 35:D301–D303\n 39. Sing T, Sander O, Beerenwinkel N, Lengauer T (2005) ROCR: visualizing \nclassifier performance in R. Bioinformatics 21:3940–3941\n 40. Wang JC, Lin JH, Chen CM, Perryman AL, Olson AJ (2011) Robust scoring \nfunctions for protein–ligand interactions with quantum chemical charge \nmodels. J Chem Inf Model 51:2528–2537\n 41. Liu XF, Ouyang SS, Yu BA, Liu YB, Huang K, Gong JY, Zheng SY, Li ZH, Li \nHL, Jiang HL (2010) PharmMapper server: a web server for potential drug \ntarget identification using pharmacophore mapping approach. Nucleic \nAcids Res 38:W609–W614\n 42. Kringelum J, Kjaerulff SK, Brunak S, Lund O, Oprea TI, Taboureau O (2016) \nChemProt‑3.0: a global chemical biology diseases mapping. Datab J Biol \nDatab Curation 2016:1–7\n 43. Liu XP , Vogt I, Haque T, Campillos M (2013) HitPick: a web server for hit \nidentification and target prediction of chemical screenings. Bioinformat‑\nics 29:1910–1912\n 44. Gfeller D, Grosdidier A, Wirth M, Daina A, Michielin O, Zoete V (2014) Swis‑\nsTargetPrediction: a web server for target prediction of bioactive small \nmolecules. Nucleic Acids Res 42:W32–W38\n 45. O’Boyle NM, Banck M, James CA, Morley C, Vandermeersch T, Hutchison \nGR (2011) Open babel: an open chemical toolbox. J Cheminformatics \n3:33–47\nPage 11 of 11\nWang et al. J Cheminform           (2019) 11:73 \n•\n \nfast, convenient online submission\n •\n  \nthorough peer review by experienced researchers in your ﬁeld\n• \n \nrapid publication on acceptance\n• \n \nsupport for research data, including large and complex data types\n•\n  \ngold Open Access which fosters wider collaboration and increased citations \n \nmaximum visibility for your research: over 100M website views per year •\n  At BMC, research is always in progress.\nLearn more biomedcentral.com/submissions\nReady to submit y our researc h ?  Choose BMC and benefit fr om: \n 46. Sadowski J, Schwab CH, Gasteiger J (2003) 3D structure generation and \nconformational searching. Computational medicinal chemistry and drug \ndiscovery. Dekker Inc, New York, pp 2151–2212\n 47. Plenge P , Wiborg O (2005) High‑ and low‑affinity binding of S‑citalopram \nto the human serotonin transporter mutated at 20 putatively important \namino acid positions. Neurosci Lett 383:203–208\n 48. Fu L, Wang S, Wang X, Wang P , Zheng Y, Yao D, Guo M, Zhang L, Ouyang \nL (2016) Crystal structure‑based discovery of a novel synthesized PARP1 \ninhibitor (OL‑1) with apoptosis‑inducing mechanisms in triple‑negative \nbreast cancer. Sci Rep 6:3–18\nPublisher’s Note\nSpringer Nature remains neutral with regard to jurisdictional claims in pub‑\nlished maps and institutional affiliations.",
  "topic": "Drug repositioning",
  "concepts": [
    {
      "name": "Drug repositioning",
      "score": 0.7770117521286011
    },
    {
      "name": "Computer science",
      "score": 0.7440567016601562
    },
    {
      "name": "Workflow",
      "score": 0.690796434879303
    },
    {
      "name": "Leverage (statistics)",
      "score": 0.5384691953659058
    },
    {
      "name": "Drug discovery",
      "score": 0.5302827954292297
    },
    {
      "name": "Drug",
      "score": 0.45593518018722534
    },
    {
      "name": "Docking (animal)",
      "score": 0.4500676393508911
    },
    {
      "name": "Repurposing",
      "score": 0.434631884098053
    },
    {
      "name": "Drug development",
      "score": 0.4311745762825012
    },
    {
      "name": "Artificial intelligence",
      "score": 0.2599773406982422
    },
    {
      "name": "Bioinformatics",
      "score": 0.16104313731193542
    },
    {
      "name": "Pharmacology",
      "score": 0.13629591464996338
    },
    {
      "name": "Database",
      "score": 0.13372138142585754
    },
    {
      "name": "Medicine",
      "score": 0.09030723571777344
    },
    {
      "name": "Engineering",
      "score": 0.08494803309440613
    },
    {
      "name": "Biology",
      "score": 0.0
    },
    {
      "name": "Waste management",
      "score": 0.0
    },
    {
      "name": "Nursing",
      "score": 0.0
    }
  ]
}