{
    "title": "Tool-Use Training Induces Changes of the Body Schema in the Limb Without Using Tool",
    "url": "https://openalex.org/W2994636302",
    "year": 2019,
    "authors": [
        {
            "id": "https://openalex.org/A2097179453",
            "name": "Yu Sun",
            "affiliations": [
                "Nanjing University"
            ]
        },
        {
            "id": "https://openalex.org/A2140174875",
            "name": "Rixin Tang",
            "affiliations": [
                "Nanjing University"
            ]
        },
        {
            "id": "https://openalex.org/A2097179453",
            "name": "Yu Sun",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2140174875",
            "name": "Rixin Tang",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2000314002",
        "https://openalex.org/W1988939429",
        "https://openalex.org/W1984422811",
        "https://openalex.org/W2231865352",
        "https://openalex.org/W2433816315",
        "https://openalex.org/W2027759729",
        "https://openalex.org/W1964359788",
        "https://openalex.org/W2109574785",
        "https://openalex.org/W1887830303",
        "https://openalex.org/W2127765148",
        "https://openalex.org/W1976582030",
        "https://openalex.org/W2149775132",
        "https://openalex.org/W2075751896",
        "https://openalex.org/W2160391787",
        "https://openalex.org/W1979333836",
        "https://openalex.org/W1996692438",
        "https://openalex.org/W2163686172",
        "https://openalex.org/W2119233587",
        "https://openalex.org/W566905354",
        "https://openalex.org/W2060873042",
        "https://openalex.org/W1977190927",
        "https://openalex.org/W2124852372",
        "https://openalex.org/W2162241705",
        "https://openalex.org/W2073739897",
        "https://openalex.org/W2169564582",
        "https://openalex.org/W2934031659",
        "https://openalex.org/W2729829921",
        "https://openalex.org/W2586662136",
        "https://openalex.org/W2108879165",
        "https://openalex.org/W1500236778",
        "https://openalex.org/W1985578091",
        "https://openalex.org/W2029460250",
        "https://openalex.org/W2900785175",
        "https://openalex.org/W2097823092",
        "https://openalex.org/W2107126846",
        "https://openalex.org/W4254663788",
        "https://openalex.org/W2044160506",
        "https://openalex.org/W2119820506",
        "https://openalex.org/W2059265730",
        "https://openalex.org/W2087370997",
        "https://openalex.org/W1969734206",
        "https://openalex.org/W1999103523",
        "https://openalex.org/W2520128830"
    ],
    "abstract": "Previous studies have shown that tool use affects the plasticity of the body schema. In other words, people will perceive the tool as a part of their body, and thus feel like they have “longer limbs” after using tools. However, it is unclear whether tool embodiment could spread to a limb that is not using the tool, and whether other limbs could utilize the proprioception of a limb. In Experiment 1, blindfolded participants were asked to search with a cane (Condition 1) or to walk with a cane (Condition 2). The results in Condition 1 illustrated that the tactile distance perception on the forearm was lengthened after tool use, while other body parts did not significantly change. In Condition 2, the tactile distance perception on the hand and forearm extended significantly after using tools. Additionally, tool-use training even induced an increased perception of the calf that was not using the tool. Possible interference from the difference between walking and standing was excluded in Experiment 2. These results demonstrate that the proprioception information of one limb could be exploited by another limb to extend the body schema even though that limb was not using a tool. It was also observed that the effect of direction was task-dependent in the tactile perception task.",
    "full_text": "ORIGINAL RESEARCH\npublished: 20 December 2019\ndoi: 10.3389/fnhum.2019.00454\nEdited by:\nMariella Pazzaglia,\nSapienza University of Rome, Italy\nReviewed by:\nLuke Edward Miller,\nINSERM U1028 Centre de\nRecherche en Neurosciences de\nLyon, France\nMarco D’Alonzo,\nCampus Bio-Medico University, Italy\nJared Medina,\nUniversity of Delaware, United States\n*Correspondence:\nRixin Tang\ntrxtrx518@nju.edu.cn\nSpecialty section:\nThis article was submitted to Sensory\nNeuroscience, a section of the journal\nFrontiers in Human Neuroscience\nReceived: 29 June 2019\nAccepted: 09 December 2019\nPublished: 20 December 2019\nCitation:\nSun Y and Tang R (2019) Tool-Use\nTraining Induces Changes of the\nBody Schema in the Limb Without\nUsing Tool.\nFront. Hum. Neurosci. 13:454.\ndoi: 10.3389/fnhum.2019.00454\nTool-Use Training Induces Changes\nof the Body Schema in the Limb\nWithout Using Tool\nYu Sun and Rixin Tang*\nDepartment of Psychology, School of Social and Behavioral Sciences, Nanjing University, Nanjing, China\nPrevious studies have shown that tool use affects the plasticity of the body schema. In\nother words, people will perceive the tool as a part of their body, and thus feel like they\nhave “longer limbs” after using tools. However, it is unclear whether tool embodiment\ncould spread to a limb that is not using the tool, and whether other limbs could utilize\nthe proprioception of a limb. In Experiment 1, blindfolded participants were asked to\nsearch with a cane (Condition 1) or to walk with a cane (Condition 2). The results in\nCondition 1 illustrated that the tactile distance perception on the forearm was lengthened\nafter tool use, while other body parts did not signiﬁcantly change. In Condition 2,\nthe tactile distance perception on the hand and forearm extended signiﬁcantly after\nusing tools. Additionally, tool-use training even induced an increased perception of the\ncalf that was not using the tool. Possible interference from the difference between\nwalking and standing was excluded in Experiment 2. These results demonstrate that\nthe proprioception information of one limb could be exploited by another limb to extend\nthe body schema even though that limb was not using a tool. It was also observed that\nthe effect of direction was task-dependent in the tactile perception task.\nKeywords: tool use, body schema, tool embodiment, limb-speciﬁc hypothesis, proprioception, plasticity\nINTRODUCTION\nTool use contributes to human survival by allowing humans to reach inaccessible spaces\nand protect their bodies from harm. Many studies have revealed that participants tend to\nperceive tools as part of their own bodies after tool use, their perception of their body parts\nis extended, and their body schema is changed, which is also known as the phenomenon of\ntool embodiment (e.g., Iriki et al., 1996; Cardinali et al., 2009, 2011; Sposito et al., 2012).\nHumans use tools more efficiently and accurately when it is incorporated into the body\nschema, allowing the brain to control it just like other body parts (Cardinali et al., 2016a).\nPerhaps tool embodiment is more crucial for individuals who are more dependent on\nthe tools. For example, amputees could use prostheses to perform movements with greater\nflexibility, and blind people could use canes to explore the spaces around them more efficiently.\nFrontiers in Human Neuroscience | www.frontiersin.org 1 December 2019 | Volume 13 | Article 454\nSun and Tang No Tool-Use Alters Body Schema\nPrevious studies emphasized training a specific limb with the\ntool then testing the body schema of the same limb. Nonetheless,\nit is still unclear whether the phenomenon of tool embodiment\nis based on the specific limb or the general procedure for all\nlimbs. Some studies have discovered that using tools with the\nhand only changed the body schema of the forearm, but did not\nchange the body schema of the foot (Jovanov et al., 2015) or\nthe cheek (Miller et al., 2017a). Additionally, Miller et al. (2014)\nfound that only the limb that is similar to the morphology of a\ntool could be modified by tool use. However, in previous studies,\nthe participants used the tool with their hands, and the tool\naccordingly gave functional benefits to the hands by expanding\nthe space that the hands can reach. Therefore, it was reasonable\nthat the body schema of other limbs failed to change. It is still\nunclear whether the body schema of limbs that do not use a\ntool would change when tools give functional benefits to that\nlimb. If the body schema of the limb not using a tool changed,\nthen the tool embodiment is general to all limbs. Otherwise, tool\nembodiment is limb-specific.\nSensory input from multiple modalities–such as vision,\nproprioception, and tactile sensation—played an important role\nin the incorporation of tools into the body schema (Miller\net al., 2015; Cardinali et al., 2016b; Martel et al., 2019). The\nproprioception provides information on perceived position and\nmovement of limbs and the body without visual feedback\n(Gilman, 2002). It was considered that the proprioception was\nnecessary (Cardinali et al., 2016b) and sufficient (de Vignemont\net al., 2005; Martel et al., 2019) to induce the changes of the\nbody schema. Furthermore, the proprioceptive input may be\ndominant to the body representation even compared to vision\n(Shenton et al., 2004). Several neurophysiology and lesion studies\nhave also suggested that the body schema is predominantly\nbased on proprioception (Head and Holmes, 1911; Paillard, 1999;\nGallagher, 2005). It is clear that visual information could be\nused to control all limbs, but proprioception is fixed to the\nspecific limb. Blindfolded and blind participants could adapt\nto the new force environment on the basis of proprioception\n(DiZio and Lackner, 2000). The proprioceptive information from\none limb arrives at the primary somatosensory cortex (SI) from\nthe thalamus (Kaas et al., 1979). It was then possible for the\nproprioceptive information of one limb stored in the SI to be\nused by other limbs, so as to drive dynamic adaptation when\nwalking blindly. It should be noted that the visual feedback\nwas usually available in most of the tool studies previously\nconducted, in which the proprioception information did not\nmake a significant difference in the tasks. However, when the\nvisual feedback was absent, the limb not using the tool became\ndependent upon the proprioceptive information of the limb\nusing the tool to program its movement. It is interesting to study\nwhether the proprioception of the limb using the tool could be\nexploited by other limbs not using the tool, as well as whether the\nproprioceptive information related to tool could induce changes\nin the body schema of the limb not using the tool.\nIn this study, two experiments were conducted to investigate\nwhether tool embodiment could spread to the limb not using\nthe tool and whether proprioception is general to all limbs or\nspecific to one limb. In Experiment 1, blindfolded participants\nwere instructed to search for the target object with a cane\n(Condition 1) or to walk with a cane (Condition 2). They\nperformed a tactile distance perception task before and after\nthe training to investigate if the body schema of their hands,\nforearms, feet, or calves had changed. It was expected that\nlimbs that experienced a change in body schema would be\ndifferent between Condition 1 and Condition 2, even though\nthe same limb used the same tools in both experiments. Possible\ninterference from the difference between walking and standing\nwas studied in Experiment 2.\nEXPERIMENT 1\nParticipants\nFifty-six participants (31 females; mean age± SD: 21.71± 2.10;\nranging from 18 to 28 years of age) took part in Condition 1 and\nCondition 2. All participants were right-handed and had\nnormal or corrected normal vision. They all received monetary\ncompensation for their participation. All participants gave\nwritten and informed consent to participate in the study, which\nwas approved by the Ethical Committee of the Department of\nPsychology, Nanjing University. These participants also attended\nExperiment 2 on different days.\nApparatus and Procedures\nAs shown inFigure 1A, all participants were required to perform\ntwo experimental conditions and both experimental conditions\nwere composed of three phases: a pre- and post-tool-use session\n(18 trials × 4 blocks each), during which participants were\ninstructed to perform a tactile distance perception task, separated\nby a tool-use training session. The two experimental conditions\ndiffered only in the tool-use training session.\nThe specific experimental procedures were as follows. At the\nbeginning of the experiment, participants would be instructed\nto put on a blindfold, and this condition of having no vision\nwould last the entire experiment. Tactile distance perception task\nwould then be performed on the hands, forearms, feet, and calves\nof the participants. During this task, participants comfortably\nsat on a chair and placed their right hand on the table, while\nalso placing their right leg on the other chair. Every time before\nstarting the tactile distance perception task, participants would\npractice at least five times to ensure that they could complete the\ntask. This was interspersed with a tool-use training task between\ntwo tactile distance perception tasks. During the training task,\nparticipants were asked to search for the object with the cane\n(Condition 1) and walk with the cane (Condition 2) on two\ndifferent days.\nTactile Distance Perception Task\nThe tactile distance perception task is an implicit and sensitive\ntask for measuring the plasticity of the body schema (Taylor-\nClarke et al., 2004; de Vignemont et al., 2005; Longo and\nHaggard, 2011; Tajadura-Jiménez et al., 2012). In this task from\nprevious studies, participants were instructed to verbally report\nwhich body part (target body part, e.g., forearm; reference body\npart, e.g., forehead) that was touched was perceived longer\n(Canzoneri et al., 2013; Miller et al., 2014). In the version of\nFrontiers in Human Neuroscience | www.frontiersin.org 2 December 2019 | Volume 13 | Article 454\nSun and Tang No Tool-Use Alters Body Schema\nFIGURE 1 | Experimental design. (A) The entire experiment procedure was divided into three phases: pre-tool-use phase, tool-use-training phase (20 min), and\npost-tool-use phase. In the pre- and post-tool-use phases, participants performed a tactile distance perception task. The three types of tactile stimuli were\nadministered into their hands, forearms, feet, and calves in separate blocks. Every block included 18 trials.(B) In the searching with cane condition, participants were\ninstructed to use a cane to ﬁnd the target object, which would be randomly placed in one of 30 possible positions. The longitudinal distance covered a range of\n100–160 cm from the body of the participant to the target object, and the transversal distance covered a range of 0–90 cm. (C) In the walking with cane condition,\nparticipants were instructed to walk with a cane for 20 min.\nthe tactile distance perception task, participants made verbal\nestimations of the distance between two tactile points manually\napplied to the target body part (Longo and Sadibolova, 2013;\nMiller et al., 2017a). In the present study, the tactile distance\nperception task was adapted from Longo and Sadibolova (2013)\nand Miller et al. (2017a). Tactile points were administered\nmanually and longitudinally (from wrist to knuckles) to four\ntarget body parts (the dorsal surface of the right hand, right\nforearm, right foot, and right calf) with a stainless steel digital\ncaliper in separate blocks. There were three types of tactile\ndistances (separated by 20, 30, or 40 mm), and every tactile\ndistance was administered six times for a total of 18 trials in every\nblock. The order was random. The tactile stimuli administered\nto the body parts of the participants lasted for approximately 1 s,\nand then the participants verbally reported the estimated distance\nin millimeters. Participants were blindfolded throughout the\nprocedure. There was no limit to the time that participants made\ntheir verbal reports.\nTool-Use Training\nIn the condition of searching with a cane (seeFigure 1B), the\ntool-use training was adapted from Serino et al. (2007) and\nCanzoneri et al. (2013). The tool was a 120 cm aluminum\nalloy cane with a diameter of 13 mm. The blindfolded\nparticipants were required to find a 4× 4 × 8 cm wooden\ntarget object randomly placed in one of 30 different locations\non the table, and to knock the front, top left, and right\nsides of the target with the cane. There were three possible\nlongitudinal distances from the body (100 cm, 130 cm,\nand 160 cm), and 10 transversal positions covering a space\nranging from 0 to 90 cm. All participants stood at a fixed\nstarting position and used the cane with their right hands.\nAt the beginning of the training, the experimenter placed\nthe target object randomly in one of 30 possible locations\non the table, avoiding making any sounds that could give\nthe participants a hint about the exact location of the\nobject. Participants were then instructed to explore the space\nin front of them with the cane, imitating the movements\nthat blind people use with a cane until they found the\nobject. Once the participants found the target, they knocked\nit over. Then the experimenter removed the first object\nand placed another one on the table. There were no time\nconstraints for how quickly the participants had to find the\ntarget object.\nIn the condition of walking with the cane (seeFigure 1C ),\nthe tool-use training required blindfolded participants to walk\nFrontiers in Human Neuroscience | www.frontiersin.org 3 December 2019 | Volume 13 | Article 454\nSun and Tang No Tool-Use Alters Body Schema\nwith the cane in a similar way that a blind person would navigate\nhimself or herself. In the 20 min of training, participants needed\nto explore the space around them and find their way with the help\nof the tool. The tool was the same as that used in Condition 1. In\nthis experimental condition, the experimenter would accompany\nparticipants in case of accidents but avoided making any sounds\nthat could interfere with the participants. To reduce auditory\ninterference, rubber was attached to the bottom of the cane to\nlessen the sound. Additionally, participants were asked to use the\ncane in a similar way in the two tasks to reduce the effect of the\nsound caused by different usages of the tool.\nResults\nThe normality of data was checked and most of the data\nconformed to normal distribution. For the data that deviated\nfrom normality, either a repeated ANOVA was conducted after\nreplacing the outliers with means or a non-parametric test\nwas done when the outliers did not cause the deviation from\nnormality. As for the data satisfying the normal distribution,\nthree 2 (Condition: searching with cane, walking with cane)× 2\n(Phase: pre, post) × 3 (Tactile distance: 20 mm, 30 mm,\n40 mm) repeated measure ANOVAs were separately conducted\nfor the verbal estimated tactile distances of three limbs.\nThe current study concerned the different modulations under\ndifferent tool-use training tasks, where the interactions between\nfactors Condition and Phase was crucial to the goals of the\npresent study.\nFor the analysis of hands (seeFigure 2A), two non-parametric\ntests between pre- and post-tool use were conducted because\nShapiro–Wilk tests signaled that the data deviated from\nnormality. The non-parametric test of walking with cane\ncondition showed that there was a significantly increased\nperception after using tools ( p = 0.014). Meanwhile,\na marginally significant increase between pre- and post-tool use\nin the condition of searching with a cane (p = 0.066) was found.\nAdditionally, significant differences among three tactile distances\nin both conditions were found (pmax < 0.001), demonstrating\nthat participants indeed increased their estimations as the actual\ndistance increased.\nThe repeated ANOVA of arms (see Figure 2B ) showed\nsignificant main effects of Phase (F(1,55) = 14.135, p < 0.001,\nηp = 0.204) and Tactile distance (F(2,110) = 500.829, p <0.001,\nηp = 0.901). The main effect of Phase showed an increased\nperception after tool use in both conditions. No other\nmain effects or interactions were found (F(1,55)max = 2.518,\npmin = 0.118,ηp = 0.044).\nFor the repeated ANOVA of feet (seeFigure 2C), a significant\nmain effect of Tactile distance (F(2,110) = 970.033, p < 0.001,\nηp = 0.946) was found. There were no other main effects or\ninteractions (F(1,55)max = 2.308,pmin = 0.134,ηp = 0.040).\nFinally, for the analysis of calves, a repeated ANOVA was\nconducted. The results (seeFigure 2D) showed that there was\na significant interaction between factors Condition and Phase\n(F(1,55) = 7.223, p = 0.010, ηp = 0.116). Two significant main\neffects were found for Tactile distance ( F(2,110) = 459.361,\np <0.001, ηp = 0.893), and Phase (F(1,55) = 13.729, p <0.001,\nηp = 0.200). Simple effect on the calf showed that perceived tactile\nFIGURE 2 | Modulations of perceived distance on different limbs in\nCondition 1 and Condition 2. (A) The perceived distance of hand extended\nsigniﬁcantly in the task of walking with a cane, but it remained unaltered in the\nsearching with cane condition. (B) The estimated tactile distance of the\nforearm signiﬁcantly increased after tool use training of searching with cane\nand walking with cane. (C) The perceived distance of the foot in both\nconditions. (D) The perception of the calf extended signiﬁcantly after walking\nwith a cane, but it remained unchanged in the task of searching with cane.\n∗p <0.05, ∗∗p <0.01.\ndistance of post tool use was longer than that of pre tool use in\nthe condition of walking with cane (p <0.001), but it did not\nchange after tool use in the condition of searching with cane\nFrontiers in Human Neuroscience | www.frontiersin.org 4 December 2019 | Volume 13 | Article 454\nSun and Tang No Tool-Use Alters Body Schema\n(p = 0.468). No other main effects or interactions were observed\n(F(1,55)max = 2.849,pmin = 0.097,ηp = 0.049).\nEXPERIMENT 2\nA previous study has suggested that the peripersonal space\nexpands in the case of walking rather than standing still (Noel\net al., 2015). The body schema expansion of calf found in\nExperiment 1 might result from the walking movement. In\nExperiment 2, whether the walking movement would affect the\nbody schema of the calf was particularly emphasized.\nMethods\nThe participants were the same as that of Experiment\n1. The apparatus and procedures were consistent with\nCondition 2 except for the walking phase. In the walking\nphase of Experiment 2, participants were instructed to walk\nwithout the cane.\nResults\nThe tests of normality showed that all data including difference\nscores was normally distributed after replacing an outlier with\nmean. Two 2 (Phase: pre, post)× 3 (Tactile distance: 20 mm,\n30 mm, 40 mm) repeated measure ANOVAs were separately\nperformed with verbal distance estimations on the foot and\ncalf (see Figure 3 ). The repeated ANOVA of foot showed a\nsignificant main effect of Tactile distance (F(2,110) = 493.170,\np < 0.001, ηp = 0.900). No other main effect (F(1,55) = 3.289,\np = 0.075, ηp = 0.056) or interaction ( F(2,110) = 0.571,\np = 0.567, ηp = 0.010) was found. The repeated ANOVA of\ncalf implied that there were significant main effects of Phase\n(F(1,55) = 9.023, p = 0.004, ηp = 0.141) and Tactile distance\n(F(2,110) = 269.746, p < 0.001, ηp = 0.831). The main effect\nof Phase showed a decreased perception after walking without\ncane. There were no interaction (F(2,110) = 0.180, p = 0.836,\nηp = 0.003).\nThe effects of tool use in three different conditions on the calf\nand foot were calculated with difference scores (the estimated\ndistance of post tool use—the estimated distance of pre tool\nuse). Two 3 (Condition: searching with a cane, walking with\ncane, walking without a cane)× 3 (Tactile distance: 20 mm,\n30 mm, 40 mm) repeated measures ANOVAs were separately\nconducted for the foot and calf (seeFigure 4 ). The repeated\nANOVA of the foot suggested that there was a significant main\neffect of Condition (F(2,110) = 4.440, p = 0.014, ηp = 0.075).\nThe post hoctest showed that the estimated distance of walking\nwith cane condition was significantly longer than that of walking\nwithout cane (p = 0.003), but there were no significant differences\nbetween searching with cane and walking with cane (p = 0.185),\nor between searching with cane and walking without cane\n(p = 0.119). There were no other main effect (F(2,110) = 1.190,\np = 0.308,ηp = 0.021) or interaction (F(4,220)= 0.860,pmin = 0.489,\nηp = 0.015) on the foot. Additionally, a significant main effect\nof Condition was observed on the calf ( F(2,110) = 16.658,\np < 0.001, ηp = 0.232). Specifically, thepost hoc test showed\nthat there were significant differences between walking with\na cane and searching with a cane ( p = 0.004), significant\ndifferences between walking with cane and walking without\ncane (p <0.001), and significant differences between searching\nwith cane and walking without cane (p = 0.009). No other\nsignificant main effect (F(2,110) = 0.584, p = 0.559, ηp = 0.011)\nor interaction (F(4,220) = 1.151,p = 0.331,ηp = 0.021) on the calf\nwere found.\nDISCUSSION\nIn this study, the change in body schema of the limb not using\nthe tool that received functional benefits from the tool was\nFIGURE 3 | Modulations of the perceived distance of the foot and calf in Experiment 2. The perceived distance remained unchanged on the foot. However, the\nperceived distance of post tool use was signiﬁcantly shorter than that of pre tool use on the calf. ∗∗p <0.01.\nFrontiers in Human Neuroscience | www.frontiersin.org 5 December 2019 | Volume 13 | Article 454\nSun and Tang No Tool-Use Alters Body Schema\nFIGURE 4 | The comparison among three conditions with difference scores\nbetween pre and post tool use. There was a signiﬁcant difference on the foot\nbetween walking with cane condition and walking without cane condition.\nAdditionally, there were signiﬁcant differences among the three conditions on\nthe calf. ∗∗p <0.01.\ninvestigated, and whether proprioception was general to all limbs\nor specific to one limb was also analyzed. Two experiments were\nconducted to answer these questions. Blindfolded participants\nwere instructed to search for the target object with a cane\n(Condition 1) or walk with a cane (Condition 2). In Condition 1,\nit was revealed that the perceived tactile distance applied to\nthe forearm was significantly extended after tool use, and\nthe perception of the hand showed a marginally significant\nincrease after tool use, while the body schema of other limbs\nremained unaltered. In Condition 2, the results showed that the\ntactile distance perception on the hand and forearm extended\nsignificantly after using tools. Additionally, tool-use training\neven induced an increased perception of the calf that was not\nusing the tool. Furthermore, in Experiment 2, the potential\ninterference of walking was excluded by instructing participants\nto walk blindfolded without the cane.\nAs was predicted, the body schema of the forearm changed\nafter using the cane to touch the target object and to walk,\nwhich was consistent with previous studies (e.g., Iriki et al., 1996;\nCardinali et al., 2009, 2011; Sposito et al., 2012). Even though\nthe visual information was unavailable, it was still revealed\nthat participants exhibited extended forearms after tool use in\nExperiment 1, indicating that only proprioception could change\nbody schema (de Vignemont et al., 2005; Martel et al., 2019).\nAdditionally, the body schema of the hand showed a significantly\nincreased perception in Condition 2 and a marginally significant\nincreased perception in Condition 1, which was inconsistent with\nthe studies conducted by Miller et al. (2014). This was perhaps\ndue to differences in the experimental tasks. In the task of Miller\net al. (2014), participants squeezed a vertical handle to control\npincers at the tooltip. The movement of the hand either curling\nup or squeezing potentially caused the shrinkage of perception\non the hand. It may also cause the separation of the hand and\nforearm due to their different methods of movement. In the\npresent study, it is likely that the dorsal of the hand and forearm\nwere a whole because of the same movement used between\nthem. Moreover, the morphology of the dorsal of the hand was\nsimilar to that of the forearm and tool to some extent. Therefore,\nthe perception of the hands produced the same changes as\nthat of the forearms.\nIn Condition 2, when the cane was used by the hand to\nassist with walking, the body schema of the hand and forearm\nchanged. Importantly, the body schema of the calf that was not\nusing the tool experienced a change. The different modulations\non the calves between Condition 1 and Condition 2 suggest that\ndifferent functions of tool use caused different changes in the\nbody schema of limbs. This result is consistent with previous\nstudies emphasizing the functionality of tools. For example,\nthe functional length of the tool was more important to body\nrepresentation than physical length (Farnè et al., 2005; Sposito\net al., 2012). Additionally, Reed et al. (2010) found that the\nacceleration of target stimulus recognition only occurred at the\nfunctional side of the tool and that there was no effect on the\nother side.\nIn the present study, the functionality of tools even altered\nthe body schema of the limb not using the tool. One potential\nexplanation for this is that blindfolded participants in the walking\nwith cane condition paid more attention to the lower limbs than\nthat of searching with cane condition. The tactile perception then\nbecame larger after training. However, it is unlikely to happen\nbecause the visual attention is usually prioritized for the space\nnear the distal of limbs (Makin et al., 2007; Brozzoli et al., 2011;\nGentile et al., 2011) or the tip of tools (Maravita et al., 2001; Farnè\net al., 2005; Kao and Goodale, 2009; Reed et al., 2010), causing the\nfaster detection of visual targets. Therefore, it should have been\ndetermined that the body schema of the foot in Condition 2 was\naffected after tool use. It should be noted that the body schema of\nthe foot was not affected in the present study. A possible reason\nfor this is that the activation of leg muscles is fundamental to the\ncontrol of human walking (Franz and Kram, 2012) rather than\nthe foot muscles. Moreover, the vertical positional relationship\nbetween foot and calf while walking perhaps induced that the\nmorphology of cane was more similar to the calf. Thus, the\ncalf-shaped cane only changed the body schema of the calf, but\nnot that of the foot (Miller et al., 2014; Cardinali et al., 2016a).\nAnother possibility is that the sensorimotor representation of\nthe calf was activated when participants used the proprioceptive\ninformation obtained from the tooltip to program its movement\n(see Miller et al., 2017b). The triangle formed among the cane,\nthe calf, and the ground appeared to be an extension of the\nreachable area of the calf. In contrast, blindfolded participants\nwould not dare to walk without the cane due to the fear\nof falling, thus showing a slower walking speed (Hallemans\net al., 2010). The mental state of not daring to walk possibly\ninduced a perception that the reachable area of the calf was\nshrinking, further leading to a decreased perception of tactile\ndistance applied to the calf. The proprioception information\nobtained from the tooltip includes the perceived length of\nthe tools (Solomon et al., 1989), the size of object that came\ninto contact with the tool (Turvey et al., 1998), as well as\nthe relation between self and the surrounding environment\n(Harrison and Turvey, 2010; Turvey and Carello, 2011). In\nthe present study, proprioception information of tool use was\nFrontiers in Human Neuroscience | www.frontiersin.org 6 December 2019 | Volume 13 | Article 454\nSun and Tang No Tool-Use Alters Body Schema\nexploited to manage walking blindly, which is similar with the\nstudy conducted by Harrison and Turvey (2010), in which the\nblindfolded participants could have place learning by walking,\nstepping, and cane probing. Moreover, motor programming\nmight play a role in the plasticity of body schema since the\nmotor imagery (Baccarini et al., 2014) and visual illusion (Miller\net al., 2017b) of tool use can change the tactile perception on the\nstationary arms. This also suggests that the proprioception fixed\nto one limb can be used by another limb and change their body\nschema, reflecting the common representation of proprioception\nin the brain.\nIt should also be noted that an increased perception in the\ntactile distance within the current study was longitudinal and\nnot transversal. The increased perception in the longitudinal\norientation was interpreted as an increase in the represented size\nof the body part (de Vignemont et al., 2005; Tajadura-Jiménez\net al., 2012). However, this effect of direction was different from\nthe studies conducted by Canzoneri et al. (2013) and Miller et al.\n(2014), which were transversal. Romano et al. (2019) suggested\nthat shoulder- or wrist- training induced different changes in\nbody representation. The training of previous studies involved\narm retraction (Canzoneri et al., 2013) or bending (Miller et al.,\n2014), which depended more on the proximal part rather than\nthe distal part. In the present study, the arms of the participants\nstretched to use the cane to search or navigate in the tasks,\nwhich were more dependent on the distal part. This indicates the\ncurrent effect is task-dependent.\nOverall, the current study shows that different goals of tool use\ncaused the different changes of the body schema. Importantly,\ntool use could induce the body schema changes of the limb\neven though that limb was not using a tool. Furthermore, the\ndirect effect of tactile distance perception tasks might be task-\ndependent. Finally, the present study also tested and verified that\ntool use could cause the changes of body schema on the sole basis\nof proprioception.\nDATA AVAILABILITY STATEMENT\nThe datasets generated for this study are available on request to\nthe corresponding author.\nETHICS STATEMENT\nThis study was carried out in accordance with the\nrecommendations of the Ethical Committee, Nanjing\nUniversity. All participants gave written and informed consent\nto participate in the study. The protocol was approved by\nthe Ethical Committee of the Department of Psychology,\nNanjing University.\nAUTHOR CONTRIBUTIONS\nRT and YS designed the experiment, discussed the results and\nwrote the article. YS conducted the experiment and analyzed the\ndata under the supervision of RT.\nFUNDING\nThis study was supported by grants from the National Natural\nScience Foundation of China (Grant #31571131) to RT.\nREFERENCES\nBaccarini, M., Martel, M., Cardinali, L., Sillan, O., Farnè, A., and Roy, A. C.\n(2014). Tool use imagery triggers tool incorporation in the body schema.Front.\nPsychol. 5:492. doi: 10.3389/fpsyg.2014.00492\nBrozzoli, C., Gentile, G., Petkova, V. I., and Ehrsson, H. H. (2011). fMRI adaptation\nreveals a cortical mechanism for the coding of space near the hand.J. Neurosci.\n31, 9023–9031. doi: 10.1523/jneurosci.1172-11.2011\nCanzoneri, E., Ubaldi, S., Rastelli, V., Finisguerra, A., Bassolino, M., and\nSerino, A. (2013). Tool-use reshapes the boundaries of body and peripersonal\nspace representations. Exp. Brain Res. 228, 25–42. doi: 10.1007/s00221-013-\n3532-2\nCardinali, L., Brozzoli, C., Finos, L., Roy, A. C., and Farnè, A. (2016a). The rules\nof tool incorporation: tool morpho-functional and sensori-motor constraints.\nCognition 149, 1–5. doi: 10.1016/j.cognition.2016.01.001\nCardinali, L., Brozzoli, C., Luauté, J., Roy, A. C., and Farnè, A. (2016b).\nProprioception is necessary for body schema plasticity: evidence from a\ndeafferented patient.Front. Hum. Neurosci.10:272. doi: 10.3389/fnhum.2016.\n00272\nCardinali, L., Brozzoli, C., Urquizar, C., Salemme, R., Roy, A. C., and Farnè, A.\n(2011). When action is not enough: tool-use reveals tactile dependent\naccess to body schema. Neuropsychologia 49, 3750–3757. doi: 10.1016/j.\nneuropsychologia.2011.09.033\nCardinali, L., Frassinetti, F., Brozzoli, C., Urquizar, C., Roy, A. C., and Farnè, A.\n(2009). Tool-use induces morphological updating of the body schema.Curr.\nBiol. 19, R478–R479. doi: 10.1016/j.cub.2009.05.009\nde Vignemont, F., Ehrsson, H. H., and Haggard, P. (2005). Bodily illusions\nmodulate tactile perception.Curr. Biol.15, 1286–1290. doi: 10.1016/j.cub.2005.\n06.067\nDiZio, P., and Lackner, J. R. (2000). Congenitally blind individuals rapidly adapt\nto Coriolis force perturbations of their reaching movements.J. Neurophysiol.\n84, 2175–2180. doi: 10.1152/jn.2000.84.4.2175\nFarnè, A., Iriki, A., and Làdavas, E. (2005). Shaping multisensory action-\nspace with tools: evidence from patients with cross modal extinction.\nNeuropsychologia 43, 238–248. doi: 10.1016/j.neuropsychologia.2004.\n11.010\nFranz, J. R., and Kram, R. (2012). The effects of grade and speed on leg muscle\nactivations during walking.Gait Posture 35, 143–147. doi: 10.1016/j.gaitpost.\n2011.08.025\nGallagher, S. (2005). How the Body Shapes the Mind.New York, NY: Oxford\nUniversity Press.\nGentile, G., Petkova, V. I., and Ehrsson, H. H. (2011). Integration\nof visual and tactile signals from the hand in the human brain:\nan fMRI study. J. Neurophysiol. 105, 910–922. doi: 10.1152/jn.00\n840.2010\nGilman, S. (2002). Joint position sense and vibration sense: anatomical\norganisation and assessment. J. Neurol. Neurosurg. Psychiatry 73, 473–477.\ndoi: 10.1136/jnnp.73.5.473\nHallemans, A., Ortibus, E., Meire, F., and Aerts, P. (2010). Low vision affects\ndynamic stability of gait.Gait Posture32, 547–551. doi: 10.1016/j.gaitpost.2010.\n07.018\nHarrison, S., and Turvey, M. T. (2010). Place learning by mechanical contact.\nJ. Exp. Biol.213, 1436–1442. doi: 10.1242/jeb.039404\nHead, H., and Holmes, G. (1911). Sensory disturbances from cerebral lesions.\nBrain 34, 102–254. doi: 10.1093/brain/34.2-3.102\nIriki, A., Tanaka, M., and Iwamura, Y. (1996). Coding of modified body schema\nduring tool use by macaque postcentral neurones.Neuroreport 7, 2325–2330.\ndoi: 10.1097/00001756-199610020-00010\nFrontiers in Human Neuroscience | www.frontiersin.org 7 December 2019 | Volume 13 | Article 454\nSun and Tang No Tool-Use Alters Body Schema\nJovanov, K., Clifton, P., Mazalek, A., Nitsche, M., and Welsh, T. N. (2015). The\nlimb-specific embodiment of a tool following experience.Exp. Brain Res.233,\n2685–2694. doi: 10.1007/s00221-015-4342-5\nKaas, J. H., Nelson, R. J., Sur, M., Lin, C. S., and Merzenich, M. M. (1979).\nMultiple representations of the body within the primary somatosensory cortex\nof primates.Science 204, 521–523. doi: 10.1126/science.107591\nKao, C., and Goodale, M. A. (2009). Enhanced detection of visual targets on\nthe hand and familiar tools.Neuropsychologia 47, 2454–2463. doi: 10.1016/j.\nneuropsychologia.2009.04.016\nLongo, M. R., and Haggard, P. (2011). Weber’s illusion and body shape: anisotropy\nof tactile size perception on the hand.J. Exp. Psychol. Hum. Percept. Perform.\n37, 720–726. doi: 10.1037/a0021921\nLongo, M. R., and Sadibolova, R. (2013). Seeing the body distorts tactile size\nperception. Cognition 126, 475–481. doi: 10.1016/j.cognition.2012.11.013\nMakin, T. R., Holmes, N. P., and Zohary, E. (2007). Is that near my hand?\nMultisensory representations of peripersonal space in human intraparietal\nsulcus. J. Neurosci.27, 731–740. doi: 10.1523/jneurosci.3653-06.2007\nMaravita, A., Husain, M., Clarke, K., and Driver, J. (2001). Reaching with a\ntool extends visual-tactile interactions into far space: evidence from cross-\nmodal extinction.Neuropsychologia 39, 580–585. doi: 10.1016/s0028-3932(00)\n00150-0\nMartel, S., Cardinali, L., Bertonati, G., Joufrais, C., Finos, L., Farnè, A., et al. (2019).\nSomatosensory-guided tool use modifies arm representation for action.Sci.\nRep. 9:5517. doi: 10.1038/s41598-019-41928-1\nMiller, L. E., Cawley-Bennett, A., Longo, M. R., and Saygin, A. P. (2017a). The\nrecalibration of tactile perception during tool use is body-part specific.Exp.\nBrain Res.235, 2917–2926. doi: 10.1007/s00221-017-5028-y\nMiller, L. E., Longo, M. R., and Saygin, A. P. (2017b). Visual illusion of tool use\nrecalibrates tactile perception.Cognition 162, 32–40. doi: 10.1016/j.cognition.\n2017.01.022\nMiller, L. E., Longo, M. R., and Saygin, A. P. (2014). Tool morphology constrains\nthe effects of tool use on body representations.J. Exp. Psychol. Hum. Percept.\nPerform. 40, 2143–2153. doi: 10.1037/a0037777\nMiller, L. E., Longo, M. R., and Saygin, A. P. (2015). Vision during tool use is\nboth necessary and sufficient for recalibration of tactile perception of body size.\nJ. Vision15:362. doi: 10.1167/15.12.362\nNoel, J. P., Grivaz, P., Marmaroli, P., Lissek, H., Blanke, O., and Serino, A.\n(2015). Full body action remapping of peripersonal space: the case of walking.\nNeuropsychologia 70, 375–384. doi: 10.1016/j.neuropsychologia.2014.08.030\nPaillard, J. (1999). ‘‘Body schema and body image: a double dissociation\nin deafferented patients,’’ in Motor Control Today and Tomorrow ,\neds G. Gantchev, S. Mori, and J. Massion (Sophia: Academic Publishing\nHouse), 197–214.\nReed, C. L., Betz, R., Garza, J. P., and Roberts, R. J. (2010). Grab it! Biased attention\nin functional hand and tool space.Atten. Percept. Psychophys. 72, 236–245.\ndoi: 10.3758/app.72.1.236\nRomano, N., Uberti, E., Caggiano, P., Cocchini, G., and Maravita, A. (2019).\nDifferent tool training induces specific effects on body metric representation.\nExp. Brain Res.237, 493–501. doi: 10.1007/s00221-018-5405-1\nSerino, A., Bassolino, M., Farnè, A., and Làdavas, E. (2007). Extended multisensory\nspace in blind cane users.Psychol. Sci.18, 642–648. doi: 10.1111/j.1467-9280.\n2007.01952.x\nShenton, J. T., Schwoebel, J., and Coslett, H. B. (2004). Mental motor imagery and\nthe body schema: evidence for proprioceptive dominance.Neurosci. Lett.370,\n19–24. doi: 10.1016/j.neulet.2004.07.053\nSolomon, H. Y., Turvey, M. T., and Burton, G. (1989). Perceiving rod extents\nby wielding: haptic diagonalization and decomposition of the inertia tensor.\nJ. Exp. Psychol. Hum. Percept. Perform.15, 58–68. doi: 10.1037/0096-1523.\n15.1.58\nSposito, A., Bolognini, N., Vallar, G., and Maravita, A. (2012). Extension of\nperceived arm length following tool-use: clues to plasticity of body metrics.\nNeuropsychologia 50, 2187–2194. doi: 10.1016/j.neuropsychologia.2012.\n05.022\nTajadura-Jiménez, A., Väljamäe, A., Toshima, I., Kimura, T., Tsakiris, M., and\nKitagawa, N. (2012). Action sounds recalibrate perceived tactile distance.Curr.\nBiol. 22, R516–R517. doi: 10.1016/j.cub.2012.04.028\nTaylor-Clarke, M., Jacobsen, P., and Haggard, P. (2004). Keeping the world a\nconstant size: object constancy in human touch.Nat. Neurosci. 7, 219–220.\ndoi: 10.1038/nn1199\nTurvey, M. T., Burton, G., Amazeen, E. L., Butwill, M., and Carello, C. (1998).\nPerceiving the width and height of a hand-held object by dynamic touch.J. Exp.\nPsychol. Hum. Percept. Perform.24, 35–48. doi: 10.1037/0096-1523.24.1.35\nTurvey, M. T., and Carello, C. (2011). Obtaining information by dynamic\n(effortful) touching. Phil. Trans. R. Soc. B Biol Sci. 366, 3123–3132.\ndoi: 10.1098/rstb.2011.0159\nConﬂict of Interest : The authors declare that the research was conducted in the\nabsence of any commercial or financial relationships that could be construed as a\npotential conflict of interest.\nCopyright © 2019 Sun and Tang. This is an open-access article distributed under the\nterms of the Creative Commons Attribution License (CC BY). The use, distribution\nor reproduction in other forums is permitted, provided the original author(s) and\nthe copyright owner(s) are credited and that the original publication in this journal\nis cited, in accordance with accepted academic practice. No use, distribution or\nreproduction is permitted which does not comply with these terms.\nFrontiers in Human Neuroscience | www.frontiersin.org 8 December 2019 | Volume 13 | Article 454"
}