{
    "title": "Improved localized fatigue wear resistance of large forging tools using a combination of multiple coupled bionic models",
    "url": "https://openalex.org/W2990552039",
    "year": 2019,
    "authors": [
        {
            "id": "https://openalex.org/A2989811579",
            "name": "Benfeng Zhi",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2100068131",
            "name": "Ti Zhou",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1990083746",
            "name": "Hong Zhou",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1972955069",
            "name": "Peng Zhang",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2121527847",
            "name": "Siyuan Ma",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2104952476",
            "name": "Geng Chang",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2284127301",
        "https://openalex.org/W2083281833",
        "https://openalex.org/W2067781546",
        "https://openalex.org/W2089262724",
        "https://openalex.org/W2080789850",
        "https://openalex.org/W2004409927",
        "https://openalex.org/W2000272967",
        "https://openalex.org/W2103159826",
        "https://openalex.org/W2750237786",
        "https://openalex.org/W2055143792",
        "https://openalex.org/W2754547199",
        "https://openalex.org/W2808109753",
        "https://openalex.org/W2014418261",
        "https://openalex.org/W2006490884",
        "https://openalex.org/W2062613656",
        "https://openalex.org/W2002315675",
        "https://openalex.org/W2885612832"
    ],
    "abstract": null,
    "full_text": "Vol.:(0123456789)\nSN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9\nResearch Article\nImproved localized fatigue wear resistance of large forging tools using \na combination of multiple coupled bionic models\nBenfeng Zhi1,2 · Ti Zhou2,3  · Hong Zhou1,2 · Peng Zhang1,2 · Siyuan Ma1,2 · Geng Chang1,2\nReceived: 27 September 2019 / Accepted: 22 November 2019 / Published online: 25 November 2019 \n© Springer Nature Switzerland AG 2019\nAbstract\nIt is important to solve the partial fatigue wear of large forging dies, where the service life can be short. The purpose of \nthis paper is to use laser remelting biomimetic technology to prepare a coupling biomimetic model combination on the \nmold surface, strengthen the local fatigue wear resistance of the mold, and extend the service life of the mold. Three \ntypes of laser energies were used to prepare the coupling biomimetic elements and analyze the microstructure and \nphase composition of the specific gravity melting zone. The biomimetic units were combined into a variety of coupling \nbiomimetic models (fringe, mesh, and dense array models with different laser energies), and the number of fatigue \ncracks and the weight of wear loss of the coupling biomimetic model were compared at different temperatures. The \nmechanism of the coupling bionic model was analyzed, and the coupling bionic surface with a dense row structure was \ndetermined to have strong anti-fatigue wear performance. According to the Range Method, the relationship between \nwear and fatigue temperature and laser energy of the coupled bionic model was determined. Using DEFORM software to \nsimulate the stress, temperature, and wear conditions of the front axle die surface, different coupling biomimetic model \ncombinations were prepared on the abrasive surface. The die wear and cut edge width of the forgings were reduced \nafter practical production, which proved that the laser bionic local strengthening method can effectively prolong the \nservice life of a die.\nKeywords Localized fatigue wear resistance · Coupling bionic model combination · Large forging tool · Laser remelt \ntechnology\n1 Introduction\nDue to the harsh working environment of forging dies, the \nplastic flow and fatigue cycle of the blank in the forging \nprocess lead to fatigue cracks and wear on the surface of \nthe die [1], resulting in decreased service life. Research has \nfound that the volume of the front axle mold of the truck \n(size: 2010 × 655 × 324 mm\n3) is dozens of times that of the \nconnecting rod mold, but the service life is about one \nthird of the connecting rod mold and experiences une -\nven wear, leading to significant waste of mold production \nand processing resources. Therefore, to explore the fail-\nure mechanism of large forging molds, DEFORM simula-\ntion software was used to carry out machining simula-\ntions of large forging molds (as shown in Fig.  1), and the \nmechanism leading to mold failure was determined and \nanalyzed. It can be found from the figure that the surface \nworking temperature of large forging dies is between 280 \nand 701 °C, and the contact and heat transfer time are dif-\nferent. It has been determined that the problem of uneven \ncontact and heat transfer between forgings and molds will \noccur in the production process. As a result, the working \n * Ti Zhou, zhouti_jlu@163.com | 1College of Material Science and Engineering, Jilin University, Changchun 130025, \nPeople’s Republic of China. 2Key Laboratory of Automobile Materials (Jilin University), Ministry of Education, Changchun 130025, \nPeople’s Republic of China. 3School of Mechanical Science and Aerospace Engineering, Jilin University, Changchun 130025, \nPeople’s Republic of China.\nVol:.(1234567890)\nResearch Article SN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9\nface experiencing high temperature appears to suffer from \nserious fatigue and wear, which leads to scrap failure of the \nmold and shortens the service life of the mold. Therefore, \nit is necessary to strengthen the surface of the mold to \nextend its service life.\nAt present, die surface strengthening technology such \nas chemical heat treatment strengthening, surface plating \nstrengthening, high-density surface strengthening, and \npre-hardening technology of die steel [2 ] usually takes \nthe whole die as the strengthening object.\nHowever, the above strengthening technologies have \nlimitations when dealing with large forging dies. For exam-\nple, to enhance the wear resistance, fatigue resistance, and \nplastic deformation resistance of the mold, a factory will \ncarry out nitriding treatment on the surface of the mold, \nwhich is a process that is complex, time-consuming, and \ncostly [3]. Although a hard nitriding layer will be formed on \nthe surface of the mold after nitriding treatment, mechanical \ncracks will also be formed under the action of cyclic stress, \nleading to scrapping of the mold. A way to overcome this is \nto increase the thickness of the nitriding layer, but this leads \nto high manufacturing costs due to a much longer nitriding \ntreatment and can be quite complex. Therefore, it is impor-\ntant to improve localized anti-fatigue and wear performance \nof the die without using complex secondary processes.\nBionics is a multidisciplinary and comprehensive disci-\npline. It is the result of the mutual penetration and inte -\ngration of life sciences and engineering technology. The \nresearch content has evolved from the bionic development \nof biological structure and structure to the bionics of mate-\nrial preparation. Engineering bionics is the intersection of \nbionics and engineering science. Starting from engineering \nneeds, learning and simulating biology, research goals focus \non technological invention and engineering creation. For \nexample, energy savings and material reduction in the auto-\nmotive industry is an important goal pursued by the indus-\ntry, and it is also an urgent need in the field of automotive \nengineering. So, through the study of bionics, it has been \nfound that the body surface of many organisms has evolved \nover millions of years to form non-smooth surfaces to adapt \nto different living environments [4]. Yet there is more than \none factor at work in adapting organisms to their environ-\nment. It is the result of the coupling and coordination of \ndifferent forms, structures, and materials of organisms. For \nexample, dragonfly wings [5] have complex microstructures \nand are primarily composed of membranes, which are sup-\nported by longitudinal and transverse venous networks. As \na result, it can survive harsh conditions.\nIn this study, large automotive forging molds were the \nprimary research objects. It can be useful to utilize biomi-\nmetic concepts and laser biomimetic remelting technol-\nogy to prepare a coupling biomimetic model in the areas \nof significant fatigue wear on the surface of the mold and \nimprove the service life of the mold. Laser remelt tech-\nnology as an advanced technology adopts high-power-\ndensity and high-intensity laser beams to heat the material \nsurfaces in a non-contact way, which enables rapid cool-\ning and obtains different tissues from the substrate. The \nlaser remelt coupling technology is used to prepare the \ncoupled bionic model combinations with different mor -\nphologies on the surface of the material. Coupling bionic \nsurfaces are formed between the combinations, which has \nbroad research prospects in improving the service life of \nthe mold.\nFig. 1  Surface temperature \nfield distribution of large forg-\ning die\n\nVol.:(0123456789)\nSN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9 \n Research Article\nLaser coupling biomimetic surfaces [6, 7] is an effective \nway to prepare biomimetic morphology and structure on \nthe material surface to improve the material performance \nwithout changing the material matrix. Many research \npapers have focused on this solution relative to die fatigue \nwear. Zhang et al. [8] found that the average peak power \ndensity and effective peak power density have significant \nimpacts on the size and morphology of the unit. When \nthe effective peak power density was 595–1448 W/mm\n2, \na coupling bionic unit with higher hardness was obtained. \nIn addition, Wang et al. [9 ] studied the mechanical prop -\nerties of coupling biomimetic units prepared under dif-\nferent laser energy densities and determined that the \nunits prepared with a laser energy density of 160 J/cm\n2 \nshowed good tensile properties. The tensile properties \nof the unit tend to decrease with an increase in energy \ndensity. In addition, the mechanical properties of coupling \nbionic units with different spacings were also discussed, \nwhich verifies that the strength of the coupling bionic unit \nincreases with the density of the unit [10]. The laser biomi-\nmetic remelting unit was prepared on AISI H13 die steel \nsurfaces by using laser biomimetic remelting technology. \nThe effects of different unit appearance [11], unit size [12], \nand sample surface alloying [13] on the fatigue properties \nof laser biomimetic remelting samples were studied. It was \nconcluded that a U-shaped laser biomimetic remelting \nunit shows a mechanism of micro strengthening and crack \ntip passivation and provides properties of oxidative corro-\nsion resistance, so as to improve the fatigue resistance of \nthe sample. In a practical application, Shi et al. [ 14] used \nlaser melting technology to prepare a bionic coupling \nbrake disc, and the results showed that the bionic unit \nplays a role in strengthening the braking and effectively \nresisting crack initiation and propagation. However, there \nare few studies and applications of laser remelt coupling \nbiomimetic technology to fabricate coupling biomimetic \nsurfaces for large forging dies.\n2  Materials and experimental methods\nThe die used in this research was a forging die for the front \naxle of a truck. The grade of die steel was 4Cr2MoVNi, and \nthe composition was (wt%): C 0.41, Cr 2.06, Mo 0.46, Ni \n1.49, Mn 0.68, and Si 0.25, with an annealed micro-hard-\nness of  345HV\n0.3. Using DK7732 edm equipment produced \nby the Huadong group, the material was cut into rectangu-\nlar samples of 40 mm × 20 mm × 6 mm. A round hole with a \ndiameter of 3 mm was cut at one end of the sample to be \nsuspended on the suspension frame of the fatigue testing \nmachine. 80–600 mesh sandpaper was used to polish both \nsides of each sample to eliminate the influence of machin-\ning marks on the experiment.\nUnder the work of other personnel in this group, the \nanti-wear properties of the oblique stripe-coupled bio -\nmimetic specimens with inclination angles of 0°, 30°, 45°, \n60°, and 90° were tested. According to the experimental \nresults, the wear properties at 45° were best. Therefore a \nstripe-like coupling bionic unit model when at a tilt angle \nof 45° was chosen, according to previous experience \n[15–17]. Therefore, a 400 W ND-Yag (YASKAWA) laser was \nused, and the laser parameters are shown in Table 1. Strip \nand mesh coupling monomer models with a spacing of \n2 mm were prepared under the polished sample surface, \nas shown in Fig. 2a. The microstructure and phase compo-\nsition of coupling bionic units were analyzed by scanning \nelectron microscopy (SEM) (Zeiss, Evo 18, Germany) and \nX-ray diffraction (XRD) (D/Max, 2500 PC, Japan) prior to the \nfatigue test. An HXD-1000 Vickers micro-hardness tester \nwas used to measure the micro-hardness of the coupling \nunit and substrate under 0.30 kg loading, 10 s holding \ntime, and a test point distance of 0.1 mm.\nAfter fastening all samples with fine wire, they were \nsuspended in batches in the self-made high-temperature \ninduction fatigue test furnace. The working principle of \nthe fatigue furnace is shown in Fig. 3. The fatigue furnace \nis primarily composed of a control system, a high-tem-\nperature induction heating furnace, and a cooling water \ntank. The control system can set the furnace tempera-\nture, sample holding time, and control motor rotation \ndirection and time. The water tank was cooled by flowing \nwater to maintain the temperature at room temperature. \nThe working process of the fatigue furnace is that the \nblank samples and the samples with the coupling bionic \nunit were fastened with fine iron wires, respectively, and \nsuspended in the self-made high-temperature induc -\ntion fatigue test furnace at 500 °C, 600 °C, and 700 °C in \nbatches. When the thermocouple display reached the \nTable 1  Laser parameters used No. Electric cur-\nrent (A)\nPulse duration \n(ms)\nDefocusing \namount (mm)\nFrequency \n(Hz)\nSpeed \n(mm/s)\nLaser \nenergy (J/\ncm\n2)\n1 160 7 154 4 1 153.5\n2 170 6 154 4 1 161.3\n3 180 6 154 4 1 174.5\nVol:.(1234567890)\nResearch Article SN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9\ntarget requirement, the holding time was 180 s, and \nthen the samples were transferred to the water tank \nand cooled to room temperature. This fatigue test was \nrepeated 3600 times. After every 400 times, the samples \nwere soaked in 3% HCl to remove the oxide skin on the \nsurface. The sample was then washed in anhydrous etha-\nnol with ultrasonic cleaning equipment and ventilated \nto dry.\nThe three batches of samples after the fatigue tests \nwere placed into a customized linear reciprocating fric -\ntion and wear machine for the surface friction and wear \ntest. The wear testing machine motor drives the eccen -\ntric wheel to induce linear reciprocating friction and wear \nmovement. The experimental load was 50 N, the wear \ntime was 10 h, and the motor speed was 690 RPM. Before \nand after the tests, the samples were cleaned ultrasoni-\ncally with anhydrous ethanol, and then dried with a hair \ndryer before weighing. To ensure weight measurement \naccuracy, a JA5003 analytical balance (Shanghai anting \nelectronic instrument factory) with an accuracy of 0.001 g \nwas used to measure each sample five times. The wear per-\nformances of the laser bionic samples were studied using \nweight changes before and after the wear tests, wear mor-\nphology of the sample surface, and the coupling bionic \nunit in the resistance to wear.\nIn actual production conditions, a forging press with a \nload of 12,500 KN (Germany) was used for experimental \nproduction. The blank is Q235 and heated to 1200 °C for \nforging. According to the wear conditions of the forging \nsurface and the developing trend of cut edge width, the \nmold performance was evaluated, and the reliability of \nthe laboratory results in production and processing was \nverified.\nFig. 2  a Laser biomimetic coupling model sample and b unit shape\nFig. 3  Working principle diagram of fatigue machine\nVol.:(0123456789)\nSN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9 \n Research Article\n3  Results and discussion\n3.1  Coupling biomimetic unit microstructure \nanalysis\nAs shown in Fig.  4a, the structure of the coupling bionic \nelement was divided into the melting zone and heat-\naffected zone. Figure  4b, c show that the grain size in \nthe melting zone is refined and distributed in a more \nuniform and regular grid shape. However, the grain \nboundary of the substrate is fuzzy, and the size is differ -\nent from that of the melting unit. The results show that \nthe laser remelting technology can rapidly solidify the \nsubstrate and refine the grain. Figure  4d shows the XRD \npattern of the substrate and unit. It was concluded that \nthe phase composition of the laser melting unit and sub -\nstrate is martensite. In the XRD patterns, the half-peak \nfull widths (FWHM) of the same diffraction peaks were \ncompared. The FWHM of the unit was 0.393, which was \nslightly higher than the FWHM of the substrate at 0.334. \nAccording to Scherrer’s classical formula and Berks’  \nempirical formula, it was concluded that laser remelting \nbionics technology can promote martensification, refine \ngrains, increase dislocation, and strengthen properties. \nThe average micro-hardness of the unit was  612HV\n0.3, \nwhich was higher than that of the substrate.\nFig. 4  a Heat-affected zone and substrate in the fusion zone b 5 k units scanning images c. 5 k substrate scanning images d XRD diagrams\nVol:.(1234567890)\nResearch Article SN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9\n3.2  Fatigue test\nIn engineering applications, a crack length greater than \n0.25 mm is defined as the effective length [18]. Figure  5 \nshows the histogram of the number and length of surface \ncracks after 3600 fatigue tests. It was observed from the \nfigure that the number and maximum length of fatigue \ncracks significantly increased with an increase of fatigue \ntemperature. In addition, with the increase of laser energy, \nthe number and length of the fatigue cracks on the sur -\nfaces of the samples remain unchanged. The crack length \nand number of cracks of the untreated samples at differ -\nent temperatures were significantly higher than that of the \nlaser-coupled biomimetic samples. The number of cracks \non the bionic surface of densely arranged structures were \nreduced by about 30%.\nIt was observed from the figure that with the increase \nin fatigue temperature, the number of surface fatigue \ncracks of the same kind of coupled biomimetic samples \nafter the same kind of laser energy processing was obvi-\nously improved. Under the same laser energy, the number \nof fatigue cracks on the surface of the sample decreases \nwith the change of the coupled bionic model. The spe -\ncific regular is dense sample < grid sample < stripe sam-\nple; under the same fatigue temperature, the number of \nfatigue cracks on the surface of the sample did not sig-\nnificantly increase with the increase of laser energy. The \npreliminary conclusion is that the laser energy shows \nno obvious influence on the initiation and propagation \nof fatigue crack. Figure  5b1–b3 show the histograms of \nthe maximum crack length on the surface of the coupled \nbionic sample processed by three laser parameters after \n3600 fatigue tests. Compared with the blank samples, \nthe maximum crack lengths of all coupled bionic sur -\nfaces were smaller than that of the blank samples. With \nthe increase in fatigue temperature, the maximum crack \nlength of the bionic model prepared with the same laser \nenergy increases. With an increase in laser energy, the \nmaximum crack length of the same coupling bionic model \nat the same fatigue temperature is slightly shortened, but \nthere is no obvious rule in the overall change. Finally, at the \nsame laser energy and fatigue temperature, the maximum \nnumber of cracks was compared, and it was found that the \ndense sample < grid sample < stripe sample. Therefore, it \nwas concluded that the length and number of cracks in \nuntreated samples at different temperatures were signifi-\ncantly higher than those in laser-coupled bionic samples. \nTherefore, among the samples with coupled bionic sur -\nface, the fatigue resistance of samples with grid sample is \nstronger than the stripe samples. In addition, the samples \nwith dense structure had the least number of cracks and \nthe smallest crack length. Therefore, with the increase in \ndensity of the coupled bionic model, the fatigue resistance \nof the sample was enhanced.\nAccording to the fatigue test results at various tem-\nperatures, it was found that the temperature and thermal \nFig. 5  The quantity (a) and length (b) of cracks after thermal fatigue testing at various thermal cycle temperatures (No. 1: 153.5 J/cm 2, No. 2: \n161.3 J/cm2, No. 3: 174.5 J/cm2)\nVol.:(0123456789)\nSN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9 \n Research Article\nstress during thermal fatigue cycling significantly affect \nthe length and number of cracks. Previous experiments \nshowed that with the increase of fatigue temperature, the \nthermal stress on the surface of the sample was strength-\nened, providing energy for the crack initiation and propa-\ngation. However, the hardness of the laser-coupled bio -\nmimetic unit is far greater than that of the substrate, as \nshown in Fig. 6a. When the crack extends to the unit, the \npropagation resistance increases, which causes the crack \nto stagger or deflect, thus hindering the crack extension. \nIn addition, the structure refinement of the laser-coupled \nbiomimetic unit leads to residual compressive stress on \nthe surface of the unit [19, 20], neutralizing the tensile \nthermal stress and inhibiting the initiation of fatigue \ncracks. Figure 5b shows that the precipitates of the unit are \nfew after multiple thermal fatigue tests. The dispersion of \nprecipitates strengthens the surface of the substrate and \nmaintains its mechanical properties. In addition, the unit \nremains plastic and ductile, which inhibits the initiation \nof fatigue cracks.\n3.3  Wear testing\nFigure 7 is the histogram of the grinding weight loss of \nsamples after 3600 cycles of fatigue testing under different \nlaser energies. It can be seen from the figure that the maxi-\nmum weight loss of samples with a coupled bionic surface \nis 0.175 g, which is significantly less than the untreated \nFig. 6  a Morphology of crack growth and b images of post-fatigue microstructure\nFig. 7  Weight loss of samples treated at different laser energies by grinding at different temperatures a No. 1 b No. 2 c No. 3\nVol:.(1234567890)\nResearch Article SN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9\nsamples. One reason is that the hardness of the unit is \nhigher than that of the matrix. In the wear process, the \nabrasive will stagnate or roll over on one side of the unit \nto reduce the wear behavior. At the initial stage of wear, \nthe unit and the substrate are in the same plane. During \nthe wear process, the unit will experience the pressure \nreleased by the load higher than the substrate, thereby \nreducing the contact area between the sample and the \nfriction pair, which induces weight loss. This means that \nthe weight loss of biomimetic models prepared with the \nsame laser energy decreases slightly with an increase in \nfatigue temperature. Analysis shows that the cooling pro-\ncess will create the surface of the sample hardening phe -\nnomenon, improve the surface hardness of the sample, \nand enhance the wear resistance of the sample surface. \nIn contrast, with an increase in laser energy at the same \nfatigue temperature, the hardness of the coupling biomi-\nmetic unit will increase, leading to improved wear resist -\nance of the sample.\nSecond, it was found that the maximum wear loss rate \ndecreases with an increase of the body density of the \ncoupling bionic unit. It was concluded that with higher \ndensity of the coupling bionic unit on the surface of the \nsample, the micro-hardness of the surface of the sample \nwill increase, thereby enhancing the wear resistance of the \nsample.\nThe Range Method is used to analyze the orthogo -\nnal test results and determine the general relationship \nbetween the influence of various factors on the grind -\ning weight loss. The experimental results and analysis are \nshown in Table 2.\nIn the table, \n̄yik is the average of the test indices corre -\nsponding to factor i at level k. As ̄yik increases, the effect of \nfactor i at the k level is more significant. The best combina-\ntion of factors is the optimal parameter combination of the \nexperiment. In the table,  R\ni represents the range of fac -\ntor i, which reflects the range of change of the test index \nwhen the level of factor I changes. That is, the greater \n R\ni is, the greater the influence of this factor on the test. \nTherefore, the primary and secondary factors affecting the \ngrinding loss weight are model category > fatigue tem-\nperature > laser energy. The best combination to improve \nwear resistance is shown in C3A1B2. Therefore, the specific \nprinciples of matching the coupling bionic model in dif-\nferent areas of the mold surface are as follows: According \nto the serious fatigue wear on the surface of the mold, \nit is divided into three regions. The A region with serious \nfatigue wear is matched and combined as C3A1B2, the \nbionic model of dense row structure processed by No. \n2 laser energy was adopted, the B zone with moderate \nfatigue wear is matched and combined as C2A3B3, that \nis, the bionic model of grid structure processed by No. 3 \nlaser energy, and the matching combination of the C area \nwith relatively shallow fatigue wear is C1A2B1, that is, the \nbionic model of striated structure processed by No. 1 laser \nenergy.\n3.4  Mold surface processing simulation\nIn this section, the equivalent stress distribution and wear \ncondition of the surface during mold production and pro-\ncessing were analyzed and studied using the simulation \nsoftware DEFORM. In this model, the working surface of \nthe forging die is the main surface, and the contact sur -\nface of the forging material is the driving surface. In the \nactual forging process, the forging pressure is 12,500 KN. \nThe simulated load on the mold surface was 1900 MPa, \nand the mold surface was divided into grids for simulation.\nFigure 8a is the surface stress distribution diagram of \nthe forging die. According to the figure, it was found that \ndifferent parts of the mold bear different pressures, and \nthe maximum stress is 1760 MPa. Most stress distributions \nrange from 560 to 1170 MPa. Since the deformation range \nof the middle part of the mold is small, the stress is also \nsmall. The stresses in parts 2 and 3 are higher than in the \nother parts, according to the diagram analysis. The reason \nfor this is that the blank must undergo plastic deforma-\ntion to meet the requirements of the workpiece. Figure 8b \nshows the analysis diagram of simulated wear on the mold \nsurface. It was found from the figure that the wear pri-\nmarily focuses on the rounded corners of the edges (part \n2 and part 3), and the wear depth ranges from 1.280 to \n1.868 mm. According to the optimal combination of model \nand energy obtained in the laboratory, a close coupling \nbionic model was prepared at the rounded corners of the \nedge of the mold surface, a grid-like model was prepared \nTable 2  Results and analysis of grinding weight loss\nNo. Fatigue \ntemperature \n(°C)\nLaser energy (J) Model category Experimen-\ntal results \n(g)\n1 500 153.5 Dense sample 0.175\n2 500 161.3 Grid sample 0.246\n3 500 174.5 Stripe sample 0.237\n4 600 153.5 Grid sample 0.174\n5 600 161.3 Stripe sample 0.235\n6 600 174.5 Dense sample 0.172\n7 700 153.5 Stripe sample 0.232\n8 700 161.3 Dense sample 0.173\n9 700 174.5 Grid sample 0.192\n̄yi1 0.219 (A1) 0.194 0.173 ∑yi = 1.836\n̄yi2 0.194 0.218 (B2) 0.204\n̄yi3 0.199 0.200 0.235 (C3)\nRi 0.025 0.024 0.062\nVol.:(0123456789)\nSN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9 \n Research Article\nat the convex part, and a striated model was prepared at \nthe other parts. The mold surface with coupling bionic \nmodel combination is shown in Fig. 8c, d.\n3.5  Analysis of engineering experiment results\nAccording to the mold wear conditions of the measure -\nment scheme, Fig. 9a shows the mechanism of edging of \nforgings during die processing. As shown in the figure, \nthe edge of the mold was worn, resulting in excessive \naccumulation of materials on the forging surface. In the \ncutting and dressing process, the forging surface will leave \ncutting marks. Therefore, the width of the forging edge \ncan reflect the wear of the die.\nFigure  10 shows the surface topography of the hot \nforging tools before and after the factory test. When the \nmolds were processed into 3600 pieces, the edges of the \nuntreated molds were severely worn. As shown in Fig. 10a, \nc, a wear slope with a depth of about 2 mm was formed on \nthe surface of the die. Compared to untreated mold edges \nFig. 8  Stress and tool wear distribution of the forging tool a stress b wear distribution c and d mold surface after remelting\nFig. 9  a The mechanism of edging of forgings during die processing and b shape of cutting edge of forging\nVol:.(1234567890)\nResearch Article SN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9\n(Fig. 10b, d), the bionic surface does not show a slanted \nsurface but is distributed with protrusions about 1 mm \ndeep on the worn surface. These bumps can impede the \nflow of metal and reduce wear during forging. Figure 10e, \nf show the wear conditions of the boss. The comparison of \nthe wear degree of the boss shows that the shape of the \ncoupling bionic structure remains on the surface of the \nboss. In the following production process, the coupling \nbionic surface will still hinder the crack propagation direc-\ntion and resist the wear between forging and die. On the \ncontrary, the surface of the untreated die boss has signifi-\ncant wear marks and severe deformation.\nFigure  11a, b show the straight part of the forging \nmachined by the untreated mold. It was found that the \nedge cut gradually widens. In the picture, it was observed \nthat the surface of the first piece is smooth, and no crack \ndefects occur. When forging 3600 pieces of the surface, \nthe die rough crack density is very large, and the edge \nwidths are 12 mm and 23 mm, which reflect the degree of \nmold wear. Figure 11c, d are the straight part of the forging \npiece processed by the die after laser melting. Compared \nwith Fig.  11a, b, it was found that the edge appearance \nof the first piece was the same, and the forging surface \nquality was very good without cracks and fleshy condi -\ntions. When 3600 pieces were processed, the edge width \nwas also widened, but the edge width of the forged pieces \nproduced by the melting mold is 5 mm smaller than that \nof the untreated ones. At the same time, there are many \ncracks in the forging pieces processed by untreated molds. \nTherefore, it can be concluded that the mold after melting \ntreatment can hinder the development of cracks.\nFigure 12a, b show the bending part of the front axle \nof the first piece and the 3600 pieces processed by the \nuntreated mold. It can be observed from the figure that \nthe edge width of the newly machined front axle is smaller \nthan that of the forging piece machined by the “soon-to-\nfail” die. In Fig.  12a, the width of the edge cut off at the \nbending of the forging is about 12 mm. When forging \nFig. 10  Surface fatigue wear after failure of the mold and remelting. a, b the bending part of the forging; c, d the straight part of the forging; \ne, f the boss of the forging\nVol.:(0123456789)\nSN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9 \n Research Article\nto 3600 pieces, the cut edge width is 20 mm. Figure  12b \nshows an image of the bending of the first piece processed \nby the melting mold and the forging pieces of 3600 pieces \nwith cut edge widths of 11 mm and 17 mm, respectively. \nFrom the appearance of the cut edge width, the forging \nedge is smooth, which reflects the smooth surface of the \ndie. It can be found from Fig.  12a, c that the width of the \ncut edge is roughly the same. It was observed in Fig.  12b, \nd that the cut edge width of the untreated mold is wider \nthan that of the melting mold. It can be concluded that \nthe wear resistance of the mold treated by laser melting is \nstronger than that of the untreated mold.\nFig. 11  Development trend of cut edge width on straight forging pieces. a, b Untreated mold; c, d laser melting mold\nFig. 12  Development trend of the cut edge width on curved forging pieces. a, b Untreated mold and c, d laser melting mold\nVol:.(1234567890)\nResearch Article SN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9\nFigure  13a, b show the trend curve of the cut edge \nwidth of forging. Observation and analysis show that the \nwidth of the untreated die forgings is larger than that of \nthe coupling bionic surface (any part). In addition, the dif-\nference of the cut edge width between the flat and curved \nparts of the mold with laser coupling bionic surface is only \n1 mm, and the difference between the cut edge width of \nthe untreated mold is 3 mm. It was shown that the fatigue \nwear degree of different parts of the die were not only sim-\nilar but can also be much less than that of the untreated \ndie. Taking the number of forgings processed under the \nfailure state of the untreated die as the standard, with the \ntheoretical production life fitting curve of coupling bionic \nstructure die, the die life can be increased by 1.57–1.80 \ntimes.\n4  Conclusions\nIt was found that the coupling bionic unit has good fatigue \nwear performance under different temperature cycling \nconditions. It was determined with an increase in laser \nenergy, the hardness and anti-fatigue wear properties of \nthe unit are improved. It was also found that as the tem-\nperature increases, the surface hardening of the sample \nwill also enhance the fatigue wear resistance of the unit. \nAccording to the analysis of the orthogonal test results, \nthe main and secondary factors affecting the fatigue wear \nresistance of the coupling bionic element are the shape \ntemperature and energy of the coupling bionic model. \nTherefore, a dense coupling bionic model was prepared \nin the part with high temperature and large wear degree, \na grid-like coupling bionic model was prepared in the part \nwith low temperature and moderate wear degree, and a \nstriated coupling bionic model was prepared in the rest \nof the mold.\nThe results obtained in the process of practical applica-\ntion in the factory are consistent with the results of fatigue \nwear testing in the laboratory. Laser coupling bionic unit \nsurfaces can improve the fatigue and wear resistance of \ndie surfaces. After producing the same number of forgings, \nthe cut edge width of the surface forgings with coupled \nbionic unit is reduced by 2–3 mm compared with that of \nuntreated die forgings. Moreover, different coupling bio -\nmimetic unit model combinations were prepared accord-\ning to the parts with different degrees of wear, so as to \nFig. 13  Fitting curve of cut edge width difference and estimated life of laser remelting mold after fatigue wear at different parts a cut edge \nwidth of the bending part of the forging b cut edge width of the straight part of the forging c cut edge width difference after fatigue wear\nVol.:(0123456789)\nSN Applied Sciences (2019) 1:1682 | https://doi.org/10.1007/s42452-019-1773-9 \n Research Article\nlocally enhance the anti-fatigue wear performance of the \nmold and create a consistent surface wear degree of the \nmold. In addition, according to the trend curve of the cut \nedge width of the forgings, the service life of the die with \na coupling unit model is increased by 1.57–1.80 times. \nTherefore, according to the characteristics of non-uniform \nfatigue wear on the surface of large molds, the prepara-\ntion of different coupling bionic model combinations to \nlocally enhance the performance of molds can improve \nthe service life of molds. Laser remelt technology elimi-\nnates the need for additional raw materials and consumes \nonly electrical energy to process the mold surface, reduc -\ning processing time and improving efficiency, while effec-\ntively extending the replacement of the mold and saving \nthe production cost of the enterprise.\nFunding This work was supported by Project 985-High Performance \nMaterials of Jilin University, Project 985-Bionic Engineering Science \nand Technology Innovation, National Natural Science Foundation of \nChina (U1601203) and double first-class project by Jilin Province and \nJilin University (SXGJXX2017-14).\nCompliance with ethical standards \nConflict of interest On behalf of all authors, the corresponding au-\nthor states that there is no conflict of interest.\nReferences\n 1. Gronostajski Z, Kaszuba M, Polak S, Zwierzchowski M, Niechajo-\nwicz A, Hawryluk M (2016) The failure mechanisms of hot forg-\ning dies. Mater Sci Eng A 657:147–160. https ://doi.org/10.1016/j.\nmsea.2016.01.030\n 2. Hailing L, Shijian T (2017) Analysis of common mold sur -\nface strengthening treatment technology. Sci Tech-\nnol Innov Her 11:52–53. https ://doi.org/10.16660  \n/j.cnki.1674-098X.2017.11.052\n 3. Longwu X (2017) Application and analysis of surface engineer -\ning technology in mold manufacturing. Telecom Power Technol \n34(6):114–115. https ://doi.org/10.19399 /j.cnki.tpt.2017.06.039\n 4. Ren L, Yang ZJ, Han Z (2005) Non-smooth wearable surfaces \nof living creatures and their bionic application. Trans Chin Soc \nAgric Mach 36(7):144–147 (Chinese core journals)\n 5. Wang XS, Li Y, Shi YF (2008) Effects of sandwich microstructures \non mechanical behaviors of dragonfly wing vein. Compos Sci \nTechnol 68:186–192. https ://doi.org/10.1016/j.comps citec  \nh.2007.05.023\n 6. Zhang Z, Ren L, Zhou H, Han Z, Tong X, Zhao Y, Chen L (2010) \nEffect of thermal fatigue loading on tensile behavior of H13 die \nsteel with biomimetic surface. J Bionic Eng 7:390–396. https ://\ndoi.org/10.1016/S1672 -6529(10)60271 -5\n 7. Chen L, Zhou H, Zhao Y, Ren LQ, Li XZ (2007) Abrasive particle \nwear behaviors of several die steels with non-smooth surfaces. \nJ Mater Process Technol 190:211–216. https ://doi.org/10.1016/j.\njmatp rotec .2007.02.043\n 8. Zhang Z, Lin P , Cong D, Kong S, Zhou H, Ren L (2014) The charac-\nteristics of treated zone processed by pulsed Nd-YAG laser sur-\nface remelting on hot work steel. Opt Laser Technol 64:227–234. \nhttps ://doi.org/10.1016/j.optla stec.2014.05.015\n 9. Wang C, Zhou H, Zhang Z, Zhao Y, Zhang P , Cong D, Meng C, \nTan F (2012) Tensile property of a hot work tool steel prepared \nby biomimetic coupled laser remelting process with different \nlaser input energies. Appl Surf Sci 258:8732–8738. https  ://doi.\norg/10.1016/j.apsus c.2012.05.082\n 10. Wang C, Zhou H, Liang N, Wang C, Cong D, Meng C, Ren L (2014) \nMechanical properties of several laser remelting processed \nsteels with different unit spacings. Appl Surf Sci 313:333–340. \nhttps ://doi.org/10.1016/j.apsus c.2014.05.211\n 11. Meng C, Zhou H, Cong D, Wang C, Zhang P , Zhang Z, Ren L (2012) \nEffect of biomimetic non-smooth unit morphology on thermal \nfatigue behavior of H13 hot-work tool steel. Opt Laser Technol \n44:850–859. https ://doi.org/10.1016/j.optla stec.2011.11.019\n 12. Cong D, Li Z, He Q, Chen D, Chen H, Yang J, Zhang P , Zhou H \n(2018) Effect of unit size on thermal fatigue behavior of hot \nwork steel repaired by a biomimetic laser remelting process. \nOpt Laser Technol 98:205–213. https ://doi.org/10.1016/j.optla  \nstec.2017.08.001\n 13. Tong X, Dai M-J, Zhang Z-H (2013) Thermal fatigue resistance \nof H13 steel treated by selective laser surface melting and CrNi \nalloying. Appl Surf Sci 271:373–380. https ://doi.org/10.1016/j.\napsus c.2013.01.209\n 14. Shi L, Yang X, Zheng L, Wu C, Ni J (2017) Research on anti \ncrack mechanism of bionic coupling brake disc. Mater \nSci Eng 231(012170):1–11. https ://doi.org/10.1088/1757-\n899X/231/1/01217 0\n 15. Gan L, Liang G-Y, Zhou T, Sui Q, Yang L, Zhou H, Zhang P (2018) \nSliding abrasion resistance of gray cast iron surfaces with bio-\ninspired groove lines and groove stripes. Mater Res Express \n50(96525):1–13. https ://doi.org/10.1088/2053-1591/\n 16. Su W, Zhou T, Zhang P , Zhou H, Li H, Sui Q (2018) Effect of the \norientation of laser stripes on the abrasion resistance of biomi-\nmetic laser textured surfaces. Opt Laser Technol 107:380–388. \nhttps ://doi.org/10.1016/j.optla stec.2018.06.020\n 17. Chen Z-K, Lu S-C, Song X-B, Zhang H, Yang W-S, Zhou H (2015) \nEffects of bionic units on the fatigue wear of gray cast iron sur -\nface with different shapes and distributions. Opt Laser Technol \n66:166–174. https ://doi.org/10.1016/j.optla stec.2014.08.016\n 18. Li GB, Li XZ, Wu JJ (1998) Study of the thermal fatigue crack ini-\ntial life of H13 and H21 steels. J Mater Process Technol 74:23–26. \nhttps ://doi.org/10.1016/S0924 -0136(97)00244 -6\n 19. Paris P , Erdogan F (1963) A critical analysis of crack propagation \nlaws. J Basic Eng 85:528–534. https ://doi.org/10.1115/1.36569  \n00\n 20. Li CW, Wang Y, Han B (2011) Microstructure, hardness and stress \nin melted zone of 42CrMo steel by wide-band laser surface melt-\ning. Opt Lasers Eng 49:530–535. https ://doi.org/10.1016/j.optla \nseng.2010.12.008\nPublisher’s Note Springer Nature remains neutral with regard to \njurisdictional claims in published maps and institutional affiliations."
}