{
    "title": "The Research on Additional Errors of Voltage Transformer Connected in Series",
    "url": "https://openalex.org/W3005125870",
    "year": 2020,
    "authors": [
        {
            "id": "https://openalex.org/A5074000379",
            "name": "Huanghui Zhang",
            "affiliations": [
                "Beihang University",
                "Fujian Metrology Institute"
            ]
        },
        {
            "id": "https://openalex.org/A5001452215",
            "name": "Haiming Shao",
            "affiliations": [
                "National Institute of Metrology"
            ]
        },
        {
            "id": "https://openalex.org/A5100765811",
            "name": "Jiafu Wang",
            "affiliations": [
                "National Institute of Metrology"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W1985312744",
        "https://openalex.org/W2513235243",
        "https://openalex.org/W2214611372",
        "https://openalex.org/W1985139731",
        "https://openalex.org/W2314157850",
        "https://openalex.org/W2072004874",
        "https://openalex.org/W6635551984",
        "https://openalex.org/W2119839147",
        "https://openalex.org/W2055421572",
        "https://openalex.org/W1595363849"
    ],
    "abstract": "The series summation method is an important method in the calibration of the voltage coefficient (VC) of the standard voltage transformers (VTs), in which the key step is connecting a fullyinsulated VT and a semi-insulated VT in series, and comparing them with the third VT under test. Caused by the imperfect electrical shielding of the serially-wound VTs, additional errors are introduced in the calibration. By analyzing the cause of the additional errors in the serial connection of the VTs, two methods were designed in this paper to measure the additional errors. The proposed methods were harnessed to measure the additional errors for a serial connection of a 35 kV fully-insulated two-stage voltage transformer (TSVT) and a 35 kV semi-insulated TSVT. The results show that the two methods give a consistency of better than 1.0 &#x00D7; 10<sup>-6</sup> in ratio error and 2.0 &#x03BC;rad in phase displacement, respectively. The accurate measurement of the series additional errors and the correction of them significantly improve the accuracy of the VC measurement of a 110/&#x221A;3 kV TSVT based on the series summation method. Furthermore, the VC measurement result is verified by the consistency of the series summation method with the series additional errors corrected and the high-voltage standard capacitor method.",
    "full_text": "Received January 24, 2020, accepted February 4, 2020, date of publication February 7, 2020, date of current version February 17, 2020.\nDigital Object Identifier 10.1 109/ACCESS.2020.2972304\nThe Research on Additional Errors of Voltage\nTransformer Connected in Series\nHUANGHUI ZHANG\n 1,2, HAIMING SHAO\n 3, (Member, IEEE),\nAND JIAFU WANG\n 3, (Member, IEEE)\n1School of Instrumentation and Optoelectronic Engineering, Beihang University, Beijing 100191, China\n2Fujian Institute of Metrology, Fuzhou 350003, China\n3National Institute of Metrology, Beijing 10029, China\nCorresponding author: Haiming Shao (shaohm@nim.ac.cn)\nThis research has been supported by the China National Key R&D Program (2017YFF0205701), entitled ‘‘Research on metrological\ntechnologies for high voltage loss measurement at low power factor conditions’’, and also been supported by Fujian Science & Technology\nProject 2017R1033-4 entitled ‘‘Research on the measurement method of voltage coefﬁcients of the high-voltage standard capacitors’’.\nABSTRACT The series summation method is an important method in the calibration of the voltage\ncoefﬁcient (VC) of the standard voltage transformers (VTs), in which the key step is connecting a fully-\ninsulated VT and a semi-insulated VT in series, and comparing them with the third VT under test. Caused\nby the imperfect electrical shielding of the serially-wound VTs, additional errors are introduced in the\ncalibration. By analyzing the cause of the additional errors in the serial connection of the VTs, two methods\nwere designed in this paper to measure the additional errors. The proposed methods were harnessed to\nmeasure the additional errors for a serial connection of a 35 kV fully-insulated two-stage voltage transformer\n(TSVT) and a 35 kV semi-insulated TSVT. The results show that the two methods give a consistency\nof better than 1.0 ×10−6 in ratio error and 2.0 µrad in phase displacement, respectively. The accurate\nmeasurement of the series additional errors and the correction of them signiﬁcantly improve the accuracy of\nthe VC measurement of a 110/\n√\n3 kV TSVT based on the series summation method. Furthermore, the VC\nmeasurement result is veriﬁed by the consistency of the series summation method with the series additional\nerrors corrected and the high-voltage standard capacitor method.\nINDEX TERMS Error analysis, high-voltage techniques, series summation method, standard voltage\ntransformer, the serial connection of the transformers, voltage coefﬁcient.\nI. INTRODUCTION\nElectric energy trade and the loss measurement traceability\nof electric power transformers, reactors, etc. require a 10 −6-\nlevel accuracy and the traceability of power frequency high\nvoltage ratio standards. For example, a loss measurement of\nan accuracy of 1% for the 0.001 power factor means an overall\naccuracy of 0.001% [1]. The voltage coefﬁcient (VC) of the\nvoltage transformer (VT) refers to the voltage dependence\nof the transformer error, that is, the variation in ratio error\nand phase displacement of the transformer with the voltage,\nwhich is the most important technical index to ensure the\naccuracy of transformer ratio. The usual way to measure\nthe VC is by comparing VT with a compressed gas high-\nvoltage standard capacitor (HVSC) and a gas-ﬁlled parallel-\nplates capacitor through a current-comparator-based bridge\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Wuliang Yin\n.\n(C-tanδ bridge) [2] (called the HVSC method). However,\nlimited by the sensitivity of the C-tanδbridge, the VC cali-\nbration uncertainties of these two-stage voltage transformers\n(TSVTs) were not as good as they were expected, and were\nmainly beneath 30% of the rated voltage.\nThe summation method is another important method for\ncalibrating VTs, which was proposed by scholars from PTB\n[3]–[6]. This method was proposed for VT ratio traceability,\nwhich is the absolute determination of the errors of voltage\ntransformers with parallel-series step-up method or with a\nsummation method via intermediate transformers or capac-\nitive divider. The summation method was improved in 1990s\nfor easier operation [7]. Reference [7] presented a voltage\nseries summation circuit by connecting two single-stage volt-\nage transformers (SSVTs) in series to determine the VC of\na third VT, the method is used to calibrate the VC of the\ntransformer (called the series summation method). Instead\nof the primary in series and the secondary grounding in the\n29188 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see http://creativecommons.org/licenses/by/4.0/VOLUME 8, 2020\nH. Zhanget al.: Research on Additional Errors of VT Connected in Series\nZinn’s circuit, the series summation method does not need to\naccurately adjust the voltage balance between the upper and\nlower of the boosting transformers, which greatly reduces the\ndifﬁculty of manufacturing and measurement.\nHowever, limited by the severe nonlinearity and repeata-\nbility of the single-stage transformers, the calibration accu-\nracy are not sufﬁcient. Moreover, the changes of the ratio\nwinding potential of the full insulation transformer intro-\nduced an unquantiﬁable error because of its imperfect elec-\ntrical shielding. Furthermore, in the VC measurement of\nVT with higher accuracy and higher voltage level, the inﬂu-\nence of these two problems is more obvious and cannot be\nignored [8], [9].\nThe key step of the series summation method is to connect\nthe fully-insulated VT and the semi-insulated VT in series,\nand then compared them with the third VT under test [7]–[9].\nCaused by the imperfect electrical shielding of the series-\nwound VTs, the additional errors are inevitably introduced\nwhen the leakage current of the VTs are changed in the\ncalibration. Obviously, in the measurement of VT with higher\naccuracy and higher voltage level, the inﬂuence of the addi-\ntional errors would be more signiﬁcant and cannot be ignored.\nIn order to reduce the inﬂuence of the additional errors on\nmeasurement, a straightforward method is to measure these\nerrors and correct them in the data processing of the series\nsummation method.\nIn this work, we evaluated the additional errors in the\nserial connection of the voltage transformers. By analyz-\ning the cause of the additional errors in the serial con-\nnection of the VTs, two new measurement methods were\nproposed and designed to measure the additional errors in\nthe paper. We implemented the proposed methods in the\nadditional errors measurement in the serial connection of a\n35 kV fully-insulated two-stage voltage transformer (TSVT)\nand a 35 kV semi-insulated TSVT. Furthermore, the effec-\ntiveness of the two additional errors measurement meth-\nods is veriﬁed by an indirect comparison: the VC of the\n110/\n√\n3 kV two-stage voltage transformers with low-voltage\nexcitation (LVE-TSVT) was measured with the series sum-\nmation method presented in [7] with a replacement of SSVTs\nwith TSVTs, including the additional errors in the serial\nconnection are ignored or corrected. And then the results were\ncompared with the HVSC method [2].\nII. THE ADDITIONAL ERRORS CAUSED BY THE VTS\nCONNECTED IN SERIES\nIn the principle of the series summation method [7], the key\nstep is the fully-insulated SSVT and the semi-insulated SSVT\nconnected in series, as shown in Fig. 1(a), where T 1 is a\nsemi-insulated SSVT, and T 23 is a combined SSVT, which\nis composed of a fully-insulated VT T 2, and a high voltage\nisolation transformer (HVIT) with 1:1 ratio. The function of\nT3 is to convert the output voltage of T 2 from the high ﬂoating\nvoltage ˙u2 into a low ﬂoating voltage ˙u23.\nHowever, it should be noticed that the potential of the low\nterminals X 0 and x 0 of T 23 in Fig.1 (a) were different from\nFIGURE 1. The equivalent circuit of T23 in serial connection.\nthose in solely used. Any imperfect electrical shields between\nthe primary and secondary windings may introduce an error\nshift, and the leakage current changes between grounding and\nﬂoating situations for the terminals of X 0 and x 0 may also\nintroduce an incalculable error [10].\nIn order to more concisely analyze the source of additional\nerror in series, the T 23 was re-drawn in Fig.1(b), where,\nEp and Es are potentials to ground of terminals X 0 and x 0,\nrespectively. IL is current entering terminal x 0. C is the stray\ncapacitance of the electrical shields of T 3 to ground. z s1 and\nzs3 are the internal impedance of the secondary winding of the\nT1 and T 3 respectively. A change in the operating potentials\nof the windings will cause a variation in the distribution of\ncapacitance currents within the transformer. This, in turn,\nmay affect the magnetization of the core causing a shift in\nthe transformer error.\nFurthermore, the effect of leakage current IL is not only\non T 23 but also on T 1. Fig.2 shows the variation of leakage\ncurrent IL in the measurement loop of the semi-insulated\ntransformer T 1 in series. TTS is a commercial available\ntransformer test set, IL(T1) is the leakage current from T 1,\nand IL(T23) is the leakage current from T 23. For the semi-\ninsulated transformer T 1, leakage currents IL(T23) and IL(T1)\nboth ﬂow through the ratio winding of T 1, and then a voltage\ndrop is generated across the winding impedance zs1. When\nthe leakage current IL changes, it will cause the ratio output\nvoltage to change, resulting in the ratio error change. Among\nthem, IL(T23) is greatly affected by Es, and the IL(T23) not\nonly forms a voltage drop on the winding impedance z s3\nof the fully-insulated transformer T 23 but also as the load\nof T 1 and T 23, resulting in load error. The leakage current,\nIL(T1) +IL(T23), changed about 1 mA in the experiment of T 23\nand T1 in the serial connection in the Section B of Chapter IV .\nThe effect of Ep, Es and IL on T 23 and T 1 were the main\nreasons for the additional errors introduced in the serial con-\nnection of the transformer. Furthermore, as the voltage level\nincreases or the VC of the measured voltage transformer is\nevaluated at 10−6-level, the errors with Ep, Es and IL must be\nconsidered in the series summation method.\nVOLUME 8, 2020 29189\nH. Zhanget al.: Research on Additional Errors of VT Connected in Series\nFIGURE 2. The effect of leakage current IL on T23 and T1 in the serial\nconnection of the voltage transformer, figure (a) shows the T1 used in\nnormal, and figure (b) shows the variation of leakage current when T1\nused in series. More importantly, the change is directly in the error\nmeasurement loop.\nLet the errors of T 1 and T23 under a voltage ˙U be ˙β\n(˙U\n)\n=\nf2\n(˙U\n)\n+j ·δ2\n(˙U\n)\nand ˙γ\n(˙U\n)\n=f3\n(˙U\n)\n+j ·δ3\n(˙U\n)\n, in which\nf2\n(˙U\n)\n, f3\n(˙U\n)\nand δ2\n(˙U\n)\n, δ3\n(˙U\n)\nare the ratio errors and\nphase displacement, respectively.\nAssuming that, ˜eT1 = feT1( ˙U) +j ·δeT1( ˙U), ˜eT23 =\nfeT23( ˙U) +j ·δeT23( ˙U) represent the additional errors respec-\ntively caused by the T 1 and T23 connected in series (from its\nlow voltage terminals being grounded to ﬂoating by connect-\ning with T 1 in series), where errors may accordingly change\nfor imperfect electrical shields, and leakage current changes\netc. Then according to Fig.1 (a), it has\n˙u1( ˙U) =\n˙U\nK\n[\n1 +˙β\n(˙U\n)\n+˜eT23\n]\n(1)\n˙u23( ˙U) =\n˙U\nK\n[\n1 +˙γ\n(˙U\n)\n+˜eT1\n]\n(2)\n˙u(2 ˙U) =˙u1( ˙U) +˙u23( ˙U)\n=\n˙U\n0.5K\n[\n1 +\n˙β\n(˙U\n)\n+˜eT23 +˙γ\n(˙U\n)\n+˜eT1\n2\n]\n(3)\nTherefore, the additional errors respectively caused by the\nT1 and T 23 connected in series (the ˜eT1 and ˜eT23) cannot be\nignored when the VC of the measured voltage transformer is\nevaluated at 10−6-level, especially for high voltage. However,\nthe ˜eT1 and ˜eT23 could be measured and corrected.\nIII. THE MEASUREMENT METHOD OF THE ADDITIONAL\nERRORS OF˜eT1 AND ˜eT23\nTo demonstrate the presence and the inﬂuence of ˜eT1\nand ˜eT23, two additional error measurement methods were\ndesigned. One is to carry out measurements directly by the\ntransformer test set (TTS), that is, the errors are directly\nread from the TTS (called direct measurement method).\nThe other is based on the third standard VT. The SSVTs,\nFIGURE 3. directly measured circuits of˜eT23 and ˜eT1 with the TTS. Both in\nfigure (a) and (b), keep the primary and the secondary windings of T1 and\nT23 connected in series respectively. Through controlling the primary\nwinding of T23 and T1, the corresponding T1 and T23 are in series,\nrespectively. For example, in figure (a), when the high and the low ends of\nprimary windings of T23 were connected to the high voltage˙U, the\nexistence of IL(T23) may form a voltage drop on the leakage impedance of\nthe fully-insulated transformer T23 and result the load error at the same\ntime, that is, the effect of Ep, Es and IL on T23.\nin series or solely used, are compared with the third standard\nVT, and the errors introduced in serial connection are calcu-\nlated (called comparative measurement method).\nThe direct measurement circuit was designed as shown\nin Fig.3. In Fig.3 (a), T 1 and T23 are connected in series and\na voltage of ˙U and 0 V were applied respectively, that is,\nthe high and the low ends of primary windings of T 23 were\nconnected to the high-voltage ˙U. Then, TTS measures the\n1˙U or ˜eT23, of the secondary voltage of T 23 against to the ˙Uref\nof the secondary voltage of T 1. The ˜eT1 could be determined\nin the similar method as ˜eT23, as shown in Fig.3 (b).\nThe second measurement method of the additional errors\n˜eT1 and ˜eT23 is comparative measurement. Taking the\nmeasurement of ˜eT23 as an example, the comparative mea-\nsurement circuits were designed as shown in Fig.4, and the\ncomparative measurement circuit of ˜eT1 is the same with the\n˜eT23 and is omitted. In Fig.4, the semi-insulated SSVT T 1 is\ncompared with the third standard voltage transformer T 0 in\nseries and solely used respectively. And then calculated the\nerrors introduced in serial connection, that is, the change of\nthe error of the measured SSVT T 1 between two comparison\nexperiments.\nTake the additional errors measurement in the serial con-\nnection of a 35 kV fully-insulated TSVT and a 35 kV semi-\ninsulated TSVT as an example, in the experiment, the two\nmeasured methods on the additional errors of ˜eT1 and ˜eT23\ngave a well agreement of ratio error and phase displacement,\nrespectively (detailed in Table 1 of Chapter IV).\nIV. THE MEASUREMENT AND VERIFICATION OF THE\nADDITIONAL ERRORS OF˜eT1 AND ˜eT23\nIn the process of the series summation method based on\nSSVTs, the nonlinearity and repeatability of the SSVTs also\ncontribute some uncertainties. To achieve better uncertainty,\nthe LVE-TSVTs were used instead of SSVTs. In order to\n29190 VOLUME 8, 2020\nH. Zhanget al.: Research on Additional Errors of VT Connected in Series\nFIGURE 4. Comparative measurement of the˜eT23 with the third standard\nVT T0.\nTABLE 1. The data of˜eT1 and ˜eT23 in the serial connection of a new 35 kV\nfully-insulated LVE-TSVT and a 35 kV semi-insulated LVE-TSVT.\nmeasure the VC of the 110/\n√\n3 kV LVE-TSVT T 0, a new\n35 kV fully-insulated LVE-TSVT T 23 was developed for the\nseries summation method, by connecting in series with the\n35 kV semi-insulated LVE-TSVT T 1. It should be declared\nthat this paper, in sections IV .A, reuses some content from\nthesis [11] with permission.\nA. THE 35 kV FULLY-INSULATED LVE-TVST\nSimilar to the semi-insulated LVE-TSVT in [12], the structure\nof the HVIT T 3 and the fully-insulated LVE-TSVT T 2 are\nboth made of two overlapped toroidal cores, S1 and S2.\nA low-voltage excitation TSVT T 20(T30) and an auxiliary\ntransformer T2C(T3C) are also involved.\nFig. 5(a) presents the structure of the HVIT (T 3) with\n1:1 ratio, including the layout of the cores, the windings, as\nwell as the shields. The difference between the HVIT and\nthe semi-insulated LVE-TSVT in [12] was that an insulation\nlayer I s1 (Isp) and an electrostatic shield E.S.0 were added\nFIGURE 5. Structure of a fully-insulated LVE-TSVT.\nbetween the primary ratio winding N 1 (N1p) and the sec-\nondary ratio windings N 2 (N2p) of the transformer T 30 (T3c)\nin T 3. E.S.0 was electric connected with the terminal X 0\nof N1.\nFig. 5 (b) shows the structure of the fully-insulated LVE-\nTSVT T2. The difference between T 2 and the semi-insulated\nLVE-TSVT in [3] is that the electrostatic shields E.S.1 and\nE.S.2 of T 2 are generally connected to the terminal X 0 (X)\nof N 1 (N1p) and x 0 (x) of N 2 (N2p) respectively, rather than\ndirectly grounded.\nFig. 5 (c) presents the circuits of T 23, the combination of\nT2 and T 3, with electrostatic shields and insulation layers\nomitted for convenience. The upper dashed box presents\nthe HIVT T 3, and the lower dashed box presents the fully-\ninsulated LVE-TSVT T 2. The terminals (A 0, A) and (X 0, X)\nof T 20 and T 2C in T 2 were led out within two bushings for\nhigh voltage connection.\nVOLUME 8, 2020 29191\nH. Zhanget al.: Research on Additional Errors of VT Connected in Series\nB. THE ERROR MEASUREMENTS OF˜eT1 AND ˜eT23 IN THE\nSERIAL CONNECTION OF A NEW 35 kV FULLY-INSULATED\nLVE-TSVT AND A 35 kV SEMI-INSULATED LVE-TSVT\nMeasuring the additional errors of ˜eT23 and ˜eT1 caused by the\nnew 35 kV fully-insulated LVE-TSVT and the 35 kV semi-\ninsulated LVE-TSVT connected in series, schematic diagram\nof measuring circuits as shown in Fig.3 and Fig.4, where\nSSVTs are replaced with LVE-TSVTs in the measurement.\nTable 1 lists the ˜eT23 and ˜eT1 in condition of corresponding\nvoltages. In Fig.4, the standard VT is a 110/\n√\n3 kV semi-\ninsulated LVE-TSVT (T 0) [13]. A 8-dial two-stage induc-\ntive voltage divider (IVD) was cascaded with the series\nsecondary windings of T 1 and T23 in order to match the ratios\nbetween the 110/\n√\n3 kV LVE-TSVT and the series of 35 kV\nLVE-TSVTs, and the IVD is omitted in Fig.4.\nFrom Table 1, the two measurements on the errors of\n˜eT1 and ˜eT23 give a consistency of better than 1.0 ×10−6\nin ratio error and 2.0 µrad in phase displacement,\nrespectively.\nC. THE APPLICATION OF THE ADDITIONAL ERRORS\nThe 35 kV fully-insulated LVE-TSVT (T 23) and the 35 kV\nsemi-insulated LVE-TSVT (T 1) were connected in series\nto calibrate the VC of the 110/\n√\n3 kV semi-insulated\nLVE-TSVT (T0) based on the series summation method [7].\nA 8-dial two-stage IVD was cascaded with the series sec-\nondary windings of T 1 and T 23 in order to match the\nratios between the 110/\n√\n3 kV LVE-TSVT and the series\nof 35 kV LVE-TSVTs. The photo of experimental site is\nshown in Fig. 6.\nLet the errors of T 0 under a voltage ˙U as ˙α\n(˙U\n)\n=f1\n(˙U\n)\n+\nj ·δ1\n(˙U\n)\n, in which f1\n(˙U\n)\nand δ1\n(˙U\n)\nare the ratio errors\nand phase displacement, respectively. Based on the three\nsteps of the series summation method mentioned in [7], and\nconsidering the error introduced in series, the VC of the\nmeasured 110/\n√\n3 kV LVE-TSVT (T 0) can be expressed as\nequation (4) and (5).\n1˙α˙U∼2 ˙U\n=˙α(2 ˙U) −˙α( ˙U)\n=˜ε1(2 ˙U) −\n(˜ε2( ˙U) +˜ε3( ˙U)\n2 −˜eT1 +˜eT23\n2\n)\n(4)\n\n\n\n\n\n\n\n\n\nf1(2 ˙U) −f1( ˙U)\n=fε1(2 ˙U)−fε2( ˙U)+fε3( ˙U)\n2 +feT1( ˙U)+feT23( ˙U)\n2\nδ1(2 ˙U) −δ1( ˙U)\n=δε1(2 ˙U)−δε2( ˙U)+δε3( ˙U)\n2 +δeT1( ˙U)+δeT23( ˙U)\n2\n(5)\nwhere, ˜ε1(2 ˙U) is the error of T 0 at the voltage of 2 ˙U by\ntaking T1 and T23 in series as the reference. ˜ε2( ˙U) and ˜ε3( ˙U)\nare the errors of T 0 at the voltage of ˙U by taking T 1 and\nT23 as the reference respectively. Let the errors obtained\nfrom the three comparative measurement experiments as\n˜ε1(2 ˙U) =fε1(2 ˙U) +j ·δε1(2 ˙U), ˜ε2( ˙U) =fε2( ˙U) +j ·δε2( ˙U),\nFIGURE 6. Photos of 110/\n√\n3 kV LVE-TSVT measurement with the series\nsummation method, and replace the SSVTs with LVE-TSVTs. The series\nsummation method contents three comparison experiments. Step 1: T1\nand T23 were connected in series, and then were compared with T0 at the\nvoltage of 2˙U. Step 2 and Step 3: T1 and T23 were compared with T0 one\nby one at voltage of˙U.\nTABLE 2. Three steps of the series summation method and the additional\nerror in series.\n˜ε3( ˙U) =fε3( ˙U) +j ·δε3( ˙U), where fε1(2 ˙U), fε2( ˙U), fε3( ˙U),\nand δε1(2 ˙U), δε2( ˙U), δε3( ˙U) are the TTS readings in ratio\nerrors and phase displacement, respectively.\nTable 2 lists the measured data in condition of correspond-\ning voltages of the three comparative measurement experi-\nments.\n1˙α˙U∼2 ˙U is calculated according to equation (4) and (5)\nwith the ˜ε1(2 ˙U), ˜ε2( ˙U) and ˜ε3( ˙U) got in the three comparative\nmeasurement experiments. The data is listed in Table 3.\n29192 VOLUME 8, 2020\nH. Zhanget al.: Research on Additional Errors of VT Connected in Series\nTABLE 3. Ratio errors and phase displacement got by the series\nsummation method.\nTABLE 4. The VC of T0 with the series summation method.\nSummating all the 1˙α to get the total error with\nequation (6).\n1˙α(15%∼120%)˙Un\n=1˙α(15%∼30%)˙Un +1˙α(30%∼60%)˙Un +1˙α(60%∼120%)˙Un\n(6)\nThe table 4 lists the VC of the 110/\n√\n3 kV LVE-TSVT\nobtained when the additional errors are corrected according\nto Table 2 or ignored. In order to further verify the addi-\ntional errors measurement method, we measured the VC of\nthe 110/\n√\n3 kV LVE-TSVT in the next section by another\ncommonly methods.\nV. DISCUSSION AND VERIFICATION\nA few attentions are given for the above measurements.\nA. TTS AND SECONDARY LOOP GROUNDING\nIn the error measured circuits, 1˙U/\n˙Uref was measured by\na commercial available TTS. Basically, it was a specially\ndesigned Phase-Lock-Ampliﬁer (PLA) with higher input\nvoltage up to 120 V in its reference channel, and high ﬂoating\nand differential input voltage for 1˙U. In order to prevent\nany leakage current load or introduce any error voltage in\nthe secondary voltage loop, all the low terminals x 0 of the\nsemi-SSVTs should be connected to a single grounding point\non the PLA-based TTS.\nB. THE DISCUSS ON ADDITIONAL ERRORS\nMEASUREMENT WITH THE DIRECT MEASUREMENT\nMETHOD\nAs analyzed in Section II, the effect of leakage current IL\nis not only on T 23 but also on T 1, that is, as the load of\nT1, T 23 and resulting in load error. Based on third standard\nVT T 0, the load errors of T 1 when used in serial connection\nwith T 23 can be measured, as shown in Figure 7. The T 1,\nin series or solely used, is compared with the standard VT T 0,\nand the load errors introduced in serial connection are calcu-\nlated.\nFIGURE 7. Comparative measurement of the load errors of T1 with a\nstandard VT T0, the difference from Figure 4 is that the output of T1 when\nused in series is measured here (a0 of T1), instead of the output of T1\nserial connection with T23 (a0 of T23) in Figure 4. The T1 and T23 are\nrepresented with single stage for convenience.\nThe load errors of the 35 kV semi-insulated TSVT when\nused in serial connection with the 35 kV fully-insulated\nTSVT were measured. And the comparison of experimental\ndata indicated that the load errors of the 35 kV semi-insulated\nTSVT is less than 0.5 ×10−6 in ratio error and 0.6 µrad\nin phase displacement respectively. It is due to the better\nload-carrying capacity of the TSVT of this semi-insulated\nstructure. Therefore, when the additional errors are measured\nwith the direct measurement method, the load errors of T 1 can\nbe ignored.\nThere is the same load effect on T 23 from T 1. However,\nthe x 0 of T 23 is nearly the ground potential, as shown in\nFig.3 (a). So the load errors of T 23 can be ignored too.\nC. THE VERIFICATION BY MEASURING THE VC OF THE\n110/\n√\n3 kV LVE-TSVT WITH HVSC METHOD\nAnother commonly method for measuring the VC of the\n110/\n√\n3 kV LVE-TSVT is by comparing it with a gas-\ncompressed HVSC through an AC current comparator from\n30% to 120% of the rated voltage [2]. The principle dia-\ngram of calibration system between standard capacitor and\nLVE-TSVT is shown in Fig.8, which mentioned in [2].\nThe C–tanδ bridge was a modiﬁed commercial available\none based on AC current comparator principle. In the bridge,\nseven dials for capacitive ratio and dissipation were designed,\nand an external phase-lock-ampliﬁer was attached as a null\nindicator to obtain a 1 ×10−7 adjustment. The current depen-\ndence of the ﬁxed ratio of this C–tanδ bridge was checked\nbetter than 3 ×10−7 by comparing two capacitors with\nnegligible voltage coefﬁcient [13].\nVOLUME 8, 2020 29193\nH. Zhanget al.: Research on Additional Errors of VT Connected in Series\nFIGURE 8. Circuitry for the comparison between standard capacitor and\nthe 110/\n√\n3110/\n√\n3kV LVE-TSVT, the HVSC method.\nTABLE 5. The variation of 110/\n√\n3 KV LVE-TEST from 30% to 120% of the\nrated voltage.\nTable 5 lists the comparison of the VC of 110/\n√\n3 kV\nLVE-TSVT with the HVSC method (#1) and the series sum-\nmation method, including the additional errors ignored (#2)\nand corrected (#3). By comparing method #2 with method\n#3, when ignoring the additional errors will introduce about\n14.6 ×10−6 in ratio error and -10.3 µrad in phase dis-\nplacement respectively at the point of 120% of the rated\nvoltage.\nBased on the consistency of the measurement results of the\nVC of the 110/\n√\n3 kV LVE-TSVT of the method #1 with\nmethod #3 in Table 5(gave an agreement of 2.4 ×10−6 in\nratio error and 3.8 µrad in phase displacement respectively),\nthe accuracy of the additional errors measurement and correc-\ntion for the series summation method was indirectly veriﬁed.\nAnd the accurate measurement of the additional errors may\neffectively improve the accuracy of the measurement when\nmeasuring the VC of the transformer with the series summa-\ntion method.\nVI. CONCLUSION\nBy analyzing the cause of the additional errors in the serial\nconnection of the VTs, two new measurement methods were\nproposed and designed to measure the additional errors in the\npaper.\nThe proposed methods were implemented in the additional\nerrors measurement in the serial connection of a 35 kV fully-\ninsulated TSVT and a 35 kV semi-insulated TSVT, where the\ntwo methods gave an agreement of better than 1.0 ×10−6 in\nratio error and 2.0 µrad in phase displacement respectively.\nThe accurate measurement of the series additional errors\nand the correction of them signiﬁcantly improve the accu-\nracy of the VC measurement based on the series summation\nmethod. The consistency of the series summation method\nwith the series additional errors corrected and the HVSC\nmethod is better than 2.4 ×10−6 in ratio error and 3.8 µrad\nin phase displacement respectively, in the measurement of the\nVC of the 110/\n√\n3 kV LVE-TSVT.\nThe comparison of experimental data indicated that the\nadditional errors of the VTs connecting in series can be\nmeasured accurately, and the accurate measurement of the\nadditional errors may effectively improve the accuracy of the\nmeasurement when measuring the VC of the transformer with\nthe series summation method.\nAt the same time, the accurate measurement of the series\nadditional errors also provided valuable technical supports\nand guidelines for the design of the fully-insulated trans-\nformer, such as how to properly design shielding to reduce\nthe inﬂuence of leakage current. Future work will involve the\nveriﬁcation of the measurement of the additional errors in the\nserial connection on voltage transformers with higher voltage\nlevel ratings.\nREFERENCES\n[1] E. So, R. Verhoeven, L. Dorpmanns, and D. Angelo, ‘‘Traceability of loss\nmeasurements of extra high voltage three-phase shunt reactors,’’ IEEE\nTrans. Instrum. Meas., vol. 64, no. 6, pp. 1344–1349, Jun. 2015.\n[2] E. So and H.-G. Latzel, ‘‘NRC-PTB intercomparison of voltage trans-\nformer calibration systems for high voltage at 60 Hz, 50 Hz, and 16.66 Hz,’’\nIEEE Trans. Instrum. Meas., vol. 50, no. 2, pp. 419–421, Apr. 2001.\n[3] E. Zinn and K. Forger, ‘‘Ein Meßverfahren zum absoluten Bestimmen der\nFehler von Spannungswandlern,’’ ETZ-A, vol. 75, H. 24, pp. 805–809,\nDec. 1954.\n[4] E. Zinn, ‘‘Fundamentale Bestimmung der Fehler von Spannungswandlern\ndurch ein Summierverfahren über Zwischenwandler,’’ Z angew. Phys.,\nvol. 10, no. 11, pp. 511–516, 1958.\n[5] E. Zinn, ‘‘Fundamentale Bestimmung der Fehler von\nHöchstspannungswandlern durch ein Summierverfahren mittels\nkapazitiven Teilers,’’ETZ-A, vol. 19, pp. 659–665, Oct. 1959.\n[6] A. Braun, H. Richter, and H. Danneberg, ‘‘Determination of voltage trans-\nformer errors by means of a parallel-series step-up method,’’ IEEE Trans.\nInstrum. Meas., vol. 29, no. 4, pp. 490–492, Dec. 1980.\n[7] W. Leren, ‘‘A series summation method for the determination of voltage\nratios at power frequency with high accuracy,’’ in Proc. Conf. Precis.\nElectromagn. Meas., Dec. 2002, pp. 378–379.\n[8] Calibration Speciﬁcation for Apparatus of Voltage Ratio Standards at\nPower Frequency, document JJF1067-2014, China, 2014.\n[9] F. Zhou, C. Jiang, M. Lei, and F. Lin, ‘‘Method to determine the errors of\nvoltage instrument transformer,’’ in Proc. CPEM Conf. Dig., Paris, France,\nJul. 2018.\n29194 VOLUME 8, 2020\nH. Zhanget al.: Research on Additional Errors of VT Connected in Series\n[10] N. L. Kusters, W. J. M. Moore, and O. Petersons, ‘‘The effect of winding\npotentials on voltage transformer errors,’’ IEEE Trans. Power Appar. Syst.,\nvol. 83, no. 2, pp. 115–121, Feb. 1964.\n[11] H. Shao, F. Lin, B. Liang, H. Zhang, W. Zhao, J. Wang, and C. Li, ‘‘V oltage\ndependence measurement of a 110 kV LVE-TSVT,’’ in Proc. Conf. Precis.\nElectromagn. Meas. (CPEM), Jul. 2016, pp. 1–2.\n[12] S. X. Peng, Y . H. Song, and Y . X. Ma, ‘‘R&D on two-stage potential\ntransformers of 35 kV with accuracy class of 0.001 and (110/v 3) kV with\naccuracy class of 0.002,’’ Elect. Equip., vol. 6, no. 7, pp. 10–16, Jul. 2005.\n[13] H. M. Shao, F. P. Lin, B. Liang, W. Zhao, D. X. Dai, S. X. Peng, T. Y . Sun,\nJ. Y . Liu, and H. H. Zhang, ‘‘The development of 110/\n√\n3kV two-stage\nvoltage transformer with accuracy class 0.001,’’ IEEE Trans. Instrum.\nMeas., vol. 64, no. 6, pp. 1383–1389, Jun. 2015.\n[14] N. L. Kusters and O. Petersons, ‘‘The voltage coefﬁcients of precision\ncapacitors,’’Trans. Amer. Inst. Elect. Eng., I, Commun. Electron. , vol. 82,\nno. 5, pp. 612–621, Nov. 1963.\n[15] H. H. Zhang, Z. H. Zhang, H. M. Shao, and W. Zhao, ‘‘V oltage coefﬁcients\nmeasurement method of the high voltage compressed-gas capacitor,’’ Chin.\nJ. Sci. Instrum., vol. 36, no. 3, pp. 530–536, Mar. 2015.\n[16] H. Shao, W. Li, D. Dai, B. Liang, and F. Lin, ‘‘The development of 5 nF\nparallel-plate capacitors with low voltage coefﬁcient,’’ in Proc. 29th Conf.\nPrecis. Electromagn. Meas. (CPEM), Aug. 2014, pp. 286–287.\nHUANGHUI ZHANGwas born in Fujian, China,\nin May 1985. He received the B.S. degree from\nShandong University, Weihai, China, in 2007, and\nthe M.E. degree from the Changsha University\nof Science and Technology, Changsha, China,\nin 2010. He is currently pursuing the Ph.D. degree\nwith Beihang University.\nIn 2010, he joined the Fujian Institute of Metrol-\nogy, Fuzhou, China. His research interests include\nthe measurement and the metrology technologies\nin the high voltage and the high current ﬁelds.\nHAIMING SHAO (Member, IEEE) was born\nin 1965. He graduated from the China Metrol-\nogy Institute, Hangzhou, in 1987, and began his\nmetrology study career at the National Institute\nof Metrology (NIM), China. He received the\nM.S. and Ph.D. degrees from Tianjin University,\nTianjin, China, in 1995 and 2010, respectively.\nHe had been working on the development and\ninvestigation of dc resistance measurement stan-\ndards after he joined NIM. He is now in charge of\nthe establishment of dc and ac high voltage standards.\nJIAFU WANG (Member, IEEE) was born in\nHarbin, China, in 1983. He received the B.E.\ndegree in electrical engineering and the Ph.D.\ndegree from Tsinghua University, Beijing, China,\nin 2006 and 2012, respectively.\nFrom 2012 to 2015, he was a Postdoctoral\nResearcher with the Department of Electrical\nEngineering, Tsinghua University. Since 2015,\nhe has been an Associate Research Fellow with\nthe National Institute of Metrology, Beijing. His\nresearch interests include the measurement and the metrology technologies\nin the high voltage and the high current ﬁelds.\nVOLUME 8, 2020 29195"
}