{
  "title": "Superconducting Transformer for Superconducting Cable Testing up to 45 kA",
  "url": "https://openalex.org/W3004494801",
  "year": 2020,
  "authors": [
    {
      "id": "https://openalex.org/A5008058721",
      "name": "Hui Yu",
      "affiliations": [
        "National High Magnetic Field Laboratory"
      ]
    },
    {
      "id": "https://openalex.org/A5028171577",
      "name": "Jun Lü",
      "affiliations": [
        "National High Magnetic Field Laboratory"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2104338782",
    "https://openalex.org/W2400591277",
    "https://openalex.org/W2059833347",
    "https://openalex.org/W2001323326",
    "https://openalex.org/W2006615527",
    "https://openalex.org/W2013470726",
    "https://openalex.org/W2572118661",
    "https://openalex.org/W2028997646",
    "https://openalex.org/W4297835267"
  ],
  "abstract": "A facility capable of testing superconducting cables with current of tens of\\nkA is essential for the development of large superconducting magnets. A\\nsuperconducting transformer (SCT) is a suitable choice as a high DC current\\nsource for testing superconducting cables. In this work, we will present our\\nexperimental results of a SCT up to output current of 45 kA. The properties of\\nthis SCT is characterized at 4.2 K. Its behaviors during quenches at different\\ncurrent levels are studied.\\n",
  "full_text": "MT26-Tue-Af-Po2.16-09 \n  \nTemplate version 8.0d, 22 August 2017. IEEE will put copyright information in this area \nSee http://www.ieee.org/publications_standards/publications/rights/index.html for more information. \n1 \nSuperconducting Transformer for Superconducting \nCable Testing up to 45 kA \n \nH. Yu, and J. Lu \n \n \n \nAbstract—A facility capable of testing superconducting cables \nwith current of tens of kA is essential for the development of large \nsuperconducting magnets. A superconducting transformer (SCT) is \na suitable choice as a high DC current source for testing supercon-\nducting cables. In this work, we will present our experimental re-\nsults of a SCT up to output current of 45 kA. The properties of this \nSCT is characterized at 4.2 K. Its behaviors during quenches at dif-\nferent current levels are studied.  \n  \nIndex Terms —Superconducting transformer, superconducting \ncable, superconducting magnet, quench. \nI. INTRODUCTION \nARGE superconducting magnets systems require super-\nconducting cables that carries tens of kA of electrical cur-\nrent. In order to develop and characterize large superconducting \ncables, it is necessary to apply electrical current at or above its \noperating current.  Superconducting cable testing using a  con-\nventional DC power supply [1]-[2] requires large current leads \nand is energy -inefficient and expensive. A superconducting \ntransformer (SCT) which uses a small current at its primary and \nobtains a large current output at its secondary, is a very efficient \nway to provide large current to superconducting cable samples. \nIn the past decades, a number of SCTs are developed for su-\nperconducting cable testing. For example, a 50 kA SCT is used \nas a current source at the SULTAN test facility at the Centre de \nRecherches en Physique des Plasma (CRPP) in Switzerland [3] \nand another SCT, which was designed to 50 kA and  tested up \nto 38 kA,  is used at FRESCA, the CERN cable test facility in \nSwitzerland [4], [5].  The Lawrence-Berkley National Labora-\ntory (LBNL) developed a 50 kA SCT and tested up to 28 kA \n[6]. The LBNL SCT  was transferred in year 2016 to the Na-\ntional High Magnetic Field Laboratory USA (NHMFL) for en-\nhancing NHMFL’s cable testing capability in high magne tic \nfields. \nThis paper will present our characterization of this SCT up to \n45 kA. The behaviors of the output current during a primary \ncurrent ramp and especially during a quench are studied. The \naccuracy of the output current measurement will be discussed. \n \nThis work is supported by the user collaboration grant program (UCGP) of the \nNHMFL which is supported by NSF through NSF-DMR-1157490 and 1644779, \nand the State of Florida. \nH. Yu and J. Lu are with National High Magnetic Laboratory, Tallahassee-see, \nFL 32310, USA (corresponding author: J. Lu, junlu@magnet.fsu.edu). \nII.  EXPERIMENTAL METHODS \nThe SCT in this research consists of a primary coil made of \nNbTi wire, and a secondary coil made of NbTi Rutherford cable \n[6]. It equipped with two Rogowski coils for measuring output \ncurrent, and two heaters near the output for quenching the SCT \nwhen needed. 50 turns of NbTi wire are wound on each \nRogowski coil for its calibration by a reference current source. \nWhen the SCT was transferred to NHMFL, it was in a good \ncondition, but the electronic control circuits as described in ref-\nerence [6] was no longer available. \nWe first characterized the SCT’s room temperature proper -\nties at the 100 Hz by using a HIOKI 3532-50 LCR meter. Table \nI listed the results and compared with the de -signed values. \nThey are in reasonably good agreement.  \nThe output current measurement is primarily by integrating \nthe inductive voltage of a Rogowski coil that encircles an output \ncurrent lead. This integration is done digitally by a computer \nwithin the data acquisition program written in LabVIEW. The \nvoltages from Rogowski coil and various voltage taps are meas-\nured by a National Instruments DAQ voltage input module \nSCXI-1125. \nThe output current  measurement by Rogowski voltage inte-\ngration was calibrated 4.2 K by applying up to 80 A current to \nColor versions of one or more of the figures in this paper are available online at \nhttp://ieeexplore.ieee.org. \nDigital Object Identifier will be inserted here upon acceptance. \nL \n \n \nFig. 1.  A photograph of the SCT researched in this work. \nRogowski coils \nCryogen \ndewar \nPrimary coil and \nSecondary coil \nSamples \n \n \n2 \nthe 50-turn calibration coil, which is equivalent to up to 4 kA \noutput current. This was done by using a TDK Lambda GEN 8-\n180 DC power supply.  \nThe output current measurement by inductive voltage inte-\ngration is accurate if an initial current is known (presumably \nzero). For a SCT connected with a superconducting sample, \nhowever, the initial current can be significantly deviated from \nzero. This could result in a considerable error. Therefore for ab-\nsolute output current measurement, albeit less accurate, we used \ntwo Hall sensors, one on the center of each output lead. The \nHall sensors used were HZ -312C by Asahi Kasei Corporation \nand calibrated up to 1 tesla in a physical property measurement \nsystem made by Quantum Design. The output cur-rent was cal-\nculated by the measured magnetic field by Biot-Savart law.  \nIn our experiments, SCT’s output was shorted by 6 short \npieces of superconducting cables soldered to the SCT output in \nparallel as shown in Fig. 1. Each of these pieces are Tevatron \ntype NbTi Rutherford cable with its critical current of about 15 \nkA at 1 T [7]-[8]. Since at 50 kA, the magnetic field at the short \ncable is lower than 1 T, so 6 cables connected in parallel are \nadequate for 50 kA output with a healthy margin. A soldering \nprocedure was developed, which uses Sn63Pb37 solder with \nhelp of a soldering fixture consists of cartridge heaters and a \npair of thermocouple.  \n \nIII. R\nESULTS AND DISCUSSIONS \nA. Maximum operating current  \nAfter cooling down the SCT to 4.2 K, the primary current \nwas ramped up at 1 A/s. As the primary current linearly ramped \nup, as expected, the output current increased with a ratio of \n1000:1 as shown in Fig. 3 . The first spontaneous quench oc-\ncurred at about 30 kA. Subsequent quenches (both induced and \nspontaneous in three cooldown campaigns) steadily increased \nquench current. In other words, the SCT clearly showed a train-\ning behavior similar to that in NbTi accelerator magnets. After \nabout total of 20 quenches, its quench current reached 45.5 kA. \nFig. 3 demonstrates a typical ramp -up, hold, and ramp- down \ncycle at 45 kA.  \nIn order to better understand and predict the behavior of SCT, \nwe carried out theoretical simulations. The currents and volt-\nages in a transformer can be described by follow differential \nequations,  \nU\np = IpRp + Lp(dIp / dt) - Mps(dIs / dt), (1a) \n0 = IsRs + Ls(dIs / dt) - Mps(dIp / dt),  (1b) \nwhere subscripted ‘p’ and ‘s’ denote primary and secondary \nrespectively. Lp, Ls, and Mps are respectively inductances of the \nprimary, secondary, and mutual inductance between the pri-\nmary and secondary. L\np, Ls, and Mps at room temperature are \nlisted in Table I.  The value of Rs is essentially the resistance of \nthe solder joint between SCT and the short cables, and a R s = \n2.29 nΩ was obtained experimentally  by fitting the V s-Is data \n(not shown) with a straight line.  So the secondary current Is can \n \n \nFig. 2.  A photo of the test system \nTABLE I \nROOM TEMPERATURE PROPERTIES MEASURED AND DESIGNED \n \nRoom temperature properties \n  \nMeasured \n(at 100 Hz) \nDesigned [6] \nCurrent ratio -- 1000 \nPrimary inductance, Lp (H) 4.158 4.5 \nSecondary inductance, Ls (H) 2.525E-6 2.27E-6 \nMutual inductance between pri-\nmary and secondary, Mps (H) \n2.75E-3 2.8E-3 \nQuench heater resistance (Ω) 10.2 -- \nRogowski inductance (H) 8.257E-3 8.1E-3 \nMutual inductance between sec-\nondary and Rogowski (H) \n5.25E-6 5.3E-6 \nCalibration inductance (H) 2.253E-4 -- \nMutual inductance between calibra-\ntion and Rogowski (H) \n2.665E-4 -- \nPrimary resistance, Rp (Ω) 636 -- \n \nData acquisition \nPrimary power \nsupply \nCryogen \ndewar \n \n \nFig. 3.  A typical ramp and hold cycle at 45 kA. The unit of the primary cur-\nrent is ‘A’, while that of the secondary current is ‘kA’. \n-20\n-10\n0\n10\n20\n30\n40\n50\n-2.5\n-2\n-1.5\n-1\n-0.5\n0\n0.5\n1\n1.5\n2\n2.5\n0 50 100 150\nCurrent\nVo lt age\nT ime (s)\nUp_calculation (V)\nPrim ary vo ltag e Up (V)\nIp (A)\nIs_Hall (kA)\nIs_Rogowski (kA)\nIs_calculation (kA)\n \n \n3 \nbe calculated by Eq. (1b), which  is plotted as Is_calculation in \nFig. 3.  \nFig.3 also shows that while the primary current is held at a \nconstant level,  the output current slowly drifts down.  This is \nconsistent with a predictable current decay due to the joint re-\nsistance between the output leads and the short cables. Our anal-\nysis shows that the decay time constant τ is about 3000 s con-\nsistent with Eq. (1b) where τ = Ls/Rs.  \nIt should be noted that as a consequence of the current decay, \nwhen the primary current was ramped back to zero, the output \ncurrent became negative.  This might have important implica-\ntion in SCT application in critical current measurements, where \nthe flux-flow resistance of the sample makes this decay much \nfaster.  \nB. Quench  \nThe maximum energy stored in this SCT is estimated to be \n45 kJ. This is equivalent to the energy for boiling off 2 liters of \nliquid helium. So a quench of the SCT will not post a serious \nsafety concern. The potentially high inductive voltage during a \nquench, however, is a concern for the safety of the operator and \nthe data acquisition instrumentations. \n During experiments, quenches were induced by energizing \nthe quench heaters attached to the secondary coil.  In the cases \nof quench, the primary power supply detected the quench  (The \nquench is detected when there is more than 4 A current drop for \nlonger than 200 ms.)  and automatically switch off its output. \nThis induced quench event is de picted in Fig.4 where the \ncurrent and voltages at both primary and secondary of the SCT \nare plotted.  \nIt is noticed that the output current after quench cannot be \nmeasured correctly by Rogowski voltage integration. This \nseems to be because either the inductive voltage is out of t he \nmeasurement range, or the data acquisition speed of 2 ms per \ndata set used in our experiment is not fast enough to handle such \na fast event. In such a case, the advantage of the Hall measure-\nment is evident. Since the measured primary voltage U\np during \na quench is less than 2 V, the SCT operation is safe without \nadditional protections.    \nThe calculated primary voltage Up and the secondary current \nIs are also shown in Fig. 4. In this calculation, R s is assumed to \nincrease rapidly at the moment of quench. The calculated Up \nspike of -16 V is not consistent with the measured value of -\n0.93V. Similarly, calculated Is of -17 kA does not agree with  \nthe measurements. The reason might be that the assumption that \nIp becomes zero at the moment of quench is not necessarily true. \nMeasurements with much higher speed are needed to under-\nstand this discrepancy. \nWe also studied the minimum energy needed to induce a \nquench as a part of the SCT operation preparation. Table II \nshows the minimal quench heater power needed at three differ-\nent secondary current levels.  As expected, the power needed \ndecreases with increasing operating current. \nFor the case of a spontaneous quench, Fig. 5 shows one that \noccurred at 45.5 kA. Since no superconducting-to-normal tran-\nsition was observed on the short cables where there are voltage \ntaps, the quench seemed to have been initiated in the SCT. Sim-\nilar to above case of induced quench, U\np spike was only -5 V, \nwhich was con firmed by  a measurement by a digital oscillo-\nscope with a time resolution of 100 µs. \nCalculated Up and Is are also shown in Fig. 5 . Comparison \nbetween calculation and measurement show similar discrep-\nancy as in the case of induced quench. \n \n \nFig. 4.  An induced quench at 45 kA. \n-20\n-10\n0\n10\n20\n30\n40\n50\n-17\n-15\n-13\n-11\n-9\n-7\n-5\n-3\n-1\n1\n3\n0 50 100 150 200 250\nCurrent\nVo lt age\nT ime (s)\nUp_calculation (V)\nUp (V)\nIs_Rogowski (kA)\nIs_calculation (kA)\nIp (A)\nIs_Hall (kA)\n \n \nFig. 5.  Spontaneous quench at 45.5 kA. \n-20\n-10\n0\n10\n20\n30\n40\n50\n-15\n-13\n-11\n-9\n-7\n-5\n-3\n-1\n1\n3\n5\n0 50 100 150\nCurrent\nVo lt age\nT ime (s)\nUp_calculation (V)\nUp (V)\nIs_calculation (kA)\nIs_Hall (kA)\nIs_Rogowski (kA)\nIp (A)\nTABLE II \nMINIMAL QUENCH HEATER POWER NEEDED TO QUENCH THE SCT \n \nNominal secondary cur-\nrent (kA) \nQuench heater cur-\nrent (mA) \nMinimal heater \npower (mW) \n45 120 144 \n20 220 488 \n10 280 784 \n \n \n \n4 \nFinally the behavior of SCT was observed after a primary \npower supply shut down simulating the event of power outage, \nas it is a possible event in a real SCT operation. In this experi-\nment, the SCT was ramped to 45 kA , then the main switch of \nthe power supply was turned off . The result s are displayed in \nFig. 6. After the shut-down, the primary current did not became \nzero quickly. It decayed slowly at about 0.7 A/s. As a result, the \nprimary inductive voltage is moderate. This behavior is likely \ndue to the fact that primary power supply has low internal re-\nsistance after the shut -down. So the stored energy in SCT can \nbe slowly discharged. The result of this experiment proved that \na power-outage does not create a safety hazard to the SCT op-\neration. \nC. Uncertainty in output current measurement \nIt can be seen from Figs. 3-5 that I\ns measured by integration \nof Rogowski signal and by Hall sensors are in reasonably good \nagreement with each other except for those after a quench which \nwe have discussed earlier . But small differences between the \ntwo can be distinguished. The main source of I s error comes \nfrom the Hall sensor measurements. This error can be broken \ndown to the error in Hall sensor calibration, and the error in \nsensor position at 4.2 K which is used to calculated current by \nthe measured magnetic field. In comparison, Rogowski signal \nintegration measurement is not sensitive to geometrical uncer-\ntainties. However, in spite of its relatively larger measurement \nerror, Hall measurement is crucial to obtain absolute output cur-\nrent when the i nitial current state is unknown, or when a fast \nevent like a quench that makes Rogowski measurement unreli-\nable, as demonstrated in Fig.4 and 5 after the quenches.     \nIV. C\nONCLUSION \nThe SCT is characterized at 4.2 K at the NHMFL. It was suc-\ncessfully ramped and held up to 45 kA after a number of train-\ning quenches. The behavior of induced and spontaneous \nquenches were studied. Neither induced nor spontaneous \nquenches generated voltage higher than 5 V in the entire sys -\ntem. The SCT is safe t o operate. Integration of Rogowski coil \nand Hall sensors are complimentary methods of measuring out-\nput current. \nA\nCKNOWLEDGMENT \nWe thank Dr. Hubertus Weijers for helpful discussions and \nMr. Eric Stiers for helps on electronic control. \nREFERENCES \n[1] D. C. van der Laan, P. D. Noyes, G. E. Miller, H. W. Weijers , and G. P. \nWillering, “Characterization of a high-temperature superconducting con-\nductor on round core cables in magnetic fields up to 20 T, ” Supercond. \nSci. Technol., vol 26, Feb 2013, Art. no. 045005. \n[2] M. Takayasu, L. Chiesa, P. D. Noyes, and J. V. Minervini, “Investigation \nof HTS twisted stacked-tape cable (TSTC) conductor for high-field, high-\ncurrent fusion magnets,” IEEE Trans. Appl. Supercond. , vol. 27, no. 4, \nJun 2017, Art. no. 6900105. \n[3] G. Pasztor, E. Aebli, B. Jakob, P. Ming, E. Siegrist,  and P. Weymuth, \n“Design, construction and testing of a 50 kA su perconducting trans-\nformer,” 11th Int. Conf. Magn. Technol. (MT-11), 1990, pp. 467-472. \n[4] A. P. Verweij, J. Genest, A. Knezovic, D. F. Leroy, J.-P. Marzolf, and L. \nR. Oberli, “1.9 K test facility for the reception of the superconducting ca-\nbles for the LHC,” IEEE Trans. Appl. Supercond., vol. 9, no. 2, Jun 1999, \npp. 153-156.  \n[5] A. P. Verweij, C-H Denarie, S. Geminian, and O. Vincent-Viry, “Super-\nconducting transformer and regulation circuit for the CERN cable test fa-\ncility,” J. Phys. Conf. Ser., vol 43, 2006, pp. 833–836.  \n[6] A. Godeke, D. R. Dietderich, J. M. Joseph, J. Lizarazo, S. O. Prestemon, \nG. Miller, and H. W. Weijers, “A superconducting transformer system for \nhigh current cable testing,” Rev. Sci. Instrum., vol 81, Mar 2010, Art. no. \n035107. \n[7] A. D. McInturff, R. A. Lundy, R. Remsbottom, and M. Wake, “I c (H, T) \nmeasurements for multi-kiloampere superconducting magnet conductor,” \nIEEE Trans. Magn., vol 21, no. 2, Mar 1985, pp. 975-978. \n[8] L. Bottura, “A practical fit for the critical surface of NbTi,\" IEEE Trans. \nAppl. Supercond., vol 10, no. 1, Mar 2000, pp. 1054-1057. \n \n \nFig. 6.  Power supply shut down at about 150 s. \n",
  "topic": "Superconductivity",
  "concepts": [
    {
      "name": "Superconductivity",
      "score": 0.6987290978431702
    },
    {
      "name": "Superconducting magnet",
      "score": 0.6891969442367554
    },
    {
      "name": "Transformer",
      "score": 0.6530039310455322
    },
    {
      "name": "Superconducting electric machine",
      "score": 0.6529091000556946
    },
    {
      "name": "Superconducting magnetic energy storage",
      "score": 0.5816410183906555
    },
    {
      "name": "Materials science",
      "score": 0.45324626564979553
    },
    {
      "name": "Critical current",
      "score": 0.43156710267066956
    },
    {
      "name": "Current (fluid)",
      "score": 0.411682665348053
    },
    {
      "name": "Electrical engineering",
      "score": 0.32913100719451904
    },
    {
      "name": "Nuclear engineering",
      "score": 0.3252902626991272
    },
    {
      "name": "Physics",
      "score": 0.2911009192466736
    },
    {
      "name": "Condensed matter physics",
      "score": 0.22354519367218018
    },
    {
      "name": "Voltage",
      "score": 0.21116507053375244
    },
    {
      "name": "Engineering",
      "score": 0.08372345566749573
    }
  ],
  "cited_by": 7
}