{
  "title": "Application of WO3 Hierarchical Structures for the Detection of Dissolved Gases in Transformer Oil: A Mini Review",
  "url": "https://openalex.org/W3016038164",
  "year": 2020,
  "authors": [
    {
      "id": "https://openalex.org/A2126211391",
      "name": "Zhijie Wei",
      "affiliations": [
        "Southwest University"
      ]
    },
    {
      "id": "https://openalex.org/A2304937582",
      "name": "Lingna Xu",
      "affiliations": [
        "Southwest University"
      ]
    },
    {
      "id": "https://openalex.org/A2251506770",
      "name": "Shudi Peng",
      "affiliations": [
        "Shanghai Electric (China)"
      ]
    },
    {
      "id": "https://openalex.org/A2141340083",
      "name": "Qu Zhou",
      "affiliations": [
        "Southwest University"
      ]
    },
    {
      "id": "https://openalex.org/A2126211391",
      "name": "Zhijie Wei",
      "affiliations": [
        "Southwest University"
      ]
    },
    {
      "id": "https://openalex.org/A2304937582",
      "name": "Lingna Xu",
      "affiliations": [
        "Southwest University"
      ]
    },
    {
      "id": "https://openalex.org/A2251506770",
      "name": "Shudi Peng",
      "affiliations": [
        "Shanghai Electric (China)"
      ]
    },
    {
      "id": "https://openalex.org/A2141340083",
      "name": "Qu Zhou",
      "affiliations": [
        "Southwest University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2068211352",
    "https://openalex.org/W2581125249",
    "https://openalex.org/W2903326442",
    "https://openalex.org/W2805156068",
    "https://openalex.org/W2957480470",
    "https://openalex.org/W2567277760",
    "https://openalex.org/W2570232802",
    "https://openalex.org/W2255581911",
    "https://openalex.org/W1974056710",
    "https://openalex.org/W2993957031",
    "https://openalex.org/W1978385067",
    "https://openalex.org/W2988022235",
    "https://openalex.org/W2750926812",
    "https://openalex.org/W2899850274",
    "https://openalex.org/W2562057498",
    "https://openalex.org/W2913004518",
    "https://openalex.org/W2330171827",
    "https://openalex.org/W2906247313",
    "https://openalex.org/W2794903132",
    "https://openalex.org/W2772841364",
    "https://openalex.org/W329502031",
    "https://openalex.org/W2980994594",
    "https://openalex.org/W1997649050",
    "https://openalex.org/W2967110143",
    "https://openalex.org/W1997511785",
    "https://openalex.org/W2612988754",
    "https://openalex.org/W2994907870",
    "https://openalex.org/W2254853253",
    "https://openalex.org/W2949652678",
    "https://openalex.org/W2921771488",
    "https://openalex.org/W2529474889",
    "https://openalex.org/W2907293407",
    "https://openalex.org/W2922180233",
    "https://openalex.org/W2958946212",
    "https://openalex.org/W2012933545",
    "https://openalex.org/W2899142119",
    "https://openalex.org/W2737317491",
    "https://openalex.org/W2930142989",
    "https://openalex.org/W2918530708",
    "https://openalex.org/W2918583630",
    "https://openalex.org/W2990512282",
    "https://openalex.org/W2939250352",
    "https://openalex.org/W2329323222",
    "https://openalex.org/W2218214379",
    "https://openalex.org/W2806799896",
    "https://openalex.org/W2773519528",
    "https://openalex.org/W2896645359",
    "https://openalex.org/W2110773476",
    "https://openalex.org/W2889229438",
    "https://openalex.org/W2979351677",
    "https://openalex.org/W2905459188",
    "https://openalex.org/W2946654129",
    "https://openalex.org/W2773421469",
    "https://openalex.org/W2059694873",
    "https://openalex.org/W2790489669",
    "https://openalex.org/W2804838205",
    "https://openalex.org/W1949182702",
    "https://openalex.org/W2774637096",
    "https://openalex.org/W2759312067",
    "https://openalex.org/W2962911469"
  ],
  "abstract": "Oil-immersed power transformers are considered to be one of the most crucial and expensive devices used in power systems. Hence, high-performance gas sensors have been extensively explored and are widely used for detecting fault characteristic gases dissolved in transformer oil which can be used to evaluate the working state of transformers and thus ensure the reliable operation of power grids. Hitherto, as a typical n-type metal-oxide semiconductor, tungsten trioxide (WO<sub>3</sub>) has received considerable attention due to its unique structure. Also, the requirements for high quality gas detectors were given. Based on this, considerable efforts have been made to design and fabricate more prominent WO<sub>3</sub> based sensors with higher responses and more outstanding properties. Lots of research has focused on the synthesis of WO<sub>3</sub> nanomaterials with different effective and controllable strategies. Meanwhile, the various morphologies of currently synthesized nanostructures from 0-D to 3-D are discussed, along with their respective beneficial characteristics. Additionally, this paper focused on the gas sensing properties and mechanisms of the WO<sub>3</sub> based sensors, especially for the detection of fault characteristic gases. In all, the detailed analysis has contributed some beneficial guidance to the exploration on the surface morphology and special hierarchical structure of WO<sub>3</sub> for highly sensitive detection of fault characteristic gases in oil-immersed transformers.",
  "full_text": "MINI REVIEW\npublished: 07 April 2020\ndoi: 10.3389/fchem.2020.00188\nFrontiers in Chemistry | www.frontiersin.org 1 April 2020 | Volume 8 | Article 188\nEdited by:\nMingshui Yao,\nKyoto University, Japan\nReviewed by:\nYanqiong Li,\nChongqing University of Arts and\nSciences, China\nRuixian Luo,\nBeijing University of Chemical\nTechnology, China\n*Correspondence:\nLingna Xu\nlingnaxu@swu.edu.cn\nQu Zhou\nzhouqu@swu.edu.cn\nSpecialty section:\nThis article was submitted to\nNanoscience,\na section of the journal\nFrontiers in Chemistry\nReceived: 11 January 2020\nAccepted: 28 February 2020\nPublished: 07 April 2020\nCitation:\nWei Z, Xu L, Peng S and Zhou Q\n(2020) Application of WO3 Hierarchical\nStructures for the Detection of\nDissolved Gases in Transformer Oil: A\nMini Review. Front. Chem. 8:188.\ndoi: 10.3389/fchem.2020.00188\nApplication of WO3 Hierarchical\nStructures for the Detection of\nDissolved Gases in Transformer Oil:\nA Mini Review\nZhijie Wei1, Lingna Xu1*, Shudi Peng2 and Qu Zhou1*\n1 College of Engineering and Technology, Southwest University, Chongqing, China,2 Chongqing Electric Power Research\nInstitute, State Grid Chongqing Electric Power Company, Chongqing, China\nOil-immersed power transformers are considered to be one of the most crucial and\nexpensive devices used in power systems. Hence, high-perfo rmance gas sensors\nhave been extensively explored and are widely used for detec ting fault characteristic\ngases dissolved in transformer oil which can be used to evalu ate the working state\nof transformers and thus ensure the reliable operation of po wer grids. Hitherto, as\na typical n-type metal-oxide semiconductor, tungsten trio xide (WO 3) has received\nconsiderable attention due to its unique structure. Also, t he requirements for high quality\ngas detectors were given. Based on this, considerable effor ts have been made to\ndesign and fabricate more prominent WO 3 based sensors with higher responses and\nmore outstanding properties. Lots of research has focused o n the synthesis of WO 3\nnanomaterials with different effective and controllable s trategies. Meanwhile, the various\nmorphologies of currently synthesized nanostructures fro m 0-D to 3-D are discussed,\nalong with their respective beneﬁcial characteristics. Ad ditionally, this paper focused on\nthe gas sensing properties and mechanisms of the WO 3 based sensors, especially for\nthe detection of fault characteristic gases. In all, the det ailed analysis has contributed\nsome beneﬁcial guidance to the exploration on the surface mo rphology and special\nhierarchical structure of WO 3 for highly sensitive detection of fault characteristic gas es in\noil-immersed transformers.\nKeywords: WO 3, gas sensors, hierarchical structure, oil-immersed transfor mer, fault characteristic gas,\nmechanism\nINTRODUCTION\nThe safe and reliable operation of transformers is of vital im portance for a stable and continuous\npower supply to the power grid (\nLu et al., 2018; Zhang D. Z. et al., 2018; Zhang Q. Y.\net al., 2018; Cui et al., 2019; Yang et al., 2019a,b ). To date, the number of oil-immersed\ntransformers accounts for more than 90% of the total number o f power transformers, and\nthe operating state of these power transformers will directly a ﬀect the condition of power\nsystems ( Zhou et al., 2016; Zhang X. X. et al., 2019 ). For a long-running transformer, partial\noverheating and partial discharge will lead to the decompositi on of transformer oil into a\nvariety of fault gases, namely hydrogen (H 2), carbon monoxide (CO), carbon dioxide (CO 2),\nmethane (CH 4), acetylene (C 2H2), ethylene (C 2H4), and ethane (C 2H6) ( Jin et al., 2017; Gao\net al., 2019; Park et al., 2019; Wang J. X. et al., 2019 ). Hence, the detection of these fault\nWei et al. WO3-Based Fault Characteristic Gas Sensors\ncharacteristic gases has been extensively applied to diagnos e early\nlatent faults and evaluate the operation quality of oil-immer sed\ntransformers ( Zhang et al., 2018a; Cui et al., 2019; Gui et al.,\n2019). In this respect, metal oxide semiconductor (MOS) gas\nsensors have attracted considerable attention due to their high-\nperformance capability and wide range of applications for the\ndetection of these fault characteristic gases in transform er oil\n(\nZhou et al., 2013; Zhang Y. Z. et al., 2019 ).\nGiven this, various metal oxides have been investigated via\ndiﬀerent synthesis routes ( Ge et al., 2017; Zhou et al., 2018a,b;\nWei et al., 2019a ). Of all the oxides, as a typical n-type metal-\noxide semiconductor, WO 3 has attracted a large amount interest\ndue to its excellent physicochemical properties ( Miao et al.,\n2015; Xu et al., 2019 ). To improve the performance of the gas\nsensors, sustainable eﬀorts have been made to synthesize var ious\nnanostructures such as nanoparticles, nanorods, nanosheet s,\nand nanoﬂowers ( Wei et al., 2019b ). Additionally, previous\nresearchers have conﬁrmed that these unique structures are\nclosely related to its gas sensing properties (\nYu et al., 2016 ).\nTherefore, the morphology controllable synthesis of diﬀeren t\nhierarchical WO 3 nanostructures and the enhanced gas sensing\nperformances thereof are of great importance to explore and\ndiscuss. In this review, we focus on the morphology controlla ble\nsynthesis of hierarchical WO 3 nanostructures including 0-\ndimensional (0-D), 1-dimensional (1-D), 2-dimensional (2 -\nD), and 3-dimensional (3-D). In addition, the enhanced gas\nsensing performance and related mechanisms, especially the\ndetection of the dissolved gases in transformer oil, have\nbeen introduced.\nSYNTHESIS, SENSOR FABRICATION AND\nMEASUREMENT\nSynthesis of WO3 Materials With Different\nStrategies\nUp to now, various eﬀective strategies have been proposed for\npreparing special surface morphologies and then fabricating\nWO3 based sensors with an enhanced gas sensing performance.\nAmong these synthesis routes the template route, hydrotherm al\nprocess, electrospinning method, and chemical deposition hav e\nall been widely used.\nWang M. D. et al. (2019) synthesized\nthree-dimensionally porous WO 3 materials with diﬀerent pore\nsizes via the template route, and they proposed a relationship\nbetween the pore size and the enhanced gas sensing performance .\nGibot et al. (2011) reported the template synthesis of a highly\nspeciﬁc surface area WO 3 nanoparticle and discussed the surface\nproperties, morphology and crystallographic structure in deta il.\nJin et al. (2019) developed diﬀerent types of WO 3 nanoparticles\nthrough a facile hydrothermal process and proposed the\nmorphology controllable route of changing the proportion of th e\nreagents.\nCao and Chen (2017) used a facile CTAB (Hexadecyl\ntrimethyl ammonium bromide)-assisted hydrothermal metho d\nto synthesize an urchin-like WO 3 nanostructure, and a sensor\nbased on this possessed an excellent gas sensing performance\ndue to its special microstructure.\nGiancaterini et al. (2016)\ninvestigated the inﬂuence of thermal- and visible light-act ivation\non the response of WO 3 nanoﬁbers via an electrospinning\nmethod. Jaroenapibal et al. (2018) presented the electrospinning\nsynthesis of Ag-doped WO 3 nanoﬁbers and demonstrated an\nenhanced gas sensing mechanism.\nSensor Fabrication and Measurement\nTo investigate the gas sensing performances of the diﬀerent\nmorphologies of WO 3 materials, the prepared samples are used\nto fabricate side-heated structures, the most common versi ons\nof which are known as planar and tubular conﬁgurations. As\ndepicted in Figure 1A, both of the structures were composed of\nfour parts: sensing materials, wires, electrodesm, and subs trate.\nThe sensing materials in the sensor structure are prepared by\ndissolving the obtained WO 3 powders into a water-ethanol\nmixed solution. After forming a homogeneous slurry, the past e\nis coated onto an alumina ceramic substrate evenly to obtain\na sensing ﬁlm (\nZhou et al., 2019a,b ). The wires are used to\nconnect the whole measuring circuit and the electrodes are\nused to measure the change in sensor resistance which directly\nreﬂects the performance of the fabricated sensor (\nZhou et al.,\n2018a). The substrate is usually made of aluminum, which\ncan provide reliable support for sensing materials ( Zhou et al.,\n2018c,d).\nThe gas sensing properties of fabricated WO 3 based sensors\nare investigated using a static intelligent gas sensing anal ysis\nplatform. Figure 1B presents an example gas sensor experimental\nprocess. In this set up the background gas and target gas are\nalternately introduced into the gas chamber to measure the\ncharacteristic dynamic response and response-recovery rate of\nthe prepared device. The ﬂow controller is used to adjust the\nﬂux and speed of gases in order to control their concentration s.\nThe fabricated sensors are installed in the testing chamber and\nthe gas sensitivity data will be directly transmitted to the c entral\ncomputer for processing (\nWei et al., 2019c ).\nMORPHOLOGY CONTROL FROM 0-D TO\n3-D\nIn general, the change in sensor resistance caused by the redox\nreaction between oxygen molecules and test gas molecules is used\nto explain the basic operating principle of gas sensors. The surfa ce\nmorphology and special hierarchical microstructures have a\ncrucial eﬀect on the performance of gas sensors. In this respect,\nvarious morphologies from 0-D to 3-D with unique physical\nand chemical properties have been successfully synthesized a nd\nextensively explored via diﬀerent eﬀective strategies (\nGuo et al.,\n2015; Yao et al., 2015 ). Additionally, the controllable synthesis\nroutes of WO 3 nanostructures have been proposed to allow\nfurther investigation into how surface morphology aﬀects gas\nsensing properties. As shown in Figure 1C, the four typical\nkinds of nanostructures, from 0-D to 3-D, can be controllabl y\nsynthesized with diﬀerent eﬀective strategies. Given this, t o\nfurther optimize the performance of WO 3 based sensors for\npractical application, the exploration of surface morphology\nand special hierarchical structure is still a challenging but\nmeaningful work.\nFrontiers in Chemistry | www.frontiersin.org 2 April 2020 | Volume 8 | Article 188\nWei et al. WO3-Based Fault Characteristic Gas Sensors\nFIGURE 1 | (A)Schematic diagram of sensor structures. (B) Schematic illustration of a gas sensing experimental platf orm. (C) Synthesis routes of different\nmorphologies. Nanoparticles. Reprinted with permission f rom Kwon et al. Copyright (2010) American Chemical Society. Nanowires. Reprinted with permission from\nWang et al. Copyright (2008) American Chemical Society. Nan osheets. Reprinted with permission from Zhang et al. Copyri ght (2015) American Chemical Society.\nNanoﬂowers. Reprinted with permission from Liu et al. Copyri ght (2010) American Chemical Society. (D) Gas sensing mechanism.\n0-Dimensional (0-D) WO3\nAs the lowest dimensional structure, 0-D WO 3 has been\ninvestigated less as it is limited by its low speciﬁc surface\narea and insuﬃcient porous structure. These disadvantages l imit\nthe diﬀusion and adsorption of target gas molecules during\nthe sensing process, leading to unsatisfactory performances .\nAdditionally, during the preparation of 0-D WO 3 nanoparticles\nand the operation of the fabricated sensor, the coarsening\nand agglomeration of the nanoparticles might decrease the\nresponse of the device. However, various WO 3 nanoparticles have\nbeen rationally designed and synthesized. Based on the defe cts\nmentioned above, WO 3 nanoparticles with high dispersivity\nand ultra-small diameters might improve the performance of\nnanoparticle based sensors. In this respect,\nLi et al. (2019)\nsynthesized highly dispersible WO 3 nanoparticles with sizes\nranging from 10 to 50 nm and they found the fabricated sensor\nexhibited an excellent gas sensing performance due to the hig hly\neﬀective surface area and suﬃcient oxygen vacancies.\n1-Dimensional (1-D) WO3\n1-D WO 3 structures, for instance, nanorods, nanoﬁbers,\nnanotubes, and nanowires, are considered to be beneﬁcial\nnanostructures with improved special surface areas compared\nto. Also, the typical morphology has been applied to the\ndetection the fault characteristic gases dissolved in tran sformer\noil.\nWisitsoorat et al. (2013) developed 1-D WO 3 nanorods via\na magnetron sputtering method, an H 2 sensor based on which\npossessed prominent properties including a high response and\nfast response-recovery time. To further enhance the performa nce\nof 1-D WO 3, the doping of metal ions and the introduction\nof surfactants have been conﬁrmed to be eﬀective strategies\nto improve the redox reaction and the orientation of special\nstructures. Atomic platinum (Pt) is considered to be an eﬀective\ndoping element which can optimize the sensing properties and\nthis strategy can be explained by the spillover eﬀect of oxygen\nspecies and the enhancement of adsorption and desorption (\nPark\net al., 2012 ).\n2-Dimensional (2-D) WO3\nCompared with low dimensional structures, 2-D structures\npossess a larger special surface area for the target gas molecu les\nand therefore higher gas responses (\nDral and ten Elshof,\n2018). In comparison to the bulk 3-D structure, freestanding\n2-D structures such as nanosheets, nanoplates, and thin\nFrontiers in Chemistry | www.frontiersin.org 3 April 2020 | Volume 8 | Article 188\nWei et al. WO3-Based Fault Characteristic Gas Sensors\nﬁlms can provide better optimization routes including the\nmodulation of the materials activity, surface polarization and rich\noxygen vacancies. Additionally, the hierarchical microst ructure\nassembled by rigid 2-D nanosheets possesses an open and well-\ndeﬁned structure which can promote the diﬀusion of target\ngas molecules (\nNasir and Pumera, 2019 ). Especially in the ﬁeld\nof the detection of fault characteristic gases in oil-immer sed\ntransformers, 2-D WO 3 based sensors have been conﬁrmed to be\npromising candidates with excellent gas sensing performance s.\nHuang et al. (2020) synthesized Ru-loaded WO 3 nanosheets\nvia a facile impregnation method and they believed that the\nhigher activity of surface lattice oxygens in WO 3 nanosheets was\nactivated by the introduction of Ru.\nOu et al. (2012) fabricated\nH2 sensors based on WO 3 nanoplates at diﬀerent calcination\ntemperatures and proved that the 2-D structure possesses a\nhigher surface to volume ratio which clearly increased the\nnumber of surface interactive areas that could interact wit h\nH2 molecules.\n3-Dimensional (3-D) WO3\nHierarchical 3-D structures are always assembled from dive rse\nlower dimension fundamental blocks such nanoparticles,\nnanorods, and nanosheets. These various assembly routes\nmake the hierarchical microstructures present diﬀerent speci al\nmorphologies, for instance, microspheres, microﬂowers,\nmesoporous structures, and other irregular structures. The well-\ndeﬁned structures always possess a larger special surface are a\nand more unique microstructures, leading to better gas sens ing\nperformances including higher response times, more prominent\nselectivity, stability, and repeatability (\nZhang et al., 2013 ).\nTo detect fault characteristic gases, Zhang Y. X. et al. (2019)\nprepared a sea-urchin-like hexagonal WO 3 structure created by\nthe capping eﬀect of potassium sulfate (which can prompt the\nanisotropic growth of WO 3) and the H 2 sensing performance\nwas conﬁrmed to beneﬁt from the special hierarchical 3-D\nmicrostructure.\nWei et al. (2017) synthesized hollow cauliﬂower-\nlike WO 3 by a facile hydrothermal process and found that the\nhigher and faster response to CO might beneﬁt from the hollow\nporous microstructure.\nGAS SENSING PROPERTIES AND\nMECHANISM\nTo improve the performances of the detection of fault\ncharacteristic gases in oil-immersed transformers, WO 3\nbased sensors with diﬀerent hierarchical structures have be en\nconﬁrmed to be promising candidates for on-line monitoring\nof oil-immersed power transformers due to their excellent ga s\nsensing properties. In this section, we summarize the related\nworks based on the recently published investigations ( Table 1)\nand propose a plausible gas sensing mechanism.\nThe gas sensing mechanism of the WO 3 based sensors can be\ndemonstrated as the change in sensor resistance caused by th e\nredox reaction between the oxygen species (mainly O −) and test\ngas molecules on the surface of synthesized materials, as sh own\nin Figure 1D. For typical n-type WO 3 based sensing materials,\nTABLE 1 |Summary of recent researches on WO 3 based sensors for sensing of\nfault characteristic gases dissolved in transformer oil.\nGas Sensing material Concentration Temp. Response Refereneces\nH2 WO3 nanoparticles 200 ppm 200 ◦C 20 Boudiba et al.,\n2013\nWO3 nanoparticles 0.5 vol% R.T. 27.3 Xiao et al., 2018\nPd-doped\nmesoporous WO 3\n5000 ppm R.T. 11.78\nWu et al., 2019\nPdO-WO3\nnanohybrids\n40 ppm 100 ◦C 23.5 Geng et al., 2017\nWO3 nanosheets 1% 250 ◦C 80% Rahmani et al.,\n2017\nCO Pt doped\nmesoporous WO 3\n100 ppm 125 ◦C 10.1 Ma et al., 2018\nCauliﬂower-like\nWO3\n50 ppm 270 ◦C 16.6\nWei et al., 2017\nPt-modiﬁed WO3\nﬁlms\n20 ppm 150 ◦C 114 Lei et al., 2016\nPt-WO3 nanorods 30 ppm 300 ◦C 4.82 Park et al., 2012\nCH4 SnO2-WO3\nnanosheets\n500 ppm 90 ◦C 1.5 Xue et al., 2019a\nRh-modiﬁed WO3\nﬁlms\n5 ppm 350 ◦C 63.1 Tan and Lei, 2019\nAu-WO3 nanowire 100 ppm 250 ◦C 37% Vuong et al., 2015\nSnO2-WO3\nnanoplates\n500 ppm 110 ◦C 2.85 Xue et al., 2019b\nC2H2 Porous WO 3\nnetworks\n200 ppm 300 ◦C 58 Zhang et al., 2018b\nWO3 nanoﬂowers 50 ppm 275 ◦C 20.95 Wei et al., 2019b\nrGO-WO3\nnanocomposite\n50 ppm 150 ◦C 15 Jiang et al., 2018\nR.T., room temperature.\nthe oxygen molecules in the testing environment will be redu ced\nand adsorbed on the surface of the materials by capturing the\nelectrons from the conduction band, and the target gas molec ules\nwill react with the oxygen ions and release the electrons back to\nthe conduction band. The involved reactions can be describe d as\nfollows (H2 and CO gas are taken as examples):\nO2(g) → O2(ads) (1)\nO2(ads) + 2e− → 2O−(ads) (2)\nH2(g) + O−(ads)+ → H2O(ads) + e− (3)\nCO(ads) + O−(ads) → CO2 + e− (4)\nCONCLUSION\nIn this mini review, we focus on the synthesis strategies,\nmorphology control, sensing experimental procedures, and gas\nsensing performances of hierarchical WO 3 structures from 0-D\nto 3-D. The gas sensing properties of various high-performance\nWO3 based sensors are summarized and discussed, especially in\nregards to the detection of fault characteristic gases disso lved\nin transformer oil. With an increasing requirement for high\nquality gas sensors with high responses, prominent selectivit y,\noutstanding stability, and excellent repeatability, conside rable\nFrontiers in Chemistry | www.frontiersin.org 4 April 2020 | Volume 8 | Article 188\nWei et al. WO3-Based Fault Characteristic Gas Sensors\neﬀorts have been made to propose more eﬀective synthesis\nroutes, more beneﬁcial morphology control and more accurate\nexperiment processes. It can be foreseen that more and more\nhierarchical WO 3 structures will be rationally designed and\nprepared due to their complicated microstructures with high\nspecial surface areas, broad internal contact area, and well -\ndeﬁned structures. These special hierarchical structures w ill\nprovide more diﬀusion paths, reactive sites, and micro reactio n\nspaces for target gas molecules adsorption, retention, and\nreaction. Although some achievements have been made by\nunremitting eﬀorts, the further enhancement of the gas sensi ng\nproperties of WO 3 based sensors for practical applications\nis still a challenging but meaningful work. We hope that\nour work can contribute some beneﬁcial guidance to the\nexploration of the surface morphology and special hierarchica l\nstructures of WO 3. Additionally, much eﬀort should be\nmade to fabricate high-performance WO 3 based sensors with\npredictably complicated hierarchical structures for detecti ng\nvarious gases, especially the fault characteristic gases dis solved in\ntransformer oil.\nAUTHOR CONTRIBUTIONS\nAll authors listed have made a substantial, direct and intel lectual\ncontribution to the work, and approved it for publication.\nFUNDING\nThis work has been supported in part by the National\nNatural Science Foundation of China (No. 51507144),\nFundamental Research Funds for the Central Universities\n(No. XDJK2019B021), the Chongqing Science and Technology\nCommission (CSTC) (No. cstc2016jcyjA0400) and the project o f\nChina Scholarship Council (CSC).\nREFERENCES\nBoudiba, A., Roussel, P., Zhang, C., Olivier, M. G., Snyders, R ., and Debliquy,\nM. (2013). Sensing mechanism of hydrogen sensors based on palladi um-\nloaded tungsten oxide (Pd-WO3). Sensor. Actuator. B Chem. 187, 84–93.\ndoi: 10.1016/j.snb.2012.09.063\nCao, S. X., and Chen, H. (2017). Nanorods assembled hierarchical ur chin-like WO3\nnanostructures: hydrothermal synthesis, characterization, and t heir gas sensing\nproperties. J. Alloy Compo. 702, 644–648. doi: 10.1016/j.jallcom.2017.01.232\nCui, H., Zhang, X. X., Zhang, G. Z., and Tang, J. (2019). Pd-doped M oS2\nmonolayer: a promising candidate for DGA in transformer oil based on D FT\nmethod. Appl. Surf. Sci. 470, 1035–1042. doi: 10.1016/j.apsusc.2018.11.230\nDral, A. P., and ten Elshof, J. E. (2018). 2D metal oxide nanoﬂakes for sensing\napplications: review and perspective. Sensor Actuator B Chem. 272, 369–392.\ndoi: 10.1016/j.snb.2018.05.157\nGao, X., Zhou, Q., Lu, Z. R., Xu, L. N., Zhang, Q. Y., and Zeng, W. ( 2019). Synthesis\nof Cr 2O3 nanoparticle-coated SnO 2 nanoﬁbers and C 2H2 sensing properties.\nFront. Mater. 6:163. doi: 10.3389/fmats.2019.00163\nGe, Q., Ma, S. Y., Xu, Y. B., Xu, X. L., Chen, H., Qiang, Z., et al. (201 7). Preparation,\ncharacterization and gas sensing properties of Pr-doped ZnO/SnO 2\nnanoﬂowers. Mater. Lett. 191, 5–9. doi: 10.1016/j.matlet.2016.12.116\nGeng, X., Luo, Y. F., Zheng, B. B., and Zhang, C. (2017). Photon assisted room-\ntemperature hydrogen sensors using PdO loaded WO 3 nanohybrids. Int. J.\nHydrogen Energ. 42, 6425–6343. doi: 10.1016/j.ijhydene.2016.12.117\nGiancaterini, L., Emamjomeh, S. M., De Marcellis, A., Palange, E., R esmini,\nA., Anselmi-Tamburini, U., et al. (2016). The inﬂuence of thermal and\nvisible light activation modes on the NO 2 response of WO3 nanoﬁbers\nprepared by electrospinning. Sensor Actuator B Chem . 229, 387–395.\ndoi: 10.1016/j.snb.2016.02.007\nGibot, P., Comet, M., Vidal, L., Moitrier, F., Lacroix, F., Suma, Y ., et al.\n(2011). Synthesis of WO 3 nanoparticles for superthermites by the\ntemplate method from silica spheres. Solid State Sci . 13, 908–914.\ndoi: 10.1016/j.solidstatesciences.2011.02.018\nGui, Y. G., Li, T., He, X., Ding, Z. Y., and Yang, P. G. (2019). Pt c luster\nmodiﬁed h-BN for gas sensing and adsorption of dissolved gases in\ntransformer oil: a Density Functional Theory Study. Nanomaterials 9:1746.\ndoi: 10.3390/nano9121746\nGuo, T., Yao, M. S., Lin, Y. H., and Nan, C. W. (2015). A comprehensi ve review on\nsynthesis methods for transition-metal oxide nanostructures. CrystEngComm\n17, 3551–3585. doi: 10.1039/C5CE00034C\nHuang, D., Yuan, W. J., Fan, S. R., Tian, C., Hua, Z. Q., Tian, X. M. , et al. (2020).\nHydrogen sensing mechanism of Ru-loaded WO 3 nanosheets. Sensor Actuator\nB Chem. 304:127339. doi: 10.1016/j.snb.2019.127339\nJaroenapibal, P., Boonma, P., Saksilaporn, N., Horprathum, M.,\nAmornkitbamrung, V., and Triroj, N. (2018). Improved NO 2 sensing\nperformance of electrospun WO 3 nanoﬁbers with silver doping. Sensor\nActuator B Chem. 255, 1831–1840. doi: 10.1016/j.snb.2017.08.199\nJiang, Z. K., Chen, W. G., Jin, L. F., Cui, F., Song, Z. H., and Zh u, C. Z.\n(2018). High performance acetylene sensor with heterostructure bas ed on\nWO3 nanolamellae/reduced graphene oxide (rGO) nanosheets operating a t low\ntemperature. Nanomaterials 8. doi: 10.3390/nano8110909\nJin, L. F., Chen, W. G., Zhang, H., Xiao, G. W., Yu, C. T., and Zhou ,\nQ. (2017). Characterization of reduced graphene oxide (rGO)-loade d SnO 2\nnanocomposite and applications in C 2H2 gas detection. Appl. Sci. Basel7:19.\ndoi: 10.3390/app7010019\nJin, Z. W., Hu, P. F., Xu, W., Zhou, J., Guo, W. W., Chen, Y., et al.\n(2019). Hydrothermal synthesis and gas sensing properties of hybrid W O3\nnano-materials using octadecylamine. J. Alloy. Compo . 785, 1047–1055.\ndoi: 10.1016/j.jallcom.2019.01.248\nLei, T., Deng, Q., Zhang, S. P., Cai, S. Z., and Xie, C. S. (2016) . Fast identiﬁcation\nof CO by using single Pt-modiﬁed WO 3 sensing ﬁlm based on optical\nmodulation. Sensor Actuator B Chem. 232, 506–513. doi: 10.1016/j.snb.2016.\n04.001\nLi, T. T., Shen, Y. B., Zhao, S. K., Zhong, X. X., Zhang, W., Han, C ., et al. (2019).\nSub-ppm level NO 2 sensing properties of polyethyleneimine-mediated WO 3\nnanoparticles synthesized by a one-pot hydrothermal method. J. Alloy. Compo.\n783, 103–112. doi: 10.1016/j.jallcom.2018.12.287\nLu, Z. R., Zhou, Q., Xu, L. N., Gui, Y. G., Zhao, Z. Y., Tang, C., e t al.\n(2018). Synthesis and characterization of highly sensitive hy drogen (H 2)\nsensing device based on Ag doped SnO 2 nanospheres. Materials 11:492.\ndoi: 10.3390/ma11040492\nMa, J. H., Ren, Y., Zhou, X. R., Liu, L. L., Zhu, Y. H., Cheng, X. W., e t al.\n(2018). Pt Nanoparticles sensitized ordered mesoporous WO 3 semiconductor:\ngas sensing performance and mechanism study. Adv. Funct. Mater. 28:1705268.\ndoi: 10.1002/adfm.201705268\nMiao, B., Zeng, W., Mu, Y. J., Yu, W. J., Hussain, S., Xu, S. B., et al.\n(2015). Controlled synthesis of monodisperse WO 3•H2O square\nnanoplates and their gas sensing properties. Appl. Surf. Sci. 349, 380–386.\ndoi: 10.1016/j.apsusc.2015.04.226\nNasir, M. Z. M., and Pumera, M. (2019). Emerging mono-elemental\n2D nanomaterials for electrochemical sensing applications: from\nborophene to bismuthene. Trac Trend. Anal. Chem . 121:115696.\ndoi: 10.1016/j.trac.2019.115696\nOu, J. Z., Yaacob, M. H., Campbell, J. L., Breedon, M., Kalantar-zade h,\nK., and Wlodarski, W. (2012). H 2 sensing performance of optical ﬁber\ncoated with nano-platelet WO 3 ﬁlm. Sensor Actuator B Chem. 166, 1–6.\ndoi: 10.1016/j.snb.2011.01.033\nPark, M. S., Lee, J. H., Park, Y., Yoo, R., Park, S., Jung, H., et al. (2 019).\nDoping eﬀects of ZnO quantum dots on the sensitive and selectiv e detection\nof acetylene for dissolved-gas analysis applications of transformer oil. Sensor\nActuator B Chem. 299:126992. doi: 10.1016/j.snb.2019.126992\nPark, S., Kim, H., Jin, C., Choi, S. W., Kim, S. S., and Lee, C. (2012 ). Enhanced CO\ngas sensing properties of Pt-functionalized WO 3 nanorods. Thermochim. Acta\n542, 69–73. doi: 10.1016/j.tca.2011.12.002\nFrontiers in Chemistry | www.frontiersin.org 5 April 2020 | Volume 8 | Article 188\nWei et al. WO3-Based Fault Characteristic Gas Sensors\nRahmani, M. B., Yaacob, M. H., and Sabri, Y. M. (2017). Hydrogen sen sors based\non 2D WO 3 nanosheets prepared by anodization. Sensor Actuator B Chem. 251,\n57–64. doi: 10.1016/j.snb.2017.05.029\nTan, Y., and Lei, Y. (2019). Atomic layer deposition of Rh nanopart icles on WO 3\nthin ﬁlm for CH 4 gas sensing with enhanced detection characteristics. Ceram.\nInter. 46, 9936–9942. doi: 10.1016/j.ceramint.2019.12.094\nVuong, N. M., Kim, D., and Kim, H. (2015). Porous Au-embedded WO 3\nnanowire structure for eﬃcient detection of CH 4 and H 2S. Sci. Rep. 5:11040.\ndoi: 10.1038/srep11040\nWang, J. X., Zhou, Q., Lu, Z. R., Wei, Z. J., and Zeng, W. (2019). A Gas sensing\nperformances and mechanism at atomic level of Au-MoS2 microspheres. Appl.\nSurf. Sci. 490, 124–136. doi: 10.1016/j.apsusc.2019.06.075\nWang, M. D., Li, Y. Y., Yao, B. H., Zhai, K. H., Li, Z. J., and Yao, H. C. (2019).\nSynthesis of three-dimensionally ordered macro/mesoporous C-doped WO 3\nmaterials: eﬀect of template sizes on gas sensing properties. Sensor Actuator B\nChem. 288, 656–666.doi: 10.1016/j.snb.2019.03.051\nWei, S. H., Han, L. X., Wang, M. Y., Zhang, H. H., Du, W. M., and Zhou,\nM. H. (2017). Hollow cauliﬂower-like WO 3 nano structures: Hydrothermal\nsynthesis and their CO sensing properties. Mater. Lett. 186, 259–262.\ndoi: 10.1016/j.matlet.2016.10.016\nWei, Z. J., Zhou, Q., Lu, Z. R., Xu, L. N., Gui, Y. G., and Tang, C.\n(2019b). Morphology controllable synthesis of hierarchical WO 3\nnanostructures and C 2H2 sensing properties. Phys. E 109, 253–260.\ndoi: 10.1016/j.physe.2019.01.006\nWei, Z. J., Zhou, Q., Wang, J. X., Gui, Y. G., and Zeng, W. (2019a ). A novel porous\nNiO nanosheet and its H 2 sensing performance. Mater. Lett. 245, 166–169.\ndoi: 10.1016/j.matlet.2019.03.013\nWei, Z. J., Zhou, Q., Wang, J. X., Lu, Z. R., Xu, L. N., and Zeng, W. (2019c).\nHydrothermal synthesis of SnO 2 nanoneedle-anchored NiO microsphere and\nits gas sensing performances. Nanomaterials 9:1015. doi: 10.3390/nano9071015\nWisitsoorat, A., Ahmad, M. Z., Yaacob, M. H., Horpratum, M., Phakaratk ul, D.,\nLomas, T., et al. (2013). Optical H 2 sensing properties of vertically aligned Pd/\nWO3 nanorods thin ﬁlms deposited via glancing angle rf magnetron sputterin g.\nSensor Actuator B Chem. 182, 795–801. doi: 10.1016/j.snb.2013.03.091\nWu, C. H., Zhu, Z., Huang, S. Y., and Wu, R. J. (2019). Preparation of palladium-\ndoped mesoporous WO 3 for hydrogen gas sensors. J. Alloy Compo. 776,\n965–973. doi: 10.1016/j.jallcom.2018.10.372\nXiao, S. H., Liu, B., Zhou, R., Liu, Z. W., Li, Q. H., and Wang, T. H. ( 2018).\nRoom-temperature H 2 sensing interfered by CO based on interfacial eﬀects\nin palladium-tungsten oxide nanoparticles. Sensor Actuator B Chem. 254,\n966–972. doi: 10.1016/j.snb.2017.07.169\nXu, Y., Zeng, W., and Li, Y. Q. (2019). A novel seawave-like hiera rchical WO 3\nnanocomposite and its ammonia gas properties. Mater. Lett. 248, 86–88.\ndoi: 10.1016/j.matlet.2019.04.010\nXue, D. P., Wang, J. J., Wang, Y., Sun, G., Cao, J. L., Bala, H., et a l. (2019a).\nEnhanced methane sensing properties of WO3 nanosheets with domina nt\nexposed (200) facet via loading of SnO 2 nanoparticles. Nanomaterials 9:351.\ndoi: 10.3390/nano9030351\nXue, D. P., Wang, Y., Cao, J. L., Sun, G., and Zhang, Z. Y. (2019b ). Improving\nmethane gas sensing performance of ﬂower-like SnO 2 decorated by WO 3\nnanoplates. Talanta199, 603–611. doi: 10.1016/j.talanta.2019.03.014\nYang, Z., Zhou, Q., Wu, X. D., and Zhao, Z. Y. (2019b). A novel mea suring\nmethod of interfacial tension of transformer oil combined PSO opti mized SVM\nand multi frequency ultrasonic technology. IEEE Access 7, 182624–182631.\ndoi: 10.1109/ACCESS.2019.2954899\nYang, Z., Zhou, Q., Wu, X. D., Zhao, Z. Y., Tang, C., and Chen, W. G. (2019a).\nDetection of water content in transformer oil using multi frequenc y ultrasonic\nwith PCA-GA-BPNN. Energies 12:1379. doi: 10.3390/en12071379\nYao, M. S., Li, Q. H., Hou, G. L., Lu, C., Cheng, B. L., Wu, K. C., et al. (2015).\nDopant-controlled morphology evolution of WO 3 polyhedra synthesized by\nRF thermal plasma and their sensing properties. ACS Appl. Mater. Inter. 7,\n2856–2866. doi: 10.1021/am5081277\nYu, Y. C., Zeng, W., Xu, M. X., and Peng, X. H. (2016). Hydrothermal synt hesis of\nWO3•H2O with diﬀerent nanostructures from 0D to 3D and their gas sensing\nproperties. Phys. E79, 127–132. doi: 10.1016/j.physe.2015.12.023\nZhang, D. Z., Jiang, C. X., and Wu, J. F. (2018). Layer-by-layer assembled In 2O3\nnanocubes/ﬂower-like MoS 2 nanoﬁlm for room temperature formaldehyde\nsensing. Sensor Actuator B Chem. 273, 176–184. doi: 10.1016/j.snb.2018.06.044\nZhang, H., Chen, W. G., Jin, L. F., and Cui, F. (2018b). Hierarchi cally porous WO 3\nmicrostructures with networks for acetylene sensing application. Mater. Lett.\n214, 198–201. doi: 10.1016/j.matlet.2017.11.122\nZhang, H., Chen, W. G., Li, Y. Q., Jin, L. F., Cui, F., and Song, Z . H. (2018a).\n3D Flower-like NiO hierarchical structures assembled with size-co ntrollable\n1D blocking units: gas sensing performances towards acetylene. Front. Chem.\n6:472. doi: 10.3389/fchem.2018.00472\nZhang, H. B., Yao, M. S., Bai, L. Y., Xiang, W. C., Jin, H. C., Li, J. L., et al. (2013).\nSynthesis of uniform octahedral tungsten trioxide by RF induct ion thermal\nplasma and its application in gas sensing. CrystEngComm 15, 1432–1438.\ndoi: 10.1039/c2ce26514a\nZhang, Q. Y., Zhou, Q., Lu, Z. R., Wei, Z. J., Xu, L. N., and Gui, Y .\nG. (2018). Recent advances of SnO 2-based sensors for detecting fault\ncharacteristic gases extracted from power transformer oil. Front. Chem.\n6:364.doi: 10.3389/fchem.2018.00364\nZhang, X. X., Fang, R. X., Chen, D. C., and Zhang, G. Z. (2019). Usi ng\nPd-doped gamma-graphyne to detect dissolved gases in transformer\noil: a density functional theory investigation. Nanomaterials 9:1490.\ndoi: 10.3390/nano9101490\nZhang, Y. Z., Zeng, W., and Li, Y. Q. (2019). NO 2 and H 2\nsensing properties for urchin-like hexagonal WO 3 based on\nexperimental and ﬁrst-principle investigations. Ceram. Inter . 45,\n6043–6050.doi: 10.1016/j.ceramint.2018.12.075\nZhang, Y. X., Sun, X., Tan, S., Liu, T., and Cui, H. (2019). Adsorpti on\ncharacteristic of Rh-doped MoSe 2 monolayer towards H 2 and C 2H2 for\nDGA in transformer oil based on DFT method. Appl. Surf. Sci . 487,\n930–937.doi: 10.1016/j.apsusc.2019.05.108\nZhou, Q., Chen, W. G., Xu, L. N., Kumar, R., Gui, Y. G., Zhao, Z. Y. ,\net al. (2018c). Highly sensitive carbon monoxide (CO) gas sensor s based\non Ni and Zn doped SnO 2 nanomaterials. Ceram. Inter. 44, 4392–4399.\ndoi: 10.1016/j.ceramint.2017.12.038\nZhou, Q., Chen, W. G., Xu, L. N., and Peng, S. D. (2013). Hydrotherma l\nsynthesis of various hierarchical ZnO nanostructures and their methane\nsensing properties. Sensors 13, 6171–6182. doi: 10.3390/s130506171\nZhou, Q., Hong, C. X., Yao, Y., Hussain, S., Xu, L. N., Zhang, Q. Y.,\net al. (2018d). Hierarchically MoS2 nanospheres assembled from nanosh eets\nfor superior CO gas-sensing properties. Mater. Res. Bull. 101, 132–139.\ndoi: 10.1016/j.materresbull.2018.01.030\nZhou, Q., Lu, Z. R., Wei, Z. J., Xu, L. N., Gui, Y. G., and Chen, W. G. (2019b).\nHydrothermal synthesis of hierarchical ultrathin NiO nanoﬂakes fo r high-\nperformance CH4 sensing. Front. Chem. 6:194. doi: 10.3389/fchem.2018.00194\nZhou, Q., Tang, C., Zhu, S. P., Chen, W. G., and Li, J. (2016). S ynthesis,\ncharacterisation and sensing properties of Sm 2O3 doped SnO 2 nanorods to\nC2H2 gas extracted from power transformer oil. Mater. Technol. 31, 364–370.\ndoi: 10.1179/1753555715Y.0000000069\nZhou, Q., Umar, A., Sodki, E., Amine, A., Xu, L. N., Gui, Y. G., et al. (2018a).\nFabrication and characterization of highly sensitive and select ive sensors\nbased on porous NiO nanodisks. Sensor Actuator B Chem. 259, 604–615.\ndoi: 10.1016/j.snb.2017.12.050\nZhou, Q., Xu, L. N., Umar, A., Chen, W. G., and Kumar, R. (2018b).\nPt nanoparticles decorated SnO 2 nanoneedles for eﬃcient CO\ngas sensing applications. Sensor Actuator B Chem . 256, 656–664.\ndoi: 10.1016/j.snb.2017.09.206\nZhou, Q., Zeng, W., Chen, W. G., Xu, L. N., Kumar, R., and Umar, A. (2 019a). High\nsensitive and low-concentration sulfur dioxide (SO 2) gas sensor application\nof heterostructure NiO-ZnO nanodisks. Sensor Actuator B Chem. 298:126870.\ndoi: 10.1016/j.snb.2019.126870\nConﬂict of Interest: The authors declare that the research was conducted in the\nabsence of any commercial or ﬁnancial relationships that could be c onstrued as a\npotential conﬂict of interest.\nCopyright © 2020 Wei, Xu, Peng and Zhou. This is an open-access article distributed\nunder the terms of the Creative Commons Attribution License(CC BY). The use,\ndistribution or reproduction in other forums is permitted, provided the original\nauthor(s) and the copyright owner(s) are credited and that the original publication\nin this journal is cited, in accordance with accepted academic practice. No use,\ndistribution or reproduction is permitted which does not comply with these terms.\nFrontiers in Chemistry | www.frontiersin.org 6 April 2020 | Volume 8 | Article 188",
  "topic": "Dissolved gas analysis",
  "concepts": [
    {
      "name": "Dissolved gas analysis",
      "score": 0.8171919584274292
    },
    {
      "name": "Tungsten trioxide",
      "score": 0.705127477645874
    },
    {
      "name": "Transformer",
      "score": 0.5616762042045593
    },
    {
      "name": "Nanomaterials",
      "score": 0.5174310803413391
    },
    {
      "name": "Nanotechnology",
      "score": 0.514139711856842
    },
    {
      "name": "Tungsten oxide",
      "score": 0.49027517437934875
    },
    {
      "name": "Materials science",
      "score": 0.48956117033958435
    },
    {
      "name": "Computer science",
      "score": 0.4251846969127655
    },
    {
      "name": "Tungsten",
      "score": 0.4228990972042084
    },
    {
      "name": "Semiconductor",
      "score": 0.4101774990558624
    },
    {
      "name": "Transformer oil",
      "score": 0.38823267817497253
    },
    {
      "name": "Electrical engineering",
      "score": 0.23250699043273926
    },
    {
      "name": "Engineering",
      "score": 0.1767219603061676
    },
    {
      "name": "Optoelectronics",
      "score": 0.14581027626991272
    },
    {
      "name": "Voltage",
      "score": 0.0
    },
    {
      "name": "Metallurgy",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I142108993",
      "name": "Southwest University",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I4210126065",
      "name": "Shanghai Electric (China)",
      "country": "CN"
    }
  ],
  "cited_by": 30
}