{
  "title": "Real-Time Monitoring &amp; Adaptive Protection of Power Transformer to Enhance Smart Grid Reliability",
  "url": "https://openalex.org/W3019961576",
  "year": 2019,
  "authors": [
    {
      "id": "https://openalex.org/A5076501673",
      "name": "Maulik Raichura",
      "affiliations": [
        "Gujarat Technological University"
      ]
    },
    {
      "id": "https://openalex.org/A5035288948",
      "name": "Nilesh Chothani",
      "affiliations": [
        "Gujarat Technological University"
      ]
    },
    {
      "id": "https://openalex.org/A5103070431",
      "name": "Dharmesh Patel",
      "affiliations": [
        "Gujarat Technological University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2717685017",
    "https://openalex.org/W2599598496",
    "https://openalex.org/W2510529955",
    "https://openalex.org/W2102734466",
    "https://openalex.org/W2770492186",
    "https://openalex.org/W1988400047",
    "https://openalex.org/W2794053249",
    "https://openalex.org/W2549813608",
    "https://openalex.org/W2482737534",
    "https://openalex.org/W1965338872",
    "https://openalex.org/W2781525661",
    "https://openalex.org/W2511660118",
    "https://openalex.org/W2000473345",
    "https://openalex.org/W2753283694",
    "https://openalex.org/W2083729861",
    "https://openalex.org/W2026208716",
    "https://openalex.org/W2033760243",
    "https://openalex.org/W2545953721",
    "https://openalex.org/W2009671103",
    "https://openalex.org/W2041964374",
    "https://openalex.org/W2885682158",
    "https://openalex.org/W2153371216"
  ],
  "abstract": "Abstract Power transformer is one of the most important pieces of equipment in the grid to reliably and efficiently transmit power to the consumers. Asset management and protection are the best concepts for prolongation of transformer lifespan as well as for the increase of grid reliability. This article presents electrical and non-electrical parameter-based power transformer monitoring and protection. Various data such as core flux, age of asset, heat generation, current harmonics and temperature are monitored in real time and processed accordingly to enhance the working capability of the transformer. The proposed scheme is successfully tested on 15 kVA laboratory transformer using Arm CORTEX-M4 processor. A Fitness Function ( F f) is estimated from the collected data to examine the working condition of the transformer. Moreover, voltage, current and power-based inrush detection as well as Adaptive Power Differential Protection (APDP) are applied to protect the transformer against fault. The hardware implementation and result validation prove the effectiveness of the proposed scheme in enhancing reliability of the distribution grid.",
  "full_text": "Electrical, Control and Communication Engineering \n \n \n \n104 \n©2019 Maulik Raichura, N. G. Chothani, Dharmesh Patel. \nThis is an open access article licensed under the Creative Commons Attribution License \n(http://creativecommons.org/licenses/by/4.0), in the manner agreed with Sciendo. \nISSN 2255-9159 (online) \nISSN 2255-9140 (print) \n2019, vol. 15, no. 2, pp. 104–112 \ndoi: 10.2478/ecce-2019-0014 \nhttps://content.sciendo.com \nReal-Time Monitoring & Adaptive Protection of \nPower Transformer to Enhance Smart Grid \nReliability \nMaulik Raichura (Researcher, A. D. Patel Institute of Technology, Gujarat Technological University, India),  \nN. G. Chothani* (PhD, Associate Professor, A. D. Patel Institute of Technology,  \nGujarat Technological University, India), \nDharmesh Patel (PhD, Assistant Professor, Government Engineering College Bharuch,  \nGujarat Technological University, India) \nAbstract – Power transformer is one of the most important \npieces of equipment in the grid to reliably and efficiently transmit \npower to the consumers. Asset management and protection are the \nbest concepts for prolongation of transformer lifespan as well as \nfor the increase of grid reliability. This article presents electrical \nand non -electrical parameter-based power transformer \nmonitoring and protection. Various data such as core flux, age of \nasset, heat generation, current harmonics and temperature are \nmonitored in real time and processed  accordingly to enhance the \nworking capability of the transformer. The proposed scheme is \nsuccessfully tested on 15  kVA laboratory transformer using Arm \nCORTEX-M4 processor. A Fitness Function (Ff) is estimated from \nthe collected data to examine the working condition of the \ntransformer. Moreover, voltage, current and power-based inrush \ndetection as well as Adaptive Power Differential Protection \n(APDP) are applied to protect the transformer against fault. The \nhardware implementation and result validation prove the \neffectiveness of the proposed scheme in enhancing reliability of the \ndistribution grid. \n \nKeywords – Condition monitoring ; Fault detection ; Power \ntransformers; Reliability; Smart Grid. \nI. INTRODUCTION \nKeeping up with the trending development in power systems \ndue to several benefits offered by smart grid and technology \nnowadays, it is required to change the criteria of protective \nschemes adding a self -healing feature. In order to improve  the \noverall monitoring and protection of a transformer, it is necessary \nto analyse all the parameters. Considering its self-importance and \ncomplexity due to nonlinear magnetizing core characteristics \nwith different voltage level, transformer protection proves its \nsignificance [1]. PLC based transformer cooling control system \nis applied by intelligent means [2]. Online condition monitoring \nfor the distribution transformer is elaborated and discussed in [3]; \nhowever, many schemes are lacking the protection criteria in \ncombination with conditioning monitoring. IEEE has provided \nguidance for assessment and reconditioning of oi l immersed \ntransformers [4], [5]. Time -based maintenance is nowadays \nreplaced by condition-based maintenance as a part of the smart \ntransformer to improve lifespan and reliability with the help of \nleakage current and partial discharge sensors [6]. \n                                                           \n* Corresponding author. \nE-mail: chothani_nilesh@rediffmail.com \nTransformer asset management is widely known as the factor \nthat conditions monitoring and controlling. Dissolved Gas \nAnalyzer (DGA) facilitates identifying transformer conditions. A \ndissolved gas sensor with multiple gas measuring technique \nallows for better predi ction of failure possibilities [7]. Fuzzy \nLogic (FL) based health index is calculated for the oil immersed \ntransformer with real field data in [8]. In turn, FL based \ntransformer asset management considering DGA, temperature, \netc. is elaborated in [9]. Based on oil insulation test and FL model \ndecision, a prediction is carried out for the remaining operational \nlife of the transformer in [10]. Based on various uncertainty and \nconflict information, FL is used to evaluate transformer health \nconditions in [11]. Conditional monitoring-based transformer \nasset management greatly increases the diagnostic accuracy [12]. \nTransformer risk index is evaluated through asset management \nplan [13] with optimal physical asset management. To reduce \nmaintenance charges, maintenance strategy is planned based on \nthe evaluation of life cycle, equipment cost, overhauling time and \nrepairing cost [14]. Differential current gradient vector -based \ntechnology [ 15] was involved in protective schemes of a \ntransformer. Voltage and current rat io [16] based scheme is \nsuccessfully integrated for inrush and fault discrimination. Power \nDifferential Protection (PDP) [17] signals a new era for \nprotection schemes, which successfully ensure wide area \nprotection with large contingencies. The PDP based transmission \nline [18] protection is also well -known among the researchers. \nOn the other hand, Current Differential Protection (CDP) scheme \nrequires phase compensation [19]. Moreover, in the CDP \nscheme, the fundamental component of current should be \nextracted to measure magnitude of the current and phase angle \nshould be extracted to measure phase difference separately [20]. \nSo, computational complexity will increase in the CDP scheme \ncompared to the PDP scheme. Another challenge lies in the fact \nthat current acts as the dominant quantity in the CDP scheme \nwhile no other quantities are involved [21]. \nThis article describes a real-time monitoring of the smart grid \ntransformer by assessing Fitness Function ( Ff). Continuous \nmonitoring of the transformer is achiev ed by estimating Ff \nconsidering various parameters like current, voltage, power \nElectrical, Control and Communication Engineering \n___________________________________________________________ _____________________________2019, vol. 15, no. 2 \n105 \nwinding temperature, harmonics, frequency, etc. Breaching the \nlimit of Ff will lead to notifying the person at work and decision \non the isolation of the asset based on the severity of limit breach.  \nMoreover, an adaptive power differential algorithm is proposed \nto protect the transformer against hazardous fault events. \nHardware implementation of condition monitoring and \nprotection scheme presented here proves its efficacy in \nimproving the performance of grid tied transformer. \nII. PROPOSED TECHNIQUE \nFig. 1 presents a comprehensive diagram for real time \ncondition monitoring and protection of a power transformer.  \nFig. 1. Generalized schematic diagram for transformer monitoring and \nprotection. \nVarious data are collected through data logger to display the \ncollected data and record them for future analysis. The \nsuggested scheme is tested on hardware using the CORTEX M4 \nprocessor available in the laboratory. If the violation of any \nconsidered parameters occurs with respect to the predefined \nlimit, then the estimated Ff provides information to the \nmonitoring and protective scheme. With the help of such \ninformation, preventive action is carried out to retain the \ntransformer in service for a longer time. Along with monitoring, \nan Adaptive Power Differential Protection (APDP) scheme is \nalso proposed, which will take care of the transformer against \ninternal faults. Both online monitoring and adaptive power \ndifferential protection techniques ar e executed simultaneously \nin the hardware processor to enhance reliability of the \ntransformer in the smart grid. \nA. Condition Monitoring of the Transformer \nCondition monitoring of the transformer is performed by \ntaking certain parameters into consideratio n [3]. We have \nconsidered selected parameters like Magnetic Unbalance \n(MUB), Winding Temperature (WT), aging factor, insulation \ndegradation [22], current harmonics, winding deformation, and \nheat generation (total). After acquiring the real -time data, the \nactual values of the said parameters are estimated in the \nCORTEX M4 processor using a set of equations [3]. \nLater, a fitness function ( Ff) is defined duly considering all \neffect, as \n                      (1) \nWhere, j is the number of parameters, Si is the score of \nparameters; Smax is the maximum score of the parameter and \n𝑊𝑓𝑖  is the weight factor of each parameter. Here, different \nparameters have different values and units, hence the score is \ndefined here as an index assigned for a particular range of \nvalues, e.g. oil level is expressed as percentage and winding \ntemperature is measured in Celsius scale. Also, the weight \nfactor is assigned based on the dominancy of the parameter, i.e. \nthe change in the parameter that highly affects the transformer \nis assigned ‘1’ weight factor and consecutively in the \ndecreasing order up to ‘4’. One can change the assigned weight \nfactor ( 𝑊𝑓𝑖) and score ( 𝑆𝑖) based on their requirements for \nmonitoring the transformer. Table I shows the score and weight \nfactors for the considered parameters, which were acquired for \nthe real time test setup. \nTABLE I \nPARAMETERS AND RESPECTIVE WEIGHT FACTORS FOR DEFINED FITNESS \nFUNCTION \nSr. \nNo. \nParameters \nConsidered \nScore (Si) Wfi 4 3 2 1 \n1 MUB 0–0.2 0.21–0.4 0.41–\n0.6 >0.6 3 \n2 WT 65–70 71–80 81-90 >90 1 \n3 Aging Factor 0.1–0.2 0.21–0.3 0.31–\n0.4 >0.4 4 \n4 Insulation \nDegradation 0–0.2 0.21–0.4 0.41–\n0.6 >0.6 2 \n5 \nCurrent \nHarmonics \n(% THD) \n0–5 6–20 21–40 >40 2 \n6 Winding \nDeformation \n0.0005–\n0.005 \n0.0051–\n0.05 \n0.051–\n0.1 >0.1 3 \n7 Total Heat \nGeneration 65–70 71–80 81–90 >90 1 \n \nB. Transformer Protection Approach \nProtection of the transformer is critically important for the \nreliability of supply and healthy operation of the power system. \nHere, real-time monitoring in conjunction with protection of the \ntransformer is proposed to enhance continuity of supply in the \ngrid. The acquired parameters used for monitoring are \nconsidered for protection. Hence, it provides for the economical \noperation by eliminating the cost of extra peripheral devices. \n \nFig. 2. Proposed Adaptive Power Differential Protection (APDP) scheme. \nIn this article, an Adaptive Power Differential Protection \n(APDP) for the transformer considering CT saturation is \nproposed, as shown in Fig.  2. The scheme presented here is to \nsome extent similar to that of the Current Differential Protection \n=\n=\n=\n\n\n1\nf\nmax\n1\n·\n1 ·.\nj\nii\ni\nj\ni\ni\nS Wf\nF S\nWf\nElectrical, Control and Communication Engineering \n___________________________________________________________ _____________________________2019, vol. 15, no. 2 \n106 \n(CDP). However, this scheme offers advantages of adaptive \ncharacteristics and reliable operation as compared to the CDP. \nThe proposed APDP scheme is based on the calculation of the \naverage power of all three phases on both sides of the \ntransformer. This does not require estimation of the \nfundamental current/voltage magnitude and angles as required \nin the CDP scheme, phase wise. Mo reover, the computational \nsteps and summation logics are also reduced in the APDP \nscheme. Here, the input power should be the summation of the \noutput power and losses that occurred in the transformer. If the \ndifference between the powers measured at both e nds exceeds \nthe settled threshold, then it is interpreted as an internal fault in \nthe asset and the relay will issue a trip signal. \nIn addition, a novel logic of “Voltage Equality” is proposed, \nwhich can effectively identify the existence of a fault at the time \nof inrush condition (transformer energization). The Power \nTransformer (PT) ratio of both sides of the transformer is taken \nso that it gives the same output voltage despite of any \ntransformation ratio. It is observed that at the time of inrush \ncondition, voltages acquired at both sides of the PTs are the \nsame, i.e. Vp = Vs. This is because at the instant when the \nprimary is energized (under healthy condition ), the secondary \nof the transformer reflects the desired voltage.  \nOn the other hand, in case of fault prior to the transformer \nenergization, output of both sides of PT will not be equal, i.e. \nVp ≠ Vs and hence there may be persistence of fault during \ninrush condition. In the processor, a comparator (logic) is used \nto com pare the primary and secondary side PT voltages for \nidentification of inrush or fault during inrush. \nFurther discrimination of internal and external fault is carried \nout by percentage biased adaptive power differential \ncharacteristic. As shown in Fig.  3, the characteristic is drawn \nbetween differential power ( Pd) and restraining power ( Pr) \nwhich is the average power (( P1 + P2)/2), where  P1 is the \nprimary side power and P2 is the secondary side power of the \ntransformer. \n  \n \nFig. 3. Differential power Vs restraining power characteristic. \n \nWith respect to the specifications of the transformer, 30  % \nslope ( K1) is considered as biased setting for relay operating \ncriteria. Hence, if the differential power exceeds 30  % of the \nrestraining power (average, in this case), the proposed scheme \nconsiders this situation as an internal fault in the transformer. \nFor the case of an internal fault condition (Fig. 3): \n(1) When Pr < PS2 and if Pd > PS1, then relay will operate.    \n(2) When  Pr > PS2 and if  Pd > PS1 + K1·Pr, then relay will \noperate.  \nWhere K1 is the initial slope set in the adaptive relay \nalgorithm. PS1 is the basic differential power setting and PS2 is \nthe biased power threshold setting. \nDuring severe fault condition, Current Transformers (CTs) \nmay get saturated [24]. If CTs get saturated during external \nfault, then a simple Power Differential Protection (PDP) based \nscheme may mal -operate. To prevent these types of undesired \nactivities, the PDP scheme is refurbished by adding an adaptive \nfeature. This adaptive characteristic will prevent false tripping \nduring external fault with the CT saturation. The author has also \ndeveloped adaptive fault impedance compensation algorithm \nfor the transmission line [23]. \n \nFig. 4. Proposed adaptive PDP based algorithm. \n \n\nElectrical, Control and Communication Engineering \n___________________________________________________________ _____________________________2019, vol. 15, no. 2 \n107 \nFig. 4 presents the flowchart for the APDP scheme proposed \nfor transformer protection. Initially, currents and voltages of \nboth sides of the transformer are measured with the help of CTs \nand PTs (same measuring equipment is used for condition \nmonitoring of the transformer).  As described above, to \ndiscriminate the internal fault and inrush condition at the time \nof energization, the voltage equality test is performed. If \nvoltages of both sides of the transformer (Vp &Vs) are not equal, \nthen it is considered as the presence of fault and the algorithm \nfurther checks for the type of fault, conversely, if voltages are \nequal, then it is the case is of inrush condition.  \nFurther, if the fault conditio n is detected,  the degree of \nsaturation (Ds) of both sides current ( Ip & Is) is measured from \nequation (2), which is given below: \n \n(2) \n \nwhere Ds = degree of saturation. \nAfter that, differential power (Pd) and restraining power (Pr) \nare estimated using computational method in the processor. \nDigital multiplication of voltage and current samples, acquired \nfrom power logger (equipped with A/D converter) is used [25].  \nIf Pd remains less than Pr, then the condition is of external fault \nor normal. But if Pd exceeds Pr, then it may indicate the presence \nof internal fault or external fault with CT saturation. Further, if \nthe degree of saturation remains below 3  % and already Pd \nexceeded Pr, then it can be understood that it is the case of internal \nfault condition and trip signal will be immediately issued to the \nCircuit Breaker (CB). On the other hand, if the degree of \nsaturation of the currents exceeds 3 %, then it can be understood \nas the presence of fault, which should be discriminated properly \nto prevent false tripping from external fault condition (Fig. 4). \nAs the saturation level grows higher, the necessary action is to \nbe taken to shift the characteristic from lower slope to higher \nadaptively, otherwise the relay will issue a false trip signal. So, \nthe algorithm will now calculate the new slope ( K2) of power \ndifferential characteristic with the help of Equation (2), as given \nin Eq. (3). \nNew slope is defined as \n \n(3) \n \nHere, K2 is the new slope for the APDP scheme. \nAnalysing further to identify whether the fault is internal or \nexternal, the algorithm will again check whether the adaptive \nslope is less than the ratio of differential power to restraining \npower. If the new slope is lower than the ratio (Pd/Pr), then it can \nbe concluded that the fault is internal with CT saturation and trip \nsignal should be generated, otherwise it is decided that external \nfault with CT saturation occurred (the scheme remains \ninoperative). \nIII. EXPERIMENTAL TEST SETUP  \nAND DISCUSSION OF RESULTS \nHardware setup is developed in the laboratory to authenticate \nthe proposed real -time monitoring and adaptive power \ndifferential protection scheme for the transformer. The snapshot \nof the developed hardware setup is shown in Fig.  5. The \ntransformer considered is a three-phase, 15  kVA, 440/220 V, \n50 Hz rated having multiple tapings on both sides. Also, \nrheostats and inductors are placed before and after the \ntransformer to replicate the effect of transmission line, which is \npresent in the real time conditions. Transfo rmer’s primary side \nis connected with 3 -phase, 440-V separate generator and the \nsecondary side is connected to 3 -phase 220-V electricity board \nsupply through auto transformer to perfectly create the internal \nfault scenario, which takes place in practice. The CTs are \nconnected to the primary and secondary side with appropriate \nampere rating. Primary side and secondary side inter nal faults \nare generated by connecting 12  A, 18 Ω variable resistors. \nAdditional 250 Ω rheostat is inserted in the secondary side of \nthe CTs to create saturation effect during internal and external \nfault conditions. High resolution DSO and power logger are  \nutilized in the hardware to observe and record the current and \nvoltage data during each abnormal condition. \nVarious inrush, internal fault and external fault conditions \nwith spectrum analysis and harmonic analysis are carried out \nconsidering the practical  aspects. Only selected results are \npresented here due to space limitations. \n \n \n \nFig. 5. Developed laboratory setup. \n \nA. Inrush Condition \nAt the time of transformer energization, voltage equality test \nwill be carried out using the algorithm (Fig.  4). As sh own in \nFig. 6(a), when the transformer is switched on from the primary \nside (closing of CB) at 0.2 second, voltages of the primary and \nsecondary side of the transformer are equal (Vp = Vs) and follow \nthe same waveform pattern as measured from the PT secondary. \nMoreover, the calculated RMS values in the processor of these \nvoltages are equal, which is shown in Fig.  6(b). The proposed \nalgorithm recognizes this condition as inrush (healthy \nenergization of the unit) and returns back to fetch the next \nsample. \n \n=−s 1 · 100 %,Saturated CurrentD Unsaturated Current\n=+ s\n2 0.3 . 100\nDK\nElectrical, Control and Communication Engineering \n________________________________________________________________________________________ 2019, vol. 15, no. 2 \n108 \nFig. 6. (a) Voltage waveform during inrush, (b) RMS value of voltages during inrush, (c) Voltage waveform during fault, (d) RMS value of voltages during fault. \n \nOn the other hand, if the transformer is switched ON in \npresence of fault within the zone, then both sides of transformer \nvoltages will be unequal (Vp ≠ Vs), which can be clearly visible \nfrom Fig. 6(c). The estimated Root Mean Square (RMS) value \nof these voltages is shown in Fig. 6(d) during faulty transformer \nenergization. If the fault condition is identified , then the \nalgorithm will further check for the type of fault. \nFig. 7. Inrush condition : (a) Three Phase Inrush Currents waveform , (b) Per \nPhase Harmonic during inrush, (c) Spectrum analysis during inrush. \n \n \n \n \n \nFig. 7(a) shows the recorded waveform of current in DSO at \nthe time of the first energization of the transformer in the \nlaboratory. For cross verification, harmonic analysis and \nspectrum analysis are carried out, as shown in Fig.  7(b) and \n7(c), respectively. It is observed that the 2 nd harmonic \ncomponent remains more than 20 percentage compared to the \nfundamental in every phase during inrush condition, as shown \nin Fig. 7(b) [1]. \nB. Internal Fault \nVarious single, double and three phase faults are carried out \non the transformer winding through 12 ohms, 18 amps rheostat \nin the laboratory environment, as shown in Fig. 8 (a), (b), (c). It \nis to be noted that for any internal fault whether existing prior \nto transformer energization or during operation, the voltage \nequality test (Vp = Vs) must be performed at the very first stage, \nas illustrated in Fig.  6(c) and 6(d). Moreover, during fault, the \nrelay continuously compares the differential and restraining \npower with respect to the set biased slope. As shown in \nFig. 8(d), during internal fault condition, the differential power \n(Pd) exceeds the restraining power ( Pr) times the set slope and \nconsequently the biased power trajectory falls into the operating \nzone. Hence, the relay will issue a trip command to the circuit \nbreaker. \n \n \n \n \n \n \n \n \n\nElectrical, Control and Communication Engineering \n___________________________________________________________ _____________________________2019, vol. 15, no. 2 \n109 \nFig. 8. Internal fault conditions. \nC. External Fault or Normal Condition \nIn the case of external fault condition, the relay should \nidentify the fault outside the protective zone and remains \ninoperative. At the instant when fault is applied in the system, \nthe differential power ( Pd) will not exceed the  percentage of \nrestraining power ( Pr) and hence the differential characteristic \nwill remain sufficiently below the operating region, as shown \nin Fig. 10(a). Thus, the proposed scheme will not issue a trip \nsignal. \nIf we consider the w orst case of one CT saturation during \nexternal fault condition, we will get distorted waveform from \nthe CT. This distorted waveform will misguide power \ndifferential relay logic to issue a trip signal. An adaptive feature \nhas been added in the PDP scheme to  tackle the CT saturation \nduring external fault (Fig.  4). An external fault with CT \nsaturation is created on the secondary side of the transformer to \ncheck the practicability of the algorithm. A deliberate resistance \nis inserted in the secondary one of the  CTs to put it into \nsaturation state. Fig s 9(a, b, c) show the waveform of the CT \nsecondary currents and comparison of voltages from both sides \nof the transformer to be protected. \nAs per Equation  (2), the level of CT saturation is estimated \nat 15 %. The slope of the biased characteristic will shift up by \n15 % as per Eq. (3), hence new slope will be 45 % (Fig. 10(b)), \nwhich is calculated in Arithmetic and Logical Unit (ALU) unit \nof the dedicated processor. The calculated value of Pd remains \nwell below the 45 % of Pr, thus adaptive slope prevents false \noperation of the relay and makes the system more reliable. \n \nFig. 9. External condition : (a) Current waveform , (b) Voltage waveform , (c) \nRMS value of voltages. \n \nFig. 10. Differential vs restraining power characteristic during external \nfaultcondition: (a) without CT saturation, (b) with CT saturation. \n \n \n\nElectrical, Control and Communication Engineering \n___________________________________________________________ _____________________________2019, vol. 15, no. 2 \n110 \nD. Monitoring of Other Transformer Conditions \nThe fitness function (Ff) as described in Eq . (1) is estimated \nfor degradation of various parameter combinatio ns. Fig. 11(a) \nshows the plot of combination of various parameter variations \nv/s calculated fitness function. The change in temperature, \nefficiency, and losses as a function of load variation are also \nestimated and shown in Fig s 11(b, c, d), respectively. Table II \nand Fig. 11(a) show the change in F f for alteration in magnetic \nunbalance, winding temperature, harmonic content in current \nand overloading conditions.  \n \nFig. 11. (a) Parameter variation v/s fitness function, (b) Loading v/s efficiency, (c) Loading v/s temperature and (d) Loading v/s losses. \n \nThe health of the transformer is defined here as a grade, based \nupon the value of fitness function ( Ff). Here we have taken \nranges of Ff to reflect its health a s 1 ≥ Ff  > 0.9 = Healthy,  \n0.9 ≥ Ff  > 0.7 = Moderate, 0.7 ≥ Ff > 0.5 = Poor and for  \n0.5 ≥ Ff = Worst. When calculated Ff enters into the range of \npoor condition, the proposed scheme provides alarm and in the \nworst case, it will trip the circuit breakers of the transformer. \nAn example is elaborated here, which sheds more light for \nestimating fitness function (Ff). \nTABLE II \nEXAMPLE FOR ESTIMATING FITNESS FUNCTION (Ff) \nSr. \nNo. \nParameters \nconsidered \nConsidered \nvalue (pu) \nScore \n(Si) Wfi \n1 MUB 0.2 4 3 \n2 WT 71 3 1 \n3 Aging Factor 0.3 3 4 \n4 Insulation Degradation 0.4 3 2 \n5 Current Harmonics \n(% THD) 5 4 2 \n6 Winding Deformation 0.0005 4 3 \n7 Total Heat Generation 75 3 1 \n \nHere, as per Eq. (1), \n \n \n \n(4) \n \n \n \n \n \n \nHence, the estimated Ff value of the transformer is 0. 87. \nBased on this value, the algorithm will make decision for \nmonitoring the transformer. \nTABLE III \nFITNESS FUNCTION (Ff) FOR CHANGE IN TRANSFORMER PARAMETER \nParameters variation in pu \n(MUB + WT + Iharm + Ioverload) \nFf (pu) Grade \n0 1.00 Healthy \n0.02 0.92 Healthy \n0.04 0.84 Moderate \n0.06 0.73 Moderate \n0.08 0.64 Poor \n0.10 0.55 Poor \n0.14 0.47 Worst \n0.16 0.40 Worst \n0.17 0.37 Worst \n1 (12 3 12 6 8 12 3) 1 56 0.874 (3 1 4 2 2 3 1) 4 16\n+ + + + + +=  =  =+ + + + + +\n7\n11\nf 7\nmax\n11\n11\n4\nj\ni i i i\nii\nj\nii\nii\nS Wf S Wf\nF S\nWfWf\n==\n==\n\n=  = \n\n\nElectrical, Control and Communication Engineering \n___________________________________________________________ _____________________________2019, vol. 15, no. 2 \n111 \nIV. CONCLUSION \nThis article presents a real-time monitoring and protection of \nthe power transformer connected in a smart grid. Fitness \nfunction (Ff) is derived from various parameters of the selected \ntransformer. Based on the estimated F f from the collected real \ntime data for different operating conditions of the transformer, \nthe algorithm provides alarm or a trip command. Also, the real-\ntime monitoring can display th e condition of the transformer \nfrom healthy to the worst case as shown in Table II. Thus, the \nproposed online condition monitoring will eliminate \nunnecessary maintenance required for the transformer, as the \nscheduled maintenance can be replaced by the nece ssary \nmaintenance. The scheme developed here is generalized; one \ncan modify the parameters based on the requirements. \nMoreover, an adaptive power differential protection (APDP) \nscheme is also presented in combination with condition \nmonitoring. The proposed APDP scheme successfully identifies \ninrush condition, internal fault and external fault for the \ntransformer to be protected. The developed approach adaptively \nmodifies power differential relay characteristic of the saturation \nperiod of the CTs. It is obse rved that the suggested scheme \noperates only during internal faults, and remains stable during \nall external faults, normal load and inrush condition. The \nproposed combined real -time monitoring and APDP based \nprotective scheme are successfully implemented on a prototype \nin the laboratory environment on a 15-kVA transformer. The \nresults discussed here justify the viability of the combination of \nthe condition monitoring and APDP scheme. Thus, the \nsuggested scheme can be efficiently employed as a complete \nprotection of any transformer at different voltage levels. \n V. ACKNOWLEDGMENT \nThis work is financially supported by the Department of \nScience and Technology (DST), India, under project reference \nnumber EMR/2016/006041. \nREFERENCES \n[1] B. Bhalja, R. P. Maheshwari, an d N. G. Chothani, Protection and \nswitchgear, Second edition. New Delhi, India: Oxford University Press, \n2017. \n[2] S. Pai, N. Bansal, K. Desai, A. Doshi, D. Moharkar, and M. Pathare, \n“Intelligent PLC based transformer cooling control system,” International \nConference on Nascent Technologies in Engineering (ICNTE), pp. 1–6, \n2017. https://doi.org/10.1109/ICNTE.2017.7947926 \n[3] M. S. Ballal, G. C. Jaiswal, D. R. Tutkane, P. A. Venikar, M. K. Mishra, \nand H. M. Suryawanshi, “Online condition monitoring system for \nsubstation and service transformers,” IET Electr. Power Appl ., vol. 11, \nno. 7, pp. 1187–1195, 2017. https://doi.org/10.1049/iet-epa.2016.0842 \n[4] Y. Cheng, T. Hu, W. Chang, and J. Bi, “Experiments on the multi -\nfunctional current sensor for condition detection of transformer \nbushings,” in IEEE Electrical Insulation Conference  (EIC), pp. 17–20, \n2016. https://doi.org/10.1109/EIC.2016.7548583 \n[5] IEEE Std C57.140 -2017 (Revision of IEEE Std C57.140 -2006), IEEE \nGuide for E valuation and reconditioning of Liquid Immersed Power \nTransformers, 27 April 2007. \nhttps://doi.org/10.1109/IEEESTD.2007.353650 \n[6] K. Najdenkoski, G. Rafajlovski, V. Dimcev , “Thermal Aging of \nDistribution Transformers According to IEEE and IEC Standards”, Power \nEngineering Society General Meeting , IEEE, Tampa , FL, USA,  \n24–28 June 2007, pp. 1–5. https://doi.org/10.1109/PES.2007.385642 \n[7] S. Ceferin, G. Janc, Z. Toro, T. Kastelic, and B. Pranikar, “Power \ntransformer monitoring systems for better asset management,” CIRED - \nOpen Access Proc. J., no. 1, pp. 395–399, 2017. \nhttps://doi.org/10.1049/oap-cired.2017.1262 \n[8] A. E. B. Abu-Elanien, M. M. A. Salama, and M. Ibrahim, “Calculation of \na Health Index for Oil-Immersed Transformers Rated Under 69 kV Using \nFuzzy Logic,” IEEE Trans. Power Deliv., vol. 27, no. 4, pp. 2029–2036, \n2012. https://doi.org/10.1109/TPWRD.2012.2205165 \n[9] A. A. Hossam -Eldin, M. Refaey, and H. Ramadan, “New approach to \npower transformer asset management and life assessment us ing fuzzy \nlogic techniques,” Nineteenth International Middle East Power Systems \nConference (MEPCON), pp. 901–908, 2017. \nhttps://doi.org/10.1109/MEPCON.2017.8301287 \n[10] N. A. Bakar and A. Abu-Siada, “Fuzzy logic approach for transformer \nremnant life prediction and asset management decision,” IEEE Trans. \nDielectr. Electr. Insul. , vol. 23, no.  5, pp.  3199–3208, 2016. \nhttps://doi.org/10.1109/TDEI.2016.7736886 \n[11] L. Sun, Z. Ma, Y. Shang, Y. Liu, H. Yuan, and G. Wu, “Research on \nmulti-attribute decision -making in condition evaluation for power \ntransformer using fuzzy AHP and modified weighted averaging \ncombination,” IET Gener. Transm. Distrib ., vol. 10, no.  15,  \npp. 3855–3864, 2016.https://doi.org/10.1049/iet-gtd.2016.0381 \n[12] X. Zhang and E. Gockenbach, “Asset -Management of Transformers \nBased on Condition Monitoring and Standar d Diagnosis”, IEEE Electr. \nInsul. Mag., vol. 24, no. 4, pp. 26–40, 2008. \nhttps://doi.org/10.1109/MEI.2008.4581371 \n[13] R. D. Medina, D. X. Morales, M. A. Toledo, and J. B. Cabrera, “Power \ntransformer risk index assessment for an asset management plan,” \nCHILEAN Conference on Electrical, Electronics Engineering, \nInformation and Communication Technologies , pp.  1–7, 2017. \nhttps://doi.org/10.1109/CHILECON.2017.8229535 \n[14] T. Takahashi and T. Okamoto, “Development of asset management \nsupport tools for oil-immersed transformer,” IEEE Trans. Dielectr. Electr. \nInsul., vol. 23, no. 3, pp. 1643–1647, 2016. \nhttps://doi.org/10.1109/TDEI.2016.005574 \n[15] R. J. N. de Alencar and U. H. Bezerra, “Power Transformer Differential \nProtection Through Gradient of the Differenti al Current,” J. Control. \nAutom. Electr. Syst. , vol.  24, no.  1-2, pp.  162–173, 2013. \nhttps://doi.org/10.1007/s40313-013-0021-6 \n[16] E. Ali, A. Helal, H. Desouki, K. Shebl, S. Abdelkader, and O. P. Malik, \n“Power transformer differential protection using current and voltage \nratios,” Electr. Power Syst. Res ., vol. 154, pp.  140–150, 2018. \nhttps://doi.org/10.1016/j.epsr.2017.08.026 \n[17] F. Namdari, S. Jamali, and P. A. Crossley, “Power differential based wide \narea protection,” Electr. Power Syst. Res., vol. 77, no. 12, pp. 1541–1551, \n2007.https://doi.org/10.1016/j.epsr.2006.10.018 \n[18] A. M. I. Taalab, H. A. Darwish, and E. Ahmed, “Performance of Power \nDifferential Relay with Adaptive Setting for Line Protection,” Power \nDeliv. IEEE Trans., vol. 22, no. 1, pp. 50–58, 2007. \nhttps://doi.org/10.1109/TPWRD.2006.877101 \n[19] L. Sevov, Z. Zhang, I. Voloh, and J. Cardenas, “Differential protection for \npower transformers with non-standard phase shifts,” in 2011 64th Annual \nConference for Protective Relay Engineers , pp.  301–309, 2011. \nhttps://doi.org/10.1109/CPRE.2011.6035631 \n[20] L. Zhang, W. Cong, T. Xun, and Y. Bai, “A current differential protection \ncriterion based on amplitude and phase difference of fault current,” in \n2011 International Conference on Advanced Power System Automation \nand Protection, vol. 1, pp. 346–350, 2011. \nhttps://doi.org/10.1109/APAP.2011.6180424 \n[21] S. Dambhare, S. A. Soman, and M. C. Chandorkar, “Adaptive Current \nDifferential Protection Schemes for Transmission-Line Protection,” IEEE \nTrans. Power Deliv ., vol. 24, no.  4, pp.  1832–1841, 2009. \nhttps://doi.org/10.1109/TPWRD.2009.2028801 \n[22] C. Lin, B. Zhang, Y. Yuan, “The Aging Diagnosis of Solid Insulation for \nOil- Immersed Power Transformers and Its Remaining Life Prediction” \nAsia-Pacific Power and Energy Engineering Conference, Chengdu, \nChina, 28–31 March 2010. \nhttps://doi.org/10.1109/APPEEC.2010.5449486 \n[23] U. J. Patel,N. G. Chothani and P. J. Bhatt, “Adaptive quadrilateral distance \nrelaying scheme for fault impedance compensation”, Electrical, Control \nand Communication Engineering , vol. 14, no.  1, pp. 58–70, 2018. \nhttps://doi.org/10.2478/ecce-2018-0007 \nElectrical, Control and Communication Engineering \n___________________________________________________________ _____________________________2019, vol. 15, no. 2 \n112 \n[24] N. G. Chothani and B. R. Bhalja, “New Algorithm for current transformer \nsaturation detection and compensation based on derivatives of secondary \ncurrents and Newton's backward difference formulae”, IET Generation, \nTransmission & Distribution,  vol. 8, no. 5, pp. 841–850, 2014. \nhttps://doi.org/10.1049/iet-gtd.2013.0324 \n[25] J. Pereira. O. Postolache, P. Girao, H. Ramos, “Minimizing Errors Due to \nNon-Simultaneous Sampling of Voltage and Current in Digital Power \nMeasurement Systems”, Proc. of the 12th IMEKO TC4 Internat. Symp., \nElectrical Measurements and Instrumentation ”, Part  1, FEEC Zagreb, \nCroatia, September 25–27, pp. 307–310, 2002. \n \nMaulik Raichura is a Research Scholar at the \nDepartment of Electrical Engineering, Gujarat \nTechnological University, Gujarat, India. He \nreceived his B.E. degree from A.  D. Patel Institute \nof Technology, New Vallabh Vidhyanagar, Gujarat, \nIndia, in 2014 and Master degree in power systems \nfrom the Shantilal Shah Engineering College, \nBhavnagar, Gujarat, India, in 2016. Currently, he is \npursuing his Ph.  D. from Gujarat Technological \nUniversity, Gujarat, India. His area of research is \npower transformer protection. \nHe is working as a Junior Research Fellow under \nDST, SERB grant, DST/EMR/2016/006041 at A. D. \nPatel Institute of Technology, New Vallabh Vidhyanagar, Gujarat, India.  \nPostal Address: A. D. Patel Institute of Technology, New Vallabh Vidhyanagar, \nVitthal Udyognagar, Anand, Gujarat 388121, India. \nE-mail: mbraichura@gmail.com \nORCID iD: https://orcid.org/0000-0001-9244-7835 \n \nDr N. G. Chothani received his B. E. degree from \nSaurashtra University, Rajkot, Gujarat in 2001. He \nreceived Master degree in power systems and the \nPh. D. degree in electric engineering from the \nSardar Patel University, Vallabh Vidhyanagar, \nAnand, India, in 2004 and 2013, respectively. He \nhas published several research papers in national \nand international referred journals. His research \ninterests include power system protection, \nsimulation, power system modeling and artificial \nintelligence. \nHe is an Associate Professor in the Department of \nElectrical Engineering, ADIT, New Vallabh \nVidhyanagar, India, since 2005. He also worked as \na Junior Engineer in state  Transmission Company \nfor 2 years.  He is Life Member of Indian Society for Technical Education \n(ISTE) and Life Member of The Institution of Engineers (India). \nPostal Address: A. D. Patel Institute of Technology, New Vallabh Vidhyanagar, \nVitthal Udyognagar, Anand, Gujarat 388121, India. \nE-mail: chothani_nilesh@rediffmail.com \n \n \n \n \n \n \n \nDr Dharmesh Patel received his B. E. degree from \nNorth Gujarat University, Patan , Gujarat, in 1999 \nand Master degree in power systems from the Sardar \nPatel University, Vallabh Vidhyanagar, Anand, \nIndia in 2002. He has received his Ph.  D. degree \nfrom Sardar Vallabhbhai National Institute of \nTechnology, Surat, India, in 2019. His field of \nresearch is power transformer protection. \nHe has been working as an Assistant Professor for 9 \nyears at the Department of Electrical Engineering, \nGovernment Engineering College, Bharuch - \n392002, Gujarat, India. He served as a lecturer for 7 \nyears in the state polytechnic college. Also, he \nworked as a Junior Engineer in State Distribution Company for 1 year. \nPostal Address: Electrical Department, Government Engineering College, \nBharuch-392002, Gujarat, India. \nE-mail: ddeps2005@gmail.com \nORCID iD: https://orcid.org/0000-0003-4862-3963 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
  "topic": "Inrush current",
  "concepts": [
    {
      "name": "Inrush current",
      "score": 0.8085257411003113
    },
    {
      "name": "Transformer",
      "score": 0.6498531699180603
    },
    {
      "name": "Distribution transformer",
      "score": 0.6306302547454834
    },
    {
      "name": "Energy efficient transformer",
      "score": 0.5328930616378784
    },
    {
      "name": "Electrical engineering",
      "score": 0.5229371786117554
    },
    {
      "name": "Engineering",
      "score": 0.5020260810852051
    },
    {
      "name": "Grid",
      "score": 0.46263426542282104
    },
    {
      "name": "Isolation transformer",
      "score": 0.4613639712333679
    },
    {
      "name": "Reliability engineering",
      "score": 0.4555167257785797
    },
    {
      "name": "Electronic engineering",
      "score": 0.41608864068984985
    },
    {
      "name": "Computer science",
      "score": 0.3299780488014221
    },
    {
      "name": "Voltage",
      "score": 0.28961730003356934
    },
    {
      "name": "Mathematics",
      "score": 0.0
    },
    {
      "name": "Geometry",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I29563240",
      "name": "Gujarat Technological University",
      "country": "IN"
    }
  ]
}