{
  "title": "Discrimination of Internal Faults and Other Transients in an Interconnected System With Power Transformers and Phase Angle Regulators",
  "url": "https://openalex.org/W3016165661",
  "year": 2020,
  "authors": [
    {
      "id": "https://openalex.org/A2899955915",
      "name": "Pallav Kumar Bera",
      "affiliations": [
        "Syracuse University"
      ]
    },
    {
      "id": "https://openalex.org/A2019657188",
      "name": "Can Isik",
      "affiliations": [
        "Syracuse University"
      ]
    },
    {
      "id": "https://openalex.org/A3015524140",
      "name": "Vajendra Kumar",
      "affiliations": [
        "Indian Institute of Technology Roorkee"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2106822551",
    "https://openalex.org/W2761506779",
    "https://openalex.org/W2800482144",
    "https://openalex.org/W2730797033",
    "https://openalex.org/W2140676464",
    "https://openalex.org/W2802314367",
    "https://openalex.org/W2747916555",
    "https://openalex.org/W2770441380",
    "https://openalex.org/W1577086563",
    "https://openalex.org/W2043634093",
    "https://openalex.org/W1978615022",
    "https://openalex.org/W2149776938",
    "https://openalex.org/W2001063991",
    "https://openalex.org/W2180727038",
    "https://openalex.org/W2769019225",
    "https://openalex.org/W2247147530",
    "https://openalex.org/W2041383636",
    "https://openalex.org/W2899603642",
    "https://openalex.org/W2102259958",
    "https://openalex.org/W2018444483",
    "https://openalex.org/W1983823148",
    "https://openalex.org/W4254871100",
    "https://openalex.org/W2051855209",
    "https://openalex.org/W2343421684",
    "https://openalex.org/W2174926952",
    "https://openalex.org/W2086062117",
    "https://openalex.org/W2131456415",
    "https://openalex.org/W2954155792",
    "https://openalex.org/W2365029635",
    "https://openalex.org/W2012587369",
    "https://openalex.org/W2124249995",
    "https://openalex.org/W1963695550",
    "https://openalex.org/W2105879876",
    "https://openalex.org/W6675354045",
    "https://openalex.org/W2080975658",
    "https://openalex.org/W2101807845",
    "https://openalex.org/W6637386731",
    "https://openalex.org/W2148143831",
    "https://openalex.org/W6679060694",
    "https://openalex.org/W2911964244",
    "https://openalex.org/W6676249281",
    "https://openalex.org/W1678356000",
    "https://openalex.org/W1504694836",
    "https://openalex.org/W2139094911",
    "https://openalex.org/W4233825779",
    "https://openalex.org/W2125055259",
    "https://openalex.org/W2330820318",
    "https://openalex.org/W2068314377",
    "https://openalex.org/W2187089797",
    "https://openalex.org/W2110298687",
    "https://openalex.org/W2101234009",
    "https://openalex.org/W4376453234",
    "https://openalex.org/W2124833832",
    "https://openalex.org/W4248956130",
    "https://openalex.org/W1594031697",
    "https://openalex.org/W4253081539",
    "https://openalex.org/W1680392829",
    "https://openalex.org/W4205551678",
    "https://openalex.org/W2108263314"
  ],
  "abstract": "This study solves the problem of accurate detection of internal faults and\\nclassification of transients in a 5-bus interconnected system for Phase Angle\\nRegulators (PAR) and Power Transformers. The analysis prevents mal-operation of\\ndifferential relays in case of transients other than faults which include\\nmagnetizing inrush, sympathetic inrush, external faults with CT saturation,\\ncapacitor switching, non-linear load switching, and ferroresonance. A gradient\\nboosting classifier (GBC) is used to distinguish the internal faults from the\\ntransient disturbances based on 1.5 cycles of 3-phase differential currents\\nregistered by a change detector. After the detection of an internal fault, GBCs\\nare used to locate the faulty unit (Power Transformer, PAR series, or exciting\\nunit) and identify the type of fault. In case a transient disturbance is\\ndetected, another GBC classifies them into the six transient disturbances. Five\\nmost relevant frequency and time domain features obtained using Information\\nGain are used to train and test the classifiers. The proposed algorithm\\ndistinguishes the internal faults from the other transients with a balanced\\naccuracy of 99.95%. The faulty transformer unit is located with a balanced\\naccuracy of 99.5% and the different transient disturbances are identified with\\na balanced accuracy of 99.3%. Moreover, the reliability of the scheme is\\nverified for different rating and connection of the transformers involved, CT\\nsaturation, and noise levels in the signals. These GBC classifiers can work\\ntogether with a conventional differential relay and offer a supervisory control\\nover its operation. PSCAD/EMTDC software is used for simulation of the\\ntransients and to develop the two and three-winding transformer models for\\ncreating the internal faults including inter-turn and inter-winding faults.\\n",
  "full_text": "IEEE SYSTEMS JOURNAL 1\nDiscrimination of Internal Faults and Other\nTransients in an Interconnected System with Power\nTransformers and Phase Angle Regulators\nPallav Kumar Bera, Can Isik, Senior Member, IEEE, and Vajendra Kumar\nAbstract—This study solves the problem of accurate detection\nof internal faults and classiﬁcation of transients in a 5-bus\ninterconnected system for Phase Angle Regulators (PARs) and\nPower Transformers (PTs). The analysis prevents mal-operation\nof differential relays in case of transients other than faults which\ninclude magnetizing inrush, sympathetic inrush, external faults\nwith Current Transformer (CT) saturation, capacitor switch-\ning, non-linear load switching, and ferroresonance. A gradient\nboosting classiﬁer (GBC) is used to distinguish the internal\nfaults from the transient disturbances based on 1.5 cycles of\n3-phase differential currents registered by a change detector.\nAfter the detection of an internal fault, GBCs are used to\nlocate the faulty unit (PT, PAR series, or exciting unit) and\nidentify the type of fault. In case a transient disturbance is\ndetected, another GBC classiﬁes them into the six disturbances.\nFive most relevant frequency and time domain features obtained\nusing Information Gain are used to train and test the classiﬁers.\nThe proposed algorithm distinguishes the internal faults from\nthe other transients with a balanced accuracy ( ¯η) of 99.95%.\nThe faulty transformer unit is located with ¯η of 99.5% and\nthe different transient disturbances are identiﬁed with ¯η of\n99.3%. Moreover, the reliability of the scheme is veriﬁed for\ndifferent rating and connection of the transformers involved, CT\nsaturation, and noise level in the signals. These GBC classiﬁers\ncan work together with a conventional differential relay and\noffer a supervisory control over its operation. PSCAD/EMTDC\nsoftware is used for simulation of the transients and to develop\nthe two and three-winding transformer models for creating the\ninternal faults including inter-turn and inter-winding faults.\nIndex Terms—Phase Angle Regulators, Power Transformers,\nFault detection, Transients, Gradient Boosting Classiﬁer\nI. I NTRODUCTION\nP\nOWER Transformers are an integral part of an electrical\ngrid and their protection is vital for reliable and stable\noperation of the power system. An important requirement\nof the protection system is the faithful discrimination of\nfaults from other transients. Differential protection has been\nthe primary protection scheme in transformers because of\nits inherent selectivity and sensitivity. Mal-operations due\nManuscript received February 20, 2020; revised May 23, 2020; accepted\nJuly 10, 2020. (Corresponding author: Pallav Kumar Bera.)\nPallav Kumar Bera & Can Isik are with the Department of Electrical\nEngineering and Computer Science, Syracuse University, NY , USA (e-mail:\npkbera@syr.edu; cisik@syr.edu).\nVajendra Kumar was with Indian Institute of Technology, Roorkee, India\n(email: kumarvajendra@gmail.com).\n2020 IEEE. Personal use of this material is permitted. Permission from\nIEEE must be obtained for all other uses, in any current or future media,\nincluding reprinting/republishing this material for advertising or promotional\npurposes, creating new collective works, for resale or redistribution to servers\nor lists, or reuse of any copyrighted component of this work in other works.\nto magnetizing and sympathetic inrush, and CT saturation\nduring external faults are the major problems associated with\ndifferential protection. Second-harmonic restraint method is\nextensively used to distinguish internal faults from magnetiz-\ning inrush since more second-harmonic component exists in\ninrush currents than in internal faults [1]. However, higher\nsecond-harmonics are generated during internal faults with\nCT saturation, presence of shunt capacitance, or because of\nthe distributed capacitance of EHV lines [2]. In addition,\nthe second-harmonic content in inrush currents has reduced\nin modern transformers with soft core material [3]. Hence,\nseveral cases of mal-operation of conventional relays in dis-\ntinguishing faults and inrush have been reported [4]. CT\nsaturation during external faults may also cause false trips due\nto the inefﬁcient setting of commonly used dual-slope biased\ndifferential relays [5].\nPhase Angle Regulators or Phase Shifters or Phase Shift\nTransformers are a special class of transformers used to\ncontrol real power ﬂow in parallel transmission lines. They\nensure the system reliability and allow easier integration of\nnew generations with the grid. By regulating the phase angle\nbetween the sending and receiving ends they prevent over-\nloading of a line and re-routes power via another line. PARs\ncan be categorized on the basis of the number of cores and\nmagnitude of sending end voltage with respect to the receiving\nend. Indirect Symmetrical Phase Angle Regulators (ISPAR)\nhaving the same sending and receiving end voltages with two\ntransformer units, namely, series and exciting (Fig.1(b)), has\nbeen chosen as one of the subjects (other being the PTs) in this\nstudy because of their popularity and security against higher\nvoltage levels as the load tap changer (LTC) is not exposed\nto system disturbances. The exciting unit is responsible for\ncreating the required phase difference to regulate the power\nwhich can be controlled by the LTC connections and an\nadvance-retard-switch located on its secondary winding [6].\nThe modiﬁed real power ﬂow in a transmission line with a\nPAR is given by\nP = VS ×VL\nXline + XPAR\n×sin(θ+ α) (1)\nwhere, VS is source voltage, VL is load voltage; θis the phase\nangle difference between VS and VL; Xline,XPAR are the\ntransmission line and PAR reactance respectively; and αis the\nnew constraint added which is responsible for controlling the\npower ﬂow. The PARs similar to PTs require a fast, sensitive,\nsecure, and dependable protection system. Discriminating ex-\narXiv:2004.06003v2  [eess.SP]  2 Aug 2020\nIEEE SYSTEMS JOURNAL 2\nternal faults with CT saturation, magnetizing inrush, and other\ntransient disturbances from internal faults is a challenge for the\nprotection systems of PARs as well. Moreover, methods used\nto compensate the phase for differential relays in PTs with\na ﬁxed phase shift are not applicable in PARs with variable\nphase shift [7].\nAuthors have used different intelligent methods to distin-\nguish internal faults and magnetizing inrush in PTs in the\npast decade. A combination of Artiﬁcial Neural Network\n(ANN) and spectral energies of wavelet components was\nused to discriminate internal faults and inrush in [8]. Support\nVector Machines (SVM) and Decision Tree (DT) based trans-\nformer protection were proposed in [9], [10] and [11]–[13]\nrespectively. Probabilistic Neural Network (PNN) has been\nused to detect different conditions in PT operation in [14].\nRandom Forest Classiﬁer (RFC) was proposed to discrimi-\nnate internal faults and inrush in [15]. Works of literature\nalso suggest extensive use of S-Transform, Hyperbolic S-\nTransform, Wavelet Transform (WT) to detect Power Quality\n(PQ) transient disturbances and then classify them using DT,\nSVM, ANN, PNN [16]–[21]. These transient disturbances are\ncaused by variations in load, capacitor switching, charging of\ntransformers, starting of induction machines, use of non-linear\nloads, etc. Contrarily, literature investigating internal faults and\ninrush in an ISPAR is limited. However, attempts were made in\n[22] where internal faults are distinguished from magnetizing\ninrush using WT and then the internal faults are classiﬁed\nusing ANN and in [23] where the internal faults in series and\nexciting transformers of the ISPAR are classiﬁed using RFC.\nFurther, the authors have predominately used an isolated and\nsimple network having a PT [8]–[14] or a PAR [22], [23] to\nsupport their proposed protection scheme. Also, the transient\ndisturbances have not been studied rigorously in these works.\nThis paper studies the use of Decision Tree based algo-\nrithms to discriminate the internal faults and other transient\ndisturbances including magnetizing inrush and CT saturation\nduring external faults in a 5-bus interconnected system with\nPhase Angle Regulators and Power Transformers which has\nnot been attempted before. Customized two-winding and three-\nwinding transformers are developed to simulate the internal\nfaults. A change detector has been used to detect and register\nthe differential currents. Five most relevant time and frequency\ndomain features have been used to train SVM, RFC, DT, and\nGBC classiﬁers to detect, locate and identify the internal faults\nand classify six transient disturbances. The proposed scheme\nis tested on 101,088 transients cases simulated on Power\nSystem Computer Aided Design (PSCAD)/ Electromagnetic\nTransients including DC (EMTDC) by varying various system\nparameters. The entire dataset of internal faults and other\ndisturbances is made available on IEEE Dataport [24].\nThe rest of the paper is organized as follows. Section II\nillustrates the modeling and simulation of the internal faults\nand other transient disturbances in the power network con-\ntaining PTs and ISPARs. Section III comprises the detection\nof internal faults, feature extraction and selection, and the\nclassiﬁers used for the detection and identiﬁcation of tran-\nsients. Section IV includes the results for detection of internal\nfaults, identiﬁcation of faults and transient disturbances, and\nevaluates the effect of noise, CT saturation, and change in\ntransformer rating and connection on the proposed scheme.\nSection V concludes the paper.\nFig. 1: (a) 5-bus interconnected system with ISPARs, PTs, T-lines, and AC\nsources, (b) Series and exciting transformers in ISPAR\nII. M ODELING AND SIMULATION\nThe power network chosen for the simulation of the internal\nfaults and the transient disturbances is based on a proposed\nPumped-storage (efﬁcient form of renewable storage designed\nto meet energy needs and reduce emissions by utilizing the\nenergy stored in an upper water body pumped from a lower\nwater body) project in California, USA [25].\nPSCAD/EMTDC is used for the modeling and simulation\nof the transients in the ISPAR and PT in the chosen intercon-\nnected power system. Fig.1(a) shows the single-line diagram\nof the 5-bus interconnected model consisting of the AC source,\ntransmission lines, ISPARs, PTs, and 3-phase loads working at\n60Hz. The ISPARs have a rating of 500 MV A, 230kV/230kV ,\nwith phase angle variations of ±25◦and the PTs are rated at\n500 MV A, 500kV/230kV . The AC source consists of 9 units\nof 120 MV A, 13.8kV hydro-generators. Two transformers are\nused in cascade to step up the voltage from 13.8kV to 500kV .\n3 ISPARs (ISPAR 1, ISPAR 2, and ISPAR 3) are connected\nbetween bus4 and bus5 through transformers T 1, T2, and T 3.\nOnly the internal faults in ISPAR 1 and T1 are studied.\nThe three-winding transformer required for the series units\nof ISPAR and the two-winding transformer required for the\nexciting units of ISPAR and PTs for the simulation of various\ninternal faults including turn-to-turn and primary-to-secondary\nwinding faults are developed in PSCAD/EMTDC with Fortran.\nThe self-inductance terms ( Li) and the mutual inductance\nterms (Mij) of the 4 ×4 L matrix (Eq.2) of the single-phase\ntwo-winding transformer and 6 ×6 L matrix of the single-\nphase three-winding transformer are evaluated from primary\nand secondary voltages, the magnetizing component of the\nno-load excitation current ( Im), and the short-circuit tests.\nThe modeled components have the provision to change the\nsaturation characteristics, % of winding shorted and other\nparameters. The Fortran script of the two-winding transformer\nis shown in the Appendix.\nIEEE SYSTEMS JOURNAL 3\nL=\n\n\nLx Mxy Mxz Mxw\nMyx Ly Myz Myw\nMzx Mzy Lz Mzw\nMwx Mwy Mwz Lw\n\n (2)\nThe study covers various internal faults in the ISPAR\nand PT, capacitor switching, switching of non-linear loads,\nmagnetizing inrush, sympathetic inrush, external faults with\nCT saturation, and ferroresonance. In the following para-\ngraphs, these conditions are considered one after the other.\nThe simulation run-time, fault/disturbance inception time, and\nfault duration time are 15.2s, 15.0s, and 0.05s (3 cycles)\nrespectively in all cases. The multi-run component is used\nto change the parameter values wherever possible to get the\ndifferent simulation cases and snapshots of the ﬁrst simulation\nruns are used to start the simulation from initialized conditions\nto reduce the simulation time.\nA. Internal Faults\nThe internal faults are created in the PT, ISPAR series,\nand ISPAR exciting unit. 88,128 internal fault cases which\ninclude basic internal faults, turn-to-turn, and winding-to-\nwinding faults are simulated by varying the fault resistance, %\nof winding shorted, fault inception time, forward or backward\nshift, and the LTC in the exciting unit.\n1) Internal phase & ground faults (ph & g): Phase winding\nto ground (wa-g, wb-g, wc-g), phase winding to phase winding\nto ground ( wa-wb-g, wa-wc-g, wb-wc-g), phase winding to\nphase winding (wa-wb, wa-wc, wb-wc), 3-phase winding ( wa-\nwb-wc), and 3-phase winding to ground ( wa-wb-wc-g) faults\nare simulated in the primary (P) and secondary (S) sides of\nthe PT and on the primary and secondary sides of exciting and\nseries transformer units in the ISPAR. Table I shows the values\nof different system and fault parameters in T 1 and ISPAR1\n(Fig.1(a)) which are varied to get the training and testing cases\nfor the internal phase & ground faults.\nTABLE I: Parameters for ph & g faults in the ISPAR and PT\nVariables Values\nFault resistance 0.01, 0.5 & 10 Ω (3)\n% of winding shorted 20%, 50%, 80% (3)\nFault type w-g, w-w-g, w-w, w-w-w & w-w-w-g (11)\nFault inception time 15s to 15.0153s in steps of 1.38ms (12)\nFault location\nTransformer (P & S) (2)\nISPAR Exciting unit (P & S) (2)\n& ISPAR Series unit (P & S) (2)\nPhase shift Forward and backward (2)\nLTC 0.2,0.4,0.6,0.8,1[1 & 0.5 in ISPAR exciting]\nTransformer or ISPAR series faults = 3 ×3×11×12×2×2×5 = 23,760\nISPAR exciting faults = 3 ×3×11×12×2×2×2 = 9504\n2) Turn-to-turn (T-T) faults: About 70-80% of faults in\ntransformers are due to turn-to-turn insulation failures. Ther-\nmal, mechanical and electrical stress degrades the insulation\nand causes turn-to-turn faults which may lead to more serious\nfaults and inter-winding faults if not detected quickly [26].\nTable II shows the values of different parameters of the PT and\nthe series and exciting unit of ISPAR used to simulate 20,736\nturn-to-turn faults. Fig.2(a) shows the differential currents for\nLTC= half, fault inception time=15s, backward phase shift,\nfault resistance=0.01Ω and % turns shorted=20 in primary of\nexciting unit. Fig.2(b) shows the differential currents for LTC=\nfull, fault inception time=15.0124s, backward phase shift,\nfault resistance=0.01Ω and % turns shorted=40 in primary of\nseries unit. Fig.2(c) shows the differential currents for LTC=\nfull, fault inception time=15.01518s, forward phase shift, fault\nresistance=0.01Ω and % turns shorted=60 in primary of the PT.\nFig. 2: 3-phase differential currents for turn-to-turn faults in (a) primary of\nexciting unit, (b) primary of series unit, and (c) primary of PT\nTABLE II: Parameters for winding-to-winding & turn-to-turn faults in the\nISPAR and PT\nVariables Values\nFault resistance 0.01, 0.5 & 10 Ω (3)\n% of winding shorted 20%, 40%, 60%, 80% (4)\nFault inception time 15s to 15.0153s in steps of 1.38ms (12)\nFault location\nTransformer phase a,b,c (P & S) (6)\nISPAR Exciting phase a,b,c (P & S) (6)\n& ISPAR Series phase a,b,c (P & S) (6)\nPhase shift Forward and backward (2)\nLTC 0.2,0.4,0.6,0.8,1 [1 & 0.5 in ISPAR exciting]\nTransformer or ISPAR series(T-T) faults = 3 ×4×12×6×2×5 = 8640\nISPAR exciting(T-T) faults = 3 ×4×12×6×2×2 = 3456\nTransformer or ISPAR series(W-W) faults = 3 ×4×12×3×2×5= 4320\nISPAR exciting(W-W) faults = 3 ×4×12×3×2×2 = 1728\n3) Winding-to-winding (W-W) faults: The electrical, ther-\nmal and mechanical stress due to short circuits and transformer\naging reduces the mechanical and dielectric strength of the\nwinding and results in degradation of the insulation between\nLV and HV winding and may damage the winding eventually\n[26]. Table II shows the values of different parameters of the\nPT and the series and exciting unit of ISPAR used to simulate\n10,368 winding-to-winding faults.\nB. Magnetizing inrush\nTransients caused by the energization of transformers are\ncommon and discrimination of inrush from fault currents has\nbeen studied since the 19th century. The harmonic restraint\nrelays fail to detect inrush currents in transformers with\nmodern core materials. The ﬂux in a transformer core just\nafter switching can be expressed as\nφ= φR + φmcosωt′−φmcosω(t+ t′) (3)\nIEEE SYSTEMS JOURNAL 4\nwhere, φR represents residual ﬂux, φm represents maximum\nﬂux, and t ′ is switching time. The transformer draws a high\npeaky non-sinusoidal current to meet the high ﬂux demand\nFig. 3: B-H curve of transformer core\nwhen switched on. Since this current ﬂows only on one side\nof the transformer the differential scheme mal-operates. T 1\n(Fig.1(a)) is the incoming 3-phase transformer and DC sources\nare used to get the desired φR in the single-phase transformers.\nThe values for the DC currents in phase-a, b, and c are\nobtained from the B-H curve of the transformer core material\nas shown in Fig.3. Table III shows the values of different\nparameters including φR and t′used to get the data for training\nand testing for magnetizing inrush and Fig.4(a) shows the 3-\nphase differential currents for LTC = full, switching time =\n15s, forward phase shift, and -80% residual ﬂux.\nFig. 4: 3-phase differential currents for (a) Magnetizing inrush, and (b)\nSympathetic inrush\nTABLE III: Parameters for Magnetizing and Sympathetic inrush\nVariables Values\nResidual ﬂux ±80%,±40%,0% in 3 phases; 5 ×3 = (15)\nSwitching time 15s to 15.0153s in steps of 1.38ms (12)\nLTC 0.2 to full tap in steps of 0.2 (5)\nPhase shift Forward and backward (2)\nTotal=15 ×12 ×5 ×2=1800\nC. Sympathetic Inrush\nSympathetic inrush occurs in the in-service transformer (T1)\nwhen the incoming transformer (T 2) is energized in a resistive\nnetwork at no-load. The asymmetrical ﬂux change per cycle\nduring switching of T 2 which drives T 1 to saturation can be\nexpressed as\n∆φ=\n∫ 2π+t\nt\n[(Rsys + RT1 )i1 + Rsysi2] (4)\nwhere Rsys is the system resistance , and RT1 is the resistance\nof transformer T1, i1 and i2 are magnetizing currents of T1 and\nT2. This interaction between the incoming and the in-service\ntransformers leads to mal-operation of differential relays of\nthe in-service transformer due to failure of harmonic restraint\nrelays and may cause prolonged harmonic over-voltages [27].\nThe use of superconducting winding, soft magnetic material\nin the core, and CT local transient saturation are some factors\nresponsible for these mal-operations [3] [28]. Sympathetic\ninrush is inﬂuenced by the residual ﬂux ( φR) of the incoming\ntransformer, switching time (t′), and system resistance [29] and\ntakes place with the incoming transformer energized in either\nseries or parallel. The magnitude and direction of φR, and\nt′ are altered and the incoming transformer T1 is connected\nin parallel to simulate the scenarios. Table III shows the\nvalues of the different parameters used to get the training and\ntesting cases for sympathetic inrush. Fig.4(b) shows the 3-\nphase differential currents for LTC = 0.2, switching time =\n15s, forward phase shift, and -80% residual ﬂux.\nD. External faults with CT saturation\nThe differential currents become non-zero due to CT sat-\nuration in case of heavy through faults and may lead to a\nfalse trip. While raising the bias threshold ensures the security\n(i.e. no mal-operation), the dependability for in-zone resistive\nfaults gets reduced. The external faults with CT saturation\nare simulated on the 500kV and 230kV buses (bus4 & bus5).\nThe values for the different parameters are given in Table\nIV. Fig.5(a) shows the 3-phase differential currents for an\nexternal line-to-ground (lg) fault when LTC = 0.2, phase shift\n= forward, fault inception time = 15s, and fault resistance =\n0.01Ω on the 230kV bus.\nFig. 5: 3-phase differential currents for (a) External fault with CT saturation,\n(b) Capacitor Switching, and (c) Ferroresonance\nIEEE SYSTEMS JOURNAL 5\nTABLE IV: Parameters for External faults on 230kV & 500kV bus\nVariables Values\nFault resistance 0.01, 0.5 & 10 Ω (3)\nFault type lg, llg, ll, lll & lllg (11)\nFault inception time 15s to 15.0153s in steps of 1.38ms (12)\nLTC 0.2 to full tap in steps of 0.2 (5)\nPhase shift Forward and backward (2)\nFault location 230kV & 500kV bus (2)\nTotal=3 ×11 ×12 ×5 ×2 ×2=7920\nE. Non-linear Load Switching\nWith the advancement in semiconductor technology and\nthe use of non-linear loads with power converters, harmonic\ncontents in the line currents have increased. The differential re-\nlays may mal-operate when non-linear loads e.g steel furnaces\nare switched in a network containing transformers because\nof mutual enhancement effects between the transformer core\nand the load causing extreme saturation of the transformer\ncore for several cycles [30]. The harmonic information has\nbeen used to discriminate faults from other disturbances and\nlocate the faults in the transmission line using SVM and ANN\n[31]. A thyristor-based 6-pulse bridge rectiﬁer with a wye-\ndelta transformer as the non-linear load is connected to the\n230 kV bus to obtain the training and testing cases for load\nswitching. The values for the different parameters are given\nin table V and Fig.6 shows the phase-a differential current\nfor LTC = full, switching time = 15s and ﬁring angle of 0 ◦.\nFig.6(a) shows the transient and Fig.6(b) shows the steady-\nstate differential current after the switching.\nFig. 6: Non-linear Load Switching (a) Transient, and (b) Steady-state differ-\nential currents\nTABLE V: Parameters for Non-linear Load Switching\nVariables Values\nFiring angle 0 ◦, 10◦, 20◦, 30◦, 40◦, 50◦ (6)\nSwitching time 15s to 15.0153s in steps of 1.38ms (12)\nLTC 0.2 to full tap in steps of 0.2 (5)\nTotal = 6 ×12 ×5 = 360\nF . Capacitor Switching\nCapacitor banks are used to improve voltage proﬁle, re-\nduce losses, and enhance power factor. Mal-functioning of\ncustomer equipment due to voltage magniﬁcation coinciding\nwith capacitor switching is common. [32] used WT to detect\nhigh transient inrush currents from capacitor-bank switching\nto avoid malfunctioning of instantaneous and time overcurrent\nrelays (50/51). A capacitor bank having 3 Legs of 500 MV Ar\neach is connected to the 230kV bus. Capacitor bank reactors\nand resistors are used in each Leg to reduce the effect of\ntransients in voltages. Table VI shows the different parameters\nand their values used to get the data for training and testing\nfor capacitor switching. Fig.5(b) shows the 3-phase differential\ncurrents for LTC = full, switching time = 15.00138s, and\nswitching of 3 Legs of the capacitor bank.\nTABLE VI: Parameters for Capacitor Switching\nVariables Values\nCapacitor bank rating 500,1000,1500 MV Ar (3)\nSwitching time 15s to 15.0153s in steps of 1.38ms (12)\nPhase shift Forward and backward (2)\nLTC 0.2 to full tap in steps of 0.2 (5)\nTotal = 3 ×12 ×2 ×5 = 360\nG. Ferroresonance\nInitiated by faults and switching operations, ferroresonance\ncauses harmonics and overvoltages and may lead to mal-\noperation of protective relays and damage of power equipment\n[33]. Mal-operation of the differential relay occurs because of\nthe higher magnitude of current in the HV side than the LV\nside [34]. Besides, the low loss, amorphous core transformer\nincreases the intensity and occurrence of ferroresonance [35].\nSeveral conﬁgurations may lead to ferroresonance in electrical\nsystems. In this paper, one such arrangement has been modeled\nwhen one of the phases of a 3-phase transformer is switched\noff. The parameters and their values for ferroresonance con-\nditions are presented in Table VII. Fig.5(c) shows the 3-phase\ndifferential currents for switching time = 15s and grading\ncapacitance = 0.2 µF simulated between bus2 and bus4.\nTABLE VII: Parameters for Ferroresonance\nVariables Values\nGrading capacitance 0.02 µF to 0.2 µF in steps of 0.02 µF (10)\nLocation a,b,c phases (3)\nSwitching time 15s to 15.016s in steps of 0.69ms (24)\nTotal=10 ×3 ×24=720\nIII. D ETECTION , DISCRIMINATION & CLASSIFICATION\nALGORITHM\nA. Change detection ﬁlter (CDF) for transient detection\nThe change in the differential currents in case of transients\nis detected by a change detection ﬁlter (CDF) which calculates\nthe difference between the cumulative sum of modulus of two\nconsecutive cycles.\nCDF(t) =\n2nc+t∑\nx=nc+t\n|Id(x)|−\n2nc+t∑\nx=nc+t\n|Id(x−nc)| (5)\nwhere x equals sample number which begins at the second\ncycle, nc equals number of samples in a cycle, {t}n−nc\nt=1 , n\nequals total number of samples, and Id represents a, b, and c\nphase differential currents.\nIEEE SYSTEMS JOURNAL 6\nThe change detection ﬁlter starts logging the data from the\ninstant CDF(t) is greater than a threshold, th in any one of\nthe 3-phases. In normal conditions when there is no transient,\nthe values of CDF(t) are nearer to zero [36].\nB. Feature Extraction & Selection\nTime series analysis of the differential currents helps in\nthe classiﬁcation and characterization of power system events.\nFeatures extracted from these time series are used as input to\nthe machine learning algorithms. Informative and distinctive\nfeatures that help to classify the events may range from simple\nstatistical functions to complex ones. Researchers have used\ntime-frequency representations like Wavelet Transform [8]–\n[10], [13], [17], [18], [21] and Stockwell Transform [16], [19]–\n[21] to extract features from the non-stationary transients to\ndiscriminate inrush and internal faults and for classiﬁcation of\nPQ disturbances. In this paper, to differentiate the faults from\nthe other transient disturbances, three time-domain features\nand two frequency-domain features have been used.\nA comprehensive number of features (794) from different\ndomains are extracted from the 3-phase differential currents\nobtained from the current transformers, CT1 and CT2 located\nnear bus4 and bus5. The complete list of the features extracted\ncan be found in [37]. Out of these 794 features, Random\nForest is used to rank and select the features with maximum\nInformation Gain to distinguish between the different classes.\nThe most relevant and common features for each of the\nclassiﬁcation tasks obtained after performing feature ranking\nbelong to the set F = {F1, F2, F3, F4, F5}where, F1 is average\nchange quantile, F2 is Fourier transform (FT) coefﬁcients, F3\nis aggregate linear trend, F4 is spectral welch density, and F5 is\nautoregressive coefﬁcients. Only those features of set F which\nare present in each of the 3-phase differential currents are\nused for training the classiﬁers to detect the faults, localize the\nfaulty units, identify the fault type, and identify the disturbance\ntype (Table XVI). The feature set F is detailed in what follows.\nF1, average change quantile calculates the average of ab-\nsolute values of consecutive changes of the time series inside\ntwo constant values qh and ql as\navg. change quantile= 1\nn′·\nn′−1∑\nt=1\n|Idt+1 −Idt| (6)\nwhere, n′ equals number of sample points in the differential\ncurrent between qh and ql, Id is a, b, and c phase differential\ncurrents with n sample points.\nF2, FT coefﬁcients, (X |k) returns the fourier coefﬁcients of\n1-D discrete Fourier Transform for real input using fast FT as\n(X|k) =\nn−1∑\nt=0\nIdt ·e(−j2πkt\nn ),k ∈Z (7)\nF3, aggregate linear trend calculates the linear least-squares\nregression for values of the time series over windows and\nreturns aggregated values of either intercept or standard error.\nF4, spectral welch density uses Welchs method to compute\nan estimate of the power spectral density by partitioning the\ntime series into segments and then averaging the periodgrams\nof the discrete Fourier transform of each segment [38].\nF5, autoregressive coefﬁcients are the least-square estimates\nof ϕi′s which are obtained by minimizing Eq.8 with respect\nto ϕ0,ϕ1...,ϕP and lag P.\nn∑\nt=p+1\n[Idt −ϕ0 −ϕ1 ·Idt−1 −...−ϕP ·Idt−P]2 (8)\nMore than one feature can be extracted from the above time\nand frequency domain functions by varying their parameters.\ne.g ( qh,ql) = (0.8,0.4) & (0.8,0.2) yields 2 features from\nchange quantile and window length = 5, 10, and 15 would\nreturn 3 features of linear trend.\nC. Classiﬁers\nTree-based learning algorithms like decision trees, random\nforest, and gradient boosting are considered among the best\nand predominantly used supervised learning methods in prob-\nlems related to data science. These estimators have higher\naccuracy, stability and are easy to interpret. They can also\nhandle non-linear relationships quite well. DT, RFC, GBC,\nand SVM has been used to detect and classify the transients.\n1) Decision Tree: Decision trees are distribution-free white\nbox Machine Learning models that learn simple decision\nrules inferred from the feature values. In 1984 Breiman et\nal. introduced Classiﬁcation and Regression Trees (CART)\n[39]. Here, the CART algorithm implemented in scikit-learn\nis used which constructs binary trees by splitting the training\nset recursively till it reaches the maximum depth or a splitting\ndoesn’t reduce the impurity measure. The candidate parent\ndata Dp is split into Dl and Dr at each node using a feature\n(f) and threshold that yields the largest Information Gain.\nThe objective function IG which is optimized at each split\nis deﬁned as\nIG(Dp,f) = I(Dp) −Nl\nNp\n·I(Dl) −Nr\nNp\n·I(Dr) (9)\nwhere, I is impurity measure, Np,Nl and Nr are the number of\nsamples at the parent and child nodes [40]. Gini, and entropy\nimpurity measures are used in the hyperparameter search.\n2) Random Forest: RFC belongs to the family of ensemble\ntrees which builds numerous base estimators and averages their\npredictions which produces a better estimator with reduced\nvariance. Each tree constitutes a random sample (drawn with\nreplacement) of the training set and the best split is found\nat each node by considering a subset of input features. The\nindividual trees tend to overﬁt but averaging the predictions of\nall trees reduces the variance [41]. The main hyperparameters\nin RFC are no of estimators (number of trees in the forest),\nmax depth (tree depth), and max features (feature size to\nconsider when splitting a node). The no of jobs parameter\nwas also used to parallelize the construction of tree and\ncomputation of predictions by using more processing units.\nRandom Forest has also been used during feature selection\nand ranking (III-B) to get the relative importance of the\nfeatures which is measured by the fraction of samples a feature\ncontributes to and the mean decrease in impurity from splitting\nthe samples [42].\nIEEE SYSTEMS JOURNAL 7\n3) Gradient Boosting Classiﬁer: GBC belongs to the class\nof ensemble trees which builds the base estimators from weak\nlearners (wp(x)) sequentially in a greedy manner which results\nin a strong estimator [43] [44]. The newly added wp tries to\nminimize the loss function given fp−1, step length ( λp), and\ninput (xi,yi)n\ni=1.\nfp(x) = fp−1(x) + λpwp(x)\nwp = arg minw\nn∑\ni=1\nL(yi,fp−1(xi) + w(xi)) (10)\nThe minimization problem is solved by taking the negative\ngradient of the negative multinomial log-likelihood loss func-\ntion, L for mutually exclusive classes.\nfp(x) = fp−1(x) −λp\nn∑\ni=1\n∇fL(yi,fp−1(xi)) (11)\nGBC uses shrinkage which scales the contribution of the weak\nlearners by the learning rate and sub-sampling of the training\ndata (stochastic gradient boosting) for regularization. The im-\nportant hyperparameters of the different GBC classiﬁers used\nare the results of grid search on no of estimators = [5000,\n7000, 10000, 12000, 15000], max depth = [3,5,7,10,15], and\nlearning rate = [0.01, 0.05, 0.07, 0.1].\nD. Proposed scheme\nFig. 7: Proposed transient detection and classiﬁcation algorithm\nThe block diagram description of the CDF and GBC based\nproposed internal fault detection, fault localization, and tran-\nsient disturbance classiﬁcation algorithm is shown in Fig.7.\nThe change detector discovers the change in the 3-phase\ndifferential currents ( IP-IS) if the CDF index in any phase\nis greater than the threshold, th= 0.05. 1/2 cycle pre-transient\nand 1 cycle post-transient differential current samples are used\nto detect an internal fault and 3 post-transient cycles are\nused for localization of faults and classiﬁcation of transient\ndisturbances. The scheme consists of a four-level classiﬁer\ndesign. The level-1 classiﬁer (GBC-1) consists of the fault\ndetector, which can apply supervisory control over the oper-\nation of the conventional differential relay. GBC-1 identiﬁes\nan internal fault with “0” and other transient disturbances with\n“1”. Hence, it governs the working of the trip/restrain function\nby blocking all other power system transients but an internal\nfault. The level-2 classiﬁer (GBC-2) does further analysis of\nthe power system events in case the output of GBC-1 is “1”.\nThe GBC-2 can identify the transient disturbance responsible\nfor the mal-operation of the conventional differential relay\n(GBC-1 is “1” & Operate relay is “1”). The level-3 classiﬁer\n(GBC-3) locates the faulty transformer unit (PT, ISPAR series,\nand ISPAR exciting) if the output of GBC-1 is “0”. The level-4\nclassiﬁers (GBC-4, GBC-5, and GBC-6) further identiﬁes the\ninternal faults in the ISPAR exciting, the ISPAR series and the\nPT.\nIV. R ESULTS AND DISCUSSION\n1.5 cycles of 3-phase differential currents are used for detec-\ntion, and 3 cycles are used for localization and identiﬁcation of\ntransients from the time of their inception. Thus, at a sampling\nrate of 10 kHz, 167 data samples per cycle are analyzed.\nSeveral factors inﬂuence the classiﬁcation accuracy of an\nalgorithm. Cross-validation and grid search helps in using\nthe data effectively and training the classiﬁer with the best\ncombination of hyperparameters. The data is split randomly\ninto training and test set in a 4:1 ratio. To avoid the problem\nof overﬁtting and underﬁtting of the estimator on the test set,\ncross-validation is applied on the training data and the hyper-\nparameters are optimized using grid search over a parameter\ngrid. Grid search comprehensively searches for the parameters\nover the subset of the hyperparameter space of the estimator.\nThe performance of the selected hyperparameters is then tested\non the unseen test data that is not used during the training\nprocess. Ten-fold stratiﬁed cross-validation (rearrangement of\nthe training data in ten folds such that each fold represents\nevery class well) is used to select the model as it is better\nboth in terms of bias and variance [45].\nTABLE VIII: Internal fault detection with CDF & GBC-1\nFault/Disturbances Total TP FN FP\nInternal Faults 2107 2105 2 0\nDisturbances 1852 1852 0 2\nTABLE IX: Comparison of performances with and without CDF\n(a) Internal fault detection with CDF\nClassiﬁer ¯η\nGBC-1 99.95 %\nDT 99.5%\nSVM 99.7%\nRFC 99.9%\n(b) Internal fault detection\nwithout CDF\nClassiﬁer ¯η\nGBC 98.5%\nDT 95.3%\nSVM 89.2%\nRFC 94.6%\nIEEE SYSTEMS JOURNAL 8\nA. Internal fault detection\nThe detection of internal faults is performed using GBC in\ntwo ways, one with the CDF and the other without it. Most\nauthors haven’t considered using some technique to detect\nthe change in differential currents in case a transient occurs.\nRather they ﬁxed the time of occurrence of the transient\nevents and used this speciﬁed inception time to store the\ndisturbance and fault data. However, faults and disturbances\nare highly unpredictable in time. In this paper, both methods,\none considering a speciﬁed time (without the use of CDF)\nand the other with CDF are used to register the data after\nthe inception of transients. The CDF detects the change and\nregisters 1/2 cycle of pre-transient and 1 cycle of post-transient\nsamples. This 1.5 cycle (250 samples) is used to extract the\nrelevant features which are then fed to GBC, SVM, DT, and\nRFC classiﬁers. Accuracy is used as the typical metrics to\nmeasure the performance of the classiﬁers. But, it is biased to\ndata imbalance. Since, the classes are imbalanced, balanced\naccuracy which is deﬁned as mean of the accuracies obtained\non all classes and computed as ¯η = 1\n2 ·[ TP\n(TP+FN) + TN\n(TN+FP) ]\nfor binary classes is used to compute the performance mea-\nsure where, TP represents true positive, TN represents true\nnegative, FP represents false positive, and FN represents false\nnegative [46].\nThe performance of the fault detection scheme composed of\nthe GBC-1 and CDF is shown in Table VIII. ¯η of 99.95% is\nobtained on a training data of 15,835, testing data of 3959,\nand hyperparameters: learning rate = 0.1, max depth = 5,\nand no of estimators = 7000. The performance of the four\nclassiﬁers with CDF is shown in Table IXa. One cycle of post-\nfault data is used for training the classiﬁers for fault detection\nwithout the CDF. ¯η of 98.52% is obtained with GBC for\nmax depth = 7, no of estimators = 5000, and learning rate\n= 0.07. The balanced scores of the four classiﬁers trained on\n80,870 cases and tested on 20,218 cases are shown in Table\nIXb. 18 features from the 3-phase differential currents (Table\nXVI) are used as the input to the classiﬁers for training the\nfault detection models with and without CDF. GBC with CDF\nperformed better than without CDF (Table IX) as the CDF\nﬁltered out the cases where there is no appreciable change in\ndifferential currents although a transient event occurred. It is\nnoticed that the CDF could detect the change in differential\ncurrents in all internal fault cases except turn-to-turn faults\nwith Rf = 10 Ω, LTC = 0.2, and percentage of winding\nshorted = 20%. Also, it detected the change for all transient\ndisturbances except sympathetic inrush cases for switching\nangles from 120◦to 330◦. On exploring the data it is observed\nthat there is almost no change in the differential currents for\nthese instances. The w-g faults for LTC = 0.2, and percentage\nof winding shorted = 20% which needs higher sensitivity were\ndetected. It proves the dependability of the scheme for ground\nfaults near neutral of wye grounded transformers (PT and\nISPAR exciting) which is again a challenge for conventional\ndifferential relays [7].\nTABLE X: Localization of faulty transformer unit\n(a) Localization with GBC-3\nTransformer Total TP FN FP\nISPAR Exciting 2937 2899 38 8\nISPAR Series 7402 7383 19 17\nPT 7287 7287 0 32\n(b) Comparison of perfor-\nmances\nClassiﬁer ¯η\nGBC-3 99.5%\nDT 98.6%\nSVM 88.9%\nRFC 98.7%\nB. Identiﬁcation of faulty unit & internal fault type\nOnce it is conﬁrmed that an internal fault has been detected,\nthe locations of those internal faults are determined. 3 cycles\nof post-fault differential current samples are used to locate\nthe faulty transformer unit (PT or ISPAR Exciting or ISPAR\nSeries) and determine the type of fault. GBC, SVM, DT, and\nRFC are used to identify the faulty unit and further locate\nand pinpoint the type of fault in the PT and ISPAR units. ¯η\nand accuracy computed as η= (TP+TN)\n(TP+FN+TN+FP) , are used as\nthe metrics to measure the performance of the estimators for\nlocalization of faulty unit and identiﬁcation of internal fault\ntype, respectively.\nTABLE XI: Comparison of identiﬁcation performances of internal fault type\n(a) Exciting unit\nClassiﬁer η\nGBC-4 99.2%\nDT 98.6%\nSVM 94.8%\nRFC 98.9%\n(b) Series unit\nClassiﬁer η\nGBC-5 98.0%\nDT 94.7%\nSVM 90.7%\nRFC 96.9%\n(c) PT\nClassiﬁer η\nGBC-6 99.2%\nDT 98.9%\nSVM 94.0%\nRFC 97.8%\n1) Localization of faulty unit: To locate the faulty trans-\nformer unit 70,502 fault cases are trained and 17,626 cases\nare tested. 18 features are used to train the classiﬁers (Table\nXVI). GBC-3 with hyperparameters: no of estimators = 5000,\nlearning rate = 0.07, and max depth = 10 gives ¯η of 99.48%.\nTable Xa shows the localization results using GBC-3 and Table\nXb compares the ¯η of the four different classiﬁers.\n2) Identiﬁcation of internal fault type: The internal faults\nin the ISPAR series, ISPAR exciting and the PT are further\nclassiﬁed into wa-g, wb-g, wc-g, wa-wb-g, wa-wc-g, wb-wc-\ng, wa-wb, wa-wc, wb-wc, turn-to-turn, winding-to-winding,\nand very rare wa-wb-wc and wa-wb-wc-g faults. 21 features\nfrom 3 cycles of the 3-phase differential currents are used\nas the input to the estimators (Table XVI). Tables XIa, XIb,\nand XIc compare the performances of GBC, RFC, DT, and\nSVM classiﬁers for ISPAR exciting, ISPAR series, and the PT\nrespectively.\nTo identify the internal faults in ISPAR exciting 14,688\nfault cases are used to train and test the four classiﬁers.\nGBC-4 trained with hyperparameters of max depth = 5,\nno of estimators = 7000, and learning rate = 0.1 achieved\nthe best accuracy of 99.18%. For the identiﬁcation of in-\nternal faults in ISPAR series 36,720 cases are used to train\nand test the classiﬁers. GBC-5 trained with learning rate =\n0.05, max depth = 7, and no of estimators = 5000 gives an\naccuracy of 98.0%. Similarly, for PT the classiﬁers are trained\n& tested on 36,720 fault cases. GBC-6 achieved the best ac-\nIEEE SYSTEMS JOURNAL 9\ncuracy of 99.2% obtained by training the hyperparameters on\nlearning rate = 0.05, no of estimators = 5000, and max depth\n= 5. The identiﬁcation accuracy obtained in the ISPAR series\nis lower than in PT and ISPAR exciting because the secondary\nside of ISPAR series is delta connected. Hence, one type of\nfault on the primary side confuses with another type on the\nsecondary side.\nC. Identiﬁcation of disturbance type\nThe various disturbances: magnetizing inrush, sympathetic\ninrush, ferroresonance, external faults with CT saturation,\ncapacitor switching, and non-linear load switching are also\nclassiﬁed using 3 cycles of post-transient samples after they\nare differentiated as no-fault by the fault detection scheme.\n15 features are used as input to the classiﬁers in this case\n(Table XVI). It’s always useful to know the probabilities of the\ninput features taking on various real values. ParzenRosenblatt\nwindow method is used to estimate the underlying probability\ndensity of the 5 features for the six different disturbances in\nphases a, b, and c. Fig.8 shows the kernel density estima-\ntion plots for the chosen features. Gaussian is used as the\nkernel function to approximate the univariate features with\na bandwidth of 0.2 for autoregressive coefﬁcient, and FT\ncoefﬁcient and a bandwidth of 0.01 for aggregate linear trend,\nand avg. change quantile 1 and 2. It is observed that probability\ndensity functions of autoregressive and FT coefﬁcients are a\nmixture of multiple normal distributions with varying standard\ndeviation and mean whereas linear trend, and change quantiles\nare unimodal with means near zero and smaller standard\ndeviations. Table XIIa and XIIb shows the values of mean (µ),\nvariance (σ2), skewness ( ˜µ3), and kurtosis (κ) of the 5 features\nfor magnetizing inrush and CT saturation during external faults\nrespectively in phases a, b and c. Because of space limitations,\nthe feature statistics of only these two transients are shown.\nFurthermore, to visualize the 15-dimensional input data in\na 2-dimensional plane, the T-distributed Stochastic Neighbor\nEmbedding dimensionality reduction technique has been used\nwhich preserves much of the signiﬁcant structure in the high-\ndimensional data while mapping in the 2-dimension [47]. Fig.9\nshows the clusters of similar transients (300 instances each)\nand also the relationships between different group of transients\nas a scatter plot.\nThe Table XIII shows the classiﬁcation results using GBC-\n2. Table XIV compares the results of GBC with RFC, DT, and\nSVM. The classiﬁers are trained on 10,368 cases and tested\non 2592 cases. ¯η of 99.28% is obtained with GBC-2 having\nhyperparameters: no of estimators = 5000, learning rate =\n0.7, and max depth = 3.\nD. Discriminate faults in PT & ISPAR\nThe PAR controls the power ﬂow through a line and\nwhen connected with a PT, it reduces the magnitude of the\ndifferential currents and their harmonic contents and alters\nthe wave shapes due to the additional phase shift for the PT\nin case of external faults. With internal faults, such changes\nin the differential currents are lesser. 70,502 internal fault\ncases are trained and 17,626 cases are tested on 18 features\nFig. 8: Kernel Density Estimate plots showing the probability distribution of\nthe 5 selected features for the 6 transient disturbances in (a) phase a, (b) phase\nb, and (c) phase c.\nTABLE XII: Low and high-order statistics of the 5 selected features\n(a) Magnetizing inrush\nautoregressive\ncoefﬁcient\nFT\ncoefﬁcient\nlinear\ntrend\nchange\nquantile 1\nchange\nquantile 2\nµ σ 2 ˜µ3 κ µ σ 2 ˜µ3 κ µ σ 2 ˜µ3 κ µ σ 2 ˜µ3 κ µ σ 2 ˜µ3 κ\nph a -4.6 5.9 .74 -.35 1e3 2e6 1.3 .74 2.6 14 1.9 3.9 .02 9e-4 1.9 2.9 .04 .008 2.5 5.1\nph b -4.7 6.2 .65 -.13 502 3e5 1.0 -.06 2.6 13 1.8 3.2 .01 8e-5 1.5 1.06 .04 .01 2.5 5.7\nph c 3.3 .72 -1.1 .33 33 1e3 1.1 .25 .19 .05 1.0 -.35 .02 5e-4 .90 -.45 .08 .009 .88 -.84\n(b) CT saturation during external faults\nautoregressive\ncoefﬁcient\nFT\ncoefﬁcient\nlinear\ntrend\nchange\nquantile 1\nchange\nquantile 2\nµ σ 2 ˜µ3 κ µ σ 2 ˜µ3 κ µ σ 2 ˜µ3 κ µ σ 2 ˜µ3 κ µ σ 2 ˜µ3 κ\nph a -2.3 3.1 -1.6 1.97 190 4e4 1.6 2.5 .47 .23 1.64 2.9 .04 6e-4 1 .98 .003 9e-6 1.8 3.6\nph b -2.2 3 -1.6 1.95 261 2e4 .81 .35 .47 .24 1.55 2.3 7e-4 9e-7 3.5 19 .04 5e-4 .6 -.42\nph c 2.5 .4 1.1 .27 16 150 1.7 2.9 .02 5e-4 1.5 2.4 .003 8e-6 1.7 4.7 .04 4e-4 .67 -.14\nto verify how effectively the GBC discriminates the internal\nfaults in the PT and the ISPAR. The table XV shows the\nclassiﬁcation errors with learning rate of 0.05, max depth =\n9, and no of estimators = 5000. The balanced accuracy of\n99.9% shows that the GBC is capable of distinguishing these\nfaults even in an interconnected network.\nE. Performances on balanced and imbalanced data\nMachine learning algorithms are more reliable when they\noperate on a balanced dataset. To adjust the data distribution of\nclasses and remove class imbalance, under-sampling of major-\nFig. 9: 2D scatterplot of the input features for transient disturbances\nIEEE SYSTEMS JOURNAL 10\nTABLE XIII: Identiﬁcation of transient disturbances with GBC-2\nDisturbances Total TP FN FP\nMagnetizing inrush 365 357 8 0\nSympathetic inrush 336 336 0 8\nCapacitor switching 73 72 1 1\nFerroresonance 133 132 1 0\nLoad switching 69 69 0 0\nExternal faults 1616 1615 1 2\nTABLE XIV: Performance\ncomparison of identiﬁcation\nof transient disturbances\nClassiﬁer ¯η\nGBC-2 99.28%\nDT 98.09%\nSVM 98.23%\nRFC 98.89%\nTABLE XV: Misclassiﬁcation\nbetween ISPAR & PT\nFaults Total TP FN FP\nPT 7262 7262 0 13\nISPAR 10364 10351 13 0\nity classes and over-sampling of minority classes is performed.\nSynthetic Minority Over-Sampling Technique (SMOTE) [48]\nis used to create minority synthetic data considering k-nearest\nneighbours and NearMiss algorithm is used for under-sampling\nthe majority classes avoiding information loss. The table\nXVI shows the balanced accuracy/ accuracy for detecting\nthe internal faults, identifying the faulty units and type of\nfaults in those units, and identifying the disturbances with and\nwithout using SMOTE and NearMiss. It is observed that the\naccuracies obtained with SMOTE and NearMiss algorithm for\nthe different classiﬁcation tasks are similar to those obtained\nby training the GBCs without them. Table XVI also gives\nthe information about the time and frequency domain features\n({Fi}5\ni=1) that has been used to train the different GBC\nclassiﬁers for the different classiﬁcation tasks.\nTABLE XVI: Input features and performance of different GBC classiﬁers with\nand without SMOTE analysis\nClassiﬁcation task F1 F2 F3 F4 F5 ∑Fi×3 ¯η\\η\n(%)\n¯η using\nSMOTE\ndetect faults 2 1 1 1 1 18 99.9 99.9\nlocate faulty units 2 2 2 - - 18 99.5 99.6\nidentify faults (series) 3 1 2 1 - 21 98.0 98.2\nidentify faults(exciting) 3 2 2 - - 21 99.2 99.1\nidentify faults (PT) 3 2 2 - - 21 99.2 99.1\nidentify transients 2 1 1 - 1 15 99.3 99.4\nF . Effect of different rating and transformer connections\nIt is not necessary to train the fault detection scheme for\ndifferent rating and connection of the PTs, rating of ISPAR,\nand variation in other parameters. In order to validate the\neffectiveness of the proposed scheme with variation in differ-\nent system parameters, new internal faults and other transient\ncases are simulated again with 400 MV A, Y ∆ connected PTs\nand 400 MV A ISPARs. The fault resistance, LTC, fault type,\nand fault inception time are altered to generate the internal\nfault cases and switching time, ﬁring angle, LTC, etc. are\naltered to generate the transient cases to test the same GBC-\n1 model trained using 500 MV A, YY connected PTs and\n500 MV A ISPARs. It is observed from Table XVII that the\nproposed scheme gives a balanced accuracy of 99.3% which\nTABLE XVII: Performance for 400-MV A & Y∆ connection\nFault/\nDisturbances\nFaults/\nAbnormalities Total TP FN ¯η\n(%)\nInternal\nfaults\n(3072)\n(a) ph & g, T-T, W-W faults (PT) 1200 1200 0 100\n(b) ph & g, T-T, W-W faults (Series) 1200 1200 0 100\n(c) ph & g, T-T, W-W faults (Exciting) 672 672 0 100\n(d) Total = (a)+ (b)+ (c) 3072 3072 0 100\nOther\ndisturbances\n(876)\n(e) Capacitive switching 60 51 9 85\n(f) External faults with CT saturation 528 525 3 99.4\n(g) Ferroresonance 24 24 0 100\n(h) Magnetizing inrush 60 60 0 100\n(i) Load switching 144 144 0 100\n(j) Sympathetic inrush 60 60 0 100\n(k) Total = (e)+ (f)+ (g)+ (h)+ (i)+ (j) 876 864 12 98.6\nTotal (3948) Total faults and disturbances = (d)+(k) 3948 3936 12 99.3\nTABLE XVIII: Effect of Noise\nFault/\nDisturbances SNR (dB) Number\nof cases\nPredicted class Accuracy\n(%)Faults Disturbances\nInternal\nfaults\n∞ 1010 1001 9 99.2\n30 1035 1005 30 97.1\n20 1008 934 74 92.7\n10 984 891 93 90.4\nOther\ndisturbances\n∞ 990 3 987 99.7\n30 965 24 941 97.6\n20 992 26 966 97.4\n10 1016 28 988 97.2\nis compatible with the accuracy obtained when trained and\ntested at 500 MV A and YY connection.\nG. Effect of Signal Noise & CT saturation\nIn order to analyse the effect of noise in the differential cur-\nrents on the proposed fault detection scheme white Gaussian\nnoise of different levels measured in terms of Signal-to-Noise-\nratio (SNR) are added to the training and testing cases for fault\ndetection [17], [19]–[21]. Table XVIII shows the accuracy\nof the GBC for different levels of noise on 5000 cases of\ninternal faults and other disturbances each. It is observed that\nas the level of noise increases the η of the classiﬁer dips,\nbut still always above 93.8% ( 90.4+97.2\n2 ). The η changes from\n99.4% to 93.8% as the SNR is varied from ∞to 10dB. It\nis also observed from the table that the misclassiﬁcation of\ninternal faults increases as the SNR is decreased whereas the\nmisclassiﬁcations are nearly the same for other disturbances as\nSNR is decreased from 30dB to 10dB. Moreover, to examine\nthe effect of CT saturation the secondary side impedance\n(burden and CT secondary impedance) which has the major\ninﬂuence over the level of saturation is changed. η of 99.5%\nis obtained with GBC on 5000 cases of internal faults and\nother disturbances each. Fig.10 shows the 3-phase differential\ncurrents with CT saturation for faults in T1 and ISPAR1.\nH. Execution Time\nThe execution time-averaged over 10 runs for the feature\nextraction, training, and testing of the GBC classiﬁers for\ndetection of internal faults, identifying the faulty unit and type\nIEEE SYSTEMS JOURNAL 11\nFig. 10: 3-phase differential currents with CT saturation for (a) wa-wb-g fault\nin transformer primary and (b) wa-g fault in series primary\nof fault, and identifying the transient using one CPU core is\nreported using the in-built library in python (Table XIX). The\nfault/no-fault decision includes the time to compute the feature\nand testing a single instance with GBC-1 which adds to 8.7ms\nwith the CDF. Thus, the proposed scheme has a processing\ntime of 25.37ms (16.67+1.7+7) or ≈11\n2 cycle to detect a fault.\nConsidering that these computations can be further optimized\nfor example by converting Python and MATLAB code to a\ncompiled low-level language such as C, the fault detection and\nlocalization, and transient identiﬁcation schemes are suitable\nfor future real-time implementation. The DT, SVM, RFC,\nand GBC classiﬁers are built in Python 3.7 using Scikit-learn\nframework [49] while the CDF is implemented in MATLAB\n2017. The pre-processing of the data is done in Python and\nMATLAB. All PSCAD simulations are carried out on Intel\nCore i7-6560U CPU @ 2.20 GHz and 8 GB RAM and the\nclassiﬁers are run on Intel Core i7-8700 CPU @ 3.20 GHz\nand 64 GB RAM.\nTABLE XIX: Execution time of the GBC classiﬁers (seconds)\nClassiﬁcation task Training\ninstances\nTesting\ninstances\nTraining\ntime\nTesting time Feature\nextraction\ntimeOne All\ndetect faults 80870 20218 1506 0.0024 1.1 0.007\ndetect faults with CDF 15835 3959 19 0.0017 .061 0.007\nlocate faulty units 70502 17626 1232 0.0049 1.2 0.0088\nidentify faults (series) 29376 7344 1341 0.016 2.1 0.0111\nidentify faults(exciting) 11750 2938 357 0.013 0.48 0.0108\nidentify faults (PT) 29376 7344 2712 0.026 5.1 0.0108\nidentify transients 10368 2592 72.3 0.004 0.09 0.0065\nThis work distinguishes faults from the six transients ( ¯η =\n99.95%), locates the faulty unit ( ¯η = 99.5%), identiﬁes the\nfault type ( η ≈99%) and six other transients ( ¯η = 99.3%)\nfor the ISPAR and PT in an interconnected system, whereas\nthe publications [22] [23] in the literature focused only on\nthe ISPAR. In [22], only the internal faults in ISPAR were\nidentiﬁed and in [23], the internal faults were differentiated\nfrom magnetizing inrush using WT and then the internal faults\nwere identiﬁed. In addition to its broader functionality, the\ncurrent work improves the accuracy from an average of 98.76\n[22] and 97.7% [23] to 99.2%.\nV. C ONCLUSION\nIn this paper, the task of discrimination of internal faults and\nother transient disturbances in a 5-bus interconnected power\nsystem for PTs and PARs is presented. The internal faults\nincluding turn-to-turn and winding-to-winding faults in the\nISPAR and the PT are distinguished from magnetizing inrush,\nsympathetic inrush, ferroresonance, external faults with CT\nsaturation, capacitor switching, and non-linear load switching\ntransients. A change detector is used to detect the change\nin the 3-phase differential currents in case a transient event\noccurs and registers the current samples for detection and\nclassiﬁcation purposes. Five most relevant time and frequency\ndomain features, selected from the differential currents on the\nbasis of Information Gain are used to train the DT, RFC, GBC,\nand SVM classiﬁers. The fault detection scheme comprising\nof the CDF and GBC gives an accuracy of 99.95% on 19,794\ntransient cases obtained by varying different parameters for the\ninternal faults and other transient disturbances conﬁrming its\ndependability for internal faults and security against transient\ndisturbances. Once an internal fault is detected and a trip signal\nis issued using 1.5 cycles, the faulty transformer unit (PT, IS-\nPAR series, or ISPAR exciting unit) and type of internal faults\nin those units are also identiﬁed in 3 cycles. Furthermore, the\ntype of transient disturbance is determined in case the fault\ndetection scheme detects a transient other than internal faults.\nThe validity of the scheme is also established for different\nrating and connection of the transformers, CT saturation, and\nSNR ratio of 30dB to 10dB in the differential currents. The\nproposed fault detection strategy can work together with a\nconventional differential relay offering supervisory control\nover its operation and thus avoid false tripping. The transient\ndetection and identiﬁcation accuracies obtained are among the\nbest even when compared with results from works on isolated\nand simple networks.\nAPPENDIX\nFortran script for two-winding transformer\n1. NW = 4 18. L2l = Lk1/2* fb\n2. Im2 = Im1 = Im 19. L3l = Lk2/2* fc\n3. fa = fault1 ∗0.01 20. L4l = Lk2/2* fd\n4. fb = 1.0 −fa 21. L1m = (v1/(w* Im1*i1))*fa∗fa\n5. fc = fault2 ∗0.01 22. L2m = (v1/(w* Im1*i1))*fb∗fb\n6. fd = 1.0 −fc 23. L3m = (v2/(w* Im2*i2))*fc∗fc\n7. i1 = MV A/v1 24. L4m = (v2/(w* Im2*i2))*fd∗fd\n8. i2 = MV A/v2 25. Lx = L1l + L1m\n9. z1 = v1/i1 26. Ly = L2l + L2m\n10. z2 = v2/i2 27. Lz = L3l + L3m\n11. w = 2*pi*f 28. Lw = L4l + L4m\n12. l1 = v1/(w* Im1*i1) 29. Mxy = sqrt(L1m*L2m)\n13. l2 = v2/(w* Im2*i2) 30. Mxz = sqrt(L1m*L3m)\n14. Lk1 = Xl*z1/w 31. Mxw = sqrt(L1m*L4m)\n15. Lk2 = Xl*z2/w 32. Myz = sqrt(L2m*L3m)\n16. tr = v1/v2 33. Myw = sqrt(L2m*L4m)\n17. L1l = Lk1/2* fa 34. Mzw = sqrt(L3m*L4m)\nREFERENCES\n[1] R. Hamilton, “Analysis of transformer inrush current and comparison of\nharmonic restraint methods in transformer protection,” IEEE Transac-\ntions on Industry Applications , vol. 49, no. 4, July 2013.\n[2] Pei Liu, O. P. Malik, Deshu Chen, G. S. Hope, and Yong Guo, “Improved\noperation of differential protection of power transformers for internal\nfaults,” IEEE Transactions on Power Delivery , vol. 7, no. 4, Oct 1992.\n[3] T. S. Sidhu, M. S. Sachdev, H. C. Wood, and M. Nagpal, “Design,\nimplementation and testing of a microprocessor-based high-speed relay\nfor detecting transformer winding faults,” IEEE Transactions on Power\nDelivery, vol. 7, no. 1, pp. 108–117, Jan 1992.\n[4] D. Bi, Y . Sun, D. Li, G. Yu, X. Wang, and W. Wang, “Analysis on\nmal-operation of differential protection caused by sympathetic inrush,”\nAutom. Elect. Power Syst. , vol. 31, pp. 36–40, Nov 2007.\nIEEE SYSTEMS JOURNAL 12\n[5] M. Stanbury and Z. Djekic, “The impact of current-transformer satura-\ntion on transformer differential protection,”IEEE Transactions on Power\nDelivery, vol. 30, no. 3, pp. 1278–1287, June 2015.\n[6] M. A. Ibrahim and F. P. Stacom, “Phase angle regulating transformer\nprotection,” IEEE Transactions on Power Delivery , vol. 9, no. 1, pp.\n394–404, Jan 1994.\n[7] “IEEE Guide for the Application of Protective Relaying for Phase-\nShifting Transformers,” IEEE Std C37.245-2018 , pp. 1–71, May 2019.\n[8] P. Mao and R. Aggarwal, “A novel approach to the classiﬁcation\nof the transient phenomena in power transformers using combined\nwavelet transform and neural network,” Power Engineering Review,\nIEEE, vol. 21, pp. 70–70, 08 2001.\n[9] S. Jazebi, B. Vahidi, and M. Jannati, “A novel application of wavelet\nbased svm to transient phenomena identiﬁcation of power transformers,”\nEnergy Conversion and Management , vol. 52, no. 2, 2011.\n[10] A. M. Shah and B. R. Bhalja, “Discrimination between internal faults\nand other disturbances in transformer using the support vector machine-\nbased protection scheme,” IEEE Transactions on Power Delivery ,\nvol. 28, no. 3, pp. 1508–1515, July 2013.\n[11] O. Ozgonenel and S. Karagol, “Power transformer protection based on\ndecision tree approach,” IET Electric Power Applications , vol. 8, no. 7,\npp. 251–256, August 2014.\n[12] S. Samantaray and P. Dash, “Decision tree based discrimination between\ninrush currents and internal faults in power transformer,” International\nJournal of Electrical Power & Energy Systems , vol. 33, no. 4, 2011.\n[13] Yong Sheng and S. M. Rovnyak, “Decision trees and wavelet analysis for\npower transformer protection,” IEEE Transactions on Power Delivery ,\nvol. 17, no. 2, pp. 429–433, April 2002.\n[14] M. Tripathy, R. P. Maheshwari, and H. K. Verma, “Probabilistic neural-\nnetwork-based protection of power transformer,” IET Electric Power\nApplications, vol. 1, no. 5, pp. 793–798, Sep. 2007.\n[15] A. M. Shah and B. R. Bhalja, “Fault discrimination scheme for power\ntransformer using random forest technique,” IET Generation, Transmis-\nsion Distribution, vol. 10, no. 6, pp. 1431–1439, 2016.\n[16] R. Kumar, B. Singh, D. T. Shahani, A. Chandra, and K. Al-Haddad,\n“Recognition of power-quality disturbances using s-transform-based ann\nclassiﬁer and rule-based decision tree,” IEEE Transactions on Industry\nApplications, vol. 51, no. 2, pp. 1249–1258, March 2015.\n[17] N. Perera and A. D. Rajapakse, “Recognition of fault transients using\na probabilistic neural-network classiﬁer,” IEEE Transactions on Power\nDelivery, vol. 26, no. 1, pp. 410–419, Jan 2011.\n[18] S. Santoso, E. J. Powers, W. M. Grady, and A. C. Parsons, “Power\nquality disturbance waveform recognition using wavelet-based neural\nclassiﬁer. i. theoretical foundation,” IEEE Transactions on Power Deliv-\nery, vol. 15, no. 1, pp. 222–228, Jan 2000.\n[19] T. Zhong, S. Zhang, G. Cai, Y . Li, B. Yang, and Y . Chen, “Power\nquality disturbance recognition based on multiresolution s-transform and\ndecision tree,” IEEE Access, vol. 7, pp. 88 380–88 392, 2019.\n[20] U. Singh and S. N. Singh, “Optimal feature selection via nsga-ii\nfor power quality disturbances classiﬁcation,” IEEE Transactions on\nIndustrial Informatics, vol. 14, no. 7, pp. 2994–3002, July 2018.\n[21] P. K. Ray, S. R. Mohanty, N. Kishor, and J. P. S. Catalo, “Optimal feature\nand decision tree-based classiﬁcation of power quality disturbances\nin distributed generation systems,” IEEE Transactions on Sustainable\nEnergy, vol. 5, no. 1, pp. 200–208, Jan 2014.\n[22] S. K. Bhasker, P. K. Bera, V . Kumar, and M. Tripathy, “Differential\nprotection of indirect symmetrical phase shift transformer and internal\nfaults classiﬁcation using wavelet and ann,” in TENCON 2015 - 2015\nIEEE Region 10 Conference , Nov 2015, pp. 1–6.\n[23] P. K. Bera, R. Kumar, and C. Isik, “Identiﬁcation of internal faults in\nindirect symmetrical phase shift transformers using ensemble learning,”\nin 2018 IEEE International Symposium on Signal Processing and\nInformation Technology (ISSPIT), Dec 2018, pp. 1–6.\n[24] P. K. Bera, C. Isik, and V . Kumar, “Transients and faults in power\ntransformers and phase angle regulators (dataset),” 2020. [Online].\nAvailable: http://dx.doi.org/10.21227/1d1w-q940\n[25] J. McIver, “Phase shifting transformers principles, design aspects and\noperation,” Siemens Energy, Inc, Mar 2015.\n[26] S. Kulkarni and S. Khaparde, Transformer Engineering. Boca Raton:\nCRC Press, 2013.\n[27] H. Bronzeado and R. Yacamini, “Phenomenon of sympathetic interaction\nbetween transformers caused by inrush transients,” IEE Proceedings -\nScience, Measurement and Technology , vol. 142, no. 4, July 1995.\n[28] T. Zheng, J. Gu, S. F. Huang, F. Guo, and V . Terzija, “A new algorithm to\navoid maloperation of transformer differential protection in substations\nwith an inner bridge connection,” IEEE Transactions on Power Delivery,\nvol. 27, no. 3, pp. 1178–1185, July 2012.\n[29] G. B. Kumbhar and S. V . Kulkarni, “Analysis of sympathetic inrush\nphenomena in transformers using coupled ﬁeld-circuit approach,” in\n2007 IEEE Power Engineering Society General Meeting , June 2007.\n[30] H. Weng and X. Lin, “Studies on the unusual maloperation of trans-\nformer differential protection during the nonlinear load switch-in,” IEEE\nTransactions on Power Delivery , vol. 24, no. 4, Oct 2009.\n[31] E. Koley, S. K. Shukla, S. Ghosh, and D. K. Mohanta, “Protection\nscheme for power transmission lines based on svm and ann consid-\nering the presence of non-linear loads,” IET Generation, Transmission\nDistribution, vol. 11, no. 9, pp. 2333–2341, 2017.\n[32] T. Patcharoen and A. Ngaopitakkul, “Transient inrush current detection\nand classiﬁcation in 230 kv shunt capacitor bank switching under various\ntransient-mitigation methods based on discrete wavelet transform,” IET\nGeneration, Transmission Distribution, vol. 12, no. 15, 2018.\n[33] M. K. Siahpoosh, D. Dorrell, and L. Li, “Ferroresonance assessment in\na case study wind farm with 8 units of 2 mva dﬁg wind turbines,” in\n2017 20th International Conference on Electrical Machines and Systems\n(ICEMS), Aug 2017, pp. 1–5.\n[34] S. Rezaei, “Impact of ferroresonance on protective relays in manitoba\nhydro 230 kv electrical network,” in 2015 IEEE 15th International\nConference on Environment and Electrical Engineering , June 2015.\n[35] M. Hajizadeh, I. Saﬁnejad, and N. Amirshekari, “Study and comparison\nof the effect of conventional, low losses and amorphous transformers on\nthe ferroresonance occurrence in electric distribution networks,” CIRED\n- Open Access Proceedings Journal, vol. 2017, no. 1, pp. 865–869, 2017.\n[36] O. Dharmapandit, R. K. Patnaik, and P. K. Dash, “A fast time-frequency\nresponse based differential spectral energy protection of ac microgrids\nincluding fault location,” Protection and Control of Modern Power\nSystems, vol. 2, no. 1, p. 30, Aug 2017.\n[37] M. Christ, N. Braun, J. Neuffer, and A. W. Kempa-Liehr, “Time series\nfeature extraction on basis of scalable hypothesis tests (tsfresh a python\npackage),” Neurocomputing, vol. 307, pp. 72 – 77, 2018.\n[38] P. Welch, “The use of fast fourier transform for the estimation of power\nspectra: A method based on time averaging over short, modiﬁed peri-\nodograms,” IEEE Transactions on Audio and Electroacoustics , vol. 15,\nno. 2, pp. 70–73, June 1967.\n[39] L. Breiman, J. H. Friedman, R. A. Olshen, and C. J. Stone, Classiﬁcation\nand regression trees. CRC Press, 1984.\n[40] J. R. Quinlan, C4.5: Programs for Machine Learning . San Francisco,\nCA, USA: Morgan Kaufmann Publishers Inc., 1993.\n[41] L. Breiman, “Random forests,” Machine Learning , vol. 45, pp. 5–32,\nOct 2001.\n[42] G. Louppe, “Understanding random forests: From theory to practice,”\nPh.D. dissertation, University of Lige, Belgium, Oct 2014.\n[43] J. H. Friedman, “Greedy function approximation: A gradient boosting\nmachine.” Ann. Statist., vol. 29, no. 5, pp. 1189–1232, 10 2001.\n[44] L. Mason, J. Baxter, P. Bartlett, and M. Frean, “Boosting algorithms as\ngradient descent,” in Proceedings of the 12th International Conference\non Neural Information Processing Systems , ser. NIPS’99. Cambridge,\nMA, USA: MIT Press, 1999, pp. 512–518.\n[45] R. Kohavi, “A study of cross-validation and bootstrap for accuracy\nestimation and model selection,” in Proc. 14th Int. Joint Conf. Artif.\nIntell., 1995, p. 11371143.\n[46] K. H. Brodersen, C. S. Ong, K. E. Stephan, and J. M. Buhmann,\n“The balanced accuracy and its posterior distribution,” in 2010 20th\nInternational Conference on Pattern Recognition , Aug 2010.\n[47] L. van der Maaten and G. Hinton, “Visualizing data using t-SNE,”\nJournal of Machine Learning Research , vol. 9, pp. 2579–2605, 2008.\n[48] N. V . Chawla, K. W. Bowyer, L. O. Hall, and W. P. Kegelmeyer, “Smote:\nSynthetic minority over-sampling technique,” J. Artif. Int. Res. , vol. 16,\nno. 1, p. 321357, Jun. 2002.\n[49] F. Pedregosa et al., “Scikit-learn: Machine learning in Python,” Journal\nof Machine Learning Research , vol. 12, pp. 2825–2830, 2011.",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.65029376745224
    },
    {
      "name": "Electric power system",
      "score": 0.5160769820213318
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.42916885018348694
    },
    {
      "name": "Electrical engineering",
      "score": 0.4071016013622284
    },
    {
      "name": "Engineering",
      "score": 0.3428860604763031
    },
    {
      "name": "Power (physics)",
      "score": 0.2952229976654053
    },
    {
      "name": "Computer science",
      "score": 0.27927613258361816
    },
    {
      "name": "Physics",
      "score": 0.20669037103652954
    },
    {
      "name": "Voltage",
      "score": 0.1732739806175232
    },
    {
      "name": "Control (management)",
      "score": 0.0
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    },
    {
      "name": "Artificial intelligence",
      "score": 0.0
    }
  ]
}