{
    "title": "COVID-19 Mobile Positioning Data Contact Tracing and Patient Privacy Regulations: Exploratory Search of Global Response Strategies and the Use of Digital Tools in Nigeria",
    "url": "https://openalex.org/W3017037691",
    "year": 2020,
    "authors": [
        {
            "id": "https://openalex.org/A5011973450",
            "name": "Iniobong Ekong",
            "affiliations": [
                null
            ]
        },
        {
            "id": "https://openalex.org/A5086364506",
            "name": "Emeka Chukwu",
            "affiliations": [
                "University of Malta"
            ]
        },
        {
            "id": "https://openalex.org/A5007546599",
            "name": "Martha Chukwu",
            "affiliations": [
                "Tallinn University of Technology"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2065069831",
        "https://openalex.org/W2119611042",
        "https://openalex.org/W1501261568",
        "https://openalex.org/W2127738864",
        "https://openalex.org/W3012379316",
        "https://openalex.org/W1992120983",
        "https://openalex.org/W4250397413",
        "https://openalex.org/W4247696503",
        "https://openalex.org/W2614820936",
        "https://openalex.org/W3016003958",
        "https://openalex.org/W3011720891",
        "https://openalex.org/W3010096538"
    ],
    "abstract": "Background The coronavirus disease (COVID-19) pandemic is the biggest global economic and health challenge of the century. Its effect and impact are still evolving, with deaths estimated to reach 40 million if unchecked. One effective and complementary strategy to slow the spread and reduce the impact is to trace the primary and secondary contacts of confirmed COVID-19 cases using contact tracing technology. Objective The objective of this paper is to survey strategies for digital contact tracing for the COVID-19 pandemic and to present how using mobile positioning data conforms with Nigeria’s data privacy regulations. Methods We conducted an exploratory review of current measures for COVID-19 contact tracing implemented around the world. We then analyzed how countries are using mobile positioning data technology to reduce the spread of COVID-19. We made recommendations on how Nigeria can adopt this approach while adhering to the guidelines provided by the National Data Protection Regulation (NDPR). Results Despite the potential of digital contact tracing, it always conflicts with patient data privacy regulations. We found that Nigeria’s response complies with the NDPR, and that it is possible to leverage call detail records to complement current strategies within the NDPR. Conclusions Our study shows that mobile position data contact tracing is important for epidemic control as long as it conforms to relevant data privacy regulations. Implementation guidelines will limit data misuse.",
    "full_text": "Original Paper\nCOVID-19 Mobile Positioning Data Contact Tracing and Patient\nPrivacy Regulations: Exploratory Search of Global Response\nStrategies and the Use of Digital Tools in Nigeria\nIniobong Ekong1*, MBBS, MPH, CGEIT; Emeka Chukwu2*, BEng, MSc, CGEIT; Martha Chukwu3*, BSc, MPA\n1Department of Health Planning, Research and Statistics, FCT Health and Human Services Secretariat, Abuja, Nigeria\n2Department of Computer Information System, Faculty of Information & Communication Technology, University of Malta, Msida, Malta\n3Ragnar Nurkse Department of Innovation and Governance, School of Business and Governance, Tallinn University of Technology, Tallinn, Estonia\n*all authors contributed equally\nCorresponding Author:\nEmeka Chukwu, BEng, MSc, CGEIT\nDepartment of Computer Information System\nFaculty of Information & Communication Technology\nUniversity of Malta\nPG room A24, Level 0\nMsida, MSD 2080\nMalta\nPhone: 356 99330888\nEmail: nnaemeka_ec@hotmail.com\nAbstract\nBackground: The coronavirus disease (COVID-19) pandemic is the biggest global economic and health challenge of the century.\nIts effect and impact are still evolving, with deaths estimated to reach 40 million if unchecked. One effective and complementary\nstrategy to slow the spread and reduce the impact is to trace the primary and secondary contacts of confirmed COVID-19 cases\nusing contact tracing technology.\nObjective: The objective of this paper is to survey strategies for digital contact tracing for the COVID-19 pandemic and to\npresent how using mobile positioning data conforms with Nigeria’s data privacy regulations.\nMethods: We conducted an exploratory review of current measures for COVID-19 contact tracing implemented around the\nworld. We then analyzed how countries are using mobile positioning data technology to reduce the spread of COVID-19. We\nmade recommendations on how Nigeria can adopt this approach while adhering to the guidelines provided by the National Data\nProtection Regulation (NDPR).\nResults: Despite the potential of digital contact tracing, it always conflicts with patient data privacy regulations. We found that\nNigeria’s response complies with the NDPR, and that it is possible to leverage call detail records to complement current strategies\nwithin the NDPR.\nConclusions: Our study shows that mobile position data contact tracing is important for epidemic control as long as it conforms\nto relevant data privacy regulations. Implementation guidelines will limit data misuse.\n(JMIR Mhealth Uhealth 2020;8(4):e19139) doi: 10.2196/19139\nKEYWORDS\nCOVID-19; contact tracing; Nigeria’s National Data Protection Regulation; General Data Protection Regulation; GDPR;\ncoronavirus; surveillance; mHealth; eHealth; digital health\nIntroduction\nThe coronavirus disease 2019 (COVID-19) is caused by severe\nacute respiratory syndrome coronavirus 2 (SARS-CoV-2) [1].\nThis infectious respiratory disease was first detected in Wuhan\nCity, China, in December 2019. It was declared a global\npandemic by the World Health Organization (WHO) on March\n11, 2020, and has currently infected over two million people\nworldwide and has killed over 150,000 people. Globally,\nresponses have been swift and in full influenza pandemic control\nJMIR Mhealth Uhealth 2020 | vol. 8 | iss. 4 | e19139 | p. 1http://mhealth.jmir.org/2020/4/e19139/\n(page number not for citation purposes)\nEkong et alJMIR MHEALTH AND UHEALTH\nXSL•FO\nRenderX\nmode [2]. Travel and movement restrictions to curtail spread\nboth within and across cities are in force. Many cities around\nthe world are in lockdown or lock-in mode. Some have issued\ndusk-to-dawn curfews. In other scenarios, large gatherings have\neither been banned or discouraged. Estimates suggest that this\npandemic can claim the lives of as many as 40 million people\nglobally [3]. The Spanish flu, which lasted between 1918 and\n1920 in some places, has been estimated to have cost the lives\nof 21-50 million people globally [4]. Evidence suggests that\ninfluenzas can mainly be spread through large clusters [5]. The\nWHO global influenza preparedness plan presents guidelines\nfor the management and control of influenza and other disease\n[6]. Nigeria, one of the countries that adopts WHO guidelines,\nhas over 493 cases of COVID-19 as of April 17, 2020, with 17\nmortalities. This is a substantial increase since the index case\nwas reported on February 27, 2020. To better manage the spread,\nNigeria’s federal government has declared a lockdown in key\naffected states (ie, Lagos, Ogun, and the Federal Capital\nTerritory). The lockdown was in addition to several mitigating\nactions by state governments, ranging from a ban on social\ngatherings to dusk-to-dawn curfews. During the lockdown,\nschools, markets, churches, mosques, banks, offices, parks,\nmotor parks, and airports remain closed, often for a 14-day\nperiod.\nThe Nigeria Centre for Disease Control (NCDC) reported that\nit is currently conducting contact tracing of over 9000 contacts\nof confirmed cases in an attempt to effectively contain the spread\nof the disease, in line with the recommended measures for\npandemic response [7,8]. These measures include antiviral,\nvaccine, and nonpharmaceutical measures such as case isolation,\nhousehold quarantine, school or workplace closure, and travel\nrestrictions. Given the scale of the COVID-19 pandemic,\nnonpharmaceutical actions appear to be the only practical and\nlogical option in the absence of any known antiviral drug or\nvaccine. Resources are stretched even in countries with advanced\nhealth care systems, as seen in Italy, the United Kingdom, China,\nand the United States [9,10].\nAlthough the NCDC's approach has been commended for its\ncompliance with WHO guidelines for large-scale containment\nand contact tracing, there remain options that may yet be\nexplored [11]. Given the inadequacy of testing kits, it is believed\nthat the number of confirmed cases may be far lower than the\nactual number of cases in Nigeria and most African countries.\nThis is fueling speculations of a real, catastrophic-level\npandemic if isolation, containment, quarantine, and\ncontact-tracing mechanisms are not urgently implemented. In\na country with an already weak health care system occasioned\nby poor health investment choices, managing such an outbreak\nwill become impossible.\nThere is, therefore, a need to develop and adopt new strategies,\nparticularly digitally-enabled strategies, to facilitate a more\nextensive, accurate, seamless, and timely response in line with\nthe high frequency of new infections among contacts of\nconfirmed cases (ie, the secondary infection rate) [12]. The\nadoption of digital solutions in Nigeria has been focused on\nelectronic forms for contact data collection and visualization\nfor follow-up [13]. Digital technologies can do more than be a\ntool for field data collection or serve as an outbreak investigation\nplatform. Data on households and general population movement\npatterns can be extracted through digital technologies [14].\nFarrahi et al [15] showed that over a 9-month period, 72\nparticipants made 10,992 phone calls and 9432 SMS records\nrepresenting communication flow; additionally, these\nparticipants made 1,973,547 Bluetooth interactions representing\nphysical proximity movements. When extrapolated for three\ncases in Abuja, the capital city of Nigeria, their movement can\nresult in thousands of interactions. In the case of an infection,\nthese three cases can initiate an exponential number of contacts\nthrough these interactions, as seen in Figure 1A. The registered\nquarantine address can be visualized on the map and movement\nof quarantine subjects can be monitored with notifications\nenabled (Figure 1B).\nOur paper reviews global practices in the use of mobile\npositioning data to achieve a more targeted and efficient\napproach at contact tracing and disease surveillance, especially\nin the context of the COVID-19 pandemic. We discuss how this\napproach is possible within regulatory confines. We also\nrecommend a novel strategy for coordinating agencies to\nleverage mobile positioning data, and how to ensure patient\nprivacy is preserved.\nFigure 1. Visualization of Movement paths of cases and quarantine location.\nJMIR Mhealth Uhealth 2020 | vol. 8 | iss. 4 | e19139 | p. 2http://mhealth.jmir.org/2020/4/e19139/\n(page number not for citation purposes)\nEkong et alJMIR MHEALTH AND UHEALTH\nXSL•FO\nRenderX\nMethods\nThe COVID-19 pandemic is emerging and only three months\nold with little scholarly work to justify a systematic search,\nreview, and analysis approach. We conducted an exploratory\n(nonsystematic) internet search for technology approaches and\nresponses to COVID-19. Results from global and national\nagencies responsible for infection prevention and control were\nanalyzed to ascertain how they currently use technology. We\nalso reviewed how these use cases fit within the regulatory\nframework for contact tracing and isolation. A similar internet\nsearch methodology was adopted for Nigeria’s response and its\nuse of digital tools for contact tracing.\nResults\nOur search yielded results based on emerging trends and the\nuse of digital technologies by countries around the world to\nrespond to COVID-19. We first present global perspectives and\nresponse strategies on the use of mobile position data during\nprevious and current pandemics. We then present Nigeria’s\napproach.\nMobile Position Data: How It Works\nThe GSM Association puts the total number of mobile\nsubscribers at 5 billion unique subscribers and 7 billion\nconnected devices [16]. Nigeria has 184 million active mobile\nsubscriber lines [17]. Mobile telecommunications subscriber\ncommunication and movement data was used for contact tracing\nduring the Ebola outbreak [14]. Many countries are currently\nusing mobile data for a more rapid response to the COVID-19\npandemic [18,19]. There has been a 90% increase in the number\nof countries implementing digital tracking measures and a 100%\nincrease in reports of censorship [20]. These approaches range\nfrom the use of anonymized aggregate data to monitor the\ngeneral mobility of people and track the mobile phones of\nconfirmed cases to tracking suspected patients and their contacts.\nIn some cases, these approaches were individualized and\nmandatory while, in others, they were aggregated and\nanonymized. In all cases, there were collaborations between the\ngovernment, mobile network operators (MNOs), and other data\ncontrollers such as technology companies and financial services\nproviders.\nAt any time, each mobile subscriber is connected to a segment\nof the MNO base station tower. For simplicity, we have\npresented a cell tower and a subscriber in Figure 2. We used\nletters A and B to illustrate the farthest and shortest distance of\nthe subscriber from the base station tower based on power\nthroughput and internal cell tower position triangulation. The\ndifference between A and B, representing the diameter of a\nuser’s device, which is a proxy for the user’s location, often\nranges between 50 and 300 meters, but depends other factors\n[14].\nFigure 2. Location of a subject with respect to a mobile network operator (MNO) cell tower.\nGlobal Strategies\nTable 1 details some of the strategies governments around the\nworld are adopting to track and isolate COVID-19 patients and\ntheir contacts or for lockdown/lock-in enforcement. In the\nUnited States, US $500 million of the US $2 trillion economic\nstimulus bill recently signed into law has been allocated to the\nUS Centers for Disease Control and Prevention to launch a new\nsurveillance and data collection system to monitor the spread\nof COVID-19 [21]. This move is a first for the United States\nsince stringent patient data privacy and security regulations\nhave hampered the adoption of contact tracing as a\ncountermeasure for epidemic control in the past [22]. Similarly,\nthe state of Massachusetts has announced the launch of what it\ncalls the “first contact tracing” call center with 1000 virtual\nassistants to call and trace contacts of COVID-19-positive\npersons [23].\nThe European Union’s General Data Protection Regulation\n(GDPR) is being tested on a large scale. Within the regulation,\na patient can decide not to disclose who they have been in\ncontact with or legally resist being traced [24]. Evidence has\nemerged that Germany, Austria, and Italy are using aggregated\nJMIR Mhealth Uhealth 2020 | vol. 8 | iss. 4 | e19139 | p. 3http://mhealth.jmir.org/2020/4/e19139/\n(page number not for citation purposes)\nEkong et alJMIR MHEALTH AND UHEALTH\nXSL•FO\nRenderX\ncall detail records (CDRs) to enforce lockdown and stay-at-home\npolicies [25]. As this is an evolving challenge and European\ncountries such as Italy and France are amongst the worst\naffected, changes to the GDPR regulations are expected and\nanticipated.\nIn China, the government worked with telecommunications\ncompanies to track and contact people who had traveled through\nHubei province during the early days of the disease outbreak.\nLocation data was shared with China's National Health\nCommission and other agencies, enabling them to\nretrospectively simulate the location of confirmed cases and\ntheir contacts, who were then issued warnings via social media\n[26]. Information has also emerged that the Chinese government\nmay have leveraged its large network of sensors and surveillance\ncameras supported by an artificial intelligence–powered facial\nrecognition and recommender system in its response to the\nCOVID-19 outbreak [27]. This success may not be unconnected\nwith the often criticized and loose patient data privacy and\nsecurity regulation in China.\nIt was, however, observed that the extent of compliance with\ninternational and country-level regulations regarding data\nprivacy considerations in deploying this digital technology\nvaried from country to country.\nTable 1. Strategies planned or adopted by countries for the use of mobile positioning data in response to the COVID-19 pandemic.\nStrategy planned or adoptedCountry\nThe state of Massachusetts announced the launch of its first contact tracing call center to be manned by 1000\nvirtual assistants [23]. The US federal government announced a US $500 million package for COVID-19\nsurveillance for the CDC [21].\nUnited States [21]\nA mandatory smartphone app “Health code” that leverages a mesh network for infected persons contact\ntracing and notification.\nChina [22,28]\nTelecommunications providers allow for the sharing of location data with health authorities to check whether\npeople are remaining at home. The data is aggregated and anonymous, mapping concentrations rather than\nindividuals to respect Europe’s privacy laws.\nItaly, Germany, and Austria [25]\nThe government created a map of cell phone data provided by telecommunications and credit card companies.\nThe map was made public, so everyone could track their level of exposure.\nSouth Korea [29]\nThe government is using GMS call detail records in addition to patient mobile phone position data to locate\ncontacts and trace their movement patterns.\nIsrael [19]\nIranian authorities developed a mobile app with government endorsement for COVID-19 self-diagnosis\nchecks. It, however, also discretely collects user’s location data.\nIran [30]\nSingapore is using a mobile app that uses a Bluetooth-based mesh network to detect people's proximity to\nthose who have been exposed to COVID-19 and warns them to get tested if they come in close contact.\nSingapore [18,21]\nThe Nigerian Strategy\nHuman travel patterns and mobility can be assessed using\navailable mobile phone data, and its application can be useful\nin disease epidemiology [31]. Panigutti et al [31] also revealed\nthe adequacy of mobile phone data for tracking infectious\ndisease spread, particularly in heavily populated and highly\ninterconnected communities.\nBorder restrictions, internal travel restrictions, and school\nclosures or total lockdown are reasonable but have minimal\nimpact compared to effective case isolation or quarantine, which\nhave been shown to have a significant impact if properly\nconducted [2]. This is particularly important in Nigeria’s case,\nwhere total compliance to these strategies cannot be guaranteed.\nTherefore, data on case isolation and quarantine should be a\nsignificant priority in Nigeria. Moreover, data is useful in\nmodeling disease transmission. Specifically, collecting and\nanalyzing data on transmission in different social contexts is\nhighly effective in mapping intervention strategies since the\nimpact of case isolation and quarantine depends on reducing\ncontact between unaffected individuals and the index and other\ncases while they are ill [2].\nIn order for the NCDC to effectively conduct the current\nlarge-scale contact tracing of over 9000 contacts of confirmed\ncases, use of digital technology is inevitable. The number of\ncontacts may even be more than this number considering the\nfrequency of new infections. Currently, there are several digital\ncontact data capture solutions, including the Surveillance,\nOutbreak Response Management and Analysis System\n(SORMAS). These solutions require a field epidemiologist or\ntheir representative to visit every contact.\nDiscussion\nPrincipal Findings\nEvidence suggests that contact tracing and data protection can\ngo together [32]. Significant progress is being made with current\nstrategies. As promising as they may seem, data privacy\nconcerns remain a major impediment; it is necessary to find a\nbalance between deploying the technology and maintaining data\nsafety and patient privacy. Existing patient privacy regulations\nare currently being tested. Some countries have attempted to\nrelax existing stringent regulations that protect patient privacy\nto allow for greater access; others have worked around them.\nAccording to Woods [21], many of the new digital technology\napproaches appear inevitable and legitimate, given the\nunprecedented high frequency of the COVID-19 infection\nspread. Many countries have now also invoked speedy\nlegislative processes to give legitimacy to their workarounds\nand deployments.\nJMIR Mhealth Uhealth 2020 | vol. 8 | iss. 4 | e19139 | p. 4http://mhealth.jmir.org/2020/4/e19139/\n(page number not for citation purposes)\nEkong et alJMIR MHEALTH AND UHEALTH\nXSL•FO\nRenderX\nIn Israel, for instance, the cabinet has passed an emergency law\nto use mobile data for tracking people infected with COVID-19,\ntrace their contacts, and identify individuals for quarantine [19].\nThis law was passed overnight, bypassing parliamentary\napproval. In the United States, privacy advocates are proposing\nstringent procedures to keep personal information safe, including\ndeletion, once the data are no longer in use to prevent abuse by\nlaw enforcement agents [21].\nThe National Data Protection Regulation (NDPR) of Nigeria\nwas promulgated in 2019 [33]. Amongst other stipulations, the\nregulation outlines the guiding principles for data processing\nin Section 5. These principles consider data processing unlawful\nif there is no consent by the individual data subjects (in this\ncase, the confirmed persons), if it is inaccurate with prejudice\nto human dignity and not protected against cybercrime, and if\nit is stored beyond a reasonable period of time. However, despite\nthese guiding principles, Section 6, part 2.0, subsection 2.2 (e)\nof the document lists the conditions for lawful data processing\nand states that:\nProcessing is necessary for the performance of a task\ncarried out in the public interest or the exercise of\nofficial public mandate vested in the controller.\nThe data controller in the case of mobile positioning data is the\nMNO, the entity that determines the purposes for and the manner\nin which network subscriber phone data is processed or is to be\nprocessed. Section 11 of the regulation states that data\nprocessing by a third party (eg, a public authority such as the\nFederal Ministry of Health, the NCDC, or anybody engaged in\nprocessing the location data such as a technology company)\nshall be governed by a written contract with the data controller.\nInterestingly, though the NDPR protects the privacy of personal\nmobile location data, it also provides exceptions for the use of\nsuch data that override public interest, such as the current\nCOVID-19 outbreak.\nRecommendations\nMobile phone location data can be effectively utilized in Nigeria\nfor COVID-19 response. The government can leverage existing\nmobile technology resources and infrastructure available\nin-country by working with MNOs and technology firms to\noptimize the ongoing contact tracing and surveillance of over\n9000 known contacts of confirmed cases. This collaboration\nshould be guided by the NDPR in order to protect and safeguard\nindividuals' data, prevent a breach of data privacy rights as well\nas inappropriate use and abuse by law enforcement agencies\nbeyond the period of contact tracing and surveillance.\nIn practice, however, the first step should involve anonymized\nmobile subscriber data in line with good data governance policy.\nIn the spirit of goodwill, informed consent of confirmed cases\nshould be appropriately obtained once they are diagnosed,\nwhenever possible. The use of the public interest exception\nshould be a last resort. A simplified guideline for these processes\nfor adhering to the NDPR should be written and made\ntransparently available for data custodians, requesting bodies,\ndata handlers, and the patient or contact.\nA third-party agreement should also be formally signed between\nparties interfacing with patient data in any way. A typical use\ncase sensitive to data privacy concerns is the use of information\nonly regarding visits to public facilities, including public\ntransportation systems, parks, churches, mosques, or malls, by\nCOVID-19-positive individuals, as described by Ohmukai et\nal [34]. The use of CDRs has been proven to be effective in\ndetecting outbreak clusters, followed by the use of other\nfrontline data collection tools for mitigating impact and\ncontainment [14]. A key limitation of using CDRs from MNOs\nis that for basic 2G (second generation) phone users, the location\nwill rely on mobile network phone mast location triangulation\nonly. This approach alone has a proximity accuracy of 50-300\nmeters. This accuracy level is not sufficient to identify persons\nwho have been in contact with a COVID-19 patient since the\nWHO contact definition prescribes two meters [7]. The use of\ntelecommunication CDRs should complement other strategies\nfor effective results.\nThe immediate action after a successful contact trace is\ncommunicating the expected course of action to citizens of an\ninfected community cluster. A simple, user-friendly interface\nusing Unstructured Supplementary Service Data will help\nimprove information requests and management for low-income\nbut literate users. Interactive voice response technology will be\nsuitable and appropriate for awareness response for low-literate\nusers in their local language.\nConclusions\nMobile positioning data can significantly improve the capacity\nand scope of timely outbreak response and will help\ngovernments as well as other responders in Nigeria. When\nimplemented early [15], there are opportunities to leverage\npositioning data to break the chains of disease transmission in\ncommunity clusters. It can improve the efficiency of currently\nused field data collection and outbreak investigation platforms\nwhen used in synergy.\nWhile mobile positioning data can be used within the current\nregulation, guidelines for data handlers must include measures\nto curtail misuse and unauthorized access. Future research\nshould design and implement models for mobile position contact\ntracing.\nConflicts of Interest\nNone declared.\nReferences\n1. World Health Organization. 2020. Naming the coronavirus disease (COVID-19) and the virus that causes it URL: https:/\n/tinyurl.com/t82w9ka [accessed 2020-04-01]\n2. Ferguson NM, Cummings DAT, Fraser C, Cajka JC, Cooley PC, Burke DS. Strategies for mitigating an influenza pandemic.\nNature 2006 Jul 27;442(7101):448-452. [doi: 10.1038/nature04795] [Medline: 16642006]\nJMIR Mhealth Uhealth 2020 | vol. 8 | iss. 4 | e19139 | p. 5http://mhealth.jmir.org/2020/4/e19139/\n(page number not for citation purposes)\nEkong et alJMIR MHEALTH AND UHEALTH\nXSL•FO\nRenderX\n3. van Elsland SL, O'Hare R. Imperial College London. 2020 Mar 26. Coronavirus pandemic could have caused 40 million\ndeaths if left unchecked URL: https://www.imperial.ac.uk/news/196496/coronavirus-pandemic-could-have-caused-40/\n[accessed 2020-04-03]\n4. Johnson NPAS, Mueller J. Updating the accounts: global mortality of the 1918-1920 \"Spanish\" influenza pandemic. Bull\nHist Med 2002;76(1):105-115. [doi: 10.1353/bhm.2002.0022] [Medline: 11875246]\n5. Ferguson NM, Fraser C, Donnelly CA, Ghani AC, Anderson RM. Public health. Public health risk from the avian H5N1\ninfluenza epidemic. Science 2004 May 14;304(5673):968-969. [doi: 10.1126/science.1096898] [Medline: 15143265]\n6. World Health Organization. 2005. WHO Global Influenza Preparedness Plan URL: https://www.who.int/csr/resources/\npublications/influenza/WHO_CDS_CSR_GIP_2005_5.pdf [accessed 2020-03-29]\n7. World Health Organization. 2020 Apr 03. Coronavirus disease 2019 (COVID-19): Situation Report - 74 URL: https://www.\nwho.int/docs/default-source/coronaviruse/situation-reports/20200403-sitrep-74-covid-19-mp.pdf?sfvrsn=4e043d03_12\n[accessed 2020-03-01]\n8. World Health Organization Writing Group, Bell D, Nicoll A, Fukuda K, Horby P, Monto A, et al. Non-pharmaceutical\ninterventions for pandemic influenza, national and community measures. Emerg Infect Dis 2006 Jan;12(1):88-94 [FREE\nFull text] [doi: 10.3201/eid1201.051371] [Medline: 16494723]\n9. Cascella M, Rajnik M, Cuomo A, Dulebohn S, Di Napoli R. Features, Evaluation and Treatment Coronavirus (COVID-19).\nTreasure Island, FL: StatPearls Publishing; 2020.\n10. Cao B, Wang Y, Wen D, Liu W, Wang J, Fan G, et al. A Trial of Lopinavir–Ritonavir in Adults Hospitalized with Severe\nCovid-19. N Engl J Med 2020 Mar 18. [doi: 10.1056/nejmoa2001282]\n11. World Health Organization. 2020 Mar 19. Considerations for quarantine of individuals in the context of containment for\ncoronavirus disease (COVID-19) URL: https://tinyurl.com/y8smo4pe [accessed 2020-03-25]\n12. World Health Organization. 2020. Household transmission investigation protocol for coronavirus disease 2019\n(    COVID-19)     URL: https://www.who.int/publications-detail/\nhousehold-transmission-investigation-protocol-for-2019-novel-coronavirus-(2019-ncov)-infection [accessed 2020-04-01]\n13. Dimagi.com. 2020. Digital Solution for COVID-19 Response URL: https://www.dimagi.com/covid-19/[accessed 2020-04-01]\n14. Shibasaki R. International Telecommunication Union. 2017. Call detail record (CDR) analysis: Sierra Leone URL: https:/\n/www.itu.int/en/ITU-D/Emergency-Telecommunications/Documents/2017/Reports/SL/D012A0000CA3301PDFE.pdf\n[accessed 2020-03-20]\n15. Farrahi K, Emonet R, Cebrian M. Epidemic contact tracing via communication traces. PLoS One 2014 May 1;9(5):e95133\n[FREE Full text] [doi: 10.1371/journal.pone.0095133] [Medline: 24787614]\n16. GSMA Intelligence. 2017. Number of Mobile Subscribers Worldwide Hits 5 Billion URL: https://www.gsma.com/newsroom/\npress-release/number-mobile-subscribers-worldwide-hits-5-billion/ [accessed 2020-04-01]\n17. Nigerian Communications Commission. 2017. URL: https://www.ncc.gov.ng/ [accessed 2017-02-17]\n18. Choudhury SR. CNBC. 2020 Mar 25. Singapore says it will make its contact tracing tech freely available to developers\nURL: https://www.cnbc.com/2020/03/25/coronavirus-singapore-to-make-contact-tracing-tech-open-source.html [accessed\n2020-03-04]\n19. Lomas N. Tech Crunch. 2020 Mar 18. Israel passes emergency law to use mobile data for COVID-19 contact tracing URL:\nhttps://techcrunch.com/2020/03/18/israel-passes-emergency-law-to-use-mobile-data-for-covid-19-contact-tracing/[accessed\n2020-03-18]\n20. Cozzens T. GPS World. 2020 Mar 26. 19 countries track mobile location to fight COVID-19 URL: https://tinyurl.com/\ny8kpuvcv [accessed 2020-03-29]\n21. Woods A. New York Post. 2020 Mar 26. CDC to launch new surveillance system to track coronavirus spread URL: https:/\n/nypost.com/2020/03/26/cdc-to-launch-new-surveillance-system-to-track-coronavirus-spread/ [accessed 2020-04-01]\n22. Rafalski EM. Health Insurance Portability and Accountability Act of 1996 (HIPAA). Encyclopedia of Health Services\nResearch 1996. [doi: 10.4135/9781412971942.n180]\n23. Carraggi M. Patch. 2020 Apr 03. MA To Launch First Coronavirus Contact Tracing Program In US URL: https://patch.\ncom/massachusetts/boston/ma-launch-first-coronavirus-contact-tracing-program-u-s [accessed 2020-04-03]\n24. Information Commissioner's Office. Guide to the General Data Protection Regulation (GDPR). Information Commissioner's\nOffice 2018 [FREE Full text] [doi: 10.1211/pj.2017.20203048]\n25. Pollina E, Busvine D. Reuters. 2020 Mar 18. European mobile operators share data for coronavirus fight URL: https:/\n/tinyurl.com/yadpu9gm [accessed 2020-04-01]\n26. Grind K, McMilan R, Mathews AW. The Wall Street Journal. 2020 Mar 17. To Track Virus, Governments Weigh Surveillance\nTools That Push Privacy Limits, Geolocation and facial-recognition systems can locate vectors of infections, but they also\ngather highly personal data URL: https://tinyurl.com/v99rex4 [accessed 2020-04-02]\n27. Yuan S. Aljazeera China. 2020 Mar 01. How China is using AI and big data to fight the coronavirus URL: https://www.\naljazeera.com/news/2020/03/china-ai-big-data-combat-coronavirus-outbreak-200301063901951.html[accessed 2020-03-20]\n28. Zhang O. Associated Press / Time. 2020 Apr 02. Inside China's Smartphone 'Health Code' System Ruling Post-Coronavirus\nLife URL: https://time.com/5814724/china-health-code-smartphones-coronavirus/ [accessed 2020-03-10]\nJMIR Mhealth Uhealth 2020 | vol. 8 | iss. 4 | e19139 | p. 6http://mhealth.jmir.org/2020/4/e19139/\n(page number not for citation purposes)\nEkong et alJMIR MHEALTH AND UHEALTH\nXSL•FO\nRenderX\n29. Lyons K. The Verge. 2020 Mar 23. Governments around the world are increasingly using location data to manage the\ncoronavirus URL: https://tinyurl.com/y75xuwyz [accessed 2020-03-29]\n30. Gilbert D. Vice. 2020 Mar 14. Iran Launched an App That Claimed to Diagnose Coronavirus. Instead, It Collected Location\nData on Millions of People URL: https://tinyurl.com/yddt2p38 [accessed 2020-03-27]\n31. Panigutti C, Tizzoni M, Bajardi P, Smoreda Z, Colizza V. Assessing the use of mobile phone data to describe recurrent\nmobility patterns in spatial epidemic models. R Soc Open Sci 2017 May 17;4(5):160950 [FREE Full text] [doi:\n10.1098/rsos.160950] [Medline: 28572990]\n32. Abeler J, Bäcker M, Buermeyer U, Zillessen H. COVID-19 Contact Tracing and Data Protection Can Go Together. JMIR\nMhealth Uhealth 2020 Apr 20;8(4):e19359 [FREE Full text] [doi: 10.2196/19359] [Medline: 32294052]\n33. National Information Technology Development Agency. 2019. Nigeria General Data Protection Regulation URL: https:/\n/nitda.gov.ng/ [accessed 2020-04-02]\n34. Ohmukai I, Yamamoto Y, Ito M, Okumura T. arXiv.org. 2020. Tracing patients' PLOD with mobile phones: Mitigation of\nepidemic risks through patients' locational open data URL: http://arxiv.org/abs/2003.06199 [accessed 2020-03-27]\nAbbreviations\n2G: second generation\nCDC: US Centers for Disease Control and Prevention\nCDR: call detail record\nCOVID-19: coronavirus disease\nGDPR: General Data Protection Regulation\nMNO: mobile network operator\nNCDC: Nigeria Centre for Disease Control\nNDPR: National Data Protection Regulation\nSARS-CoV-2: severe acute respiratory syndrome coronavirus 2\nSORMAS: Surveillance, Outbreak Response Management and Analysis System\nWHO: World Health Organization\nEdited by G Eysenbach; submitted 05.04.20; peer-reviewed by T Yasaka, GE Iyawa, D Pförringer; comments to author 16.04.20;\nrevised version received 17.04.20; accepted 19.04.20; published 27.04.20\nPlease cite as:\nEkong I, Chukwu E, Chukwu M\nCOVID-19 Mobile Positioning Data Contact Tracing and Patient Privacy Regulations: Exploratory Search of Global Response\nStrategies and the Use of Digital Tools in Nigeria\nJMIR Mhealth Uhealth 2020;8(4):e19139\nURL: http://mhealth.jmir.org/2020/4/e19139/\ndoi: 10.2196/19139\nPMID: 32310817\n©Iniobong Ekong, Emeka Chukwu, Martha Chukwu. Originally published in JMIR mHealth and uHealth (http://mhealth.jmir.org),\n27.04.2020. This is an open-access article distributed under the terms of the Creative Commons Attribution License\n(https://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium,\nprovided the original work, first published in JMIR mHealth and uHealth, is properly cited. The complete bibliographic information,\na link to the original publication on http://mhealth.jmir.org/, as well as this copyright and license information must be included.\nJMIR Mhealth Uhealth 2020 | vol. 8 | iss. 4 | e19139 | p. 7http://mhealth.jmir.org/2020/4/e19139/\n(page number not for citation purposes)\nEkong et alJMIR MHEALTH AND UHEALTH\nXSL•FO\nRenderX"
}