{
    "title": "Validity Evaluation of Transformer DGA Online Monitoring Data in Grid Edge Systems",
    "url": "https://openalex.org/W3013444895",
    "year": 2020,
    "authors": [
        {
            "id": "https://openalex.org/A5102947051",
            "name": "Jun Jia",
            "affiliations": [
                "Shanghai Electric (China)",
                "Southeast University"
            ]
        },
        {
            "id": "https://openalex.org/A5103393606",
            "name": "Fengbo Tao",
            "affiliations": [
                "Shanghai Electric (China)"
            ]
        },
        {
            "id": "https://openalex.org/A5037622360",
            "name": "Guojiang Zhang",
            "affiliations": [
                "Shanghai Electric (China)"
            ]
        },
        {
            "id": "https://openalex.org/A5102223425",
            "name": "Jin Shao",
            "affiliations": [
                "State Grid Corporation of China (China)"
            ]
        },
        {
            "id": "https://openalex.org/A5101411217",
            "name": "Xinghui Zhang",
            "affiliations": [
                "State Grid Corporation of China (China)"
            ]
        },
        {
            "id": "https://openalex.org/A5100408193",
            "name": "Bo Wang",
            "affiliations": [
                "Wuhan University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2778122813",
        "https://openalex.org/W3008774220",
        "https://openalex.org/W2941060906",
        "https://openalex.org/W2933852482",
        "https://openalex.org/W6750145317",
        "https://openalex.org/W2050921210",
        "https://openalex.org/W2118978333",
        "https://openalex.org/W2979459011",
        "https://openalex.org/W2802552971",
        "https://openalex.org/W2981067452",
        "https://openalex.org/W2991844793",
        "https://openalex.org/W2956324374",
        "https://openalex.org/W1986831525",
        "https://openalex.org/W2165496236",
        "https://openalex.org/W2084880510",
        "https://openalex.org/W2966350350",
        "https://openalex.org/W2799796316",
        "https://openalex.org/W2069633290",
        "https://openalex.org/W2911692934",
        "https://openalex.org/W2919115771",
        "https://openalex.org/W1976242767",
        "https://openalex.org/W2936610935",
        "https://openalex.org/W2957369234",
        "https://openalex.org/W2990125784",
        "https://openalex.org/W2763314014",
        "https://openalex.org/W2977354825",
        "https://openalex.org/W2770198223",
        "https://openalex.org/W2979740536",
        "https://openalex.org/W2797770018",
        "https://openalex.org/W2990250410",
        "https://openalex.org/W2890817474",
        "https://openalex.org/W2971978647",
        "https://openalex.org/W3001151456",
        "https://openalex.org/W2982466638",
        "https://openalex.org/W2974991939",
        "https://openalex.org/W2946627595",
        "https://openalex.org/W2954613285",
        "https://openalex.org/W2784292531",
        "https://openalex.org/W2608946692",
        "https://openalex.org/W2012608140",
        "https://openalex.org/W2127761407",
        "https://openalex.org/W2921392310",
        "https://openalex.org/W2914246346",
        "https://openalex.org/W3009238340",
        "https://openalex.org/W2972609628",
        "https://openalex.org/W2785788383",
        "https://openalex.org/W2981776383",
        "https://openalex.org/W1998300401",
        "https://openalex.org/W2893279648",
        "https://openalex.org/W2899228279",
        "https://openalex.org/W2795362964"
    ],
    "abstract": "Dissolved gas analysis (DGA) is an important method of predicting transformer faults, and the accuracy of DGA measurements is of great significance to the evaluation of the transformer state in grid edge systems. In actual situations, it is difficult to regularly calibrate online DGA monitoring devices in a uniform way. Therefore, this paper proposes a method based on B-EMD and DBN to evaluate the validity of online DGA monitoring data and optimize the corresponding calibration plan. An analysis of actual DGA signals shows that the method proposed in this paper can effectively diagnose faults and improve the reliability of DGA online monitoring devices.",
    "full_text": "SPECIAL SECTION ON CLOUD - FOG - EDGE COMPUTING\nIN CYBER-PHYSICAL-SOCIAL SYSTEMS (CPSS)\nReceived March 4, 2020, accepted March 15, 2020, date of publication March 23, 2020, date of current version April 9, 2020.\nDigital Object Identifier 10.1 109/ACCESS.2020.2982674\nValidity Evaluation of Transformer DGA Online\nMonitoring Data in Grid Edge Systems\nJUN JIA1,2, FENGBO TAO1, GUOJIANG ZHANG3, JIN SHAO4,\nXINGHUI ZHANG4, AND BO WANG\n5\n1Research Institute, State Grid Jiangsu Electric Power Co., Ltd., Jiangsu 210036, China\n2Jiangsu Key Laboratory of Smart Grid Technology and Equipment, School of Electrical Engineering, Southeast University, Jiangsu 210000, China\n3Equipment Department, State Grid Jiangsu Electric Power Co., Ltd., Jiangsu 210036, China\n4Equipment Department, State Grid Corporation of China, Ltd., Beijing 100031, China\n5School of Electrical and Automation Engineering, Wuhan University, Hubei 430072, China\nCorresponding author: Bo Wang (whwdwb@whu.edu.cn)\nThis work was supported in part by the National Key Research and Development Program of China (Technology and Application of Wind\nPower / Photovoltaic Power Prediction for Promoting Renewable Energy Consumption) under Grant 2018YFB0904200 and in part by the\nEponymous Complement S&T Program of State Grid Corporation of China under Grant SGLNDKOOKJJS1800266.\nABSTRACT Dissolved gas analysis (DGA) is an important method of predicting transformer faults, and the\naccuracy of DGA measurements is of great signiﬁcance to the evaluation of the transformer state in grid edge\nsystems. In actual situations, it is difﬁcult to regularly calibrate online DGA monitoring devices in a uniform\nway. Therefore, this paper proposes a method based on B-EMD and DBN to evaluate the validity of online\nDGA monitoring data and optimize the corresponding calibration plan. An analysis of actual DGA signals\nshows that the method proposed in this paper can effectively diagnose faults and improve the reliability of\nDGA online monitoring devices.\nINDEX TERMS Dissolved gas analysis, power transformer, validity evaluation, empirical mode decompo-\nsition, deep belief network.\nI. INTRODUCTION\nPower transformers are one of the most important pieces of\nequipment in a power system, and their operation reliability is\ndirectly related to the safety of the power system. At present,\ndissolved gas analysis (DGA) for transformer oil is an effec-\ntive method of diagnosing transformer defects [1]–[3] and has\nbeen widely used to monitor the state of power transformers.\nHowever, the service life of a DGA online monitoring device\nis far lower than that of the power transformer itself, and\nmost DGA online monitoring devices are installed outdoors,\nwhere the operating environment is harsh. The accuracy of\nDGA is greatly reduced because of the dead oil that results\nfrom unreasonable oil circuit design, the aging of degassing\ndevices, spectrometer deviations and other factors that lead\nto invalid data, thus reducing the reliability and conﬁdence\nof DGA monitoring data.\nCurrently, it is difﬁcult to regularly calibrate online DGA\nmonitoring devices in a uniform way in actual scenarios\ndue to the complexity of on-site calibration and extensive\nprofessional requirements. Therefore, it can be determined\nwhether there are aging or other problems with DGA online\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Xiaokang Wang.\nmonitoring devices by evaluating the validity of oil chro-\nmatography data. In this approach, the calibration and main-\ntenance of high-risk DGA online monitoring devices can be\nprioritized, which is of important signiﬁcance for improv-\ning the accuracy of DGA state monitoring devices and the\noperating safety of the power transformer. In the actual oper-\nation of a power transformer, the ambient temperature and\nrelative humidity, load, oil temperature and other factors\nwill inﬂuence the DGA results both directly and indirectly.\nReference [4] found that the DGA signal itself is complex\nand chaotic and can be obtained by calculating the Lyapunov\nIndex of the signal.\nIn the literature, there have been a large number of\nstudies on dissolved gas signal analysis, mostly focus-\ning on the diagnosis and analysis of power transformer\ndefects [2], [5]–[8]. Few studies have focused on the accu-\nracy of online devices. Currently, support vector machines\nare manly used to improve the accuracy of online DGA\nsignals. Because the corresponding model is too simple and\nrequires ofﬂine data for support, this approach is not fea-\nsible in practical applications. Reference [9]–[14] uses the\nfast-MCD robust analysis method to detect outliers in DGA\nsignals based on the Mahalanobis distance. However, the\ncalibration of the Mahalanobis distance is easily affected by\nVOLUME 8, 2020 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see https://creativecommons.org/licenses/by/4.0/ 60759\nJ. Jiaet al.: Validity Evaluation of Transformer DGA Online Monitoring Data in Grid Edge Systems\nDGA changes in monitoring devices, and such changes in the\neffectiveness of the DGA online monitoring devices tend to\nbe reﬂected in the signal of the DGA changes.\nReference [15] decomposes the defects in DGA online\ndevices into ﬁve types (i.e., ﬁxed deviation, drift deviation,\ntransformation ratio deviation, precision distortion fault and\ncomplete failure defects) to evaluate the effectiveness of DGA\ndata using threshold, variation, and slope criteria, among\nothers. Because of the complexity of DGA signals, however,\nthe methods above tend to cause a large number of false\nstatements and misstatements due to the improper selection\nof parameters [16]–[20].\nTherefore, it is extremely difﬁcult to determine how to\nreduce the impact of monitoring in the analysis of DGA\nsignals. Therefore, this paper proposes a method based\non B-EMD and DBN to evaluate the validity of online\nDGA monitoring data and optimize the calibration scheme.\nAn analysis of actual DGA signals shows that the method pro-\nposed in this paper can effectively diagnose the faults of DGA\nonline monitoring devices and improve device reliability.\nII. INTRINSIC MODEL ANALYSIS OF DGA SIGNAL\nBASED ON B-EMD\nIn analyses of DGA signals, most traditional signal process-\ning methods need to predeﬁne the primary functions (such as\nby Fourier analysis and wavelet analysis). However, the DGA\nsignals collected by online devices are mostly non-stationary\nsignals, and the power spectrum and correlation function are\ntime varying, so it is difﬁcult to select a uniﬁed primary\nfunction for decomposition.\nIn 1998, Huang proposed a new signal processing method\ncalled empirical mode decomposition (EMD). The core idea\nof the EMD method is to decompose non-stationary complex\nsignals into series of intrinsic mode functions (IMFs). Each\nIMF is decomposed based on its own characteristics for the\ngiven signals and contains the local characteristics of the\nsignals at different scales. Because it is not necessary to\npredeﬁne the primary function, the EMD method has high\nadaptability for non-stationary signals. EMD has been used\nin signal detection analysis for power equipment [21]–[26].\nThe calculation process of the standard EMD method is as\nfollows. For input signal x(t), search the all the maximum/\nminimum sequences of x(t), that is, x+(t) and x−(t).\nThen, perform three spline interpolations for the maximum/\nminimum sequences x+(t) and x−(t) separately before\nobtaining the upper/lower envelope curves of the original\ninput signal x(t), which are expressed as e+(t) and e−(t).\nNext, calculate the mean signal m(t) through the following\nformula.\nm(t) =e+(t) +e−(t)\n2 (1)\nThe quasi-signal h(t) = m(t) −x(t) must satisfy the\nfollowing criteria.\n1) The difference between the number of zero crossing\npoints and the number of extreme points should be no greater\nthan one.\n|count(e+(t)) −count(e−(t))|≤1 (2)\n2) At any point in the signals studied, the mean value of\nthe upper and lower envelope curves determined by the local\nmaximum and local minimum points should be less than the\nset threshold SD.\nSD =\nT∑\nt=0\n[hk−1(t) −hk (t)]2\nh2\nk−1(t) (3)\n3) If the quasi-modal signal h(t) has the above two condi-\ntions, h(t) is the ﬁrst IMF component IMF1 of the original\nsignal. Otherwise, x(t) = h(t), and the above steps are\nrepeated.\nThe key step in this method is obtaining the upper and\nlower envelope curves of the original signal. The acquisition\nof the envelope curves is highly dependent on the locations\nof the extreme points of the input signal and the accuracy of\nthe value information. Therefore, the sampling rate should\nbe much higher than the Nyquist frequency of the signal\nto obtain stable and accurate EMD results for a group of\nsignals [24]. However, the sampling rate of DGA signals is\nlow, and because of the acquisition error of the devices, DGA\nsignals are chaotic [4], [5], [27]. The extreme points of the\nsignal are often inaccurate. The sampling error will affect\nthe accuracy of the decomposition results, thus reducing the\naccuracy of the state analysis of the DGA sensors. To address\nthe problem of performing accurate EMD for low-frequency\nsignals, the existing methods mainly consider the interpola-\ntion of signals before relocating the extreme points to reduce\nerrors. References [24], [25], [28] reconstructed the original\nsignal based on interpolation, and reference [29] used ascend-\ning cosine interpolation to extract the envelope curves of the\nsignals. However, sinc interpolation and ascending cosine\ninterpolation have drawbacks such as a slow convergence\nspeed and boundary distortion, making them difﬁcult to apply\nin practice [30]–[36].\nTherefore, this paper proposes a pretreatment method for\nDGA signals based on B-spline ﬁtting. Unlike the traditional\ninterpolation algorithm, the B-spline ﬁtting algorithm is char-\nacterized by the same performance as a low pass ﬁlter and can\neffectively reduce the effect of chaos and improve the stability\nof EMD for small sets of DGA data.\nAssuming that the original DGA data curve is y(t), the ﬁt-\nted curve g(t) of the B-spline of order p can be expressed as\ng(t) =\nn∑\nj=0\ncjBj,p(t) (4)\nwhere cj refers to the B-spline parameter to be deter-\nmined and Bj,p refers to the B-spline function of order p.\nAssuming that the original DGA monitoring sequence is\nu = {u0,u1,u2,··· ,un+p}, the B-spline function Bj,p of\norder p can be calculated using the Cox-deBoor recursive\n60760 VOLUME 8, 2020\nJ. Jiaet al.: Validity Evaluation of Transformer DGA Online Monitoring Data in Grid Edge Systems\nformula [18].\nBj,1(t) =\n{1 uj ≤t ≤uj+1\n0 other (5)\nBj,p(t) = t −uj\nuj+p−1 −uj\nBj,p−1(t)\n+ uj+p −t\nuj+p −uj+1\nBj+1,p+1(t), (p >1) (6)\nThe difference between the ﬁtted curve g(t) of the B-spline\nmethod and the original DGA signals is ε(t).\nε(t) =y(t) −g(t) (7)\nTherefore, the parameters to be determined in B-spline\nﬁtting can be obtained by the least squares of ε(t).\nmin |ε(t)|=min\n(\nε2(t)\n)\n=min(\n∑\nt\n(y(t) −g(t))2)\n=min(\n∑\nt\n(y(t) −\nn∑\nj=0\ncjBj,p(t))\n2\n) (8)\nIdeally, assuming the measured signal is a constant value µ,\nthe signals measured by the DGA monitoring device should\nsatisfy a normal distribution with µ as the mean and σ as\nthe variance (related to the measurement accuracy and aging\ndegree of the DGA device).\nThe sampling frequency of DGA is generally 1-3 times\na day. Because each IMF decomposed by B-EMD can be\nregarded as a narrow-band signal, and when combined with\nthe actual decomposition effect of B-EMD, the error signals\ncaused by the DGA measuring device are mainly distributed\nin IMF1_IMF3, as shown in Fig.1.\nIII. VALIDITY EVALUATION OF DGA SIGNAL\nEFFECTIVENESS BASED ON A DBN NETWORK\nA. CONSTRUCTION OF A VALIDITY EVALUATION\nNETWORK FOR DGA SIGNALS\nA deep belief network (DBN) is a probability-generating\nmodel with multiple hidden layers and is used to evalu-\nate the conditional probability of events [37]–[39], such as\n(P(Observation | Label) and P(Label | Observation), by estab-\nlishing a joint probability distribution between Observation\nand Label. Such networks have already been applied in trans-\nformer fault analysis [1], [40], [41], insulator fault analy-\nsis [42] and fan fault analysis [43]–[47].\nA DBN can pretrain unsupervised labeled samples with a\nlayer-by-layer unsupervised learning algorithm before train-\ning labeled samples to obtain a near-optimal solution for the\nnetwork parameter distribution before ﬁne tuning the data\naccording to the labeled samples to speed up the network\ntraining process.\nStructurally, the DBN can be viewed as a stack of multiple\nRBMs as shown in Fig.2.\nFIGURE 1. Diagram of B-EMD for a DGA Signal.\nFIGURE 2. DBN network schematic diagram.\nVOLUME 8, 2020 60761\nJ. Jiaet al.: Validity Evaluation of Transformer DGA Online Monitoring Data in Grid Edge Systems\nFIGURE 3. RBM structural diagram.\nEach RBM unit consists of a visual layer (v ∈{0, 1}D) and\na hidden layer (h ∈{0, 1}M ), where D and M refer to the\ndimensions of time variables with an energy function deﬁned\nas follows:\nE(v,h;θ) =−\nD∑\ni=1\nM∑\nj=1\nWijvihj −\nD∑\ni=1\nbivi −\nM∑\nj=1\najhj (9)\nwhere the model parameter θ ={W ,b,a}, Wij refers to the\nweight between node vi in the visual layer and node hj in the\nhidden layer, aj and bi are the bias coefﬁcients of the model.\np(v;θ) =p ∗(v;θ)\nZ(θ) = 1\nZ(θ)\n∑\nh\ne−E(v,h;θ) (10)\nZ =\n∑\nv\n∑\nh\ne−E(v,h;θ) (11)\nwhere p∗is the unnormalized probability function and Z(θ)\nis the partitioning function or normalized constant.\nTherefore, a single-layer RBM network can be represented\nas Fig.3.\nBased on EMD and a DBN, the network is divided into\nthree parts: the EMD module, the DBN recognition module\nand the weighted average module.\nBased on B-spline interpolation and the EMD of input\ninformation, the ﬁrst three IMFs IMF1_IMF3 can be\nobtained. Then, each IMFn(n =1,2,3) of ﬁve characteristic\ngases is separately connected to the three independent DBNs.\nFinally, the output results of the DBNs are entered into the\nBP network for weighting factor sorting to obtain the ﬁnal\nresults.\nThe overall structure diagram of the validity analysis of\nDGA monitoring data based on B-EMD and DBN DGA is\nshown in Fig. 4.\nB. TRAINING OF THE VALIDITY EVALUATION NETWORK\nOF DGA SIGNALS\n1) SELECTION OF TRAINING SAMPLES\nThe training sample data from the validity evaluation network\nof DGA signals can be divided into unlabeled sample data and\nlabeled sample data.\nThe unlabeled sample data are mainly derived from the\nactual DGA online monitoring data after eliminating the\nintermittent values, zero values, inﬁnite values and other\nabnormal data.\nFIGURE 4. Structure diagram of validity analysis of DGA monitoring data\nbased on B-EMD and DBN.\nThe labeled samples are mainly derived from the online\nDGA monitoring devices with calibration records and includ-\ning the following data types:\n- The monitoring data from normal transformer DGA\nand qualiﬁed monitoring device calibration (positive\nsamples);\n- The abnormal ofﬂine testing data from transformer\nDGA but for the normal calibration of typical devices\n(positive samples);\n- The data for monitoring devices that are not qualiﬁed for\ncalibration (negative samples).\n2) PRETRAINING PROCESS OF THE DBN\nAccording to Formulas (6) - (8), the conditional probability\ndistribution between the node vi in the visual layer and the\nnode hj in the hidden layer can be expressed as follows.\n\n\n\np(h|v) =∏\nj\np(hj|v)\np(v|h) =∏\ni\np(vi|h) (12)\n\n\n\np(hj =1|v) =σ(∑\ni\nWijvi +aj)\np(vj =1|h) =σ(∑\ni\nWijhi +bj) ,σ(x) = 1\n1 +e−x\n(13)\nAccording to Formulas (7) - (10), the parameter θ in the\nRBM can be obtained by the maximum likelihood function\nof the edge distribution of θthrough p(c,h;θ).\np(v;θ) =1\nZ\n∑\nh\nexp(−E(v,h;θ)) (14)\n60762 VOLUME 8, 2020\nJ. Jiaet al.: Validity Evaluation of Transformer DGA Online Monitoring Data in Grid Edge Systems\nThe training algorithm of the RBM parameters can be\ndescribed as follows:\n\n\n1wij =ε(⟨vihi⟩data −⟨vihi⟩k )\n1bi =ε(⟨vi⟩data −⟨vi⟩k )\n1ai =ε\n(⟨\nhj\n⟩\ndata −\n⟨\nhj\n⟩\nk\n) (15)\nwhere ε() is the learning efﬁciency function; ⟨⟩data is the\nmathematical expectation function of training samples; ⟨⟩k ,\n1wij, 1bi and 1ai are the mathematical expectation function,\nthe updating weight and the updating offset after sub-Gibbs\nsampling k times for the training samples, respectively [48].\nThe entire pretraining process of the DBN can be described\nas follows:\n- Train the RBM in the ﬁrst layer;\n- Use the parameters of the hidden layer in the RBM in\nthe second layer as inputs for the Level 2 RBM;\n- Train the RBM in the second layer.\nThe pretraining of the entire DBN can be completed in the\nsame manner.\n3) FINE-TUNING PROCESS OF THE DBN\nAfter pretraining, the DBN is ﬁne tuned by marking samples.\nThe ﬁne-tuning process is described as follows: the output of\nthe RBM in the last layer of the DBN is taken as the input\nof the back-propagation network and supervised by the back-\npropagation algorithm from back to front [31], [49]–[53].\n4) ENTIRE NETWORK TRAINING PROCESS FOR DGA\nEFFECTIVENESS EVALUATION\nThe entire training process can be described in four stages,\nas shown in Fig. 5.\nIn stage 1, B-spline interpolation and EMD are conducted\non all samples to obtain samples IMF1_IMF3. In stage 2,\nunlabeled decomposition samples IMF1_IMF3 are used to\npretrain DBNs 1-3 according to Formulas (12) - (15).\nIn stage 3, the labeled decomposition samples IMF1_IMF3\nare used to train DBNs 1-3 through the BP algorithm.\nIn stage 4, the labeled samples are diagnosed by the trained\nDBN, and the output results are used as inputs to train the\nweighted factor sorting network through the BP algorithm.\nIV. CASE STUDY\nTo verify the reasonability and validity of the method pro-\nposed in this paper, the recognition accuracy of the deep\nlearning model under different feature extraction mechanisms\nis comparatively analyzed. Moreover, the model structures\nand training parameters are changed for comparative veriﬁ-\ncation and to obtain the optimal validity evaluation model.\nAdditionally, this paper compares the proposed method with\nother methods, such as black box testing and multicriteria\nfusion, to further validate the proposed method.\nA. CASE DESCRIPTION\nThe current DGA online monitoring devices are expected to\ndetect seven characteristic gases, including H2, CH4, C2H4,\nFIGURE 5. Flowchart of DGA signal validity evaluation network training.\nFIGURE 6. Samples of DGA monitoring data using the sliding window\nmethod.\nC2H6, C2H2, CO and CO2. However, the majority of such\ndevices can monitor only ﬁve gases. Hence, monitoring data\nfor H2, CH4, C2H4, C2H6 and C2H2are adopted as inputs.\nA total of 540,000 valid entries recorded by 354 DGA online\nmonitoring devices from 2007 to 2017 were collected (dis-\ncontinuous data, zero values, inﬁnite values and other obvious\nabnormal data were removed). The sliding window method\nwas employed to build a sample base. The sliding window\nlength was 30 days, and the step length was 5 days. As shown\nin Fig. 6, 102,774 valid training samples were obtained.\nThe computer adopted for this research is equipped with\nan 8-core Xeon CPU, a GTX1080 GPU and 32 GB of RAM.\nNotably, 441 sets of DGA online monitoring and calibration\nVOLUME 8, 2020 60763\nJ. Jiaet al.: Validity Evaluation of Transformer DGA Online Monitoring Data in Grid Edge Systems\nFIGURE 7. DGA signal training error Diagrams.\nTABLE 1. Weight settings of source-load double-sided energy prediction tasks.\nFIGURE 8. Accuracy diagram of network training for different levels of\nDBN.\ndata were retrieved from the PMS database. According to\nthe calibration results, there were 4,541 marked samples,\nof which 3,632 were positive samples and 909 were negative\nsamples. The data for various gases in the samples were\ndecomposed. The validity evaluation network was trained\nusing the method proposed in Chapters I and II. The signal\ndecomposition network training error is shown in Fig. 7.\nB. COMPARISON OF DIFFERENT FEATURE\nEXTRACTION MODELS\nThis paper adopts three network feature extraction mecha-\nnisms to test the model based on the same samples, including\nthe DBN, RNN and FCN. The DGA data recognition preci-\nsion of the evaluation models based on three types of feature\nextraction mechanisms is compared. The results are shown\nin Fig. 8.\nTo develop the optimal DBN structure and training param-\neters, this paper compares the model evaluation effects of the\nDGA data for different DBM layers and training cycles. Then,\nthe optimal DBN model can be built according to the practical\ncharacteristics of the input samples.\nThe above ﬁgure shows that after the number of DBN\nmodel layers and number of training cycles reach 4 and\n250, respectively, the model recognition precision tends to\nconverge. At that moment, if the number of model lay-\ners or training cycles increases, the training and testing times\nwill increase, thus decreasing the computational efﬁciency.\nIn addition, considering its use in practical situations and the\ndata analyzed in this paper, a four-layer DBN model with\n250 training cycles is adopted.\nThe method proposed in this paper is also compared with\nthe phase-space reconstruction method discussed in [4], [54],\n[55] and the black box testing and multicriteria fusion strat-\negy given in [15], [45] to verify the validity of the method\ndeveloped in this paper. The comparison results are shown\nin Table 1.\nAs shown in Table 1, the model proposed in this paper\nexhibits the highest precision in recognizing fault samples.\nConsidering the weak generalization of the black box testing\nand multicriteria fusion strategy, the tagged value and the\nvariable coefﬁcient judgment criteria should be artiﬁcially\nselected. The validity evaluation model proposed in this\npaper adopts the DBN model feature extraction mechanism,\nwhich can automatically extract DGA monitoring data fea-\ntures under different fault and normal operation situations\nfrom mass samples. In this way, the inﬂuence caused by\nimproper artiﬁcial feature selection can be avoided. Addition-\nally, the generalization of the model is improved compared to\nthat of other models.\nCurrently, periodical overhauling is typically adopted for\nthe daily calibration and maintenance of DGA online moni-\ntoring devices. Due to the lack of ability to efﬁciently evaluate\nthe actual operation status of monitoring devices, the main-\ntenance and repair objects are, to some extent, random.\nIn response to this problem, this paper proposes a strategy for\n60764 VOLUME 8, 2020\nJ. Jiaet al.: Validity Evaluation of Transformer DGA Online Monitoring Data in Grid Edge Systems\nFIGURE 9. Visual comparison of t-SNE for different layers of the DBN data.\nDGA device predictive maintenance. In light of the validity\nevaluation model, this method analyzes the health status of\nthe corresponding DGA devices and provides auxiliary deci-\nsion making for device calibration planning.\nVOLUME 8, 2020 60765\nJ. Jiaet al.: Validity Evaluation of Transformer DGA Online Monitoring Data in Grid Edge Systems\nAfter model decomposition and the feature extraction of\nDGA monitoring data via B-EMD and the DBN, this paper\nuses the weighting factor network to classify monitoring\ndevices into different grades. According to the corresponding\nfault type of training samples and the feature vectors extracted\nby the model, the health status of a DGA online monitor-\ning device is deﬁned as follows: (1) dangerous: when the\nfault conﬁdence coefﬁcient is above 90%, repair and main-\ntenance are necessary; (2) alarming: when the fault conﬁ-\ndence coefﬁcient ranges from 80% to 90%, the device should\nbe included in the repair and maintenance plan; (3) hidden\ndanger: the fault conﬁdence coefﬁcient ranges from 70%\nto 80%; (4) potential hidden danger: the fault conﬁdence\ncoefﬁcient ranges from 60% to 70%; and (5) safe: the fault\nconﬁdence coefﬁcient is below 60%. The grade evaluation\nresults after sample dimension reduction and the mapping of\nthe weighting factor network are shown in Fig. 9.\nV. PREDICTIVE MAINTENANCE OF TRANSIFORMER DGA\nONLINE MONITORING DEVICES\nBased on the fault conﬁdence coefﬁcient evaluation per-\nformed by the model, this paper proposes an optimized plan\nfor online monitoring device calibration. Below are the details\nof the optimization strategy.\n(1) Choose the DGA monitoring data for the corresponding\nperiod according to the repair period.\nConduct data preprocessing. Remove discontinuous data,\nzero values, inﬁnite values, and other obvious abnormal data.\nDirectly include the transformer monitoring device for which\nthe abnormal data correspond to the calibration plan.\n(2) Input data into the validity evaluation model of the\nDGA online monitoring devices. Calculate the fault conﬁ-\ndence coefﬁcient of the corresponding DGA transformer in\nvarious periods of time and determine the health grade of the\nDGA monitoring device.\n(3) Report the DGA device fault analysis results to the\nrepair and calibration personnel to provide assistance in the\nimplementation of the calibration plan.\n(4) The optimization strategy proposed in this paper for the\ndevice calibration plan can improve the overhaul probability\nof DGA monitoring devices with potential hidden dangers to\nsome extent and reduce the randomness and blindness of the\nmaintenance schedule, thus improving the reliability of DGA\nonline monitoring devices.\nVI. CONCLUSION\nIn this paper, an EMD method for DGA signals based on\nB-spline interpolation and a validity analysis network for\nDGA data based on deep learning is proposed. This approach\ncan effectively improve the stability of EMD at low sampling\nrates for DGA signals and classify the effectiveness of DGA\nonline monitoring devices. An optimization method for the\nDGA calibration plan is proposed according to the validity\ncalculation results of DGA. The experimental results demon-\nstrate the effectiveness of the method proposed in this paper.\nREFERENCES\n[1] M. Duval, ‘‘Dissolved gas analysis: It can save your transformer,’’ IEEE\nElect. Insul. Mag., vol. 5, no. 6, pp. 22–27, Nov. 1989.\n[2] J. L. Guardado, J. L. Naredo, P. Moreno, and C. R. Fuerte, ‘‘A comparative\nstudy of neural network efﬁciency in power transformers diagnosis using\ndissolved gas analysis,’’ IEEE Power Eng. Rev., vol. 21, no. 7, p. 71,\nJul. 2001.\n[3] J. Faiz and M. Soleimani, ‘‘Dissolved gas analysis evaluation in electric\npower transformers using conventional methods a review,’’ IEEE Trans.\nDielectr. Electr. Insul., vol. 24, no. 2, pp. 1239–1248, Apr. 2017.\n[4] P. Zhang, B. Qi, Z. Rong, and X. Li, ‘‘Optimal dissolved gas analysis data\nset selection based on phase space reconstruction,’’ in Proc. IEEE Conf.\nElectr. Insul. Dielectr. Phenomenon (CEIDP), Oct. 2017, pp. 229–232.\n[5] Q. Su, C. Mi, L. L. Lai, and P. Austin, ‘‘A fuzzy dissolved gas analysis\nmethod for the diagnosis of multiple incipient faults in a transformer,’’\nIEEE Trans. Power Syst., vol. 15, no. 2, pp. 593–598, May 2000.\n[6] C. E. Lin, J.-M. Ling, and C.-L. Huang, ‘‘An expert system for transformer\nfault diagnosis using dissolved gas analysis,’’ IEEE Trans. Power Del.,\nvol. 8, no. 1, pp. 231–238, Jan. 1993.\n[7] F. U. Din, A. Ahmad, H. Ullah, A. Khan, T. Umer, and S. Wan, ‘‘Efﬁcient\nsizing and placement of distributed generators in cyber-physical power\nsystems,’’J. Syst. Archit., vol. 97, pp. 197–207, Aug. 2019.\n[8] Q. Zhang, S. Wan, B. Wang, D. W. Gao, and H. Ma, ‘‘Anomaly detection\nbased on random matrix theory for industrial power systems,’’ J. Syst.\nArchit., vol. 95, pp. 67–74, May 2019.\n[9] G. Casolla, S. Cuomo, V . S. D. Cola, and F. Piccialli, ‘‘Exploring unsu-\npervised learning techniques for the Internet of Things,’’ IEEE Trans. Ind.\nInformat., vol. 16, no. 4, pp. 2621–2628, Apr. 2020.\n[10] X. Wang, L. T. Yang, Y . Wang, X. Liu, Q. Zhang, and M. J. Deen, ‘‘A dis-\ntributed tensor-train decomposition method for cyber-physical-social ser-\nvices,’’ACM Trans. Cyber-Phys. Syst., vol. 3, no. 4, pp. 1–15, Oct. 2019.\n[11] L. Qi, X. Zhang, W. Dou, C. Hu, C. Yang, and J. Chen, ‘‘A two-stage\nlocality-sensitive hashing based approach for privacy-preserving mobile\nservice recommendation in cross-platform edge environment,’’ Future\nGener. Comput. Syst., vol. 88, pp. 636–643, Nov. 2018.\n[12] S. Wan, Y . Zhao, T. Wang, Z. Gu, Q. H. Abbasi, and K. K. R. Choo, ‘‘Multi-\ndimensional data indexing and range query processing via V oronoi diagram\nfor Internet of Things,’’ Future Gener. Comput. Syst., vol. 91, pp. 382–391,\n2019.\n[13] F. Piccialli, S. Cuomo, V . S. di Cola, and G. Casolla, ‘‘A machine learning\napproach for IoT cultural data,’’ J. Ambient Intell. Hum. Comput., pp. 1-12,\n2019.\n[14] X. Xu, R. Mo, F. Dai, W. Lin, S. Wan, and W. Dou, ‘‘Dynamic resource\nprovisioning with fault tolerance for data-intensive meteorological work-\nﬂows in cloud,’’ IEEE Trans. Ind. Informat., early access, Dec. 11, 2019,\ndoi: 10.1109/TII.2019.2959258.\n[15] Q. Bo, P. Zhang, and R. Zhihai, ‘‘Validity assessment method of dga\nsensors based on data driven and multiple criterion integration,’’ Power\nSyst. Technol., vol. 41, no. 11, pp. 3662–3669, 2017.\n[16] M. A. Rahman, M. Y . Mukta, A. Yousuf, A. T. Asyhari, M. Z. A. Bhuiyan,\nand C. Y . Yaakub, ‘‘IoT based hybrid green energy driven highway lighting\nsystem,’’ in Proc. IEEE Int. Conf. Dependable, Auton. Secure Comput.,\nInt. Conf. Pervas. Intell. Comput., Int. Conf. Cloud Big Data Comput., Int.\nConf. Cyber Sci. Technol. Congr. (DASC/PiCom/CBDCom/CyberSciTech),\nAug. 2019, pp. 587–594.\n[17] X. Xu, C. He, Z. Xu, L. Qi, S. Wan, and M. Z. A. Bhuiyan,\n‘‘Joint optimization of ofﬂoading utility and privacy for edge computing\nenabled IoT,’’ IEEE Internet Things J., early access, Sep. 26, 2019, doi:\n10.1109/JIOT.2019.2944007.\n[18] L. Qi, Y . Chen, Y . Yuan, S. Fu, X. Zhang, and X. Xu, ‘‘A QoS-aware\nvirtual machine scheduling method for energy conservation in cloud-based\ncyber-physical systems,’’ World Wide Web, vol. 23, no. 2, pp. 1275–1297,\nMar. 2020.\n[19] X. Wang, L. T. Yang, H. Li, M. Lin, J. Han, and B. O. Apduhan, ‘‘NQA:\nA nested anti-collision algorithm for RFID systems,’’ ACM Trans. Embed-\nded Comput. Syst., vol. 18, no. 4, pp. 1–21, Jul. 2019.\n[20] S. Ding, S. Qu, Y . Xi, and S. Wan, ‘‘Stimulus-driven and concept-driven\nanalysis for image caption generation,’’ Neurocomputing, early access,\nJul. 27, 2019, doi: 10.1016/j.neucom.2019.04.095.\n[21] Proc. Roy. Soc. London, Math., Phys. Eng. Sci., pp. 29–111, 1905.\n[22] W. Gong, L. Qi, and Y . Xu, ‘‘Privacy-aware multidimensional mobile\nservice quality prediction and recommendation in distributed fog environ-\nment,’’Wireless Commun. Mobile Comput., vol. 2018, pp. 1–8, Apr. 2018.\n60766 VOLUME 8, 2020\nJ. Jiaet al.: Validity Evaluation of Transformer DGA Online Monitoring Data in Grid Edge Systems\n[23] X. Xu, Y . Xue, L. Qi, Y . Yuan, X. Zhang, T. Umer, and S. Wan, ‘‘An edge\ncomputing-enabled computation ofﬂoading method with privacy preser-\nvation for Internet of connected vehicles,’’ Future Gener. Comput. Syst.,\nvol. 96, pp. 89–100, Jul. 2019.\n[24] Z. Xu, B. Huang, and F. Zhang, ‘‘Improvement of empirical mode decom-\nposition under low sampling rate,’’ Signal Process., vol. 89, no. 11,\npp. 2296–2303, Nov. 2009.\n[25] A. Roy and J. F. Doherty, ‘‘Improved signal analysis performance at\nlow sampling rates using raised cosine empirical mode decomposition,’’\nElectron. Lett., vol. 46, no. 2, pp. 176–177, 2010.\n[26] Y . LeCun, Y . Bengio, and G. Hinton, ‘‘Deep learning,’’ Nature, vol. 521,\nno. 7553, p. 436, 2015.\n[27] R. Zhang, P. Xie, C. Wang, G. Liu, and S. Wan, ‘‘Classifying transporta-\ntion mode and speed from trajectory data via deep multi-scale learning,’’\nComput. Netw., vol. 162, Oct. 2019, Art. no. 106861.\n[28] S. Wan and S. Goudos, ‘‘Faster R-CNN for multi-class fruit detection\nusing a robotic vision system,’’ Comput. Netw., vol. 168, Feb. 2020,\nArt. no. 107036.\n[29] Q. Chen, N. Huang, S. Riemenschneider, and Y . Xu, ‘‘A B-spline approach\nfor empirical mode decompositions,’’ Adv. Comput. Math., vol. 24,\nnos. 1–4, pp. 171–195, Jan. 2006.\n[30] M. Unser, A. Aldroubi, and M. Eden, ‘‘B-spline signal process-\ning. I. Theory,’’ IEEE Trans. Signal Process., vol. 41, no. 2, pp. 821–833,\nFeb. 1993.\n[31] M. A. Rahman, M. M. Hasan, A. T. Asyhari, and M. Z. A. Bhuiyan,\n‘‘A 3D-collaborative wireless network: Towards resilient communication\nfor rescuing ﬂood victims,’’ in Proc. IEEE 15th Int. Conf. Depend-\nable, Auton. Secure Comput., 15th Int. Conf. Pervas. Intell. Comput.,\n3rd Int. Conf. Big Data Intell. Comput. Cyber Sci. Technol. Congr.\n(DASC/PiCom/DataCom/CyberSciTech), Nov. 2017, pp. 385–390.\n[32] W. Wei, M. A. Rahman, I. F. Kurniawan, A. T. Asyhari, S. M. N. Sadat,\nand L. Yao, ‘‘Immune genetic algorithm optimization and integration of\nlogistics network terminal resources,’’ in Proc. 3rd IEEE Int. Conf. Robot.\nComput. (IRC), Feb. 2019, pp. 435–436.\n[33] X. Xu, Q. Liu, X. Zhang, J. Zhang, L. Qi, and W. Dou, ‘‘A blockchain-\npowered crowdsourcing method with privacy preservation in mobile envi-\nronment,’’IEEE Trans. Comput. Social Syst., vol. 6, no. 6, pp. 1407–1419,\nDec. 2019.\n[34] H. Liu, H. Kou, C. Yan, and L. Qi, ‘‘Link prediction in paper citation net-\nwork to construct paper correlation graph,’’ EURASIP J. Wireless Commun.\nNetw., vol. 2019, no. 1, pp. 1–12, Dec. 2019.\n[35] X. Wang, W. Wang, L. T. Yang, S. Liao, D. Yin, and M. J. Deen, ‘‘A dis-\ntributed HOSVD method with its incremental computation for big data in\ncyber-physical-social systems,’’ IEEE Trans. Comput. Social Syst., vol. 5,\nno. 2, pp. 481–492, Jun. 2018.\n[36] S. Wan, Z. Gu, and Q. Ni, ‘‘Cognitive computing and wireless commu-\nnications on the edge for healthcare service robots,’’ Comput. Commun.,\nvol. 149, pp. 99–106, Jan. 2020.\n[37] H. He and E. A. Garcia, ‘‘Learning from imbalanced data,’’ IEEE Trans.\nKnowl. Data Eng., vol. 21, no. 9, pp. 1263–1284, Sep. 2009.\n[38] S. Wan, Y . Xia, L. Qi, Y .-H. Yang, and M. Atiquzzaman, ‘‘Automated\ncolorization of a grayscale image with seed points propagation,’’ IEEE\nTrans. Multimedia, early access, Feb. 28, 2020, doi: 10.1109/TMM.\n2020.2976573.\n[39] A. Salehi Fathabadi, M. J. Butler, S. Yang, L. A. Maeda-Nunez, J. Bantock,\nB. M. Al-Hashimi, and G. V . Merrett, ‘‘A model-based framework for\nsoftware portability and veriﬁcation in embedded power management\nsystems,’’J. Syst. Archit., vol. 82, pp. 12–23, Jan. 2018.\n[40] L. Qi, X. Zhang, S. Li, S. Wan, Y . Wen, and W. Gong, ‘‘Spatial-temporal\ndata-driven service recommendation with privacy-preservation,’’ Inf. Sci.,\nvol. 515, pp. 91–102, Apr. 2020.\n[41] X. Shi, Y . Zhu, C. Sa, L. Wang, and G. Sun, ‘‘Power transformer fault\nclassifying model based on deep belief network,’’ Power Syst. Protection\nControl, vol. 44, no. 1, pp. 71–76, 2016.\n[42] G. Qiang, Y . Wu, and L. Qian, ‘‘A faulted insulator identiﬁcation algorithm\nof sparse difference-based deep belief network,’’ Elect. Meas. Instrum.,\nno. 1, p. 4, 2016.\n[43] L. Xiuli, Z. Xueying, and W. Liyong, ‘‘Fault diagnosis method of wind\nturbine gearbox based on deep belief network and vibration signal,’’ in\nProc. 57th Annu. Conf. Soc. Instrum. Control Eng. Jpn. (SICE), Sep. 2018,\npp. 1699–1704.\n[44] G. M. Gu and X. Zhang, ‘‘Structural damage identiﬁcation of wind turbine\nblade based on deep belief networks,’’ J. Gansu Agricult. Univ., no. 4, p. 22,\n2016.\n[45] B. Wang, H. Ma, X. Wang, G. Deng, Y . Yang, and S. Wan, ‘‘Vulnerability\nassessment method for cyber-physical system considering node hetero-\ngeneity,’’J. Supercomput., pp. 1–21, Oct. 2019, doi: 10.1007/s11227-019-\n03027-w.\n[46] Y .-W. Zhang, Y .-Y . Zhou, F.-T. Wang, Z. Sun, and Q. He, ‘‘Service rec-\nommendation based on quotient space granularity analysis and covering\nalgorithm on spark,’’ Knowl.-Based Syst., vol. 147, pp. 25–35, May 2018.\n[47] S. Singh and S. Tripathi, ‘‘SLOPE: Secure and load optimized packet\nscheduling model in a grid environment,’’ J. Syst. Archit., vol. 91,\npp. 41–52, Nov. 2018.\n[48] C. Lawrence, S. Altschul, M. Boguski, J. Liu, A. Neuwald, and J. Wootton,\n‘‘Detecting subtle sequence signals: A gibbs sampling strategy for multiple\nalignment,’’Science, vol. 262, no. 5131, pp. 208–214, Oct. 1993.\n[49] Z. Gao, Y . Li, and S. Wan, ‘‘Exploring deep learning for view-based\n3D model retrieval,’’ ACM Trans. Multimedia Comput., Commun., Appl.,\nvol. 16, no. 1, pp. 1–21, Mar. 2020.\n[50] Z. Gao, H.-Z. Xuan, H. Zhang, S. Wan, and K.-K.-R. Choo, ‘‘Adaptive\nfusion and category-level dictionary learning model for multiview human\naction recognition,’’ IEEE Internet Things J., vol. 6, no. 6, pp. 9280–9293,\nDec. 2019.\n[51] N. Eltayieb, R. Elhabob, A. Hassan, and F. Li, ‘‘An efﬁcient attribute-\nbased online/ofﬂine searchable encryption and its application in cloud-\nbased reliable smart grid,’’ J. Syst. Archit., vol. 98, pp. 165–172, Sep. 2019.\n[52] X. Wang, L. T. Yang, X. Xie, J. Jin, and M. J. Deen, ‘‘A cloud-edge\ncomputing framework for cyber-physical-social services,’’ IEEE Commun.\nMag., vol. 55, no. 11, pp. 80–85, Nov. 2017.\n[53] F. Piccialli, G. Casolla, S. Cuomo, F. Giampaolo, and V . S. di Cola,\n‘‘Decision making in IoT environment through unsupervised learning,’’\nIEEE Intell. Syst., vol. 35, no. 1, pp. 27–35, Jan. 2020.\n[54] L. Qi, X. Zhang, W. Dou, and Q. Ni, ‘‘A distributed locality-sensitive\nhashing-based approach for cloud service recommendation from multi-\nsource data,’’IEEE J. Sel. Areas Commun., vol. 35, no. 11, pp. 2616–2624,\nNov. 2017.\n[55] B. Wang, L. Zhang, H. Ma, H. Wang, and S. Wan, ‘‘Parallel LSTM-based\nregional integrated energy system multienergy source-load information\ninteractive energy prediction,’’Complexity, vol. 2019, pp. 1–13, Nov. 2019.\nJUN JIAis currently pursuing the Ph.D. degree in\npower system with Southeast University, Nanjing,\nChina. He is working at the Research Institute,\nState Grid Jiangsu Electric Power Company, Ltd.,\nJiangsu, China. His research interests include\npower system online assessment, big data, inte-\ngrated energy systems, and smart city.\nFENGBO TAOreceived the Ph.D. degree in elec-\ntrical engineering from Xi’an Jiaotong University,\nXi’an, China. He is working at the Research Insti-\ntute, State Grid Jiangsu Electric Power Company,\nLtd., Jiangsu, China. His research interests include\nhigh voltage and insulation equipment.\nGUOJIANG ZHANG received the Ph.D. degree\nin electrical engineering from Zhejiang Univer-\nsity, Hangzhou, China. He is working at the\nEquipment Department, State Grid Jiangsu Elec-\ntric Power Company, Ltd. His research interests\ninclude power system online assessment and big\ndata.\nVOLUME 8, 2020 60767\nJ. Jiaet al.: Validity Evaluation of Transformer DGA Online Monitoring Data in Grid Edge Systems\nJIN SHAO received the master’s degree in elec-\ntrical engineering from Chongqing University,\nChongqing, China. He is working at the Equip-\nment Department, State Grid Corporation of\nChina, Ltd. His research interests include high\nvoltage and insulation equipment.\nXINGHUI ZHANG received the master’s degree\nin electrical engineering from Southeast Uni-\nversity, Nanjing, China. He is working at the\nEquipment Department, State Grid Corporation\nof China, Ltd. His research interests include\npower system online assessment and big data.\nBO WANGreceived the Ph.D. degree in computer\nscience from Wuhan University, Wuhan, China,\nin 2006. He was a Postdoctoral Researcher with\nthe School of Electrical Engineering, Wuhan Uni-\nversity, from 2007 to 2009. He is currently an\nAssociate Professor with the School of Electri-\ncal Engineering, Wuhan University. His research\ninterests include power system online assessment,\nbig data, integrated energy systems, and smart city.\n60768 VOLUME 8, 2020"
}