{
  "title": "Experimental Study on the Burning Characteristics of Transformer Oil Pool Fires",
  "url": "https://openalex.org/W3011008185",
  "year": 2020,
  "authors": [
    {
      "id": "https://openalex.org/A2098881448",
      "name": "Jinlong Zhao",
      "affiliations": [
        "China University of Mining and Technology",
        "University of Ulster"
      ]
    },
    {
      "id": "https://openalex.org/A2768210896",
      "name": "Shansheng Wang",
      "affiliations": [
        "China University of Mining and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2096754531",
      "name": "Jianping Zhang",
      "affiliations": [
        "University of Ulster"
      ]
    },
    {
      "id": "https://openalex.org/A2047826570",
      "name": "Rui Zhou",
      "affiliations": [
        "Tsinghua University"
      ]
    },
    {
      "id": "https://openalex.org/A2111018549",
      "name": "Rui Yang",
      "affiliations": [
        "Tsinghua University"
      ]
    },
    {
      "id": "https://openalex.org/A2098881448",
      "name": "Jinlong Zhao",
      "affiliations": [
        "China University of Mining and Technology",
        "University of Ulster"
      ]
    },
    {
      "id": "https://openalex.org/A2768210896",
      "name": "Shansheng Wang",
      "affiliations": [
        "China University of Mining and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2096754531",
      "name": "Jianping Zhang",
      "affiliations": [
        "University of Ulster"
      ]
    },
    {
      "id": "https://openalex.org/A2047826570",
      "name": "Rui Zhou",
      "affiliations": [
        "Tsinghua University"
      ]
    },
    {
      "id": "https://openalex.org/A2111018549",
      "name": "Rui Yang",
      "affiliations": [
        "Tsinghua University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2140417752",
    "https://openalex.org/W1982994921",
    "https://openalex.org/W2112222310",
    "https://openalex.org/W1983179715",
    "https://openalex.org/W2029050432",
    "https://openalex.org/W2039110117",
    "https://openalex.org/W1993482590",
    "https://openalex.org/W2086165113",
    "https://openalex.org/W2749856080",
    "https://openalex.org/W2971365699",
    "https://openalex.org/W2047809873",
    "https://openalex.org/W2909827167",
    "https://openalex.org/W2773040493",
    "https://openalex.org/W2492248215",
    "https://openalex.org/W2800601875",
    "https://openalex.org/W2059346076",
    "https://openalex.org/W2565657516",
    "https://openalex.org/W2117070213",
    "https://openalex.org/W1995475224",
    "https://openalex.org/W1973481596",
    "https://openalex.org/W1993208154",
    "https://openalex.org/W2199157794",
    "https://openalex.org/W2776342187",
    "https://openalex.org/W2072603133",
    "https://openalex.org/W2031628313",
    "https://openalex.org/W1987784698",
    "https://openalex.org/W2006639371",
    "https://openalex.org/W2003761899",
    "https://openalex.org/W2029459068",
    "https://openalex.org/W2994814441",
    "https://openalex.org/W2736134973",
    "https://openalex.org/W2071900845",
    "https://openalex.org/W2036165365",
    "https://openalex.org/W2048756136",
    "https://openalex.org/W1988378002",
    "https://openalex.org/W2792963816",
    "https://openalex.org/W2008726813",
    "https://openalex.org/W2087563598",
    "https://openalex.org/W2107027019",
    "https://openalex.org/W4386041593",
    "https://openalex.org/W3156207584",
    "https://openalex.org/W2325436362"
  ],
  "abstract": "This paper examines experimentally the burning behaviors of transformer oil pool fires. A series of transformer oil pool fire tests with different pool diameters (0.2-1 m) were conducted. The mass burning rate, flame height, liquid layer temperature, flame temperature, and radiative heat flux were measured and analyzed. A new correlation for the mass burning rate as a function of pool diameter is deduced. The experimental flame height is compared to existing correlations, and it is found that the present result is in better agreement with those deduced for heavy oils. The liquid temperature results show that the fuel layer consists of a boiling layer and a gradient layer, and the thickness of the boiling layer is found to be around 2.6 mm independent of the pool diameter. The flame temperature is also analyzed and three zones are observed, for which a piecewise function is deduced. The radiation fraction and the emissive power of the flame are determined, respectively, based on the source flame model and solid flame model, and an exponential decay of the radiation fraction as a function of pool diameter is obtained. The present results are important for estimation of thermal radiation from a pool fire on the surrounding objects in practical transformer oil fires.",
  "full_text": " \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nExperimental Study on the Burning Characteristics of Transformer Oil Pool Fires\nZhao, J., Wang, S., Zhang, J., Zhou, R., & Yang, R. (2020). Experimental Study on the Burning Characteristics\nof Transformer Oil Pool Fires. Energy and Fuels, 34(4), 4967-4976.\nhttps://doi.org/10.1021/acs.energyfuels.0c00175\nLink to publication record in Ulster University Research Portal\nPublished in:\nEnergy and Fuels\nPublication Status:\nPublished (in print/issue): 16/04/2020\nDOI:\n10.1021/acs.energyfuels.0c00175\nDocument Version\nAuthor Accepted version\nGeneral rights\nThe copyright and moral rights to the output are retained by the output author(s), unless otherwise stated by the document licence.\nUnless otherwise stated, users are permitted to download a copy of the output for personal study or non-commercial research and are\npermitted to freely distribute the URL of the output. They are not permitted to alter, reproduce, distribute or make any commercial use of the\noutput without obtaining the permission of the author(s).\nIf the document is licenced under Creative Commons, the rights of users of the documents can be found at\nhttps://creativecommons.org/share-your-work/cclicenses/.\nTake down policy\nThe Research Portal is Ulster University's institutional repository that provides access to Ulster's research outputs. Every effort has been\nmade to ensure that content in the Research Portal does not infringe any person's rights, or applicable UK laws. If you discover content in\nthe Research Portal that you believe breaches copyright or violates any law, please contact pure-support@ulster.ac.uk\nDownload date: 05/11/2025\nSubscriber access provided by University of Ulster Library\nis published by the American Chemical Society. 1155 Sixteenth Street N.W.,\nWashington, DC 20036\nPublished by American Chemical Society. Copyright © American Chemical Society.\nHowever, no copyright claim is made to original U.S. Government works, or works\nproduced by employees of any Commonwealth realm Crown government in the course\nof their duties.\nCombustion\nExperimental study on the burning characteristics of transformer oil pool fires\nJinlong Zhao, Wang Shansheng, Jianping Zhang, Rui Zhou, and Rui Yang\nEnergy Fuels, Just Accepted Manuscript • DOI: 10.1021/acs.energyfuels.0c00175 • Publication Date (Web): 16 Mar 2020\nDownloaded from pubs.acs.org on March 18, 2020\nJust Accepted\n“Just Accepted” manuscripts have been peer-reviewed and accepted for publication. They are posted\nonline prior to technical editing, formatting for publication and author proofing. The American Chemical\nSociety provides “Just Accepted” as a service to the research community to expedite the dissemination\nof scientific material as soon as possible after acceptance. “Just Accepted” manuscripts appear in\nfull in PDF format accompanied by an HTML abstract. “Just Accepted” manuscripts have been fully\npeer reviewed, but should not be considered the official version of record. They are citable by the\nDigital Object Identifier (DOI®). “Just Accepted” is an optional service offered to authors. Therefore,\nthe “Just Accepted” Web site may not include all articles that will be published in the journal. After\na manuscript is technically edited and formatted, it will be removed from the “Just Accepted” Web\nsite and published as an ASAP article. Note that technical editing may introduce minor changes\nto the manuscript text and/or graphics which could affect content, and all legal disclaimers and\nethical guidelines that apply to the journal pertain. ACS cannot be held responsible for errors or\nconsequences arising from the use of information contained in these “Just Accepted” manuscripts.\nExperimental study on the burning characteristics of transformer oil \np\nool fires\nJinlong Zhaoa,b*, Shansheng Wanga, Jianping Zhangb, Rui Zhouc , Rui Yangc\na. School of Emergency Management & Safety Engineering, China University of \nMining & Technology, Beijing, China\nb. FireSERT, Belfast School of Architecture and the Built Environment, Ulster \nUniversity, Newtownabbey, BT37 0QB, United Kingdom\nc. Institute of Public Safety Research, Department of Engineering Physics, Tsinghua \nUniversity, Beijing, China\nABSTRACT: This paper examines experimentally the burning behaviors of \ntransformer oil pool fires. A series of transformer oil pool fire tests with different pool \ndiameters (0.2~1m) was conducted. The mass burning rate, flame height, liquid layer \ntemperature, flame temperature, and radiative heat flux were measured and analyzed. \nA new correlation for the mass burning rate as a function of pool diameter is deduced. \nThe experimental flame height is compared to existing correlations and it is found that \nthe present result is in better agreement with those deduced for heavy oils. The liquid \ntemperature results show that the fuel layer consists of a boiling layer and a gradient \nlayer, and the thickness of the boiling layer is found to be around 2.6 mm independent \nof the pool diameter. The flame temperature is also analyzed and three zones are \nobserved, for which a piecewise function is deduced. The radiation fraction and the \nemissive power of the flame are determined respectively based on the source flame \nmodel and solid flame model, and an exponential decay of the radiation fraction as a \nfunction of pool diameter is obtained. The present results are important for estimation \nof thermal radiation from a pool fire on the surrounding objects in practical \ntransformer oil fires.\nKey Words: transformer fires; burning rate; flame height; temperature profile; \nradiation\nPage 1 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n1. INTRODUCTION\nA\n wide variety of oil-immersed transformers is commonly used in electrical power \ndelivery networks1. During the conversion of voltage, heat will be produced, and the \ntransformer oil is usually used to cool down the transformers 2. As transformer oils \nare highly flammable, fire accidents or even boil-over can be triggered by external \nconditions, such as lightning strikes, switching transients, short-circuits, or other \nincidents1. The common probability of (0.04~0.25)% per year was used in the fire \nhazard analysis3. The development of transformer fire accidents was categorized into \nfour stages: arc forming, oil pyrolysis, overpressure and equipment cracking 4. After \nthe cracking, the oil will overflow under gravity and then form a large burning area in \nthe oil pit, which poses a great hazard to the nearby persons and equipment. This has \nbeen demonstrated in a serious transformer oil fire accident that occurred in \nDecember 22, 2019 in Jinan (a Chinese city) 5. It was reported that the transformer oil \nleaked from the box and then formed a pool fire accident after the deflagration, which \nresulted in one fatality and two injuries5. \nThe transformer fire hazard is closely associated with the transformer oil burning \ncharacteristics6. There has been considerable research describing the burning \nbehaviors of hydrocarbon fuels, including heat feedback 7, mass burning rate 8,9, flame \nheight10, etc. The mass burning rate, as one of the key parameters, depends on the \npool size through a change of heat feedback from the flame to the fuel surface 7. The \nheat feedback mechanism has been categorized into three regimes: conduction \ncontrolled (D<0.1m), convection controlled (0.1m<D<0.2m) and radiation controlled \n(D>0.2m)9,11. In practical fire accidents, the burning is usually controlled by radiation \ndue to their large pool diameters. Burgess et al. 11 derived an empirical correlation to \ncalculate the burning rate of a pool fire (  for large-scale burning, \n\u0003\u0004(1 \u0007\b\u0007\t\n\u000b)\nwhere  is the mass burning rate of an infinite pool diameter;  is a const ant for \u0003\u0004 \t\nfuels; D is the burning diameter). Subsequently Babrauskas 9 provided the detail \nvalues ( , ) for some fuels, including those of the transformer oil (\u0003\u0004  \t \n \u0003\u0004\n=0.039g/(m2s ), =0.7m -1)12. These values have been widely used in some  \t \napplications13, 14, however it is important to note that they were derived from \nPage 2 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nexperimental data with only two pool diameters (D=1.2m and D=1.7m) for \nt\nransformer oil pool fires 9. In recent years, the values of  and  have been \u0003\u0004 \t\nconstantly updated with new experimental data for some fuels, such as gas oline and \nkerosene8,13, however these for transformer oils have not been due to a lack of \nexperimental data. Therefore the burning rate as a function of pool diameter for \ntransformer oil is still unclear and needs to be further examined given its importance \nin the determination of flame height, radiation fraction and other important \ncombustion characteristics such as heat release rate and flame temperature and \nvelocities10,16,17. \nTo date, the research on transformer oil pool fires is relatively limited, particularly \nusing systematic experiments. Heskestad and Dobson 17 conducted pool fire \nexperiments using transformer oil over a rock bed in a 1.2 m diameter pan with and \nwithout drainage at the bottom of the pan and found that the fires self-extinguished \nafter the liquid level decreased to a critical value in the drainage experiments. Zhang \net al.6 conducted pool fire experiments using a cone calorimeter under five external \nradiative heat fluxes using three types of transformer oils (10#, 25# and 45#) and \nfound that the ignition time of transformer oil decreased exponentially with the \nincrease of heat fluxes. In addition, the effects of the thickness of transformer oil on \nthe ignition characteristics were also discussed in the paper18. Wang et al.19 performed \nexperiments on the auto-ignition characteristics of pure and oil-impregnated \ntransformer insulating paper board and analyzed the ignition time, heat release rate \nand gas concentrations during fuel burning. It is worthwhile to note that in these \nstudies6,18-19, the equivalent diameter of the fire ( , where S is the pool area) is \n\r\u000e\u000f\u0010\nall less than 10 cm, for which conduction is the dominant heat transfer mode, in \nc\nomparison to radiation in real pool fire scenarios or experiments20,21. Clearly, there is \na lack of experimental data to the quantitative thermal hazard analysis and \ncorresponding firefighting for transformer fire accidents.\nTo fill this knowledge gap, this work aims to experimentally investigate the \ntransformer oil burning behaviors of pool fires using different pool diameters, mainly \nPage 3 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nin the radiation-controlled regime (D \u000320 cm). The mass burning rate, flame height, \nliquid layer temperature, flame temperature and radiation are discussed and analyzed \nin detail. Furthermore, correlations of burning rate, flame temperature and radiation \nfraction are deduced based on the experiments, which will be of practical use in \nthermal hazard analysis of transformer oil fire accidents as well as corresponding \nfirefighting. \n2. EXPERIMENTAL SETUP\nThe overall schematic of the experimental setup is shown in Figure 1. All tests \nwere conducted in a large hall. The doors and windows of the hall were all closed but \nnot sealed during the tests, so the wind effect was not considered in this work. In the \ntests, KI25X transformer oil was used and the detail characteristics were shown in \nTable 1.\nTable 1. The characteristics of KI25X transformer oil\nProperties Value\nDensity (kg/m3) 883\nFlash point (\u0004) 155\nHeat conductivity (W/(m K))19 0.128\nHeat capacity (J/(kg K))22 1960\nEffective heat of combustion (MJ/kg)6 40\nIn total, six fuel pans were used having diameters of 20, 30, 40, 60, 80, and 100cm \na\ns shown in Table 2. The height of the side wall of the pan is fixed at 10cm. In order \nto examine the effects of the fuel thickness, three averaged fuel thicknesses (1cm, \n3cm, 5cm) were used. A digital vernier caliper was used to measure the liquid layer \nthickness at different locations of the pan. The pan was placed on the top of a load cell \n(precision: 0.1g, maximum: 35 kg, Sartorius) to record the real time fuel mass. A \nfireproof board was placed between the load cell and the pan to protect the load cell. \nPage 4 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nPage 5 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nshown in the results, the steady burning rate is independent of the fuel thicknes s when \nthe fuel thickness is more than 1 cm. For ignition, 10 mL heptane was injected into \nthe pan and ignited using a butane hand torch to initiate the combustion of the \ntransformer oil.\nTable 2. Specification of the test conditions\nNo.\nDiameter \n(c\nm)\nAveraged \nt\nhickness (cm)\nMass \n(g)\nNo.\nDiameter \n(c\nm)\nAveraged \nt\nhickness (cm)\nMass\n(g)\n1 20 1.0 407 9 40 5.0 5576\n2 20 3.0 845 10 60 1.0 2586\n3 20 5.0 1419 11 60 3.0 7540\n4 30 1.0 647 12 60 5.0 12530\n5 30 3.0 1818 13 80 1.0 4540\n6 30 5.0 3174 14 80 3.0 13390\n7 40 1.0 1253 15 100 3.0 20830\n8 40 3.0 3396\n3. RESULT AND DISCUSSION\n3.1 Bu\nrning rate \nThe transient burning rates of selected tests with different initial thicknesses are \nshown in Figure 2. The whole burning process can be divided into four distinctive \nstages: (a) ignition stage, (b) increasing burning rate stage, (c) steady burning stage \nand (d) extinguishment. At the ignition stage, it was observed that the flame only \ncovered part of the fuel surface and the flame gradually spread to the whole surface. \nDuring this period, most of the transformer oil was not ignited and the flame was \nmainly due to the heptane burning. At the second stage, the burning rate increased \nquickly, accompanied by a quick increase of the flame height. The flame detached \nfrom the surface of the fuel due to limited availability of oxygen in the pan. \nMeanwhile, black smoke was gradually observed in this stage. At the steady burning \nstage, the burning rate and the flame height are nearly constant for a relatively long \nPage 6 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nperiod of time. In this period, the heat feedback from the flame to the fuel s urface and \nthe heat transfer process are nearly constant. At the last stage, the flame re-entered the \npan and disappeared in a short time. The detailed characteristics in each stage are \nshown in Figure 3.\nFigure 2 shows that the steady burning rate for tests with the same pool diameter is \nnearly constant, independent of its initial thickness in the tests. For example, for the \n20 cm cases the steady burning rate is 12.69, 12.34 and 12.18 g/(m 2s) for the initial \nthickness of 1 cm, 3cm and 5cm respectively and the maximum relative difference is \nless than 5%. Subsequently, the fuel thickness effects on the steady burning rate are \nnot considered and the averaged burning rate is used for further analysis.  \n0.0 0.2 0.4 0.6 0.8 1.00\n4\n8\n12\n16\n20\n24\n28\n Thickness=1.0 cm\n Thickness=3.0 cm\n Thickness=5.0 cm\nBurning Rate (g/m\n2\ns)\nTime [-]\nD=20 cm\n0.0 0.2 0.4 0.6 0.8 1.00\n4\n8\n12\n16\n20\n24\n Thickness=1.0 cm\n Thickness=3.0 cm\n Thickness=5.0 cm\nBurning Rate (g/m\n2\ns)\nTime [-]\nD=30 cm\n0.0 0.2 0.4 0.6 0.8 1.00\n4\n8\n12\n16\n20\n24\n28\n Thickness=1.0 cm\n Thickness=3.0 cm\n Thickness=5.0 cm\nBurning Rate (g/m\n2\ns)\nTime [-]\nD=40 cm\n0.0 0.2 0.4 0.6 0.8 1.00\n4\n8\n12\n16\n20\n24\n28\n Thickness=1.0 cm\n Thickness=3.0 cm\n Thickness=5.0 cm\nBurning Rate (g/m\n2\ns)\nTime [-]\nD=60 cm\nFigure 2. Experimental data of burning rate for different initial thickness with varied \ndi\nameter (Time[-]=Treal/Ttotal)\nT=10 s\n T=30 s\n T=180 s\n T=900 s T=1300 s\nPage 7 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFigure 3. The burning process pictures of Test-14\nF\nigure 4 plots the average steady burning rate as a function of pool diameter. \nPrevious experimental data for transform oils with different pool diameters (1.2 m and \n1.7 m) by Heskestad 10 and Kung and Stavrianidis 12 are also included along with the \ncorrelation proposed by Burgess 11 for comparison purpose.\n0.2 0.4 0.6 0.8 1.0 1.2 1.4 1.6 1.80\n5\n10\n15\n20\n25\n30\n35\n40\n45\nHeskestad\n10\n;  Kung and Stavrianidis\n12\n;\nm'=39*(1-exp(-0.7D)), Babrauskas\n9\n;\nPresent study;\nm'=28.65*(1-exp(-1.78D)), R2=0.963.\nMass burning rate (g/(m\n2\n·s))\nDiameter (m)\nFigure 4. The mass burning rate as a function of burning diameter\nT\nhe experimental data show that the burning rate increases with increasing pool \ndiameter and approaches a constant value for large diameters. This trend is consistent \nwith that of other hydrocarbon fuels 7-8. For a pool fire, the total feedback heat from \nthe flame to the fuel surface controls the burning rate and can be expressed as:\n      (1)\u0011\u0012 =\n\r\t\u0005\u0014\u0015 \u0007\u0014\u0016)\n\u000b +\u0018(\u0014\u0019 \u0007\u0014\u0016) +\u001a\u001b\u0005\u00144\u0012 \u0007\u00144\u0016)(1 \u0007exp ( \u0007\t\u001f\u000b))\nwhere k, h and V represents heat conduction coefficient, the convective heat transfer \ncoefficient, and StefanBoltzmann constant, respectively;  is in a constant which \t\u001f\nequals the extinction coefficient multiplied by the mean beam length corre ctor ( ); \t\nD is the pool diameter, F is the view factor, and Tr ,Tg, Tf and Tl are the temperatures \nof the pool rim, liquid gas above the liquid surface, flame and liquid fuel, \nrespectively. For radiation-controlled burning (D>20cm) 7, the heat feedback can be \nsimplified as:\n                (2)\u0011\u0012 = \u001a\u001b\u0005\u00144\u0012 \u0007\u00144 !\"\u0016)(1 \u0007exp ( \u0007\t\u001f\u000b))\nThe burning rate ( ) can be written as \u0003\u001f\n                   (3)\u0003\u001f(#$(\u0014 !\"\u0016 \u0007\u0014\u0004) + %&) = \u0011\u0012\nPage 8 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nwhere cp is the specific heat at constant pressure,  Lv is the latent heat of vaporization, \nand Tboil and  are the fuel boiling point and ambient temperature, respectively. \u0014\u0004\nCombining eqs (1-3), the burning rate can finally be expressed as:\n      \n(4)m\u001f =\n\u001a\u001b(\u00144\u0012 \u0007\u00144\u0016)\n#$(\u0014 !\"\u0016 \u0007\u0014\u0004) + %&\n(1 \u0007exp ( \u0007\t\u001f\u000b)) = m\u001f\u001f\u0004(1 \u0007exp ( \u0007\t\u001f\u000b))\nwhere  is the mass burning rate of a pool fire with an infinite pool diamet er. The m\u001f\u001f\u0004\nburning rate of most fuels with diameter larger than 1m can be approximated as  the \nmaximum burning value ( ) 9. In this study, the parameters of  and  are m\u001f\u001f\u0004 m\u001f\u001f\u0004 \t\u001f\nobtained based on the experimental data fitting as was done in the pa per9, as shown in \nFigure 3. The present correlation also agrees with the other tests with different pool \ndiameters (Diameter: 1.2 m, 1.7 m) in the references10,12.\n3.2 Flame height\nFlame height associated with the heat flux distribution is a key parameter in pool \nfire thermal hazard analysis8,11,14. The flame height can be determined by means of the \nvisible images obtained from the video recordings. In the tests, the two cameras were \nlocated far away from the pool at different positions. An algorithm was developed to \ndistinguish the flame contour. Videos of the flames were converted to a series of \nbinary pictures and then the flame height was be determined based on a certain scale, \nas commonly done in literatures 26-28. The detailed processing examples are shown in \nFigure 5.\n81 cm\n 104 cm\n86 cm\n83 cm\nFigure 5. Flame contour extraction map\nA\nfter obtaining the instantaneous flame heights in each picture, the flame \nintermittency was then obtained following the procedure in the paper 29. Figure 6 \npresents the flame intermittency versus dimensionless height, L/D, for the case with a \npool diameter of 0.8 m. The average flame height is the one having a flame \nintermittency of 0.5. \nPage 9 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n0.8 1.2 1.6 2.0 2.4 2.80.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n Experimental Values\nIntermittency\nL/D\nFlame Height (L/D=0.5)\nFigure 6. Flame height intermittence versus L /D for a diameter of 0.8 m burning \n(151s <t< 161 s)\nThe dimensionless flame height (L/D) can be correlated to a dimensionless number \n30-33 a s. ()\n                       (5)% \u000b= *(()) + #\nThe parameters of a, b and c are constants, which are given in Table 3. It can be \nseen that their values vary significantly, because they are determined based on \ndifferent tests having a wide range of scales and using different kinds of fuels. \nTable 3. The parameters used to evaluate the experimental flame length data\nParameters () a b c Note\nMoorhouse30\n'\u001f\n+\u0004 gD 4.7 0.21 0 Pool-fire: 12.2×15.4 m\nMangialavori and \nRu\nbino31\n'\u001f\n+\u0004 gD 31.6 0.58 0 Pool diameter: 16 m\nFay32\n\u0003\u001f\n+\u0004 \u0019\u000b 15.5 0.4 0 LNG pool fires\nMcCaffrey33\n\u0003\u001f./#\u0010\n\r+\u0004#\u0004\u0014\u0004 \u0019\u000b 3.7 0.4 -1.02 Laboratory-scale data\nFigure 7 shows a comparison of the present experimental flame heights and \np\nredictions using different correlations. As it can be seen in Figure 6, the predictions \nvary widely between different models. In the experimental data, we also included an \nPage 10 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nadditional measurement for a pool dimeter of 1.9 m. The test was conducted to s tudy \nfire suppression, but a steady flame height was observed before the fire extinguishing. \n0.4 0.8 1.2 1.6 2.00.0\n0.8\n1.6\n2.4\n3.2\n4.0\n4.8\nExperimental values;\nMoorhouse Model\n30\n;\nManginalavori and Rubino Model\n31\n;\nFay Model\n32\n;\nMcCaffrey Model\n33\n.\nFlame Height (m)\n Diameter (m)\nFigure 7. Com parison between the experimental flame height and the predictive \nvalues by different models\nFigure 7 shows that the Fays and McCaffreys correlations can provide a good \nprediction when the pool diameter is small (D \u000540cm). With the increase of pool \ndiameter, both methods tend to overestimate the flame height. As we have known that \nthe burning efficiency will gradually decrease for heavy oils burning due to the \nincomplete combustion. In addition, the production of strong smoke also limits the \nincrease of flame with the increase of pool diameter. The Fay correlation is based on \nthe LNG pool fire tests32 and McCaffreys correlation is from light fuels 33. Therefore, \nthe effects caused by burning efficiency and smoke on flame height are not \nconsidered adequately in the two correlations. With increasing burning diameter, both \nMoorhouses and Mangialavoris correlations, derived from large scale pool fire tests, \nare in good agreement with the measurements. The average relative difference \nbetween the Moorhouses and Mangialavoris correlations and the experimental data \nis similar, 0.114 and 0.120 respectively. This result is consistent with the finding of \nthe paper 26 that Moorhouses model is more suitable for large scale gasoline and \ndiesel pool fire.\n3.3. Temperature profile\n3.3.1. Liquid and vapor temperature\nFor the temperature profile in a liquid layer, a uniform temperature layer near the \nPage 11 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nliquid surface and a lower layer with a large temperature gradient were obs erved for \nsmall pool fires (D=10 cm) 20-21,34. However, there is still very limited information on \nthe temperature profile in transformer oil burning, particularly for medium-scale \n(D>0.2m) pool fires. Figure 8 shows the results of the measured transient liquid \ntemperature for selected cases.\n0 1000 2000 3000 40000\n200\n400\n600\n800\n1000\n1200 1350 1500 1650 1800300\n325\n350\n375\n400\nBoiling Layer\nHeight = 4 cm\nTemperature (\u0000 )\nTimes (s)\nConvection Layer\n Height= 1 cm\n Height= 2 cm\n Height= 3 cm\n Height= 4 cm\n Height= 5 cm\nTemperature (\u0000 )\nTime (s)\n0 600 1200 1800 2400 3000 36000\n200\n400\n600\n800\n1000\n1200 1350 1500 1650 1800300\n325\n350\n375\n400\nBoiling Layer\nHeight = 4 cm\nTemperature (\u0000 )\nTimes (s)\nConvection Layer\n Height= 1 cm\n Height= 2 cm\n Height= 3 cm\n Height= 4 cm\n Height= 5 cm\nTemperature (\u0000 )\nTime (s)\n0 600 1200 1800 2400 30000\n200\n400\n600\n800\n1000\n1350 1500 1650 1800300\n325\n350\n375\n400\nBoiling Layer\nHeight = 4 cm\nTemperature (\u0000 )\nTimes (s)\nConvection Layer\n Height= 1 cm\n Height= 2 cm\n Height= 3 cm\n Height= 4 cm\n Height= 5 cm\nTemperature (\u0000 )\nTime (s)\n0 300 600 900 12000\n200\n400\n600\n800\n1000\n200 300 400 500300\n325\n350\n375\n400\nBoiling Layer\nHeight = 4 cm\nTemperature (\u0000 )\nTimes (s)\nConvection Layer\n Height= 1 cm\n Height= 2 cm\n Height= 3 cm\n Height= 4 cm\n Height= 5 cm\nTemperature (\u0000 )\nTime (s)\nTest 3 Test 9\nTest 12 Test 14\n(1)\n(2) (3)\n(4)\n(5)\nFigure 8. The measured temperature in the pan as a function of time\nW\ne recall that the top thermocouple in the pan is positioned at 5cm from the pan \nbottom surface, so it was initially exposed in the air for Test 3 and Test 14. This \nexplains the initial sharp increase of temperature at this location. With increasing \nburning rate, this thermocouple became gradually immersed in the fuel vapor and the \ncorresponding measured temperature decreases with time and eventually became \nconstant at about 400 oC, indicating the formation of fuel-rich core region above the \nfuel surface35. In order to directly reflect the whole temperature variation in the pan, \nthe measured temperature by the thermocouple at the height of 4cm from the bottom \nsurface in Test-12 is used as an example. At the initial stage, the thermocouple was \nimmersed in the fuel and the temperature increased from 30 \u0004 to 332 \u0004. As the \nmeasured temperature achieved the boiling point, the measured value kept nearly \nconstant from 1423s to 1565s. After 1565s, the measured temperature experienced a \nPage 12 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nquick increase and then remained nearly constant until near the end of the tests , when \nthe temperature increased dramatically around from 400 \u0004 to 800 \u0004 indicating the \npresence of the flame at this location. According the temperature variation in the pan, \nthis process can be divided into five stages, as shown in Figure 8 (Test 12). And the \ndetailed characteristic in each stage is described as follows:\n(1) Gradually temperature increase stage: After ignition, the surface temperature \nwill achieve the boiling point in a short time 36. The fuel below the boiling layer will \nbe heated by heat conduction. Meanwhile, the distance between the thermocouple and \nthe fuel surface will decrease with the continuous burning. So the measured \ntemperature will increase until it reaches the boiling point.\n(2) Steady temperature stage: The measured temperature is nearly constant (~330\u0004,  \nthe boiling temperature) when the measurement positions are close to the fuel surface. \nThe measured temperature with the boiling point can keep constant and continue for \nsome time until the thermocouple is exposed to the fuel vapor. The appearance of the \nsteady temperature stage illustrates the existence of the boiling layer below the fuel \nsurface. Based on the temperature measurements in the liquid layer, the thickness of \nthe boiling layer can be estimated as:\n                       (6)\n\u0018 !\"\u0016 = 0\u00051\f× (12 \u000711)\nwhere  is the burning rate (mm/s), t1 is the start time when the measured 0\ntemperature achieves the boiling point and t2 is the end time, after which the \ntemperature exceeds the boiling point, followed by a quick temperature increase. \nBased on eq 6, the boiling thickness at different pool sizes (D=20cm, 40cm, 60cm, \n80cm) is calculated and the average values are approximately 2.46 mm, 2.85 mm, \n2.64 mm and 2.54mm, respectively, all slightly less than 3.0mm observed in the \npaper21. The reason for the deviation is closely associated with the radiation \nabsorption properties of the fuel layer20-21, 34. \n(3) Sharp temperature increase stage: After the thermocouple is exposed to the fuel \nvapor, a sharp temperature increase from around 330 \u0004 to 380 \u0004 is observed. This \nillustrates the existence of a vapor layer with a large temperature gradient just above \nthe fuel surface, which promotes the heat convection heat feedback between the fuel \nPage 13 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nand vapor.\n(4) \nSecond steady temperature stage: It has been known that there is a fuel-rich core \nregion above the fuel surface for pool fires 35. As the liquid fuel is vaporized and the \nsurface of the fuel recedes, the thermocouples become immersed in the fuel vapor and \nnot directly in contact with the flame. The speed at which the fuel surface decreases is \nvery small, so it has little influence on the flame behavior. Therefore, the temperature \nof fuel vapor near the fuel surface in the pan can keep steady. The temperature \nincrease at 4mm is only about 26 oC at the start and the end of this stage. The slight \nincrease is likely due to the small increase in the distance between the thermocouple \nand the fuel surface. \n(5) Second sharp temperature increase stage: Near the end of burning, the liquid \nfuel is nearly all consumed and all the thermocouples were exposed in the vapor. The \nflame entered the pan where unburn gas vapor is, and as a result the measured \ntemperature all increased sharply. The extinguishment of the flame followed shortly, \nindicated by the sudden decrease of the measured temperature.\n3.3.2. Flame temperature\nFigure 9 shows the axial flame temperature variations with time for Tests 4 and 15. \nThe maximum value of flame temperature is about 800 \u0004 , with similar values \nobserved in other tests. The variation of the flame temperature with time is consistent \nwith that of the burning rate. For further analysis, the average temperature at the \nsteady burning stage is used to study the vertical temperature profile. \n0 300 600 900 12000\n300\n600\n900\n1200  15 cm;  30 cm;  45 cm;\n 60 cm;  75 cm;  90 cm;\n 105 cm;  120 cm;  135 cm;\n 150cm\nTemperature (\u0003C)\nTime (s)\nTest-15\n0 200 400 600 800 10000\n300\n600\n900\n1200\n 15 cm;  30 cm;  45 cm;\n 60 cm;  75 cm;  90 cm;\n 105 cm;  120 cm;  135 cm;\n 150cm\nTemperature (\u0003C)\nTime (s)\nTest-4\nFigure 9. The axial flame temperature as a function of time\nPage 14 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nThe dimensionless temperature increase, , are plotted in Figure 9 (\u00144 \u0007\u0014\u0004)/\u0014\u0004\nagainst the normalized height, , where Tz is the flame temperature at location Z; 5 (0.4\nT\u0006 is the ambient temperature; The heat release rate ( ) can be expressed as:(\n                           (7)(= m\u001f × ./# × \u000e\nwhere S is the pool area ( ) and  is the effective heat of combustion given \u0010\u000b2 4 ./#\nin Table 1. \nT\nhe flame temperature profile can be divided into three regions: isothermal zone; \nrapid decrease zone and slow decrease zone based on the temperature variation in \nsome papers 37-39. For example, a piecewise function is correlated and given by Tao et \nal. derived from the large scale aviation kerosene pool fire 37 as also shown in Figure \n10. \n0.0 0.1 0.2 0.3 0.40.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n3.5\nD=20 cm;  D=30 cm\n D=40 cm;  D=60 cm\n D=80 cm;  D=100 cm\nPiece function model by Lu et al.\nNew correlation in present study\n\u0004Tz/TZ\nZ/Q \n0.4\nFigure 10. the normalized temperature rise\u0007Tz/ T\u0006 as a function of \u001a\u0014\u001b\u001c2/5\nIt can be found that the modified model by Lu et al. gives a better agreement for the \nisothermal zone, while the deviation gradually becomes large for the second zone. \nThis can be attributed to the difference in the pool diameter and fuel types. Base on \nthe present experimental data, a new piecewise function can be deduced and the \nresults are shown in Figure 9. \n        (8)\n.\u00144\n\u0014\u0004\n= {\n           2.45;                                5 (0.4 < 0.03\n         0.33 × (5 (0.4)\n\u00070.57\n;      0.03 >5 (0.4 >0.1\n0.0086 × (5 (0.4)\n\u00072.15\n;       5 (0.4 > 0.1\n \nIt is noted in Figure 10 that the zone of the isothermal zone is narrow and the fl ame \ntemperature decreases quickly in the second zone. The larger air entrainment and the \nPage 15 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nPage 16 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n0.0 0.2 0.4 0.6 0.8 1.00.0\n0.2\n0.4\n0.6\n0.8\n D= 20 cm\n D= 40 cm\n D= 60 cm\n D= 80 cm\nRadiation heat flux (kW/m\n2\n)\nTime [-]Time[-]\nFigure 12. Measured radiative heat flux for different pool sizes (Time[-]=t/tt otal)\n  The variations of radiative heat flux are consistent with those of the burning rate \nand the measured values are nearly constant in the steady burning stage. In order to \ndetermine the radiation fraction, the average radiative heat flux at the steady burning \nstage is used. Based on eq 10, the radiation fraction is calculated and the results are \nshown in Figure 13. \n0.2 0.4 0.6 0.8 1.0 1.20.20\n0.25\n0.30\n0.35\n0.40\n0.45\n0.50\n Experimental Values\nXr=0.364e-0.228D (R2=0.96)\n Xr=0.354e-0.005D , McGrattan Model\nRatio (Qrad/QTotal)\n Diameter (m)\nFigure 13. Experimental results vs. proposed model and McGrattans model\nT\nhe radiation fraction decreases with increasing pool diameter in Figure12, which \nis in accordance with the finding for other fuels 8, 26 . Existing correlations 8,23,43 for \nradiation fraction assume that  ~D -0.5, ~constant, or an exponential relationship B\u0015\nbetween  and pool diameter 42. At present, McGrattans model is widely used in B\u0015\nsome liquid pool fires 43-44. \n                      \n(10)B\u0015 = B\u0015\u0003*D\b\u0007#\u000b\nPage 17 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nwhere  and c=0.05 43. Although these values are derived from the B\u0015\u0003*D = 0.35\nexperimental data fitting, involving a range of different liquid fuels, there is s till a \nlarge deviation for certain fuels, which has been illustrated by Chatris et al.8. In Figure \n13, it can be seen that the predicted values by McGrattan model overestimates the \npractical values. So the parameters in eq 10 are reacquired (  and B\u0015\u0003*D = 0.36\nc=0.228) by the fitting of experimental date. The correlation coefficient can reach \nabout 0.96. In the new correlations, the value of c is larger than the previous value, \nwhich means a quick decrease in radiation fraction with the increase of pool diameter. \nThis is attributed to the obvious smoke blockage for the heavy oil burning as \nillustrated in Figure 14. \nStrong Smoke\nFigure 14. The smoke blockage effect on the flame radiation\n3.4.2 Emi\nssive power of flame surface\nTo calculate the radiative heat flux from a fire to a nearby object (at closer \ndistances), a solid flame radiation model is widely used, in which the flame is \nidealized as a vertical cylinder emitting thermal radiation from its surface 44. The \nradiative heat flux from a fire to a nearby object can be expressed as:\n                          (11)q\u001f\u001f = \u001b1 \u00072FG\u0012\nwhere  i s a geometric view factor;  is the atmospheric transmissivity to \u001b1 \u00072 F\nthermal radiation, simplified as one for near target 45;   is an average emissive G\u0012\npower of flame surface. Various empirical models are available to predic t emissive \npower and the corresponding calculation results in the tests are shown in Table 4. For \nModel 1, the average flame temperature obtained from the experiments, around 1030 \nK, is used for the calculation.\nPage 18 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nPage 19 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nthe initial fuel thickness. So, the measured radiative heat flux values from t ests 3, 6, 9, \n12, 14 and 15 are used. The comparison between the experimental values and the \ncalculations by different models is shown in Figure 16.\n0 2 4 6 8 100\n2\n4\n6\n8\n10\n-15%\n Model 1\n Model 2\n Model 3\n Model 4\n Model 5\nPrediction value (kW/m\n2\n)\nExperimental values (kW/m\n2\n)\n+15%\nFigure 16. Comparison of experimental and calculated radiative heat flux using the \ndi\nfferent emissive surface models \nIt is seen that Model 1 can predict well the radiative heat flux within errors of ±\n15%. For the small pool diameter burning (D \u000540 cm) \tModel 5 can give a good \nprediction. However, the discrepancy increases with increase pool diameter. This \ncould be attributed to the assumption that the flame is a perfect cylinder, while in fact \nnecking-in due to the air entrainment occurs as shown in Figures 4 and 12, which has \nbeen discussed in detail in the paper 49. The assumption in Model 5 results in a lower \nemissive power. Model 2 is recommended by Mudan for hydrogen fuels 44, and the \npredictive accuracy is relatively poor due to use of a constant for the emissive power. \nIn Models 3 and 4, the predictive values are larger than the experimental values \nbecause the effects of smoke are not considered well since light component fuels were \nused in the development of these models. Overall, Model 1 ( ) provides the E = IJ\u0012\u00144  \nbest agreement and could be used to estimate the thermal radiation of pool  fire on the \nsurrounding objects in the actual fire accidents.\n4. CONCLUSION \nThis study was aimed at identifying the burning characteristics of the transformer \noil pool fires. To this end, a series of transformer oil pool fires was performed with \ndifferent pool diameters. The burning rate, flame height, the liquid layer and flame \nPage 20 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\ntemperature profile, and radiation were measured and analyzed. The main results  are \nas follows:\n\n New key burning parameters (  g/m 2 and =1.78 m -1) for the m\u001f\u001f\u0004 = 28.65 \t\u001f\ntransformer oil pool fires are deduced based on present experimental data and also \nverified by existing data in the literature. \n\n Several empirical models for flame height were examined and it was found that \nthe ones developed for heavy fuels agree better the measurements for transformer oils, \nwhich is consistent with the finding in Muñoz et al.s study for a diesel pool fire.\n\n In the liquid layer, a boiling layer and a gradient layer were observed based on \nthe temperature measurements. The average thickness of the boiling layer in the \nsteady burning stage is approximately 2.6 mm for the transformer oil pool fires. \n\n A new piecewise function is provided to calculate the axial temperature for \ntransformer oil pool fires, with a similar finding reported in the literature for aviation \nkerosene pool fires. \n\n Correlations are also developed for radiation fraction and flame surface emissive \npower. The radiation fraction is determined by the source model and a new correlation \nfor the radiation fraction as a function of pool diameter ( ) is B\u0015 = 0.36\b\u00076733?\u000b\ndeduced. Using the solid flame model, a flame emissive model based on the flame \ntemperature ( ) is found to estimate well the radiative heat flux of pool fire on E = IJ\u0012\u00144\nthe surrounding objects in transformer oil pool fire accidents.\nT\nhe measurements reported here can help to enrich the basic experimental data of \ntransformer oil pool fires which have been rarely reported. These results and \nfundamental analysis will lay a solid foundation of thermal hazard assessment for \npractical transformer oil fire accidents. \nAUTHOR INFORMATION\nCorresponding Author\n*Tel: 86-15210567787.  E-mail: 15210567787@163.com\nNotes\nPage 21 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nThe authors declare no competing financial interest.\nA\nCKNOWLEDGEMENTS\nThis study was sponsored by the National Key R&D Program of China \nNo. \n2018YFC0809900 \u000b ,the National Natural Science Foundation of China (No. \n51906253) and the Opening Funds of State Key Laboratory of Building Safety and \nBuilt Environment and National Engineering Research Center of Building \nTechnology (BSBE 2017-03).\nREFERENCES \n(1) Wang, M.; Vandermaar, A.; and Srivastava, K. D. Review of condition assessment \nof power transformers in service. Ieee. Electr. Insul. M. 2002, 18, 12-25.\n(2) Dumitran, L.M.; Setnescu, R.; Notingher, P.V.; et al. Method for lifetime \nestimation of power transformer mineral oil. Fuel 2014, 117, 756-762.\n(3) Working Group A2.33. Guide for transformer fire safety practices. Paris, France: \nCIGRE, 2013.\n(4) Zhao, Z.; Xu Y.; Wang J.; et al. Research on the fire safety of large power \ntransformer. High Voltage Engineering 2015, 41(10), 3378-3384.\n(5) Xianji China 2019. Jinan 1000 kV UHV substation detonation caused 1 death and \n2 injuries. https://www.xianjichina.com/special/detail_433103.html.\n(6) Zhang, B.; Zhang, J.; Huang, Y.; et al. Burning process and fire characteristics of \ntransformer oil. J. Therm. Anal. Calorim. 2019, 7,1-10.\n(7) Hamins, A.; Fischer, S.; Kashiwagi, T.; et al. Heat feedback to the fuel surface in \npool fires. Combust. Sci. Technol. 1994, 97(1-3), 37-62.\n(8) Chatris, J.M.; Quintela, J.; Folch, J.; et al. Experimental study of burning rate in \nhydrocarbon pool fires. Combust. Flame 2001, 126(1-2), 1373-1383.\n(9) Babrauskas, V. Estimating large pool fire burning rates. Fire Technol. 1983, 19(4), \n251-261.\n(10) Heskestad, G. Luminous heights of turbulent diffusion flames. Fire Safety J.  \n1983, 5(2), 103-108.\nPage 22 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n(11) Burgess, D.S.; Strasser, A.; Grumer, J. Diffusive burning of liquid fuels in open \nt\nrays. Fire Res. Abstr. Rev. 1961, United States.\n(12) Kung, H.C.; Stavrianidis, P. Buoyant plumes of large-scale pool fires. \nCombustion Inst. 1982, 19(1), 905-912.\n(13) Rew, P.J.; Hulbert, W.G.; Deaves, D.M. Modelling of thermal radiation from \nexternal hydrocarbon pool fires. Process Saf. Environ. 1997, 75(2), 81-89.\n(14) Sun, H.; Wang, C.; Liu, H.; et al. Experimental study of combustion \ncharacteristics of circular ring thin-layer pool fire. Energy Fuels 2017, 31(9), \n10082-10092.\n(15) Sharma, A.; Mishra, K. Experimental set-up to measure the maximum mass \nburning rate of storage tank fires. Process Saf. Environ. 2019, 131, 282-291.\n(16) Zukoski, E.; Kubota T.; Cetegen, B. Entrainment in fire plumes. Fire Safety J. \n1981, 3(3), 107-121.\n(17) Kim, S.C.; Lee, K.Y.; Hamins, A. Energy balance in medium-scale methanol, \nethanol, and acetone pool fires. Fire Safety J. 2019, 107:44-53.\n(18) Zhang, B.; Zhang, J.; Wang, L.; et al. Investigation on effects of thickness on \nignition characteristics and combustion process of the oil-impregnated transformer \ninsulating paperboard. J. Therm. Anal. Calorim. 2018, 132(1), 29-38.\n(19) Wang, X.; Zhu, P.; Xu, H.; et al. Experimental study on the autoignition \ncharacteristics of pure and oil-impregnated transformer insulating paper board. J. \nTherm. Anal. Calorim. 2017, 127(3), 2489-2497.\n(20) Zhao, J.; Huang, H.; Jomaas, G.; et al. Experimental study of the burning \nbehaviors of thin-layer pool fires. Combust Flame 2018, 193, 327-334.\n(21) Suo-Anttila, J.M.; Blanchat, T.K.; Ricks, A.J.; et al. Characterization of thermal \nradiation spectra in 2 m pool fires. Combustion Inst. 2009, 32(2), 2567-2574.\n(22) Hasan, M.I.; Improving the cooling performance of electrical distribution \ntransformer using transformer oilBased MEPCM suspension. Int. J. Eng. Sci.  2017, \n20(2), 502-510.\n(23) Yang J.; Hamins, A.; Kashiwagi, T. Estimate of the effect of scale on radiative \nheat loss fraction and combustion efficiency. Combust. Sci. Technol. 1994, 96(1-3), \nPage 23 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n183-188.\n(24) \nKoseki, H. Large scale pool fires: results of recent experiments. Fire Safety Sci. \n2000, 6, 115-132.\n(25) Hu, L.; Hu, J.; de Ris, J.L. Flame necking-in and instability characterization in \nsmall and medium pool fires with different lip heights. Combust Flame 2015, 162(4): \n1095-1103.\n(26) Muñoz, M.; Arnaldos, J.; Casal, J.; et al. Analysis of the geometric and radiative \ncharacteristics of hydrocarbon pool fires. Combust Flame 2004, 139(3), 263-277.\n(27) Zhang, P.; Tang, X.; Tian, X.; et al. Experimental study on the interaction \nbetween fire and water mist in long and narrow spaces. Appl. Therm. Eng. 2016, 94, \n706-714.\n(28) Wang, Q.; Tang, F.; Liu, H.; et al. Experimental Investigation on the effect of a \nreduced pressure on the combustion characteristics and flame height of gaseous fuel \njets in parallel sidewalls. Energy fuels 2018, 32(2), 2490-2496. \n(29) Zukoski, E.; Cetegen, B.M.; Kubota, T. Visible structure of buoyant diffusion \nflames. Combustion Inst. 1985, 20(1), 361-366.\n(30) Moorhouse, J. Scaling criteria for pool fires derived from large-scale \nexperiments. The Assessment of Major Hazards, Symposium Series 1982, 71, \n165-179.\n(31) Mangialavori, G.; Rubino, F. Experimental tests on large hydrocarbon pool fires.  \n7th Int. Symp. on Loss Prevention and Safety Promotion in the Process Industries \n1992, Taormina, Italy, 4-8.\n(32) Fay, J.A. Model of large pool fires. J. Hazard Mater. 2006, 136(2), 219-232.\n(33) McCaffrey, B.J. Momentum implications for buoyant diffusion flames. Combust. \nFlame 1983, 52, 149-167.\n(34) Vali, A.; Nobes, D.S.; Kostiuk, L.W. Transport phenomena within the liquid \nphase of a laboratory-scale circular methanol pool fire. Combust Flame 2014, 161(4), \n1076-1084.\n(35) Joulain, P. The behavior of pool fires: state of the art and new insights. \nCombustion Inst. 1998, 27(2), 2691-2706.\nPage 24 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n(36) Garo, J.P., Vantelon, J.P., Koseki, H. Thin-layer boilover: Prediction of its onset \na\nnd intensity. Combust. Sci. Technol.2006, 178(7), 1217-1235.\n(37) Tao, Y.; Lu, K.; Chen, X.; et al. Experimental investigation on the temperature \nprofile of large scale RP-5 aviation kerosene pool fire in an open space. Fuel 2020, \n264, 116852.\n(38) Li, C.; Yao, Y.; Tao, Z.; et al. Influence of depressurized environment on the fire \nbehaviour in a dynamic pressure cabin. Appl. Therm. Eng. 2017, 125, 972-977.\n(39) Zhou, Z.; Wei, Y.; Li, H.; et al. Experimental analysis of low air pressure \ninfluences on fire plumes. Int. J. Heat Mass Tran. 2014, 70, 578-585.\n(40) Hamins, A.; Klassen, M.; Gore, J.; et al. Estimate of flame radiance via a single \nlocation measurement in liquid pool fires. Combust Flame 1991, 86(3), 223-228.\n(41) Hu, L.; Wang, Q.; Delichatsios, M.; et al. Flame radiation fraction behaviors of \nsooty buoyant turbulent jet diffusion flames in reduced-and normal atmospheric \npressures and a global correlation with Reynolds number. Fuel 2014, 116, 781-786.\n(42) Hankinson, G.; Lowesmith, B.J. A consideration of methods of determining the \nradiative characteristics of jet fires. Combust Flame 2012, 159(3), 1165-1177.\n(43) Yang, J.C.; Hamins, A.; Kashiwagi, T. Estimate of the effect of scale on radiative \nheat loss fraction and combustion efficiency. Combust. Sci. Technol. 1994, \n96(1-3),183-188.\n(44) McGrattan, K.B.; Baum, H.R.; Hamins, A. Thermal Radiation from Large Pool \nFires, NIST (National Institute of Standards and Technology) NISTIR 6546, 2000.\n(45) Sudheer, S; Prabhu, S.V. Measurement of flame emissivity of gasoline pool fires. \nNucl. Eng. Des. 2010, 240(10), 3474-3480.\n(46) Mudan, K.S. Thermal radiation hazards from hydrocarbon pool fires. Prog. \nEnerg. Coumbust 1984, 10(1): 59-80.\n(47) Shokri, M.; Beyler, C.L. Radiation from large pool fires.  J. Fire. Prot. Eng. \n1989, 1, 141-150.\n(48) Mudan, K.; Croce, P. Fire hazard calculations for large open hydrocarbon fires, \nSFPE Handbook of Fire Protection Engineering, 1st ed., National Fire Protection \nAssociation, Quincy, Ma., Section 2, 1988.\nPage 25 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n(49) Hu, L.; Hu, J.; de Ris, J.L. Flame necking-in and instability characterizat ion in \nsmall and medium pool fires with different lip heights. Combust Flame 2015, 162(4), \n1095-1103.\nPage 26 of 26\nACS Paragon Plus Environment\nEnergy & Fuels\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60",
  "topic": "Mass fraction",
  "concepts": [
    {
      "name": "Mass fraction",
      "score": 0.5512649416923523
    },
    {
      "name": "Flame spread",
      "score": 0.5336151123046875
    },
    {
      "name": "Adiabatic flame temperature",
      "score": 0.5080451965332031
    },
    {
      "name": "Transformer oil",
      "score": 0.4883515536785126
    },
    {
      "name": "Thermal radiation",
      "score": 0.4817393124103546
    },
    {
      "name": "Mechanics",
      "score": 0.4635429084300995
    },
    {
      "name": "Boiling",
      "score": 0.4544532597064972
    },
    {
      "name": "Materials science",
      "score": 0.4369368851184845
    },
    {
      "name": "Radiative transfer",
      "score": 0.43435001373291016
    },
    {
      "name": "Temperature gradient",
      "score": 0.4273514449596405
    },
    {
      "name": "Combustion",
      "score": 0.4098411500453949
    },
    {
      "name": "Transformer",
      "score": 0.4021201729774475
    },
    {
      "name": "Chemistry",
      "score": 0.367100328207016
    },
    {
      "name": "Thermodynamics",
      "score": 0.26037144660949707
    },
    {
      "name": "Composite material",
      "score": 0.25280946493148804
    },
    {
      "name": "Voltage",
      "score": 0.19406422972679138
    },
    {
      "name": "Meteorology",
      "score": 0.18541017174720764
    },
    {
      "name": "Optics",
      "score": 0.09881576895713806
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    },
    {
      "name": "Organic chemistry",
      "score": 0.0
    },
    {
      "name": "Combustor",
      "score": 0.0
    },
    {
      "name": "Physics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I25757504",
      "name": "China University of Mining and Technology",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I138801177",
      "name": "University of Ulster",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I99065089",
      "name": "Tsinghua University",
      "country": "CN"
    }
  ],
  "cited_by": 47
}