{
    "title": "Improving the language model for low-resource ASR with online text corpora",
    "url": "https://openalex.org/W3028740611",
    "year": 2020,
    "authors": [
        {
            "id": "https://openalex.org/A5089804664",
            "name": "Nils Hjortnæs",
            "affiliations": [
                "Indiana University"
            ]
        },
        {
            "id": "https://openalex.org/A5026504904",
            "name": "Timofey Arkhangelskiy",
            "affiliations": [
                "Universität Hamburg"
            ]
        },
        {
            "id": "https://openalex.org/A5038987419",
            "name": "Niko Partanen",
            "affiliations": [
                "University of Helsinki"
            ]
        },
        {
            "id": "https://openalex.org/A5055468924",
            "name": "Michael Rießler",
            "affiliations": [
                "University of Eastern Finland"
            ]
        },
        {
            "id": "https://openalex.org/A5076604380",
            "name": "Francis M. Tyers",
            "affiliations": [
                "Stanford University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2741615391",
        "https://openalex.org/W3084713055",
        "https://openalex.org/W3035136611",
        "https://openalex.org/W2995090617",
        "https://openalex.org/W560371024",
        "https://openalex.org/W3087775410"
    ],
    "abstract": "In this paper, we expand on previous work on automatic speech recognition in a low-resource scenario typical of data collected by field linguists. We train DeepSpeech models on 35 hours of dialectal Komi speech recordings and correct the output using language models constructed from various sources. Previous experiments showed that transfer learning using DeepSpeech can improve the accuracy of a speech recognizer for Komi, though the error rate remained very high. In this paper we present further experiments with language models created using KenLM from text materials &#13;\\navailable online. These are constructed from two corpora, one containing literary texts, one for social media content, and another combining the two. We then trained the model using each language model to explore the impact of the language model data source on the speech recognition model. Our results show significant improvements of over 25% in character error rate and nearly 20% in word error rate. This offers important methodological insight into how ASR results can be improved under low-resource conditions: transfer learning can be used to compensate the lack of training data in the target language,and online texts are a very useful resource when developing language models in this context.",
    "full_text": null
}