{
    "title": "Analysis of Neural Network Based Language Modeling",
    "url": "https://openalex.org/W3020828030",
    "year": 2020,
    "authors": [
        {
            "id": "https://openalex.org/A5067151657",
            "name": "P. Karuppusamy",
            "affiliations": [
                null
            ]
        }
    ],
    "references": [
        "https://openalex.org/W1498436455",
        "https://openalex.org/W4300402905",
        "https://openalex.org/W2072223048",
        "https://openalex.org/W2102439588",
        "https://openalex.org/W2140679639",
        "https://openalex.org/W2171928131",
        "https://openalex.org/W2058641082",
        "https://openalex.org/W2743945814",
        "https://openalex.org/W2984716259",
        "https://openalex.org/W3010197215",
        "https://openalex.org/W2990522736",
        "https://openalex.org/W2980578413",
        "https://openalex.org/W950853366",
        "https://openalex.org/W179875071",
        "https://openalex.org/W2757704557",
        "https://openalex.org/W3207342693",
        "https://openalex.org/W4285719527"
    ],
    "abstract": "The fundamental and core process of the natural language processing is the language modelling usually referred as the statistical language modelling. The language modelling is also considered to be vital in the processing the natural languages as the other chores such as the completion of sentences, recognition of speech automatically, translations of the statistical machines, and generation of text and so on. The success of the viable natural language processing totally relies on the quality of the modelling of the language. In the previous spans the research field such as the linguistics, psychology, speech recognition, data compression, neuroscience, machine translation etc. As the neural network are the very good choices for having a quality language modelling the paper presents the analysis of neural networks in the modelling of the language. Utilizing some of the dataset such as the Penn Tree bank, Billion Word Benchmark and the Wiki Test the neural network models are evaluated on the basis of the word error rate, perplexity and the bilingual evaluation under study scores to identify the optimal model.",
    "full_text": null
}