{
  "title": "Palliative care needs-assessment and measurement tools used in patients with heart failure: a systematic mixed-studies review with narrative synthesis",
  "url": "https://openalex.org/W3047499127",
  "year": 2020,
  "authors": [
    {
      "id": "https://openalex.org/A3047608171",
      "name": "Bader Nael Remawi",
      "affiliations": [
        "Lancaster University"
      ]
    },
    {
      "id": "https://openalex.org/A332385820",
      "name": "Amy Gadoud",
      "affiliations": [
        "Lancaster University"
      ]
    },
    {
      "id": null,
      "name": "Iain Malcolm James Murphy",
      "affiliations": [
        "Trinity House",
        "Lancaster University"
      ]
    },
    {
      "id": "https://openalex.org/A2143691073",
      "name": "Nancy Preston",
      "affiliations": [
        "Lancaster University"
      ]
    },
    {
      "id": "https://openalex.org/A3047608171",
      "name": "Bader Nael Remawi",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A332385820",
      "name": "Amy Gadoud",
      "affiliations": [
        "Lancaster University"
      ]
    },
    {
      "id": null,
      "name": "Iain Malcolm James Murphy",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2143691073",
      "name": "Nancy Preston",
      "affiliations": [
        "Lancaster University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1903277992",
    "https://openalex.org/W2086643853",
    "https://openalex.org/W2593121558",
    "https://openalex.org/W2419574140",
    "https://openalex.org/W2588942344",
    "https://openalex.org/W2160723383",
    "https://openalex.org/W2064454083",
    "https://openalex.org/W2115659562",
    "https://openalex.org/W2966562746",
    "https://openalex.org/W2504965775",
    "https://openalex.org/W2557853949",
    "https://openalex.org/W2957876193",
    "https://openalex.org/W2788315186",
    "https://openalex.org/W2999124418",
    "https://openalex.org/W2114790017",
    "https://openalex.org/W1585782977",
    "https://openalex.org/W2095737970",
    "https://openalex.org/W2775789264",
    "https://openalex.org/W2140821409",
    "https://openalex.org/W2780545483",
    "https://openalex.org/W2149773068",
    "https://openalex.org/W2334113593",
    "https://openalex.org/W2055766917",
    "https://openalex.org/W2023732292",
    "https://openalex.org/W2770753203",
    "https://openalex.org/W4247137125",
    "https://openalex.org/W2163406780",
    "https://openalex.org/W2049928843",
    "https://openalex.org/W2000227031",
    "https://openalex.org/W3141544461",
    "https://openalex.org/W3031913436",
    "https://openalex.org/W2100069180",
    "https://openalex.org/W1972803103",
    "https://openalex.org/W2038380229",
    "https://openalex.org/W2043584251",
    "https://openalex.org/W2066797995",
    "https://openalex.org/W2129751406",
    "https://openalex.org/W1413992971",
    "https://openalex.org/W2599225410",
    "https://openalex.org/W2146030020",
    "https://openalex.org/W2344577298",
    "https://openalex.org/W1969695312",
    "https://openalex.org/W2070205714",
    "https://openalex.org/W2523431231",
    "https://openalex.org/W2786213019",
    "https://openalex.org/W2901203553",
    "https://openalex.org/W1777023829",
    "https://openalex.org/W2811170218",
    "https://openalex.org/W2887874932",
    "https://openalex.org/W2913715986",
    "https://openalex.org/W2921683050",
    "https://openalex.org/W2336043902",
    "https://openalex.org/W2753564369",
    "https://openalex.org/W3021664032",
    "https://openalex.org/W2082767172",
    "https://openalex.org/W2105552450",
    "https://openalex.org/W2912830309",
    "https://openalex.org/W2136103707",
    "https://openalex.org/W2135669047",
    "https://openalex.org/W1899201673",
    "https://openalex.org/W2339928140",
    "https://openalex.org/W2341210272",
    "https://openalex.org/W2119360286",
    "https://openalex.org/W2121592477",
    "https://openalex.org/W2136352051",
    "https://openalex.org/W2522136028",
    "https://openalex.org/W2005501262",
    "https://openalex.org/W2026826869",
    "https://openalex.org/W2784327453",
    "https://openalex.org/W2807686452",
    "https://openalex.org/W2272092870",
    "https://openalex.org/W2846333577",
    "https://openalex.org/W2972425775",
    "https://openalex.org/W2742571859",
    "https://openalex.org/W2984509504",
    "https://openalex.org/W2950519345",
    "https://openalex.org/W2946180847",
    "https://openalex.org/W2907720830",
    "https://openalex.org/W2756213203",
    "https://openalex.org/W2913740177",
    "https://openalex.org/W2605249189",
    "https://openalex.org/W2737971463",
    "https://openalex.org/W1557243082",
    "https://openalex.org/W52877415",
    "https://openalex.org/W2160048640",
    "https://openalex.org/W2546533774",
    "https://openalex.org/W3004973073",
    "https://openalex.org/W2150377764",
    "https://openalex.org/W1587877887",
    "https://openalex.org/W2803766250",
    "https://openalex.org/W2886240095",
    "https://openalex.org/W2963807198",
    "https://openalex.org/W2914333997",
    "https://openalex.org/W2063675532",
    "https://openalex.org/W2147927650",
    "https://openalex.org/W2753659610",
    "https://openalex.org/W2914512157",
    "https://openalex.org/W2053917126",
    "https://openalex.org/W145325731",
    "https://openalex.org/W2912819973",
    "https://openalex.org/W2991792334"
  ],
  "abstract": null,
  "full_text": "Palliative care needs-assessment and measurement tools used\nin patients with heart failure: a systematic mixed-studies review\nwith narrative synthesis\nBader Nael Remawi 1 & Amy Gadoud 1,2 & Iain Malcolm James Murphy 1,3 & Nancy Preston 2\n# The Author(s) 2020\nAbstract\nPatients with heart failure have comparable illness burden and palliative care needs to those with cancer. However, few of them\nare offered timely palliative care. One main barrier is the difficulty in identifying those who require palliative care. Several\npalliative care needs-assessment/measurement tools were used to help identify these patients and assess/measure their needs, but\nit is not known which one is the most appropriate for this population. This review aimed to identify the most appropriate palliative\ncare needs-assessment/measurement tools for patients with heart failure. Cochrane Library, MEDLINE Complete, AMED,\nPsycINFO, CINAHL Complete, EMBASE, EThOS, websites of the identified tools, and references and citations of the included\nstudies were searched from inception to 25 June 2020. Studies were included if they evaluated palliative care needs-assessment/\nmeasurement tools for heart failure populations in terms of development, psychometrics, or palliative care patient/needs identi-\nfication. Twenty-seven papers were included regarding nineteen studies, most of which were quantitative and observational. Six\ntools were identified and compared according to their content and context of use, development, psychometrics, and clinical\napplications in identifying patients with palliative care needs. Despite limited evidence, the Needs Assessment Tool: Progressive\nDisease – Heart Failure (NAT:PD-HF) is the most appropriate palliative care needs-assessment tool for use in heart failure\npopulations. It covers most of the patient needs and has the best psychometric properties and evidence of identification ability and\nappropriateness. Psychometric testing of the tools in patients with heart failure and evaluating the tools to identify those with\npalliative care needs require more investigation.\nKeywords Palliative care . Heart failure . Needs-assessment . Needs-measurement . Systematic review . Mixed-studies review .\nNarrative synthesis\nIntroduction\nPalliative care is defined by the World Health Organization\n(WHO) as “an approach that improves the quality of life of\npatients and their families facing the problem associated with\nlife-threatening illness…” [1]. It is a team-based, holistic ap-\nproach that aims to address the multidimensional needs of\npatients and families: physical, psychological, social, and spir-\nitual [1]. The basic palliative care needs of patients are man-\naged by the patient ’s usual care team (for example, primary\ncare practitioner, cardiologist, heart failure nurse), while more\ncomplex needs are managed by a multidisciplinary specialist\nteam with extensive training in palliative care [ 2, 3].\nPatients with heart failure have a significant symptom bur-\nden and palliative care needs [ 4, 5], which are comparable\nwith those with cancer [ 6, 7]. Several guidelines call for inte-\ngrating palliative care into standard heart failure management\n[8–10]. Providing palliative care to these patients results in an\nimprovement in their physical and psychological symptoms,\nquality of life, and satisfaction; increase in documentation of\ncare preferences; and decrease in the use of medical service\n[11–13]. Despite this, patients with heart failure have less\nElectronic supplementary material The online version of this article\n(https://doi.org/10.1007/s10741-020-10011-7) contains supplementary\nmaterial, which is available to authorized users.\n* Bader Nael Remawi\nb.remawi@lancaster.ac.uk\n1 Lancaster Medical School, Faculty of Health and Medicine,\nLancaster University, Lancaster LA1 4YG, UK\n2 International Observatory on End of Life Care, Faculty of Health and\nMedicine, Lancaster University, Lancaster LA1 4YG, UK\n3 Trinity Hospice and Palliative Care Services, Low Moor Road,\nBlackpool FY2 0BG, UK\nhttps://doi.org/10.1007/s10741-020-10011-7\nPublished online: 3 August 2020\nHeart Failure Reviews (2021) 26:137–155\naccess to palliative care than those with cancer, and most of\ntheir palliative care consultations occur late in their life [ 14].\nThere are many barriers to providing palliative care to patients\nwith heart failure [15, 16]. One major barrier is the difficulty in\nidentifying those who need palliative care [ 17].\nUsing structured research tools can aid in identifying pa-\ntients with heart failure who need palliative care [ 18].\nGenerally, these tools fall in one of two categories: those\npredicting end of life (prognostic tools) and those assessing/\nmeasuring patient needs (needs-assessment/measurement\ntools) [18]. Given the unpredictable trajectory of heart failure,\nprognostic tools are of limited value for identifying patients\nwith a high risk of mortality who can benefit from palliative\ncare [ 19]. The National Institute for Health and Care\nExcellence (NICE) guidelines do not recommend their use\nto determine if patients with heart failure need palliative care\nreferral [ 20]. These tools do not correlate strongly with the\npalliative care needs of heart failure populations [ 19]n o rd o\nthey account for the improvement in their quality of life [ 21].\nOn the other side, tools that focus on assessing/measuring\npatient needs, instead of predicting prognosis, are more appro-\npriate for the timely initiation of palliative care for patients\nwith heart failure [ 18, 22]. These tools can identify patient\nneeds early before evidence of poor prognosis [ 23], provide\na systematic assessment/measurement of patients ’ needs\nwhich are often underreported by patients or assessed/\nmeasured differently by healthcare professionals [ 24, 25], fa-\ncilitate discussion with the care team, and elicit patient pref-\nerences and goals of care [ 26].\nDespite their advantages, some challenges exist for the use\nof palliative care needs-assessment/measurement tools in\nheart failure populations. These tools require further evalua-\ntion to determine their ability to enhance the timely introduc-\ntion of palliative care in these patients [ 18]. Furthermore, most\nof these tools have not been widely implemented and few\nhave been specifically developed and validated for non-\ncancer conditions [ 27, 28]. Several factors should be taken\ninto consideration when selecting the most appropriate palli-\native care needs-assessment/measurement tool, including the\naim of assessment, target patients, patient capabilities, clinical\nsettings, administration mode, and its psychometric and prac-\nticality properties [ 27]; the latter defined as the burden of\ncompleting the tool on respondents (acceptability) and admin-\nistrators (feasibility) [29, 30].\nThe intended use of the tools is another important factor to\nguide the selection of appropriate tools [ 31]. While some tools\nare mainly used as screening instruments to identify patients\nwho require palliative care based on their deteriorating health\nand potential palliative care n eeds (patient identification\ntools), others are primarily used to provide a more holistic\nevaluation of those unmet needs (needs identification tools)\n[32]. Furthermore, while some tools are designed to measure\npatient needs (needs-measurement tools), others are designed\nto assess these needs as clinical decision aids (needs-\nassessment tools) [ 33]. Needs-measurement tools enable\nscreening, monitoring, and scoring patient needs over time\nto track changes in health status and evaluate the effectiveness\nand quality of provided care [ 34]. When used alone, these\ntools may not trigger healthcare professionals to act on the\nidentified needs as they may lack the skills and knowledge\nto interpret the scores [ 35, 36]. Therefore, they may have little\ncontribution to clinical decision-making on their own [37]. On\nthe other hand, needs-assessment tools, as clinical decision\naids, facilitate the evaluation of patient needs, assignment of\nactions to address those needs, and understanding of care op-\ntions and outcomes [ 33, 38]. These tools are ideally used as\nadjuncts to patient counseling to assist healthcare profes-\nsionals in making the most appropriate decisions on patient\ncare [33]. They are not intended to be prescriptive or used as\nan endpoint in themselves, but rather as a support and starting\npoint for patient-centered care [ 33].\nComparisons between palliative care needs-assessment/\nmeasurement tools used in heart failure populations are\nlacking. It is not known which tools are better for palliative\ncare patient/needs identific a t i o na n dw h i c hh a v et h eb e s t\npsychometric and practicality evidence in these patients.\nThere are no systematic revi ews to critique these tools in\nidentifying patients with heart failure who have palliative\ncare needs. Three systematic reviews demonstrated tools\nt h a tc o u l db eu s e dt oi d e n t i f yp a lliative care patients in pri-\nmary care settings [ 28, 32, 39]. However, these were not\nspecific to heart failure populations and limited to one set-\nting. Another review of palliative care needs-assessment\ntools used in patients with chronic heart failure was not\nsystematic, nor did it compare the psychometric properties\nin detail [ 18]. A comprehensive comparison between palli-\native care needs-assessment/measurement tools used in\nheart failure populations is needed to determine the most\nappropriate tools for identifying patients who require palli-\native care and assessing/measuring their needs.\nSubsequently, these needs can be acted upon to improve\npatients’quality of life.\nReview question\nWhat are the most appropriate palliative care needs-assess-\nment/measurement tools for use in patients with heart failure?\nReview objectives\n1 Identify palliative care nee ds-assessment/measurement\ntools used to identify patients with heart failure who have\npalliative care needs.\n2 Compare these tools regarding their content (included\nitems, length, addressed need domains) and context of\nuse (clinical settings, completion method).\n138 Heart Fail Rev (2021) 26:137–155\n3 Compare the development and intended use of the tools.\n4 Compare the psychometric and practicality properties of\nthe tools in patients with heart failure.\n5 Compare the clinical applications of the tools in identify-\ning patients with heart failure who have palliative care\nneeds.\nMethods\nThe review protocol was registered with the International\nProspective Register of Sys tematic Reviews (PROSPERO)\non December 2018 under registration number\nCRD42018118376. Quantitative, qualitative, and mixed-\nmethods studies were included in the review to maximize\nthe evidence on using the tools in patients with heart failure,\nwhere limited research is available [ 40]. The review was\nwritten following the guidance of the adapted Preferred\nReporting Items for Systematic Reviews and Meta-\nAnalyses (PRISMA) for reporting systematic reviews of\nqualitative and quantitative evidence [ 41]. Covidence on-\nline software program was used to facilitate systematic re-\nview management.\nInclusion/exclusion criteria\nStudies were included if they met all these criteria:\n& Included adults 18 years of age or older with a primary\ndiagnosis of heart failure.\n& Evaluated palliative care needs-assessment/measurement\ntools, defined as structured multi-item research instru-\nments developed for identifying palliative care patients/\nneeds.\n& Evaluated more commonly used tools, defined as those\nwhich were used for identifying heart failure populations\nwith palliative care needs in more than one study retrieved\nthrough the review search.\n& Aimed to evaluate the tools in terms of development, psy-\nchometrics or practicality, or palliative care patient/needs\nidentification.\n& Primary empirical quantitative, qualitative, or mixed-\nmethods studies where quantitative and qualitative data\nwere combined at the stage of data collection and/or\nanalysis.\n& Published in English or Arabic.\nStudies that evaluated guidelines, pathways, and individual\nitems were excluded. Case reports, opinion pieces, editorials,\ncommentaries, letters, retrospective studies, reviews, and sec-\nondary research were also excluded.\nSearch strategy\nA sensitive search strategy was applied to retrieve relevant\nstudies and tools after consulting experienced librarians.\nCochrane Library, MEDLINE Complete (EBSCO), AMED\n(EBSCO), PsycINFO (EBSCO), CINAHL Complete\n(EBSCO), and EMBASE (Ovid) were searched from incep-\ntion to 25 June 2020. The following secondary resources were\nalso searched: websites of the retrieved tools where available,\nEThOS for United Kingdom ’s( U K’s) doctoral research the-\nses, and citing and cited articles of the included studies. Search\nterms for palliative care , heart failure ,a n d tool were com-\nbined in each database using both free-text terms and\nMedical Subject Headings (MeSH) where available\n(Table 1). The search strategy for EMBASE (Ovid) is present-\ned in Supplemental Table 1. Duplicates were removed from\nthe retrieved records using EndNote X8 and Covidence.\nTable 1 Key search terms used in\nthe review Key search terms*\nConcept 1 Palliative care OR Terminal care OR Long-term care OR End of life care OR Hospice OR\nAdvance care planning\nConcept 2 Heart failure OR Cardiac failure OR Ventricular dysfunction OR Low cardiac output OR Dilated\ncardiomyopathy OR Congestive cardiomyopathy OR Cardiogenic shock\nConcept 3 Tool OR Survey OR Questionnaire OR Checklist OR Inventory OR Scale OR Instrument OR\nIndicator OR Measure OR Index OR Model OR Criteria OR Calculator OR Score\nFilters/limits\nPopulation Human\nLanguage English or Arabic\nStudy\ndesign\nEmpirical research\nDate No limits\nSettings No limits\n*These terms are not exhaustive. An example of a comprehensive search strategy for EMBASE (Ovid) is shown\nin Supplemental Table 1\n139Heart Fail Rev (2021) 26:137–155\nStudy/tool selection\nTitles and abstracts of retrieved studies were screened by the\nmain author (BR). A second reviewer (IM) screened 10% of\nthem independently. The agreement rate for the studies\nscreened was 97% which demonstrated a high level of\nagreement. Full texts of potentially relevant studies were\nscreened by BR to determine their eligibility, while IM\nscreened 25% of those independently as the agreement rate\nwas 80%. Discrepancies were resolved through discussion\nwhich helped identify screening issues and discuss the in-\nclusion criteria. A third reviewer (AG or NP) was consulted\nwhen necessary.\nData collection\nData extraction tables were created for the included studies.\nThey were piloted first on a sample of studies and continu-\nously amended until the final versions were developed.\nExtracted data included study design, objectives, popula-\ntion, settings, and country; method of and reason for tools ’\ndevelopment; results of psychometric and practicality test-\ning; method of identifying patients requiring palliative care\nand their needs; and results of tools ’applications in pallia-\ntive patient/needs identification. Relevant data were ex-\ntracted from the included papers by BR. IM extracted data\nfrom about half of the papers independently. All disagree-\nments were resolved through discussion which helped iden-\ntify extraction issues and refine the data extraction tables.\nThere was no need to refer to the third reviewer. First au-\nthors of the included studies were contacted by email to\nclarify vague information if necessary, and all of them\nresponded. Data were also extracted from the tools them-\nselves and their associated guides if available. Extracted\ndata included primary instruments from which the tools\nwere adapted, settings of use, completion method and time,\nand involved items and need domains. The latest edition/\nversion of each tool at the time of synthesizing the evidence\nwas compared with the others.\nCriteria to assess tools ’ psychometrics and practicality\nThe psychometric and practicality properties of the in-\ncluded tools were assessed by BR using the Oxford\nPatient-Reported Outcome Measures (PROMs) Group\ncriteria for selecting PROMs in clinical trials [ 31].\nAlthough the tools in this review were not all PROMs,\nthis seemed the most appropriate tool to use as it provides\ndetailed guidance on how to assess each of these criteria.\nAmong the eight criteria suggested by the Oxford PROMs\nGroup, the five which have been more often used and\ncited on standard checklists and discussions were\ncompared: Acceptability, F easibility, Reliability,\nValidity, and Responsiveness [ 31].\nQuality appraisal\nTo assess the quality of the heterogeneous studies (quanti-\ntative, qualitative, and mixed methods), Hawker et al. ’st o o l\nfor appraising disparate data was used [ 42]. This instrument\nassesses the quality of studies based on nine criteria which\ncan be scored from one (very poor) to four (good). The\nminimum and maximum possibl e scores per study are nine\nand 36, respectively. The methodological quality of the in-\ncluded studies was described and considered in the synthe-\nsis stage. Studies were not excluded based on their method-\nological rigor or assigned scores. Quality assessment of the\nincluded papers was performed by BR, while IM assessed\nthe quality of about half of them independently.\nDisagreements were resolved through discussion which\nhelped identify quality apprai sal issues and critique the\nstudies more thoroughly. There was no need to refer to the\nthird reviewer.\nSynthesis method\nNarrative synthesis, guided by Popay et al. ’s framework, was\nused to synthesize the findings from the heterogeneous studies\n[43]. Tools were described narratively, and studies were tab-\nulated and grouped according to the evaluated tool and their\napplication to discover patterns within and across the groups.\nSubsequently, relationships were explored within and be-\ntween the studies. The synthesis process was then critiqued\nwhere the limitations of the synthesis methodology, influence\nof low-quality studies on the synthesis results, made assump-\ntions, and areas for future research were highlighted.\nSynthesizing the evidence from the included studies was car-\nried out by BR.\nResults\nStudy selection\nThe search strategy for the primary and secondary resources\nretrieved a total of 46,212 records, which were reduced to\n33,135 after removing duplicates. The titles/abstracts of these\npapers were screened for relevance and meeting the inclusion\ncriteria, resulting in 308 papers for full-text screening. Among\nthese, 27 papers were included in the review about 19 studies.\nThe included studies differ in their design: ten were quantita-\ntive [ 19, 44–54], one qualitative [ 55], and eight of mixed-\nmethods design [ 26, 56–68]. All studies were observational\nexcept for one interventional study [ 61–64], one pilot study\n140 Heart Fail Rev (2021) 26:137–155\n[59], and one feasibility study [ 26, 56]. The PRISMA flow\ndiagram of study selection is presented in Fig. 1 [69].\nThe included papers were classified into three categories\nbased on how the included tools were evaluated: development\nstudies, psychometrics/practicality studies, and palliative care\npatient/needs identific ation studies (identification studies)\n(Table 2). Some studies fitted into more than one category\nas they were used for more than one purpose. There were five\ndevelopment studies, five psychometrics/practicality studies,\nand 17 identification studies. Quality scores of studies ranged\nfrom 22 to 35 with a median of 29, indicating moderate to\ngood quality.\nIdentifying palliative care needs-\nassessment/measurement tools used to identify\npatients with heart failure who have palliative care\nneeds\nSeveral tools were found that had been or could be used for\nidentifying patients with heart failure who require palliative\ncare. Among these, six palliative care needs-assessment/mea-\nsurement tools were identified as per the inclusion criteria and\ncompared:\n1 Integrated Palliative care Outcome Scale (IPOS) [ 55]\nRecords iden/g415ﬁed through \ndatabase searching\n(n = 44,384)*\nTotal records screened\n(n = 33,135)\nFull-text ar/g415cles assessed \nfor eligibility\n(n = 308)\nRecords excluded (n = 32,827)\n-Not mee/g415ng inclusion criteria \n(n=32,735)\n-Unavailable full texts (n=92)\nAr/g415cles included in \nnarra/g415ve synthesis\n(n = 27)\nRecords excluded (n = 281)\n-Outcome ﬁndings for adults \ncould not be analysed separately \n(n=1)\n-Outcome ﬁndings for HF \npa/g415ents could not be analysed \nseparately (n=11)\n-HF pa/g415ents not included (n=1)\n-No informa/g415on if HF pa/g415ents \nwere included (n=16)\n-Not evalua/g415ng PC needs-\nassessment/measurement tools \n(n=183)\n-Tools assessed for iden/g415fying \nHF pa/g415ents with PC needs in one \nretrieved study only (n=11)\n-Main study aim was not to \nevaluate tools’ development, \npsychometrics/prac/g415cality in HF \npa/g415ents, or PC pa/g415ent/needs \niden/g415ﬁca/g415on (n=7)\n-Inappropriate study design \n(n=51)\nRecords iden/g415ﬁed through \nother sources\n(n = 1,828)\nnoitacifitnedIScreeningEligibilityIncluded\nDuplicates removed\n(n = 13,077)\nFig. 1 PRISMA flow diagram of study selection. HF heart failure, PC\npalliative care. *Cochrane Library, MEDLINE Complete, AMED,\nPsycINFO, CINAHL Complete, and EMBASE were originally\nsearched from inception to 4 January 2019. The latest search update\nwas run in these databases on 25 June 2020 except for CINAHL\nComplete because of end of subscription\n141Heart Fail Rev (2021) 26:137–155\n2 Gold Standards Framework - Proactive Identification\nGuidance (GSF-PIG) [ 70]\n3 Radboud Indicators for Palliative Care Needs (RADPAC)\n[60]\n4 Supportive and Palliative Care Indicators Tool (SPICT)\n[65]\n5 Needs Assessment Tool: Pr ogressive Disease - Heart\nFailure (NAT:PD-HF) [58]\n6 Necesidades Paliativas - Palliative Needs (NECPAL) [ 66]\nComparing the tools regarding their content and\ncontext of use\nThe main features and comparisons of the tools are displayed\nin Table 3. All tools were based on previous tools that in-\nformed their development except RADPAC, which was in-\nformed by extracting indicators used for identifying patients\nwith palliative care needs from the literature [ 60]. Some tools\nwere derived from each other which explains their similarities.\nTable 2 List of the included tools\nand corresponding evaluation\nstudies with their overall quality\nscores using Hawker et al. ’s tool\nTool Development\nstudy\nQuality\nscore*\nPsychometrics/\npracticality study\n#\nQuality\nscore*\nIdentification\nstudy\nQuality\nscore*\nIPOS Schildmann\net al. [ 55]\n32 Kane et al. [ 56]2 9 K a n e e t a l . [ 56]\nKane et al. [ 26]\n(follow-up paper)\n29\n30\nRoch et al. [ 57]2 8 R o c h e t a l . [ 57]2 8\nGSF-PIG -- -- -- -- Milnes et al. [ 44]2 7\nHaga et al. [ 19]3 0\nGardiner et al. [ 46]\nRyan et al. [ 45]\n(follow-up paper)\n28\n30\nPandini et al. [ 47]2 4\nRADPAC Thoonsen et al.\n[60]\n27 -- -- Thoonsen et al. [ 61]\n(protocol)\nThoonsen et al. [ 62]\nThoonsen et al. [ 63]\n(follow-up paper)\nThoonsen et al. [ 64]\n(follow-up paper)\nNA\n32\n32\n29\nSPICT Highet et al.\n[65]\n27 -- -- Highet et al. [ 65]2 7\nHamano et al. [ 48]2 6\nHamano et al. [ 49]2 9\nNAT:PD-HF Waller et al.\n[58]\n30 Waller et al. [ 58] 30 Waller et al. [ 58]3 0\nJanssen et al. [ 59] 35 Janssen et al. [ 59]3 5\nCampbell et al.\n[51]\n28 Campbell et al. [ 50]\n(protocol)\nCampbell et al. [ 51]\nNA\n28\nNECPAL Gómez-Batiste\net al. [ 66]\n24 -- -- Gómez-Batiste et al.\n[66]\nGómez-Batiste et al.\n[67] (follow-up\npaper)\nAmblàs-Novellas\net al. [ 68]\n(follow-up paper)\n24\n30\n29\nde-la-Rica-Escuín\net al. [ 52]\n30\nOrzechowski et al.\n[53]\n23\nGastelurrutia et al.\n[54]\n22\nNA not applicable. These papers are study protocols with no results to critique and therefore could not be assigned\na total score in Hawker et al. ’st o o l\n*Scores are out of 36\n# Some studies in this column were not designed to test psychometrics/practicality but some data on these aspects\nwere indirectly provided\n142 Heart Fail Rev (2021) 26:137–155\nTable 3 Main features and comparisons of the tools\nTool IPOS (version 1) GSF-PIG (6th\nedition, 2016)\nRADPAC\n(original)\nSPICT (April\n2019)\nNAT:PD-HF\n(original)\nNECPAL\n(version 3.1,\n2017)\nMain tools from\nwhich the tool\nwas adapted\nPOS, POS-S, APCA\nAfrican POS\nNHPCO tool -- NHPCO tool,\nGSF-PIG, PPS,\nPPI\nPC-NAT GSF-PIG,\nSPICT\nGeneric vs\nHF-Specific\nGeneric Generic Generic Generic HF-Specific Generic\nClinical settings\nDiseases for which\nthe tool can be\nused\nMultiple (including\nheart failure)\nMultiple (including\nheart disease)\nMultiple (cancer,\ncongestive\nheart failure,\nCOPD)\nMultiple\n(including\nheart/vascular\ndisease)\nChronic heart failure Multiple\n(including\nchronic\nheart\ndisease)\nClinical settings\nfor tool use\nMultiple Multiple Primary\ncare/general\npractice\nMultiple Multiple Multiple\nCompletion method\nCompleted by Healthcare\nprofessionals (staff\nversion), patients\n(patient version)\nHealthcare\nprofessionals\nPrimary care\npractitioners\nHealthcare\nprofessionals\nHealthcare\nprofessionals\nHealthcare\nprofes-\nsionals\nObjective vs\nsubjective*\nSubjective Objective,\nsubjective\nObjective,\nsubjective\nObjective,\nsubjective\nSubjective Objective,\nsubjective\nItems\nSurprise Question X ✓ XXX ✓\nGeneral indicators\nof health decline\nor PC need\nX ✓ X ✓ X ✓\nDisease-specific\nindicators of\nhealth decline or\nPC need\nX ✓✓ ✓ X ✓\nOpen questions ✓ XX X X X\nLength\nNumber of items\n(for HF patients)\n17 (+ 2 open questions) 17 7 9 20 18\nAverage time for\ncompletion\nStaff version: 2–5m i n\nP a t i e n tv e r s i o n :8m i n\n-- -- --\n(Older versions:\n5–7.5 min)\n5–10 min.\n(Dutch version:\n26 min)\n--\n(Older version:\n2–8m i n )\nMinimal criteria to\nidentify HF\npatients who\nrequire PC\n-- SQ+, or general\nindicators, or two\nHF-specific indi-\ncators\n-- Any general\nindicator or the\nHF-specific in-\ndicator\n-- SQ+ plus any\nother\nparameter\nNeed domains\nPhysical ✓✓ ✓ ✓ ✓ ✓\nPsychological ✓✓ XX ✓✓\nSocial ✓ XX X ✓✓\nSpiritual ✓ XX X ✓ X\nOthers Informal carer,\ninformation,\nfinancial/personal\n-- -- Informal carer Informal carer,\ninformation,\nfinancial/legal,\ntreatment regimens\n--\nAPCA, African Palliative Care Association; COPD, Chronic Obstructive Pulmonary Disease; HF, heart failure; NHPCO, National Hospice and\nPalliative Care Organization; PC, palliative care; PC-NAT, Palliative Care-Needs Assessment Tool; POS, Palliative care Outcome Scale; POS-S,\nPalliative care Outcome Scale-Symptoms; PPI, Palliative Prognostic Index; PPS, Palliative Performance Scale. SQ+: a negative answer to the\nSurprise Question (healthcare professionals would not be surprised if the patient dies within the next year)\n*Objective: medical records. Subjective: clinical judgement or patient/informal caregiver input\n143Heart Fail Rev (2021) 26:137–155\nIncluded items\nThe tools include different items to identify patients with\npalliative care needs. GSF-PIG and NECPAL include the\nsurprise question ( would you be surprised if the patient\ndies in next year? ) as the first step for identification [ 71],\nfollowed by general and disease-specific indicators of\nhealth decline. SPICT does not have the surprise question\nbut includes general and diseas e-specific indicators, while\nRADPAC has only disease-specific indicators. In all these\ntools, a set of indicators specific to heart failure, or heart\ndisease, exists. On the other hand, IPOS and NAT:PD-HF\ndo not have indicators for patient identification. Instead,\nthey include items that evaluate a variety of patient needs.\nIPOS consists of open-ended questions about patient main\nproblems and unlisted sympt oms alongside closed-ended\nquestions on patient and caregiver needs which are an-\nswered using a Likert scale. It provides a total score\nwhichprovides measurement of the overall patient needs.\nNAT:PD-HF consists of four se ctions that address patient\nand caregiver needs: priority referral for further\nassessment, patient wellbeing , caregiver/family ability to\ncare for patient ,a n d caregiver wellbeing . Needs identi-\nfied in the last three sections can be rated according to\ntheir significance: none, some/potential ,a n d significant .\nMoreover, actions are suggested for these needs: direct\nmanagement by the healthcare professional , management\nby another care team member ,a n d referral to members\noutside the team .\nClinical settings\nOnly NAT:PD-HF is specific for use in patients with heart\nfailure [58]. All other tools can be used in multiple diseases.\nRADPAC was developed for use in primary care [ 60], while\nthe other tools can be used in different healthcare settings.\nCompletion method\nOther than IPOS which has a version for staff completion\nand another for patient comp letion, all tools were de-\nsigned to be completed by hea lthcare professionals with\ninteraction from patients or informal caregivers. All tools\nhave a subjective element of completion where healthcare\nprofessionals use their clinical judgement (for example, to\nassess symptoms severity or health decline )o rw h e r e\npatients/caregivers provide their input (for example, to\nrequest for palliative care or rate their symptoms ).\nFurthermore, GSF-PIG, RADPAC, SPICT, and\nNECPAL require information from patients ’ medical re-\ncords such as the number of hospitalizations and weight.\nLength\nThe length of tools varies with a range of seven items for\ncompletion (RADPAC) to 20 items (NAT:PD-HF). IPOS\nand NAT:PD-HF contain more items than other tools and\nalthough they may take longer to complete, they provide a\nmore comprehensive evaluation of patient needs. SPICT and\nNECPAL need less than 8 min to fill [ 72–74]. IPOS patient\nversion takes about 8 min for completion while the staff ver-\nsion takes about 2 to 5 min [ 75]. NAT:PD-HF needs about 5 to\n10 min [ 27], although its Dutch translation needed an average\nof 26 min to be completed by heart failure nurses who were\nuntrained in palliative care [ 59].\nAddressed need domains\nNAT:PD-HF covers more palliative care needs than any other\ntool, including the key need domains advocated by the WHO:\nphysical, psychological, social, and spiritual [ 1]. It is the only\ntool that asks if patients have issues in managing their medi-\ncation and treatment regimens. IPOS is also comprehensive\nand addresses most of the need domains contained in\nNAT:PD-HF. NECPAL misses the spiritual issues, while\nGSF-PIG, RADPAC, and SPICT address mainly the physical\nsymptoms of patients.\nIn summary, NAT:PD-HF and IPOS outweigh other tools\nregarding the content and context of use. Both can be used in\nmultiple clinical settings, completed in a reasonable time\nframe without reviewing patient medical records, provide a\ncomprehensive assessment/measurement of patient and infor-\nmal caregiver needs, and address more palliative care needs\nthan other tools. Compared with NAT:PD-HF, IPOS has a\npatient version for completion which can decrease staff bur-\nden, includes open questions which enable patients to outline\ntheir main problems and unlisted symptoms, and requires less\ntime for filling. However, unlike NAT:PD-HF, IPOS does not\nexplicitly address treatment complexity among patient needs,\nneither does it have a correspondent action to be taken for the\nidentified concerns.\nComparing the development and intended use of the\ntools\nNone of the tools was originally developed for use in patients\nwith heart failure. Only NAT:PD-HF was adapted specifically\nfor use in these patients from a similar tool for patients with\ncancer [58]. All other tools are generic but have been used for\npatients with heart failure. A heart failure specific version of\nIPOS has not been formally tested yet [ 76]. All tools were\ndeveloped in high-income countries, and half of them\n(IPOS, GSF-PIG, SPICT) were developed in the UK. The\nclinical expertise of healthcare professionals contributed to\ntools ’ development. Similarly, literature reviews were\n144 Heart Fail Rev (2021) 26:137–155\nconducted to aid in the development of all tools except GSF-\nPIG [70]. Interestingly, all tools have an original development\npaper except GSF-PIG. In conclusion, GSF-PIG\nunderperforms compared with other tools in this comparison\naspect.\nGSF-PIG, RADPAC, SPICT, and NECPAL were de-\nveloped to identify patients who require palliative care\n(patient identification tools )[ 60, 65, 66, 70], while\nIPOS and NAT:PD-HF were developed to provide a more\ncomprehensive evaluation of the palliative care needs of\npatients ( needs identification tools )[ 55, 58]. The patient\nidentification tools were mainly developed as clinical de-\ncision aids which can be used during patient consultation\nto decide whether patients require palliative care and sub-\nsequently to prompt more holistic needs-assessment/mea-\nsurement. SPICT, for example, is recommended to be\nused alongside IPOS to get a more complete picture on\npatient needs [ 77]. IPOS, on the other hand, was devel-\noped as an outcome measure to identify and score patient\nsymptoms and concerns. It does not provide recommen-\ndations on how to address the identified needs and thus,\nclinical decision support tools are needed to interpret its\nscores [ 33]. NAT:PD-HF is not an outcome measure. It is\nmainly used as a clinical decision aid during patient con-\nsultation to classify the level of concern (none, some,\nsignificant) and triage actions for each identified need\n(managed directly, managed by other care team member,\nreferral required). The main purpose and intended use of\nthe tools are summarized in Table 4.\nComparing the psychometric and practicality\nproperties of the tools in patients with heart failure\nIn the general population, IPOS and SPICT have the best\nevidence of validity, reliability, and practicality [ 55, 65, 72,\n73, 78–84], followed by NECPAL and RADPAC [ 60, 66],\nwhile no formal validation studies were found for GSF-PIG.\nStill, the psychometric and practicality properties of the tools\nwere rarely assessed in heart failure populations (Table 5).\nOnly NAT:PD-HF (Original NAT:PD-HF), its Dutch transla-\ntion (Dutch NAT:PD-HF), IPOS (Original IPOS), and its\nGerman translation (German IPOS) had their practicality\nproperties tested in these patients [ 56–59]. Besides, only\nOriginal NAT:PD-HF and Dutch NAT:PD-HF had some of\ntheir psychometric properties tested in this population [ 51, 58,\n59].\nAcceptability Acceptability of the tools to patients was only\ntested for Original NAT:PD-HF, Dutch NAT:PD-HF,\nOriginal IPOS, and German IPOS. Although acceptability of\nNAT:PD-HF versions was not directly assessed from the per-\nspective of patients, it was assessed using other parameters\nsuch as time to complete and translation and cultural\napplicability [31]. Overall, both IPOS versions and Original\nNAT:PD-HF were acceptable, with more evidence in favor of\nIPOS [56–58]. On the contrary, Dutch NAT:PD-HF had neg-\native evidence of acceptability [ 59].\nFeasibility Feasibility of the tools for healthcare professionals\nwas only tested for Original NAT:PD-HF, Dutch NAT:PD-\nHF, and Original IPOS. While Original IPOS and Original\nNAT:PD-HF were feasible (easy to complete in a short time)\n[56, 58], Dutch NAT:PD-HF had negative evidence of feasi-\nbility [59].\nReliability Reliability was only assessed for Original\nNAT:PD-HF [ 58]. Results of testing inter-rater reliability\nshowed good agreement between the raters for each tool item.\nInternal consistency and test-retest reliability were not tested.\nValidity Validity was only assessed for Original NAT:PD-HF\nand Dutch NAT:PD-HF. Original NAT:PD-HF showed good\nface, content, and concurrent (construct) validity [ 51, 58].\nConstruct validity was tested in one study by identifying the\nTable 4 Main purpose\nand intended use of the\ntools\nTool* IPOS\n(version\n1)\nGSF-PIG\n(6th edition,\n2016)\nRADPAC\n(original)\nSPICT\n(April 2019)\nNAT:PD-HF\n(original)\nNECPAL\n(version 3.1,\n2017)\nPatient\nidentification\n✓✓ ✓ ✓\nNeeds\nidentification\n✓✓\nNeeds\nassessment/\ndecision aids\n✓✓ ✓ ✓ ✓\nNeeds\nmeasurement\n✓\n*This classification should not be considered rigid as there can be some overlap in these applications\n145Heart Fail Rev (2021) 26:137–155\ncorrelation between the items in the NAT:PD-HF patient\nwellbeing section and corresponding items from the Heart\nFailure Needs Assessment Questionnaire (HFNAQ) [ 58]. In\nanother study which was not designed to test the tool psycho-\nmetrics, a statistically significant relationship was found between\nhaving a significantconcern on any item in the NAT:PD-HF\npatient wellbeingsection and the construct of specialist palliative\ncare needs as defined by the authors (persistently severe impair-\nment of any of four PROMs without improvement, or severe\nimpairment immediately preceding death) (p =0 . 0 0 8 )[51]. The\nother tool sections were not tested for construct validity in both\nstudies. In contrast to Original NAT:PD-HF, Dutch NAT:PD-HF\nshowed poor construct and criterion validity [ 59]. These were\ntested by identifying the correlation between some items of\nDutch NAT:PD-HF and three outcome measures: Dutch\nEdmonton Symptom Assessment System (ESAS), Australia-\nmodified Karnofsky Performance Scale (AKPS), and Family\nAppraisal of Caregiving Questionnaire for Palliative Care\n(FACQ-PC). Of note, the evaluating study was a pilot study\nand not designed to test the tool’s validity.\nResponsiveness Responsiveness was not evaluated for any\ntool.\nIn conclusion, Original NAT:PD-HF is the most extensive-\nly tested and psychometrically robust tool in heart failure pop-\nulations. It is the only tool validated in this population and has\nsome evidence of reliability. Also, it is feasible for healthcare\nprofessionals and has some evidence of acceptability to pa-\ntients. Although IPOS has more acceptability evidence than\nNAT:PD-HF, its psychometrics has not been tested in heart\nfailure populations. Psychometrics and practicality of the oth-\ner tools were not tested at all in this population.\nComparing the clinical applications of the tools in\nidentifying patients with heart failure who have\npalliative care needs\nThe characteristics of the identification studies are shown\nin Supplemental Table 2. Detailed results of the tools ’\napplications in identifying heart failure populations with\npalliative care needs are presented in Supplemental\nTable 3.\nBreadth of tools ’ application in heart failure populations\nFew identification studies were found for each tool. GSF-\nPIG and NECPAL were the most commonly evaluated\n(four studies each) [ 19, 44–47, 52–54, 66–68], followed\nby SPICT and NAT:PD-HF [ 48–51, 58, 59, 65]( t h r e e\nstudies each), IPOS (two studies) [ 26, 56, 57], and lastly\nRADPAC (one study) [ 61–64]. GSF-PIG was evaluated in\nmore countries than other tool s (four countries), followed\nby NAT:PD-HF (three countries). NECPAL was evaluat-\ned in diverse healthcare settings, while IPOS, GSF-PIG,\nSPICT, and NAT:PD- HF were evaluated for inpatients\nand outpatients. More patients with heart failure were\nscreened by NAT:PD-HF and NECPAL compared with\nother tools. Baseline data for the tools-screened patients\nwere described in more detail in NAT:PD-HF and IPOS\nstudies. While NAT:PD-HF was evaluated for several\ntypes and classes of heart failure and was the only tool\nevaluated for those with acute on chronic heart failure,\npatients who lacked the cognitive capacity to participate\nor consent were excluded from its studies.\nTable 5 Psychometric and\npracticality properties of the tools\nin patients with heart failure,\nusing the Oxford Patient-\nReported Outcome Measures\nGroup criteria\nTool Acceptability Feasibility Reliability Validity Responsiveness\nIPOS (original, patient version 1,\n7-day recall)\n+++ +++ 0 0 0\nIPOS (Gemran, patient version,\n3-day recall)\n++ 0 0 0 0\nGSF-PIG 0 0 0 0 0\nRADPAC 0 0 0 0 0\nSPICT 0 0 0 0 0\nSPICT (Japanese, SPICT-J) 0 0 0 0 0\nNAT:PD-HF (original) + +++ + ++ 0\nNAT:PD-HF (Dutch) –– 0 – 0\nNECPAL 0 0 0 0 0\n– = evidence does not support criteria\n0 = not reported or no evidence in favor\n+ = some limited evidence in favor\n++ = some good evidence in favor, but some aspects do not meet criteria or some aspects not reported\n+++ = good evidence in favor\n146 Heart Fail Rev (2021) 26:137–155\nUse for palliative care patient/needs identification\nAll tools were used to identify palliative patients (patient iden-\ntification) and evaluate their needs (needs identification) ex-\ncept RADPAC which was mainly applied by the authors to\nidentify palliative patients [ 61–63]. When used for patient\nidentification, GSF-PIG (in one study) and RADPAC were\ncombined with a more comprehensive needs-assessment/mea-\nsurement tool [ 45, 46, 61, 62].\nAbility and appropriateness of the tools for palliative care\npatient/needs identification\nThe proportion of patients with heart failure identified by the\ntools for palliative care among those screened was considered\nan indicator of their identification ability. This could not be\ncalculated in many studies because of missing or vague data\nand the lack of a clear gold standard of what a palliative care\npatient is. RADPAC-trained primary practitioners identified\nonly 6% of patients with heart failure in a randomized con-\ntrolled trial [ 62]. One year after training, these trained prac-\ntitioners did not identify any patient, while those untrained\nidentified more patients shortly after RADPAC administra-\ntion [ 63]. SPICT identified only a few patients with heart\nfailure although the proportion in one study was mislead-\ningly high because of the small sample size [ 48]. GSF-PIG\nidentified 86% of patients with heart failure in one study\n[19], while NECPAL identified 32%, 55%, and 91% in\nthree studies [ 53, 54, 67]. IPOS and NAT:PD-HF identified\n56% and 26% of patients with heart failure for specialist\npalliative care, respectively [ 51, 57]. NAT:PD-HF identi-\nfied 100% of patients for palliative care in another study\n[59].\nThe baseline health characteristics and morbidity out-\ncomes of idenitified patients were considered an indicator\nof the appropriateness of identification by the tools.\nHowever, this was not reported in most studies. The tool\nis robust if the patients it identified for palliative care had\nevidence of poor health. Poor health at baseline, evidenced\nby poor scoring in patient outcome measures, long or fre-\nquent hospitalizations, old age, and/or New York Heart\nAssociation (NYHA) class III-IV, was shown for many pa-\ntients identified by IPOS [ 57], GSF-PIG [ 19, 45, 46],\nNAT:PD-HF [ 51, 59], and NECPAL [ 53, 54]. Likewise,\nbetter health at baseline, evidenced by NYHA class I –II,\nwas observed in many patients who reported few significant\npsychological, social, and spiritual concerns in NAT:PD-HF\n[58]. Morbidity outcomes at follow-up periods of identified\npatients were only presented briefly in one GSF-PIG study,\nwhere identified patients did not have significantly more\nhospitalizations within a 1-year follow-up period as would\nhave been expected [ 19].\nImpact of the tools\nThree tools were incorporated into palliative care interven-\ntions where healthcare professionals were trained on using\nthe tools to identify, and subsequently act on, the palliative\ncare needs of patients [ 56, 59, 61, 62]. IPOS, RADPAC, and\nDutch NAT:PD-HF had no significant positive impact on pa-\ntients with heart failure or th eir informal caregivers. The\nIPOS-based intervention resulted in mild improvement in\nthe quality of life, symptom burden, and depression, though\nthis was often transient and got worse at further follow-up\nperiods [ 56]. Similarly, symptom burden, physical function-\ning, care dependency, and caregiver burden were not signifi-\ncantly improved after the Dutch NAT:PD-HF intervention\nand health status got significantly worse [ 59]. Additionally,\nit did not influence the recording of advance directives or\nhospital and emergency room visits. Of note, the studies that\nevaluated the intervention effect of IPOS and Dutch NAT:PD-\nHF were pilot/feasibility studies and not designed to test their\neffectiveness [56, 59]. In contrast, the RADPAC intervention\neffect was evaluated in a cluster randomized controlled trial\nwhere primary care practitioners used the tool to identify pa-\ntients with palliative care needs [ 61, 62]. RADPAC interven-\ntion did not result in a significant difference between deceased\npatients of RADPAC-trained practitioners and those of un-\ntrained practitioners in the number of contacts with out of\nhours primary care service (primary outcome measure), con-\ntacts with own primary care practitioner, hospitalizations, and\nplace of death (secondary outcome measures). In a post hoc\nanalysis, identified patients from the trained group (only two\nwith heart failure) had significantly better secondary outcome\nmeasures compared with all other patients, but the primary\nmeasure was not different.\nPerspectives of healthcare professionals and patients\non using the tools for identification\nThe three interventions described above were followed by\ninterviews with healthcare professionals and/or patients to\nevaluate their perspectives on using the tools for identification\n[26, 59, 64]. The emerged themes were mainly positive for\nIPOS and RADPAC and negative for Dutch NAT:PD-HF. A\ncommon positive theme on IPOS and RADPAC was the iden-\ntification of palliative needs (IPOS) and patients (RADPAC),\nthough identifying those with heart failure was considered\ndifficult by RADPAC. Dutch NAT:PD-HF was not found\nhelpful to communicate about palliative care, while IPOS\nwas found to facilitate patient-nurse communication although\nmany patients did not consider it to have any clinical effect.\nPatient perspectives were only evaluated for IPOS while\nhealthcare professionals were interviewed in all studies.\nIn summary, NAT:PD-HF outperformed other tools in the\nclinical applications in palliative patient/needs identification\n147Heart Fail Rev (2021) 26:137–155\nthough this needs further testing. NAT:PD-HF has relatively\nwide application in heart failure populations and it was used\nfor both patient identification and needs identification.\nNAT:PD-HF was able to identify high proportions of patients\nwith heart failure who have palliative care needs and most\nimportantly those identified had poor health at baseline, indi-\ncating a proper identification. The original NAT:PD-HF was\nn o ti n c o r p o r a t e di n t oa ni n t e r v e n t i o ni nc o n t r a r yt oi t sD u t c h\ntranslation. Like IPOS and RADPAC, Dutch NAT:PD-HF\nlacked a significant positive impact on patients/informal care-\ngivers. Unlike these two tools, healthcare professionals were\nnot positive in their comments on Dutch NAT:PD-HF and\nthey listed many barriers for its use.\nDiscussion\nThis is the first systematic review that comprehensively com-\npares palliative care needs-ass essment/measurement tools\nused in patients with heart failure. The main review question\nwas to determine the most appropriate palliative care needs-\nassessment/measurement tools for use in heart failure popula-\ntions to inform clinical practice. Six tools were identified and\ncompared according to their content and context of use, de-\nvelopment, psychometrics and practicality, and applications in\nidentifying patients with palliative care needs. Based on the\nlimited available evidence, NAT:PD-HF is the most appropri-\nate palliative care needs-assessment tool for heart failure pop-\nulations, though more studies are needed to confirm this.\nIPOS is promising and shares many advantages of NAT:PD-\nHF but it is less commonly studied in this population.\nGeneralizability of the review results is limited by the small\nnumber of tool-evaluating studies and the heterogeneity of\npopulations, interventions, outcomes, and health settings.\nThe results of this review are concordant with the recent\nEuropean Association for Palliative Care (EAPC) position\nstatement where a comprehensive palliative care needs-\nassessment tool was suggested to identify patients with unmet\nneeds [9]. NAT:PD-HF, being validated for patients with heart\nfailure, was suggested as an example of such a tool but this\nwas not based on detailed comparisons with other tools. IPOS\nwas also suggested as a trigger to initiate palliative care but\ncategorized separately as a symptoms-assessment tool. SPICT\nwas considered a patient identification tool that does not detail\nindividual needs. Although SPICT was recommended over\nother tools in one review to identify palliative patients, this\nwas concluded for the general population in primary care, and\nneither NAT:PD-HF nor IPOS was included in that review\n[39].\nNAT:PD-HF was not identified in three previous\nsystematic reviews that looked for tools used to identify\ngeneral populations with palliative care needs in primary\ncare [ 28 , 32 , 39 ]. It was probably seen as a needs\nidentification rather than a patient identification tool.\nIndeed, NAT:PD-HF was developed for identifying patient\nneeds rather than screening patients who require palliative\ncare, although it has been used for both purposes [ 51, 58, 59].\nAnother non-systematic review of palliative care needs-\nassessment in patients with chronic heart failure included\nNAT:PD-HF but it did not seek which tool is the most\nappropriate for this population [ 18].\nThe tools have different items to identify patients with pal-\nliative care needs, including the surprise question, indicators\nof deterioration, and reported symptoms and concerns. The\npotential use of the surprise question as a simple method for\nidentifying patients with palliative care needs had been ac-\nknowledged [ 85, 86]. However, RADPAC developers did\nnot recommend it to trigger end of life discussions [ 60], and\nalthough it was included in SPICT original versions, it was\nremoved later. Apart from this question, the items of some\ntools (GSF-PIG, RADPAC, and SPICT) address mainly pa-\ntient physical symptoms. These tools may not be able to iden-\ntify relatively asymptomatic patients with a high risk of dying\n[87, 88]. Therefore, a more comprehensive needs-assessment/\nmeasurement tool like NAT:PD-HF or IPOS would be more\nappropriate to use in this population.\nThe length of time to complete the tools should be\naccounted for to prevent staff/patient burden [ 27]. Reasons\nfor the differences between the tools in time for completion\ninclude the tool purpose, number of items, and completion\nmethod [ 27, 39]. NAT:PD-HF and IPOS aim to identify the\nmultidimensional palliative care needs of patients and hence,\nthey have the largest number of items to complete. All items\nrequire clinical judgement or patient/informal caregiver input\nwhich may increase completion time [ 39]. The action taken\nsection of NAT:PD-HF may contribute to the longer time\nneeded to fill the tool compared with IPOS, but it may also\nprompt staff to think about how to act on the identified needs.\nIPOS does not have such section and it may just be filled and\nfiled without having a clinical effect [ 26]. IPOS patient ver-\nsion (PROM) can be used outside the consultation time where\neach question is answered to provide a score measure for each\nconcern and symptom. Conversely, although NAT:PD-HF\ntakes a relatively few minutes to complete the form itself, it\nrepresents information obtained throughout a longer clinical\nassessment. This may explain the long time needed to com-\nplete its Dutch translation (26 min) [ 59]. Interestingly, the\noriginal cancer version of NAT:PD-HF (NAT:PD-C) did not\nprolong the average consultation time (18 min) indicating that\nthe tool items are normally evaluated during consultations\n[89]. The other tools (GSF-PIG, RADPAC, SPICT, and\nNECPAL) are clinical consultation aids, like NAT:PD-HF,\nbut they require screening medical records in addition to sub-\njective judgements. No data about time for completion were\navailable on the latest version of these tools at the time of\nsynthesizing the evidence.\n148 Heart Fail Rev (2021) 26:137–155\nRegarding tools ’ development, GSF-PIG, SPICT, and\nNECPAL were derived from prognostic tools but the focus\nhas been shifted from determining prognosis to assessing\nneeds for recognizing eligible patients for palliative care.\nThis is supported by the results of a study where a high level\nof need was observed among patients identified by GSF-PIG\nalthough few of them died within a 12-month follow-up peri-\nod [ 19]. Indeed, GSF-PIG was renamed from Prognostic\nIndicator Guidance to Proactive Identification Guidance al-\nthough the tool content only showed minimal changes [ 70].\nLikewise, the aim of SPICT was changed from “identifying\npeople at risk of deteriorating and dying ” to “identify people\nwhose health is deteriorating [and] assess them for unmet\nsupportive and palliative care needs …” [77]. Despite these\nendeavors, these tools are still used to determine prognosis\nwhich informs patient eligibility for palliative care [ 19, 78,\n90].\nThe tools are not necessarily mutually exclusive; indeed,\nthey can be used for different, and possibly complementary,\npurposes. One scenario is the use of one tool to screen for\npatients who require palliative care (patient identification),\nfollowed by another tool to evaluate their needs more com-\nprehensively (needs identification) [ 32]. In this case, the\npatient identification tool provides a quick snapshot of pa-\ntient needs, while the needs identification tool provides a\nmore complete picture and ho listic evaluation of these\nneeds [ 27]. Another scenario is the use of one tool to mea-\nsure general patient needs over time and another tool to\nidentify specific needs and triage action to meet those needs\n[91]. IPOS, as a generic outcome measure which provides a\ntotal score and individual scores of patient needs, could\nprovide a general summary of patient needs which could\nbe then assessed in more detail using the heart failure\nspecific tool NAT:PD-HF by determining the level of\nconcern for each need and assigning actions to address\nthose needs. Another possible use of the tools is to identify\npatients with specialist palli ative care needs to be included\nin a randomized controlled trial of specialist palliative care\nversus standard care [ 92]. Providing a specialist palliative\ncare intervention to those identified to have specialist\npalliative care needs is necessary to avoid diluting the effect\nsize. This issue is common in heart failure research where\npatients with specialist pa lliative care needs are not\ndifferentiated from patients without these needs.\nGiven that the tools serve different purposes, their psycho-\nmetric properties are not directly comparable. Nonetheless, no\ntool had been tested as widely as NAT:PD-HF. Original\nNAT:PD-HF has good validity and inter-rater reliability and\nwas acceptable to staff and patients [ 51, 58]. The poor psy-\nchometric and practicality properties of Dutch NAT:PD-HF\nhave several possible reasons [ 59]. Firstly, although the tool\nwas translated using a forward-backward procedure, cultural\nadaptation was not adopted upon translation. Cultural\nadaptation is needed when a tool is used in another country\nand language to maintain its content validity [ 93], and poor\ntranslation may create an inequivalent tool to the original one\n[93, 94]. Secondly, the evaluating study was not designed as a\nprimary psychometric study and its focus was not to test con-\nstruct and criterion validity. Nonetheless, the correlation be-\ntween some Dutch NAT:PD-HF items and three outcome\nmeasures was examined in an exploratory secondary analysis,\nand the results provided information on both validity types.\nThirdly, the small sample size was a contributor to the lack of\nrelationship between the constructs. Lastly, the heart failure\nnurses who administered the tool to patients lacked skills,\nknowledge, training, and experience in palliative care which\nled to difficulties in understanding the tool questions. This\nsuggests that implementation issues may affect the tools ’abil-\nity to identify patient needs.\nTwo approaches were suggested in this review to evaluate\nthe tools in identifying patients with palliative care needs. The\nfirst approach is to assess their identification ability by calcu-\nlating the proportion of identified palliative patients (the more\npatients identified, the better is the tool). It was noted that a\nhigh proportion of identified patients may not always reflect a\ngood tool’s identification ability. Proportions may be mislead-\ningly high or low if the tool is used by untrained or unskilled\nstaff or if few patients are screened [ 48, 49]. Also, a low\nproportion may reflect less severe disease rather than weak\nidentification ability. Therefore, a better approach to evaluate\nthe tools is to assess the appropriateness of identification by\nevaluating the health status of identified patients. Issues with\nidentification were suggested for RACPAC and NECPAL.\nRADPAC-trained primary care practitioners identified a few\npatients for palliative care [ 62], most likely because the tool\ncovers only physical patient needs so it could not identify\nthose with psychosocial and spiritual needs. For NECPAL,\nmore than 90% of patients with a negative answer to the sur-\nprise question were identified by the tool across all the evalu-\nating studies [ 52–54, 67], which may suggest a little added\nvalue of the detailed NECPAL compared with the surprise\nquestion alone.\nThe lack of intervention effect of IPOS and Dutch\nNAT:PD-HF on health outcomes has many possible reasons\n[56, 59]. Firstly, the evaluating studies were not designed to\ntest effectiveness. Secondly, worsening of health status over\ntime is expected in patients with heart failure [ 8]. Without a\ncontrol group, it is not possible to see a signal of benefit over\ntime; deterioration may have happened faster without the in-\ntervention. Lastly, the actions taken by the nurses to address\nthe identified patient needs might be inappropriate as they\nwere not offered clinical guidelines on how to act upon the\nresults of the tools. The interviews with heart failure nurses\nand patients after the IPOS intervention revealed that it could\nnot trigger nurses to act on the identified needs [ 26]. The\nseveral barriers listed for Dutch NAT:PD-HF by interviewed\n149Heart Fail Rev (2021) 26:137–155\nheart failure nurses indicate the improper translation of the\ntool and lack of palliative care knowledge among nurses\n[59]. For RADPAC intervention, the lack of significant effect\nwas justified by the small proportion of identified patients and\nidentifying practitioners [61, 62]. The difficulty in identifying\npalliative patients with hear t failure as reported by the\ninterviewed primary care practitioners after the intervention\nrevealed a tool identification problem [ 64].\nTo be clinically relevant, palliative care needs-assessment/\nmeasurement tools should be successfully implemented in\npractice by healthcare professionals. Barriers to implementa-\ntion include high workload of healthcare professionals and\nlimited resources and capacities; lack of expertise, knowledge,\neducation, and training about palliative care in heart failure;\nand lack of communication skills with patients and informal\ncaregivers [32, 59]. Additional barriers adopted from similar\ndiscussions on implementing advance care planning in heart\nfailure care, where needs-assessment is a key element [ 95],\nexist on different levels. These include lack of support at the\nhealth system and institutional level; lack of an electronic\ninformation-recording and exchange system; lack of public\neducation about palliative care; fear of losing hope and caus-\ning concern if palliative care is discussed with patients and\ninformal caregivers; lack of trust and a long relationship with\npatients and informal caregivers to enable palliative care dis-\ncussions; unstable physical, cognitive, and emotional condi-\ntions of patients; emotional impact on healthcare professionals\nwhen discussing palliative care; misconception that palliative\ncare discussions reflect treatment failure; and lack of collabo-\nration between healthcare professionals and consensus on\nwho should fill the tool and assess the needs [ 96–98]. It is\nessential to overcome these barriers because no matter how\nwell-developed, valid, acceptable, and feasible the tools are,\nthey would be ineffective in clinical practice if no attention is\npaid to implementation issues. Successful implementation of\nthe tools would facilitate the timely identification of patients\nwith palliative care needs and subsequent access to palliative\ncare services [ 32].\nStrengths and limitations\nThis review adopted a systematic method to search for relevant\nevidence, screen retrieved studies and tools, extract data from\nincluded ones, assess their quality, and synthesize their findings.\nA broad search strategy was used to retrieve most of the relevant\nstudies. The review was not restricted to quantitative or qualita-\ntive studies as both were sought. It was written following the\nadapted PRISMA reporting guideline to enhance transparency\n[41]. The choice of the most appropriate tools was based on\ncomprehensive comparisons according to predetermined criteria.\nAlthough NAT:PD-HF was suggested as an example of a good\nneeds-assessment tool in the EAPC statement and another re-\nview, this was not based on such comparisons [9, 18].\nThe review has some limitations. Firstly, tools were ex-\ncluded if they were not developed for palliative care patient/\nneeds identification or used for identifying heart failure pop-\nulations with palliative care needs in a single study retrieved\nthrough the review search. Including these tools in the review\ncould have altered its findings. Secondly, the second reviewer\nwas only partly involved in study screening, data extraction,\nand quality appraisal. He was not involved in assessing the\ntools’psychometric and practicality properties and synthesiz-\ning the evidence. Thirdly, the psychometric and practicality\nproperties of the tools were assessed using the Oxford PROMs\nGroup criteria although all tools, except IPOS patient version,\nwere clinical decision aids rather than PROMs. Needs-\nassessment tools are distinct from needs-measurement tools\nand they have different, though overlapping, purposes; there-\nfore, the psychometric approaches for each are not directly\ncomparable. The purpose and method of validation differ be-\ntween these tool types and the psychometric items of respon-\nsiveness, although not assessed, may not apply to clinical\ndecision aids. Fourthly, despite adopting a sensitive search\nstrategy, some studies and tools might be missed as with any\nsystematic review. Studies published in non-English or non-\nArabic languages were not searched, and few gray literature\nsources were sought. Indeed, palliative care and heart failure\nstudies are difficult to retrieve because of their inconsistent\nterminology [ 99, 100]. The term heart disease was used in\nsome included studies and this was assumed to be equivalent\nto heart failure unless indicated otherwise.\nMethodological limitations include the subjective nature of\nnarrative synthesis which may affect transparency and repro-\nducibility [101], though this was mitigated by adapting Popay\net al.’sf r a m e w o r k[43]; lack of consensus on the best tool for\nconcomitantly appraising quantitative, qualitative, and mixed-\nmethods studies [ 102], though the commonly cited Hawker\net al.’s tool was used; and assignment of a total quality score\nfor each study which is not agreed by some researchers [ 42].\nStudies were not excluded based on their quality score.\nHowever, excluding lower quality studies would not have\nchanged the answer to the review question, especially that\nNAT:PD-HF and IPOS studies scored in the upper range of\nthe scale and would not have been excluded.\nImplications for research, practice, and policy\nThe tools need further assessment of their psychometric and\npracticality properties in patients with heart failure. Further\nevaluation of the tools for identif ying heart failure populations\nwith palliative care needs is also needed. Future studies should\ninclude a larger number of patie nts, evaluate patients with dif-\nferent types of heart failure and i n multiple health settings, and\nadequately report the baseline data and health outcomes for\nidentified patients. Cultural adaptation should be included in\nthe tools’ translation to create tools equivalent to the original\n150 Heart Fail Rev (2021) 26:137–155\nones. Healthcare professionals should be aware of the different\nroles that needs-assessment/measurement tools can play and\nconsider combining them where appropriate. Until more data\nbecome available, they are advised to use NAT:PD-HF to iden-\ntify heart failure populations with palliative care needs. This\nshould be followed by acting to a ddress these needs and con-\nsequently improve health outcomes. Policymakers should\nadopt a needs-based approach for identifying patients requiring\npalliative care and integrate needs-assessment/measurement\ntools into the practice of healthcare professionals. Particular\nattention should be paid to implementation issues to enhance\nthe clinical effectiveness of the tools in practice.\nConclusion\nSix palliative care needs-assessment/measurement tools used\nin patients with heart failure were identified and compared\naccording to their content and context of use, development,\npsychometrics and practicality, and applications in identifying\npalliative care patients and needs. The tools are not necessarily\nmutually exclusive as they may serve different purposes in-\ncluding patient identification, needs identification, needs-\nmeasurement, and needs-assessment (decision aids).\nComparison results suggested that NAT:PD-HF is the most\nappropriate palliative care needs-assessment tool for use in\nheart failure populations. It covers most of the patient needs\nand has the best psychometric properties and evidence of iden-\ntification ability and appropriateness. However, this conclu-\nsion is based on limited evidence. Four retrieved tools lack\nstudies on their psychometric and practicality properties in\nheart failure populations, and one of these (GSF-PIG) even\nlacks a research development paper. Nevertheless, NAT:PD-\nHF is preliminarily recommended for use in patients with\nheart failure, but it requires further testing and validation.\nIPOS has some similar advantages to NAT:PD-HF but less\nevidence is available on its use in heart failure populations.\nCode availability Not applicable.\nAuthor contributions Bader Remawi, Nancy Preston, and Amy Gadoud\ncontributed to the study conception and design. The literature search was\nperformed by Bader Remawi. Bader Remawi and Iain Murphy screened\nthe studies, extracted relevant data, and appraised the quality of the in-\ncluded studies. Nancy Preston and Amy Gadoud provided their input\nwhen required to solve any discrepancy. Synthesizing and analyzing the\nevidence were carried out by Bader Remawi. The review was drafted by\nBader Remawi and critically revised by Nancy Preston and Amy Gadoud.\nFunding information This review was part of a research project for Bader\nRemawi who is funded by the British Council to pursue his PhD study at\nLancaster University which contributes the value of the academic fees.\nData availability Not applicable.\nCompliance with ethical standards\nThis article is a literature review and does not include an original clinical\ntrail conducted by the authors.\nConflict of interest The authors declare that they have no conflict of\ninterest.\nConsent Not applicable.\nOpen Access This article is licensed under a Creative Commons\nAttribution 4.0 International License, which permits use, sharing,\nadaptation, distribution and reproduction in any medium or format, as\nlong as you give appropriate credit to the original author(s) and the\nsource, provide a link to the Creative Commons licence, and indicate if\nchanges were made. The images or other third party material in this article\nare included in the article's Creative Commons licence, unless indicated\notherwise in a credit line to the material. If material is not included in the\narticle's Creative Commons licence and your intended use is not\npermitted by statutory regulation or exceeds the permitted use, you will\nneed to obtain permission directly from the copyright holder. To view a\ncopy of this licence, visit http://creativecommons.org/licenses/by/4.0/.\nReferences\n1. Sepúlveda C, Marlin A, Yoshida T, Ullrich A (2002) Palliative\ncare: the World Health Organization ’s global perspective. J Pain\nSymptom Manag 24(2):91 –96. https://doi.org/10.1016/s0885-\n3924(02)00440-2\n2. Quill TE, Abernethy AP (2013) Generalist plus specialist pallia-\ntive care - creating a more sustainable model. N Engl J Med\n368(13):1173–1175. https://doi.org/10.1056/NEJMp1215620\n3. Gelfman LP, Kavalieratos D, Teuteberg WG, Lala A, Goldstein\nNE (2017) Primary palliative care for heart failure: what is it? How\ndo we implement it? Heart Fail Rev 22(5):611 –620. https://doi.\norg/10.1007/s10741-017-9604-9\n4. Chan HY, Yu DS, Leung DY, Chan AW, Hui E (2016) Quality of\nlife and palliative care needs of elderly patients with advanced\nheart failure. J Geriatr Cardiol 13(5):420 –424. https://doi.org/10.\n11909/j.issn.1671-5411.2016.05.016\n5. Cagle JG, Bunting M, Kelemen A, Lee J, Terry D, Harris R (2017)\nPsychosocial needs and interventions for heart failure patients and\nfamilies receiving palliative care support: a systematic review.\nHeart Fail Rev 22(5):565 –580. https://doi.org/10.1007/s10741-\n017-9596-5\n6. O'leary N (2009) The comparative palliative care needs of those\nwith heart failure and cancer patients. Curr Opin Support Palliat\nCare 3(4):241 –246. https://doi.org/10.1097/SPC.\n0b013e328332e808\n7. Bekelman DB, Rumsfeld JS, Havranek EP, Yamashita TE, Hutt\nE, Gottlieb SH, Dy SM, Kutner JS (2009) Symptom burden, de-\npression, and spiritual well-being: a comparison of heart failure\nand advanced cancer patients. J Gen Intern Med 24(5):592 –598.\nhttps://doi.org/10.1007/s11606-009-0931-y\n8. Jaarsma T, Beattie JM, Ryder M, Rutten FH, McDonagh T,\nMohacsi P, Murray SA, Grodzicki T, Bergh I, Metra M, Ekman\nI, Angermann C, Leventhal M, Pitsis A, Anker SD, Gavazzi A,\nPonikowski P, Dickstein K, Delacretaz E, Blue L, Strasser F,\nMcMurray J, on behalf of the Advanced Heart Failure Study\nGroup of the HFA of the ESC (2009) Palliative care in heart\nfailure: a position statement from the palliative care workshop of\nthe Heart Failure Association of the European Society of\n151Heart Fail Rev (2021) 26:137–155\nCardiology. Eur J Heart Fail 11(5):433 –443. https://doi.org/10.\n1093/eurjhf/hfp041\n9. Sobanski PZ, Alt-Epping B, Currow DC, Goodlin SJ, Grodzicki\nT, Hogg K, Janssen DJA, Johnson MJ, Krajnik M, Leget C,\nMartínez-Sellés M, Moroni M, Mueller PS, Ryder M, Simon\nST, Stowe E, Larkin PJ (2020) Palliative care for people living\nwith heart failure: European Association for Palliative Care Task\nForce expert position statement. Cardiovasc Res 116(1):12 –27.\nhttps://doi.org/10.1093/cvr/cvz200\n10. Braun LT, Grady KL, Kutner JS, Adler E, Berlinger N, Boss R,\nButler J, Enguidanos S, Friebert S, Gardner TJ, Higgins P,\nHolloway R, Konig M, Meier D, Morrissey MB, Quest TE,\nWiegand DL, Coombs-Lee B, Fitchett G, Gupta C, Roach WH\nJr, American Heart Associ ation Advocacy Coordinating\nCommittee (2016) Palliative care and cardiovascular disease and\nstroke: a policy statement from the American Heart Association/\nAmerican Stroke Association. Circulation 134(11):e198 –e225.\nhttps://doi.org/10.1161/CIR.0000000000000438\n11. Diop MS, Rudolph JL, Zimmerman KM, Richter MA, Skarf LM\n(2017) Palliative care interventions for patients with heart failure:\na systematic review and meta-analysis. J Palliat Med 20(1):84–92.\nhttps://doi.org/10.1089/jpm.2016.0330\n12. Datla S, Verberkt CA, Hoye A, Janssen DJ, Johnson MJ (2019)\nMulti-disciplinary palliative care is effective in people with symp-\ntomatic heart failure: a systematic review and narrative synthesis.\nPalliat Med 33(8):1003 –1016. https://doi.org/10.1177/\n0269216319859148\n13. Zhou K, Mao Y (2019) Palliative care in heart failure: a meta-\nanalysis of randomized controlled trials. Herz 44(5):440 –444.\nhttps://doi.org/10.1007/s00059-017-4677-8\n14. Gadoud A, Kane E, Oliver SE, Johnson MJ, Macleod U, Allgar V\n(2020) Palliative care for non-cancer conditions in primary care: a\ntime trend analysis in the UK (2009-2014). BMJ Support Palliat\nCare. https://doi.org/10.1136/bmjspcare-2019-001833\n15. Selman L, Harding R, Beynon T, Hodson F, Hazeldine C, Coady\nE, Gibbs L, Higginson IJ (2007) Modelling services to meet the\npalliative care needs of chronic heart failure patients and their\nfamilies: current practice in the UK. Palliat Med 21(5):385 –390.\nhttps://doi.org/10.1177/0269216307077698\n16. Gelfman LP, Kalman J, Goldstein NE (2014) Engaging heart fail-\nure clinicians to increase palliative care referrals: overcoming bar-\nriers, improving techniques. J Palliat Med 17(7):753 –760. https://\ndoi.org/10.1089/jpm.2013.0675\n17. Gadoud A, Jenkins SM, Hogg KJ (2013) Palliative care for people\nwith heart failure: summary of current evidence and future direc-\ntion. Palliat Med 27(9):822 –828. https://doi.org/10.1177/\n0269216313494960\n18. Janssen DJ, Johnson MJ, Spruit MA (2018) Palliative care needs\nassessment in chronic heart failure. Curr Opin Support Palliat Care\n12(1):25–31. https://doi.org/10.1097/SPC.0000000000000317\n19. Haga K, Murray S, Reid J, Ness A, O'Donnell M, Yellowlees D,\nDenvir MA (2012) Identifying community based chronic heart\nfailure patients in the last year of life: a comparison of the Gold\nStandards Framework Prognostic Indicator Guide and the Seattle\nHeart Failure Model. Heart 98(7):579 –583. https://doi.org/10.\n1136/heartjnl-2011-301021\n20. National Institute for Health and Care Excellence (2018) Chronic\nheart failure in adults: diagn osis and management. National\nInstitute for Health and Care Excellence, London https://www.\nnice.org.uk/guidance/ng106. Accessed 20 Mar 2020\n21. Passantino A, Guida P, Parisi G, Iacoviello M, Scrutinio D (2018)\nCritical appraisal of multivariable prognostic scores in heart fail-\nure: development, validation and clinical utility. Adv Exp Med\nBiol 1067:387–403. https://doi.org/10.1007/5584_2017_135\n22. Hogg KJ, Jenkins SM (2012) Prognostication or identification of\npalliative needs in advanced heart failure: where should the focus\nlie? Heart 98(7):523 –524. https://doi.org/10.1136/heartjnl-2012-\n301753\n23. Gadoud AC, Johnson MJ (2014) Response: what tools are avail-\nable to identify patients with palliative care needs in primary care:\na systematic literature review and survey of European practice?\nBMJ Support Palliat Care 4(2):130. https://doi.org/10.1136/\nbmjspcare-2014-000706\n24. Ekman I, Ehrenberg A (2002) Fatigued elderly patients with\nchronic heart failure: do patient reports and nurse recordings cor-\nrespond? Int J Nurs Terminol Classif 13(4):127 –136. https://doi.\norg/10.1111/j.1744-618x.2002.tb00416.x\n25. Ekman I, Cleland JG, Andersson B, Swedberg K (2005)\nExploring symptoms in chronic heart failure. Eur J Heart Fail\n7(5):699–703. https://doi.org/10.1016/j.ejheart.2005.07.003\n26. Kane PM, Ellis-Smith CI, Daveson BA, Ryan K, Mahon NG,\nMcAdam B, McQuillan R, Tracey C, Howley C, O ’Gara G,\nRaleigh C, Higginson IJ, Murtagh FE, Koffman J, BuildCARE\n(2018) Understanding how a palliative-specific patient-reported\noutcome intervention works to facilitate patient-centred care in\nadvanced heart failure: a qualitative study. Palliat Med 32(1):\n143–155. https://doi.org/10.1177/0269216317738161\n27. Girgis A, Waller A (2015) Palliative care needs assessment tools.\nIn: Cherny N, Fallon M, Kaasa S, Portenoy RK, Currow DC (eds)\nOxford textbook of palliative medicine, 5th edn. Oxford\nUniversity Press, Oxford, pp 363 –375\n28. Maas EA, Murray SA, Engels Y, Campbell C (2013) What tools\nare available to identify patients with palliative care needs in pri-\nmary care: a systematic literature review and survey of European\npractice. BMJ Support Palliat Care 3(4):444 –451. https://doi.org/\n10.1136/bmjspcare-2013-000527\n29. Ware JE Jr, Brook RH, Davies AR, Lohr KN (1981) Choosing\nmeasures of health status for individuals in general populations.\nAm J Public Health 71(6):620 –625. https://doi.org/10.2105/ajph.\n71.6.620\n30. Deyo AR, Patrick LD (1989) Barriers to the use of health status\nmeasures in clinical investigation, patient care, and policy re-\nsearch. Med Care 27(3 Suppl):S254 –S268. https://doi.org/10.\n1097/00005650-198903001-00020\n31. Fitzpatrick R, Davey C, Buxton MJ, Jones DR (1998) Evaluating\npatient-based outcome measures for use in clinical trials. Health\nT e c h n o lA s s e s s2 ( 1 4 ) : i–iv, 1–74. https://doi.org/10.3310/hta2140\n32. ElMokhallalati Y, Bradley SH, Chapman E, Ziegler L, Murtagh\nFE, Johnson MJ et al (2020) Identification of patients with poten-\ntial palliative care needs: a systematic review of screening tools in\nprimary care. Palliat Med:026921632092955. https://doi.org/10.\n1177/0269216320929552\n33. van Vliet LM, Harding R, Bausewein C, Payne S, Higginson IJ\n(2015) How should we manage information needs, family anxiety,\ndepression, and breathlessness for those affected by advanced dis-\nease: development of a Clinical Decision Support Tool using a\nDelphi design. BMC Med 13:263. https://doi.org/10.1186/\ns12916-015-0449-6\n34. Greenhalgh J (2009) The applications of PROs in clinical practice:\nwhat are they, do they work, and why? Qual Life Res 18(1):115 –\n123. https://doi.org/10.1007/s11136-008-9430-6\n35. Simon ST, Higginson IJ, Harding R, Daveson BA, Gysels M,\nDeliens L et al (2012) Enhancing patient-reported outcome mea-\nsurement in research and practice of palliative and end-of-life care.\nSupport Care Cancer 20(7):1573 –1578. https://doi.org/10.1007/\ns00520-012-1436-5\n36. Daveson BA, Simon ST, Benalia H, Downing J, Higginson IJ,\nHarding R, Bausewein C, on behalf of PRISMA (2012) Are we\nheading in the same direction? European and African doctors ’and\nnurses’views and experiences regarding outcome measurement in\npalliative care. Palliat Med 26(3):242 –249. https://doi.org/10.\n1177/0269216311409614\n152 Heart Fail Rev (2021) 26:137–155\n37. Greenhalgh J, Long AF, Flynn R (2005) The use of patient report-\ned outcome measures in routine clinical practice: lack of impact or\nlack of theory? Soc Sci Med 60(4):833 –843. https://doi.org/10.\n1016/j.socscimed.2004.06.022\n38. O'Connor AM (2007) Using decision aids to help patients navi-\ngate the “grey zone” of medical decision-making. CMAJ 176(11):\n1597–1598. https://doi.org/10.1503/cmaj.070490\n39. Walsh RI, Mitchell G, Francis L, van Driel ML (2015) What\ndiagnostic tools exist for the early identification of palliative care\npatients in general practice? A systematic review. J Palliat Care\n31(2):118–123. https://doi.org/10.1177/082585971503100208\n40. Hong QN, Pluye P, Bujold M, Wassef M (2017) Convergent and\nsequential synthesis designs: implications for conducting and\nreporting systematic reviews of qualitative and quantitative evi-\ndence. Syst Rev 6(1):61. https://doi.org/10.1186/s13643-017-\n0454-2\n41. Pluye P, Hong QN, Vedel I (2016) Report mixed studies reviews.\nMcGill University, Department of Family Medicine. http://\ntoolkit4mixedstudiesreviews.pbworks.com/w/page/66154236/\nReport%20mixed%20studies%20reviews. Accessed 4 Jul 2019\n42. Hawker S, Payne S, Kerr C, Hardey M, Powell J (2002)\nAppraising the evidence: reviewing disparate data systematically.\nQual Health Res 12(9):1284 –1299. https://doi.org/10.1177/\n1049732302238251\n43. Popay J, Roberts H, Sowden A, Petticrew M, Arai L, Rodgers M\net al (2006) Guidance on the conduct of narrative synthesis in\nsystematic reviews: a product from the ESRC Methods\nProgramme. Lancaster University, Institute for Health Research,\nLancaster\n44. Milnes S, Orford NR, Berk eley L, Lambert N, Simpson N,\nElderkin T, Corke C, Bailey M (2019) A prospective observation-\nal study of prevalence and outcomes of patients with Gold\nStandard Framework criteria in a tertiary regional Australian hos-\npital. BMJ Support Palliat Care 9(1):92 –99. https://doi.org/10.\n1136/bmjspcare-2015-000864\n45. Ryan T, Ingleton C, Gardiner C, Parker C, Gott M, Noble B\n(2013) Symptom burden, palliative care need and predictors of\nphysical and psychological discomfort in two UK hospitals.\nBMC Palliat Care 12:11. https://doi.org/10.1186/1472-684X-12-\n11\n46. Gardiner C, Gott M, Ingleton C, Seymour J, Cobb M, Noble B,\nBennett M, Ryan T (2013) Extent of palliative care need in the\nacute hospital setting: a survey of two acute hospitals in the UK.\nPalliat Med 27(1):76 –83. https://doi.org/10.1177/\n0269216312447592\n47. Pandini S, Defendi S, Scirè C, Fiorini F, Fiorini G (2016) Biases in\npalliative care access for elderly patients dying in hospital: a pro-\nspective study in acute care. Prog Palliat Care 24(6):310 –314.\nhttps://doi.org/10.1080/09699260.2016.1230973\n48. Hamano J, Oishi A, Kizawa Y (2018) Identified palliative care\napproach needs with SPICT in family practice: a preliminary ob-\nservational study. J Palliat Med 21(7):992–998. https://doi.org/10.\n1089/jpm.2017.0491\n49. Hamano J, Oishi A, Kizawa Y (2019) Prevalence and character-\nistics of patients being at risk of deteriorating and dying in primary\ncare. J Pain Symptom Manag 57(2):266 –272.e1. https://doi.org/\n10.1016/j.jpainsymman.2018.11.006\n50. Campbell RT, Jackson CE, Wright A, Gardner RS, Ford I,\nDavidson PM, Denvir MA, Hogg KJ, Johnson MJ, Petrie MC,\nMcMurray JJV (2015) Palliative care needs in patients hospital-\nized with heart failure (PCHF) study: rationale and design. ESC\nHeart Fail 2(1):25–36. https://doi.org/10.1002/ehf2.12027\n51. Campbell RT, Petrie MC, Jackson CE, Jhund PS, Wright A,\nGardner RS, Sonecki P, Pozzi A, McSkimming P, McConnachie\nA, Finlay F, Davidson P, Denvir MA, Johnson MJ, Hogg KJ,\nMcMurray JJV (2018) Which patients with heart failure should\nreceive specialist palliative care? Eur J Heart Fail 20(9):1338 –\n1347. https://doi.org/10.1002/ejhf.1240\n52. de-la Rica Escuín M, García-Barrecheguren A, Monche-Palacín\nAM (2019) Assessment of the needs for palliative care in ad-\nvanced chronic patients on discharge. Enferm Clin 29(1):18 –26.\nhttps://doi.org/10.1016/j.enfcli.2018.07.004\n53. Orzechowski R, Galvão AL, Nunes TD, Campos LS (2019)\nPalliative care need in patients with advanced heart failure hospi-\ntalized in a tertiary hospital. Rev Esc Enferm USP 53:e03413.\nhttps://doi.org/10.1590/S1980-220X2018015403413\n54. Gastelurrutia P, Zamora E, Domingo M, Ruiz S, González-\nCostello J, Gómez-Batiste X (2019) Palliative care needs in heart\nfailure. A multicenter study using the NECPAL questionnaire.\nRev Esp Cardiol (Engl Ed) 72(10):870 –872. https://doi.org/10.\n1016/j.rec.2019.01.009\n55. Schildmann EK, Groeneveld EI, Denzel J, Brown A, Bernhardt F,\nBailey K, Guo P, Ramsenthaler C, Lovell N, Higginson IJ,\nBausewein C, Murtagh FEM (2016) Discovering the hidden ben-\nefits of cognitive interviewing in two languages: the first phase of\na validation study of the Integrated Palliative care Outcome Scale.\nPalliat Med 30(6):599 –610. https://doi.org/10.1177/\n0269216315608348\n56. Kane PM, Daveson BA, Ryan K, Ellis-Smith CI, Mahon NG,\nMcAdam B, McQuilllan R, Tracey C, Howley C, O ’Gara G,\nRaleigh C, Higginson IJ, Koffman J, Murtagh FEM,\nBuildCARE (2017) Feasibility and acceptability of a patient-\nreported outcome intervention in chronic heart failure. BMJ\nSupport Palliat Care 7(4):470 –479. https://doi.org/10.1136/\nbmjspcare-2017-001355\n57. Roch C, Palzer J, Zetzl T, Störk S, Frantz S, van Oorschot B\n(2020) Utility of the integrated palliative care outcome scale\n(IPOS): a cross-sectional study in hospitalised patients with heart\nfailure. Eur J Cardiovasc Nurs. https://doi.org/10.1177/\n1474515120919386\n58. Waller A, Girgis A, Davidson PM, Newton PJ, Lecathelinais C,\nMacDonald PS et al (2013) Facilitating needs-based support and\npalliative care for people with chronic heart failure: preliminary\nevidence for the acceptability, inter-rater reliability, and validity of\na needs assessment tool. J Pain Symptom Manag 45(5):912 –925.\nhttps://doi.org/10.1016/j.jpainsymman.2012.05.009\n59. Janssen DJ, Boyne J, Currow DC, Schols JM, Johnson MJ, La\nRocca HP (2019) Timely recognition of palliative care needs of\npatients with advanced chronic heart failure: a pilot study of a\nDutch translation of the Needs Assessment Tool: Progressive\nDisease - Heart Failure (NAT:PD-HF). Eur J Cardiovasc Nurs\n18(5):375–388. https://doi.org/10.1177/1474515119831510\n60. Thoonsen B, Engels Y, van Rijswijk E, Verhagen S, van Weel C,\nGroot M, Vissers K (2012) Early identification of palliative care\npatients in general practice: development of RADboud indicators\nfor PAlliative Care Needs (RADPAC). Br J Gen Pract 62(602):\ne625–e631. https://doi.org/10.3399/bjgp12X654597\n61. Thoonsen B, Groot M, Engels Y, Prins J, Verhagen S, Galesloot\nC, van Weel C, Vissers K (2011) Early identification of and pro-\nactive palliative care for patients in general practice, incentive and\nmethods of a randomized controlled trial. BMC Fam Pract 12:123.\nhttps://doi.org/10.1186/1471-2296-12-123\n62. Thoonsen B, Vissers K, Verhagen S, Prins J, Bor H, van Weel C,\nGroot M, Engels Y (2015) Training general practitioners in early\nidentification and anticipatory palliative care planning: a random-\nized controlled trial. BMC Fam Pract 16:126. https://doi.org/10.\n1186/s12875-015-0342-6\n63. Thoonsen B, Gerritzen SH, Vissers KC, Verhagen S, van Weel C,\nGroot M et al (2019) Training general practitioners contributes to\nthe identification of palliative patients and to multidimensional\ncare provision: secondary outcomes of an RCT. BMJ Support\n153Heart Fail Rev (2021) 26:137–155\nPalliat Care 9(1):e18. https://doi.org/10.1136/bmjspcare-2015-\n001031\n64. Thoonsen B, Groot M, Verhagen S, van Weel C, Vissers K,\nEngels Y (2016) Timely identification of palliative patients and\nanticipatory care planning by GPs: practical application of tools\nand a training programme. BMC Palliat Care 15:39. https://doi.\norg/10.1186/s12904-016-0112-9\n65. Highet G, Crawford D, Murray SA, Boyd K (2014) Development\nand evaluation of the supportive and palliative care indicators tool\n(SPICT): a mixed-methods study. BMJ Support Palliat Care 4(3):\n285–290. https://doi.org/10.1136/bmjspcare-2013-000488\n66. Gómez-Batiste X, Martínez-Muñoz M, Blay C, Amblàs J, Vila L,\nCosta X, Villanueva A, Espaulella J, Espinosa J, Figuerola M,\nConstante C (2013) Identifying patients with chronic conditions\nin need of palliative care in the general population: development of\nthe NECPAL tool and preliminary prevalence rates in Catalonia.\nBMJ Support Palliat Care 3(3):300 –308. https://doi.org/10.1136/\nbmjspcare-2012-000211\n67. Gómez-Batiste X, Martínez-Muñoz M, Blay C, Amblàs J, Vila L,\nCosta X, Espaulella J, Espinosa J, Constante C, Mitchell GK\n(2014) Prevalence and characteristics of patients with advanced\nchronic conditions in need of palliative care in the general popu-\nlation: a cross-sectional study. Palliat Med 28(4):302–311. https://\ndoi.org/10.1177/0269216313518266\n68. Amblàs-Novellas J, Murray SA, Espaulella J, Martori JC, Oller R,\nMartínez-Muñoz M et al (2016) Identifying patients with ad-\nvanced chronic conditions for a progressive palliative care ap-\nproach: a cross-sectional study of prognostic indicators related to\nend-of-life trajectories. BMJ Open 6(9):e012340. https://doi.org/\n10.1136/bmjopen-2016-012340\n69. Moher D, Liberati A, Tetzlaff J, Altman DG, PRISMA Group\n(2009) Preferred reporting items for systematic reviews and me-\nta-analyses: the PRISMA statement. Ann Intern Med 151(4):264–\n269. https://doi.org/10.7326/0003-4819-151-4-200908180-00135\n70. National Gold Standards Framework Centre. The gold standards\nframework. http://www.goldstandardsframework.org.uk/PIG .\nAccessed 4 Jun 2019\n71. Pattison M, Romer AL (2001) Improving care through the end of\nlife: launching a primary care clinic-based program. J Palliat Med\n4(2):249–254. https://doi.org/10.1089/109662101750290335\n72. Fachado AA, Martínez NS, Roselló MM, Rial JJ, Oliver EB,\nGarcía RG et al (2018) Spanish adaptation and validation of the\nsupportive & palliative care indicators tool – SPICT-ESTM. Rev\nSaude Publica 52:3. https://doi.org/10.11606/s1518-8787.\n2018052000398\n73. Afshar K, Feichtner A, Boyd K, Murray S, Jünger S, Wiese B,\nSchneider N, Müller-Mundt G (2018) Systematic development\nand adjustment of the German version of the Supportive and\nPalliative Care Indicators Tool (SPICT-DE). BMC Palliat Care\n17(1):27. https://doi.org/10.1186/s12904-018-0283-7\n74. Rodríguez-Calero MÁ, Julià-Mora JM, Prieto-Alomar A (2016)\nDetection of palliative care needs in an acute care hospital unit.\nPilot Study Enferm Clin 26(4):238–242. https://doi.org/10.1016/j.\nenfcli.2015.11.004\n75. Bausewein C, Schildmann E, Rosenbruch J, Haberland B, Tänzler\nS, Ramsenthaler C (2018) Starting from scratch: implementing\noutcome measurement in clinical practice. Ann Palliat Med\n7(Suppl 3):S253–S261. https://doi.org/10.21037/apm.2018.06.08\n76. Oriani A, Guo P, Gadoud A, Dunleavy L, Kane P, Murtagh FEM\n(2019) What are the main symptoms and concerns reported by\npatients with advanced chronic heart failure?-a secondary analysis\nof the Palliative care Outcome Scale (POS) and Integrated\nPalliative care Outcome Scale (IPOS). Ann Palliat Med 8(5):\n775–780. https://doi.org/10.21037/apm.2019.08.10\n77. The University of Edinburgh. SPICT Supportive And Palliative\nCare Indicators Tool. https://www.spict.org.uk/ . Accessed 11\nOct 2019\n78. De Bock R, Van Den Noortgate N, Piers R (2018) Validation of\nthe supportive and palliative care indicators tool in a geriatric\npopulation. J Palliat Med 21(2):220 –224. https://doi.org/10.\n1089/jpm.2017.0205\n79. Pham L, Arnby M, Benkel I, Dahlqvist Jonsson P, Källstrand J,\nMolander U, Ziegert K (2019) Early integration of palliative care:\ntranslation, cross-cultural adaptation and content validity of the\nSupportive and Palliative Care Indicators Tool in a Swedish\nhealthcare context. Scand J Caring Sci. https://doi.org/10.1111/\nscs.12781\n80. Murtagh FE, Ramsenthaler C, Firth A, Groeneveld EI, Lovell N,\nSimon ST et al (2019) A brief, patient- and proxy-reported out-\ncome measure in advanced illness: validity, reliability and respon-\nsiveness of the Integrated Palliative care Outcome Scale (IPOS).\nPalliat Med 33(8):1045 –1057. https://doi.org/10.1177/\n0269216319854264\n81. Sterie AC, Bernard M (2019) Challenges in a six-phase process of\nquestionnaire adaptation: findings from the French translation of\nthe Integrated Palliative care Outcome Scale. BMC Palliat Care\n18(1):38. https://doi.org/10.1186/s12904-019-0422-9\n82. Veronese S, Rabitti E, Costantini M, Valle A, Higginson I (2019)\nTranslation and cognitive testing of the Italian Integrated Palliative\nOutcome Scale (IPOS) among patients and healthcare profes-\nsionals. PLoS One 14(1):e0208536. https://doi.org/10.1371/\njournal.pone.0208536\n83. Beck I, Olsson Möller U, Malmström M, Klarare A, Samuelsson\nH, Lundh Hagelin C, Rasmussen B, Fürst CJ (2017) Translation\nand cultural adaptation of the Integrated Palliative care Outcome\nScale including cognitive interviewing with patients and staff.\nBMC Palliat Care 16(1):49. https://doi.org/10.1186/s12904-017-\n0232-x\n84. Sakurai H, Miyashita M, Imai K, Miyamoto S, Otani H, Oishi A,\nKizawa Y, Matsushima E (2019) Validation of the Integrated\nPalliative care Outcome Scale (IPOS) - Japanese version. Jpn J\nClin Oncol 49(3):257–262. https://doi.org/10.1093/jjco/hyy203\n85. Downar J, Goldman R, Pinto R, Englesakis M, Adhikari NK\n(2017) The “surprise question” for predicting death in seriously\nill patients: a systematic review and meta-analysis. CMAJ\n189(13):E484–E493. https://doi.org/10.1503/cmaj.160775\n86. White N, Kupeli N, Vickerstaff V, Stone P (2017) How accurate is\nthe ‘Surprise Question’at identifying patients at the end of life? A\nsystematic review and meta-analysis. BMC Med 15(1):139.\nhttps://doi.org/10.1186/s12916-017-0907-4\n87. Cleland JG, Chattopadhyay S, Khand A, Houghton T, Kaye GC\n(2002) Prevalence and incidence of arrhythmias and sudden death\nin heart failure. Heart Fail Rev 7(3):229 –242. https://doi.org/10.\n1023/a:1020024122726\n88. MERIT-HF Study Group (1999) Effect of metoprolol CR/XL in\nchronic heart failure: metoprolol CR/XL randomised intervention\ntrial in congestive heart failure (MERIT-HF). Lancet 353(9169):\n2001–2007. https://doi.org/10.1016/S0140-6736(99)04440-2\n89. Waller A, Girgis A, Johnson C, Lecathelinais C, Sibbritt D,\nSeldon M, Bonaventura T, Currow D, on behalf of the Palliative\nCare Research Program team (2012) Implications of a needs as-\nsessment intervention for people with progressive cancer: impact\non clinical assessment, response and service utilisation.\nPsychooncology 21(5):550 –557. https://doi.org/10.1002/pon.\n1933\n90. Gómez-Batiste X, Martínez-Muñoz M, Blay C, Amblàs J, Vila L,\nCosta X, Espaulella J, Villanueva A, Oller R, Martori JC,\nConstante C (2017) Utility of the NECPAL CCOMS-ICO© tool\nand the Surprise Question as screening tools for early palliative\ncare and to predict mortality in patients with advanced chronic\n154 Heart Fail Rev (2021) 26:137–155\nconditions: a cohort study. Palliat Med 31(8):754–763. https://doi.\norg/10.1177/0269216316676647\n91. Johnson MJ. Systematic identification and triage of palliative care\nneeds of patients and family carers. Hull York Medical School\nhttp://www.yhscn.nhs.uk/me dia/End%20of%20Life%20Care/\nPresentations%20Posters/Needs%20Assessment.pdf . Accessed\n14 Jun 2020\n92. Kluger BM, Miyasaki J, Katz M, Galifianakis N, Hall K, Pantilat\nS, Khan R, Friedman C, Cernik W, Goto Y, Long J, Fairclough D,\nSillau S, Kutner JS (2020) Comparison of integrated outpatient\npalliative care with standard care in patients with Parkinson dis-\nease and related disorders: a randomized clinical trial. JAMA\nNeurol 77(5):551–560. https://doi.org/10.1001/jamaneurol.2019.\n4992\n93. Guillemin F, Bombardier C, Beaton D (1993) Cross-cultural ad-\naptation of health-related quality of life measures: literature review\nand proposed guidelines. J Clin Epidemiol 46(12):1417 –1432.\nhttps://doi.org/10.1016/0895-4356(93)90142-n\n94. Herdman M, Fox-Rushby J, Badia X (1998) A model of equiva-\nlence in the cultural adaptation of HRQoL instruments: the uni-\nversalist approach. Qual Life Res 7(4):323 –335. https://doi.org/\n10.1023/a:1024985930536\n95. Rietjens JA, Sudore RL, Connolly M, van Delden JJ, Drickamer\nMA, Droger M, van der Heide A, Heyland DK, Houttekier D,\nJanssen DJA, Orsi L, Payne S, Seymour J, Jox RJ, Korfage IJ,\nEuropean Association for Palliative Care (2017) Definition and\nrecommendations for advance care planning: an international con-\nsensus supported by the European Association for Palliative Care.\nLancet Oncol 18(9):e543 –e551. https://doi.org/10.1016/s14e70-\n2045(17)30582-x\n96. Jimenez G, Tan WS, Virk AK, Low CK, Car J, Ho AH (2018)\nOverview of systematic reviews of advance care planning: sum-\nmary of evidence and global lessons. J Pain Symptom Manag\n56(3):436–459.e25. https://doi.org/10.1016/j.jpainsymman.2018.\n05.016\n97. Jimenez G, Tan WS, Virk AK, Low CK, Car J, Ho AH (2019)\nState of advance care planning research: a descriptive overview of\nsystematic reviews. Palliat Support Care 17(2):234 –244. https://\ndoi.org/10.1017/s1478951518000500\n98. Schichtel M, Wee B, MacArtney JI, Collins S (2019) Clinician\nbarriers and facilitators to heart failure advance care plans: a sys-\ntematic literature review and qualitative evidence synthesis. BMJ\nSupport Palliat Care. https://doi.org/10.1136/bmjspcare-2018-\n001747\n99. Rietjens JA, Bramer WM, Geijteman EC, van der Heide A,\nOldenmenger WH (2019) Development and validation of search\nfilters to find articles on palliative care in bibliographic databases.\nPalliat Med 33(4):470 –474. https://doi.org/10.1177/\n0269216318824275\n100. Fitzsimons D, Strachan PH (2012) Overcoming the challenges of\nconducting research with people who have advanced heart failure\nand palliative care needs. Eur J Cardiovasc Nurs 11(2):248 –254.\nhttps://doi.org/10.1016/j.ejcnurse.2010.12.002\n101. Booth A, Sutton A, Papaioannou D (2016) Synthesising and\nanalysing quantitative studies. In: Booth A, Sutton A,\nPapaioannou D (eds) Systematic approaches to a successful liter-\nature review, 2nd edn. Sage, London, pp 171 –214\n102. Pluye P, Gagnon MP, Griffiths F, Johnson-Lafleur J (2009) A\nscoring system for appraising mixed methods research, and con-\ncomitantly appraising qualitative, quantitative and mixed methods\nprimary studies in mixed studies reviews. Int J Nurs Stud 46(4):\n529–546. https://doi.org/10.1016/j.ijnurstu.2009.01.009\nPublisher’sn o t e Springer Nature remains neutral with regard to jurisdic-\ntional claims in published maps and institutional affiliations.\n155Heart Fail Rev (2021) 26:137–155",
  "topic": "Palliative care",
  "concepts": [
    {
      "name": "Palliative care",
      "score": 0.8409004211425781
    },
    {
      "name": "Medicine",
      "score": 0.7631524801254272
    },
    {
      "name": "CINAHL",
      "score": 0.7055869698524475
    },
    {
      "name": "MEDLINE",
      "score": 0.5918596386909485
    },
    {
      "name": "PsycINFO",
      "score": 0.5869436860084534
    },
    {
      "name": "Needs assessment",
      "score": 0.5696892142295837
    },
    {
      "name": "Context (archaeology)",
      "score": 0.4832521080970764
    },
    {
      "name": "Systematic review",
      "score": 0.4358541667461395
    },
    {
      "name": "Psychometrics",
      "score": 0.410361647605896
    },
    {
      "name": "Nursing",
      "score": 0.25809362530708313
    },
    {
      "name": "Clinical psychology",
      "score": 0.0988086462020874
    },
    {
      "name": "Psychological intervention",
      "score": 0.09122094511985779
    },
    {
      "name": "Sociology",
      "score": 0.0
    },
    {
      "name": "Biology",
      "score": 0.0
    },
    {
      "name": "Political science",
      "score": 0.0
    },
    {
      "name": "Law",
      "score": 0.0
    },
    {
      "name": "Paleontology",
      "score": 0.0
    },
    {
      "name": "Social science",
      "score": 0.0
    }
  ]
}