{
  "title": "Standardising care in the ICU: a protocol for a scoping review of tools used to improve care delivery",
  "url": "https://openalex.org/W3042627914",
  "year": 2020,
  "authors": [
    {
      "id": "https://openalex.org/A2605735170",
      "name": "Laura Allum",
      "affiliations": [
        "King's College London"
      ]
    },
    {
      "id": "https://openalex.org/A2710549640",
      "name": "Chloe Apps",
      "affiliations": [
        "St Thomas' Hospital",
        "Guy's and St Thomas' NHS Foundation Trust"
      ]
    },
    {
      "id": "https://openalex.org/A2130134040",
      "name": "Nicholas Hart",
      "affiliations": [
        "King's College London",
        "Guy's and St Thomas' NHS Foundation Trust",
        "National Institute for Health Research",
        "NIHR Biomedical Research Centre at The Royal Marsden and the ICR"
      ]
    },
    {
      "id": "https://openalex.org/A2098879762",
      "name": "Natalie Pattison",
      "affiliations": [
        "Florence Nightingale Foundation"
      ]
    },
    {
      "id": "https://openalex.org/A1993510163",
      "name": "Bronwen Connolly",
      "affiliations": [
        "Queen's University Belfast",
        "University of Melbourne",
        "King's College London"
      ]
    },
    {
      "id": "https://openalex.org/A2147509969",
      "name": "Louise Rose",
      "affiliations": [
        "King's College London"
      ]
    },
    {
      "id": "https://openalex.org/A2605735170",
      "name": "Laura Allum",
      "affiliations": [
        "King's College London",
        "Centre for Nursing Innovation"
      ]
    },
    {
      "id": "https://openalex.org/A2710549640",
      "name": "Chloe Apps",
      "affiliations": [
        "Guy's and St Thomas' NHS Foundation Trust"
      ]
    },
    {
      "id": "https://openalex.org/A2130134040",
      "name": "Nicholas Hart",
      "affiliations": [
        "Centre for Nursing Innovation",
        "Guy's and St Thomas' NHS Foundation Trust"
      ]
    },
    {
      "id": "https://openalex.org/A2098879762",
      "name": "Natalie Pattison",
      "affiliations": [
        "Florence Nightingale Foundation"
      ]
    },
    {
      "id": "https://openalex.org/A1993510163",
      "name": "Bronwen Connolly",
      "affiliations": [
        "Centre for Nursing Innovation",
        "Queen's University Belfast",
        "King's College London",
        "University of Melbourne"
      ]
    },
    {
      "id": "https://openalex.org/A2147509969",
      "name": "Louise Rose",
      "affiliations": [
        "King's College London",
        "Centre for Nursing Innovation"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1941368619",
    "https://openalex.org/W2063094401",
    "https://openalex.org/W2110115774",
    "https://openalex.org/W2003143911",
    "https://openalex.org/W2795822965",
    "https://openalex.org/W2787310623",
    "https://openalex.org/W2346781430",
    "https://openalex.org/W2075446217",
    "https://openalex.org/W1977283305",
    "https://openalex.org/W2046883748",
    "https://openalex.org/W1975847015",
    "https://openalex.org/W1915438975",
    "https://openalex.org/W2095156824",
    "https://openalex.org/W2487741839",
    "https://openalex.org/W1964722451",
    "https://openalex.org/W1985319918",
    "https://openalex.org/W2024151720",
    "https://openalex.org/W1971898772",
    "https://openalex.org/W2501411339",
    "https://openalex.org/W2053296568",
    "https://openalex.org/W2027295311",
    "https://openalex.org/W1968419082",
    "https://openalex.org/W2101154195",
    "https://openalex.org/W1506288911",
    "https://openalex.org/W2076774749",
    "https://openalex.org/W1996415907",
    "https://openalex.org/W2110418226",
    "https://openalex.org/W2079366077",
    "https://openalex.org/W2168892842",
    "https://openalex.org/W2108463415",
    "https://openalex.org/W2936423227",
    "https://openalex.org/W2020842956",
    "https://openalex.org/W2080526315",
    "https://openalex.org/W2891378911",
    "https://openalex.org/W2075950485",
    "https://openalex.org/W2156098321",
    "https://openalex.org/W2320276705",
    "https://openalex.org/W2077109464",
    "https://openalex.org/W2901724277",
    "https://openalex.org/W2084154288",
    "https://openalex.org/W2991792334",
    "https://openalex.org/W2080860687"
  ],
  "abstract": null,
  "full_text": "PROTOCOL Open Access\nStandardising care in the ICU: a protocol\nfor a scoping review of tools used to\nimprove care delivery\nLaura Allum 1,2* , Chloe Apps 3,4, Nicholas Hart 2,5, Natalie Pattison 6, Bronwen Connolly 2,7,8,9 and Louise Rose 1,2\nAbstract\nBackground: Increasing numbers of critically ill patients experience a prolonged intensive care unit stay\ncontributing to greater physical and psychological morbidity, strain on families and cost to health systems. Quality\nimprovement tools such as checklists concisely articulate best practices with the aim of improving quality and\nsafety; however, these tools have not been designed for the specific needs of patients with prolonged ICU stay.\nThe primary objective of this review will be to determine the characteristics including format and content of\nmulticomponent tools designed to standardise or improve ICU care. Secondary objectives are to describe the\noutcomes reported in these tools, the type of patients and settings studied, and to understand how these tools\nwere developed and implemented in clinical practice.\nMethods: We will search the Cochrane Library, the Cumulative Index to Nursing and Allied Health Literature (CINA\nHL), EMBASE, MEDLINE, PsycINFO, Web of Science, OpenGrey, NHS evidence and Trial Registries from January 2000\nonwards. We will include primary research studies (e.g. experimental, quasi-experimental, observational and\nqualitative studies) recruiting more than 10 adult participants admitted to ICUs, high dependency units and\nweaning centres regardless of length of stay, describing quality improvement tools such as structured care plans or\nchecklists designed to standardize more than one aspect of care delivery. We will extract data on study and patient\ncharacteristics, tool design and implementation strategies and measured outcomes. Two reviewers will\nindependently screen citations for eligible studies and perform data extraction. Data will be synthesised with\ndescriptive statistics; we will use a narrative synthesis to describe review findings.\nDiscussion: The findings will be used to guide development of tools for use with prolonged ICU stay patients. Our\ngroup will use experience-based co-design methods to identify the most important actionable processes of care to\ninclude in quality improvement tools these patients. Such tools are needed to standardise practice and thereby\nimprove quality of care. Illustrating the development and implementation methods used for such tools will help to\nguide translation of similar tools into ICU clinical practice and future research.\nSystematic review registration: This protocol is registered on the Open Science Framework, https://osf.io/, DOI\nhttps://doi.org/10.17605/OSF.IO/Z8MRE\nKeywords: Critical care, Patient care planning, Checklist, Delivery of Healthcare, Prolonged critical illness\n© The Author(s). 2020 Open Access This article is licensed under a Creative Commons Attribution 4.0 International License,\nwhich permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give\nappropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if\nchanges were made. The images or other third party material in this article are included in the article's Creative Commons\nlicence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons\nlicence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain\npermission directly from the copyright holder. To view a copy of this licence, visit http://creativecommons.org/licenses/by/4.0/.\nThe Creative Commons Public Domain Dedication waiver ( http://creativecommons.org/publicdomain/zero/1.0/) applies to the\ndata made available in this article, unless otherwise stated in a credit line to the data.\n* Correspondence: laura.allum@kcl.ac.uk\n1Florence Nightingale Faculty of Nursing, Midwifery and Palliative Care, King ’s\nCollege London, London, UK\n2Lane Fox Clinical Respiratory Physiology Research Centre, London, UK\nFull list of author information is available at the end of the article\nAllum et al. Systematic Reviews           (2020) 9:164 \nhttps://doi.org/10.1186/s13643-020-01414-6\nBackground\nIncreasing numbers of patients remain in intensive care\nunits (ICUs) for longer than a week due to increased\nsurvival rates, comorbidity and age in the general popu-\nlation resulting in lower resilience to acute illness and\nlonger recovery [ 1– 4]. Various terminology is used to\ndescribe these patients including ‘persistent critical ill-\nness’ and ‘chronic critical illness ’ (CCI). Persistent crit-\nical illness is used to describe the point at which a\npatient’s presenting condition no longer predicts their\nrisk of mortality [ 1]. Patients, however, continue to ex-\nperience ongoing illness-related complications and organ\nfailure [ 5]. This differentiates these patients from those\nexperiencing prolonged respiratory weaning or condi-\ntions with an inherently long recovery time such as\nGuillain-Barré syndrome. Chronic critical illness is also\nused to describe patients with a prolonged length of stay\n(LOS) [ 2] and refers to a medically complex group of pa-\ntients with multiple co-morbidities, often of older age.\nThis frailty can result in less physical resilience to with-\nstand the insult of critical illness [ 6]. For clarity, the term\n‘prolonged ICU stay ’which encompasses both persistent\nand chronic critical illness, will be used in this paper to\ndescribe any patient with a stay of over 7 days. This\ntimepoint is the lower threshold defined by Iwashyna\net al. [ 7], who suggest that the transition to persistent\ncritical illness occurs within a range of 7 – 22 days. These\npatients experience a range of complications, including\nmuscle wasting [ 3] and long-term physical and func-\ntional deficits [ 8, 9], psychological distress [ 10], and cog-\nnitive deficits, leading to longer stays in hospital after\nICU discharge [ 3] and prolonged recovery. They are\nmore likely to die [ 11], and survivors are less likely to\nreturn home, often requiring ongoing nursing or resi-\ndential care [ 12, 13]. Family members experience signifi-\ncant levels of psychological distress [ 14, 15], which may\nrequire involvement of social workers or psychologists.\nThe transition from acute critical illness to a pro-\nlonged ICU stay involves a shift in the goals of care. This\nfrequently involves professions and specialities not typic-\nally involved in the acute phase of care, such as speech\nand language therapists, occupational therapists, social\nworkers, and palliative care. The needs of this patient\ngroup are distinct and include rehabilitation. Family\nmembers require regularly updates and involvement in\ncare [ 10]. Clinicians report feeling dissatisfied with their\nmanagement of these patients due to the need to priori-\ntise care for more unstable patients [ 12], a dislike of car-\ning for lower acuity patients and a lack of training [ 16].\nIntensive care units are complex environments, involv-\ning the coordination of multiple healthcare professions,\nspecialties and numerous tasks for patients with life-\nthreatening conditions [ 17]. Communication errors are\ncommon [ 18, 19] and contribute to patient harm and\nfrustrations for clinicians [ 18, 20, 21]. In response to\nthese errors, quality improvement tools including check-\nlists, tools to structure ward rounds, bundles and proto-\ncols have been developed for the purposes of\nstandardising care. These tools have the potential to im-\nprove safety [ 22, 23], patient, family and staff satisfaction\n[24], and understanding of goals of treatment [ 25– 28],\nand can decrease ICU length of stay [ 17, 28]. However,\nthese tools most commonly focus on medically orien-\ntated priorities of care delivery during the acute period\nof ICU admission [ 29– 31]. Such tools may be less rele-\nvant to more stable patients requiring aspects of care de-\nlivery such as mobilisation, communication aids and\npatient-led goal setting [ 12, 32]. Additionally, many of\nthese tools are designed for delivery of a single element\nof care, such as the prevention of infection associated\nwith central line insertion, rather than the coordination\nof a range of tasks by the interprofessional team.\nThe ability of such tools to impact care is dependent\non a wide range of factors [ 33], including successful\nimplementation addressing local barriers to adoption,\nwidespread ‘buy-in’ from clinicians and ongoing imple-\nmentation strategies to sustain use [ 33]. A 2013 system-\natic review of the impact of knowledge translation\nstudies in ICU concluded that there was insufficient evi-\ndence to identify the most effective knowledge transla-\ntion strategies for improving practice in the ICU,\nparticularly for quality improvement measures which\ncannot be protocolised — however, it did not include\nqualitative literature [ 34].\nWhy is it important to do this review?\nGiven the demonstrable benefits of ICU quality im-\nprovement tools for patients in the acute phase of ICU\nadmission, knowledge of the elements and factors that\nfacilitate successful implementation could inform design\nof similar tools to address the distinct care needs of\npatients experiencing a prolonged ICU stay [ 32]. This is\nparticularly important given the rising prevalence of\nthese patients and their cost to the healthcare system.\nTo the best of our knowledge, no review has synthesised\nthis information.\nOur primary objective is to determine the characteris-\ntics (i.e., format, content) of multicomponent tools de-\nsigned to standardise and/or improve care delivery in\nadult ICU patient management. Our secondary objec-\ntives are to describe (1) what outcomes are reported,\nhow they are measured and their effect; (2) the type of\npatients studied; (3) how tools were developed including\npatients and/or family member involvement; and (4)\nhow these tools are implemented in practice.\nWe have chosen a scoping review approach as de-\nscribed by Tricco et al. [ 35] and adapted from Arksey\nand O ’Malley [ 36] as the most appropriate methodology\nAllum et al. Systematic Reviews           (2020) 9:164 Page 2 of 5\nto achieve our objective of mapping the different com-\nponents of these tools and the research on them to date.\nWe also anticipate a range of different methodologies\nand study designs, for which scoping reviews are the\nadvised methodology [ 36].\nMethods\nThe present protocol has been registered within the\nOpen Science Framework platform ( https://osf.io/\nz8mre). It is reported in accordance with the reporting\nguidance provided in the Preferred Reporting Items\nfor Systematic Reviews and Meta-Analyses Protocols\n(PRISMA-P) statement [ 37]and the PRISMA extension\nfor Scoping Reviews (PRISMA-ScR) [ 35] see PRISMA-P\nchecklist in Additional file 1).\nInformation sources and searches\nA search strategy (Additional file 2) was created using a\ncombination of MeSH terms and keyword combinations.\nWe will adapt the search strategy for each database. We\nwill search electronic databases including MEDLINE\n(Ovid), the Cumulative Index to Nursing and Allied\nHealth Literature (CINAHL), EMBASE, PsycINFO and\nWeb of Science from January 2000 onwards, to reflect\ncurrent ICU care. We will search for ongoing or com-\npleted trials using the World Health Organisation Inter-\nnational Clinical Trials Registry Platform ( http://apps.\nwho.int/trialsearch/) and systematic reviews via the\nCochrane Library. We will search for grey literature\nusing Opengrey (http://www.opengrey.eu/), NHS evi-\ndence ( https://www.evidence.nhs.uk/), Google Scholar\nand Prospero. We will scan reference lists of included\nstudies for other studies of relevance. We will exclude\neditorials, commentaries and animal studies. LA will\ncontact authors where necessary for full-text papers or\nto enquire about unpublished work identified through\nprotocols or trial registries. A draft search for MEDLINE\n(Ovid) is available in Additional file 2.\nEligibility criteria\nArticles will be selected according to the following cri-\nteria for study population, intervention and comparator\nand study design.\nPopulation\nWe will include studies recruiting adult patients aged\n18 years and older admitted to an intensive or critical\ncare unit, high dependency or a weaning centre, respira-\ntory care unit or long-term acute care hospital (LTAC\nH), regardless of length of stay. We will also include\nstudies that include family members/caregivers and the\nhealthcare practitioners responsible for the care of these\npatients as participants.\nIntervention\nWe will include studies that report on quality improve-\nment interventions such as multicomponent structured\ncare plans, goal sheets, or checklists designed to\nstandardize or remind clinicians about more than one\naspect of care delivery. We will exclude checklists for\nprocedures such as central line insertion or tools such as\ncare bundles with single objectives of care, e.g. to pre-\nvent ventilator-associated pneumonia. Protocols, includ-\ning those for delirium prevention, sedation management,\nweaning, and mobilisation will also be excluded as we do\nnot seek to produce a decision algorithm and therefore\nthis format is outside the scope of this review. Examples\nof such tools are daily goals sheets [ 38, 17] and rounding\nchecklists [ 31].We will exclude: 1. checklists for proce-\ndures such as central line insertion; 2. care bundles with\nsingle objectives of care e.g. to prevent ventilator-\nassociated pneumonia; 3. Single objective protocols, in-\ncluding those for delirium prevention, sedation manage-\nment, weaning, and mobilisation will also be excluded as\nwe do not seek to produce a decision algorithm and\ntherefore this format is outside the scope of this review.\nComparators\nWe will include studies with an active comparator (i.e.\nanother quality improvement tool), a passive comparator\n(i.e. usual care) and no comparator.\nOutcomes\nWe will not make decisions related to inclusion of\nstudies based on outcomes reported.\nStudy design\nWe will include all qualitative and quantitative study\ndesigns including experimental, quasi-experimental,\nobservational studies and qualitative studies except case\nseries, as this design is not appropriate for the evaluation\nof a Quality Improvement (QI) tool. For pragmatic\nreasons, we will only include studies published in\nEnglish. We will include unpublished work in the form\nof conference proceedings and theses.\nStudy selection\nOne author (LA) will independently screen titles and ab-\nstracts to remove obvious exclusions using Endnote X8.\nThe full text of citations selected for potential inclusion\nwill be retrieved and assessed independently by two\nauthors (LA and CA) for eligibility, with a third reviewer\n(LR) available for arbitration if needed. All decisions will\nbe recorded in an Excel file.\nData charting process\nTwo authors (LA and CA) will independently extract\ndata using a Google form (Additional File 3) iteratively\nAllum et al. Systematic Reviews           (2020) 9:164 Page 3 of 5\ndesigned for this review by three authors (LA, CA and\nLR). The form captures the following variables:\n/C15Participants—participant characteristics (patient/\nfamily member/healthcare worker), country, setting\n(e.g. ICU or weaning unit), admitting speciality).\n/C15Study design —study type and methodology used\n/C15Tool—the type, design, frequency of completion,\ncontent and aims of the QI tool described\n/C15Tool development —we will extract data on how the\ntool was developed, including patient and family\ninvolvement and feasibility testing,\n/C15Tool implementation —methods used and evaluated\nusing the Theoretical Domains Framework [ 39]t o\ndescribe barriers and facilitators to adoption.\n/C15Outcomes—the effect of the interventions will be\nextracted including descriptive data and outcome\nmeasures used.\nDifferences in extracted data between the two re-\nviewers will be resolved by discussion, and a third re-\nviewer (LR) consulted if an agreement cannot be\nreached. LA will contact corresponding authors for\nmissing information as needed (e.g. tool development or\nimplementation strategies).\nCritical appraisal of evidence sources\nWe will use the results of the MMAT [ 40]t oh e l pi n -\nform conclusions and recommendations from the\nscoping review, as a robust tool for describing quality\nof mixed-methods studies. The authors of the tool\nstrongly discourage using stand-alone numerical\nscores for studies, and so we intend to use the tool\nas they advise to describe high-, medium- and low-\nquality studies [ 41].\nEvidence synthesis, analysis and interpretation\nWe will complete a PRISMA study flow diagram [ 37]t o\ndescribe our search results. We will provide a narrative\nsynthesis to describe our findings as recommended by\nLevac et al. [ 42].\nWe will summarise characteristics of included studies,\nincluding the setting (type of unit and country) and type\nof tool used using descriptive statistics.\nTo address our primary objective, we will present\ntables grouped according to tool type (e.g. checklist, care\nplan, goal sheet) describing the purpose and content of\neach tool. We will include reported outcomes, their\nmeasures (if applicable) and the effects of the interven-\ntion on these outcomes.\nTo address our secondary objectives, a table will be\nproduced describing the patients and settings studied in\neach included tool, and tool development including\nsource of content (e.g. published evidence, expert\nopinion) and whether patients and family members were\ninvolved in its development. Data on methods of tool\nimplementation will be summarised with reported\nbarriers and facilitators interpreted using the Theoretical\nDomains Framework.\nDiscussion\nInternational work [ 32] to identify and prioritise the pro-\ncesses of care that most improve the experience of pa-\ntients with prolonged ICU stay and their families is\nongoing, using principles of experience-based co-design.\nThe findings of this review will inform the design and im-\nplementation of quality improvement tools to improve/\nstandardise the delivery of these identified processes of\ncare, to assist knowledge translation to clinical practice.\nA previous systematic review [ 32] failed to identify any\nquality improvement tools specific to long stay patients\nin intensive care. An improved comprehension of how\nsuch tools are developed and implemented will help to\nguide translation for similar tools in ICU.\nLimitations of our findings are anticipated due to het-\nerogeneity in the tools studied and differences in the\ncontext in which they are applied, and the selection bias\ninherent with only including papers published in Eng-\nlish, and after 2000. Limitations of scoping review meth-\nodology will mean that a synthesis of findings across\narticles is not possible.\nThis review will also provide a summary for clinicians\nseeking to better understand and utilise the range of\nquality improvement tools used to improve more than\none aspect of care in the ICU.\nSupplementary information\nSupplementary information accompanies this paper at https://doi.org/10.\n1186/s13643-020-01414-6.\nAdditional file 1. PRISMA extension for scoping reviews checklist (PRIS\nMA-scr).\nAdditional file 2. MEDLINE search strategy.\nAdditional file 3. Date extraction document.\nAbbreviations\nICU: Intensive care unit; CCI: Chronic critical illness; LOS: Length of stay; PRIS\nMA-scr: Preferred Reporting Items for Systematic Reviews and Meta-Analyses,\nScoping Review; MeSH: Medical Subject Headings; LTACH: Long-term acute\ncare hospital; QI: Quality improvement\nAcknowledgements\nNot applicable.\nAuthors’ contributions\nLA and LR conceived of this review. LA drafted the protocol under the\nsupervision of LR. All authors read and approved the final manuscript. No\nfunding body, sponsor nor institution had any involvement in the\ndevelopment of this protocol. This paper presents independent research\nfunded by the National Institute for Health Research (NIHR). The views\nexpressed are those of the authors and not necessarily those of the NHS, the\nNIHR or the Department of Health and Social Care.\nAllum et al. Systematic Reviews           (2020) 9:164 Page 4 of 5\nFunding\nLaura Allum is funded by a National Institute for Health Research (NIHR)\nClinical Doctoral Fellowship for this research project.\nAvailability of data and materials\nNot applicable.\nEthics approval and consent to participate\nNot applicable.\nConsent for publication\nNot applicable.\nCompeting interests\nThe authors declare that they have no competing interests.\nAuthor details\n1Florence Nightingale Faculty of Nursing, Midwifery and Palliative Care, King ’s\nCollege London, London, UK. 2Lane Fox Clinical Respiratory Physiology\nResearch Centre, London, UK. 3Physiotherapy department, St. Thomas ’\nHospital, Guy ’s and St. Thomas ’ NHS Foundation Trust, Westminster Bridge\nRd, London, UK. 4Critical Care Research Group, St. Thomas ’ Hospital, Guy ’s\nand St. Thomas ’ NHS Foundation Trust, Westminster Bridge Rd, London, UK.\n5National Institute for Health Research Biomedical Research Centre, Guy ’s and\nSt. Thomas ’ NHS Foundation and King ’s College London, London, UK.\n6University of Hertfordshire; East & North Herts NHS Trust; Florence\nNightingale Foundation, London, UK. 7Wellcome-Wolfson Institute for\nExperimental Medicine, Queen ’s University Belfast, Belfast, UK. 8Centre for\nHuman and Applied Physiological Sciences, King ’s College London, London,\nUK. 9Department of Physiotherapy, The University of Melbourne, Melbourne,\nAustralia.\nReceived: 29 November 2019 Accepted: 25 June 2020\nReferences\n1. Iwashyna TJ, et al. Towards defining persistent critical illness and other\nvarieties of chronic critical illness. Crit Care Resusc. 2015;17(3):215 – 8.\n2. Kahn JM, et al. The epidemiology of chronic critical illness in the United\nStates. Crit Care Med. 2015;43(2):282 – 7.\n3. Nelson JE, et al. Chronic critical illness. Am J Respir Crit Care Med. 2010;\n182(4):446– 54.\n4. Sjoding MW, Cooke CR. Chronic critical illness: a growing legacy of\nsuccessful advances in critical care. Crit Care Med. 2015;43(2):476 – 7.\n5. Viglianti EM, et al. Late organ failures in patients with prolonged intensive\ncare unit stays. Journal of Critical Care. 2018;46:55 – 7.\n6. Pugh R, Ellison A, Pye K, et al. Feasibility and reliability of frailty assessment\nin the critically ill: a systematic review. Critical Care. 2018.\n7. Iwashyna T, et al. Timing of onset and burden of persistent critical illness in\nAustralia and New Zealand: a retrospective, population-based, observational\nstudy. Lancet Respir Med. 2016;4(7):566 – 73.\n8. Chelluri L, et al. Long-term mortality and quality of life after prolonged\nmechanical ventilation. Critical care medicine. 2004;32(1):61 – 9.\n9. Combes A, et al. Morbidity, mortality, and quality-of-life outcomes of\npatients requiring ≥ 14 days of mechanical ventilation. Critical care\nmedicine. 2003;31(5):1373 – 81.\n10. Rose L, et al. Psychological wellbeing, health related quality of life and\nmemories of intensive care and a specialised weaning centre reported by\nsurvivors of prolonged mechanical ventilation. Intensive Crit Care Nurs.\n2014;30(3):145– 51.\n11. Leroy G, et al. One-year mortality in patients requiring prolonged\nmechanical ventilation: multicenter evaluation of the ProVent score. Crit\nCare. 2014;18(4):R155. https://doi.org/10.1186/cc13994.\n12. Iwashyna TJ, et al. Persistent critical illness characterised by Australian and\nNew Zealand ICU clinicians. Crit Care Resusc. 2015;17(3):153 – 8.\n13. Douglas SL, et al. Survival and quality of life: short-term versus long-term\nventilator patients. Critical care medicine. 2002;30(12):2655 – 62.\n14. Wintermann GB, et al. Predictors of posttraumatic stress and quality of\nlife in family members of chronically critically ill patients after intensive\ncare. Ann Intensive Care. 2016;6(1):69. https://doi.org/10.1186/s13613-\n016-0174-0 .\n15. Hickman RL Jr. and S.L. Douglas, Impact of chronic critical illness on the\npsychological outcomes of family members. AACN Adv Crit Care. 2010;21(1):80– 91.\n16. Roulin, M.-J., M.-F. Boul'ch, and P. Merlani, Staff satisfaction between 2\nmodels of care for the chronically critically ill. Journal of Critical Care, 2012.\n27(4): p. 426.e1-426.e8.\n17. Pronovost P, et al. Improving communication in the ICU using daily goals. J\nCrit Care. 2003;18(2):71 – 5.\n18. Reader TW, Flin R, Cuthbertson BH. Communication skills and error in the\nintensive care unit. Current opinion in critical care. 2007;13(6):732 – 6.\n19. Alvarez G, Coiera E. Interruptive communication patterns in the intensive\ncare unit ward round. International journal of medical informatics. 2005;\n74(10):791– 6.\n20. Thomas A, MacDonald J. A review of patient safety incidents reported as\n‘severe’or ‘death’from critical care units in England and Wales between 2004\nand 2014. Anaesthesia. 2016;71(9):1013 – 23.\n21. Pronovost PJ, et al. Improving patient safety in intensive care units in\nMichigan. Journal of Critical Care. 2008;23(2):207 – 21.\n22. Rosen MA, Pronovost PJ. Advancing the use of checklists for evaluating\nperformance in health care. Acad Med. 2014;89(7):963 – 5.\n23. Sagana R, Hyzy RC. Achieving zero central line-associated bloodstream\ninfection rates in your intensive care unit. Critical Care Clinics. 2013;29(1):1 – 9.\n24. Jacobowski NL, et al. Communication in critical care: family rounds in the\nintensive care unit. Am J Crit Care. 2010;19(5):421 – 30.\n25. Gonzalo JD, et al. Bedside interprofessional rounds: perceptions of benefits\nand barriers by internal medicine nursing staff, attending physicians, and\nhousestaff physicians. J Hosp Med. 2014;9(10):646 – 51.\n26. Agarwal S, et al. Improving communication in a pediatric intensive care unit\nusing daily patient goal sheets. J Crit Care. 2008;23(2):227 – 35.\n27. Phipps LM, Thomas NJ. The use of a daily goals sheet to improve\ncommunication in the paediatric intensive care unit. Intensive Crit Care\nNurs. 2007;23(5):264 – 71.\n28. Narasimhan M, et al. Improving nurse-physician communication and\nsatisfaction in the intensive care unit with a daily goals worksheet. Am J Crit\nCare. 2006;15(2):217 – 22.\n29. Newkirk M, et al. Checklists change communication about key elements of\npatient care. J Trauma Acute Care Surg. 2012;73(2 Suppl 1):S75 – 82.\n30. Siegele P. Enhancing outcomes in a surgical intensive care unit by\nimplementing daily goals tools. Critical care nurse. 2009;29(6):58 – 69.\n31. Weiss CH, et al. Prompting physicians to address a daily checklist and\nprocess of care and clinical outcomes: a single-site study. Am J Respir Crit\nCare Med. 2011;184(6):680 – 6.\n32. Rose L, et al. Patient and family centered actionable processes of care and\nperformance measures for persistent and chronic critical illness: a systematic\nreview. Critical Care Explorations. 2019;1(4):e0005.\n33. Bosk CL, et al. Reality check for checklists. The Lancet. 2009;374(9688):444 – 5.\n34. Sinuff T, et al. Knowledge translation interventions for critically ill patients: a\nsystematic review. Crit Care Med. 2013;41(11):2627 – 40.\n35. Tricco AC, et al. PRISMA Extension for Scoping Reviews (PRISMA-ScR):\nChecklist and ExplanationThe PRISMA-ScR Statement. Annals of Internal\nMedicine. 2018;169(7):467 – 73.\n36. Arksey H, O'Malley L. Scoping studies: towards a methodological framework.\nInternational journal of social research methodology. 2005;8(1):19 – 32.\n37. Moher D, et al. Preferred reporting items for systematic reviews and meta-\nanalyses: the PRISMA statement. BMJ. 2009;339:b2535.\n38. Centofanti, J.E., et al., Use of a daily goals checklist for morning ICU rounds:\na mixed-methods study. Critical Care Medicine. 42(8): p. 1797-803.\n39. Cane J, O ’Connor D, Michie S. Validation of the theoretical domains\nframework for use in behaviour change and implementation research.\nImplementation Science. 2012;7(1):37.\n40. Hong QN, et al. The Mixed Methods Appraisal Tool (MMAT) version 2018 for\ninformation professionals and researchers. Education for Information. 2018;\n34(4):285– 91.\n41. Hong, Q.N. Questions on the MMAT version 2018. 2018; Available from: http://\nmixedmethodsappraisaltoolpublic.pbworks.com/w/file/fetch/140056890/\nReporting%20the%20results%20of%20the%20MMAT.pdf. Accessed 5th June 2020.\n42. Levac D, Colquhoun H, O'Brien KK. Scoping studies: advancing the\nmethodology. Implementation Science. 2010;5(1):69.\nPublisher’sN o t e\nSpringer Nature remains neutral with regard to jurisdictional claims in\npublished maps and institutional affiliations.\nAllum et al. Systematic Reviews           (2020) 9:164 Page 5 of 5",
  "topic": "Medicine",
  "concepts": [
    {
      "name": "Medicine",
      "score": 0.9536395072937012
    },
    {
      "name": "Protocol (science)",
      "score": 0.732836127281189
    },
    {
      "name": "Nursing",
      "score": 0.4901209771633148
    },
    {
      "name": "Alternative medicine",
      "score": 0.23245644569396973
    },
    {
      "name": "Pathology",
      "score": 0.0
    }
  ]
}