{
    "title": "CO2 footprint for distribution oil immersed transformers according to ISO 14067:2018",
    "url": "https://openalex.org/W3043247710",
    "year": 2020,
    "authors": [
        {
            "id": "https://openalex.org/A5049959836",
            "name": "Vlatka Šerkinić",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2149300032",
            "name": "Marijana Majić Renjo",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2600376103",
            "name": "Viktor Ucović",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A5049959836",
            "name": "Vlatka Šerkinić",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2149300032",
            "name": "Marijana Majić Renjo",
            "affiliations": [
                "Croatian Institute of Transfusion Medicine"
            ]
        },
        {
            "id": "https://openalex.org/A2600376103",
            "name": "Viktor Ucović",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W3043247710",
        "https://openalex.org/W2408283333"
    ],
    "abstract": "In the last few decades, climate change and the global warming have emerged as important environmental issues. The cause of global warming is the increase of greenhouse gas emissions (GHG). There are several greenhouse gases responsible for global warming: water vapor, carbon dioxide (CO2), methane, nitrous oxides, chlorofluorocarbons (CFCs) and others. They are mostly the result of the fossil fuels' combustion in cars, buildings, factories, and power plants. The gas responsible for the most of the global warming is carbon dioxide (CO2). This increase in the greenhouse gas emissions leads to a greater interest of the consumers, board management and stakeholders in the environmental impact of their activities, products and services.The verification of the Carbon Footprint of distribution oil immersed transformer, presented in this paper, was recognized as an opportunity for the company to understand its own environmental impact and to identify inefficiencies and opportunities within its business.Carbon Footprint of a Product (CFP) is a rather new term closely related to the greenhouse gas emissions. The CFP is considered as a total of the greenhouse emissions generated during the life cycle of a product – that is, from raw material acquisition or generation from natural resources to a final disposal. It is described within the standard ISO 14067:2018 Carbon footprint of products – Requirements and guidelines for quantification [1]. This standard belongs to the environmental series ISO 14000 and enables the organization to demonstrate its environmental responsibility.Life Cycle Assessment (LCA), as well as the Carbon Footprint of products together with environmental impact of the product, are shown in this paper in accordance with standard ISO 14067:2018. The LCA is a method for the quantification of the environmental impacts of individual products. It takes into account a complete life cycle, starting from a raw material production, until the product’s final disposal or materials’ recycling in accordance with ISO 14040 [2] and ISO 14044 [3]. Greenhouse gases are expressed in mass-based CO2 equivalents (CO2e), which is the unit of measurement in the ISO 14067:2018 standard. The functional unit in ISO 14067:2018 can be either a product or a service. In this paper, the functional unit was the product – oil immersed distribution transformer, in four product variations. The LCA scope used in the preparation of this study was \"cradle to gate\" – it covers the CFP from the acquisition of the raw materials (\"cradle\") up to dispatch from the factory (\"gate\").The objectives of product life cycle considerations in Končar D&amp;ST Inc. are to reduce the use of natural resources and emissions to the environment, as well as to improve social performance at different stages of the product life cycle.By linking the economic and ecological dimension of the production, different aspects during realization of product in all phases of the life cycle come together. In this way company achieves cleaner products and processes, competitive advantage in the market and improved platform that will meet the needs of the changing business climate.Lifecycle thinking is based on the principles of reducing environmental impacts at the beginning of product creation, giving a wider picture of material and energy flow and ultimately environmental pollution prevention. These principles are organized in Končar D&amp;ST Inc. internally by planning and introducing cleaner manufacturing processes, environmental protection management and eco-design.Incorporating ISO 14067:2018 into company business is recognized as an opportunity for transparent communication to interested parties, incorporating CO2 emissions into annual reports and as a baseline information for a first step towards managing carbon emissions.",
    "full_text": "3\nJournal of Energy\njournal homepage: http://journalofenergy.com/\nVOLUME 69 Number 3 | 2020 | Special Issue   \nVlatka Šerkinić, Marijana Majić Renjo, Viktor Ucović, CO2 footprint for distribution oil immersed transformers according to ISO 14067:2018, Journal of \nEnergy, vol. 69 Number 3 Special Issue (2020), p. 3–9 \nhttps://doi.org/10.37798/202069342\n \n \n \nCO2 footprint for distribution oil immersed \ntransformers according to ISO 14067:2018 \n \nVlatka Šerkinić, Marijana Majić Renjo and Viktor Ucović  \nKončar Distribution and Special Transformers Inc., Mokrovićeva 8, Zagreb 10090, Croatia \nE-mail: vlatka.serkinic@koncar-dst.hr \n \nExtended Abstract \n \nIn the last few decades, clima te change and the global warming have emerged as  important environmenta l issues. The cause of \nglobal warming is the increase of greenhouse gas emissions (GHG). There are se veral greenhouse gases re sponsible for global \nwarming: water vapor, carbon dioxide (CO 2), methane, nitrous oxides, chlorofluoro carbons (CFCs) and others. They are mostly \nthe result of the fossil fuels' combustion in cars, buildings, factories,  and power plants. The gas responsible for the most of the \nglobal warming is carbon dioxide (CO 2). This increase in the greenhouse gas emissions leads to a greater interest of the \nconsumers, board management and stakeholders in the environmental impact of their activities, products and services.  \nThe verification of the Carbon F ootprint of distribution oil immerse d transformer, presented in th is paper, was recognized as a n \nopportunity for the company to understand its  own environmental impact and to identify inefficiencies and opportunities within \nits business. \nCarbon Footprint of a Product (CFP) is a rather new term closely related to the greenhouse gas emissions. The CFP is \nconsidered as a total of the greenhouse emissions generated duri ng the life cycle of a product – that is, from raw material \nacquisition or generation from natural resources to a final di sposal. It is described within  the standard ISO 14067:2018 Carbon  \nfootprint of products – Requirements and guidelines for quantification [1]. This standard belongs to the environmental series ISO \n14000 and enables the organization to demonstrate its environmental responsibility.  \nLife Cycle Assessment (LCA), as well as the Carbon Footprint of products together with environmental impact of the product, are \nshown in this paper in accordance w ith standard ISO 14067:2018. The LCA is a method for the quantification of the \nenvironmental impacts of individual products. It takes into account a complete life cycle, starting from a raw material production, \nuntil the product’s final disposal or materials’ recycling in accordance with ISO 14040 [2] and ISO 14044 [3]. Greenhouse gases  \nare expressed in mass-based CO 2 equivalents (CO 2e), which is the unit of  measurement in the IS O 14067:2018 standard. The \nfunctional unit in ISO 14067:2018 can be either  a product or a service. In this paper,  the functional unit was the product – oi l \nimmersed distribution transformer, in four product variations. The LCA scope used in the preparation of this study was \"cradle to \ngate\" – it covers the CFP from the acquisition of the raw materials (\"cradle\") up to dispatch from the factory (\"gate\"). \nThe objectives of product life cycle considerations in Kon čar D&ST Inc. are to reduce the use of natural resources and emissions \nto the environment, as well as to improve social performance at different stages of the product life cycle. \nBy linking the economic and ecological dime nsion of the production, different aspects during realization of product in all phases \nof the life cycle come together. In this way company achieves cleaner products and processes, competitive advantage in the market \nand improved platform that will meet the needs of the changing business climate. \nLifecycle thinking is based on the principles of reducing environmental impacts at the beginning of product creation, giving a \nwider picture of material and energy flow and ultimately enviro nmental pollution prevention. Thes e principles are organized in \nKončar D&ST Inc. internally by planning  and introducing cleaner manufacturing  processes, environmental protection \nmanagement and eco-design.  \nIncorporating ISO 14067:2018 into company business is recognized as an opportun ity for transparent communication to \ninterested parties , incorporating CO 2 emissions into annual reports and as a bas eline information for a first step towards \nmanaging carbon emissions. \nIndex Terms— greenhouse gas emissions, carbon dioxide, Carbon F ootprint of a Product, Li fe Cycle Assessment, ISO \n14067:2018 standard.\n \nI. INTRODUCTION \nClimate change arising from anthropogenic activity has been  identified as one of the gr eatest challenges facing the \nworld and will continue to affect business and citizens over future decades. \nClimate change has implications for both human and natural systems and could lead to significant impact on resource \navailability, economic activity and human wellbeing. In response, international, regional, national and local initiatives \nare being developed and implemented by public and private sectors to mitigate greenhouse gas (GHG) concentrations in \nthe Earth's atmosphere as well as to facilitate adaptation to climate change. [1] \nIn 2008 the European Union has set three goals to be achieved by 2020 in terms of reducing greenhouse gas \nemissions (by 20%), share of renewable energy sources (20%) and energy efficiency improvement (20%).  \nConcern over climate change has stimulated interest in  estimating the total amount of greenhouse gasses (GHG) \nproduced during the different stages in the ―life cycle of goods and services — i.e. their production, processing, \ntransportation, sale, use and disposal. [4]  \nThe result of GHG calculations in different stages is refe rred as a carbon footprint of product (CFP). In this \n4\n     \n \ncalculation carbon footprint is the total amount of GHGs produced for a given activity, while product is any good or \nservice that is marketed. In this contex t, the CFP of a product differs from the CFPs performed at the level of projects, \ncorporations, supply chains, municipalities, nations or individuals. \nCollecting the most accurate information requires a good understanding of emissi ons in all parts of the life cycle, \nusually either from raw material to factory gate (cradle to gate) or until the end of life span (cradle to grave). \nMany businesses are now calculating carbon footprint of their products and services  - some to meet supply chain \nneeds to disclose carbon emissions, e.g. in sales tenders and others to actively reduce carbon footprint of production.  \nProducts and services we purchase and consume today demand a large amount of energy throughout their entire life \ncycle, from its production / creation to the time of their dis posal at the end of the life cy cle. This energy comes mainly \nfrom fossil fuels such as petroleum, coal and natural gas, all of which release carbon dioxide (CO₂) into the atmosphere, \nwhich is the cause of global warming. \nGiven that end users are also included in the last step - disposal and recycling, the CFP is a useful tool that involves \nboth the manufacturer and the end user in activities to reduce GHG emissions. \nAs CO2 and other greenhouse gases contribute to climate change , selecting low carbon products instead of those that \nhave a major negative impact on the environment is one way in which a customer can make a difference. \nDue to increasing demands from customer side for calculating the carbon footprint of a single transformer, a need for \ncalculating the carbon footprint of Končar D&ST products has occurred.  \nThe objective of this study is Life Cy cle Assessment (LCA), as well as the Ca rbon Footprint of products together \nwith environmental im pact of the product – oil immersed distribution transformer.  For the purpose of this study, \nstandard ISO 14067:2018, as well as other standards from ISO 14000 family (ISO 14040 and ISO 14044 [2] [3]), were \nused as a tool to calculate the carbon footprint of Končar D&ST's product.  \n \nI.I. CFP BACKGROUND \nAccording to the Kyoto Protocol (which  was adopted in Kyoto, Japan, on 11 December 1997 and entered into force \non 16 February 2005), during the first commitment period, 37 industrialized countries and the European Community \ncommitted to reduce GHG emissions to an average of five percent against 1990 levels. During the second commitment \nperiod, Parties committed to reduce GHG emissions by at least 18 percent below 1990 levels in the eight-year period \nfrom 2013 to 2020; however, the composition of Parties in the second commitment period is different from the first. [5] \n \nAs a measure of achieving these goals, the idea of deve loping a carbon footprint calcu lation mechanism that would \nvisualize CO\n2 emissions has appeared. The life cycle of the product depends on many factors such as raw material \nextraction, material processing, parts manufacturing, assemb ly, transport, product use and maintenance and end of life \n(disposal and recycling). (Fig. 1) [5] \n \n \nFigure 1. A life cycle of a product [5] \n \nThe carbon footprint of a product is usually calculated as the sum of the total greenhouse gas (GHG) emissions \nemitted at each stage of a product's life cycle by calculati ng its emissions, and then converting that figure to an \nequivalent amount of CO2 emissions (CO2e). \nVlatka Šerkinić, Marijana Majić Renjo, Viktor Ucović, CO2 footprint for distribution oil immersed transformers according to ISO 14067:2018, Journal of \nEnergy, vol. 69 Number 3 Special Issue (2020), p. 3–9 \nhttps://doi.org/10.37798/202069342\n5\n     \n \nI.II. GREENHOUSE GAS EMISSION STANDARD \nThere are different standards regarding the monitoring of greenhouse gas emissions, which are designed to provide a \nframework for businesses, governments, and other entities to measure and report their greenhouse gas emissions in \nways that support their missions and goals. Three of them are described in the following paragraphs. \n \na) Greenhouse Gas Protocol  \nThis protocol provides standards, guidance, tools and training for business and government to measure and manage \nclimate-warming emissions. GHG Protocol establishes comprehensive global standardized frameworks to measure \nand manage greenhouse gas (GHG) emissions from private and public sector operations, value chains and mitigation \nactions. The Greenhouse Gas Protocol provides the foundation for sustainable climate strategies and more efficient, \nresilient and profitable organizations. The GHG Protocol Product Standard is one of a suite of accounting tools \ndeveloped by the GHG Protocol to encourage users to understand, quantify, and manage greenhouse gas emissions. \n[7] \n \nb) Publicly Available Specification (PAS) 2050 \nSpecification for the assessment of the life cycle greenhouse gas emissions of goods and services was developed by \nthe British Standards Institution in 2008. PAS 2050 is the first consensus-based and internationally applicable \nstandard on product carbon footprinting that has been used as the basis for the development of other standards \ninternationally. Builds on existing international LCA standard (ISO 14044), covers all GHGs specified by the IPCC \n(Integrated Pollution Prevention and Control), covers whole life cycle of product (raw materials to end of life or \n‘cradle to grave’), designed to be used on any product, by any company, in any geographic location. [8] \n \nc) ISO 14067 \nThe Carbon Footprint of a Product is the total of the greenhouse emissions generated during the life cycle \nassessment of a product. The GHG are considered all gaseous substances for which the IPCC has defined a global \nwarming potential coefficient. They are expressed in mass-based CO 2 equivalents (CO 2e), which is the unit of \nmeasurement in ISO 14067. \nA carbon footprint and life cycle assessme nt (LCA) is used to systematically record and analyze the impact on the \nenvironment throughout the entire life cy cle of a product or service. This in volves an end-to-end analysis of the \nproduct or service. The analysis considers all raw materials, transports, production processes, usage and disposal of \nthe product. A carbon footprint at product level is a special application of the LCA methodology that specifically \nfocuses on greenhouse gas emissions. [1] \nI.III. LIFE CYCLE ASSESMENT \nA Product Carbon Footprint is based on a life cycle assessment (LCA), but focuses on a single issue which is global \nwarming. An LCA shows where the environmental impact in the overall chain takes place which can serve as an \nopportunity to improve a certain process or product parts. Eventually, this can lead towards savings in, for example raw \nmaterials, energy use and total costs, and to a more sustainable product which can be used as promotion point when \nselling the product. \n \nAccording to ISO 14040 an LCA study consists of four main phases [2]:  \nStep 1: Defining the goal and scope of the study.  \nStep 2: Making a model of the product life cycle with all the environmental inputs and outputs. This data collection \neffort is usually referred to as life cycle inventory (LCI).  \nStep 3: Understanding the environmental relevance of all the inputs and outputs. This is referred to as life cycle \nimpact assessment (LCIA).  \nStep 4: The interpretation of the study. \n \nThe principles of the LCA standard we re followed when carrying out the case studies presented in this report. The \nfour phases of LCA are presented in Figure 2.  \nVlatka Šerkinić, Marijana Majić Renjo, Viktor Ucović, CO2 footprint for distribution oil immersed transformers according to ISO 14067:2018, Journal of \nEnergy, vol. 69 Number 3 Special Issue (2020), p. 3–9 \nhttps://doi.org/10.37798/202069342\n6\n     \n \n \nFigure 2. Phases of a life cycle assessment [2] \n \nII. EXPERIMENTAL \nThe overall goal of conducting a CFP study is to calcu late the potential contribution of a product to global \nwarming potential expressed as CO2e by quantifying all significant GHG emissions and removals over the product's life \ncycle or selected processes, in line with cut-off criteria. [1] \nThe CFP study can be conducted according to several types of LCA methodology, for instance: \n Cradle-to-grave – full life cycle assessment from resour ce extraction ('cradle') to use phase and disposal \nphase ('grave'); \n Cradle-to-gate is an assessment of  a partial product life cycle from resource extraction (cradle) to the \nfactory gate (i.e., before it is transported to the consumer); \n Cradle-to-cradle (or closed loop production) – a specific kind of cradle-to-grave assessment, where the \nend-of-life disposal step for the product is a recycling process. \nIn this CFP study report cradle-to-gate methodology was used. This means the product was studied from \nextraction of raw materials to its production. The goal of this project was to produce validated environmental data for \noil immersed transformers, in order to get insight in their environmental performance. International Electrotechnical \nVocabulary defines a transformer as a static piece of appa ratus with two or more windings which, by electromagnetic \ninduction, transforms a system of alternating voltage and curr ent into another system of voltage and current, usually of \ndifferent values and at the same frequency for the purpose of transmitting electrical power. [9] Distribution \nTransformers are used in distribution networks in order to transmit energy from the medium voltage (MV) network to \nthe low voltage (LV) network of the consumers. [10] \nAn oil immersed distribution transformer is composed of the following main components: transformer core \nmade from special grade magnetic steel; low voltage winding made from aluminum coil; high voltage winding made \nfrom aluminum wire; tank and cover made from low carbon steel; transformer oil (mineral oil or synthetic ester); \ninsulation components made from paper and pressboard; some store-bought components, such as tap changer, bushings \netc. Most of the raw materials (magnetic steel, aluminum co il and wire, transformer oil) are produced in a way specific \nfor a transformer industry and will not be explained here.  \nIn the production of Kon čar D&ST, raw materials are machined and assembled, together with store-bought \ncomponents, in a complete product: the magnetic steel is slit, cut and stacked into transf ormer core; aluminum coil and \naluminum wire, together with diamond-dotted insulation paper are transformed into low voltage windings and high \nvoltage winding, respectively. Windings are assembled ont o the core, connected with cover and then tanked. So \nprepared semi-product is dried in a low-frequency heating (LFH) plant, vacuumed and filled with transformer oil. \nFigure 3 displays a schematic overview of the producti on process, including system boundaries. All relevant \nand known processes and materials have been included. \nStandard ISO 14067 asks for unit declaration together with  cradle-to-gate boundaries wh ich in this case is the \nsame for all types of transformers included in the study.  \nDeclared unit: the cradle-to-gate CO2 eq. emissions of oil immersed transformer. \nStudy was performed for specific products from one plant and one manufacturer and data was collected for the \nyear 2018.\nThe carbon footprint study includes cradle-to-gate CO 2e emission data for the following transformers, produced at \nKončar D&ST Inc. in Zagreb, Croatia [11], shown in Figures 4-6:\n Object 1 (400 kVA); \n Object 2 (400 kVA); \n Object 3 (400 kVA); \n Object 4 (630 kVA). \nVlatka Šerkinić, Marijana Majić Renjo, Viktor Ucović, CO2 footprint for distribution oil immersed transformers according to ISO 14067:2018, Journal of \nEnergy, vol. 69 Number 3 Special Issue (2020), p. 3–9 \nhttps://doi.org/10.37798/202069342\n7\n     \n \n \nFigure 3. Schematic overview of the Končar D&ST’s production \nFigure 4. Visualization of Object 1, Object \n2, Object 3 \nFigure 5. Visualization of Object 1, Object \n2, Object 3 \nFigure 6. Visualization of Object 4 \n \nII.I. INVENTORY ANALYSIS \nLife cycle inventory analysis is a phase of a life cycle assessment involving the compilation and quantification \nof inputs and outputs for a product throughout its life cycle. [1] \nInventory was discussed for the four types of transfor mers in a way that all components from the bill of \nmaterials per each transformer, weighing more than 1 kg, were taken into account. All transformer components were \nanalyzed according to the name of the co mponent, data type, reference process, weight and the main part to which the \ncomponent belongs.  \nMain components covered with this study were: aluminum coil, aluminum wire, carbon steel, core steel and \ntransformer oil. LCA software used in this CFP study report was SimaPro 9.0. \nSelection of processes that covers 80% of the total CO 2e emissions was made and primary data was collected \nfor these processes.  \nElectricity consumption at Končar D&ST includes the following processes: \n• Lines for cutting transformer sheets (slitting and cutting); \n• Preparation of the insulation parts; \n• Preparation of the windings; \n• Production and assembly; \n• Drying of active parts (core and windings);  \n• Manipulation with electric forklifts; \n \n \n \nVlatka Šerkinić, Marijana Majić Renjo, Viktor Ucović, CO2 footprint for distribution oil immersed transformers according to ISO 14067:2018, Journal of \nEnergy, vol. 69 Number 3 Special Issue (2020), p. 3–9 \nhttps://doi.org/10.37798/202069342\n8\n     \n \nAs well as: \n• Testing station; \n• Lighting; \n• Ventilation; \n• Compressed air; \n• Offices. \n \nThe origin of the electricity used by Končar D&ST in 2018 was retrieved from the website of HEP, Kon čar D&ST's \npower supplier: \n 42% hydroelectric power plants; \n 17% thermal power plants;  \n 17% renewable energy sources; \n 14% nuclear power plants; \n 10% unknown. \n \nData on production waste at Kon čar D&ST is indicted per material and type of transformer. Types of wastes that \nare generated in Kon čar D&ST which were analyzed in this study  are core sheets steel , aluminum and waste \ntransformer oil. [11] \nIII. RESULTS AND DISCUSSION \nIn this phase of a CFP study, the po tential climate change impact of each GHG emitted and removed by the product \nsystem was calculated by multiplying the mass of GHG released or removed by the 100-year GWP  (Global warming \npotential) given by the IPCC in units of kg CO2e per kg emission. [1]\nSteel for the core, aluminum  wire and cold-rolled steel make up the top three of materials with the largest \ncontribution to the total CO2e emissions. \nTable I. shows total emissions expressed in kilograms of CO2 equivalents. [11] \nTABLE I. Total by carbon source in kg CO₂ eq. \nTransformer Total kg CO2eq. \nOBJECT 1 4673 \nOBJECT 2 4915 \nOBJECT 3 5003 \nOBJECT 4 6736 \n \nThe carbon footprint of the transformers covered by the study ranges from 4676 kg CO 2 eq. for the Object 1 to 6736 \nkg CO2 eq. for Object 4. This difference can be explained by the total amount of materials used in the different types of \ntransformers (different weight of core, tank etc.). Due to small differences in design and functionality, the Object 1 has \na slightly lower carbon footprint. Also, there is a slight difference in carbon footprint between the Object 1 and the other \ntwo 400 kVA transformers, which was mostly caused by materials used in the windings.  \nThe larger carbon footprint of the Object 4 (630 kVA) compared to the other three transformers can be explained by \nits total mass. Compared to th e 400 kVA transformers, the Object 4 is cons iderably heavier because more material is \nused for production. When calculating the emissions in kg CO 2 eq. per kg material used for the different transformers, \nresults for the Object 2, Object 3 and Object 1 are that approx. 3,8 kg CO2e per kg of used material. Whereas the Object \n4 has a carbon footprint of 4,0 kg CO2e per kg of used material. [11] \nData for each unit process within the systems boundary can be classified under major groups [2]: \n- Energy inputs, raw material inputs, ancillary inputs, other physical inputs; \n- Products, co-products and waste; \n- Emissions to air, discharges to water and soil; \n- Other environmental aspects. \n \nThe quality of CFP data relies strongly on the quality of in put data. According to standard ISO 14067 it is preferable \nto use data derived from company’s own processes (i.e. primar y data). In addition to that, raw materials from suppliers \nwere analyzed considering they can strongly influence the CFP. In this CFP study report, authors strived to use primary \ndata from suppliers of the main parts. Besides that, they  relied on industry average data  where no supplier-specific \nVlatka Šerkinić, Marijana Majić Renjo, Viktor Ucović, CO2 footprint for distribution oil immersed transformers according to ISO 14067:2018, Journal of \nEnergy, vol. 69 Number 3 Special Issue (2020), p. 3–9 \nhttps://doi.org/10.37798/202069342\n9\n     \n \ninformation was available. \n \nKončar D&ST provided all data based on the bills of materials and technical drawings of the various transformers \nwhich displayed composition and the amounts of used materials. [11] \n \nIV. CONCLUSION \nMeasures to reduce the carbon footprint of the products covered by the study can be implemented in several ways. \nKončar D&ST is considering three possible options. \nOne way is to influence the production process in Kon čar D&ST through various measures (product design or \ndevelopment, alternative materials). Since 2% of the total CO 2 impact calculated in this study is the contribution of the \nprocesses at the Kon čar D&ST production site, this would be almost ha lf of the contribution to the total 5% reduction \nwhich was Končar D&ST's CFP reduction goal. \nAnother way of CFP reduction is through material purchasing, since other 98% of the total CFP is a contribution \nthat comes from suppliers of the materials. These improvement measures can be done in one of the following ways: \n Communicate with the suppliers with high CO 2 contribution about the energy s ources that they use in their \nprocess – e.g. energy generated in a conventional way could be replaced by some form of renewable energy; \n Request from suppliers to use a certain type of fuel when transporting goods to Kon čar D&ST (e.g. EURO 5, \nEURO 6); \n Suggest to tank suppliers to buy raw materials produced in arc furnaces (which use a large content of raw \nmaterials from secondary sources – recy cled) and not in conver sion furnaces (large content of raw materials \nfrom primary sources), and therefore adopt a procurement plan that benefits a supplier who uses a large \ncontent of raw materials from secondary sources; \n In the future, buy material in a greater percentage th an before from a major supplier who has a smaller total \ncarbon footprint. \n \nThird goal option to reduce CO 2 footprint is tree planting since trees and green plants take in carbon dioxide for \nphotosynthesis and in this way should reduce CO 2. Tree planting these days is becoming  an increasingly popular tool to \ncombat climate change. New analyses show that there is  enough space in the world’s existing parks, forests and \nabandoned land to plant 1,2 trillion additional trees, which would have the CO 2 storage capacity to cancel out a decade of \ncarbon dioxide emissions. \n \nV. REFERENCES \n[1] ISO 14067 Greenhouse gases – Carbon footprint of products – Requirements and guidelines for quantification, First edition, 2018. \n[2] ISO 14040 Environmental management – Life Cycle Assessment – Principles and framework, Second edition, 2006. \n[3] ISO 14044 Environmental management – Life Cycle Assessment – Requirements and guidelines, First edition, 2006. \n[4] Counting carbon in the marketplace: Part I – Overview paper, Simon Bolwig, DTU Climate Centre Risø , Technical University of Den mark and \nPeter Gibbon, Senior Researcher, Head of re search unit on Trade and development, Dani sh Institute for International Studies; „Global forum on \ntrade and climate change“, Paris, 9 and 10 June 2009 \n[5] United Nations Framework Conven tion on Climate Change: Kyoto Pr otocol Reference Manual on accoun ting of emissions and assigned \namount, 2008. \n[6] https://thelcacentre.com/wat-is-lca/; accessed in September 2019. \n[7] https://ghgprotocol.org/about-us; accessed in September 2019. \n[8] PAS 2050 – Specification for the assessment of the life cycle greenhouse gas emissions of goods and services \n[9] International Electrotechnical Vocabulary, Chapter 421: Power transformers and reactors \n[10] Pavlos S. Georgilakis: Spotlight on Modern Transformer Design, Springer, 2009. \n[11] Partial carbon footprint for oil immersed transformers; Končar D&ST, SGS Search Consultancy; 2019. \n \n \nVlatka Šerkinić, Marijana Majić Renjo, Viktor Ucović, CO2 footprint for distribution oil immersed transformers according to ISO 14067:2018, Journal of \nEnergy, vol. 69 Number 3 Special Issue (2020), p. 3–9 \nhttps://doi.org/10.37798/202069342"
}