{
    "title": "Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC Power Electronics Transformer With Four-Winding Power Channel",
    "url": "https://openalex.org/W3040271702",
    "year": 2020,
    "authors": [
        {
            "id": "https://openalex.org/A2155311036",
            "name": "Xiaohui Li",
            "affiliations": [
                "Soochow University"
            ]
        },
        {
            "id": "https://openalex.org/A3039104032",
            "name": "Linqian Cheng",
            "affiliations": [
                "Soochow University"
            ]
        },
        {
            "id": "https://openalex.org/A2114836643",
            "name": "Liqun He",
            "affiliations": [
                "Soochow University"
            ]
        },
        {
            "id": "https://openalex.org/A2231849140",
            "name": "Zhongkui Zhu",
            "affiliations": [
                "Soochow University"
            ]
        },
        {
            "id": "https://openalex.org/A1969775177",
            "name": "Yong Yang",
            "affiliations": [
                "Soochow University"
            ]
        },
        {
            "id": "https://openalex.org/A2110463833",
            "name": "Cheng Wang",
            "affiliations": [
                "Nanjing University of Science and Technology"
            ]
        },
        {
            "id": "https://openalex.org/A2155311036",
            "name": "Xiaohui Li",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A3039104032",
            "name": "Linqian Cheng",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2114836643",
            "name": "Liqun He",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2231849140",
            "name": "Zhongkui Zhu",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1969775177",
            "name": "Yong Yang",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2110463833",
            "name": "Cheng Wang",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W1964394431",
        "https://openalex.org/W2094111656",
        "https://openalex.org/W2001312628",
        "https://openalex.org/W2098172743",
        "https://openalex.org/W2077714903",
        "https://openalex.org/W2804020131",
        "https://openalex.org/W2913211836",
        "https://openalex.org/W2509591675",
        "https://openalex.org/W2896337300",
        "https://openalex.org/W2907538067",
        "https://openalex.org/W1966751624",
        "https://openalex.org/W2524275263",
        "https://openalex.org/W2328119608",
        "https://openalex.org/W1970816228",
        "https://openalex.org/W2562166267",
        "https://openalex.org/W2557373001",
        "https://openalex.org/W2524328699",
        "https://openalex.org/W2060472803",
        "https://openalex.org/W1561531086",
        "https://openalex.org/W2057175642",
        "https://openalex.org/W2099709196",
        "https://openalex.org/W2245524230",
        "https://openalex.org/W2761069206",
        "https://openalex.org/W2783972781"
    ],
    "abstract": "Power electronic transformer (PET) with modular cascaded structure has become a flexible interface between AC and DC grids. Nonetheless, the notable 2<sup>nd</sup>-order ripple power introduced from the AC source requires considerable energy storage in the module capacitors, which is likely to degrade the overall power density and increase system cost. In this paper, a power channel based four-winding PET (PC-PET) is proposed to address such an issue. Owing to the phase-crossing power channels, the low-frequency ripples can cancel each other through magnetic flux counteracting. To improve the accuracy of power decoupling, the effect compromised by inconsistent windings is considered. Accordingly, a proportional-resonant (PR) control based power decoupling strategy for PC-PET incorporated with power balance is proposed to decouple the three-phase low-frequency ripple powers, and minimize the voltage ripple in module capacitors. Additionally, the improvement of power density is discussed based on analyses on power losses, capacitor volume and transformer volume. Simulation and experimental results verified the validity of proposed control strategies.",
    "full_text": "Received June 1, 2020, accepted June 17, 2020, date of publication June 29, 2020, date of current version July 9, 2020.\nDigital Object Identifier 10.1 109/ACCESS.2020.3005530\nCapacitor Voltage Ripple Minimization of a\nModular Three-Phase AC/DC Power\nElectronics Transformer With\nFour-Winding Power Channel\nXIAOHUI LI\n1, (Graduate Student Member, IEEE), LINQIAN CHENG1, LIQUN HE\n 1, (Member, IEEE),\nZHONGKUI ZHU\n 1, YONG YANG\n 1, (Senior Member, IEEE), AND CHENG WANG2, (Member, IEEE)\n1School of Rail Transportation, Soochow University, Suzhou 215006, China\n2School of Automation, Nanjing University of Science and Technology, Nanjing 210094, China\nCorresponding author: Liqun He (lqhe@suda.edu.cn)\nThis work was supported in part by the National Natural Science Foundation of China under Grant 51707127 and Grant 51977136, in part\nby the Natural Science Foundation of Jiangsu Province under Grant BK20190461, and in part by the Open Research Fund of Jiangsu\nCollaborative Innovation Center for Smart Distribution Network, Nanjing Institute of Technology, under Grant XTCX201904.\nABSTRACT Power electronic transformer (PET) with modular cascaded structure has become a ﬂexible\ninterface between AC and DC grids. Nonetheless, the notable 2 nd-order ripple power introduced from the\nAC source requires considerable energy storage in the module capacitors, which is likely to degrade the\noverall power density and increase system cost. In this paper, a power channel based four-winding PET (PC-\nPET) is proposed to address such an issue. Owing to the phase-crossing power channels, the low-frequency\nripples can cancel each other through magnetic ﬂux counteracting. To improve the accuracy of power\ndecoupling, the effect compromised by inconsistent windings is considered. Accordingly, a proportional-\nresonant (PR) control based power decoupling strategy for PC-PET incorporated with power balance is\nproposed to decouple the three-phase low-frequency ripple powers, and minimize the voltage ripple in\nmodule capacitors. Additionally, the improvement of power density is discussed based on analyses on power\nlosses, capacitor volume and transformer volume. Simulation and experimental results veriﬁed the validity\nof proposed control strategies.\nINDEX TERMS PET, power channel, power decoupling, QAB.\nI. INTRODUCTION\nPower electronic transformer (PET) contributes to intel-\nligent power ﬂow management while providing reduced\nweight/volume, improved power quality, enhanced reliability\nand so forth [1]–[3]. It is playing an important role in modern\npower system as energy routers to replace line-frequency\ntransformer (LFT) [4], [5]. In three-phase AC/DC applica-\ntion, the PET can reduce the required volume and weight to\nnearly one third, halve the power loss while the material cost\ncan still compete with LFT [6].\nThe conﬁguration of AC/DC PET can be catego-\nrized into two general types: AC/HFAC (high-frequency\nAC)-HFAC/DC, and AC/DC-DC/HFAC-HFAC/DC. Tough\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Huiqing Wen\n.\ncontrol issues of matrix converters are hiding the former\nconﬁguration from high voltage/high power applications.\nOn the contrary, the AC/DC-DC/HFAC-HFAC/DC one is\nattracting more and more attentions owing to its mature\ncontrol schemes [1], [7]. Cascaded H-bridge (CHB) and\nmodular multilevel converter (MMC) based PET are both\nwith AC/DC-DC/HFAC-HFAC/DC conﬁguration. Featuring\nmultiport capability and modular structure, these two types\nof PETs are commonly studied [8]. The MMC-PET [9]–[11]\nare usually applied when high-voltage DC bus is required.\nGenerally, the topology of a CHB based PET inter-connecting\nthree-phase medium-voltage (MV) AC and low-voltage (LV)\nDC grid is shown in Fig. 1 with N PET modules in each\nphase. Each module consists of a single-phase PWM rectiﬁer\nas active front end and a dual-active-bridge (DAB) or multi-\nactive bridge converter [5], [7], [12]. The 2 nd-order ripple\n119594 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see https://creativecommons.org/licenses/by/4.0/VOLUME 8, 2020\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\npowers are introduced from each AC-input-port and stored in\nDC capacitors of the modules. In order to reduce the 2 nd-order\nripple in capacitor voltage, large DC capacitance is usually\nrequired. This will increase the volume of the system and\ntherefore reduce the power density.\nFIGURE 1. The topology of normal three-phase AC/DC CHB-PET.\nPower decoupling in single-phase PWM rectiﬁer normally\nrequires large passive capacitors to trap low frequency ripple\npowers [13]–[17]. As for three-phase systems, interaction\nbetween phases makes the ripple powers cancelling each\nother possible. Quad-active-bridge (QAB) equipped with\nthree primary ports and a secondary port is an ideal way\nto function as power interaction channels between phases\n[18], [19]. The power channel based PET (PC-PET) can serve\nas high-power-density power electronic interface between\nthree-phase three-wire AC and DC grid [20]. However,\nthe three-phase power imbalance issue cannot be ignored.\nThe effect of power decoupling control intensively depends\non the collaboration with power balance.\nIn this paper a proportional-resonant (PR) control based\npower decoupling strategy for three-phase AC/DC PC-PET is\nproposed. Realized in stationary reference frame, the strategy\nprovides suppression to multiple harmonics by paralleled\ncontrollers. The low-frequency voltage ripples in module\ncapacitors can be minimized even in the situation of asym-\nmetrical three-phase. The capacitance and volume of module\ncapacitor can be reduced, thereby the power density can be\nimproved.\nIn Section II, the PC-PET conﬁguration is ﬁrstly analyzed.\nThen the 2 nd-order ripple voltage in module capacitors and\noperating principle of PC-PET are discussed. In Section III,\nthe equivalent circuit model of the QAB and its power\ndispatching characteristics are investigated. In Section IV ,\nthe overall control scheme including the proposed ripple\nvoltage suppression strategy is illustrated. In Section V , simu-\nlation and experimental results are presented to demonstrate\nthe proposed topology and control schemes. In Section VI,\nthe power losses as well as capacitor volume are calculated\nbased on analytical models. Finally, Section VII concludes\nthis paper.\nFIGURE 2. The topology of modular PC-PET interfacing three-phase MVAC\nand LVDC power grids.\nII. SECOND-ORDER RIPPLE VOLTAGE ANAYSIS AND\nOPERATING PRINCIPLE OF PC-PET\nThe circuit of PC-PET is shown in Fig. 2, with N modules\nin each phase leg (a_1∼ a_N, b_1∼b_N, c_1∼ c_N).\nThe PC-PET is composed of three power conversion stages,\ni.e. level 1, level 2 and level 3 sub-converters. For modular\ndesign, the sub-converters from a same stage are identi-\ncal with each other. The level 1 converter is selected as a\nH-bridge (HB) that functions as a PWM rectiﬁer (RECM_x_j,\nx =a,b and c, j =1 ∼N). The level 2 converter (three\nHBs) and level 3 converter (one HB) act as a QAB. Each QAB\nis equipped with a four-winding high-frequency transformer\nwith three primary ports and one secondary port. The primary\nports are connected to the HFAC-outputs of the three power\nmodules QABM_x _j, corresponding to the jth (j =1∼N)\nmodule in phase x (x =a,b and c). The secondary port is\ntied with the HFAC-input of the level 3 converter. The total\nN DC ports are paralleled to form LVDC-bus.\nA. SECOND-ORDER RIPPLE VOLTAGE ANALYSIS\nThe 2 nd-order ripple power imported from the AC port and\nthe induced 2 nd-order ripple voltage in DC capacitors are\nanalyzed as follows.\nAssume the input voltage and current of phase a are:\nusa =Us sin(ωt), (1)\nisa =Is sin(ωt −θ). (2)\nwhere Us and Is are the amplitudes, ωand θare fundamental\nangular frequency and power factor angle respectively. Tak-\ning RECM_a_j for example, the power ﬂowing to the AC port\nis expressed as:\nps_aj =usa ·isa\nN =UsIs\n2N cos θ−UsIs\n2N cos(2ωt −θ). (3)\nIt is supposed that losses of the all the active and passive\ncomponents can be ignored. The DC component of ps_aj is\nVOLUME 8, 2020 119595\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\ndirectly determined by the DC load.\nUsIs\n2N cos θ = po\n3N (4)\nwhere po is the power consumed by the load.\nIf the 2 nd-order ripple powers of ps_aj (ps2_aj) are totally\nabsorbed by module capacitors, the instantaneous power of\ncapacitor in RECM_a_j is\npC_aj =uC_aj ·iC_aj =usa ·isa −isa ·Ls disa\ndt\nN −pdc. (5)\nwhere uC_aj and iC_aj are the capacitor voltage and capacitor\ncurrent of RECM_a_j, Ls is the line-frequency inductance.\npdc is the power transferred to the next conversion stage,\nwhich only contains DC component.\npdc = po\n3N (6)\nHence uC_aj mainly contains DC and 2 nd-order compo-\nnents, as expressed by:\nuC_aj =UCdc_aj +uC2_aj. (7)\nThen iC_aj can be rewritten to:\niC_aj =C ·duC_aj\ndt =C ·d(UCdc_aj +uC2_aj)\ndt\n=C ·duC2_aj\ndt . (8)\nwhere C is the capacitance of RECM.\nSubstituting (2) - (4) and (6) - (8) to (5), devices (9).\n(UCdc_aj +uC2_aj) ·C ·duC2_aj\ndt\n=−UsIs\n2N cos(2ωt −θ) −ωLsI2\ns\n2N sin(2ωt −2θ) (9)\nConsidering zero initial voltage for uC2_aj and integrating\nboth sides of (9) by time, (10) can be derived:\n1\n2Cu2\nC2_aj +CUCdc_ajuC2_aj\n=−UsIs\n4ωN sin(2ωt −θ) +LsI2\ns\n4N cos(2ωt −2θ). (10)\nThen uC2_aj can be solved from (10), as expressed by (11).\nuC2_aj =−UCdc_aj +\n√\nU2\nCdc_aj −A ·sin(2ωt −2θ+ψ) (11)\nwhere\nA =\n√\np2o\n9(ωCN)2 +\n( po\n3ωCN cos θ sin θ− 4Lsp2\no\n18U2s CN cos2 θ\n)2\nψ =arctan\n(\ntan θ− 2ωLspo\n3U2s cos2 θ\n)\nThe relationship between the amplitude of uC2_aj (UC2_aj),\nC and po is shown in Fig. 3. UC2_aj will increase with the\nincreasing of po or the decreasing of module capacitance.\nSimilarly, 2nd-order ripple voltage of module capacitors of\nphase b and phase c are expressed as:\nuC2_bj =−U Cdc_bj\n+\n√\nU2\nCdc_bj −A ·sin(2ωt −2θ+2π\n/\n3 +ψ),\n(12)\nFIGURE 3. Relationship between amplitude of 2nd-order ripple voltage,C\nand po.\nuC2_cj =−U Cdc_cj\n+\n√\nU2\nCdc_cj −A ·sin(2ωt −2θ−2π\n/\n3 +ψ).\n(13)\nB. OPERATING PRINCIPLE OF PC-PET\nIf the powers ﬂowing through three phases are balanced,\nthe input powers of RECM_b_j and RECM_c_j are:\nps_bj =UsIs\n2N cos θ−UsIs\n2N cos(2ωt −θ+2π/3). (14)\nps_cj =UsIs\n2N cos θ−UsIs\n2N cos(2ωt −θ−2π/3). (15)\nThe 2 nd-order ripple powers of three phase legs are sym-\nmetrical with negative sequence. If the ripple powers are\nforced to ﬂow through the three primary ports of the four-\nwinding transformer, they will be counteracted through ﬂux\ncoupling. That is the reason why the QAB can be regarded as\na ‘‘power channel’’. Only DC component will be reﬂected on\nthe LVDC bus.\nConsequently, there is no low-frequency voltage ripple\nin all the capacitors of PC-PET. Module capacitors are just\nrequired for the purpose of ﬁltering high-frequency switching\nharmonics. It can sharply reduce the capacitance, the vol-\nume as well. In addition, owing to the highly integrated\nmulti-winding structure, the transformer volume is smaller\nthan conventional two-winding ones. All of these make the\nPC-PET very competitive in terms of power density.\nIII. EQUIVALENT CIRCUIT MODELING\nOF THE QAB IN PC-PET\nConsidering switching frequency components, the controlled\nvoltage source based equivalent circuit of QAB is shown\nin Fig. 4.\nWindingsN1 ∼N3 are the three primary windings of QAB,\ncorresponding to phase a ∼c. N4 is the secondary winding.\nThe inductor Lk (k = 1 ∼ 3) represents the self-leakage\ninductance of N1 ∼N3.\nAssuming the phase-shift control (PSC) is employed,\nthe averaged power transferred from port k to port 4 in a\n119596 VOLUME 8, 2020\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\nFIGURE 4. Four voltage sources model of four-winding transformer.\nswitching period can be expressed as [20]:\npk4 = 1\nTs\n∫ Ts\n0\nvk i(τ)dτ = vk v4\n2π2fsLk4\nϕk4(π−ϕk4). (16)\nwhere vk and v4 are the voltages of port k and port 4, fs is\nthe switching frequency, Ts is the switching period, Lk4 is the\nequivalent inductance between port k and port 4, and ϕk4 is\nphase-shift angle between port k and port 4.\nFIGURE 5. T-type equivalent circuit of the four-winding transformer.\nAccording to (16), the power transferred from one primary\nside to the secondary side is dependent on Lk4. It is herein\nnecessary to analysis the value of Lk4 through an equivalent\nDAB model. The T type equivalent circuit of four-winding\ntransformer is shown in Fig. 5. Lm is the magnetizing induc-\ntance. The Thevenin equivalent circuit between port k and\nport 4 is given in Fig. 6.\nFIGURE 6. Thevenin equivalent circuit between portk and port 4 of QAB.\nvTH4k−4 is the Thevenin equivalent voltage, that is calcu-\nlated by\n\n\n\n\n\n\n\n\nvTH41−4 = L2L3\nL1L3 +L1L2 +L2L3\n·v4\nvTH42−4 = L1L3\nL1L2 +L2L3 +L1L3\n·v4\nvTH43−4 = L1L2\nL1L3 +L2L3 +L1L2\n·v4.\n(17)\nLTHk is the Thevenin equivalent leakage inductance and\ncan be calculated by\n\n\n\n\n\n\n\n\n\n\nLTH1 =\n( 1\nLm\n+ 1\nL2\n+ 1\nL3\n+ 1\nL4\n)−1\nLTH2 =\n( 1\nLm\n+ 1\nL1\n+ 1\nL3\n+ 1\nL4\n)−1\nLTH3 =\n( 1\nLm\n+ 1\nL1\n+ 1\nL2\n+ 1\nL4\n)−1\n.\n(18)\nDue to the imperfect manufacturing of multi-winding\ntransformer, the leakage inductance of each winding will not\nbe completely consistent. Supposing that the difference value\nbetween L1 and L2 is 1L12, and 1L13 is the difference value\nbetween L1 and L3. The power deviation caused by difference\nbetween leakage inductances is addressed. The LTHk can then\nbe expressed as:\n\n\n\n\n\n\n\n\n\n\nLTH1 =\n( 1\nLm\n+ 1\nL1 +1L12\n+ 1\nL1 +1L13\n+ 1\nL4\n)−1\nLTH2 =\n( 1\nLm\n+ 1\nL1\n+ 1\nL1 +1L13\n+ 1\nL4\n)−1\nLTH3 =\n( 1\nLm\n+ 1\nL1\n+ 1\nL1 +1L12\n+ 1\nL4\n)−1\n.\n(19)\nPower transferred from port k to port 4 can be expressed\nas:\npk4 = vk vTH4k−4\n2πfs(Lk +LTHk )ϕk4(π−ϕk4). (20)\nAccording to (16), (17), (19), (20), Lk4 can be ﬁgured out:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nL14 =(L1 +LTH1)\n×\n[\nL4\n( 1\nLm\n+ 1\nL1 +1L12\n+ 1\nL1 +1L13\n)\n+1\n]\nL24 =(L2 +LTH2)\n×\n[\nL4\n( 1\nLm\n+ 1\nL1\n+ 1\nL1 +1L13\n)\n+1\n]\nL34 =(L3 +LTH3)\n×\n[\nL4\n( 1\nLm\n+ 1\nL1\n+ 1\nL1 +1L12\n)\n+1\n]\n.\n(21)\nSubstituting (21) to (16), taking p14 as the base value,\nthe power difference value in per unit is:\n\n\n\n1p12(p.u.) =p14 −p24\np14\n=1 −L14\nL24\n1p13(p.u.) =p14 −p34\np14\n=1 −L14\nL34\n. (22)\nVOLUME 8, 2020 119597\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\nFIGURE 7. The power deviation of QAB with respect to inconsistent\nleakage inductances of the four-winding transformer: (a) The relationship\nbetween 1p12, 1L12 and 1L13. (b) The relationship between1p13, 1L12\nand 1L13.\nThe relationship between 1L12, 1L13 and 1p12 is shown\nin Fig. 7(a), while the one between 1L12, 1L13 and 1p13\nis shown in Fig. 7(b). This shows that a small deviation in\nleakage inductance can lead to a signiﬁcant circulating power\namong different ports of QAB.\nSuch a power deviation will give rise to three-phase asym-\nmetrical 2 nd-order ripple powers and herein pose negative\neffect on power decoupling of PC-PET. Since such mismatch\nin transformer windings is inevitable, it is necessary to com-\nbine three-phase power balance and power decoupling. The\nproposed control strategy for PC-PET will be presented in the\nnext section.\nIV. PROPOSED CAPACITOR VOLTAGE RIPPLE\nSUPPRESSION METHOD\nThe overall control scheme of PC-PET is shown in Fig. 8.\nThe dual-loop control of PWM rectiﬁer is adopted. And the\ncontrol block diagram for RECM_x_j (x = a, b and c,\nj =1∼N) is shown in Fig. 8(a). As the physical constraints\nof three-phase system, the voltage regulation of phase c is\nacquired by the voltage loop of phase a and phase b.\nThe control block diagram of QAB is shown in Fig. 8(b).\nThe overall control of QAB contains PSC, ripple power\ndecoupling control and power balance control. In the start-up\nprocess, the primary HB of QAB works in PWM mode. Duty\ncycle gradually increases from 0% to 50%, and then switches\nto PSC.\nA. RIPPLE POWER DECOUPLING CONTROL\nBesides the 2 nd-order component, power stored in module\ncapacitors is likely to have higher secondary induced fre-\nquency components, i.e. the 4 th-order one. PR control is\nsuitable to decouple multiple-order ripple powers through\nparalleled structure in stationary reference frames [21]. Here,\nthe PR controller with resonant frequencies of 2ω and 4ω is\nselected. The transfer function is:\nPR(s) =kRP + kRI2s\ns2 +(2ω)2 + kRI4s\ns2 +(4ω)2 . (23)\nwhere kRP is the proportionality coefﬁcient, kRI2 and kRI4 are\nthe integration coefﬁcients. The resonant part realizes zero-\nsteady-state AC reference tracking, while a proportional gain\nis employed to ensure fast dynamic response [22]. The block\ndiagram of ripple power decoupling control is shown in Fig.9.\nAs the physical constraints of three-phase system, 1p2_cj\nand 1p4_cj can be calculated by:\n{\n1p2_cj =−1p 2_aj −1p2_bj\n1p4_cj =−1p 4_aj −1p4_bj. (24)\nAccording to (3), (14) and (15), the 2 nd-order ripple powers\n(ps2_aj, ps2_bj and ps2_cj) can be calculated as feedforward\ncompensation. The ripple voltages in module capacitors are\nextracted and suppressed to zero by PR controllers. The pr_xj\n(x =a, b and c) in Fig. 9 can be expressed as:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\npr_aj =−\n[UsIs\n2N cos(2ωt −θ) +1p2_aj +1p4_aj\n]\npr_bj =−\n[UsIs\n2N cos(2ωt −θ+2π/3)\n+1p2_bj +1p4_bj\n]\npr_cj =−\n[UsIs\n2N cos(2ωt −θ−2π/3)\n+1p2_cj +1p4_cj\n]\n(25)\nAccording to (16), ϕr_xj (x =a, b and c) can be expressed\nas:\n\n\n\n\n\n\n\n\n\n\n\nϕr_aj =\nπ−π\n√\n1 −8pr_ajfsL14\n/(\nuC_ajuo\n)\n2\nϕr_bj =\nπ−π\n√\n1 −8pr_bjfsL24\n/(\nuC_bjuo\n)\n2\nϕr_cj =\nπ−π\n√\n1 −8pr_cjfsL34\n/(\nuC_cjuo\n)\n2\n(26)\n119598 VOLUME 8, 2020\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\nFIGURE 8. The control scheme of PC-PET. (a) Control strategy of the PWM rectifiers. (b) Control strategy of QAB involving the whole\noperating process.\nFIGURE 9. The ripple power decoupling control strategy for PC-PET.\nB. POWER BALANCE CONTROL\nPower imbalance among phases commonly occurs due to\ninevitable inconsistent circuit parameters, such as different\nleakage inductance of transformer windings. Consequently,\nthe ripple powers are hard to be completely counteracted,\nwhich degrades the effect of ripple power decoupling.\nTherefore, a power balance control strategy is introduced. Its\ncontrol block diagram is shown in Fig. 10.\nFIGURE 10. The power balance control strategy of QAB in PC-PET.\nVOLUME 8, 2020 119599\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\nTABLE 1. Simulation parameters of proposed PC-PET.\nTABLE 2. Leakage inductances.\nThe power balance control strategy is composed of power\nbalance of three phases and power balance in phase x (x =a,\nb and c). According to the power balance control strategy,\nthe compensation on phase-shift angles of QAB (1ϕ aj, 1ϕbj\nand 1ϕcj) are ﬁnally obtained.\nV. SIMULATION AND EXPERIMENTAL VERIFICATION\nA. SIMULATION RESULTS AND ANALYSIS\nTo demonstrate the proposed techniques, a simulation model\nof PC-PET with two QAB modules per phase is set up\nin MATLAB/Simulink. Parameters of the power circuit are\nsummarized in Table 1.\nTo illustrate the inﬂuence of inconsistently coiled wind-\nings, and to verify the effect of proposed power balancing\ncontrol, the leakage inductances of the four-winding trans-\nformer in QAB are deliberately set as the speciﬁc values\nshown in Table 2. The largest parameter difference is 9.4%.\nFig. 11 and Fig. 12 depict the steady-state as well as\ndynamic performance of proposed power balancing control\nfor PC-PET. In Fig. 11(a), imbalance percentage of three-\nphase gird currents caused by inconsistent windings can be as\nlarge as 28.3%. While in Fig. 11(b), three-phase grid currents\nare well balanced. Fig. 12 shows that balancing adjustment is\nachieved within an interval of 11 periods.\nThe voltage of module capacitor and its FFT analysis\nresults are shown for comparison in Fig. 13. Without ripple\npower decoupling, the peak-to-peak of capacitor voltage can\nbe as large as 10%, and the 2 nd-order ripple component\nreaches 5.11% (shown in Fig. 13(a)). With ripple power\ndecoupling applied, the peak-to-peak ratio of the capacitor\nFIGURE 11. Steady-state waveforms of grid-side currentsisa, isb and isc .\n(a) Without power balance control. (b) With power balance control.\nFIGURE 12. Transient waveforms of grid-side currentsisa, isb and isc\nduring the starting of power balance control.\nvoltage is decreased to 0.5%, and the 2 nd-order ripple\ncomponent remains only 0.125% (shown in Fig. 13(b)).\nThe results reveal that the proposed PC-PET control strat-\negy can effectively suppress the voltage ripple in module\ncapacitors.\nFig. 14 shows the primary-side current of four-winding\ntransformer and phase-shift angle of QAB with ripple power\ndecoupling. The 2 nd-order component of phase-shift angle\ncontributes to the transfering of 2 nd-order ripple power. And\nthe transformer current is high-frequency pulsating with dou-\nble line-frequency ripple.\nThe steady-state of PC-PET with the overall control\nscheme is presented in Fig. 15. As shown, the unit power\nfactor at grid side is always guaranteed. The capacitor volt-\nages and the output voltage of QAB are all well balanced.\nThrough FFT analysis, the THD of gird current is 3.18%, the\n2nd-order harmonic component is 0.02%, and other harmonic\ncomponents are all below 2%.\nThe effects of power imbalance on ripple power decoupling\nare shown in Fig. 16. Without power balance control, the\nthree-phase gird currents become asymmetrical as shown\nin Fig. 16(a). The imbalanced three-phase ripple powers can-\nnot be completely counteracted in power decoupling, leaving\n119600 VOLUME 8, 2020\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\nFIGURE 13. Module capacitor voltageuC_a1 and the corresponding FFT analysis results. (a) Without ripple power decoupling.\n(b) With ripple power decoupling.\nFIGURE 14. Steady-state waveforms with the proposed control scheme.\n(a) Primary-side current of transformer. (b) Phase-shift angle. (all in\nphase a).\nconsiderable voltage ripple in module capacitor even though\npower decoupling is applied (shown in Fig. 16(b)). The resid-\nual ripple powers are transferred to the secondary side of\nQAB and lead to low-frequency voltage ripples at the DC bus,\nas illustrated in Fig. 16(c).\nIn the same PC-PET without proposed power decoupling,\n3000µF capacitance in power modules is required to achieve\nthe effect that the ratio of peak to peak ripple voltage equals to\n0.5%. The waveforms of capacitor voltages in both scenarios\nare shown in Fig. 17. The histogram in Fig. 18 indicates\nthat module capacitance can be sharply reduced by using\nproposed ripple power decoupling.\nFig. 19 shows the transient processes of PC-PET with 50%\nload change. It can be seen that with step load changing, the\npower balance control and ripple power decoupling control\ncan function as expected. During the load change, the system\nremains operating stably and adjusts to new steady state\nwithin 3 fundamental periods.\nFIGURE 15. Steady-state waveforms with the proposed control scheme.\n(a) Phase voltage and grid current of phasea. (b) Capacitor voltages of\npower modules in three phases. (c) DC output voltage.\nB. EXPERIMENTAL RESULTS AND ANALYSIS\nIn order to further verify the effectiveness of the proposed\ncontrol strategy, a 4:1 downscaled PC-PET prototype is built\nup. Parameters of the prototype is listed in Tabel 3.\nFig. 20 shows of the main control board and the power\nunit used. The overall setup is shown in Fig. 21. On the\nmain control board, the FPGA (EP1C12Q240I7) receives the\nmodulating signals from the DSP (TMS320F28335) and per-\nforms the pulse-width modulation. Based on modular design,\nthe main circuit of PC-PET is constituted by 7 identical power\nVOLUME 8, 2020 119601\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\nFIGURE 16. Steady-state waveforms of ripple power decoupling without\npower balance control. (a) Three-phase grid side currents. (b) Module\ncapacitor voltageuC_ax1. (c) DC output voltage of PC-PET.\nFIGURE 17. The module capacitor voltage. (a) With the proposed power\ndecoupling control/ capacitance of 100µF. (b) Without ripple power\ndecoupling/ capacitance of 3000µF. (all in phasea).\nunits per each cascaded level. The power devices and driving\ncircuit are integrated on one power unit. Each unit has a H-\nbridge composed of 4 IXFH40N85X MOSFETs (850V/40A),\nan EP4CE10E22C8 FPGA and other auxiliary circuits. The\nMOSFETs gating signals are generated by the main control\nboard and transferred to power units by optical ﬁbers.\nFIGURE 18. Capacitance comparison of each individual module.\nFIGURE 19. Transient waveforms of PC-PET with 50% load change.\n(a) Module capacitor voltages. (b) Three-phase grid-side currents.\n(c) Currents flowing through three primary sides of transformer.\n(d) Output DC voltage.\nFig. 22 shows the module capacitor voltages and DC\noutput voltage of PC-PET during the whole operating inter-\nval. Firstly, three single-phase PWM rectiﬁers are work-\ning in diode rectifying mode. During the rectifying process,\nthe module capacitor voltages rise from 311V to 400V . After-\nwards, the QAB is softly started with a certain ramp rate\n119602 VOLUME 8, 2020\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\nFIGURE 20. The PC-PET prototype for experimental verification.\nFIGURE 21. Schematic diagram of the prototype configuration.\nFIGURE 22. Module capacitor voltages and DC output voltage of PC-PET\nin the whole operating process.\nof the pulse width. Once the output voltage reaches 398V ,\nQAB enters PSC operating mode. Finally, the ripple power\ndecoupling control is imposed. The output voltage of QAB is\nwell regulated and stabilized at the expected value, 400V .\nFIGURE 23. Three-phase grid-side currents of PC-PET during the starting\nof power balance control.\nSince the three primary leakage inductances of the four-\nwinding transformer are different, the power balance con-\ntrol should be carried out after entering to the PSC mode.\nFig. 23 illustrates the corresponding transient process. When\nthe power balance control is not imposed, imbalance percent-\nage of gird currents can be as large as 11.7%. After when\nthe power balance control effects, the three-phase currents\ngradually tend to be symmetrical.\nFIGURE 24. Steady-state waveforms of grid-side currents. (a) Without\npower balance control. (b) With power balance control.\nFig. 24 shows the steady state waveforms of grid side\ncurrents with/ without the power balance control. Origi-\nnally, the three grid currents show considerable amplitude\ndifferences due to asymmetrical circuit parameters. Such\ndifferences are ﬁnally resolved by using the power balance\ncontrol.\nFig. 25 shows the transient process for ripple power\ndecoupling. As ripple power decoupling control started,\nthe low-frequency ripples in module capacitor voltages are\nsuppressed effectively.\nFig. 26 demonstrates the effect of voltage ripple suppres-\nsion. Without ripple power decoupling, the peak to peak ratio\nof ripple voltage is 6.75%. With proposed power decoupling,\nthe peak to peak ratio of ripple voltage is decreased to 1.25%.\nThe three primary currents of the four-winding transformer\nwith ripple power decoupling are shown in Fig. 27. The\nwaveforms match with simulation results well, and the three\nprimary currents are symmetrical with each other.\nVOLUME 8, 2020 119603\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\nFIGURE 25. Module capacitor voltages during the starting process of\nproposed power decoupling control.\nFIGURE 26. Comparison of module capacitors voltages in PC-PET.\n(a) Without ripple power decoupling. (b) With proposed ripple power\ndecoupling control.\nFig. 28 shows grid side currents and grid side voltage of\nphase a with ripple power decoupling. Taking phase a for\nexample, the current is in phase with the voltage at grid side.\nThus, it is proved that ripple power decoupling will not affect\nthe power factor control of PWM rectiﬁer in PC-PET.\nFig. 29 shows the dynamic waveforms of 33% load change,\ni.e. load power changing from 960W to 1450W. As we\nshall see, PC-PET can always operate stably. In Fig. 29(a),\nalthough there is a transient drop of uo, such a drop value\nis only 23V , about 5.75% of the reference value, which is\nFIGURE 27. Currents flowing through three primary sides of the\nfour-winding transformer in QAB (with proposed power decoupling\ncontrol).\nFIGURE 28. Phase a voltage and three-phase currents of PC-PET (with the\nproposed power decoupling control).\nacceptable. It is same for the dc voltages. Moreover, there is\nno double line frequency ripple on each dc voltage, which\nindicates the decoupling control works well in the tran-\nsients. In Fig. 29(b), during the load change, the three-phase\ncurrents are symmetrical, the power balance control can\nfunction well.\nVI. POWER LOSSES ANALYSIS\nThe power dissipation comes from different parts, i.e the\nsemiconductors, the high-frequency transformers, the reac-\ntive components. So the power loss calculation are performed\nfrom part to part, based on the simulation results.\nA. POWER LOSSES IN POWER DEVICES\nIGBT power losses can be divided into two groups: con-\nduction loss and switching loss. The conduction loss of\nIGBT (p CT ) and the anti-parallel diode (p CD) can be\nexpressed as [23]:\n\n\n\n\npCT = 1\nTs\n∫ Ts\n0\n(\nuCE0 ·iC (t) +rC ·i2\nC (t)\n)\ndt\npCD = 1\nTs\n∫ Ts\n0\n(\nuD0 ·iD(t) +rD ·i2\nD(t)\n)\ndt\n(27)\n119604 VOLUME 8, 2020\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\nFIGURE 29. Transient waveforms of PC-PET with 33% load change.\n(a) Modular capacitor voltages and DC output voltage. (b) Three-phase\ngrid-side currents.\nwhere iC (t) is the current ﬂowing through collector of IGBT,\niD(t) is the current ﬂowing through the anti-parallel diode.\nuCE0 and rC represent the on-state voltage the on-state resis-\ntance of IGBT respectively, uCE0 and rC represents the on-\nstate voltage the on-state resistance of the anti-parallel diode\nrespectively.uCE0, rC , uD0 and rD can be calculated referring\nto datasheet [24]. Switching loss (p sw) can be expressed as:\npsw =\n(\nEonT +EoffT +EonD\n)\n·fs (28)\nwhere EonT and EoffT are turn-on and turn-off energy losses\nin IGBT. EonD is turn-on energy loss in anti-parallel diode.\nParameters EonT , EoffT and EonD can be found in [24]. The\ntotal power losses of an IGBT (p I ) can be calculated with:\npI =pCD +pCT +psw (29)\nB. POWER LOSSES IN FOUR-WINDING TRANSFORMER\nPower losses of the four-winding transformer is composed by\ntwo parts: core loss and winding loss. Based on the improved\nSteinmetz equation, the core losses can be calculated as [25],\npC =FKf αs BβV (30)\nFor square excitation, the ﬂux waveform factor F equals to\nπ/4. The values of K, αand β are 4.8810 −5, 1.63 and 6.22\nrespectively, corresponding to the ferrite core. B is the ﬂux\ndensity, and V is the volume of core.\nNeglecting proximity effect and skin effect, the winding\nloss pw is calculated by equivalent resistance of the coils. The\ntotal power losses (p T ) of four-winding transformer can be\ncalculated by:\npT =pC +pW (31)\nC. POWER LOSS IN STORAGE CAPACITOR\nPower loss of capacitor pC is mainly consumed by the equiv-\nalent series resistance (ESR) that can be calculated as [26]:\nRC =tan(δ)\n2πfsC (32)\nwhere tan(δ) is the dissipation factor [27]. Then pC can be\ncalculated as:\npC =I2\nC ·RC (33)\nFIGURE 30. Comparisons between PC-PETs with and without the power\ndecoupling. (a) Losses breakdown among components. (b) Total volume\nof all capacitors.\nD. POWER LOSSES AND VOLUME ESTIMATION\nPower losses and capacitor volume are calculated based on\nthe selected components listed in Table 4. Similarly, both of\nthe conditions with and without ripple power decoupling are\naccounted. The comparison results are illustrated in Fig. 30.\nIn Fig. 30(a), PIrec, PIpri and PIsec represent power loss of\nIGBTs in RECM, primary and secondary side of QAB, PT\nis the total loss of four-winding transformers and PC is\ntotal loss of all capacitors in PC-PET. Without ripple power\ndecoupling, the total power loss of PC-PET is 345.7674W.\nVOLUME 8, 2020 119605\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\nTABLE 3. Parameters of proposed PC-PET prototype.\nTABLE 4. Component list of PC-PET with and without ripple power\ndecoupling.\nWhile with ripple power decoupling, the total power loss is\n359.39W. The efﬁciency is 95.47% and 95.13% respectively.\nAs we shall see, the efﬁciencies of the conditions with\nand without power decoupling would be very similar. Since\nthe focus of this paper is on minimizing of the capacitor\nvoltage ripples, a comparison is done as following, in order\nto demonstrate the effect of capacitance reduction.\nIn Fig. 30(b), the volume of 100µF module capaci-\ntor (V 100µF) is 38.013cm 3. The volume of 3000µF mod-\nule capacitor (V 3000µF) is 692.72cm 3. By using the power\ndecoupling strategy, the volume of module capacitor can be\nremarkably reduced while the efﬁciency of the system almost\nremains the same. Thereby power density of the system is\npromoted.\nFor one power module in a conventional three-phase PET,\nthree two-winding transformers are needed. Supposing that\nthe rated power is 2kW, the ferrite core of transformer is\nFIGURE 31. Volume comparison of transformers between PET and PC-PET\n(considering one power module).\nEE55/28/25, and the volume is 78.7cm 3. Thus the total\nvolume of transformers in a conventional PET is about\n236.1cm3. For one power module in the proposed PC-PET,\nonly one four-winding transformer is needed. The ferrite core\nis EE85/45/31, and the total transformer volume in PC-PET\nis 162cm 3, which is much less than the total one of three\ntwo-winding transformers. The comparison of transformer\nvolume between the two types of PET is illustrated in Fig. 31.\nVII. CONCLUSION\nThe low-frequency ripple power in module capacitors pre-\nvents PET from promoting its power density. In this paper,\na power channel based four-winding PET (PC-PET) is pro-\nposed to solve this issue. The PC-PET principle is ﬁrstly\nintroduced, which is followed by the mathematical analysis\nof the ripple power and its induced ripple voltages. Then the\nnegative effect of inconsistent windings on power decoupling\nis analyzed. Furthermore, the proposed PR control based\npower decoupling strategy is presented in details. The sim-\nulation and experiment results verify that by employing the\nproposed techniques, the three-phase ripple powers are com-\npletely eliminated through power channels without ﬂowing\nto loads. And the low-frequency ripples voltage in module\ncapacitors are effectively suppressed even with asymmetric\ncircuit parameters, which reduces the required module capac-\nitance sharply. Intentionally, the power losses, the capacitor\nvolume and the transformer volume are estimated based on\nthe simulation data. The results show that PC-PET with the\npower decoupling control has the similar efﬁciency with\nbefore, but beneﬁts a much higher power density..\nREFERENCES\n[1] X. She, A. Q. Huang, and R. Burgos, ‘‘Review of solid-state transformer\ntechnologies and their application in power distribution systems,’’ IEEE J.\nEmerg. Sel. Topics Power Electron., vol. 1, no. 3, pp. 186–198, Sep. 2013.\n[2] J. E. Huber and J. W. Kolar, ‘‘Solid-state transformers: On the origins\nand evolution of key concepts,’’ IEEE Ind. Electron. Mag., vol. 10, no. 3,\npp. 19–28, Sep. 2016.\n[3] A. Q. Huang, ‘‘Medium-voltage solid-state transformer: Technology for\na smarter and resilient grid,’’ IEEE Ind. Electron. Mag., vol. 10, no. 3,\npp. 29–42, Sep. 2016.\n[4] A. Q. Huang, M. L. Crow, G. T. Heydt, J. P. Zheng, and S. J. Dale, ‘‘The\nfuture renewable electric energy delivery and management (FREEDM)\nsystem: The energy Internet,’’ Proc. IEEE, vol. 99, no. 1, pp. 133–148,\nJan. 2011.\n119606 VOLUME 8, 2020\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\n[5] C. Gu, Z. Zheng, L. Xu, K. Wang, and Y . Li, ‘‘Modeling and control\nof a multiport power electronic transformer (PET) for electric traction\napplications,’’ IEEE Trans. Power Electron., vol. 31, no. 2, pp. 915–927,\nFeb. 2016.\n[6] J. E. Huber and J. W. Kolar, ‘‘V olume/weight/cost comparison of a 1MV A\n10 kV/400 v solid-state against a conventional low-frequency distribu-\ntion transformer,’’ in Proc. IEEE Energy Convers. Congr. Expo. (ECCE),\nSep. 2014, pp. 4545–4552.\n[7] L. F. Costa, G. Buticchi, and M. Liserre, ‘‘Quad-active-bridge DC–DC con-\nverter as cross-link for medium-voltage modular inverters,’’ IEEE Trans.\nInd. Appl., vol. 53, no. 2, pp. 1243–1253, Mar. 2017.\n[8] F. Briz, M. Lopez, A. Rodriguez, and M. Arias, ‘‘Modular power electronic\ntransformers: Modular multilevel converter versus cascaded H-bridge solu-\ntions,’’IEEE Ind. Electron. Mag., vol. 10, no. 4, pp. 6–19, Dec. 2016.\n[9] F. Briz, M. Lopez, A. Zapico, A. Rodriguez, and D. Diaz-Reigosa, ‘‘Oper-\nation and control of MMCs using cells with power transfer capability,’’\nin Proc. IEEE Appl. Power Electron. Conf. Expo. (APEC) , Mar. 2015,\npp. 980–987.\n[10] Z. Li, P. Wang, Z. Chu, H. Zhu, Z. Sun, and Y . Li, ‘‘A three-phase 10\nkV AC-750 VDC power electronic transformer for smart distribution grid,’’\nin Proc. 15th Eur. Conf. Power Electron. Appl. (EPE), Sep. 2013, pp. 1–9.\n[11] Y . Liu, A. Escobar-Mejia, C. Farnell, Y . Zhang, J. C. Balda, and\nH. A. Mantooth, ‘‘Modular multilevel converter with high-frequency\ntransformers for interfacing hybrid DC and AC microgrid systems,’’ in\nProc. IEEE 5th Int. Symp. Power Electron. Distrib. Gener. Syst. (PEDG),\nJun. 2014, pp. 1–6.\n[12] B. Zhao, Q. Song, W. Liu, and Y . Sun, ‘‘Overview of dual-active-\nbridge isolated bidirectional DC–DC converter for high-frequency-link\npower-conversion system,’’ IEEE Trans. Power Electron. , vol. 29, no. 8,\npp. 4091–4106, Aug. 2014.\n[13] R. Wang, F. Wang, D. Boroyevich, R. Burgos, R. Lai, P. Ning, and\nK. Rajashekara, ‘‘A high power density single-phase PWM rectiﬁer with\nactive ripple energy storage,’’ IEEE Trans. Power Electron., vol. 26, no. 5,\npp. 1430–1443, May 2011.\n[14] H. Li, K. Zhang, and H. Zhao, ‘‘DC-link active power ﬁlter for high-\npower single-phase PWM converters,’’ J. Power Electron., vol. 12, no. 3,\npp. 458–467, May 2012.\n[15] B. Liu, W. Song, J. Ma, X. Feng, and W. Li, ‘‘Dynamic performance\nimprovement of single-phase PWM converters with power hysteresis\ncontrol scheme,’’ IET Power Electron. , vol. 11, no. 12, pp. 1894–1902,\nOct. 2018.\n[16] L. Zhang and X. Ruan, ‘‘Control schemes for reducing second harmonic\ncurrent in two-stage single-phase converter: An overview from DC-bus\nport-impedance characteristics,’’ IEEE Trans. Power Electron., vol. 34,\nno. 10, pp. 10341–10358, Oct. 2019.\n[17] Y . Xia, J. Roy, and R. Ayyanar, ‘‘A capacitance-minimized, doubly\ngrounded transformer less photovoltaic inverter with inherent active-power\ndecoupling,’’IEEE Trans. Power Electron., vol. 32, no. 7, pp. 5188–5201,\nJul. 2017.\n[18] P. K. Achanta, B. B. Johnson, G.-S. Seo, and D. Maksimovic, ‘‘A multi-\nlevel DC to three-phase AC architecture for photovoltaic power plants,’’\nIEEE Trans. Energy Convers., vol. 34, no. 1, pp. 181–190, Mar. 2019.\n[19] L. He, X. Li, Y . Yang, Y . Yuan, and L. Tong, ‘‘Modeling and control of\nthree-phase AC-DC power channel based power electronics transformer\n(PC-PET) with power decoupling,’’ in Proc. IEEE Int. Power Electron.\nAppl. Conf. Expo. (PEAC), Nov. 2018, pp. 244–249.\n[20] S. Falcones, R. Ayyanar, and X. Mao, ‘‘A DC–DC multiport-converter-\nbased solid-state transformer integrating distributed generation and stor-\nage,’’ IEEE Trans. Power Electron., vol. 28, no. 5, pp. 2192–2203,\nMay 2013.\n[21] S. Li, W. Qi, S.-C. Tan, and S. Y . Hui, ‘‘Integration of an active ﬁlter and\na single-phase AC/DC converter with reduced capacitance requirement\nand component count,’’ IEEE Trans. Power Electron., vol. 31, no. 6,\npp. 4121–4137, Jun. 2016.\n[22] Z. Li, Y . Li, P. Wang, H. Zhu, C. Liu, and F. Gao, ‘‘Single-loop digital\ncontrol of high-power 400-hz ground power unit for airplanes,’’ IEEE\nTrans. Ind. Electron., vol. 57, no. 2, pp. 532–543, Feb. 2010.\n[23] D. Graovac and M. Pürschel, ‘‘IGBT power losses calculation using the\ndata-sheet parameters,’’ Inﬁneon Appl. Note, vol. 1, pp. 1–17, Jan. 2009.\n[24] IGBT Power Losses Calculation Using the Data-Sheet Parameters.\nAccessed: 2020. [Online]. Available: http://www.inﬁneon.com\n[25] Q. Yue, C. Li, Y . Cao, Y . He, B. Cai, Q. Wu, and B. Zhou, ‘‘Comprehensive\npower losses model for electronic power transformer,’’ IEEE Access, vol. 6,\npp. 14926–14934, 2018.\n[26] B. Chen, P. Wang, Y . Wang, W. Li, F. Han, and S. Zhang, ‘‘Comparative\nanalysis and optimization of power loss based on the isolated series/multi\nresonant three-port bidirectional DC-DC converter,’’ Energies, vol. 10,\nno. 10, pp. 1565–1591, Oct. 2017.\n[27] Rubycon_MXH_Catalog. Accessed: 2020. [Online]. Available: http://\nwww.rubycon.com\nXIAOHUI LI (Graduate Student Member, IEEE)\nreceived the M.S. degree in control engineering\nfrom the School of Control Engineering, Xijing\nUniversity, Xi’an, China, in 2016. He is currently\npursuing the Ph.D. degree in intelligent transporta-\ntion science and technology with Soochow Univer-\nsity, Suzhou, China.\nHis current research interests include power\nelectronic transformer and multi physics ﬁelds of\nelectrical equipment.\nLINQIAN CHENGreceived the bachelor’s degree\nin engineering from the School of Rail Transporta-\ntion, Soochow University, Suzhou, China, in 2015,\nwhere he is currently pursuing the master’s degree\nin trafﬁc information engineering and control.\nHis current research interest includes modeling\nand control of power electronic converter.\nLIQUN HE(Member, IEEE) received the B.E. and\nPh.D. degrees in electrical engineering from the\nHuazhong University of Science and Technology\n(HUST), Wuhan, China, in 2010 and 2015, respec-\ntively.\nShe is currently an Associate Professor with\nSoochow University, Suzhou, China. Her research\ninterests include fully modular power electron-\nics systems, power electronic transformer, rail-\nway electriﬁcation, and multi physics ﬁelds of\nelectrical equipment.\nZHONGKUI ZHU received the B.S. and M.S.\ndegrees in vehicle engineering from the Hefei Uni-\nversity of Technology, Hefei, China, in 1997 and\n2002, respectively, and the Ph.D. degree in instru-\nmentation science and technology from the Uni-\nversity of Science and Technology of China, Hefei,\nin 2002.\nFrom 2005 to 2012, he was a Lecturer and an\nAssociate Professor with the School of Mechanical\nand Electrical Engineering, Soochow University,\nwhere he has been a Professor with the School of Rail Transportation, since\n2012. He is the author of more than 100 articles. His research interests\ninclude system monitoring and diagnostics, signal processing, and vehicle\nsystem dynamics and control.\nVOLUME 8, 2020 119607\nX. Liet al.: Capacitor Voltage Ripple Minimization of a Modular Three-Phase AC/DC PET\nYONG YANG (Senior Member, IEEE) received\nthe B.S. degree in automation from Xiangtan Uni-\nversity, Xiangtan, China, in 2003, the M.S. degree\nin electrical engineering from Guizhou University,\nGuiyang, China, in 2006, and the Ph.D. degree in\nelectrical engineering from Shanghai University,\nShanghai, China, in 2010.\nFrom December 2017 to December 2018,\nhe was a Visiting Scholar with the Center for\nHigh Performance Power Electronics (CHPPE),\nThe Ohio State University, Columbus, OH, USA. He is currently an Asso-\nciate Professor with the School of Rail Transportation, Soochow University.\nHe has coauthored more than 60 journal and conference papers. His current\nresearch interests include model predictive control in power electronic con-\nverters, distributed energy resource interfacing, and high-performance motor\ndrive control.\nCHENG WANG (Member, IEEE) received\nthe B.S. degree in electrical engineering and\nautomation from Southwest Jiaotong University,\nChengdu, China, in 2011, and the Ph.D. degree\nin electrical engineering from the Huazhong Uni-\nversity of Science and Technology, Wuhan, China,\nin 2018.\nHe was a Research Assistant with the Depart-\nment of Electrical and Computer Engineering,\nLehigh University, Bethlehem, PA, USA, from\n2014 to 2018. He joined the Nanjing University of Science and Technology,\nas an Associate Professor, in 2018. His current research interests include\nmicrogrids, high-penetrative grid-interactive photovoltaic systems, MV/HV\nAC-DC/DC-AC power electronics converter systems, modular multilevel\nconverters, and uninterrupted power systems.\n119608 VOLUME 8, 2020"
}