{
  "title": "Comparison of Ageing Characteristics of Superior Insulating Fluids With Mineral Oil for Power Transformer Application",
  "url": "https://openalex.org/W3046658820",
  "year": 2020,
  "authors": [
    {
      "id": "https://openalex.org/A3046333361",
      "name": "Raymon Antony Raj",
      "affiliations": [
        "Botswana International University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2673671063",
      "name": "Ravi Samikannu",
      "affiliations": [
        "Botswana International University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2144988972",
      "name": "Abid Yahya",
      "affiliations": [
        "Botswana International University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2223686165",
      "name": "Modisa Mosalaosi",
      "affiliations": [
        "Botswana International University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A3046333361",
      "name": "Raymon Antony Raj",
      "affiliations": [
        "Botswana International University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2673671063",
      "name": "Ravi Samikannu",
      "affiliations": [
        "Botswana International University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2144988972",
      "name": "Abid Yahya",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2223686165",
      "name": "Modisa Mosalaosi",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2077062901",
    "https://openalex.org/W2147507227",
    "https://openalex.org/W2138190965",
    "https://openalex.org/W2049607248",
    "https://openalex.org/W2411079712",
    "https://openalex.org/W2104194630",
    "https://openalex.org/W2789601376",
    "https://openalex.org/W2769884725",
    "https://openalex.org/W2567842500",
    "https://openalex.org/W2505600226",
    "https://openalex.org/W2167835054",
    "https://openalex.org/W2144142846",
    "https://openalex.org/W2122364249",
    "https://openalex.org/W2243833121",
    "https://openalex.org/W2751960879",
    "https://openalex.org/W1782513595",
    "https://openalex.org/W1123322564",
    "https://openalex.org/W2014305810",
    "https://openalex.org/W2094908333",
    "https://openalex.org/W2057404461",
    "https://openalex.org/W6772045120",
    "https://openalex.org/W2895909756",
    "https://openalex.org/W2605887583",
    "https://openalex.org/W1998703974",
    "https://openalex.org/W2897284871",
    "https://openalex.org/W1973180884",
    "https://openalex.org/W2080106834",
    "https://openalex.org/W2740682698",
    "https://openalex.org/W2388127488",
    "https://openalex.org/W3150669413",
    "https://openalex.org/W2503283570",
    "https://openalex.org/W2996337533",
    "https://openalex.org/W4302324829"
  ],
  "abstract": "Natural Esters (NEs) with a high proportion of Unsaturated Fatty Acids (UFAs) were used in this research. A Superior Insulating Fluid (SIF) is prepared by blending NEs like Baobab Oil (BAO) and Mongongo Oil (MGO) with a pure dielectric like Kerosene (KER) and subjected to ultrasonic wave treatment at 30 kHz. Then, accelerated heating of SIF is carried out in the presence of Kraft Paper (KP) and Copper Plate (CP) for 10 hours a day at 90 &#x00B0;C for 30 successive days. The deterioration of the dielectric characteristics of SIF, KP, and CP was measured as per IEC and ASTM standards before and after the schemes of stressing. The failure rate of SIF, KP and CP was compared to understand the influence of KER in NEs. The KER addition at 5% proportion protects the oil from dielectric weakening, copper from ageing and likewise, the viscosity remains at the original level. The use of KER in NEs have thin the oils and protects the copper from oxidation, thus preserving the quality of oils for several years. The extrapolation of data is done using a polynomial function and for 90 days, where the selected SIFs show 7% of ageing rate when compared to MO that shows 50% ageing rate. This affirms that SIFs are a suitable substitute for Mineral Oil (MO) and reclamation SIFs are achieved using natural reclamation/filtration techniques using Activated Bentonite and Activated Carbon. Hence spilling and reusing the SIFs does not harm the environment as that of Mineral Oil (MO).",
  "full_text": "Received July 6, 2020, accepted July 27, 2020, date of publication July 30, 2020, date of current version August 13, 2020.\nDigital Object Identifier 10.1 109/ACCESS.2020.3012988\nComparison of Ageing Characteristics of Superior\nInsulating Fluids With Mineral Oil for\nPower Transformer Application\nRAYMON ANTONY RAJ\n, RAVI SAMIKANNU\n , (Member, IEEE),\nABID YAHYA, (Member, IEEE), AND MODISA MOSALAOSI, (Member, IEEE)\nDepartment of Electrical, Computer and Telecommunications Engineering, Faculty of Engineering and Technology, Botswana International University of Science\nand Technology, Palapye, Botswana\nCorresponding author: Raymon Antony Raj (raymonhve@gmail.com)\nABSTRACT Natural Esters (NEs) with a high proportion of Unsaturated Fatty Acids (UFAs) were used\nin this research. A Superior Insulating Fluid (SIF) is prepared by blending NEs like Baobab Oil (BAO) and\nMongongo Oil (MGO) with a pure dielectric like Kerosene (KER) and subjected to ultrasonic wave treatment\nat 30 kHz. Then, accelerated heating of SIF is carried out in the presence of Kraft Paper (KP) and Copper\nPlate (CP) for 10 hours a day at 90 ◦C for 30 successive days. The deterioration of the dielectric characteristics\nof SIF, KP, and CP was measured as per IEC and ASTM standards before and after the schemes of stressing.\nThe failure rate of SIF, KP and CP was compared to understand the inﬂuence of KER in NEs. The KER\naddition at 5% proportion protects the oil from dielectric weakening, copper from ageing and likewise, the\nviscosity remains at the original level. The use of KER in NEs have thin the oils and protects the copper\nfrom oxidation, thus preserving the quality of oils for several years. The extrapolation of data is done using\na polynomial function and for 90 days, where the selected SIFs show 7% of ageing rate when compared to\nMO that shows 50% ageing rate. This afﬁrms that SIFs are a suitable substitute for Mineral Oil (MO) and\nreclamation SIFs are achieved using natural reclamation/ﬁltration techniques using Activated Bentonite and\nActivated Carbon. Hence spilling and reusing the SIFs does not harm the environment as that of Mineral\nOil (MO).\nINDEX TERMS Ageing, Kraft Paper, mineral oil, natural ester, pressboard, power transformer.\nI. INTRODUCTION\nEnergy sectors across the world are focusing on the utilization\nof renewable sources to create a carbon-free environment.\nPower transmission units like the power transformer have\nbeen using Mineral Oil since 1890 to present [1]. The demand\nfor power is rising day-by-day and the number of power\ntransformers in the network is increasing as well. Therefore,\nthe utilization of insulating ﬂuids in power transformers has\nattracted the attention of researchers in recent years [2]. The\nuse of MO in power accessories like transformers [3], high\nvoltage cables [4], high voltage capacitors [5] and high-\npressure oil circuit breakers [6] is necessary for achieving\ninsulation and cooling. But the adverse effects of using MO\nduring operation followed by reclamation or post-disposal\nwill affect the environment with Particulate Matters\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Hui Ma\n.\nEmission (PME) [7], [8]. Shifting the focus towards edible\nmarkets offers several options in the form of NEs which have\nsuperior insulation and cooling properties [1] than commer-\ncially used MO. NEs on the other hand, are amply available\nand must therefore, be investigated for their suitability as\ndielectric ﬂuids and possible substitute to MO. The dielectric\nstrength is the qualiﬁer line for any oil to be used as a\ndielectric ﬂuid, MO has a poor dielectric strength much\nless than NEs [9]. Moreover, many transformer ﬁres are\nbecause of the poor cooling performance due to low thermal\ncharacteristics of MO. The NEs thermal characteristics are\ndouble to thrice that of MO provided with better dissipa-\ntion constant [10]. To a large extent, the solid insulation in\nMO-ﬁlled power transformers deteriorate at a faster rate than\nthose with NEs because both the NEs and solid insulations\n(Kraft Paper (KP) and Pressboard (PB) are environmentally\ncompatible [11]. Even though the oxidation rate of MO is\nmuch lesser than that of NEs, MO in contact with solid\nVOLUME 8, 2020 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see https://creativecommons.org/licenses/by/4.0/ 141111\nR. A. Rajet al.: Comparison of Ageing Characteristics of Superior Insulating Fluids\ninsulation and copper windings increases the oil’s acidity\nand sludge [12]. This tends to increase the copper-oxidation\nand conductivity; therefore, oil’s dielectric strength gets\nreduced to increase the probability of insulation failure.\nHence, to reduce such failure the use of NEs is the only envi-\nronmentally friendly choice for enhanced power transformer\nlife and its service reliability.\nII. MATERIALS AND METHODS\nA. UNSATURATED FATTY ACIDS (UFAs) RICH\nNATURAL ESTERS (NE)\nNEs which are naturally highly viscous needs treatment\nbefore installation in power transformers [13], [14]. Many\nresearchers place greater attention on the composition of\nSaturated Fatty Acids (SFAs) where more of it offers better\noxidation stability when compared to oils with higher content\nof UFAs [15]. The SFAs rich NEs are hydrogenated oils\nwith more Hydrogen (H) molecules that mix with the sulfur\nin the oil resulting in the post-production of sulfur oxides.\nSulfur in oil is a warning sign that the solid insulation is at\ngreater risk [7], [16] and deterioration will increase [17], [18].\nThe NEs rich in UFAs do not contain H molecules in the\nfatty acid chain and thus no production of sulfur oxides,\nreducing the risk of deterioration of solid insulation. With\nregards to viscosity, NEs with high SFAs have an H molecule\nbetween every Carbon-Carbon (C-C) chain and it is difﬁcult\nto alleviate the (C-C) length unless using any ultrasonic wave\ntreatment [19], [20]. But the effect could be short-term so that\nthe (C-C) length begins to shrink as the viscosity matrix is\nrigid to restore to its initial length. On the other hand, NEs\nwith high proportion of UFAs containing (C-C) chain without\nH molecule by nature possess ﬂexible viscosity matrix [21]\nwhich will show a good response to ultrasonic waves.\nB. KEROSENE (KER) - C10H22\nKerosene (KER) has been used as a burning fuel before the\nexistence of Mineral Oil for transformer application [22].\nKER is a pure mineral oil that burns pure and possesses\nmiscible property when blended with high-density solvents\nlike diesel, paints and high-grade engine oils [23]. Studies\nhave shown that biodiesel prepared from kerosene and edible\noil have identical carbon chain length [24]. It is a class-3\nﬂammable liquid with a good dielectric permittivity of 1.86\n(at 21 ◦C), thus preventing electric ﬁeld conduction in the\ndielectric. This can be deduced from the relation E =σ/ξ,\nwhere E is electric ﬁeld, σ is conductivity, and ξ is permit-\ntivity that exists within the dielectric by keeping the conduc-\ntivity minimum [25]. KER, when blended with a solvent will\nproduce a homogeneous mixture and no agglomeration in the\npost phase. KER has a pour point of −47◦C that helps to\nkeep the oil circulating in the transformer during extreme cold\nweather [26]. The alkali metals are usually stored in KER to\nprotect them from oxidation, hence it acts as a good lubricant\nagainst metals like Iron (Fe), Aluminium (Al), and Copper\n(Cu) [27]. KER protects metals from corrosion and oxida-\ntion provided the enclosure is watertight and oxygen sealed.\nThe insulation property of KER does not allow ionization\nto happen in the insulating oil and thereby eliminates/delays\nthe avalanche process. KER is mainly used in rocket propul-\nsion systems as a cooling fuel because it possesses excellent\nheat dissipation than any other dielectric ﬂuid [28]. These\nattributes prove that KER has better insulation and cooling\nproperties in addition to the miscible property. KER has\nlittle volatility and does not produce smoke without pre-\nheating [26]. The mixture of Oil:KER is homogeneous and\nwill have a better dissipation factor as the oil possesses an\nauto-ignition point greater than 300 ◦C.\nC. COPPER PLATE (CP) AND KRAFT PAPER (KP)\nThe oil used in power transformers must possess properties\nlike good insulation and cooling [29]. Whenever it is used\nin a composite phase like solid in oil, it must extract heat\nfrom the windings and dissipate it to the external atmosphere.\nBut oil is not ideal insulation to sustain any balance between\nheat generated by the winding and heat dissipated to the\nenvironment. Hence the solid insulation and winding must\nmeet certain heat throughout the working of the power trans-\nformer. The solid insulation like KP is made of cellulose\nmaterial obtained from pulp and it readily deteriorates when\nin contact with oil containing saturated hydrocarbons like\nMineral Oil [30]. Similarly, the prolonged exposure of copper\nwindings immersed in Mineral Oil is susceptible to corrosion\ndue to oxidation [31]. As the heat dissipation of Mineral Oil\nis very less when compared to Natural Esters, the CP and\nKP immersed in Mineral Oil deteriorates at a much faster\nrate than in Natural Esters [32]. Additionally, CP will start\nproducing copper oxides which increase the acidity of the\noil and thereby increasing the conductivity of the oil. When\nconductivity increases, an electric ﬁeld is setup in the oil and\nleads to dielectric breakdown. On the other hand, the acidity\nof the oil increases the polymerization of KP and mixes ﬁnely\nwith oil [33]. Furthermore, the reaction initiates the electric\nﬁeld in the oil which subsequently raises oil sludge and\nacidity. The use of Natural Esters, however, provides better\nrust protection and lubrication for CP because NE dissipates\nheat at a higher rate than MO. Also, with the good heat\ndissipation property, the KP immersed in NE deteriorates at\na much slower rate and thereby maintaining the quality of oil\nfor several years.\nIII. SUPERIOR INSULATING FLUID (SIF)\nSuperior Insulating Fluid (SIF) is prepared using the method-\nology presented in Figure 1. The UFAs rich NEs are initially\ntreated with Activated Bentonite Clay for the removal of\nmoisture/ionic impurities followed by heating at 100 ◦C [34].\nThen, the ultrasonic waves with 30kHz at 90 ◦C are used\nto alter the molecular structure of the oil, which affects\nthe viscosity of oil [20]. The UFAs rich oils are a loosely\npacked chain structure without a hydrogen molecule which\nwhen subjected to ultrasonic waves, the oil experiences com-\npression and expansion forces acting between the carbon\natoms. This stretches the molecular structure of the oil unless\n141112 VOLUME 8, 2020\nR. A. Rajet al.: Comparison of Ageing Characteristics of Superior Insulating Fluids\nFIGURE 1. Methodology for preparation of superior insulating\nfluids (SIFs).\na thinner medium is used to ﬁll the voids developed because\nof molecular expansion. The molecular expansion is affected\nby lower temperatures and therefore the C-C molecule gap\nreduces to its original level. The higher carbon atom of\nKER is used to ﬁll the NEs chain gaps and the effect is\npermanent. Since KER is not affected by low temperature\nbecause of its low pour point, the low-temperature effect on\nNEs is not effective. The reduction of viscosity of NEs after\nultrasonic treatment and low-temperature impact on NEs is\npresented in Table 1. A miscible pure dielectric solvent like\nKER is blended with oil and subjected to ultrasonic treatment\nwith 30kHz at 100 ◦C. The viscosity proﬁles of NEs with-\nout KER, before/after treatment with ultrasonic waves, and\nNEs with KER, before/after treatment with ultrasonic waves\nare presented in Table 2. Compositions of KER:Oil taken\nare 5%:95% (5ml:95ml), 10%:90% (10ml:90ml) for the SIF\npreparation. After the preparation, the Superior Insulating\nFluid (SIF) samples are subjected to dielectric tests as per the\nstandards of IEC and ASTM.\nIV. TEST METHODOLOGY\nThe Copper Plate (CP) and Kraft Paper (KP) samples are\ntaken and placed in SIFs prepared using BAO, MGO, and\nconventional naphthalene grade mineral oil with KER added\nin different proportions. A total of 13 samples (‘A1-A6’, ‘M’,\nand ‘B1-B6’) were prepared for the investigation as presented\nin Table 3.\nTABLE 1. Kinematic viscosity and breakdown voltage of BAO after\ntreatment.\nTABLE 2. Kinematic viscosity and breakdown voltage of BAO after\ntreatment.\nTABLE 3. List of SIFs and MO samples prepared.\nThe test samples were subjected to accelerated heating\ntest where the samples are heated at 90 ◦C for 30 days with\n10 hours a day. The samples were allowed to cool between\nthe heating cycles at room temperature and they are trans-\nferred to tight containers. Dielectric testing on the samples\nVOLUME 8, 2020 141113\nR. A. Rajet al.: Comparison of Ageing Characteristics of Superior Insulating Fluids\nwas performed after 10 days and 30 days, which includes\nbreakdown voltage, thermal conductivity, kinematic viscos-\nity, auto-ignition point, and acid number.\nV. RESULTS AND DISCUSSION\nThe test results of the samples are used to state the dielectric\nnature of the SIF samples with and without KER, CP, and KP.\nThe performance statistics are presented in each section of the\ndiscussion.\nA. ELECTRICAL CHARACTERISTICS\n1) AC BREAKDOWN VOLTAGE\nAC breakdown voltage is the deciding property of the insu-\nlating ﬂuid when proposed for power transformer applica-\ntion. The test results conducted as per the IEC standard [35]\nusing breakdown testing kit with 2.5mm spacing between\nthe spherical electrodes, comply with the ASTM standard\nfor loading Natural Ester in power apparatus [36]. The volt-\nage is applied at a rate of 2kV/s until a regular breakdown\nappears in the liquid. Every ﬁve measurements are taken\naverage given a time gap of 2-5 minutes between the measure-\nments. The comparison of the results of samples ‘A1-A6’ and\n‘B1-B6’ are compared with the results obtained with the\nsample ‘M’ that was prepared using Mineral Oil. The\nbreakdown voltage variations of BAO samples (A1-A3,\nB1-B3), M and its corresponding insulating life degrada-\ntion are presented in Figures 2 and 3. The sample M\nshow 21kV\nFIGURE 2. Comparison of breakdown voltage characteristics of\nSIF prepared using BAO with mineral oil.\nThough, the dielectric breakdown voltage value of sam-\nples with high KER proportion is greater in samples ‘A2’,\n‘A3’, ‘B2’, and ‘B3’ from ﬁgure 2. The breakdown voltage\nreduction of samples with 10% KER is higher (4%−6.3%)\nthan samples with 5% KER proportion that has 1.1%−2.2%.\nHere, the data within 30 days are interpolated using linear\nand polynomial (third-order) equations, where the best ﬁt of\nthe trend show R 2 = 0.812 to 0.967 and R 2 = 0.813 to\n0.984 for the linearity and polynomial interpolation function,\nrespectively.\nFurther extrapolating the data using the polynomial func-\ntion from ﬁgure 2 there is a noticeable 4.8% reduction after\n30 days in breakdown voltage of samples ‘A1’ and ‘B1’ that\ntakes 315 days to deteriorate 50% breakdown voltage from\nFIGURE 3. 50% Breakdown voltage life expectancy of BAO.\nFigure 3. On the other hand, the sample ‘M’ has a reduction\nof 16% in 30 days and will take 90 days to deteriorate 50%\ninsulation strength. Considering the sample ‘A2’ and ‘B2’,\nthey have the least 50% of insulation strength degradation\nin 1350 and 675 days, respectively. An average difference of\ntwo-time is seen between sample ‘B2’ and ‘A1’, and seven-\ntime is observed between sample ‘B2’ and ‘M’ after the\naccelerated heating test. This extrapolation informs the power\nengineers about the weakness of insulation and help them\nto reﬁll the oil with fresh one or reclaim the used oil upon\nreaching 50% of life.\nThe dielectric breakdown voltage and the insulation degra-\ndation characteristics are presented for the samples pre-\npared using MGO and MO. Like the BAO characteristics\nin Figures 2 and 3, the samples (A4-A6, and B4-B6 show\nsuperior breakdown voltage with higher KER proportion seen\nfrom Figure 4.\nFIGURE 4. Comparison of breakdown voltage characteristics of SIF\nprepared using MGO with mineral oil.\nBut the samples ‘A4’ and ‘B4’ containing no KER show\na 2.6% breakdown voltage reduction for the measurement\ncarried out for 0 to 30 days. The linear and polynomial\ninterpolations show a trend ﬁt of the curve with conformity\nof R2 =0.968 and R 2 =0.987 for the linear and polynomial\nfunctions, respectively. On the other hand, the samples ‘A6’\nand ‘B6’ show a 6.4-8.9% reduction in insulation strength,\nwith the other samples ‘A5’ and ‘B5’ showing the least\nvalue of 2.3-2.4% for the 0 to 30 days span. Basically, when\ncomparing all the SIFs in Figure 4, the sample ‘M’ shows the\nhighest drop of 16.7% breakdown voltage in the presence of\nCP and KP components.\n141114 VOLUME 8, 2020\nR. A. Rajet al.: Comparison of Ageing Characteristics of Superior Insulating Fluids\nFurther, extrapolating the data using polynomial func-\ntions the ﬁgure 5 shows the insulation reduction to sev-\neral days for MGO based SIF where sample ‘B5’ takes\n630 days to reach 50% insulation strength reduction. The\nsample ‘M’ has the least in the record with an average\nof 90 days to reach 50% insulation reduction. The sample\n‘B5’ has an average difference of 1:7 times life expectancy\nthan samples ‘B4’ (without KER) and ‘M’ respectively.\nThe life expectancy of the samples from Figure 5 shows\nthat the sample ‘B5’ with 5% KER (includes CP and KP)\nholds the longest life for liquid insulation in the power\ntransformer.\nFIGURE 5. 50% Breakdown voltage life expectancy of MGO.\nB. THERMAL CHARACTERISTICS\n1) AUTO-IGNITION POINT\nNEs possess high auto-ignition point greater than 300 ◦C\ncompared to Mineral Oil which is only 150 ◦C. But the NEs\nthat are supposed to be mixed with KER at different pro-\nportions, heated along with CP and KP show changes in the\nactual strength. The thermal withstands capacity of samples\nwhich are measured according to ASTM [37] are depicted\nin ﬁgures 6 and 8, where their percentage reduction from\nactual strength is presented in Figures 7 and 9. As the\nreduction in the auto-ignition point is less than 2%, the data\nwithin 30 days are interpolated using a logarithmic function\nwhich gives the best ﬁt of conformity R 2 = 0.769. From\nFigure 6 and 8, the actual auto-ignition points of samples\nprepared using BAO and MGO and subsequently treated with\nCP and KP are seen. The reduction in the auto-ignition point\nis shown in Figure 7 and 9 and the percentage reduction is\nhighest in sample ‘M’ over other samples. BAO and MGO\nwith 0 to 10% KER proportion with CP and KP have a\nreduction of less than 1%. In contrast, sample M shows a\ngreater reduction of 1.9% in auto-ignition for over 30 days.\nExtrapolation indicates that, upon subsequent heating of sam-\nple ‘M’, the thermal stability of the sample will drop below\n100◦C in 790 days. But NEs with 5% KER and 10% KER\nwill take several years to decline the auto-ignition point to\nless than 50% of actual capacity.\n2) THERMAL CONDUCTIVITY\nThe thermal conductivity is measured using the KS-1 probe\nat room temperature and elevated temperature compared to\nthe loading standard of Natural Ester in ASTM [36] and\nFIGURE 6. Comparison of auto-ignition point of SIF prepared using BAO\nwith MO.\nFIGURE 7. Auto-ignition point reduction of SIF containing BAO and MO\nin 30 days.\nFIGURE 8. Comparison of auto-ignition point of SIF prepared using MGO\nwith MO.\nIEEE [38] at 30, 60, 90 and 110 ◦C for 10 days and 30 days\ndurations. The results are presented in Figure 10, 11, 13,\nand 14. The percentage of variations of samples prepared\nusing BAO and MGO with CP and KP are presented\nin Figures 12 and 15, respectively. The thermal conduc-\ntivity of NEs is higher than that of MO at both low and\nelevated temperatures where the heat dissipation capacity\nof NEs is excellent at higher temperatures. The presence\nof CP and KP does not affect the thermal conductivity of\nBAO and MGO samples except the samples containing 10%\nKER show the lowest percentage difference from the Fig-\nures 12 and 15. BAO Samples with 5% KER has shown excel-\nlent thermal conduction peaks compared to MO which has\nthe least thermal conduction at elevated temperature and low\ntemperature.\nVOLUME 8, 2020 141115\nR. A. Rajet al.: Comparison of Ageing Characteristics of Superior Insulating Fluids\nFIGURE 9. Auto-ignition point reduction of SIF containing MGO and MO\nin 30 days.\nFIGURE 10. Comparison of thermal conductivity of BAO after 10 days\nwith MO.\nFIGURE 11. Comparison of thermal conductivity of BAO after 30 days\nwith MO.\nFIGURE 12. Percentage difference in thermal conductivity of BAO from\n30◦C to 110◦C.\nSimilarly, samples prepared with MGO show greater con-\nductivity at elevated temperature and lower temperature than\nMO which is poor in heat dissipation. Figures 13 and 14 show\nthat the thermal conductivity of MGO prepared samples is\nFIGURE 13. Comparison of thermal conductivity of MGO after 10 days\nwith MO.\nFIGURE 14. Comparison of thermal conductivity of MGO after 30 days\nwith MO.\nFIGURE 15. Percentage difference in thermal conductivity of MGO from\n30◦C to 110◦C.\nconsistently higher when compared to that of MO. The dif-\nference in thermal conductivity of samples in 10 days and\n30 days for temperature changes from 30 ◦C to 110 ◦C is\npresented in Figure 15 where the maximum difference is\nachieved without the CP and KP component. But the samples\nA5 and B5 with CP and KP component show similar values\nafter the 10- and 30-days span. In all the experiments, the dif-\nference in conductivity from 30 ◦C to 110 ◦C is higher in the\n10days span than in the 30days.\nHowever, the thermal conductivity of NEs at elevated tem-\nperatures is higher due to molecular relaxation achieved using\nultrasonic waves and KER. On the other hand, MO with\nrandom carbon molecules has no signiﬁcant tolerance to\nheat and likely to affect the internal parts of the power\ntransformer.\n141116 VOLUME 8, 2020\nR. A. Rajet al.: Comparison of Ageing Characteristics of Superior Insulating Fluids\nC. PHYSICAL CHARACTERISTICS\n1) KINEMATIC VISCOSITY\nThe kinematic viscosity measured according to ASTM\nD6871 [39] shows that the NEs are three to four times heav-\nier than MO, but treatment with ultrasonic waves and KER\nreduces the viscosity as presented in Figures 16 and 18. At a\ntemperature of 40 ◦C the oils have a viscosity of 50 cSt as\nspeciﬁed by the standard of ASTM D445 and this further\nindicates a reduction in the oil’s viscosity. Changes over 10-\nand 30 days are presented in ﬁgure 17 and 19. NEs treated\nwith ultrasonic waves along with KER show lower values\nof viscosity with the increase in KER proportion. However,\naccelerated heating with CP and KP components over 30 days\nwith the measurement taken on the day ‘0’, ‘10’, and ‘30’\nshow viscosity value between 40 cSt and 60cSt at 5% KER\nproportion at 30 ◦C. The days between 0 day to 30 days\nFIGURE 16. Kinematic viscosity of SIF prepared using BAO with MO for\n0 to 30 days measured at 30◦C.\nFIGURE 17. Percentage kinematic viscosity changes in SIF having BAO\nand MO over 30 days.\nFIGURE 18. Kinematic viscosity of SIF prepared using MGO with MO for\n0 to 30 days measured at 30◦C.\nare interpolated using third-order polynomial function with\nR2 =0.93 as the best ﬁt of the trend. When the temperature\nincreases, the viscosity value of samples ‘A2’ and ‘B2’ is\n17cSt and 25cSt at 90◦C which is desirable for the higher heat\ndissipation. Mineral Oil, on the other hand shows the lowest\nvalue of viscosity in 0 days and starts to rise to 25% at the\nend of 30 days. Furthermore, extrapolating the curve using\nthe polynomial function concerning the increase in heating\nhours the fade away of viscosity could be reached within six\nmonths.\nFIGURE 19. Percentage kinematic viscosity changes in SIF having MGO\nand MO over 30 days.\nLike the BAO characteristics in Figures 16 and 17, MGO\nshows a similar trend with ﬁtting accuracy R 2 =0.815 when\ninterpolated using polynomial function than linear function\nas shown in Figures 18 and 19. The addition of KER to\nMGO shows similar values of viscosity with and without\nthe CP and KP component as seen through samples ‘A5’\nand ‘B5’ in Figure 18. An increase in the viscosity of the\nsample ‘M’ when compared to other samples can be seen\nin Figure 19. Similarly, the extrapolation of viscosity with\ntemperature shows that the samples ‘A5’ and ‘B5’ will have\na viscosity value between 23cSt to 31cSt with temperature\nincreased from 30 ◦C to ≥90◦C.\nD. CHEMICAL CHARACTERISTICS\n1) ACID NUMBER\nUpon adding KER to NEs and MO, the samples are heated\nwith the CP and KP components for 30 days. The acid\nnumber is measured according to ASTM [40] after 10 days\nand 30 days to estimate the depreciation of insulation with\nKER, CP, and KP. The acid number measurement results\nfor BAO and MGO are presented. The interpolation of\nthe data obtained between 0- to 30-days has best ﬁtted\nusing the polynomial function with accuracy R 2 = 1.\nFigure 20 and 22 show no change at 0% and 5% KER\nproportion without CP and KP components. Also, a less than\n4% increase in acid number is observed in sample A2 which\nhas 5% KER with CP and KP components. But the trend\nremains the same for the NE without KER proportion as seen\nin Figure 21. Increasing the KER proportion to 10% shows a\nnearly 10% increase in the acid number. The acid number of\nsample M shows almost shows a 30% increase in acid number\nafter 30 days of accelerated heating. The observation from\nﬁgure 21 is that CP and KP components in NE with 5% KER\nVOLUME 8, 2020 141117\nR. A. Rajet al.: Comparison of Ageing Characteristics of Superior Insulating Fluids\nproportion have consistency with three times lesser effect on\nsolid insulation and windings of the power transformer.\nFIGURE 20. Changes in acid number of SIF having BAO compared\nwith MO.\nFIGURE 21. Percentage rise in acid number of BAO based SIF over\n30 days.\nFIGURE 22. Changes in acid number of SIF having MGO compared\nwith MO.\nA similar interpolation trend and observation are seen from\nFigures 20 and 22, which show 5% KER with BAO and MGO\nwith CP and KP components have lesser ageing effects over\n30 days. The percentage rise in acid number from ﬁgure 23\nshows that NE with 5% KER has reduced the ageing of\nthe components (sample B2) than the NE sample without\nKER which shows an increase of acid number which doubles\nin 30 days.\nThis is because of the KER in BAO and MGO has\nhigher thermal conductivity than SIF without KER propor-\ntion. In addition to that, KER can protect oxidation of metal\nfrom thermal stresses that reduces the production of metal\noxides in the oil and thereby reducing the acidic components.\nHere also the sample ‘M’ shows the maximum rate of ageing\nwhen compared to other samples.\nFIGURE 23. Percentage rise in acid number of MGO based SIF over\n30 days.\nVI. DETERIORATION RATE OF DIELECTRIC\nCHARACTERISTICS OF OILS WITH LIFE EXPECTANCY\nThe investigation of SIFs samples with CP and KP compo-\nnents, the sample B2 and B5 has noticeable observations like\nhigher breakdown voltage strength and auto-ignition point,\nslower diminution of viscosity and acid number, better ther-\nmal conduction at low and high temperatures when compared\nto the Mineral Oil sample M that can be seen from Table 4 and\nFigures 24-28. Here a comparison of dielectric parameters\nof SIFs with MO is presented to show that the SIFs have\nextended life compared to MO in the presence of CP and\nKP. The SIF is subjected to online condition, usually where\nthe liquid insulation in power transformer will experience a\ntemperature ≥90◦C. The breakdown voltage of sample M\nfrom Figure 24 clearly shows the end of breakdown strength\nat the end of 90 days whereas the samples B2 and B5 show\na consistent strength. The breakdown voltage of SIF will\nincrease further due to the extension of (C-C) bonds due to\nthe temperature effect. Also, a steep rise in the kinematic\nviscosity is observed in Figure 25 for the sample M that\nalmost doubles its actual value. On the other hand, samples\nB2 and B5 show a 2 to 3 % rise in the kinematic viscosity\nfor the 90 days. The kinematic viscosity of SIFs samples ‘B2’\nand ‘B5’ reduces below 30cSt at ≥90◦C to take out more heat\nfrom the windings and core of the power transformer. The\nauto-ignition points of SIFs prove to be thermally stable to\nany electrical stresses that occur, and the thermal conductivity\nof SIFs increases with the higher relaxation distance of the\nviscosity matrix caused by ultrasonic waves and KER. The\nMO shows a poor thermal characteristic due to the improper\ndistancing of the Carbon chain in the oil matrix. From\nFigure 26 the thermal conductivity of samples B2, B5 and\nM in Figure 28 show that M has nearly lost the oil’s heat\ndissipation property in 90 days. But the samples B2 and\nB5 have a long way to lose its heat dissipation property,\nthereby exhibiting excellent breakdown strength and slow rise\nin viscosity. The auto-ignition point of samples B2, B5 and\nM from Figure 26 show a similar kind of trend as that in\nFigures 23 and 24. Here the auto-ignition point of sample\nM drops from 155 ◦C to 100 ◦C in 90 days which decreases\nthe rate of heat convection by the oil and thereby leads\nto transformer ﬁre or explosion. Comparatively, the auto-\n141118 VOLUME 8, 2020\nR. A. Rajet al.: Comparison of Ageing Characteristics of Superior Insulating Fluids\nTABLE 4. Comparison of degradation of selected SIFs containing 5% KER proportion with MO for 30 days and extrapolating to 90 days.\nFIGURE 24. Comparison of breakdown voltage of SIFs (B2, B5) with\nmineral oil (M) for 90 days.\nignition points of samples B2 and B5 are 225 ◦C and 290 ◦C\nrespectively and can perform extensive heat dissipation\nfunction.\nThe presence of CP and KP components does not alter the\nacid number of SIFs when compared to MO from Table 4.\nThe acid number has a steep rise for the sample M than\nB2 and B5 from Figure 27. The acid number of M from\nFigure 27 clearly indicates its increase in 90 days which\nincreases the hydroperoxides in oil and in turn increases\nthe oil kinematic viscosity. Although, the samples B2 and\nB5 show slower acid rise with the CP and KP com-\nponents measures like reﬁlling/reclamation of oil must\nbe taken before the acid number reaches 0.03mgKOH/g.\nLastly from Figure 28 thermal conductivity of samples is\nobserved to weaken after temperature effect for the 90 days.\nBut for the sample M, thermal conductivity is less than\nFIGURE 25. Comparison of kinematic viscosity of SIFs (B2, B5) with\nmineral oil (M) for 90 days.\nFIGURE 26. Comparison of auto-ignition point of SIFs (B2, B5) with\nmineral oil (M) for 90 days.\n0.13W/m-K which shows heat dissipation of the oil is not\nenough to maintain the transformer components in a healthy\nVOLUME 8, 2020 141119\nR. A. Rajet al.: Comparison of Ageing Characteristics of Superior Insulating Fluids\nFIGURE 27. Comparison of acid number of SIFs (B2, B5) with mineral oil\n(M) for 90 days.\nFIGURE 28. Comparison of thermal conductivity of SIFs (B2, B5) with\nmineral oil (M).\nstate. This is commonly observed in all the dielectric proper-\nties from Figures 24-28 where the samples B2 and B5 have\nmanaged to age slowly and for the sample M the ageing has\nbeen ceased in the 90 days. However, the sample M needs\nreplacement in the early stage when compared to the samples\nB2 and B5.\nVII. CONCLUSION\nThe tests conducted on the NEs and MO prove to support\nstrong decision to use NEs in power transformers. The NEs\nwith 0% KER proportion show initial performance without\nCP and KP components after accelerated heating test, but its\nreduction in strength is higher with the components of CP and\nKP. However, the NEs with 5% KER show a slower ageing\nrate of oils, most likely the SIFs after 30 days show a slower\nageing rate than the NEs without KER proportion. On the\nother hand, the SIFs with 10% KER show slightly higher\nrate of ageing but quite slower than MO. Upon evaluating the\nperformance of MO with/without CP and KP components it\nis observed that the highest ageing rate of the oil’s dielectric\ncharacteristics in the order of three to four times compared\nto SIFs (B2 and B5). With respect to auto-ignition point, the\nMO has reduced by 66.6%, kinematic viscosity has doubled,\nand acid number has surged to lead in 70 days. This shows\nMO have shown the highest extrapolated degradation rate\nwithin 90 days to reach 50% of strength. The breakdown\nvoltage of the NEs with 5% KER shows a better life span with\na reduction of 10% from the maximum level, whereas MO\nshows a life expectancy of less than 90 days. These results\nprove that KER as miscible dielectric not only as thinner\nmedium but exhibit better insulation over Copper Plate and\nbetter heat dissipation. Then again, KER in lower proportion\nsays as 5% would not affect the cellulose insulation Kraft\nageing and NEs can maintain a substantial level of acid\nnumber over several months. Hence ultrasonic waves relax\nthe molecular distance between carbon atoms in NEs, but the\naddition of KER has shown potential in viscosity relaxation\non NEs by rightly ﬁlling the voids of (C-C) gap. Thus, the\naddition will not allow reduction of viscosity in the mean-\ntime. The SIFs upon accelerated heating have shown superior\nperformance over MO and SIFs increase the life time of solid\ninsulations and internal parts of the power transformer. Based\non the overall results SIFs are proposed as suitable liquid\ninsulation for power transformer.\nREFERENCES\n[1] A. Raymon, S. Pakianathan, M. P. E. Rajamani, and R. Karthik, ‘‘Enhanc-\ning the critical characteristics of natural esters with antioxidants for power\ntransformer applications,’’ IEEE Trans. Dielectr. Electr. Insul., vol. 20,\nno. 3, pp. 899–911, Jun. 2013.\n[2] M. Maharana, S. K. Nayak, and N. Sahoo, ‘‘Karanji oil as a potential\ndielectrics liquid for transformer,’’ IEEE Trans. Dielectr. Electr. Insul.,\nvol. 25, no. 5, pp. 1871–1879, Oct. 2018.\n[3] M. Raﬁq, Y . Z. Lv, Y . Zhou, K. B. Ma, W. Wang, C. R. Li, and Q. Wang,\n‘‘Use of vegetable oils as transformer oils—A review,’’ Renew. Sustain.\nEnergy Rev., vol. 52, pp. 308–324, Dec. 2015.\n[4] I. R. M. Fairouz, M. Rabah, A. Djamil, and D. H. Klaus, ‘‘Reliability-\nbased preventive maintenance of oil circuit breaker subject to competing\nfailure processes,’’ Int. J. Performability Eng., vol. 9, no. 5, pp. 495–504,\n2013.\n[5] I. H. Reynolds and B. Fallou, ‘‘Dielectric liquids for capacitors–Review\nof the supply position in September 1978,’’ Electra, vol. 67, pp. 93–99,\n1979.\n[6] R. E. Gerdt, J. M. Crowley, and J. C. Chato, ‘‘Electrohydrody-\nnamic pumping of cable oil,’’ J. Electrostat., vol. 5, pp. 477–488,\nSep. 1978.\n141120 VOLUME 8, 2020\nR. A. Rajet al.: Comparison of Ageing Characteristics of Superior Insulating Fluids\n[7] G. E. Akhigbe, F. M. Adebiyi, and N. Torimiro, ‘‘Analysis and\nHazard assessment of potentially toxic metals in petroleum hydrocarbon-\ncontaminated soils around transformer installation areas,’’ J. Health Pol-\nlut., vol. 9, no. 24, pp. 1–18, 2019.\n[8] W. Wu, J. Xu, H. Zhao, Q. Zhang, and S. Liao, ‘‘A practical approach to\nthe degradation of polychlorinated biphenyls in transformer oil,’’ Chemo-\nsphere, vol. 60, no. 7, pp. 944–950, Aug. 2005.\n[9] M. Pompili, L. Calcara, A. Sturchio, and F. Catanzaro, ‘‘Natural\nesters distribution transformers: A solution for environmental and\nﬁre risk prevention,’’ in Proc. AEIT Int. Annu. Conf. (AEIT), Capri,\nItaly, 2016.\n[10] A. Raymon, S. Sakthibalan, C. Cinthal, R. Subramaniaraja, and\nM. Yuvaraj, ‘‘Enhancement and comparison of nano-ester insulating ﬂu-\nids,’’ IEEE Trans. Dielectr. Electr. Insul., vol. 23, no. 2, pp. 892–900,\nApr. 2016.\n[11] I. Hosier, A. Guushaa, E. Westenbrink, C. Rogers, A. Vaughan, and\nS. Swingler, ‘‘Aging of biodegradable oils and assessment of their suit-\nability for high voltage applications,’’ IEEE Trans. Dielectr. Electr. Insul.,\nvol. 18, no. 3, pp. 728–738, Jun. 2011.\n[12] O. H. A. Fernandez, I. Fofana, J. Jalbert, S. Gagnon, E. Rodriguez-Celis,\nS. Duchesne, and M. Ryadi, ‘‘Aging characterization of electrical insu-\nlation papers impregnated with synthetic ester and mineral oil: Correla-\ntions between mechanical properties, depolymerization and some chemical\nmarkers,’’IEEE Trans. Dielectr. Electr. Insul., vol. 25, no. 1, pp. 217–227,\nFeb. 2018.\n[13] R. Madavan and S. Balaraman, ‘‘Comparison of antioxidant inﬂuence on\nmineral oil and natural ester properties under accelerated aging condi-\ntions,’’IEEE Trans. Dielectr. Electr. Insul., vol. 24, no. 5, pp. 2800–2808,\nOct. 2017.\n[14] R. Karthik and A. Raymon, ‘‘Effect of silicone oxide nano parti-\ncles on dielectric characteristics of natural ester,’’ in Proc. IEEE Int.\nConf. High Voltage Eng. Appl. (ICHVE), Chengdu, China, Sep. 2016,\npp. 1–3.\n[15] T. Mariprasath and V . Kirubakaran, ‘‘A critical review on the character-\nistics of alternating liquid dielectrics and feasibility study on pongamia\npinnata oil as liquid dielectrics,’’ Renew. Sustain. Energy Rev., vol. 65,\npp. 784–799, Nov. 2016.\n[16] R. Maina, V . Tumiatti, M. Pompili, and R. Bartnikas, ‘‘Corrosive sulfur\neffects in transformer oils and remedial procedures,’’ IEEE Trans. Dielectr.\nElectr. Insul., vol. 16, no. 6, pp. 1655–1663, Dec. 2009.\n[17] F. Scatiggio, V . Tumiatti, R. Maina, M. Tumiatti, M. Pompili, and\nR. Bartnikas, ‘‘Corrosive sulfur in insulating oils: Its detection and cor-\nrelated power apparatus failures,’’ IEEE Trans. Power Del., vol. 23, no. 1,\npp. 508–509, Jan. 2008.\n[18] F. Scatiggio, V . Tumiatti, R. Maina, M. Tumiatti, M. Pompili, and\nR. Bartnikas, ‘‘Corrosive sulfur induced failures in oil-ﬁlled electrical\npower transformers and shunt reactors,’’ IEEE Trans. Power Del., vol. 24,\nno. 3, pp. 1240–1248, Jul. 2009.\n[19] S. M. Yusof, N. Hussin, and M. Isa, ‘‘Viscosity reduction of palm oil\nvia ultrasonic radiation,’’ Appl. Mech. Mater., vol. 785, pp. 315–319,\nAug. 2015.\n[20] M. Bakrutheen, M. W. Iruthayarajan, and A. Narayani, ‘‘Inﬂuence of\nultrasonic waves on viscosity of edible natural esters based liquid insu-\nlation,’’IEEE Trans. Dielectr. Electr. Insul., vol. 25, no. 5, pp. 1628–1635,\nOct. 2018.\n[21] S. M. Ghazani, D. A. Pink, M. Koutchekinia, J. R. Carney, R. Bond,\nW. Rakitsky, and A. G. Marangoni, ‘‘Engineering the viscosity and melting\nbehaviour of triacylglycerol biolubricants via interesteriﬁcation,’’ RSC\nAdv., vol. 5, no. 47, pp. 37180–37187, 2015.\n[22] M. B. Hocking, Handbook of Chemical Technology and Pollution Control,\n3rd ed. Victoria, BC, Canada: Elsevier, 2005.\n[23] P. M. Patterson, A. G. Kyne, M. Pourkashanian, A. Williams, and\nC. W. Wilson, ‘‘Combustion of kerosene in counterﬂow diffusion ﬂames,’’\nJ. Propuls. Power, vol. 17, no. 2, pp. 453–460, Mar. 2001.\n[24] R. Mustak and T. Ahmed, ‘‘Investigating the Effect of Blending Kerosene\nand,’’Int. J. Sci. Eng. Res., vol. 9, no. 2, pp. 1271–1276, 2018.\n[25] B. A. Akash, ‘‘Combustion and emission investigation of diesel fuel\nand kerosene blends,’’ Res. J. Appl. Sci., Eng. Technol., vol. 10, no. 6,\npp. 618–622, Jun. 2015.\n[26] T. K. Saha and P. Purkait, Eds., Transformer Ageing: Monitoring and\nEstimation Techniques. Singapore: Wiley, 2017, pp. 1–33.\n[27] A. Zaki, Principles of Corrosion Engineering and Corrosion Control.\nOxford, U.K.: Butterworth-Heinemann, 2006, pp. 609–646.\n[28] I. Nikischenko, R. D. Wright, and R. A. Marchan, ‘‘Improving the perfor-\nmance of LOX/kerosene upper stage rocket engines,’’ Propuls. Power Res.,\nvol. 6, no. 3, pp. 157–176, Sep. 2017.\n[29] R. Sanghi, ‘‘Chemistry behind the life of a transformer,’’ Resonance, vol. 8,\nno. 6, pp. 17–23, Jun. 2003.\n[30] L. Lundgaard, W. Hansen, and S. Ingebrigtsen, ‘‘Ageing of mineral oil\nimpregnated cellulose by acid catalysis,’’ IEEE Trans. Dielectr. Electr.\nInsul., vol. 15, no. 2, pp. 540–546, Apr. 2008.\n[31] M. Sorina, O. Gabriela, R. Elena, M. Virgil, V . Andreea, and L. Iosif,\n‘‘Corrosion of copper and carbon steel in some electrical purposes oils,’’\nRevista de Chimie-Bucharest-Original Ed., vol. 67, no. 9, pp. 1707–1712,\n2016.\n[32] I. Fofana, A. Bouaicha, M. Farzaneh, and J. Sabau, ‘‘Ageing behaviour of\nmineral oil and ester liquids: A comparative study,’’ in Proc. Annu. Rep.\nConf. Electr. Insul. Dielectr. Phenomena, Quebec, QC, Canada, Oct. 2008.\n[33] N. Lelekakis, J. Wijaya, D. Martin, and D. Susa, ‘‘The effect of acid accu-\nmulation in power-transformer oil on the aging rate of paper insulation,’’\nIEEE Elect. Insul. Mag., vol. 30, no. 3, pp. 19–26, May 2014.\n[34] A. Raymon and R. Karthik, ‘‘Reclaiming aged transformer oil with\nactivated bentonite and enhancing reclaimed and fresh transformer oils\nwith antioxidants,’’ IEEE Trans. Dielectr. Electr. Insul., vol. 22, no. 1,\npp. 548–555, Feb. 2015.\n[35] Insulating Liquids-Determination of the Breakdown Voltage at Power\nFrequency-Test Method, 3rd ed., Standard IEC60156, 2003.\n[36] Standard Speciﬁcation for Natural (Vegetable Oil) Ester Fluids Used in\nElectrical Apparatus, Standard ASTM D6871, 2003.\n[37] Standard Test Methods for Flash Point by Pensky-Martens Closed Cup\nTester, Standard ASTM D93, 2012.\n[38] Guide for Acceptance and Maintenance of Natural Ester Fluids in Trans-\nformers, IEEE Standard C.57.147, 2008.\n[39] Standard Test Method for Kinematic Viscosity of Transparent and Opaque\nLiquids (and Calculation of Dynamic Viscosity), Standard ASTM D445,\n2011.\n[40] Standard Test Method for Acid and Base Number by Color Indicator\nTitration, Standard ASTM D974, 2014.\nRAYMON ANTONY RAJ was born in India\nin 1987. He received the B.Eng. degree in elec-\ntrical and electronics engineering from P.S.R.\nEngineering College, India, in 2009, and the\nM.Eng. degree in high voltage engineering from\nNational Engineering College, India, in 2013.\nHe is currently pursuing the Ph.D. degree with\nthe Botswana International University of Science\nand Technology (BIUST), Palapye, Botswana.\nHe was an Honor recipient in UG and PG studies.\nHe joined Integrated Wireless Solutions Pte. Ltd., Noida, where he worked as\nan RF Engineer for a while. He has also worked as an Assistant Professor and\nHead In-charge of the Electrical and Electronics Engineering Department,\nKalasalingam Institute of Technology, Krishnankovil, India. He has pub-\nlished research papers in reputed Journals such as the IEEE TRANSACTIONS ON\nDIELECTRICS AND ELECTRICAL INSULATION, the Australian Journal of Electrical\nand Electronics Engineering, Springer Lecturer Notes, and so on. His areas\nof interest include transformer liquid insulation, as well as enhancement\ntheories of liquid dielectric and eco-friendly ﬂuids.\nVOLUME 8, 2020 141121\nR. A. Rajet al.: Comparison of Ageing Characteristics of Superior Insulating Fluids\nRAVI SAMIKANNU (Member, IEEE) received\nthe Ph.D. degree in electrical engineering from\nAnna University, Chennai, India. He is cur-\nrently working as an Associate Professor with\nthe Electrical, Computer, and Telecommunications\nEngineering Department, Botswana International\nUniversity of Science and Technology (BIUST),\nPalapye, Botswana. He is working on research\nprojects in power systems, energy systems, and\nsmart grid. He is actively engaged in teaching,\nresearch, and academic admiration. He has played a major role in setting\nup various laboratories for different electrical engineering courses and pre-\npared the department for accreditation from different quality agencies like\nNBA, AICTE, and UGC. He has a total teaching experience of 15 years\nat undergraduate and postgraduate levels. He has conducted a total of four\nNational Level Symposiums and a Science Exhibition. He has delivered\nspecial guest lectures in many international and national conferences. He is\nan active member of IDDS and has participated in different rural community\ndevelopment projects. He has published 60 research papers in International\nJournals. He has presented 50 papers in International and National Confer-\nences. He is a Life Member of the IE(I) and ISTE. He has received the Best\nPaper Award two times for his presentation. He is a Reviewer in the IEEE\nand other reputed journals.\nABID YAHYA (Member, IEEE) received the\nbachelor’s degree in electrical and electronic engi-\nneering, majoring in telecommunication, from\nthe University of Engineering and Technology,\nPeshawar, Pakistan, and the M.Sc. and Ph.D.\ndegrees in wireless and mobile systems from Uni-\nversiti Sains Malaysia, Malaysia. He is currently\nworking with the Botswana International Univer-\nsity of Science and Technology (BIUST), Palapye,\nBotswana. He has applied the combination of prac-\ntical and academic experience to a variety of consultancies for major corpo-\nrations. His career on an engineering path is rare among other researcher\nexecutives. He has many research publications to his credit in numerous\nreputable journals, conference papers, and book chapters. His recent four\nbooks, including Emerging Technologies in Agriculture, Livestock, and\nClimate (Springer, 2020), Mobile WiMAX Systems: Performance Analysis\nof Fractional Frequency Reuse (CRC Press |Taylor & Francis, 2019),\nSteganography Techniques for Digital Images, and LTE- A Cellular Net-\nworks: Multi-Hop Relay for Coverage, Capacity, and Performance Enhance-\nment (Springer International Publishing, July 2018 and January 2017) are\nbeing followed in national and international universities. He has received sev-\neral awards and grants from various funding agencies and supervised several\nPh.D. and master’s candidates. He is a Professional Engineer registered with\nthe Botswana Engineers Registration Board (ERB).\nMODISA MOSALAOSI (Member, IEEE) rece-\nived the B.Sc. degree in electrical engineering,\nand the M.Sc.Eng. and Ph.D. degrees in electronic\nengineering from the University of KwaZulu-\nNatal, Durban, South Africa, in 2009, 2015,\nand 2017, respectively. He is currently a Lec-\nturer with the Botswana International University\nof Science and Technology (BIUST). His research\ninterests include power line communication, RF\nand Microwave propagation, free-space optics,\nand green power technologies. He is a member of the IEEE-HKN Mu Eta\nChapter.\n141122 VOLUME 8, 2020",
  "topic": "Mineral oil",
  "concepts": [
    {
      "name": "Mineral oil",
      "score": 0.8665382862091064
    },
    {
      "name": "Transformer oil",
      "score": 0.6574329733848572
    },
    {
      "name": "Materials science",
      "score": 0.5610884428024292
    },
    {
      "name": "Kraft paper",
      "score": 0.5100944638252258
    },
    {
      "name": "Composite material",
      "score": 0.49499768018722534
    },
    {
      "name": "Copper",
      "score": 0.43527036905288696
    },
    {
      "name": "Polystyrene",
      "score": 0.4184388518333435
    },
    {
      "name": "Vegetable oil",
      "score": 0.4136947989463806
    },
    {
      "name": "Transformer",
      "score": 0.40669676661491394
    },
    {
      "name": "Chemistry",
      "score": 0.26364290714263916
    },
    {
      "name": "Metallurgy",
      "score": 0.25021010637283325
    },
    {
      "name": "Electrical engineering",
      "score": 0.12044164538383484
    },
    {
      "name": "Organic chemistry",
      "score": 0.11698713898658752
    },
    {
      "name": "Engineering",
      "score": 0.0
    },
    {
      "name": "Polymer",
      "score": 0.0
    },
    {
      "name": "Voltage",
      "score": 0.0
    }
  ]
}