{
    "title": "Zoo-Housed Chimpanzees Can Spontaneously Use Tool Sets But Perseverate on Previously Successful Tool-Use Methods",
    "url": "https://openalex.org/W3046875332",
    "year": 2020,
    "authors": [
        {
            "id": "https://openalex.org/A4209570892",
            "name": "Laura M. Bernstein‐Kurtycz",
            "affiliations": [
                "Lincoln Park Zoo",
                "Case Western Reserve University",
                "Cleveland Metroparks Zoo"
            ]
        },
        {
            "id": "https://openalex.org/A2166793389",
            "name": "Lydia M. Hopper",
            "affiliations": [
                "Lincoln Park Zoo"
            ]
        },
        {
            "id": "https://openalex.org/A2764424451",
            "name": "Stephen R. Ross",
            "affiliations": [
                "Lincoln Park Zoo"
            ]
        },
        {
            "id": "https://openalex.org/A1810465739",
            "name": "Claudio Tennie",
            "affiliations": [
                "University of Tübingen",
                "Lincoln Park Zoo"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2528434715",
        "https://openalex.org/W3032693158",
        "https://openalex.org/W1973432127",
        "https://openalex.org/W2062400579",
        "https://openalex.org/W2136080516",
        "https://openalex.org/W6777474812",
        "https://openalex.org/W1964881952",
        "https://openalex.org/W6858065579",
        "https://openalex.org/W2074028900",
        "https://openalex.org/W6648689777",
        "https://openalex.org/W2140550168",
        "https://openalex.org/W2259074155",
        "https://openalex.org/W2062490000",
        "https://openalex.org/W2316682762",
        "https://openalex.org/W2093351439",
        "https://openalex.org/W2028897480",
        "https://openalex.org/W1091745440",
        "https://openalex.org/W2002838896",
        "https://openalex.org/W2063770628",
        "https://openalex.org/W2100164632",
        "https://openalex.org/W1908604543",
        "https://openalex.org/W6642833565",
        "https://openalex.org/W2103462950",
        "https://openalex.org/W2044682864",
        "https://openalex.org/W2156185911",
        "https://openalex.org/W6605590862",
        "https://openalex.org/W2908910252",
        "https://openalex.org/W1984368981",
        "https://openalex.org/W2168356648",
        "https://openalex.org/W2039394779",
        "https://openalex.org/W2789463171",
        "https://openalex.org/W2033700888",
        "https://openalex.org/W899177196",
        "https://openalex.org/W2065940295",
        "https://openalex.org/W1999642235",
        "https://openalex.org/W2122200219",
        "https://openalex.org/W2946187295",
        "https://openalex.org/W2995763071",
        "https://openalex.org/W2530388343",
        "https://openalex.org/W2771610616",
        "https://openalex.org/W1974493129",
        "https://openalex.org/W2068858721",
        "https://openalex.org/W1556223197",
        "https://openalex.org/W2163339645",
        "https://openalex.org/W2611635135",
        "https://openalex.org/W6682673344",
        "https://openalex.org/W7015761883",
        "https://openalex.org/W7074183155",
        "https://openalex.org/W2151613345",
        "https://openalex.org/W2047302493",
        "https://openalex.org/W2178559658",
        "https://openalex.org/W6659083587",
        "https://openalex.org/W2141403362",
        "https://openalex.org/W1520036242",
        "https://openalex.org/W3092221452",
        "https://openalex.org/W2106583109",
        "https://openalex.org/W3176620241",
        "https://openalex.org/W6808331901",
        "https://openalex.org/W1644240647",
        "https://openalex.org/W2415236776",
        "https://openalex.org/W6638264623",
        "https://openalex.org/W2061167950",
        "https://openalex.org/W2582743722",
        "https://openalex.org/W2040487613",
        "https://openalex.org/W4234180827",
        "https://openalex.org/W2035201120",
        "https://openalex.org/W2122193570",
        "https://openalex.org/W2153418948",
        "https://openalex.org/W2808453012",
        "https://openalex.org/W3149308116",
        "https://openalex.org/W1972276901",
        "https://openalex.org/W136115829",
        "https://openalex.org/W1971206359",
        "https://openalex.org/W3008888867",
        "https://openalex.org/W2046813029",
        "https://openalex.org/W4388260183",
        "https://openalex.org/W207722603",
        "https://openalex.org/W1992559575"
    ],
    "abstract": "Tool use is documented in both wild and captive chimpanzees, but the creation of tool sets (e.g., two, or more, tools used in a sequence to solve a task), seems to be less common. This has raised the question of whether tool sets are a culture-dependent trait (CDT), or can be re-innovated independently, and thus fall within chimpanzees’ Zone of Latent Solutions (ZLS). To test this, we provided a group of zoo-housed chimpanzees with a novel task that mimicked the wild conditions, required a tool set to solve, and all necessary materials to do so. We therefore enhanced the necessary conditions for the tool-set behavior, but without providing demonstrations of tool-set manufacture or use. We baited an artificial termite mound with six ketchup-filled tubes, each with a 45-degree bend and with a cellophane barrier across the top. The chimpanzees needed a rigid tool to pierce the barrier and then a flexible tool to reach the reward. Overall, chimpanzees did use both tool types in order, thus demonstrating that this tool-set form is not a CDT. Yet, few attempts were successful, and the majority were not made using a tool set. This suggests that the behavioral pattern did not stabilize, which may have been due to unintentional difficulty created by the opacity of our task. Overall, our study showed that the form of tool sets can be within the ZLS of chimpanzees, but future studies need to determine what stabilizes the behavioral patterns in the wild.",
    "full_text": "ABC 2020, 7(3):288-309 \nAnimal Behavior and Cognition                                                                DOI: https://doi.org/10.26451/abc.07.03.03.2020 \n©Attribution 3.0 Unported (CC BY 3.0)  \n \n \n \n \n \n \nZoo-Housed Chimpanzees Can Spontaneously Use Tool Sets \nBut Perseverate on Previously Successful Tool-Use Methods \n \nLaura M. Bernstein-Kurtycz1,2,3,*, Lydia M. Hopper3, Stephen R. Ross3, and Claudio Tennie3,4 \n \n1Cleveland Metroparks Zoo, Cleveland, OH, USA \n2Case Western Reserve University, Cleveland, OH, USA \n3Lester E. Fisher Center for the Study and Conservation of Apes, Lincoln Park Zoo, Chicago, IL, USA \n4Department for Early Prehistory and Quaternary Ecology, Eberhard Karls University Tübingen, Tübingen, Germany \n \n*Corresponding author (Email: lmbk@clevelandmetroparks.com) \n \nCitation – Bernstein-Kurtycz, L. M., Hopper, L. M., Ross, S. R., & Tennie, C. (2020). Zoo-housed chimpanzees can \nspontaneously use tool sets but perseverate on previously successful t ool-use methods . Animal Behavior and \nCognition, 7(3), 288-309. doi: https://doi.org/10.26451/abc.07.03.03.2020 \n \nAbstract – Tool use is documented in both wild and captive chimpanzees, but the creation of tool sets (e.g., two, or \nmore, tools used in a seque nce to solve a task), seems to be less common. This has raised the question of whether \ntool sets are a culture -dependent trait (CDT), or can be re -innovated independently, and thus fall within \nchimpanzees’ Zone of Latent Solutions (ZLS). To test this, we p rovided a group of zoo -housed chimpanzees with a \nnovel task that mimicked the wild conditions, required a tool set to solve, and all necessary materials to do so. We \ntherefore enhanced the necessary conditions for the tool -set behavior, but without providi ng demonstrations of tool-\nset manufacture or use. We baited an artificial termite mound with six ketchup -filled tubes, each with a 45 -degree \nbend and with a cellophane barrier across the top. The chimpanzees needed a rigid tool to pierce the barrier and th en \na flexible tool to reach the reward. Overall, chimpanzees did use both tool types in order, thus demonstrating that \nthis tool-set form is not a CDT. Yet, few attempts were successful, and the majority were not made using a tool set. \nThis suggests that t he behavioral pattern  did not stabilize, which may have been due to unintentional difficulty \ncreated by the opacity of our task. Overall, our study showed that the form of tool sets can be within the ZLS of \nchimpanzees, but future studies need to determine what stabilizes the behavioral patterns in the wild.  \n \nKeywords – Chimpanzee, Tool set, Culture-dependent trait, Zone of Latent Solutions, Innovation \n \n \n  “The wealth of research on tool use and tool construction by chimpanzees and other nonhuman \nprimates has not addressed the fundamental distinction between understanding that tools work versus \nunderstanding why they work” (Povinelli, 2000, p. 3). \n \nIn the 20 years since the publication of Folk Physics for Apes: The Chimpanzee’s Theory of How \nthe World Work s, by Daniel Povinelli, much research effort has been dedicated to understanding how, \nwhy, and when both wild and captive chimpanzees use tools. Moreover, considerable effort has been \nexpended to reveal how chimpanzees learn (socially or individually) to m ake, modify, and use tools, and \nthe role of social information on that process. Social learning may also contribute to the coordination of \nindividual learning efforts within a population, namely the socially -facilitated adjustment (including \nstabilization) of frequencies of individual re -innovations (Tennie et al., in press,  2009, 2020). Special \nsocial learning mechanisms can also go beyond mere frequency increases – they can transmit the form of \nbehavior (or artifacts; Tennie et al., in press). It has been  suggested that non human great apes, and, in \n                                                                        Bernstein-Kurtycz et al. 289 \n \nparticular, chimpanzees, apply such form-transmitting social learning mechanisms, and that they use them \nin the wild to pass on some of their behavioral forms: passively through imitation (Whiten et al., 1999 , \n2009) and/or actively, via some variant of teaching (Musgrave et al., 2016, 2020; Sanz et al., 2004). \nHowever, the extent to which social learning allows the transmission of a behavioral form, or merely \namplifies and harmonizes the frequency of (individuall y-learned) behavioral forms within populations of \nwild apes is a topic of some debate (Bandini & Tennie, 2017; Tennie et al., in press, 2009, 2020; Whiten \net al., 2009). \nCulture is often defined as “group -typical behavior patterns shared by members of a co mmunity \nthat rely on socially learned and transmitted information” (Laland & Hoppitt, 2003, p. 151). Note that this \ndefinition already presupposes that form -copying social learning is required. Therefore, this definition \nfirst requires researchers to deter mine whether a species actually uses form -copying variants of social \nlearning before culture can be ascribed to it. Given that this has not yet been settled in wild apes, a more \nparsimonious definition of culture is useful, namely one that circumvents the need to identify the exact \nlearning mechanisms involved. Such a definition equates any variant of social learning (form -copying or \nmere frequency -increasing) with culture. Here, therefore, we adopt the minimal culture definition of \nNeadle et al. (2017, p. 12): “a behaviour can be considered cultural, if social learning (of any [variant], \nincluding learning from artifacts) plays any role at all in the form and/or the frequency of the behaviour \n(and/or any produced artifacts […]).” Thus defined, culture can b e inferred in many animals besides \nhumans (including great apes: McGrew, 1998; van Schaik et al., 2003; Whiten et al., 1999; monkeys: \nFragaszy et al., 2004; birds: Weir & Kacelnik, 2006; whales: Rendell & Whitehead, 2001; insects: Alem \net al., 2016; and fish: Helfman & Schultz, 1984).  \nA prerequisite for cumulative cultural forms is the ability to culturally pass on behavioral and/or \nartifact forms. Humans do this through a variety of mechanisms, including both passive social learning \nand active teaching (D ean et al., 2012). Humans not only copy the forms of the actions or physical \ncreations of others, but also modify – sometimes unintentionally – and potentially enhance those copied \nskills and artifacts, which can then again be copied (i.e., cumulative cult ure; Tomasello, 199 6). The \nupshot of this iterative process is behavioral or technological forms that could not be created by a single, \nculturally unconnected individual in their lifetime (Boyd & Richerson, 2005; Mesoudi & Thornton, 2018; \nTomasello et al., 1993). These cumulated forms are also known as culture-dependent traits (CDTs, Reindl \net al., 2017). Given that cumulative culture is said to be humankind’s niche (Boyd et al., 2011; Pinker, \n2010) – and understanding its source in humans has been ranked a s one of the top 125 questions of our \ntime (Anonymous, 2005) – understanding the origins and distribution of it has been the focus of extended \nresearch efforts.  \nWhile apes are certainly capable of various means of social learning (like so many other animals), \nthere is far less evidence that they engage in form -copying social learning, or that they use form -copying \nin a way that would enable them to build cumulatively on the forms of inventions of others in the way \nthat humans do (Dean et al., 2012; Horner & Whiten, 2005; Marshall-Pescini & Whiten, 2008; Tennie et \nal., in press, 2009). Thus, while human culture is dominated by CDTs, this is not the case for our closest -\nliving relatives, chimpanzees. The upshot is that there may be few, if any, examples of te chnology forms \nthat chimpanzees use that could not be independently re -innovated by a single individual, i.e., that are \nbeyond chimpanzees’ ‘Zone of Latent Solutions’ (ZLS; Tennie et al., in press, 2009). A “latent solution,” \ntherefore, is a behavior and/o r artifact form that does not require form -copying social learning \nmechanisms to occur. These forms are derived individually, although non -copying variants of social \nlearning can regulate and even stabilize latent solution frequencies in populations. Laten t solutions, \ntherefore, are the antithesis to form-copying and CDTs (Tennie et al., in press, 2020). \nIn the wild, chimpanzees use a wide variety of tools (Sanz et al., 2013), yet few, if any, of these \ntool-use forms may be examples of cumulative cultural learning. Indeed, a number of studies have shown \nthat form -naïve apes (i.e., those not previously exposed to the behavioral and/or tool forms), when \nprovided with the necessary raw materials, spontaneously and individually produced (re -innovated) the \nsame behavioral and tool forms shown by their wild counterparts, thereby demonstrating the lack of need \nfor any form -copying social learning for their production (e.g., Bandini & Tennie, 2017; Huffman & \n                                                                        Bernstein-Kurtycz et al. 290 \n \nHirata, 2004; Menzel et al., 2013; Neadle et al., 2017). No te that these studies are not completely devoid \nof all variants of social learning effects – by provisioning the subjects with the raw materials, these \nmaterials become “enhanced” (an effect that is part of various social learning mechanisms). But \nenhancement cannot and does not transmit behavioral and/or tool forms (Tennie et al., 2020). These forms \ncan be and are, therefore, re -innovated from scratch by naïve apes  – in similar form across diverse \npopulations – meaning that they fall within apes’ ZLS. As s uch, re -innovated behavioral and material \nforms (i.e., within the ZLS) do not require a form -copying social learning to be acquired – instead, non-\ncopying social learning (including enhancement) likely increases, and then maintains, these form \nfrequencies in those populations (Tennie et al., in press, 2009). \nThere are, however, a few chimpanzee tool forms that remain candidates for cumulative culture; \nfor example, those that – to human eyes at least – appear to be too complicated to be re -innovatable by \nnaïve chimpanzees. One example is nut-cracking behavior in primates, as it involves several objects used \nin the correct simultaneous configuration, orientation, and force (capuchins: Corat et al., 2016; Eschar et \nal., 2016; chimpanzees: Humle, 2002; Luncz et al., 2018). Another example consists of the different “tool \nset” forms used by some wild groups of chimpanzees. A tool set is defined as the use of more than one \ntype of tool, used in a specific sequential order, to achieve a goal (Brewer & McGrew, 1990; S anz et al., \n2010). Tool sets are technically cumulative in a loose sense of the term, in that the act involves the \nsequential combination of at least two tools, but it is unknown if this also means they represent \ncumulative culture of forms; whether they r equire form -copying (and thus whether they fall outside \nchimpanzees’ ZLS).  \nIt has been proposed that tool sets can be innovated only when individuals build upon an original \nfoundation of tool use (Sanz & Morgan, 2009). In other words, the full trait (two tools) may itself depend \non the existence of more basic traits first (one tool) and may be developed (perhaps purely individually) \nonly once the basic skill is in place. If this is the case, such tool sets would fulfill at least part of the \ndefinition of the ratchet effect (they might then fall into a grey zone of cumulative culture; Tennie et al., \nin press). However, in spite of the seeming complexity of tool sets, their use has been reported at over 10 \nsites in the wild (in Cameroon: Deblauwe et al., 2006; Muroyama, 1991; Central African Republic: Fay & \nCarroll, 1994; Hicks et al., 2005; Gabon: Boesch et al., 2009; McGrew & Rogers, 1983; Guinea: Koops et \nal., 2015; Nigeria: Sommer et al., 2012; Republic of Congo: Bermejo & Illera, 1999; Nishihara et \nal.,1995; Sanz & Morgan, 2007; Sanz et al., 2009; Uganda: Hashimoto et al., 2015) and this relatively \nhigh frequency suggests that tool-set behavior might be easier to individually acquire than first thought.  \nAn example of tool -set use can be found among the ch impanzees in the Goualougo Triangle \n(Republic of Congo). These chimpanzees have demonstrated the use of 22 different tools, and among \nthem, multiple distinct tool sets: one for perforating and dipping at ant nests; one for puncturing and \nfishing at subterranean termite nests; and one for perforating and fishing at epigeal termite nests; and they \nalso use multiple tools for pounding, lever opening, and fluid dipping at bee hives (Sanz & Morgan, 2007, \n2009; Sanz et al., 2004, 2010). The differences in the two  termite extraction tool sets are related to the \ndifferent types of termite mounds present in this area. To extract termites from an epigeal, or elevated, \nmound, the chimpanzees first use a perforating tool to open a tunnel through the outside of the mound . \nFor this tool, the chimpanzees use a variety of species of woody plant, usually a twig or short stick, which \nis near at hand and is procured when needed but is not carried to the mound. After opening a tunnel, the \nchimpanzee will then insert a fishing to ol. These tools are much more specific than the perforating tools; \nthey are long and flexible, and the chimpanzees make them from one of only a few specific species of \npliable plant. This form of the tool set differs from that which these chimpanzees use t o extract termites \nfrom subterranean mounds. For the latter, and in order to open an exit tunnel in a subterranean mound, the \nchimpanzees use a stout puncturing stick, almost always made of one specific species of plant \n(Thomandersia hensii ), which they of ten bring with them to the mound, sometimes from several \nkilometers away. After using sometimes considerable force to open a tunnel, chimpanzees will then use a \nlong, flexible fishing tool (the same as the tools used to fish termites from an elevated mound ) to capture \ntermites (Sanz et al., 2004). Because only the resultant tool -set behavior has been observed in the wild, \n                                                                        Bernstein-Kurtycz et al. 291 \n \nnot its potential two-step successive innovation, it is unknown whether form-naïve chimpanzees could re-\ninnovate the behavioral and/or artifact form.  \nIn order to test for tool set re -innovation, we extracted the relevant components of the behavioral \nand artifact forms from wild tool-set behavior. Re-innovation tests can provide subjects with enhancement \nof the raw materials, as this, in itself, does not necessarily provide information of the behavioral or artifact \nform (Bandini et al. , 2020). Here, we opted to provide subjects with ready -made, stick tools in two \nvariants – rigid and flexible – but we provided no demonstration of the require d sequence of their use. In \nthis sense, we wished to determine if task -naïve chimpanzees would spontaneously re -innovate the form \nof tool -set use when given the “perfect” environmental conditions, even in the absence of a social \ndemonstrator, as none of these chimpanzees had ever been asked to solve this specific problem before and \nas they had comparable levels of tool experience with single-tool tasks.  \nWe tested this with a group of zoo -housed chimpanzees that had previously acquired and \ndemonstrated prof icient one -step tool use in a simulated termite -fishing task using stick tools at an \nartificial termite mound in their exhibit (e.g., Hopper , Tennie et al., 2015; Lonsdorf et al., 2009) . To test \nour question, we adapted the chimpanzees’ artificial termite mound to create a novel tool -use task that \nrequired the chimpanzees to use a two -step tool set to obtain food rewards. From the start, we attempted \nto create conditions as similar to the wild as possible, but there were some differences that could not be \novercome, such as the age of the subjects (all adults) and some specifics of the form of the artificial \ntermite mound available to us (see below). Following the model of previous re -innovation tests (e.g., \nBandini & Tennie, 2017; Huffman & Hirata, 2004; Menzel at al., 2013; Neadle et al., 2017), we provided \nthe chimpanzees with the materials necessary to create the tool set but provided no demonstration of the \nrequired solution sequence. The tool set included a rigid  tool, needed to pierce a cellophane barri er (step \n1), analogous to the puncturing stick used in the wild, and a flexible tool, needed to bend around the curve \nin an out -of-sight tube to access the food reward (step 2), analogous to the flexible fishing tools used in \nthe wild. Both tools were therefore required and had to be used in a specific sequence (rigid first, flexible \nsecond) to obtain the food reward.  \nFor this study we had one key question: would the chimpanzees spontaneously use tool sets?  To \nanswer this, we investigated what tools the ch impanzees used at the mound,  whether the chimpanzees \ncould successfully pierce the barrier across the tubes to access the food reward, and if they did so by using \ntwo different tool types in succession. We also recorded whether they would attempt to modify  the tools. \nWe expected that the chimpanzees would spontaneously perform the first step of a tool set by inserting a \ntool, given that our tested chimpanzees were already familiar with this type of task, and that they would \nlikely attempt to modify the flex ible tools. We also expected the chimpanzees to pierce the barrier, given \nthat puncturing behavior appears to fall within the ZLS for chimpanzees (Motes -Rodrigo et al., 2019). \nFurthermore, if the chimpanzees learned that a rigid tool must precede a flexibl e tool, we would expect \nthat they would be more likely to use a rigid tool (step 1) before using a flexible tool (step 2), i.e., a tool \nset. More specifically, and as each hole’s barrier needed to be pierced only once in each session, we \npredicted that the chimpanzees would use rigid tools in every session, but that they would use them when \nfirst arriving at the mound and when first dipping at a hole, and thereafter would primarily use flexible \ntools. Thus, overall, we predicted that the chimpanzees would make a greater number of dips with flexible \ntools than rigid tools. We also expected that the number of times the food reward was obtained would \nincrease over the course of the study, (and perhaps, plateau eventually), if subjects gained proficiency at \nthe task.  \nIf the chimpanzees successfully used both tools, in order, to retrieve the reward, this would mean \nthat the form of tool -set use falls within the ZLS for chimpanzees. As we predicted that tool -set use is \nwithin chimpanzees’ ZLS, then we also predict ed that the chimpanzees would express this tool -use form \nspontaneously. If they did not, then this behavior may be an example of a CDT in wild chimpanzees. \nFurthermore, if the chimpanzees showed the correct order of tool use and if, additionally, the use o f a \ncorrect order increased and stabilized over time, we would further conclude that even in a somewhat \nartificial setting and setup and even in a group of adult -only chimpanzees, wild -type group patterns of \nbehavioral use can reappear. \n                                                                        Bernstein-Kurtycz et al. 292 \n \nMethod \nSubjects and Housing \n \nWe conducted this study at Lincoln Park Zoo in Chicago IL, USA, with a group of six \nchimpanzees housed at the Regenstein Center for African Apes. The subjects included two male and four \nfemale mother-reared chimpanzees (average age 24.5 years old , range = 15-30 years). They were housed \ntogether in an exhibit comprised of an indoor dayroom (408.4 m 2), with both naturalistic and functional \nelements, including nests, climbing trees, ledges, vines, and mulch substrate, and an outdoor enclosure \n(1603.3 m2), which could be accessed directly from the indoor dayroom. Within their dayroom was an \nartificial termite mound (described in “Materials”) that these chimpanzees always had access to and all \nmembers of the group were proficient at using a single tool to extract food from the mound.  \nMaterials \n \nWe took advantage of the artificial termite mound that was built into the chimpanzees’ home \nexhibit (Figure 1 A, see Lonsdorf et al., 2009 , for details of its design and construction). The artificial \ntermite mound was designed to be “baited” by the zookeepers from the underside, by attaching PVC tubes \nfilled with a viscous food reward (e.g., ketchup or mustard) to eight points that aligned with holes in the \nmound’s surface through which the chimpanzees could dip fo r food. Given the design of the termite \nmound, keepers could bait the mound without having to remove the chimpanzees from the exhibit. \nTypically (i.e., for enrichment purposes, see below), straight tubes (4.5 cm diameter, 33 cm length) with a \nfood reward in the bottom were attached to the mound, and the chimpanzees could use long sticks as tools \nto dip through holes on the surface of the termite mound while within their enclosure (Figure 1A).  \nThe artificial termite mound was originally used to study this g roup’s acquisition of tool use and \n“termite-fishing” (Hopper, Tennie et al., 2015; Lonsdorf et al., 2009). Over the years, the mound has been \nused to study other questions, including how chimpanzees adjust to changing resource availability and \ntheir food preferences in a social context (Bonnie et al., 2012; Calcutt et al., 2014; Finestone et al., 2014). \nIn all of these studies, the tubes used to bait the mound were straight and of uniform length (33 cm), but \nthe presentation of the task varied in either the  number of baited tubes available to the chimpanzees, the \ndays on which baiting occurred, or the reward in the tubes. In addition to its use in experimental studies, \nthe mound was baited regularly as part of the chimpanzees’ enrichment schedule. In all previous contexts, \nthe chimpanzees used natural, wood tools that they were either given by keepers or that they had to find \nby themselves from within their outdoor yard (see Hopper, Tennie et al., 2015 for a detailed description of \ntool materials with which t he chimpanzees had prior experience). We ran  our current study during the \nwinter when subjects had minimal access to their outdoor exhibit, and therefore a reduced ability to find \ntheir own tools, because we wanted to control the tool types the chimpanzees  had access to in test \nsessions (i.e., the two tool forms we provided).  \nWe modified the setup of the termite mound to require the chimpanzees to use two tools, used in \na specific order, to solve the task (i.e., a tool set). We did this by using tubes with  a 45-degree bend in the \nmiddle (4.5-cm diameter, 69-cm total length) and to which we added a cellophane barrier across the top \n(Figure 1B). We baited the tubes with a viscous food reward (ketchup) and provided the chimpanzees \nwith two types of novel tools : rigid and flexible. In order to reach the ketchup in the bottom of the tube, \nthe chimpanzees first had to use the rigid tool to pierce the cellophane barrier and then a long, flexible \ntool, which could bend around the angle in the tube when inserted, to reach the food reward. The rigid \ntools we provided to the chimpanzees were 0.6 m long PVC rods (1 cm in diameter, Figure 1 C) and the \nflexible tools were 1.2 m long strips of cardboard (2 cm in width, Figure 1 C). The long flexible tool had \nto remain long an d unmodified, as if it was shortened too much, it would no longer be long enough to \nreach the ketchup at the bottom of the tube. \n \n \n                                                                        Bernstein-Kurtycz et al. 293 \n \nFigure 1 \n \nThe Test Materials we Presented to the Chimpanzees to Assess their Ability to Use a Two-Step Tool Set \n  \n \n \n \n \nNote. A) The artificial termite mound inside the chimpanzee enclosure. The six holes , A-F, are marked for clarity, B) The six \nbent tubes with cellophane barrier attached. We placed ketchup in the bottom white cap of the tubes, C) Examples of the flexible \ncardboard and rigid PVC tools we provided to chimpanzees (one of each pictured), and D) A diagram of the inside of the mound, \ndemonstrating how the tubes were attached. \n                                                                        Bernstein-Kurtycz et al. 294 \n \nProcedure \n \nWe ran ten total sessions, 30 min each, with two sessions per week each starting a round 11 am. \nThe study lasted five weeks, across February and March 2015. Prior to the beginning of each session, \nLBK filled the bottom of the six bent tubes with ketchup up to a depth of approximately 5 cm and covered \nthe tops with a cellophane barrier (a  plastic gift bag, unopened, resulting in two layers of stiff cellophane \ncovering the top of the tubes). Each tub e was labeled with a letter that matched a labeled hole in the \nartificial termite mound. Keepers attached the six tubes to the matching holes i n the underside of the \nmound (Figure 1D), and then provided the chimpanzees with 24 tools of each type (48 total) by pushing \nthe tools through a mesh barrier at the perimeter of the chimpanzees’ exhibit, 10 m from the termite \nmound. This resulted in four t ools per type per chimpanzee to ensure that all tools of any one type could \nnot be monopolized by a single chimpanzee. We provided a new set of 48 tools at the start of each \nsubsequent test session but did not provide the chimpanzees with any additional to ols during sessions. \nThe termite mound had eight holes in its surface. In the first session, we baited all eight holes, but found \nthat two were difficult to view from the public floor. In the following nine sessions, therefore, we baited \nthe six visible ho les, labeled A-F (Figure 1A). At the end of each session, a keeper returned the tubes to \nLBK, who examined the cellophane barrier and recorded which tubes had been pierced. Using two Sony \nHandycams (HDR -CX160; Sony, Tokyo, Japan), we recorded the chimpanze es’ behavior for 30 min, \nstarting from the moment the tools landed in the exhibit, by filming them at the termite mound from two \nlocations outside the exhibit (see “Coding”).  \nCoding  \n \nThe artificial termite mound can be clearly seen from the public floor of the Regenstein Center \nfor African Apes via the floor -to-ceiling windows, allowing for easy viewing of the chimpanzees’ \nbehavior within test sessions (Figure 1 A). We filmed all sessions from two angles from the public floor \nand LH and LBK narrated each session during filming as a guide for later coding. After the completion of \nall ten test sessions, we coded the chimpanzees’ behavior from the videos into Microsoft Excel. Inter-rater \nreliability was conducted using one full, 30 -min video, fully coded by bo th LBK and a volunteer coder \n(CD), who was naïve to the aims of our study but familiar with this group of chimpanzees. There was \nhigh intra-class correlation (ICC; Shrout & Fliess, 1979) for all measures, including number of dips made \nwith a rigid tool (IC C = .985, p < .001), number of dips made with flexible tools (ICC = .957, p = .002), \npresence of each individual at or within one meter of the mound when a focal made a dip (Hank (ICC = \n.921, p = .010), Optimus (ICC = .973, p = .001), Kathy (ICC = .955, p = .003), Nana (ICC = .977, p = \n.001), Cashew (ICC = .918, p = .011), Chuckie (ICC = .978, p < .001)), and number of tool modification \nbehaviors (ICC = .829, p = .020). Following reliability, the rest of the coding was completed by CD.  \nGeneral Engagement with the Task \n \nWe coded every time a chimpanzee inserted a tool into a hole, inspected the tool, or modified a \ntool (Table 1), along with the identity of the focal animal performing the action and the identity of any \nchimpanzees within 1 m of the focal. Fur thermore, for all tool interactions, we coded whether the tool \nused by the focal was the “rigid” or “flexible” form (Table 1). (While we had aimed to limit the \nchimpanzees’ access to other tool materials during test sessions, occasionally the chimpanzees u sed other \nitems as tools. Thus, in four sessions, four chimpanzees found sticks within their exhibit that were sharp \nenough to pierce the cellophane and/or flexible enough to bend in the tubes and reach the ketchup. When \nthe chimpanzees used such sticks, w e coded those tools as “other tool.”) For each tool insertion behavior \n(“dip”), we also recorded which specific hole the chimpanzee inserted their tool into. Additionally, for all \nbehaviors, we noted the session number and the time stamp of when the action was performed.  \n \n                                                                        Bernstein-Kurtycz et al. 295 \n \nTable 1 \n \nOperational Definitions of Coded Behaviors.  \n \nBehavior Definition \nBout A dipping bout consisted of any number of dips made by a single chimpanzee at a single hole with no interruption. \nA bout began when a chimpanzee dipped once into a hole using any tool and ended when the chimpanzee dipped a \ntool into another hole or left the mound.  \nDip Chimpanzee inserted tool into mound. Dips could be successful or unsuccessful. \nSuccessful dip – Chimpanzee extracted tool with ketchup visib le on the tip. For each successful dip, we knew that \nthe cellophane barrier must have been pierced, but we could not determine whether it was that particular dip or a \nprevious one in which the cellophane was pierced. \nUnsuccessful dip  – Chimpanzee extracted tool with no ketchup visible on the tip. We were unable to determine \nwhether that the cellophane barrier was not pierced, or if the dipping action pierced the cellophane but that the \ndipping technique the chimpanzee was using did not allow them to obtai n ketchup. Specifically, we could not \ndetermine if unsuccessful dips did not produce food because the length of the tool was too short, there was a lack \nof ketchup in the tube, the chimpanzee did not insert the tool far enough into the tube, or for some ot her reason. \nGiven this uncertainty as to the causal mechanism of successful and unsuccessful dips, we have coded them in the \nmost parsimonious way, i.e., simply whether the chimpanzee obtained food or not. When we were uncertain if a \ndip was successful or not, it was listed as unsuccessful. \nModify tool Chimpanzee modified tool, using either their mouth or hands. This could be any of the three tool types (rigid, \nflexible, other). \nChew – Chimpanzee inserted tip of tool into mouth, gnawed on end, deforming or fraying the tool. \nBend – Chimpanzee used hands to bend tool but not break tool. \nBreak – Chimpanzee broke, ripped, or snapped tool with either mouth or hands. \nSample tool Chimpanzee inserted tool into mouth for one to three seconds (i.e., to taste f or ketchup, but did not chew or \nmodify). Ketchup may or may not have been visible on the tip of the tool. \nTool-set sequence A tool-set sequence was defined as at least one dip using a rigid tool, followed by one or more dips using flexible \ntools. Tool -set sequences only occurred within bouts – when a chimpanzee switched to another hole, both the \nsequence and the bout ended (i.e., if a chimpanzee dipped into a hole with a rigid tool, then dipped twice with a \nflexible tool, they had used a tool -set sequence. However, if for their third flexible dip they turned and dipped into \na different hole, the previous bout and sequence would be over, and that dip would be the beginning of a new bout \nin a new hole). \nNote. For each of these behaviors, in addition to the described modifiers, we also recorded what type of tool the chimpanzee used \n(rigid, flexible, or other), the identity of the chimpanzee using the tool, and the identity of any other chimpanzees within 1 m of \nthe tool using chimpanzee. \nSuccessful Tool Use \n \nWe considered a dip to be successful if the chimpanzee that inserted a tool into a hole was able to \nprocure ketchup with the tool (Table 1). Therefore, each time a chimpanzee completed a dip, we coded \nwhether it was successful or not, irrespective of tool type. Furthermore, we also recorded the total number \nof holes that the chimpanzees punctured each session. Due to the opacity of the termite mound, we were \nunable to determine when during the session a given tube was pierced. For each test session, therefore, we \ncoded holes as being successfully pierced based on our examination of the cellophane barrier on each tube \nat the end of each session (as described in the “Procedure” section above).  \n \n                                                                        Bernstein-Kurtycz et al. 296 \n \nAnalysis \nGeneral Considerations and Definitions \n \nWe completed all analyses using R statistical software, version 3.6.1 (R Core Team, 2019). For \nanalysis of the chimpanzees’ dipping behavior and potential use of tool -set sequences (see below), we \nconsidered each chimpanzee’s dipping behavior by bouts. We defined a “bout” to begin when a \nchimpanzee first dipped a tool (of either type) into a hole and to end when they switched to a different \nhole or left the mound. Thus, within a single test session, each subject could complete zero, one, or \nmultiple bouts of interaction wit h the termite mound. Each chimpanzee’s bouts were comprised of dips, \nwhich were classed as either successful or unsuccessful (see Table 1 for detailed definitions) and could \nthemselves be considered as part of tool-set sequences or not.  \nSpecifically, we d efined a tool -set sequence as any time a chimpanzee made a dip with a rigid \ntool and then made a dip with a flexible tool, one or more times, within a single bout (i.e., in succession at \na single hole). We considered any number of flexible dips that follow ed a rigid dip within a bout to be \npart of that tool-set sequence, and the sequence ended when the chimpanzee dipped again with a rigid tool \nor left that hole. Bouts could contain more than one tool-set sequence. Furthermore, successful dips could \noccur within tool-set sequences and outside of them. For example, if a chimpanzee arrived at a hole and \nbegan dipping with a rigid tool one or more times, then picked up a flexible tool and dipped several times \nand found ketchup on the end of the tool, that succes sful dip occurred within a tool -set sequence. \nHowever, if a chimpanzee arrived at a hole and began dipping with a flexible tool first, and one of those \ndips was successful, that successful dip occurred outside of a tool-set sequence. This could happen if t he \nbarrier at that hole had been previously pierced, or if a chimpanzee was able to pierce a barrier with a \nflexible tool (which was not intended by design).  \nGeneral Engagement with the Task \n \nTo assess the chimpanzees’ general engagement with the task, we  calculated the total number of \ndips each chimpanzee completed per session, the tools they used for each, and the number of times the \nchimpanzees modified the tools. To determine if there was a correlation between the chimpanzees’ \ndipping rate and session number (i.e., to evaluate if their dipping proficiency increased with time and if \nthey showed an increased preference for either tool type over time), we used a Pearson’s Product-Moment \ncorrelation, using the cor.test function, for the number of dips made with both rigid and flexible tools. We \nalso used a Pearson’s Product -Moment correlation to see if there were changes in the chimpanzees’ rate \nof tool modification across sessions.  \nSuccessful Tool Use \n \nFirst, we calculated the total number of dips for each  chimpanzee by session and the proportion \nthat were successful. Second, to examine whether the chimpanzees’ likelihood of success increased within \nsessions, we used the cor.test function to correlate chimpanzees’ within -session bout number and the \nnumber of successful dips they made within that bout (irrespective of whether they constituted a tool -set \nsequence or not). \nWe also wanted to explore whether a chimpanzee’s success predicted their behavior after the \ncompletion of a dip, namely whether they sampled  the tool (i.e., put the tool in their mouth) and/or \nwhether they moved to a new hole after a dip. To consider tool sampling rates we compared the best fit of \ngeneralized linear mixed models (GLMMs) with “tool type,” “session number,” “number of observing \nchimpanzees,” “minute in session ,” and “dip success” as fixed factors; we included “subject ID” and \n“hole” as random factors in all models. We scored the outcome variable (whether chimpanzees put the tip \nof the tool in their mouth after a dip or not) as a binary variable. Similarly, to explore what influenced the \n                                                                        Bernstein-Kurtycz et al. 297 \n \nchimpanzees to leave a hole where they were dipping and move to a new hole on the termite mound, we \ncompared the best fit of GLMMs that contained “tool type ,” “session number,” “number of observing  \nchimpanzees,” and “dip success” as fixed factors; we included “subject ID” and “hole” as random factors \nin all models. Again, we scored the outcome variable (whether the chimpanzee moved to a new hole or \nnot) as a binary variable. For both models, given o ur binary response variables, and the combination of \nfixed and random predictor variables, we analyzed our data using a binomial generalized linear mixed \nmodel. We fit this model using the Laplace approximation method via the ‘glmer’ function in the ‘lme4’  \npackage (Bates et al., 2012). We compared Akaike information criterion (AIC) values to compare model \nfits and we used Z -tests and likelihood ratio tests (LRTs) to compare the relative contribution of fixed \nfactors to the best model (Bates et al., 2012). \nTool-Set Sequences \n \nWithin each test session, when a chimpanzee first arrived at a hole, they could either use a rigid \nor flexible tool. As the termite mound was opaque, the chimpanzees could not visually determine when \nthey arrived at a hole for the first time within a session whether the barrier had been pierced. Therefore, \nthe most parsimonious solution, if the chimpanzees adopted the use of tool -set sequences, would be to \nfirst dip with a rigid tool. Thus, we used a Pearson’s Product -Moment correlation, using the cor.test \nfunction, for the proportion of first dips the chimpanzees made with rigid tools across sessions. We also \nlooked at the proportion of dips chimpanzees made with rigid tools for the first dip at each hole (max = 6) \nwithin each session. We used a Pearson’s Product-Moment correlation, using the cor.test function, for the \nproportion of first dips at each hole made using a rigid tool.  \nGiven that our definition of a tool-set sequence was for a chimpanzee to dip first with a rigid tool \nand then to dip one or more times with a flexible tool at the same hole, it is likely that the chimpanzees \nwould use flexible tools more frequently than rigid tools to make dips overall. To determine if \nchimpanzees chose flexible tools more often than would be expected by chance, we used a Pearson’s Chi-\nsquare test for count data, using the chisq.test function.  \nBeyond these inferences about the chimpanzees’ tool-set use, we also calculated the total number \nof (within-bout) tool-set sequences each chimpanzee completed per session.  \nResults \nGeneral Engagement with the Task \n \nIn total, over the course of all 10 sessions, the chimpanzees dipped a total of 1,728 times. All \nchimpanzees participated in every session, and all dipped successfully three times or more, with wi de \nindividual variation in numbers of dips and bouts (Figure 2, Table 2). The total number of dips that the \nchimpanzees made over the course of the 10 sessions first increased but then decreased. There was also \nwide variation in the length of time that each individual engaged with the task (Figure 3). Chimpanzees \nattempted to modify their tools an average of 49.6 times per session ( SD: 16.89, Table 3). The two most \ncommon modifications included chewing on the end of the flexible tools (37.90%) and shortenin g the \nflexible tools by biting or tearing them to make them shorter (53.83%). This second behavior often \nresulted in flexible tools that were too short to reach to the bottom of the tubes. The frequency of \nmodifications was significantly positively correla ted w ith session number (Pearson’s product moment \ncorrelation: r(8) = .67, p = .033, Table 4). \n \n \n \n \n \n                                                                        Bernstein-Kurtycz et al. 298 \n \nFigure 2 \n \nMean Number o f Dips Ma de per Chimpanzee per Session, and Mean Number o f Successful Dips Made per Chimpanzee per \nSession Error Bars Show the Standard Error of the Mean \n \nTable 2 \n \nIndividual Variation in Bouts, Sequences, Total Dips, and Success Within Sequences \n \n \nTotal tool-set \nsequences \nProportion of \nrigid dips that \nled to tool sets \nSuccessful \ndips in \nsequences \nSuccessful \ndips outside \nof sequences \nTotal \ndips \nTotal \nbouts \nMean bouts \nper session \n(SD) \nMean dips \nper bout \n(SD) \nCashew 16 0.14 12 3 276 76 7.6 (3.80) 3.75 (1.51) \nChuckie 31 0.23 28 22 517 84 8.4 (3.72) 6.23 (1.80) \nHank 3 0.17 0 3 85 31 3.1 (2.17) 2.98 (1.91) \nKathy 23 0.28 3 8 331 76 7.6 (3.50) 5.04 (2.24) \nNana 14 0.23 3 35 327 60 6.0 (2.28) 6.00 (2.26) \nOptimus 10 0.15 0 2 192 64 6.4 (3.35) 3.23 (1.23) \nAverage \n(SD) 16.17 (9.83) 0.29 (0.06) 7.67 (10.89) 12.17 \n(13.47) \n288.00 \n(145.86) \n65.17 \n(18.89) n/a n/a \nSuccessful Tool Use \n \nIn the first seven sessions, the chimpanzees pierced every hole (i.e., every cellophane barrier on \neach of the six tubes was pierced by the end of the session), but in session 8, they pierced only five holes \nand, in sessions 9 and 10, they pierced only 4 holes. Despite their overall success in piercing the holes, the \nchimpanzees did not extract ketchup from every pierced tube. Collectively, the chimpanzees successfully \ndipped in three holes in sessions 3, 4, 5, 7, and 8, but successfully from only one hole in sessions 6  and 9 \n                                                                        Bernstein-Kurtycz et al. 299 \n \n(in sessions 1, 2, 10, they made no successful dips). Session 6 in general was a low point for dips, bouts, \nand sequences (Figures 4 and 5). \n \nFigure 3  \n \nMean Length of Time That Each Chimpanzee Engaged with the Task Within a Session Across a ll 10 Sessions Error Bars Show \nthe Standard Error of the Mean. \n \nTable 3 \nAll Tool Modification Behaviors Made by the Chimpanzees Across all 10 Sessions \nType of Modification  \n(followed by tool type) Total count Percent of total \nBend (rigid) 13 2.62% \nBend (flexible) 1 0.20% \nChew (rigid) 11 2.22% \nChew (flexible) 188 37.90% \nChew (other) 9 1.81% \nBreak with hands (rigid) 1 0.20% \nBreak with hands (flexible) 36 7.26% \nBreak with mouth (rigid) 1 0.20% \nBreak with mouth (flexible) 231 46.57% \nBreak with mouth (other) 4 0.81% \nOther modification (flexible) 1 0.20% \nTotal 496  \n \nTable 4 \n \nNumber of Modifications Per Session and Frequency of Modifications*  \nSession  Number of modifications per session Frequency (number of modifications per minute) \n1  28 0.93 \n2  27 0.90 \n3  41 1.37 \n4  57 1.90 \n5  65 2.17 \n6  26 0.87 \n7  68 2.27 \n8  62 2.07 \n9  51 1.70 \n10  71 2.37 \n* Number of modifications per session divided by 30 minutes \n                                                                        Bernstein-Kurtycz et al. 300 \n \nFigure 4 \n \nMean Number of Successful Dips That Occurred Within a Tool-Set Sequence per Chimpanzee per Session and Mean Number of \nTool-Set Sequences Made per Chimpanzee per Session Error Bars Show the Standard Error of the Mean \n \n \nFigure 5 \n \nThe Mean Number of Dips (Successful a nd Unsuccessful Combined) Made with Each Tool Type per Chimpanzee per Session \nError Bars show the Standard Error of the Mean \n \n \nOf the 1,728 dips that the chimpanzees made across all 10 sessions, 119 (6.89%) were successful. \nAll successful dips were made with either a flexible tool (92.00%) or an “other” tool (8.00%). As \nintended by our study design, no successful dips were ever made with a rigid tool. Following the \nchimpanzees’ general engagement with the task, the number of successful dips that they made increased \nover the first few sessions and then decreased, with an average of 1.98 successful dips per session.  \nReflecting the variation across chimpanzees in their engagement with the task, there was also \nindividual variation in success; the highest performing chimpanzees dipped the most, used the tool -set \nsequence the most, and mad e the most successful dips, though they differed in success rate (Chuckie: 50 \nsuccessful dips, success rate 9.67%; and Nana: 38 successful dips, rate 11.62%). In addition to \nconsidering the chimpanzees’ success across sessions, we also considered it within sessions and found \n                                                                        Bernstein-Kurtycz et al. 301 \n \nthat there was a negative correlation between within -session bout number and number of successful dips \nthe chimpanzees made (Pearson’s product moment correlation: r(390) = -.10, p = .043). \nAfter a chimpanzee had inserted a tool into the  mound and extracted it, they did one of four \nthings: they reinserted the tool into the same hole (continuing the bout), they inserted their tool into a \ndifferent hole (starting a new bout), they sampled the tool, by putting the end into their mouth, and t hen \nreinserted the tool back into the same hole (continuing the bout), or they sampled the tool and then \ninserted their tool into a different hole (ending the bout and starting a new one). The chimpanzees \nsampled the tool after all (119/119) successful dip s bu t only after 47.23% (760/1609) of unsuccessful \ndips. However, the best model that described the chimpanzees’ tool -sampling behavior included only \n“tool type,” “session number,” and “number of observers” as predictors (Table 5). The rate of the \nchimpanzees’ tool-sampling behavior varied significantly by the type of tool the chimpanzees used (LRT, \nχ2(2) = 80.544, p < .001), the number of observers present for each dip (LRT, χ2(1) = 6.111, p = .013), \nand by session number (LRT, χ2(1) = 7.015, p = .008). Sp ecifically, chimpanzees were more likely to \nsample the flexible tool, when more conspecifics were present, and during the later sessions. Considering \nwhat predicted the chimpanzees’ decision to insert their tool into a new hole after a dip, model \ncomparison re vealed that the best model included both “dip success” and “number of observers” as \npredictors (Table 6). Whether a chimpanzee would switch holes varied significantly by whether the dip \nwas successful (LRT, χ2 (1) = 135.980, p < .001) and the number of observers present as they made the \ndip (LRT, χ2(1) = 6.478, p = .011). Specifically, we found that chimpanzees were more likely to switch to \na new hole if they were not successful on their previous dip and when more conspecifics were present. \n \nTable 5 \n \nMixed Effects Logistic Regression Models and Associated AIC Values, for the Models Predicting Sampling the Tool \nFactors Included in Model AIC Model Rank \nTool + Session + Observers 2239.2 1 (best) \nTool + Session 2243.3 2 \nTool + Observers 2244.2 3 \nTool + Minute in session + Session 2244.8 4 \nTool 2250.0 5 \nTool + Minute in session 2251.4 6 \nObservers 2314.5 7 \nObservers + Session 2315.8 9 \nMinute in session 2324.2 9 \nSession 2327.2 10 (worst) \n \nTable 6 \nMixed Effects Logistic Regression Models and Associated AIC Values, for the Models Predicting Switching Holes \nFactors Included in Model AIC Model Rank \nSuccess + Observers 1544.8 1 (best) \nTool + Success + Observers 1548.7 2 \nObservers 1549.3 3 \nTool + Observers + Session + Success 1550.3 4 \nSuccess + Tool 1550.6 5 \nObservers + Session 1551.0 6 \nTool + Observers 1552.9 7 \nTool + Observers + Session 1554.4 8 \nSession  1677.4 9 \nTool + Session 1677.5 10 \nTool  1678.3 11 \nSuccess 1678.8 12 \nSuccess + Session 1678.9 13 \nSuccess + Tool 1679.7 14 (worst) \n                                                                        Bernstein-Kurtycz et al. 302 \n \nTool-Set Sequences \n \nChimpanzees demonstrated the correct tool -set sequence (first rigid, then flexible within a single \nbout) a total of 97 times and an average of 16.17 (SD = 8.97) per session. The proportion of rigid dips that \nthe chimpanzees made to the number of tool-set sequences observed (i.e., the number of times at least one \ndip with a flexible tool followed a dip with a rigid tool) ranged from 0.14 – 0.28 (Table 2). Furthermore, \n38.66% (46) of the total number of su ccessful dips that the chimpanzees made were within tool -set \nsequences (Table 2), the remainder were made with tools that the chimpanzees dipped into presumably \npreviously pierced holes, which had been pierced earlier in the session by themselves or anothe r group \nmember.  \nConfirming our predictions associated with tool -set use, a Pearson’s Chi -square rev ealed that \nchimpanzees chose the flexible tools significantly more often than would be expected due to chance (χ 2 \n(1) = 296.350, p < .001). Furthermore , rigid tool use decreased over the course of the ten sessions: the \nnumber of dips chimpanzees made with rigid tools was significantly negatively correlated with session \nnumber (Pearson’s product moment correlation: r(8) = -.81, p = .005). In contrast, flexible tool use \nincreased with time: the number of dips chimpanzees made with flexible tools was significantly positively \ncorrelated with session number (Pearson’s product moment correlation: r(8) = .77, p = .009; Figure 5). On \naverage, the chimpanzees made dips with a rigid tool 47.30 times per session ( SD = 34.11) and with a \nflexible tool 117.10 times per session (SD = 38.54).  \nThe proportion of first dips the chimpanzees made at a hole using a rigid tool was negatively \ncorrelated with session number (Pearson’s product moment correlation: r(58) = -.60, p < .001). A similar \npattern was seen within sessions: the proportion of rigid tools used as the first tool by each chimpanzee in \na session was negatively correlated with session number (Pearson’s product moment correlation: r(8) = -\n.83, p = .003). This suggests that, as the study went on, chimpanzees were more likely to use the flexible \ntools first when arriving at a hole, rather than the rigid tools.  \nDiscussion \nWe presented a group of chimpanzees with a novel task requiring a tool set and all the materials \nnecessary to solve the task. We hypothesized that if t he ability to re -innovate a tool -set sequence was \nwithin chimpanzees’ ZLS, then the group would spontaneously re -innovate using tool-set sequences with \nthe materials provided, in a similar manner (i.e., order) to wild chimpanzees. While the chimpanzees were \nalready familiar with using single tools and dipping them into the artificial termite mound in their exhibit \nto extract food, they were not familiar with the two novel tool types we provided, nor with the need to use \ntwo tools in correctly ordered succes sion to obtain food. When first presented with the task, the \nchimpanzees immediately began exploring the novel tools and dipping the tools into the mound and all \nsix of the chimpanzees were observed to use a tool -set sequence one or more times. In total, t he \nchimpanzees were recorded to perform a tool -set sequence 97 times, and, on average, a fifth of the times \nthe chimpanzees used a rigid tool, they subsequently dipped with a flexible tool (i.e., used a tool set). \nMore generally, every chimpanzee participated in every session, although participation time decreased in \nthe later sessions and there was wide variation in the number of dips made by the individual chimpanzees. \nA 15-year-old female (Chuckie) was the most prolific participant and also the youngest, most subordinate \nmember of the group. The fact that she was the most successful, both in participation and in number of \nsuccessful dips across all sessions and rewards obtained (50 successful dips, representing 42.02% of all \nrewards) fits the pattern seen in other zoo studies and in the wild in which young, subordinate individuals \nhave the most reason to innovate, but, perhaps due to their subordinate status, their innovations influence \nthe rest of the group less (Biro et al., 2003; Hopper , Kurtycz et al., 2015; Kendal et al., 2015; Matsuzawa \n& Yamakoshi, 1996).  \n Not only did the chimpanzees engage with the task, but they also successfully extracted food \nfrom the termite mound, by piercing the cellophane and then obtaining food using the flexible tools, an d \n                                                                        Bernstein-Kurtycz et al. 303 \n \nwe recorded nearly 100 instances of tool -set use, with all individuals using a tool set at least one time. \nFrom a re -innovation standpoint, one can infer that subjects did innovate the form (Bandini & Tennie, \n2017; Bandini et al., 2020) – here, the sequence of the tool set: first using the rigid tool to pierce the hole \nand then using a flexible tool one or more times to extract food . Successful dips were slightly more likely \nto occur earlier within sessions, and rather than a linear relationship between s ession number and dip \nsuccess, we saw an increase and then subsequent decrease in the number of successful dips the \nchimpanzees made over the ten sessions, with no successful dips made in the last session. Additionally, \nwe acknowledge that we observed the chimpanzees successfully puncturing the cellophane and extracting \nketchup with a flexible tool (not intended by our experimental design) two times.  \nHowever, over the course of the study, not only did we observe a decrease in the number of dips \nchimpanzees made with rigid tools across sessions (as predicted), we also observed a decrease of rigid \ntools used at the beginning of sessions and as the first tools used at a hole (counter to our prediction). This \nmay in part be attributed to the fact that the chimpanzees were only ever successful with the flexible tools \n(by design) and so the use of this tool was reinforced more strongly than were the rigid tools. This pattern \ncould also be attributed to the fact that the chimpanzees could not see the barrier (the b arrier was hidden \nfrom sight), and thus they could not see the causal purpose for the rigid tool. Taken together, these \nfindings suggest that, while at least one chimpanzee did innovate the tool -set form, the behavior did not \nstabilize. \n While we did not see tool-set use increase or even stabilize over time, all six chimpanzees did use \na tool-set sequence and four chimpanzees successfully obtained food using this approach. This shows that \nthe form of this tool -set behavior is principally within chimpanzees’  ZLS as we predicted. Therefore, the \nform of a tool set is not a CDT ( sensu Reindl et al., 2017). However, we acknowledge that the frequency \nof this behavioral form might be under the influence of social learning in the wild (Tennie et al., in press). \nGiven that the frequency of the correct tool order declined over time in our study, there may be some \nother factor(s) responsible for stabilizing the use of the tools in the correct order over time in the wild that \nwe cannot replicate in a captive setting (see  Boesch, 2020, this issue). Indeed, success rates of termite \nextraction in the wild seem to be higher than we saw here for liquid extraction (McGrew & Marchant, \n1999). However, as in the wild, a number of social and asocial factors may influence the expres sion of a \nbehavior, and next we consider the elements that may have influenced, or inhibited, the expression of the \ntool-set form in the group of chimpanzees we studied here.  \nIndividual Learning and the Social Environment \n \nOur study was conducted with the  chimpanzees in a social setting, mimicking wild conditions. \nHowever, once the first chimpanzee had re -innovated the use of a tool set, we cannot be certain whether \nsubsequent individuals to do so were primed by their observations of them, in this case, Ch uckie in \nsession 1 (sensu Fiore et al., 2020). Indeed, the ZLS hypothesis predicts that non -copying forms of social \nlearning likely influence the frequency at which latent solutions are expressed. Yet, we did not see tool -\nset use become habitual. We argue that an absence of (trained) social models is unlikely to be the missing \nfactor in our study as to why tool set use did not become habitual. Indeed, the use of the correct tool order \ndid appear – in each tested individual – and resulted in success, creatin g a potential source of social \nlearning for others. Yet the correct order, while present, was not often realized, and most of the \nindividuals largely abandoned the activity by the later sessions, suggesting that they did not have a causal \nunderstanding of the task.  \nWith regard to individual learning, our task might have been less naturally structured, or guided, \nthan may be the case the wild. Although we created a task that required both tools in correct order to be \nsolved – our task did not require both t ools and this correct order once it was partly solved. After initial \npiercing and dipping, rewards were left in the task that remained sufficient to be exploited . This is clear \nfrom the fact that many successful dips were made at previously pierced locatio ns by subjects other than \nthe initial piercer – without the need to use the entire tool set anymore. This was an outcome of the type \nof artificial termite mound setting available to us, where the contained viscous reward was a long -term \n                                                                        Bernstein-Kurtycz et al. 304 \n \nexploitable resource. That is, our task may not compare in this respect well to the wild, where a pierced \nhole may be (at least temporarily) exploited beyond a rewarding level – guiding the production of further \npierced holes and discouraging the re-use of others’ pierced holes.  \nIn the wild, feeding at termite mounds is often solitary or performed in mother -offspring dyads \n(Lonsdorf, 2006). We tested the chimpanzees in a group setting, which changes the learning environment \nand the chimpanzees’ access to the resources (both the mound and the tools). Indeed, in our study we \nfound that a higher number of conspecifics present on the mound contributed to the likelihood of an \nindividual switching to a new hole and the likelihood of an individual sampling the tool. Whereas this \ngroup has previously shown the ability to take turns when accessing a reduced number of baited holes at \nthe termite mound (Calcutt et al., 2014), it appears that when more holes are baited, and they have the \noption to switch holes, this is influenced by the number of conspecifics near them. The tool sampling may \nhave been reinforced by the occasional successful dips or may have been a form of response facilitation in \nreaction to other chimpanzees sampling their tools (Hoppitt et al., 2007).  \nTermite Mound Design and Causal Understanding \n \nOne limitation of our study relates to the physical properties of the artificial termite mound that \nwe co-opted for this experiment, which may have impacted the chimpanzees’ individual learning of the \ntask. In the wild, and in our study, chimpanzees cannot see the reward inside the mounds. However, in the \nwild, chimpanzees create their own hole in the mound itself  (with the first tool; Sanz & Morgan, 2007); \nthus, they see the causal interplay between the use of the rigid tool, t he piercing action, and the change in \nstate of the termite mound (that a hole appears). In our study, unlike in the wild, tool insertion points were \npre-drilled, and did not change in location across test sessions. In addition to this, the opacity of the \nartificial termite mound meant that the chimpanzees could not see if or when they had pierced the barrier \n(or indeed, that there was a barrier to pierce), which is in stark contrast to the outcome of piercing and \npuncturing actions in a wild setting. Thus, it may not have been so causally obvious that the chimpanzees \nneeded to pierce a barrier to access the food. These combined factors might have resulted in a lack of \nenvironmental channeling of the correct order of tool use in each tested individual (or eve n the need for \ntwo tools). In other words, in the wild, it might make more sense (provide more positive feedback) to \nmake a new hole first and then use a flexible tool, rather than work at a hole first made, but then deserted, \nby others. However, it may al so be that chimpanzees might require much longer individual learning time \nto overcome their tendency to skip the rigid tool in their approach (from their previous years of \nexperience using rigid wooden tools, this group of captive chimpanzees may be more likely to perseverate \nin using such tool forms than flexible ones – discussed further below). Future studies could test for the re-\noccurrence and stabilization of the correct sequence over an extended period of testing time. \nPrior Personal Experience and Conservatism \n \nAnother factor to consider is the chimpanzees’ prior experience with the task: it is possible that \nwe inadvertently made the task too difficult by co -opting a task at which this group was already highly \nproficient. When chimpanzees are presente d wi th a novel form of a familiar task, they can act \nconservatively (Hrubesch et al., 200 9) and it may be that they are unable to adjust their strategies in \nresponse to a change in a (very) familiar task. Furthermore, not only did we require the chimpanzee s to \nadopt a novel strategy to solve a familiar task, but the task changes were unknown to the chimpanzees \n(we changed the form of the tubes into which they had to dip, which were out of view of the \nchimpanzees). The only change visible to the chimpanzees were the novel tools we provided. Recent \nwork has suggested that, when apes understand the causal demands of a task, they are not conservative, \nbut can flexibly respond to changes in task design (Jacobson & Hopper, 2019). Thus, the chimpanzees’ \nextensive e xperience solving the task in one way (using one tool), with tubes that are considerably \nshorter, could have inhibited their ability to innovate a tool-set form, and yet we did not find this. Despite \n                                                                        Bernstein-Kurtycz et al. 305 \n \ntheir prior experience with the task, and their lack of information about task changes, the chimpanzees did \nexhibit a novel approach to solving this modified task (i.e., the adoption of a tool -set form). Furthermore, \nfor wild chimpanzees that use tool sets, it is proposed that they first learned to use one tool  and then, \nperhaps via the ratchet effect, augmented the technique by using two tools in correct succession. In sum, \nthis suggests that they are not conservative ( sensu Hrubesch et al., 2009), but can adopt novel, more \nefficient strategies when needed (see also Jacobson & Hopper, 2019).  \nIn our study it is possible that the chimpanzees may have more consistently adopted tool -set use, \nhowever, if they had been provided with greater information and visual access about the causal mechanics \nof the task. Povinel li ( 2000) argued that “the principles of chimpanzee folk physics are founded upon \nthings that can be directly perceived, including action sequences that can be generated from imagination \nor held as visual memory” (p. 307). In an example that is different, but not completely unrelated to the \ndemands of our task, Povinelli tested chimpanzees on their ability to construct or deconstruct a tool to use \non a particular apparatus (also see Price et al., 2009; Vale et al., 2016). In one version of Povinelli’s task,  \nthe chimpanzees needed a straight tool (the “deconstructed” version) to reach the reward, and in another, \nthey need a hook tool (the “constructed” version) to reach the reward. The chimpanzees in the study \nstruggled to create the appropriate tool. More re cently, Bania et al. (2009) replicated this experiment and \nfound that the enculturated chimpanzees they worked with were highly successful at the same task. Bania \nand colleagues postulated that this was for several reasons, including the fact that the encu lturated \nchimpanzees had extensive experience with tools during early development (0 -3 years of age). The \nchimpanzees Povinelli tested, on the other hand, began using tools after this critical developmental stage, \nsimilar to the chimpanzees we tested. This  highlights the important interplay between personal \nexperience, rearing history, and causal understanding when interpreting chimpanzees’ tool use and \nproblem-solving success. Related to this is the chimpanzees’ ineffectual modifications of the flexible \ntools.  \nWhile the chimpanzees in our study could not modify the rigid tools that we provided, they could \nmake modifications to the flexible, cardboard tools, and indeed they did so frequently. The majority of \nthese modifications consisted of the chimpanzees fraying or shortening the tools. In the past, these same \nchimpanzees have been shown to modify stick tools for use in this termite mound in similar ways \n(Hopper, Tennie et al., 2015), suggesting that tool modification (including frayed, brushed tools) was \nalready in their repertoire. Indeed, wild chimpanzees also typically modify tools in this manner (Bermejo \n& Illera, 1999; Sanz et al., 2009). In the aforementioned replication of one of Povinelli’s (2000) \nexperiments, Bania et al. (2009) found that chimpan zees were more successful at the tool task when the \nrequired tool modification involved deconstructing a tool, rather than constructing one, and pointed out \nthat wild chimpanzees typically modify tools by taking them apart, rather than assembling them (although \nsee Shumaker et al., (2011) for examples of other kinds of ways in which chimpanzees have been \nreported to modify tools). In our study, and in contrast to the group’s prior experience with tool \nmodification (see Hopper, Tennie et al., 2015), shortening the tools quickly resulted in tools that were too \nshort to reach the reward and so modification made the tools non-functional. Since the chimpanzees could \nnot see the tubes, they did not have any way of assessing what was happening to their short tools (i.e., that \nthey fell into the tubes and out of reach). The high rate of tool modifications (an average of nearly 50 \nmodifications per 30-minute session) may potentially reflect perseveration on a previously successful, but \nnow ineffectual, approach (Hoppe r, Tennie et al., 2015 ) or instead may be a mark of the chimpanzees’ \nfrustration. This is also in line with an increase in modifications in later sessions in tandem with a \ndecreased engagement with the task more generally. \n \nConclusion \n \nWe provided zoo-housed chimpanzees with a novel task, two types of tools resembling wild tools \nin functionality, and a short period of time to demonstrate innovation of a correctly ordered two step tool -\nset behavior. Chimpanzees in the wild perform this behavioral sequence, b ut it remains to be seen if this \nsequence is a culture -dependent trait, or a skill that falls within the ZLS of chimpanzees. The \n                                                                        Bernstein-Kurtycz et al. 306 \n \nchimpanzees we tested did use the tools to extract rewards, and did use the tools in the required order, \nshowing that the form of this tool set (its correct sequence) falls generally within the ZLS of chimpanzees. \nThus, our methods not only allowed us to ask questions about chimpanzee learning and culture, but also \nto provide them with the opportunity to exhibit species -typical be havior through the provision of an \nenriching paradigm. However, our study was different from wild conditions in a number of ways and the \ncorrect sequence also did not solidify, (at least not in the time frame of our study). Future studies will be \nneeded to determine what leads to a stabilizing of the behavioral sequence in the wild. \nAcknowledgments \nWe thank Jennifer Vonk and Michael Beran for inviting us to participate in this special issue \ncelebrating the 20th anniversary of the publication of Povinelli’s Folk Physics for Apes. This research was \nfunded by the Leo S. Guthman Fund and, at the time of writing, LMH was supported by the Lincoln Park \nZoo Women’s Board. We would like to thank Maureen Leahy, Michael Brown-Palsgrove, and the animal \ncare staff at the  Regenstein Center for African Apes for their help and support of this project. We would \nalso like to thank Callum Duffield for diligently coding all of the videos. CT received funding via the \nERC STONECULT project during the writing of the manuscript. The  project STONECULT has received \nfunding from the European Research Council (ERC) under the European Union’s Horizon 2020 research \nand innovation programme (grant agreement No. 714658). \nReferences \nAlem, S., Perry, C.  J., Zhu, X., Loukola, O. J., Ingraham, T ., S øvik, E., & Chittka, L. (2016). Associative \nmechanisms allow for social learning and cultural transmission of string pulling in an insect.  PLoS \nBiology, 14, e1002564. \nAnonymous. (2005). So much more to know. Science 309, 78–102. \nBandini, E., Motes-Rodrigo, A., Steele, M. P., Rutz, C., & Tennie, C. (2020). Examining the mechanisms \nunderlying the acquisition of animal tool behaviour. Biology Letters, 16, 20200122. \nBandini, E., & Tennie, C. (2017). Spontaneous reoccurrence of “scooping”, a wild tool -use behaviour, i n na ïve \nchimpanzees. PeerJ, 5, e3814. \nBania, A. E., Harris, S., Kinsley, H.  R., & Boysen, S.  T. (2009). Constructive and deconstructive tool modification \nby chimpanzees (Pan troglodytes). Animal Cognition, 12, 85-95. \nBates, D., Maechler, M., & Bolker, B. ( 2012). lme4: Linear mixed ‐effects models using S4 classes  [Computer \nsoftware]. R package (version 0. 999999‐0). http://CRAN.R‐project.org/package1⁄4lme4  \nBermejo, M., & Illera, G. (1999). Tool-set for termite-fishing and honey extraction by wild chimpanzees in the Lossi \nForest, Congo. Primates, 40, 619-627. \nBiro, D., Inoue -Nakamura, N., Tonooka, R., Yamakoshi, G., Sousa, C., & Matsuzawa, T. (2003). Cultural \ninnovation and transmission of tool use in wild chimpanzees: Evidence from field experiments. Animal \nCognition, 6, 213–223. \nBoesch, C. (2020). Listening to the appeal from the wild. Animal Behavior and Cognition, 7, 257–263. \nBoesch, C., Head, J., & Robbins, M.  M. (2009). Complex tool sets for honey extraction among chimpanzees in \nLoango National Park, Gabon. Journal of Human Evolution, 56, 560–569. \nBonnie, K., Ross, S.  R., & Lonsdorf, E.  V. (2012). Flexibility and persistence of chimpanzee ( Pan troglodytes)  \nforaging behavior in a captive environment. American Journal of Primatology, 74, 661–668. \nBoyd, R., & Richerson, P. J. (2005). The origin and evolution of cultures. Oxford University Press. \nBoyd, R., Richerson, P. J., & Henrich, J. (2011). The cultural niche: Why  social learning is essential for human \nadaptation. Proceedings of the National Academy of Sciences, 108, 10918–10925. \nBrewer, S. M., & McGrew, W. C. (1990). Chimpanzee use of a tool -set to get honey. Folia Primatologica, 54, 100–\n104. \nCalcutt, S. E., Lonsdorf, E. V., Bonnie, K.  E., Milstein, M.  S., & Ross, S.  R. (2014). Captive chimpanzees share \ndiminishing resources. Behaviour, 151, 1967–1982. \nCorat, C., Siqueira, J., & Ottoni, E. B. (2016). Sequential organization and optimization of the nut -cracking behavior \nof semi-free tufted capuchin monkeys (Sapajus sp.) Primates, 57, 113–121.  \n                                                                        Bernstein-Kurtycz et al. 307 \n \nDean, L.  G., Kendal, R.  L., Schapiro, S.  J., Thierry, B., & Laland, K.  N. (2012). Identification of the social and \ncognitive processes underlying human cumulative culture. Science, 335, 1114–1118. \nDeblauwe, I., Guislain, P., Dupain, J., & van Elsacker, L. (2006). Use of a tool ‐set by Pan troglodytes troglodytes to \nobtain termites ( Macrotermes) in the periphery of the Dja Biosphere Reserve, Southeast Cameroon. \nAmerican Journal of Primatology, 68, 1191–1196. \nEschar, Y., Izar, P., Visalberghi, E., Resende, B., & Fragaszy, D. (2016 ). When and where to practice: Social \ninfluences on the development of nut -cracking in bearded capuchins ( Sapajus libidinosus ). Animal \nCognition, 19, 605–618. \nFay, J.  M., & Carroll, R.  W. (1994). Chimpanzee tool use for honey and termite extraction in Cent ral Africa. \nAmerican Journal of Primatology, 34, 309–317. \nFinestone, E., Bonnie, K.  E., Hopper, L.  M., Vreeman, V. M., Lonsdorf, E. V., & Ross, S.  R. (2014). The interplay \nbetween individual, social, and environmental influences on chimpanzee food choices.  Behavioural \nProcesses, 105, 71–77. \nFiore, A.  M., Cronin, K.  A., Ross, S.  R. & Hopper, L.  M. (2020). Food cleaning by Japanese macaques: Innate, \ninnovative, or cultural? Folia Primatologica, 91, 433-444. \nFragaszy, D., Izar, P., Visalberghi, E., Ottoni, E.  B., & de Oliveira, M.  G. (2004). Wild capuchin monkeys ( Cebus \nlibidinosus) use anvils and stone pounding tools. American Journal of Primatology, 64, 359–366. \nHashimoto, C., Isaji, M., Koops, K., & Furuichi, T. (2015). First records of tool -set use for ant -dipping by Eastern \nchimpanzees (Pan troglodytes schweinfurthii ) in the Kalinzu Forest Reserve, Uganda. Primates, 56, 301–\n305. \nHelfman, G. S., & Schultz, E.  T. (1984). Social transmission of behavioural traditions in a coral reef fish.  Animal \nBehaviour, 32, 379–384.  \nHicks, T. C., Fouts, R. S., & Fouts, D.  H. (2005). Chimpanzee ( Pan troglodytes troglodytes ) tool use in the Ngotto \nforest, Central African Republic. American Journal of Primatology, 65, 221–237. \nHopper, L.  M., Kurtycz, L.  M., Ross, S.  R., & Bonn ie, K.  E. (2015). Captive chimpanzee foraging in a social \nsetting: A test of problem solving, flexibility, and spatial discounting. PeerJ, 3, e833. \nHopper, L.  M., Tennie, C., Ross, S.  R., & Lonsdorf, E.  V. (2015). Chimpanzees create and modify probe tools \nfunctionally: A study with zoo‐housed chimpanzees. American Journal of Primatology, 77, 162–170. \nHoppitt, W., Blackburn, L., & Laland, K.  N. (2007). Response facilitation in the domestic fowl. Animal Behaviour, \n73, 229–238. \nHorner, V., & Whiten, A. (2005). Causal knowledge and imitatio n/emulation switching in chimpanzees ( Pan \ntroglodytes) and children (Homo sapiens). Animal Cognition, 8, 164–181. \nHrubesch, C., Preuschoft, S., & van Schaik, C. (2009). Skill mastery inhibits adoption of observed alternative \nsolutions among chimpanzees (Pan troglodytes). Animal Cognition, 12, 209-216. \nHuffman, M. A., & Hirata, S. (2004). An experimental study of leaf swallowing in captive chimpanzees: Insights \ninto the origin of a self-medicative behavior and the role of social learning. Primates, 45, 113–118. \nHumle, T. (2002). The tool repertoire of Bossou chimpanzees. In T. Matsuzawa, T. Humle, & Y. Sugiyama (Eds.) \nThe chimpanzees in Bossou and Nimba. (p. 61–71). Springer. \nJacobson, S. L. & Hopper, L.  M. (2019). Hardly habitual: Chimpanzees and gorillas sh ow flexibility in their motor \nresponses when presented with a causally-clear task. PeerJ, 7, e6195. \nKendal, R., Hopper, L.  M., Whiten, A., Brosnan, S.  F., Lambeth, S.  P., Schapiro, S.  J., & Hoppitt, W. (2015). \nChimpanzees copy dominant and knowledgeable in dividuals: Implications for cultural diversity. Evolution \nand Human Behavior, 36, 65–72. \nKoops, K., Schöning, C., McGrew, W. C., & Matsuzawa, T. (2015). Chimpanzees prey on army ants at Seringbara, \nNimba Mountains, Guinea: Predation patterns and tool use c haracteristics. American Journal of \nPrimatology, 77, 319–329. \nLaland, K. N., & Hoppitt, W. (2003). Do animals have culture? Evolutionary Anthropology: Issues, News, and \nReviews: Issues, News, and Reviews, 12, 150–159. \nLonsdorf, E.  V. (2006). What is the ro le o f mothers in the acquisition of termite -fishing behaviors in wild \nchimpanzees (Pan troglodytes schweinfurthii)? Animal Cognition, 9, 36–46. \nLonsdorf, E. V., Ross, S. R., Linick, S. A., Milstein, M. S., & Melber, T.  N. (2009). An experimental, comparati ve \ninvestigation of tool use in chimpanzees and gorillas. Animal Behaviour, 77, 1119–1126. \nLuncz, L. V., Sirianni, G., Mundry, R., & Boesch, C. (2018). Costly culture: Differences in nut -cracking efficiency \nbetween wild chimpanzee groups. Animal Behaviour, 137, 63–73. \nMarshall-Pescini, S., & Whiten, A. (2008). Chimpanzees ( Pan troglodytes) and the question of cumulative culture: \nAn experimental approach. Animal Cognition, 11, 449–456. \n                                                                        Bernstein-Kurtycz et al. 308 \n \nMatsuzawa, T., & Yamakoshi, G. (1996). Comparison of chimpanzee material culture between Bossou and Nimba, \nWest Africa. In A. E. Russon, K. A. Bard, & S. T. Parker (Eds.), Reaching into thought: The minds of the \ngreat apes (p. 211–232). Cambridge University Press. \nMcGrew, W.C., & Rogers, M.E. (1983). Brief report: Chimpanzees, tools, and termites: New record from Gabon. \nAmerican Journal of Primatology, 5, 171-174. \nMcGrew, W. C. (1998). Culture in nonhuman primates? Annual Review of Anthropology, 27, 301–328. \nMcGrew, W.  C., & Marchant, L.  F. (1999). Laterality of hand use pays of f in  foraging success for wild \nchimpanzees. Primates, 40, 509–513. \nMcGrew, W. C., & Rogers, M.  E. (1983). Brief report: Chimpanzees, tools, and termites: New record from Gabon. \nAmerican Journal of Primatology, 5, 171–174. \nMenzel, C., Fowler, A., Tennie, C. , & Call, J. (2013). Leaf surface roughness elicits leaf swallowing behavior in \ncaptive chimpanzees ( Pan troglodytes) and bonobos ( P. paniscus), but not in gorillas ( Gorilla gorilla) or \norangutans (Pongo abelii). International Journal of Primatology, 34, 533–553. \nMesoudi A., & Thornton, A. (2018). What is cumulative cultural evolution? Proceedings of the Royal Society B, \n285, 20180712. \nMotes-Rodrigo, A., Majlesi, P., Pickering, T. R., Laska, M., Axelsen, H., Minchin, T.  C., Tennie, C., & Hernandez -\nAguilar, R.A. (2019). Chimpanzee extractive foraging with excavating tools: Experimental modeling of the \norigins of human technology. PloS One, 14, e0215644. \nMuroyama, Y. (1991). Chimpanzees' choices of prey between two sympatric species of Macrotermes in the Campo \nAnimal Reserve, Cameroon. Human Evolution, 6, 143–151. \nMusgrave, S., Lonsdorf, E., Morgan, D., Prestipino, M., Bernstein -Kurtycz, L., Mundry, R., & Sanz, C. (2020). \nTeaching varies with task complexity in wild chimpanzees.  Proceedings of the National Acad emy of \nSciences, 117, 969–976. \nMusgrave, S., Morgan, D., Lonsdorf, E., Mundry, R., & Sanz, C. (2016). Tool transfers are a form of teaching \namong chimpanzees. Scientific Reports, 6, 34783. \nNeadle, D., Allritz, M., & Tennie, C. (2017). Food cleaning in gori llas: Social learning is a possibility but not a \nnecessity. PloS One, 12, e0188866. \nNishihara, T., Suzuki, S., & Kuroda, S. (1995). Tool -set for termite -fishing by chimpanzees in the Ndoki Forest, \nCongo. Behaviour, 132, 219–235. \nPinker, S. (2010). The cogn itive niche: Coevolution of intelligence, sociality, and language. Proceedings of the \nNational Academy of Sciences, 107, 8993–8999. \nPovinelli, D. (2000). Folk physics for apes: The chimpanzee's theory of how the world works . Oxford University \nPress.  \nPrice, E. E., Lambeth, S. P., Schapiro, S. J., & Whiten, A. (2009). A potent effect of observational learning on \nchimpanzee tool construction. Proceedings of the Royal Society B: Biological Sciences, 276, 3377–3383. \nR Core Team (2019). R: A language a nd environment for statistical computing [Computer software]. R Foundation \nfor Statistical Computing. https://www.R-project.org/ \nReindl, E., Apperly, I.  A., Beck, S. R., & Tennie, C. (2017). Young children copy cumulative technological design \nin the absence of action information. Scientific Reports, 7, 1788.  \nRendell, L., & Whitehead, H. (2001). Culture in whales and dolphins. Behavioral and Brain Sciences, 24, 309-324. \nSanz, C.  M., Call, J., & Boesch, C. (2013). Tool use in animals: Cognition and ecology.  Cambridge University \nPress. \nSanz, C., Call, J., & Morgan, D. (2009). Design complexity in termite -fishing tools of chimpanzees ( Pan \ntroglodytes). Biology Letters, 5, 293–296. \nSanz, C. M., & Morgan, D.  B. (2007). Chimpanzee tool technology in the Goualougo Triangle, Republic of Congo. \nJournal of Human Evolution, 52, 420–433. \nSanz, C.  M., & Morgan, D.  B. (2009). Flexible and persistent tool -using strategies in honey -gathering by wild \nchimpanzees. International Journal of Primatology, 30, 411–427. \nSanz, C., Mo rgan, D., & Gulick, S. (2004). New insights into chimpanzees, tools, and termites from the Congo \nBasin. The American Naturalist, 164, 567–581. \nSanz, C.  M., Schöning, C., & Morgan, D.  B. (2010). Chimpanzees prey on army ants with specialized tool set. \nAmerican Journal of Primatology, 72, 17–24. \nSommer, V., Buba, U., Jesus, G., & Pascual -Garrido, A. (2012). Till the last drop. Honey gathering in Nigerian \nchimpanzees. Ecotropica, 18, 55–64. \nShrout, P.  E., & Fleiss, J.  L. (1979). Intraclass correlations: Uses i n assessin g rater reliability. Psychological \nBulletin, 86, 420–428. \n                                                                        Bernstein-Kurtycz et al. 309 \n \nShumaker, R. W., Walkup, K. R., & Beck, B. B. (2011). Animal tool behavior: The use and manufacture of tools by \nanimals. Johns Hopkins University Press. \nTennie, C., Bandini, E., van Schaik, C. P., & Hopper, L. M. (in press). The zone of latent solutions and its relevance \nto understanding ape cultures. Biology & Philosophy. \nTennie, C., Call, J., & Tomasello, M. (2009). Ratcheting up the ratchet: On the evolution of cumulative culture. \nPhilosophical Transactions of the Royal Society of London B: Biological Sciences , 364, 2405–2415. \nTennie, C., Hopper, L.  M., & van Schaik, C. (2020 ). On the origin of cumulative culture: Consideration of the role \nof copying in culture -dependent traits and a r eappraisal of the zone of latent solutions hypothesis. In L.  M. \nHopper & S. R. Ross (Eds.), Chimpanzees in context. University of Chicago Press. \nTomasello, M. (1996). Do apes ape? In C. M. Heyes & B. G. Galef, Jr. (Eds.), Social learning in animals: The roots \nof culture (pp. 319–346). Academic Press. \nTomasello, M., Kruger, A . C., & Ratner, H.  H. (1993). Cultural learning. Behavioral and Brain Sciences , 16, 495–\n511. \nvan Schaik, C.  P., Ancrenaz, M., Borgen, G., Galdikas, B., Knott, C.  D., Singleton, I., Suzuki , A., Utami, S.  S., & \nMerrill, M. (2003). Orangutan cultures and the evolution of material culture. Science, 299, 102–105. \nVale, G. L., Flynn, E. G., Pender, L., Price, E., Whiten, A., Lambeth, S. P., Schapiro, S. J., & Kendal, R. L. (2016). \nRobust retention and transfer of tool construction techniques in chimpanzees ( Pan troglodytes). Journal of \nComparative Psychology, 130, 24–35. \nWeir, A. A., & Kacelnik, A. (2006). A New Caledonian crow ( Corvus moneduloides) creatively re-designs tools by \nbending or unbending aluminum strips. Animal Cognition, 9, 317-334. \nWhiten, A., Goodall, J., McGrew, W.  C., Nishida, T., Reynolds, V., Sugiyama, Y., Tutin, C.  E. G., Wrangham, R.  \nW., & Boesch, C. (1999). Cultures in chimpanzees. Nature, 399, 682-685. \nWhiten, A., McGuigan, N ., Marshall-Pescini, S., & Hopper, L.  M. (2009). Emulation, imitation, over -imitation and \nthe scope of culture for child and chimpanzee. Philosophical Transactions of the Royal Society of London \nB: Biological Sciences, 364, 2417–2428. "
}