{
  "title": "Emotions and Instructed Language Learning: Proposing a Second Language Emotions and Positive Psychology Model",
  "url": "https://openalex.org/W3081010188",
  "year": 2020,
  "authors": [
    {
      "id": "https://openalex.org/A2152071734",
      "name": "Kaiqi Shao",
      "affiliations": [
        "Hangzhou Dianzi University"
      ]
    },
    {
      "id": "https://openalex.org/A2607572137",
      "name": "Laura J. Nicholson",
      "affiliations": [
        "Edge Hill University"
      ]
    },
    {
      "id": "https://openalex.org/A2802066329",
      "name": "Gulsah Kutuk",
      "affiliations": [
        "Edge Hill University"
      ]
    },
    {
      "id": "https://openalex.org/A2072925694",
      "name": "Fei Lei",
      "affiliations": [
        "South China Normal University"
      ]
    },
    {
      "id": "https://openalex.org/A2152071734",
      "name": "Kaiqi Shao",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2607572137",
      "name": "Laura J. Nicholson",
      "affiliations": [
        "Edge Hill University"
      ]
    },
    {
      "id": "https://openalex.org/A2802066329",
      "name": "Gulsah Kutuk",
      "affiliations": [
        "Edge Hill University"
      ]
    },
    {
      "id": "https://openalex.org/A2072925694",
      "name": "Fei Lei",
      "affiliations": [
        "South China Normal University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1011193893",
    "https://openalex.org/W2120582212",
    "https://openalex.org/W2607153553",
    "https://openalex.org/W3027636484",
    "https://openalex.org/W2972145160",
    "https://openalex.org/W2018765701",
    "https://openalex.org/W2907972239",
    "https://openalex.org/W2096576379",
    "https://openalex.org/W2588952674",
    "https://openalex.org/W1972760319",
    "https://openalex.org/W2792647855",
    "https://openalex.org/W2143114368",
    "https://openalex.org/W2107145111",
    "https://openalex.org/W2007445014",
    "https://openalex.org/W2090242685",
    "https://openalex.org/W2157607046",
    "https://openalex.org/W2794878664",
    "https://openalex.org/W2778877095",
    "https://openalex.org/W2115688553",
    "https://openalex.org/W2102003000",
    "https://openalex.org/W2464899612",
    "https://openalex.org/W2109254294",
    "https://openalex.org/W6722024514",
    "https://openalex.org/W2148883986",
    "https://openalex.org/W2308784220",
    "https://openalex.org/W2612819889",
    "https://openalex.org/W2950246374",
    "https://openalex.org/W1997053036",
    "https://openalex.org/W2897199305",
    "https://openalex.org/W2126046748",
    "https://openalex.org/W2169374134",
    "https://openalex.org/W2937156297",
    "https://openalex.org/W1966058179",
    "https://openalex.org/W6719318803",
    "https://openalex.org/W6720842423",
    "https://openalex.org/W2801885291",
    "https://openalex.org/W2802523542",
    "https://openalex.org/W2912580389",
    "https://openalex.org/W2026387202",
    "https://openalex.org/W2944762731",
    "https://openalex.org/W2982355547",
    "https://openalex.org/W1664104301",
    "https://openalex.org/W1827659809",
    "https://openalex.org/W1985515877",
    "https://openalex.org/W6725072211",
    "https://openalex.org/W2900995365",
    "https://openalex.org/W128472000",
    "https://openalex.org/W3126542412",
    "https://openalex.org/W2915069625",
    "https://openalex.org/W2013183177",
    "https://openalex.org/W2109717075",
    "https://openalex.org/W3012677379",
    "https://openalex.org/W2004697493",
    "https://openalex.org/W2800006373",
    "https://openalex.org/W6776223351",
    "https://openalex.org/W2800870566",
    "https://openalex.org/W2981673751",
    "https://openalex.org/W1920419802",
    "https://openalex.org/W2169365000",
    "https://openalex.org/W2052097980",
    "https://openalex.org/W2063898208",
    "https://openalex.org/W2517016476",
    "https://openalex.org/W636333792",
    "https://openalex.org/W4244065918",
    "https://openalex.org/W6723201902",
    "https://openalex.org/W2795033568",
    "https://openalex.org/W6762658305",
    "https://openalex.org/W1999399625",
    "https://openalex.org/W2786367559",
    "https://openalex.org/W2329626881",
    "https://openalex.org/W1985028117",
    "https://openalex.org/W6757463063",
    "https://openalex.org/W4241286296",
    "https://openalex.org/W2159903595",
    "https://openalex.org/W1976439938",
    "https://openalex.org/W3038060792",
    "https://openalex.org/W2969396919",
    "https://openalex.org/W2094955439",
    "https://openalex.org/W1610177724",
    "https://openalex.org/W2038506024",
    "https://openalex.org/W2758760497",
    "https://openalex.org/W2149093562",
    "https://openalex.org/W2481116305",
    "https://openalex.org/W2917548179",
    "https://openalex.org/W3028950870",
    "https://openalex.org/W2953358504",
    "https://openalex.org/W2053133047",
    "https://openalex.org/W2316964395",
    "https://openalex.org/W2491875241",
    "https://openalex.org/W3016132763",
    "https://openalex.org/W1785468416",
    "https://openalex.org/W1670606950",
    "https://openalex.org/W2523364226",
    "https://openalex.org/W1599418893",
    "https://openalex.org/W2063694620",
    "https://openalex.org/W1551383178",
    "https://openalex.org/W4248842122",
    "https://openalex.org/W1746951143",
    "https://openalex.org/W2724135820",
    "https://openalex.org/W1534802210",
    "https://openalex.org/W1976743906",
    "https://openalex.org/W2051843211"
  ],
  "abstract": "Although emotion research and positive psychology (PP) have recently gained strong momentum in the field of second language acquisition (SLA), theoretical models linking language emotion and PP research, which offer insights for both research and intervention practice are lacking. To address this gap, the present article first introduces the origin, concept, and research around PP. Next, it summarizes recent research on PP and emotions in SLA. Finally, by triangulating emotion theories and research in the fields of psychology, education, and SLA, we propose a new model, which merges the three pillars of PP (positive institutions, positive characteristics, and positive emotions) with the antecedents, outcomes, and interventions of second language (L2) emotions (the L2EPP model). The value of the model to L2 pedagogy and research is highlighted in the context of the importance of integrating PP into the area of emotions and instructed SLA.",
  "full_text": "Frontiers in Psychology | www.frontiersin.org 1 August 2020 | Volume 11 | Article 2142\nHYPOTHESIS AND THEORY\npublished: 25 August 2020\ndoi: 10.3389/fpsyg.2020.02142\nEdited by: \nJ. Lake,  \nFukuoka Women’s University, Japan\nReviewed by: \nChengchen Li,  \nHuazhong University of Science and \nTechnology, China\nJean-Marc Dewaele,  \nBirkbeck, University of London, \nUnited Kingdom\n*Correspondence: \nFei Lei  \nleifei@m.scnu.edu.cn\nSpecialty section: \nThis article was submitted to  \nLanguage Sciences,  \na section of the journal  \nFrontiers in Psychology\nReceived: 07 May 2020\nAccepted: 31 July 2020\nPublished: 25 August 2020\nCitation:\nShao K, Nicholson LJ, Kutuk G and \nLei F (2020) Emotions and Instructed \nLanguage Learning: Proposing a \nSecond Language Emotions and \nPositive Psychology Model.\nFront. Psychol. 11:2142.\ndoi: 10.3389/fpsyg.2020.02142\nEmotions and Instructed Language \nLearning: Proposing a Second \nLanguage Emotions and Positive \nPsychology Model\nKaiqi Shao1, Laura J. Nicholson  2, Gulsah Kutuk  3 and Fei Lei  4*\n1 School of Foreign Languages, Hangzhou Dianzi University, Hangzhou, China, 2 Faculty of Education, Edge Hill University, \nOrmskirk, United Kingdom, 3 Faculty of Education, Edge Hill University, Ormskirk, United Kingdom, 4 School of Foreign \nStudies, Center for Language Cognition and Assessment, South China Normal University, Guangdong, China\nAlthough emotion research and positive psychology (PP) have recently gained strong \nmomentum in the field of second language acquisition (SLA), theoretical models linking \nlanguage emotion and PP research, which offer insights for both research and intervention \npractice are lacking. To address this gap, the present article first introduces the origin, \nconcept, and research around PP . Next, it summarizes recent research on PP and \nemotions in SLA. Finally, by triangulating emotion theories and research in the fields of \npsychology, education, and SLA, we propose a new model, which merges the three pillars \nof PP (positive institutions, positive characteristics, and positive emotions) with the \nantecedents, outcomes, and interventions of second language (L2) emotions (the L2EPP \nmodel). The value of the model to L2 pedagogy and research is highlighted in the context \nof the importance of integrating PP into the area of emotions and instructed SLA.\nKeywords: emotion, second language acquisition, positive psychology, theory, learning, teaching\nINTRODUCTION\nLanguage learning creates a spectrum of emotions of both positive and negative connotation. \nThese emotions are of critical importance for second language (L2) learning and achievement \n(Shao et  al., 2019 ). However, past research on emotions and second language acquisition (SLA) \nhas traditionally focused on negative emotions, particularly language anxiety (see Teimouri \net al., 2019 , for review), leaving the effects of positive emotions (e.g., happiness, pride, gratitude, \njoy, hope, and admiration) largely unaddressed ( Dewaele and MacIntyre, 2014 ). Recently, there \nhas been a move toward examining a few positive emotions (e.g., enjoyment; Dewaele et  al., \n2018), as well as the positive effects of negative emotions ( Swain, 2013 ) in L2 teaching and \nlearning. Examining different language learning emotions together with their antecedents and \noutcomes from a more positive rather than solely negative perspective permits a balanced \ninsight into how language learners are able to fine-tune their emotions that eventually leads \nthem to success in the long run of SLA ( Oxford, 2016 ).\nAccording to Gable and Haidt (2005), positive psychology (PP) can be  defined as the scientific \nstudy that aims to better understand the conditions and processes involved in the flourishing or \noptimal functioning of groups and individuals. Seligman and Csikszentmihalyi (2000) pointed out \nthat PP research is built on three pillars: positive emotions (e.g., happiness and joy), positive \nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 2 August 2020 | Volume 11 | Article 2142\ncharacteristics (e.g., strengths and virtues), and positive institutions \n(e.g., family and school). As a key component of PP , positive \nemotions are seen not only as end states of flourishing and \nhappiness, but also as a means to achieving psychological growth, \nintellectual development, and improved well-being over time \n(Fredrickson, 2001). This suggests that they are worth cultivating \nand may play a central role in SLA, which is a gradually developing \nprocess necessitating long-term effort, motivation, interest, resilience, \noptimism, and the like (MacIntyre et al., 2019). Moreover, positive \ncharacteristics such as empathy, courage, optimism, and trait \nemotional intelligence, which are reflected in thoughts, feelings, \nand behaviors, can energize the language learners, helping them \nto recognize their own and others’ strengths, overcome language \nobstacles, and obtain optimal affective and learning experience \nin the L2 classroom ( Lake, 2013 ; Shao et  al., 2013 ). Good \ninstitutions/schools, which are characterized by security, democracy, \nfreedom of inquiry, high quality of education, and teacher and \npeer support can transcend the lone individual L2 learner, strengthen \npositive characteristics, and engender positive emotions to better \na community of language learners (Peterson, 2006; Khajavy et  al., \n2018). These three pillars of PP are intricately linked with one \nanother in the process of SLA as an individual L2 learner’s positive \ncharacteristics can generate positive emotions, which can have a \nripple effect on peers and teachers through mechanisms such as \nemotion contagion and social appraisal ( Parkinson, 2019), and \nthus influence the emotional climate at classroom and institutional \nlevels, resulting in a beneficial effective experience and language \ndevelopment for all ( Khajavy et  al., 2018).\nRiding on the wave of PP in SLA, these core concepts of PP \nmay serve as a useful guide for L2 emotion researchers to expand \nthe scope of emotions investigated, examine the causes and \nconsequences of multiple emotions in more depth, and provide \nconcrete recommendations for L2 teachers to foster students’ \nbeneficial emotional experiences ( Dewaele et  al., 2019a ; Shao \net al., 2019). The present article aims to contribute to our knowledge \nand understanding of these important topics by first briefly \nsynthesizing existing literature on PP and emotions in SLA, and \nthen introducing a theoretical model, namely, L2EPP (second \nlanguage emotions and positive psychology), which integrates \nemotion theories and research in the fields of psychology, education, \nand language with preliminary PP intervention studies in SLA. \nWe  anticipate that the interdisciplinary nature of this model will \npromote more research opportunities for L2 researchers, as well \nas the practical improvement of instruction in language classes.\nAN OVERVIEW OF POSITIVE \nPSYCHOLOGY\nPP has become a buzzword in the field of psychology in the \npast two decades. The historical basis of this concept can \nbe  traced back to the teaching of ancient Greek philosopher \nAristotle, who emphasized the importance of happiness and \nwell-being in life, which he referred to as eudaimonia (Robinson, \n1991). With its modern roots in the humanistic approach of \npsychology ( Maslow, 1954), PP , as a structured discipline, was \nfirst introduced in Martin Seligman’s 1988 Presidential Address \nof the American Psychological Association ( Seligman, 2002 ; \nGable and Haidt, 2005 ). Initially, the basic premise of PP was \nthat human beings are bestowed with positive traits and driven \nby the passion to seek a happy, engaged, and meaningful life. \nIt was envisioned that psychology needed a more optimistic \noutlook by studying topics such as character strengths, love, \nhappiness, well-being, and wisdom rather than being preoccupied \nby the abnormal and illness mentalities ( Seligman and \nCsikszentmihalyi, 2000 ). PP did not aim to disregard negative \nemotions and psychological disorders but was proposed as a \ncomplementary approach that could help to balance pathology-\nfocused approaches, which might produce only limited \nunderstanding of human nature ( Peterson, 2006 ).\nThe concept of PP at the subjective level is about positive \nsubjective experience: well-being and satisfaction, flow, joy, the \nsensual pleasures, and happiness; and constructive cognitions \nabout the future – optimism, hope, and faith. At the individual \nlevel, it is about positive personal traits: the capacity for love \nand vocation, courage, interpersonal skill, aesthetic sensibility, \nperseverance, forgiveness, originality, future-mindedness, high \ntalent, and wisdom. At the group level, it is about the civic \nvirtues and the institutions that move individuals toward better \ncitizenship: responsibility, nurturance, altruism, civility, \nmoderation, tolerance, and work ethic ( Seligman and \nCsikszentmihalyi, 2000 ). As the three pillars of PP , positive \nemotions, positive characteristics, and positive institutions are \ntied to the scientific inquiries of what makes life worth living \nand what helps people flourish in life ( Peterson, 2006 ).\nPP is a science that emphasizes theory-practice integration. \nSince Seligman and colleagues co-initiated the special issue of \nPP in the journal of American Psychologist  ( Peterson, 2000 ; \nSeligman and Csikszentmihalyi, 2000), a large number of empirical \nresearch has been conducted to attest to the theoretical soundness \nof PP constructs. In general, findings provided support for the \ntenets of PP , showing that each pillar of PP is pivotal for \nhuman beings’ cognitive and affective functioning, coping and \nresilience to adversity, physical and psychological health, and \nincreased engagement, performance, and satisfaction with their \nwork and life (e.g., Fredrickson and Branigan, 2005 ; Rode, \n2013; Meneghel et al., 2016). Seligman et al. (2005) also developed \nand refined a list of 40 practical interventions for practitioners \nto use to help people increase happiness. For instance, some \nof the well-known interventions include: expressing gratitude \nto an important person, describing three good things that \nhappened each day, identifying one’s signature strengths, and \nusing signature strengths in new ways. Two meta-analyses, \nwhich included 49 and 39 studies, respectively, supported the \neffectiveness of PP interventions for improving well-being and \nlowering depression, and the positive effects of these interventions \non psychological well-being remained significant after 6 months \n(Sin and Lyubomirsky, 2009 ; Bolier et  al., 2013 ).\nTheory and practice of PP have evolved in recent years. \nThe focus of PP has shifted from happiness (positive emotions, \nengagement, and meaning) to a more well-rounded theory of \nwell-being. In his book, “Flourishing” , Seligman (2011) explicitly \nstates that “ …the topic of positive psychology is well-being, \nthat the gold standard for measuring well-being is flourishing, \nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 3 August 2020 | Volume 11 | Article 2142\nand that the goal of positive psychology is to increase flourishing” \n(Seligman, 2011 , p.  13). According to Seligman (2011) , human \nflourishing can only be  achieved through enhancing each and \nevery aspect of PERMA: positive emotion, engagement, meaning, \npositive relationships, and accomplishment. Individuals in such \na state thrive, feel vitality, and prosper at both individual and \ninstitutional levels. Furthermore, the term “second wave positive \npsychology” represents a call in the field of PP to integrate \nconceptualization of positive and negative processes and to \nunderstand the role of contexts to create more appropriate \ntheoretical accounts about psychology in practice ( Lomas and \nIvtzan, 2016 ). Combining the study of positive and negative \nexperiences allows theory and research to move beyond simple, \nstatic, and linear descriptions of emotions, attitudes, and cultures \n(Snyder et  al., 2015 ). These new developments of PP coincide \nwith the introduction and flowering of PP in emotions and SLA.\nPP AND EMOTIONS IN SLA\nPP Constructs in SLA\nAlthough the explicit introduction of PP into the field of SLA \nhas only been a recent phenomenon, earlier studies on the \n“good language learner” (e.g., Naiman, 1978 ) as well as L2 \nmotivation research such as Gardner’s (1985) socio-educational \nmodel and Dörnyei’s (2005)  L2 self-system model have all \ntouched on the positive aspects of language learners and \ndemonstrated the importance of positive characteristics, positive \nattitudes, and positive emotions for the successful acquisition \nof a second language.\nMacIntyre and colleagues ( MacIntyre and Gregersen, 2012 ; \nMacIntyre and Mercer, 2014 ) were the first to formally bring \nPP into the spotlight of L2 researchers. They referred to \nFredrickson’s broaden-and-build theory (BBT) of positive emotions \nand its associated practical functions (see MacIntyre and \nGregersen, 2012, for a summary) and argued that teachers have \nthe potential to help students harness both positive and negative \nemotions by using techniques such as promoting imagination \nand practicing relaxation in language classrooms. Their work \nhighlighted the importance of PP theories for language teaching, \nlearning, and communication, and identified promising trends \nsuch as the move toward studying positive emotional states \n(e.g., love, enjoyment, and flow) and learner strengths (e.g., \ncourage, empathy, and hardiness) in SLA. They also addressed \nand proposed solutions for criticisms of PP that also occurred \nin L2 contexts (e.g., measurement issues and over-reliance on \ncross-sectional data; MacIntyre et  al., 2016 , 2019).\nIn another body of work, Oxford (2016) expanded Seligman’s \n(2011) PERMA framework by drawing upon prior research in \npsychology and proposing a more encompassing model containing \nkey elements that promote happiness within language learners \nand teachers. Specifically, the model comprises emotion and \nempathy; meaning and motivation; perseverance (including hope, \nresilience, and optimism); agency and autonomy; time; hardiness \nand habits of mind; intelligence; character strengths; and self-\nconcept, self-efficacy, self-esteem, and self-verification, and is \nknown using the acronym, EMPATHICS. Oxford (2016)  put \nforth a series of testable hypotheses related to each dimension \nof the model, and the preliminary empirical findings appeared \nto support the efficacy of the classroom interventions. Lake \n(2013, 2016) and Mercer (2016), to name a few, also investigated \na small number of constructs in this framework, such as courage, \nself-concept, and empathy and their initial findings provided \nsupport for the usefulness of these variables for L2 teaching \nand learning at both individual (in terms of enhancing positive \nL2 self, L2 self-efficacy, and L2 intended effort) and institutional \nlevel (in terms of promoting social relationships, positive group \ndynamics, and optimal classroom atmosphere).\nDewaele and colleagues have also emphasized the importance \nof adapting a more holistic view of L2 learners’ emotions by \nfocusing on both negative and positive emotions ( Dewaele and \nMacIntyre, 2014 ; Dewaele et  al., 2018 ). They proposed that \npositive emotions promote students’ resilience and perseverance \nto overcome language difficulties and encourage learners to \nexplore and play, which are crucial for building social cohesion \n(Dewaele et al., 2018). Their work on foreign language enjoyment \n(FLE) has shifted L2 researchers’ attention from their previous \npreoccupation with negative constructs, such as anxiety, to positive \nemotion constructs, which marks a new era of investigation. \nThis research has triggered a series of recent studies examining \nantecedents and outcomes of FLE in different contexts (to \nbe  discussed next; e.g., Jin and Zhang, 2018 ; Saito et  al., 2018 ; \nDewaele et  al., 2019b ; Li, 2020 ).\nPositive Emotions in SLA\nBefore the advent of PP in SLA, research in the field of emotions \nand language learning has been dominated by anxiety, which \nis the only emotion that has been systematically investigated \n(MacIntyre, 2017; Teimouri et  al., 2019). However, even in this \n“negative” period, one could add that signs of PP were already \npresent in studies that investigated the effects of positive \ncharacteristics such as trait emotional intelligence on language \nanxiety ( Dewaele et  al., 2008 ; Shao et  al., 2013 ). The role of \npositive affect has also featured in more teacher-oriented research \nby Arnold (1999)  since the turn of the century. Theoretical \nand empirical introduction of positive emotions in SLA started \nfrom the work of MacIntyre ( MacIntyre and Gregersen, 2012 ) \nand Dewaele ( Dewaele and MacIntyre, 2014 ). Following the \nBBT (Fredrickson, 2001), they pointed out the beneficial functions \nof positive emotions for language learners in terms of broadening \ncognition, tempering negative emotions, promoting resilience, \nbuilding personal and social resources, and triggering a virtuous \ncircle toward greater well-being and achievement ( MacIntyre \nand Gregersen, 2012 ; Dewaele et  al., 2019a ). Employing these \nconcepts, Dewaele and MacIntyre (2014)  explored one type of \npositive emotions: enjoyment, among 1,746 foreign language \n(FL) learners from around the world. Findings revealed that \nparticipants reported higher levels of FLE than foreign language \nanxiety (FLA), and FLE was only moderately negatively correlated \nwith FLA. FLE and FLA were also linked with socio-demographical \nvariables such as gender, age, number of FL known, and perceived \nlanguage proficiency. Qualitative data indicated that teachers’ \nprofessional and emotional skills and peer support are important \nfactors influencing learners’ FLE.\nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 4 August 2020 | Volume 11 | Article 2142\nInspired by this pioneering study, L2 researchers began to \ninvestigate a wide range of predictors (internal vs. external) \nand outcomes of FLE as well as the dynamic interactions \namong these variables from a PP perspective. For example, \nDewaele et  al. (2018)  examined the extent to which certain \nlearner and teacher variables were linked to students’ FLE and \nFLA. Results from 189 British high school students learning \nvarious foreign languages in class showed that FLE was negatively \ncorrelated with FLA but positively related to achievement. \nStudents’ age, gender, degree of multilingualism, language \nproficiency, and attitude toward the foreign language were also \nrelated to their FLE. Interestingly, teacher variables such as \nunpredictability of the class, frequency of L2 use, and students’ \nattitudes toward the teacher were more strongly correlated with \nstudents’ FLE than to their FLA. Moreover, employing a mixed \ncross-sectional and longitudinal design, Saito et  al. (2018)  \ninvestigated how language learners’ emotion and motivation \nprofiles related to their oral proficiency among 108 Japanese \nhigh school students. Results showed that learners’ enjoyment \nand motivation, but not anxiety, were positively related to \nstudying, practicing, and using the target language throughout \ntheir L2 learning experience. Students with a clear vision of \ntheir ideal L2-Self experienced more enjoyment and less anxiety \nin their language learning. Students’ enjoyment also positively \npredicted both their long-term and short-term language \nachievement, while anxiety only influenced their long-term \nachievement. In the Chinese context, Jin and Zhang (2018)  \ninvestigated factors underlying FLE among 320 EFL high school \nstudents. Factor analysis yielded a three-factor solution from \nan adapted FLE scale: enjoyment of teacher support, enjoyment \nof student support, and enjoyment of FL learning. FLE exerted \nboth direct and indirect effects on students’ FL performance. \nEnjoyment of FL learning had the strongest effect on achievement \nscores with enjoyment of teacher support and enjoyment of \nstudent support having indirect effects.\nTaken together, this initial evidence highlights the importance \nof positive emotions in enhancing L2 learners’ motivation and \nperformance and decreasing their language anxiety in the long \nrun and suggests that L2 teachers should strive to boost students’ \nenjoyment rather than solely focusing on reducing their anxiety \nin language classrooms ( Dewaele et  al., 2018 ). However, it is \nnoteworthy that these initial studies probed only one type of \npositive emotions; enjoyment, but other pleasant emotions such \nas hope, pride, contentment, gratitude, and admiration may \nplay an equally important role in promoting L2 learners’ \nmotivation, creativity, interest, and performance and thus are \nalso worth investigating. Recent research has started to address \nthis by adapting the construct of achievement emotions from \nthe field of educational psychology to the FL context in order \nto measure a wider range of positive emotions: enjoyment, \nhope, and pride ( Shao et  al., 2019 , 2020). This line of research \nwill be  discussed in more detail later on.\nA More Balanced Approach to the Study of \nEmotions in SLA\nRecent hermeneutics on PP emphasize the need to integrate \npositive and negative experiences and move beyond the static \nnotion of seeing them as simply good or bad ( Snyder et  al., \n2015). As Prior (2019 , p.  522) pointed out, “ Any emotion can \nbe facilitative or restrictive, motivating or demotivating, adaptive \nor maladaptive. To fully engage with emotion in language \nresearch and teaching requires a focus on context and a \nwillingness to simultaneously embrace ‘joy’ as well as ‘pain’ . ” \nFirst and foremost, this foregrounds a more balanced meta-\ntheoretical perspective on the influence of negative emotions \nin the language learning process, rather than treating them \nas purely maladaptive. Indeed, some research has demonstrated \nthe “positive power” of negative emotions for L2 learners to \nacquire the target languages.\nFor example, Swain’s (2013)  study showed that learners’ \nembarrassment may serve as a strong impetus for them to \nacquire the L2  in order to avoid such feelings in front of \npeers; while anger can motivate some students to master the \nsecond language as a way of revenging on perceived unfair \ntreatment by the school principal. Similarly, López and Cárdenas \n(2014) found that Mexican students were able to transform \nnegative emotions such as fear, anger, and frustration toward \nteachers’ written feedback and evaluations into positive energy \nafter reflecting on their moral obligations as students to their \nfamilies. Cultural value on education, socio-economic condition, \nfamily issues, and aspiration are documented as mediators in \nthe relation between teacher feedback and students’ emotions \nand writing texts. In the Japanese context, Imai (2010) examined \nhow a group of EFL learners discursively constructed and \nshared their emotional attitudes toward a semester-long group \nassignment that pushed them to co-construct their knowledge \nand challenge the assigned tasks and material. Participants’ \nnarratives show that emotions like boredom, discontentment, \nand frustration could become a psychological resource for their \nL2 development and mediate the relationship between cognitive \ntask demands and subsequent learning behavior.\nImportantly, these studies imply that negative emotions are \nseemingly detrimental and may initially lower students’ \nmotivation; however, they may be  turned into motivational \nfuels, depending on how L2 learners can make sense of these \nemotions and manage their emotionality to their advantage \nrather than succumbing to it. This meaning-making process \nis in line with the essence of PP , which emphasizes the importance \nof learning lessons from negative experiences and finding \npositive meaning in the face of adversities ( Peterson, 2006 ). \nSuch complex effects of negative emotions are more readily \nobserved from anxiety research in education and language \nshowing that anxiety can have either positive, negative, or \nzero correlations with performance (e.g., Kleinmann, 1977 ; \nEysenck et  al., 2007 ; Marcos-Llinás and Garau, 2009 ). \nFurthermore, these findings demonstrate that negative emotions \nand positive emotions often co-exist in the language acquisition \nprocess and may interact with cognition and contextual factors \nin affecting language learning and use. For example, family \nresponsibility, economic condition, and collective culture were \nimportant contextual factors that shaped the emotions of \nenjoyment, pride, and hope in the studies by Imai (2010)  and \nLópez and Cárdenas (2014) . The interplay among emotion, \ncognition, and context may take a more complex non-linear \nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 5 August 2020 | Volume 11 | Article 2142\nform than any experimental or cross-sectional research has \nassumed. Rather than denying the positive side of negative \nemotions, it may be  best to find a leverage point on the \ncontinuum of positive emotions and negative emotions with \na consideration of the language learning context.\nFurther, it is important to note that the effects of positive \nemotions on language learning are also context-dependent and \nmay not always be  adaptive ( Komorowska, 2016). From the PP \nperspective, this implies a more balanced approach regarding \nthe influence of positive emotions in SLA as well. Research in \npsychology and education has shown that positive emotions, \nunder certain circumstances, may induce unrealistic appraisals, \nfostering superficial information processing, and reducing \nmotivation to pursue challenging goals ( Forgas and East, 2008 ; \nPekrun and Perry, 2014 ). For language learners, unrealistic \noptimism may lead to an overestimated sense of control over \nthe learning tasks and situation, hope for an easy shortcut to \nachievement, and less systematic planning and preparation, which \nwill diminish their chances of success ( Komorowska, 2016).\nA THEORETICAL MODEL OF SECOND \nLANGUAGE EMOTIONS AND POSITIVE \nPSYCHOLOGY\nBuilding on emotion theories and research from the fields of \npsychology, education, and SLA (e.g., Fredrickson, 2001; Pekrun, \n2006; Dewaele et  al., 2018 ; Shao et  al., 2019 ), we  now propose \na second language emotions and positive psychology (L2EPP) \nmodel (see Figure  1) integrating the three core components \nof PP , that is, positive emotions, adaptive characteristics, and \ngood institutions with the antecedents, outcomes, and \ninterventions of L2 emotions. We  begin by describing the \ntheoretical framework before presenting empirical support for \neach aspect. As can be  seen from Figure  1, characteristics \nand institutions represent individual and environmental \nantecedents of L2 emotions, respectively, and they are expected \nto be  reciprocally linked with emotions and their learning \noutcomes in a feedback loop model. With emotion being placed \nat the center, each component of the model contains elements \nsituating different aspects of PP into the L2 context and may \nexert both direct and indirect effects on the elements in other \ncomponents. These elements may also interact with one another \nand with contextual factors (e.g., culture, policy, and language \ngroup, which are out of scope of the discussion) to co-determine \nlanguage learners’ emotions, achievement, and well-being.\nThe theoretical assumptions underlying the L2EPP model \nare in line with both Pekrun’s ( Pekrun, 2006 ; Pekrun and \nPerry, 2014 ) control-value theory of achievement emotions \n(CVT) and Fredrickson’s ( Fredrickson, 2001 ; Fredrickson and \nJoiner, 2018 ) BBT. The CVT posits that students experience \nspecific learning or achievement-related emotions when they \nfeel in control, or out of control, of achievement activities \nand outcomes that are subjectively important, implying that \nperceived control and perceived value are proximal determinants \nof classroom emotions ( Pekrun, 2006 ). Importantly, the CVT \nplaces emotion at the center of its framework (i.e., emotion \nis seen as both an independent and a dependent variable) \nand explicitly emphasizes the direct, indirect, and bidirectional \neffects as well as associated interventions among environmental \nfeatures, appraisals, emotions, and achievement outcomes (Pekrun \nand Perry, 2014 ). On the other hand, the BBT postulates that \nexperiences of positive emotions broaden people’s momentary \nthought-action repertoires and undo the lingering effects of \nnegative emotions, which in turn serves to build their enduring \npersonal resources, ranging from physical and intellectual \nresources to social and psychological resources ( Fredrickson, \n2001). The relationships among positive emotions, cognitive \nthinking, coping, and well-being are reciprocal, triggering an \nupward spiral ( Fredrickson and Joiner, 2002 ).\nThe distinctions between these theories lie in the fact that \nthe BBT is one of the founding blocks and major theories of \nPP , and it was introduced into the field of emotions and SLA \nas a fundamental theory for advocating the current PP movement \nin second language learning ( MacIntyre and Gregersen, 2012 ; \nDewaele and MacIntyre, 2014 ; Dewaele et al., 2019a ). The CVT \nis based on contemporary appraisal theories of emotions (Scherer, \n2013) and integrates various established theories in educational \npsychology (e.g., expectancy-value theory, transactional \napproaches of emotions, and attributional theory of motivation; \nsee Pekrun et  al., 2011). It was developed in general education \naiming to expand the scope of emotion investigated beyond \ntest anxiety in academic contexts as well as to systematically \nexamine the antecedents and outcomes of students’ diverse \nachievement emotions (Pekrun et al., 2002). As a domain-general \nemotion theory, the CVT has only recently been applied to \nthe domain of language learning (e.g., Piniel and Albert, 2018 ; \nShao et  al., 2019 , 2020; Davari et  al., 2020 ). While the BBT \nfocuses on the effects of positive emotions on cognitive and \npsychological processes, the CVT attends to both positive and \nnegative emotions together with their antecedents and outcomes.\nIn spite of the differences, these two theories share some \ncommon basic assumptions. Both CVT and BBT emphasize \nthe crucial role of positive emotions (e.g., enjoyment, hope, \npride, and contentment) in relation to cognitive thinking, \npersonality traits, physical health, psychological well-being, and \nsocial environment as well as the reciprocal relationships among \nthese variables. The value of cultivating positive emotions and \nfine-tuning negative emotions for the promotion of intellectual \ngrowth and psychological functioning is also prominent in \nboth. The two theories are complementary for building our \nL2EPP model, which is designed for putting forward a series \nof testable hypotheses for L2 researchers and practitioners who \nare willing to devote their time and efforts into the exciting \nresearch area of PP and emotions in SLA.\nSpecifically, as delineated in the L2EPP framework (see \nFigure  1), we  propose that academic environments/institutions \ncan shape students’ learning characteristics, which then go on \nto influence their emotions toward language tasks. For example, \na school/classroom climate featuring positive teacher and peer \nrelationships can foster students’ positive characteristics such as \nself-confidence and optimism, which are likely to generate positive \nemotions such as enjoyment of learning, hope, and pride. These \nemotions can in turn affect the cognitive and motivational \nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 6 August 2020 | Volume 11 | Article 2142\nprocesses involved in language learning and subsequent \nachievement, which ultimately influences psychological well-being. \nReciprocally, students’ psychosomatic health can also influence \ntheir language achievement, cognition, and motivation, which \nmay have differential effects on their language learning emotions, \nfor example, academic success might strengthen positive emotions \nand failure would induce negative emotions (e.g., anxiety, shame, \nand boredom). Different emotions can then influence students’ \nlearning characteristics such as curiosity and perseverance, which \nwill impact features of the learning environment, such as teachers’ \ndesign and selection of language tasks and materials. All of \nthese effects are bidirectional, triggering a feedback loop. L2 \nemotion interventions that focus on any dimension of the model \nare likely to bring syntonic effects to all other parts of the \nL2EPP model. It is noted that the aspects included in each \ncomponent of the model are not exhaustive; they are examples, \nalbeit the most pertinent ones based on past research and theory. \nNot only could L2 researchers systematically study particular \naspects of each component and how they relate to one another \nthrough possible mediation/moderation mechanisms, but also \nexploratory research could be conducted to identify other elements \nof each component that are not mentioned in the model.\nThe L2EPP model intends to guide L2 researchers to conduct \ninnovative research incorporating PP into the particular area of \nemotions and SLA, as well as to help language teachers design \nPP interventions targeting students’ affective experiences in the \nclassroom. In the following paragraphs, we illustrate each component \nof this model by merging recent emotion research in language \nand education with the preliminary applications of PP in SLA. \nThen, we discuss potential PP interventions, which may be applied \nFIGURE 1 |  L2EPP (second language emotions and positive psychology) model integrating three pillars of PP with antecedents, outcomes, and interventions of L2 \nemotions.\nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 7 August 2020 | Volume 11 | Article 2142\nto the field of L2 emotions based on each component. Finally, \nwe  suggest directions for future research and implications for \nlanguage teaching based on each dimension of the model.\nEmpirical Findings\nInstitutions\nAccording to Peterson (2006 , p.  20), “positive institutions can \npromote the development and display of positive characteristics, \nwhich in turn facilitate positive subjective experiences. ” From \na PP perspective, school is a unique institution that plays a \nrole not only in fostering language learning, but also in the \npersonal development and affective growth of teachers and \nstudents ( Gabryś-Barker, 2016 ). However, institutional factors \nare the least investigated among the three pillars of PP by L2 \nemotion researchers ( MacIntyre, 2016 ). Possible reasons for \nthis situation include the multiple determinants of school \nenvironment, difficulty in assessing these factors, and different \nperceptions of these features by teachers and students ( Gabryś-\nBarker, 2016 ). As Dörnyei (2014 , p.  46 ) stated, “the complex \ncharacter of school climate calls for a multidisciplinary approach \nwhich makes use of research findings from motivational \npsychology, educational studies and second language research. ”\nIn general education, the CVT proposes that institutional \nfactors (e.g., school, classroom, and teaching quality; see \nFigure  1 ) are distal antecedents of achievement emotions, \nwhich can have a collective influence on both teachers’ and \nlearners’ emotions, resulting in a change of emotional experience \nfor everyone in that particular environment ( Pekrun, 2006 ). \nSupporting this proposition, research has shown that a classroom \nenvironment conveying positive relationships, enjoyment, and \nmastery goal orientation positively predicts students’ academic \nenjoyment, engagement, and achievement and negatively \npredicts their anxiety at both classroom and individual levels \n(Arens et  al., 2015 ; Frenzel et  al., 2018 ).\nSpecifically, Frenzel et  al. (2018)  examined the relationship \nbetween teacher and student enjoyment in math classes. Findings \nshowed that teacher and student enjoyment were positively \nrelated even when controlling for students’ previous mathematics \nenjoyment, and that the effect of teacher enjoyment on student \nenjoyment was mediated by teacher enthusiasm. Lazarides and \nBuchholz (2019)  investigated the relation between students’ \nperceived teaching quality in math classrooms and enjoyment, \nanxiety, and boredom among 6,020 German middle school \nstudents. Multilevel regression analyses showed that teacher \nsupport and classroom management were negatively related to \nstudent-level anxiety and boredom. Teacher support was positively \nrelated to enjoyment and negatively related to anxiety at the \nclassroom level. Classroom management was negatively related \nto classroom-level boredom. Recently, employing doubly-latent \nmultilevel analysis, Khajavy et al. (2018) examined the influence \nof classroom environment on students’ emotions in second \nlanguage learning from the PP perspective. Results showed \nthat a positive classroom climate featuring by teacher support \nand student cohesiveness positively predicts students’ enjoyment, \nbut negatively predicts their anxiety. Enjoyment and anxiety \nalso mediated the relationship between classroom environment \nand willingness to communicate at the classroom level.\nCharacteristics\nThe BBT (Fredrickson, 2001) suggests that positive characteristics \nsuch as resilience, perseverance, and optimism can help people \nundo the protracted effects of negative emotions quickly and \nexperience more positive emotions that improve their cognitive \nfunctioning and psychological well-being. In the same vein, \nthe CVT ( Pekrun, 2006 ) proposes that personality traits like \nemotional intelligence and self-confidence related appraisals are \nmore immediate antecedents of achievement emotions that can \nhave a significant impact on learners’ emotional experiences. \nEducational research studies conducted so far have supported \nthese propositions.\nFor example, using the BBT, Seaton and Beaumont (2015)  \nexamined the relationships between students’ positive emotions \n(awe and amusement), resilience, personal goals, and subjective \nwell-being. Results revealed that positive emotions predicted \nincreased resilience and more personal growth goals. Resilience \npartially mediated the relationship between positive emotions \nand well-being. Moreover, following the CVT, Heckel and \nRingeisen (2019)  investigated the proposed structural \nrelationships between self-efficacy, cognitive appraisals, \nachievement emotions, and learning outcomes among 220 \nuniversity students in an online learning environment. Findings \nshowed self-efficacy was positively related to perceived control, \ninterests, and pride, but was negatively correlated with anxiety. \nControl and interest mediated the relationships between self-\nefficacy and satisfaction/competence gain, respectively, while \npride mediated the relationship between self-efficacy and \ncompetence gain.\nIn SLA, adapting the PP perspective, Wei et  al. (2019)  \ninvestigated the effect of grit on FLE and foreign language \nperformance (FLP) among 832 middle school students in China. \nResults indicated that grit positively affected FLE and FLP , and \nthe relationship between grit and FLP was mediated by FLE. \nPositive classroom environment also moderated the relationship \nbetween grit and FLE, and between grit and FLP . Similarly, \nTeimouri et  al. (2020) examined the relationship between grit, \nas measured by consistency of interest and perseverance of \neffort, with emotion, motivation, and language performance. \nFindings showed that FL grit positively correlated with enjoyment, \nmotivational variables (intended effort, willingness to \ncommunicate, and attention), and a series of language achievement \nmeasures (grammar, speaking, GPA, and self-rating), but negative \ncorrelated with anxiety. In another study, Li (2020) investigated \nthe impact of trait emotional intelligence on Chinese students’ \nFLE and achievement from the perspective of PP . Results \ndemonstrated that emotional intelligence is a positive predictor \nof language enjoyment and achievement. FLE partially mediated \nthe relationship between emotional intelligence and self-reported/\nactual language performance.\nEmotions\nAs previously mentioned, from a PP perspective, current L2 \nemotion research needs to expand the scope of both positive \nand negative emotions investigated. In the fields of psychology \nand education, Pekrun and colleagues’ research has demonstrated \nthat there are qualitative and quantitative differences (e.g., \nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 8 August 2020 | Volume 11 | Article 2142\ncontent, intensity, valence, activation, and object focus) between \ndiscrete positive emotions and negative emotions ( Frenzel et al., \n2007; Goetz et  al., 2010 ; Pekrun et  al., 2011 ). According to \nthe CVT ( Pekrun, 2006 ), pleasant achievement emotions (e.g., \nenjoyment, hope, and pride) are posited to be  jointly caused \nby high perceived control and high positive value, whereas \nunpleasant achievement emotions (e.g., anger, anxiety, shame, \nhopelessness, and boredom) are assumed to be  elicited as a \njoint function of perceived lack of control and high negative \nvalue. Moreover, these discrete positive emotions and negative \nemotions are presumed to differentially relate to a wide range \nof learning outcomes (e.g., motivation, cognition, interest, \nlearning strategies, and performance; see Pekrun et  al., 2011 ). \nAlthough this line of emotion research has traditionally tended \nto focus on domain-general emotion variables, such as general \ntest anxiety, or on students’ math-related emotions (e.g., Goetz \net  al., 2010; Pekrun et  al., 2017 ), the construct of achievement \nemotions has recently attracted increasing attention from L2 \nresearchers (e.g., Starkey-Perret et  al., 2018 ; Shao et  al., 2019 , \n2020; Davari et  al., 2020). As Davari et  al. (2020, p.  4) pointed \nout, “ Adherence to a complex system of learning emotions \nwould set L2 researchers free of a narrow, discrete approach \nto investigating language emotions. This complex system would \nalso protect the SLA field from the criticism levelled against \nthe perspectives on learning emotions that would draw on PP \n(e.g., dichotomization of positive emotions versus negative \nemotions and measurement problem). ”\nSpecifically, employing a short-version of the achievement \nemotion questionnaire (AEQ; Pekrun et al., 2005, 2011), Starkey-\nPerret et  al. (2018)  examined the impact of two FL teaching \napproaches (i.e., traditional approach vs. task-based teaching) \non learners’ two positive emotions (enjoyment and pride) and \nfive negative emotions (anger, anxiety, shame, hopelessness, \nand boredom) in an urban middle school in France in three \nsettings (class, learning, and test). Results of the study provided \nsupport for the reliability and validity of the AEQ for measuring \nlanguage learning emotions. Similarly, Davari et  al. (2020)  \ninvestigated the psychometric properties of the class-related \nAEQ among 784 Iranian EFL learners. Exploratory factor \nanalyses and confirmatory factor analysis (CFA) substantiated \nthe internal structure of the AEQ for measuring eight emotions \n(enjoyment, hope, pride, anger, anxiety, shame, hopelessness, \nand boredom) in language learning. Multi-group CFA also \ndemonstrated the measurement invariance of the AEQ across \ngender and learning contexts (school vs. institution). Very \nrecently, Shao et  al. (2020)  examined the effects of perceived \ncontrol and value on language emotions and performance as \nwell as the moderated mediation effects of appraisals on \nachievement through emotions among Chinese college EFL \nstudents (N = 550). Results indicated that students experienced \nmore positive emotions (enjoyment, hope, and pride) and less \nnegative emotions (anger, anxiety, shame, hopelessness, and \nboredom) and achieved better language performance when they \nfelt confident about language learning and found the learning \nactivities and outcomes important and interesting. The interactive \neffects of control and value appraisals on FL performance were \nalso mediated by enjoyment, hope, pride, and hopelessness.\nOutcomes\nAchievement and well-being are the ultimate goals of fostering \nlearners’ adaptive emotions in language classrooms. This is in \nline with the goal of “positive education, ” which explicitly aims \nto combine academic goals with the promotion of well-being \nfor learners ( Seligman et  al., 2009 ). It is well-documented in \npsychology and education that the effects of emotions on \nlearners’ achievement and psychological well-being depend on \nthe interplay between various cognitive and motivational \nmechanisms (Pekrun et al., 2011 ; Fredrickson and Joiner, 2018 ; \nsee above). According to the BBT and CVT, positive emotions \ncan facilitate holistic thinking and creative problem solving, \nbroaden the scope of attention and cognition, promote mastery \napproach goal, and enhance intrinsic motivation and long-term \nefforts, which eventually lead to better performance and well-\nbeing ( Fredrickson and Branigan, 2005 ; Pekrun et  al., 2011 ). \nOn the other hand, negative emotions may cause divided \nattention and reduced cognitive resources, but can promote \nanalytical thinking, facilitate emotion congruent memory and \nretrieval, and stimulate extrinsic motivation to invest effort \n(Pekrun and Perry, 2014 ). Thus, negative emotions can have \nvariable effects on learning and well-being (e.g., López and \nCárdenas, 2014 ), although negative consequences on overall \nacademic performance likely outweigh any beneficial effects \nfor most students (e.g., Pekrun et  al., 2017 ).\nHowever, existing L2 research has almost exclusively focused \non the effects of emotions on language performance, leaving \nother language outcomes (such as cognition, motivation, and \nwell-being) understudied. Among the few studies that have \nexamined relations between emotions and motivation, most \nof them centered around Gardner’s (1985)  social-educational \nmodel and Dörnyei’s (2005) L2 motivational self-system. From \nthe PP perspective, supporters of the two theories argued that \nlearners’ positive attitudes and behaviors (e.g., willingness to \ncommunicate) toward L2 learning or determination to deal \nwith the discrepancy between their present self and their ideal \nL2 self would all require a strong sense of enjoyment for \nacquiring the target language ( Teimouri, 2017; Dewaele et  al., \n2018; MacIntyre et  al., 2019 ). Preliminary research findings \nsupported this claim showing that L2 motivation and performance \nwere positively related to enjoyment, but negatively correlated \nwith anxiety (e.g., Chow et  al., 2018 ; Saito et  al., 2018 ).\nRecently, pioneering L2 researchers have started to adapt \nthe construct of achievement emotion to SLA and found similar \nmotivational effects in a broader scope of emotions. For instance, \nMéndez-Aguado et al. (2020) examined the influence of emotions \non motivation and performance among 394 students who \nlearned French as a foreign language. Findings showed that \npositive emotions (enjoyment, calmness, and pride) positively \npredicted motivation, while negative emotions (anxiety, \nhopelessness, boredom, and embarrassment) negatively predicted \nit. Motivation toward French learning positively related to \nleisure habit to learn French and academic performance. Shao \net al. (submitted manuscript) examined the relations between \neight discrete emotions, motivational variables, and language \nperformance in a sample of 1,021 Chinese EFL students. Results \nshow that students’ enjoyment, hope, and pride were positively \nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 9 August 2020 | Volume 11 | Article 2142\ncorrelated with intrinsic motivation, extrinsic motivation, self-\nregulation, and FL performance; while the opposite trend was \ngenerally found among anger, anxiety, shame, hopelessness, \nand boredom.\nPP Interventions and L2 Emotions\nPeterson (2006 , p.  25 ) advocated that PP is “not a spectator \nsport” , that the field has taken on a mandate to develop practical \ninterventions that help to create personal growth. Emotion-\ncentered language activities targeting any part of the L2EPP \nmodel may empower positive transformation and growth among \nlearners through the acquisition of essential life skills, thereby \ngenerating beneficial impact on the individual and their \nsurroundings via emotion contagion ( Hatfield et  al., 1994 ). L2 \neducators may avail themselves of PP interventions tailored \nto different aspects of the L2EPP model for promoting students’ \nemotional well-being and linguistic competence. Some pioneering \nstudies already exist for each dimension of the L2EPP , which \nwe  exemplify below.\nRegarding interventions focused on the institutional \ncomponent, Gabryś-Barker (2016)  explored the possibility of \napplying PP activities to enhance emotional climate in language \nclassrooms. Results show that EFL teachers’ awareness of the \nindicators of positive classroom atmosphere, understanding of \nteachers’ and students’ contribution to it and ability to use \nPP knowledge and techniques to adjust teaching are positively \nlinked with both teachers’ and students’ affective well-being. \nUseful tips include creating a form of mutual responsibility \nfor cultivating a positive learning environment and relationship \nbetween teachers and students; supporting students’ emotional \nneeds; and engaging students in activities such as experience \nsharing, small talks, and collaborative assignments, which can \nboost connectedness and group cohesion.\nTurning to positive characteristics interventions, Piasecka \n(2016) investigated whether working on poetry with PP activities \ncan support learners’ character strengths. The findings show \nthat this training can help learners develop language proficiency, \nimagination, and sensitivity and promote adaptive characteristics \nsuch as creativity, open-mindedness, courage, social intelligence, \nand appreciation of beauty. These enhanced characteristics show \nsigns of helping students move toward their possible ideal L2 \nself. Students also reported increased self-efficacy, satisfaction, \nand happiness after the course. Moreover, adopting an emotional \nintelligence (EI) intervention program, Li and Xu (2019)  \nexamined the extent to which EFL learners’ FLE and FLA \nwere linked to trait EI. The results showed that the EI intervention \nwas effective in increasing EFL learners’ EI, boosting their \nFLE and reducing their FLA.\nConcerning direct L2 emotion interventions, Kossakowska-\nPisarek (2016) incorporated vocabulary training strategies with \nfacets of self-control such as commitment control, metacognitive \ncontrol, satiation control, emotion control, and environmental \ncontrol to probe their influences on learners’ emotion, motivation, \nand performance. Learners were asked to set up their own \ngoals, analyze them, implement strategies and monitor the \nprocess that would help them negotiate emotional responses \nto achieving or not achieving their goals. Findings showed \nthat these activities can potentially raise students’ emotion \nawareness, enhance their commitment and motivation, and \npromote their positive emotions and language performance.\nFinally, as reflected in the L2EPP model, any interventions \nfocused on language outcomes would likely influence their \nantecedents and vice versa. For instance, applying six PP \ninterventions (gratitude, altruism, music, pets, exercise, and \nlaughter) into the language context, Gregersen (2016)  paired \nexperienced trainees of the PP approach with L2 learners to \nexamine the efficacy of these procedures. Qualitative and \nquantitative findings showed that these activities were able to \nelevate students’ mood and positive emotions, and students \nreported greater feelings of engagement and well-being. Similarly, \nMercer et al. (2018)  enlisted the promotion of positive language \neducation among L2 learners by using principles such as content \nand language integrated learning, which can have the potential \nto improve linguistic competence and subjective well-being at \nboth individual and institutional levels.\nIt should be  noted, however, that these interventions are \nstill in the trial period and some of the criticisms of PP \nmentioned by Lazarus (2003) , such as over-reliance on cross-\nsectional data, inadequate attention to within-between group \ndifferences, and poor quality of measurement, remained unsolved \nin these studies. Thus, language teachers are advised to critically \nexamine empirical support for the interventions, understand \nhow these interventions are supposed to function, and evaluate \ntheir outcomes before putting them into large-scale practice. \nL2 researchers may collect longitudinal data ( Elahi Shirvan \nand Taherian, 2018), employ multilevel analysis ( Khajavy et al., \n2018), and adapt established and validated instruments from \npsychology and education ( Seligman et  al., 2009 ; Davari et  al., \n2020) when testing the effectiveness of emotion interventions \nthat target any dimension of the L2EPP model in the future.\nResearch Suggestions and Pedagogical \nImplications\nThe aforementioned empirical studies have demonstrated the \ntheoretical utility of the L2EPP model for merging emotion \nresearch in language and education with PP concepts. However, \nthis line of research is still in its infancy, and there is ample \nroom for exploring each dimension of the model in the future. \nFor example, previous research to date has only tapped relations \nbetween teacher and student emotions ( Frenzel et  al., 2018 ), \nleaving the influence of peer emotions largely neglected. \nStudents spend a larger amount of time in the company of \npeers in their school life and the need for students to \ncommunicate and interact with one another is greater in \nlanguage classrooms than for other subjects due to the \ncommunicative demands of language acquisition ( Shao et  al., \n2019). Thus, language researchers may consider investigating \nhow students’ language learning emotions are influenced by \nthe emotional experiences of their peers through processes \nsuch as emotional contagion ( Hatfield et  al., 1994 ) or social \nappraisals ( Parkinson and Manstead, 2015 ). By implication, \nthis may also suggest that language teachers can promote \nstudents’ adaptive emotions by nurturing positive peer relations. \nOne way to achieve this is through encouraging collaborative \nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 10 August 2020 | Volume 11 | Article 2142\nlearning in and out of the classroom, which may help with \ndeveloping positive interdependence and a supportive learning \natmosphere among students ( Johnson and Johnson, 2009 ).\nL2 researchers may also consider expanding the scope of \npositive characteristics investigated to include, for instance, \ncourage, humor, resolution, open-mindedness, altruism, \ncuriosity, and empathy. For example, empathy, as an important \nelement in Oxford’s (2016)  EMPATHICS model, may play a \nvital role in shaping language learning emotions given that \nit relates to learners’ competence to understand the minds \nand emotions of interlocutors and develop positive relationships \nwith them during intercultural communication, social \ninteraction, and language use ( Mercer, 2016 ). L2 researchers \ncan investigate the influence of empathy on a wide range of \npositive and negative emotions (e.g., enjoyment, hope, pride, \nanger, shame, and boredom) as well as the potential mediating \nrole of empathy in the relationship between institutional factors \nand language learning emotions. Pedagogically, language teachers \ncan employ various intervention tools (e.g., role-play, movies, \ndrama, reflective journal, and reading literature) to help learners \nfoster their empathy ( Mercer, 2016 ). One effective method \ncan be  through the use of role-play, by using either real or \nimaginative characters. Acting helps language learners to gain \ndeeper insight into the minds and emotions of others. This \nvicarious experience enables them to be  more considerate \nand resourceful in handling the relationship with peers and \nteachers as well as their own language learning emotions \n(Shao et  al., 2012 ).\nAs for the focal area of L2 emotions, researchers may \nexamine discrete positive and negative emotions in language \nlearning in a more nuanced manner. In line with the \ntwo-dimension circumplex model of affect in psychology \n(Linnenbrink, 2007 ), Pekrun et  al. (2002)  has classified \nachievement emotions in educational settings based on valence \nand activation. Accordingly, positive activating emotions (hope, \npride, and enjoyment), negative deactivating emotions (boredom \nand hopelessness), negative activating emotions (anger, anxiety, \nand shame) and positive deactivating emotions (relief) are \npresumed to have distinguished influence on motivation, self-\nregulation, effort, and performance (see Pekrun, 2006 ; Pekrun \net  al., 2011). L2 emotion researchers may probe how multiple \ntypes of emotions differentially link with their antecedents \nand language outcomes as well as the potential mediation \neffects of emotions between institutional factors, positive \ncharacteristics, and language achievement. Language educators \nmay also heed to the unique roles of different types of emotions \nexperienced by students. It is advised that teachers can help \nstudents capitalize on the double-edged sword of both discrete \npositive emotions and negative emotions and maintain the \nequilibrium of their effects on language learning. Intervention \nprograms specifically targeting students’ achievement emotions \nsuch as attributional retraining ( Hall et  al., 2016 ) and value \ninduction (Harackiewicz and Priniski, 2018) have already become \navailable for language teachers.\nRegarding language outcomes of emotions, one of the \nforemost areas might be  to consider how emotions relate to \nwell-being in language learning and teaching. Well-being is \nan aim, outcome, and contributor to the language learning \nprocess and can facilitate personal growth and social \ntransformation ( MacIntyre et  al., 2019 ). Language researchers \nmay pay more attention to the function of emotions for \nphysiological and psychological health and investigate the \ninfluence of discrete positive emotions and negative emotions \non psychosomatic indexes such as heart rate, adrenaline, blood \npressure, satisfaction, mental health, and well-being ( Gregersen \net  al., 2014 ). Possible mediation and moderation processes as \nwell as the reciprocal links among institutional factors, learner \ncharacteristics, emotions, cognition, motivation, and well-being \nmight also be  probed ( Fredrickson, 2001 ; Pekrun, 2006 ). In \nline with the goal of positive language education, L2 educators \nmay explicitly aim to combine the acquisition of linguistic \nskills with the promotion of well-being in the classroom and \nschool ( Mercer et  al., 2018 ). Language teachers can adopt a \nnumber of innovative instructional designs (e.g., participating \nin a fictional talk show or live interview; see Shao et  al., \n2012) to promote students’ positive emotions, language \nproficiency, and well-being. For example, teachers may select \ndifferent types of background music to match teaching content, \nstudents’ preferences and learning contexts. The fine-tuned \nmusic may not only foster positive characteristics and adaptive \nemotions, but also facilitate language learning and psychological \ndevelopment ( Kang and Williamson, 2014 ).\nCONCLUSION\nThe emergence of PP in SLA and the particular area of emotion \nand language learning resonate with a change of mentality \namong L2 researchers, shifting from a narrow, negative focus \nto a more positive, balanced approach for investigating language \nteaching and learning. PP is deemed to be  an exciting topic \nto incorporate into the study of emotions and SLA because \nit encompasses facets like positive institutions, positive \ncharacteristics, and positive emotions, which are of primary \nrelevance to the examination and cultivation of beneficial \naffective experiences in language classrooms. The initial research \nin this promising field is already producing new ideas, knowledge \nand insights for L2 emotion theorists ( MacIntyre et  al., 2016 ; \nOxford, 2016) and proposing practical interventions for language \nteachers (Gregersen, 2016; Dewaele et al., 2018 ). In this article, \nwe  propose an L2EPP model that enables us to have a more \nholistic and systematic view on the issue of emotions and \nlanguage learning from the lens of PP , recognizing the importance \nof institutional factors and character strengths, together with \neffective intervention designs in shaping language learners’ \nemotional well-being and achievement. By aligning the BBT \n(Fredrickson, 2001 ) with the CVT ( Pekrun, 2006 ), the L2EPP \nmodel has the potential to provide a framework of language \nemotions that would effectively address criticism against the \nPP approach in SLA. The advent of PP into the area of emotions \nand language learning broadens the horizon for applied linguists \nand language practitioners, and in this research endeavor, \nwe  also offer new input from our unique experiences and \nperspectives to enrich its theories and practice, which can \nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 11 August 2020 | Volume 11 | Article 2142\nlead to cross-fertilization of new ideas. In building the L2EPP \nmodel with its many hypotheses, mechanisms, and practices \nyet to be  tested, we  envision a bright future for its utility in \nthe area of emotions and SLA.\nDATA AVAILABILITY STATEMENT\nThe original contributions presented in the study are included \nin the article/supplementary material, and further inquiries \ncan be  directed to the corresponding author.\nAUTHOR CONTRIBUTIONS\nKS guided and drafted the review. LN co-wrote and designed \nthe article. GK co-wrote and edited the review. FL reviewed \nand revised the manuscript. All authors contributed to the \narticle and approved the submitted version.\nFUNDING\nHangzhou Dianzi University.\n \nREFERENCES\nArens, A. K., Morin, A., and Watermann, R. (2015). Relations between classroom \ndisciplinary problems and student motivation: achievement as a potential \nmediator? Learn. Instr. 39, 184–193. doi: 10.1016/j.learninstruc.2015.07.001\nArnold, J. (ed.) (1999). Affect in language learning . Cambridge: Cambridge \nUniversity Press.\nBolier, L., Haverman, M., Westerhof, G. J., Riper, H., Smit, F ., and Bohlmeijer, E. \n(2013). Positive psychology interventions: a meta-analysis of randomized \ncontrolled studies. BMC Public Health 13:119. doi: 10.1186/1471-2458-13-119\nChow, B. W ., Chiu, H. T., and Wong, S. W . (2018). Anxiety in reading and \nlistening English as a foreign language in Chinese undergraduate students. \nLang. Teach. Res.  22, 719–738. doi: 10.1177/1362168817702159\nDavari, H., Karami, H., Nourzadeh, S., and Iranmehr, A. (2020). Examining \nthe validity of the Achievement Emotions Questionnaire for measuring more \nemotions in the foreign language classroom. J. Multiling. Multicult. Dev.  \ndoi: 10.1080/01434632.2020.1766054 [Epub ahead of print]\nDewaele, J. -M., Chen, X., Padilla, A. M., and Lake, J. (2019a). The flowering \nof positive psychology in foreign/second language teaching and acquisition \nresearch. Front. Psychol. 10:2128. doi: 10.3389/fpsyg.2019.02128\nDewaele, J. -M., and MacIntyre, P . D. (2014). The two faces of janus? Anxiety \nand enjoyment in the foreign language classroom. Stud. Second Lang. Learn. \nTeach. 4, 237–274. doi: 10.14746/ssllt.2014.4.2.5\nDewaele, J. -M., Magdalena, A. F ., and Saito, K. (2019b). The effect of perception \nof teacher characteristics on Spanish EFL Learners’ Anxiety and Enjoyment. \nMod. Lang. J.  103, 412–427. doi: 10.1111/modl.12555\nDewaele, J. -M., Petrides, K. V ., and Furnham, A. (2008). Effects of trait \nemotional intelligence and sociobiographical variables on communicative \nanxiety and foreign language anxiety among adult multilinguals: a review \nand empirical investigation. Lang. Learn.  58, 911–960. doi: 10.1111/ \nj.1467-9922.2008.00482.x\nDewaele, J. -M., Witney, J., Saito, K., and Dewaele, L. (2018). Foreign language \nenjoyment and anxiety: the effect of teacher and learner variables. Lang. \nTeach. Res. 22, 676–697. doi: 10.1177/1362168817692161\nDörnyei, Z. (2005). The psychology of the language learner: Individual differences \nin second language acquisition . Mahwah, NJ: Lawrence Erlbaum.\nDörnyei, Z. (2014). “Motivation in second language learning” in Teaching English \nas a second or foreign language . 4th Edn . eds. M. Celce-Murcia and  \nL. McIntosh (Boston, MA: National Geographic Learning/Cengage Learning), \n518–531.\nElahi Shirvan, M., and Taherian, T. (2018). Longitudinal examination of university \nstudents’ foreign language enjoyment and foreign language classroom anxiety \nin the course of general English: latent growth curve modeling. Int. J. Biling. \nEduc. Biling. doi: 10.1080/13670050.2018.1441804 [Epub ahead of print]\nEysenck, M. W ., Derakshan, N., Santos, R., and Calvo, M. G. (2007). Anxiety \nand cognitive performance: attentional control theory. Emotion 7:336. doi: \n10.1037/1528-3542.7.2.336\nForgas, J. P ., and East, R. (2008). On being happy and gullible: mood effects \non skepticism and the detection of deception. J. Exp. Soc. Psychol.  44, \n1362–1367. doi: 10.1016/j.jesp.2008.04.010\nFredrickson, B. L. (2001). The role of positive emotions in positive psychology: \nthe broaden-and-build theory of positive emotions. Am. Psychol.  56, 218. \ndoi: 10.1037/0003-066X.56.3.218\nFredrickson, B. L., and Branigan, C. (2005). Positive emotions broaden the \nscope of attention and thought-action repertoires. Cognit. Emot. 19, 313–332. \ndoi: 10.1080/02699930441000238\nFredrickson, B. L., and Joiner, T. (2002). Positive emotions trigger upward \nspirals toward emotional well-being. Psychol. Sci. 13, 172–175. doi: 10.1111/ \n1467-9280.00431\nFredrickson, B. L., and Joiner, T. (2018). Reflections on positive emotions and \nupward spirals. Perspect. Psychol. Sci.  13, 194–199. doi: 10.1177/ \n1745691617692106\nFrenzel, A. C., Becker-Kurz, B., Pekrun, R., Goetz, T., and Lüdtke, O. (2018). \nEmotion transmission in the classroom revisited: a reciprocal effects model \nof teacher and student enjoyment. J. Educ. Psychol. 110, 628–639. doi: 10.1037/\nedu0000228\nFrenzel, A. C., Thrash, T. M., Pekrun, R., and Goetz, T. (2007). Achievement \nemotions in Germany and China: a cross-cultural validation of the Academic \nEmotions Questionnaire—Mathematics. J. Cross-Cult. Psychol.  38, 302–309. \ndoi: 10.1177/0022022107300276\nGable, S. L., and Haidt, J. (2005). What (and why) is positive psychology? \nRev. Gen. Psychol.  9, 103–110. doi: 10.1037/1089-2680.9.2.103\nGabryś-Barker, D. (2016). “Caring and sharing in the foreign language class: \non a positive classroom climate” in Positive psychology perspectives on foreign \nlanguage learning and teaching . eds. D. Gabry ś-Barker and D. Ga łajda \n(Switzerland: Springer), 155–174.\nGardner, R. C. (1985). Social psychology and second language learning: The role \nof attitudes and motivation . London: Edward Arnold.\nGoetz, T., Frenzel, A. C., Stoeger, H., and Hall, N. C. (2010). Antecedents of \neveryday positive emotions: an experience sampling analysis. Motiv. Emot. \n34, 49–62. doi: 10.1007/s11031-009-9152-2\nGregersen, T. (2016). “The positive broadening power of a focus on well-being \nin the language classroom” in Positive psychology perspectives on foreign \nlanguage learning and teaching . eds. D. Gabry ś-Barker and D. Ga łajda \n(Switzerland: Springer), 59–73.\nGregersen, T., MacIntyre, P . D., and Meza, M. D. (2014). The motion of emotion: \nidiodynamic case studies of learners’ foreign language anxiety. Mod. Lang. \nJ. 98, 574–588. doi: 10.1111/modl.12084\nHall, N. C., Sampasivam, L., Muis, K. R., and Ranellucci, J. (2016). Achievement \ngoals and emotions: the mediational roles of perceived progress, control, \nand value. Br. J. Educ. Psychol.  86, 313–330. doi: 10.1111/bjep.12108\nHarackiewicz, J. M., and Priniski, S. J. (2018). Improving student outcomes in \nhigher education: the science of targeted intervention. Annu. Rev. Psychol.  \n69, 409–435. doi: 10.1146/annurev-psych-122216-011725\nHatfield, E., Cacioppo, J. T., and Rapson, R. L. (1994). Emotional contagion . \nNew Y ork: Cambridge University Press.\nHeckel, C., and Ringeisen, T. (2019). Pride and anxiety in online learning \nenvironments: achievement emotions as mediators between learners’ \ncharacteristics and learning outcomes. J. Comput. Assist. Learn. 35, 667–677. \ndoi: 10.1111/jcal.12367\nImai, Y . (2010). Emotions in SLA: new insights from collaborative learning \nfor an EFL classroom. Mod. Lang. J.  94, 278–292. doi: 10.1111/ \nj.1540-4781.2010.01021.x\nJin, Y ., and Zhang, L. J. (2018). The dimensions of foreign language classroom \nenjoyment and their effect on foreign language achievement. Int. J. Biling. \nEduc. Biling. doi: 10.1080/13670050.2018.1526253 [Epub ahead of print]\nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 12 August 2020 | Volume 11 | Article 2142\nJohnson, D. W ., and Johnson, R. T. (2009). An educational psychology success \nstory: social interdependence theory and cooperative learning. Educ. Res.  \n38, 365–379. doi: 10.3102/0013189X09339057\nKang, H. J., and Williamson, V . J. (2014). Background music can aid second \nlanguage learning. Psychol. Music 42, 728–747. doi: 10.1177/0305735613485152\nKhajavy, G. H., MacIntyre, P . D., and Barabadi, E. (2018). Role of the emotions \nand classroom environment in willingness to communicate: applying doubly \nlatent multilevel analysis in second language acquisition research. Stud. \nSecond. Lang. Acquis.  40, 605–624. doi: 10.1017/S0272263117000304\nKleinmann, H. H. (1977). Avoidance behavior in adult second language acquisition. \nLang. Learn.  27, 93–107. doi: 10.1111/j.1467-1770.1977.tb00294.x\nKomorowska, H. (2016). “Difficulty and coping strategies in language education: \nis positive psychology misrepresented in SLA/FLT?” in Positive psychology \nperspectives on foreign language learning and teaching . eds. D. Gabry ś-Barker \nand D. Ga łajda (Switzerland: Springer), 39–56.\nKossakowska-Pisarek, S. (2016). “Pedagogical implications of positive psychology: \npositive emotions and human strengths in vocabulary strategy training” in \nPositive psychology perspectives on foreign language learning and teaching . \neds. D. Gabry ś-Barker and D. Ga łajda (Switzerland: Springer), 93–114.\nLake, J. (2013). “Positive L2 self: linking positive psychology with L2 motivation” \nin Language learning motivation in Japan.  eds. M. Apple, D. Da Silva and \nT. Fellner (Bristol: Multilingual Matters), 225–244.\nLake, J. (2016). “ Accentuate the positive: conceptual and empirical development \nof the positive L2 self and its relationship to L2 proficiency” in Positive \npsychology in SLA . eds. P . D. MacIntyre, T. Gregersen and S. Mercer (Bristol: \nMultilingual Matters), 237–257.\nLazarides, R., and Buchholz, J. (2019). Student-perceived teaching quality: how \nis it related to different achievement emotions in mathematics classrooms? \nLearn. Instr. 61, 45–59. doi: 10.1016/j.learninstruc.2019.01.001\nLazarus, R. S. (2003). Does the positive psychology movement have legs? Psychol. \nInq. 14, 93–109. doi: 10.1207/S15327965PLI1402_02\nLi, C. (2020). A positive psychology perspective on Chinese EFL students’ trait \nemotional intelligence, foreign language enjoyment and EFL learning \nachievement. J. Multiling. Multicult. Dev.  41, 246–263. doi: 10.1080/ \n01434632.2019.1614187\nLi, C., and Xu, J. (2019). Trait emotional intelligence and classroom emotions: \na positive psychology investigation and intervention among Chinese EFL \nlearners. Front. Psychol. 10:2453. doi: 10.3389/fpsyg.2019.02453\nLinnenbrink, E. A. (2007). “The role of affect in student learning: a multi-\ndimensional approach to considering the interaction of affect, motivation, \nand engagement” in Emotion in education . eds. P . A. Schutz and R. Pekrun \n(Burlington, MA: Elsevier), 107–124.\nLomas, T., and Ivtzan, I. (2016). Second wave positive psychology: exploring \nthe positive-negative dialectics of wellbeing. J. Happiness Stud. 17, 1753–1768. \ndoi: 10.1007/s10902-015-9668-y\nLópez, M. G. M., and Cárdenas, M. A. F . (2014). Emotions and their effects \nin a language learning Mexican context. System 42, 298–307. doi: 10.1016/j.\nsystem.2013.12.006\nMacIntyre, P . D. (2016). “So far so good: an overview of positive psychology \nand its contributions to SLA ” in  Second language learning and teaching. \nPositive psychology perspectives on foreign language learning and teaching . \neds. D.  Gabryś-Barker and D. Gałajda (Switzerland: Springer), 3–20.\nMacIntyre, P . D. (2017). “ An overview of language anxiety research and trends \nin its development” in New insights into language anxiety: Theory, research \nand educational implications. eds. C. Gkonou, M. Daubney and J. -M. Dewaele \n(Bristol: Multilingual Matters), 11–30.\nMacIntyre, P ., and Gregersen, T. (2012). Emotions that facilitate language \nlearning: the positive-broadening power of the imagination. Stud. Second \nLang. Learn. Teach.  2, 193–213. doi: 10.14746/ssllt.2012.2.2.4\nMacIntyre, P . D., Gregersen, T., and Mercer, S. (eds.) (2016). Positive psychology \nin SLA . Bristol: Multilingual Matters.\nMacIntyre, P . D., Gregersen, T., and Mercer, S. (2019). Setting an agenda for \npositive psychology in SLA: theory, practice, and research. Mod. Lang. J.  \n103, 262–274. doi: 10.1111/modl.12544\nMacIntyre, P . D., and Mercer, S. (2014). Introducing positive psychology to \nSLA. Stud. Second Lang. Learn. Teach. 4, 153–172. doi: 10.14746/ssllt.2014.4.2.2\nMarcos-Llinás, M., and Garau, M. J. (2009). Effects of language anxiety on \nthree proficiency-level courses of Spanish as a foreign language. Foreign \nLang. Ann. 42, 94–111. doi: 10.1111/j.1944-9720.2009.01010.x\nMaslow, A. H. (1954). Motivation and personality. New Y ork: Harper and Row.\nMéndez-Aguado, C., Aguilar-Parra, J. M., Álvarez, J. F ., Trigueros, R., and \nFernández-Archilla, J. A. (2020). The influence of emotions, motivation and \nhabits in the academic performance of primary education students in French \nas a foreign language. Sustainability 12:2531. doi: 10.3390/su12062531\nMeneghel, I., Salanova, M., and Martínez, I. M. (2016). Feeling good makes us \nstronger: how team resilience mediates the effect of positive emotions on \nteam performance. J. Happiness Stud. 17, 239–255. doi: 10.1007/s10902-014-9592-6\nMercer, S. (2016). “Seeing the world through your eyes: empathy in language \nlearning and teaching” in Positive psychology in SLA . eds. P . MacIntyre,  \nT. Gregersen and S. Mercer (Bristol: Multilingual Matters), 91–111.\nMercer, S., MacIntyre, P ., Gregersen, T., and Talbot, K. (2018). Positive language \neducation: combining positive education and language education. Theory \nPract. Second Lang. Acquis.  4, 11–31.\nNaiman, N. (1978). The good language learner. Clevedon, UK: Multilingual Matters.\nOxford, R. L. (2016). “Toward a psychology of well-being for language learners: \nthe “EMPATHICS” vision” in Positive psychology in SLA. eds. P . D. MacIntyre,  \nT. Gregersen and S. Mercer (England: Multilingual Matters Bristol), 10–87.\nParkinson, B. (2019). Intragroup emotion convergence: beyond contagion and \nsocial appraisal. Pers. Soc. Psychol. Rev.  24, 121–140. doi: \n10.1177/1088868319882596\nParkinson, B., and Manstead, A. S. (2015). Current emotion research in social \npsychology: thinking about emotions and other people. Emot. Rev. 7, 371–380. \ndoi: 10.1177/1754073915590624\nPekrun, R. (2006). The control-value theory of achievement emotions: assumptions, \ncorollaries, and implications for educational research and practice. Educ. \nPsychol. Rev. 18, 315–341. doi: 10.1007/s10648-006-9029-9\nPekrun, R., Goetz, T., Frenzel, A. C., Barchfeld, P ., and Perry, R. P . (2011). \nMeasuring emotions in students’ learning and performance: the achievement \nemotions questionnaire (AEQ). Contemp. Educ. Psychol.  36, 36–48. doi: \n10.1016/j.cedpsych.2010.10.002\nPekrun, R., Goetz, T., Titz, W ., and Perry, R. P . (2002). Academic emotions \nin students’ self-regulated learning and achievement: a program of qualitative \nand quantitative research. Educ. Psychol.  37, 91–105. doi: 10.1207/\nS15326985EP3702_4\nPekrun, R., Götz, T., and Perry, R. P . (2005). Achievement emotions questionnaire \n(AEQ). User’s manual. Department of Psychology, University of Munich, \nMunich, Germany.\nPekrun, R., Lichtenfeld, S., Marsh, H. W ., Murayama, K., and Goetz, T. (2017). \nAchievement emotions and academic performance: longitudinal models of \nreciprocal effects. Child Dev.  88, 1653–1670. doi: 10.1111/cdev.12704\nPekrun, R., and Perry, R. P . (2014). “Control-value theory of achievement \nemotions” in International handbook of emotions in education. eds. R. Pekrun \nand L. Linnenbrink-Garcia (New Y ork: Routledge), 130–151.\nPeterson, C. (2000). The future of optimism. Am. Psychol.  55, 44–55. doi: \n10.1037/0003-066X.55.1.44\nPeterson, C. (2006). A primer in positive psychology . New Y ork: Oxford \nUniversity Press.\nPiasecka, L. (2016). “ Activating character strengths through poetic encounters \nin a foreign language—a case study” in Positive psychology perspectives on \nforeign language learning and teaching. eds. D. Gabry ś-Barker and D. Ga łajda \n(Switzerland: Springer), 75–92.\nPiniel, K., and Albert, Á. (2018). Advanced learners’ foreign language-related \nemotions across the four skills. Stud. Second Lang. Learn. Teach.  8, 127–147. \ndoi: 10.14746/ssllt.2018.8.1.6\nPrior, M. T. (2019). Elephants in the room: an “affective turn, ” or just feeling \nour way? Mod. Lang. J.  103, 516–527. doi: 10.1111/modl.12573\nRobinson, D. N. (1991). Aristotle’s psychology . New Y ork, NY: Columbia \nUniversity Press.\nRode, M. (2013). Do good institutions make citizens happy, or do happy citizens \nbuild better institutions? J. Happiness Stud.  14, 1479–1505. doi: 10.1007/\ns10902-012-9391-x\nSaito, K., Dewaele, J., Abe, M., and In’nami, Y . (2018). Motivation, emotion, \nlearning experience, and second language comprehensibility development \nin classroom settings: a cross-sectional and longitudinal study. Lang. Learn. \n68, 709–743. doi: 10.1111/lang.12297\nScherer, K. R. (2013). The nature and dynamics of relevance and valence \nappraisals: theoretical advances and recent evidence. Emot. Rev. 5, 150–162. \ndoi: 10.1177/1754073912468166\nShao et al. Second Language Emotions and Positive Psychology\nFrontiers in Psychology | www.frontiersin.org 13 August 2020 | Volume 11 | Article 2142\nSeaton, C. L., and Beaumont, S. L. (2015). Pursuing the good life: a short-term \nfollow-up study of the role of positive/negative emotions and ego-resilience \nin personal goal striving and eudaimonic well-being. Motiv. Emot.  39, \n813–826. doi: 10.1007/s11031-015-9493-y\nSeligman, M. E. (2002). “Positive psychology, positive prevention, and positive \ntherapy” in Handbook of positive psychology . eds. C. R. Snyder and S. J. \nLopez (New Y ork, NY , US: Oxford University Press), 3–9.\nSeligman, M. E. (2011). Flourish: A visionary new understanding of happiness \nand well-being . New Y ork: Simon and Schuster.\nSeligman, M. E., and Csikszentmihalyi, M. (2000). Positive psychology: an \nintroduction. Am. Psychol. 55, 5–14. doi: 10.1037/0003-066X.55.1.5\nSeligman, M. E., Ernst, R. M., Gillham, J., Reivich, K., and Linkins, M. (2009). \nPositive education: positive psychology and classroom interventions. Oxf. \nRev. Educ.  35, 293–311. doi: 10.1080/03054980902934563\nSeligman, M. E. P ., Steen, T. A., Park, N., and Peterson, C. (2005). Positive \npsychology progress: empirical validation of interventions. Am. Psychol. 60, \n410–421. doi: 10.1037/0003-066X.60.5.410\nShao, K. Q., Pekrun, R., Marsh, H. W ., and Loderer, K. (2020). Control-value \nappraisals, achievement emotions, and foreign language performance: a latent \ninteraction analysis. Learn. Instr. 69. doi: 10.1016/j.learninstruc.2020.101356 \n[Epub ahead of print]\nShao, K. Q., Pekrun, R., and Nicholson, L. J. (2019). Emotions in classroom \nlanguage learning: what can we  learn from achievement emotion research? \nSystem 86:102121. doi: 10.1016/j.system.2019.102121\nShao, K. Q., Yu, W ., and Ji, Z. (2012). The relationship between EFL students’ \nemotional intelligence and writing achievement. Innov. Lang. Learn. Teach.  \n7, 107–124. doi: 10.1080/17501229.2012.725730\nShao, K. Q., Yu, W . H., and Ji, Z. M. (2013). An exploration of Chinese EFL \nstudents’ emotional intelligence and foreign language anxiety. Mod. Lang. \nJ. 97, 917–929. doi: 10.1111/j.1540-4781.2013.12042.x\nSin, N. L., and Lyubomirsky, S. (2009). Enhancing well-being and alleviating \ndepressive symptoms with positive psychology interventions: a practice-\nfriendly meta-analysis. J. Clin. Psychol.  65, 467–487. doi: 10.1002/jclp.20593\nSnyder, C. R., Lopez, S. J., Edwards, L., and Marques, S. (2015). The oxford \nhandbook of positive psychology . 3rd Edn . New Y ork: Oxford  \nUniversity Press.\nStarkey-Perret, R., Deledalle, A., Jeoffrion, C., and Rowe, C. (2018). Measuring \nthe impact of teaching approaches on achievement-related emotions: the \nuse of the Achievement Emotions Questionnaire. Br. J. Educ. Psychol.  88, \n446–464. doi: 10.1111/bjep.12193\nSwain, M. (2013). The inseparability of cognition and emotion in second \nlanguage learning. Lang. Teach. 46, 195–207. doi: 10.1017/S0261444811000486\nTeimouri, Y . (2017). L2 selves, emotions, and motivated behaviors. Stud. Second. \nLang. Acquis. 39, 681–709. doi: 10.1017/S0272263116000243\nTeimouri, Y ., Goetze, J., and Plonsky, L. (2019). Second language anxiety and \nachievement: a meta-analysis. Stud. Second. Lang. Acquis.  41, 363–387. doi: \n10.1017/S0272263118000311\nTeimouri, Y ., Plonsky, L., and Tabandeh, F . (2020). L2 grit: passion and \nperseverance for second-language learning. Lang. Teach. Res.  doi: 10.1177/ \n1362168820921895 [Epub ahead of print]\nWei, H., Gao, K., and Wang, W . (2019). Understanding the relationship between \ngrit and foreign language performance among middle school students: the \nroles of foreign language enjoyment and classroom environment. Front. \nPsychol. 10:1508. doi: 10.3389/fpsyg.2019.01508\nConflict of Interest:  The authors declare that the research was conducted in \nthe absence of any commercial or financial relationships that could be  construed \nas a potential conflict of interest.\nCopyright © 2020 Shao, Nicholson, Kutuk and Lei. This is an open-access article \ndistributed under the terms of the Creative Commons Attribution License (CC BY). \nThe use, distribution or reproduction in other forums is permitted, provided the \noriginal author(s) and the copyright owner(s) are credited and that the original \npublication in this journal is cited, in accordance with accepted academic practice. \nNo use, distribution or reproduction is permitted which does not comply with \nthese terms.",
  "topic": "Psychology",
  "concepts": [
    {
      "name": "Psychology",
      "score": 0.7860503196716309
    },
    {
      "name": "Positive psychology",
      "score": 0.6812601685523987
    },
    {
      "name": "Second-language acquisition",
      "score": 0.5318023562431335
    },
    {
      "name": "Context (archaeology)",
      "score": 0.4686809182167053
    },
    {
      "name": "Field (mathematics)",
      "score": 0.46761712431907654
    },
    {
      "name": "Cognitive psychology",
      "score": 0.44687986373901367
    },
    {
      "name": "Psychological intervention",
      "score": 0.4136952757835388
    },
    {
      "name": "Social psychology",
      "score": 0.3695392608642578
    },
    {
      "name": "Linguistics",
      "score": 0.28675657510757446
    },
    {
      "name": "Paleontology",
      "score": 0.0
    },
    {
      "name": "Pure mathematics",
      "score": 0.0
    },
    {
      "name": "Mathematics",
      "score": 0.0
    },
    {
      "name": "Psychiatry",
      "score": 0.0
    },
    {
      "name": "Biology",
      "score": 0.0
    },
    {
      "name": "Philosophy",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I50760025",
      "name": "Hangzhou Dianzi University",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I165525304",
      "name": "Edge Hill University",
      "country": "GB"
    },
    {
      "id": "https://openalex.org/I187400657",
      "name": "South China Normal University",
      "country": "CN"
    }
  ],
  "cited_by": 92
}