{
    "title": "A Data Mining Approach for Transformer Failure Rate Modeling Based on Daily Oil Chromatographic Data",
    "url": "https://openalex.org/W3088834408",
    "year": 2020,
    "authors": [
        {
            "id": "https://openalex.org/A5027312104",
            "name": "Wei Huang",
            "affiliations": [
                "Chongqing University"
            ]
        },
        {
            "id": "https://openalex.org/A5100362311",
            "name": "Xuan Li",
            "affiliations": [
                "Chongqing University"
            ]
        },
        {
            "id": "https://openalex.org/A5028864691",
            "name": "Bo Hu",
            "affiliations": [
                "Chongqing University"
            ]
        },
        {
            "id": "https://openalex.org/A5100778538",
            "name": "Jiahao Yan",
            "affiliations": [
                "Chongqing University"
            ]
        },
        {
            "id": "https://openalex.org/A5001989111",
            "name": "Lvbing Peng",
            "affiliations": [
                "Chongqing University"
            ]
        },
        {
            "id": "https://openalex.org/A5101624829",
            "name": "Yue Sun",
            "affiliations": [
                "Chongqing University"
            ]
        },
        {
            "id": "https://openalex.org/A5101986940",
            "name": "Xin Cheng",
            "affiliations": [
                "Chongqing University"
            ]
        },
        {
            "id": "https://openalex.org/A5053684153",
            "name": "Jinfeng Ding",
            "affiliations": [
                "Chongqing University"
            ]
        },
        {
            "id": "https://openalex.org/A5017941662",
            "name": "Kaigui Xie",
            "affiliations": [
                "Chongqing University"
            ]
        },
        {
            "id": "https://openalex.org/A5034904632",
            "name": "Qinglong Liao",
            "affiliations": [
                null
            ]
        },
        {
            "id": "https://openalex.org/A5001778158",
            "name": "Lingyun Wan",
            "affiliations": [
                null
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2608946692",
        "https://openalex.org/W2500834297",
        "https://openalex.org/W2979662676",
        "https://openalex.org/W2444690661",
        "https://openalex.org/W2067248431",
        "https://openalex.org/W2114793344",
        "https://openalex.org/W2916484015",
        "https://openalex.org/W2807046658",
        "https://openalex.org/W2610557515",
        "https://openalex.org/W2945876738",
        "https://openalex.org/W2100273549",
        "https://openalex.org/W2158071052",
        "https://openalex.org/W2758498471",
        "https://openalex.org/W2535500033",
        "https://openalex.org/W2572496364",
        "https://openalex.org/W2149447924",
        "https://openalex.org/W2385194251",
        "https://openalex.org/W2624220717",
        "https://openalex.org/W2026566079",
        "https://openalex.org/W3040828036",
        "https://openalex.org/W2900185692",
        "https://openalex.org/W2097407510",
        "https://openalex.org/W2767587205",
        "https://openalex.org/W2893023389",
        "https://openalex.org/W2606436201",
        "https://openalex.org/W2121589417",
        "https://openalex.org/W2468457481",
        "https://openalex.org/W2996907627",
        "https://openalex.org/W2965147845",
        "https://openalex.org/W2973406612",
        "https://openalex.org/W3026374379",
        "https://openalex.org/W2864622186",
        "https://openalex.org/W6775425395",
        "https://openalex.org/W1990804385",
        "https://openalex.org/W2116893630",
        "https://openalex.org/W6662606999",
        "https://openalex.org/W2406397217",
        "https://openalex.org/W1997731496",
        "https://openalex.org/W2089978275",
        "https://openalex.org/W2972862101",
        "https://openalex.org/W2165982332",
        "https://openalex.org/W2944364416",
        "https://openalex.org/W2962772482",
        "https://openalex.org/W2160291822",
        "https://openalex.org/W2779432642",
        "https://openalex.org/W2792530194",
        "https://openalex.org/W2003318329",
        "https://openalex.org/W3101921698",
        "https://openalex.org/W2048907231",
        "https://openalex.org/W3015291549",
        "https://openalex.org/W82275334",
        "https://openalex.org/W1569468020",
        "https://openalex.org/W4285719527"
    ],
    "abstract": "Evaluating the real-time failure rate of transformers can effectively guide the planning of maintenance and reduce their failure risk. This paper proposed a novel transformer failure rate model that considers the impact of maintenance based on daily oil chromatographic monitoring data mining. Firstly, to ensure the quality of the modeling data, an improved k-nearest neighbor (KNN) algorithm based on genetic algorithm (GA) is proposed to repair the missing monitoring data. The repaired data is then mapped to the equivalent state duration (ESD) by the M-BPNN proposed, which is used to modify the multistate Markov process of transformers so as to quantify the impact of maintenance on failure rate. Considering the changing characteristics of the dissolved gases' content in the short period, the ESD is further merged in sequential periods to obtain the merged equivalent state duration (MESD). Finally, an analytical function of the transformer failure rate with respect to the MESD is obtained. Case studies on a typical substation demonstrate that the proposed approach has the ability to characterize the impact of maintenance and the actual failure rate, thereby improving the accuracy of the substation reliability assessment.",
    "full_text": "Received September 15, 2020, accepted September 18, 2020, date of publication September 23, 2020,\ndate of current version October 2, 2020.\nDigital Object Identifier 10.1 109/ACCESS.2020.3026171\nA Data Mining Approach for Transformer\nFailure Rate Modeling Based on Daily Oil\nChromatographic Data\nWEI HUANG\n1, XUAN LI1, BO HU\n 1, (Member, IEEE), JIAHAO YAN\n1, (Member, IEEE),\nLVBING PENG1, YUE SUN1, XIN CHENG\n 1, JINFENG DING1,\nKAIGUI XIE\n 1, (Senior Member, IEEE), QINGLONG LIAO2, (Member, IEEE),\nAND LINGYUN WAN2, (Member, IEEE)\n1State Key Laboratory of Power Transmission Equipment and System Security and New Technology, Chongqing University, Chongqing 400044, China\n2State Grid Chongqing Electric Power Research Institute, Chongqing 400000, China\nCorresponding author: Kaigui Xie (kaiguixie@vip.163.com)\nThis work was supported by the Science and Technology Project of State Grid Corporation of China under\nGrant 5100-201999332A-0-0-00.\nABSTRACT Evaluating the real-time failure rate of transformers can effectively guide the planning of\nmaintenance and reduce their failure risk. This paper proposed a novel transformer failure rate model that\nconsiders the impact of maintenance based on daily oil chromatographic monitoring data mining. Firstly,\nto ensure the quality of the modeling data, an improved k-nearest neighbor (KNN) algorithm based on\ngenetic algorithm (GA) is proposed to repair the missing monitoring data. The repaired data is then mapped\nto the equivalent state duration (ESD) by the M-BPNN proposed, which is used to modify the multistate\nMarkov process of transformers so as to quantify the impact of maintenance on failure rate. Considering\nthe changing characteristics of the dissolved gases’ content in the short period, the ESD is further merged\nin sequential periods to obtain the merged equivalent state duration (MESD). Finally, an analytical function\nof the transformer failure rate with respect to the MESD is obtained. Case studies on a typical substation\ndemonstrate that the proposed approach has the ability to characterize the impact of maintenance and the\nactual failure rate, thereby improving the accuracy of the substation reliability assessment.\nINDEX TERMS Oil-immersed transformer, data mining, oil chromatographic data, reﬁned failure rate\nmodel, substation reliability.\nNOMENCLATURE\nMost of the symbols and notations used throughout this paper\nare deﬁned below for quick reference.\nA. ABBREVIATIONS\nDGA Dissolved gas analysis\nSD State duration\nESD Equivalent state duration\nMESD Merged equivalent state duration\nB. INDICES\nn Index of days\nk Index of fault types\nl Index of dissolved gases\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Ying Xu\n.\nu, v Index of parent samples\ns Index of child samples\ny Index of the missing dissolved gas\nw Index of nearest DGA data samples\nt Index of operation time\nf Index of data samples from a speciﬁc transformer\nC. PARAMETERS\nG The target matrix G of storing the DGA data\nGk The DGA data matrix of fault type k\nNk The number of days in fault type k\ngs The child samples before mutation\ng′\ns The child samples after mutation\ngk,min The minimum values of each dissolved gas\ncontent in Gk\ngk,max The maximum values of each dissolved gas\ncontent in Gk\nVOLUME 8, 2020 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see https://creativecommons.org/licenses/by/4.0/ 174009\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\ngtrain,w The wth sample in Gtrain\ngtest (l) The lth dissolved gas in gtest\nˆgtest (y) The repairing value of the missing data\nζi,j The transition rate from state i to state j\nti The SD corresponding to operation time t\nt\"\ni The ESD corresponding to operation time t\nt\"\ni The MESD corresponding to operation time t\nC The external random failure rate\nλ(t) The failure rate at time t\nDistf ,f +1 The distance between the DGA data samples\ngf and gf +1.\nt′\nb The ESD that corresponds to the bth data\nsample in period p.\nt\n′′\np The MESD that corresponds to period p\nI. INTRODUCTION\nAs the core electrical equipment in a substation, the trans-\nformer plays a signiﬁcant role in the substation reliability [1].\nThe failure rate is a signiﬁcant parameter that measures the\nability of a transformer to maintain its normal operations.\nEvaluating the failure rate of transformers accurately can lay a\nsolid foundation for the reliability assessment of substations.\nSo far, the average failure rate model has been widely used\nin the substation reliability assessment. However, this model\nassumes the constant failure rates and cannot reﬂect the\nshort-term ﬂuctuation of the reliability level of an individual\ntransformer [2], [3]. In reality, the failure rate of a transformer\nchanges in real time according to its own operating condi-\ntion [4], [5]. Therefore, it is necessary to establish a novel\ntime-varying transformer failure rate model [6], [7].\nTransformers faults can be divided into internal latent fault\nand external random fault [8]. Owing to the differences in the\ndevelopment modes, these two kinds of fault should be con-\nsidered separately when modeling the failure rate model [5].\nThis paper focuses on the modeling of internal latent failure\nrate of transformers.\nAt present, the main approach for establishing the internal\nlatent failure rate model is to analyze the internal physical\nand chemical processes of the transformers [1]. The degree\nof the internal latent failure is characterized by a distribu-\ntion function, such as the Arrhenius-Weibull distribution.\nAccordingly, the trends of the failure rate can be evaluated.\nRecently, modeling the failure rate of transformers based on\noil chromatographic data has become a popular method [9].\nOil chromatographic data, also known as dissolved gas\nanalysis data (DGA data), include the content of the dissolved\ngases in a transformer’s oil [9]. These dissolved gases are\ngenerated from the operational and fault events of the trans-\nformer [10]. Therefore, the content of the dissolved gases\nhas a tight connection to the fault type and fault severity of\nthe transformers [11]. By now, DGA data has been widely\napplied in the transformer faults diagnostics and remaining\nuseful life (RUL) estimation aided by some powerful machine\nlearning algorithms such as dynamic bayesian networks and\ntemporal fault trees [13]–[17]. Reference [1] captures the\nqualitative causal relationship between dissolved gases and\ntransformer faults, then a probabilistic diagnosis framework\nis proposed. Reference [18] established an improved trans-\nformer RUL prediction approach combining the data-driven\nthermal forecasting models and model-based lifetime exper-\nimental models. These studies excavate the value of DGA\ndata promote its application. To the best of the authors’\nknowledge, DGA data also accurately characterize the devel-\nopment degree of internal latent faults and can be used to\nestablish the models of internal latent failure rate of trans-\nformer [19]–[25]. Reference [19]–[21] choose the DGA data\nas the features and solve the multistate Markov process to\nobtain the time-varying failure rate model of transformers [5].\nHowever, the transformer failure rates obtained by those mod-\nels are still equal as long as the state and the state duration are\nthe same although operating at different operation time. That\nis these models cannot describe the impact of maintenance\non the transformer failure rate [22]. The reason for this defect\nis that those models ignored the actual operating conditions\nof the day when calculating the real-time failure rate of\nthe transformer. To overcome this problem, some improved\nmodels introduced more covariates so as to describe the\noperating conditions and quantify the impact of maintenance\nwhen modeling the failure rates [22]. Reference [23] pro-\nposed a transformer failure rate model based on Proportional\nhazard model. In this model, the information of real-time\nhot spot temperatures (HST) is introduced to reﬂect the\nreal-time operating conditions. Reference [24] further used\nsome covariates such as the moisture content of insulating\npaper to modify the Markov process. Reference [25] selected\nthe service life of the equipment as new features to establish\nthe failure rate model.\nUnfortunately, these external covariates such as service\nlife, HST are hard to accurately describe the internal\noperating conditions of the transformer on daily basis.\nBesides, the acquisition of these covariates relies on complex\naccelerated aging experiments and it is difﬁcult to obtain the\nactual operating data. An alternative method is to mine the\ndaily DGA data, which is the most direct reﬂection of\nthe daily operating conditions of the transformer. However,\nthe sampling resolution of the DGA data in the above models\nis usually measured in months [26], making it difﬁcult to\ncapture the short-term changes in the DGA data.\nIn addition, the quality of DGA data is another important\nfactor that affects the accuracy of the transformer failure diag-\nnosis and failure rate modeling [27]. Nonetheless, a repair-\ning model for missing DGA data is absent in the existing\nliterature.\nFor the system reliability assessment considering com-\nponent failures, a whole range of different approaches to\nthe problem have been proposed. Reference [28] established\nan uncertainty-aware dynamic reliability analysis framework\nwithout the need of exact failure data of its components.\nReference [29] presented a framework for prognostics-\nupdated dynamic dependability assessment based on the\nonline data analysis. Reference [30] used the FTA for per-\nforming reliability analysis of an management system. In this\n174010 VOLUME 8, 2020\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\nmodel, the system reliability was also evaluated based on\nthe given failure rates of the components. Reference [31]\nestablished a conceptual framework to incorporate com-\nplex basic events in hierarchically performed hazard origin\nand propagation studies (HiP-HOPS), which can guarantee\nthe modelling capability on complex failures and the efﬁ-\nciency of Model-based safety analysis (MBSA) effectively.\nReference [16] gave the detailed classiﬁcation for safety\nmodels associated with machine learning (ML) and further\nproposed a novel approach based on ML and real-time oper-\national data to reduce the difﬁculty in modeling and evalua-\ntion these complex safety-critical systems. In [32], the state\nanalysis method is introduced for generic power system reli-\nability assessment. Considering the requirements of the case\nstudies, state analysis method is adopted in this paper for the\nsubstation reliability evaluation.\nThis paper established a novel modeling framework for\ntransformer failure rate based on daily DGA data mining.\nThe framework solves two main problems of repairing the\nmissing DGA data and quantifying the impact of maintenance\non failure rates. The short-term change characteristics of\ndissolved gases’ content are also analyzed in this paper.\nIn summary, the main contributions of this paper are as\nfollows:\n1. A data repairing method derived from the improved\nKNN is proposed; thus, the quality of the modeling data is\nwell guaranteed.\n2 In order to eliminate the inﬂuence of unbalanced sample\nspace on the repairing accuracy, the Genetic algorithm (GA)\nis introduced to construct a balanced sample space.\n3. The parameter of ESD, which can reﬂect the real-\ntime operational conditions when calculating the failure rate,\nis proposed to modify the Markov failure rate model. And\nthen, a Multi-back-propagation neural network (M-BPNN)\nmodel is constructed to map the DGA data to ESD.\n4. The MESD is further obtained by merging the ESD\nbased on the analysis of the variation in the content of the dis-\nsolved gases. Thus, an analytical function of the failure rate\nwith respect to the MESD is obtained based on a multistate\nMarkov process.\nThe rest of this paper is organized as follows. The model\nfor repairing the missing DGA data based on the GA\nand improved KNN algorithm is proposed in Section II.\nSection III established the transformer failure rate model\nproposed and its validation method. Case studies are given\nin Section IV . Finally, Section V concludes the paper.\nII. REPAIRING MODEL FOR MISSING DGA DATA\nThe quality of DGA data is an important factor that affects\nthe accuracy of the transformer failure rate model. The\nDGA data could be missing in the process of collection,\ntransmission and storage [33]. It is necessary to repair the\nmissing data. Most existing data repairing methods are based\non time series analysis [34]. These methods have performed\nwell when the missing data occurs under the normal state\nof transformers. However, the missing data often appears\nwhen the transformer works in abnormal/fault states [35].\nTherefore, this paper proposes an improved KNN algorithm\nto repair the missing data. However, the number of DGA data\nsamples in the abnormal or fault state is much smaller than\nthat in the normal state due to the low occurrence probability\nof abnormal and fault states. It could result in an unbalanced\ndata sample space and errors for the KNN algorithm. To avoid\nthis problem, a balanced sample space of DGA data is ﬁrst\nconstructed through sample expansion based on a GA.\nA. EXPANSION OF DGA DATA BASED ON GA\nThe genetic algorithm imitates the process of biological evo-\nlution and includes operations such as selection, crossover\nand mutation [36]. This paper proposes a sample expansion\nmethod that is inspired by the population generation method\nof the GA.\nA target matrix G is created for storing the daily DGA\ndata, including the content of each type of gas in N days. The\nnth row of the N∗L matrix G represents the DGA data sample\nof nth day. It can be expressed as:\ngn =(gn1,gn2,...... gnL ) (1)\nwhere 1 ≤n ≤N, and L is the total number of types of\ndissolved gases. The dissolved gases include H2, C2H2, CH4,\nC2H6, C2, CO, CO2 and total hydrocarbons.\nThe fault types for these N days could be determined\nthrough their content ratios of dissolved gases [37], [38]. The\n12 fault types and their corresponding ranges for the ratios of\ndissolved gases are given in Table 1.\nAccordingly, each DGA data sample in G can be allocated\nto one of these fault types. The number of days when the\ntransformer in fault type k (1 ≤k ≤12) is Nk . It has the\nfollowing relationship with N:\nN =\n12∑\ni=1\nNk (2)\nThe DGA data belonging to type k constitutes an N∗\nk L\nmatrix Gk :\nGk =\n\n\nG1,1 G1,2 G1,L\nG2,1 G2,2 G2,L\nGNk,1 GNk,2 GNk,L\n\n (3)\nChoose Gk as the initial parent population and randomly\nmatch the data samples contained in this population into pairs.\nA total of Nk /2 pairs of parent samples can be obtained.\nTake a pair of parent samples, for example, gk,u and gk,v,\nand perform the crossover operation on this pair, which is\nexpressed as follows:\n\n\n\ngs1 =1.5gk,u −0.5gk,v\ngs2 =−0.5g k,u +1.5gk,v\ngs3 =(gk,u +gk,v)/2\n(4)\nwhere gs1, gs2 and gs3 are newly generated DGA data sam-\nples, named here child samples. Formula (4) presents a\ntypical linear crossover in GA proposed by Wright [36].\nVOLUME 8, 2020 174011\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\nTABLE 1. Rogers ratio method [35].\nIn formula (4), the coefﬁcient of gk,u and gk,v are set\nto 1.5 and -0.5 when generating gs1, to prevent gs1 from\nbeing too similar to gk,u or gk,v. The same reason holds for\ngs2 and gs3. By keeping all the parent samples and child\nsamples, the number of DGA data samples corresponding to\nfault type k will be 2.5N k .\nTo ensure the heterogeneity between the child samples\nand parent samples, an uncertain increment is added to the\noriginal values of each child sample. The step length variation\nmethod [39] is used to process those child samples obtained\nfrom (5).\ng′\ns =gs ±0.5g1 ·1\n1=\nm∑\nq=1\na(q)\n2q (5)\nwhere a(q) is equal to 1 with a probability of 1/m. Otherwise,\na(q) =0. Here, m is set to 20 normally, and g1 is a variation\nvector with the value range [g k,min, gk,max].\nFormula (5) uses an uncertain probability 1 multiplied\nby an uncertain step length g1 to describe the uncertain\nincrement for gs. Note that the step length g1 is bounded by\nthe value range of each dissolved gas in Gk .\nAfter the process of mutation for child samples, the valid-\nity of each child sample generated should be examined;\nthat is, only the samples with values within [0.95 gk,min,\n1.05 gk,max] can be added to Gk . Otherwise, the samples\nshould be removed from Gk .\nPerform the above operations iteratively until the sample\nsize meets the requirement. At this point, the algorithm ends,\nand Gk is updated. The sample expanding to consider other\nfault types can be treated with the same method. Finally, the\ndata matrixes for all fault types constitute the updated G.\nB. REPAIRING METHOD BASED ON IMPROVED KNN\nThe repairing method proposed in this paper is developed\nfrom the observation that the DGA data under the same\nabnormal/fault state have similar patterns and the missing\ndata can be estimated according to these DGA data [34]. This\npaper uses the KNN algorithm [40] to ﬁnd adjacent samples\nof the DGA data samples. The missing data is then repaired\naccording to these adjacent samples.\nDue to the missing data, the dimensionalities of the test\nsamples and the training samples are not equal. Therefore,\nit is hard to choose the nearest samples by the Euclidean dis-\ntance used in the traditional KNN. In this paper, the Pearson\nsimilarity [41] is selected to be the measure of the distance\nbecause it is not affected by the dimensionality mismatches\nbetween the samples.\nTo avoid the error in the distance calculation caused by the\ndimensionality mismatch and elementwise numerical differ-\nence, the DGA data samples should ﬁrst be centralized. For\nthe nth DGA data sample in G, gn, its centralization can be\nrealized according to the following formula (6):\ngn(l) =gn(l) −µn (6)\nwhere µn is the mean value of all elements in gn.\nFor the testing sample gtest to be repaired, if the yth element\nof gtest, gtest (y), is missing, then the centralization formula\nshould be described as follows:\ngtest (l) =\n{\n0, l =y\ngtest (l) −µ′\ntest , l ̸=y (7)\nwhere µ′\ntest is the mean of all elements in gtest after setting\nthe yth element gtest (y) to 0.\nSimilarly, the other data samples in G can be processed by\nformulas (6) and (7). The advantage of (6) and (7) is that each\ncentralized element becomes a value regardless of its original\nunit and magnitude.\nThe distance Dn between the centralized test sample, gtest ,\nand the nth sample in G, gn, can be calculated based on the\nPearson similarity:\nDn =cov(gtest ,gn)\nσgtest ∗σgn\n(8)\nwhere cov represents the covariance between gtest and gn.\nσ means the standard deviation of the vector. A smaller\nDn implies a closer distance between gtest and gn and more\nsimilarity between them.\nAccording to formulas (8), the distance between gtest and\neach sample in the updated G can be calculated. Select r\nnearest training samples and record these samples as Gtrain.\nThe weighted average value in Gtrain is calculated as the\n174012 VOLUME 8, 2020\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\nrepaired value of the missing data.\nˆgtest (y) =\n( r∑\nw=1\nηtrain,w ·gtrain,w(y)\n)\n/r (9)\nwhere ηtrain,w is the weight of each data sample in Gtrain,and\n1 ≤w ≤r. Details of the weight calculation method can\nbe found in [42]. A smaller distance in (8) results in a larger\nweight in the estimation of the missing data, which indicates\nits greater similarity to the test sample gtest .\nIII. REFINED FAILURE RATE MODEL OF THE\nTRANSFORMER\nA. MULTISTATE MARKOV PROCESS OF A TRANSFORMER\nAccording to IEEE Std C57.104 [35], the operational states\nof transformers can be divided by their DGA data into four\nstates: normal state, abnormal state, warning state and failure\nstate.\nAs a typical repairable component, the operating state of\nthe transformer generally transfers between the above four\nstates. Speciﬁcally, the transformer may change from a nor-\nmal state to an abnormal/warning state with an increasing\nfailure rate during the operation. It can also return to the\nnormal state from the abnormal/warning state through main-\ntenance. The multistate Markov process of the transformer is\nillustrated in Fig 1.\nFIGURE 1. Multistate Markov model of the transformer.\nIn Fig 1, ζi,j represents the transition rate from state i to\nstate j, which can be calculated as follows:\nζi,j =counti,j\nTi\n(10)\nwhere counti,j is the times that the transformer transfer from\nstate i to the j. Ti is the total duration that the tranformer stays\nin state i.\nFormula (10) can be used to calculate the transition rate\nbetween states with a direct transition path. Based on the rela-\ntionships in Fig 1, the transition rates between all states form\na Markov time-varying state transition matrix A, as follows:\nA =\n\n\n−ζ1,2 ζ2,1 ζ3,1 0\nζ1,2 −(ζ2,1 +ζ2,3) ζ3,2 0\n0 ζ2,3 −(ζ3,1 +ζ3,2 +ζ3,4) 0\n0 0 ζ3,4 0\n\n\n(11)\nwhere Ai,j =0 indicates that there is no direct transition path\nbetween state i and state j.\nAssume that the probability of the transformer operating in\nvarious states at time t is P(t) =[P1(t), P 2(t), P 3(t), P 4(t)].\nSince the Markov process established in this paper is contin-\nuous in operation time, this section uses the Kolmogorov dif-\nferential equation [43] to calculate the P(t). The Kolmogorov\ndifferential equation that corresponds to equation (11) can be\nexpressed as follows:\ndP(t)\ndt =AP(t) (12)\nwhere the left side of equation (12) is the derivative of P(t )\nwith respect to the operation time t.\nThe probability of the transformer operating in various\nstates P(t) can be obtained by solving (13):\nP(t) =eAt P(0) (13)\nwhere\neAt =α0I +α1A +α2A2 +α3A3 (14)\nWhen operating in the failure state (i.e. state 4), the trans-\nformer needs to be out of service and protected immediately.\nTherefore, the failure state is considered as the ending state of\nthe internal latent fault of the transformer. Consequently, the\ninternal latent failure rate at time t can be considered as the\nprobability that the transformer transfers from the operating\nstate to the failure state at time t, that is P4(t).\nIt should be noted that P(0) is the initial conditions of the\ndifferential equation (12). It denotes the initial probability\nthat the transformer operates in each state at time t. The\nvalue of the ith element is set to 1 if the transformer is\nin state i at time t. Otherwise, it is set to 0. For example,\nP(0) =[1 0 0 0] is the initial conditions for solving the\nanalytical expressions of the time-varying internal latent fail-\nure rate when the transformer is operating in normal state\nat time t. Similarly, P(0) =[0 1 0 0] and P(0) =[0 0 1 0]\nare the initial conditions for obtaining the failure rate expres-\nsions when the transformer operates in abnormal state and\nwarning state at time t respectively. Additionally, α0, α1, α2,\nand α3 are exponential functions determined by the eigen-\nvalues of matrix A. These functions can be solved by the\nHamilton-Hailey method [24], [46].\nDeﬁne the SD ti as the duration that the transformer has\nstayed in state i at time t, and 1 ≤ti ≤Ti. From equations\n(10)-(14), the analytical expressions of the failure rate λi(t)\nfor the latent failure of the transformer can be expressed by\nequation. As shown in formula (15), as shown at the bottom\nof the next page, the time-varying internal latent failure rate\nof transformer at time t under different operating states has\ndifferent analytical expressions.\nWhen calculating the latent failure rate of the transformer\nat operation time t, the variable used should be the SD that\ncorresponds to t, ti, rather than t. A constant C is chosen\nto represent the external random failure rate of the trans-\nformer [27]. The total failure rate at time t can be obtained\nVOLUME 8, 2020 174013\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\nas follows:\nλ(t) =λi(ti) +C (16)\nThe above failure rate model is called the Markov fail-\nure rate model (Markov model). An illustrative example is\ngiven in Fig 2, which shows the change in the failure rate\nwith the operation time, according to the Markov failure rate\nmodel.\nFIGURE 2. Failure rate based on Markov failure rate model.\nSuppose that the maintenance is performed on the trans-\nformer at time t3 in a warning state, which results in a\nsigniﬁcant decrease in the failure rate at time t3. The SDs\nin state 2 at time t1 and t2 are equal, and the failure rates at\ntime t1 and t2 calculated by formula (16) and are also the\nsame. The reason for equal SDs at times t1 and t2 is that\nthe Markov model always assumes that the transformer can\nreturn to the initial state after the maintenance is performed at\ntime t3 [22].\nObviously, the values of SD ti used in the Markov model\nare determined only by the current state and the correspond-\ning state duration at time t. As along as the transformer is\nunder the same state and has the same state duration, the val-\nues of SD remain the same. However, the maintenance might\nnot return the transformer to its original condition [22]. The\nSD at time t2 after maintenance should be no longer the same\nas that at time t1. Therefore, the Markov failure rate model\ntends to have an optimistic view of the impact of maintenance\nby ignoring the actual operating condition after maintenance.\nThe next section introduces a modiﬁcation of SD combined\nwith the actual operating condition after the maintenance to\neffectively describe the impact of the maintenance.\nB. REFINED MODEL OF THE TRANSFORMER FAILURE\nRATE\n1) MODELING OF ESD\nTo quantify the impact of the maintenance, the SD ti in for-\nmula (16) is modiﬁed to its corresponding ESD t′\ni . Compared\nwith SD, ESD is able to simultaneously consider the current\nstate, the corresponding state duration and the operating con-\ndition at time t. The DGA data should be accounted for in\nthe calculation of ESD because it can efﬁciently describe the\noperating condition of the transformers.\nFig 3 illustrates the modiﬁcation of SD to ESD. The DGA\ndata that corresponds to time t is used to obtain t′\ni . The\nquantitative relationship with non-linear correlation between\nthe ESD and the DGA data is modeled by BPNN in this\npaper. Note that the other neural network models like Radial\nBasis Function neural network (RBF) can also be used for\nmodeling [44], [45].\nFIGURE 3. The process of modifying SD to ESD.\nBPNN is a multilayer feedforward network that is trained\nby an error back-propagation algorithm. This network is able\nto describe nonlinear relationships and has a good learning\nability [46]. In addition, BPNN has been proved that it has\na reasonable explainability [47].The network structure of the\nBPNN is shown in Fig 4:\nAs seen from Fig 4, the BPNN includes an input layer,\nhidden layer and output layer. Formula (17) describes the\nfeature delivered from the input layer to the hidden layer:\nh1 =σ1(W1x +b1) (17)\nwhere h1 is the feature vector for the ﬁrst hidden layer.\nX is the input vector. W1 is the weight coefﬁcient matrix of\nλ1(t) =α3ζ1,2ζ2,3ζ3,4 if P(0) =\n[1 0 0 0 ]\nλ2(t) =ζ2,3ζ3,4[α2 −α3(ζ2,3 +ζ3,4 +ζ3,2 +ζ3,1 +ζ2,1)] if P(0) =\n[0 1 0 0 ]\nλ3(t) =α1ζ3,4 −α2ζ3,4(ζ3,4 +ζ3,2 +ζ3,1) +α3ζ3,4[ζ2,3ζ3,2 +(ζ3,4 +ζ3,2 +ζ3,1)2] if P(0) =\n[0 0 1 0 ]\n(15)\n174014 VOLUME 8, 2020\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\nFIGURE 4. The structure of the BPNN.\nthe hidden layer. B1 is the bias vector. 61 is the activation\nfunction.\nA sigmoid function is used as the activation function,\nwhich is shown in(18). The relationships between the hidden\nlayers can be expressed as (19) for the multilayer neural\nnetworks.\nσ1(z) = 1\n1 +e−z (18)\nhe =σe(Wehe−1 +be) (19)\nwhere e is the index of the hidden layers. We is the weight\ncoefﬁcient matrix of the eth hidden layer. Be is the bias vector\nof the eth hidden layer.\nAssuming that there are X hidden layers in total, the pre-\ndicted output ˆy can be described as:\nˆy =σe(WyhX +by) (20)\nSince the calculation of the output layer is exactly the same\nas the hidden layer, the output layer can be regarded as the\nX +1th hidden layer. The error δy between the predicted\noutput and the actual output can be calculated as\nδy =ˆy −y (21)\nCombining (20) and (21), the back derivation of the error\nof the eth hidden layer can be expressed as:\nδe =WT\ne δe+1.×(he ·(1 −he)) (22)\nwhere the weight coefﬁcient matrix of the eth hidden layer\ncan be updated as:\nWe =We +δe+1 ·hT\ne (23)\nThe above is an iteration in the training process of the\nBPNN. The learning parameters of the BPNN can be tuned\nafter several iterations to obtain a more accurate BPNN\nmodel.\nThe ESD is equal to its SD at any time before the main-\ntenance of the transformer. Nonetheless, this circumstance\nis not the case after maintenance. To correctly represent\nthe relationships between the ESD and DGA data, only the\nDGA data and its corresponding ESD (equal to SD) before\nmaintenance should be selected as the training samples of the\nBPNN.\nThe size of a single BPNN model could be too large if it\nis designed to estimate the ESD under all possible operating\nstates. It reduces the computational efﬁciency of the model.\nTo handle this problem, the Multi-BP neural network (M-\nBPNN) is trained. It contains four BPNNs, one for each oper-\nating state. The structure of the M-BPNN is shown in Fig 5.\nFIGURE 5. The structure of the M-BPNN.\nThe steps of estimating ESD by M-BPNN are as follows:\nTraining:\nSTEP1: Select the DGA data Ginit in each state before\nmaintenance as the input. The corresponding SD Tinit are\nused as the output. These data together form the training\nsamples of M-BPNN.\nSTEP2: Tune the learning parameters. The training sam-\nples are inputted into M-BPNN for learning, in such a way\nthat the mapping relationship between the input and output\ncan be constructed.\nTesting:\nSTEP3: Choose the DGA data Gaft after maintenance and\ndetermine the operating state of the transformer. Next, input\nthe data into the different BPNN models according to the\ncorresponding states. Finally, the ESD T′\naft corresponding to\nthe DGA data Gaft can be estimated from the BPNN model.\n2) MODELING OF THE MESD\nMinor changes in the dissolved gases within a short period\nof time are commonly seen in the DGA data. Such changes\ndo not necessarily indicate changes in the failure rates. If the\nchanges in the dissolved gases between any two days are\nless than a given threshold in this period, then the ESD and\nfailure rate of the transformer can be considered to be the\nsame. Therefore, the ESD in this period could be merged into\nthe same value. To achieve this goal, this paper proposes a\nclustering algorithm based on the distance matrix between the\ntime series of the DGA data. By this method, the time series\nof the DGA data can be partitioned into different sequential\nperiods.\nThe ﬁrst step of the clustering algorithm proposed is to\ncreate a distance matrix, which can be expressed as:\nDist =\n\n\nDist1,1 Dist1,2 Dist1,F\nDist2,1 Dist2,2 Dist2,F\nDistF,1 DistF,2 DistF,F\n\n (24)\nwhere F is the number of DGA data samples of a particular\ntransformer. Each element in matrix Dist adopts the standard\nVOLUME 8, 2020 174015\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\nEuclidean distance:\nDistf ,f +1 =\nL∑\ni=1\n√[\ngf (i) −gf +1(i)\n]2\nsi\n(25)\nwhere 1 ≤f <F, and si is the standard deviation of each ele-\nment. The advantage of using the standard Euclidean distance\nis that this formula can avoid the inﬂuence of dimensionality\ndifferences in the distance calculation.\nNext, the procedure of the clustering algorithm proposed\nin this section is shown in Table 2.\nTABLE 2. The algorithm flow for obtaining MESD.\nAssuming that time t is clustered into period p, the\nMESD t\n′′\ni corresponding to time t can be obtained by aver-\naging the ESD of each day in period p:\nt\n′′\np =\nq∑\nb=1\nt′\nb\nq (26)\nwhere q is the number of data samples in period p. Here, t′\nb is\nthe ESD corresponding to the bth data sample in this period.\nThe total failure rate at time t can be modiﬁed\nfrom (15) and (16) by replacing the parameter ESD t′\ni with\nMESD t\n′′\ni (t\n′′\np ):\nλ(t) =λi(t\n′′\ni ) +C (27)\nCombining (26) and (27), the analytical failure rate model\nproposed in this paper is established.\nC. VERIFICATION METHOD OF THE FAILURE RATE MODEL\nAlthough the failure rate of an individual transformer is\naffected by factors such as the region, operation time, and\nstatistical methods, the transformers’ failure rates have sim-\nilar changing trends over time [48], [49]. The trend in the\nindividual transformer failure rates should be consistent with\nthe statistical data of the failure rate that is observed from\nmultiple transformers. This paper proposes a veriﬁcation\nmethod of the transformer failure rate model by comparing\nthe similarity in the changing trend of the failure rate over\ntime.\nSuppose that λpro = {λpro,1, λpro,2, λpro,3,...,λ pro,τ}\nis the time series of the time-varying failure rates of an\nindividual transformer obtained from the failure rate model.\nAdditionally, λsta ={λ sta,1, λsta,2, λsta,3,...,λ sta,υ} is the\ntime the series of failure rates from the statistical data of\nmultiple transformers. The similarity between the overall\nfailure rate and the individual transformer failure rate can be\ncharacterized by the parameter RMSD as follows:\nRMSD =DTW (τ,υ) (28)\nwhere τ and υ are the number of points in the sequence\nλpro and λsta respectively. DTW(τ, υ) represents the distance\nbetween λpro and λsta with dynamic time regularization [50]:\nDTW (o,z) =DTW (o,z)\n+min {DTW (o −1,z),DTW (o,z −1)\n+DTW (o −1,z −1)} (29)\nwhere 2 ≤o ≤τ, 2 ≤z ≤υ. DTW(o, z) represents the\nEuclidean distance between the oth point of the sequence λpro\nand the zth point of the sequence λsta. A smaller RMSD value\nindicates greater similarity between the trends of the two\nfailure rate time series. As a result, the change in the failure\nrate of an individual transformer calculated by the failure\nrate model is more consistent with that obtained from the\nstatistical data; i.e., the model is more accurate.\nTo better explain how different methods mentioned above\njoin together to established the novel transformer failure rate\nmodel above, the ﬂowchart of the transformer failure rate\nmodeling process proposed is given in Fig 6. Note that the\nproposed validation method in Section III-C does not need to\nbe considered in the ﬂowchart description below.\nAs shown in Fig 6 above, the failure rate modeling pro-\nposed can be divided into three main parts including repairing\nthe missing DGA data, modifying the model parameters and\ncalculating the transformer failure rate. The detailed explana-\ntion of part 1, part 2 and part 3 can be found in the section II\nand section III.\nIV. CASE STUDY\nThis paper uses the DGA data of multiple 110 kV\noil-immersed power transformers from an electrical company\nin southwest China in 2017 to verify the proposed failure\nrate model of a transformer. The model is applied to two\ntransformers of a typical substation, as shown in Fig 7. The\ntwo 220/110 kV transformers, T1 and T2, use the same DGA\ndata. The external failure rate of transformer C is set to 0.005.\nThe constant failure rate λc of the two transformers is set\nto 0.2. The reliability data and load data of this substation can\nbe found in [51]. The failure rates from the statistical data of\nmultiple transformers can be found in [52].\nIn this section, study 1 veriﬁes the effectiveness of the\nrepairing method for the missing DGA data. In Study 2,\nthe failure rate of the transformer without maintenance was\ncalculated. Study 3 calculates the failure rate of the trans-\nformer while considering maintenance ﬁrst. The results are\nthen applied in the reliability assessment of the substation by\nthe state analysis method [53]. Study 4 veriﬁes the accuracy\n174016 VOLUME 8, 2020\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\nFIGURE 6. The flowchart of transformer failure rate modelling.\nFIGURE 7. A typical substation model.\nof the proposed model. All simulations are implemented on\na personal computer with 3.0 GHz Intel Core i5-9500 and\n8 G RAM.\nA. STUDY 1. REPAIRING OF MISSING DGA DATA\nTo verify the effect of the proposed data repairing method,\nthis case created multiple sets of DGA data. The created data\nsets represent different fault types of the transformers through\nrandom deletion. The RV (Repaired Value) obtained by the\nKNN (non-time series) and Arima (time series) methods are\nboth given in this case.\nThe samples with missing data are shown in Table 3. The\nunit of each gas content is µL/L. ‘∗’ represents the missing\nDGA data in each sample. Table 4 gives the correspond-\ning RV , RE (Relative Error) and FTJ (Fault Types Judged)\nobtained by the three methods.\nIt can be seen from Table 4 that the three methods all have\nlow relative errors (<10%) when the data missing occurs in\na normal state (sample 1 and sample 2). At the same time,\nall three methods make the correct judgment of the fault\ntypes based the repaired DGA data. On closer examination,\nthe repaired value based on the proposed method keeps the\nrelative error less than 1%, which means that it is better than\nthe other two methods when the data missing occurs in a\nnormal state.\nWhen the missing data occurs in abnormal or fault states\n(sample 3 and sample 4), the proposed method still shows\ngood performance. The relative error is still less than 15%,\nwhich implies its accuracy for the fault type judgment.\nHowever, the relative errors obtained by the KNN and Arima\nmethods are larger than 45%, which results in mistakes in the\nfault type judgment. The results conﬁrm that the repairing\nmethod proposed is suitable for repairing the missing data\nthat occurs in abnormal or fault states compared with the\ntraditional KNN method and Arima method.\nTable 5 gives the maximum, minimum and the average\nvalues of RE obtained from the three methods.\nIt can be seen from Table 5 that the proposed repairing\nmethod always has a lower RE regardless of the operating\nstates of the transformers. The average RE is reduced by\n23.69% and 17.07% compared with KNN and Arima, respec-\ntively. Therefore, the method can provide accurate repaired\ndata for the failure rate model.\nB. STUDY 2. SHORT-TERM FAILURE RATES WITHOUT\nMAINTENANCE\nIn this case, the daily DGA data of a transformer from Jan-\nuary 22, 2010 to February 15, 2010 is used for the failure rate\nmodeling. The transformer had never undergone maintenance\nbefore May 24, 2010. Fig 8 shows the SD, ESD and MESD\nthat correspond to the daily DGA data during this period.\nFIGURE 8. The values of SD, ESD and MESD.\nVOLUME 8, 2020 174017\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\nTABLE 3. The samples with data missing.\nTABLE 4. The samples with data missing.\nTABLE 5. The comparison of RE.\nFig 8 shows that the SD of the transformer is equal to\nits ESD for each day from 2010-1-22 to 2020-2-15, because\nno maintenance is performed on the transformer before\n2020-5-24. The reasons are detailed in section III. The\n25 days are partitioned into 5 periods, and the MESD for all\nperiods take the same value. In addition, the EMSD curve in\nthe stepped increase in Fig 8 suggests that the severity of the\ninternal latent faults also increases with time.\nSubstituting the MESD into the failure rate analysis for-\nmula (30), the daily failure rate from 2010-1-22 to 2010-2-15\ncan be obtained, as shown in Fig 9. For comparison, the fail-\nure rates obtained by the Markov failure rate model and the\nconstant failure rate model are also shown in this ﬁgure.\nAccording to Fig 9, the failure rate given by the proposed\nmodel is maintained at a constant value in a short time period,\neven though the DGA data are changing every day. For exam-\nple, the failure rates from 2010-1-22 to 2010-1-27 maintain\nthe same value. The reason is that the model proposed consid-\ners short-term changes in the dissolved gases to be a normal\nphenomenon. Overall, the failure rate curve still shows a trend\nof stepped increase, whereas that obtained from the Markov\nmodel is continuously increasing. Moreover, the failure rate\nFIGURE 9. Failure rates from 2010-1-22 to 2020-2-15.\ncurve obtained by the proposed model ﬂuctuates around the\nMarkov failure rate curve.\nIn fact, the transformer had just been put into service\nfrom 2010-1-22 to 2020-2-15, and the failure rate will not\nreach 0.2 in this period. The failure rate only increases\nfrom 0.00541 to 0.00555, and the internal latent failure rate\nonly increases from 0.00041 to 0.00055. The reason is that\nthe transformer is in a normal state during 2010-1-22 to\n2010-2-15. The main cause of transformer failures should\nbe attributed to external random failures rather than internal\nlatent failures.\nC. STUDY 3. SHORT-TERM FAILURE RATES WITH\nMAINTENANCE\nTo characterize the impact of maintenance on the transformer\nfailure rate, study 3 selects the DGA data from 2013-11-3\nto 2013-12-1 as the modeling data for transformer T1 and\nT2. The maintenance of the transformer is scheduled on\n2013-11-12.\nTable 6 shows part of the data from 2013-11-3 to\n2013-12-1. It can be seen from Table 6 that the ESD will\n174018 VOLUME 8, 2020\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\nTABLE 6. Data from 2013-11-8 to 2013-11-15.\nnot be equal to the SD for each day after the maintenance.\nThis table also shows that the MESD in 2013-11-11 is 142.5\ndays in state 3, and the MESD in 2013-11-12 is 171.890 days\nin state 1, after maintenance. However, the Markov model\nconsiders that the transformer is able to return to state 1 of\nthe ﬁrst day after maintenance.\nThe failure rates from 2013-11-3 to 2013-12-1 based on the\nproposed model are displayed in Fig 10. They are compared\nwith the results obtained by the Markov failure rate model.\nFIGURE 10. Failure rate curve of the transformer after maintenance.\nThis case focuses on the analysis of the impact of main-\ntenance on the transformer failure rate. The increment of the\nfailure rate caused by maintenance is the difference between\nthe failure rate obtained by the proposed method and the\nMarkov model. The increments recorded in the period from\n2013-11-12 to 2013-12-1 are shown in Table 7. Note that the\nunit for the values in the table below is 10 −2.\nAfter maintenance, the failure rate obtained by the Markov\nfailure rate model is signiﬁcantly smaller than that obtained\nby the proposed model. The reason is that the actual effect\nof the maintenance is overestimated in the Markov model.\nAs can be seen in Table 7, the failure rates obtained\nfrom Markov model are keep in 0.005 from 2013-11-12 to\n2013-12-1 because the internal latent failure rates calculated\nare ignored as they are very close to 0. Although maintenance\nindeed can reduce the failure rate, the transformer cannot\nbe repaired to the initial operating state. The results of the\nreliability assessment for the substation can be calculated\nbased on the two failure rate models. This paper selects Loss\nof load probability (LOLP) and Expected energy not supplied\n(EENS) as the indices for the reliability assessment [54].\nTABLE 7. Increments in the failure rate.\nThe LOLP and EENS are shown in Fig 11. Before the\nmaintenance of the transformer, the results of the assess-\nments from the two models are close to each other. However,\nthe LOLP and EENS calculated based on the proposed model\nare signiﬁcantly higher than the results by the Markov fail-\nure rate model after maintenance. The results show that the\nmaintenance operation has a large inﬂuence on the substation\nreliability assessment. If the actual impact of the maintenance\nis not considered in the reliability assessment, the assessment\nresults will be overoptimistic.\nD. STUDY 4. VERIFICATION OF THE FAILURE RATE MODEL\nIn this case, the RMSD between the failure rate curve obtained\nby the proposed model and the statistical failure rate curve is\nused to measure the accuracy of the proposed model. Details\non the RMSD can be found in section III.\nThe daily DGA data used in the proposed failure rate mode\nis collected from the transformers whose operation time range\nis from 7.4 to 11.3 years. In total, 7 sampling points are\nselected, and the intervals between the sampling points are\nuneven. The average failure rates at the sampling points\nare then calculated separately.\nThe failure rate curves obtained from the proposed model\nand the statistical data are shown in Fig 12. For comparison,\nFig 12 also gives the curve obtained from the Markov model.\nThe failure rate curve in blue is the overall failure rate curve\nbased on the statistical data. The curve in orange is obtained\nfrom the proposed model. The gray curve is the transformer\nfailure rate curve based on the Markov failure rate model.\nTo verify the effectiveness of the different failure rate\nmodels, the RMSD between the orange curve and the blue\ncurve, and that between the gray curve and the blue curve,\nare calculated. The results are shown in Table 8.\nTable 8 shows that the RMSD of the proposed model is\nsmaller than that of the Markov failure rate model and is\nVOLUME 8, 2020 174019\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\nFIGURE 11. Reliability assessment of the substation.\nFIGURE 12. Comparison between three failure rate curves.\nTABLE 8. The RMSD of the two models.\ndecreased by 60.34%. The trends in the failure rate curve\nproposed are more consistent with the overall failure rate\ncurve. This ﬁnding shows that the effectiveness of the model\nis indeed improved compared with the Markov failure rate\nmodel. The results also show that maintenance has a large\ninﬂuence on the failure rate, and its impact cannot be ignored.\nV. CONCLUSION\nThis paper proposes a new approach for transformer time-\nvarying failure rate modeling by mining the DGA data on a\nshort-time scale. The model obtained by the approach builds\na connection between the DGA data and the time-varying\nfailure rate of the transformer, which quantiﬁes the impact\nof maintenance on the failure rate.\nCase studies show that DGA data can effectively describe\nthe operating conditions of transformers and the impact of\nmaintenance on the transformer failure rate. After mainte-\nnance, the failure rate will decrease, but it is still higher than\nthat obtained from the Markov failure rate model. On the\nother hand, the LOLP and EENS calculated based on the pro-\nposed model are higher than that obtained from the Markov\nfailure rate model. The results show that the trend of the fail-\nure rate curve obtained from the model proposed is more in\nline with the statistical failure rate curve. Therefore, the pro-\nposed model can better characterize the actual transformer\nfailure rate considering the impact of maintenance. Further-\nmore, the proposed repairing method for missing data can\neffectively improve the accuracy of the modeling data.\nWith the installation and operation of a large amount of\ntransformer monitoring equipment, massive quantities moni-\ntoring data will be used in the modeling of transformer failure\nrates. Determining how to effectively identify the erroneous\nmonitoring data and improve the accuracy of the transformer\nfailure rate model will be an important research direction in\nthe future.\nACKNOWLEDGMENT\nThe authors would like to thank Prof. Baoping Cai from the\nChina University of Petroleum (East China), China, for the\nuseful comments and guidance of this research.\nREFERENCES\n[1] K. Xie, K. Cao, and D. C. Yu, ‘‘Reliability evaluation of electri-\ncal distribution networks containing multiple overhead feeders on a\nsame tower,’’ IEEE Trans. Power Syst., vol. 26, no. 4, pp. 2518–2525,\nNov. 2011.\n[2] J. H. Jurgensen, L. Nordström, and P. Hilber, ‘‘Estimation of individual\nfailure rates for power system components based on risk functions,’’ IEEE\nTrans. Power Del., vol. 34, no. 4, pp. 1599–1607, Aug. 2019.\n[3] S. L. Lima, O. R. Saavedra, and V . Miranda, ‘‘A two-level framework to\nfault diagnosis and decision making for power transformers,’’ IEEE Trans.\nPower Del., vol. 30, no. 1, pp. 497–504, Feb. 2015.\n[4] Q. Li ‘‘Research on prediction model of insulation failure rate of power\ntransformer considering real-time aging state,’’ in Proc. IEEE 3rd Conf.\nEnergy Internet Energy Syst. Integr. (EI2), Nov. 2019, pp. 800–805.\n[5] Y . Liang, K. Li, L. Niu, and J. Zhao, ‘‘EWDGA and Markov process based\nfailure rate estimation of transformer internal latent fault,’’ in Proc. IEEE\nPES Innov. Smart Grid Technol., May 2012, pp. 1–5.\n[6] W. Li, J. Zhou, K. Xie, and X. Xiong, ‘‘Power system risk assessment using\na hybrid method of fuzzy set and Monte Carlo simulation,’’ IEEE Trans.\nPower Syst., vol. 23, no. 2, pp. 336–343, May 2008.\n[7] J. Qiu, H. Wang, D. Lin, B. He, W. Zhao, and W. Xu, ‘‘Nonpara-metric\nregression-based failure rate model for electric power equipment using\nlifecycle data,’’ IEEE Trans. Smart Grid, vol. 6, no. 2, pp. 955–964,\nJan. 2015.\n[8] A. A. A. Etumi and F. J. Anayi, ‘‘The application of correlation technique\nin detecting internal and external faults in three-phase transformer and\nsaturation of current transformer,’’ IEEE Trans. Power Del., vol. 31, no. 5,\npp. 2131–2139, Oct. 2016.\n174020 VOLUME 8, 2020\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\n[9] Y . Zhang, X. Li, H. Zheng, H. Yao, J. Liu, C. Zhang, H. Peng, and\nJ. Jiao, ‘‘A fault diagnosis model of power transformers based on dissolved\ngas analysis features selection and improved krill herd algorithm opti-\nmized support vector machine,’’ IEEE Access, vol. 7, pp. 102803–102811,\n2019.\n[10] J. I. Aizpurua, V . M. Catterson, B. G. Stewart, S. D. J. McArthur,\nB. Lambert, B. Ampofo, G. Pereira, and J. G. Cross, ‘‘Selecting appropriate\nmachine learning classiﬁers for DGA diagnosis,’’ in Proc. IEEE Conf.\nElectr. Insul. Dielectr. Phenomenon (CEIDP), Oct. 2017, pp. 153–156.\n[11] J. I. Aizpurua, B. G. Stewart, S. D. J. McArthur, B. Lambert, and\nJ. G. Cross, ‘‘Towards a comprehensive DGA health index,’’ in Proc.\nIEEE 2nd Int. Conf. Dielectrics (ICD), Budapest, Hungary, Jul. 2018,\npp. 1–4.\n[12] M. K. Pradhan and T. S. Ramu, ‘‘On the estimation of elapsed life of oil-\nimmersed power transformers,’’ IEEE Trans. Power Del., vol. 20, no. 3,\npp. 1962–1969, Jul. 2005.\n[13] B. Cai, Y . Liu, and M. Xie, ‘‘A dynamic-Bayesian-network-based fault\ndiagnosis methodology considering transient and intermittent faults,’’\nIEEE Trans. Autom. Sci. Eng., vol. 14, no. 1, pp. 276–285, Jan. 2017.\n[14] S. Kabir, T. K. Geok, M. Kumar, M. Yazdi, and F. Hossain, ‘‘A method\nfor temporal fault tree analysis using intuitionistic fuzzy set and expert\nelicitation,’’IEEE Access, vol. 8, pp. 980–996, 2020.\n[15] B. Cai, X. Shao, Y . Liu, X. Kong, H. Wang, H. Xu, and W. Ge, ‘‘Remaining\nuseful life estimation of structure systems under the inﬂuence of multiple\ncauses: Subsea pipelines as a case study,’’ IEEE Trans. Ind. Electron.,\nvol. 67, no. 7, pp. 5737–5747, Jul. 2020.\n[16] Y . Gheraibia, S. Kabir, K. Aslansefat, I. Sorokos, and Y . Papadopoulos,\n‘‘Safety+AI: A novel approach to update safety models using artiﬁcial\nintelligence,’’IEEE Access, vol. 7, pp. 135855–135869, 2019.\n[17] S. Kabir, K. Aslansefat, I. Sorokos, Y . Papadopoulos, and S. Konur,\n‘‘A hybrid modular approach for dynamic fault tree analysis,’’ IEEE\nAccess, vol. 8, pp. 97175–97188, 2020.\n[18] J. I. Aizpurua, S. D. J. McArthur, B. G. Stewart, B. Lambert, J. G. Cross,\nand V . M. Catterson, ‘‘Adaptive power transformer lifetime predictions\nthrough machine learning and uncertainty modeling in nuclear power\nplants,’’ IEEE Trans. Ind. Electron., vol. 66, no. 6, pp. 4726–4737,\nJun. 2019.\n[19] Mineral Oil-Impregnated Electrical Equipment in Service: Guide to the\nInterpretation of Dissolved and Free Gases Analysis, Standard IEC 60599,\nAMD, 2007, pp. 1–8.\n[20] F. Jakob, P. Noble, and J. J. Dukarm, ‘‘A thermodynamic approach to\nevaluation of the severity of transformer faults,’’ IEEE Trans. Power Del.,\nvol. 27, no. 2, pp. 554–559, Apr. 2012.\n[21] I. B. M. Taha, D.-E.-A. Mansour, S. S. M. Ghoneim, and N. I. Elkalashy,\n‘‘Conditional probability-based interpretation of dissolved gas analysis\nfor transformer incipient faults,’’ IET Gener., Transmiss. Distrib., vol. 11,\nno. 4, pp. 943–951, Mar. 2017.\n[22] Y . Wang, M. Shahidehpour, and C. Guo, ‘‘Applications of survival func-\ntions to continuous semi-Markov processes for measuring reliability of\npower transformers,’’ J. Modern Power Syst. Clean Energy, vol. 5, no. 6,\npp. 959–969, Nov. 2017.\n[23] S. Lin, X. Sun, and D. Feng, ‘‘A failure rate model for traction transformer\nbased on PHM considering multiple factors,’’ in Proc. Prognostics Syst.\nHealth Manage. Conf. (PHM-Chengdu), Oct. 2016, pp. 1–6.\n[24] S. Han et al., ‘‘Dynamic failure rate model for transformer considering\ninsulation aging and oil chromato-graphic monitoring data,’’ Power Syst.\nTechnol., vol. 42, no. 10, pp. 3275–3281, 2018.\n[25] W. Zhao, H. Wang, and J. Qiu, ‘‘Analysis of dynamic reliability of trans-\nformer based on monitoring data of oil chromatography,’’ Automat. Electr.\nPower Syst., vol. 38, no. 22, pp. 38–42 and 49, 2014.\n[26] J. Pathak, Y . Jiang, and V . Honavar, ‘‘Condition data aggregation with\napplication to failure rate calculation of power transformers,’’ in Proc.\nHawaii Int. Conf. Syst. Sci., 2006, p. 241.\n[27] J. Jia, H. O. U. Huijuan, and D. U. Xiuming, ‘‘Optimum maintenance\npolicy for power delivery equipment based on Markov decision process,’’\nHigh Voltage Eng., vol. 43, no. 7, pp. 2323–2330, 2017.\n[28] S. Kabir, M. Yazdi, J. I. Aizpurua, and Y . Papadopoulos, ‘‘Uncertainty-\naware dynamic reliability analysis framework for complex systems,’’ IEEE\nAccess, vol. 6, pp. 29499–29515, 2018.\n[29] J. I. Aizpurua, V . M. Catterson, Y . Papadopoulos, F. Chiacchio, and\nG. Manno, ‘‘Improved dynamic dependability assessment through inte-\ngration with prognostics,’’ IEEE Trans. Rel., vol. 66, no. 3, pp. 893–913,\nSep. 2017.\n[30] S. Kabir, T. Azad, M. Walker, and Y . Gheraibia, ‘‘Reliability analy-\nsis of automated pond oxygen management system,’’ in Proc. 18th Int.\nConf. Comput. Inf. Technol. (ICCIT), Dhaka, Bangladesh, Dec. 2015,\npp. 144–149.\n[31] S. Kabir, K. Aslansefat, I. Sorokos, Y . Papadopoulos, and Y . Gheraibia,\n‘‘A conceptual framework to in-corporate complex basic events in HiP-\nHOPS,’’ inProc. Int. Symp. Model-Based Saf. Assessment. Cham, Switzer-\nland: Springer, Oct. 2019, pp. 109–124.\n[32] W. Li, Risk Assessment of Power Systems: Models Methods and Applica-\ntions. Hoboken, NJ, USA: Wiley, 2014.\n[33] Y . Liu, L. Wenpeng, and X. Yan, ‘‘Data cleaning method for distribution\ntransformer,’’Power Syst. Technol., vol. 41, no. 3, pp. 1008–1014, 2017.\n[34] J. Chen, W. Liao, J. Xin, Q. Zhou, C. Kang, S. Ma, and D. Song, ‘‘On-\nline fault diagnosis method for power transformer based on missing data\nrepair,’’Power Syst. Protection Control, vol. 47, no. 15, pp. 86–92, 2019.\n[35] IEEE Guide for the Interpretation of Gases Generated in Oil-Immersed\nTransformers, IEEE Standard C57.91-1995, Institute of Electrical and\nElectronics Engineers, IEEE Standards Board, USA, 1996.\n[36] L. M. O. Queiroz and C. Lyra, ‘‘Adaptive hybrid genetic algorithm for\ntechnical loss reduction in distribution networks under variable demands,’’\nIEEE Trans. Power Syst., vol. 24, no. 1, pp. 445–453, Feb. 2009.\n[37] R. Rogers, ‘‘IEEE and IEC codes to interpret incipient faults in transform-\ners, using gas in oil analysis,’’ IEEE Trans. Electr. Insul., vol. EI-13, no. 5,\npp. 349–354, Oct. 1978.\n[38] J. Faiz and M. Soleimani, ‘‘Dissolved gas analysis evaluation in electric\npower transformers using conventional methods a review,’’ IEEE Trans.\nDielectr. Electr. Insul., vol. 24, no. 2, pp. 1239–1248, Apr. 2017.\n[39] J. Du, Z. Liu, and Z. Yi, ‘‘A KNN algorithm for unbalanced data set\nclassiﬁcation,’’Sci. Technol. Eng., vol. 11, no. 12, pp. 2680–2685, 2011.\n[40] S. Zhang, X. Li, M. Zong, X. Zhu, and R. Wang, ‘‘Efﬁcient kNN classiﬁ-\ncation with different numbers of nearest neighbors,’’ IEEE Trans. Neural\nNetw. Learn. Syst., vol. 29, no. 5, pp. 1774–1785, May 2018.\n[41] H. Xu and Y . Deng, ‘‘Dependent evidence combination based on\nshearman coefﬁcient and pearson coefﬁcient,’’ IEEE Access, vol. 6,\npp. 11634–11640, 2018.\n[42] Y . Sai, R. Jinxia, and L. Zhongxia, ‘‘Learning of neural networks based on\nweighted mean squares error function,’’ in Proc. 2nd Int. Symp. Comput.\nIntell. Design, 2009, pp. 241–244.\n[43] X. Luo and S. S.-T. Yau, ‘‘Hermite spectral method to 1-D forward\nkolmogorov equation and its application to nonlinear ﬁltering problems,’’\nIEEE Trans. Autom. Control, vol. 58, no. 10, pp. 2495–2507, Oct. 2013.\n[44] D. Zhai, C. Xi, J. Dong, and Q. Zhang, ‘‘Adaptive fuzzy fault-tolerant\ntracking control of uncertain nonlinear time-varying delay systems,’’ IEEE\nTrans. Syst., Man, Cybern. Syst., vol. 50, no. 5, pp. 1840–1849, May 2020.\n[45] C. Xi and J. Dong, ‘‘Adaptive neural network-based control of uncertain\nnonlinear systems with time-varying full-state constraints and input con-\nstraint,’’Neurocomputing, vol. 357, pp. 108–115, Sep. 2019.\n[46] T. Kaczorek, ‘‘Generalization of Cayley-hamilton theorem for n-D polyno-\nmial matrices,’’ IEEE Trans. Autom. Control, vol. 50, no. 5, pp. 671–674,\nMay 2005.\n[47] R. Guidotti, A. Monreale, S. Ruggieri, F. Turini, F. Giannotti, and\nD. Pedreschi, ‘‘A survey of methods for explaining black box models,’’\nACM Comput. Surv., vol. 51, no. 5, pp. 93.1–93.42, Jan. 2019.\n[48] E. N. A. Franz and L. Bertling, State of the Art-Life Time Modeling\nand Management of Transformers. Stockholm, Sweden: Royal Institute of\nTechnology, 2007.\n[49] D. Zhou, Z. Wang, P. Jarman, and C. Li, ‘‘Data requisites for transformer\nstatistical lifetime modelling—Part II: Combination of random and aging-\nrelated failures,’’ IEEE Trans. Power Del., vol. 29, no. 1, pp. 154–160,\nJul. 2014.\n[50] D. P. Borgers, V . S. Dolk, and W. P. M. H. Heemels, ‘‘Riccati-based design\nof event-triggered controllers for linear systems with delays,’’ IEEE Trans.\nAutom. Control, vol. 63, no. 1, pp. 174–188, Jan. 2018.\n[51] J. Zhong, W. Li, R. Billinton, and J. Yu, ‘‘Incorporating a condition moni-\ntoring based aging failure model of a circuit breaker in substation reliability\nassessment,’’ IEEE Trans. Power Syst., vol. 30, no. 6, pp. 3407–3415,\nNov. 2015.\n[52] F. Zhao and H. Su, ‘‘Short-term load forecasting using Kalman ﬁlter and\nelman neural network,’’ in Proc. 2nd IEEE Conf. Ind. Electron. Appl.,\nMay 2007, pp. 1043–1047.\n[53] H. Yang, L. Wang, Y . Zhang, H.-M. Tai, Y . Ma, and M. Zhou, ‘‘Reliability\nevaluation of power system considering time of use electricity pricing,’’\nIEEE Trans. Power Syst., vol. 34, no. 3, pp. 1991–2002, May 2019.\nVOLUME 8, 2020 174021\nW. Huanget al.: Data Mining Approach for Transformer Failure Rate Modeling\n[54] Y . Zhao, J. Kuang, K. Xie, W. Li, and J. Yu, ‘‘Dimension reduction\nbased non-parametric disaggregation for dependence modeling in compos-\nite system reliability evaluation,’’ IEEE Trans. Power Syst., early access,\nJul. 8, 2020, doi: 10.1109/TPWRS.2020.3007692.\nWEI HUANG received the B.S. degree from the\nChina University of Petroleum, Qingdao, in 2019.\nHe is currently pursuing the M.S. degree with\nChongqing University, China. His research inter-\nests include power system reliability and planning.\nXUAN LI received the B.S. degree from\nChongqing University, China, in 2019, where he is\ncurrently pursuing the M.S. degree. His research\ninterests include power system protection and\ncontrol.\nBO HU (Member, IEEE) received the Ph.D.\ndegree in electrical engineering from Chongqing\nUniversity, China, in 2010. He is currently work-\ning as a Full Professor with the School of Electrical\nEngineering, Chongqing University. His research\ninterests include power system reliability and par-\nallel computing techniques in power systems.\nJIAHAO YAN(Member, IEEE) received the B.S.\ndegree from the Hefei University of Technol-\nogy, China, in 2016. He is currently pursuing the\nPh.D. degree with Chongqing University, China.\nHis research interests include power system risk\nassessment and optimization.\nLVBING PENGreceived the B.S. degree from the\nHefei University of Technology, China, in 2015.\nHe is currently pursuing the Ph.D. degree with\nChongqing University, China. His research inter-\nests include power system reliability and planning.\nYUE SUNreceived the B.S. degree from Guizhou\nUniversity, in 2019. He is currently pursuing\nthe M.S. degree with Chongqing University,\nChina. His research interest includes power system\nreliability.\nXIN CHENG received the B.S. degree from the\nNorth University of China, in 2019. She is cur-\nrently pursuing the M.S. degree with Chongqing\nUniversity, China. Her research interest includes\npower system reliability.\nJINFENG DING received the B.S. degree from\nChongqing University, China, in 2019, where he\nis currently pursuing the M.S. degree. His research\ninterest includes power system reliability.\nKAIGUI XIE (Senior Member, IEEE) received\nthe Ph.D. degree in electrical engineering from\nChongqing University, China, in 2001. He is cur-\nrently working as a Full Professor with the School\nof Electrical Engineering, Chongqing University.\nHis main research interests include power system\nreliability, planning, and analysis.\nQINGLONG LIAO (Member, IEEE) received\nthe Ph.D. degree in electrical engineering\nfrom Chongqing University, Chongqing, China,\nin 2017. He is currently working with the State\nGrid Chongqing Electric Power Research Institute.\nLINGYUN WAN (Member, IEEE) is currently\nworking with the State Grid Chongqing Electric\nPower Research Institute.\n174022 VOLUME 8, 2020"
}