{
  "title": "Convolutional-Neural-Network-Based Partial Discharge Diagnosis for Power Transformer Using UHF Sensor",
  "url": "https://openalex.org/W3098852188",
  "year": 2020,
  "authors": [
    {
      "id": "https://openalex.org/A4208115330",
      "name": "The-Duong Do",
      "affiliations": [
        "Myongji University"
      ]
    },
    {
      "id": "https://openalex.org/A3182542056",
      "name": "Vo Nguyen Tuyet Doan",
      "affiliations": [
        "Myongji University"
      ]
    },
    {
      "id": "https://openalex.org/A2126710350",
      "name": "Yong-Sung Cho",
      "affiliations": [
        "Korea Electrotechnology Research Institute"
      ]
    },
    {
      "id": "https://openalex.org/A3083419210",
      "name": "Jong Ho Sun",
      "affiliations": [
        "Korea Electrotechnology Research Institute"
      ]
    },
    {
      "id": "https://openalex.org/A2278793848",
      "name": "Yong Hwa Kim",
      "affiliations": [
        "Myongji University"
      ]
    },
    {
      "id": "https://openalex.org/A4208115330",
      "name": "The-Duong Do",
      "affiliations": [
        "Myongji University"
      ]
    },
    {
      "id": "https://openalex.org/A3182542056",
      "name": "Vo Nguyen Tuyet Doan",
      "affiliations": [
        "Myongji University"
      ]
    },
    {
      "id": "https://openalex.org/A2126710350",
      "name": "Yong-Sung Cho",
      "affiliations": [
        "Myongji University"
      ]
    },
    {
      "id": "https://openalex.org/A3083419210",
      "name": "Jong Ho Sun",
      "affiliations": [
        "Myongji University"
      ]
    },
    {
      "id": "https://openalex.org/A2278793848",
      "name": "Yong Hwa Kim",
      "affiliations": [
        "Myongji University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W6631190155",
    "https://openalex.org/W6600284362",
    "https://openalex.org/W6684191040",
    "https://openalex.org/W2792643794",
    "https://openalex.org/W2782530865",
    "https://openalex.org/W2160793296",
    "https://openalex.org/W6681435938",
    "https://openalex.org/W2919358988",
    "https://openalex.org/W3002842489",
    "https://openalex.org/W2141125852",
    "https://openalex.org/W2913360682",
    "https://openalex.org/W4239510810",
    "https://openalex.org/W2108929535",
    "https://openalex.org/W2144420934",
    "https://openalex.org/W2001812107",
    "https://openalex.org/W2144524711",
    "https://openalex.org/W2169637651",
    "https://openalex.org/W1995949612",
    "https://openalex.org/W2896734877",
    "https://openalex.org/W2469293760",
    "https://openalex.org/W1976538634",
    "https://openalex.org/W2798969854",
    "https://openalex.org/W6738503771",
    "https://openalex.org/W2120743928",
    "https://openalex.org/W2596688947",
    "https://openalex.org/W2594448314",
    "https://openalex.org/W2790259478",
    "https://openalex.org/W2165956668",
    "https://openalex.org/W2883550674",
    "https://openalex.org/W2051542965",
    "https://openalex.org/W2235057615",
    "https://openalex.org/W2605250934",
    "https://openalex.org/W4240924624",
    "https://openalex.org/W2896674238",
    "https://openalex.org/W2108069432",
    "https://openalex.org/W2515040851",
    "https://openalex.org/W2153375913",
    "https://openalex.org/W2604679602",
    "https://openalex.org/W2810392541",
    "https://openalex.org/W2146502635",
    "https://openalex.org/W2119821739",
    "https://openalex.org/W3123941068",
    "https://openalex.org/W6908809",
    "https://openalex.org/W2163605009",
    "https://openalex.org/W1522301498",
    "https://openalex.org/W2964121744",
    "https://openalex.org/W2620908499",
    "https://openalex.org/W2165496236"
  ],
  "abstract": "Given the enormous capital value of power transformers and their integral role in the electricity network, increasing attention has been given to diagnostic and monitoring tools as a safety precaution measure to evaluate the internal condition of transformers. This study overcomes the fault diagnosis problem of power transformers using an ultra high frequency drain valve sensor. A convolutional neural network (CNN) is proposed to classify six types of discharge defects in power transformers. The proposed model utilizes the phase-amplitude response from a phase-resolved partial discharge (PRPD) signal to reduce the input size. The performance of the proposed method is verified through PRPD experiments using artificial cells. The experimental results indicate that the classification performance of the proposed method is significantly better than those of conventional algorithms, such as linear and nonlinear support vector machines and feedforward neural networks, at 18.78%, 10.95%, and 8.76%, respectively. In addition, a comparison with the different representations of the data leads to the observation that the proposed CNN using a PA response provides a higher accuracy than that using sequence data at 1.46%.",
  "full_text": "Received October 23, 2020, accepted November 10, 2020, date of publication November 17, 2020,\ndate of current version November 27, 2020.\nDigital Object Identifier 10.1 109/ACCESS.2020.3038386\nConvolutional-Neural-Network-Based Partial\nDischarge Diagnosis for Power Transformer\nUsing UHF Sensor\nTHE-DUONG DO\n1, VO-NGUYEN TUYET-DOAN1, YONG-SUNG CHO2, JONG-HO SUN2,\nAND YONG-HWA KIM\n 1, (Member, IEEE)\n1Department of Electronic Engineering, Myongji University, Yongin 17058, South Korea\n2Advanced Power Apparatus Research Center, Korea Electrotechnology Research Institute, Changwon 51543, South Korea\nCorresponding author: Yong-Hwa Kim (yongkim@mju.ac.kr)\nThis work was supported in part by the Korea Electric Power Corporation under Grant R18XA01, and in part by the Korea Institute of\nEnergy Technology Evaluation and Planning (KETEP) and the Ministry of Trade, Industry, and Energy (MOTIE) of the Republic of Korea\nunder Grant 20179310100050.\nABSTRACT Given the enormous capital value of power transformers and their integral role in the electricity\nnetwork, increasing attention has been given to diagnostic and monitoring tools as a safety precaution\nmeasure to evaluate the internal condition of transformers. This study overcomes the fault diagnosis\nproblem of power transformers using an ultra high frequency drain valve sensor. A convolutional neural\nnetwork (CNN) is proposed to classify six types of discharge defects in power transformers. The proposed\nmodel utilizes the phase–amplitude response from a phase-resolved partial discharge (PRPD) signal to\nreduce the input size. The performance of the proposed method is veriﬁed through PRPD experiments\nusing artiﬁcial cells. The experimental results indicate that the classiﬁcation performance of the proposed\nmethod is signiﬁcantly better than those of conventional algorithms, such as linear and nonlinear support\nvector machines and feedforward neural networks, at 18.78%, 10.95%, and 8.76%, respectively. In addition,\na comparison with the different representations of the data leads to the observation that the proposed CNN\nusing a PA response provides a higher accuracy than that using sequence data at 1.46%.\nINDEX TERMS Partial discharge (PD), fault diagnosis, power transformer, and convolutional neural\nnetwork (CNN).\nI. INTRODUCTION\nOver the past several decades, with the development of the\neconomy and the continuous advancement of society, the\nglobal energy industry has witnessed rapid growth, and elec-\ntric energy demand has become increasingly vigorous. As\nthe primary origin for changing the voltage, the power trans-\nformer, one of the most important components for maintain-\ning stable operational conditions of a power system, assumes\nan inevitable role in the network of transmission and dispens-\ning systems [1]–[3]. Working under factual conditions such as\nthe process of manufacturing, installation, maintenance, and a\nprolonged period of operation, the transformer is unavoidably\nsubjected to external factors such as power, apparatus, and\nheat. This may lead to the degradation of insulation over a\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Hui Ma\n.\nperiod by gradual erosion in the winding, generating frac-\ntional release separator phenomena (partial discharge (PD)),\ncompromising the stable operation condition of the entire\nsystem [4], [5]. In addition, if they are not detected at an early\nstage, PD failures will progressively evolve, and the trans-\nformer insulation will increasingly deteriorate. Ultimately,\nPD will develop into a discharge breakdown or spark dis-\ncharge, which may result in full insulation deterioration and\ntremendous economic losses [6], [7]. As a result, monitoring\nand diagnostic techniques that assess the stable reliability,\npredict the presence, and identify the types of PD insulation\ndefects in the transformer precisely in a timely manner are of\ngreat signiﬁcance for enhancing the operational reliability of\npower transformers and maintaining the safe operation of the\npower grid and the electricity supply [8]–[10].\nElectrical measurements based on IEC 60270 are widely\nused for power transformer testing during routine factory\nVOLUME 8, 2020 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see https://creativecommons.org/licenses/by/4.0/ 207377\nT. -D. Doet al.: CNN-Based PD Diagnosis for Power Transformer Using UHF Sensor\ntests [11]. However, it is difﬁcult to measure and analyze PD\nowing to electromagnetic noise in the substations. This has\nled to numerous research endeavors in many nations to look\nfor alternative methods of PD diagnosis. Recently, to identify\nPD signals, measurements using conventional-pulse current,\nhigh-frequency current, ultrahigh frequency (UHF), acoustic\nemission (AE), and dissolved gas analysis (DGA) have been\ngaining popularity in the monitoring and evaluation of power\ntransformers [5]. Among these methods, the pulse current and\nDGA methods are not suitable for providing locations for\nPD sources, and the acoustic method has the disadvantage\nof diagnosing faults inside the power transformer [12], [13].\nTherefore, the UHF method is widely used for PD diagnosis\nbecause of its high sensitivity and robustness to noise [13].\nThe recognition of UHF signals can provide extremely valu-\nable information in analyzing the internal state, allowing one\nnot only to identify faults in the device but also to determine\nwhat kind of faults they are, where they are, and how danger-\nous they are.\nWith the progression of signal processing techniques,\nnumerous studies have focused on applying artiﬁcial intelli-\ngence and optimization techniques for the purpose of mon-\nitoring the condition of power system components as well\nas improving and enhancing the accuracy of diagnosing the\nfault, consisting of transformer fault diagnosis. Among the\nvarious detection techniques, UHF has shown promising\nresults in PD recognition and classiﬁcation [14]–[17]. Clas-\nsical PD types have been measured using the UHF antenna,\nand then a concept based on zero-span was proposed for\nPD classiﬁcation in [14]. An enhancement of the diagnostic\nprocess with more than one source of PD or interference\nwas presented in [15]. In that study, wavelet-based time—-\nfrequency analysis was applied to ﬁnd suitable features in PD\ndata to distinguish between PD sources at different locations.\nThis technique is based on calculating the similarity between\npairs of signals that have been transformed into the time—-\nfrequency domain. For on-site PD, reliability of the diagnosis\nhas been achieved by utilizing a redundant diagnosis strategy-\nbased system [16].\nWith the recent and rapid growth of technology, machine\nlearning algorithms, such as artiﬁcial neural networks\n(ANNs), support vector machines (SVMs), and decision trees\n[17]–[23] have been introduced in the literature as promising\ntechniques for a fault diagnosis of a transformer. Of them,\nthe combination of signal processing techniques and SVMs,\nwhich can handle the main issues of a ‘‘dimensionality dis-\naster,’’ ‘‘over-ﬁtting,’’ and local minimum point, has gained\nincreasing prevalence [18]. To classify the PD types in a\npower transformer, feature extraction of the signals has been\naccomplished based on a wavelet analysis, and an improved\nbagging algorithm with a backpropagation neural network\nand an SVM were then used for the classiﬁcation task [17].\nHowever, it is challenging to accurately choose the appropri-\nate model parameters, including the kernel function, which\nhas a signiﬁcant inﬂuence on the classiﬁcation performance\nof an SVM [19], [20]. The fuzzy theory has a simple structure\nand achieves a fast diagnosis; however, its learning ability is\ninsufﬁcient, and it does not have the ability to take advantage\nof previous diagnosis results [21]. For a clear description of\nthe uncertainties and to overcome the limitation of automati-\ncally adjusting a fuzzy rule diagnosis, one of the most widely\nused artiﬁcial intelligence methods, an ANN with superior\nlearning capabilities, which generates an efﬁcient structured\nnetwork with weight vectors instead of fault diagnosis rules,\nhas been introduced for a transformer fault prediction [22],\n[23]. Although an ANN has strong self-learning and a parallel\nprocessing capability to learn from the training data directly,\ntackling nonlinear relationships and generalized solutions for\na new dataset, the convergence of the model is quite slow,\noscillation occurs at times, and it easily falls into a local\noptima [18]. In addition, to acquire the best performance of\nthe network, the selection of parameters of the ANN model,\nsuch as the number of hidden layers and the hidden neu-\nrons in each layer, must be properly considered. Despite the\ncooperation of features and the fact that such algorithms have\nachieved a substantial level of success, it has been perceived\nthat such conventional methods have reached a bottleneck in\ntheir development, which restricts the further improvement of\nthe pattern recognition accuracy.\nTo address these problems, various studies have been con-\nducted using deep learning, which has been recognized as a\nmainstream of AI because deep learning has shown a much\nhigher accuracy than other machine learning approaches.\nIn particular, convolutional neural networks (CNNs), which\nhave arguably the most widespread deep learning archi-\ntecture, have increasingly shown prominent results for a\nvariety of computer vision problems such as image classiﬁ-\ncation, segmentation, detection, and video tracking, and have\nachieved prevailing success and an exemplary performance\nin the ﬁeld of pattern classiﬁcation and retrieval related tasks\nin recent years [24], [25]. It must ﬁrst be recognized that\nthe principal dominance of a CNN in comparison to its\npredecessors is that it automatically and adaptively learns\nrepresentations by exploiting spatial or temporal correlations\nin the data based on the use of multiple feature extraction\nstages and detects the essential characteristics without any\nhuman surveillance. In comparison to other deep learning\ntechniques, the complexity of a CNN and the difﬁculty of its\ntraining are greatly diminished through the sharing of param-\neters and local connections, which additionally decrease the\nrisk of over-ﬁtting [26]. In addition, constructing a network\nwith a deep architecture utilizing a CNN is relatively easy.\nSimilar to many other deep neural networks, the topology of a\nCNN is separated into multiple learning stages from the input\nto the output layers composed of a combination of multiple\nhidden layers, such as convolution layers, pooling layers,\na dropout, and fully connected layers in the middle. Each\nlayer has numerous ﬁlters, kernels, or neurons that respond\nto distinctive combinations of inputs from the prior layers,\naccomplish a convolution, and take its place with an optional\nnon-linearity [27]. In addition to their sample efﬁciency in\nachieving accurate models, CNNs tend to be computationally\n207378 VOLUME 8, 2020\nT. -D. Doet al.: CNN-Based PD Diagnosis for Power Transformer Using UHF Sensor\nefﬁcient, both because they require fewer parameters than\nfully connected architectures and because convolutions are\neasy to parallelize across GPU cores.\nThe main objective of this work is to develop a convolu-\ntional neural network (CNN) model to address the essential\nrequirements of PD source classiﬁcation in power trans-\nformers. We utilize the characteristics of CNNs to clas-\nsify the incipient defects of power transformers using the\nphase–amplitude (PA) response of the PD signals as the input\nof the CNNs. The structure of the proposed CNN model in our\nexperiment includes convolutional layers and max-pooling\nlayers with the main task of performing feature extraction of\nthe PRPD signal. The dropout and batch normalization hold\nthe responsibility of preventing overﬁtting. In addition, fully\nconnected layers are applied in our model as a function of\nmapping the extracted features into the ﬁnal output, where a\nclassiﬁcation layer is employed to recognize different insula-\ntion faults for the power transformer. The main contributions\nof this article are as follows.\n• A UHF drain valve sensor was used to capture the waves\nemitted by six types of discharge defects that may occur\ninside the power transformer [28], [29]. The perfor-\nmance of the proposed method was veriﬁed through\nexperiments using artiﬁcial cells for the power trans-\nformer. In addition, noise is regarded as a normal state\nto analyze the inﬂuence of noise in PD classiﬁcation.\n• The PA response is obtained from the PRPD to decrease\nthe size of the input matrix for the CNN. The PA\nresponse has different characteristics for each failure in\nthe power transformer. The proposed CNN with the PA\nresponse has better classiﬁcation performance than the\nCNN method using PRPDs and achieved a classiﬁcation\nperformance of almost 100%.\n• The proposed CNN has higher classiﬁcation accuracy\nthan previous classiﬁcation methods such as linear\nSVM, nonlinear SVM, and FNN. This is because the\nproposed CNN has the advantage of feature extraction\nbased on the PA response.\nThe remainder of this article is organized as follows.\nIn Section II, the description of PRPDs and noise mea-\nsurements for power transformers is presented. Then, the\nproposed CNN-based classiﬁcation method, including the\ninput representation and the framework for CNN, is pre-\nsented in Section III. Performance evaluations are presented\nin Section IV. We also compare the performance of the\nproposed method with other classiﬁcation methods in this\nsection. Finally, Section V concludes this article. In addition,\nthe acronyms used in this article are listed in Table 1.\nII. PRPD MEASUREMENT USING UHF SENSOR\nIn this section, we present our experimental setup and experi-\nmental results for PRPDs in order to investigate the assess-\nment of the PD characteristics in the power transformer.\nArtiﬁcial cells are modeled for six types of faults in power\ntransformers, and noise measurements are also conducted.\nFIGURE 1. Block diagram of experimental system for power transformer.\nFIGURE 2. UHF drain valve sensor for oil-insulated transformers:\n(a) sensor external shape and (b) sensor installation.\nTABLE 1. List of acronyms and abbreviations.\nA. EXPERIMENTAL SYSTEM\nFig. 1 shows a pictorial block diagram of the experimental test\nsystem, which is composed of a power transformer chamber,\nUHF drain valve sensor, and data acquisition system (DAS).\nThe UHF drain valve sensor using a monopole-type broad-\nband antenna is designed to be suitable for the UHF frequency\nband of PDs generated from a power transformer and installed\nin the oil-ﬁlled power transformer chamber, as shown in\nFig. 2. As shown in Fig. 3, the DAS comprises an ampliﬁer,\na log detector, an 8-bit analog-to-digital converter (ADC), and\na personal computer (PC). The ampliﬁer has a gain of 45 dB\nwithin the frequency range of 300 MHz to 1.8 GHz. The log\nVOLUME 8, 2020 207379\nT. -D. Doet al.: CNN-Based PD Diagnosis for Power Transformer Using UHF Sensor\nFIGURE 3. Block diagram of DAS.\nFIGURE 4. Artificial cells: (a) protruding electrode, (b) particle, (c) floating,\n(d) surface, (e) bad contact between windings, and (f) void PDs.\ndetector consists of a logarithmic ampliﬁer and a peak detec-\ntor, where the logarithmic ampliﬁer is used for the dynamic\nrange compression, and the peak detector is used to capture\nthe maximum values of the UHF PD pulses [30]. After the\npeak detector, the DAS uses the ADC with 1024 ×fm samples\nper second, where fm =60 Hz is the power frequency. The\nmaximum value is then captured at every 8 samples in the\nDAS, and P =128 samples in each power cycle were used\nfor the PRPD measurements.\nThe measured signal for M =3600 power cycles is deﬁned\nin matrix form as\nX =\n\n\nx(1,1) x(1,2) ... x(1,P)\nx(2,1) x(2,2) ... x(2,P)\n..\n. .\n.\n. ... .\n.\n.\nx(M,1) x(M,2) ... x(M,P)\n\n, (1)\nwhere x(m,p) ∈{0, 1,··· ,255}is the measured signal at the\np-th data point for the m-th power cycle.\nB. PRPD MEASUREMENTS\nPRPD measurements according to the form and characteris-\ntics of PD signals were performed in artiﬁcial cells ﬁlled with\noil. Fig. 4 shows six artiﬁcial cells used for simulating various\ntypes of PD insulation defects in power transformers such\nas protruding electrode discharge, ﬂoating discharge, free\nparticle discharge, surface discharge, bad contact between\nwindings, and void PDs [31]. Moreover, the voltage divider\nand high-voltage AC source for generating PDs in the arti-\nﬁcial cells were applied in the PRPD measurements. The\ntest voltages for artiﬁcial cells relevant to each type in the\nexperiment are given in Table 2.\nTABLE 2. Artificial cells under different voltage levels.\nFIGURE 5. Sequential phase-resolved PDs (PRPDs) for six fault types in\npower transformer: (a) protruding electrode, (b) floating, (c) particle,\n(d) surface, (e) turn-to-turn, and (f) void.\nFig. 5 presents sequential data for PRPDs under six types of\ninsulation defects with 3600 power cycles in the six artiﬁcial\ncells using the UHF drain valve sensor. As can be seen from\nFig. 5a that the discharge pulses of the protruding electrode\nare observed separately at both a positive and negative half-\ncycle near 90 ◦and 270◦, which have a distribution similar to\nthat of void discharge. However, the pulses of the void are\nsparser. For the ﬂoating and particle, there is an extremely\ncondensed density of evident discharge pulses across all\nbands at different intensity ranges, as shown in Figs. 5b and\n5c, in which the amplitude of ﬂoating PDs reaches a record-\nhigh of 250. Meanwhile, the discharge pulses of the turn to\nturn are mainly distributed in the ﬁrst quadrant. In addition,\nit can be seen that some sparse pulses emerged in the third\nquadrant near 270◦. Fig. 5d shows that the presence of surface\nPDs with high amplitude is found massively in the regions\n207380 VOLUME 8, 2020\nT. -D. Doet al.: CNN-Based PD Diagnosis for Power Transformer Using UHF Sensor\nFIGURE 6. PA responses of PRPDs for six fault types in power\ntransformer: (a) protruding electrode, (b) floating, (c) particle,\n(d) surface, (e) turn-to-turn, and (f) void.\naround 0 ◦- 90 ◦in the positive band, and from 180 ◦to 300 ◦\nin the other band, and a smaller part at the end of the phase.\nFig. 6 shows the phase–amplitude (PA) response\nfor PRPDs in 2D representation, where amplitudes\nof 3600 power cycles are accumulated to generate the PA\nresponse, and the number of PDs per 3600 power cycles is\nillustrated by different colors in a 2D representation. The PA\nresponse for PRPDs is deﬁned as\nXin =\n\n\nxin(1,1) xin(1,2) ··· xin(1,P)\nxin(2,1) xin(2,2) ··· xin(2,P)\n..\n. .\n.\n. ... .\n.\n.\nxin(K,1) xin(K,2) ··· xin(K,P)\n\n\n, (2)\nwhere K = 256,\nK∑\nk=1\nxin (k,p) = M, and xin(k,p) ∈\n{0,1,··· ,M}is the number of cycles with an amplitude\nvalue k at the pth phase with k = 1,2,..., K and p =\n1,2,..., P. Sequential PRPDs in (1) are transformed into\nthe PA response in (2), so the size of the data is sub-\nstantially decreased. It can be clearly seen from Fig. 6a\nand Fig. 6f that the PD activity of the defects protrud-\ning from the electrode and void are almost symmetric in\ntwo half-circles. In addition, the distribution of the fault\nﬂoating activity, which is not symmetric, is also presented\nin Fig. 6b.\nFIGURE 7. Example of noise measurements: (a) phase-resolved\nPD (PRPD) and (b) PA response.\nTABLE 3. Detail structure of proposed CNN model.\nC. NOISE MEASUREMENTS\nThe noise was measured in a laboratory environment using\nthe UHF drain valve sensor. Fig. 7 presents an example of\nnoise signals for 3600 power cycles and the corresponding\nPA response in a 2D representation. Here, it can be seen that\nwith small amplitudes, the pulses of noise signals are sparse\nand scattered without regularity in all ranges of phases and\npower cycles, as shown in Fig. 7.\nIII. PROPOSED CNN FOR PD DIAGNOSIS\nIn this section, we focus on CNN-based PRPD fault diagno-\nsis. The proposed CNN architecture for classifying PRPDs\nin power transformers is shown in Fig. 8. The structure of\nthe model is comprised of an input layer, convolutional lay-\ners, max-pooling, dropout, batch normalization, ﬂatten, fully\nconnected layers, and an output layer. In the input layer, the\nPA response, Xin, in (2) is used for PRPDs, where the matrix\nsize of Xin is smaller than that of sequential data X in (1).\nTable 3 shows the detailed structure of the proposed CNN\nmodel, where the total parameters for the training set number\n145,331. To acquire the appropriate characteristics, the input\nVOLUME 8, 2020 207381\nT. -D. Doet al.: CNN-Based PD Diagnosis for Power Transformer Using UHF Sensor\nFIGURE 8. Proposed CNN architecture.\ndata will be resized according to the designed CNN model.\nThe convolutional layer is utilized directly to extract features\nfrom the input and map extracted features to form new fea-\nture maps. Speciﬁcally, using a convolution operation, the\nconvolutional layers convolve the input of the local regions\nto extract the local features, which is usually referred to as\nweight-sharing and is afterward followed by the activation\nfunction to produce features of the output. It can be seen\nfrom Table 3 that, in all convolutional layers, we employed\nmultiple ﬁlters with a kernel size of 5 ×5 and 3 ×3, which\nhave the function of reducing the input size for the next\nconvolution layer resulting in less computational complexity\nfor the next network layer. In addition, it also plays a leading\nrole in reducing the number of parameters, and consequently,\nthe training efﬁciency of the model is substantially improved.\nThe activation function, which permits the network to obtain\na nonlinear expression of the input to intensify the represen-\ntation capacity and make the learned features increasingly\ndividable, is utilized. Owing to both the simplicity of the\nimplementation and its good performance on a variety of\npredictive tasks, the rectiﬁed linear unit (ReLU), which accel-\nerates the convergence of the CNNs, has become the most\npopular choice of activation function in recent years [32],\n[33]. The ReLU is deﬁned as follows\nf (zl ) =max{0,zl }=\n{\nzl , zl ≥0,\n0, else, (3)\nin which zl is an element of the outputs in the l-th convo-\nlutional layer. After the ﬁrst two convolutional layers, the\nmax-pooling layer, which plays the key role of increasing\ninvariance to small local translations as well as decreasing\nthe spatial size of the features and the number of subse-\nquent learnable parameters of the network by subsampling,\nis employed [33], [34]. The max-pooling acts as a down-\nsampling function with a view to reducing the size of the\nfeature layout and obtaining location-invariant features. As\ncan be seen in Table 3, with a 2 ×2-size window and the\nsampling window step size of 2, pooling layers separate the\nprevious layer’s output into a nonoverlapping subregion and\nconducts a local max operation over the input features. With\nthe proposed CNN model, after the convolution, ReLU, and\npooling layer, dropout, and batch normalization which are\nused as regularization techniques to reduce the over-ﬁtting\nand accelerate the training process of the network [35], [36].\nBy permitting some fraction of the nodes in each layer to be\nliterally rejected before calculating the subsequent layer in\neach iteration during the training, the dropout technique han-\ndles the challenge of a large number of parameters, leading\nto an acceleration of the training process and the prevention\nof an overmatching. Likewise, batch normalization, a popular\nand effective technique that consistently accelerates the con-\nvergence of the networks, was also employed to avoid van-\nishing and exploding gradients mainly caused by the internal\ncovariance shift throughout the training.\nFinally, the classiﬁcation layer, commonly called a soft-\nmax layer, comes after the fully connected layer. In this layer,\nthe output value was designed to be equal to the number of\nobjects to be classiﬁed, as can be seen in Table 3. The value\nwas set to 7. The task here is to determine the probability of\nthe input batch elements belonging to one of the categories\nand give the ﬁnal probabilities for each label. During the\nclassiﬁcation process, an output value interval is produced\nwith a range of 0–1 for seven different objects, which means\nthat the output to be interpreted as the probability that a given\nitem belongs to a particular class, based on the largest output\nvalue of the class, can then be chosen. This means that the\noutput that produces a value of near 1 is perceived to be\nthe object predicted by the network. At the output layer, the\noutput for C classes is obtained using a softmax activation\nfunction as\nz =[z1,··· ,zC ]T =σ(h), (4)\n207382 VOLUME 8, 2020\nT. -D. Doet al.: CNN-Based PD Diagnosis for Power Transformer Using UHF Sensor\nTABLE 4. Experimental dataset for PRPDs and noise.\nwhere zj is the predicted interference representing the j-th\ncategory in the C classes, h =[h1,··· ,hC ]T is the output\nof the last fully connected layer, and σ(h) is the softmax\nfunction, which is deﬁned as\nzj =[σ(h)]j = ehj\n∑C\ni=1 ehi\n. (5)\nDuring training, the parameters of the proposed CNN were\nlearned through the minibatch B to minimize the following\nloss function\nJ(2) = 1\n|B|\n∑\nb ∈B\nLoss(b), (6)\nwhere 2is denoted as a correction of every learnable param-\neter in the model, and |·|is the number of elements in a set. In\n(5), the loss function is calculated based on the cross-entropy\nloss as follows\nLoss(b) =−\nC∑\ni=1\nti log\n(\nz(b)\ni\n)\n, (7)\nwhere the superscript (b) is the index for the b-th training\nsample in the minibatch B, ti =1 when the index i is the index\nfor the ground truth, and ti =0 otherwise. To minimize the\nloss function, stochastic gradient decent optimization algo-\nrithms such as AdaGrad, AdaDelta, and Adam [37]–[39] are\nused. Here, the Adam optimizer is used to update the network-\nlearnable parameters.\nIV. PERFORMANCE EVALUATIONS\nIn this section, the performance evaluation of partial dis-\ncharge pattern recognition using PRPDs and noise measure-\nments is demonstrated to clarify the results of the CNN algo-\nrithm for fault diagnosis in power transformers. The number\nof samples for noise and each defect in the experiments\nis shown in Table 4, where noise and six types of faults\n(protruding electrode, ﬂoating, particle, surface, turn-to-turn,\nand void) are considered and numbered as 0, 1,2,3,4,5, and\n6, respectively.\nIn our experiments, all of the data was typically split into\nthree parts (training set, validation, and test set) with 80%,\n10%, and 10% samples of the data, respectively. Therefore,\nwith 2736 samples in the entire dataset, the training database\npossesses 2188 samples in total. The validation and test set\ntake up the same ﬁgure, at 274 each. During the training\nprocess, the optimization step was accomplished to acquire\nthe optimized hyperparameters in accordance with the batch\nsize, layer type, number of layers, and ﬁlter size. The pro-\nposed model was trained by utilizing different combinations\nTABLE 5. Maximum and minimum bound of hyperparameter\noptimization.\nTABLE 6. Performance evaluation with different representations of data.\nof parameters, and the best combination was chosen. We car-\nried out trials to alleviate the effects of random initial values\non the network during our experiments, and then averaged\nthe results to conﬁrm the robustness of the proposed model.\nTable 5 shows the optimization of the maximum and mini-\nmum boundary range of each hyperparameter and whether the\nparameter was an integer or a real value. Among all models\ngenerated, the 16-layer CNN with a 5 ×5-size kernel in\nthe ﬁrst convolutional layer and a 3 ×3-size kernel in the\nrest of the layers using a learning rate, an exponential decay\nrate for the ﬁrst moment, a minibatch size, and a learning\nrate drop factor of 0.0002, 0.5, 32, and 0.5, respectively,\nachieves the highest overall PD pattern recognition accuracy\nand the highest pattern recognition accuracy for every type of\ndefect. In addition, the types of activation functions applied\nstrongly affect the PD pattern recognition performance of the\nCNN. In this study, the performance of CNN was determined\nwith different activation functions such as Tanh, Sigmoid,\nSwish, ReLU, and Leaky ReLU using the same optimized\nhyperparameters. The results show that the ReLU function\nhas a higher pattern recognition accuracy than those of CNNs\nwith the other four activation functions.\nTable 6 presents the classiﬁcation results of the perfor-\nmance evaluation of the proposed model based on different\nrepresentations of the dataset. It can be seen that the proposed\nCNN model with both types of input data, sequential data,\nand PA response exhibit the appreciate results for the classi-\nﬁcation of the transformers’ discharge faults. Nevertheless,\nthe proposed CNN when using the PA response achieves a\n99.64% overall accuracy, which is 1.46% higher than when\nusing the sequential data. Here, we use the PA response in\n(2) as the input of the proposed CNN. Regarding each defect,\nVOLUME 8, 2020 207383\nT. -D. Doet al.: CNN-Based PD Diagnosis for Power Transformer Using UHF Sensor\nFIGURE 9. Classification accuracy performance for different models.\nfrom the table, it is obvious that the PD pattern recognition\naccuracy rate of the proposed CNN method utilizing the\nPA response as the input shows better results for most of\nthe transformer incipient faults. However, as can be seen,\nwith the ‘‘turn-to-turn’’ defect, the proposed model utilizing\ncontinuous data exhibits better characteristics than that using\nPA data. An analysis of the results shows that the proposed\nmodel also has the advantage of using continuous data in this\ncase.\nFig. 9 provides a comparison of the evaluation performance\nof the proposed CNN model, FNN, and SVMs for partial\ndischarge pattern recognition in a power transformer, where\nthe SVMs use maximum values for power cycles at each\nphase as a feature vector. For comparison, we used linear and\nnonlinear SVMs with a radial basis function (RBF) and an\nFNN model as the baseline models [40], [41]. In the SVMs,\nthe feature vector was obtained based on the maximum of\nthe amplitudes from the PRPD, where the parameter C =\n0.01 for the linear SVM and the parameters C =0.01 and\nγ = 0.1 were chosen after parameter estimation using a\ngrid search. The FNN model was designed with seven hidden\nlayers, the total parameters of which were 4,203,847. In com-\nparison with the proposed CNN method, it is clear that the\nFNN requires more learnable parameters despite the smaller\nnumber of hidden units than the CNN model. From Fig. 9,\nit is clearly observed that the proposed CNN model attained\nthe highest overall classiﬁcation accuracy performance (at\nroughly 99.64%), followed by the FNN and the linear and\nnonlinear SVM models, of which the linear SVM model is\nthe least effective among the approaches. Note that the FNN\nis superior to the SVMs, and the nonlinear SVM with RBF\nis somewhat superior to the linear SVM. This is because\nthe improvement in performance comes from the ability to\nautomatically acquire characteristics of the PA response of\nPRPDs and recombine them to generate new features from the\nraw input. Meanwhile, the FNN used the raw input without\nthe phase information of the PRPDs, and the SVMs used a\nmanually created feature vector that combined the character-\nistics of PRPDs.\nFIGURE 10. Confusion matrix for (a) proposed CNN and (b) FNN models.\nUsing a PA response, the PD pattern recognition for the\nFNN and SVMs was also investigated, as shown in Table 7.\nIt is clear that the accuracy rate of the PD pattern recognition\nof the proposed CNN for every type of transformer incipient\nfault is the highest among all methods, with an accuracy rate\nof 100% for almost all defect types. Meanwhile, with only\n80.56% and 68.42% accuracy rates in recognizing the particle\nand void defects, respectively, the FNN model proved less\nviable in discriminating the defect types. Likewise, for the\nSVM, the linear and nonlinear versions are both capable of\ndifferentiating several faults, such as a protruding electrode\nand a surface defect with a nonlinear SVM, and the turn-\nto-turn defect and noise with a linear model. In particular,\nthe protruding electrode and void classiﬁcation accuracies\nof 40% and 57.89% are lower than the 60% and 42.11% of\nthe proposed CNN, respectively, which indicates the inef-\nﬁciency of the linear SVM model in the transformer fault\nclassiﬁcation.\nFurthermore, in order to assert the advantages of the pro-\nposed CNN technique and to more intuitively reﬂect the\naccuracy of the classiﬁcation results, the confusion matrix of\nthe FNN is presented in Fig. 10. It can be seen in Fig. 10\nthat the proposed model shows the degree of distinction of\n207384 VOLUME 8, 2020\nT. -D. Doet al.: CNN-Based PD Diagnosis for Power Transformer Using UHF Sensor\nFIGURE 11. Data visualization using t-distributed stochastic neighbor embedding (t-SNE) of 2188 training samples for (a) input data, (b) FC layer of\nproposed CNN, and (c) FC layer of FNN model.\nTABLE 7. Comparison of classification performance with other methods\nusing PA response.\ndefect types as relatively high, with accuracy rates of 100%\nfor the defect types of protruding electrode, ﬂoating, particle,\nsurface, and void, and approximately 97.4% for the turn-to-\nturn fault, making it easier to differentiate the defect types.\nIn addition, from Fig. 10a, we can see that among all of\nthe faults, only the turn-to-turn defect is misidentiﬁed and\nincorrectly recognized as a void defect with 2.63%, indicat-\ning that the characteristics of the proposed model extraction\nperform well in other faults but lack the ability to identify\nthe defect in turn-to-turn. This is because there is one sample\nof 38 samples in the test set according to the turn-to-turn\ndefect, which has the same distribution as the void defect.\nMeanwhile, the CNN model has shown undisputed efﬁciency\nin distinguishing most of the faults. The FNN method has\nbeen perceived as less effective in identifying the defect types\nof protruding electrode, void, and noise. This performance\nis lower than that of the CNN model at 15%, 5.26%, and\n10.53%, respectively.\nTo better understand the CNN model, we analyzed the\ninternal representation of the trained network at the fully con-\nnected layer. Figs. 11a, 11b, and 11c show the t-distributed\nstochastic neighbor embedding (t-SNE) representations of\nvectors for the input and fully connected layers of the pro-\nposed CNN and FNN schemes, respectively. The t-SNE\nembedded high-dimensional vectors into 2D spaces while\nretaining the pairwise similarity [42]. As can be seen in\nFig. 11a, the PD signals are very close to each other, so it is\nFIGURE 12. Classification accuracy performance for different models in\ncase of without noisy data.\nTABLE 8. Training and testing time comparisons.\ndifﬁcult to identify and recognize discharge defects precisely\nusing the PD input signal. By contrast, Fig. 11b and Fig. 11c\nshow that the vector of the fully connected layer of both\nmodels was much more dispersed when compared to the\ninput vector. The vectors of the fully connected layer of\nthe proposed CNN model for some data of the protruding\nelectrode, ﬂoating, particle, surface, turn-to-turn, and void\nfaults in the power transformer are similar to those for some\nnoise data. In addition, the clear distinct distribution of the\nincipient faults of the transformers is illustrated in Fig. 11b,\nVOLUME 8, 2020 207385\nT. -D. Doet al.: CNN-Based PD Diagnosis for Power Transformer Using UHF Sensor\nFIGURE 13. Confusion matrix for (a) proposed CNN and (b) FNN models\nin case of without noisy data.\nwhich indicates the predominance of the proposed CNN over\nthe FNN model. Therefore, our proposed method can serve as\nan effective partial discharge pattern recognition method for\na power transformer.\nTable 8 shows the training and testing time comparisons\nfor the FNN, SVMs, and proposed CNN, where the timing\nwas normalized to a hypothetical 1-GHz single-core CPU to\nmake the measurement meaningful. In our experiments, with\nthe same hardware conﬁguration, the models were trained\nand tested on an NVIDIA Titan X GPU with 3584 cores,\neach running at 1.4 GHz. As can be seen, the proposed CNN\nmodel was slower with a 2.93-min training time compared\nto 0.89 and 0.034 min of the FNN and linear SVM model,\nrespectively. However, a test period of roughly 0.161 s for\nthe proposed model using a PA response is appropriate for\nan ofﬂine application. Moreover, to employ a different input,\nthe use of a PA response as an input of the proposed CNN\noutperforms that of a PRPD with less than 33 min required\nfor the training and 0.889 s required for the testing. This leads\nto the advantage of the proposed model using a PA response,\nnot only improving the performance of the pattern recognition\nbut also appropriately reducing the size of the input leading\nto a reduction of the complexity of the model and the memory\nrequired for its deployment.\nTo enhance the adaptability to real-world situations, the\npattern recognitions of an FNN, SVMs, and the proposed\nPD classiﬁed model were also investigated by comparing\ndifferent partial discharge models without noise. The overall\nclassiﬁcation results of different models using partial dis-\ncharge data without noise are illustrated in Fig. 12. Although\nthe proposed model exhibits the highest overall PD pattern\nrecognition accuracy of 100%, followed by the FNN and non-\nlinear SVMs, which have a similar capability of classifying\nthe partial discharge defects without noise with accuracy rates\nof 91.1% and 90.87%, respectively, the linear SVM model\nis the lowest among the different approaches. In addition,\nFig. 13 shows the PD pattern recognition accuracy for each\ntype of PD fault without noise using the confusion matrix.\nAs shown in Fig. 13a, the proposed CNN model can suc-\ncessfully predict PD patterns for every type of defect without\na noise signal with an accuracy of 100%. Meanwhile, the\nFNN model shows a lower efﬁciency with only two detected\nfaults and is inefﬁcient in predicting void and particle defects\nwith accuracy rates of 78.95% and 80.56%, as shown in\nFig. 13b. A comparison of the different methods, including\nthe FNN and SVMs, under different cases of noise and no\nnoise, indicates that the proposed approach is reasonable and\nachieves an improvement over the existing methods used\nfor PD classiﬁcation under both noisy and quiet conditions,\nwhich implies that the proposed model exhibits the strongest\ntolerance against noise contamination.\nV. CONCLUSION\nIn this article, we proposed a CNN-based fault diagnosis\nmethod to detect defects in power transformers. PRPDs were\nobtained by utilizing a new UHF drain sensor and included\nsix types of faults: protruding electrode, particle, ﬂoating,\nsurface, bad contact between windings, and void. The pro-\nposed model uses the PA response from PRPDs for the dimen-\nsion reduction of the CNN input. The experimental results\nrevealed that the proposed CNN achieved a classiﬁcation\naccuracy of 99.64% and had 18.78%, 10.95%, 8.76%, and\n1.46% higher classiﬁcation performance than linear SVM,\nnonlinear SVM, FNN, and CNN using PRPDs, respectively.\nThe proposed CNN using the PA response can be applied\nto the fault diagnosis of other power equipment. In addition,\nfurther veriﬁcation of the proposed method will be conducted\nusing continuous data and the PA response based on mixed\nsimulation PD signals and the actual transformer PD signals\nwhen considering real-world situations.\nREFERENCES\n[1] C. Wang, J. Wu, J. Wang, and W. Zhao, ‘‘Reliability analysis and overload\ncapability assessment of oil-immersed power transformers,’’ Energies,\nvol. 9, no. 1, p. 43, Jan. 2016.\n[2] A. Jahromi, R. Piercy, S. Cress, J. Service, and W. Fan, ‘‘An\napproach to power transformer asset management using health index,’’\nIEEE Elect. Insul. Mag., vol. 25, no. 2, pp. 20–34, Mar. 2009,\ndoi: 10.1109/MEI.2009.4802595.\n207386 VOLUME 8, 2020\nT. -D. Doet al.: CNN-Based PD Diagnosis for Power Transformer Using UHF Sensor\n[3] E. Gulski, ‘‘Digital analysis of partial discharges,’’ IEEE Trans.\nDielectr. Electr. Insul., vol. 2, no. 5, pp. 822–837, Oct. 1995,\ndoi: 10.1109/94.469977.\n[4] T. Wen, Q. Zhang, J. Ma, X. Liu, Z. Wu, L. Zhang, J. Zhao, N. Shi-\nmomura, and W. Chen, ‘‘Research on the detecting effectiveness of on-\nsite lightning impulse test for GIS equipment with insulation defects,’’\nIEEE Trans. Dielectr. Electr. Insul., vol. 25, no. 2, pp. 551–558, Apr. 2018,\ndoi: 10.1109/TDEI.2018.006961.\n[5] Y.-B. Wang, D.-G. Chang, Y.-H. Fan, G.-J. Zhang, J.-Y. Zhan, X.-J. Shao,\nand W.-L. He, ‘‘Acoustic localization of partial discharge sources in power\ntransformers using a particle-swarm-optimization-route-searching algo-\nrithm,’’IEEE Trans. Dielectr. Electr. Insul., vol. 24, no. 6, pp. 3647–3656,\nDec. 2017, doi: 10.1109/TDEI.2017.006857.\n[6] M. Mondal, G. B. Kumbhar, and S. V. Kulkarni, ‘‘Localization of partial\ndischarges inside a transformer winding using a ladder network constructed\nfrom terminal measurements,’’ IEEE Trans. Power Del., vol. 33, no. 3,\npp. 1035–1043, Jun. 2018, doi: 10.1109/TPWRD.2017.2683560.\n[7] C. Pan, J. Tang, Y. Zhang, X. Luo, and X. Li, ‘‘Variation of discharge\ncharacteristics with temperature in moving transformer oil contaminated\nby metallic particles,’’ IEEE Access, vol. 6, pp. 40050–40058, 2018,\ndoi: 10.1109/ACCESS.2018.2856580.\n[8] J. Singh, Y. Sood, and R. Jarial, ‘‘Condition monitoring of power\nTransformers–Bibliography survey,’’ IEEE Elect. Insul. Mag., vol. 24,\nno. 3, pp. 11–25, May 2008, doi: 10.1109/MEI.2008.4591431.\n[9] S. Chakravorti, D. Dey, and B. Chatterjee, Recent Trends in the Condi-\ntion Monitoring of Transformers: Theory, Implementation, and Analysis.\nCham, Switzerland: Springer, 2013.\n[10] H. Dong, X. Yang, A. Li, Z. Xie, and Y. Zuo, ‘‘Bio-inspired PHM model\nfor diagnostics of faults in power transformers using dissolved Gas-in-Oil\ndata,’’Sensors, vol. 19, no. 4, p. 845, Feb. 2019.\n[11] High-Voltage Test Techniques-Partial Discharge Measurements, Interna-\ntional Electrotechnical Commission, Geneva, Switzerland, 2000.\n[12] M. D. Judd, L. Yang, and I. B. B. Hunter, ‘‘Partial discharge monitoring of\npower transformers using UHF sensors—Part I: Sensors and signal inter-\npretation,’’ IEEE Elect. Insul. Mag., vol. 21, no. 2, pp. 5–14, Mar. 2005,\ndoi: 10.1109/MEI.2005.1412214.\n[13] M. D. Judd, L. Yang, and I. B. B. Hunter, ‘‘Partial discharge moni-\ntoring for power transformer using UHF sensors—Part 2: Field expe-\nrience,’’ IEEE Elect. Insul. Mag., vol. 21, no. 3, pp. 5–13, May 2005,\ndoi: 10.1109/MEI.2005.1437603.\n[14] K. Raja, F. Devaux, and S. Lelaidier, ‘‘Recognition of discharge sources\nusing UHF PD signatures,’’ IEEE Elect. Insul. Mag., vol. 18, no. 5,\npp. 8–14, Sep. 2002, doi: 10.1109/MEI.2002.1044316.\n[15] L. Yang and M. D. Judd, ‘‘Recognising multiple partial discharge sources\nin power transformers by wavelet analysis of UHF signals,’’ IEE Proc. Sci.,\nMeas. Technol., vol. 150, no. 3, pp. 119–127, May 2003, doi: 10.1049/ip-\nsmt:20030201.\n[16] D. Aschenbrenner, H.-G. Kranz, W. R. Rutgers, and P. van den Aardweg,\n‘‘On line pd measurements and diagnosis on power transformers,’’ IEEE\nTrans. Dielectr. Electr. Insul., vol. 12, no. 2, pp. 216–222, Apr. 2005,\ndoi: 10.1109/TDEI.2005.1430392.\n[17] T. Jiang, J. Li, Y. Zheng, and C. Sun, ‘‘Improved bagging algorithm for\npattern recognition in UHF signals of partial discharges,’’ Energies, vol. 4,\nno. 7, pp. 1087–1101, Jul. 2011.\n[18] J. Faiz and M. Soleimani, ‘‘Assessment of computational intelligence and\nconventional dissolved gas analysis methods for transformer fault diagno-\nsis,’’ IEEE Trans. Dielectr. Electr. Insul., vol. 25, no. 5, pp. 1798–1806,\nOct. 2018.\n[19] Z. Chen, T. Lin, N. Tang, and X. Xia, ‘‘A parallel genetic algorithm based\nfeature selection and parameter optimization for support vector machine,’’\nSci. Program., vol. 2016, no. 2, pp. 1–10, Jun. 2016.\n[20] Y. Zhang, H. Wei, R. Liao, Y. Wang, L. Yang, and C. Yan, ‘‘A new\nsupport vector machine model based on improved imperialist competitive\nalgorithm for fault diagnosis of oil-immersed transformers,’’ J. Electr. Eng.\nTechnol., vol. 12, no. 2, pp. 830–839, Mar. 2017.\n[21] Y. Zhang, J. Liu, H. Zheng, and K. Wang, ‘‘Feasibility of a universal\napproach for temperature correction in frequency domain spectroscopy of\ntransformer insulation,’’ IEEE Trans. Dielectr. Electr. Insul., vol. 25, no. 5,\npp. 1766–1773, Oct. 2018.\n[22] J. L. Guardado, J. L. Naredo, P. Moreno, and C. R. Fuerte, ‘‘A compara-\ntive study of neural network efﬁciency in power transformers diagnosis\nusing dissolved gas analysis,’’ IEEE Trans. Power Del., vol. 16, no. 4,\npp. 643–647, Oct. 2001.\n[23] V. Miranda and A. R. G. Castro, ‘‘Improving the IEC table for transformer\nfailure diagnosis with knowledge extraction from neural networks,’’ IEEE\nTrans. Power Del., vol. 20, no. 4, pp. 2509–2516, Oct. 2005.\n[24] D. Cireäan, U. Meier, J. Masci, and J. Schmidhuber, ‘‘Multi-column deep\nneural network for trafﬁc sign classiﬁcation,’’ Neural Netw., vol. 32,\npp. 333–338, Aug. 2012.\n[25] X. Liu, Z. Deng, and Y. Yang, ‘‘Recent progress in semantic image seg-\nmentation,’’Artif. Intell. Rev., vol. 52, no. 2, pp. 1089–1106, Aug. 2019.\n[26] S. H. Bae, K. J. Yoon. ‘‘Conﬁdence-based data association and discrimi-\nnative deep appearance learning for robust online multi-object tracking,’’\nIEEE Trans. Pattern Anal. Mach. Intell., vol. 40, no. 3, pp. 595–610,\nMar. 2018.\n[27] A. Ucar, Y. Demir, and C. Guzelis, ‘‘Object recognition and detection with\ndeep learning for autonomous driving applications,’’ Simulation, vol. 1,\npp. 1–11, Dec. 2017.\n[28] H. Mirzaei, A. Akbari, E. Gockenbach, and K. Miralikhani, ‘‘Advancing\nnew techniques for UHF PDdetection and localization in the power trans-\nformers in the factory tests,’’ IEEE Trans. Dielectr. Electr. Insul., vol. 22,\nno. 1, pp. 448–455, Feb. 2015, doi: 10.1109/TDEI.2014.004249.\n[29] M. Siegel, M. Beltle, S. Tenbohlen, and S. Coenen, ‘‘Application\nof UHF sensors for PD measurement at power transformers,’’ IEEE\nTrans. Dielectr. Electr. Insul., vol. 24, no. 1, pp. 331–339, Feb. 2017,\ndoi: 10.1109/TDEI.2016.005913.\n[30] J. Vedral and M. Kriz, ‘‘Signal processing in partial discharge measure-\nment,’’Metrology Meas. Syst., vol. 17, no. 1, pp. 55–64, Jan. 2010.\n[31] G.-J. Zhang, Y.-B. Wang, D.-G. Chang, X.-J. Shao, J.-Y. Zhan, and\nW.-L. He, ‘‘Separation of multiple partial discharge sources in power trans-\nformer,’’ in Proc. Int. Conf. High Voltage Eng. Power Syst. (ICHVEPS),\nOct. 2017, pp. 12–17, doi: 10.1109/ICHVEPS.2017.8225857.\n[32] A. Fred Agarap, ‘‘Deep learning using rectiﬁed linear units (ReLU),’’ 2018,\narXiv:1803.08375. [Online]. Available: http://arxiv.org/abs/1803.08375\n[33] A. Krizhevsky, I. Sutskever, and G. Hinton, ‘‘ImageNet classiﬁcation with\ndeep convolutional neural networks,’’ in Proc. Neural Inf. Process. Syst.,\n2012, pp. 84–90.\n[34] D. Ciresan, U. Meier, and J. Schmidhuber, ‘‘Multi-column deep neural net-\nworks for image classiﬁcation,’’ in Proc. IEEE Conf. Comput. Vis. Pattern\nRecognit., Jun. 2012, pp. 3642–3649, doi: 10.1109/CVPR.2012.6248110.\n[35] C. Garbin, X. Zhu, and O. Marques, ‘‘Dropout vs. Batch normalization: An\nempirical study of their impact to deep learning,’’ Multimedia Tools Appl.,\nvol. 79, nos. 19–20, pp. 12777–12815, May 2020.\n[36] M. Z. Alom, T. M. Taha, C. Yakopcic, S. Westberg, P. Sidike, M. S. Nasrin,\nM. Hasan, B. C. Van Essen, A. A. S. Awwal, and V. K. Asari, ‘‘A state-\nof-the-art survey on deep learning theory and architectures,’’ Electronics,\nvol. 8, no. 3, p. 292, Mar. 2019.\n[37] J. Duchi, E. Hazan, and Y. Singer, ‘‘Adaptive subgradient methods for\nonline learning and stochastic optimization,’’ J. Mach. Learn. Res., vol. 12,\npp. 2121–2159, Feb. 2011.\n[38] M. D. Zeiler, ‘‘ADADELTA: An adaptive learning rate method,’’ 2012,\narXiv:1212.5701. [Online]. Available: http://arxiv.org/abs/1212.5701\n[39] D. P. Kingma and J. L. Ba, ‘‘Adam: A method for stochastic optimization,’’\nin Proc. Int. Conf. Learn. Represent., 2015, pp. 1–41.\n[40] C. Cortes and V. N. Vapnik, ‘‘Support vector networks,’’ Mach. Learn.,\nvol. 20, no. 3, pp. 273–297, 1997.\n[41] H.-Y. Huang and C.-J. Lin, ‘‘Linear and kernel classiﬁcation: When to use\nwhich?’’ in Proc. SIAM Int. Conf. Data Mining, Jun. 2016, pp. 216–224.\n[42] L. van der Maaten and G. Hinton, ‘‘Visualizing high-dimensional data\nusing t-SNE,’’ J. Mach. Learn. Res., vol. 9, pp. 2579–2605, Nov. 2008.\nTHE-DUONG DO received the B.E. degree in\nmechatronics from the Hanoi University of Sci-\nence and Technology, Hanoi, Vietnam, in 2018. He\nis currently pursuing the master’s degree with the\nInformation Technology Convergence Laboratory,\nDepartment of Electronic Engineering, Myongji\nUniversity, South Korea. His major research inter-\nests include deep learning applications for fault\ndiagnosis, generative adversarial nets, and auto-\nmotive radar signal processing.\nVOLUME 8, 2020 207387\nT. -D. Doet al.: CNN-Based PD Diagnosis for Power Transformer Using UHF Sensor\nVO-NGUYEN TUYET-DOAN received the B.S.\ndegree in statistics from Ton Duc Thang Univer-\nsity, Ho Chi Minh City, Vietnam, in 2018. She\nis currently pursuing the M.S. degree in Informa-\ntion Technology Convergence Laboratory, Depart-\nment of Electronic Engineering, Myongji Univer-\nsity, South Korea. Her research interests include\nstatistics, data analysis, pattern recognition, com-\nputer vision, image processing, and deep learning\ntechniques.\nYONG-SUNG CHO received the B.S. and M.S.\ndegrees in electrical engineering from Busan\nNational University, Busan, South Korea, in 2003\nand 2006, respectively. Since 2006, he has been\nwith the Power Apparatus Research Center, Korea\nElectrotechnology Research Institute, where he is\ncurrently a Senior Researcher. His research inter-\nests include multi-physics simulation and partial\ndischarge diagnostics system for power apparatus.\nJONG-HO SUNwas born in South Korea in 1962.\nHe received the B.S. and Ph.D. degrees in elec-\ntrical engineering from Pusan National Univer-\nsity in 1986 and 2001, respectively. Since 2001,\nhe has been with the Korea Electrotechnology\nResearch Institute, where he is currently a Prin-\ncipal Researcher. His interests are the diagnosis\nand monitoring technologies of electrical power\nequipment.\nYONG-HWA KIM(Member, IEEE) received the\nB.S. degree in electrical engineering and the\nPh.D. degree in electrical and computer engi-\nneering from Seoul National University, Seoul,\nSouth Korea, in 2001 and 2007, respectively.\nFrom 2007 to 2011, he was a Senior Researcher\nwith the Korea Electrotechnology Research Insti-\ntute, Geonggi, South Korea. From 2011 to 2013,\nhe was an Assistant Professor with the Division\nof Maritime Electronic and Communication Engi-\nneering, Mokpo National Maritime University, South Korea. In 2013,\nhe joined the Faculty with the Department of Electronic Engineering,\nMyongji University, South Korea. His general research interests include\ncommunication systems, fault diagnosis, and digital signal processing, with\nan emphasis on artiﬁcial intelligence for communications, radar systems, and\nsmart grids.\n207388 VOLUME 8, 2020",
  "topic": "Partial discharge",
  "concepts": [
    {
      "name": "Partial discharge",
      "score": 0.8351951241493225
    },
    {
      "name": "Ultra high frequency",
      "score": 0.8249456882476807
    },
    {
      "name": "Convolutional neural network",
      "score": 0.6320189237594604
    },
    {
      "name": "Computer science",
      "score": 0.6053853631019592
    },
    {
      "name": "Transformer",
      "score": 0.5744351148605347
    },
    {
      "name": "Electrical engineering",
      "score": 0.3550299108028412
    },
    {
      "name": "Electronic engineering",
      "score": 0.3415825068950653
    },
    {
      "name": "Artificial intelligence",
      "score": 0.24528127908706665
    },
    {
      "name": "Voltage",
      "score": 0.21246588230133057
    },
    {
      "name": "Telecommunications",
      "score": 0.2106102705001831
    },
    {
      "name": "Engineering",
      "score": 0.12360456585884094
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I89440247",
      "name": "Myongji University",
      "country": "KR"
    },
    {
      "id": "https://openalex.org/I196471810",
      "name": "Korea Electrotechnology Research Institute",
      "country": "KR"
    }
  ]
}