{
  "title": "Analysis of Validation Development Science Learning Tools using Guided Inquiry Model Assisted by Real Media to Improve the Understanding Concepts and Science Process Skills of Students",
  "url": "https://openalex.org/W3117882287",
  "year": 2020,
  "authors": [
    {
      "id": "https://openalex.org/A1381615299",
      "name": "Susilawati Susilawati",
      "affiliations": [
        "University of Mataram"
      ]
    },
    {
      "id": "https://openalex.org/A2108557294",
      "name": "Aris Doyan",
      "affiliations": [
        "University of Mataram"
      ]
    },
    {
      "id": "https://openalex.org/A2902916240",
      "name": "Putu Artayasa",
      "affiliations": [
        "University of Mataram"
      ]
    },
    {
      "id": "https://openalex.org/A3109891693",
      "name": "Hary Soeprianto",
      "affiliations": [
        "University of Mataram"
      ]
    },
    {
      "id": "https://openalex.org/A2008518551",
      "name": "Ahmad Harjono",
      "affiliations": [
        "University of Mataram"
      ]
    },
    {
      "id": "https://openalex.org/A1381615299",
      "name": "Susilawati Susilawati",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2108557294",
      "name": "Aris Doyan",
      "affiliations": [
        "University of Mataram"
      ]
    },
    {
      "id": "https://openalex.org/A2902916240",
      "name": "Putu Artayasa",
      "affiliations": [
        "University of Mataram"
      ]
    },
    {
      "id": "https://openalex.org/A3109891693",
      "name": "Hary Soeprianto",
      "affiliations": [
        "University of Mataram"
      ]
    },
    {
      "id": "https://openalex.org/A2008518551",
      "name": "Ahmad Harjono",
      "affiliations": [
        "University of Mataram"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W3160319176",
    "https://openalex.org/W3109668624",
    "https://openalex.org/W2950380709",
    "https://openalex.org/W2909164693",
    "https://openalex.org/W2994957288",
    "https://openalex.org/W2414815872",
    "https://openalex.org/W2508909859",
    "https://openalex.org/W2959679517",
    "https://openalex.org/W2235164400"
  ],
  "abstract": "Development of natural science learning tools with guided inquiry model assisted by real media to improve students' mastery of science process concepts and skills has been successfully carried out. The purpose of this development is to produce a science learning tool guided Inquiry model assisted by valid real media. The development of these tools uses the 4D model (define, design, develop, and disseminate). Science learning tools developed in the form of syllabus, lesson plan implementation, student worksheets, science process skills instruments, and students' mastery of concepts. The results showed that the device validation process developed with the guided inquiry learning model fulfilled the content validation and construct validation. This suggests that it has produced a very valid device",
  "full_text": " \nJPPIPA 7(1) (2021) \n \nJurnal Penelitian Pendidikan IPA \nJournal of Research in Science Education  \n \nhttp://jppipa.unram.ac.id/index.php/jppipa/index  \n   \n___________ \nEmail: susilawatihambali@unram.ac.id \nCopyright © 2020, Author et al.  \nThis open access article is distributed under a (CC-BY License \nAnalysis of Validation Development Science Learning Tools using \nGuided Inquiry Model Assisted by Real Media to Improve the \nUnderstanding Concepts and Science Process Skills of Students \n  \nSusilawati 1,2* , Aris Doyan 1,2*, Putu Artayasa2, Hary Soeprianto2, Ahmad Harjono1,2 \n \n1Physics Education, Faculty of Teacher Training and Education, University of Mataram, Lombok, West Nusa Tenggara, Indonesia.  \n2Master of Science Education Program, University of Mataram, Lombok, West Nusa Tenggara, Indonesia.  \n \nDOI: 10.29303/jppipa.v7i1.473 \n \nArticle Info \nReceived: September 2th, 2020 \nRevised: December 10th, 2020 \nAccepted: December 18th, 2020 \n \n \n \nAbstract: Development of n atural science learning tools with guided inquiry model \nassisted by real media to improve students' mastery of science process concepts and s kills \nhas been successfully carried out. The purpose of this development is to produce a sci ence \nlearning tool guided Inquiry model assisted by valid real media. The  development of these \ntools uses the 4D model (define, design, develop, and disseminate). Science learning tools \ndeveloped in the form of syllabus, lesson plan implementation, student worksheets, science \nprocess skills instruments, and students' mastery of  concepts. The results showed that the \ndevice validation process developed with the guided inquiry learning model fulfilled the \ncontent validation and construct validation. This suggests that it h as produced a very valid \ndevice.  \n \n Keywords: Validation analysis; guided inquiry model; real media; natural science learning \ntools; concept mastery; science process skills. \n  \nCitation: Susilawati, S., Doyan, A., Artayasa, P., Soeprianto, H., & Harjono, A. (2 020). Analysis of Validation Development \nScience Learning Tools using Guided Inquiry Model Assisted by Real Media to Improve the Understanding \nConcepts and Science Process Skills of Students. Jurnal Penelitian Pendidikan IPA, 7 (1), 41 -44. \ndoi:https://doi.org/10.29303/jppipa.v7i1.473  \n \n \nIntroduction  \n \nNatural Science is a science that consists of \nseveral branches of science including physics, \nchemistry, and biology. The concepts and theories in \nscience are obtained through an experiment or \nexperiment which is carried out based on scientific \nprocedures. \nNatural Science is a process of discovery that is \ncarried out systematically about nature. The \ndevelopment of competencies and the process of \nunderstanding the natural surroundings are \nemphasized in science learning. To obtain a deeper \nunderstanding of the natural  surroundings, the process \nof inquiry and action is directed at Science Education \n(Trianto, 2012). \nEssentially science learning is a product, process, \nand application of knowledge. Science as a product \nincludes facts, concepts, principles, and theories, wh ile \na process includes the skills and attitudes that must be \npossessed to obtain a product. These skills are known \nas process skills, while the attitudes that must be \npossessed are called scientific attitudes. Students must \nbe active in conducting experime nts to find the truth of \nthe concepts they are learning by not forgetting the \nscientific attitude like a researcher. However, the reality \nin the field of science learning is still informative, so it \nmakes students learn science material by memorizing \nit. Students are only given a direct understanding of the \nJurnal Penelitian Pendidikan IPA (JPPIPA) January 2021, Volume 7, Issue 1, 41-44 \n \n42 \nmaterial so that students tend not to understand the \nmaterial they are learning more deeply. An in -depth \nunderstanding of the material is very important in the \nprocess of honing students' conceptual mast ery skills. \nThe science learning that occurs must be able to change \nthe old paradigm from teacher -centered to student -\ncentered. Learning science is said to be successful if \nstudents have mastered science material cognitively, \npsychomotor, and affective. On e way to involve \nstudents to be active so that they can understand the \nconcept of science well is by applying a guided inquiry \nmodel (Susilawati et al, 2015; Istiqomah et al, 2016). \nThe guided inquiry learning model is a learning \nmodel that actually places  students as learning subjects \nso that students can learn more independently and the \nknowledge obtained from their thoughts will be easier \nto remember (Susilawati et al, 2019). In addition, in this \nmodel students are allowed to find and find their own \nanswers to the problems given by their own \nobservations and experiences (Susilawati et al, 2019). \nThis study focuses on developing science \nlearning tools based on guided inquiry learning models \nwith real media to measure the mastery of science \nprocess concepts  and skills in junior high schools  \n(Jamuri et al, 2015). \n   \nMethod  \n \nThis research is development research with a 4D \nmodel. The 4D model includes several stages, namely \ndefine, design, develop, and disseminate. This research \nis limited to the development  stage, which includes the \nvalidity test. The data obtained from the validity test \nwere taken from the results of reviewers and \nassessments of content aspects and learning activities \nby five expert validators. The initial products \ndeveloped were in the for m of syllabus, learning \nimplementation plans, Dididk Participant Worksheets, \ninstruments that consist of mastery of concepts and \nskills science process learners. The data obtained in this \nstudy were analyzed using equation 1: \n \n𝑉 = average value of expert validity\n𝑚𝑎𝑥𝑖𝑚𝑢𝑚 𝑠𝑐𝑜𝑟𝑒    \n \nThe level of validity can be determined based on the \nfollowing table 1: \nTable 1. Criteria for Evaluation Results for Assessment \nInstruments (Arikunto, 2010). \nValue Average Category \n4.2 ≥ SV ≤ 5.0  Very Valid \n3.4 ≥ SV ≤ 4.2 Valid \n2.6 ≥ SV ≤ 3.4 Valid Enough \n1.8 ≥ SV ≤ 2.6  Invalid  \n1.0 ≥ SV ≤ 1.8 Very Invalid \nResult and Discussion \n \nThe Define Stage \nThe define stage includes problem and \ncurriculum analysis. The purpose of the problem \nanalysis is to find out the problems experienced by \nstudents, including their characteristics. Based on the \nresults of the characteristic analysis of students, it was \nfound that generally, class VIII had an age of 13 to 14 \nyears. The results of the 2013 curriculum analysis \nshowed basic competencies of 3.12 and 4.12 regarding \nLight and Optical Devices. Based on these basic \ncompetencies, indicators and learning objectives to be \nachieved by students can be developed. \n \nThe Design Stage \nThe second stage is design, where at this stage \nthe researcher designs learning tools, validation sheets, \nand student response questionnaires. As for designing \nvalidation sheets and student response questionnaires, \nthere are several components of the syllabus, learning \nimplementation plans, and developed  student \nworksheets. The syllabus components that have been \ndeveloped consist of the identity and format of the \nsyllabus matrix. Whereas for the learning \nimplementation plan being developed is the school \nidentity; subjects; class; subject matter and time \nallocation; basic competence and competency \nachievement indicators; learning objectives; learning \nmaterials; method; learning media and learning \nresources; steps of learning activities and assessment of \nlearning outcomes. Student worksheets consist of the \ntitle of learning material, student identity, time, \nsupporting pictures, learning objectives, and \ninstructions. \nThe validation sheet for the concept mastery \ninstrument is designed based on several aspects, \nnamely material, language, and test construction. \nValidation sheets for students' science process skills \ninstruments include the suitability of questions with \nindicators; construction and Language. test validation, \nreliability, level of difficulty, and distinguishing power \nof the questions were carried ou t to determine whether \nthe questions made were good. \n \nThe Development Stage \nThe development stage aims to produce the final \nform of science learning tools with guided inquiry \nmodels assisted by real media. The stage consists of \ntwo steps, namely expert ju dgment and development \ntrials. The products developed in this study have a \ncharacteristic that is learning activities that follow the \nsteps of guided inquiry learning model activities. The \nfinished learning device was then tested for validity by \nfive expert validators. \nJurnal Penelitian Pendidikan IPA (JPPIPA) January 2021, Volume 7, Issue 1, 41-44 \n \n43 \nBased on Table 2, it can be seen that the science \nlearning device with the guided inquiry model assisted \nby real media developed has an average value above \n4.2. This shows that the device that has been developed \nis very valid. If it meets th e criteria for content validity \nand construct validity, the learning device is said to be \nvalid (Kartini et al, 2019). Devices that have a very valid \ncategory can be used as research material (Khasanah et \nal, 2019). Suggestions and revised results from exp ert \nvalidators can be shown in Table 3. \n \nTable 2. The results of the validation of science learning tools with guided inquiry models assisted by real media  \n \nTable 3.  Suggestions and revisions from the Expert Validator \nNo Learning Devices Average validator score Total Average Category V1 V2 V3 V4 V5 \n1 Syllabus 4.67 4.11 4.52 4.77 4.65 22.72 4.54 Very Valid \n2 Lesson Plan (LP) 4.33 4.63 4.53 4.35 4.53 22.37 4.47 Very Valid \n3 Student Activity Sheet (SAS) 3.98 4.80 4.45 4.57 4.75 22.55 4.51 Very Valid \n4 Concept mastery test instrument 4.57 4.25 4.44 4.64 4.56 22.46 4.49 Very Valid \n5 Science process skill test instrument 4.33 4.17 4.65 4.55 4.47 22.17 4.43 Very Valid \nNo  Suggestion Revision \n1 Syllabus \n- Error writing the word Science - Writing the word Ipa into science \n- Writing the words in the syllabus there are still errors so it \nstill needs to be corrected \n- Writing of several words in the syllabus has been \nimproved \n- The question of mastering the concepts contained in the \nsyllabus is only a matter of description, even though the \nappendix is also a multiple-choice question \n- In the syllabus, it has been improved that the \nconcept mastery is in the form of multiple -choice \nquestions \n2 Lesson Plan  (LP) \n- The description of the subject matter, especially in the \nlesson plan is too short, it is necessary to add a description \nof facts from everyday life about the properties of light \n(propagating straight and reflected) and a description of the \nuse of flat, convex, and concave mirrors in everyday life. \n- Has added a description of the subject matter to the \nlesson plan especially about the breakdown of facts \nfrom daily life about the properties of light \n(propagating straight and reflected) and a \ndescription of th e use of flat, convex, and concave \nmirrors in everyday life. \n- Indicators in the lesson plan are still dominated by aspects \nof knowledge, and still little writing on aspects of attitudes \nand skills. Indicators of skills aspects in the lesson plan in \nthe form of conducting experiments and presentations can \nbe added with indicators designing experiments, \ncalculating, drawing, or graphing and concluding. \n- Indicators on the lesson plan have been added to \naspects of attitude and skills. Indicators of skills \naspects to the lesson plan have been added in the \nform of conducting experiments and presentations \nwith indicators designing expe riments, calculating, \ndrawing, or graphing and concluding. \n- The description or formulation of learning objectives is still \nincomplete, there are still many learning objectives that do \nnot include aspects of C (condition) and D (Degree). \n- Description or formulation of learning objectives has \nbeen added to the learning objectives that include \naspects of C (condition) and D (Degree). \n- Examples of facts on learning material in the lesson plan \nneed to be added. \n- Examples of facts on learning material in the l esson \nplan have been added. \n- Learning resources written in the lesson plan are limited to \nbooks so other learning resources need to be added such as \npictures, concept maps, magazines, science comics, or short \nreads that teenagers like. \n- Learning resources written in the lesson plan have \nbeen added from books such as pictures, concept \nmaps, magazines. \n \n3 Student Activity Sheet (SAS) \n- Subject identity and time allocation need to be written on \nthe SAS. \n- Subject identity and time allocation were added to the \nSAS \n- Indicators on the second Basic Competencies (aspects of \nskills) have not been written on the SAS \n- Indicators on the second Basic Competencies  (skills \naspect) have been added to the SAS. \n- Aspect D (degree) has not been explicitly written on the \nlearning objectives in SAS \n- Aspect D (degree) has been written on the learning \nobjectives in SAS \n- The material and methods are good. - The material and methods are good. \n- A variety of learning resources need to be added - A variety of learning resources have been added \nJurnal Penelitian Pendidikan IPA (JPPIPA) January 2021, Volume 7, Issue 1, 41-44 \n \n44 \n \nConclusion  \n  \nThe whole discussion above shows that the \nprocess of validating the device  developed with the \nguided inquiry learning model fulfills the content \nvalidation and construct validation. This suggests that \nit has produced a very valid device.   \n \nAcknowledgements  \n \nThank you to the Dean of FKIP, the Head of the \nDepartment of PMIPA and  the Chair of the Physics \nEducation Study Program and the headmaster of \nMataram 2 Public High School so that this r esearch can \nbe carried out well.  \n \nReferences  \n \nArikunto, S. (2012). Dasar-Dasar Evaluasi Pendidikan \nEdisi 2. Jakarta: Bumi Aksara. \nIstiqamah, N., Doyan, A., & Taufik, M. (2016).  \nPengaruh Model Pembelajaran Discovery dan \nInkuiri Terbimbing Berbasis Eksperimen \nTerhadap Hasil Belajar Fisika dan Sikap Ilmiah \nSiswa. Jurnal Penelitian Pendidikan IPA, 2(1), 27 -\n38, doi: 10.29303/jppipa.v2i1.30.  \nJamuri, Kosim, & Doyan, A. (2015). Pengaruh Mo del \nPembelajaran Kooperatif STAD Berbasis Multi \nMedia Interaktif Terhadap Penguasaan Konsep \nSiswa pada Materi Termodinamika . Jurnal \nPenelitian Pendidikan IPA , 1(1),  123-134. \ndoi:10.29303/jppipa.v1i1.11. \nKartini, Doyan, A., Kosim, Susilawati, Khasanah,  B.U., \nHakim, S., & Muliyadi, L. (2019). Analysis of \nValidation Development Learning Model \nAttainment Concept to Improve Critical \nThinking Skills and Student Learning Outcomes. \nJurnal Penelitian Pendidikan  IPA, 5(2), 185 -188. \ndoi: 10.29303/jppipa.v5i2.262. \nKhasanah, B. U., Doyan, A., Gunawan, S usilawati, \nKartini, Hakim, S., & Muliyadi, L., (2019). \nAnalysis Validation of Learning Media Quantum \nPhenomenon. Jurnal Penelitian Pendidikan IPA,  \n5(2), 189-193. doi: 10.29303/jppipa.v5i2.265. \nSusilawati, Susilawati, &  Sridana, N. (2015). Pengaruh \nModel Pembelajaran Inkuiri Terbimbing \nTerhadap Keterampilan Proses Sains Siswa. \nJurnal Tadris IPA Biologi FITK IAIN Mataram , 8(1), \n27-36. \nSusilawati, Doyan, A., Harjono, A. & Kosim. (2019). \nPenerapan Model Pembelajaran Inkuiri  Berbasis \nMedia Virtual Program Java Pada Guru Fisika \nDan Siswa SMA. Jurnal Pengabdian Masyarakat \nSains Indonesia, 1(1), 4-10. \nSusilawati, Doyan, A.,  & Ayub, S. (2019). Perbedaan \nKeterampilan Generik Sains antara Model \nPembelajaran Berbasis Masalah dengan Inkuiri \nTerbimbing Ditinjau dari Kemampuan Berpikir \nKritis Siswa SMA. Jurnal Pendidikan Fisika dan \nTeknologi, 5 (1), 16-24. doi:10.29303/jpft.v5i1.887. \nSusilawati, Doyan, A., Artayasa, P., Soeprianto, H., \nHarjono, A. & Kartini. (2019). Effectiveness of \nScientific Learning Guided Inquiry Devices \nBased on Real Media to Improve Understand \nConcept and Skills Process of Science Students. \nThe 2 nd International Conference on Elementary \nEducation, 2 (1), 517-524. \nTrianto. (2012). Model Pembelajaran Terpadu dalam Teori \ndan Praktek. Jakarta : Prestasi Pustaka Publisher. \n \n \n \n- The steps of activities in SAS need to be adjusted to the \nguided inquiry learning model that is to provide \nopportunities for students to plan investigative activities. \n- The steps of the activities in SAS  have been adjusted \nto the guided inquiry learning model that is to provide \nopportunities for students to plan investigative \nactivities. \n4 Instrument of Science Process Skill \n- Need to add an important aspect of the science process \nskills, namely the science process, which is about writing \nexperimental results in the form of tables or graphs and \nsummarizing experimental data. \n- Has added an important aspect of the science process \nskills, namely the science process, which is about \nwriting experimental results in the form of tables  or \ngraphs and inferring experimental data. \n- Scores on the science process skills assessment rubric \nshould be sorted from smallest to largest. \n- The scores on the science process skills assessment \nrubric have been sorted from the smallest to the \nlargest. \n- Need to add an important aspect of the science process \nskills, namely the science process, which is about writing \nexperimental results in the form of tables or graphs and \nsummarizing experimental data. \n- Has added aspects of the science process skills, \nnamely the science process, which is about writing \nexperimental results in the form of tables or graphs \nand summarizing experimental data. ",
  "topic": "Syllabus",
  "concepts": [
    {
      "name": "Syllabus",
      "score": 0.7507194876670837
    },
    {
      "name": "Process (computing)",
      "score": 0.6639121770858765
    },
    {
      "name": "Construct (python library)",
      "score": 0.5434338450431824
    },
    {
      "name": "Computer science",
      "score": 0.5316717624664307
    },
    {
      "name": "Lesson plan",
      "score": 0.4762340188026428
    },
    {
      "name": "Plan (archaeology)",
      "score": 0.47280874848365784
    },
    {
      "name": "Mathematics education",
      "score": 0.46528688073158264
    },
    {
      "name": "Science education",
      "score": 0.41958385705947876
    },
    {
      "name": "Psychology",
      "score": 0.2396576702594757
    },
    {
      "name": "History",
      "score": 0.0
    },
    {
      "name": "Programming language",
      "score": 0.0
    },
    {
      "name": "Archaeology",
      "score": 0.0
    },
    {
      "name": "Operating system",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I168180000",
      "name": "University of Mataram",
      "country": "ID"
    }
  ],
  "cited_by": 22
}