{
    "title": "Research on the application of Decision Tree and Random Forest Algorithm in the main transformer fault evaluation",
    "url": "https://openalex.org/W3119144332",
    "year": 2021,
    "authors": [
        {
            "id": "https://openalex.org/A2104885304",
            "name": "Chenmeng Zhang",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2534032538",
            "name": "Can Hu",
            "affiliations": [
                null
            ]
        },
        {
            "id": "https://openalex.org/A2140793205",
            "name": "Shijun Xie",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2164870036",
            "name": "Shuping Cao",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2104885304",
            "name": "Chenmeng Zhang",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2534032538",
            "name": "Can Hu",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2140793205",
            "name": "Shijun Xie",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2164870036",
            "name": "Shuping Cao",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2196785217",
        "https://openalex.org/W1987100535",
        "https://openalex.org/W1989426076",
        "https://openalex.org/W2090444805",
        "https://openalex.org/W2023682610",
        "https://openalex.org/W2143216386"
    ],
    "abstract": "Abstract The detection and monitoring methods of power equipment are relatively complex. The analysis of a large amount of data obtained from detection and monitoring and the development of data recording methods make it possible to obtain higher-dimensional power data. If we adopt appropriate data analysis method to the data sets, we can better get the potential laws and value of power data. In this paper, we took various basic monitoring data and faults records of the 110kV main transformers into consideration, and the grid-equipment-environment data was fused. Based on the fused data, we used the decision tree and random forest algorithm to evaluate the main transformers’ defects and faults. The evaluation results of the two algorithms were obtained and compared, which proved the effectiveness of the fault evaluation algorithm and selected a more accurate fault evaluation algorithm. This paper provides new ideas for smart fault detection for power grid, and provides a reference for a more in-depth evaluation of power grid equipment.",
    "full_text": null
}