{
  "title": "A Partial Discharge Localization Method in Transformers Based on Linear Conversion and Density Peak Clustering",
  "url": "https://openalex.org/W3120266438",
  "year": 2021,
  "authors": [
    {
      "id": "https://openalex.org/A5103188254",
      "name": "Shudong Wang",
      "affiliations": [
        null,
        "Hefei University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5020019416",
      "name": "Yigang He",
      "affiliations": [
        "Hefei University of Technology",
        "Wuhan University"
      ]
    },
    {
      "id": "https://openalex.org/A5090273766",
      "name": "Baiqiang Yin",
      "affiliations": [
        "Hefei University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5075079967",
      "name": "Wenbo Zeng",
      "affiliations": [
        "Hefei University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5034563404",
      "name": "Ying Deng",
      "affiliations": [
        "Hefei University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5062029777",
      "name": "Zengchao Hu",
      "affiliations": [
        "Hefei University of Technology"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2900089459",
    "https://openalex.org/W2945887213",
    "https://openalex.org/W2955986943",
    "https://openalex.org/W2921078400",
    "https://openalex.org/W2358490399",
    "https://openalex.org/W2988480857",
    "https://openalex.org/W2315251746",
    "https://openalex.org/W2905491444",
    "https://openalex.org/W2790259478",
    "https://openalex.org/W2207354331",
    "https://openalex.org/W2103191800",
    "https://openalex.org/W2107730391",
    "https://openalex.org/W1981274855",
    "https://openalex.org/W2146954551",
    "https://openalex.org/W2416882504",
    "https://openalex.org/W2810802136",
    "https://openalex.org/W6777176073",
    "https://openalex.org/W2899893835",
    "https://openalex.org/W2743269949",
    "https://openalex.org/W1984467659",
    "https://openalex.org/W2883550674",
    "https://openalex.org/W2165835468",
    "https://openalex.org/W2115069150",
    "https://openalex.org/W3021077166",
    "https://openalex.org/W2557706747",
    "https://openalex.org/W2115383907",
    "https://openalex.org/W2909359396",
    "https://openalex.org/W1931803241",
    "https://openalex.org/W2138249727",
    "https://openalex.org/W2172031339",
    "https://openalex.org/W2576117416",
    "https://openalex.org/W2096620497",
    "https://openalex.org/W2148876405",
    "https://openalex.org/W2886610070",
    "https://openalex.org/W6783099387",
    "https://openalex.org/W3024008852",
    "https://openalex.org/W3084908386"
  ],
  "abstract": "The detection of partial discharge (PD) is a crucial method to evaluate the insulation status of transformers. The main difficulties of the current localization algorithms are the complexity of the solution and sensitivity to time delay errors. This article proposes a PD localization method in transformers based on linear conversion and density peak clustering (DPC). First, to reduce the complexity of solving the localization equations, the nonlinear localization equations are transformed into linear localization equations by eliminating the second-order terms. Then, to reduce the influence of time delay errors on localization accuracy, the initial localization values are located by multiple acoustic emission (AE) sensors. Finally, the optimal PD coordinates are determined by clustering the initial location values using density peaks clustering algorithm with automatic finding centers (AFC-DPC). The experimental results show that the proposed method can improve PD localization accuracy in transformers, and the average localization error is 5.30 cm.",
  "full_text": "Received December 12, 2020, accepted December 31, 2020, date of publication January 6, 2021, date of current version January 13, 2021.\nDigital Object Identifier 10.1 109/ACCESS.2021.3049558\nA Partial Discharge Localization Method in\nTransformers Based on Linear Conversion and\nDensity Peak Clustering\nSHUDONG WANG\n1,3, (Graduate Student Member, IEEE), YIGANG HE\n1,2, (Member, IEEE),\nBAIQIANG YIN\n 1, WENBO ZENG\n 1, YING DENG1, AND ZENGCHAO HU1\n1School of Electrical Engineering and Automation, Hefei University of Technology, Hefei 230009, China\n2School of Electrical Engineering and Automation, Wuhan University, Wuhan 430072, China\n3State Grid Anhui Electric Power Company Ltd., Electric Power Research Institute, Hefei 230031, China\nCorresponding authors: Baiqiang Yin (yinbaiqiang123@163.com) and Yigang He (18655136887@163.com)\nThis work was supported in part by the National Natural Science Foundation of China under Grant 51977153, Grant 51977161,\nGrant 51577046, and Grant 61971175; in part by the State Key Program of National Natural Science Foundation of China under\nGrant 51637004; in part by the National Key Research and Development Plan ‘‘Important Scientiﬁc Instruments and Equipment\nDevelopment’’ under Grant 2016YFF0102200; in part by the Equipment Research Project in Advance under Grant 41402040301; and in\npart by the Fundamental Research Funds for the Central Universities under Grant JZ2019YYPY0025.\nABSTRACT The detection of partial discharge (PD) is a crucial method to evaluate the insulation status of\ntransformers. The main difﬁculties of the current localization algorithms are the complexity of the solution\nand sensitivity to time delay errors. This article proposes a PD localization method in transformers based\non linear conversion and density peak clustering (DPC). First, to reduce the complexity of solving the\nlocalization equations, the nonlinear localization equations are transformed into linear localization equations\nby eliminating the second-order terms. Then, to reduce the inﬂuence of time delay errors on localization\naccuracy, the initial localization values are located by multiple acoustic emission (AE) sensors. Finally,\nthe optimal PD coordinates are determined by clustering the initial location values using density peaks\nclustering algorithm with automatic ﬁnding centers (AFC-DPC). The experimental results show that the\nproposed method can improve PD localization accuracy in transformers, and the average localization error\nis 5.30 cm.\nINDEX TERMS Partial discharge (PD), localization, time difference of arrival (TDOA), acoustic emis-\nsion (AE) sensors, AFC-DPC.\nI. INTRODUCTION\nMost power grid failures are caused by insulation defects\n[1]–[3]. Partial discharge (PD) usually occurs when electrical\nequipment is defective in insulation [4]. As the primary equip-\nment in the power grid, the insulation status of the transformer\ndirectly affects the safe operation of the power grid [5], [6].\nThe detection of PD is an important method to evaluate the\ninsulation status of transformers [7]. Determining the exact\nposition of the PD source can more accurately reﬂect the\ninsulation status of the transformer and help the operator to\nformulate the appropriate maintenance strategies [8]–[10].\nThe detection of PD localization can usually be divided\ninto the ultra-high-frequency (UHF) method and acoustic\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Mehdi Bagheri\n.\nemission (AE) method [11]. The UHF method has good\nanti-interference and high sensitivity, but the installation of\nUHF sensors still faces some challenges. The transformer\ntank has an electromagnetic shielding effect, so most UHF\nsensors must be preinstalled in the transformer. Once the\ntransformer comes into service, it is difﬁcult to install UHF\nsensors in transformer [12]. Unlike UHF sensor, AE sensor\nis not affected by external electrical interference and can\nbe easily installed on the enclosure of transformer [13].\nTherefore, the AE method has been widely applied in PD\nlocalization [14].\nWhen PD occurs, the AE method calculates the time\ndelay in arrival of the acoustic signal. Then the localization\nequations are established according to the time difference\nof arrival (TDOA) localization method, and the position of\nPD is obtained [15]–[17]. This shows that the time delay\nVOLUME 9, 2021 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see https://creativecommons.org/licenses/by/4.0/ 7447\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nis the crucial parameter in PD localization and solving the\nlocalization equations is the key process. However, it is chal-\nlenging to solve the localization equations characterized by\nnonlinearity [19]. Besides, due to the interference factors such\nas the noise of the detection system and the internal structure\nof the transformer, the time delay data obtained are inevitably\nerrors [18]. These problems will reduce the accuracy of PD\nlocalization.\nIn order to improve localization accuracy, many PD local-\nization algorithms have been reported. The traditional method\nof solving localization equations is the Newton-Raphson iter-\native algorithm, but it is prone to local convergence [20], [21].\nIn addition, the algorithm requires an initial value to be\nclose to the actual position. If the initial value is incor-\nrectly selected, the algorithm cannot converge [12], [19].\nTo solve the above problems, intelligent optimization algo-\nrithms such as particle swarm optimization (PSO) algo-\nrithm [14], [22], genetic algorithm (GA) [23], and neural\nnetwork algorithm [24] have been applied to PD localization.\nHowever, these algorithms do not consider the effect of time\ndelay error on PD localization accuracy.\nThe inner structure of the transformer will cause refraction,\nreﬂection and diffraction of the PD signal, thus increasing\nthe time delay error. Some researchers have studied ways to\nimprove the accuracy of time delays. A recent study [25] has\nestablished a PD localization model that considers the errors\ncaused by refraction and diffraction. In [26], an improved\npropagation route search (IPRS) algorithm has been pro-\nposed, which can obtain the fastest propagation route of the\nPD signal. In [4], the acoustic wave propagation inside the\ntransformer has been discussed, and a ﬁber-optic acoustic\nsensor array has been designed for PD localization in trans-\nformer winding. The article [27] has studied how to locate the\nPD in the transformer by the macro ﬁber composite sensors\n(MFCS). The MFCS can be installed on uneven surfaces and\ncan be applied to transformers of various shapes. However,\nthe time delay detected by the AE sensors will inevitably have\nerrors.\nThis article proposes a novel PD localization method in\ntransformers based on linear conversion and density peak\nclustering (DPC). First, eight AE sensors are used to detect\nPD simultaneously. Then, the nonlinear localization equa-\ntions are transformed into linear localization equations, and\n56 initial localization values are obtained by the Gaussian\nelimination method. Finally, the optimal coordinates of PD\nsource are determined by clustering the initial location values\nby using the density peaks clustering algorithm with auto-\nmatic ﬁnding centers (AFC-DPC).\nOverall, the main contributions of the article include:\n1) Considering the difﬁculty in solving nonlinear localiza-\ntion equations using existing algorithms, we propose\nto transform nonlinear localization equations into lin-\near localization equations by eliminating second-order\nterms.\n2) To reduce the impact of time delay errors on local-\nization accuracy and decrease the dependence of\nalgorithm on exact time delay data, PD is simultane-\nously located by multiple AE sensors. We can obtain\nmultiple initial localization values. Then the optimal\ncoordinates of the PD source are determined by clus-\ntering the initial location values.\n3) The DPC algorithm needs to determine the cutoff\ndistance manually to calculate the local density, and\naccording to the decision graph manually select the\ncluster centers. To overcome those two limitations,\nthe proposed AFC-DPC algorithm applies the cutoff\ndistance sequence to calculate the local density. In addi-\ntion, it uses the γi value to determine the cluster centers.\nThe remainder of this article is organized as follows.\nIn section II, we brieﬂy introduce the principle of PD local-\nization. We proposed a novel localization algorithm based\non AFC-DPC in section III. In section IV , simulations and\nexperiments with the localization algorithm are presented.\nFinally, the conclusions are shown in section V .\nII. THEORY OF PD LOCALIZATION IN TRANSFORMERS\nA. PRINCIPLE OF TDOA LOCALIZATION\nThe principle of TDOA localization method is to receive sig-\nnals from the point to be located through multiple sensors and\nthen obtain the time delay data of the signals reaching each\nsensor. The nonlinear localization equations are established\nby using the coordinates and time delay data of each sensor.\nFinally, the coordinates of the point to be located can be\nobtained by solving the localization equations.\nTo determine the PD position in 3D space, at least four\nor more AE sensors are needed to simultaneously detect the\nPD signal. Suppose the coordinates of the PD source and AE\nsensors are P (x , y, z) and S i (xi, yi, zi) (i =1, 2, ..., n),\nrespectively. According to the principle of TDOA localiza-\ntion, the following localization equations are established:\n\n\n\n\n\n\n\n\n\n\n\n\n(x −x1)2 +(y −y1)2 +(z −z1)2 =v2t2\n(x −x2)2 +(y −y2)2 +(z −z2)2 =v2(t +τ21)2\n(x −x3)2 +(y −y3)2 +(z −z3)2 =v2(t +τ31)2\n(x −x4)2 +(y −y4)2 +(z −z4)2 =v2(t +τ41)2\n......\n(x −xn)2 +(y −yn)2 +(z −zn)2 =v2(t +τn1)2\n(1)\nwhere t is the time required for the acoustic wave to reach\nthe ﬁrst sensor from the PD source. Here, τi1 is the time delay\nbetween the acoustic wave from the PD source to reaching the\ni th (i =2, 3, ..., n) sensor and the ﬁrst sensor. The velocity\nof the acoustic wave is v.\nThe coordinates of the PD source can be obtained by\nsolving the nonlinear localization equations (1).\nB. LOCALIZATION MODEL TRANSFORMATION\nIt is difﬁcult to solve complex nonlinear localization equa-\ntions. To avoid the above problem, the nonlinear equations\nare transformed into linear equations by eliminating the\nsecond-order terms [28].\n7448 VOLUME 9, 2021\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nFive AE sensors are needed to locate the PD to convert\nthe nonlinear localization equations into linear localization\nequations. We can get the following equations from (1):\n(x −x1)2 +(y −y1)2 +(z −z1)2 =v2t2 (2)\n(x −x2)2 +(y −y2)2 +(z −z2)2 =v2 (t +τ21)2 (3)\n(x −x3)2 +(y −y3)2 +(z −z3)2 =v2 (t +τ31)2 (4)\n(x −x4)2 +(y −y4)2 +(z −z4)2 =v2 (t +τ41)2 (5)\n(x −x5)2 +(y −y5)2 +(z −z5)2 =v2 (t +τ51)2 (6)\nExpand and subtract (2) and (3) to obtain the following\nequation:\n(x2 −x1)x +(y2 −y1)y +(z2 −z1)z +v2τ21t\n=0.5 ×\n[(\nx2\n2 +y2\n2 +z2\n2\n)\n−\n(\nx2\n1 +y2\n1 +z2\n1\n)\n−v2τ2\n21\n]\n(7)\nLet xi1 =xi- x1, yi1 =yi - y1, zi1 =zi - z1, li =x2\ni +y2\ni +z2\ni ,\nand i =2, 3, ..., 5. Then (7) can be rewritten as follows:\nx21x +y21y +z21z +v2τ21t =0.5\n(\nl2 −l1 −v2τ2\n21\n)\n(8)\nSimilarly, (5), (6), and (7) are expanded and subtracted\nfrom (2), respectively, to obtain the following equations:\nx31x +y31y +z31z +v2τ31t =0.5\n(\nl3 −l1 −v2τ2\n31\n)\n(9)\nx41x +y41y +z41z +v2τ41t =0.5\n(\nl4 −l1 −v2τ2\n41\n)\n(10)\nx51x +y51y +z51z +v2τ51t =0.5\n(\nl5 −l1 −v2τ2\n51\n)\n(11)\nEquations (8) - (10) can be rewritten into the localization\nequations as follows:\n\n\nx21 y21 z21 v2τ21\nx31 y31 z31 v2τ31\nx41 y41 z41 v2τ41\nx51 y51 z51 v2τ51\n\n·\n\n\nx\ny\nz\nt\n\n\n=0.5 ·\n\n\nl2 −l1 −v2τ2\n21\nl3 −l1 −v2τ2\n31\nl4 −l1 −v2τ2\n41\nl5 −l1 −v2τ2\n51\n\n (12)\nwhere xi1 =xi- x1, yi1 =yi - y1, zi1 =zi - z1, li =x2\ni +y2\ni +z2\ni ,\nand i =2, 3, ..., 5.\nThe Gaussian elimination algorithm can solve the linear\nlocalization equations (12), and the coordinates of the PD\nsource can be obtained.\nIII. MULTI INITIAL LOCALIZATION VALUES CLUSTERING\nMETHOD BASED ON AFC-DPC\nA. ACQUISITION OF INITIAL LOCALIZATION VALUES\nBy using the coordinates and time delay data of a set of\nAE sensors, an initial localization value can be obtained and\nexpressed as P 1. For PD source at the same position, the\ncoordinates and time delay data of another set of AE sensors\nare used to substitute into (12). Another initial localization\nvalue can also be obtained, expressed as P 2. It can be seen\nfrom (12) that the time delay data is the crucial parameter\nin localization equations. Theoretically, if there is no error in\ntime delays, then P 1 and P 2 are identical. However, due to\ninterference factors such as the noise of the detection system\nand the internal structure of the transformer, the measured\ntime delays will inevitably produce errors. This will lead to\nthe points P 1 and P2 being noncoincidence and having some\nerrors with the actual PD position.\nTo improve the accuracy of PD localization, we use mul-\ntiple AE sensors to locate PD and obtain multiple initial\nlocalization values. Then we can determine the optimal PD\ncoordinates by using a clustering algorithm to reduce the\neffect of the time delay on the localization accuracy.\nUsing too many AE sensors will increase detection costs.\nOn the other hand, it will increase the task of solving local-\nization equations and clustering. When too few sensors are\nutilized, the few initial localization values obtained are not\nconducive to clustering. Therefore, we use eight AE sen-\nsors to detect PD simultaneously in this article. According\nto (12), any ﬁve AE sensors form a group and establish the\ncorresponding localization equations. We can obtain 56 initial\nlocalization values by solving these localization equations.\nB. AFC-DPC\nThe DPC algorithm was ﬁrst proposed by A. Rodriguez and\nA. Laio. in 2014 [29]. The algorithm is based on the idea\nthat the density of the cluster center is greater than that\nof the neighbor, and the distance from the point is higher.\nThe algorithm determines the cluster centers by calculating\nthe local densities and distances of the points and then assigns\nthe remaining points to the same clusters with the closest\npoints. As can be seen above, local density and distance\nare two critical parameters in the DPC algorithm. These\ntwo parameters and their calculation methods are described\nbelow.\nSuppose there is a data set s ={xi}N\ni=1, i =1, 2, ..., N. For\neach data point xi in the data set s, there is a corresponding\nlocal density and distance. Let dij represents the Euclidean\ndistance between data points xi and xj.\ndij =\nxi −xj\n\n\n2 (13)\nThere are two calculation methods for the local density ρi,\n(14) and (15) are the cutoff kernel method and the Gaussian\nkernel method, respectively.\nρi =\nn∑\nj=1\nχ\n(\ndij −dc\n)\n(14)\nwhere χ(x)=\n{1,x <0\n0, x ≥0 , and dc >0 is the cutoff distance.\nρi =\nn∑\nj=1\ne\n−\n(dij\ndc\n)2\n(15)\nThe distance δi is deﬁned as follows: when the data point xi\nhas the largest local density, δi is the distance of the data point\nVOLUME 9, 2021 7449\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nwith the largest distance from xi in the data set s. Besides, for\nother data points that do not have the maximum local density,\nδi is the distance from the data point with the smallest distance\namong all data points with a local density greater than xi. The\nformula for calculating δi is as follows:\nδi =\n\n\n\nmin\nj\n(\ndij\n)\n, ∃j s.t.ρj >ρi\nmax\nj\n(\ndij\n)\n, otherwise (16)\nThe DPC algorithm is simple and easy to realize. The\nkey to the algorithm is to choose cluster centers based on\nthe local density and distance. Compared with other algo-\nrithms, the DPC algorithm only needs to select the clus-\nter centers once, and it does not need to iterate the target\nfunction.\nHowever, the DPC algorithm has the following two dis-\nadvantages [30]. On the one hand, the cutoff distance dc\nis manually selected based on empirical values [31]. The\nsuggestion given in reference [29] is to choose to sort the\ndistance between all data points in ascending order and take\nthe ﬁrst 1% to 2% as the cutoff distance. For different sam-\nples, the clustering results produced by this general cutoff\ndistance selection method may have some errors from the\nactual results [32], [33]. On the other hand, according to the\ndecision graph, the DPC algorithm manually selects cluster\ncenters with larger ρi and δi. In order to solve these two prob-\nlems, an AFC-DPC algorithm is proposed. The AFC-DPC\nalgorithm uses the cutoff distance sequence to calculate the\nlocal density to overcome pre-speciﬁed cutoff distance. Fur-\nthermore, the manual selection of cluster centers based on the\ndecision graph is overcome by determining the cluster center\nwith γi value.\n1) CUTOFF DISTANCE SEQUENCE AND LOCAL DENSITY\nThe maximum cutoff distance dmax is deﬁned as\ndmax =min\ni\n{\ndi\n⏐⏐di =max dij,i,j =1,2,..., n\n}\n(17)\ndmax can take all points as its neighbors and is the neighbor\nradius lower bound containing all points. Therefore, the cut-\noff distance sequences can be deﬁned as follows:\nQ ={dci |dci =i ×h,h =dmax/n,i =1,2,..., n} (18)\nThe local density of xi is deﬁned as follows:\nρi =\nn∑\nl=1\n\n\nn∑\nj=1\nχ\n(\ndij −dcl\n)\n/l\n\n (19)\nwhere dij =\nxi −xj\n\n\n2 and dcl ∈Q.\nAs we can see from (19), the cutoff distance sequence can\nensure that the local density of at least one point will be\naffected by all other points. When Q increases, the differ-\nence in the number of points in the neighbor of the same\ncutoff distance will also be reﬂected in the local density.\nSimilar to the local density of DPC algorithm with Gaussian\nFIGURE 1. Flow chart of proposed PD localization.\nkernel, AFC-DPC algorithm also considers the effect of all\ndata points on local density. Every point contributes to the\nlocal density. However, their contributions are different, and\nthe farther points have a weaker contribution to the local\ndensity [34].\n2) SELECTION OF CLUSTER CENTERS\nFor different data sets, the local density and distance of each\ndata point vary. In order to simplify the calculation, the local\ndensity ρi and distance δi are normalized. Then deﬁne the γi\nof each data point xi as follows:\nγi =ρi\n√\nδi (20)\nwhere i =1, 2, ..., n.\nAll data points xi are arranged in descending order accord-\ning to the magnitude of the γi values, and the ﬁrst u data points\nare taken as the cluster centers. We take 10% of the number\nof samples as the number of cluster centers. In other words,\nwe take u =6 in this article.\nThe DPC algorithm deﬁnes the cluster centers with large\nlocal density ρi and distance δi,, and the anomaly points\nhave higher δi values and lower ρi values. Therefore, in the\nAFC-DPC algorithm, we have weakened the function of\nthe δi value in determining the cluster centers and have\ndeﬁned a quantity γi which combines the ρi and the δi.\nThe larger the γi, the more likely they are the cluster\ncenters.\nC. AFC-DPC ALGORITHM FLOW\nThe proposed AFC-DPC algorithm ﬂow is shown in Fig.2 and\nTable 1.\nD. COMPUTATIONAL COMPLEXITY ANALYSIS\nSuppose n is the number of data points in the data set,\nu is the number of clusters, and h is the number of\niterations. As shown in Table 2, we choose K-Means,\nDBSCAN, and DPC to compare the computational com-\nplexity with the AFC-DPC algorithm proposed in this\narticle [31], [34].\n7450 VOLUME 9, 2021\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nFIGURE 2. Steps for the proposed AFC-DPC algorithm.\nTABLE 1. The Proposed AFC-DPC Algorithm Flow.\nE. DETERMINATION OF THE OPTIMAL PD SOURCE\nCOORDINATES\nAfter 56 initial localization values are clustered, they will\nbe divided into u clusters. By averaging all the data in each\nTABLE 2. Computational Complexity Comparisons.\ncluster, u points can be obtained, and the coordinates of each\npoint is recorded as P′\nk\n(\nx′\nk ,y′\nk ,z′\nk\n)\n(k =1, 2, ..., u).\nWhen the number of AE sensors is eight, the nonlinear\nlocalization equations (1) can be written as follows:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n√\n(x −x1)2 +(y −y1)2 +(z −z1)2 =vt√\n(x −x2)2 +(y −y2)2 +(z −z2)2 =v(t +τ21)√\n(x −x3)2 +(y −y3)2 +(z −z3)2 =v(t +τ31)\n..\n.√\n(x −x8)2 +(y −y8)2 +(z −z8)2 =v(t +τ81)\n(21)\nLet ri =\n√(\nx′\nk −xi\n)2 +\n(\ny′\nk −yi\n)2 +\n(\nz′\nk −zi\n)2 subtract\nthe 2nd - 8th equation from the ﬁrst equation in (21), and\nthe following equations can be obtained:\n\n\n\n\n\n\n\nr2 −r1 =vτ21\nr3 −r1 =vτ31\n..\n.\nr8 −r1 =vτ81\n(22)\nLet Xk =\n(\nx′\nk ,y′\nk ,z′\nk\n)T, (22) can be rewritten as follows:\nF (Xk )=\n\n\nr2 −r1 −vτ21\nr3 −r1 −vτ31\n..\n.\nr8 −r1 −vτ81\n\n=\n\n\nf1 (Xk )\nf2 (Xk )\n..\n.\nf8 (Xk )\n\n (23)\nIf there are no errors in the time delay data, then F(Xk ) =\n0. However, there are inevitably errors in the time delay\ndata, so F(Xk ) ̸=0. In other words, F(Xk ) can describe the\nmagnitude of the solution error of (22). This article takes the\n1 norm of F(Xk ) as the evaluation index, and the evaluation\nindex Ek is deﬁned as follows:\nEk =∥F (Xk )∥1 (24)\nCalculate the evaluation index Ek of point P′\nk and com-\npare their values. When there are errors in the time delays,\nthe smaller the value of Ek , the smaller the errors of the\nsolution of (21). In other words, the point where the value of\nthe evaluation index is the smallest is closest to the actual PD\nsource. Take this point as the optimal PD source coordinates.\nF. STEPS OF PD LOCALIZATION METHOD PROPOSED IN\nTHIS PAPER\nThe main steps of the PD localization method in transform-\ners based on linear conversion and AFC-DPC proposed are\nshown in Fig. 3.\nVOLUME 9, 2021 7451\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nFIGURE 3. Steps of the PD localization method proposed in this article.\nIV. SIMULATIONS AND EXPERIMENTS OF THE\nALGORITHM\nA. NUMERICAL SIMULATIONS\nAs shown in Fig. 4, the size of the transformer is assumed to\nbe 150cm ×100cm ×120cm. The coordinates of PD source\nare P (60, 45, 80) cm. The coordinates of the eight AE sensors\nare S 1 (10, 0, 10) cm, S 2 (10, 100, 10) cm, S 3 (140, 100,\n10) cm, S 4 (140, 0, 10) cm, S 5 (20, 0, 110) cm, S 6 (20, 100,\n110) cm, S 7 (130, 100, 110) cm, and S 8 (130, 0, 110) cm. The\nspeed of acoustic wave propagating in the oil of transformer\nis 1500m/s [35].\nThe theoretical time delays of acoustic waves from the PD\nsource to each sensor can be calculated using the coordinates\nof each sensor and PD source. In actual detection, there are\ninevitable errors in the time delays. To verify the correctness\nFIGURE 4. Hardware structure of PD localization.\nand feasibility of the algorithm, the time delay errors are arti-\nﬁcially added based on the theoretical time difference data,\nwhich is used to simulate the time delays in actual detection.\nSuppose that the theoretical time delay is τ, the simulated\ntime delay is τ′after adding the error, and the deﬁned time\ndelay error is e:\ne =\n⏐⏐⏐⏐\nτ′−τ\nτ\n⏐\n⏐⏐⏐ (25)\nAdd ﬁve types of random time delays errors within a\ncertain range, which are e1 ∈(0, 2%), e2 ∈(2%, 4%), e3 ∈\n(4%, 6%), e4 ∈(6%, 8%) and e5 ∈(8%, 10%). The simulated\ntime delay data are shown in Table 3.\nTABLE 3. Time Delay Data of Eight AE Sensors.\nAssuming that the actual coordinates of the PD source are\n(xact, yact, zact) and the coordinates obtained by the localiza-\ntion algorithm are (x , y, z), then the PD localization error is\ndeﬁned as follows\n1R =\n√\n(x −xact)2 +(y −yact)2 +(z −zact)2 (26)\nWe deﬁne the error on each axis as follows:\n1x =|x −xact| (27)\n1y =|y −yact| (28)\n1z =|z −zact| (29)\nThen, the maximum error of coordinates is as follows:\nDmax =max {1x,1y,1z } (30)\n7452 VOLUME 9, 2021\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nTABLE 4. Localization Results and Errors Before and After Clustering.\nThe scatter plots and clustering results of 56 initial local-\nization values under ﬁve different time delay errors are shown\nin Fig. 5. With the increase of time delay errors, the initial\nlocalization values are gradually discrete. The 56 initial local-\nization values are clustered by using the AFC-DPC algorithm.\nA few cluster points are far beyond the scope of the trans-\nformer set up by the simulation, so they are not shown. Then,\nthe points in the 6 clusters are averaged, and the optimal PD\nsource coordinates are determined according to the evaluation\nindex Ek .\nTo compare the localization results and errors before and\nafter clustering, we take an average of 56 initial localization\nvalues as the localization results before clustering. At the\nsame time, we compared the localization errors of K-Means,\nDensity-Based Spatial Clustering of Applications with Noise\n(DBSCAN), DPC, and the proposed AFC-DPC algorithm.\nThe number of clusters in the K-Means algorithm is 6, and\nthe cluster centers are randomly selected. In the DBSCAN\nalgorithm, the radius of the neighborhood is 3, and the core\nobject contains at least 5 samples. The DPC algorithm uses\nthe Gaussian kernel to calculate the local density, chooses to\nsort the distances between all data points in ascending order\nand takes the ﬁrst 2% as the cutoff distance.\nThe localization results and errors are shown in Fig. 6 and\nTable 4. We can see that when the time delay error is tiny (for\nexample, the time delay error is e1), the localization errors\nbefore and after clustering are not much different. When\nthe time delay error is e2, the localization error after using\nthe clustering algorithm is smaller except for the K-Means\nalgorithm. When the time difference error reaches e3 (that is,\nthe time difference error is greater than 4%), with the time\ndelay error increasing, the localization error after clustering is\nsmaller than before clustering. However, only the AFC-DPC\nalgorithm has the smallest localization errors and highest\nstability.\nThe results show that PD localization is very sensitive to\nthe time delay parameter, and the clustering algorithm can\neffectively reduce the effect of the time delay error. How-\never, compared with other clustering algorithms, only the\nAFC-DPC algorithm proposed in this article can keep the\nlocalization error minimum.\nThe following takes the data set with time delay error e5\nas an example to analyze the process of the method in this\narticle. First, 56 initial localization values are calculated by\nGaussian elimination. The speciﬁc data are shown in Table 5.\nThe errors of 56 initial localization values are shown in Fig. 7.\nThere are some errors in time delays, which result in a large\ndispersion of initial localization values. Besides, the errors of\nsome initial localization values are large, and the PD position\ncannot be accurately found. The average location result for\nthese 56 initial location values are (65.7,46.4,71.1) cm, and\nthe localization error is 10.7 cm. Then, we use the AFC-DPC\nalgorithm to cluster the 56 initial localization values. Accord-\ning to (19), the local density ρi of each data point can be\ncalculated. Then calculate the distance δi of each data point\naccording to (16). Finally, the γi value of each data point is\nobtained according to (20). Table 5 shows the local density\nρi, distance δi and γi value of each data point. We sort the γi\nvalues in descending order and use the ﬁrst 6 data points as\ncluster centers. All data in each cluster are averaged, and the\nevaluation parameter Ek are calculated. As can be seen from\nTable 6, the evaluation index value corresponding to cluster\nVOLUME 9, 2021 7453\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nFIGURE 5. The distribution of 56 initial localization clustering results with different time delay errors where (a) time delay error is\ne1, (b) time delay error ise2, (c) time delay error ise3, (d) time delay error ise4, and (e) time delay error ise5.\n3 is minimal, which means that the ﬁnal localization result is\n(60.0,44.1,81.5) cm and the localization error is 1.7 cm.\nB. EXPERIMENTS IN LABORATORY\nTo verify the effectiveness of the proposed method, we con-\nducted PD localization experiments in the laboratory.\nAs shown in the Fig. 8, the experimental system is composed\nof a transformer box model, PD generator, AE sensors,\nand oscilloscope. The size of the transformer tank model is\n120cm ×160cm ×105cm. The transformer tank model is\nmade of stainless steel with good electromagnetic shielding\nperformance. The coordinates of the eight AE sensors are S 1\n(20, 0, 20) cm, S 2 (20, 160, 20) cm, S 3 (100, 160, 20) cm,\nS4 (100, 0, 20) cm, S 5 (30, 0, 80) cm, S 6 (30, 160, 180) cm,\n7454 VOLUME 9, 2021\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nTABLE 5. 56 Initial Localization Values When the Time Delay Error ise5.\nFIGURE 6. Localization errors before and after clustering.\nTABLE 6. Clustering Results When the Time Delay Error ise5.\nS7 (90, 160, 80) cm, and S 8 (90, 0, 80) cm, respectively. The\ndiameter of the AE sensor is 25mm, the center frequency is\n40kHz, and the receiving sensitivity is greater than -68dB.\nThe PD sources are set at PD 1 (80, 60, 40) cm and PD 2\nFIGURE 7. The localization errors of 56 initial localization values when\ntime delay error ise5.\n(50, 120, 50) cm, respectively. The PD generating device is\ncomposed of a boosting transformer and a protrusion defect\nmodel. The oscilloscope sampling rate is set at 250ks/s. The\ninside of the transformer tank model is not ﬁlled with oil,\nso the speed of acoustic wave in the air is 340 m/s. The\ntime-domain waveforms of PD signals are shown in Figure 9,\nand the time delay data are shown in Table 7.\nWe use the localization method proposed in this article\nto locate two PD sources. The clustering distribution of the\ninitial localization values obtained is shown in Fig. 10. Some\npoints outside the transformer range are not plotted in Fig. 10.\nThe clustering results are shown in Table 8 and Table 9.\nVOLUME 9, 2021 7455\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nFIGURE 8. PD localization experiments in a laboratory where (a) is a\nboosting transformer, (b) is a protrusion defect model, and (c) is the PD\nlocalization system.\nTABLE 7. Time Delay Data of Eight Sensors for PD1 and PD2.\nAccording to the evaluation parameter Ek , the optimal\nPD source coordinates are ﬁnally determined. As shown\nin Table 10, the localization errors of PD 1 and PD2 are 2.4cm\nand 8.2cm, respectively. The average localization error of the\ntwo PD sources is 5.3cm.\nFIGURE 9. The time-domain waveforms of the PD signals where (a) is\nPD1 signal and (b) is PD2 signal.\nTo compare the localization results and errors before and\nafter clustering, we take an average of 56 initial local-\nization values as the localization results before clustering.\nTable 10 shows that the localization errors after clustering\nusing the AFC-DPC algorithm are smaller than before.\nIn [12], methods such as the Newton-Raphson algorithm,\nChan algorithm, genetic algorithm (GA), and imperialist\n7456 VOLUME 9, 2021\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nFIGURE 10. The distribution of 56 initial localization clustering results\nwhere (a) is the results of PD1 and (b) is the results of PD2.\nTABLE 8. Clustering Results for PD1.\nTABLE 9. Clustering Results for PD2.\ncompetitive algorithm (ICA) are used for PD localization in\ntransformer. We take average errors as the errors of these\nmethods. The comparison results are shown in Table 11.\nTABLE 10. Localization Results and Errors Before and After Clustering for\nPD1 and PD2.\nTABLE 11. Error Analysis and Comparison of Localization Results of\nVarious Methods.\nAs can be seen from Table 11, the errors of the method\nproposed in this article are smaller than other methods. The\nresults show that the proposed method can accurately locate\nPD in transformers.\nV. CONCLUSION AND FUTURE WORKS\nThis article proposes a novel PD localization method in\ntransformers based on linear conversion and AFC-DPC. The\nnonlinear localization equations are transformed into linear\nlocalization equations. Multiple initial localization values are\nobtained by simultaneous detection of PD by multiple AE\nsensors. The AFC-DPC algorithm is used to perform cluster\noptimization on multiple initial localization values to deter-\nmine the optimal coordinates of the PD source.\n1) To reduce the difﬁculty of solving the localization\nequations, we transform the nonlinear localization\nequations into linear localization equations by elimi-\nnating the second-order terms.\n2) To decrease the inﬂuence of the time delay errors on\nthe localization accuracy, the initial localization values\nare clustered by using the AFC-DPC algorithm.\n3) The AFC-DPC algorithm uses the cutoff distance\nsequence to calculate the local density and uses the γi\nto determine the clustering centers, which overcomes\nthe limitations of the DPC algorithm and improves the\nclustering performance of the algorithm.\nThe effectiveness and accuracy of the method are veriﬁed\nby simulation and experiments. Simulation results show that\nwhen the time delay error is 8%-10%, the localization error\nis 1.7cm. The experiment results show that the average local-\nization error is 5.3cm. Compared with the errors of other\nVOLUME 9, 2021 7457\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nlocalization methods, the method proposed in this article has\nthe advantages of the low localization error.\nIn future work, we will undertake the following two\nstudies:\n1) We will study methods for extracting precise time\ndelays. The inﬂuence of the inner structure of the trans-\nformer on the refraction and diffraction of the PD signal\ncan be reduced.\n2) To improve the precision of PD localization in trans-\nformers, we will further study the new localization\nalgorithm.\nREFERENCES\n[1] M. Wu, H. Cao, J. Cao, H.-L. Nguyen, J. B. Gomes, and\nS. P. Krishnaswamy, ‘‘An overview of state-of-the-art partial discharge\nanalysis techniques for condition monitoring,’’ IEEE Elect. Insul. Mag.,\nvol. 31, no. 6, pp. 22–35, Nov. 2015.\n[2] W. J. K. Raymond, H. A. Illias, A. H. A. Bakar, and H. Mokhlis, ‘‘Par-\ntial discharge classiﬁcations: Review of recent progress,’’ Measurement,\nvol. 68, pp. 164–181, May 2015.\n[3] N. A. Al-geelani, M. A. M. Piah, and N. Bashir, ‘‘A review on hybrid\nwavelet regrouping particle swarm optimization neural networks for char-\nacterization of partial discharge acoustic signals,’’ Renew. Sustain. Energy\nRev., vol. 45, pp. 20–35, May 2015.\n[4] C. Gao, L. Yu, Y . Xu, W. Wang, S. Wang, and P. Wang, ‘‘Partial dis-\ncharge localization inside transformer windings via ﬁber-optic acoustic\nsensor array,’’ IEEE Trans. Power Del., vol. 34, no. 4, pp. 1251–1260,\nAug. 2019.\n[5] A. Akbari, P. Werle, H. Borsi, and E. Gockenbach, ‘‘Transfer function-\nbased partial discharge localization in power transformers: A feasi-\nbility study,’’ IEEE Elect. Insul. Mag., vol. 18, no. 5, pp. 22–32,\nSep. 2002.\n[6] C. Pan, J. Tang, Y . Zhang, X. Luo, and X. Li, ‘‘Variation of discharge\ncharacteristics with temperature in moving transformer oil contaminated\nby metallic particles,’’ IEEE Access, vol. 6, pp. 40050–40058, 2018.\n[7] L. Luo, B. Han, J. Chen, G. Sheng, and X. Jiang, ‘‘Partial discharge detec-\ntion and recognition in random matrix theory paradigm,’’ IEEE Access,\nvol. 5, pp. 8205–8213, 2017.\n[8] A. U. M. Zaki, Y . Hu, and X. Jiang, ‘‘Partial discharge localization in 3-D\nwith a multi-DNN model based on a virtual measurement method,’’ IEEE\nAccess, vol. 8, pp. 87434–87445, 2020.\n[9] Z. Guozhi, X. Zhang, H. Xingrong, Y . Jia, J. Tang, Z. Yue, T. Yuan, and\nL. Zhenze, ‘‘On-line monitoring of partial discharge of less-oil immersed\nelectric equipment based on pressure and UHF,’’ IEEE Access, vol. 7,\npp. 11178–11186, 2019.\n[10] M. Homaei, S. M. Moosavian, and H. A. Illias, ‘‘Partial discharge local-\nization in power transformers using neuro-fuzzy technique,’’ IEEE Trans.\nPower Del., vol. 29, no. 5, pp. 2066–2076, Oct. 2014.\n[11] C. Gao, W. Wang, S. Song, S. Wang, L. Yu, and Y . Wang, ‘‘Localization of\npartial discharge in transformer oil using Fabry-Pérot optical ﬁber sensor\narray,’’IEEE Trans. Dielectr. Electr. Insul., vol. 25, no. 6, pp. 2279–2286,\nDec. 2018.\n[12] Y .-B. Wang, D.-G. Chang, Y .-H. Fan, G.-J. Zhang, J.-Y . Zhan, X.-J. Shao,\nand W.-L. He, ‘‘Acoustic localization of partial discharge sources in power\ntransformers using a particle-swarm-optimization-route-searching algo-\nrithm,’’IEEE Trans. Dielectr. Electr. Insul., vol. 24, no. 6, pp. 3647–3656,\nDec. 2017.\n[13] W. M. F. Al-Masri, M. F. Abdel-Hafez, and A. H. El-Hag, ‘‘A novel\nbias detection technique for partial discharge localization in oil insula-\ntion system,’’ IEEE Trans. Instrum. Meas., vol. 65, no. 2, pp. 448–457,\nFeb. 2016.\n[14] R. A. Hooshmand, M. Parastegari, and M. Yazdanpanah, ‘‘Simultaneous\nlocation of two partial discharge sources in power transformers based\non acoustic emission using the modiﬁed binary partial swarm optimi-\nsation algorithm,’’ IET Sci., Meas. Technol., vol. 7, no. 2, pp. 112–118,\nMar. 2013.\n[15] H. Hou, G. Sheng, and X. Jiang, ‘‘Robust time delay estimation method\nfor locating UHF signals of partial discharge in substation,’’ IEEE Trans.\nPower Del., vol. 28, no. 3, pp. 1960–1968, Jul. 2013.\n[16] F. Zeng, J. Tang, L. Huang, and W. Wang, ‘‘A semi-deﬁnite relax-\nation approach for partial discharge source location in transformers,’’\nIEEE Trans. Dielectr. Electr. Insul., vol. 22, no. 2, pp. 1097–1103,\nApr. 2015.\n[17] H. H. Sinaga, B. T. Phung, and T. R. Blackburn, ‘‘Partial discharge localiza-\ntion in transformers using UHF detection method,’’ IEEE Trans. Dielectr.\nElectr. Insul., vol. 19, no. 6, pp. 1891–1900, Dec. 2012.\n[18] W. M. F. Al-Masri, M. F. Abdel-Hafez, and A. H. El-Hag, ‘‘Toward high-\naccuracy estimation of partial discharge location,’’ IEEE Trans. Instrum.\nMeas., vol. 65, no. 9, pp. 2145–2153, Sep. 2016.\n[19] M.-X. Zhu, Y .-B. Wang, D.-G. Chang, G.-J. Zhang, X. Tong, and L. Ruan,\n‘‘Quantitative comparison of partial discharge localization algorithms\nusing time difference of arrival measurement in substation,’’ Int. J. Electr.\nPower Energy Syst., vol. 104, pp. 10–20, Jan. 2019.\n[20] P. J. Moore, I. E. Portugues, and I. A. Glover, ‘‘Radiometric\nlocation of partial discharge sources on energized high-voltage\nplant,’’ IEEE Trans. Power Del., vol. 20, no. 3, pp. 2264–2272,\nJul. 2005.\n[21] Q. Zhang, C. Li, S. Zheng, H. Yin, Y . Kan, and J. Xiong, ‘‘Remote detecting\nand locating partial discharge in bushings by using wideband RF antenna\narray,’’IEEE Trans. Dielectr. Electr. Insul., vol. 23, no. 6, pp. 3575–3583,\nDec. 2016.\n[22] L. Tang, R. Luo, M. Deng, and J. Su, ‘‘Study of partial discharge localiza-\ntion using ultrasonics in power transformer based on particle swarm opti-\nmization,’’IEEE Trans. Dielectr. Electr. Insul., vol. 15, no. 2, pp. 492–495,\nApr. 2008.\n[23] Z. Tang, C. Li, X. Cheng, W. Wang, J. Li, and J. Li, ‘‘Partial dis-\ncharge location in power transformers using wideband RF detection,’’\nIEEE Trans. Dielectr. Electr. Insul., vol. 13, no. 6, pp. 1193–1199,\nDec. 2006.\n[24] T. Boczar, S. Borucki, A. Cichon, and D. Zmarzly, ‘‘Application pos-\nsibilities of artiﬁcial neural networks for recognizing partial discharges\nmeasured by the acoustic emission method,’’ IEEE Trans. Dielectr. Electr.\nInsul., vol. 16, no. 1, pp. 214–223, Feb. 2009.\n[25] J. Jia, C. Hu, Q. Yang, Y . Lu, B. Wang, and H. Zhao, ‘‘Localization of par-\ntial discharge in electrical transformer considering multi-media refraction\nand diffraction,’’ IEEE Trans. Ind. Informat., early access, Sep. 14, 2020,\ndoi: 10.1109/TII.2020.3023883.\n[26] Y .-B. Wang, Y .-H. Fan, S.-R. Qin, D.-G. Chang, X.-J. Shao, H.-B. Mu, and\nG.-J. Zhang, ‘‘Partial discharge localisation methodology for power trans-\nformers based on improved acoustic propagation route search algorithm,’’\nIET Sci., Meas. Technol., vol. 12, no. 8, pp. 1023–1030, Nov. 2018.\n[27] B. A. de Castro, D. de Melo Brunini, F. G. Baptista, A. L. Andreoli,\nand J. A. C. Ulson, ‘‘Assessment of macro ﬁber composite sensors for\nmeasurement of acoustic partial discharge signals in power transformers,’’\nIEEE Sensors J., vol. 17, no. 18, pp. 6090–6099, Sep. 2017.\n[28] S. Wang, Y . He, B. Yin, S. Ning, and W. Zeng, ‘‘Partial discharge local-\nization in substations using a regularization method,’’ IEEE Trans. Power\nDel., early access, May 14, 2020, doi: 10.1109/TPWRD.2020.2994660.\n[29] A. Rodriguez and A. Laio, ‘‘Clustering by fast search and ﬁnd\nof density peaks,’’ Science, vol. 344, no. 6191, pp. 1492–1496,\nJun. 2014.\n[30] D. Yu, G. Liu, M. Guo, X. Liu, and S. Yao, ‘‘Density peaks\nclustering based on weighted local density sequence and nearest\nneighbor assignment,’’ IEEE Access, vol. 7, pp. 34301–34317,\n2019.\n[31] M. D. Parmar, W. Pang, D. Hao, J. Jiang, W. Liupu, L. Wang, and\nY . Zhou, ‘‘FREDPC: A feasible residual error-based density peak cluster-\ning algorithm with the fragment merging strategy,’’ IEEE Access, vol. 7,\npp. 89789–89804, 2019.\n[32] L. Sun, R. Liu, J. Xu, and S. Zhang, ‘‘An adaptive density peaks clus-\ntering method with Fisher linear discriminant,’’ IEEE Access, vol. 7,\npp. 72936–72955, 2019.\n[33] M. Parmar, D. Wang, X. Zhang, A.-H. Tan, C. Miao, J. Jiang, and Y . Zhou,\n‘‘REDPC: A residual error-based density peak clustering algorithm,’’ Neu-\nrocomputing, vol. 348, pp. 82–96, Jul. 2019.\n[34] M. Guo, D. Yu, G. Liu, X. Liu, and S. Cheng, ‘‘Drug-target interac-\ntion data cluster analysis based on improving the density peaks clus-\ntering algorithm,’’ Intell. Data Anal., vol. 23, no. 6, pp. 1335–1353,\nNov. 2019.\n[35] Q. Xie, Y . Li, F. C. Lü, C. Li, N. Wang, and Y . J. Ding, ‘‘Method for\nPD location in oil combining ultrasonic phased array with wideband array\nsignal processing,’’Proc. Chin. Soc. Elect. Eng., vol. 29, no. 28, pp. 15–19,\n2009.\n7458 VOLUME 9, 2021\nS. Wanget al.: PD Localization Method in Transformers Based on Linear Conversion and DPC\nSHUDONG WANG (Graduate Student Member,\nIEEE) was born in Anhui, China, in Novem-\nber 1992. He received the B.S. degree in automa-\ntion from Anhui Polytechnic University, Wuhu,\nChina, in 2015. He is currently pursuing the Ph.D.\ndegree in electrical engineering with the Hefei\nUniversity of Technology, Hefei, China.\nHis current research interests include partial dis-\ncharge detection and localization technology for\npower equipment.\nYIGANG HE(Member, IEEE) was born in Hunan,\nChina. He received the M.S. degree in electrical\nengineering from Hunan University, Changsha,\nChina, in 1992, and the Ph.D. degree in electri-\ncal engineering from Xi’an Jiaotong University,\nXi’an, China, in 1996.\nIn 1990, he joined the College of Electrical and\nInformation Engineering, Hunan University, and\nwas promoted as an Associate Professor and a\nProfessor in 1996 and 1999, respectively. He was\na Senior Visiting Scholar with the University of Hertfordshire, Hatﬁeld,\nU.K., in 2002. From 2006 to 2011, he was the Director of the Institute\nof Testing Technology for Circuits and Systems, Hunan University. From\n2011 to 2017, he was also the Head of the School of Electrical Engineering\nand Automation, Hefei University of Technology, Hefei, China. In Decem-\nber 2017, he joined Wuhan University, Wuhan, China, where he is currently\nthe Vice Head of the School of Electrical Engineering and Automation. His\ncurrent research interests include testing and fault diagnosis of analog and\nmixed-signal circuits, electrical signal detection, smart grid, and intelligent\nsignal processing. He was the Winner of the National Science Fund for Dis-\ntinguished Young Scholars and National Excellent Science and Technology\nWorker.\nBAIQIANG YIN was born in Hunan, China.\nHe received the B.S. degree in electrical engineer-\ning from Nanhua University, Hengyang, China,\nin 2008, and the Ph.D. degree in electrical engi-\nneering from Hunan University, Changsha, China,\nin 2014.\nIn 2014, he joined the Hefei University of Tech-\nnology, Hefei, China, where he is currently an\nAssociate Professor of the School of Electrical\nEngineering and Automation. His research inter-\nests include testing and fault diagnosis of analog and mixed-signal circuits,\nelectrical signal detection, radio frequency identiﬁcation technology, and\nintelligent signal processing.\nWENBO ZENG was born in Hunan, China,\nin August 1994. He received the B.S. degree from\nHunan University, Changsha, China, in 2016. He is\ncurrently pursuing the Ph.D. degree in electrical\nengineering with the Hefei University of Technol-\nogy, Hefei, China.\nHis current research interests include wireless\ncommunication channel modeling, key technolo-\ngies for wireless sensor, and wireless communica-\ntion testing in smart grids.\nYING DENGwas born in Anhui, China, in 1996.\nHe received the B.S. degree in automation from\nthe Anhui University of Science and Technology,\nHuainan, China, in 2018. He is currently pursuing\nthe M.S. degree with the electrical engineering\nwith the Hefei University of Technology, Hefei,\nChina.\nHis research interests include digital signal pro-\ncessing and deep learning.\nZENGCHAO HU was born in Anhui, China,\nin 1995. He received the B.S. degree in electrical\nengineering and automation from the Anhui Uni-\nversity of Science and Technology, Anhui, China,\nin 2018. He is currently pursuing the M.S. degree\nin electrical engineering with the Hefei University\nof Technology, Anhui.\nHis research interests include power quality dis-\nturbance analysis and signal processing.\nVOLUME 9, 2021 7459",
  "topic": "Cluster analysis",
  "concepts": [
    {
      "name": "Cluster analysis",
      "score": 0.8069739937782288
    },
    {
      "name": "Partial discharge",
      "score": 0.6845703125
    },
    {
      "name": "Nonlinear system",
      "score": 0.6484546065330505
    },
    {
      "name": "Transformer",
      "score": 0.5833145976066589
    },
    {
      "name": "Algorithm",
      "score": 0.4767126441001892
    },
    {
      "name": "Computational complexity theory",
      "score": 0.45019295811653137
    },
    {
      "name": "Current transformer",
      "score": 0.4466283619403839
    },
    {
      "name": "Computer science",
      "score": 0.4366764724254608
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.41897454857826233
    },
    {
      "name": "Mathematics",
      "score": 0.39054733514785767
    },
    {
      "name": "Voltage",
      "score": 0.33936160802841187
    },
    {
      "name": "Physics",
      "score": 0.19904422760009766
    },
    {
      "name": "Artificial intelligence",
      "score": 0.15130046010017395
    },
    {
      "name": "Control (management)",
      "score": 0.0
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I16365422",
      "name": "Hefei University of Technology",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I37461747",
      "name": "Wuhan University",
      "country": "CN"
    }
  ]
}