{
    "title": "Determining the chronological sequence of inks deposited with different writing and printing tools using ion beam analysis",
    "url": "https://openalex.org/W3137294959",
    "year": 2021,
    "authors": [
        {
            "id": "https://openalex.org/A5053684355",
            "name": "M. Vairavel",
            "affiliations": [
                "Uppsala University"
            ]
        },
        {
            "id": "https://openalex.org/A5070596299",
            "name": "Maurício A. Sortica",
            "affiliations": [
                "Uppsala University"
            ]
        },
        {
            "id": "https://openalex.org/A5008391457",
            "name": "Daniel Primetzhofer",
            "affiliations": [
                "Uppsala University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2734903779",
        "https://openalex.org/W1993373184",
        "https://openalex.org/W2027538951",
        "https://openalex.org/W2041860675",
        "https://openalex.org/W2131036679",
        "https://openalex.org/W1998093007",
        "https://openalex.org/W3000115677",
        "https://openalex.org/W2002251553",
        "https://openalex.org/W2161447631",
        "https://openalex.org/W2101697173",
        "https://openalex.org/W2944303743",
        "https://openalex.org/W2330056730",
        "https://openalex.org/W2007154165",
        "https://openalex.org/W2057347849",
        "https://openalex.org/W2554305363",
        "https://openalex.org/W2974081822",
        "https://openalex.org/W2032371620",
        "https://openalex.org/W1673855059"
    ],
    "abstract": "Abstract Determining the sequence of inks in a questioned document is important in forensic science. Conventional and micro beam‐based ion beam analysis using Rutherford backscattering spectrometry (RBS) and particle‐induced X‐ray emission were employed to study the depth distribution of chemical elements in plain paper and inks/toner deposited by different pens as well as inkjet and laser printers. Composition depth profiling with high lateral resolution was performed with focus on areas where two different coloring agents overlapped. We identify under which conditions the sequence of inks deposited can be reconstructed, analyzing the continuity of characteristic contributions to the obtained signals, with a focus on the depth‐resolved RBS data. The order of deposition was correctly determined for combinations of two different laser printers and in certain cases for pens. Results indicate a potential for analysis, depending on the composition of staining agent, that is, in particular if heavy species are present in sufficiently high concentration. In such cases, also characters obscured or modified by an agent of different composition can be revealed. Changing the probing depth by modifying the beam energy could yield additional information.",
    "full_text": null
}