{
    "title": "PLANAR FLYBACK TRANSFORMER DESIGN FOR PV POWERED LED ILLUMINATION",
    "url": "https://openalex.org/W3141724989",
    "year": 2021,
    "authors": [
        {
            "id": "https://openalex.org/A5008183660",
            "name": "Ali Mamizadeh",
            "affiliations": [
                "Gazi University"
            ]
        },
        {
            "id": "https://openalex.org/A5031073442",
            "name": "Bestoon Ahmed Mustafa",
            "affiliations": [
                "Van Yüzüncü Yıl Üniversitesi"
            ]
        },
        {
            "id": "https://openalex.org/A5078720918",
            "name": "Naci Genç",
            "affiliations": [
                "Yalova University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2126829588",
        "https://openalex.org/W1502243249",
        "https://openalex.org/W2145415873",
        "https://openalex.org/W2119122935",
        "https://openalex.org/W2936357398",
        "https://openalex.org/W2041804496",
        "https://openalex.org/W2905519009"
    ],
    "abstract": "Solar standalone LED lighting is becoming increasingly popular due to their economical, sustainability, simplicity and the low number of components. Designing of low volume and low weight driver decreases the price of LED drivers. Since the flyback converter has a low number of components, it is one of the most popular topologies for LED applications. The most important part of a flyback transformer or an inductor is the core. For the magnetic components, operation at high frequencies increases conductor losses due to skin and proximity effects. The use of planar transformers on printed circuit boards (PCB) can be an alleviate to this problem. With larger surface areas, planar transformers also provide better thermal performance than traditional wire-wound magnetic cores. Planar windings have different configurations. Optimal designing of core and winding reduce the losses of the transformer and inductors effectively. Therefore, this paper presents the design of a flyback planar transformer (PT) for photovoltaic (PV) powered LED illumination. The essential equations for designing of flyback PT are introduced and evaluated. The designed flyback PT was used in 50W LED illumination driver powered by PV panel with a battery. In the proposed driver which was simulated by using MATLAB/Simulink program, the battery is charged via PV powered boost topology with Perturb Observation ( P&O) MPPT method and an insulated H-bridge DC/DC converter.",
    "full_text": null
}