{
  "title": "Operation of Meshed Hybrid Microgrid During Adverse Grid Conditions With Storage Integrated Smart Transformer",
  "url": "https://openalex.org/W3155893033",
  "year": 2021,
  "authors": [
    {
      "id": "https://openalex.org/A5029585121",
      "name": "V M Hrishikesan",
      "affiliations": [
        "Indian Institute of Technology Guwahati"
      ]
    },
    {
      "id": "https://openalex.org/A5084789783",
      "name": "Chandan Kumar",
      "affiliations": [
        "Indian Institute of Technology Guwahati"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1834350974",
    "https://openalex.org/W2154636565",
    "https://openalex.org/W3128360029",
    "https://openalex.org/W2570301988",
    "https://openalex.org/W3120784924",
    "https://openalex.org/W3116716593",
    "https://openalex.org/W2741124169",
    "https://openalex.org/W2057175642",
    "https://openalex.org/W2167459638",
    "https://openalex.org/W2041761580",
    "https://openalex.org/W2773487978",
    "https://openalex.org/W2920446039",
    "https://openalex.org/W2669566973",
    "https://openalex.org/W2442002586",
    "https://openalex.org/W2688604271",
    "https://openalex.org/W3013125307",
    "https://openalex.org/W2740073304",
    "https://openalex.org/W2525013347",
    "https://openalex.org/W2905626661",
    "https://openalex.org/W2803523434",
    "https://openalex.org/W6785914745",
    "https://openalex.org/W2055593572",
    "https://openalex.org/W2143022361",
    "https://openalex.org/W2276000938",
    "https://openalex.org/W1914038610",
    "https://openalex.org/W2087767349",
    "https://openalex.org/W1994959046",
    "https://openalex.org/W6794480060",
    "https://openalex.org/W2553261477",
    "https://openalex.org/W2968462769",
    "https://openalex.org/W2999595761",
    "https://openalex.org/W2810050724",
    "https://openalex.org/W3017292140",
    "https://openalex.org/W2999527218",
    "https://openalex.org/W2908075593",
    "https://openalex.org/W2776904577",
    "https://openalex.org/W65252926",
    "https://openalex.org/W3101599861",
    "https://openalex.org/W3159526508",
    "https://openalex.org/W3113271931"
  ],
  "abstract": "Microgrid faces various challenges such as reverse power flow, peak power demand, voltage limit violations, etc., due to significant installations of renewable energy sources (RESs) and electric vehicles (EVs). For continuous and effective operation of such a system, enhanced and complex control methodologies are needed. Smart transformer (ST) has emerged as a promising solution for overcoming such challenging issues. This paper proposes the operation of battery energy storage system (BESS) integrated ST in a meshed hybrid microgrid. Instead of connecting through ac interconnections with normally open (NO) circuit breakers (CBs), the same line is connected through the medium voltage (MV) dc links of ST. This introduces several paths for controlled power flow in the system. As compared to ac interconnections, this configuration improves the performance of the overall system during various adverse operating conditions such as reverse power flow, peak power demand, and voltage sag. Moreover, the MVDC line voltage is controlled by one ST, resulting in reduced control complexity of other power converters. Detailed simulation and experimental results are provided to show the merits of the proposed system.",
  "full_text": "Received 28 February 2021; revised 28 March 2021; accepted 6 April 2021. Date of publication 14 April 2021;\ndate of current version 20 May 2021. The review of this article was arranged by Associate Editor Giampaolo Buticchi.\nDigital Object Identiﬁer 10.1109/OJIES.2021.3073142\nOperation of Meshed Hybrid Microgrid During\nAdverse Grid Conditions With Storage\nIntegrated Smart Transformer\nHRISHIKESAN V M (Student Member, IEEE), AND CHANDAN KUMAR (Senior Member, IEEE)\nIndian Institute of Technology Guwahati, Guwahati, Assam 781039, India\nCORRESPONDING AUTHOR: Chandan Kumar (e-mail: chandank@iitg.ac.in)\nThis work was supported in part by “Visvesvaraya Ph.D. Scheme, MeitY , Govt. of India MEITY-PHD-1228,” and in part by Science and Engineering Research\nBoard (SERB), Department of Science and Technology, India, under Grant ECR/2017/001564.\nABSTRACT Microgrid faces various challenges such as reverse power ﬂow, peak power demand, volt-\nage limit violations, etc., due to signiﬁcant installations of renewable energy sources (RESs) and electric\nvehicles (EVs). For continuous and effective operation of such a system, enhanced and complex control\nmethodologies are needed. Smart transformer (ST) has emerged as a promising solution for overcoming such\nchallenging issues. This paper proposes the operation of battery energy storage system (BESS) integrated\nST in a meshed hybrid microgrid. Instead of connecting through ac interconnections with normally open\n(NO) circuit breakers (CBs), the same line is connected through the medium voltage (MV) dc links of ST.\nThis introduces several paths for controlled power ﬂow in the system. As compared to ac interconnections,\nthis conﬁguration improves the performance of the overall system during various adverse operating condi-\ntions such as reverse power ﬂow, peak power demand, and voltage sag. Moreover, the MVDC line voltage is\ncontrolled by one ST, resulting in reduced control complexity of other power converters. Detailed simulation\nand experimental results are provided to show the merits of the proposed system.\nINDEX TERMS Microgrid, photovoltaic (PV) integration, Smart transformer (ST).\nI. INTRODUCTION\nRenewable energy sources (RESs) such as photovoltaic (PV),\nwind, etc. are emerging as a sustainable solution for growing\nenergy needs. However, the geographical distribution of these\nsources results in more distributed energy production in the\ngrid [1]. The local consumption of energy reduces the line\nactive power losses, and the co-existence of generation and\nloads constitutes the creation of ac microgrids in the power\nsystem [2]. The peak power production from PV sources leads\nto high reverse power ﬂow in the microgrid during low-load\nhours, and voltage magnitude rise can cause irreversible dam-\nage to the connected equipments [3]. The peak power demand\nis another issue that requires immediate attention which may\nforce the system operators to impose load shedding measures\nduring peak demand hours [4]. V oltage sags are also a fre-\nquently occurring disturbance in the microgrid that affect the\nreliability of power supply.\nConventionally, the voltage rise due to reverse power\nﬂow is handled by solutions such as on-load tap changers\n(OLTCs) [5], and active power control of PV inverters [6].\nThe peak demand management is handled with battery energy\nstorage system (BESS) [4], and voltage sags are mitigated\nusing different active and reactive power control methods [7].\nThe OLTC based voltage control solutions are having a lim-\nited range of operation, whereas active power control from\nPV inverters reduces the overall energy extraction. Effective-\nness of voltage sag mitigation techniques largely depends\non the grid impedance and available active/reactive power\ncapacity. The ac interconnections with normally open (NO)\ncircuit breakers (CBs) are conventionally used for the micro-\ngrid interconnections, however, the system has limited power\ncontrol features. In this scenario, the medium voltage (MV) dc\ninterconnection to the ac microgrids provide advantages such\nas ﬂexible active power transfer capability, independent active\nThis work is licensed under a Creative Commons Attribution 4.0 License. For more information, see https://creativecommons.org/licenses/by/4.0/\nVOLUME 2, 2021 315\nV M AND KUMAR: OPERATION OF MESHED HYBRID MICROGRID DURING ADVERSE GRID CONDITIONS\nand reactive power management, and improved stability [8],\n[9]. The power electronic converters that are used to integrate\nAC and DC systems can ﬂexibly transfer active power in both\ndirections. Therefore, the MVDC systems are used to connect\nthe renewable-rich distribution grid with the main grid. The\ngrids with more number of RESs lacks the inertia due the less\nnumber of synchronous generators. Therefore, sudden load\nand generation ﬂuctuations can introduce frequency devia-\ntions in the grid and that can lead to instability. In these scenar-\nios, the MVDC/HVDC interconnection can serve as an energy\nsource and the interconnecting power electronic converter can\nbe controlled as a virtual synchronous generator [10], [11].\nMoreover, the MVDC systems are used for the horizontal\ncoupling of substations and formation of meshed grids [12].\nFor the formation of hybrid ac/dc grids, various methods to\nconvert the existing ac distribution lines to dc are detailed\nin [13].\nThe power electronic-based smart transformer (ST) has\nemerged as an effective choice for interfacing ac and dc sys-\ntems [14]. A three-stage ST consists of dc links at MV and\nlow voltage (LV) levels which are useful for establishing dc\ndistribution systems [15], [16]. In addition, RES, BESS and\nelectric vehicle (EV) charging station integrations are possible\nwith the dc links [17]. Even though the conventional power\ntransformers (CPTs) are more reliable in comparison with ST,\ncontinuous research is being conducted to improve the relia-\nbility of ST. Various solutions for improving the reliability of\nST are proposed such as, the improved SiC device based MV\ntechnologies [18], modular power converter structure [19],\npower routing based on thermal loading [20], etc. Moreover,\nvarious other solutions proposed for improving power con-\nverter reliability can also be incorporated with ST [21], [22].\nAll these research methods are expected to improve the relia-\nbility of ST in the future applications.\nThe STs potential has been identiﬁed in providing several\nfeatures such as the formation of an LVDC meshed hybrid dis-\ntribution grid [23], hosting capacity enhancement [24], state\nof charge (SoC) management of BESS [25], MVDC intercon-\nnection [26], [27], frequency regulation [28], etc. The MV AC\ngrid voltage support during voltage sag is investigated with ST\nin different scenarios [29]–[31]. The reactive power capability\nof ST MV converter is utilized to mitigate the voltage sag\nin [29], [30]. In addition, the active power is also used to\nsupport the voltage in MV AC grid [31]. The reverse power\nﬂow from LV AC to MV AC distribution grid is controlled by\nST [32]. This method utilizes the ST LV converter control to\ncurtail the active power from the RES during reverse power\nﬂow conditions.\nConnecting LV AC lines between two grids is an option in\nST-CPT based distribution system [33]. Similarly, the inter-\nconnection of MVDC links of STs is an option to provide\nmore ﬂexible operation for a microgrid during adverse MV AC\ngrid conditions. This paper explores features of an MVDC\ninterconnected, ST enabled, meshed hybrid microgrid conﬁg-\nuration with BESS integration. The operation of the system\nis analyzed during peak PV generation, peak load demand\nFIGURE 1. Single-line diagram of the system. (a) Conventional ac\nmicrogrid [12]. (b) ST based meshed hybrid system.\nfrom MV AC grid and MV AC voltage sag in the microgrid. The\nmain contributions of this paper are summarized as follows:\nr The active power support during peak load hours is ana-\nlyzed using BESS and MVDC interconnection.\nr The capability of the system to control the reverse power\nﬂow is analyzed during peak PV generation period.\nr The operation is analyzed during MV AC voltage sag\ncondition to explore the potential of the system in pro-\nviding reliable power supply to the LV AC loads.\nr All the operating modes are veriﬁed with simulation and\nexperimental results.\nThe organization of this paper is as follows: system con-\nﬁguration is discussed in Section II. Modes of operation are\nexplained in Section III. Control of ST and BESS power con-\nverters is given in Section IV. Simulation and experimental\nanalysis are provided in Section V, and Section VI, respec-\ntively. Major conclusions are reported in Section VII.\nII. SYSTEM CONFIGURATION\nFig. 1(a) shows the conventional microgrid conﬁguration con-\nnected to a second grid through ac distribution lines with NO\nCBs derived from [12]. The PV-based distributed generation\n(DG) source is connected to the MV AC bus of grid-1 through\ndc/dc, dc/ac converters and CPT. The BESS is connected to\nthe grid-1 through dc/dc, dc/ac converters and CPT. The loads\nare connected to the LV AC-1 bus through the 11/0.4 kV CPT.\n316 VOLUME 2, 2021\nTABLE 1 System Parameters\nIn grid-2 MV AC bus, loads are connected through 11/0.4 kV\nCPT.\nThe system conﬁguration considered for analysis in this\npaper is shown in Fig. 1(b). In the ST based conﬁguration,\nST-1 and ST-2 replaces the CPT-2, CPT-3 and CPT-4 as shown\nin Fig. 1(b). The ST MVDC link has the capability to integrate\nPV . However, normally the MV AC grid contains multiple\nnumber of PV sources and restructuring one PV source to\nthe MVDC link will not help in controlling the issue of re-\nverse power ﬂow. Therefore, the PV source connection in the\nST based conﬁguration remains same as shown in Fig. 1(a).\nThe existing interconnecting ac distribution line is converted\nto an MVDC system, and connected between MVDC-1 and\nMVDC-2 [13]. BESS is connected to MVDC-1 through an\nisolated dual active bridge (DAB) converter [34]. The DAB is\nused in the BESS application because, it needs to be connected\nbetween an MVDC level and a battery terminal voltage level.\nThis variation in the range of voltage is difﬁcult to achieve\nwithout a transformer isolation, and DAB is considered as a\nbetter solution in this scenario. The DAB converter provides\nadvantages such as good conversion efﬁciency, easy parallel\nand series connections for expanding the operation to higher\nvoltage and current levels, etc. The STs use a three-stage\nconﬁguration and the MV converter is a three-level ac-dc\nconverter [15]. The dc-dc converter is a DAB converter with\na high frequency transformer between MVDC and LVDC\nlinks [35]. The dc-ac converter uses a three-phase, two-level,\ndc-ac converter [15]. The ST-1 and ST-2 form LV AC buses\nand loads in grid-1 and grid-2 are connected to LV AC-1 and\nLV AC-2 buses, respectively. The parameters are shown in\nTable 1. The rating of ST converters are given in Table 1. A\nnon-uniform sizing is adapted to the ST converters based on\nthe requirement of distribution grid [14]. The ST LV converter\nrating is selected to supply the maximum active and reactive\npower load on LV AC bus. The ST DC-DC converter is sized\nto transfer the maximum active power load on the LV AC\nbus. The ST MV converter rating is selected to exchange the\nmaximum active power load on ST LV converter. In addition,\nit is designed to transfer active power to the BESS or grid-2 at\nthe LV AC full load condition.\nIII. MODES OF OPERATION\nThis paper considers four modes of operation, and they are\nnamed as mode-1, mode-2, mode-3, and mode-4. Also, tran-\nsition of operation from one mode to another is discussed in\nthis section. The power ﬂow diagram for various modes of\noperation is shown in Fig. 2. The active power ﬂow directions\nare also marked in all the diagrams. Pmv1, Pmv2 and Pbess\nare the power ﬂow through ST-1 MV , ST-2 MV and BESS\nconverters respectively. Pt is the active power transfer through\nthe MVDC line. Fig. 3 shows a ﬂow-chart of the operating\nmodes.\nA. MODE-1: NORMAL OPERATION\nThe mode-1 power ﬂow diagram is shown in Fig. 2(a). In the\nnormal operation, the ST-1 and ST-2 supplies the LV AC-1 and\nLV AC-2 loads, respectively. In addition, the BESS charging is\ncarried out through the ST-1 MV converter to maintain appro-\npriate SoC. The active power references for MV converters of\nST-1 (P∗\nmv1) and ST-2 ( P∗\nmv2)a r eg i v e nb y ,\nP∗\nmv1 = Plv1−lo ad+ P∗\nbess\nP∗\nmv2 = Plv2−lo ad\n(1)\nwhere Plv1−lo adand Plv2−lo adare the loading on LV AC-1 and\nLV AC-2 buses, respectively.P∗\nbess is the BESS charging power\nreference.\nB. MODE-2: PEAK LOAD SHAVING OPERATION\nThe mode-2 power ﬂow diagram is shown in Fig. 2(b). The\npeak load shaving is typically employed to eliminate demand\nspikes in the system that causes the extreme power demands\nfrom the energy sources. This mode operates to support the\ngrid during peak loading hours. The LV AC-1 load is supported\neither from the BESS or from the grid-2 through MVDC\nlink. This mode is activated when the LV AC-1 load exceeds\nthe predeﬁned peak demand limit ( Ppeak−lim ). The ST-1 MV\nconverter active power reference is given by,\nP∗\nmv1 = Ppeak−lim , if Plv1−lo ad> Ppeak−lim . (2)\nP∗\nmv2 remains same as given in (1). If the BESS is available\nfor discharge, the power is delivered from BESS. In the event\nof BESS unavailability, the power is transferred from grid-2\nthrough MVDC line. Therefore, the BESS discharge power\nreference ( P∗\nbess) and the dc transfer power reference ( P∗\nt )a r e\ngiven by,\nP∗\nbess = P∗\nt\n= Ppeak−lim − Plv1−lo ad, if Plv1−lo ad> Ppeak−lim .\n(3)\nThis active power support helps in reducing peak load de-\nmand on the MV AC-1 bus.\nC. MODE-3: REVERSE POWER FLOW CONTROL\nReverse power ﬂow occurs when the total generation from\nthe PV source is higher than the total load. In that case, the\nbalance power is supplied to grid. The mode-3 power ﬂow di-\nagram is shown in Fig. 2(c). The increased power production\nfrom PV sources at low-load periods causes reverse power\nﬂow in the MV AC grid that can cause voltage rise. This mode\ncontrols the reverse power ﬂow in the MV AC side of the\nVOLUME 2, 2021 317\nV M AND KUMAR: OPERATION OF MESHED HYBRID MICROGRID DURING ADVERSE GRID CONDITIONS\nFIGURE 2. Power ﬂow diagram of the system during various operating modes. (a) Mode-1. (b) Mode-2. (c) Mode-3. (d) Mode-4.\nFIGURE 3. Flow-chart representation of modes of operation.\ngrid-1. The net power import ( Pg1−net ) in the grid-1 is given\nby,\nPg1−net = Plv1−lo ad− Plv1−pv (4)\nwhere Plv1−pv is the active power generation from PV genera-\ntor. During low-load, peak-generation hours, the active power\nfrom PV is absorbed through ST-1 MV converter depending\nupon the predeﬁned power export limit ( Pg1−lim ). The ST-1\nMV converter reference power is given by,\nP∗\nmv1 = Plv1−pv − Pg1−lim , if Pg1−net < Pg1−lim . (5)\nThe ST-2 MV converter active power reference remain\nsame as given in (1). The absorbed power is either used\nfor BESS charging or if BESS is not available for charging,\n318 VOLUME 2, 2021\nthe power is transferred to the grid-2. Therefore, the BESS\ncharging power reference and the dc transfer power reference\nis given by,\nP∗\nbess = P∗\nt =− Pg1−net − Pg1−lim , if Pg1−net < Pg1−lim . (6)\nThe extra absorption of active power limits the reverse\npower ﬂow in grid-1 and the voltage rise conditions are\navoided.\nD. MODE 4: SAG OPERATION\nThe mode-4 power ﬂow diagram is shown in Fig. 2(d). V oltage\nsags are caused by different faults in the grid and it affects the\navailability of power supply to the customers. If the MV AC-1\nvoltage magnitude is lower than 90% of the nominal value,\nthe ST-1 operates in sag operating mode. For the detection\nof sag, the measured rms MV AC voltage is compared with a\nthreshold magnitude of 0.9 p.u. [36]. If the magnitude falls\nbelow threshold value, the ST operation mode is changed\nto the voltage sag mode. In this mode, the ST-1 MV con-\nverter is controlled to continue the operation with reduced\npower absorption. Due to the constant power operation of\ngrid-connected ST-1 MV converter, the absorption of currents\nincreases during voltage sag to maintain the load power sup-\nply. In this paper, the ST-1 MV converter is controlled in\ncoordination with ST-2 and BESS for ensuring the reliability\nof power supply for the LV AC-1 loads during grid-1 voltage\nsags.\nThe reactive power exchange is not considered during this\noperating mode and the apparent power rating ( Smv1−rn )o f\nST-1 MV converter during nominal microgrid voltage condi-\ntion is equal to the active power rating ( Pmv1−rn ) given by,\nPmv1−rn =\n√\n3Vg1−nImv1−r (7)\nwhere Vg1−n is the MV AC-1 nominal rms voltage (L-L) and\nImv1−r is the ST-1 MV converter rms current rating. In the\nevent of grid-1 MV AC voltage sag, the voltage (Vg1−s)i sl o w e r\nthan the nominal value. For limiting the currents within the\nrating, the maximum apparent power ( Smv1−rs ) that can be\nabsorbed during sag is limited to a lower value as compared to\nSmv1−rn . During sag, the active power rating ( Pmv1−rs ) which\nis same as the Smv1−rs given by,\nPmv1−rs =\n√\n3Vg1−sImv1−r = MsPmv1−rn\nwhere Ms = Vg1−s\nVg1−n\n. (8)\nIn the case when ST-1 MV converter’s effective rating dur-\ning sag is less than the LV AC-1 demand, the balance power\nis transferred from grid-2 through MVDC line. However, the\nmaximum power transfer during this mode is limited to a\nvalue ( Pdc−lim ) and the remaining power is absorbed from\nBESS.\nThe ST-1 MV converter power reference during voltage sag\nis given as,\nP∗\nmv1 =\n{\nPlv1−lo ad, if Plv1−lo ad≤ Pmv1−rs\nPmv1−rs , otherwise. (9)\nThe MVDC power transfer is given by,\nPdc−s =\n{\n0, if Plv1−lo ad≤ Pmv1−rs\nPlv1−lo ad− Pmv1−rs , otherwise.\n(10)\nThe MVDC power transfer reference ( P∗\nt ) is given by,\nP∗\nt =\n{\n−Pdc−s, if Pdc−s ≤ Pdc−lim\n−Pdc−lim , otherwise. (11)\nThe P∗\nt is limited to a maximum value of Pdc−lim and BESS\nis activated if Pdc−s exceeds the Pdc−lim . The BESS power\nreference (P∗\nbess) during the sag operation is given by,\nP∗\nbess =\n{\n0, if Pdc−s ≤ Pdc−lim\n−(Pdc−s − Pdc−lim ), otherwise. (12)\nBESS transfers the remaining power to support the LV AC-1\nload based on the requirement. The ST-2 MV converter refer-\nence remain same as given in (1).\nIV. CONTROL OF ST AND BESS\nIn this paper, the ST-2 MV converter controls the MVDC link\nvoltage, and ST-1 MV converter controls the power ﬂow based\non the requirement. This control concept can be extended to\na three-grid/multi-grid system with one of the ST controlling\nthe MVDC link voltage and other STs controlling the power\nﬂow based on the mode of operation. The storage can be\nintegrated to the power ﬂow controlling STs MVDC links and\nthey can be controlled as per the control requirement. In this\nsection, the control of ST MV , ST dc-dc, ST LV converters\nare explained. In addition, the BESS converter control is also\nexplained. Overall control diagram is shown in Fig. 4.\nA. ST-1 MV CONVERTER\nThe control block diagram is given in Fig. 5(a) and (b). The\npower reference generation according to operating modes is\ngiven in Fig. 5(a) and reference current generation is shown in\nFig. 5(b). The aim of ST-1 MV converter is to support LV AC-\n1 loads and exchange power with ST-2 through MVDC link.\nIt is also used to charge/discharge BESS. For the mode-1 to\nmode-4, the active power references are given by, (1), (2), (5),\nand (9), respectively. A generalized expression for the ST-1\nMV converter reference power is given by\nP∗\nmv1 = Plv1−lo ad+ P∗\nt + P∗\nbess. (13)\nIn mode-2 to mode-4, the inter-grid power transfer is con-\ntrolled by ST-1 using indirect MVDC voltage control. Con-\nsidering a constant dc link voltage at the MVDC-2 link, the\nVOLUME 2, 2021 319\nV M AND KUMAR: OPERATION OF MESHED HYBRID MICROGRID DURING ADVERSE GRID CONDITIONS\nFIGURE 4. Control of ST and BESS.\nFIGURE 5. Proposed control block diagram. (a) Power reference based on modes of operation. (b) ST MV converter reference current generation. (c)\nReference phase angle generation of ST dc-dc converter. (d) Reference voltage generation of ST LV converter. (e) Reference phase angle generation of\nBESS converter.\nMVDC-1 voltage is expressed as\nVmvdc1 = Vmvdc2 + P∗\nt\n2Rdc\nVmvdc2\n(14)\nwhere Vmvdc1 and Vmvdc2 are the voltages at MVDC-1 and\nMVDC-2 links, respectively. Rdc is the resistance of dc line.\nA positive P∗\nt indicates that the power is transferred from\ngrid-1 to grid-2, and a negative P∗\nt indicates the power transfer\nfrom grid-2 to grid-1. The MVDC-1 voltage variation based\non P∗\nt is shown in Fig. 6. The Pmax\nt is the maximum power\ntransfer and V h\nmvdc1, V l\nmvdc1 are the maximum and minimum\nMVDC-1 voltages, respectively depending upon the direction\nof power transfer. At any operating power transfer P∗\nt−op,t h e\nMVDC-1 voltage is V o\nmvdc1 as shown in Fig. 6. The ST-1 MV\npower reference P∗\nmv1 is used with instantaneous symmetrical\ncomponent theory (ISCT) [37] to generate the corresponding\nFIGURE 6. MVDC-1 voltage variation with active power transfer.\ncurrent references ( i∗\nmv1−abc) as given by\ni∗\nmv1−a =\nvp\ng1a + kpf 1(vp\ng1b − vp\ng1c )\n(vp\ng1a )2 + (vp\ng1b)2 + (vp\ng1c )2 (P∗\nmv1)\n320 VOLUME 2, 2021\ni∗\nmv1−b =\nvp\ng1b + kpf 1(vp\ng1c − vp\ng1a )\n(vp\ng1a )2 + (vp\ng1b)2 + (vp\ng1c )2 (P∗\nmv1)\ni∗\nmv1−c =\nvp\ng1c + kpf 1(vp\ng1a − vp\ng1b)\n(vp\ng1a )2 + (vp\ng1b)2 + (vp\ng1c )2 (P∗\nmv1) (15)\nwhere vp\ng1a, vp\ng1b and vp\ng1c, respectively are fundamental pos-\nitive sequence MV AC-1 voltages of respective phases. kpf 1\nis the power factor control constant, and in this paper re-\nactive power exchange is not considered, and therefore kpf 1\nis zero. These reference currents are maintained using PWM\ncontroller to generate switching pulses. Hysteresis based con-\ntroller is used for controlling the ST MV converters due to its\nadvantages such as simplicity in implementation, lesser com-\nputational requirement in the digital controller, low tracking\nerrors, very good dynamic response, etc. [38].\nB. ST-2 MV CONVERTER\nThe block-diagram representation of the power reference gen-\neration and reference current generation strategy is shown\nin Fig. 5(a) and (b), respectively. The ST-2 MV converter\nsupplies the active power requirement at LV AC-2 bus. It also\nexchanges active power with grid-2 through MVDC distribu-\ntion line. ST-2 MV converter maintains the dc link voltage\nat nominal value, and depending upon the MVDC-1 volt-\nage magnitude, the power is exchanged with the ST-1. The\nreference (V ∗\nmvdc2) and measured ( Vmvdc2) MVDC-2 voltages\nare compared and the error is passed through a proportional\nintegral (PI) controller to generate the reference Plo ss.T h e\ngains of PI controller are selected based on the symmetrical\noptimum method [39]. This power reference along with ST-2\nMV active power reference generated in (1) are used in ISCT\nto generate current references ( i∗\nmv2−abc) as given by\ni∗\nmv2−a =\nvp\ng2a + kpf 2(vp\ng2b − vp\ng2c )\n(vp\ng2a )2 + (vp\ng2b)2 + (vp\ng2c )2 (P∗\nmv2 + Plo ss)\ni∗\nmv2−b =\nvp\ng2b + kpf 2(vp\ng2c − vp\ng2a )\n(vp\ng2a )2 + (vp\ng2b)2 + (vp\ng2c )2 (P∗\nmv2 + Plo ss)\ni∗\nmv2−c =\nvp\ng2c + kpf 2(vp\ng2a − vp\ng2b)\n(vp\ng2a )2 + (vp\ng2b)2 + (vp\ng2c )2 (P∗\nmv2 + Plo ss)\n(16)\nwhere vp\ng2a, vp\ng2b and vp\ng2c, respectively are fundamental pos-\nitive sequence MV AC-2 voltages of respective phases. The\npower factor control constant kpf 2 = 0, since there is no\nreactive power transfer. These reference currents are used with\nPWM controller to generate converter switching pulses.\nC. ST DC-DC CONVERTER\nThe control block diagram is given in Fig. 5(c). For both\nST-1 and ST-2, dc-dc converters are operated to transfer re-\nquired power between MVDC and LVDC links. The sym-\nbol ‘i’ indicates terms related to ith ST ( i =1, 2). The volt-\nage is maintained at a constant reference value for LVDC-1\nand LVDC-2 links by the respective dc-dc converters. A PI\nTABLE 2 Simulation Parameters\ncontroller generates a phase angle reference ( δ∗\ndc−dci ) from\nthe error generated by the comparison of reference LVDC-i\nvoltage ( V ∗\nlvdci ) and corresponding measured value ( Vlvdci ).\nThe PI controller gains are selected using symmetrical op-\ntimum method to obtain the appropriate phase angle output.\nMaintaining this phase angle difference between MVDC and\nLVDC side converter switches ensure the power ﬂow and\nvoltage control [35].\nD. ST LV CONVERTER\nA block-diagram is given in Fig. 5(d). The ST-1 and ST-2\nLV converters are controlled similar to a grid forming voltage\nconverter [2]. The reference rms LV voltage ( V ∗\nlvi) at nominal\nfrequency ( fnom) is used to generate the three-phase sinusoidal\n(v∗\nlvi−abc) voltage as given by,\nv∗\nlvi−a = V ∗\nlvi\n√\n2s i n (ωnomt )\nv∗\nlvi−b = V ∗\nlvi\n√\n2s i n (ωnomt − 2π/3).\nv∗\nlvi−c = V ∗\nlvi\n√\n2s i n (ωnomt + 2π/3) (17)\nThe reference three-phase voltages are maintained at the re-\nspective LV AC buses by the PWM controller.\nE. BESS DC-DC CONVERTER\nThe power references are generated according to the mode of\noperation as shown in Fig. 5(a). During mode-1, the BESS\ncharges from grid-1 to maintain the necessary SoC. During\npeak load shaving operation, based on the availability of\nenergy, the grid-1 is supported from BESS. During reverse\npower ﬂow control mode, as per requirement and availabil-\nity, power is transferred from grid-1. In sag operation, the\nBESS supports the LV AC-1 load as per the algorithm shown\nin Fig. 3. Based on the charging/discharging power reference\n(P∗\nbess) given in (3), (6) and (12), the controller generates\nthe reference angle ( δ∗\nbess) as shown in Fig. 5(e). This angle\nis maintained between MVDC-1 and BESS side converter\nswitches which ensures the required power exchange between\nBESS and MVDC-1 bus [34].\nV. SIMULATION RESULTS\nSimulation is conducted in PSCAD software and the parame-\nters are shown in Table 1 and Table 2. Three cases are simu-\nlated in this paper.\nFig. 7 shows the operation with BESS support during peak\nloading on the grid-1. Till t = 10 s, the ST-1 and ST-2 MV\nconverters supply their own LV AC loads. At t = 10 s, the\nloading on LV AC-1 bus is increased beyond the Ppeak−lim .\nVOLUME 2, 2021 321\nV M AND KUMAR: OPERATION OF MESHED HYBRID MICROGRID DURING ADVERSE GRID CONDITIONS\nFIGURE 7. Simulation results for peak load shaving operation. (a) MVAC-1\nvoltages. (b) ST-1 MV converter currents. (c) MVAC-2 voltages. (d) ST-2 MV\nconverter currents. (e) Dc link voltages. (f) Different active powers.\nThe BESS is available for discharge and supports the LV AC-1\nloads and Fig. 7(a) and (c) show the MV AC-1 and MV AC-2\nvoltages, respectively. Fig. 7(b) and Fig. 7(d) show the ST-\n1 MV and ST-2 MV converter currents. The MVDC-1 and\nMVDC-2 voltages are shown in Fig. 7(e). In Fig. 7(f), differ-\nent active powers are shown.\nIn the second case shown in Fig. 8, the reverse power ﬂow\ncontrol operation is exhibited. At t = 10 s, the PV output\npower increases and LV AC-1 loading is low during this time.\nThe ST-1 absorbs the active power from grid-1 and since\nBESS is not available in this condition, power is transferred\nto the grid-2 through MVDC line. Fig. 8(a) and (c) show the\nMV AC-1 and MV AC-2 voltages, respectively. The ST MV\nconverter currents are shown in Fig. 8(b) and (d) for ST-1 and\nST-2, respectively. The ST-1 MV converter currents increase\ndue to extra power absorption. Fig. 8(e) shows MVDC link\nvoltages of ST-1 and ST-2 and MVDC-1 voltage increases\nabove nominal value to control the power transfer. Fig. 8(f)\nshows PV , ST-1 MV and MV AC-1 active powers. The MV AC-\n1 active power remains nearly constant due to the increased\nabsorption by ST-1 MV converter thereby avoiding reverse\npower ﬂow. Fig. 8(g) shows the ST-2 and MVDC active pow-\ners.\nIn the third case shown in Fig. 9, the voltage sag operation\nis analyzed. Fig. 9(a) and (c) show the MV AC-1 and MV AC-2\nvoltages, respectively and MV AC-1 voltage decreases after\nexperiencing a 40% sag. The ST MV converter currents are\nshown in Fig. 9(b) and (d) for ST-1 and ST-2. The ST-1 MV\nFIGURE 8. Simulation results during reverse power ﬂow control. (a)\nMVAC-1 voltages. (b) ST-1 MV converter currents. (c) MVAC-2 voltages.\n(d) ST-2 MV converter currents. (e) Dc link voltages. (f) PV, ST-1 MV and\nMVAC-1 active powers. (g) ST-2 and MVDC active powers.\nFIGURE 9. Simulation results during MVAC-1 voltage sag. (a) MVAC-1\nvoltages. (b) ST-1 MV converter currents. (c) MVAC-2 voltages. (d) ST-2 MV\nconverter currents. (e) Dc link voltages. (f) Different active powers.\n322 VOLUME 2, 2021\nFIGURE 10. Laboratory prototype. (a) Schematic diagram. (b) Photograph.\nFIGURE 11. Experimental results during peak load shaving operation.\n(a) MVAC-1 voltages. (b) ST-1 MV converter currents. (c) MVAC-2 voltages.\n(d) ST-2 MV converter currents.\nconverter currents increase to the maximum rating. Fig. 9(e)\nshows MVDC bus voltages of ST-1 and ST-2. The MVDC-1\nvoltage decreases to transfer the demanded power from grid-2.\nFig. 9(f) shows different active powers. The ST-1 and ST-2\nMV converter active powers are shown. The active power is\ntransferred from the grid-2 and since it reaches the maximum\ntransferable power, BESS is also activated to supply the re-\nmaining power as per the ﬂow-chart shown in Fig. 3.\nVI. EXPERIMENTAL ANALYSIS\nIn the experiments, MV AC voltage is 150 V (L-L), and LV AC\nvoltage is 110 V (L-L). Fig. 10(a) and (b), respectively show\nthe schematic diagram and photograph of the experimental\nprototype. The experiment analysis shows all the cases de-\nscribed in simulation analysis.\nIn the ﬁrst case, the peak load operation is analyzed. Fig. 11\nand 12 show the results for the peak load operation. The ST-\n1 and ST-2 operate supplying the LV AC loads. The LV AC-\n1 load increased beyond the predeﬁned peak load limit, and\nBESS supports the ST-1 loads. Fig. 11(a) and (c) show the\nthree-phase voltages of MV AC-1 and MV AC-2, respectively.\nFig. 11(b) and (d) show the MV currents for ST-1 and ST-2.\nThe load change is marked in the Fig. 11 and 12. The dc link\nvoltages are shown in Fig. 12(a). Different powers are shown\nin Fig. 12(b). This shows that the BESS power support lowers\nthe peak demand on grid-1 and smooths the load curve.\nIn the second case, PV injection increase scenario is consid-\nered to show the reverse power ﬂow case. Fig. 13 and 14 show\nFIGURE 12. Experimental results during peak load shaving operation.\n(a) DC link voltages. (b) Different active powers.\nFIGURE 13. Experimental results during reverse power ﬂow control.\n(a) MVAC-1 voltages. (b) ST-1 MV converter currents. (c) MVAC-2 voltages.\n(d) ST-2 MV converter currents.\nFIGURE 14. Experimental results during reverse power ﬂow control. (a) Dc\nlink voltages. (b) PV, ST-1 MV and MVAC-1 active powers. (c) ST-2 and\nMVDC active powers.\ndifferent waveforms. Fig. 13(a) and (c) show MV AC voltages\nfor ST-1 and ST-2, respectively. ST-1 MV currents increase\nafter the absorption of extra active power from PV source,\nand it is shown in Fig. 13(b). ST-2 MV currents decrease due\nto extra active power support from MVDC line as shown in\nFig. 13(d). Dc link voltages are shown in Fig. 14(a). MVDC-1\nlink voltage increases to facilitate the active power transfer.\nFig. 14(b) shows PV , ST-1 MV and MV AC-1 active powers.\nVOLUME 2, 2021 323\nV M AND KUMAR: OPERATION OF MESHED HYBRID MICROGRID DURING ADVERSE GRID CONDITIONS\nFIGURE 15. Experimental results during MVAC-1 voltage sag. (a) MVAC-1\nvoltages. (b) ST-1 MV converter currents. (c) MVAC-2 voltages. (d) ST-2 MV\nconverter currents.\nFIGURE 16. Experimental results during MVAC-1 voltage sag. (a) Dc link\nvoltages. (b) Different active powers.\nThe MV AC-1 active power remains nearly constant even after\nthe PV power increase. Fig. 14(c) shows the ST-2 MV and\nMVDC active powers. The reverse power control capability\nshows the ability of the system to reduce the voltage rise\nconditions.\nIn the third case, the MV AC-1 bus experiences a voltage sag\nand ST-1 active power is supported by the ST-2 and BESS.\nFig. 15(a) shows the MV AC-1 voltages and the voltage sag\nis visible in the waveform. Fig. 15(b) shows the MV cur-\nrents. Fig. 15(c) shows the MV AC-2 voltages and Fig. 15(d)\nshows ST-2 MV currents. Dc link voltages are shown in\nFig. 16(a) and the MVDC-1 voltage decreases to import active\npower through MVDC line. Different powers are shown in\nFig. 16(b). The uninterrupted operation during voltage sag\nimproves the overall reliability of the system.\nVII. CONCLUSION\nThis paper proposes operation of an MVDC interconnected\nmeshed hybrid microgrid conﬁguration enabled by ST and\nBESS during adverse grid conditions. The following advan-\ntages are achieved: (1) lower peak power demand from MV AC\ngrid smooths the load curve and reduces the unmanageable\nhigh-load conditions on the grid, (2) reverse power ﬂow con-\ntrol reduces the voltage rise conditions without the PV active\npower curtailment, and this helps in maximizing the energy\nextraction from PV sources, and (3) continuous operation of\nloads during grid voltage sags are helpful in reducing power\ninterruption-hours in the system and this improves the relia-\nbility of power supply to the customer. The simulation and\nexperimental results verify the ﬁndings.\nREFERENCES\n[1] X. Liang, “Emerging power quality challenges due to integration of\nrenewable energy sources,” IEEE Trans. Ind. Appl., vol. 53, no. 2,\npp. 855–866, Mar. 2017.\n[2] J. Rocabert, A. Luna, F. Blaabjerg, and P. Rodriguez, “Control of power\nconverters in ac microgrids,” IEEE Trans. Power Electron., vol. 27,\nno. 11, pp. 4734–4749, Nov. 2012.\n[3] C. L. Masters, “V oltage rise: The big issue when connecting embedded\ngeneration to long 11 kv overhead lines,” Power Eng. J., vol. 16, no. 1,\npp. 5–12, Feb. 2002.\n[4] K. Mahmud, M. J. Hossain, and G. E. Town, “Peak-load reduction\nby coordinated response of photovoltaics, battery storage, and electric\nvehicles,”IEEE Access, vol. 6, pp. 29353–29365, 2018.\n[5] R. Kabiri, D. G. Holmes, B. P. McGrath, and L. G. Meegahapola, “LV\ngrid voltage regulation using transformer electronic tap changing, with\nPV inverter reactive power injection,” IEEE J. Emerg. Sel. Top. Power\nElectron., vol. 3, no. 4, pp. 1182–1192, Dec. 2015.\n[6] R. Tonkoski, L. A. C. Lopes, and T. H. M. El-Fouly, “Coordinated\nactive power curtailment of grid connected PV inverters for overvoltage\nprevention,” IEEE Trans. Sustain. Energy, vol. 2, no. 2, pp. 139–147,\nApr. 2011.\n[7] C. Kumar and M. K. Mishra, “Operation and control of an improved\nperformance interactive dstatcom,” IEEE Trans. Ind. Electron., vol. 62,\nno. 10, pp. 6024–6034, Oct. 2015.\n[8] MVDC PLUS - the Grid Connector. [Online]. Available: https://new.\nsiemens.com/global/en/products/energy/medium-voltage/solutions/\nmvdc.html\n[9] J. K. Steinke, P. Maibach, G. Ortiz, F. Canales, and P. Steimer, “Mvdc\napplications and technology,” in Proc. PCIM Europe; Int. Exhib. Conf.\nPower Electron., Intell. Motion, Renewable Energy Energy Manage.,\nMay 2019, pp. 1–8.\n[10] B. Silva, C. L. Moreira, L. Seca, Y . Phulpin, and J. A. Pecas Lopes,\n“Provision of inertial and primary frequency control services using\noffshore multiterminal hvdc networks,” IEEE Trans. Sustain. Energy,\nvol. 3, no. 4, pp. 800–808, Oct. 2012.\n[11] Y . Cao et al., “A virtual synchronous generator control strategy for\nvsc-mtdc systems,” IEEE Trans. Energy Convers. , vol. 33, no. 2,\npp. 750–761, Jun. 2018.\n[12] R. Bernacchi, “MVDC and Grid Interties: enabling new features\nin distribution, sub-transmission and industrial networks,” [Online].\nAvailable: https://library.e.abb.com/public/5fea768c835b4daeb8258bf\n950ddb05c/ABB%20MVDC_White%20paper.pdf?x-sign=X9LOXy\nlnUBkKlMUPttFtrNFlHfODv7TYMZjoITkYE332BdplwYEgUSztjC9z/\nl58\n[13] L. Zhang, J. Liang, W. Tang, G. Li, Y . Cai, and W. Sheng, “Convert-\ning ac distribution lines to DC to increase transfer capacities and DG\npenetration,” IEEE Trans. Smart Grid, vol. 10, no. 2, pp. 1477–1487,\nMar. 2019.\n[14] L. F. Costa, G. D. Carne, G. Buticchi, and M. Liserre, “The smart trans-\nformer: A solid-state transformer tailored to provide ancillary services\nto the distribution grid,” IEEE Power Electron. Mag., vol. 4, no. 2,\npp. 56–67, Jun. 2017.\n[15] M. Liserre, G. Buticchi, M. Andresen, G. D. Carne, L. F. Costa, and\nZ. X. Zou, “The smart transformer: Impact on the electric grid and tech-\nnology challenges,” IEEE Ind. Electron. Mag., vol. 10, no. 2, pp. 46–58,\nJun. 2016.\n[16] S. Bhattacharya, “Transforming the transformer,” IEEE Spectr ., vol. 54,\nno. 7, pp. 38–43, Jul. 2017.\n[17] F. Ruiz Allende, M. A. Perez, J. R. Espinosa, T. Gajowik, S. Stynski,\nand M. Malinowski, “Surveying solid-state transformer structures and\ncontrols: Providing highly efﬁcient and controllable power ﬂow in dis-\ntribution grids,” IEEE Ind. Electron. Mag., vol. 14, no. 1, pp. 56–70,\nMar. 2020.\n324 VOLUME 2, 2021\n[18] A. Q. Huang, Q. Zhu, L. Wang, and L. Zhang, “15 kv sic mosfet:\nAn enabling technology for medium voltage solid state transformers,”\nCPSS Trans. Power Electron. Appl., vol. 2, no. 2, pp. 118–130, 2017.\n[19] M. Liserre, M. Andresen, L. Costa, and G. Buticchi, “Power routing\nin modular smart transformers: Active thermal control through uneven\nloading of cells,” IEEE Ind. Electron. Mag., vol. 10, no. 3, pp. 43–53,\nSep. 2016.\n[20] V . Raveendran, M. Andresen, G. Buticchi, and M. Liserre, “Ther-\nmal stress based power routing of smart transformer with CHB\nand DAB converters,” IEEE Trans. Power Electron., vol. 35, no. 4,\npp. 4205–4215, Apr. 2020.\n[21] J. Falck, C. Felgemacher, A. Rojko, M. Liserre, and P. Zacharias, “Re-\nliability of power electronic systems: An industry perspective,” IEEE\nInd. Electron. Mag., vol. 12, no. 2, pp. 24–35, Jun. 2018.\n[22] S. Peyghami, F. Blaabjerg, and P. Palensky, “Incorporating power\nelectronic converters reliability into modern power system reliability\nanalysis,” IEEE J. Emerg. Sel. Top. Power Electron., vol. 9, no. 2,\npp. 1668–1681, Apr. 2021.\n[23] D. Das, V . M. Hrishikesan, C. Kumar, and M. Liserre, “Smart\ntransformer-enabled meshed hybrid distribution grid,” IEEE Trans. Ind.\nElectron., vol. 68, no. 1, pp. 282–292, Jan. 2021.\n[24] H. V . M., A. K. Deka, and C. Kumar, “Capacity enhancement of a\nradial distribution grid using smart transformer,” IEEE Access,v o l .8 ,\npp. 72411–72423, 2020.\n[25] C. Kumar, R. Zhu, G. Buticchi, and M. Liserre, “Sizing and SOC man-\nagement of a smart-transformer-based energy storage system,” IEEE\nTrans. Ind. Electron., vol. 65, no. 8, pp. 6709–6718, Aug. 2018.\n[26] V . M. Hrishikesan, C. Kumar, and M. Liserre, “Flexible power transfer\nin smart transformer interconnected microgrids,” in Proc. 44th Annu.\nConf. IEEE Ind. Electron. Soc., Oct. 2018, pp. 5535–5540.\n[27] V . M. Hrishikesan and C. Kumar, “Smart transformer based meshed\nhybrid microgrid with mvdc interconnection,” in Proc. IECON 46th\nAnnu. Conf. IEEE Ind. Electron. Soc., 2020, pp. 4961–4966.\n[28] G. De Carne, G. Buticchi, M. Liserre, and C. V ournas, “Real-time pri-\nmary frequency regulation using load power control by smart transform-\ners,”IEEE Trans. Smart Grid, vol. 10, no. 5, pp. 5630–5639, Sep. 2019.\n[29] D. Shah and M. L. Crow, “Online volt-var control for distribution\nsystems with solid-state transformers,” IEEE Trans. Power Del., vol. 31,\nno. 1, pp. 343–350, Feb. 2016.\n[30] H. V M, D. Das, C. Kumar, H. B. Gooi, M. Saad, and X. Guo, “Increas-\ning voltage support using smart power converter based energy storage\nsystem and load control,” IEEE Trans. Ind. Electron., p. 1, 2020, doi:\n10.1109/TIE.2020.3042165.\n[31] S. Giacomuzzi, M. Langwasser, G. De Carne, G. Buja, and M. Liserre,\n“Smart transformer-based medium voltage grid support by means of\nactive power control,” CES Trans. Elect. Machines Syst., vol. 4, no. 4,\npp. 285–294, Dec. 2020.\n[32] G. De Carne, G. Buticchi, Z. Zou, and M. Liserre, “Reverse power ﬂow\ncontrol in a st-fed distribution grid,” IEEE Trans. Smart Grid,v o l .9 ,\nno. 4, pp. 3811–3819, Jul. 2018.\n[33] S. Giacomuzzi, G. De Carne, S. Pugliese, G. Buja, M. Liserre,\nand A. Kazerooni, “Synchronization of low voltage grids fed by\nsmart and conventional transformers,” IEEE Trans. Smart Grid ,\np. 1, 2021, doi: 10.1109/TSG.2021.3054478.\n[34] S. Inoue and H. Akagi, “A bidirectional DC-DC converter for an energy\nstorage system with galvanic isolation,” IEEE Trans. Power Electron.,\nvol. 22, no. 6, pp. 2299–2306, Nov. 2007.\n[35] S. Falcones, R. Ayyanar, and X. Mao, “A DC DC multiport-converter-\nbased solid-state transformer integrating distributed generation and stor-\nage,” IEEE Trans. Power Electron., vol. 28, no. 5, pp. 2192–2203,\nMay 2013.\n[36] A. Camacho, M. Castilla, J. Miret, L. G. de Vicuña, and R. Guzman,\n“Positive and negative sequence control strategies to maximize the volt-\nage support in resistive-inductive grids during grid faults,” IEEE Trans.\nPower Electron., vol. 33, no. 6, pp. 5362–5373, Jun. 2018.\n[37] A. Ghosh and G. Ledwich, Power Quality Enhancement Using Custom\nPower Devices. Springer Science & Business Media, 2012.\n[38] M. P. Kazmierkowski and L. Malesani, “Current control techniques for\nthree-phase voltage-source pwm converters: A survey,” IEEE Trans.\nInd. Electron., vol. 45, no. 5, pp. 691–703, Oct. 1998.\n[39] R. Teodorescu, M. Liserre, and P. Rodriguez, Grid Converters for Pho-\ntovoltaic and Wind Power Systems. Hoboken, NJ, USA: John Wiley &\nSons, vol. 29, 2011.\nHRISHIKESAN V M(Student Member, IEEE) re-\nceived the B.Tech. degree in electrical and elec-\ntronics engineering from Government Engineering\nCollege, Thrissur, India, in 2011 and the M.Tech.\ndegree in power systems from the National Insti-\ntute of Technology, Trichy, India, in 2014. He is\ncurrently a Research Scholar with the Department\nof Electronics and Electrical Engineering, Indian\nInstitute of Technology Guwahati, Guwahati, In-\ndia. His research interests include applications of\npower electronics in power systems and power\nquality.\nCHANDAN KUMAR (Senior Member, IEEE) re-\nceived the B.Sc. degree from the Muzaffarpur In-\nstitute of Technology, Muzaffarpur, India, in 2009,\nthe M.Tech. degree from the National Institute of\nTechnology, Trichy, India, in 2011, and the Ph.D.\ndegree from the Indian Institute of Technology\nMadras, Chennai, India, in 2014, all in electrical\nengineering.\nSince 2015, he has been working as Assistant\nProfessor in electronics and electrical engineering\nDepartment, Indian Institute of Technology Guwa-\nhati, India. In 2016–17, he worked as Alexander von Humboldt Research\nFellow with Chair of Power Electronics, University of Kiel, Kiel, Germany.\nHe is an Associate Editor of IEEE A CCESS, IEEE O PEN JOURNAL OF POWER\nELECTRONICS, and IEEE O PEN JOURNAL OF THE INDUSTRIAL ELECTRON-\nICS SOCIETY. His research interests include power electronics application in\npower system, power quality, and renewable energy.\nVOLUME 2, 2021 325",
  "topic": "Microgrid",
  "concepts": [
    {
      "name": "Microgrid",
      "score": 0.8578809499740601
    },
    {
      "name": "Transformer",
      "score": 0.6152639389038086
    },
    {
      "name": "Smart grid",
      "score": 0.609423816204071
    },
    {
      "name": "Grid",
      "score": 0.48968032002449036
    },
    {
      "name": "Computer science",
      "score": 0.4475666284561157
    },
    {
      "name": "Reliability engineering",
      "score": 0.38301098346710205
    },
    {
      "name": "Electrical engineering",
      "score": 0.3476322889328003
    },
    {
      "name": "Engineering",
      "score": 0.21372491121292114
    },
    {
      "name": "Voltage",
      "score": 0.07577502727508545
    },
    {
      "name": "Geology",
      "score": 0.05518701672554016
    },
    {
      "name": "Geodesy",
      "score": 0.0
    }
  ]
}