{
  "title": "Systematic review automation tool use by systematic reviewers, health technology assessors and clinical guideline developers: tools used, abandoned, and desired",
  "url": "https://openalex.org/W3159559669",
  "year": 2021,
  "authors": [
    {
      "id": "https://openalex.org/A2659054067",
      "name": "Anna Mae Scott",
      "affiliations": [
        "Bond University"
      ]
    },
    {
      "id": "https://openalex.org/A3158312288",
      "name": "Connor Forbes",
      "affiliations": [
        "Bond University"
      ]
    },
    {
      "id": "https://openalex.org/A2105601291",
      "name": "Justin Clark",
      "affiliations": [
        "Bond University"
      ]
    },
    {
      "id": "https://openalex.org/A2099587762",
      "name": "Matt Carter",
      "affiliations": [
        "Bond University"
      ]
    },
    {
      "id": "https://openalex.org/A2015517922",
      "name": "Paul Glasziou",
      "affiliations": [
        "Bond University"
      ]
    },
    {
      "id": "https://openalex.org/A2023216196",
      "name": "Zachary Munn",
      "affiliations": [
        "University of Adelaide"
      ]
    },
    {
      "id": "https://openalex.org/A2659054067",
      "name": "Anna Mae Scott",
      "affiliations": [
        "Bond University"
      ]
    },
    {
      "id": "https://openalex.org/A3158312288",
      "name": "Connor Forbes",
      "affiliations": [
        "Bond University"
      ]
    },
    {
      "id": "https://openalex.org/A2105601291",
      "name": "Justin Clark",
      "affiliations": [
        "Bond University"
      ]
    },
    {
      "id": "https://openalex.org/A2099587762",
      "name": "Matt Carter",
      "affiliations": [
        "Bond University"
      ]
    },
    {
      "id": "https://openalex.org/A2015517922",
      "name": "Paul Glasziou",
      "affiliations": [
        "Bond University"
      ]
    },
    {
      "id": "https://openalex.org/A2023216196",
      "name": "Zachary Munn",
      "affiliations": [
        "University of Adelaide"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2593758073",
    "https://openalex.org/W2547303135",
    "https://openalex.org/W2805303998",
    "https://openalex.org/W3003735349",
    "https://openalex.org/W2961191798",
    "https://openalex.org/W1977535059",
    "https://openalex.org/W2095601341",
    "https://openalex.org/W3120256265",
    "https://openalex.org/W2905431510",
    "https://openalex.org/W3030484156",
    "https://openalex.org/W2013578576",
    "https://openalex.org/W2999783216",
    "https://openalex.org/W2167717887"
  ],
  "abstract": "Abstract Objective We investigated the use of systematic review automation tools by systematic reviewers, health technology assessors and clinical guideline developers. Study design and settings An online, 16-question survey was distributed across several evidence synthesis, health technology assessment and guideline development organisations internationally. We asked the respondents what tools they use and abandon, how often and when they use the tools, their perceived time savings and accuracy, and desired new tools. Descriptive statistics were used to report the results. Results 253 respondents completed the survey; 89% have used systematic review automation tools – most frequently whilst screening (79%). Respondents’ ‘top 3’ tools include: Covidence (45%), RevMan (35%), Rayyan and GRADEPro (both 22%); most commonly abandoned were Rayyan (19%), Covidence (15%), DistillerSR (14%) and RevMan (13%). Majority thought tools saved time (80%) and increased accuracy (54%). Respondents taught themselves to how to use the tools (72%), and were most often prevented by lack of knowledge from their adoption (51%). Most new tool development was suggested for the searching and data extraction stages. Conclusion Automation tools are likely to take on an increasingly important role in high quality and timely reviews. Further work is required in training and dissemination of automation tools and ensuring they meet the desirable features of those conducting systematic reviews.",
  "full_text": "1 \n \nTit le  \nSy s t ematic review  aut omatio n t ool us e by s ystema t ic  r ev iewer s , health t ec hnology  \nasse s s or s  and clinic al guideline developers: tools used, a b a ndoned, and desir ed.  \n \nAutho rs:  \nAnna Mae Scott 1 , Conn or Forbes 1 , Jus ti n Cl a rk 1 , Matt  Carter 1 , Paul Gla s ziou 1 , Zach a r y Munn 2 \n \nAf fili a tion s:   \n1  Institute f or  Evidence-Based Healthc ar e, Bond Univ er s it y  \n2  JBI, F aculty of Health and Medical Sc ience s, The U niversity of Adelaide  \n \n \nAbst ract  \nObj ective \nWe investigated t he us e of s y s t ematic review aut omation t ools  by s y s tematic  r eviewer s , \nhealth t e chnolog y as s e s s ors and clinical guideline develope r s .  \n \nStudy d esign and settings \nAn onlin e, 16- ques t ion s ur vey  wa s di str ibuted across several evidence  synt hesis, healt h \ntechnology a sse s s ment  and guideline  dev elopmen t organisations interna t ionally. We a s ked \nthe r es pon dents w h a t  tools they use  and abando n, how often and when they  u se the t ools , \ntheir  pe rceiv ed t im e s avings and ac curacy , and des ir ed new tools. De s cr iptive stat is t ic s w er e \nused to report the res ult s .  \n \nResults \n253 respondent s  complet ed the s u rvey; 89 %  have used sy stematic review automat ion tools \n– most fr equent ly whils t  s creening (7 9%). Respondent s’ ‘t op 3’ tools inc lude: Cov idenc e \n(45%), RevMan (35%), Ra yya n  and  GR ADEPro (b oth 22%); most commo nly  abando ned were \nRay yan (19%), Covidence (15%), Di stillerSR (14%) and Rev Man (13%). \nM ajo r it y t hought t ools  \nsav ed t ime (80%) and increase d  a ccur ac y (54%). Re spondents taught  t hems elves to how to  \nuse the tools (72%), and were mos t of ten prev ent ed by lack of knowledge from t h eir \nadopt io n (51%). Most new too l deve lopment was  su gge s t ed for th e search ing and data \nextraction stages .  \nConclusion  \nAut oma tion tools  ar e likely to take on  an increasingl y  important  r o le in hig h quality and \ntimely reviews. F ur ther  w ork is  required in tr a in ing and dissemination of au t omation  tools  \nand ensuring they meet  the desir able  featur es  of t hos e conducting s y s t ematic r eview s.  \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \nNOTE: This preprint reports new research that has not been certified by peer review and should not be used to guide clinical practice.\n2 \n \nIntroductio n  \nSy s t ematic review s are integr al t o evidenc e- bas ed deci s ion mak ing. The y s erve as  the input \ninto clinica l and policy decision-mak ing, bot h on their  ow n and as under pin nings  of  clinical \npractice guidelines  and healt h technology as se ssments. However, condu cting t hem has  \nhistorically been both resour c e-  and t ime-in tens ive, with s y stemat ic  r ev iews on av er age, \nrequ ir ing approximately 67 week s  to  comp let e,(1) guidelines requir ing 18- 30 months,(2) and \nhealth t e chnolog y as s e s s ments between 6 and 24 months(3).  \n \nTo decrea se t he time r equir ed, sev er al a u tomation  t oo ls h a ve been – and continu e t o be – \ndeveloped, to ass ist with complet ing  t he ke y sy s t ematic review  stage s , s uc h as  devising a nd \nconducting databa se s ear c he s, screening  of  s earch r esults, data extr a ct ion, meta-analys is , \nand write up of the results.(4-9)  \n \nAlth ough auto mat ion tools are poten t ially helpful,  t heir curr en t uptake appear s  low. \nHo w ever , t his  evidence bas ed  o n a  f e w  sub gro ups  of  t he sy stematic reviewer commun it y, \nfor  ex ample, Coc hr ane s y stematic reviewers,(10) and clinica l pr a c t ic e guide line deve lopers \nwho are memb ers o f G uideline In t ern ational Network.( 11) \n \nTo bro a d en our under s t anding of the  upt ak e of  a u tomation  t oo ls, w e cond ucted a survey to \nidentify whet her ther e a re differ enc es  in how those who conduct standalone systemat ic  \nreviews, clinical pra ctic e guidelines, a nd health technology asse s s ment s  (h enc ef orth, \ncollec t iv ely ‘reviews’) perceive and int eract with sy s tematic r eview aut oma tion too ls . More \nspe c ifically, w e queried what types of  tools they use a nd hav e abandoned, how often they  \nuse the tools, at what stage s  of  t he proces s, how they  per c eive the t ime s avings  and \nac c ur acy of t he tools, how they learn to use the tools , and what new tools  they would like \ndeveloped.  \n \nMe tho ds  \nWe condu c t ed a  surve y of self-identified s y stematic reviewers, health technology a ssessor s  \nand guideline deve lopers, asse ssing r eview exper ienc e and views  and exper iences with the \nuse of automat ion tools us ing a set of multip le choice and open-ended qu e s t io ns . This \nsurvey is reported fol lowing the Chec klist for  Reporting Res ult s  of Int ernet E- S urvey s  \n(CHERRIES) reporting guideline.(12) \n \nRespondents \nThe survey tar geted r es po ndents eng a ged in conducting an y part  of sy stemat ic reviews, \nclinic al practice guidelines , and healt h technology as se ssments. The s ur ve y  wa s “ open,”  i.e., \nanyone could c o mplete it. We did not impose any loc at ion, gender, or  age r estr ic t ions  on  \nthe r es pon dents, alt hough we had anticipated that  respondents would be over 18, as  t he \nquestions target ed professio nals .  \n \nSurvey dissemination \nWe ado pted a two-pr onged approach to  r eac h  r es p ondents: via  pr ofess ion al or ga n isations \nand via s ocial media. \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n3 \n \nWe cont a c t ed professional o rganis at io ns  who se membership includes d esired r es po ndents \nvia email, with a r eques t  to diss eminat e it  to the ir  me mbership. The email provided \ninfor ma tion abou t  the pr ojec t  and it s  aims, a s  well as  a link to the survey. T he following \norganisations were contacted: JBI ( fo rmerly k nown a s the J oanna Brigg s  Instit ute, a \ns ystemat ic  r ev iew organisation),  Cochr ane Collaboration (a s y stematic review organisation), \nG-I-N: G uidelines Internat ional N etwor k (guidelines - focus ed) , HTAi (health t echnology \nasse s s ment  interna t ional, HT A- focus ed) , I N AHTA (Int ernationa l Networ k  of  Agencies for  \nHealt h Tec hnolog y Asse ssment (HTA- f ocus ed) , AL IA Health L ibrar ies Austr a lia (lib r arians \ninvolved in s earching for  sy stematic reviews ) , a nd Ex per t Searcher s Mailing lis t \n(inter na tional; ind ividuals involved in designing / executing s ear c hes for  s y s t ematic reviews ). \n \nWe also di s seminated  t he infor matio n about  t he s ur vey  via personal Twitter  a ccount s (AMS, \nPG, ZM), and an ins t itutiona l account (Instit ute for  Ev id ence-Ba sed Healt hc ar e), with weekly  \ntweets with infor ma tion abou t  the survey and a link.  \n \nThe survey w a s opened on 28 Sept 2020; all survey re spons e s were eligible for inclus ion if  \nret urned be f ore 31 Oc t ober 2020.  \n \nSurvey instrument \nThe survey w a s deliberately brie f , c onsi sting of 16 questions plus  an opt ion to prov id e an \nemail address  t o receiv e r es ult s . The questions were predominantly tick-box or multiple-\nchoice que s tions , quer yin g  t he respondent’s experience with sy stemat ic reviews, us age of \nautomation tools, perception of their  ac curac y a nd time s aving s offered,  and how t hey \nlearned t o us e the tools. ( The full s urvey  is repr oduced in Appendix A). \n \nTo test for  technica l is s ues and e stimate the time r equir ed to complet e t h e s ur v ey, we \npiloted t he s ur vey  with t wo c olleagues not involved w it h the pr ojec t . Bas ed on t he fe edback \nreceived, the survey was ref ormatt ed  to decrease the need for  s crolling, and the r es ult ing \nsurvey c onsisted of 7 page s .  The e stimat ed time fo r  c ompletion was  appr oximately 10 \nminut es . Ther e was only one v er s ion  of  the survey, a n d the s eq uenc e of  ques t ions  wa s \ncons t ant – i.e., adaptive ques t ioning was  not  us ed – but  r es pondents were able to r et urn t o \nprior  ans wer s  to change them.  \n \nThe survey w a s hosted on the Sur v ey Monkey p lat form. \n \nAnalyses  \nExc el wa s u s ed to cal culate des cr iptive s tat is t ic s. W e had intended to calculate t he \ndifference in pr oportions between groups using  t he c hi- s quar e test, howe ver, data was  \ninsufficient. Free text r es pons e s were analysed the matica lly, using a n induct iv e appr oac h.(2) \nCoding wa s conduct ed by  t wo re sea r chers (AMS, CF), with dis crepancies   r esolved by \ncon s en s u s.  \n \n \nEthics approval and informed consent \nBond University Human Research Ethics Committ ee pr ovided approv al fo r the pr ojec t  \n(AS200903 ). The first page of the surv ey provided informatio n about th e project, project \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n4 \n \nteam, et hic s approval, data pr otectio n, and con sent. Respondent s  pr ov ided  t heir consent by \nclicking on the “if you cons ent , pleas e  click next to proceed”  button. Par ticipation and \ncompletion wer e vo lunt ary, and no in centives f or survey c ompletion were off ered. \n  \nResult s  \nRespondents  \nWe r eceived 253 r es pon se s. The med ian time to completio n w as 6 minutes. As the survey \nwas  open t o all t hose wit h ex per ienc e in evidence s ynt hes i s, no re sponse r ate was  able to \nbe calc ulated.  \n \nRespondent s  reported conducting r ev iews via t heir own organisation (e.g., an employer)  \n(59%), J BI (15%), Cochrane (13%) , or another  af filia tion (13%). Respondent s who ident ified \nanothe r  af filia tion and p r ovided add it ional deta ils, indic at ed c onduc t ing review s for  multip le \norganisations, government  agencies , HTA agencies, guideline-pr oducing b odies , or  \nuniversities.  \n \nThe majorit y o f respondents had been involved in mor e t han 10 review s (5 3%); 13% had \npreviously c on du c t ed between 6-10 r ev iews, 23 % b etween 3-5, 9% between 1-2 r ev iews. \n1% repor ted having not be en invo lve d in previous reviews .  \nTypes of reviews conducted \nNearly two-thir ds  of  respondents con ducted s ystemat ic  r ev iews a s  stand-al one pr ojec t s  \n(66%); 21% condu cted t hem as  par t o f a guideline dev elo pmen t pr oce ss , an d 13% a s part  o f \na health technology as s e s s ment.  \n \nThe majorit y of respondents had conducted reviews of interven t ions  (8 2% ) , then, in \ndes c ending  f requency: scoping reviews ( 46%), qualitative rev iews  (29 % ) , diagnos tic te st \nac c ur acy r ev iews (2 5%) and prognostic reviews  ( 17 % ) . All othe r  r ev iew  t y pes  (including: \naetiology, prevalence, ec onomic, hea l t h utilities, patient p r efe rences, a nd other)  wer e \nconducted b y fewer t han 15% o f respondents. (Ap pendix  B , Table B1) .  \n \nRespondent s  most fr equently repo rte d involvem ent in t he s ear c h design / execution (7 8% )  \nand question-f orm ulat in g  stages of a review ( 72%). However, also c ommon were \ninvolvem ent in the wr ite-up (59%) , sc reening (54%), dat a ext raction (51%) and data \ns y nt hesis (45%) stage s . \n \nFrequency and stage of  automat ion tool use  \n202 respondent s  r eport ed the percen t  o f the ir r e v iews that involv ed use of automat ion  \ntools; 11% of respondent s  r eport ed u s ing aut omation tools in none o f t he ir  reviews while \n89% us ed aut omation tools  in at least  some of their  reviews  in the past 3 years.  \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n5 \n \nAut oma tion tools  were mos t  f requen t ly  used at t he s creening sta ge (79% o f 189 \nrespondent s ) , f ollowed by d a t a ex t raction (51%) and dat a  s ynthesi s /meta- analy sis  stage s \n(46%) (Table 1).  \n \nTabl e  1 :  S ta ge o f au t omati o n  tool  use  \nA t  w h a t st a g e  of t h e  re v iew d id y ou us e a u t o m a t i on t o ols?  \nStag e N  ( % )  o f  18 9 re sp ond en t s  \nFormu lat in g  t he PICO T *  que s tio n  29 (15 % )  \nSearc h  des ig n  and/or e x ec ut ion  71 (38 % )  \nScree nin g  150 ( 7 9 % )  \nD a ta  e x t ra cti on  (i nc lu di n g  ri s k  of  bi a s )  96 (51 % )  \nD a t a  sy n t h e si s/ m e t a - a n a l y s i s  86 (46 % )  \nWr i t eu p  43 (23 % )  \nDe v elop i n g r ec omm end a t i o ns  from t he ev id enc e  34 (18 % )  \n*Pop u l a t ion , i n te rv e n tio n, c om parator,  ou tcome, time \nAutomat ion tools used and abandoned  \n211 respondent s  pr ovided informa tio n on the t o ols  t hey u s ed dur ing the sy stemat ic review \nproc es s . Mos t  c ommonly s elected tools  fr om a list of  45 opt ions (including ‘other’ with an \noption to provid e det ai ls), included: Covidence (50%), RevMan (4 1% ) , Rayy an (33%) , \nGRADEpro (31%) and JBI-SU MARI (21%) ( F igur e 1; F igur e B1 in Appendix B) .  \n \n \nFigu re  1:  F i fte en m o st comm o n l y  use d  systematic re vi ew au t omati o n tools  \n \nRespondent s  were also as ked to iden t ify their ‘top  3’ – t he three t oo ls t hey us e most \ncommonly. Tho se u s ed mo s t  commonly b y  1 80 r es pon dents , in c luded : C o v iden c e (45%) , \nRevMan (3 5% ) , a n d Rayyan and GRADEPro (bo th 22%).  \n \nThe top t ools  r epor t ed to be  abandon ed mos t  f requently  by 95 r espond e n ts included \nRay yan (19%), Covidence (15%), Di stillerSR (14%) and Rev Man (13%). Reasons  f or \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n6 \n \nabandoning the us e of t hes e tools  included: crashe s , non- c ustomis ability, s low ness, c ost , \ncomplexity or difficult y  t o lear n, prefe r ence for or  a va ilability of an alt er na te tool, and lack \nof desired feat u res.  \nSpeed and accuracy improvements  \nEighty per cent ( 80%) of 184 respondent s  th ought that  a u tomation  t o ols s a ve time – either  a  \nlot of t ime  (36%) or  some t ime (44%); 15% were neutr al and 4 %  t hought there are t ime \ncos t s  a s s ociated with t ool us e (Table 2). Most frequently, respondents wer e neutr al a bou t \nthe improvemen t in accurac y f rom aut omation  to ol us e (44% of 185 r es po n dents), although \n54% felt there was  either  a lot o r a lit t le accurac y improvement . 2%  t hought t here is  some \nac c ur acy loss  fr om the use of automa tion tools (Table 2).  \n \nT a b le  2 :  S pe e d  a nd  a c c ur a c y  i m p r ov e m e nt  f r om  au t om at i on  t o o l  u s e  \nH o w  mu ch  t i me  d o  the s e  to ol s s a v e ?  \nT i m e  sav ed  N ( % ) o f 184  r esp o ns es  \nSave s a l ot o f ti m e  67  (36 % )  \nSave s s o m e  time  81  (44 % )  \nNeu tral  28  (15 % )  \nC o s t s so m e  t i me  6 (3%)  \nCost s  lot s of  time  2 (1%)  \nDo t h e  t oo l s  im prov e t h e  ac c u r acy  o f  t he sy s t e ma t ic  rev i e w/H T A/CP G * ?  \nAccu r a c y N ( % ) o f 185  r esp o ns es  \nA l ot o f improve ment in a ccura c y  50  (27 % )  \nA l ittl e impro vemen t in  a ccura cy  50  (27 % )  \nNeu tral  82  (44 % )  \nLo s e  s o m e a ccura c y  w i th u si ng t he t ool s  3 (2%)  \nLo s e  a l ot of  ac c u r a cy with  us ing  the  too ls  0 (0%)  \n*H TA= he a lt h tec hn ol og y  a sse ss m e nt;  CPG =clin ic a l  p r a c tice g uide line  \nLearning about the tools and factors impeding their use \nMost commonly ,  r e s po ndents taught th ems elves how to use t he automat ion tools (72% of \n193 respondent s )  or used the help documentat ion (44%). Learning fro m other s  common ly \ninvolved par ticipating in workshops ( 43%), learning from a colleague (42%) or  fro m webinar s  \n(40%) (Figur e 2 ).  \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n7 \n \n \nFigu re  2:  How  do re sp ond e n ts learn  to use th e  aut o mation t o o l s \nRespondent s  (n=196)  w er e most commonly prevented  f rom using automation tools by l ack \nof knowledge about t he ex isting too l s (51%), co st s ( 45%), the complicated natur e of the \ntools (39%), t i me constr aints ( 28%) , or user unfr iendl ines s (25%). (Table 3) \n \nTabl e  3 :  F a c t o rs preve n tin g respo nden ts  from u s in g  t he a ut o m a tion to o l s  \nW h a t  pre v e nt s  res p o n dents fro m  us i ng th e autom ati on to o l s  \nF act o rs   N ( % ) o f 196 r esp o ns es  \nThe lea rn ing  curve (too c omp li c a ted t o lea rn )  76  ( 3 9 % )  \nTim e con stra ints  5 5  (28%)  \nCo sts  8 8  (45%)  \nL a ng ua g e  b a r r i e r  5 ( 3% )   \nIn te rn e t con nectivity/ fi re wall  5 ( 3% )  \nUs e r unf rie ndl y  4 9  (25%)  \nLa ck of  k nowledge of  e xistin g  t oo l s  1 0 0 (51%)  \nNot a pplica b le  2 0  (10%)  \nOther (o p ti onal :  p leas e shar e why)  4 3  (22%)  \n \nMos t  time-cons uming ste ps and new  t ools  de s ire d  \nOf 194 re spondent s , 48 % found s creening to be t he m os t  time-consuming stage of the \nreview, foll owed by data extraction (45%) and s ear c h de sign and/ o r exe cu t i o n (30%). Dat a  \ns y nt hesis/meta-analy s is w as  identif i ed by  19% of  r es p ondent s, and write-up  b y  16% ; fewest \nrespondent s  fo und formula ting the PICO que stion to be t he most time -consuming step (8%).  \n \nRespondent s  als o  shared  what  a u tomation t oo ls  t hey w o uld l ike to see developed in the \nfut ure. As multiple sugges t i o n s  were fr equent ly made in a si n gl e commen t, 116 comments \nwere br oken down to indiv idual s ugg estions (n=341). Mo s t  commonly, too ls f or the \nsea r chin g stage (53 sug ge s t i o ns ), d a t a e xt raction stage (n=41), sc r eening ( n=20) or r is k of \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n8 \n \nbias ( n=19) were requ es ted . ( The s pe cific tools requested by mor e t han one respondent  a r e \nin Table 4; an ex pand ed table is  pr es ent ed i n  A ppendix B, Table B2).  \n \nTabl e  4 :  T o ol  dev elo pment su ggeste d  b y  the res p on dents \nWh at au tomati on t ool s  wou ld y ou  li k e de velo p ed ?  \nRev iew stag e (N \nsug ge sti o ns)  \nSugges te d t o ols*  \nS e ar c hi n g ( n = 53 )  • S t r a t eg y  o p ti m i s at i o n t o ol  ( n on - s p e ci f i c  or  v i s ual )  ( n =1 4 )  \n• Dedu pli c at ion  (n=9 ) \n• Transla tio n be tween  dat ab a s es (n= 7)  \n• Strate gy desig n (no n-spe cifi c or data  m i nin g t o ols) (n= 5) \n• G re y  l ite rature  (non-s p ecifi c or e x p ortin g) (n = 2) \n• Sy n on y m /re lat ed te rm  (p hrase) sug gestio n to ol (n =2)  \nScreen ing  (n=2 0) • Dis p ute  resolu tion  too l (no n-spe cifi c  o r with v i sua li sati on) (n =5) \n• Sc re eni ng t ool  (non -s pe c i fi c) (n=4 ) \n• Data m in ing  fun c ti ona lit y (fo r ful l-text s c re en) (n =2) \n• Refere nce pri oriti s a tion  an d th res h old -s e ttin g fu nc t ion ali t y  (n =2) \nData  extractio n (oth er th an \nris k  of b ia s) (n=4 1)  \n• Data ex t rac t ion  too l (no n-s p ec ifi c or gen eral - e.g ., accurate , fast) \n(n=2 4)  \n• For o bserv a tio nal s tu die s  (n =2) \n• For reuse of  previo us  data  e xtraction s  (n =2) \n• From Pdfs (n= 2) \nR i sk  of  Bi a s  ( n= 1 9)  • Auto m at ed ri sk of bia s (no n-spe cifi c ) (n =11) \n• Auto m at ed ri sk of bia s (ob s e r v at ion al stud ie s)  (n= 7)  \nSynthe s i s /a nal y si s  (n=5)  • No to ols s u gge s te d b y more t han  1 respo ndent \nWri teup  (n=1 2)  • Data v i sua li sati on/p resenta tion  (n= 5) \nProj ect m a nag ement (n =16 ) • Strea m li ned /s i ngl e to ol for th e en tire  proces s  (n =9) \n• Lin k a ge b etwee n to ols/da ta p us h ing  be tween  tool s  (n=2) \nOthe r (n=4 ) • No to ols s u gge s te d b y more t han  1 respo ndent \n*t he  n umb er of s u g g es ti o ns f o r  each  t ool i s  i n di c a t e d  in brackets ; c om plete  l is t of su g g e st ed  t oo ls is p r o v i d e d \nin T able  B 2,  A pp e n d ix B  \n \nDifferen c e in r espo nses b y system ati c  r eviewers, guideline dev eloper s  an d h eal t h \ntechno log y  as sessors  \nPaucit y of response s  f rom guideline d evelopers and health technology a sse s s or s  pr e c luded  \ntesting whether  the three c at egories o f respondents differ  in the ir per c ep ti on of th e  \nusefulnes s  of t he a u tomat ion  t o ols. We ther efore p r es en t the pe r c ent ages  of r es pon ses i n  \neach cat eg o ry.  \n \nMost s y s t ematic reviewe r s  sa w automation  tools as offer ing time s avings (80%) – either \nsome time (43%) or  a lot of time ( 37%); ve r y few s a w automat ion to ols as involving ti me \nco s t s  (3%) . Similarly, th e  maj o rity of g uideline d evelope rs (88%) and health  t ec h nology \nasse s s or s  (73 %) sa w automation  t oo l s as offer ing s ome  or  large time -saving s , and few \nperceived time  cost s ( 6% and  7% , r espectively). However, t he l ow n umber s of responder s  in \nthe latter categories s u gge st c aution i n inter pr et i n g t hes e nu mbers. (Table 5).  \n \n \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n9 \n \nTabl e  5 :  Perc epti on  of  time -sa v i ng s  offer ed b y  aut omation t ools b y  the 3 re sp ond e n t g roups \nTim e saving s  by  \nautomati o n t ools \nSy stem atic  revie w e rs \n(s tan d-a l one )  N (% ) of \n1 36 r e sponses \nGuidel ine de v el opers  \nN (%) of 32 re sp ons e s \nHe alth techn ol o gy \na sse ssors  N ( %) o f 15 \nre spons es  \nCosts  lo ts o f tim e 2 ( 1 %)  0 (0 %)  0 ( 0 % )  \nCosts  so m e ti m e  3  (2% )  2 (6 %)  1  (7%)  \nNeutral                 23  ( 17 % )  2 (6 %)  3  (20%)  \nSav es s ome  time 5 8 (4 3% )  14  (44%)  8  (53%)  \nSav es l ots of ti me  50  ( 37 % )  14  (44%)  3  (20%)  \n \nMost s y s t ematic review er s  t hought t hat automation too ls improve acc u rac y  (53% )  – eit her \n‘some’ (28 %) or a lot  ( 25%), however a c o n s ider a b l e per centage were neut r al ( 46%). A \nsi mil ar  response p a t tern  was evi d ent for  guideline  develop er s , 45% of who m saw \nautomation tools as  of fering a lot of i mpr ovemen t and 23% as offering so me impr o vement  \nin acc ur a cy, whil s t  32% wer e neutral. H eal t h technology a ssessor s  were most commo nly  \nneutr al a b ou t the i mprove ment offer ed by t he tools ( 53%) although 27% view ed  t hem as  \noffering s ome an d 13%  of fering a lot of imp r ovemen t in accurac y. Th e low number of \nresponder s  who self-ident if i ed  as guideline deve lopers or heal th t ec hno l ogy  a s s e s s o r dictate \ncaution in inter p retation of  these number s , ho w ever .  \nAcc uracy improvement \nby aut om a tio n to ols  \nSy stem atic r e vie w e r s  \n(s tan d-a l one) N (% ) of \n1 38 r e sponses \nGuidel ine de v el opers  \nN (%) of 31 re sp ons e s \nHe alth techn ol o gy \na sse ssors  N ( %) o f 15 \nre spons es  \nA lot o f  loss  of a c cura cy  0 ( 0 % )  0 (0 %)  0 ( 0 % )  \nS o m e l o ss  o f  ac c ur ac y  2  (1%) 0 (0 %)  1  (7%)  \nNeutral  63  ( 46 % )  10  (32%)  8  (53%)  \nS o m e i m pr ov e me n t  3 9 (2 8% )  7 (2 3% )  4  (27%)  \nA lot o f  improvemen t  34  ( 25 % )  14  (45%)  2  (13%)  \n \nDi scus sio n  \nThis sur v ey of sy s t ematic review er s , c linic al pr ac t ic e guideline develop ers and health \ntechnology a sse s s or s  fou nd that most use only a few tools but cons ider  that t hey save them \ntime, t hough they als o  o ften abando ned use of t he t oo ls. Most commonly, respondent s  self-\ntaught  to use t he tools, and the bigges t  barrier  to up t a ke was the lack of kn owledge about \nthe t oo ls ’ existen ce, i d e n tified by half  of the res po ndents.  \n \nCovidence, Ray y an  and  R ev Man were identi fied as both mo s t commonly u sed – and most \ncommonly abandoned – t ools . The per v asiveness of their  us e may be explai ned by their \ncros s - utilis at i o n a n d name-recognitio n  ( e.g., Rev Man, and Covidence a r e s t andardly used for \nCochrane R e views, w it h Covidence  also having p a r tner ed wi t h JBI and the G uidelines \nInter nationa l Network). The r ea son s f or t hes e t ools ’ abandonment by the u sers – techni ca l, \nnon-customi sability, s lowne s s, cost, a nd complexity – are generally c o ns i st ent with t he  \nmor e g en e r al bar rier s  t o a u to mation  tool use iden ti fied by respondent s  – c os t , comple xity, \ntime constraint s , user- unfriendliness and  t ec h nic al issue s. Res p ondent s al s o repo rt ed high \nlevel of invo lv emen t acros s  all of the stage s of the review process  (wit h the lowes t  \npercent a ge – just under  a h a lf  – invo l ved in data synthesi s ), however , t he most common use \nof aut omat ion t o ols  by far ( 80% o f respondents) wa s  r eport ed i n  t he s cr ee n i n g sta ge. Thi s \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n10  \n \nmay reflect t he a vailab ili ty with the tools  fo r this s t ag e of  the proces s ,( 13) and is  r eflec t ed in \nthe sug ges t ions  f or tools to be develo ped – with most fo c using on the dat a  extr ac t ion or \nsea r chin g stage s, and less c ommonly on screening. Int erestingly, s everal of th e t oo ls \nsu gg e sted f or develop ment by t he re spondents already exist, whi ch fur the r und ersc or es  t he \nimpor tance of ano ther  o f the survey’s f inding – t hat lack  of  k n ow ledge abo ut  the to o l s’ \nexis t enc e is the most fr equently cited barr ier to th e ir adopt ion .  \n \nThe survey ha s  sev er al limit at ions. F ir s t , one of the key limitati ons wa s  th e r elativ ely  low \nnumber  of response s  f rom guideline developers (21%) and health tec hn ology  a s s e s s o rs \n(13%), whi ch precluded us from iden t ifying the diffe r ences  (if any) bet ween these t hree \ngroup s  in their  v iews and practice s  ar ound automation too ls. Sec on d , t he respondent  \nsample may b e b i ased and thus limited in generalisabili t y, as  tho s e individuals  who \nresponded t o our survey may general ly b e  more inte r es t ed and thus more positively i n c lined \ntowar ds  aut omation tool u s e, than no n-respondent s . Finally, be c au se the survey was \nconducted and publici s ed  in English , its f indings  ma y als o  n ot be generalisab l e t o r eviewers \nwho work in other  languages, although some of t he ‘other ’ respons e s to th e q ues t i o n about \nthe or ganis ation  t hrough which they per form r evie ws, su g ge st th at non-English-langua ge \nbased respondents al s o par ticipated in the survey (including from: Spain, Quebec, \nAr gentina, N o rway , A us t ria, Cro a t ia, B as que r egi o n, a n d S wit z er l and ).  \n \nOur findings are con s i stent  w it h previ ous findings . A  recent surve y focu s ed on t he \nautomation tool use by guideli n e d ev eloper s  specifica ll y, found  t hat 74% use aut omation \ntools to be more ef ficient and 66% strongly a greed t hat automa t ion tools are useful.(11) \nSimilarly, a s ur v ey of s y s t ematic reviewers who conduct  C o c hr ane Review s found  a usability \ns c or e greater  t han 68 (out of 100) ac r os s  automation too ls.(10)  The spe cific  t ools  cited a s \nmost commonly u sed by the respond ent s  t o the present survey – Covidenc e, R ev Man and \nRay yan – a lso overlap with th os e iden t ified  by g u i d el ine develop er s  (R ev Man, Covidence \nand Rayy an)(11) and t hose  ident ifie d by Co chrane Reviewers (EndNote, Re vMan, Covidence, \nRay yan).(10) A  quali t at ive s t udy a lso i dentifi ed t hat a lac k of knowledge wa s  a contr ibutor  to \nthe slow pac e of  uptake of automa t i o n tools amongst guideline devel o pers an d c oncluded \nautomation tools needed t o be transparent  and  in l ine with cur ren t values an d practice.(9)  \nThe inter es t  in sy s t ematic review automation is long-standing, and may be  dated back to the \nrelease of the fir s t  v er s ion of  R evMan  in 1993.(14) It s  br oadening i s  ref lec t ed i n  t he \nfor mat ion of t he Inter na tional  Collab orat ion for t he  Aut o mati on of Systematic Review s \n(ICA S R ) in 2015.(4) Nevertheless, on e  o f the key barrier s  to t he us e and ad op tion o f \nautomation tools remains the lack o f knowl ed g e abou t their existence. This  is a cru c ial \nbarr ier, as  t he majori ty of  r es p ondent s to our  s ur ve y self-teach the use of the tools, and  \nthey cannot t eac h t hems elves to u se the too ls they do not  kno w  exist. Thi s sug ge s t s  th a t  an \nincreased emphas i s on tool dissemin ation (e.g. suc h a s the SR Toolbox initiative, or t hrough \nintegr a t ion into t h e Cochrane, Campb ell, and JBI  guidelin es and teaching materials) could be \nprior i tised. The 6 organis at ion s  we su rveyed c o uld a lso have a r ole in bet te r  dis semination.  \nAs one of the other key barr i er s  identified was  th e steep learn i n g cur v e, t he provisi o n of \nresour c e s s uch a s d emo vi d eos  and tu torials for t he too ls i s likew i se cru cial – in particula r  as  \nthe t im e i n v estmen t  in ac q uiring the f amiliar it y wit h these t ools  seems to be well o f fset by \nthe t i me s avings  p e r cei ved by the r espon dents.  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n11  \n \nAut oma tion tools  ar e likely to increase i n  r ange and impro ve in usabili t y, a n d s o t a ke on an \nincreasingly impor tant r ol e in high qu ali t y a n d timely rev iews . Regular  sur vey s of their \nuptake, pr oblems ,  and  aband onment will be imp ort ant to  u nde rstanding their  \ndis s eminat i o n.  \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n12  \n \nA c k n ow l e dg e men t s \nWe w ould lik e to thank  Ton Kuj iper s  fo r i nv alua ble f eedb a ck  on the dr af t s  of the su r v ey, a nd Melan i e \nVerm eule n for  s e tting up t he sur v ey i n S urvey Monkey .  We w ould al so l ike to th a nk  all  of our \nre spond ent s  fo r  g ene rou sly sh aring with us th eir tim e, v iews an d  s ug ge s t i on s .   \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n13  \n \nRef e rences  \n \n \n1. Borah R, B r ow n AW, Cap er s PL,  Kai se r KA . Analy s is o f t he t im e and w orker s  ne ede d to \nco nduct sy ste matic rev iews o f me dica l in terven tion s u sing d at a fr om the PROS PE RO regi st r y . BMJ \nOpen. 20 17 ;7(2 ):e0125 45 .  \n2. Natio nal H e al th and M e dical  Re se arch C oun cil (NHM RC ). Re por t on Au stral ian c li nic al \nprac t i ce g uideli ne s  20 14 Canb er r a: Natio n al Healt h a nd Medic al Re sea rc h Cou nc il; 201 4 [Avail abl e \nfrom: h ttp s:/ / w ww .nhmrc.gov .au /abou t - us/publ ica tion s/ r ep o r t -au s tr a lia n-c linic al -prac tic e -\ngui deline s -2014 . \n3. Akeh urst RL, Ab adie E , R enaudi n N ,  Sark ozy F . Vari ation in H ealt h Te chnol ogy A sse ssme nt \nand Reimbur se ment Proce s s e s  i n Europe . Va lu e in H e al th. 2017 ;20 (1) :67-76 .  \n4. Bell er E, Cla r k  J , Tsa fna t G, Adam s C, Die hl  H ,  Lund H , et al. M ak ing p r og r e s s with the \nautoma t io n o f sy s t ema t i c r evi ews : princi p les o f th e In tern atio nal  Col lab ora t i on fo r  t he  Au toma tion \nof S ystema t i c Rev iew s (I CASR ). Sy st emati c Review s .  2018;7 (1) :77 .  \n5. Cla r k  J, Gla sz io u P , Del Ma r C, B a nnac h - B row n A, Ste hl ik P, Scot t AM . A ful l s y st ematic  review  \nwa s  c omple ted in 2 w eek s u sing a utoma t ion tool s: a c a s e s t ud y. J Clin  Epidemi ol . 2020 ;121:81-90 .  \n6. Mar s h all I J, Wa l lace  B C. Tow ard sy s tema t i c revi ew a utoma tion : a pr a c tica l guid e t o using \nmac hine l earni ng t ool s  i n r e sea r c h synth esi s. Sys temat ic Revie ws.  2019;8(1 ):1 63.  \n7. Tsa fnat G, D unn A, Gla sziou P, C oi era E. T he automa t i on o f system a tic rev iew s. B mj. \n2013 ;346:f139.  \n8. Tsa fnat G, Gl a sz i ou P , Cho on g MK, Dunn A, Gal gani F , Coi e r a  E. Sy s t ema t i c revi ew \nautoma t io n t echnol ogie s . Sy stema tic  Re v iews. 201 4;3 (1):74 .  \n9. Arno A, El lio tt  J ,  W a ll ac e B, Tu r n e r  T , Tho ma s  J . T he vie ws o f heal t h guidel in e dev e loper s on \nthe u se o f a u t o mati on in h eal th ev idenc e  synthe si s. Sys t Rev. 2 021;10 (1):16 .  \n10. va n Altena AJ, S pijke r  R ,  O la b arr i aga S D. U sag e of au toma tio n to ol s  in sy s t ema t i c revi ews . \nRes earch  Synt he si s Me thod s .  2019 ;10 ( 1 ): 72-82.  \n11. Munn Z , Brand t L, Kuijpers T, Whi tting to n C, W i le s  L, Ka r g e T. Are sys tema tic  r e vi ew  and \ngui deline devel o pment tool s u s e ful ? A G uideli ne s  In te r n ati onal N etwork  s urve y o f us er pr ef er ence s. \nJBI Ev id Imple men t. 2020 ;18 (3) :345-52 .  \n12. Ey s enb ach G. Im prov ing the quali ty of We b s u r v eys : the Chec kli st for R epor ting R esul t s of \nInte rne t E-S ur v ey s ( CHERR IES). J M e d Int erne t Re s. 2004;6 ( 3 ):e 34 -e .  \n13. Harr i s on H , Gri ffin S J , Kuhn I, U sh er -Smit h JA. So ftwa r e  t ool s  t o s uppo rt t itle a nd abs tr a c t \nscre ening  f or s y stema tic  revie ws in h ea lt hcare: a n eva luati on. B MC M e dica l Re se arch Me thod ology.  \n2020 ;20(1) :7.  \n14. Chan dl er J, H opewe ll S. Cochr ane me tho ds  - t w enty y ea rs  e xperienc e in devel opi ng \nsys t e ma tic rev iew m eth od s . Sy stem atic Review s. 2013;2(1 ):76 .  \n \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n14  \n \n \nAppendi x A  –  T he ful l s ur vey i ns t r ument  \n1.  Are y ou r review s pred omina ntl y cond uc t ed t hrou gh a n or g ani z a tion  su c h  a s:  \na.  Cochran e \nb.  JBI  \nc.  Campbe ll  \nd.  Own Organ izatio n  \ne.  Othe r \n2.  W hy  do  y o u  pr e d om i na n tl y  c o nd uc t  r ev i ews ? \na.  As part  of a  gui del ine  de v el opmen t pro c e s s \nb.  As part  of t he Hea lth  Techno log y  A s s e ss m e nt  (HTA) p roc e ss  \nc.  As a s yste mati c rev ie w  onl y \n3.  Wh at type s o f review s do y ou  c o ndu c t pred om i nan tl y?  \na.  In terventi ons  \nb.  Dia gnosti c Te s t A c curac y \nc.  Prog nosti c  \nd.  Eti olo gy \ne.  Q u a li t at iv e \nf.  Scopi ng  \ng.  Preval en ce  \nh.  Econo m i c E valu atio n s \ni.  Hea lth Uti li ties  \nj.  Pat ien t Prefe rences and  Val ue s  \nk.  Othe r \n4.  Wh at stag e/s of t he s ystemati c  re v ie w are y ou  m o s t com m o nl y in v o l v e d in ? (sele c t one  or m ore)  \na.  Formul atin g th e q uestio n (e. g. PICOT)  \nb.  Sea rc h  des ig n an d/or ex e c u tion  \nc.  Screen ing  \nd.  Data  extractio n (in c l udin g ri sk of b ia s)  \ne.  Data  synth es i s / m et a-ana ly si s  \nf.  Wri teup  \ng.  Develo pin g reco m m e nda tion s  f rom  the evi den c e  \n5.  How man y sy stemati c re view s ha v e y ou  be en i nvol ved in?  \na.  0 \nb.  1-2 \nc.  3-5 \nd.  6-1 0  \ne.  10 + \n6.  Wh ic h  too l s do you  acti vel y u se i n th e s ystem atic re vie w  proce ss?  \na.  CADIMA  \nb.  CM -UCLI I  \nc.  Col andr \nd.  C o v i d enc e \ne.  Data  Abstra ctio n A ssi stan t (DAA)  \nf.  Disput atron  \ng.  Docear \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n15  \n \nh.  DoctorE vide n ce (DOC Da ta) \ni.  Eng aug e Dig itizer \nj.  EPPI-Re vie w e r  \nk.  EXACT: E Xt rac t ing  A ccurate  eff i c a cy an d saf et y  i nformati on from Clin i c a lTria l s.gov  \nl.  E x aC T :  e x t r ac tio n  of  c l i nic al  t r ia l \nm.  Fi ddle \nn.  GR AD Ep ro  \no.  Graph 2Data  \np.  GRI M  (g ranu lari ty -re late d i nc o nsi s t en c y  o f me an s ) te s t c al c u lato r  \nq.  Hea lth A sse ss m e nt W or kspace Co lla bora ti ve (HAWC) \nr.  Import .io \ns.  JBI- SUMARI  \nt.  MA G ICa pp  \nu.  metaDi giti s e  \nv.  OR BIT (Out come Rep ortin g Bia s  i n Tri als) Ma trix Gene rator \nw.  P l ot  D i gi t iz e r  \nx.  Pol y g lot  \ny.  Prox y Pa per  \nz.  ReL iS \naa .  Review Man ager (R e v Man ) \nbb .  R o bo t S e ar c h \ncc .  Rob otReviewe r \ndd .  RO BVIS  \nee .  Schol ar cy  \nff.  SESR A  \ngg .  SRDB.P R O \nhh .  SWIF T-R e v i ew  \nii .  Sy R F : S ystemati c  Re vie w Fa cili t y \njj .  SRA-Help er (En dnot e Hel per)  \nkk .  S y st e ma t i c Re vi e w  A c c e l e r a t o r  \nll .  V o y a nt  T o ol s \nmm .  We bPlo tDigi ti zer \nnn .  We k a  \noo .  Wo rd Freq u en c y Ana l yser \npp .  Wo rdStat 8 \nqq .  Othe r (ple ase spec if y) \n \n7.  Wh ic h  thre e to ols woul d you u s e  m o s t c o mm o nly? [ te xt box to  fil l i n]  \n8.  Wh ic h  too l s ha ve you tried  to us e  in  the  past b ut di scon tinu ed u s i ng, and  why  (opti ona l)? [text bo x ]  \n9.  Of al l th e s ystemati c re vie ws (gu ide lin es, HTA s ) y ou  ha v e c o mpl eted  in the past 3 y ea r s , app rox i m a tel y \nwha t percen tage  in v ol v e d au tomati on t ool s :  \na.  0% \nb.  1-2 5%  \nc.  25 -50% \nd.  50 -75% \ne.  75 -100 %  \n10 .  Wh at stag e/s of t he s ystemati c  re v ie w/gui del i ne /HTA were these t ool s  u s ed : \na.  Formul atin g th e PICOT q uestio n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n16  \n \nb.  Sea rc h  des ig n an d/or ex e c u tion  \nc.  Screen ing  \nd.  Data  extractio n (in c l udin g ri sk of b ia s)  \ne.  Data  synth es i s / m et a-ana ly si s  \nf.  Wri teup  \ng.  Develo pin g reco m m e nda tion s  f rom  the evi den c e  \n11 .  How mu ch ti m e w o uld  y o u sa y  those t ool s  sp ee d up  the  review p roce ss (op tio nal )  \na.  Save s lo t s  o f ti me  \nb.  Save s s o m e  time  \nc.  Neu tral  \nd.  C o s t s so m e  t i me  \ne.  Cost s  lot s of  time  \n12 .  Do t hese to ols i mpro ve t he a ccurac y  of th e s yste mati c revie w/gui del ine /HTA?  \na.  A l ot o f improve ment in a ccura c y \nb.  A l ittl e impro vemen t in  a ccura cy  \nc.  Neu tral  \nd.  Lo s e  s o m e a ccura c y  w i th u si ng t he t ool s   \ne.  Lo s e  a l ot of  ac c u r a cy with  us ing  the  too ls   \n13 .  Wh at pre v e nts y o u fro m  u s i ng th e a utomati on tool s ?   \na.  The  le arni ng  curve (to o co mpli c at ed t o le arn)  \nb.  Ti m e c on s tra int s  \nc.  Cost s \nd.  La ngu age  ba rri er  \ne.  I n t e r n e t  co n n e ct i vi t y/ f i r e w a l l  \nf.  U s er  u nf r i e nd l y \ng.  La ck of kno wledg e o f exi sting  too ls  \nh.  Othe r [opt ion al ‘ ple ase share  wh y ’ : te x t b ox]  \n14 .  Wh at i s  th e p r i m a r y  wa y in  whi ch you  lea rned  ho w  to use the a uto m at ion  too ls ?   \na.  Wo rkshop s  \nb.  We bin ars \nc.  Presen tati ons  \nd.  Col lea gue s h owed me  \ne.  Hel p do c u m en tati on  \nf.  Sel f-tau ght \n15 .  Wh at stag e of the rev i ew i s mo s t  ti me con sum ing  for you ? \na.  Formul atin g th e PICOT q uestio n  \nb.  Sea rc h  des ign  an d/or ex e c u tion  \nc.  Screen ing  \nd.  Data  extractio n (in c l udin g ri sk of b ia s)  \ne.  Data  synth es i s / m et a-ana ly si s  \nf.  Wri teup  \ng.  Develo pin g reco m m e nda tion s  f rom  the evi den c e  \n16 .  Wh at au tomati on t ool s  wou ld y ou  li k e to see i n th e fu ture – p lea s e be spe c i f i c  as po s s i ble ? [mult i-li ne \nte x t b o x] \nE.g . “a t ool  to h elp  with disput e resol utio n fo r s e ar ch”, “a  vi sua li sati on u til ity to o pti m i se sea rc h \nstrate gie s”, “a n a utomate d metho d to  extract r is k  of b ia s ”  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n17  \n \n17 .  Opti ona l: Pl ea se pro v i de you r email  if you  wo ul d li k e  to re c e i v e  the  result s of  the  s u rv e y (if  y o u wou ld \nli k e  to re m a in a non ymou s bu t recei ve t he re su lts, pl ea se i nput  a fre e e m ai l a ddre s s s u c h a s  g m a il or \nho tm a il,  rathe r tha n your institu tio nal  add ress ) : [ text bo x ]  \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n18  \n \nAppendi x B – Ex pand e d r es ults  \nTable B1: What t ypes  of  reviews  do y ou pr edomina nt ly c on duc t ?  \n \nTyp e of re view Respon s es \nInte r v enti o ns  82 %  206  \nDiagn os tic  te st accuracy 25 %  62  \nPrognos tic  17 %  44  \nEtiolo gy  7%  1 8 \nQuali tative 29 %  72  \nSco ping  46 %  115  \nPrev alenc e 12 %  30  \nEco nomi c  eva lu ati o ns  10 %  26  \nHea lth u tili tie s 10 %  24  \nPati ent pref e rence s and va l ues 11 %  27  \nOther (ple ase  specify )  10 %  25  \n Total 252  \n \nRes pon se s  und er th e “o t he r ”  ca t e gory, i nc luded: ne twork me ta -a naly se s, umbr el la  revie ws,  r a pid \nrevie ws , cos t and r es ource u se, heal th p ol icie s, i mplemen tati on s c i ence , inve stiga t i ve te s t s , \nmathema t i cal  modelli ng, me ta -re s earch,  methodol ogi cal,  mixe d method s, o bs erv ational , IP D, ri s k  \nfac t o r c harac t e r i s tics , sy ste matic m ap s ,  to underpin c linic al e vid enc e re por t, and v ariable .  \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n19  \n \nFigure B1:  Most commo nly u s ed sy s t ematic review aut omatio n tools – exp anded fig ur e  \n \nTool s  me n t i one d unde r  the ‘o the r’ cat eg or y , inc luded: 2 D  sea r c h , Ab st r ac kr, A tla s Ti, VOS View e r, \nSWIF T- A c tive Scre ene r , be s p ok e or ‘hom e -grown’ tool s, Cin ema , Coc hr ane R eg ist er of S t u die s , \nEndno t e  (17 re spon se s), Ya l e Anal y s e r, Vo s  v iewe r, P ubM ed remin er, Y al e Me sh, Te r mi ne, C oc hran e \nSc reen4M e, Me S H  on D emand, P ubV enn , E pis t emon iko s, Ex cel, Zote ro, G oogle tr ansl ate , Ovi d \nLa unche r , O p en  Acce ss Bu tton , Me ta -lite , NVivo , PRIS MA, R, R ayya n, RCT Cl as s i fie r, Re vtool s , \nlits earch r, S R D R,  STATA, OpenM et a,  Sys r ev.c om, lit sea rchr, Vo sV iew er, Cit eSpac e  \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n20  \n \nTable B2: Too l  d evelopme nt  su gge st ed by th e r espon dent s  – expa nde d t able  \n \nTabl e  6 :  T o ol  dev elo pment su ggeste d  b y  the res p on dents \nWh at au tomati on t ool s  wou ld y ou  li k e de velo p ed ?  \nRev iew stag e (N \nsug ge sti o ns)  \nSugges te d t o ols*  \nS e ar c hi n g ( n = 53 )  • Strategy  op tim is ati o n t ool  ( no n-s p eci fic or v isua l) (n=1 4)  \n• Dedupli c ation (n=9)  \n• Transl ati on b etween  dat a base s  (n= 7)  \n• Strategy  des i gn (non-s pe cific  or data  min i ng t oo ls)  (n= 5)  \n• G re y lite rature (no n-s pe ci fic  or ex p ortin g) ( n =2)  \n• Synony m /rel ated term ( ph r a se) s ug ge sti on tool (n =2)  \n• Auto m at ed stud y  i den tifi c at ion  (e.g . for living  review s/up date s )  \n• For o pen pee r review co m m e nt s, arti c l e ver s i ons  \n• For syste mati c  re v i ew s  \n• Formatti ng a bil iti es (c o lou r  c od ing , no tes, commen ts , ind enti ng) \n• Ful l text re triever \n• Inte rfaces (bett er an d more s ta ble ) \n• M e ta sear ch wi th fi lte r s  \n• O VI D  inte rface wit h fed erat ed sea rc h functio n  (a llo w i ng sea rc h e s  of mult ipl e \ndat abases)  \n• Refere nce impo rting  from refe rence man age r \n• Searchi ng (n on-specif i c ) \n• Specifi c  f eatu res (e xport re s u lt s from da taba se s  a nd o the r  s o urc e s ; abi lit y to \ngrou p, sort, s e lect re sul t s ; i nte rope rabl e with  r efe rence man agemen t software ) \n• Strin g lo gic che c k  t ool \n• Subj ect he adi ng tra nslati on betwe en d ata bases  \n• Text mini ng f rom  rele van t pa pers \n \nScreen ing  (n=2 0) • Dispute  res ol uti on to ol (n on -s pec if ic or w i th vis uali s atio n ) (n=5 )  \n• Scree ning t oo l ( no n-s p ec ific ) (n =4 )  \n• Data m ini ng fun ctionality (f or full - text scree n) ( n=2 )  \n• Referenc e prio r i tisa ti o n and threshold -s et t ing f unct io na lity  ( n=2 )  \n• Auto m at ed t i-ab scan for ke yw o rds/e xc lu sio n crite ria \n• Data m in ing  fun c ti ona lit y (fo r ful l-text s c re en) \n• Dec i s i on t ra ckin g fun c t ion ali t y  (i n c l u sion /e x c lu s i on d e ci s i on s) \n• Fil terin g ou t RCTs  \n• G ui d ed  al g or it h m  t o ol  \n• Pdf i m p orter f rom  c i tati on man agers  \n• Search re s u lt clu steri ng f unctio nal it y  \n• Stud y  sele c ti on tool  (non -s p ecif i c) \n \nData  extractio n \n(oth er than ris k o f \nbi as) (n=4 1) \n• Data e xtraction t ool  (no n-speci fi c or g e nera l - e. g., a ccurate , fas t ) ( n=2 4)  \n• For obs erva ti on al stu die s (n= 2)  \n• For reus e of  p r e vio u s data ex tract io ns  (n=2) \n• From Pdfs  (n=2 )  \n• C u s tom i s ab l e \n• Dis p ute  resolu tion  too l fo r dat a-extractio n  \n• Doub le b lin d extracti on capa bil it y  \n• F o r  de s c r i pt iv e  da t a  \n• For e ffect si ze s \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint \n21  \n \n• For meta -data \n• For o utcome da ta \n• From fig ures/tab les  \n• Ide ntifi es rel ev a nt p arts of t he a rticle  \n• O f  refe rence s withi n s ystemati c re vie ws fo r im port into  re fe rence mana ger  \n• Text mini ng cap abi lit y  \nRis k  o f B ia s  \n(n= 19)  \n• Autom ate d risk  of bi as ( n on -specific )  (n=11) \n• Autom ate d risk  of bi as ( o bserv ati ona l  stud ies ) (n=7 )  \n• Auto m at ed stren gth of e v i den ce a sse s sment  \nSynthe s i s /a nal y si s  \n(n= 5)  \n• Non-spec ifi c \n• Im p orti ng i nto a manu script (like Re v M a n e x po rter)  \n• Bette r c a pacit y in  Di still erSR  \n• Topi c  m od ell ing  \n• R e su l t s  vi su a l i sa t i o n  \nWri teup  (n=1 2)  • D a t a  vi s u al i s at i o n / p r es e n t at i o n  ( n= 5 )  \n• Auto m at ed re porte d chec k l i st c o m p leti on \n• Correctne ss c h e ck (Ci s and  eff ec t  s i z e s)  \n• F i gu r e  ge n er a t i on  \n• PRIS M A g ene rator \n• Tabl e g enerator  \n• Write -once-rea d-many fun c t iona lit y \n• Writi ng from s ta nda rdised  templa te  \nProj ect \nmana gement  \n(n= 16)  \n• Stream lined/ si ngl e  to ol  for t he en tire proce s s (n= 9)  \n• Linkage b e tween tool s/ da ta pu shi n g betw e en to o ls ( n= 2)  \n• Auto m at ed p re-reg is t ratio n fo rm s \n• Coll abo r a tive wo r k to ol ( f aci lit ate w o rk , em a i l trac k in g) \n• Pape r trai l tra c king  \n• Refere nce mana gement tool  \n• Tool s  (non-spe c i fied ) for q ual ita tive e vid ence re v ie w s \nOthe r (n=4 ) • Causati on a sse s sment  \n• Ex tra c ti ng m et a-dat a (che c k l i s t  in formatio n)  \n• Free s to rage  (f or a rticles)  \n• Unc l ear (lite rature  s e lecti on to ol s) \n*wh e r e  m o r e  t h a n  one s u g g e sti o n  me n t io n ed a  s p ecific t oo l , th e n umb er of  s ug g es t io ns i s in dicat e d  i n \nbrack e ts ; m os t co m m o n  s u g g e s t ions  are  li ste d f irs t and  bo lde d  \n \n \n \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted April 30, 2021. ; https://doi.org/10.1101/2021.04.26.21255833doi: medRxiv preprint ",
  "topic": "Guideline",
  "concepts": [
    {
      "name": "Guideline",
      "score": 0.7626537084579468
    },
    {
      "name": "Automation",
      "score": 0.7337889671325684
    },
    {
      "name": "Systematic review",
      "score": 0.6854012608528137
    },
    {
      "name": "Computer science",
      "score": 0.47747111320495605
    },
    {
      "name": "Quality (philosophy)",
      "score": 0.4595140516757965
    },
    {
      "name": "Data extraction",
      "score": 0.45064103603363037
    },
    {
      "name": "Work (physics)",
      "score": 0.43411290645599365
    },
    {
      "name": "MEDLINE",
      "score": 0.3921683728694916
    },
    {
      "name": "Data science",
      "score": 0.36902904510498047
    },
    {
      "name": "Knowledge management",
      "score": 0.36899930238723755
    },
    {
      "name": "Medical education",
      "score": 0.3650982975959778
    },
    {
      "name": "Engineering management",
      "score": 0.34362882375717163
    },
    {
      "name": "Medicine",
      "score": 0.2842216193675995
    },
    {
      "name": "Engineering",
      "score": 0.25713223218917847
    },
    {
      "name": "Political science",
      "score": 0.07497698068618774
    },
    {
      "name": "Philosophy",
      "score": 0.0
    },
    {
      "name": "Epistemology",
      "score": 0.0
    },
    {
      "name": "Law",
      "score": 0.0
    },
    {
      "name": "Mechanical engineering",
      "score": 0.0
    },
    {
      "name": "Pathology",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I120125038",
      "name": "Bond University",
      "country": "AU"
    },
    {
      "id": "https://openalex.org/I5681781",
      "name": "The University of Adelaide",
      "country": "AU"
    }
  ]
}