{
    "title": "Design of Cooling and Heating Tool Using Thermoelectric Peltier Based On Arduino Uno",
    "url": "https://openalex.org/W3153628021",
    "year": 2021,
    "authors": [
        {
            "id": "https://openalex.org/A5101266774",
            "name": "Meraj Alam",
            "affiliations": [
                "Lampung University"
            ]
        },
        {
            "id": "https://openalex.org/A5080295942",
            "name": "Helmi Fitriawan",
            "affiliations": [
                "Lampung University"
            ]
        },
        {
            "id": "https://openalex.org/A5087406401",
            "name": "FX Arinto Setyawan",
            "affiliations": [
                "Lampung University"
            ]
        },
        {
            "id": "https://openalex.org/A5070255973",
            "name": "Umi Murdika",
            "affiliations": [
                "Lampung University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2751684739",
        "https://openalex.org/W2613551054",
        "https://openalex.org/W2090813637",
        "https://openalex.org/W2788748077",
        "https://openalex.org/W2201634594",
        "https://openalex.org/W3036738143"
    ],
    "abstract": "Cooler is an electronic device used to cool food and drinks. The current cooling system still uses refrigerants that can damage the ozone layer. The thermoelectric based cooling system can be used as an alternative since it produces sufficient temperature difference on both sides by considering its advantages that is more environmentally friendly. This research is aimed to design and built a cooling and heating system using a thermoelectric Peltier TEC 12715 based on microcontroller Arduino uno. This system uses the Peltier thermoelectric effects as coolant and warmer because it produces temperature difference on both sides. Based on this research, in the no load condition the system can produce a cold temperature of 21,3 ℃ and a hot temperature of 80,2 ℃ in the 40th minute of use. When given a load of 300 ml and 220 ml drink bottles, the system can produce a cold temperature of 22,2 ℃ and a hot temperature of 70,7 ℃ in the 40th minute of use. The TEC 12715 Peltier component used in this research produces the optimal temperature if a voltage of 12 volts and a current of 15 amperes are applied to each Peltier component. The designed system is able to operate repeatedly, properly, and continuously since it is directly connected to alternative current power which is common in households.",
    "full_text": null
}