{
    "title": "Dielectric Response of the Oil-Paper Insulation System in Nanofluid-Based Transformers",
    "url": "https://openalex.org/W3165085887",
    "year": 2021,
    "authors": [
        {
            "id": "https://openalex.org/A3049697369",
            "name": "Daniel Perez-Rosa",
            "affiliations": [
                "Universidad Carlos III de Madrid"
            ]
        },
        {
            "id": "https://openalex.org/A2134643747",
            "name": "Belen Garcia",
            "affiliations": [
                "Universidad Carlos III de Madrid"
            ]
        },
        {
            "id": "https://openalex.org/A2138813327",
            "name": "Juan Carlos Burgos",
            "affiliations": [
                "Universidad Carlos III de Madrid"
            ]
        },
        {
            "id": "https://openalex.org/A3049697369",
            "name": "Daniel Perez-Rosa",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2134643747",
            "name": "Belen Garcia",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2138813327",
            "name": "Juan Carlos Burgos",
            "affiliations": [
                "Universidad Carlos III de Madrid"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2991327975",
        "https://openalex.org/W2509416715",
        "https://openalex.org/W7011565826",
        "https://openalex.org/W2009843108",
        "https://openalex.org/W3013452561",
        "https://openalex.org/W3013358860",
        "https://openalex.org/W3077996470",
        "https://openalex.org/W2200283558",
        "https://openalex.org/W2736100994",
        "https://openalex.org/W2811431091",
        "https://openalex.org/W1409508127",
        "https://openalex.org/W2748396141",
        "https://openalex.org/W2122795128",
        "https://openalex.org/W6610403488",
        "https://openalex.org/W2059471323",
        "https://openalex.org/W2021376564",
        "https://openalex.org/W2554204792",
        "https://openalex.org/W6731766829",
        "https://openalex.org/W2981508788",
        "https://openalex.org/W2140723035",
        "https://openalex.org/W2911707012",
        "https://openalex.org/W2054693124",
        "https://openalex.org/W1974576320",
        "https://openalex.org/W1602688591",
        "https://openalex.org/W288609838",
        "https://openalex.org/W2568562988"
    ],
    "abstract": "The interest in developing and testing dielectric nanofluids for electrotechnical purposes has increased significantly in the last ten years. A number of works have been published reporting dielectric and thermal properties for these liquids that enhance those of conventional insulating fluids. Some authors propose that the application of dielectric nanofluids to transformer insulation could improve the reliability of transformers and open new possibilities for transformer design. However, this will not be feasible until thorough studies on the interaction of these materials with other elements of the transformer, specially the solid insulation, are carried out. In this work, the effect of the presence of nanoparticles on the dielectric response of oil and oil-paper insulation is analysed in laboratory conditions. Specimens have been prepared to emulate the insulation system of transformers and the dielectric response in the frequency domain of these specimens has been characterized. The dependence of nanoparticle concentration on the dielectric response has been analysed. Proposing physical mechanisms that explain the experimental results observed over the oil and the paper samples. Some conclusions are extracted in this work that may be of interest if nanofluids are considered as liquid insulation for transformers.",
    "full_text": "Received April 7, 2021, accepted May 4, 2021, date of publication May 24, 2021, date of current version June 16, 2021.\nDigital Object Identifier 10.1 109/ACCESS.2021.3083368\nDielectric Response of the Oil-Paper Insulation\nSystem in Nanofluid-Based transformers\nDANIEL PÉREZ-ROSA\n , BELÉN GARCÍA\n , AND JUAN CARLOS BURGOS\nElectrical Engineering Department, Universidad Carlos III de Madrid, 28911 Leganés, Spain\nCorresponding author: Daniel Pérez-Rosa (daperezr@ing.uc3m.es)\nThis work was supported in part by the Spanish Ministry of Economy and Competitiveness under Grant DPI2015-71219-C2-2-R, and in\npart by the Spanish Ministry of innovation under Grant PID2019-107126RB-C21.\nABSTRACT The interest in developing and testing dielectric nanoﬂuids for electrotechnical purposes has\nincreased signiﬁcantly in the last ten years. A number of works have been published reporting dielectric\nand thermal properties for these liquids that enhance those of conventional insulating ﬂuids. Some authors\npropose that the application of dielectric nanoﬂuids to transformer insulation could improve the reliability\nof transformers and open new possibilities for transformer design. However, this will not be feasible until\nthorough studies on the interaction of these materials with other elements of the transformer, specially the\nsolid insulation, are carried out. In this work, the effect of the presence of nanoparticles on the dielectric\nresponse of oil and oil-paper insulation is analysed in laboratory conditions. Specimens have been prepared\nto emulate the insulation system of transformers and the dielectric response in the frequency domain of these\nspecimens has been characterized. The dependence of nanoparticle concentration on the dielectric response\nhas been analysed. Proposing physical mechanisms that explain the experimental results observed over the\noil and the paper samples. Some conclusions are extracted in this work that may be of interest if nanoﬂuids\nare considered as liquid insulation for transformers.\nINDEX TERMS Dielectric response, nanoﬂuid, nanodielectric, nanoparticles, transformer insulation,\ncomplex capacitance, FDS, Fe 3O4, permittivity.\nI. INTRODUCTION\nPower transformers are one of the most important compo-\nnents of electrical systems. They are responsible of rising\nthe voltage level of the energy in order to transport it with\nlower power losses and to reduce the voltage level near\nto consumption points. The reliability of these elements is\nvital for the adequate operation of the electrical network\nand, in some cases, transformer faults have led to power\noutages and severe accidents which derive in high economic\nlosses [1]–[3].\nOne of the main elements that makes possible the safe\noperation of transformers is the insulation system, which is\ndivided into liquid and solid insulation. Transformer solid\ninsulation is composed of different types of cellulose based\nmaterials such as Kraft paper and pressboard [4]. The liquid\ninsulation is commonly mineral oil (MO), which is derived\nfrom petroleum, although other ﬂuids are starting to be used\nsuch as natural and synthetic esters.\nThe use of nanodielectric ﬂuids (NF) as transformer liquid\ninsulation has been proposed by a number of authors in the\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Hui Ma\n.\nlast years [5]–[7]. Many experimental and theoretical works\nhave been conducted that show that the addition of small\nconcentrations of nanoparticles (NP) to insulating oils may\nhave a beneﬁcial effect on the dielectric properties of the\nﬂuids [8]–[10].\nMost published studies are focused on the evaluation of\nthe breakdown voltages under AC or under impulse solicita-\ntions. Increases up to 40 % in breakdown voltage have been\nreported. The observed improvements have been explained\nby the fact that impurities and charges present in the base ﬂuid\nmight be attracted by the NP limiting their role in the forma-\ntion of the streamer. Then, higher voltage levels are required\nto produce a breakdown [8], [11]–[13]. Another effect that\nhas been observed is that the presence of NP increases the\nsolubility of water in the base ﬂuid, limiting the hazardous\neffect of the water on the breakdown voltage [14], [15].\nAlthough there is a relatively high agreement in the fact\nthat NF have, in many cases, superior dielectric properties\nthan conventional oil, it should not be forgotten that, in case of\nusing these ﬂuids as transformer liquid insulation, they would\nbecome a part of a complex system and would interact with\nother transformer elements and materials. The interaction is\nespecially relevant in the case of the solid insulation.\nVOLUME 9, 2021 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see https://creativecommons.org/licenses/by/4.0/ 83797\nD. Pérez-Rosaet al.: Dielectric Response of Oil-Paper Insulation System in Nanofluid-Based transformers\nThe solid insulation of a transformer is devoted to elec-\ntrically separate regions of the equipment that operate at\ndifferent voltage level. It is constituted by thin insulation,\nwhich is composed of Kraft paper that wounds the cooper\nproviding insulation between turns and discs; and thick insu-\nlation, which is composed of pressboard cylinders and other\npressboard pieces and provides insulation between adjacent\nwindings and between the windings and other elements con-\nnected to ground, as the magnetic core or the tank.\nBoth thin and thick insulation are made of cellulose, which\nis a porous material. To improve the dielectric properties of\ncellulose and extend its life, cellulose insulation is impreg-\nnated with oil in a process that is generally done under\nvacuum and at high temperatures after manufacturing the\ntransformer active part.\nThe effect of the NP on the properties of solid insulation\nhas not been fully studied, although it is a vital aspect in\nthe development and application of NFs in transformers. In a\nprevious work [16], the authors shown that there exist an\ninteraction between the cellulose ﬁbers and the NPs of the\nNF that impregnates the solid insulation.\nA few authors carried out experiments to evaluate the\nbreakdown properties of cellulose impregnated with NFs.\nZhou et al. [17] compared the AC and DC breakdown\nvoltage and the space charge distribution of pressboard\nsamples impregnated with a TiO 2 based NF and mineral\noil-impregnated pressboard. Other authors evaluated the\nmechanical properties of the cellulose and its ageing process\nwhen impregnated with NFs [18], [19].\nThe aim of the present work is to analyse the effect of\nthe NP in the dielectric response of cellulose when it is\nimpregnated with a Fe 3O4 based NF. The work includes\nthe characterization of the dielectric response of the NFs as\nwell. The dielectric response of an insulation is related with\nthe polarization processes that take place when a dielectric\nmaterial is subjected to an electric ﬁeld and has a key role\nin the distribution of electric ﬁeld within the transformer.\nThe effect of the NP concentration is studied and physical\nmechanisms that explain the experimental observations are\nproposed in the paper. The measurement of the dielectric\nresponse was carried out with Frequency Dielectric Spec-\ntroscopy (FDS) method. This technique provides information\nabout the conduction and the polarization processes that take\nplace when a dielectric material is subjected to an electric\nﬁeld. FDS characterizes the response of materials in a wide\nfrequency range what is important to separate processes with\ndifferent time constants.\nII. DIELECTRIC RESPONSE OF OIL-PAPER INSULATION\nA. POLARIZATION PROCESSES ON DIELECTRIC\nMATERIALS\nWhen a dielectric material is subjected to an electric ﬁeld,\na polarisation process starts consisting of the alignment of the\nelectric dipoles in the direction of the ﬁeld.\nUnlike what happens in conductive materials, electric\ncharges in dielectrics materials are trapped and cannot move\nfreely. Polarisation processes in insulating materials are char-\nacterised by a limited movement of the charges trapped in the\nmaterial and an orientation of the dipoles that constitute the\ndielectric.\nThere are different mechanisms that contribute to the polar-\nisation of dielectrics which are governed by different time\nconstants, such as the atomic polarisation, ionic polarisa-\ntion, orientational polarisation, interfacial polarisation and\nhopping.\nIf a voltage V(t) is applied across the plates of a capacitor\nseparated by a dielectric material, the resulting electric dis-\nplacement D(t) shows a time dependency that is related with\nthe retarded response of the different polarization processes\nin the dielectric:\nD(t) =ε0 ·E(t) +P(t) (1)\nwere ε0 is the permittivity of the vacuum, E(t) is the electric\nﬁeld and P(t) the polarization.\nThe instantaneous polarization of a material P(t) depends\non the so called dielectric response function, f(t), which is a\nmonotonous decreasing function that represents the response\nof a material to an impulse electric ﬁeld.\nFor an impulse of magnitude E1t, the resulting polarisa-\ntion would be:\nP(t) =ε0 ·E ·1t ·f (t) (2)\nFor a ﬁeld with a different time dependency, E(t), the polar-\nisation can be obtained as:\nP(t) =ε0\n∫ ∞\n0\nf (τ)E(t −τ)dτ (3)\nThe dielectric response function, f(t), depends on the prop-\nerties of the materials and also on its condition. Factors as the\nmoisture content of a material or its aging condition have been\ndemonstrated to have an impact on its dielectric response.\nDielectric response measurements have been mainly used as\na diagnostic method for transformer oil-paper insulation, as\naging processes release water and other polar compounds that\nimpact the dielectric response of the insulation system.\nB. DETERMINATION OF THE DIELECTRIC RESPONSE\nThree methods are currently used to determine the dielec-\ntric response of oil-paper insulation: The measure of the\nPolarisation and Depolarisation Currents (PDC), the Recov-\nery V oltage Method (RVM) and the Frequency Dielectric\nSpectroscopy (FDS) method. PDC and RVM determine the\nresponse of the material in the time domain, while FDS\ndoes it in the frequency domain [20]. Measuring equipment,\nspeciﬁcally designed to monitor the condition of transformer\ninsulation, are commercially available to perform RVM, PDC\nand FDS measures.\nFDS is the method applied in this work to obtain the\ndielectric response of the NFs and the NF-impregnated cel-\nlulose insulation. With this aim cylindrical capacitors with\neach dielectric were prepared. A sinusoidal voltage of vari-\nable frequency is applied to the capacitor in a typical range\n83798 VOLUME 9, 2021\nD. Pérez-Rosaet al.: Dielectric Response of Oil-Paper Insulation System in Nanofluid-Based transformers\nof 1000 Hz - 0.1 mHz. The equipment returns the complex\nimpedance of the capacitor for every applied frequency.\nThe dielectric material is modeled as a capacitor in par-\nallel with a resistor (Fig. 1). The value of both parameters\n(C and R) are frequency dependent. The resistor represents\nthe losses of active power, which are the sum of the resistive\nlosses (dependent on the material’s conductivity) and the\ndielectric losses (i.e. the dissipation of energy caused by the\norientation of the dipoles).\nFIGURE 1. Model to represent the insulation under study.\nThe relation between the phasor voltage and current is\ngiven by Ohm’s law. Considering the association in parallel\nof the impedances ZR and ZC :\nZR(ω) =R(ω) ZC (ω) =i ·XC (ω)\nwhere\nXC (ω) =− 1\nω·C(ω) (4)\nFor a certain applied voltage, the current is:\nI(ω) =(i ·ω·C(ω) + 1\nR(ω)) ·U(ω) (5)\nThe relation between the current and the voltage is com-\nmonly expressed as:\nI(ω) =iωC0 ·(ε′(ω) −iε′′(ω)) ·U(ω) (6)\nwere ε(ω)′and ε(ω)′′are the real and imaginary parts of the\nso called ‘‘complex permittivity’’ ( ˆε(ω)), which depend on\nthe capacitance and the dielectric losses of the material:\nε′=C(ω)\nC0\nε′′= 1\nR(ω) ·ω·C0\nC0 is the geometric capacitance, which is deﬁned as the\ncapacitance of the test cell with any dielectric between the\nelectrodes.\nSome other relevant magnitudes, such as the dielectric\ndissipation factor, also called tan delta, can be derived from\nthese measures:\ntan δ(ω) =ε′′(ω)\nε′(ω) (7)\nMost FDS measuring devices provide the so called com-\nplex capacitance as output parameter:\nˆC(ω) =C′(ω) +iC′′(ω) =C0 ·ˆε(ω) (8)\nwhere\nC′=C(ω) C′′= 1\nR(ω) ·ω\nAs can be seen, C’ is the capacitance of the test object and\nC’’ is proportional to the power loss of the material.\nOne of the limitations of FDS method, compared to other\nmethods such as PDC, is that it does not allow the direct esti-\nmation of the conductivity of the material. However, at very\nlow frequencies the resistive part of the losses is predominant.\nCigré states that, when ε′′has slope ω−1 and ε′is constant it is\npossible to identify the DC conductivity of the material with\nthe slope of the C’’ curve [20].\nDielectric measures are very sensitive to temperature vari-\nations. The temperature dependence of dielectric measure-\nments has been widely studied, observing that changes of\ntemperature cause a frequency shift of the dielectric response\nfrequency spectra, although in most dielectric materials, such\nas oil-paper insulation, temperature does not affect signiﬁ-\ncantly the shape of the dielectric response.\nThe shift of the dielectric response curves with temperature\ncan be expressed by means of an Arrhenius factor, and may be\ncalculated using the equation proposed by Ekanayake in [21]:\nshift =log(ω1) −log(ω2) =− Ea\nk ·2.3258 ·( 1\nT2\n− 1\nT1\n) (9)\nwhere k is Boltzman’s constant and Ea is the activation energy\nof the material.\nAll the dielectric response measurements presented in this\nwork were performed at constant temperature 30 oC. On\na second stage of the study the dielectric response of the same\nspecimens will be analysed at higher temperatures, closer to\nthe service temperatures of transformers.\nIII. EXPERIMENTAL PROCEDURE\nA. MATERIALS\nThe commercial dielectric MO Nynas Nytro 4000× was used\nas base ﬂuid to prepare the NFs characterized in this work.\nNynas Nytro 4000×is manufactured by the company Nynas\nAB (Nynas AB, Stockholm, Sweden), and it is composed\nof 70–90% hydrotreated light naphthenic hidrocarbons, and\n10–30% lubricating oils (C20-50, hydrotreated neutral oil-\nbased) and less than 0.4% 2, 6-di-tert-butyl-p-cresol.\nA custom made NP dispersion that contains Fe 3O4 NP\nsuspended in the MO Nynas Nytro to a concentration 60%\nwas used to prepare the NFs. The suspension was manufac-\ntured by the company Magnacol (United Kingdom) using a\none-step manufacturing process, in which the NPs are directly\nproduced in the MO. The Fe 3O4 NPs present in the colloid\nwere about 10nm of diameter.\nThe speciﬁcations of the Kraft paper used to obtain the\ncellulose-impregnated samples are: grammage 0.75 g/cm 3\nand thermal class 105 ◦C. The typical composition of this type\nof Kraft paper insulation is 75-85 % alpha cellulose 10-20 %\nhemicellulose and 2-6 % lignin [22]\nVOLUME 9, 2021 83799\nD. Pérez-Rosaet al.: Dielectric Response of Oil-Paper Insulation System in Nanofluid-Based transformers\nB. NF PREPARATION\nThe NFs are prepared by mixing the base MO Nynas Nytro\n4000×with the Fe 3O4 dispersion to three different concen-\ntrations: 0.2, 0.3 and 0.4 g/L. The mixture was performed\nusing an ultrasound stirrer (Inc model VC 750 Watt, manufac-\ntured by Sonics& Materials). The sonicator was used at 40%\nof its rated power (i.e., power 300 W and ultrasound wave\nintensity 268 W/cm2), for two hours in intervals of 30 seconds\nof agitation and 30 s of pause to avoid overheating of the\nmixture. The NF stability was evaluated in a previous work,\nin which the long-term stability of the NF was investigated\nwithin a temperature range 20-110 ◦C using visual inspection\nand measurement of the particle size with Dynamic light\nscattering [23], concluding that the prepared NFs remained\nstable at ambient temperature for more than one year with a\ntypical distribution of NP diameter between 10 and 16 nm.\nC. PREPARATION OF THE TEST SPECIMENS\nThe main goal of this work is to characterize the dielectric\nresponse of the NFs and also the response of pieces of cellu-\nlose insulation impregnated with those NF. The responses of\nthe NF and nanocomposites are compared with the responses\nof the MO and the MO-impregnated cellulose.\nThe responses of the MO and the NFs with different con-\ncentrations of NP were measured using a test cell for liquids\nwith cylindrical electrodes (Fig.2). The cell was ﬁlled with\n2 cl of the ﬂuid that is being characterized in each test.\nFIGURE 2. Liquids’ test cell.\nThe dielectric response of the solid insulation was tested\nusing a cylindrical test object. The objects were prepared\nby rolling layers of Kraft paper around an aluminium core\nusing a winder machine to this end (Fig. 3). Identical test\nobjects were obtained with thickness of cellulose 1 mm; for\nthat purpose 14 layers of Kraft paper were necessary. The\nresulting test object is shown in Fig.4.\nThe impregnation process of the cellulose insulation was\nperformed under vacuum, using the impregnation plant\nshown in Fig. 5. The plant was designed to emulate the\nimpregnation process of the solid insulation that is carried out\nin transformer factories. The test specimens are introduced\nFIGURE 3. Winder machine deployed to prepare the solid insulation\ntest-specimens.\nFIGURE 4. Cellulose test specimen and test cell.\nin the vessel labeled as Chamber 2 in Fig. 5 and vacuum\nis applied. At the same time the impregnating liquid (NF\nor mineral oil) is placed in Chamber 1 and preheated to a\ntemperature of 40◦C. When the temperature is stable, the ﬂuid\nis loaded in the hosepipe an introduced in Chamber 2. The\nvacuum applied in Chamber 2 makes the NF ﬂow as a spray,\nmaking the impregnation process similar to the one used\nfor transformers’ production. The ﬂuid is kept in Chamber\n2 for 30 minutes to allow correct impregnation, and then it is\ndrained through a valve at the bottom of Chamber 2. In the\nlast step the test specimen is removed from Chamber 2.\nThree groups of two test specimens were prepared by\nthe impregnation process. Each group was impregnated with\nMO, NF 0.2 g/L, NF 0.3 g/L or NF 0.4 g/L. One of the test\nspecimens of each group was used to study the dielectric\nproperties, and the other one was used as a control sample\nfor moisture measurement.\nIn a previous work, samples of cellulose that were impreg-\nnated with different NFs were tested using Cryo-SEM\nmicroscopy [16] and other analytical techniques as Energy\nDispersive X-ray Spectrometry and Inductively coupled\nPlasma Mass Spectrometry. That study proved that, when\ncellulose is impregnated with a NF, some NPs penetrate in the\n83800 VOLUME 9, 2021\nD. Pérez-Rosaet al.: Dielectric Response of Oil-Paper Insulation System in Nanofluid-Based transformers\nFIGURE 5. Impregnation plant.\nFIGURE 6. Cryo-SEM image of a NF-impregnated sample of cellulose.\ncellulose creating bonds with the nanoﬁbres that constitute\nits internal structure. Fig. 6 shows a Cyo-SEM image of a\nNF-impregnated sample of Kraf-paper where it is possible to\nobserve the cellulose nanoﬁbres and the NPs.\nThe dielectric response of paper and oil insulation is\nstrongly dependent on the moisture content of the materi-\nals [20]. Thus, in order to separate the effect of the moisture\nTABLE 1. Moisture content of the oil and cellulose samples after the\npreparation process.\nfrom that of the NPs, the initial moisture content of the\nsamples included in the study was characterized using Karl\nFischer titration [24]. As it can be seen in Table 1, all the sam-\nples had similar low moisture contents after the preparation\nprocess.\nTo characterize the dielectric response of the cellulose test\nspecimens they were ﬁtted into a teﬂon tank ﬁlled with oil\nor with NF (depending on the cellulose-impregnating ﬂuid),\nso that the whole test object was immersed in oil, as happens\nwith the solid insulation in operating transformers.\nThe aluminium core of the specimen was used as ground\nelectrode during the measurements, and a second aluminium\nelectrode was fastened to the external layer of the Kraft paper\nto be used as measuring electrode. The electrode placed on the\ntest specimen was a 2 layers aluminium paper. The election\nof this electrode is motivated because of its fair conductivity\nand its capacitance to ﬁt on the dielectric testing specimens\nproduced for the present investigation.\nThe test specimens were kept at constant temperature for\nat least 24 h prior to performing any dielectric response\nmeasurements.\nD. DIELECTRIC MEASUREMENTS SETUP\nThe frequency dielectric response of the cellulose test spec-\nimens and the ﬂuids under study was measured using the\ndielectric response analyser Dirana (Omicron, Austria). The\ntesting procedure is described below.\nIn all cases, the measurements were done under a con-\ntrolled temperature 30 ◦C, thus the test cells were placed\ninside of an oven as is explained below.\n1) SOLID INSULATION SAMPLES\nThe measurement protocol used to analyze the solid-\ninsulation samples applies a measuring voltage of 20 V and\na frequency range from 0.1 mHZ to 1 kHz. Although the test\nequipment is able to measure both in the time domain or in\nthe frequency domain, all the measures were performed in\nfrequency domain.\nThe teﬂon cell containing the cellulose test specimen was\nplaced in the oven, which was set at the test temperature\nfor 24 hours for sample conditioning. Then, the setup of the\nDirana tester was connected to the cell as shown in Fig.7. The\nmeasuring conﬁguration was Ungrounded Specimen Test\n(UST). The cell was kept in the oven during the FDS tests\nto ensure a constant temperature.\nVOLUME 9, 2021 83801\nD. Pérez-Rosaet al.: Dielectric Response of Oil-Paper Insulation System in Nanofluid-Based transformers\nFIGURE 7. Measurement setup for the cellulose test specimens.\n2) LIQUID INSULATION\nThe liquid insulation samples were placed in a vacuum oven\nBinder VD 53 at temperature 30 ◦C and vacuum of 1 mbar\nfor 24 hours prior to the dielectric measurements. After the\nconditioning process the samples of the liquid were placed in\nthe test cell of liquids and were kept in the oven at 30 ◦C for\n24 h before performing the measurement.\nAs with the solid insulation, the measurements of the\ndielectric response of the ﬂuids were performed using the\nDirana FDS-PDC dielectric insulation analyzer. The mea-\nsurement protocol used to analyze the liquid insulation sam-\nples uses a measuring voltage of 50 V and a frequency range\nfrom 1 mHz to 1 kHz. Although the test equipment is able to\nmeasure both in the time domain or in the frequency domain,\nall the measures were performed in the frequency domain.\nIV. RESULTS AND DISCUSSION\nThis section presents the results of the FDS measurements\nthat were carried out in all the tested materials. Firstly,\nthe dielectric responses of the three prepared NFs are com-\npared with that of the MO used as base liquid. A discussion\nis provided aiming at describing the physical processes that\ntake place in those materials to justify the experimental obser-\nvations. Then, the results obtained on NF-impregnated paper\nspecimens are analyzed and compared with the recordings on\nMO-impregnated paper samples.\nA. DIELECTRIC RESPONSE OF THE MO AND THE NFs\nAs explained before, the dielectric response of the MO and\nthe NFs prepared with NP concentrations 0.2 g/L, 0.3 g/L\nand 0.4 g/L was measured in the frequency domain, within\na rage 10 3 to 10−3 Hz. The results of the real and imaginary\nparts of the complex capacitance in those materials are shown\nin Figs. 8 and 9. These results are in agreement with the\nobservations of Dai on SiO 2 based NFs [9]\nFig.8 shows the real part of the complex capacitance for\nthe base MO and the NFs with NP concentrations 0.2, 0.3 g/L\nand 0.4 g/L. It can be noted that the presence of NPs causes an\nincrease on the values of the real part of the complex capac-\nitance in the whole frequency range; the change is higher at\nlower frequencies.\nFIGURE 8. Real part of the complex capacitance of MO and NFs vs\nfrequency.\nFIGURE 9. Imaginary part of the complex capacitance of MO and NFs vs\nfrequency.\nTABLE 2. Dielectric constant (εr ) of the MO and the NFs at 50 Hz.\nThe measured dielectric constant (ε r ) of the three ﬂuids is\nshown in Table 2. As can be seen, there is an increase of more\nthan 45% in the permittivity value; the increase is higher as\nthe concentration of NP rises. The same pattern was reported\nby Du et al. in [25] for several temperatures and with different\ntypes of NPs and various NP concentrations.\nTo understand the behaviour of C′, it is important to\nremark that the Fe 3O4 NP are polar compounds. Then if a\nNFs is subjected to an electric ﬁeld, a charge displacement\ntakes place within the NPs that contributes to the overall\npolarization of the ﬂuid. Because of this additional charge\ndisplacement, the capacitance values recorded for the NFs are\nhigher than the ones measured in the MO. The polarization of\nconductive NPs is a fast event; the time constants associated\n83802 VOLUME 9, 2021\nD. Pérez-Rosaet al.: Dielectric Response of Oil-Paper Insulation System in Nanofluid-Based transformers\nFIGURE 10. Resistivity of the MO and the NFs.\nto the phenomena are much shorter than the ones associated\nto atomic or molecular polarization in the oil. This explains\nthe fact that the effect of NP on C′is equally noticeable in the\nwhole frequency range.\nRegarding imaginary part of the capacitance i.e. the dielec-\ntric losses of the ﬂuids, which are displayed in Fig.9, clear\ndifferences are observed between the measurements on the\nNF samples and those on the MO. The overall value of\nthe dielectric losses is increased when adding NPs to the\nbase MO, but the increase is especially noticeable at lower\nfrequencies.\nApart from the polarization phenomena that take place in\nthe NPs, the observed increase of the dielectric losses can be\nrelated with three different factors:\n1) When conductive NPs are added to a base ﬂuid, its\nconductivity increases signiﬁcantly.\nIn a previous work, the authors characterized the resis-\ntivity of several Fe3O4 based NFs ﬁnding the behaviour\nshown in Fig. 10. As it can be seen, the resistivity\nof the MO was divided by 2.5 when 0.2 g/L of NP\nwere added and by 8 when the concentration increased\nup to 0.35 g/L. As the resistivity of the NFs drops,\nthe formation of ionic paths is more likely, what leads\nto an increase of the resistive losses. This effect is\ndominant at very low frequencies [20].\n2) The addition of NPs increases the polarization losses\ncaused by the interfacial polarisation in the interfaces\nbetween the NPs and the base ﬂuid.\nSince the electrical properties of the oil and the NPs\ndiffer greatly, an accumulation of change takes place\nin the interfaces between the two media when the\nmaterial is subjected to an electric ﬁeld. The formation\nof this structure of counter-ions, which is commonly\nreferred to as the ‘‘electrical double layer’’ contributes\nto increase the dielectric losses of the material.\n3) Swartz [26] described an additional mechanism that\nincreases the dielectric losses of colloidal materials at\nlow frequencies. As the polarization of the dielectric\nmaterial progresses (i.e as the oil is polarized) there is\na certain displacement of the counter-ion layer which is\ntypically formed around the NPs when the NF is sub-\njected to an electric ﬁeld. The electrical double layer\nsuffers a polarization in which the ions are not removed\nfrom the surface of the NPs, as this would require larger\namounts of energy to overcome the potential well, but\nthey move within the surface of the NPs, deforming\nthe double layer. Those movements lead to a further\nincrease of the dielectric losses.\nB. DIELECTRIC RESPONSE OF THE NF-IMPREGNATED\nCELLULOSE\nFigs. 11 and 12 show the real and imaginary parts of the com-\nplex capacitance of cellulose specimens that were impreg-\nnated with MO and NFs prepared with NP concentrations\n0.2, 0.3 and 0.4 g/L according to the process explained in\nsection III.\nFIGURE 11. Real part of complex capacitance vs frequency for MO and NF\nimpregnated paper.\nFIGURE 12. Imaginary part of complex capacitance vs frequency for MO\nand NF impregnated paper.\nAs it can be seen, the impregnation of the cellulose with\nNFs has a signiﬁcant impact on the dielectric response of the\nVOLUME 9, 2021 83803\nD. Pérez-Rosaet al.: Dielectric Response of Oil-Paper Insulation System in Nanofluid-Based transformers\nsolid insulation. A shift towards higher frequencies can be\nobserved for both components of the complex capacitance\nwhich increases with the concentration of NPs dispersed\nin the impregnating ﬂuid. These type of relaxation peaks\nhave also been observed on pressboard and paper samples\nimpregnated with MO that contained high concentrations\nof moisture [20]. The shared polar character of water and\nNPs might justify the similarities between the pattern of the\ndielectric response of both types of specimens.\nIn a previous work [16], the authors carried out\nFourier Transform Infrared Spectroscopy (FTIR) and X-Ray\nfotoelectron spectroscopy (XPS) analysis on samples of\nNF-impregnated cellulose ﬁnding evidences of the existence\nof bonds between the oxygen molecules of the cellulose and\nthe Fe atoms of the NPs. The fact that bonds exist between the\ncellulose ﬁbres and the NPs, and the limitation on the NPs\nmobility caused by those bonds has probably an impact on\nthe dielectric response of NF-impregnated cellulose and may\nexplain the different impact of the NPs in the response of the\nsolid and liquid insulation.\nAdditionally, a change of slope appears in the dielec-\ntric losses of the three NF-impregnated specimens which\nindicates that an additional relaxation process appears in\nthose specimens. The change of slope is more noticeable\nfor the specimens impregnated with NP of concentrations\n0.3 and 0.4 g/L.\nThe dielectric constants of the cellulose specimens are\nshown in Table 3. The value of this parameter shows a great\nvariability as the impregnation liquid changes and do not fol-\nlow a consistent tendency. A signiﬁcant increase is observed\nfor the cellulose specimens impregnated with NFs with low\nconcentration of NPs (0.2 g/L), but the measured relative\npermittivity drops for the samples impregnated with liquids\nwith higher concentations of NPs reaching values closer to\nthose of the oils in the case of the NF 0.3 g/L and similar to\nthose of the MO-impregnated cellulose for the NF 0.4 g/L.\nTABLE 3. Dielectric constant (εr ) of the cellulose impregnated with MO\nor NFs at 50 Hz.\nMore research would be needed to explain the recorded\nbehaviour, but the observations are probably related with the\nrelative inﬂuence of two phenomena that occur simultane-\nously in the NP-cellulose composites. As was explained in\nsection IV-A, the NPs are polar compounds and they polarize\nin presence of an electric ﬁeld; this would contribute to\nincrease the capacitance and the relative permittivity of the\nmaterial. However, the polarized NPs cause a distortion of\nthe electrical ﬁeld that can give rise to a decrease of other\npolarization processes in the cellulose, what would diminish\nthe measured capacitance. It is likely that the ﬁrst effect\npredominates when the NPs’ content is low, but as the con-\ncentration increases the second gains more importance.\nV. CONCLUSION\nThe dielectric response of NFs and NF-impregnated solid\ninsulation has been investigated in this paper observing that\nthe presence of NP has an important impact on the per-\nmittivity and the dielectric losses both types of electrical\ninsulation.\nThe relative permittivity of solid and liquid insulation\nvary when NPs are added to both materials; for the oil,\nthe pemittivity increases consistently as the concentration of\nNPs increases. In the case of paper, the permittivity increases\nfor low concentrations of NP but larger increases in the\nconcentration of NP cause the permittivity to drop a little.\nThis is due to the fact that two physical phenomena coexists\nin the dielectric: the polarization of the NPs attached to the\ncellulose chains and the distortion of the electrical ﬁeld in the\nsolid because caused by the presence of polarized NPs. It will\nbe important to analyse the dielectric response of cellulose\nmaterials when those are impregnated with NFs based in\nsemiconductive or insulating NPs in the future. It is likely\nthat the interaction of other types of NPs with cellulose, and\ntheir impact on the dielectric response is different from the\nobservations of this work.\nThe values of the relative permittivities of the oil and\npaper insulation has a role on the distribution of the electric\nﬁeld of a transformer and are taken into account for the\ntransformer design. For the NFs to be used in real trans-\nformers in the future, studies will be needed to determine\nthe values of these parameters and probably some modiﬁ-\ncations in the design of the oil-paper insulation would be\nrequired.\nACKNOWLEDGMENT\nThe authors would like to thank Adrián Febrero for his assis-\ntance in the laboratory measures.\nREFERENCES\n[1] D. Martin, C. Beckett, J. Brown, and S. Nielsen, ‘‘Analysis and mitigation\nof Australian and New Zealand power transformer failures resulting in\nﬁres and explosions,’’ IEEE Elect. Insul. Mag., vol. 35, no. 6, pp. 7–14,\nNov. 2019.\n[2] J. Marks, D. Martin, T. Saha, O. Krause, A. Alibegovic-Memisevic,\nG. Russell, G. Buckley, S. Chinnarajan, M. Gibson, and T. MacArthur,\n‘‘An analysis of Australian power transformer failure modes, and compari-\nson with international surveys,’’ in Proc. Australas. Univ. Power Eng. Conf.\n(AUPEC), 2016, pp. 1–6.\n[3] D. Martin, J. Marks, and T. Saha, ‘‘Survey of Australian power trans-\nformer failures and retirements,’’ IEEE Elect. Insul. Mag., vol. 33, no. 5,\npp. 16–22, Sep. 2017.\n[4] M. J. Heathcote, ‘‘Basic materials,’’ in J P Transformer. Amsterdam,\nThe Netherlands: Elsevier, 2007, pp. 40–74.\n[5] V . Segal and K. Raj, ‘‘An investigation of power transformer cooling with\nmagnetic ﬂuids,’’ Indian J. Eng. Mater. Sci., vol. 5, no. 6, pp. 416–422,\n1998.\n[6] X. Wang, X. Xu, and S. U. S. Choi, ‘‘Thermal conductivity of nanoparticle–\nﬂuid mixture,’’ J. Thermophys. Heat Transf., vol. 13, no. 4, pp. 474–480,\nOct. 1999.\n[7] S. Özerinç, S. Kakaç, and A. G. Yazıcıoğlu, ‘‘Enhanced thermal conduc-\ntivity of nanoﬂuids: A state-of-the-art review,’’ Microﬂuidics Nanoﬂuidics,\nvol. 8, no. 2, pp. 145–170, Feb. 2010.\n[8] Y . Du, Y . Lv, C. Li, M. Chen, Y . Zhong, J. Zhou, X. Li, and Y . Zhou, ‘‘Effect\nof semiconductive nanoparticles on insulating performances of transformer\noil,’’ IEEE Trans. Dielectr. Electr. Insul., vol. 19, no. 3, pp. 770–776,\nJun. 2012.\n83804 VOLUME 9, 2021\nD. Pérez-Rosaet al.: Dielectric Response of Oil-Paper Insulation System in Nanofluid-Based transformers\n[9] J. Dai, M. Dong, Y . Li, J. Zhou, and F. Wen, ‘‘Inﬂuence of nanoparticle\nconcentration on the frequency domain spectroscopy properties of trans-\nformer oil-based nanoﬂuids,’’ in Proc. IEEE Conf. Electr. Insul. Dielectr.\nPhenomena (CEIDP), Oct. 2016, pp. 587–590.\n[10] V . A. Primo, B. García, J. C. Burgos, and D. Pérez-Rosa, ‘‘Investigation\nof the lightning impulse breakdown voltage of mineral oil based Fe 3O4\nnanoﬂuids,’’Coatings, vol. 9, no. 12, p. 799, Nov. 2019.\n[11] G. D. Peppas, A. Bakandritsos, V . P. Charalampakos, E. C. Pyrgioti,\nJ. Tucek, R. Zboril, and I. F. Gonos, ‘‘Ultrastable natural ester-based\nnanoﬂuids for high voltage insulation applications,’’ ACS Appl. Mater.\nInterfaces, vol. 8, no. 38, pp. 25202–25209, Sep. 2016.\n[12] F. M. O’Sullivan, ‘‘A model for the initiation and propagation of electri-\ncal streamers in transformer oil and transformer oil based nanoﬂuids,’’\nPh.D. dissertation, Dept. Electr. Eng. Comput. Sci., Massachusetts Inst.\nTechnol., Cambridge, MA, USA, 2007.\n[13] J. Kudelcik, P. Bury, P. Kopcansky, and M. Timko, ‘‘Dielectric breakdown\nin mineral oil ITO 100 based magnetic ﬂuid,’’ Phys. Procedia, vol. 9, no. 2,\npp. 78–81, 2010.\n[14] V . A. Primo, B. García, J. C. Burgos, and D. Pérez, ‘‘AC breakdown voltage\nof Fe3O4 based nanodielectric ﬂuids. Part 1: Analysis of dry ﬂuids,’’ IEEE\nTrans. Dielectr. Electr. Insul., vol. 27, no. 2, pp. 352–359, Apr. 2020.\n[15] V . A. Primo, B. Garcia, J. C. Burgos, and D. Perez, ‘‘AC breakdown voltage\nof Fe 3O4 based nanodielectric ﬂuids. Part 2: Analysis of ﬂuids with high\nmoisture content,’’ IEEE Trans. Dielectr. Electr. Insul. , vol. 27, no. 2,\npp. 360–367, Apr. 2020.\n[16] D. Pérez-Rosa, B. García, J. C. Burgos, and A. Febrero, ‘‘Morphological\nanalysis of transformer kraft paper impregnated with dielectric nanoﬂu-\nids,’’Cellulose, vol. 27, no. 15, pp. 8963–8975, Oct. 2020.\n[17] Y . Zhou, Y . X. Zhong, M. T. Chen, S. N. Zhang, Y . F. Du, Y . Z. Lv, C. Li, and\nT. Liu, ‘‘Effect of nanoparticles on electrical characteristics of transformer\noil-based nanoﬂuids impregnated pressboard,’’ in Proc. IEEE Int. Symp.\nElect. Insul., Jun. 2012, pp. 650–653.\n[18] R. Cimbala, S. Bucko, L. Kruželák, and M. Kosterec, ‘‘Thermal degrada-\ntion of transformer pressboard impregnated with magnetic nanoﬂuid based\non transformer oil,’’ in Proc. 18th Int. Sci. Conf. Electr. Power Eng. (EPE),\n2017, pp. 1–5.\n[19] S. Bucko, M. Krchnák, R. Cimbala, L. Kruželák, and J. Zbojovský, ‘‘Abra-\nsive properties of transformer oil-based magnetic nanoﬂuid,’’ in Proc. 19th\nInt. Sci. Conf. Electr. Power Eng. (EPE), 2018, pp. 1–4.\n[20] Cigré Brochure 254. Dielectric Response Methods for Diagnostics of\nPower Transformers, document TF D1.01.09, 2004.\n[21] C. Ekanayake, S. M. Gubanski, A. Graczkowski, and K. Walczak, ‘‘Fre-\nquency response of oil impregnated pressboard and paper samples for\nestimating moisture in transformer insulation,’’ IEEE Trans. Power Del.,\nvol. 21, no. 3, pp. 1309–1317, Jul. 2006.\n[22] M. Franchek and A. Levin, ‘‘Insulations R⃝DPE,’’ Transf. Mag., vol. 3,\nno. 2, 2016.\n[23] V . A. Primo, D. Pérez-Rosa, B. García, and J. C. Cabanelas, ‘‘Evaluation\nof the stability of dielectric nanoﬂuids for use in transformers under real\noperating conditions,’’ Nanomaterials, vol. 9, no. 2, p. 143, Jan. 2019.\n[24] Insulating Liquids—Oil-Impregnated Paper and Pressboard—\nDetermination of Water by Automatic Coulometric Karl Fischer Titration\nNuméro, Standard CEI/IEC 60814:1997, Commission International\nElectrotechnical, 1997.\n[25] B. X. Du, X. L. Li, and J. Li, ‘‘Thermal conductivity and dielectric charac-\nteristics of transformer oil ﬁlled with Bn and Fe 3O4 nanoparticles,’’IEEE\nTrans. Dielectr. Electr. Insul., vol. 22, no. 5, pp. 2530–2536, Oct. 2015.\n[26] G. Schwarz, ‘‘A theory of the low-frequency dielectric dispersion of col-\nloidal particles in electrolyte solution,’’ J. Phys. Chem., vol. 66, no. 12,\npp. 2636–2642, Dec. 1962.\nDANIEL PÉREZ-ROSA was born in Madrid,\nin 1989. He received the B.Sc. degree, in 2014,\nthe M.Sc. degree in chemistry from the Univer-\nsidad Complutense de Madrid, in 2014, and the\nM.Sc. degree in materials engineering from the\nUniversidad Carlos III de Madrid, Spain, in 2015,\nwhere he is currently pursuing the Ph.D. degree\nwith the Electrical Engineering Department. His\nmain interest includes development of nanodielec-\ntric ﬂuids for electrical applications.\nBELÉN GARCÍA received the B.Sc. degree,\nin 1998, the M.Sc. degree in physics from the\nUniversidad Complutense de Madrid, in 1998, and\nthe Ph.D. degree in electrical engineering from\nthe Universidad Carlos III de Madrid, in 2002.\nSince 2004, she has been holding a senior lecturer\nposition with the Electrical Engineering Depart-\nment, Universidad Carlos III de Madrid. Her main\nresearch interests include power transformer life\nmanagement and insulating materials.\nJUAN CARLOS BURGOS received the B.Sc.\ndegree, in 1980, and the Ph.D. degree from the\nEscuela Técnica Superior de Ingenieros Indus-\ntriales de Madrid, in 1987. He is currently a\nSenior Lecturer with the Universidad Carlos III de\nMadrid, Spain, where he has been working, since\n1994. His main research interest includes power\ntransformer maintenance.\nVOLUME 9, 2021 83805"
}