{
    "title": "Development of the geometrical feature extraction tool using DBSCAN clustering for toolpath generation in incremental forming",
    "url": "https://openalex.org/W3170910590",
    "year": 2021,
    "authors": [
        {
            "id": "https://openalex.org/A5028416476",
            "name": "Aniket Nagargoje",
            "affiliations": [
                "Indian Institute of Information Technology Design and Manufacturing Jabalpur"
            ]
        },
        {
            "id": "https://openalex.org/A5019041685",
            "name": "Pavan Kumar Kankar",
            "affiliations": [
                "Indian Institute of Technology Indore"
            ]
        },
        {
            "id": "https://openalex.org/A5100631333",
            "name": "Prashant K. Jain",
            "affiliations": [
                "Indian Institute of Information Technology Design and Manufacturing Jabalpur"
            ]
        },
        {
            "id": "https://openalex.org/A5078325931",
            "name": "Puneet Tandon",
            "affiliations": [
                "Indian Institute of Information Technology Design and Manufacturing Jabalpur"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2995523182",
        "https://openalex.org/W1968189173",
        "https://openalex.org/W2403549691",
        "https://openalex.org/W2770934870",
        "https://openalex.org/W1970245188",
        "https://openalex.org/W2078178448",
        "https://openalex.org/W2092506097",
        "https://openalex.org/W4239223006",
        "https://openalex.org/W2038099537",
        "https://openalex.org/W2072374998",
        "https://openalex.org/W2005541613",
        "https://openalex.org/W2169008480",
        "https://openalex.org/W1665170912",
        "https://openalex.org/W3095304131",
        "https://openalex.org/W2126751256",
        "https://openalex.org/W2740924709",
        "https://openalex.org/W1673310716",
        "https://openalex.org/W1887172757",
        "https://openalex.org/W2042830635"
    ],
    "abstract": "Abstract Incremental forming is an emerging manufacturing technique, which allows the forming of the components without product-specific dies. The process uses Computer Numerical Control (CNC) machine tools to form complicated geometries. A punch, mostly a ball end tool, follows the toolpath obtained from the 3D model of the desired geometry to deform a blank into the desired shape. The objective of the current research is to develop a geometrical feature extraction technology to generate the toolpaths for the incremental forming process. A novel geometrical feature extraction tool, developed using attribute clustering techniques is proposed here. The proposed technology extracts geometrical features from the sliced contoured data of the geometry using Density-Based Spatial Clustering of Applications with Noise (DBSCAN) clustering and convex hull algorithms. Initially, the DBSCAN clustering technique is used for parent feature extraction. Later, child features are extracted from the parent features with the help of a convex hull algorithm. This paper discusses in detail the algorithms developed to extract geometrical features. The performance of the developed algorithms is validated with three different multi-featured geometries representing different types of families like geometries with natural partitions (features are connected with edges), geometries with smoothly connected features, and free form geometries. The results show that the techniques work successfully with different complicated geometries to extract the features. The outcome of this research would help evolve a system for an automatic generation of the feature-based toolpaths for the incremental forming (and similar) processes.",
    "full_text": "Page 1/25\nDevelopment of the geometrical feature extraction\ntool using DBSCAN clustering for toolpath\ngeneration in incremental forming\nAniket Nagargoje \nPDPM Indian Institute of Information Technology, Design and Manufacturing\nPavan K. Kankar \nIndian Institute of Technology Indore\nPrashant K. Jain \nPDPM Indian Institute of Information Technology, Design and Manufacturing\nPuneet Tandon  (  ptandon@iiitdmj.ac.in )\nPDPM Indian Institute of Information Technology, Design and Manufacturing Jabalpur\nResearch Article\nKeywords: Incremental forming, Toolpath, Feature extraction, Freeform geometries, DBSCAN clustering\nPosted Date: June 3rd, 2021\nDOI: https://doi.org/10.21203/rs.3.rs-340927/v1\nLicense:     This work is licensed under a Creative Commons Attribution 4.0 International License.  \nRead Full License\nPage 2/25\nAbstract\nIncremental forming is an emerging manufacturing technique, which allows the forming of the\ncomponents without product-speci\u0000c dies. The process uses Computer Numerical Control (CNC) machine\ntools to form complicated geometries. A punch, mostly a ball end tool, follows the toolpath obtained from\nthe 3D model of the desired geometry to deform a blank into the desired shape. The objective of the\ncurrent research is to develop a geometrical feature extraction technology to generate the toolpaths for\nthe incremental forming process. A novel geometrical feature extraction tool, developed using attribute\nclustering techniques is proposed here. The proposed technology extracts geometrical features from the\nsliced contoured data of the geometry using Density-Based Spatial Clustering of Applications with Noise\n(DBSCAN) clustering and convex hull algorithms. Initially, the DBSCAN clustering technique is used for\nparent feature extraction. Later, child features are extracted from the parent features with the help of a\nconvex hull algorithm. This paper discusses in detail the algorithms developed to extract geometrical\nfeatures. The performance of the developed algorithms is validated with three different multi-featured\ngeometries representing different types of families like geometries with natural partitions (features are\nconnected with edges), geometries with smoothly connected features, and free form geometries. The\nresults show that the techniques work successfully with different complicated geometries to extract the\nfeatures. The outcome of this research would help evolve a system for an automatic generation of the\nfeature-based toolpaths for the incremental forming (and similar) processes.\n1. Introduction\nToolpath planning is vital for various manufacturing processes, including CNC milling, 3D printing, and\nIncremental Forming (IF). The procedure of toolpath development somewhat differs for these\nmanufacturing processes. Besides, for manufacturing most of the complex free form geometries, except\n3D printing, geometrical feature extraction is a critical part of the toolpath development. A variety of\nmethods are reported for geometrical feature extraction using surface mesh or a point cloud. These\nmethods are categorised into seven domains, namely, edge detection methods, region growing methods,\nattribute clustering methods, shape \u0000tting methods, model-driven methods, deep learning methods, and\nhybrid methods[1]. In another work of Babic et al. [2], the feature recognition methods were categorised in\nthe domains like syntactic pattern recognition, state transition diagrams and automata, logic (if-then)\nrules and expert systems, graph-based approach, convex-hull volumetric decomposition, cell-based\nvolumetric decomposition, hint-based approach, and hybrid approach. This paper proposes a novel\ngeometrical feature extraction tool, developed using attribute clustering techniques for toolpath\ndevelopment for IF.\nLu et al. [3] introduced a feature-based toolpath (FBT) generation method for the IF process, in which,\nunlike the constant Z-height sliced toolpath, equipotential lines based on boundary edges were generated\nand used for toolpath generation. This method was not suitable for complex parts where the number of\nboundary edges is more than two. In another work, automatic feature recognition and sequencing\nstrategy were developed by Lingam et al. [4]. In their method, feature separation and recognition steps\nPage 3/25\nwere performed using silhouette loops on the surface, followed by sequencing of features and toolpath\ngeneration. However, \u0000nding the silhouette loop involved huge complexity. Ndip-Agbor et al. [5] proposed\na new toolpath strategy for toolpath generation for multifeatured parts in case of double-sided\nincremental forming (DSIF). Their method discussed the strategies of feature separation using a contour\nrelation map and forming using a hierarchical tree structure. Behera et al. [6] had reported optimised\ntoolpath generation algorithms. They proposed a network analysis methodology using topological\nconceptual graphs to reduce geometrical inaccuracies in the formed part through toolpaths. The FBT\nstrategies mentioned above uses the Stereolithographic (STL) \u0000le format for feature extraction. However,\nthe conversion of Computer Aided Design (CAD) surfaces to STL leads to tessellation errors, which cause\nthe loss of topological or geometrical information.\nIn addition, to minimize the tessellation error (refer Fig. 1), if the number of triangular facets used for the\napproximation of the geometry is increased, the STL \u0000le size becomes large. Thus, feature extraction\nusing STL \u0000les makes the process in\u0000exible and computationally expensive, which further increases the\nlead time of the toolpath development process. Direct slicing uses the exact contours of a CAD model as\nthe input; and thus, is more precise. It eradicates the restrictions of STL and avoids tessellation errors\nassociated with the use of an STL model [7–9].\nSeveral feature extraction techniques are reported in the literature, while some of the relevant papers are\ndiscussed here. In the works of Liu et al [10], Bhandarkar and Nagi [11], and Öztürk et al. [12], the\nautomatic part feature extraction technologies were developed based on Initial Graphics Exchange\nSpeci\u0000cation (IGES), neural network approach with boundary representation and Standard for the\nExchange of Product model data (STEP) \u0000le formats respectively. Lavoué et al.[13] used the curvature\nvalues of the triangles of the surface mesh for the geometrical feature extraction using the K-means\nclustering technique. Zhang et al. [14]used the region growing method for feature extraction using mean-\nshift clustering to cluster the vertices of the mesh. Nagargoje et al.[15] evaluated the performance\nevaluation clustering techniques to identify the best technique for toolpath development and rated\nDensity-Based Spatial Clustering of Applications with Noise (DBSCAN) clustering over K-means,\nHierarchical, and Spectral clustering techniques.\nThe DBSCAN [16–18] is a density-based clustering technique in which the clusters are built based on\ndensity and connectivity of the points in the dataset. The density-based clustering techniques divide the\npoints in the dataset into three categories, namely, core points, border points, and noise or outliers. Two\nbasic input parameters, i.e., epsilon neighbourhood radius ( ε ) and the minimum number of points\n(Minpts) inside the epsilon neighbourhood radius are used to categorize the dataset. Based on the\nde\u0000nitions of the points, the clusters are formed. For more details, kindly refer to [16].\n2. Methodology\nIn this section, the algorithms developed for the geometrical feature extraction are discussed in detail.\nThe section is organised as follows: the details of the development of sliced contoured datasets are\nPage 4/25\ndiscussed at the starting of the section, this is followed by the formation of parent features using\nDBSCAN technique, and the section ends with the formation of child features using convex hull\nalgorithms.\n2.1. Development of datasets\nIn this section, the procedure for the development of the datasets is discussed. Figure 2 shows the\nprocedure for the development of the dataset.\nThe process starts with modelling of the required geometry using a CAD platform. Later, slicing of part\ngeometries is performed. Slicing is a process of contour generation due to the intersection of a plane with\nthe part geometry. In this research, the planes parallel to the Z plane are used as the intersection planes.\nThe slicing of the surface geometry results in densely connected points forming a closed contour(s). In\nthe multifeatured geometries, the number of contours for each slice would be greater than one. The\nspatial coordinates of the surface-plane intersection are extracted for further processing. Later, this\ndataset is divided into different subsets based on Z coordinate values of the points (i.e., sorting of the\npoints based on the Z coordinate value of the points). The number of subsets depends on the depth of\nthe component and the distance between two consecutive intersecting planes (step depth).\nThe steps involved in the development of datasets are shown in Fig. 3; the geometries considered here\nare shown in Step 1 and the results of slicing are shown in Step 2. The datasets used for clustering in this\nwork are point cloud data stored in the form of multiple closed contours as shown in Step 2 of Fig. 3.\nSlices at different depths, as shown in Fig. 3, are selected as the input to the DBSCAN clustering\nalgorithm. To get the insight of the slicing process, some randomly selected subsets (slices) are\nhighlighted and shown in Step 2 of Fig. 3.\n2.2. Identi\u0000cation of the Parent Features\n2.2.1. Contour Clustering by DBSCAN\nHere, the focus would be to correctly identify and segregate each contour present in a slice in the dataset\nusing the DBSCAN clustering algorithm. For the geometries, that can be formed incrementally, the\ncontours generated due to slicing are well separated in most of the cases. If at some point, the contours\nintersect or part intersection occurs, the developed contour can be formed in a single cycle. Thus, the\nintersecting contours are treated as a single feature and will not affect the toolpath generation. The\noutliers or noise, in general, does not appear in the clusters to be formed in this application.\nThe \u0000owchart for the process of contour clustering by DBSCAN is shown in Fig. 4. At the dataset\ndevelopment stage, the dataset is converted into the subset. Initially, the subset one, i.e., the \u0000rst slice, is\nchosen for the contour clustering. In the next step, the input parameters of the DBSCAN are calculated for\nthe subset one. As discussed in Sect. 1, there are two input parameters of the DBSCAN algorithm, the\nlowest possible value of minimum points is two, and the same is chosen here to avoid the merging of two\nPage 5/25\nclosely spaced contours. The maximum value of the Euclidean distance between pairs of points in the\nsubset is taken as the value of the radius of the epsilon neighbourhood. Using these input parameters, the\nDBSCAN clustering solutions are obtained for slice 1. The obtained solutions may contain single or\nmultiple clusters based on the contours available in subset 1. In the next step, each of these clusters is\nstored separately; also, the mean of the points in each cluster and area of the polygon made by points in\nthe cluster is calculated and stored for further processing. The process is repeated for all subsets (slices)\nand means, and the areas of the clusters on each slice are stored for the process of formation of the\nparent feature.\nFigure 5 shows the output of contour clustering; to get the insight of the process, one slice per dataset is\nselected randomly and shown here. The mean and area of the polygons are also highlighted. The details\nof the dataset, the input parameter of the DBSCAN, and the number of clusters identi\u0000ed for contour\nclustering are given in Table 1. It is visible that for datasets 1 and 3, the means of the clusters can be\nseparable from each other, whereas, for dataset 2, the means of the clusters cannot be distinguished\nfrom each other.\nTable 1\nDataset and input parameter information for contour clustering\nDataset information DBSCAN information\nInput parameter Output\nDataset Stepdepth\n(mm)\nSelectedslice\nno.\nTotal height /depth ofgeometry\n(mm)\nHeight /depth ofslice\n(mm)\nRadius ofneighbourhood\n( ε )\nNo. ofmin.points\n(Minpts)\nNo. ofclusters\n1 0.5 1 32 -32 0.4361 2 3\n2 0.1 113 11.3 -0.1 0.5 2 3\n3 0.5 27 30 -23 0.6513 2 4\n2.2.2. Formation of groups\nAfter the contour clustering operation is performed for each slice, the groups of contours are formed.\nThese groups are called parent features. To form the groups, the matrices of means and the polyarea are\nused. In this section, the procedure for the formation of parent features is discussed in detail.\nFigure 6 shows the \u0000owchart for the procedure of formation of parent features. The matrix of means\ncomprises the means of the multiple contours found as results of the contour clustering for each slice. In\nthe 2D space of X and Y coordinates, the mean of the contour is a parameter that represents the location\nof the contour. The contours having their means in the close neighbourhood of each other are likely to\nform a group. Thus, the DBSCAN clustering is used here to form groups based on means of contours. For\nthe groups that are not distinguishable based on the means of the clusters are separated on the basis of\nPage 6/25\nthe areas of the polygons. The logic is that the areas of the outer clusters would be greater than the areas\nof the inner clusters. After the formation of the groups based on the means, each group is scanned for\nslices with concentric clusters. If the slices with concentric clusters are present in the group, the\nseparation of the concentric clusters is performed. After the identi\u0000cation of the slices, the areas of the\nclusters on the slices are called and DBSCAN clustering applied. As the areas for the outer cluster are\ngreater than the inner ones, DBSCAN easily performs the separation process. Figure 7 shows the\nprocedure for the separation of concentric clusters.\nFigure 8 shows the plots of the means for each cluster on all the slices, where the groups of clusters are\nformed using the DBSCAN clustering of the means of the clusters. The details of the dataset, input\nparameters of the DBSCAN, and the number of clusters identi\u0000ed for group formation using means are\ngiven in Table 2.\nTable 2\nDataset and input parameter information for group formation using means\nDatasetinformation Data from contour clustering DBSCAN information\nInput parameter Output\nDataset Totalslices Min. clusterson any slice Max.\nclusters onany slice\nRadius ofneighbourhood\n( ε )\nNo. ofmin.points\n(Minpts)\nNo. ofgroupsformed\n1 65 3 3 0.5 2 3\n2 114 2 3 0.01 2 1\n3 61 1 8 0.3 2 7\nFor the geometries having convex-concave features (2nd geometry in Fig. 3), some of the slices may have\nconcentric contours. For such concentric contours, the mean of the points coincides. In such cases, it is\nimpossible to form two different groups as a convex and concave feature. Thus, the areas of the\ncontours are used for the separation of the concentric features. For the contours developed due to the\nconvex feature, the area of the contours increases with the depth of the component. Whereas, for the\nconcave feature, the area of the contours decreases with the depth of the component. The DBSCAN\nclustering is applied to separate the contours based on the area of the contours.\nFrom Fig. 8 (b), it is noticed that only 1 group is formed using the means of clusters as means of the\nclusters are coincident; whereas the maximum clusters on any slice are 3 (refer Fig. 5 (b)). This condition\noccurs when the clusters are concentric. Thus, this group must follow the step of separation of the\nconcentric clusters. Figure 9 shows the application of the DBSCAN to the areas of the polygons for\ndataset 2. From Fig. 9, it can be noticed that totally 3 sub-groups are formed. There are 114 slices in the\ngroup from slice 1 to slice 111; slice 114 consists of two clusters, whereas slices 112, and 113 have 3\nslices each.\nPage 7/25\n2.3. Identi\u0000cation of the Child Features\nAfter identi\u0000cation of the parent features, the child features of the geometries can be extracted using the\ntechnique developed with the help of convex hull of the polygon. For a given set of points in the plane, the\nconvex hull of the set is the smallest convex polygon that contains all the points of it. The output of the\nfeature extraction using the DBSCAN clustering is used as the input for the extraction of child feature.\nThe \u0000ow chart for the child feature extraction is shown in Fig. 10.\nAfter extraction of the parent feature, each parent feature is analysed separately for child feature\nextraction, and the points lying inside the convex hull of each slice are extracted. Figure 11 shows the\nprocess of application of the convex hull algorithm to polygons. After application of the convex hull\nalgorithm, the points inside the convex hull polygon are selected for further processing. The output of the\npoints inside the convex hull polygon is a single set of points and needs to be separated into distinct sets\nof points for separate child features. To separate the features, DBSCAN clustering is applied to the\nextracted points. Figure 12 shows the separate clusters after application of DBSCAN clustering to the\nextracted points, the asterisk marks are the means of clusters identi\u0000ed. This process is repeated for all\nslices of the parent feature.\nAfter the application of DBSCAN clustering to the extracted points, the clusters are formed, and the\nmeans of clusters are used to form the group. Again, the DBSCAN algorithm is applied to the means of\nclusters to form groups, these groups are child features of the parent features.\n3. Results And Discussion\nIn this section, the \u0000nal outcomes of the feature extraction using DBSCAN clustering and convex hull\nalgorithm are discussed in detail. Results of the parent feature extraction and the child feature extraction\nare discussed separately for each dataset.\n3.1. Dataset 1\n3.1.1. Extraction of the parent features\nAs discussed in Sect. 2.2, at the stage of formation of groups by the means of clusters; for dataset 1, 3\ngroups formed are as the parent features. Also, there is no need for further processing for the separation\nof concentric features. Figure 13 shows the parent features extracted from dataset 1 using DBSCAN\nclustering. The dog bone shaped feature is termed as parent feature 1, two conical features are termed as\nparent feature 2 and 3, respectively. Features 1, 2, and 3 in Fig. 13 correspond to the groups 1 (red), 2\n(black), and 3 (green) in Fig. 8 (a), respectively.\n3.1.2. Extraction of the child feature\nPage 8/25\nFigure 14 shows the application of the convex hull algorithm to the parent features of dataset 1. Here, the\nchild features are extracted from the parent feature 1 only, as for the parent features 2 and 3 do not show\nany points inside the convex hull of the polygons. Figure 15 shows the child features extracted using\nparent feature 1 for dataset 1.\n3.2. Dataset 2\n3.2.1. Formation of the parent features\nAs shown in Fig. 8 (b), at the stage of group formation using the means of clusters for dataset 2, only one\ngroup can be formed as the mean of all clusters coincides. The corresponding feature is shown in Fig. 16.\nFor these kinds of geometries, additional processing, i.e., separation of groups using the areas of clusters\nis performed. The results of the separation of the features using areas of the clusters are shown in\nFig. 17.\n3.2.2. Extraction of the child features\nFigure 18 shows the application of the convex hull algorithm to the parent features of dataset 2.  As\nshown in Figure 18 for dataset 2, child features can be extracted from all the parent features. Child\nfeatures extracted from the parent features 1, 2, and 3 for dataset 2 are shown in Figure 19, Figure 20 and\nFigure 21 respectively.\n3.3. Dataset 3\n3.3.1. Formation of the parent features\nAs shown in Fig. 8 (c), at the stage of group formation using the means of clusters for dataset 3, seven\ngroups are formed, and some noise points are also visible. The noise point represents the null group and\ndoes not form the features. The parent features formed for dataset 3 based on the means of the clusters\nare shown in Fig. 22. As there are no concentric groups formed, the groups formed here are distinct, and\nthus, termed as parent features. As the parent feature 2 consists of only 2 slices and located outside of\nthe main geometry, it is deleted and not considered for child feature extraction.\n3.3.2. Extraction of child features\nFigure 23 shows the application of the convex hull algorithm to the parent features of dataset 2.  For\ndataset 3, child features are extracted for parent features 1, 5. For the other parent feature in dataset 3,\nthe points inside the convex hull polygon are not enough to constitute a child feature. Child features\nextracted from the parent features 1 and 5 of dataset 3 are shown in Figure 24 and Figure 25 respectively.\nConclusions\nThis paper proposes a feature extraction technique for toolpath development for the incremental forming\nprocess using DBSCAN clustering and convex hull algorithms. The algorithms to extract the parent and\nPage 9/25\nchild features from sliced contoured data are developed using DBSCAN clustering and convex hull\nalgorithm, respectively. Three different multifeatured geometries are considered to check the performance\nof the developed algorithms. From the results obtained the following conclusions are drawn:\nIt was observed that the DBSCAN clustering technique works successfully for the contour clustering\napplication irrespective of the shape of the contours in the datasets.\nThe algorithms developed for feature extraction using DBSCAN and convex hull algorithms\nautomatically detect the number of geometrical features, i.e., the number of the features to extract is\nnot given as an input to the algorithm.\nThe developed process facilitates the advantage of direct slicing of the CAD models and eliminates\nthe errors arising in the toolpaths due to tessellation errors caused by STL slicing.\nThe developed methodology is suitable for the smoothly connected features (absence of natural\nboundary or edge between features) as well as for the geometries having more than two boundary\nedges.\nThe results show that the developed techniques work successfully with different types of\ncomplicated geometries that can be formed by using the IF process.\nThis technology being a novel approach to extract and represent the geometrical features in complex\ngeometries will provide \u0000exibility while developing the IF toolpaths.\nDeclarations\nFunding:\nThis research was \u0000nancially supported by Impacting Research, Innovation, and Technology (IMPRINT)\nINDIA through a Project of Government of India (Project Number: 5506). The authors wish to\nacknowledge the funding agencies.\nCon\u0000icts of interest/Competing interests:\nThere are, however, no con\u0000icts, \u0000nancial or otherwise that are related to this study or its outcome. The\nstudy staffs have no con\u0000icts of interest to report. The authors declare that they have no competing\ninterests.\nAvailability of data and material:\nAll the data and material used in the study is given in the manuscript.\nCode availability:\nThe codes are developed using MATLAB® based on the algorithms described in the manuscript.\nAuthors' contributions:\nPage 10/25\nThe work was primarily done by AN with the support of PKK and PKJ for development of algorithms for\nparent and child feature extraction respectively. PT reviewed and modi\u0000ed the developed algorithms to\nget the \u0000nal versions. AN took the lead in writing the manuscript. All authors provided critical feedback\nand helped shape the research, \u0000nding and manuscript. PKK, PKJ and PT arranged the funding. PT and\nPKJ supervised the research work.\nEthics approval:\nAll procedures performed in the work involve no human or animal participants.\nConsent to participate:\nNo external participants have contributed to the work discussed in this manuscript.\nConsent for publication:\nThe authors give their full consent to the editor to publish this article if accepted.\nReferences\n1. Cai N, Anwer N, Scott PJ et al (2020) A new partitioning process for geometrical product\nspeci\u0000cations and veri\u0000cation. Precis Eng 62:282–295.\nhttps://doi.org/10.1016/j.precisioneng.2019.12.009\n2. Babic B, Nesic N, Miljkovic Z (2008) A review of automated feature recognition with rule-based\npattern recognition. Comput Ind 59:321–337\n3. Lu B, Chen J, Ou H, Cao J (2013) Feature-based tool path generation approach for incremental sheet\nforming process. J Mater Process Technol 213:1221–1233.\nhttps://doi.org/10.1016/j.jmatprotec.2013.01.023\n4. Lingam R, Prakash O, Belk JH, Reddy N (2017) Automatic feature recognition and tool path strategies\nfor enhancing accuracy in double sided incremental forming. Int J Adv Manuf Technol 88:1639–\n1655. https://doi.org/10.1007/s00170-016-8880-1\n5. Ndip-Agbor E, Ehmann K, Cao J (2018) Automated Flexible Forming Strategy for Geometries with\nMultiple Features in Double-Sided Incremental Forming. Journal of Manufacturing Science\nEngineering Transactions of the ASME 140:. https://doi.org/10.1115/1.4038511\n\u0000. Behera AK, Lauwers B, Du\u0000ou JR (2014) Tool path generation framework for accurate manufacture\nof complex 3D sheet metal parts using single point incremental forming. Comput Ind 65:563–584.\nhttps://doi.org/10.1016/j.compind.2014.01.002\n7. Jamieson R, Hacker H (1995) Direct slicing of CAD models for rapid prototyping. Rapid Prototyping\nJournal 1:4–12. https://doi.org/10.1108/13552549510086826\n\u0000. Zhou MY, Xi JT, Yan JQ (2004) Adaptive direct slicing with non-uniform cusp heights for rapid\nprototyping. Int J Adv Manuf Technol 23:20–27. https://doi.org/10.1007/s00170-002-1523-8\nPage 11/25\n9. Sun SH, Chiang HW, Lee MI (2007) Adaptive direct slicing of a commercial CAD model for use in\nrapid prototyping. Int J Adv Manuf Technol 34:689–701. https://doi.org/10.1007/s00170-006-0651-y\n10. Liu SC, Gonzalez M, Chen JG (1996) Development of an automatic part feature extraction and\nclassi\u0000cation system taking CAD data as input. Comput Ind 29:137–150.\nhttps://doi.org/10.1016/0166-3615(95)00081-X\n11. Bhandarkar MP, Nagi R (2000) STEP-based feature extraction from STEP geometry for Agile\nManufacturing. Comput Ind 41:3–24. https://doi.org/10.1016/S0166-3615(99)00040-8\n12. Öztürk N, Öztürk F (2001) Neural network based non-standard feature recognition to integrate CAD\nand CAM. Comput Ind 45:123–135. https://doi.org/10.1016/S0166-3615(01)00090-2\n13. Lavoué G, Dupont F, Baskurt A (2005) A new CAD mesh segmentation method, based on curvature\ntensor analysis. CAD Computer Aided Design 37:975–987.\nhttps://doi.org/10.1016/j.cad.2004.09.001\n14. Zhang X, Li G, Xiong Y, He F (2008) 3D Mesh Segmentation Using Mean-Shifted Curvature. In:\nAdvances in Geometric Modeling and Processing. Springer, Berlin Heidelberg, pp 465–474\n15. Nagargoje A, Kankar PK, Jain PK, Tandon P (2020) Performance Evaluation of the Data Clustering\nTechniques and Cluster Validity Indices for E\u0000cient Toolpath Development for Incremental Sheet\nForming. J Comput Inf Sci Eng 1–32. https://doi.org/10.1115/1.4048914\n1\u0000. Ester M, Kriegel H-P, Sander J, Xu X (1996) A Density-Based Algorithm for Discovering Clusters in\nLarge Spatial Databases with Noise. In: Kdd, 34th ed. pp 226–231\n17. Sander J, Ester M, Kriegel HP, Xu X (1998) Density-based clustering in spatial databases: The\nalgorithm GDBSCAN and its applications. Data Min Knowl Disc 2:169–194.\nhttps://doi.org/10.1023/A:1009745219419\n1\u0000. Schubert E, Sander J, Ester M et al (2017) DBSCAN Revisited, Revisited. ACM Transactions on\nDatabase Systems 42:1–21. https://doi.org/10.1145/3068335\nFigures\n\nPage 12/25\nFigure 1\nTessellation error [7]\nFigure 2\nProcedure: development of the dataset\nFigure 3\nSteps in dataset development\nPage 13/25\nFigure 4\nAlgorithm for application of DBSCAN for the contour clustering\nPage 14/25\nFigure 5\nContour clustering (a) Slice 1 of Dataset 1, (b) Slice 113 of Dataset 2, (c) Slice 27 of Dataset 3\nPage 15/25\nFigure 6\nFlowchart for the procedure of formation of parent features\nPage 16/25\nFigure 7\nProcedure for separation of concentric features\nFigure 8\nFormation of groups based on the means of clusters (a) Dataset 1, (b) Dataset 2, (c) Dataset 3\nFigure 9\nSeparation of the concentric features using areas of polygons (Dataset 2)\nPage 17/25\nFigure 10\nFlowchart for the procedure of formation of child features\nPage 18/25\nFigure 11\nProcess of application of convex hull algorithm\nFigure 12\nApplication of DBSCAN to the extracted points\nPage 19/25\nFigure 13\nParent features extracted by the means of the clusters (Dataset 1)\nFigure 14\nApplication of convex hull algorithm to the parent features (Dataset 1)\nPage 20/25\nFigure 15\nChild features extracted for parent feature 1 (Dataset 1)\nFigure 16\nParent features extracted by means of the clusters (Dataset 2)\nPage 21/25\nFigure 17\nParent features extracted by areas of the clusters (Dataset 2)\nFigure 18\nApplication of convex hull algorithm to the parent features (Dataset 2)\nPage 22/25\nFigure 19\nChild features extracted for parent feature 1 (Dataset 2)\nFigure 20\nChild features extracted for parent feature 2 (Dataset 2)\nFigure 21\nChild features extracted for parent feature 1 (Dataset 2)\nPage 23/25\nFigure 22\nParent features extracted by means of the clusters (Dataset 3)\nPage 24/25\nFigure 23\nApplication of convex hull algorithm to the parent features (Dataset 3)\nFigure 24\nChild features extracted for parent feature 1 (Dataset 3)\nPage 25/25\nFigure 25\nChild features extracted for parent feature 5 (Dataset 3)"
}