{
  "title": "COVID-19 as a Research Dynamic Transformer: Emerging Cross-Disciplinary and National Characteristics",
  "url": "https://openalex.org/W3185875207",
  "year": 2021,
  "authors": [
    {
      "id": "https://openalex.org/A2289369001",
      "name": "Ryosuke L. Ohniwa",
      "affiliations": [
        "National Taiwan University",
        "University of Tsukuba"
      ]
    },
    {
      "id": "https://openalex.org/A2175972303",
      "name": "Joji Kijima",
      "affiliations": [
        "University of Tsukuba"
      ]
    },
    {
      "id": "https://openalex.org/A2671886405",
      "name": "Mizuho Fukushige",
      "affiliations": [
        "University of Tsukuba"
      ]
    },
    {
      "id": "https://openalex.org/A130455233",
      "name": "Osamu Ohneda",
      "affiliations": [
        "University of Tsukuba"
      ]
    },
    {
      "id": "https://openalex.org/A2289369001",
      "name": "Ryosuke L. Ohniwa",
      "affiliations": [
        "Development Center for Biotechnology",
        "National Taiwan University",
        "University of Tsukuba"
      ]
    },
    {
      "id": "https://openalex.org/A2175972303",
      "name": "Joji Kijima",
      "affiliations": [
        "University of Tsukuba"
      ]
    },
    {
      "id": "https://openalex.org/A2671886405",
      "name": "Mizuho Fukushige",
      "affiliations": [
        "University of Tsukuba"
      ]
    },
    {
      "id": "https://openalex.org/A130455233",
      "name": "Osamu Ohneda",
      "affiliations": [
        "University of Tsukuba"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1502432690",
    "https://openalex.org/W90362830",
    "https://openalex.org/W2049941951",
    "https://openalex.org/W1968393246",
    "https://openalex.org/W4245774281",
    "https://openalex.org/W2610356532",
    "https://openalex.org/W2622319725",
    "https://openalex.org/W3006290567",
    "https://openalex.org/W2050194858",
    "https://openalex.org/W1624360235",
    "https://openalex.org/W6603694148",
    "https://openalex.org/W4247440588",
    "https://openalex.org/W2980107785",
    "https://openalex.org/W2062908258",
    "https://openalex.org/W2071721961",
    "https://openalex.org/W3124680412",
    "https://openalex.org/W3010699833",
    "https://openalex.org/W2789928592",
    "https://openalex.org/W2093179710",
    "https://openalex.org/W2102187991",
    "https://openalex.org/W3010466793",
    "https://openalex.org/W2117730239",
    "https://openalex.org/W1970991549",
    "https://openalex.org/W2063993968"
  ],
  "abstract": "The outbreak of the COVID-19 pandemic has had an unprecedented impact on humanity as well as research activities in life sciences and medicine. Between January and August 2020, the number of coronavirus-related scientific articles was roughly 50 times more than that of articles published in the entire year of 2019 in PubMed. It is necessary to better understand the dynamics of research on COVID-19, an emerging topic, and suggest ways to understand and improve the quality of research. We analyze the dynamics of coronavirus research before and after the outbreaks of SARS, MERS, and COVID-19 by examining all the published articles from the past 25 years in PubMed. We delineate research networks on coronaviruses as we identify experts’ background in terms of topics of previous research, affiliations, and international co-authorships. Two distinct dynamics of coronavirus research were found: 1) in the cases of regional pandemics, SARS and MERS, the scope of cross-disciplinary research remained between neighboring research areas; 2) in the case of the global pandemic, COVID-19, research activities have spread beyond neighboring disciplines with little transnational collaboration. Thus, COVID-19 has transformed the structure of research on coronaviruses as an emerging issue. Knowledge on COVID-19 is distributed across the widest range of disciplines, transforming research networks well beyond the field of medicine but within national boundaries. Given the unprecedented scale of COVID-19 and the nationalization of responses, the most likely way forward is to accumulate local knowledge with the awareness of transdisciplinary research dynamics.",
  "full_text": "COVID-19 as a Research Dynamic\nTransformer: Emerging\nCross-Disciplinary and National\nCharacteristics\nRyosuke L. Ohniwa1,2*†, Joji Kijima3†, Mizuho Fukushige1 and Osamu Ohneda1\n1Faculty of Medicine, University of Tsukuba, Tsukuba, Japan,2Center for Biotechnology, National Taiwan University, Taipei,\nTaiwan, 3Bureau of Global Initiatives, University of Tsukuba, Tsukuba, Japan\nThe outbreak of the COVID-19 pandemic has had an unprecedented impact on humanity as\nwell as research activities in life sciences and medicine. Between January and August 2020,\nthe number of coronavirus-related scientiﬁc articles was roughly 50 times more than that of\narticles published in the entire year of 2019 in PubMed. It is necessary to better understand the\ndynamics of research on COVID-19, an emerging topic, and suggestways to understand and\nimprove the quality of research. We analyze the dynamics of coronavirus research before and\nafter the outbreaks of SARS, MERS, and COVID-19 by examining all the published articles\nfrom the past 25 years in PubMed. We delineate research networks on coronaviruses as we\nidentify experts’ background in terms of topics of previous research, afﬁliations, and\ninternational co-authorships. Two distinct dynamics of coronavirus research were found: 1)\nin the cases of regional pandemics, SARS and MERS, the scope of cross-disciplinary research\nremained between neighboring research areas; 2) in the case of the global pandemic, COVID-\n19, research activities have spread beyond neighboring disciplines with little transnational\ncollaboration. Thus, COVID-19 has transformed the structure of research on coronaviruses as\nan emerging issue. Knowledge on COVID-19 is distributed across the widest range of\ndisciplines, transforming research networks well beyond theﬁeld of medicine but within\nnational boundaries. Given the unprecedentedscale of COVID-19 and the nationalization of\nresponses, the most likely way forward is to accumulate local knowledge with the awareness\nof transdisciplinary research dynamics.\nKeywords: COVID-19, coronavirus research, researcher dynamics, PubMed, scientometrics\nINTRODUCTION\nCOVID-19 [SARS-CoV-2 (severe acute respiratory syndrome coronavirus 2)]— since ﬁrst reported\nin Wuhan, China, in December 2019— has spread around the globe with more than 172 million\nconﬁrmed cases and more than three million deaths from December 2019 to June 2021(WHO 2021).\nEarlier in this century, the world was also plagued by the outbreaks of SARS [SARS-CoV (severe\nacute respiratory syndrome coronavirus)] — originating from Guangdong Province, China, in\nNovember 2002 (Rosling and Rosling, 2003;Xu et al., 2004)— and MERS [MERS-CoV (Middle\nEast respiratory syndrome coronavirus)] that emerged in March 2012 (Hijawi et al., 2013;Cauchemez\net al., 2014). In the 21st century, coronaviruses have become the root causes of emerging infectious\ndiseases in the world (Guarner, 2020;Wang et al., 2020).\nEdited by:\nReza Lashgari, ShahidBeheshti\nUniversity, Iran\nReviewed by:\nGregory R. Hart, Yale University,\nUnited States\nSohrabNajaﬁan,\nSUNY College of Optometry,\nUnited States\nMahdi Mahdavi,\nShahidBeheshti University of Medical\nSciences, Iran\n*Correspondence:\nRyosuke L. Ohniwa\nohniwa@md.tsukuba.ac.jp\n†These authors have contributed\nequally to this work\nSpecialty section:\nThis article was submitted to\nMedicine and Public Health,\na section of the journal\nFrontiers in Big Data\nReceived: 19 November 2020\nAccepted: 21 June 2021\nPublished: 26 July 2021\nCitation:\nOhniwa RL, Kijima J, Fukushige M and\nOhneda O (2021) COVID-19 as a\nResearch Dynamic Transformer:\nEmerging Cross-Disciplinary and\nNational Characteristics.\nFront. Big Data 4:631073.\ndoi: 10.3389/fdata.2021.631073\nFrontiers in Big Data | www.frontiersin.org July 2021 | Volume 4 | Article 6310731\nBRIEF RESEARCH REPORT\npublished: 26 July 2021\ndoi: 10.3389/fdata.2021.631073\nMeanwhile, the number of scienti ﬁc research articles on\ncoronaviruses in the ﬁelds of life sciences and medicine has\nincreased dramatically (Figure 1). In the case of SARS-CoV,\nthe number of publications increasedﬁvefold by 2003— in just\none year after the outbreak. In the case of MERS-CoV, the\nnumber increased steadily from the year after the outbreak in\n2012 and doubled by 2015. In the case of SARS-CoV2, the\nnumber of research articles published between January 2020\nand August 2020 was 50 times more than the number of\nscientiﬁc publications on coronaviruses in the entire year of\n2019 (see Results). Indeed, coronaviruses have become an\nemerging research topic as a result (Rotolo et al., 2015).\nIt has been shown by bibliometric and sociological studies that\nresearchers tend to publish articles on topics outside of their own\narea of expertise and begin diversifying their publications once\ncertain topics— such as new technologies and concepts — are\nrecognized as something scientiﬁcally valuable in the forthcoming\nfuture. That is how the corresponding topics become“emerging”\n(Van Merkerk and Van Lente, 2005;Borup et al., 2006;Gustafsson\net al., 2015). At the same time, the rapid growth of publications\nmakes these emerging topics the foci of cross-disciplinary studies\n(Rotolo et al., 2015). However, more studies are needed to adequately\nunderstand the relationship between emerging topics— such as\ninfectious diseases— and the scope of cross-disciplinary research.\nThis study aimed toﬁll part of that gap in the literature on the\nrelationship between the emerging topics.\nIn this study, we analyze the Medical Subject Headings\n(MeSH) attached to PubMed (Medline) articles to identify the\nresearch topics and specialties of each researcher. PubMed\n(Medline), a literature database search engine run by the\nNational Library of Medicine (NLM), contains approximately\n10 million articles. MeSH is a popular keyword thesaurus\ndeveloped by NLM, and it is typically used in PubMed to\nsupport literature searches (Lipscomb, 2000). It is attached to\neach article under the supervision of professional curators\naccording to article contents (Lowe and Barnett, 1994). We\nhave developed a method to identify emerging topics as\nclusters of emerging MeSH terms (Ohniwa et al., 2010;Ohniwa\nand Hibino, 2019). For the present study, we have modiﬁed this\nmethod to identify the characteristics of research topics and areas\nof expertise by selecting unique MeSH terms instead of those\nemerging (see Materials and Methods).\nWe investigate all the articles in PubMed between 1996 and\n2020 to elucidate the following: 1) trends in coronavirus research\nbefore and after the outbreaks of the novel coronavirus infectious\ndiseases— namely, SARS, MERS, and COVID-19— in terms of\ntheir impact on the nature of research; 2) the dynamics of how\nresearchers venture across disciplinary boundaries to tackle\nemerging topics in times of crises by identifying their areas of\nresearch prior to the outbreaks and their countries of origin; and\n3) the relational mechanism between cross-disciplinary research\nand transnational collaboration on coronaviruses. The results\nindicate the current COVID-19 pandemic has transformed\ncoronavirus research into a nationalized body of knowledge\nacross a wider range of disciplines. Finally, we suggest the\nmost likely way forward for coronavirus research and draw an\nimplication from the transformation of research dynamics based\non the concepts of “transdisciplinarity (Stenner, 2017)” and\n“event (Whitehead, 1925)”.\nMATERIALS AND METHODS\nDataset\nMeSH terms attached to articles published between 1996 and\n2020 were collected through PubMed (https://www.ncbi.nlm.nih.\ngov/pubmed/) on August 17th, 2020. A total of 21,706,508 articles\nwere included in the analysis.\nMeSH terms attached on each article were identiﬁed from the\nXML data, and any overlaps in terms for each article were\neliminated by our original Perl scripts as described in our\nprevious articles ( Ohniwa et al., 2010 ;Ohniwa and Hibino,\n2019). Here, to identify the set of MeSH terms attached to\neach article, terms tagged as <DescriptorNameUI /equals@> and\n<NameOfSubstance UI /equals@> from the XML data (@\nrepresents each UI) were extracted, and then overlaps in the\nterms for each article were eliminated by Perl with our original\nscripts. Then, to eliminate the terms not concerned with research\nFIGURE 1 |Number of articles on coronaviruses published in PubMed. The number of articles was counted on Aug 17th, 2020.“All articles” represents the total\nnumber of articles found in PubMed as published in each year (the scale is shown in the leftx axis). “Coronavirus-related articles” represents the total number of articles\nfound by the query of“coronavirus OR COVID-19 OR SARS-CoV OR MERS-CoV” (the scale is shown in the rightx axis).\nFrontiers in Big Data | www.frontiersin.org July 2021 | Volume 4 | Article 6310732\nOhniwa et al. COVID-19 and Researcher Dynamics\ntopics, all the MeSH terms under the following hierarchies were\nexcluded: “Geographicals [Z], ”“Publication Characteristics\n[V],”“Named Groups [M], ”“Health Care [N], ”“Information\nServices [L01.453], ”“Communications Media\n[L01.178],”“Communication [L01.143], ”“Information Centers\n[L01.346],” and “Publishing [L01.737]” according to the 2018\nMeSH Tree Hierarchy (https://meshb-prev.nlm.nih.gov/search).\nThese categories involve MeSH terms which represent the style or\nthe background of articles rather than its research contents. A\ntotal of 1,776,759 kinds of terms with a total of 957,790,657\noccurrences were obtained between 1996 and 2020 by this\noperation.\nTo identify the sets of authors and afﬁliations attached to each\narticle, terms tagged as <AfﬁliationInfo>, <LastName>, and\n<Initials> within <Author ValidYN /equals@> (@ represents each\n“Yo rN ”) were extracted by our original Perl script. A total of\n42,923,027 kinds of authors (with afﬁliation) with a total of\n56,467,393 occurrences were obtained by this operation (in the\ncase of only author name, a total of 7,395,577 kinds of authors\nwith a total of 108,977,113 occurrences).\nCoronavirus-related articles published between 1996 and 2020\nwere separately obtained by searching PubMed using the query\nterms of“coronavirus OR COVID-19 OR SARS-CoV OR MERS-\nCoV.” A total of 56,077 articles and 66,850 kinds of MeSH terms\nwith a total of 1,739,841 occurrences were obtained between 1996\nand 2020 by this operation. From these articles, a total of 252,292\nkinds of authors (with af ﬁliations) with a total of 273,759\noccurrences were obtained (in the case of using only authors’\nnames, a total of 157,593 kinds of authors with a total of 337,946\noccurrences).\nCountries of Origin\nThe number of articles having the following words in the afﬁliation\nwas counted: “Argentina”, “Australia”, “Austria”,\n“Belgium”, “Brazil”, “Bulgaria”, “Canada”, “Chile”, “China (‘China’\nor ‘People’sR e p u b l i co fC h i n a’)”, “Croatia”,\n“Czech Republic ”, “Denmark”, “Egypt”,\n“Finland”, “France”, “Germany”, “Greece”, “HongKong”,\n“Hungary”, “India”, “Iran”, “Ireland”, “Israel”,\n“Italy”, “Japan”, “Korea”, “Malaysia”, “Mexico”, “Netherlands”,\n“New Zealand ”, “Norway”, “Pakistan”, “Poland”,\n“Portugal”, “Romania”, “Russia”, “Saudi Arabia”, “Singapore”,\n“Slovakia”, “Slovenia”, “South Africa ”, “Spain”, “Sweden”,\n“Switzerland”, “Taiwan ( ‘Taiwan’ or ‘Republic of China ’)”,\n“Thailand”, “Turkey”, “Ukraine”, “United Arab Emirates (‘UAE’\nor ‘United Arab Emirates’)”, “United Kingdom (‘England’, ‘U.K’,\n‘UK’, ‘United Kingdom’, ‘Scotland’)”,a n d“United States (‘USA’or\n‘United States’)”.\nUnique Keywords\nAmong MeSH terms, we arbitrary deﬁned unique keywords to\ncoronavirus research as follows:\n(Aα in βC/Bβ)/(Cα in β/Dβ)≥ 2,\nwhere Aα in β is the number of appearances of the MeSH termα in\nyears β found in coronavirus-related articles, Bβ is the total\nnumber of the coronavirus-related articles in yearsβ,C α in β is\nthe number of appearances of the MeSH termα in years β in\nPubMed, and Dβ is the total number of articles counted in yearsβ\nin PubMed. The terms whose rates were more than 2 were deﬁned\nas unique keywords. A total of 13,125 kinds of MeSH terms as\nunique keywords with a total of 1,739,841 occurrences were\ncollected between 1996 and 2020.\nCo-Word Analysis With Unique Keywords\nTop 50 most frequently occurring unique keywords were\ncollected for each period, and they were examined whether\nthey coappeared in the same article. The coappearance was\nexamined by using Perl with our original scripts. The\ncoappearance of the keywords was visualized using Pajek\nsoftware (Batagelj and Mrvar, 2002). To eliminate any weak\nrelation among keywords, the threshold for making edges was\nset at 10% of the number of keywords (selecting smaller sized\nnodes) linked by the edges, according to the clusters appeared in\nthe networks visualized by Pajek.\nRESULTS\nThe number of articles covering coronaviruses in theﬁelds of life\nsciences and medicine rapidly increased in 2003 and decreased\nuntil 2011, and it increased again in 2015 and decreased until\n2018 (Figure 1). From Jan 1st, 2020 to Aug 17th, 2020, the\nnumber reached 42,647, which is approximately 50 times more\nthan the number, 831 articles, in 2019. This tendency coincided\nwith the emergence of coronavirus infectious diseases such as the\nemergence of SARS in November 2002 (Xu et al., 2004), MERS in\nNovember 2012 (Hijawi et al., 2013;Cauchemez et al., 2014), and\nCOVID-19 in 2019. Once the diseases emerged, research on\ncoronaviruses was rapidly activated and sustained for a few\nyears. In the case of COVID-19, compared with SARS and\nMERS, the increment rate of the related articles was huge.\nCoronavirus has become an emerging research topic as a\nresult (Rotolo et al., 2015).\nBy Topic: Cross-Disciplinary\nConsequences and the Scope of Impact\nRegarding their impact on research contents, this study identiﬁed\nunique keywords which represented the characteristics of\ncoronavirus research before and after the outbreaks of SARS,\nMERS, and COVID-19. Since the collection of frequently\nappeared MeSH terms by itself did not reveal the unique\ncharacteristics of the research contents owing to their\ngenerality of use in numerous articles (Ohniwa et al., 2010),\nunique keywords from coronavirus research in a particular year\nwere selected. These unique keywords deﬁned as MeSH terms in\ncoronavirus-related articles had the appearance rate that was at\nleast twice as high as their appearance rate in all articles of the\nyear (see Materials and Methods). This operation helped identify\nrepresentative terms such as “SARS Virus” between 2003 and\n2006 and “Middle East Respiratory Syndrome Coronavirus ”\nbetween 2013 and 2016 as top 25 frequently appeared unique\nFrontiers in Big Data | www.frontiersin.org July 2021 | Volume 4 | Article 6310733\nOhniwa et al. COVID-19 and Researcher Dynamics\nTABLE 1 |Top 25 unique keywords in coronavirus research articles.\n1996–2002 2003 –2006 2007 –2012 2013 –2016 2017 –2019 2020 Jan –Aug\nNumber of articles 1,189 3,180 3,083 3,427 2,551 42,647\nViruses 1,113 2,646 2,631 2,705 1908 15,166\nRNA viruses 1,100 2,611 2,547 2,596 1828 15,154\nNidovirales 1,058 2,533 2,349 2,422 1705 15,129\nCoronaviridae 1,051 2,529 2,337 2,408 1,697 15,129\nCoronavirus 1,046 2,508 2,311 2,336 1,682 15,126\nProteins 706 1742 910\nInfections 655 2092 1894 2,383 1707 17,959\nVirus diseases 638 2041 1777 2,259 1,630 17,939\nRNA virus infections 602 1960 1,608 2,103 1,506 17,929\nNidovirales infections 567 1901 1,473 1972 1,412 17,914\nCoronaviridae infections 565 1899 1,463 1963 1,410 17,914\nCoronavirus infections 551 1884 1,436 1912 1,406 17,912\nCells 534 1,039\nGenetic phenomena 518 1,214 708\nBetacoronavirus 506 1963 1,270 1,028 715 14,995\nRodentia 491\nMuridae 490\nMurinae 471\nMice 459 550\nAnimal diseases 446 432 838 1,006 898\nHepatitis viruses 414 212 301 132 59\nBiochemical phenomena 412 1,035\nMurine hepatitis virus 408 191 265 103 45 6\nCells, cultured 379 625 784 478 423\nNucleic acids, nucleotides, and nucleosides 369 704 698 494 342\nGenetic techniques 352 860 939 782 513 805\nViral proteins 343 913 1,064 705 502 507\nGenetic structures 333 624 599 442 290\nNucleic acids 327 590 595 409 298\nMolecular structure 322 732 737 456 258\nBlood proteins 290 570 497 385 309 919\nArtiodactyla 280 286 601 603\nMicrobiological phenomena 264 412 680 684 534 734\nViral structural proteins 258 653 673 438 343 359\nAlphacoronavirus 230 196 432 525 539 49\nVirus physiological phenomena 189 345 534 488 354 481\nSwine 160 67 174 375 459\nRespiratory tract infections 81 1,591 866 659 322 17,774\nDisease outbreaks 39 404 199 389 277 17,576\nPneumonia 8 53 47 74 33 17,732\nPneumonia, viral 4 21 24 52 22 17,719\nSARS virus 1 1743 926 301 115 576\nSevere acute respiratory syndrome 1 1,465 569 230 77 393\nRespiratory tract diseases 1,617 911 696 346 17,785\nAmino acids, peptides, and proteins 1756 930\nBiological phenomena 542 677 521\nMiddle East respiratory syndrome coronavirus 625 500 165\nHealth care quality, access, and evaluation 587 7,365\nEukaryota 17,968\nAnimals 17,967\nVertebrates 17,947\nChordata 17,947\nMammals 17,939\nEutheria 17,938\nPrimates 17,845\nHaplorhini 17,843\nCatarrhini 17,842\nHominidae 17,813\nHumans 17,812\nEnvironment and public health 17,778\nPublic health 17,773\nLung diseases 17,741\nItalic numbers represent the number of appearances of keywords ranked in top 25. We sorted the order based on the total number in“1996–2002.”\nFrontiers in Big Data | www.frontiersin.org July 2021 | Volume 4 | Article 6310734\nOhniwa et al. COVID-19 and Researcher Dynamics\nkeywords (Table 1). Keywords related to“biological classiﬁcation\nof coronaviruses, ”“infection matters of coronaviruses, ” and\n“respiratory tract issues [respiratory tract is the target infection\nsite for coronaviruses as well as the site where its major symptom\nappears (Channappanavar and Perlman, 2017;Singhal, 2020)]”\nwere commonly used between 1996 and 2020— consistent with\nthe collection of unique keywords from coronavirus-related\narticles in this study. Keywords related to“components of the\nvirus” and “biological aspect” were found in all of the years except\nfor 2020, while others such as“public health” and “human” began\nto appear in 2020. When the list was expanded to top 50\nfrequently appeared unique keywords, this tendency was even\nstrengthened (Supplementary Table S1 ). In the meantime,\nconventional keywords such as“immunology” were still found\nin all of the years. In addition to the fact that these top 50\nkeywords frequently coappeared in the coronavirus-related\narticles (Supplementary Figures S1 – S6), the results of this\ninvestigation suggest the following: 1) the regional outbreaks\nof SARS and MERS did not change the cross-disciplinary\nresearch trends that had existed before the outbreaks as\nkeywords fell well within the scope of existing well-connected\nnetworks for coronavirus research focusing on the topics which\nTABLE 2 |Top 25 unique keywords used by newly entered researchers in the past.\nMeSH 1998 –2002\nAuthor in\n2003–2006\n2008–2012\nAuthor in\n2013–2016\n2015–2020\nAuthor in\n2020\nMeSH 1998 –2002\nAuthor in\n2003–2006\n2008–2012\nAuthor in\n2013–2016\n2015–2020\nAuthor in\n2020\nNumber of articles 70 681 49,798 Number of articles 70 681 49,798\nInfections 28 176 History 5 69\nGenetic phenomena 25 Animal diseases 5 46\nInformation science 20 History, Modern 1601- 4 58\nBacterial infections and\nmycoses\n16 44 Respiratory tract infections 3 50 963\nNucleic acids, nucleotides,\nand nucleosides\n16 Orthomyxoviridae 3 47 373\nGenetic structures 16 Inﬂuenza A virus 3 47 321\nGenetic techniques 16 Inﬂuenza A virus 3 47 319\nNucleic acids 16 Organizations 3 41 1,145\nBacteria 15 Antiviral agents 3 15 624\nGenome 15 Orthomyxoviridae infections 2 50 427\nBiological science\ndisciplines\n15 Inﬂuenza, human 2 42 355\nNatural science disciplines 15 United Kingdom 2 1,265\nViruses 14 100 2079 Social sciences 162\nBacterial infections 14 42 Health care economics and\norganizations\n96\nMolecular structure 13 Social control, formal 70\nInformation services 12 Respiratory tract diseases 64\nVirus diseases 11 126 2,903 Medicine 56\nImmunologic techniques 11 Philosophy 43\nGenome components 11 Communications media 43\nBiology 11 Physicians 18 756\nBlood proteins 11 Flaviviridae infections 7 625\nGenes 10 Survival analysis 1,658\nSociology 9 113 Mortality 1,522\nSocial problems 9 41 Health planning 1,436\nWarfare and armed\nconﬂicts\n9 3 National health programs 912\nWarfare 9 3 State medicine 835\nMolecular sequence data 9 Survival rate 774\nComputational biology 9 Urologic surgical\nprocedures\n744\nHemic and immune\nsystems\n9 Guidelines as topic 678\nProteobacteria 9 Controlled clinical trials as\ntopic\n659\nGram-negative bacteria 9 Randomized controlled\ntrials as topic\n651\nDocumentation 9 Registries 647\nBase sequence 9 Radiotherapy 641\nRNA viruses 8 88 1,571 Prostatic diseases 594\nRNA virus infections 7 110 2,261 Practice guidelines as topic 589\nHumanities 6 141\nProportional hazard models 580\nItalic numbers represent the number of appearances of keywords ranked in top 25. We sorted the order based on the total number in“1998–2002 author in 2003–2006.”\nFrontiers in Big Data | www.frontiersin.org July 2021 | Volume 4 | Article 6310735\nOhniwa et al. COVID-19 and Researcher Dynamics\nhad been constantly studied regardless of the outbreaks; 2) the\nglobal outbreak of COVD-19, on the other hand, initially had a\ndiversifying impact on the existing research trend as newly\nemerged keywords formed unconnected research networks\nacross different disciplines, including areas of research such as\njurisprudence and public policy.\nBy Author: Identifying Converted Experts\nThe increase in the number of coronavirus-related articles\nafter the outbreaks of SARS, MERS, and COVID-19 was largely\ndue to the entry of new researchers (Supplementary Table S2).\nFor example, between 2015 and 2019, a total of 24,745 authors\nwith speciﬁca fﬁliations were identiﬁed in coronavirus-related\narticles. Their names with the same afﬁliations were found in\nonly 369 out of 39,804 (0.9%) coronavirus-related articles in\n2020. In the case of SARS, the authors of publications between\n1998 and 2002 accounted for 23 out of 2,805 (0.8%) published\narticles on coronavirus between 2003 and 2006. In the case of\nMERS, the authors from the years between 2008 and 2012\noccupied 123 out of 3,052 (4.0%) coronavirus-related articles\npublished between 2013 and 2016. As a reference, we also\nanalyzed the case of“Inﬂuenza, ” resulting in a higher rate of\noccupation [the authors from the years between 2014 and 2018\noccupied 1,364 out of 5,542 in ﬂuenza-related articles\npublished in 2019 (24.6%)]. Here, because not all afﬁliations\nwere attached to the authors in PubMed before 2014\n(Supplementary Table S3 ), the authors regardless of their\nafﬁliations were counted in (Supplementary Table S4 ). The\nrisk of counting different authors as the same authors had to be\ntaken. In any case, the results of this investigation show that\nmost of these converted experts were conducting their\ncoronavirus research on a temporary basis as they did not\ncontinue publishing on coronaviruses after new outbreaks.\nThis study then examined unique keywords used by the\nnewcomers to coronavirus research from the past 5 years\n(searched by their names with afﬁliations). Those listed as top 25\nFIGURE 2 |Networks of Top 50 unique keywords used by newcomers to coronavirus research.(A) The networks of top 50 unique keywords in 1998– 2002, which\nwere used by those researchers who converted to coronavirus research in 2003– 2006. (B) The networks of top 50 unique keywords in 2008– 2012, which were used by\nthose who started coronavirus research in 2013– 2016. (C) The networks of top 50 unique keywords in 2015– 2019, which were used by those who converted to\ncoronavirus research in 2020. The node colors represent theﬁelds related to the keywords (green: virus and its infection; light green: molecular biology,\nmicrobiology, and immunology; orange: health care and policy; light orange: humanity and social issues; blue: epidemiology; gray: other issues). The threshold for\nmaking edges was set at 10% of the number of keywords (selecting smaller sized nodes) linked by the edges.\nFrontiers in Big Data | www.frontiersin.org July 2021 | Volume 4 | Article 6310736\nOhniwa et al. COVID-19 and Researcher Dynamics\nfrequently appeared unique keywords used by the newly entered\nresearchers (Table 2) did not largely overlap with those of\ncoronavirus research between 1996 and 2020 (Table 1)( 1 1o u t\nof 72 keywords). This tendencydid not change when we compared\nthem with top 50 frequently appeared unique keywords\n(Supplementary TablesS1, S5) .T h u s ,i ti sl i k e l yt h a ts u c hn e w\nresearchers came from different disciplines.\nAfter the outbreak of SARS, experts on“infection of RNA viruses\nand bacteria especially in theﬁelds of immunology, molecular\nbiology, bioinformatics, and/or sociology” began to take part in\ncoronavirus studies (Figure 2A). In the case of MERS, many RNA\nvirus researchers handling“inﬂuenza virus infection” and “HIV\ninfection” as well as experts on “health-care issues” joined in\n(Figure 2B). In the case of COVID-19, it attracted experts on the\n“hepatitis virus” and “mycobacterium” (Figure 2C).\nFurthermore, for COVID-19, many converted experts had no\nbackground in the research on“RNA virus and infection.” They\nconsequently formed a separate scientiﬁc network apart from those\nwith their background in“RNA viruses and infections” in the\nbeginning. They started from forming networks with those with\ntheir background in“urology and prostate,”“diagnosis of digestive\nsystem,”“clinical trial, ” or “health care and guide line\nplanning,”“jurisprudence,”“public policy,” and others. Such outside-\nin networking, due to the wide disciplinary base of the network, was one\nof the characteristics of COVID-19 research dynamics in the beginning.\nBy Nationality: The Prioritization of National\nContingencies as an International Trend\nOnce a novel infectious disease emerges in a certain country,\nscientiﬁc publications on the disease increase in the\ncorresponding country ( Table 3 and Supplementary Table\nS6). The United States and Germany have always been ranked\namong top 10 countries frequently publishing coronavirus\narticles, regardless of contingencies involving novel\ncoronaviruses— suggesting that these countries have been the\nleaders of coronavirus research over the past 25 years. China\nbecame the No. 2 country after the SARS outbreak in November\n2002 in China. Taiwan, Hong Kong, Singapore, and Canada— the\ncountries and regions that prevailed after being hit hard by SARS\nin 2003 ( Chan-Yeung and Xu, 2003 ; Wallinga and Teunis,\n2004)— were also in top 10 between 2003 and 2006. In the\ncase of the MERS outbreak in November 2012, Saudi Arabia\nwas ranked among top 10 as one of the major countries that\novercame the epidemic. Korea was also ranked among top 10\ncountries between 2013 and 2016, quite possibly due to the\noutbreak of the MERS epidemic in Korea in 2015 (Chen et al.,\n2017). With regard to the case of COVID-19, the exponential\nincrease in the number of scientiﬁc publications originating from\nall the countries examined in this article suggests its impact on a\nglobal scale. It was also found that many researchers converted to\nthe ﬁeld of coronavirus studies after the outbreaks of infectious\ndiseases (Supplementary Table S7). Accordingly, the outbreaks\nof novel coronavirus diseases accelerate coronavirus research\nactivities in the affected countries by attracting new researchers.\nThe proportion of internationally co-authored articles on\ncoronaviruses to all the coronavirus-related articles among the\ncountries listed in Supplementary Table S6 was 0.22–0.26\nbetween 2016 and 2019 (Supplementary Table S8). This rate\nwas higher than that of all the internationally co-authored articles\nduring the same period (0.16–0.18). Thus, compared with the\naverage collaboration ratio of articles, a higher rate of\ntransnational collaboration was present for coronavirus\nresearch. In contrast, in 2020 after the outbreak of COVID-19,\nthe rate of internationally co-authored coronavirus articles was\n0.16. This was lower than the rate of all the international research\narticles published in the same year (0.19). In this way,\ntransnational collaboration on coronavirus research as\nTABLE 3 |Top 10 countries for coronavirus articles in each period.\n1996–2002 2003 –2006 2007 –2012 2013 –2016 2017 –2019 2020 Jan –Aug\nUnited States 1 1 1 1 2 1\nJapan 2 8 4 7 6\nCanada 3 6 6 5 6\nGermany 4 5 7 3 4 7\nSpain 5 9 8\nFrance 6 10 4 7 5\nItaly 7 9 8 9 3\nSwitzerland 8\nSingapore 9 7\nAustralia 10 10 9 9\nBelgium 10\nUnited Kingdom 10 10\nKorea 88\nTaiwan 4 5 10\nChina 2 2 2 1 2\nHong Kong 3 3 6\nIndia 4\nSaudi Arabia 53\nEgypt 10\nThe value in each column represents the ranking for the number of articles published from the corresponding country in each period. We sorted the orderbased on the total number in\n“1996–2002.”\nFrontiers in Big Data | www.frontiersin.org July 2021 | Volume 4 | Article 6310737\nOhniwa et al. COVID-19 and Researcher Dynamics\nindicated in the rate of international co-authorships has\ndecreased since the outbreak of COVID-19.\nDISCUSSION\nThis study investigated the dynamics of research on COVID-19\n(SARS-CoV-2) by comparing it to the previous cases of SARS (SARS-\nCoV) and MERS (MERS-CoV). Results show two different modes of\nresearch dynamics with regard to the scale of social impact as follows:\n1) in the cases of two regional pandemics, SARS and MERS, the scope\nof cross-disciplinary research remained between neighboring\nresearch areas as experts on surrounding research areas joined the\nnetworks of coronavirus experts; 2) in the case of the global\npandemic, COVID-19, with overwhelming global impact, cross-\ndisciplinary activities have spread far beyond neighboring areas of\nresearch to form new research networks. These dynamics of cross-\ndisciplinary research are national in character as newly converted\nresearchers came from the countries seriously affected by the\ncoronaviruses. However, the majority of these converted experts\nare likely to conduct their coronavirus research on a temporary\nbasis, and they might change their research subjects once an outbreak\nis over. Such temporary participation of researchers in coronavirus\nresearch suggests that securing the source of funding could be one of\nthe factors for sustaining transdisciplinary research on coronaviruses\nand lowering the fatality of future outbreaks.\nKnowledge on COVID-19 is distributed across a wide range of\ndisciplines forming research networks within national\nboundaries. More technically, while MeSH terms may not be\nsufﬁcient to completely identify the background of authors with\ndifferent roles, this research shows that MeSH terms are still\nuseful to the extent that they help identify the scope of cross-\ndisciplinarity regarding coronavirus research. It would also be\nvaluable to examine the dynamics of research beyond thoseﬁelds\ncovered by PubMed to further unveil the impact of COVID-19 on\nan even wider range of research activities in the world.\nIn short, COVID-19 has transformed the structure of\ncoronavirus research. The greater the scale of social impact is,\nthe more cross-disciplinary research emerges. In the case of\nCOVID-19, the national character of research has been\nreinforced by the ﬁnding that transnational collaboration in\nterms of international co-authorships has decreased since the\noutbreak of the global pandemic. Given the unprecedented scale\nof COVID-19 and the nationalization of responses, the most\nlikely way forward for medical experts is to accumulate local\nknowledge with the awareness of transdisciplinary research\ndynamics. For a coordinated response to COVID-19, an\nimplication here is to be aware of the perspective that the\nglobal pandemic can be grasped into a bodily event for each\nmedical and nonmedical expert to become an extension to a\ntransdisciplinary solution to the health problem of the one and\nthe many. An “event” or a “prehension” (apprehension which\nmay or may not be cognitive) of things, here in this place such as a\nlocal response to the COVID-19 pandemic, has reference to other\nplaces since things gathered into the grasped unity of an event as a\nspatiotemporal unity here and now have essential reference to\nother places and other times (Whitehead, 1925). Events are\nprehensions of things that constitute realities of nature given\nthat nature is a structure of evolving“processes” and each single\nevent within its own context has all the reality that is interlocked\nwith the whole (Whitehead, 1925). Finally, while the present\nstudy— with its focus on the articles published by August 17,\n2020— demonstrated the initial impact of COVID-19, continuous\nresearch is still necessary to grasp the further transformation of\nresearch dynamics in the long-term challenge against COVID-19.\nDATA AVAILABILITY STATEMENT\nThe original contributions presented in the study are included in\nthe article/Supplementary Material; further inquiries can be\ndirected to the corresponding author.\nAUTHOR CONTRIBUTIONS\nAll the authors contributed to this work and approved theﬁnal\nversion for submission. RO and JK wrote the article. RO carried\nout the data collection and the analyses reported in this study. MF\nhelped informing the discussion. OO supervised the study.\nFUNDING\nThis work has been funded by the Japan Society for the\nPromotion of Science as Grant-in-Aid for Scientiﬁc Research\n(C) to RO (20K00266), and by the University of Tsukuba as a\nresearch support program to tackle COVID-19 –related\nemergency problems to RO, JK, MF, and OO.\nSUPPLEMENTARY MATERIAL\nThe Supplementary Material for this article can be found online at:\nhttps://www.frontiersin.org/articles/10.3389/fdata.2021.631073/\nfull#supplementary-material\nREFERENCES\nBatagelj, V., and Mrvar, A. (2002). Pajek- Analysis and Visualization of Large\nNetworks. Graph Drawing2265, 477–478. doi:10.1007/3-540-45848-4_54\nBorup, M., Brown, N., Konrad, K., and Van Lente, H. (2006). The Sociology of\nExpectations in Science and Technology. Technol. Anal.Strateg.Manage.18,\n285–298. doi:10.1080/09537320600777002\nCauchemez, S., Fraser, C., Van Kerkhove, M. D., Donnelly, C. A., Riley, S., Rambaut, A.,\net al. (2014). Middle East Respiratory Syndrome Coronavirus: Quantiﬁcation of the\nExtent of the Epidemic, Surveillance Biases, and Transmissibility.Lancet Infect.\nDis.14, 50–56. doi:10.1016/s1473-3099(13)70304-9\nChan-Yeung, M., and Xu, R.-H. (2003). SARS: Epidemiology.Respirology8 (Suppl.\nl), S9–S14. doi:10.1046/j.1440-1843.2003.00518.x\nChannappanavar, R., and Perlman, S. (2017). Pathogenic Human Coronavirus\nInfections: Causes and Consequences of Cytokine Storm and\nFrontiers in Big Data | www.frontiersin.org July 2021 | Volume 4 | Article 6310738\nOhniwa et al. COVID-19 and Researcher Dynamics\nImmunopathology. Semin.Immunopathol39, 529 –539. doi:10.1007/s00281-\n017-0629-x\nC h e n ,X . ,C h u g h t a i ,A . A . ,D y d a ,A . ,a n dM a c i n t y r e ,C . R .( 2 0 1 7 ) .C o m p a r a t i v e\nEpidemiology of Middle East Respiratory Syndrome Coronavirus (MERS-CoV) in\nSaudi Arabia and South Korea.Emerg. Microbes Infect.6, e51. doi:10.1038/emi.2017.40\nGuarner, J. (2020). Three Emerging Coronaviruses in Two Decades. Am.\nJ.Clin.Pathol.153, 420–421. doi:10.1093/ajcp/aqaa029\nGustafsson, R., Kuusi, O., and Meyer, M. (2015). Examining Open-Endedness of\nExpectations in Emerging Technologicalﬁelds: The Case of Cellulosic Ethanol.\nTechnol. Forecast.Soc. Change91, 179–193. doi:10.1016/j.techfore.2014.02.008\nHijawi, B., Abdallat, M., Sayaydeh, A., Alqasrawi, S., Haddadin, A., Jaarour, N.,\net al. (2013). Novel Coronavirus Infections in Jordan, April 2012:\nEpidemiological Findings from a Retrospective Investigation. East.Mediterr.\nHealth J.19 (Suppl. 1), S12–S18. doi:10.26719/2013.19.supp1.s12\nLipscomb, C. E. (2000). Medical Subject Headings (MeSH).Bull Med. Libr. Assoc.\n88, 265–266.\nLowe, H. J., and Barnett, G.O. (1994). Understanding and Using the Medical\nSubject Headings (MeSH) Vocabulary to Perform Literature Searches.Jama-\nJournal Am. Med. Assoc.271, 1103–1108. doi:10.1001/jama.271.14.1103\nOhniwa, R. L., and Hibino, A. (2019). Generating Process of Emerging Topics in the\nLife Sciences.Scientometrics121, 1549–1561. doi:10.1007/s11192-019-03248-z\nOhniwa, R. L., Hibino, A., and Takeyasu, K. (2010). Trends in Research Foci in Life\nScience ﬁelds over the Last 30 Years Monitored by Emerging Topics.\nScientometrics85, 111–127. doi:10.1007/s11192-010-0252-2\nRosling, L., and Rosling, M. (2003). Pneumonia Causes Panic in Guangdong\nProvince. BMJ326, 416. doi:10.1136/bmj.326.7386.416\nRotolo, D., Hicks, D., and Martin, B. R. (2015). What Is an Emerging Technology?.\nRes.Pol.44, 1827–1843. doi:10.1016/j.respol.2015.06.006\nSinghal, T. (2020). A Review of Coronavirus Disease-2019 (COVID-19).Indian\nJ.Pediatr. 87, 281–286. doi:10.1007/s12098-020-03263-6\nStenner, P. (2017).“Liminality and Experience A Transdisciplinary Approach to the\nPsychosocial, (London: Palgrave Macmillan UK Imprint). doi:10.1057/978-1-\n137-27211-9\nVan Merkerk, R. O., and Van Lente, H. (2005). Tracing Emerging Irreversibilities\nin Emerging Technologies: The Case of Nanotubes. Technol. Forecast.Soc.\nChange72, 1094–1111. doi:10.1016/j.techfore.2004.10.003\nWallinga, J., and Teunis, P. (2004). Different Epidemic Curves for Severe Acute\nRespiratory Syndrome Reveal Similar Impacts of Control Measures. Am.\nJ.Epidemiol.160, 509–516. doi:10.1093/aje/kwh255\nWang, Y., Wang, Y., Chen, Y., and Qin, Q. (2020). Unique Epidemiological and\nClinical Features of the Emerging 2019 Novel Coronavirus Pneumonia\n(COVID-19) Implicate Special Control Measures.J. Med.Virol.92, 568–576.\ndoi:10.1002/jmv.25748\nWhitehead, A. N. (1925).\nScience and the Modern World Lowell Lectures, 1925.\nNew York: The Macmillan company.\nXu, R.-H., He, J.-F., Evans, M. R., Peng, G.-W., Field, H. E., Yu, D.-W., et al. (2004).\nEpidemiologic Clues to SARS Origin in China. Emerg. Infect. Dis. 10,\n1030–1037. doi:10.3201/eid1006.030852\nConﬂict of Interest:The authors declare that the research was conducted in the\nabsence of any commercial orﬁnancial relationships that could be construed as a\npotential conﬂict of interest.\nPublisher’s Note:All claims expressed in this article are solely those of the authors\nand do not necessarily represent those of their afﬁliated organizations, or those of\nthe publisher, the editors and the reviewers. Any product that may be evaluated in\nthis article, or claim that may be made by its manufacturer, is not guaranteed or\nendorsed by the publisher.\nCopyright © 2021 Ohniwa, Kijima, Fukushige and Ohneda. This is an open-access\narticle distributed under the terms of the Creative Commons Attribution License (CC\nBY). The use, distribution or reproduction in other forums is permitted, provided the\noriginal author(s) and the copyright owner(s) are credited and that the original\npublication in this journal is cited, in accordance with accepted academic practice.\nNo use, distribution or reproduction is permitted which does not comply with\nthese terms.\nFrontiers in Big Data | www.frontiersin.org July 2021 | Volume 4 | Article 6310739\nOhniwa et al. COVID-19 and Researcher Dynamics",
  "topic": "Pandemic",
  "concepts": [
    {
      "name": "Pandemic",
      "score": 0.779110312461853
    },
    {
      "name": "Coronavirus disease 2019 (COVID-19)",
      "score": 0.5835862755775452
    },
    {
      "name": "Discipline",
      "score": 0.5348886847496033
    },
    {
      "name": "Scope (computer science)",
      "score": 0.46884405612945557
    },
    {
      "name": "Outbreak",
      "score": 0.4192352890968323
    },
    {
      "name": "Political science",
      "score": 0.41736239194869995
    },
    {
      "name": "Coronavirus",
      "score": 0.4125773012638092
    },
    {
      "name": "Sociology",
      "score": 0.30310314893722534
    },
    {
      "name": "Social science",
      "score": 0.25428882241249084
    },
    {
      "name": "Infectious disease (medical specialty)",
      "score": 0.20965859293937683
    },
    {
      "name": "Medicine",
      "score": 0.20356139540672302
    },
    {
      "name": "Virology",
      "score": 0.1868133246898651
    },
    {
      "name": "Computer science",
      "score": 0.12537416815757751
    },
    {
      "name": "Programming language",
      "score": 0.0
    },
    {
      "name": "Pathology",
      "score": 0.0
    },
    {
      "name": "Disease",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I146399215",
      "name": "University of Tsukuba",
      "country": "JP"
    },
    {
      "id": "https://openalex.org/I16733864",
      "name": "National Taiwan University",
      "country": "TW"
    }
  ],
  "cited_by": 24
}