{
  "title": "Enhancing machining accuracy reliability of multi-axis CNC Indexed by: machine tools using an advanced importance sampling method",
  "url": "https://openalex.org/W3180011154",
  "year": 2021,
  "authors": [
    {
      "id": "https://openalex.org/A2102500323",
      "name": "Zhiming Wang",
      "affiliations": [
        "Lanzhou University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A1989810000",
      "name": "Hao Yuan",
      "affiliations": [
        "Lanzhou University of Technology"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1965419094",
    "https://openalex.org/W2065938869",
    "https://openalex.org/W2043234478",
    "https://openalex.org/W2030010644",
    "https://openalex.org/W1985387100",
    "https://openalex.org/W2116366865",
    "https://openalex.org/W2054888280",
    "https://openalex.org/W936423603",
    "https://openalex.org/W2087341588",
    "https://openalex.org/W2965175627",
    "https://openalex.org/W1986511594",
    "https://openalex.org/W1965011797",
    "https://openalex.org/W3089131888",
    "https://openalex.org/W3120533716",
    "https://openalex.org/W4394956715",
    "https://openalex.org/W3014833255",
    "https://openalex.org/W2325078854",
    "https://openalex.org/W2522705988",
    "https://openalex.org/W2563434485",
    "https://openalex.org/W2471733517",
    "https://openalex.org/W2085913024",
    "https://openalex.org/W2751185364"
  ],
  "abstract": "The purpose of this paper is to propose a general precision allocation method to improve machining performance of CNC machine tools based on certain design requirements. A comprehensive error model of machine tools is established by using the differential motion relation of coordinate frames. Based on the comprehensive error model, a reliability model is established by updating the primary reliability with an advanced importance sampling method, which is used to predict the machining accuracy reliability of machine tools. Besides, to identify and optimize geometric error parameters which have a great influence on machining accuracy reliability of machine tools, the sensitivity analysis of machining accuracy is carried out by improved first-order second-moment method. Taking a large CNC gantry guide rail grinder as an example, the optimization results show that the method is effective and can realize reliability optimization of machining accuracy.",
  "full_text": "Ek s p l o a t a c j a i NiEz a w o dNo s c – Ma iNtE NaNcE aNd REliabilit y Vo l. 23, No. 3, 2021 559\nE-mail addresses:\nEksploatacja i Niezawodnosc – Maintenance and Reliability\nVolume 23 (2021), Issue 3\njournal homepage: http://www.ein.org.pl\nIndexed by:Enhancing machining accuracy reliability of multi-axis CNC  \nmachine tools using an advanced importance sampling method\nZhiming Wang a, Hao Yuan a\na School of Mechanical and Electronic Engineering, Lanzhou University of Technology, Lanzhou 730050, China\nWang Z, Yuan H. Enhancing machining accuracy reliability of multi-axis CNC machine tools using an advanced importance sampling me-\nthod. Eksploatacja i Niezawodnosc – Maintenance and Reliability 2021; 23 (3): 559–568, http://doi.org/10.17531/ein.2021.3.17.\nArticle citation info:\nThe purpose of this paper is to propose a general precision allocation method to improve \nmachining performance of CNC machine tools based on certain design requirements. A \ncomprehensive error model of machine tools is established by using the differential motion \nrelation of coordinate frames. Based on the comprehensive error model, a reliability model \nis established by updating the primary reliability with an advanced importance sampling \nmethod, which is used to predict the machining accuracy reliability of machine tools. Be-\nsides, to identify and optimize geometric error parameters which have a great influence on \nmachining accuracy reliability of machine tools, the sensitivity analysis of machining ac-\ncuracy is carried out by improved first-order second-moment method. Taking a large CNC \ngantry guide rail grinder as an example, the optimization results show that the method is \neffective and can realize reliability optimization of machining accuracy.\nHighlights Abstract\nAn accuracy allocation method for CNC machine • \ntools is proposed.\nThe error is presented by using the differential • \nmotion matrix and reliability theory.\nThe machining accuracy reliability is given by an • \nadvanced importance sampling method.\nThe effectiveness is validated by a CNC grinding • \nmachine.\nprecision allocation, comprehensive error, machining accuracy reliability, sensitivity analy-\nsis, advanced importance sampling method.\nKeywords\nThis is an open access article under the CC BY license \n(https://creativecommons.org/licenses/by/4.0/)\nZ. Wang - wangzhiming301@sohu.com, H. Yuan - 2324996561@qq.com\nNomenclature\nδxx    Positioning error of the X-axis\nδyx    Y direction of straightness error of the X-axis\nδzx    Z direction of straightness error of the X-axis\nεxx    Roll error of the X-axis\nεyx    Pitch error of the X-axis\nεzx    Yaw error of the X-axis\nδxy    X direction of straightness error of the Y-axis\nδyy    Positioning error of the Y-axis\nδzy    Z direction of straightness error of the Y-axis\nεxy    Pitch error of the Y-axis\nεyy    Roll error of the Y-axis\nεzy    Yaw error of the Y-axis\nδxz    X direction of straightness error of the Z-axis\nδyz    Y direction of straightness error of the Z-axis\nδzz    Positioning error of the Z-axis\nεxz    Pitch error of the Z-axis\nεyz    Yaw error of the Z-axis\nεzz    Roll error of the Z-axis\nSxz    X and Z-axis perpendicularity error\nSyz    Y and Z-axis perpendicularity error\nSxy    X and Y-axis perpendicularity error\n1. Introduction\nCNC machine tools integrate many technologies, such as accuracy \nmachinery, electronics, electric drag, automatic control, automatic \ndetection, fault diagnosis, and computer. It is a typical mechatronics \nproduct with high accuracy and efficiency [22]. Machining accuracy \nis critical to the quality and performance of machine tools and it is the \nfirst consideration of any manufacturer [20]. Machining accuracy reli-\nability is the ability for machine tools can work normally to achieve \nthe corresponding machining accuracy under specified conditions \n[14]. Its main influencing factors include geometric errors, thermal \nerrors and cutting force errors, etc. Geometric errors and thermal er -\nrors are the main influencing factors, accounting for 45%-65% of the \ntotal errors. The higher the accuracy of machine tools, the bigger the \nproportion of geometric errors and thermal errors [12]. When the tem-\nperature changes to a stable state, the impact of geometric errors are \nthe largest, accounting for about 40% of the total errors [5]. Large \nCNC gantry rail grinder has a wide range of travel and is suitable \nfor heavy machinery, ships, and metallurgical equipment. This paper \ntakes it as an example to analyze the relationship between geometric \nerrors of components of the grinder and the reliability of grinding ac-\ncuracy.\nThe accuracy design of machine tools includes two aspects: ac-\ncuracy prediction and accuracy allocation [10]. Accuracy prediction \nEk s p l o a t a c j a i NiEz a w o dNo s c – Ma iNtE NaNcE aNd REliabilit y Vo l. 23, No. 3, 2021560\nrefers to the prediction of the volume errors of a machine tool based \non the known accuracy of the updated and maintained parts, and then \nthe prediction of the machining accuracy of the workpiece [3]. Ac-\ncuracy prediction is the basis of accuracy design. Error models are \noften used to predict the accuracy of machine tools. At present, the \nmethods of establishing a comprehensive error model of machine \ntools include the matrix translation method, error matrix method, rigid \nbody kinematics, and modeling method based on multi-body system \ntheory [2]. Among them, modeling methods based on MBS theory \nare widely used, but the calculation amount is large and the process \nis complicated. In the process of modeling, the ideal position matri -\nces, position error matrices, ideal motion matrices, and motion error \nmatrices of components need to be considered at the same time. To \nreduce the amount of calculation, a geometric error modeling method \nbased on differential motion relation of coordinate frames is adopted \nin this paper. By establishing the differential motion matrices between \ncomponents, the transmission relationship between geometric errors \nof components and the comprehensive error of machine tools is de-\ntermined.\nAccuracy allocation refers to obtaining the accuracy of updated \nmaintenance parts according to the total accuracy preset by the ma-\nchine tool so that the accuracy of parts can reach the optimal scheme \n[17]. Its main content is to establish the reliability model of machining \naccuracy and the sensitivity model of machining accuracy reliability. \nThere are many important methods of reliability and sensitivity analy-\nsis such as differential analysis, response surface methodology, Monte \nCarlo analysis, and variance decomposition procedures [1]. Zhang et \nal. [21] established the geometric error cost model and geometric er -\nror reliability model based on the traditional cost model and reliability \nanalysis model, considering the principle of the weighting function. \nThen, an error allocation method is proposed to optimize the total \ncost and the reliability. Cheng et al. [6] developed an error allocation \nmethod based on the first-order second-moment method to optimize \nthe allocation of manufacturing and assembly tolerances while spec-\nifying operating conditions to determine the optimal level of these \nerrors. Based on Monte Carlo simulation method, the reliability and \nsensitivity analysis models of machining accuracy for machine tools \nare given by Cheng et al [8]. The machining accuracy reliability is \ntaken as the index to measure the capability of the machine tools, \nand the reliability sensitivity is taken as the reference to optimize the \nbasic parameters of the machine tools. The validity of this method is \nverified by taking a three-axis machine tool as an example. In this \npaper, the reliability model of machining accuracy is established by \nupdating primary reliability based on an important sampling method, \nwhich can determine the reliability of grinding machines at different \nmachining locations. Different geometric errors have different effects \non the reliability of machining accuracy of machine tools. How to find \nand control the key geometric errors effectively is the main problem \nto improve the machining accuracy [15]. Through sensitivity analysis \nof machining accuracy reliability, the most critical geometric errors \ncan be identified. Lee and Lin studied the effect of each assembly er-\nror term on the volumetric error of a five-axis machine tool according \nto form-shaping theory [13]. Chen [4] studies the volumetric error \nmodeling and its sensitivity analysis for the purpose of machine de-\nsign. Cheng [7] considered the stochastic characteristic of geometric \nerrors and used Sobol’s global sensitivity analysis method to identify \ncrucial geometric errors of machine tools, which is helpful to improve \nthe machining accuracy of multi-axis machine tools. In this paper, \nthe improved first-order second-moment method is used to establish a \nsensitivity analysis model, which can identify and optimize the main \ngeometric error parameters that affect the machining accuracy reli -\nability, so that the machining accuracy reliability of machine tools \ncan meet the design requirements. In this paper, the principle of dif-\nferential motion between coordinate frames is applied to geometric \nerror modeling of machine tools, and a new precision design method \nis proposed by combining with reliability theory. It has important the-\noretical significance and practical value for further study machining \nprecision reliability of machine tools.\nDifferential motion vector in a rigid body or coordinate frame in-\nclude differential translation vector and differential rotation vector \n[9]. The differential translation consists of the differential movement \nof the coordinate frame in the direction of three coordinate axes\n, and \nthe differential rotation consists of the differential rotation of the co-\nordinate frame around three coordinate axes, then the differential mo-\ntion vector of the coordinate frame is expressed as:\n \nE xy zx yz=[, ,,, ,]δδ δε εε  (1)\nAccording to the differential motion relation in coordinate system, \nthe differential motion in one coordinate frame can be represented \nin another coordinate frame. The differential changes relationship \nbetween the two coordinate frames can be established by a 6 × 6 \ntransformation matrix, which is the differential motion matrix [16]. \nAssume that the homogeneous transformation matrix of coordinate \nframe c relative to coordinate frame d is:\n \nT RP\nOc\nd\nxx xx\nyy yy\nzz zz\nno ap\nno ap\nno ap\n=\n\n\n=\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n00 01\n (2)\nThen the differential motion matrix of coordinate frame d relative \nto coordinate frame c can be expressed as:\n( )T T\nT\n3 3\n( ) ( ) ( )\n( ) ( ) ( )\n( ) ( ) ( )\n0 0 0\n0 0 0\n0 0 0\nx y z x y z\nx y z x y z\nx y z x y zd\nc\nx y z\nx y z\nx y z\nn n n p n p n p n\no o o p o p o p o\na a a p a p a p a\nDJ n n n\no o o\na a a\n×\n× × × \n × × × \n   × × ×− ×     = =        \n \n \n  \nR R PT\nO R\n \n(3)\nwhere (P×) represents the skew-symmetric matrix of vector P.\nDifferential motion matrix reflects the transfer relationship of dif-\nferential motion between coordinate frames. If the differential motion \nvector of the coordinate frame d is:\n ∆Edx dy dz dx dy dz d= \n\nδδ δε εε,, ,, ,\nT\n (4)\nThen the differential motion vector of the coordinate frame c caused \nby the differential motion of the coordinate frame d as follows:\n ∆∆ET Ed\nc\nc\nd\ndDJ=  \n⋅\n  (5)\nThe rest of the paper is organized as follows. In Sect. 2, a compre-\nhensive geometric error model of a machine tool is established based \non differential motion relationship between coordinate systems. In \nSect. 3, a general precision allocation method that includes machine \ntools reliability prediction and error parameter optimization is pro-\nposed. Furthermore, the effectiveness of the method is validated by \na large CNC gantry guide rail grinder. The conclusions are presented \nin Sect. 4.\nEk s p l o a t a c j a i NiEz a w o dNo s c – Ma iNtE NaNcE aNd REliabilit y Vo l. 23, No. 3, 2021 561\n2. Geometric error modeling of machine tool based \non the differential motion relation of coordinate \nframes\n2.1. Differential motion matrix of a machine tool\nWhen the differential transformation between coordinate frames is \napplied to geometric error modeling of a machine tool, the influence \nof geometric errors of various parts of a machine tool on machining \naccuracy can be obtained and geometric error model can be estab-\nlished. Taking a large CNC gantry rail grinder as an example, the geo-\nmetric error modeling process of this machine tool is presented using \ndifferential motion relation of coordinate frames.\nThe basis of geometric error modeling is to obtain the homogene-\nous transformation matrices between each component of the machine \ntool. Firstly, the homogeneous transformation matrices of tool relative \nto any other component are established according to the order of open \nkinematic chain of the machine tool. The structure of the large CNC \ngantry rail grinder is shown in Figure 1 and the corresponding topo-\nlogical structure is shown in Figure 2. The order of open kinematic \nchain is working table — X-axis — Bed — Z-axis — Y-axis — tool.\nFig. 1. Structure diagram of CNC gantry guide rail grinder\nFig. 2. Topological structure diagram\nThe components of the grinder are regarded as rigid bodies and \ntheir local coordinate frames are established. Based on the MBS the-\nory, the homogeneous transformation matrices between the compo-\nnents of the grinder are established. The homogeneous transformation \nmatrices of the working table relative to X-axis, the X-axis relative to \nbed, the Z-axis relative to bed, the Y-axis relative to Z-axis, and the \ntool relative to Y-axis are respectively represented as:\n1 0 0 0 1 0 0 1 0 0 0\n0 1 0 0 0 1 0 0 0 1 0 0, , ,0 0 1 0 0 0 1 0 0 0 1\n0 0 0 1 0 0 0 1 0 0 0 1\n1 0 0 0 1 0 0 0\n0 1 0 0 1 0 0                           , 0 0 1 0 0 0 1 0\n0 0 0 1 0 0 0 1\nX F F\nW X Z\nZ Y\nY T\nx\nz\ny\n     \n     \n     = = = =     \n     \n     \n   \n   \n   = = =   \n   \n   \nT E T T\nT T E\n(6)\nThen the homogeneous transformation matrix of the bed relative to \nthe X-axis coordinate frame can be indicated as:\n \n1 0 0\n0 1 0 0\n0 0 1 0\n0 0 0 1\nX\nF\nx− \n \n = \n \n \nT  (7)\nwhere x, y, and z denote the moving distances of the X-axis, Y-axis and \nZ-axis respectively.\nFrom the order of open kinematic chain of the grinder, the homoge-\nneous transformation matrices of the tool relative to other parts of the \ngrinder can be obtained, which are expressed as:\n \nW W X F Z Y\nT X F Z Y T\nX X F Z Y\nT F Z Y T\nF F Z Y\nT Z Y T\nZ Z Y\nT Y T\nY Y\nT T\n = ⋅ ⋅ ⋅ ⋅\n = ⋅ ⋅ ⋅\n = ⋅ ⋅\n = ⋅\n =\nT T T T T T\nT T T T T\nT T T T\nT T T\nT T\n (8)\nFrom equations (3) and (8), the differential motion matrices of each \naxis of the grinder relative to the tool can be obtained, which are:\n \n1 0 0 0\n0 1 0 0\n0 0 1 0\n0 0 0 1 0 0\n0 0 0 0 1 0\n0 0 0 0 0 1\nT\nX\nz y\nz x\ny xDJ\n− \n − − \n   =    \n \n \n  \nT  (9)\n \n1 0 0 0 0\n0 1 0 0 0 0\n0 0 10 0\n0 0 0 1 0 0\n0 0 0 0 1 0\n0 0 0 0 0 1\nT\nZ\ny\nyDJ\n− \n \n \n   =    \n \n \n  \nT  (10)\n \n1 0 0 0 0 0\n0 1 0 0 0 0\n0 0 1 0 0 0\n0 0 0 1 0 0\n0 0 0 0 1 0\n0 0 0 0 0 1\nT\nYDJ\n \n \n \n   =    \n \n \n  \nT  (11)\n\nEk s p l o a t a c j a i NiEz a w o dNo s c – Ma iNtE NaNcE aNd REliabilit y Vo l. 23, No. 3, 2021562\n2.2. Error modeling\nThere are 21 geometric errors in the grinder, including three linear \nerrors and three angular errors of each axis, and three squareness er -\nrors. In Figure 3, δxx, δyx, δzx represent the linear error of X-axis in the \nx, y, and z-directions, εxx, εyx, εzx represent the angular errors of X-axis \nin the x, y, and z-directions. \nFig. 3. Basic geometric error of X-axis\nIn Figure 4, Sxz, Syz, Sxy represent the squareness errors between the \nX-axis and Z-axis, Y-axis and Z-axis, X-axis and Y-axis.\nFig. 4. Distribution of perpendicularity error between triaxial\nThe geometric errors of each part of the grinder can be regarded \nas the differential motion of each part in its coordinate system. Lin-\near errors are expressed as differential translation, and angular errors \nare expressed as differential rotation. The six basic errors will change \nwith the motion of the grinder, and the differential motion vector of \neach component i can be expressed by:\n \n∆Eix iy iz ix iy iz i= \n\nδδ δε εε,, ,, ,\nT\n  (12)\nThere is no geometric error in working table and bed, so the differ-\nential motion vectors of the working table and bed are as follows:\n ∆∆EEWF=[] =[]000000 000000,,,,, , ,,,,,TT   (13)\nThe squareness errors are an important part of the geometric error \nof machine tools. In the process of error modeling, the squareness er-\nrors can be regarded as the angular errors of the corresponding axis. \nSxy can be regarded as the angular error of the X-axis in the z-direction, \nSxz can be regarded as the angular error of the Z-axis in the y-direction, \nSyz can be regarded as the angular error of the Z-axis in the x-direction. \nThen the differential motion vectors of the Z-axis and Y-axis can be \ngiven by:\n \n∆\n∆\nE\nE\nYx yy yz yx yy yz y\nZx zy zz zx zy zS\n= \n\n=+\n()\nδδ δε εε\nδδ δε\n,, ,, ,\n,, ,,\nT\nεεεyz xz zzS+() \n\n\n\n\n\n ,\nT  (14)\nWhen the grinder is seen as one open kinematic chain, the reference \ncoordinate frame is located on the working table, and the geometric \nerrors direction of the part between the bed and the working table are \nopposite to the direction defined in the measurement, so the differen-\ntial motion vector of the X-axis is denoted as:\n \n∆EXx xy xz xx xy xz xx yS=− −− −− −+() \n\nδδ δε εε,, ,, ,\nT\n (15)\nWith the differential motion matrices of each part relative to the \ntool and the differential motion vectors of each part, the differential \nmotion vectors of the geometric errors of each part in the tool coor -\ndinate frame can be obtained. By taking Eqs (9) and (15) into Eq (5), \nthe differential motion vector of geometric error of the X-axis in tool \ncoordinate frame can be got as:\n ∆∆ET EX\nT\nT\nX\nX\nxx yx zx xy\nyx xx zx xy\nDJ\nzy S\nzx S\n=  \n⋅=\n−− ++\n()\n−+ ++(\nδε ε\nδε ε ))\n−− −\n−\n−\n−\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nδε ε\nε\nε\nε\nzx xx yx\nxx\nyx\nzx\nyx      (16)\nIn the same way, the differential motion vectors of the geometric \nerrors of the Y-axis and Z-axis in the tool coordinate frame can also \nbe obtained:\n∆ ∆E T EZ\nT\nT\nZ\nZ\nxz zz\nyz\nzz xz yz\nxz yz\nyz xz\nDJ\ny\ny S\nS\nS\n=  \n⋅ =\n−\n+ +\n( )\n+\n+\nδ ε\nδ\nδ ε\nε\nε\nεε\nδ\nδ\nδ\nε\nzz\nY\nT\nT\nY\nY\nxy\nyy\nzy\nx\nDJ\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n=  \n⋅ =, ∆ ∆E T E\nyy\nyy\nzy\nε\nε\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n(17)\nAnd then, by adding the differential motion vectors of the geomet-\nric errors of the components in the tool coordinate frame, the com-\nprehensive error vector of the tool can be obtained, which shows the \ninfluence of the geometric errors of the components on the tool coor-\ndinate frame:\n\nEk s p l o a t a c j a i NiEz a w o dNo s c – Ma iNtE NaNcE aNd REliabilit y Vo l. 23, No. 3, 2021 563\nxx yx zx xz xy xy\nyx xx zx yz yy xy\nzx xx yx zz xz zy yzT T T\nT X Z Y\nxx xz yz xy\nyx yz xz yy\nzx zz zy\nz y yS\nz x xS\ny x y yS\nS\nS\nδ εε δ δ\nδ ε ε δ δ\nδ ε ε δ ε δ\nε ε ε\nε ε ε\nε ε ε\n− −++ + + \n − +++ + + \n − −−+ ++ + ∆ =∆ +∆ +∆ =  − + + + \n − + + +\n \n− + +  \nE E E E\n(18)\nwhere ΔET is the comprehensive geometric error model of the grinder \nin the tool coordinate frame.\n3. Accuracy distribution\n3.1. Reliability modeling of machining accuracy\nReliability refers to the ability of a product to complete specified \nfunctions under specified conditions and within the specified time. It \nis one of the most important quality attributes of components, prod-\nucts, and complex systems [11]. Machining accuracy reliability, which \nreflects the performance of machine tools to maintain machining ac-\ncuracy, is considered. To reflect the influence of geometric errors of \nmachine tools on the reliability of machining accuracy, in this paper a \nmethod of updating the primary reliability with importance sampling \nmethod is proposed and the reliability model of machining accuracy \nof the grinder is given. Compared with the commonly used sampling \nmethod, this method can ensure that the shape of limit state surface is \ntaken into account and sampling is processed in important areas. Con-\nsider a limit state function Z = g\nX(X) = gX(X1, X2, … , Xn) where the \nrandom variable X are independent and follow normal distribution, \nthe mean value is μX = (μX1, μX2, … , μXn), the variance is σX = (σX1, \nσX2, …, σXn). Let x* be a point on the plane of limit state, then:\n Zg X= () =∗x 0  (19)\nTo calculate the reliability index, we can use a Taylor series expan-\nsion of Z = gX(X) at the point x* to linearize the limit state function. \nThe Taylor series expansion is:\n Zg\ng\nX XxLX\nX\ni\nii\ni\nn\n=+\n∂ ()\n∂ −()\n∗\n∗\n∗\n=\n∑()x\nx\n1\n (20)\nThus, the reliability index can be obtained as follows:\n β µ\nσ==\n() −\n∂ ()\n∂\n∂ ()\n∂\n\n\n\n\n\n\n\n\n\n\n∗\n∗\n∗\n=\n∗\n=\n∑\nZL\nZL\nX\nX\ni\ni\ni\nn\nX\nii\nn\ng\ng\nX x\ng\nX\nx\nx\nx\n1\n1\n∑∑\n2  (21)\nAnd the sensitivity coefficient of the variable αXi is also given by:\n α\nσ\nσ\nXi\nX\ni\nXi\nX\ni\nXi\ni\nn\ng\nX\ng\nX\n=−\n∂\n∂\n∂\n∂\n\n\n\n\n\n\n\n\n∗\n∗\n=\n∑\n()\n()\nx\nx\n2\n2\n1\n (22)\nTransforming basic random variable X space into independent \nstandard normal random variable Y space, the function becomes  Z \n= gY(Y). The improved first-order second-moment method is used to \nsolve the reliability index β, design point y* and sensitivity vector αY = \n[αY1, αY2, …, αYn]T in Y space. Constructing an orthogonal matrix H = \n[H1, H2, …, Hn-1, αY] from αY by orthogonal normalization technique. \nUsing H to transform the rotation of Y space into another standard \nnormal variable P space, we can obtain:\n YH PH P== + PnYαα  (23)\nIn Equation (23):\n    HP=() =()−−HH HP PPnn12 11 21,, ,, ,,, T  (24)\nThe design point in P space is p* = HTy*. The limit state surface \ngP(P) = 0 is orthogonal to the Pn axis at p*. The positive direction of \nPn axis points to the failure region. Therefore, the function can be \nexpressed as:\n ( ) ( )P nPZ g P h p P= = −   (25)\nIn the failure domain, P satisfies the following equation:\n PP hnn P= () ≥ () PP  (26)\nIn P space, the failure probability is:\np p p h p p pE hpf n gp P n PP\n= () =− () \n\n() =− (() ≤ − ∞\n+∞\n−∫ ∫ ϕ ϕ0 1d d Φ Φ     )) \n\n{ }\n(27)\nSample ( )1 , 2 , ,i i N= =p   can be obtained by sampling the stand-\nard normal random variable P . Therefore, the unbiased estimation of \nfailure probability can be got by:\n ( )f\n1\n1 Ö\nN\niP\ni\np h pN =\n = − ∑ \n Φ  (28)\nThe design point \n* T\nT *= , np∗    \np p  satisfies the expression\nhpP n p**\n() == β . *p  was taken as the sampling center. This method \nupdates the results of the improved first-order second-moment meth -\nod.\nThe comprehensive error model of grinder in tool coordinate sys-\ntem can be expressed as follows:\nT\n, , , , ,\nxx yx zx xz xy xy\nyx xx zx yz yy xy\nzx xx yx zz xz zy yz\nT ex ey ez ex ey ez\nxx xz yz xy\nyx yz xz yy\nzx zz zy\nz y yS\nz x xS\ny x y yS\np p p o o oS\nS\nδ εε δ δ\nδ ε ε δ δ\nδ ε ε δ ε δ\nε ε ε\nε ε ε\nε ε ε\n− −++ + + \n − +++ + + \n − −−+ ++ +   ∆ = =  − + + + \n − + + +\n \n− + +  \nE\n(29)\nLet I be the maximum allowable error of the grinder, then the limit \nstate function of the grinder is:\n T= − ∆Z I E  (30)\nEk s p l o a t a c j a i NiEz a w o dNo s c – Ma iNtE NaNcE aNd REliabilit y Vo l. 23, No. 3, 2021564\nWe can use the value of the limit state function to judge the per -\nformance of the grinder. When Z > 0, the machine tool is in a reliable \nstate; otherwise, the machine tool is in an unreliable state. The geo-\nmetric errors of each part of the grinder are generally considered to be \nnormal distribution and independent of each other, so the importance \nsampling method to updating reliability is suitable for the reliability \nmodeling of machining accuracy of the grinding machine.\n3.2. Sensitivity analysis of machining accuracy reliability\nThe machining accuracy reliability of machine tools is determined \nby the distribution types and distribution parameters of all design vari-\nables, and the sensitivity of different influencing factors to reliability \nis very different [19]. In this paper, the sensitivity of the grinder is \nanalyzed by improved first-order second-moment method, and the \nsensitivity of different geometric error parameters to machining ac-\ncuracy reliability is determined.\nThe reliability of machining accuracy can be given by the improved \nfirst-order second-moment method as follows:\n \nR = ()Φ β  (31)\nThe partial derivatives of mean and variance of geometric error are \ngiven by:\n \nZL\nxi ZL xi\nZL\nxi ZL xi\nR R\nR R\nβ µ\nµ β µ µ\nβ σ\nσ β σ σ\n∂ ∂ ∂ ∂ = ⋅ ⋅∂ ∂ ∂ ∂ ∂ ∂ ∂ ∂ = ⋅ ⋅∂ ∂ ∂ ∂\n (32)\nIn equation (32):\n \n∂\n∂ =−\n\n\n\n\n\n\n∂\n∂ =\n∂\n∂ =−\n∂\n∂\n=\nR\nZL ZL\nZL\nZL\nZL\nZL\nX\nβ π\nβ\nβ\nµσ\nβ\nσ\nµ\nσ\nµ\n1\n2 2\n1\n2\n2\nexp\nµµT\n∂∂\n∂\n∂\n∂\n∂\n∂\n\n\n\n\n\n\n∂\n∂\n= ∂\n∂\n∂\nµ\nµ\nµ\nµ\nµ\nµ\nσσ\nσ\nσ\nZL\nx\nZL\nx\nZL\nxn\nZL\nX\nZL\nx\nZL\n12\n1\n,, ,\n,\n\nT\nTσσ ∂∂\n∂\n∂\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nσ\nσ\nσx\nZL\nxn2\n,,\nT\n (33)\nSo, the reliability sensitivity of machining accuracy of various geo-\nmetric error parameters is obtained.\nTill now, a precision design method has been put forward. It takes \ninto account geometric errors of machine tools, and includes accuracy \nreliability model and reliability sensitivity model. Its process is shown \nin Figure 5.\n3.3. Reliability analysis and accuracy optimization of grinder \nmachining accuracy\nThe geometric errors of various parts of MKW5230A/3×160 large \naccuracy CNC gantry guideway grinder approximately obey normal \ndistribution, so the 21 of geometric errors are regarded as obeying \nnormal distributions. The variances of the geometric errors are deter-\nmined by assembly tolerances and geometric tolerances. The mean \nvalues of all geometric errors are 0. According to the accuracy of the \nexisting general CNC equipment and the national standard of accu -\nracy testing for gantry guide rail grinder of the people’s Republic of \nChina (GB/T5288-2007/ISO4703: 2001), the variances of 21 geomet-\nric errors are preliminarily determined [18]. As shown in Table 1.\nThere are three linear errors and three angular errors in the com-\nprehensive geometric error model of the grinder in the tool coordinate \nframe. As for the angle error, it can be seen from its expression, mean \nvalue, and variance that the three angular errors are far less than the \nallowable errors, which will not be calculated in this paper. In the tool \ncoordinate frame of the grinder, the minimum value of reliability is \nnot less than 95% and the average value of reliability is not less than \n97% within the maximum allowable error I = [0.03, 0.03, 0.03] \nT. In \nits working stroke, five points of 0, 250, 500, 750, 1000 are selected \nin x-direction, five points of -1500, -750, 0,750,1500 are selected in \ny-direction, and five points of 600,800,1000,1200,1400 are selected \nin z-direction. Using the method proposed in this paper, the machin -\ning accuracy reliability of each point can be calculated with Matlab \nprogram.\nTable 1. Variance of 21 geometric errors\nError variable (1-7) δxx δyx δzx εxx εyx εzx δxy\nvariance /mm 0.05/6 0.05/6 0.05/6 0.03/6000 0.06/6000 0.05/6000 0.04/6\nError variable (8-14) δyy δzy εxy εyy εzy δxz δyz\nvariance /mm 0.05/6 0.04/6 0.05/6000 0.04/6000 0.04/6000 0.03/6 0.03/6\nError variable (15-21) δzz εxz εyz εzz Sxy Sxz Syz\nvariance /mm 0.05/6 0.03/6000 0.04/6000 0.03/6000 0.03/3000 0.03/3000 0.02/3000\nFig. 5. Flowchart showing the algorithm of the procedure\nEk s p l o a t a c j a i NiEz a w o dNo s c – Ma iNtE NaNcE aNd REliabilit y Vo l. 23, No. 3, 2021 565\nThe limit state equations of the grinder in x, y, and z-directions are \ngiven as follows:\n \nPz yy S\nPz x\nex xx yx zx xz xy xy\ney yx xx\n=− −− ++ ++()\n=− −+ +\n00 3\n00 3\n.\n.\nδε εδ δ\nδε εεδ δ\nδε εδ εδ\nzx yz yy xy\nez zx xx yx zz xz zy\nxS\nPy xy yS\n++ +()\n=− −− −+ ++ +00 3. yyz()\n    (34)\nIn equation (34), Pex is only related to Y-axis and Z-axis coordi-\nnates. Pey is only related to X-axis and Z-axis coordinates. Pez is only \nrelated to X-axis and Y-axis coordinates. The reliability of machining \naccuracy in different directions at selected points is shown in Tables \n2 ~ 4.\nIt can be seen from Table 2 that the minimum reliability value of \n25 machining accuracy items in the x-direction is 86.07%, and the \naverage reliability value is 92.16%. In Table 3, it also can be seen that \nTable 2. Reliability of machining accuracy in the x-direction\nVector of point\n(y, z) (-1500, 600) (-750, 600) (0, 600) (750, 600) (1500, 600)\nReliability (%) 88.83 96.14 98.74 96.14 88.83\nVector of point \n(y, z) (-1500, 800) (-750, 800) (0, 800) (750, 800) (1500, 800)\nReliability (%) 88.31 95.42 98.14 95.42 88.31\nVector of point\n (y, z) (-1500, 1000) (-750, 1000) (0, 1000) (750, 1000) (1500, 1000)\nReliability (%) 87.67 94.51 97.28 94.51 87.67\nVector of point \n(y, z) (-1500, 1200) (-750, 1200) (0, 1200) (750, 1200) (1500, 1200)\nReliability (%) 86.93 93.41 96.17 93.41 86.93\nVector of point \n(y, z) (-1500, 1400) (-750, 1400) (0, 1400) (750, 1400) (1500, 1400)\nReliability (%) 86.07 92.36 94.74 92.36 86.07\nTable 3. Reliability of machining accuracy in the y-direction\nVector of point \n(x, z) (0, 600) (0, 800) (0, 1000) (0, 1200) (0, 1400)\nReliability (%) 98.85 98.64 98.46 98.12 97.81\nVector of point \n(x, z) (250, 600) (250, 800) (250, 1000) (250, 1200) (250, 1400)\nReliability (%) 98.44 98.28 98.10 97.96 97.65\nVector of point\n(x, z) (500, 600) (500, 800) (500, 1000) (500, 1200) (500, 1400)\nReliability (%) 97.85 97.59 97.28 96.97 96.59\nVector of point\n(x, z) (750, 600) (750, 800) (750, 1000) (750, 1200) (750, 1400)\nReliability (%) 96.53 96.28 95.94 95.75 95.33\nVector of point\n(x, z) (1000, 600) (1000, 800) (1000, 1000) (1000, 1200) (1000, 1400)\nReliability (%) 94.64 94.39 94.05 93.92 93.45\nTable 4. Reliability of machining accuracy in the z-direction\nVector of point\n(x, y) (0, -1500) (0, -750) (0, 0) (0, 750) (0, 1500)\nReliability (%) 93.53 96.44 98.54 96.44 93.53\nVector of point\n (x, y) (250, -1500) (250, -750) (250, 0) (250, 750) (250, 1500)\nReliability (%) 93.38 97.18 98.43 97.18 93.38\nVector of point\n(x, y) (500, -1500) (500, -750) (500, 0) (500, 750) (500, 1500)\nReliability (%) 92.93 96.71 98.01 96.71 92.93\nVector of point \n(x, y) (750, -1500) (750, -750) (750, 0) (750, 750) (750, 1500)\nReliability (%) 92.21 95.89 97.28 95.89 92.21\nVector of point \n(x, y) (1000, -1500) (1000, -750) (1000, 0) (1000, 750) (1000, 1500)\nReliability (%) 91.21 94.82 96.14 94.82 91.21\nEk s p l o a t a c j a i NiEz a w o dNo s c – Ma iNtE NaNcE aNd REliabilit y Vo l. 23, No. 3, 2021566\nthe sensitivity of geometric error variance in each direction. It can be \nseen that the geometric errors in the x-direction are εyx, εzx, εzz, Sxy. \nFor y-direction, they are εxx, εzx, Sxy. For z-direction, they are εxx, εyx, \nεxz, Syz.\nThe reliability of machining accuracy can be improved by adjust-\ning the geometric errors with a higher sensitivity. Tables 5-7 show the \nresults after improvement.\nFrom Tables 5-7, it can be seen that the minimum and average val-\nues of machining accuracy reliability in x, y and z directions meet the \ndesign requirements by optimizing geometric error parameters with \nhigh sensitivity. Therefore, it can be concluded that the reliability \nmodel and sensitivity model presented in this paper are feasible and \neffective when the geometric error distribution types and distribution \nparameters of machine tools are known. The reliability calculation \nmethod proposed in this paper incorporates stochastic simulation and \nstatistical analysis, which can solve the reliability problem with high \nnon-linearity. In fact, CNC machine tools is a complex mechanical \nequipment with a highly nonlinearity. Therefore, this method is more \nsuitable for analyzing the machining accuracy of machine tools.\n4. Conclusion\nIn this paper, a general precision design method for CNC machine \ntools is proposed. The method takes average value and minimum value \nof machining precision reliability as constraints, and combines sensi-\nthe minimum reliability value of 25 machining accuracy items in the \ny-direction is 93.45%, and the average reliability value is 96.75%. In \nTable 4, it also can be seen that that the minimum reliability value of \n25 machining accuracy items in the z-direction is 91.21%, and the \naverage reliability value is 95.08%. The minimum and mean values \nof reliability in all directions do not meet the design requirements. \nThe reliability sensitivity analysis method based on the improved \nfirst-order second-moment method is used to determine the geometric \nerror parameters. Because the mean value of each geometric error is \n0, only the geometric error variance is analyzed. Figures 6-8 shows \nFig. 6. Geometric error parameter sensitivity in the x-direction\nTable 5. The reliability after improvement in the x-direction\nImprovement times\nError variable Reliability\nεyx εzx εzz Sxy\nmean value \n(%)\nminimum \nvalue (%)\nInitial value/mm 0.06/6000 0.05/6000 0.03/6000 0.03/3000 92.16 86.07\nThe first improvement/mm 0.055/6000 0.045/6000 0.025/6000 0.025/3000 93.66 88.49\nThe second improvement/mm 0.05/6000 0.04/6000 0.02/6000 0.02/3000 95.15 91.01\nThe third improvement/mm 0.045/6000 0.035/6000 0.015/6000 0.015/3000 96.46 93.43\nThe fourth improvement/mm 0.04/6000 0.03/6000 0.01/6000 0.01/3000 97.76 96.52\nTable 6. The reliability after improvement in the y-direction\nImprovement times\nError variable Reliability\nεxx εzx Sxy Mean value (%) Minimum value \n(%)\nInitial value/mm 0.03/6000 0.05/6000 0.03/3000 96.75 93.45\nThe first improvement/mm 0.025/6000 0.045/6000 0.025/3000 97.23 94.65\nThe second improvement/mm 0.02/6000 0.04/6000 0.02/3000 97.68 95.55\nFig. 7. Geometric error parameter sensitivity in the y-direction\nFig. 8. Geometric error parameter sensitivity in the z-direction\n\nEk s p l o a t a c j a i NiEz a w o dNo s c – Ma iNtE NaNcE aNd REliabilit y Vo l. 23, No. 3, 2021 567\ntivity analysis of error parameters to optimize geometric error param-\neters of machine tools. Some conclusions are drawn as follows:\nCompared with the existing traditional method, the geometric 1. \nerror modeling method based on the differential motion rela-\ntion between coordinate frames has less calculation and can \nclearly explain the geometric meaning of the geometric error \nof each part to the total error.\nBased on the comprehensive error model and advanced im-2. \nportance sampling method, the accuracy reliability model and \nreliability sensitivity model of machine tools are given to opti-\nmize the machining accuracy reliability of machine tools.\nThe effectiveness of the method proposed in this paper is val-3. \nidated by a large CNC gantry guide rail grinder, the results \nshow that the machining accuracy reliability of the machine \ntool can be improved.\nTable 7. The reliability after improvement in the z-direction\nImprovement times\nError variable Reliability\nεxx εyx εxz Syz\nMean value \n(%)\nMinimum \nvalue (%)\nInitial value/mm 0.06/6000 0.05/6000 0.03/6000 0.03/3000 95.08 91.21\nThe first improvement/mm 0.055/6000 0.045/6000 0.025/6000 0.025/3000 96.24 93.26\nThe second improvement/mm 0.05/6000 0.04/6000 0.02/6000 0.02/3000 97.06 94.69\nThe third improvement/mm 0.045/6000 0.035/6000 0.015/6000 0.015/3000 97.21 95.24\nReferences\n1.  Antonio CC, Hoffbauer LN. An approach for reliability-based robust design optimisation of angle-piy composite. Composite Structures \n2009; 90(1): 53-59, https://doi.org/10.1016/j.compstruct.2009.01.008.\n2.  Bohez ELJ, Ariyajunya B, Sinlapeecheewa C, Shein TMM, Lap DT, Belforte G. Systematic geometric rigid body error identification of \n5-axis milling machines. Computer-Aided Design 2007; 39(4): 229-244, https://doi.org/10.1016/j.cad.2006.11.006.\n3.  Cai LG, Zhang ZL, Cheng Q, Liu ZF, Gu PH. A geometric accuracy design method of multi-axis NC machine tool for improving \nmachining accuracy reliability. Eksploatacja i Niezawodnosc-Maintenance and Reliability 2015; 17(1): 143-155, https://doi.org/10.17531/\nein.2015.1.19.\n4.  Chen GD, Liang YC, Sun YZ, Chen WQ, Wang B. V olumetric error modeling and sensitivity analysis for designing a five-axis ultra-precision \nmachine too. The International Journal of Advanced Manufacturing Technology 2013; 68(9-12): 2525-2534, https://doi.org/10.1007/s00170-\n013-4874-4.\n5.  Cheng Q, Feng QN, Liu ZF, Gu PH, Cai LG. Fluctuation prediction of machining accuracy for multi-axis machine tool based on stochastic \nprocess theory. Proceedings of the Institution of Mechanical Engineers, Part C: Journal of Mechanical Engineering Science 2015; 229(14): \n2534-2550, https://doi.org/10.1177/0954406214562633.\n6.  Cheng Q, Zhang ZL, Zhang GJ, Gu PH, Cai LG. Geometric accuracy allocation for multi-axis CNC machine tools based on sensitivity \nanalysis and reliability theory. Proceedings of the Institution of Mechanical Engineers, Part C: Journal of Mechanical Engineering Science \n2015; 229(6): 1134-1149, https://doi.org/10.1177/0954406214542491.\n7.  Cheng Q, Zhao HW, Zhang GJ, Gu PH, Cai LG. An analytical approach for crucial geometric errors identification of multi-axis machine tool \nbased on global sensitivity analysis. The International Journal of Advanced Manufacturing Technology 2014; 75(1-4): 107-121, https://doi.\norg/10.1007/s00170-014-6133-8.\n8.  Cheng Q, Zhao HW, Zhao YS, Sun BW, Gu PH. Machining accuracy reliability analysis of multi-axis machine tool based on Monte Carlo \nsimulation. Journal of Intelligent Manufacturing 2018; 29(1): 1-19, https://doi.org/10.1007/s10845-015-1101-1.\n9.  Fu GQ, Fu JZ, Xu YT, Chen ZC, Lai JT. Accuracy enhancement of five-axis machine tool based on differential motion matrix: Geometric \nerror modeling, identification and compensation. International Journal of Machine Tools & Manufacture 2015; 89: 170-181, https://doi.\norg/10.1016/j.ijmachtools.2014.11.005.\n10.  Guo SJ, Mei XS, Jiang GD. Geometric accuracy enhancement of five-axis machine tool based on error analysis. The International Journal of \nAdvanced Manufacturing Technology 2019; 105(1-4): 137-153, https://doi.org/10.1007/s00170-019-04030-4.\n11.  Huang B. Reliability theory of engineering structure and its application. Wuhan: Wuhan University of Technology Press 2019.\n12.  Lee ES, Suh SH, Shon JW. A comprehensive method for calibration of volumetric positioning accuracy of CNC-machines. The International \nJournal of Advanced Manufacturing Technology 1998; 14(1): 43-49, https://doi.org/10.1007/BF01179416.\n13.  Lee RS, Lin YH. Applying bidirectional kinematics to assembly error analysis for five-axis machine tools with general orthogonal \nconfiguration. The International Journal of Advanced Manufacturing Technology 2012; 62(9-12): 1261-1272, https://doi.org/10.1007/\ns00170-011-3860-y.\n14.  Niu P, Cheng Q, Chang WF, Song XM, Li YS. Sensitivity analysis of machining accuracy reliability considering partial correlation of \ngeometric errors for Horizontal Machining Center. Proceedings of the Institution of Mechanical Engineers, part B 2021; 235(3): 455-465, \nhttps://doi.org/10.1177/0954405420958843.\n15.  Niu P, Cheng Q, Liu ZF, Chu HY . A machining accuracy improvement approach for a horizontal machining center based on analysis \nof geometric error characteristics. The International Journal of Advanced Manufacturing Technology 2021; 112: 2873-2887, https://doi.\norg/10.1007/s00170-020-06565-3.\n16.  Qi J, Yang W. Differential change construction based geometric error compensation for machine tools. Transactions of the Chinese Society \nfor Agricultural Machinery 2016; 47(9): 398-405.\n17.  Wu HR, Zheng HL, Li XX, Wang WK, Xiang XP, Meng XP. A geometric accuracy analysis and tolerance robust design approach for a vertical \nmachining center based on the reliability theory. Measurement 2020; 161: 107809, https://doi.org/10.1016/j.measurement.2020.107809.\n18.  Yu ZM, Liu ZJ, Ai YD, Xiong M. Geometric error model and precision distribution based on reliability theory for large CNC gantry \nEk s p l o a t a c j a i NiEz a w o dNo s c – Ma iNtE NaNcE aNd REliabilit y Vo l. 23, No. 3, 2021568\nguideway grinder. Journal of Mechanical Engineering 2013; 49(17): 142-151, https://doi.org/10.3901/JME.2013.17.142.\n19.  Zhang C. Geometric error inversion and optimization of multi axis CNC machine tools based on robust design. Beijing: Beijing University \nof Technology 2014.\n20.  Zhang ZL, Cai LG, Cheng Q, Liu ZF, Gu PH. A geometric error budget method to improve machining accuracy reliability of multi-axis \nmachine tools. Journal of Intelligent Manufacturing 2019; 30(2): 495-519, https://doi.org/10.1007/s10845-016-1260-8.\n21.  Zhang ZL, Liu ZF, Cai LG, Cheng Q, Qi Y . An accuracy design approach for a multi-axis NC machine tool based on reliability theory. The \nInternational Journal of Advanced Manufacturing Technology 2016; 91(5-8): 1-20, https://doi.org/10.1007/s00170-016-9824-5.\n22.  Zhang ZL, Liu ZF, Cheng Q, Qi Y , Cai LG. An approach of comprehensive error modeling and accuracy allocation for the improvement of \nreliability and optimization of cost of a multi-axis NC machine tool. The International Journal of Advanced Manufacturing Technology 2016; \n89(1-4): 1-19, https://doi.org/10.1007/s00170-016-8981-x.\n23.  Zhao CB. Application of SCM and PLC technology in CNC machine tool. Applied Mechanics and Materials 2014; 687-691: 22-25, https://\ndoi.org/10.4028/www.scientific.net/AMM.687-691.22.",
  "topic": "Machining",
  "concepts": [
    {
      "name": "Machining",
      "score": 0.8390480875968933
    },
    {
      "name": "Reliability (semiconductor)",
      "score": 0.7268754839897156
    },
    {
      "name": "Machine tool",
      "score": 0.6877874732017517
    },
    {
      "name": "Numerical control",
      "score": 0.6307055354118347
    },
    {
      "name": "Computer science",
      "score": 0.6022605895996094
    },
    {
      "name": "Sensitivity (control systems)",
      "score": 0.5536745190620422
    },
    {
      "name": "Coordinate-measuring machine",
      "score": 0.49603328108787537
    },
    {
      "name": "Sampling (signal processing)",
      "score": 0.4581872224807739
    },
    {
      "name": "Reliability engineering",
      "score": 0.45622143149375916
    },
    {
      "name": "Relation (database)",
      "score": 0.43491265177726746
    },
    {
      "name": "Engineering",
      "score": 0.23960015177726746
    },
    {
      "name": "Mechanical engineering",
      "score": 0.2091466188430786
    },
    {
      "name": "Data mining",
      "score": 0.17248225212097168
    },
    {
      "name": "Electronic engineering",
      "score": 0.07077479362487793
    },
    {
      "name": "Computer vision",
      "score": 0.06788602471351624
    },
    {
      "name": "Filter (signal processing)",
      "score": 0.0
    },
    {
      "name": "Power (physics)",
      "score": 0.0
    },
    {
      "name": "Physics",
      "score": 0.0
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I22716506",
      "name": "Lanzhou University of Technology",
      "country": "CN"
    }
  ]
}