{
  "title": "An Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers Under High Distributed Generation",
  "url": "https://openalex.org/W3190463591",
  "year": 2021,
  "authors": [
    {
      "id": "https://openalex.org/A5040973625",
      "name": "Ndamulelo Tshivhase",
      "affiliations": [
        "University of Johannesburg"
      ]
    },
    {
      "id": "https://openalex.org/A5107880477",
      "name": "Ali N. Hasan",
      "affiliations": [
        "Higher Colleges of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5069878254",
      "name": "Thokozani Shongwe",
      "affiliations": [
        "University of Johannesburg"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2035837781",
    "https://openalex.org/W2024605755",
    "https://openalex.org/W2076767855",
    "https://openalex.org/W2394770715",
    "https://openalex.org/W2769945802",
    "https://openalex.org/W2039255778",
    "https://openalex.org/W2889042200",
    "https://openalex.org/W2536356422",
    "https://openalex.org/W2954548388",
    "https://openalex.org/W2995987906",
    "https://openalex.org/W2954378742",
    "https://openalex.org/W2505043058",
    "https://openalex.org/W2912247077",
    "https://openalex.org/W2963510221",
    "https://openalex.org/W3019765971",
    "https://openalex.org/W3049675396",
    "https://openalex.org/W3130155859",
    "https://openalex.org/W2772445447",
    "https://openalex.org/W2905445498",
    "https://openalex.org/W3022948633",
    "https://openalex.org/W2738620288",
    "https://openalex.org/W2115255613",
    "https://openalex.org/W2744135835",
    "https://openalex.org/W2753767989",
    "https://openalex.org/W2889534483",
    "https://openalex.org/W6656204801",
    "https://openalex.org/W2403666663",
    "https://openalex.org/W2958480258",
    "https://openalex.org/W2735059875",
    "https://openalex.org/W2911637461",
    "https://openalex.org/W3093120843",
    "https://openalex.org/W2917052088",
    "https://openalex.org/W2922408640",
    "https://openalex.org/W2560488049",
    "https://openalex.org/W2587686993",
    "https://openalex.org/W1998572623",
    "https://openalex.org/W3017246937",
    "https://openalex.org/W2793266307",
    "https://openalex.org/W2782454251",
    "https://openalex.org/W2022321480"
  ],
  "abstract": "The South African power distribution network is characterized by long power distribution lines with low short circuit capacity, and when distributed generation is introduced to these lines, voltage magnitudes are severely impacted. The existing voltage regulation methods of the on-load tap changer and step voltage regulator cannot successfully regulate voltage in long distribution lines with distributed generation since their control philosophy was designed for networks without distributed generation. Therefore, a dynamic system is proposed in this paper that coordinates the on-load tap changer, step voltage regulator, distributed generators, and the battery energy storage system to control voltage in long distribution lines with distributed generation. Their coordination will be based on response time and robustness. Unlike the conventional method, the proposed novel system will calculate a reference voltage that the on-load tap changer and the step voltage regulator must follow, based on the real time average voltage of the section of the network they each regulate. The system will also control the charging and discharging of a battery energy storage system based on the point of connection voltage and the average voltage of the feeder which it is connected to. Reactive power from distributed generators will also be used to enhance voltage regulation and refine the network power factor. When voltage magnitudes cannot be successfully brought within acceptable range, the proposed scheme will decrease the active power produced by distributed generators. The proposed system is examined on a South African 22kV network built in Matlab/Simulink.",
  "full_text": "Received July 18, 2021, accepted July 27, 2021, date of publication July 30, 2021, date of current version August 10, 2021.\nDigital Object Identifier 10.1 109/ACCESS.2021.3101463\nAn Average Voltage Approach to Control Energy\nStorage Device and Tap Changing Transformers\nUnder High Distributed Generation\nNDAMULELO TSHIVHASE\n1, ALI N. HASAN2, AND THOKOZANI SHONGWE\n1, (Member, IEEE)\n1Department of Electrical and Electronic Engineering, University of Johannesburg, Johannesburg 2006, South Africa\n2Department of Electrical Engineering, Higher Colleges of Technology, Abu Dhabi, United Arab Emirates\nCorresponding author: Ndamulelo Tshivhase (200831989@student.uj.ac.za)\nABSTRACT The South African power distribution network is characterized by long power distribution\nlines with low short circuit capacity, and when distributed generation is introduced to these lines, voltage\nmagnitudes are severely impacted. The existing voltage regulation methods of the on-load tap changer and\nstep voltage regulator cannot successfully regulate voltage in long distribution lines with distributed gener-\nation since their control philosophy was designed for networks without distributed generation. Therefore,\na dynamic system is proposed in this paper that coordinates the on-load tap changer, step voltage regulator,\ndistributed generators, and the battery energy storage system to control voltage in long distribution lines\nwith distributed generation. Their coordination will be based on response time and robustness. Unlike the\nconventional method, the proposed novel system will calculate a reference voltage that the on-load tap\nchanger and the step voltage regulator must follow, based on the real time average voltage of the section of\nthe network they each regulate. The system will also control the charging and discharging of a battery energy\nstorage system based on the point of connection voltage and the average voltage of the feeder which it is\nconnected to. Reactive power from distributed generators will also be used to enhance voltage regulation and\nreﬁne the network power factor. When voltage magnitudes cannot be successfully brought within acceptable\nrange, the proposed scheme will decrease the active power produced by distributed generators. The proposed\nsystem is examined on a South African 22kV network built in Matlab/Simulink.\nINDEX TERMS Active distribution system, Active power, battery energy storage system, distributed\ngenerator, on-load tap changer, reactive power, step voltage regulator, voltage regulation.\nI. INTRODUCTION\nRenewable energy sources have gained more attention in the\nlast decade. This increased attention is motivated by the pollu-\ntion associated with conventional coal ﬁred power generating\nstations. Most of these renewable energy sources are small\nscale and distributed throughout the power system, hence,\nthey are also called distributed generators (DGs). However,\nthe connection of these DGs to the power distribution network\nintroduces operational challenges [1]. The major challenge\nintroduced is voltage regulation, when DGs export active\npower during low loading conditions, the voltage magnitude\nwhere they are connected can rise above the power util-\nity’s prescribed voltage limits [1]–[4]. The rise in voltage\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Bin Zhou\n.\nmagnitude will be worse when the DG is connected to a low\nshort circuit capacity network, also referred to as a weak net-\nwork [5]–[7]. The South African power distribution network\nis characterized by long power distribution lines, some of\nthese lines spanning between ﬁfty and a hundred kilometres.\nThe high impedance towards the end of such long distribution\nnetworks, and the resulting low short circuit capacity make\nthem weak networks, where the voltage is extremely sensitive\nto both active and reactive power [8]. Therefore, when DGs\nare introduced in such weak locations of the power distribu-\ntion network, their impact on voltage is extremely high. How-\never, these long distribution networks have voltage regulation\ntechniques that they use to keep voltage magnitudes well-\nregulated, which include the on-load tap changer (OLTC)\nand the step voltage regulator (SVR). The OLTC is situated\nat the main substation and regulate voltage by ensuring that\nVOLUME 9, 2021 This work is licensed under a Creative Commons Attribution 4.0 License. For more information, see https://creativecommons.org/licenses/by/4.0/ 108731\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\na predetermined and ﬁxed voltage magnitude is kept at its\nsecondary busbar [9]. Since the peak load and impedance\nof a power distribution feeder are known, and the voltage\ndrop at the furthest point can be estimated, the OLTC ﬁxed\nreference voltage is determined such that the furthest point in\nall feeders is above minimum acceptable voltage during peak\nloading conditions [10]. However, for long power distribution\nfeeders, the voltage drop at the furthest point is so high such\nthat no possible OLTC ﬁxed reference voltage can prevent the\nvoltage from dropping below minimum acceptable voltage.\nTherefore, in such long feeders, SVRs are installed along the\nfeeders to help boost voltage magnitudes. The philosophy of\noperation of an SVR is similar to that of an OLTC, it keeps\nthe voltage magnitude of interest at a predetermined and\nﬁxed voltage magnitude [11], [12]. This voltage magnitude\nof interest can be the voltage where it is located, or the\nvoltage at a remote location that is estimated through the line\ndrop compensation (LDC) technique [12]. This conventional\nprocedure of employing both the OLTC and SVR to regulate\nvoltage in accordance with a ﬁxed reference voltage works\nin passive power distribution networks, where there are no\nDGs, power ﬂows in one direction, the network load and\nimpedance are well understood, and the voltage drop can\nbe easily predicted. The active power distribution network\nthat result from DG connection has power that can ﬂow in\nany direction and will also experience both voltage drops\nand voltage rises depending on the balance between DG\ngeneration and network load.\nTherefore, the OLTC and SVR static voltage regulation\nphilosophy that relies on predictability and ﬁxed variables\ncannot sufﬁce in a network with high distributed genera-\ntion. This paper will consequently introduce an innovative\ndynamic algorithm that enhances voltage regulation in active\ndistribution systems with high distributed generation. The\ndynamic algorithm will coordinate the operation of the OLTC\nand SVR, and further calculate the appropriate reference\nvoltages that each one should follow. It will further utilize\na battery energy storage system (BESS) to enhance voltage\nregulation and reduce the number of tap operations on both\nthe OLTC and SVR. DGs also have voltage regulation ability\nthrough the usage of reactive power, however, literature has\nhighlighted the impact that the exchange of reactive power\nbetween the network and DGs have on the electrical network\npower factor [13]–[15]. Therefore, the proposed scheme will\nalso utilize DGs reactive power to further assist in enhancing\nvoltage regulation and boosting power factor. The proposed\ncontrol system’s dynamic characteristic arises from its ability\nto compute the setpoints of all devices it controls in real time\nbased on real time voltage magnitudes. This is an improve-\nment from the existing conventional system that uses ﬁxed\nsetpoints, and hence static.\nII. LITERATURE REVIEW\nLiterature has explored and proposed multiple techniques\nthat enhance voltage regulation in active power distribution\nnetworks and also use a BESS for efﬁcient power system\noperation. In [14], a technique is proposed that coordinates\nmultiple DGs to control voltage and reﬁne the power factor.\nIn [16], another technique is proposed that controls voltage\nand reduce power losses using reactive power from DGs.\nThe technique also ensures that the reactive power is evenly\ndistributed through all DGs. However, since DGs are being\nconnected to a power system with existing voltage regulation\ndevices, DGs voltage control capabilities must be coordi-\nnated with existing devices for optimal voltage regulation.\nBy not coordinating DGs and existing voltage regulation\ndevices, strategies in [14] and [16] will lead to conﬂict\nbetween devices, and the overutilization/underutilization of\nsome devices. In [17], a technique is proposed that uses a\nBESS in a low voltage active distribution network to control\nvoltage. The BESS is connected on the same bus as the\nDG, and its charging and discharging cycles are triggered by\nthe amount of generated active power and the DG point of\nconnection (POC) voltage. In [18], a technique is designed\nto coordinate a BESS and an OLTC for effective voltage\nregulation and prevent the overutilization of the BESS. The\nBESS regulates voltage based on its POC voltage, whereas\nthe OLTC regulates voltage based on estimated bus voltages,\nBESS state of charge (SOC), and the apparent power ﬂowing\nthrough the network. In [19], a technique is proposed to coor-\ndinate BESS, DGs and soft open points devices for optimal\nusage of all devices in voltage regulation.\nIn [20], a technique is presented that uses a BESS to reduce\nvoltage and frequency deviation. The strategy uses multiple\nBESS connected at different locations, the controller then\ncontrols the charging and discharging of each BESS to control\nvoltage and frequency in relation to the sensitivity coefﬁcient\nof the BESS location and the BESS SOC. In [21], a technique\nis proposed that uses a BESS to ensure that wind power plants\nmeet their frequency response obligations. The strategy con-\nsiders the BESS SOC and the BESS rate of charge/discharge\nin operation. In [22], a technique is proposed that allows a\nhigh power generation by photovoltaic plants in a low voltage\npower distribution network by using a BESS to prevent over-\nvoltage. In [23], a technique is presented that coordinate the\nOLTC, BESS and DGs for voltage regulation improvement.\nThe strategy determines the optimal tap position of the OLTC\nat any point in time, the state of each BESS, and the reactive\nand active power outputs of each DG to ensure well-regulated\nvoltage magnitudes and reduce line congestion.\nIn [24], a technique is proposed that coordinates a tap\nchanging transformer with a BESS to alleviate voltage rise\nunder high DG generation. The tap changing transformer\noperated using LDC where it estimates voltage at a remote\nbus and ensures it is equal to a ﬁxed reference voltage. When\nthe tap changing transformer has matched the estimated volt-\nage with its ﬁxed reference voltage, but other voltage magni-\ntudes within the network are out of a deﬁned range, the BESS\nwill charge/discharge based on the deviation direction and the\nstate of the network load. The state of the load will be either\npeak or off peak. In [25], another technique is suggested that\ncoordinates capacitor banks, OLTC, DGs and cascaded SVRs\n108732 VOLUME 9, 2021\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nfor voltage control in a medium voltage power system with a\nvast number of DGs. The distribution network is partitioned\ninto multiple sections where each equipment is assigned a\nsection to regulate based on the location and operational\nreach. In addition, cascaded SVRs are also time-graded to\nensure those closest to the substation operate ﬁrst and those\nfurthest from the substation operate last. In [26], a genetic\nalgorithm is proposed to coordinate an OLTC, SVR, capacitor\nbanks and a BESS to regulate voltage and minimize losses.\nWhen a voltage rise occurs during off peak period, the OLTC\ntakes priority and keep a certain bus voltage within deﬁned\nlimits. The controller will also issue a charging signal to the\nBESS. The SVR will be engaged if the OLTC and BESS can-\nnot keep voltage magnitudes within deﬁned limits. To reduce\nlosses and reﬁne power factor, the capacitor bank is switched\non if the quantity of reactive power exceeds a speciﬁc pre-set\nlimit and switched off if the quantity of reactive power goes\nbelow a speciﬁc pre-set limit. In [27], a technique is proposed\nto regulate voltage using a BESS in electric vehicles. The\nelectric vehicles would charge when a high voltage magnitude\nis detected. When the electric vehicles SOC is not low enough\nto alleviate the voltage rise, the controller will curtail the\nactive power generated by DGs.\nAlthough the techniques summarised in [14]–[27] are\neffective in regulating voltage magnitudes to a certain extent,\ntheir effectiveness can be enhanced by introducing an average\nvoltage method of voltage regulation instead of a single point\nvoltage regulation method. This is because the methods in\nliterature control the OLTC and SVR with respect to a ﬁxed\nreference voltage, or a reference voltage computed based\non the highest/lowest measured/estimated voltage magnitude.\nSince the introduction of DGs create a network where the\nvoltage proﬁle of one feeder can have multiple peaks and\ntroughs, regulating voltage based on the peak measured volt-\nage might drop the voltage proﬁle troughs below acceptable\nlimits. Similarly, regulating the voltage based on the mea-\nsured trough might increase the voltage proﬁle peaks above\nprescribed limits. In addition, methods proposed in literature\nuses BESS POC voltage to control the BESS. Therefore, if the\nvoltage peaks/troughs on the voltage proﬁle do not occur\nwhere the BESS is connected, the BESS will be underutilized\nwhen operating based on its POC voltage.\nIII. PAPER CONTRIBUTIONS\nThe proposed method will adopt an average voltage\napproach. The reference voltage that the OLTC must keep\nwill be calculated from the average voltage of the whole\npower distribution network that it regulates. Similarly, the ref-\nerence voltage of the SVR will be computed from the average\nvoltage of the section of the feeder that it regulates. The\nobjective will be to keep the average voltage at nominal\nvoltage. Therefore, based on the computed average voltages,\nthe OLTC and SVR reference voltages will be calculated such\nthat they keep their respective average voltages at nominal\nvoltage. Furthermore, the charging and discharging of the\nBESS will be controlled based on its POC voltage and the\naverage voltage of the feeder which it is connected to. There-\nfore, the controller will utilize the BESS when the BESS\nPOC voltage or the feeder average voltage is out of deﬁned\nlimits. The advantage of the average voltage approach is that\nwhen DGs are connected, it does not control voltage peaks\nor voltage troughs of the voltage proﬁle to regulate voltage,\nit controls their average. By keeping the average voltage at\nnominal voltage, the controller ensures that voltage peaks do\nnot deviate too far above nominal voltage, and voltage troughs\ndo not deviate too far below nominal voltage. In addition, it is\nreal time, hence, the calculated reference voltages will change\nto sustain the average voltage at nominal voltage as DG gener-\nation and feeder load changes and affect the average voltage.\nTo compute the average voltage, voltage measurements will\nbe taken in locations of the feeder with the potential of\nexperiencing the peak or the lowermost voltage. This include\nthe OLTC bus, DG POCs, BESS POCs, SVR POCs, and the\nfurthest points on feeders. In addition to voltage regulation,\nthe proposed method will also enhance power factor.\nInstead of using capacitor banks to boost power factor as\nimplemented in literature, the proposed method will utilize\nthe reactive power of DGs to simultaneously perform voltage\ncontrol and boost power factor. Lastly, the proposed method\nwill curtail the active power that DGs are producing when\nvoltage magnitudes cannot be kept within acceptable limits.\nTherefore, the major contributions that this paper present can\nbe summarized as follows.\n• Utilize DG reactive power to simultaneously perform\nvoltage control and boost power factor.\n• Control the charging and discharging of a BESS based\non feeder average voltage and POC voltage.\n• Coordinate the OLTC and SVR based on feeder average\nvoltages.\n• Curtail DG active power when voltage cannot be kept\nwithin acceptable limits.\nIn operation, the control scheme’s sequence will allow DGs\nto control voltage ﬁrst, BESS second, SVR third, and OLTC\nlast. The designed control scheme will control the amount of\nreactive power that the DGs generate based on the DGs POC\nvoltage. Therefore, the POC voltage magnitudes of all DGs\nwill be transmitted to the central controller for the computa-\ntion of the amount of reactive power each DG must generate\nthrough the supervisory control and data acquisition system\n(SCADA). A BESS charging/discharging algorithm will also\nbe designed that activates the BESS to charge when the POC\nvoltage or the feeder average voltage exceeds a set voltage\nlimit, and activate the BESS to discharge when the POC\nvoltage or feeder average voltage drops below a set voltage\nlimit. In controlling the BESS, the algorithm will ensure that\nit does not over-charge or completely discharge the BESS\nas this will damage it. The coordination of the OLTC and\nSVR will be carried out through a designed sequence that\nallows the SVR to act ﬁrst and reach its target voltage or\nthe minimum/maximum tap position before the OLTC can\nact. The target voltage of both the OLTC and SVR will be\nVOLUME 9, 2021 108733\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\ncalculated based on real-time voltage magnitudes measured\nat different locations on the sections of the power distribution\nnetwork they each control. The coordination of all devices\nand the computation of all setpoints will be carried out by\nthe central controller using measured parameters transmitted\nthrough SCADA.\nThe layout of the paper will be as follows; Section 1 pro-\nvided the overview, Section 2 will provide an outline of\nthe impact that OLTCs, SVRs, DGs, and BESS have on\npower distribution network voltage, Section 3 will provide an\noverview of the problem statement, Section 4 will assess and\ndiscuss the results obtained when the proposed system was\nevaluated, and Section 5 will provide a conclusion.\nIV. OLTC, SVR, DGs, AND BESS IN VOLTAGE REGULATION\nA. OLTC AND SVR\nThe OLTC is the most popular equipment used in South\nAfrican power distribution networks for voltage regulation.\nThere are both mechanical and electronic OLTCs, however,\nthe electronic OLTCs are expensive and not used often [28].\nThe South African power distribution network uses only the\nmechanical OLTCs, hence, this paper and the control scheme\nproposed will only focus on the mechanical OLTC. The volt-\nage regulation capability of the OLTC arises from its ability\nto change the power transformer winding ratio [29]. There-\nfore, as the load through the power transformer changes,\nand the voltage start changing, the OLTC will change the\npower transformer winding ratio and prevent the voltage from\nchanging, hence, keeping a constant voltage [30]. The voltage\nthe OLTC controls can be at the power transformer secondary\nbusbar in the substation or at a remote location that is far\nfrom the substation where the voltage is estimated through\nLDC [30].\nWhen operating using its conventional technique, the con-\nstant voltage that the OLTC must keep is predetermined\nand ﬁxed. This ﬁxed reference voltage is determined such\nthat it is high enough to keep the voltage at the point that\nexperiences the lowest voltage during peak load above min-\nimum acceptable voltage. A tolerance margin is also intro-\nduced above and below the ﬁxed reference voltage to prevent\ncontinuous tap hunting. Therefore, the OLTC must keep its\nmeasured voltage within a deﬁned tolerance margin from the\nﬁxed reference voltage. However, when distribution feeders\nbeing supplied are long, there will be no appropriate ﬁxed\nreference voltage that can keep the voltage at the furthest\npoints above the minimum prescribed voltage limit, hence\nSVRs are introduced. The operation of an SVR is similar to\nthat of an OLTC, where they change tap position to keep a\nlocal voltage or a remote voltage, estimated through LDC,\nwithin deﬁned margins based on a pre-set and ﬁxed reference\nvoltage [31]. However, the OLTC is located at the substation\nwhere distribution feeders emanate, and SVRs are installed\nalong a feeder where voltage magnitudes start to drop below\nthe minimum prescribed voltage.\nThe existing technique that the OLTC and SVR use work\neffectively in power distribution systems that have no DGs,\nwhere the voltage peak is always at the substation, the feeder\nvoltage proﬁle decreases uniformly from the substation, and\nthe maximum voltage drop can be estimated from the peak\nload and the impedance of the feeder. However, when DGs\nare introduced, the feeder voltage proﬁle trend becomes\nnonuniform, and a single feeder can have a voltage proﬁle\nthat has multiple peaks and troughs that will consistently\nshift based on the generation of DGs. Therefore, under such\nconditions, a technique that uses a ﬁxed reference voltage,\nthat is determined based on the predictable passive power\ndistribution network will not be effective. An active power\ndistribution network requires an adaptive algorithm that is\nable to change and adapt as the state of the power network\nchanges. Hence, the algorithm in this paper does not utilize\na ﬁxed and static reference voltage, but a variable reference\nvoltage that is calculated based on real time state of the power\nnetwork.\nB. DGs AND BESS\nDGs and BESS have certain similarities, both can export\nactive power into the power system. However, unlike com-\nmon DGs, a BESS can also import active power and charge.\nIn addition, both DGs and BESS can import and export\nreactive power, however, only DGs will be allowed to\nexport/import reactive power on the scheme designed in\nthis paper. Furthermore, DGs and BESS also affect the\nvoltage, and their impact on voltage can be illustrated by\nEquations 1-3, where 1V is the change in voltage between\nthe DG/BESS location and the substation, R is the resistance\nof a feeder, X is the reactance of a feeder, PL and QL are\nthe active and reactive power drawn by the network load, PG\nand QG are the active and reactive power exported/imported\nby DGs/BESS, and VOLTC and VG are the substation voltage\nand the voltage where the DG/BESS is connected, respec-\ntively [32], [33].\n1V =R.PL +X.QL\nVOLTC\n+jX.PL −R.QL\nVOLTC\n(1)\nThe imaginary term in Equation 1 is very small in relation\nto the real term, therefore, Equation 1 can be simpliﬁed and\nrepresented by Equation 2.\n1V ≈R.PL +X.QL\nVOLTC\n(2)\nWhen DGs are introduced, Equation 2 becomes Equa-\ntion 3. These are the equations that are used to compute\nthe change in voltage between two points based on the net-\nwork impedance, load, and DG generated power. Therefore,\nthe voltage rise that will be experienced when DGs are con-\nnected is in accordance with Equation 3.\n1V ≈R(PL −PG) +X(QL −QG)\nVG\n(3)\nEquation 2 shows the characteristics of a passive power\nsystem with no DGs present. As the line impedance R +jX is\nknown, and the peak load PL +jQL is also known, the voltage\n108734 VOLUME 9, 2021\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\ndrop between two points 1V is predictable, and hence volt-\nage regulation is easier. Equation 3 shows the characteristics\nof an active power system where DGs are present. The change\nin voltage 1V will depend on the balance between the active\npower produced by DGs/BESS, PG, and the load on the\nnetwork PL . Hence, the change in voltage 1V can be positive,\nindicating voltage drop, or negative indicating a voltage rise.\nSince the power generated by renewable DGs can ﬂuctuate\ndue to their intermittent nature, the change in voltage 1V is\nnot easy to predict. In addition, when the power generated,\nPG is greater than the network load, PL , the voltage rises,\nand when PG is lower than PL , voltage drops. It is this\nunpredictability and dynamic nature of a power distribution\nnetwork with DGs that makes the conventional techniques\nthat rely on predictability inadequate. Furthermore, since the\nproposed algorithm is tested on a medium voltage grid where\nR ≈X, both reactive power and active power will signif-\nicantly affect the network voltage as illustrated by Equa-\ntion 3 [34]. Hence, the balance between the reactive power\ngenerated by DGs QG and the reactive load QL will also affect\nthe voltage. However, the exchange of DG reactive power\nwith the power system to inﬂuence voltage will increase the\nover-all reactive power transmitted by the power system, and\nhence affect the power system power factor. The power factor\nis depicted by Equation 4 where PF is power factor, P is active\npower, S is apparent power and Q is reactive power [32].\nPF =P\nS = P√\nP2 +Q2\n(4)\nA lower power factor indicates a non-efﬁcient power sys-\ntem with high power losses that will lead to excessive volt-\nage drop [35]. Therefore, the scheme designed in this paper\nwill coordinate DGs, BESS, SVR and OLTC to effectively\nregulate voltage in the presence of DGs and also boost the\npower factor. The location of a DG on the power distribution\nnetwork is also signiﬁcant, as it determines the impact that the\nDG will have on voltage. DGs that are connected further away\nfrom the substation will have the highest impact on voltage.\nThis is because the location furthest from the substation will\nhave the lowest short circuit capacity (SSC), resulting in a\nweak power network. The SSC is the maximum short circuit\ncurrent that would ﬂow if a fault occurred at a location.\nThe SSC also determines the strength of a network, where\na high SSC indicate a strong network where voltage cannot\nbe easily inﬂuenced, whereas a low SSC indicate a weak\nnetwork where voltage can be easily inﬂuenced. The SSC can\nbe expressed by Equation 5 where E is the equivalent voltage\nand Z is the impedance from the source to the location of\nassessment [36].\nSSC =E\nZ (5)\nSince long power distribution lines will have a high\nimpedance towards the end, it will result in a low SSC, and\na weak network where DGs can severely impact the voltage.\nIt is this reason DGs connected towards the end of long power\ndistribution lines cause the highest voltage change.\nV. PROBLEM STATEMENT\nThe intermittent nature of renewable power generation cre-\nates voltage ﬂuctuation challenges that the OLTC and SVR\ncannot act fast enough to mitigate. In addition, when the\nweather conditions are conducive, and the network load is\nlow, the high active power generation by renewable energy\nsources result in extreme voltage magnitudes that surpass\nacceptable limits, and the existing technique of the OLTC\nand SVR is not adequate to suppress them. Since the South\nAfrican power distribution network has multitudes of long\ndistribution lines, the voltage ﬂuctuations and extreme volt-\nage magnitudes will be worse when DGs are connected.\nFurthermore, these long distribution lines also experience low\nvoltage magnitudes during peak loading conditions that coin-\ncide with low DG generation. These low voltage magnitudes\nexperienced during peak loading conditions are the reason\nlong power distribution lines have SVRs installed. Since these\nlong distribution lines will experience high voltage magni-\ntudes when DGs are generating high active power, and also\nexperience low voltage magnitudes when the peak load is\nexperienced during DG low generation period, a BESS is the\noptimal equipment to manage voltage regulation.\nHowever, the power distribution network will now have\nmultiple devices regulating voltage including the BESS,\nOLTC, DGs and the SVR. If not properly coordinated, a con-\nﬂict will arise between devices, leading to excessive oper-\nation and the over-utilization or under-utilization of some\ndevices. Therefore, a system is designed that coordinates\nDGs, BESS, SVR and OLTC to avert extreme voltage mag-\nnitudes and voltage ﬂuctuations. In addition, the designed\nscheme will regulate the output active power produced by\nDGs when the BESS, OLTC and SVR fail to maintain\nacceptable voltage magnitudes. Furthermore, the system will\nalso monitor and boost power factor as the reactive power\ndemand/supply changes with changing voltage magnitudes.\nTherefore, the objective of the proposed scheme can be\ndeﬁned by Equations 6-9, where f is the objective function,\nVn is the nominal voltage, Vavg is the feeder average voltage,\nPGi and PLi are the generated active power and load, QGi\nand QLi are the generated reactive power and reactive power\ndemand, Vi and Vk are any two buses that power is transferred\nbetween, Gik and Bik are components of the Y bus matrix,\nVmin and Vmax are the minimum and maximum prescribed\nvoltage limits, respectively, and δis the voltage angle.\nf = min\n(dVavg\ndt\n)\n+min\n(⏐⏐Vn −Vavg\n⏐\n⏐)\n+max\n(\nP\n√\n(P2 +Q2\n)\n(6)\ns.t Vmax ≥V ≥Vmin (7)\nPGi −PLi −Vi\n∑n\nk=1 Vk (Gik cosδik +Bik sinδik )=0\n(8)\nQGi −QLi −Vi\n∑n\nk=1 Vk (Gik sinδik −Bik cosδik )=0\n(9)\nVOLUME 9, 2021 108735\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nIn Equation 6, the ﬁrst term of minimizing instantaneous\nvoltage change will be achieved by both DGs and BESS since\nthey have a fast response time. Instantaneous voltage change\nwill occur when the weather suddenly changes, when a cloud\npasses over the photovoltaic plant for solar plants or a sudden\ndrop in wind speed for wind plants. The sudden drop in DG\nactive power generation and the resulting drop in voltage will\ntrigger DGs to export more reactive power and the BESS to\ndischarge and minimize the voltage drop. The second term\nin Equation 6 of minimizing the difference between nominal\nvoltage and the feeder average voltage is a long-term voltage\nregulation process that will be achieved by DGs, BESS, SVR\nand OLTC. As the voltage gradually changes due to a gradu-\nally changing load or a gradual change in DG generation, DGs\nwill constantly adjust their reactive power output, BESS will\nconstantly adjust its charging/discharging magnitude, and the\nOLTC and SVR will constantly change tap position with the\nobjective of keeping the feeders average voltages close to\nnominal voltage throughout the day.\nThe last term in Equation 6 of maximizing the power factor\nwill be achieved by DGs as they transfer reactive power to\nand from the power distribution network. The power factor\nwill be measured at the substation power transformer since\nthat is where the power distribution network total reactive\npower can be measured. The last term of maximizing power\nfactor is added since DGs that are exporting/importing a small\nmagnitude of reactive power due to low voltage deviation\nfrom the nominal voltage at their POC will be made to\nincrease or decrease their reactive power output to compen-\nsate for the reactive power demand of those DGs export-\ning/importing high magnitude of reactive power due to high\nvoltage deviation at their POC, improving the power factor\nthereof. Equation 7 represent a critical condition that ensures\nthat as the control system operates, all voltage magnitudes\nare kept between the prescribed maximum and minimum\nvoltage limits. Equations 8-9 are power ﬂow equations that\nportray the ﬂow of both active and reactive power in a power\nsystem [16]. Therefore, to determine the power distribution\nnetwork bus voltages based on power ﬂow, Equations 8-9 are\nutilized. Since the proposed control scheme requires several\nvoltage magnitudes, on selected locations to compute its\nsetpoints, those voltages are computed through Equation 8-9.\nThe power distribution network used to assess the proposed\ncontrol scheme is modelled using Matlab Simulink, hence\nMatlab Simulink relied on Equations 8-9 to compute selected\nvoltage magnitudes used as inputs to the control system based\non active and reactive power ﬂow.\nVI. PROPOSED CONTROL SYSTEM\nSince the control system is controlling multiple devices,\nit will use a sequence that prioritizes devices based on\nresponse time, robustness, and impact. Since DGs and BESS\nboth have fast response time, DGs are more robust. This\nis because continuously charging and discharging a BESS\ncan signiﬁcantly affect its lifespan, whereas continuously\nexporting and importing reactive power from a renewable\nDG does not signiﬁcantly affect its life span. Therefore, DGs\nwill regulate voltage through reactive power ﬁrst, to minimize\nthe charging-discharging cycles on the BESS, extending the\nBESS lifespan thereof. The BESS will go second with its\ncharge/discharge capability. The OLTC and SVR also have\nsimilar response time and robustness. This is because they\nare both mechanical, and experience wear and tear when\nsubjected to frequent operation.\nHowever, their impact on the electrical network they reg-\nulate is different. The SVR will only change voltage on\nthe section of a feeder that it is connected to, whereas an\nOLTC has a global impact and changes voltage on all feeders\nsimultaneously. Therefore, the SVR will go third, and the\nOLTC going last. This is because when voltage on a section of\na feeder is well regulated, it improves the overall power distri-\nbution system average voltage, and hence reduces the number\nof tap positions that the OLTC must change. In addition,\nit has been highlighted in literature that the introduction of\nDGs will result in excessive tap operation by the OLTC [37].\nIt is because of this reason that the control system hierarchy\nallows DGs to regulate voltage ﬁrst, BESS going second,\nSVR going third, and OLTC going last. Therefore, by allow-\ning DGs and BESS to regulate voltage ﬁrst, the number of tap\npositions that the OLTC and SVR must alter will be reduced\nwhen large voltage disturbances occur. When small voltage\ndisturbances occur, DGs and BESS will be able to control\nthem without assistance from the OLTC and SVR.\nHowever, a BESS has a limited lifespan, it is this reason\nsome techniques proposed in the past have limited the BESS\nto one charge and discharge per day [38]. However, limiting\na BESS to one charge and discharge per day will result in the\nBESS not being available to assist in voltage regulation most\nof the times, since voltage might rise and drop multiple times\na day when DGs are connected, hence reducing the BESS\navailability factor. Therefore, considering the high price of\na BESS, a strategy proposed must ensure that the availability\nfactor of the BESS is high, and the lifespan is long. Therefore,\nthe strategy proposed in this paper suggests the usage of a\nVanadium redox battery technology. The Vanadium redox\nbattery technology has a lifespan of up to 10 000 cycles,\nwhen cycled to its minimum SOC, this is three times that\nof lithium-ion that has up to 3000 cycles and ten times that\nof lead-acid that has up to 1 000 cycles [39]. When not\ncycled to its minimum SOC, the lifespan of a Vanadium\nredox battery is longer than 10 000 cycles. A 4MW,6MWh\nVanadium redox BESS installed in Tomamae Wind Villa,\nJapan, has been cycled 270 000 times, down to different\nSOCs, indicating the robustness of this technology [40]. The\noverall illustration of the proposed voltage regulation scheme\nis shown in Figure 1. Based on Figure 1, it can be observed\nthat the central controller receives voltage, active and reactive\npower measurements from selected locations on the power\ndistribution network. The central controller then computes\nsetpoints for each of its four devices. The operation of each\nof the four devices that the central controller controls is\nexplained in steps 1-5.\n108736 VOLUME 9, 2021\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nFIGURE 1. Overall illustration of the proposed control scheme.\nStep 1: The system will measure voltage where a DG\nis connected and then determine the quantity of reactive\npower a DG must absorb/inject to control voltage from Equa-\ntions 10 where QDG is the expected reactive power, VDGPOC\nis the DG POC voltage, Vn is the nominal voltage, Qmax is the\nDG maximum reactive power capacity, and Sq is a sensitivity\nindex that illustrates the extent to which voltage is inﬂuenced\nby reactive power where the DG is located.\nQDG =Vn −VDGPOC\nSq\n×Qmax (10)\nA higher Sq resembles a network where voltage is highly\ninﬂuenced by reactive power, and hence a smaller magnitude\nof reactive power is needed to change voltage. On the other\nhand, a smaller Sq resembles a network in which voltage\nis slightly inﬂuenced by reactive power, and hence a high\nreactive power quantity will be needed to change voltage.\nThe sensitivity index Sq is assessed as the ratio between a\nvoltage of 0.01p.u and the amount of reactive power desired\nto raise the voltage by 0.01p.u at the point of interest. Based\non Equation 10, the scheme will instruct a DG to export\nreactive power when VDGPOC is less than Vn and import\nreactive power when VDGPOC is greater than Vn. Therefore,\nEquation 10 will be utilized by the system to determine the\nDG reactive power response with respect to voltage for all\nDGs.\nStep 2: The system will control the BESS as shown in\nFigure 2 where POC_V is the BESS POC voltage and Avg_V\nis the average voltage of the feeder which the BESS is con-\nnected to.\nThe system will use the voltage magnitude where the BESS\nis connected and the average voltage of the feeder which the\nBESS is placed on to determine the magnitude of active power\nthe BESS must discharge/charge. This allows the system\nto use the BESS not only to regulate BESS POC voltage,\nbut to regulate the entire feeder voltage as well. Therefore,\nif the BESS POC voltage deviate from deﬁned limits, the\nsystem will activate the BESS, similarly, if the feeder average\nFIGURE 2. Flow chart for BESS control.\nvoltage deviate from deﬁned limits, the system will activate\nthe BESS.\nThe feeder average voltage will be computed using all volt-\nage magnitudes measured within the feeder including voltage\nat the end of a feeder, DGs POC, the secondary and primary\nside of the SVR, BESS POC and the substation busbar. These\nare critical locations where the highest or the lowest voltage\nmagnitudes are more likely to occur on a power distribution\nfeeder when DGs are introduced. Hence, using voltage mag-\nnitudes from these locations gives an accurate feeder average\nvoltage. Measured voltage magnitudes will be transmitted\nthrough the supervisory control and data acquisition system\n(SCADA). Equation 11 shows how the feeder average voltage\nis computed where Vavg is the feeder average voltage, N\nis the number of voltage magnitudes measured and Vm is a\nmeasured voltage magnitude.\nVavg =\n∑N\n1\nVm\nN (11)\nVOLUME 9, 2021 108737\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nAccording to Figure 2, a dead band of 0.02p.u from nom-\ninal voltage is given to the operation of the BESS. There-\nfore, the system will start charging the BESS above 1.02p.u\nand start discharging the BESS below 0.98p.u. The charging\npower will increase as the voltage rises further above 1.02p.u,\nsimilarly, the discharging power will increase as the voltage\nmoves further below 0.98p.u. However, between 0.98p.u and\n1.02p.u, the system can still charge the BESS if the SOC\nis below 60%. This is to ensure that the BESS does not\nremain discharged as this will damage the BESS. In addition,\nbetween 0.98p.u and 1.02p.u, the system will stop charging\nthe BESS when the SOC reaches 60%. This is to ensure that\nthe BESS is always available to control voltage when either\nhigh or low voltage magnitudes occurs, since it will not be in\na fully charged or completely discharged state.\nStopping at an SOC of 60% while charging is only appli-\ncable when both the POC voltage and the feeder average\nvoltage are between 0.98p.u and 1.02p.u. When either the\nPOC voltage or the feeder average voltage is above 1.02p.u,\nthe system can charge the BESS to an SOC of 90%. As shown\nin Figure 2, the system will use both the BESS POC voltage\nand feeder average voltage to control the BESS. If the BESS\nPOC voltage and the feeder average voltage are both above\n1.02p.u, and the BESS SOC is above 90%, the BESS will not\nbe charged as this may overcharge and damage the BESS.\nWhen the BESS POC voltage and the feeder average voltage\nare both above 1.02p.u, and the BESS SOC is below 90%,\nthe control scheme will compute the quantity of active power\nthe BESS should import/charge based on the highest voltage\nmagnitude between the BESS POC voltage and the feeder\naverage voltage with a relationship reﬂected in Equation 12,\nwhere PBESS is the desired BESS active power, Vhigh is the\ndeﬁned voltage where the BESS must start charging, VPOC is\nthe BESS POC voltage, Sp is a sensitivity index that illustrates\nthe extent to which voltage is inﬂuenced by active power at\nthe BESS POC, and Prated is the BESS rated active power.\nSimilar to Sq, the sensitivity of voltage to active power index\nSp will be calculated as the ratio between a voltage of 0.01p.u\nand the amount of active power needed to raise the voltage by\n0.01p.u at the POC.\nPBESS =Vhigh −max\n(\nVPOC ,V avg\n)\nSp\n×Prated (12)\nTo ensure that the system does not over charge or com-\npletely discharge the BESS, Equation 12 will be implemented\nin combination with the charging-discharging curve of\nFigure 3.\nThe charging-discharging curve of Figure 3 is only appli-\ncable above a voltage of 1.02p.u and below a voltage of\n0.98p.u. Between 0.98p.u and 1.02p.u, the BESS can only\nbe charged up to an SOC of 60%. As shown in Figure 3,\nwhen the SOC exceeds 75%, the charging power will be\ngradually reduced to prevent overcharging the BESS. The\ncharging will be completely halted when the SOC reaches\n90%. The BESS charging is halted at an SOC of 90% since\nSOC is an estimated variable based on BESS voltage, and\nFIGURE 3. BESS charging-discharging curve.\nallowing it to get close to 100% increases the chances of\novercharging the BESS. The discharging power will also be\ngradually reduced when the SOC goes below 30% to prevent\na complete discharge of the BESS. The discharge will be\ncompletely stopped when the SOC reaches 20%. Therefore,\nafter calculating the BESS charging power using Equation 12,\nthe system will utilize the maximum value attained between\nEquation 12 and Figure 3 based on the BESS SOC.\nThe maximum value between Equation 12 and Figure 3 is\nused since the direction of power ﬂow on both Equa-\ntion 12 and Figure 3 will yield a negative value while charg-\ning, and hence the maximum value will be the least magnitude\nof charging active power. When both the BESS POC voltage\nand the feeder average voltage are below 0.98p.u, the BESS\nwill need to start discharging to boost voltage magnitudes.\nThe discharging power of the BESS will be in accordance\nwith Equation 13 and Figure 3, where Vlow is the deﬁned\nlow voltage where the BESS must start discharging. The\nsystem will utilize the lowermost discharging power attained\nbetween Equation 13 and Figure 3. The minimum value\nbetween Equation 13 and Figure 3 is used since the direction\nof power ﬂow on both Equation 13 and Figure 3 will yield\na positive value while discharging, and hence the minimum\nvalue will be the least magnitude of discharging active power.\nPBESS =Vlow −min\n(\nVPOC ,Vavg\n)\nSp\n×Prated (13)\nWhen either the BESS POC voltage or feeder average\nvoltage is above 1.02p.u, and the other one is above 0.98p.u,\nthe BESS will charge with a charging power determined\nby Equation 12 and Figure 3. When either the BESS POC\nvoltage or the feeder average voltage is below 0.98p.u, and the\nother is below 1.02p.u, the BESS will discharge in accordance\nwith Equation 13 and Figure 3. When both the BESS POC\nvoltage and the feeder average voltage are between 0.98p.u\nand 1.02p.u, the BESS will be charged if the SOC is below\n60%. This is to ensure that the BESS does not remain in a\n108738 VOLUME 9, 2021\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\ndischarged state, but it is still able to charge should a high\nvoltage magnitude be detected. The charging power between\n0.98p.u and 1.02p.u will be in accordance with Equation 13.\nAlthough Equation 13 was used to calculate the discharging\npower when the measured voltage is below Vlow, it can also\nbe used to calculate the charging power when the measured\nvoltage magnitude is above Vlow, but below Vhigh. This is\nbetween 0.98p.u and 1.02p.u. Therefore, Equation 13 will\nalso be used to calculate the charging power when both the\nBESS POC voltage and the feeder average voltage magni-\ntudes are between 0.98p.u and 1.02p.u.\nEquation 13 ensures that the charging power between a\nvoltage of 0.98p.u and 1.02p.u does not cause the lowest\nvoltage magnitude between the BESS POC and the feeder\naverage voltage to drop below 0.98p.u. In addition, when\ncharging the BESS when both the BESS POC voltage and\nthe feeder average voltage are between 0.98p.u and 1.02p.u,\nthe charging-discharging curve of Figure 3 is not applicable,\nsince charging will stop when SOC gets to 60%. When either\nthe BESS POC voltage or feeder average voltage is above\n1.02p.u and the other is below 0.98p.u, the system cannot use\nthe BESS to control voltage, hence the BESS will keep its cur-\nrent state. This is because regulating one voltage will worsen\nthe other. To incorporate Equation 12 for charging when the\nvoltage is above 1.02p.u, Equation 13 for discharging when\nvoltage is beneath 0.98p.u, Equation 13 for charging when\nvoltage is between 0.98p.u and 1.02p.u, and Figure 3, a fuzzy\nlogic controller was used. When determining the active power\nrating of the BESS to be installed, the efﬁciency of the battery\ntechnology in use must be considered. Therefore, the active\npower rating of the BESS to be installed must be calculated\nbased on Equation 14, where BESSP is the BESS active power\nrating, PCalc is the active power required to boost/suppress\nvoltage calculated based on network voltage sensitivity, and\nηis the battery technology efﬁciency in per unit.\nBESSP =PCalc +(PCalc ×(1 −η)) (14)\nUsing Equation 14 will ensure that the BESS installed can\ndeliver the active power required. If the efﬁciency of the\nBESS is not considered, the BESS installed will deliver a\nsmall amount of active power than required.\nStep 3:The system will control the SVR and the OLTC\nfrom attained average voltage magnitudes. The SVR will\nuse the average voltage obtained from measuring voltage\nmagnitudes on the section of the feeder that it regulates. These\nvoltage magnitudes will include voltage at the end of the\nfeeder, DGs and BESS POCs, and the location where the\nSVR is connected on both its secondary and primary sides.\nThe system will also control the OLTC based on the average\nvoltage of all feeders connected to it. The locations where\nvoltage will be measured will include the DG POC, BESS\nPOC, SVR POC, substation busbar and the end of feeders.\nThese points will be measured in all feeders that the OLTC\nis regulating. The reason for measuring voltage in these loca-\ntions is that they are the critical locations where the highest\nor the lowest voltage magnitudes are more likely to occur\nwhen DGs are introduced. Therefore, computing an average\nvoltage based on the highest and lowest voltage magnitudes\ngives a more accurate average voltage. Based on all voltage\nmagnitudes that have been measured in different locations,\nthe control scheme will then determine the average voltages\nand the reference voltages for both the SVR and OLTC in\naccordance with Equations 15 and 16 where VSVR and VOLTC\nare the SVR and OLTC reference voltages, respectively, Vp is\nany voltage magnitude measured within the section the SVR\nis regulating, Va is any voltage magnitude measured within all\nfeeders the OLTC is regulating, N is the number of voltage\nmagnitudes measured within the section of the feeder the\nSVR is regulating, M is the number of voltage magnitudes\nmeasured in all feeders the OLTC is regulating, and Vn is the\nnominal voltage.\nEquation 15 will compute the SVR reference voltage such\nthat the average voltage of the section the SVR regulates is\nclose to nominal voltage. Similarly, Equation 16 will compute\nthe OLTC reference voltage such that the average voltage of\nthe feeders the OLTC regulates is close to nominal voltage.\nSince Equations 15 and 16 uses real time voltage magnitudes\nto produce the reference voltages, the reference voltages will\nnot stay ﬁxed, they will change with respect to the measured\nvoltage magnitudes. Therefore, the control system will ensure\nthat the SVR and the OLTC changes their tap positions to\nmatch their respective reference voltage with the measured\nvoltage where they are located. To prevent tap position hunt-\ning, an error margin will be introduced. Therefore, for the\ntap position change signal to stop, the measured voltage must\nbe within a deﬁned tolerance margin from the calculated\nreference voltage.\nVSVR =\n∑N\na=1\nVn −Vp\nN +Vn (15)\nVOLTC =\n∑M\na=1\nVn −Va\nM +Vn (16)\nTo avoid concurrent operation between the SVR and the\nOLTC, which might lead to conﬂict between equipment,\nthe OLTC will wait for the SVR to match its computed\nreference voltage with its POC voltage or reach the mini-\nmum/maximum tap position. Once the SVR has matched its\ncomputed reference voltage with its POC measured voltage\nor has reached maximum/minimum tap position, the system\nwill activate the OLTC. The ﬂow chart of Figure 4 shows\nthe SVR and OLTC sequential operation where Ref_V is the\nSVR computed reference voltage and V_SVR is the voltage\nmeasured on the secondary side of the SVR.\nAs shown in Figure 4, the OLTC will wait for the SVR\nto equalize its reference voltage with the measured voltage\nor reach the maximum/minimum tap position before it starts.\nThe sequence of allowing the SVR to control voltage ﬁrst will\nallow feeder voltage magnitude to improve before the OLTC\nstart regulating, as the OLTC regulate multiple feeders simul-\ntaneously and the SVR regulate one feeder. Therefore, if high\nvoltage magnitudes are experienced in a feeder, the SVR will\nsuppress the high voltage magnitude ﬁrst. This will reduce\nVOLUME 9, 2021 108739\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nFIGURE 4. SVR and OLTC operational sequence.\nthe number of tap positions the OLTC has to change. In oper-\nation, both the SVR and OLTC will change tap positions\nuntil the reference voltages calculated in Equations 15-16 are\nwithin a deﬁned error margin from their respective measured\nPOC voltages or they have reached minimum/maximum tap\nposition.\nStep 4: If the procedures deﬁned in steps 1-3 cannot\nsuccessfully reduce a DG POC voltage below the upmost\nprescribed voltage Vmax , the system will reduce the active\npower generation of the DG located at that point where the\nvoltage is still above Vmax . The system will calculate the DG\nactive power based on Equation 17, where Pexport is the\nnew active power value the DG must generate and export\nafter the active power reduction process, PGen is the initial\nactive power value that the DG is generating and injecting\nto the distribution network before the active power reduc-\ntion process, Vmax is the upmost prescribed voltage limit,\nVerror is the prescribed error margin above Vmax , VDGPOC\nis the DG POC voltage, and Sp is the sensitivity index that\nillustrates the impact active power has on the voltage at the\nDG POC.\nPexport =PGen −\n(VDGPOC −(V max +Verror)\nSp\n×PGen\n)\n(17)\nBased on Equation 17, the amount of DG output active\npower reduced will be proportional to the difference between\nthe DG voltage at its POC and the upmost prescribed voltage\nVmax . A high difference between the two voltage magnitudes\nwill prompt a higher reduction in active power produced\nby the DG. The control system will follow the sequence\nof Figure 5 in reducing the active power of DGs where\nRef_V_SVR is the SVR reference voltage, V_SVR is the\nSVR measured voltage, Ref_V_OLTC is the OLTC refer-\nence voltage, V_OLTC is the OLTC measured voltage and\nPavailable is the peak possible power a DG can generated\nbased on primary energy source availability. An error margin\nVerror will also be introduced above Vmax to prevent DGs\nfrom reducing active power generation when the voltage\nFIGURE 5. DG active power reduction/recovery process.\ncould still recover. However, when the voltage goes beyond\nVmax +Verror, and the OLTC and SVR have operated, the\nchances of voltage recovery are slim. Therefore, DGs will\nonly be instructed to reduce active power generation when\ntheir POC voltage has surpassed Vmax +Verror, and the OLTC\nand SVR cannot act.\nThe operation of the process in Figure 5 can be explained as\nfollows. If a voltage above Vmax +Verror is measured at any\nDG POC, the system will assess the state of the OLTC and\nSVR before proceeding to reduce active power production for\nthat DG.\nIt is only when the voltage at the DG POC is still higher\nthan Vmax +Verror, and both the SVR and OLTC have equal-\nized their calculated reference voltages with the measured\nvoltages or have reached minimum/maximum tap position\nthat the system will issue an instruction for the DG linked\nto that respective POC to reduce active power generation and\nalso calculate the new active power value that the DG must\nreduce to. Checking for the SVR and OLTC status is done to\nensure that all voltage regulation measures have taken place,\nand high voltage is persistent. If these checks are not per-\nformed, the system might reduce the DG active power unnec-\nessarily when the voltage regulation equipment could have\nsuccessfully regulated voltage to acceptable range. Reducing\nDG active power generation reduces revenue, demotivate\ninvestors from building more DGs, and decelerate the world’s\nobjective of moving towards renewable energy. Therefore,\nreducing DG active power generation will only be done when\nthere is no other option to curb rising voltage magnitudes.\n108740 VOLUME 9, 2021\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nIn reducing active power generation, the system will use\nEquation 17.\nTo ensure that the DG does not get caught in a loop of con-\ntinuously increasing and decreasing active power generation,\nthe system will only attempt to increase active power once\nthe DG POC voltage goes below 1.03p.u. The increase of\nDG active power once the DG POC voltage has gone below\n1.03p.u will be in accordance with Equation 18, where Pexport\nis the new active power value that the DG must generate\nand export after the active power increment process, and\nPGen is the active power value that the DG is producing\nright before the active power increment process is carried\nout.\nPexport =PGen +\n(Vmax −VDGPOC\nSp\n×PGen\n)\n(18)\nSince Equation 18 will only attempt to increase active\npower of a DG such that the DG POC voltage does not\nexceed Vmax , it might not increase active power to the level\nit was before reduction. However, modern renewable DGs\ncan compute their peak possible/available power based on\nprimary energy source availability, e.g. wind speed or solar\nirradiance. Therefore, the system will continuously compare\nthe active power the DG is generating with the DG peak\npossible/available active power based on weather conditions.\nIf the active power the DG generates after increasing power\ngeneration has not reached possible/available peak power due\nto voltage constraints, the system will monitor the DG POC\nvoltage and keep trying to increase active power generation\nas the voltage drops until generated power is similar to the\ncalculated peak possible/available power. However, the sys-\ntem will not force the DG to violate voltage limits in effort to\nincrease active power generation.\nStep 5:Since modern DGs have reactive power capability\nand can inﬂuence voltage through reactive power as demon-\nstrated in step 1, the exportation and importation of reactive\npower in effort to support voltage alters the power system\npower factor. The proposed control scheme has a strategy\nto improve this power factor that will be reduced as DGs\nimport/export reactive power to control voltage. Therefore,\nDGs that are not participating in voltage control through\nreactive power or those that are exporting/importing a trivial\nmagnitude of reactive power due to low voltage deviation\nfrom nominal voltage at their POC will be used to compensate\nthe power distribution network reactive power demand, and\nboost the power factor. DGs exporting/importing high mag-\nnitude of reactive power due to high voltage deviation from\nnominal voltage at their POC cannot be used for power factor\ncorrection, as this might make their voltage deviation worse.\nFurthermore, DGs exporting/importing high reactive power\nmagnitude to control voltage are the ones with a negative\nimpact on the power system power factor. It is this reason\nthat only DGs with a POC voltage deviation that requires\na reactive power output less than 30% of the DG reactive\npower rating will be nominated for power factor correc-\ntion. These DGs are nominated since importing/exporting a\nlow magnitude of reactive power indicate that they do not\nhave voltage problems where they are connected. Therefore,\nthe control system will give these DGs new reactive power\nsetpoints that allows them not to control voltage only, but also\nenhance the power system power factor. These DGs that are\nexporting/importing low reactive power to regulate voltage\nare then used as capacitors/inductors to provide/consume\nextra reactive power to enhance power system power factor.\nWhile performing power factor correction, the control\nscheme will depend on the reactive and active power that\npasses through the substation power transformer to compute\nthe power factor. Once the power system power factor has\nbeen computed, the system will select DGs it will utilize\nto boost the power factor. As stated earlier, the scheme will\nselect those DGs with a POC voltage deviation that requires\na DG reactive power output less than 30% of the DG reac-\ntive power rating. DGs with a POC voltage deviation that\nrequires reactive power output equal or greater than 30%\nof the DG reactive power rating will be solely focused on\ncontrolling voltage. The control scheme will then compute\npower factor enhancement setpoints for selected DGs based\non Equations 19-22. Equation 19 will be used to assign\nthe maximum reactive power that each nominated DG must\nexport/import, where QDG is the maximum power factor\nenhancement reactive power that each nominated DG must\ngenerate to completely correct the power factor at the substa-\ntion, QMeasured is the total distribution system reactive power\ndemand measured at the substation, and z is the total num-\nber of DGs nominated for power factor enhancement [15].\nTherefore, Equation 19 will determine the maximum reactive\npower that each DG selected for power factor reﬁnement\nmust export/import to enhance power factor back to unity.\nEquation 19 will also ensure that the reactive power to be\ncompensated is evenly distributed through all DGs selected\nfor power factor enhancement.\nQDG =QMeasured\nz (19)\nHowever, the system will need to conﬁrm if each of the\nnominated DGs can export/import the required maximum\nreactive power QDG considering the POC voltage. The sys-\ntem will then use Equations 20-21, where Qpossible is the\npossible peak reactive power a DG is able to exchange with\nthe network considering its POC voltage, VDGPOC is the\nDG POC voltage, Vmax and Vmin are the upmost and low-\nermost prescribed voltages, respectively, Qmax is the DG\nmaximum rated reactive power capacity, and Sq is the sen-\nsitivity index illustrating the inﬂuence reactive power has on\nPOC voltage.\nQPossible =\n(Vmin −VDGPOC\nSq\n)\n×Qmax , QMeasured <0\n(20)\nQPossible =\n(Vmax −VDGPOC\nSq\n)\n×Qmax , QMeasured >0\n(21)\nVOLUME 9, 2021 108741\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nOnce the system has determined the reactive power each\nDG is capable of generating without exceeding the prescribed\nvoltage magnitudes Vmax and Vmin, it will then compare\nEquations 19 and 20, and utilize the highest value, or com-\npare Equations 19 and 21, and use the lowest value. The\ndecision to either compare Equation 19 with Equations 20 or\n21 will depend on the direction of reactive power measured\nat the substation transformer. Therefore, DGs nominated for\npower factor correction will be exporting/importing a sum\nof two reactive power magnitudes, which is the reactive\npower for voltage regulation given by Equation 10, and\nthe reactive power for power factor enhancement given by\nEquations 19-21. Therefore, the reactive power setpoint for\na DG nominated for power factor enhancement can be rep-\nresented by Equation 22, where QV _PF is the nominated\nDG reactive power setpoint, QV is the reactive power for\ncontrolling voltage computed based on Equation 10, and QPF\nis the reactive power for power factor enhancement computed\nbased on Equations 19-21.\nQV _PF =QV +QPF (22)\nHowever, as a DG selection criterion for it to be eligible\nfor boosting power factor, the reactive power for control-\nling voltage, QV , will be small, and below 30% of the DG\nreactive power rating. The reactive power setpoints of DGs\nnot selected for power factor enhancement will be computed\nbased on Equation 10 only.\nSince exporting/importing below 30% of the DG max-\nimum rated reactive power is a requirement for it to be\neligible for power factor enhancement, POC voltage get-\nting close to Vmax or Vmin will be the criteria for with-\ndrawing a DG from power factor enhancement. To ensure\nthat the minimum and maximum prescribed voltage lim-\nits are not violated, the controller will withdraw a DG\nfrom power factor correction when its POC voltage gets to\n(Vmax −0.01p.u) or (Vmin +0.01p.u). Once a DG is withdrawn\nfrom power factor correction, the controller will use it solely\nfor voltage regulation in accordance with Equation 10, until\nit meets the requirements of being used for both voltage\nregulation and power factor reﬁnement again, in accordance\nwith Equation 22. Furthermore, when the power factor as\nmeasured at the substation power transformer is above 0.98,\nthe controller will not engage any DG for power factor\nenhancement.\nVII. RESULTS AND ANALYSIS\nTo assess the efﬁciency of the proposed scheme, two South\nAfrican 22kV lines that are supplied from the same substation\nwere used as shown in Figure 6. The substation consists of a\n132/22kV , 40MV A, power transformer ﬁtted with an OLTC.\nOne feeder has an SVR installed. DGs were also added to the\nfeeders. These DGs were added based on the network SSC,\nsince the network voltage is easily inﬂuenced by active and\nreactive power where the SSC is low, and resistant to change\nwhere the SSC is high [5]–[7]. Hence, DGs were distributed\nthrough areas of medium and low SSC. Since the highest SSC\nFIGURE 6. A power distribution network with DGs, BESS, SVR, OLTC and\ncontroller interconnections.\nof a power distribution network is at the substation busbar,\nand it reduces with the length of the feeder. The area of\nmedium SSC was identiﬁed at the middle of the feeder, and\nthe area of low SSC towards the end of the feeder. Therefore,\nDGs were located in the middle, and towards the end of the\nfeeder. The reason for distributing DGs in areas of medium\nand low SSC was to observe the highest change in voltage\nmagnitudes. In addition, in real world operation, it is the\nDGs in medium and low SSC networks that cause the highest\nchange in voltage magnitudes, and this control system was\nintended to alleviate that problem.\nThe maximum rated reactive power capacity of all DGs\nwill be in relation to the South African grid connection code\nfor renewable power plants which dictates that category B\nplants should have reactive power capacity that is 22.8% of\ntheir maximum rated active power [41]. A BESS was also\nadded to both feeders. To ensure that the BESS assist the\nnetwork during high DG generation period that coincide with\nlow loading conditions, and during low DG generation period\nthat coincide with peak loading conditions, the BESS was\nlocated at a point on the feeder where the voltage breaches\nthe minimum prescribed voltage Vmin, during feeder peak\nload, and in the absence of DG generation. Therefore, the\nlocation of the BESS will be remarkably close to the loca-\ntion of the SVR. The rating of each of the two BESS was\ndecided based on the sensitivity index Sp that illustrates\nthe impact of active power on voltage where the BESS is\nlocated.\nSince the BESS is placed in a location of the feeder where\nvoltage breaches Vmin, the BESS must have enough active\npower such that it can boost the voltage from Vmin, to a value\nabove nominal voltage. The minimum prescribed voltage,\nVmin, will be taken as 0.95p.u, and the value above nom-\ninal voltage will be taken as 1.03p.u. Through simulation,\nit was discovered that 0.45MW of active power is required\nto raise the voltage by 0.01p.u where BESS 1 is placed on\n108742 VOLUME 9, 2021\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nfeeder 1. Hence, BESS 1 must have a minimum output power\nof 3.6MW in order to change the voltage from 0.95p.u to\n1.03p.u where it is connected. Similarly, 0.51MW of active\npower is required to raise the voltage by 0.01p.u where BESS\n2 is connected on feeder 2. Hence, BESS 2 must have a min-\nimum output power of 4.08MW in order to raise the voltage\nfrom 0.95p.u to 1.03p.u. Considering a 90% efﬁciency for\nthe battery technology in BESS 1, and 80% efﬁciency for\nthe battery technology in BESS 2, BESS 1 was designed to\nbe a 4MW/12MWh system, and BESS 2 was designed to\nbe a 5MW/15MWh system. The maximum DG active power\noutput was set to 7MW, this was the power required to cause\nreverse power ﬂow and excessive voltage magnitudes given\nthe loading on feeders 1 and 2. Figure 6 shows the power\ndistribution network utilized.\nTwo 22kV feeders are supplied by the power transformer\nas shown in Figure 6, and feeders 1 and 2 are 69km and 57km\nlong, respectively. The load on feeders 1 and 2 is 8.43MW and\n6.78MW, respectively. The interconnections between the pro-\nposed controller and the power distribution network equip-\nment are also illustrated. The power distribution network of\nFigure 6 is simpliﬁed to show the interconnections, the real\nfeeders extend outwards in a complex tree-like structure.\nFurthermore, in simulation, the real-world operation time of\nequipment was accelerated for better analysis and presenta-\ntion of results. However, this does not affect their impact on\nthe power system. Hence, the response of the power system\nwill still mimic that of a real-world power system.\nTo minimize the amount of data transmitted through\nSCADA, and avoid computational complexity, the proposed\ncontrol scheme will use a 1 second average value to perform\ncomputations. Therefore, for all measured variables in dif-\nferent locations, including voltage magnitudes, active power,\nand reactive power, only one value per measured variable\nwill be transmitted to the central controller every second.\nThis one value per measured variable sent per second, will be\nthe average of multiple points sampled within the continuous\nsignal of the measured variable on that second. This means\nthat, for all measured locations that have been selected, each\none of them will transmit its 1 second average measured value\nto the central controller every second. The period which one\nvalue per measured variable is sent to the central controller\nwill be adjustable to cater for communication networks with\na slow data transmission rate. The assessment of the system\nwill be carried out through a series of four scenarios. These\nfour scenarios will demonstrate different attributes of the\nproposed system.\nA. SCENARIO 1: A NETWORK WITH DGs AND USING\nCONVENTIONAL VOLTAGE REGULATION METHOD\nScenario 1 will evaluate a network in which the OLTC and\nSVR are operating based on their conventional technique,\nwhere they regulate voltage based on a pre-set and ﬁxed\nreference voltage. The ﬁxed reference voltage for both the\nOLTC and SVR will be 1.03p.u. This is a reference voltage\ncommonly used on South African medium voltage power\nFIGURE 7. DGs reactive power and substation power factor for scenario 1.\nFIGURE 8. Power distribution system voltage magnitudes for scenario 1.\ndistribution network tap changing transformers. In addition,\nDGs will export active power and also regulate voltage\nthrough reactive power in accordance with their POC voltage.\nThe network of assessment will be similar to that portrayed\nin Figure 6, with the BESS, controller and the controller\ninterconnections removed. This scenario will evaluate the\nresponse of the conventional technique when DGs are gen-\nerating constant active power with DGs 1-4 generating 6.32,\n6.75, 5.96, and 6.1MW, respectively. The DGs reactive power\noutput and the resulting distribution network voltage magni-\ntudes are shown in Figures 7-8.\nInitially, at t =0 s, DGs are exporting active power to\nthe power system with a reactive power output of 0 Mvar as\nillustrated in Figures 7. The constant active power exported\nby DGs increased voltage magnitudes on several locations\nof the power distribution system with the highest measured\nvoltage being 1.216p.u at the DG 4 POC, and the lowest mea-\nsured voltage being 1.079p.u at the SVR location as shown\nin Figure 8. All voltage magnitudes measured and displayed\nat t =0 s in Figure 8 are classiﬁed as high voltage magnitudes,\nas most power utility companies around the world try to\nkeep medium voltage networks voltage deviation below 5%\nof nominal voltage. Using their reactive power capability,\nDGs imported reactive power in an attempt to repress voltage\nVOLUME 9, 2021 108743\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nmagnitudes at t =2 s, as shown in Figure 7. DGs 1-4 imported\n1.64, 1.44, 1.67, and 1.62Mvar, respectively. However, only\nDG 2 managed to bring its POC voltage within 5% of nominal\nvoltage at 1.048p.u. The rest of the DG POC voltage magni-\ntudes and the voltages at the end of feeders were still above\n1.05p.u. The DGs importation of reactive power presented\nin Figure 7, at t =2 s, also dropped the power factor from\n0.99 to 0.76.\nThe voltage magnitudes that were measured at the SVR and\nOLTC locations had also dropped below 1.05p.u, to 1.001 and\n1.049p.u, respectively. Since the OLTC and the SVR local\nvoltage magnitudes were at 1.049p.u and 1.001p.u, and their\nﬁxed reference voltage is 1.03p.u, they started changing tap\npositions. They also changed tap positions simultaneously,\nat t =6 s since there is no coordination. Since the OLTC\nmeasured voltage is at 1.049p.u, it moved its tap position\nonce, and took the voltage down to 1.032p.u. The OLTC\nmeasured voltage is now at 1.032p.u, which is within a\n0.01p.u tolerance margin from the ﬁxed reference voltage\nof 1.03p.u, therefore, no further tap position change would\nbe required from the OLTC. On the other hand, the SVR\nmeasured voltage was at 1.001p.u, hence, it also moved its tap\nposition once and take the voltage up to 1.012p.u in effort to\nget to its reference voltage. Since the SVR measured voltage\nwas at 1.012p.u, and not within a declared tolerance margin\nfrom its reference voltage of 1.03p.u, a second tap position\nchange was initiated at t =11 s. The SVR then stepped\nthe voltage up one more time from 1.012p.u to 1.03p.u, and\nthen stopped since the measured voltage was now within a\nmargin of 0.01p.u from the ﬁxed reference voltage as shown\nin Figure 8.\nHowever, while stepping up the voltage from 1.001p.u to\n1.03p.u in effort to reach its ﬁxed reference voltage, the SVR\nalso stepped up the voltage at the DG 1 POC from 1.061p.u\nto 1.086p.u. Furthermore, the voltage at the end of feeder\n1 was also elevated from 1.054p.u to 1.078p.u during the\nsame SVR operation. Therefore, the SVR has made the\nvoltages at the DG 1 POC and the end of feeder 1 worse\nthan they were before the SVR operation. It is this reason\nthat makes the OLTC and SVR that uses a ﬁxed reference\nvoltage ineffective when DGs are connected. In addition,\nthe OLTC stopped at its ﬁxed reference voltage of 1.03p.u\nwhile voltage magnitudes throughout the power distribution\nnetwork were still high, with the highest measured voltage\nof 1.13p.u at the DG 4 POC, and the lowest of 1.030p.u\nat the SVR POC. Given that the OLTC had not reached\nminimum/maximum tap position, and the lowest measured\nvoltage is 1.030p.u, which is still far from the prescribed\nminimum voltage of 0.95p.u, the OLTC should be able to\nreduce voltage magnitudes further and regulate 1.13p.u fur-\nther down. However, its static voltage regulation philosophy\ndoes not allow it to do so. It is because of these reasons that\nthe control system presented in this paper does not utilize\na ﬁxed reference voltage but calculate appropriate reference\nvoltages that the OLTC and SVR must follow based on real\ntime voltage magnitudes. Furthermore, the power factor only\nimproved to 0.78 when the conventional method has acted\nas shown in Figure 7. Renewable DGs are also intermittent,\ntherefore, instead of generating constant active power, they\ncan also generate ﬂuctuating active power. Hence, a sud-\nden reduction in DG active power generation may cause\nsudden reduction in voltage magnitudes within the network\nwhich the mechanical SVR and OLTC used in South African\nnetworks cannot act fast enough to alleviate. Therefore,\nthe proposed scheme will utilize a BESS to lessen the impact\nof DGs ﬂuctuating active power on the power distribution\nsystem.\nB. SCENARIO 2: A NETWORK WITH DGs, BESS, SVR AND\nOLTC USING THE PROPOSED CONTROL SYSTEM\nThis scenario will utilize the set-up portrayed in Figure 6 with\nDGs, BESS, SVR and the OLTC controlling the network\nvoltage, and boosting the network power factor based on the\nproposed control algorithm. The active power generated by\nDGs will be similar to that in scenario 1, with DGs 1-4 export-\ning 6.32, 6.75, 5.96, and 6.1MW, respectively. The same\nhigh voltage magnitudes experienced at the beginning of sce-\nnario 1 will also be experienced at the beginning of scenario\n2. This will provide a good comparison of the conventional\ntechnique and the proposed system. The BESS SOC was set\nto 50% for both BESS 1 and 2. The results are shown in\nFigures 9-14.\nAt the beginning, t =0 s, there are high voltage magnitudes\nmeasured on several sites of the power distribution network\nwith the highest measured voltage being 1.216p.u at the DG\n4 POC, and the lowest being 1.079p.u at the SVR location.\nThis is clearly depicted at the beginning of Figures 9, 10, 12,\n13, and 14. These voltages are categorized as high voltage\nmagnitudes since most power utility companies wish to keep\nmedium voltage networks voltage deviation below 5% of\nthe nominal voltage. Based on its sequence, the controller\nallowed DGs to absorb reactive power from the network and\ncontrol voltage ﬁrst, hence, DGs 1-4 imported 1.64, 1.44,\n1.67 and 1.62Mvar, respectively as shown in Figure 11, at t =\n2 s. Their effort managed to suppress voltage magnitudes\nslightly, as the highest measured voltage magnitude reduced\nto 1.146p.u at the DG 4 POC, and the lowest recorded voltage\nmagnitude reduced to 1.001p.u at the SVR location as shown\nin Figures 10 and 14. At this point, the power factor reduced\nfrom 0.99 to 0.82 as shown in Figure 11.\nThe second phase for the controller is to activate the BESS.\nAt this point, BESS 1 and 2 POC voltages were at 1.009 and\n1.118p.u, respectively. In addition, the average voltage mag-\nnitudes for feeders 1 and 2 were 1.043 and 1.130p.u, respec-\ntively. Since the scheme uses both the BESS POC voltage\nand the average voltage of the feeder which the BESS is con-\nnected to, it calculated that BESS 1 and 2 must charge with\n2.86 and 4.63MW, respectively, to suppress voltage magni-\ntudes at t =4 s as shown in Figures 12-13. In this instance,\nthe controller used the feeder average voltage to calculate the\ncharging power since the average voltage was higher than the\nPOC voltage. However, the controller ensured that the BESS\n108744 VOLUME 9, 2021\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nFIGURE 9. OLTC measured and calculated reference voltage for scenario 2.\nFIGURE 10. SVR measured and calculated reference voltage for\nscenario 2.\nPOC voltage does not drop below Vlow. In addition, BESS 2\ncharged with a higher active power magnitude than BESS 1\nsince the feeder average voltage where it is connected was\nhigher than that of BESS 1. The action by BESS 1 and\n2 reduced the power distribution network voltages further,\nand the highest measured voltage was now 1.083p.u at the\nDG4 POC, and the lowest measured voltage 0.984p.u at the\nSVR location.\nThe next phase of the controller after controlling DGs and\nBESS, is to control the mechanical devices including the SVR\nand the OLTC. The SVR is controlled ﬁrst, and the OLTC will\nonly be controlled once the SVR has reached its calculated\nreference voltage or has reached minimum/maximum tap\nposition. A tolerance margin of 0.015p.u will be allowed\nfor both the OLTC and SVR, therefore, the controller will\nstop changing tap position once the measured voltage is\nwithin 0.015p.u from the calculated reference voltage for\nboth the OLTC and SVR. As shown in Figure 10, at t =\n4 s, the SVR was at a measured voltage of 0.984p.u which\nis within 0.015p.u from its calculated reference voltage of\nFIGURE 11. DG reactive power, substation reactive power and power\nfactor for scenario 2.\nFIGURE 12. BESS 1 output power, POC voltage and feeder 1 average\nvoltage for scenario 2.\n0.971p.u. This indicates that the action of DGs and BESS\nhas matched the SVR measured and calculated reference\nvoltages. Therefore, the controller moves to the OLTC. It cal-\nculated the OLTC reference voltage of 0.961p.u using the\nreceived measured voltage magnitudes and Equation 16.\nSince the OLTC measured voltage was at 1.056p.u, a tap\nposition change was initiated. The OLTC then altered its tap\nposition from tap 4 to 5, and its measured voltage reduced to\n1.037p.u at t =8 s as shown in Figure 9.\nThe controller recomputed the OLTC reference voltage\nto 0.969p.u, and since the measured voltage was 1.037p.u,\nanother tap position change was required. Before the con-\ntroller can enable the OLTC for a second tap position change,\nit checked if the SVR is still within its calculated refer-\nence voltage. Since the SVR was at a measured voltage of\n0.977p.u, and its calculated reference voltage at 0.978p.u,\nthey were within 0.015p.u from each other as shown at t =\n8 s in Figure 10. Therefore, the OLTC moved from tap 5 to\nVOLUME 9, 2021 108745\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\ntap 6, moving the voltage from 1.037p.u to 1.021p.u. A new\nOLTC reference voltage was calculated to 0.974p.u. Since\nthe SVR was still within the deﬁned tolerance from its cal-\nculated reference voltage, a third OLTC tap position change\nto tap 7 was carried out. This moved the OLTC measured\nvoltage further from 1.021p.u to 1.003p.u as shown at t =\n16 s in Figure 9. At this point, the SVR measured voltage\ndrifted to 0.969p.u which was no longer within 0.015p.u from\nthe SVR calculated reference voltage of 0.988p.u, as shown\nat t =16 s in Figure 10. Therefore, the controller paused\nthe OLTC and changed the tap position of the SVR once,\nthis changed the SVR voltage from 0.969p.u to 0.981p.u,\nas shown at t =20 s in Figure 10. Since the SVR measured\nvoltage was now at 0.981p.u, and its calculated reference\nvoltage at 0.986p.u, they were within 0.015p.u from each\nother. Therefore, the controller went back to adjusting the\nOLTC. The OLTC measured voltage was at 1.002p.u, and\nthe calculated reference voltage at 0.975p.u. The controller\nthen moved the OLTC to tap 8, moving the measured voltage\nfrom 1.002p.u to 0.985p.u. At this point, the OLTC measured\nvoltage was within 0.015p.u from its calculated reference\nvoltage of 0.980p.u, as shown at t =24 s in Figure 9. However,\nthe SVR at 0.976p.u has drifted away by more than 0.015p.u\nfrom its calculated reference voltage of 0.992p.u, as shown at\nt =24 s in Figure 10. The controller then changed the SVR\ntap position a second time taking the SVR measured voltage\nfrom 0.976p.u to 0.988p.u, which is within 0.015p.u from the\ncalculated reference voltage of 0.990p.u.\nAt this point, both the OLTC and SVR measured voltages\nwere within 0.015p.u from their calculated reference voltage\nas shown at t =30 s in Figures 9-10. After the operation\nof the DGs, BESS, SVR and the OLTC using the proposed\ncontrol system, the highest voltage magnitude measured was\n1.051p.u at the DG 4 POC, and the lowest measured voltage\nwas 0.988p.u at the SVR location. In scenario 1, which used\nthe conventional technique, the highest measured voltage was\n1.13p.u at the DG 4 POC after all available equipment has\nregulated voltage. Therefore, the proposed control scheme\nreduced the ﬁnal voltage of 1.13p.u in scenario 1 to 1.051p.u\nin scenario 2. The proposed control scheme achieved this\nwhile keeping all voltage magnitudes above the minimum\nprescribed voltage, Vmin, of 0.95p.u. This demonstrates the\neffectiveness of the newly presented algorithm in controlling\nvoltage as compared to the conventional system. Once the\ncontrol system has equalized the measured voltage magni-\ntudes of both the OLTC and SVR with the respective calcu-\nlated reference voltage. It assessed if any DG required active\npower reduction based on DG POC voltage magnitudes.\nSince there was no DG POC voltage above Vmax +Verror\n(1.06p.u), there was no requirement for DG active power\nreduction.\nThe system then moved to the ﬁnal stage of power factor\ncorrection. It determined that since DGs 1-4 were dispatching\n91, 6, 32, and 102% of their maximum rated reactive power\ncapacity, respectively, to regulate voltage at t =30 s, only\nDG 2 was eligible to carry out power factor correction since\nFIGURE 13. BESS 2 output power, POC voltage and feeder 2 average\nvoltage for scenario 2.\nFIGURE 14. DGs POC and feeder end voltage magnitudes for scenario 2.\nit is the only one importing/exporting reactive power below\n30% of its maximum rated reactive power capacity. Since the\nreactive power measured on the substation power transformer\nwas 5.03Mvar, leading to a power factor of 0.93 as shown\nat t =30 s in Figure 11, and only one DG was eligible for\npower factor correction. The controller assigned DG 2 to\ncompensate for a maximum reactive power of 5.03Mvar as\ndepicted by Equation 19. However, due to voltage and capac-\nity constraints, the controller only managed to get 1.42Mvar\nfrom DG 2 in accordance with Equations 19-21. Since DG 2\nwas already exporting 0.09Mvar for voltage regulation, it then\nexported 1.51Mvar in total to simultaneously control voltage\nand boost power factor in accordance with Equation 22.\nThis action by DG 2 boosted the power factor from 0.93 to\n0.96 as shown at t =32s in Figure 11. When DG 2 exported\na total of 1.51Mvar for controlling voltage and boosting\npower factor, its POC voltage increased to 1.012p.u. Since\nthis was below 1.04p.u, based on the prescribed Vmax of\n1.05p.u, DG 2 continued performing both voltage control\nand boosting power factor. DG 2 will only be withdrawn\n108746 VOLUME 9, 2021\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nfrom power factor enhancement and made to focus solely on\nvoltage regulation when its POC voltage rises above 1.04p.u,\ndrop below 0.96p.u, or the reactive power through the substa-\ntion transformer has reduced such that a power factor above\n0.98 is computed when DGs are still controlling voltage\nthrough reactive power. Since the exportation of reactive\npower affect voltage magnitudes, the reactive power expor-\ntation by DG 2 for power factor correction at t =32 s caused\na mismatch between the measured voltage and the calculated\nreference voltage for both the OLTC and SVR as shown in\nFigures 9-10.\nThe SVR was at a measured voltage of 1.003p.u, with a\ncalculated reference voltage of 0.979p.u, the OLTC was at\na measured voltage of 0.990p.u, with a calculated reference\nvoltage of 0.970p.u. The controller then changed the tap\nposition of the SVR ﬁrst, changing the measured voltage\nfrom 1.003 to 0.989p.u, which was now within 0.015p.u from\nits calculated reference voltage of 0.983p.u. Once the SVR\nvoltage was within 0.015p.u from its calculated reference\nvoltage, the controller changed the tap position of the OLTC\nand changed its measured voltage from 0.990 to 0.975p.u,\nwhich was now within 0.015p.u from its calculated reference\nvoltage of 0.978p.u. At this point, the highest voltage mea-\nsured within the power distribution network was 1.048p.u at\nthe DG 4 POC, and the lowest being 0.975p.u at the OLTC\nlocation. Comparing these results to that of scenario 1 where\nthe highest voltage ended at 1.13p.u, and the power factor at\n0.78. The proposed control system succeeded in reducing the\nhighest voltage to 1.048p.u, and the power factor improved\nto 0.96. This shows the effectiveness of the system presented\nin this paper in coordinated voltage control and power factor\ncorrection.\nC. SCENARIO 3: THE CONTROL SYSTEM’S RESPONSE TO\nA SUDDEN REDUCTION IN DG ACTIVE POWER OUTPUT\nThis scenario will demonstrate how the system uses its equip-\nment to minimize the impact of a sudden reduction in DG\nactive power output. This is signiﬁcant as renewable DGs can\nproduce ﬂuctuating active power when their primary energy\nsource is intermittent. The initial conditions of the power\ndistribution network will be a state where the OLTC and SVR\nhave both reached their calculated reference voltages. In addi-\ntion, the active power output reduced will be that of DGs\n1 and 2. The ﬁrst demonstration will show how the voltage\nmagnitudes on feeder 1 where DGs 1 and 2 are connected will\nbehave if DG active power output is reduced while the control\nscheme is not fully utilized, and BESS 1 is disconnected.\nThe network response is shown in Figure 15. The voltage\nmagnitudes of Figure 15 are responding to the reduction in\nactive power by DGs 1 and 2 shown in Figure 16, from t =\n0 s to t =19 s. The section from t =20 s where the active\npower of DGs 1 and 2 recovers is not shown in Figure 15 since\nthe purpose is to show how voltage magnitudes of feeder\n1 respond to a DG active power output reduction when the\ncontrol system is not fully utilized.\nFIGURE 15. Feeder 1 voltage magnitudes without BESS 1 response.\nFIGURE 16. DG active power output.\nAs shown in Figures 15 and 16, when the active power\noutput of DGs 1 and 2 reduced, and BESS 1 did not respond,\nthe voltage at the DG 1 POC, DG2 POC, feeder 1 end,\nand BESS 1 POC dropped to 0.861, 0.874, 0.855, and\n0.879p.u, respectively. These are extremely low voltage mag-\nnitudes.The next demonstration will show how voltage mag-\nnitudes respond when the active power output of DGs 1 and\n2 reduces suddenly while the proposed control scheme is\nfully applied with BESS 1 and 2 connected and responding\naccordingly. The demonstration will further evaluate how\nthe control scheme together with its respective equipment\nrespond when the active power of DGs 1 and 2 recovers.\nIn addition, the demonstration will show how the proposed\ncontrol scheme respond when both small and large volt-\nage disturbances occur on the power distribution network.\nTherefore, on this demonstration, the control scheme is fully\nimplemented, and the BESS is responding accordingly. The\nSOC for both BESS 1 and 2 was set to 50%. The results are\nshown in Figures 16-22.\nInitially, at t =0 s, DGs 1-4 are generating 6.32, 6.53,\n5.96, and 6.1MW, respectively, as shown in Figure 16. At this\nVOLUME 9, 2021 108747\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nmoment, the OLTC is at a measured voltage of 0.985p.u,\nwith a calculated reference voltage of 0.977p.u, as shown in\nFigure 17. The SVR is at a measured voltage of 0.988p.u,\nwith a calculated reference voltage of 0.990p.u, as shown\nin Figure 18. Therefore, both the OLTC and SVR are within\n0.015p.u from their calculated reference voltages and the\ncontroller will not change their tap position. Furthermore, the\nvoltage magnitudes at the DGs 1-4 POC are 1.047, 0.993,\n1.023 and 1.051p.u, respectively, as shown in Figure 22.\nDGs 1, 3 and 4 are importing 1.36, 0.52 and 1.62Mvar of\nreactive power, whereas DG 2 is exporting 0.16Mvar since\nit is the only one with a POC voltage lower than 1p.u at\n0.993p.u, as shown in Figure 19. The voltage at the end of\nfeeders 1 and 2 is 1.039 and 1.047p.u, respectively, with the\naverage voltage for feeders 1 and 2 at 1.008 and 1.034p.u,\nrespectively. BESS 1 and 2 were both charging with 2.16 and\n3.77MW, respectively, as shown in Figures 20-21. Therefore,\nin the beginning, the control system had utilized its equipment\nto regulate voltage magnitudes, and all measured voltage\nmagnitudes were within acceptable range as represented at\nt =0 s in Figure 22.\nThen, the active power output of DGs 1 and 2 started reduc-\ning at t =5 s as shown in Figure 16. DGs 1 and 2 moved from\n6.32MW and 6.53MW to 0.79MW and 0.83MW, respec-\ntively. This caused a large voltage disturbance in feeder\n1 and a small voltage disturbance in feeder 2 as shown in\nFigure 22. However, since the control system was fully uti-\nlized and BESS 1 responded accordingly, the voltage at the\nDG 1 POC, DG 2 POC, feeder 1 end, and BESS 1 POC only\ndropped to 0.942, 0.946, 0.940, and 0.960p.u, respectively,\nas shown in Figure 22. Therefore, comparing these results to\nthat of Figure 15, where the control scheme was not fully\nutilized and BESS 1 disconnected, the fully implemented\nscheme minimized the voltage dip caused by the DGs sudden\nreduction of active power output by 8.1%, 7.2%, 8.5%, and\n8.1% for DG 1 POC, DG 2 POC, feeder 1 end, and BESS\n1 POC voltage, respectively. This is a huge improvement\nand shows the signiﬁcance of the proposed scheme and its\nBESS in minimizing instantaneous voltage dips as described\nby the objective function of Equation 6. Therefore, when\nthe system detected the large voltage disturbance in feeder\n1 caused by the sudden reduction of active power output by\nDGs 1 and 2, it instructed BESS 1 to change its state from\ncharging with 2.16MW to discharging 2.78MW, as shown at\nt =5 s in Figure 20. It is this 2.78MW that BESS 1 discharged\nthat prevented the voltage from going to levels it did when the\ncontrol scheme was not fully utilized on the ﬁrst demonstra-\ntion of Figure 15.\nSince feeder 2 only experienced a small voltage distur-\nbance when DGs 1 and 2 reduced active power generation,\nthe controller kept BESS 2 charging, but changed its charg-\ning power slightly from 3.77MW to 3.9MW to control the\nsmall voltage disturbance as shown in Figure 21. In addition,\nthe controller also changed the reactive power that DG 3 is\nimporting slightly, from 0.52Mvar to 0.65Mvar to control the\nsmall voltage disturbance in feeder 2.\nFIGURE 17. OLTC measured and calculated reference voltage.\nFIGURE 18. SVR measured and calculated reference voltage.\nThe reduction in active power output by DGs 1 and 2 at\nt =5 s also caused a mismatch between the reference voltage\nthat is calculated and the voltage that is measured for both the\nOLTC and SVR as shown in Figures 17-18. Therefore, after\nthe system is done controlling BESS 1, it proceeded to the\nSVR, since the SVR takes precedence to the OLTC. The SVR\ncalculated reference voltage was 1.049p.u, and the measured\nvoltage at 0.946p.u. The SVR then altered tap position once\ntaking the calculated SVR reference voltage and the voltage\nmeasured to 1.048 and 0.955p.u, respectively. Since they\nwere still more than 0.015p.u apart, a second tap position\nchange occurred taking the SVR calculated reference voltage\nand the voltage measured to 1.047 and 0.964p.u, respectively.\nRight after the SVR has changed tap position a second time,\nthe active power generation of DGs 1 and 2 started recovering\nas shown at t =20 s in Figure 16. This caused voltage mag-\nnitudes to start rising again, and hence the controller slowly\nchanged the status of BESS 1 from discharging 2.0MW,\n108748 VOLUME 9, 2021\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nFIGURE 19. DG reactive power and the substation power factor.\nFIGURE 20. BESS 1 active power, POC and feeder 1 average voltage.\nto charging with 2.46MW as shown in Figure 20. When the\nactive power output of DGs 1 and 2 was fully restored at t =\n27 s, there was still a mismatch between the calculated ref-\nerence voltage and the voltage measured for both the OLTC\nand the SVR, as show in Figures 17-18. The OLTC calculated\nreference voltage was at 0.985p.u and its measured voltage at\n0.969p.u, whereas the SVR calculated reference voltage was\nat 0.984p.u and the measured voltage at 1.015p.u. Since the\nSVR takes precedence to the OLTC, the controller changed\nthe SVR tap position once taking the SVR measured voltage\nto 0.997p.u, with a calculated reference voltage of 0.991p.u.\nSince the SVR measured voltage was now within 0.015p.u\nfrom the calculated reference voltage, the controller turned\nits attention to the OLTC.\nAt this point, the OLTC was at a measured voltage of\n0.985p.u, and the calculated reference voltage at 0.976p.u,\nsince these were also within 0.015p.u from each other,\nthe controller stopped instructing tap position changes for\nboth the OLTC and SVR as shown in Figures 17-18. It can\nbe observed that a tap change by the SVR simultaneously\nFIGURE 21. BESS 2 active power, POC and feeder 2 average voltage.\nFIGURE 22. DGs and feeder end voltage magnitudes.\nbrought both the SVR and OLTC within 0.015p.u from\ntheir calculated reference voltages as shown at t =30 s,\nin Figures 17-18. At this point, the highest measured voltage\nmagnitude was 1.051p.u at the DG 4 POC, and the lowest\nvoltage magnitude 0.985p.u at the OLTC location.\nScenario 3 has demonstrated the intelligent behaviour of\nthe proposed scheme that allows it to control multiple equip-\nment to regulate voltage, as the power system experiences\nlarge and small voltage disturbances caused by the variable\nactive power output of renewable DGs. It can be observed\nthat as the generation of DGs 1 and 2 drops suddenly, feeder\n1 experienced a large voltage disturbance, whereas feeder\n2 experienced a small voltage disturbance. However, the con-\ntrol system was able to continuously regulate the reactive\npower output of DGs, the BESS charging/discharging sta-\ntus, the SVR tap position, and the OLTC tap position to\nsimultaneously control the voltage on feeder 1 experienc-\ning a large voltage disturbance, and feeder 2 experiencing\na small voltage disturbance. Furthermore, scenario 3 shows\nthe signiﬁcance of a BESS in preventing extreme voltage\nVOLUME 9, 2021 108749\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nFIGURE 23. DGs active power output.\nFIGURE 24. OLTC measured and calculated reference voltage.\nsags when DG active power output reduces suddenly. Hence,\nscenario 3 further conﬁrms the ability of this multi variable\ncontrol scheme in keeping voltage magnitudes within accept-\nable limits, and also lessen the depth of voltage dips that are\ncaused by the erratic behaviour of renewable DGs.\nD. SCENARIO 4: THE CONTROL SYSTEM’S DG ACTIVE\nPOWER REDUCTION CAPABILITY\nThis scenario will illustrate the response of the control\nscheme when a DG POC voltage cannot be successfully\nbrought within acceptable margin in accordance with the pro-\ncess of Figure 5. The initial conditions of the power system\nwill be a state where DGs and BESS have acted, but the SVR\nand OLTC have not equalized their measured and calculated\nvoltages. The network used will be that of Figure 6, however,\nthe load on feeder 1 will remain the same at 8.43MW, and\nthat of feeder 2 reduced to 4.62MW. Results are shown\nin Figures 23-29.\nInitially, at t =0 s, DGs 1-4 are generating 6.32, 6.53,\n5.96, and 6.1MW, respectively, as shown in Figure 23.\nAt this instance, the system had used DGs and BESS to\nregulate voltage with DGs 1, 3, and 4 importing 1.65, 0.77,\nand 1.66Mvar, respectively. DG 2 was exporting 0.33Mvar\nsince its POC voltage was slightly below nominal voltage\nFIGURE 25. SVR measured and calculated reference voltage.\nFIGURE 26. DGs reactive power and the substation power factor.\nFIGURE 27. BESS 1 active power, POC and feeder 1 average voltage.\nas shown in Figure 26. In addition, BESS 1 and 2 were\ncharging at 2.31MW and 4.37MW, respectively, as shown in\nFigures 27 and 28. The OLTC and SVR were at a measured\nvoltage of 0.983 and 1.016p.u, respectively, with a calcu-\nlated reference voltage of 0.959 and 0.983p.u, respectively,\nas shown in Figures 24 and 25. Hence, both the OLTC and\nSVR measured voltages were not within 0.015p.u from the\ncalculated reference voltages.\n108750 VOLUME 9, 2021\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\nFIGURE 28. BESS 2 active power, POC and feeder 2 average voltage.\nFIGURE 29. DGs and feeder end voltage magnitudes.\nTherefore, the system started with the SVR and changed\nits tap position once taking the measured voltage to 0.999p.u,\nwith a calculated reference voltage of 0.989p.u at t =6 s.\nSince the SVR measured voltage was now 0.015p.u from\nthe calculated reference voltage, the system moved to the\nOLTC and changed its tap position once as well. This changed\nthe OLTC measured voltage to 0.967p.u, with a calculated\nreference voltage 0.972p.u at t =11 s, the measured volt-\nage was now 0.015p.u from the calculated reference volt-\nage. At this point, the OLTC and SVR measured voltages\nwere within 0.015p.u from the calculated reference volt-\nages, hence, no tap position change would be carried out.\nNevertheless, DGs 1-4 POC voltages were at 1.050, 0.983,\n1.023 and 1.071p.u, as depicted in Figure 29 at t =12 s.\nSince the system cannot change the tap positions of the\nOLTC and SVR, as they have reached their calculated ref-\nerence voltages, and the DG 4 POC voltage is still above\n(Vmax +Verror =1.06p.u), the control scheme then reduced\nthe active power generation of DG 4 in accordance with Equa-\ntion 17. Using the model in Matlab/Simulink, it was found\nthat 0.56MW of active power is required to move the voltage\nby 0.01p.u at the DG 4 POC, this gives a sensitivity index Sp\nof 0.018.\nTherefore, based on Equation 17, the system calculated\nthat DG 4 must reduce its active power generation from 6.1 to\n3.73MW, as shown at t =18 s in Figure 23. The reduction\nof active power generation by DG 4 resulted in the DG\n4 POC voltage reducing from 1.071 to 1.042p.u, as shown\nin Figure 29 at t =18 s. As the voltage at the DG 4 POC\ndropped, the reactive power imported by DG 4 also dropped\nfrom 1.65Mvar to 0.99Mvar, as shown in Figure 26. At this\npoint, the control scheme will only attempt to increase the\nactive power generation of DG 4 once its POC voltage drops\nbelow 1.03p.u, this will happen when the load on feeder 2\nstart increasing.\nScenario 4 has illustrated the control scheme’s capability to\ncontrol the active power generation of DGs when the equip-\nment dedicated to voltage regulation cannot successfully keep\nall voltage magnitudes within deﬁned limits. As presented,\nthe control scheme managed to decrease the voltage at the\nDG 4 POC to acceptable range by reducing the active power\ngeneration of DG 4.\nVIII. CONCLUSION\nIn this paper, a control scheme is designed that coordinate\nDGs, BESS, SVR and OLTC for controlling voltage and\nboosting power factor in a power network with high DG\ngeneration. The design was motivated by the inefﬁciency of\nexisting methods in regulating voltage when high magnitude\nof active power from DGs is exported to a power distribution\nnetwork. When DGs are introduced to a power distribution\nnetwork, especially one with long lines that have low short\ncircuit capacity, the voltage can rise beyond acceptable limits,\nand the existing methods cannot successfully bring it back\nto acceptable range. This was demonstrated in scenario 1,\nwhere the highest voltage was 1.216p.u before the conven-\ntional method has operated, and dropped to 1.13p.u after the\nconventional method has operated and has reached its ﬁxed\nreference voltage. In addition, the exchange of reactive power\nbetween DGs and the power system affect the power factor.\nThis was also conﬁrmed in scenario 1, where the power\nfactor was 0.99 at the beginning, and 0.78 when the con-\nventional method has operated with DGs importing reactive\npower. When the newly presented control scheme that does\nnot rely on ﬁxed variables was implemented in scenario 2,\nthe highest voltage was 1.216p.u at the beginning, similar to\nthat at the beginning of scenario 1, however, the proposed\ntechnique reduced the highest voltage from 1.216 to 1.048p.u.\nTherefore, the proposed scheme managed to reduce voltage\nfurther by 8.20% from where the conventional method had\nended. In doing so, the lowest voltage recorded was also\n0.975p.u, indicating that the lower voltage limit was not\nbreached. In addition, the power factor was 0.96 when the\nproposed system had operated, which is an 18.0% improve-\nment from the conventional method. Furthermore, the pro-\nposed technique also managed to reduce the depth of a voltage\ndip on the average voltage of feeder 1 by 8.07%, when\nDG generation reduced suddenly as depicted in scenario 3.\nBased on the comparison between the voltage magnitudes and\nVOLUME 9, 2021 108751\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\npower factor of the conventional method of scenario 1 and\nthe proposed method of scenarios 2-4, it can be deduced that\nthe proposed method is more effective in regulating voltage\nmagnitudes and enhancing the power factor when DGs are\nconnected.\nREFERENCES\n[1] U. Agarwal and N. Jain, ‘‘Distributed energy resources and supportive\nmethodologies for their optimal planning under modern distribution net-\nwork: A review,’’Technol. Econ. Smart Grids Sustain. Energy, vol. 4, no. 1,\np. 3, Jan. 2019.\n[2] S.-E. Razavi, E. Rahimi, M. S. Javadi, A. E. Nezhad, M. Lotﬁ,\nM. Shaﬁe-Khah, and J. P. S. Catal ˜zo, ‘‘Impact of distributed generation\non protection and voltage regulation of distribution systems: A review,’’\nRenew. Sustain. Energy Rev., vol. 105, pp. 157–167, May 2019.\n[3] Z. Tang, D. J. Hill, and T. Liu, ‘‘Fast distributed reactive power control\nfor voltage regulation in distribution networks,’’ IEEE Trans. Power Syst.,\nvol. 34, no. 1, pp. 802–805, Jan. 2019.\n[4] A. Bouakra, F. Slaoui-Hasnaoui, M. Rustom, and S. Georges, ‘‘V oltage\nregulation of electric power network interconnected with wind energy\ndistributed generations,’’ in Proc. IEEE 2nd Int. Conf. DC Microgrids\n(ICDCM), Nuremburg, Germany, Jun. 2017, pp. 387–392.\n[5] S. Repo, A. Nikander, H. Laaksonen, P. Järventausta, and P. W. Daly,\n‘‘A method to increase the integration capacity of distributed generation\non weak distribution networks,’’ in Proc. 17th Int. Conf. Electr. Distrib.,\nBarcelona, Spain, May 2003, pp. 12–15.\n[6] G. N. Koutroumpezis, A. S. Saﬁgianni, G. S. Demetzos, and\nJ. G. Kendristakis, ‘‘Investigation of the distributed generation penetration\nin a medium voltage power distribution network,’’ Int. J. Energy Res.,\nvol. 34, pp. 585–593, 10 Jun. 2010.\n[7] M. Chindris, A. Cziker, and A. Miron, ‘‘UPQC—The best solution to\nimprove power quality in low voltage weak distribution networks,’’ in Proc.\nInt. Conf. Modern Power Syst. (MPS), Cluj-Napoca, Romania, Jun. 2017,\npp. 6–9.\n[8] M. G. Dozein, P. Mancarella, T. K. Saha, and R. Yan, ‘‘System strength and\nweak grids: Fundamentals, challenges, and mitigation strategies,’’ in Proc.\nAustralas. Univ. Power Eng. Conf. (AUPEC), Auckland, New Zealand,\nNov. 2018, pp. 27–30.\n[9] R. Małkowski, M. Izdebski, and P. Miller, ‘‘Adaptive algorithm of a tap-\nchanger controller of the power transformer supplying the radial network\nreducing the risk of voltage collapse,’’ Energies, vol. 13, no. 20, p. 5403,\nOct. 2020.\n[10] A. N. Hasan and N. Tshivhase, ‘‘V oltage regulation system for OLTC\nin distribution power systems with high penetration level of embedded\ngeneration,’’ Int. Trans. Electr. Energy Syst., vol. 29, no. 7, Jul. 2019,\nArt. no. e12111.\n[11] Y .-C. Jeong, E.-B. Lee, and D. Alleman, ‘‘Reducing voltage volatility\nwith step voltage regulators: A life-cycle cost analysis of Korean solar\nphotovoltaic distributed generation,’’ Energies, vol. 12, no. 4, p. 652,\nFeb. 2019.\n[12] M. Bazrafshan, N. Gatsis, and H. Zhu, ‘‘Optimal power ﬂow with step-\nvoltage regulators in multi-phase distribution networks,’’ IEEE Trans.\nPower Syst., vol. 34, no. 6, pp. 4228–4239, Nov. 2019.\n[13] S.-B. Kim and S.-H. Song, ‘‘A hybrid reactive power control method\nof distributed generation to mitigate voltage rise in low-voltage grid,’’\nEnergies, vol. 13, no. 8, p. 2078, Apr. 2020.\n[14] N. Tshivhase, A. N. Hasan, and T. Shongwe, ‘‘Proposed fuzzy logic system\nfor voltage regulation and power factor improvement in power systems\nwith high inﬁltration of distributed generation,’’ Energies, vol. 13, no. 16,\np. 4241, Aug. 2020.\n[15] N. Tshivhase, A. N. Hasan, and T. Shongwe, ‘‘A fault level-based system to\ncontrol voltage and enhance power factor through an on-load tap changer\nand distributed generators,’’ IEEE Access, vol. 9, pp. 34023–34039,\nFeb. 2021.\n[16] I. Khan, Y . Xu, H. Sun, and V . Bhattacharjee, ‘‘Distributed optimal reactive\npower control of power systems,’’ IEEE Access, vol. 6, pp. 7100–7111,\nDec. 2018.\n[17] C. Jamroen, A. Pannawan, and S. Sirisukprasert, ‘‘Battery energy storage\nsystem control for voltage regulation in microgrid with high penetration\nof PV generation,’’ in Proc. 53rd Int. Univ. Power Eng. Conf. (UPEC),\nGlasgow, U.K., Sep. 2018, pp. 4–7.\n[18] T. Tewari, A. Mohapatra, and S. Anand, ‘‘Coordinated control of OLTC\nand energy storage for voltage regulation in distribution network with high\nPV penetration,’’IEEE Trans. Sustain. Energy, vol. 12, no. 1, pp. 262–272,\nJan. 2021.\n[19] L. Bai, T. Jiang, F. Li, H. Chen, and X. Li, ‘‘Distributed energy storage plan-\nning in soft open point based active distribution networks incorporating\nnetwork reconﬁguration and DG reactive power capability,’’ Appl. Energy,\nvol. 210, pp. 1082–1091, Jan. 2018.\n[20] Y . Hua, X. Shentu, Q. Xie, and Y . Ding, ‘‘V oltage/frequency deviations\ncontrol via distributed battery energy storage system considering state of\ncharge,’’Appl. Sci., vol. 9, no. 6, p. 1148, Mar. 2019.\n[21] J. Tan and Y . Zhang, ‘‘Coordinated control strategy of a battery energy\nstorage system to support a wind power plant providing multi-timescale\nfrequency ancillary services,’’ IEEE Trans. Sustain. Energy, vol. 8, no. 3,\npp. 1140–1153, Jul. 2017.\n[22] M. Zeraati, M. E. H. Golshan, and J. M. Guerrero, ‘‘Distributed control\nof battery energy storage systems for voltage regulation in distribution\nnetworks with high PV penetration,’’ IEEE Trans. Smart Grid, vol. 9, no. 4,\npp. 3582–3593, Dec. 2016.\n[23] K. Kotsalos, I. Miranda, J. L. Dominguez-Garcia, H. Leite, N. Silva, and\nN. Hatziargyriou, ‘‘Exploiting OLTC and BESS operation coordinated\nwith active network management in LV networks,’’ Sustainability, vol. 12,\nno. 8, p. 3332, Apr. 2020.\n[24] X. Liu, A. Aichhorn, L. Liu, and H. Li, ‘‘Coordinated control of distributed\nenergy storage system with tap changer transformers for voltage rise\nmitigation under high photovoltaic penetration,’’ IEEE Trans. Smart Grid.,\nvol. 3, no. 2, pp. 897–906, Jun. 2012.\n[25] M. Chamana and B. H. Chowdhury, ‘‘Optimal voltage regulation of\ndistribution networks with cascaded voltage regulators in the presence\nof high PV penetration,’’ IEEE Trans. Sustain. Energy, vol. 9, no. 3,\npp. 1427–1436, Jul. 2018.\n[26] M. Aryanezhad, ‘‘Management and coordination of LTC, SVR, shunt\ncapacitor and energy storage with high PV penetration in power distri-\nbution system for voltage regulation and power loss minimization,’’ Int.\nJ. Elect. Power Energy Syst., vol. 100, pp. 178–192, Sep. 2018.\n[27] M. Zeraati, M. E. H. Golshan, and J. M. Guerrero, ‘‘A consensus-based\ncooperative control of PEV battery and PV active power curtailment for\nvoltage regulation in distribution networks,’’ IEEE Trans. Smart Grid,\nvol. 10, no. 1, pp. 670–680, Jan. 2019.\n[28] J. Faiz and B. Siahkolah, ‘‘Differences between conventional and elec-\ntronic tap-changers and modiﬁcations of controller,’’ IEEE Trans. Power\nDel., vol. 21, no. 3, pp. 1342–1349, Jun. 2006.\n[29] C. R. Sarimuthu, V . K. Ramachandaramurthy, K. R. Agileswari, and\nH. Mokhlis, ‘‘A review on voltage control methods using on-load tap\nchanger transformers for networks with renewable energy sources,’’\nRenew. Sustain. Energy Rev., vol. 62, pp. 1154–1161, Sep. 2016.\n[30] F. A. Viawan, A. Sannino, and J. Daalder, ‘‘V oltage control with on-load tap\nchangers in medium voltage feeders in presence of distributed generation,’’\nElectr. Power Syst. Res., vol. 77, pp. 1314–1322, Aug. 2007.\n[31] F. Bai, R. Yan, T. K. Saha, and D. Eghbal, ‘‘A new remote tap position\nestimation approach for open-delta step-voltage regulator in a photovoltaic\nintegrated distribution network,’’ IEEE Trans. Power Syst., vol. 33, no. 4,\npp. 4433–4443, Jul. 2018.\n[32] C. Deckmyn, T. L. Vandoorn, B. Meersman, L. Gevaert, L. Vandevelde, and\nJ. Desmet, ‘‘A coordinated voltage control strategy for on-load tap chang-\ning transformers with the utilisation of distributed generators,’’ in Proc.\nIEEE Int. Energy Conf. (ENERGYCON), Leuven, Belgium, Apr. 2016,\npp. 4–8.\n[33] M. A. Azzouz and E. F. El-Saadany, ‘‘Optimal coordinated volt/V AR\ncontrol in active distribution networks,’’ in Proc. IEEE PES Gen.\nMeeting Conf. Expo., National Harbor, MD, USA, Jul. 2014,\npp. 27–31.\n[34] A. Mazza, H. Mirtaheri, G. Chicco, A. Russo, and M. Fantino, ‘‘Location\nand sizing of battery energy storage units in low voltage distribution\nnetworks,’’Energies, vol. 13, no. 1, p. 52, Dec. 2019.\n[35] S. Lotsu, Y . Yoshida, K. Fukuda, and B. He, ‘‘Effectiveness of a power\nfactor correction policy in improving the energy efﬁciency of large-\nscale electricity users in Ghana,’’ Energies, vol. 12, no. 13, p. 2582,\nJul. 2019.\n[36] L. Huang, J. Xu, Y . Sun, M. Chen, and H. Xu, ‘‘V oltage stability analysis\nand monitoring based on short circuit capacity,’’ in Proc. IEEE Int. Conf.\nPower Syst. Technol. (POWERCON), Auckland, New Zealand, Oct. 2012,\npp. 1–5.\n108752 VOLUME 9, 2021\nN. Tshivhaseet al.: Average Voltage Approach to Control Energy Storage Device and Tap Changing Transformers\n[37] A. D. Pizzc, L. Di Noia, D. Lauria, M. Crispino, A. Cantiello, and\nF. Mottola, ‘‘Control of OLTC distribution transformer addressing voltage\nregulation and lifetime preservation,’’ in Proc. Int. Symp. Power Electron.,\nElectr. Drives, Automat. Motion (SPEEDAM), Amalﬁ, Italy, Jun. 2018,\npp. 20–22.\n[38] M. Sedghi, A. Ahmadian, and M. Aliakbar-Golkar, ‘‘Optimal storage\nplanning in active distribution network considering uncertainty of wind\npower distributed generation,’’ IEEE Trans. Power Syst., vol. 31, no. 1,\npp. 304–316, Jan. 2016.\n[39] K. C. Divya and J. Østergaard, ‘‘Battery energy storage technology for\npower systems—An overview,’’ Electr. Power Syst. Res., vol. 79, no. 4,\npp. 511–520, Apr. 2009.\n[40] M. Beaudin, H. Zareipour, A. Schellenberg, and W. Rosehart, ‘‘Energy\nstorage for mitigating the variability of renewable electricity sources,’’\nEnergy Storage for Smart Grids, Planning and Operation for Renewable\nand Variable Energy Resources. Amsterdam, The Netherlands: Elsevier,\n2015, pp. 1–33.\n[41] T. Mchunu, ‘‘Grid connection code for renewable power plants (RPPs)\nconnected to the electricity transmission system (TS) or the distribution\nsystem (DS) in South Africa, version 3.0,’’ Nat. Energy Regulator South\nAfrica, Pretoria, South Africa, Tech. Rep., Sep. 2020.\nNDAMULELO TSHIVHASE received the B.Eng.\ndegree in electrical and electronic engineering and\nthe M.Eng. degree in electrical engineering from\nthe University of Johannesburg, South Africa,\nin 2013 and 2019, respectively. He is currently a\npower system engineer focused on the integration\nof renewable power plants into the power systems.\nALI N. HASANreceived the B.Eng. degree in elec-\ntrical and electronic engineering from Hashemite\nUniversity, Jordan, in 2005, the M.Eng. degree\nin electrical engineering from North West Uni-\nversity, South Africa, in 2010, and the D.Ing.\n(Ph.D.) degree in electrical and electronic engi-\nneering from the University of Johannesburg,\nSouth Africa, in 2014. He was a Senior Lecturer\nwith the Department of Electrical and Electronic\nEngineering Technology, University of Johannes-\nburg, South Africa. He is currently an Assistant Professor with the Higher\nColleges of Technology, Abu Dhabi. His research work focuses on the\napplications of artiﬁcial intelligence in energy, power, and communication\nsystems.\nTHOKOZANI SHONGWE (Member, IEEE)\nreceived the B.Eng. degree in electronic engineer-\ning from the University of Swaziland, Swaziland,\nin 2004, the M.Eng. degree in telecommunications\nengineering from the University of the Witwa-\ntersrand, South Africa, in 2006, and the D.Eng.\ndegree from the University of Johannesburg, South\nAfrica, in 2014. He is currently an Associate\nProfessor with the Department of Electrical and\nElectronic Engineering Technology, University\nof Johannesburg. His research ﬁelds are in digital communications and\nerror correcting coding. His research interests include power-line com-\nmunications, cognitive radio, smart grid, visible light communications,\nmachine learning, and artiﬁcial intelligence. He was a recipient of the\n2014 University of Johannesburg Global Excellence Stature (GES) Award,\nwhich was awarded to him to carry out his postdoctoral research with the\nUniversity of Johannesburg. In 2016, he was a recipient of the TWAS-DFG\nCooperation Visits Program funding to do research in Germany. He received\nthe Post-Graduate Merit Award Scholarship to pursue his master’s degree\nwith the University of the Witwatersrand, in 2005, which is awarded on\na merit basis. In 2012, he (and his coauthors) received an Award of the\nBest Student Paper at the IEEE ISPLC 2012 (power line communications\nconference), Beijing, China.\nVOLUME 9, 2021 108753",
  "topic": "Tap changer",
  "concepts": [
    {
      "name": "Tap changer",
      "score": 0.8026341199874878
    },
    {
      "name": "Voltage regulation",
      "score": 0.7873237133026123
    },
    {
      "name": "Voltage regulator",
      "score": 0.6819392442703247
    },
    {
      "name": "Voltage optimisation",
      "score": 0.6513041853904724
    },
    {
      "name": "Distributed generation",
      "score": 0.5976491570472717
    },
    {
      "name": "Voltage",
      "score": 0.5553683638572693
    },
    {
      "name": "Computer science",
      "score": 0.4839775562286377
    },
    {
      "name": "Dropout voltage",
      "score": 0.4716571867465973
    },
    {
      "name": "Electrical engineering",
      "score": 0.40124645829200745
    },
    {
      "name": "Transformer",
      "score": 0.3661876916885376
    },
    {
      "name": "Engineering",
      "score": 0.35919976234436035
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.3440467119216919
    },
    {
      "name": "Renewable energy",
      "score": 0.11643335223197937
    },
    {
      "name": "Control (management)",
      "score": 0.09648814797401428
    },
    {
      "name": "Artificial intelligence",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I24027795",
      "name": "University of Johannesburg",
      "country": "ZA"
    },
    {
      "id": "https://openalex.org/I119744171",
      "name": "Higher Colleges of Technology",
      "country": "AE"
    }
  ],
  "cited_by": 17
}