{
    "title": "Application of Distribution Transformer Thermal Life Models to Electrified Vehicle Charging Loads Using Monte-Carlo Method: Preprint",
    "url": "https://openalex.org/W344945656",
    "year": 2011,
    "authors": [
        {
            "id": "https://openalex.org/A2244931601",
            "name": "Michael Kuss",
            "affiliations": [
                "Office of Scientific and Technical Information"
            ]
        },
        {
            "id": "https://openalex.org/A2423469494",
            "name": "T. Markel",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1955275859",
            "name": "W. Kramer",
            "affiliations": [
                "National Renewable Energy Laboratory"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2037799258",
        "https://openalex.org/W2116555056",
        "https://openalex.org/W2127666130",
        "https://openalex.org/W2154112080",
        "https://openalex.org/W2152243106",
        "https://openalex.org/W1970232346",
        "https://openalex.org/W1978006291",
        "https://openalex.org/W2132679857",
        "https://openalex.org/W2142870461",
        "https://openalex.org/W316555498"
    ],
    "abstract": "Concentrated purchasing patterns of plug-in vehicles may result in localized distribution transformer overload scenarios. Prolonged periods of transformer overloading causes service life decrements, and in worst-case scenarios, results in tripped thermal relays and residential service outages. This analysis will review distribution transformer load models developed in the IEC 60076 standard, and apply the model to a neighborhood with plug-in hybrids. Residential distribution transformers are sized such that night-time cooling provides thermal recovery from heavy load conditions during the daytime utility peak. It is expected that PHEVs will primarily be charged at night in a residential setting. If not managed properly, some distribution transformers could become overloaded, leading to a reduction in transformer life expectancy, thus increasing costs to utilities and consumers. A Monte-Carlo scheme simulated each day of the year, evaluating 100 load scenarios as it swept through the following variables: number of vehicle per transformer, transformer size, and charging rate. A general method for determining expected transformer aging rate will be developed, based on the energy needs of plug-in vehicles loading a residential transformer.",
    "full_text": null
}