{
  "title": "Design and Modeling of an Integrated Micro-Transformer in a Flyback Converter",
  "url": "https://openalex.org/W361235272",
  "year": 2013,
  "authors": [
    {
      "id": "https://openalex.org/A5077632604",
      "name": "Mokhtaria Derkaoui",
      "affiliations": [
        "Université des Sciences et de la Technologie d'Oran Mohamed Boudiaf"
      ]
    },
    {
      "id": "https://openalex.org/A5101429306",
      "name": "Azzedine Hamid",
      "affiliations": [
        "Université des Sciences et de la Technologie d'Oran Mohamed Boudiaf"
      ]
    },
    {
      "id": "https://openalex.org/A5017853468",
      "name": "Thierry Lebey",
      "affiliations": [
        "Université Toulouse III - Paul Sabatier"
      ]
    },
    {
      "id": "https://openalex.org/A5113973613",
      "name": "Rabia Melati",
      "affiliations": [
        "Université des Sciences et de la Technologie d'Oran Mohamed Boudiaf"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2292408904",
    "https://openalex.org/W2289344184",
    "https://openalex.org/W2098810578",
    "https://openalex.org/W6676088394",
    "https://openalex.org/W2145229319",
    "https://openalex.org/W78737785",
    "https://openalex.org/W4285719527",
    "https://openalex.org/W231057060",
    "https://openalex.org/W142558646",
    "https://openalex.org/W355910127",
    "https://openalex.org/W2153429334",
    "https://openalex.org/W2183913798",
    "https://openalex.org/W1585881123",
    "https://openalex.org/W597762855",
    "https://openalex.org/W2108757345",
    "https://openalex.org/W2908725024",
    "https://openalex.org/W2567696230"
  ],
  "abstract": "This paper presents the design and modeling of a square micro-transformer for its integration in a flyback converter. From the specifications of the switching power supply, we determined the geometric parameters of this micro-transformer. The π-electrical model of this micro-transformer highlights all parasitic effects generated by stacking of different material layers and permits to calculate the technological parameters by using the S-parameters. A good dimensioning of the geometrical parameters reduces efficiently the energy losses in the micro-transformer and permits to reach the desirable value of the converter output voltage. We have also simulated the electromagnetic effects with the help of the software FEMLAB3.1 in two cases. The first case, without ferromagnetic core, the second case with ferromagnetic core, in order to choose the micro-transformer that has better electromagnetic compatibility with the vicinity components. To validate dimensioning of the geometrical and technological parameters, we have simulated with the help of the software PSIM6.0, the equivalent electrical circuit of the converter containing the electrical circuit of the dimensioned planar micro-transformer.",
  "full_text": "TELKOMNIKA, Vol.11, No.4, December 2013, pp. 669~682 \nISSN: 1693-6930, accredited A by DIKTI, Decree No: 58/DIKTI/Kep/2013 \nDOI: 10.12928/TELKOMNIKA.v11i4.1785   669 \n  \nReceived May 30, 2013; Revised September 30, 2013; Accepted October 22, 2013 \nDesign and Modeling of an Integrated Micro-\nTransformer in a Flyback Converter \n \n \nM. Derkaoui*1, A. Hamid1, T. Lebey2, R. Melati1  \n1 University of Sciences and Technology of Oran (USTO-MB) 31000, Algeria \n2University of Paul Sabatier, LAPLACE Laboratory, Toulouse, France \n*Corresponding author, e-mail: mokhtariaderkaoui@yahoo.fr \n \n \nAbstrak \nDesain dan pemodelan suatu trafo mikro untuk  integrasinya pada sebuah konverter flyback \ndihadirkan pada makalah ini. Parameter geometris trafo mikro ditentukan dari spesifikasi catu daya \nswitching-nya. Model elektris π-dari trafo mikro ini menekankan pada semua efek parasitik yang \ndihasilkam oleh penumpukan berbagai bahan lapisan yang berbeda dan memungkinkan penghitungan \nparameter teknologis dengan menggunakan param eter S. Sebuah penentuan dimensi parameter \ngeometris yang baik dapat mengurangi rugi-rugi day a pada trafo mikro secara efisien dan memungkinkan \ntercapainya nilai tegangan keluaran konverter yang diinginkan. Simulasi efek elektromagnetik dengan \nmenggunakan perangkat lunak FEMLAB3.1 pada dua kasus juga dihadirkan. Pada kasus pertama, tanpa \ninti ferromagnetik, dan yang kedua dengan inti fe rromagnetik untuk memilih trafo mikro yang memiliki \nkompatibilitas elektromagnetik yang lebih baik dengan komponen di sekitarnya. Untuk menvalidasi dimensi \ngeometris dan parameter teknogianya, dilakuka n simulasi dengan perangkat lunak PSIM6.0 pada \nrangkaian listrik yang setara dengan konverter yang memiliki rangkaian listrik dari trafo mikro yang \ndihasilkan.  \n \nKata kunci: konverter fly-back, integrasi, micro-transformer planar, parameter S  \n \n \nAbstract \nThis paper presents the design and modeling of a square micro-transformer for its integration in a \nflyback converter. From the specif ications of the switching power su pply, we determined the geometric \nparameters of this micro-transformer. The π-electrical model of this micro-transformer highlights all \nparasitic effects generated by stacking of different  material layers and permits to calculate the \ntechnological parameters by using the S-parameters. A good dimensioning of the geometrical parameters \nreduces efficiently the energy losses in the micro-trans former and permits to reach the desirable value of \nthe converter output voltage. We hav e also simulated the electromagnetic effects with the help of the \nsoftware FEMLAB3.1 in two cases. The first case, without ferromagneti c core, the second case with \nferromagnetic core, in order to choose the micro-tr ansformer that has better electromagnetic compatibility \nwith the vicinity components. To validate dimensioni ng of the geometrical and technological parameters, \nwe have simulated with the help of the software PSIM6.0 , the equivalent electrical circuit of the converter \ncontaining the electrical circuit of the dimensioned planar micro-transformer. \n \nKeywords: fly-back converter, integration, planar micro-transformer, S-parameters \n \n \n1. Introduction \nSince its appearance, power electronics has never ceased to evolve. Currently, this \ndiscipline is present in the majority of electrical  systems, ensuring control of energy supply and \nthe integrity of the components. Planar micro- transformers are widely used in monolithic \nintegrated circuits; so, new techniques must be developed to reduce the size of elements and \nreach better efficiency. The monolithic and hybrid integration of power electronic devices pose \nnew research challenges in the coming years. The micro-transformer constitutes an important \ncomponent of the switching power supply such as  the flyback that is the most commonly used \nfor low output power applications where the out put voltage needs to be isolated from the input \nmain supply. The output power of  flyback circuits may vary from few watts to less than 100 \nwatts. \n \n \n                   ISSN: 1693-6930 \nTELKOMNIKA  Vol. 11, No. 4, December 2013:  669 – 682 \n670\n2. Presentation Of Flyback Converter \nThe converter is the starting point of t he design of the micro-transformer. We have \nchosen a flyback converter (figure 1) because it  is composed of a transformer and few passive \ncomponents. The principle of operation of the flyback is based on the energy transfer from \nprimary to secondary through a transformer [1]- [3]. The specifications shown as Table 1 and \nTable 2. \n \n \nTable 1. Main Specification \nParameters Values \nInput Voltage [Vin] (V) 12 \nOutput voltage [Vout] (V) 5 \nOutput power [Pout] (W) 5 \nDuty cycle [α] 0.5 \nOperation Frequency  (MHz) 100 \n \n \nTable 2. Material Specifications \nElements Material Characteristics \nmagnetic  Ferrite (NiZn) Maximal induction of saturation: B max= 0.3T \nRelative permeability: μr= 1400 \nRelative permittivity: εr= 12 \nResistivity: ρNiZn= 10\n3\nΩ.m \nConductor Copper (Cu) Resistivity: ρCu= 1.7 .10\n−8 \nΩ.m \nOxide Silicon dioxide (SiO2) Relative permittivity: εr= 3.9 \nSubstrate Silicon (Si) Resistivity: ρSi= 18.5 Ω.m \n \n \n3. Dimensioning of the Micro-Transformer \nBy taking into account selected electrical and magnetic characteristics, we evaluate the \nvolume of the magnetic core. This enables us  to define the section on which we will put the \nelectrical circuit of the micro-tr ansformer; then we will evaluate the dimensions of this circuit in \norder to meet the specifications of the conver ter in terms of magnetic storage of energy and \nlosses in materials. \n \n3.1. Dimensioning of the magnetic circuit \nTurn ratio \n \nߙ\nെ1\n௢௨௧\n௜௡\nൌ 0.417\t\t\t\t\t\t\t\t\t\t\t  (1) \n \nThe primary inductance Lp is calculated for a maximum current undulation   α = 0.5: \n \n௜௡\nଶ\n2.݂௢௨௧ (2) \n \nThe secondary inductance Ls is derived from the relation (2): \n \n௣ (3) \n \nThe total magnetic energy stored is therefore: \n \nൌ 1\n2\n௜௡\nଶ ൌ 1\n2௢௨௧\nଶ ൌ 3.12510ିଽܬ4) \n \nMaximum volume density of energy: \n \n௠௔௫\nଶ\nே௜௓௡\nൌ 25.59\tܬଷ\n (5) \nTELKOMNIKA  ISSN: 1693-6930  \n \nDesign and Modeling of an Integrated Micro-Transformer in a Flyback Converter (Derkaoui) \n671\nVolume of the core: \n \nܹ\n௩௠௔௫\nଷ\n (6) \n \nSo, 0.122mm3 of NiZn is necessary to store 3.125nJ. We have chosen the square form (figure \n2) for the windings with outer diameter equal to 1500 µm and inner diameter equal to  \n750 µm. \n \nCore thickness: \n \ne\nܸ\n݀௢௨௧\nଶ  (7) \n \n3.2. Calculation of the geometrical parameters  \nThe planar square windings are geometrica lly described by five parameters to each \nwinding (Figure 2) which are: turn’s number n, width w, the thickness t, spacing between \nwindings s and total length lt. \n \n \n \n \nFigure 1. Schematic diagram of flyback \nconverter \n \n \nFigure 2. Geometry of square spiral windings \n[4] \n \n \nTo calculate the number of turns, we have opted to the Wheeler method which is represented \nby relation 8 [5]: \n \nLൌ\tk ଵµ଴\nnଶdୟ୴୥\n1൅k ଶA୫ (8) \n \nThe coefficients k 1 and k 2 depend on the geometrical form used. For the square geometry: \nk1=2,34 and k2=2,75. \n \ndୟ୴୥ ൌ\nୢ౥౫౪ାୢ౟౤\nଶ     ,   A୫ ൌ\nୢ౥౫౪ିୢ౟౤\nୢ౥౫౪ାୢ౟౤ (x) \n \nSo, primary and secondary turns’ numbers are:   \n \nn୮ ൌ ඪ\nL୮ ቆ1൅k ଶ ൬d୭୳୲െd୧୬\nd୭୳୲൅d୧୬\n൰ቇ\nkଵµ଴ ൬d୭୳୲ ൅d୧୬\n2 ൰  \n(9) \n \n\n                   ISSN: 1693-6930 \nTELKOMNIKA  Vol. 11, No. 4, December 2013:  669 – 682 \n672\nnୱ ൌm .n୮ (10)\n \nThe calculation of these two parameters (P rimary thickness and width) depends on skin \nthickness (equation 11) which determines the widt h of the zone where the current concentrates \nin a conductor [6] [7] [8]. \n \nδ ൌ ඨ\nρେ୳\nπ.μେ୳.f (11)\n \nTo circumvent the problem of the skin effect and make the current flowing in the entire \nconductor, it is necessary to fulfill one of the following conditions: \n \nߜ11)\n \nThe current density for x ranging from 0 to t/2 is given by; \n \njሺxሻ ൌj ଴eି୧ቀ୶\nδቁeିቀ୶\nδቁ (12)\n \nThe average value of the current density is: \n \njୟ୴୥ ൌj ଴\n൤eିቀ ୲\nଶδቁ ൅1൨\n2  \n(13)\n \nOne of the two values t or w set in order to find the other. The width of the primary conductor w p \nis is derived from the equations (14) and (15) for a value of t = 2. δ (t: thickness of the \nconductors of primary and secondary). \n \ni୮ ൌS c୮.jୟ୴୥ (14)\n \nSc୮ ൌw ୮.t (15)\n \nWhere Scp: primary conductor’s section. \nIn most cases, micro-conductors are in contac t with the substrate that has good conduction \nproperties of temperature. This allows us to use the boundaries conditions: j଴ ൌ1 0ଽ\tA/m²  [9]. \nPrimary spacing \n \ns୮ ൌ d୭୳୲ െd୧୬ െ൫2.w ୮.n୮൯\n2.൫n୮ െ1൯  (16)\n \nPrimary total length \n \nlt୮ ൌ൬ 4 n୮ ቀd୭୳୲ െ൫n୮ െ1൯s୮ െ൫n୮.w୮൯ቁ൰െs ୮ (17)\n \nWe have taken the same spacing for both the primary and secondary windings: \n \nwୱ ൌ ሾd୭୳୲ െd୧୬ െ2.s ୱ.ሺnୱ െ1ሻሿ\n2.nୱ  (18)\n \nSecondary total length: \n \nl\n୲ୱ ൌൣ 4 .nୱ.൫d୭୳୲ െሺnୱ െ1ሻ.sୱ െሺnୱ.wୱሻ൯൧െs ୱ (19)\n \nTELKOMNIKA  ISSN: 1693-6930  \n \nDesign and Modeling of an Integrated Micro-Transformer in a Flyback Converter (Derkaoui) \n673\nThe magnetic circuit design must also take into account the existence of losses and the \nappearance of the skin effect in relation to t he high-frequency operation. These side effects, \nwhich degrade the performance of the componen t, can be reduced by flipping the magnetic \ncores. This may, however, increase the total volume of the core. \n \n \n4. Modelling of Integrated Planar Micro-Transformer \nThe electrical behavior of an integrated micro-transformer is shown in Figure 3. Figure 4 \nshows the electrical equivalent model extracted from the diagram in Figure 3, which will be used \nto simulate the behavior of the micro-transformer. The equivalent circuit of Figure 4 contains the \nfollowing electrical parameters: \n1. Inductances L\np and Ls of the two windings \n2. Serial resistance R sp and Rssof the two windings \n3. Oxide capacitance C oxp, Coxs \n4. Resistance of the magnetic layer R magp, Rmags, \n5. Resistances R subp, Rsubs associated to the silicon substrate \n6. Capacitance C subp, Csubs associated to the silicon substrate, \n7. Coupling capacitance C KP, Cks of the two windings \n8. Coupling capacitance C k between the two windings \n \n \n \n \nFigure 3. 3D cross section of an integrated \nplanar micro-transformer. \n \n \n \n \nFigure 4. Equivalent circuit of an integrated \nplanar micro-transformer [10]-[12] \n \n \n4.1. Calculation of the technological parameters \nThe analytical expressions of different elements are: \n \n௣\n௘௙௙\n௦\n௘௙௙ (20)\n \nefft : is given by the expression; tୣ୤୤ ൌ δቀ1െe ିቀ౪\nδቁቁ \nRୱ୳ୠ୮ ൌ2 .ρୗ୧ . eୗ୧\nw୮.l୲୮\n\t\t\t\t\t\t\tRୱ୳ୠୱ ൌ2 .ρୗ୧ . eୗ୧\nwୱ.l୲ୱ (21)\n \nR୫ୟ୥୮ ൌ2 .ρ୒୧୞୬\t. e୒୧୞୬\nw୮.l୲୮\n\t\t\t\t\t\t\tR୫ୟ୥ୱ ൌ2 .ρ୒୧୞୬ . e୒୧୞୬\nwୱ.l୲ୱ (22)\n \n\n                   ISSN: 1693-6930 \nTELKOMNIKA  Vol. 11, No. 4, December 2013:  669 – 682 \n674\nC୭୶୮ ൌ 1\n2.ε୭୶.w୮.l୲୮\nt୭୶\n\t\t\t\t\t\t\t\t\t\t\t\tC୭୶୮ ൌ 1\n2.ε୭୶.wୱ.l୲ୱ\nt୭୶  (23)\n \nCୱ୳ୠ୮ ൌ 1\n2.εୗ୧.w୮.l୲୮\neୱ୧\n\t\t\t\t\t\t\t\t\t\tCୱ୳ୠୱ ൌ 1\n2.εୗ୧.wୱ.l୲ୱ\neୱ୧  (24)\n \nC୩୮ ൌ 1\n2.ε୭୶.t.l୲୮\ns୮\n\t\t\t\t\t\t\tC୩ୱ ൌ 1\n2.ε୭୶.t.l୲ୱ\nsୱ  (25)\n \nC୩ ൌ ε୭୶.d୭୳୲\nଶ\nt୭୶  (26)\n \n4.2. Concept of S-parameters \nThe scattering parameters of the micro-transformer can be easily obtained from the \nlocalized model. The S-parameters of Figure 4 are calculated as follows [13]: \nFirst, we calculate the ABCD matrices for each block. \n \nቂ\nܣܤ \nቃ\nఈ\nൌ൦\n10\n1\n1\n௢௫௣\n௦௨௕௣\n௦௨௕௣\n1൪ \n \nܤܣ\nቃ\nఉ\n௦௣\n01 ൨ \n \nܤܣ\nቃ\nఊ\nൌെ\nۏ\nێ\nێ\nۍ௣\nܯ௦\nܯ൰\n1\nܯ݆߱\n௦\nܯے \nۑ\nۑ\nې\n \n \nܤܣ\nቃ\nఋ\n௦௦\n01 ቃ \n \nܤܣ\nቃ\nఌ\nൌ൦\n10\n1\n1\n௢௫௦\n௦௨௕௦\n௦௨௕௦\n1൪ \n \nቂܣܤ \nቃ\nఝ\nൌ൥ 1 1\n݆௞\n01\n൩ \n(x) \n \nWhere ௦ \nNext, we can combine the blocks α, β, γ, δ, ε, φ in cascade: \n \nܤܣ\nቃ\nூ\nܤܣ\nቃ\nఈ\nܤܣ\nቃ\nఉ\nܤܣ\nቃ\nఊ\nܤܣ\nቃ\nఋ\nܤܣ\nቃ\nఌ\nܤܣ\nቃ\nఝ\n(x) \n \nThen, we can combine the large intermediate block I with block φ in parallel. The final ABCD \nmatrix of the entire transformer F is given below: \n \nܤܣ\nቃ\nி\nൌ 1\nఝ\n.ቈ\nఝ\nఝ\n቉ (x) \n \nFinally, we can convert the A, B, C, D parameters to S-parameters as follows: \n \nTELKOMNIKA  ISSN: 1693-6930  \n \nDesign and Modeling of an Integrated Micro-Transformer in a Flyback Converter (Derkaoui) \n675\nSଵଵ ൌ\nA୊ ൅B୊\nZ଴\nെC୊.Z଴ െD୊\nA୊ ൅B୊\nZ଴\n൅C୊.Z଴ ൅D୊\n\t\t\t Sଵଶ ൌ 2.ሺA୊.D୊ െሺB୊.C୊ሻሻ\nA୊ ൅B୊\nZ଴\n൅C୊.Z଴ ൅D୊\n (27)\n \nSଶଵ ൌ 2\nA୊ ൅B୊\nZ଴\n൅C୊.Z଴ ൅D୊\n\t\t Sଶଶ ൌ\nെA୊ ൅B୊\nZ଴\nെC୊.Z଴ ൅D୊\nA୊ ൅B୊\nZ଴\n൅C୊.Z଴ ൅D୊\n (28)\n \nHere, Z0 is the characteristic impedance of the line. Also, note that due to reciprocity, we will \nhave A୊.D୊ െB୊.C୊ ൌ1 ;  therefore, S12=S21. \n \n \n5. Geometrical And Electrical Parameters Results \n5.1. Geometric dimensioning results \nThe geometric parameters of micro-transformer are shown in the Table 3. \n \n \nTable 3. Results of dimensioning of geometrical parameters \nGeometrical parameters values \nPrimary turns: np 5 \nSecondary turns: ns 2 \nOuter diameter: dout 1500µm \nInner diameter: din 750 µm \nThickness of magnetic core: eNiZn 57.24 µm \nThickness of winding: t 13.13 µm \nWidth of primary winding: wp 46.39 µm \nWidth of secondary winding: ws 169.62µm \nInter-spacing of primary winding: sp 35.75 µm \nInter-spacing of secondary winding: ss 35.75 µm \nTotal length of primary winding: ltp 2.25 cm \nTotal length of secondary winding: lts \nConductor’s skin thickness: δ \n9 mm \n6.56 µm \n \n \nWe note that the values of the calculated geo metric parameters are according with technical \nintegration. \n \n5.2. Results of electrical parameters \nThe Table 4 shows the electrical parameters calculated. \n \n \nTable 4. Electrical parameters results \nElectrical parameters values \nPrimary inductance: Lp \nSecondary inductance: Ls \nPrimary serial resistance: Rsp \nSecondary serial resistance : Rss \nPrimary magnetic resistance : Rmagp \nSecondary magnetic resistance :Rmags \nPrimary resistance of silicon substrate :Rsubp \nSecondary resistance of silicon substrate :Rsubs \nPrimary oxide capacitance :Coxp \nSecondary oxide capacitance :Coxs \nPrimary capacitance of silicon substrate :Csubp \nSecondary capacitance of silicon substrate :Csubs \nPrimary coupling capacitance :Ckp \nSecondary coupling capacitance :Cks \nCoupling capacitance between two windings :Ck \n36 nH \n6.25 nH \n1.45Ω \n0.16Ω \n103.98 KΩ \n71.1 KΩ \n3.54 KΩ \n2.42 KΩ \n2.5 pF \n3.66 pF \n0.54 pF \n0.79 pF \n0.14 pF \n0.057 pF \n10.79 pF \n \n \n \n \n                   ISSN: 1693-6930 \nTELKOMNIKA  Vol. 11, No. 4, December 2013:  669 – 682 \n676\nInfluence of frequency on the primary and secondary inductances and serial resistances \nThe curves of Figure 5 show the influence of the frequency on inductors and series resistances \n(primary and secondary) \n \nL\n୮ ൌ ImሺZଵଵሻ\nω \t\t\t\t\t\t\t\t\t\t\t\tLୱ ൌ ImሺZଶଶሻ\nω (29)\n \nRୱ୮ ൌR e ሺ Zଵଵሻ \t\t\t\t\t\t\t\t\t\tRୱୱ ൌR e ሺ Zଶଶሻ (30)\n \n  \n \n(a) \n \n(b) \n \nFigure 5. Primary and secondary inductances (a) and serial resistances (b) versus frequency \n \n \nFigure 5 shows the influence of the frequency on the inductance and series resistance of \nprimary and secondary windings. We observe the characteristics of inductance behavior: The \ninductive behavior, a transition zone and finally the capacitive behavior [14]. \n \nInfluence of frequency on the quality factor of primary and secondary windings \nThe quality factor expresses losses of power in the micro-transformer; it is defined as following \n[10] [12]: \n \nݕ݃ݎ݁݊݁݀݁݇ܿ݋ݐݏ \nݕ݃ݎ݁݊݁݀݁ݐܽ݌݅ݏݏ݅݀ 31)\n \nThe quality factors of inductors primary and secondary are given by the formulas (32) \n \nଵଵሻ\nଵଵሻଶଶሻ\nଶଶሻ (32)\n \nFigure 6 shows the evolution of the quality factor as a function of frequency for the primary and \nsecondary inductances. \n \n \nFig. 6: Quality factor of the primary and secondary windings versus frequency. \n10\n6\n10\n7\n10\n8\n10\n9\n10\n10\n-1\n-0.8\n-0.6\n-0.4\n-0.2\n0\n0.2\n0.4\n0.6\n0.8\n1\nLp=(f)   Ls=f(f)\nFrequency (MHz)\nInductances (nH)\n \n \nLp\nLs\n10\n6\n10\n7\n10\n8\n10\n9\n10\n10\n-1\n-0.8\n-0.6\n-0.4\n-0.2\n0\n0.2\n0.4\n0.6\n0.8\nRsp=(f)   Rss=f(f)\nFrequency (MHz)\n Serial resistances (Ohm)\n \n \nRsp\nRss\n0.5 1 1.5 2 2.5\nx 10\n8\n-10\n-5\n0\n5\n10\n15\n20\n25\n30\n Q = f(f)\nFrequency (Hz)\nQuality factor Q\n \n \nPrimary Q\nSecondary Q\nTELKOMNIKA  ISSN: 1693-6930  \n \nDesign and Modeling of an Integrated Micro-Transformer in a Flyback Converter (Derkaoui) \n677\n6. Simulation Of The Operating Converter \nWe performed simulations in order to test the operation of our flyback converter in three \ncases: The converter contains an ideal transfor mer (lossless), a real transformer (with losses) \nand an integrated micro-transformer. The simulation was performed using PSIM software 6.0. \nInitially, we need to calculate the following three parameters: \n \nLoad resistance of the flyback converter \nThe load resistance of the flyback converter is given by Equation 33. \n \n\tR ൌV୭୳୲\ni୭୳୲\nൌ5 Ω (33)\n \nCapacitance of the flyback converter \nThe capacity of the fly-back converter is gi ven by the formula below. For a voltage undulation \nequal to 0.25V, the capacitor C is equal to: \n \n\tC ൌ αଶmV୧୬\nሺ1െ αሻ∆V୭୳୲Rf ൌ2 0 \t n F (34)\n \nMagnetizing inductance \nThe magnetizing inductance is defined by, \n \nL\n୫ ൌn ୮\nଶ.\nµ୒୧୞୬.d୭୳୲\nଶ\n2.e୒୧୞୬\nൌ0 . 9 \t m H (35)\n \n6.1. Simulation of the operating converter with an ideal transformer \nIn this simulation, the circuit of Figure 7 contains an ideal transformer and the Figure 8 \nshows the waveform of the output voltage and current of the converter. We also note in Figure 7 \nthe two modes of the converter: the transient  and steady state. The output voltage is 4.9 V \ninstead of 5V. This is due to voltage drops across  the diode and transistor. In the steady state, \nthe current is 0.98A, which corresponds to an output power of 4.8 W in place of 5 W. The Figure \n9 shows the waveform of the voltage and current  across of both transistor and diode of the \nflyback. \n \n6.2. Simulation of the operating converter with a real transformer \nIn this simulation, the circuit of Figure 10 contains a real transformer and the Figure 11 \nshows the waveform of the output voltage and curr ent of the converter. We also note here the \nexistence of two modes of operation of the converter: the transient and steady state.  \n \n \n \n \nFigure 7. Flyback with an ideal transformer \n \n \nFigure 8. Output voltage and current of \nflyback with an ideal transformer \n\n                   ISSN: 1693-6930 \nTELKOMNIKA  Vol. 11, No. 4, December 2013:  669 – 682 \n678\n \n \nFigure 9. Voltage and current of both transistor and diode of the flyback with an ideal \ntransformer \n \n \nThe output voltage is 4.25 V instead of 5V . This is due to the voltage drop across the \ndiode and the transistor, the resistive losses in the conductor and then the magnetic core \nlosses. In the steady state, the current is 0.85A, which corresponds to an output power of \n3.6Win place of 5 W. The Figure 12 shows the waveform of the voltage and current across of \nboth transistor and diode of the flyback. \n \n \n \n \nFigure 10. Flyback with a real transformer \n \n \nFigure 11. Output voltage and current of \nflyback with a real transformer \n \n \n \n \nFigure 12. Voltage and current of both transistor and diode of the fly-back with a real micro-\ntransformer \n\nTELKOMNIKA  ISSN: 1693-6930  \n \nDesign and Modeling of an Integrated Micro-Transformer in a Flyback Converter (Derkaoui) \n679\n6.3. Simulation of the operating converter with an integrated micro-transformer \n In this simulation, the circuit of Figure 13 contains an integrated micro-transformer and \nthe Figure 14 shows the waveform of the output voltage and current of the converter. We note \nagain, the existence of two regimes of operation of the converter: transient and steady state. \nThe output voltage is 4.24V instead of 5V. This  is the voltage drop across the diode and the \ntransistor, the resistive losses in the conductor s and then the magnetic core losses. In steady \nstate, the current is 0.84 A, which corresponds to an output power of 3.6W instead of 5 W. The \nFigure 15 shows the waveform of the voltage and cu rrent across of both transistor and diode of \nthe flyback. We note that the micro-transformer delivers the same power as a real transformer. \n \n \n \nFigure 13. Flyback with an integrated micro-\ntransformer \n \n \n \n \n \n \n \n \n \n \nFigure 14. Output voltage and current of \nflyback with an integrated micro-transformer \n \n \n \n \nFigure 15. Voltage and current of both transistor and diode of the flyback with an integrated \nmicro-transformer \n \n \n\n                   ISSN: 1693-6930 \nTELKOMNIKA  Vol. 11, No. 4, December 2013:  669 – 682 \n680\n7. The Flyback Converter Efficiency \nThe efficiency of converter (Formula 36) tells  us about his performance. Pj is copper \nlosses and Pf is Iron losses. \n \n\tη ൌ P\n୭୳୲ െP୨ െP୤\np୭୳୲  (36)\n \n௢௨௧ (37)\n \n௢௨௧\nଶ (38)\n \n௜௡\nଶ\n௦௘௤ (39)\n \nThe efficiency found is around 82%, so near to  the performance of an operating flyback \nconverter which is 85%. We conclude that this  reduction corresponds to the joules losses \ngenerated by conducting windings and the iron losses in the ferromagnetic core. \n \n \n8. Simulation 3d Of The Electromagnetic Effects In A Planar Micro-Transformer \n In this section, we present the distribu tion of the electromagnetic field in a micro-\ntransformer with and without core. This simulation was performed using the software FEMLAB \n3.1. \n \n8.1. Simulation without magnetic\n core \n Figure 17 shows the planar micro-transfor mer without magnetic core. Figure 18 shows \nthe distribution of magnetic field lines in the micro-transformer. \n \n \n \n \nFigure 16. Evolution of the flyback converter \nefficiency versus frequency \n \n \nFigure 17. Planar micro-transformer which to \nbe simulated without magnetic core \n \n \n8.2. Simulation with magnetic core \n Figure 19 shows the micro-planar transformer  with magnetic core. Figure 20 shows the \ndistribution of magnetic field lines in the micro-transformer. When we insert a ferromagnetic \nlayer on the top and bottom of the insulating layer,  the majority of the  magnetic field lines are \nconcentrated at the walls of the magnetic block (Figure 20). So, we conclude that the \nferromagnetic layers are required to have a good electromagnetic compatibility in the case of \nthe integration of a transformer. \n0 1 2 3 4 5 6 7-10\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\nEfficiency of Fly-back converter\n Outup power Pout (Watt)\nE f f i ci ency ( % )\n \n \nIdeal µtransfo\nReal µtransfo\nIntegrated µtransfo\n\nTELKOMNIKA  ISSN: 1693-6930  \n \nDesign and Modeling of an Integrated Micro-Transformer in a Flyback Converter (Derkaoui) \n681\n \n \n \n \n \nFigure 18. Propagation of magnetic field lines in a planar micro-transformer without magnetic \ncore \n \n \n \n \nFigure 19. Schematic of planar micro-transformer with a magnetic core \n \n \n \n \n \n \n \n  \nFigure 20. Propagation of magnetic field lines in a planar micro-transformer with a magnetic \ncore \n \n \n9. Conclusion\n \nIn this paper, we have presented the dimensioning, the modeling and the simulation of \na square planar micro-transformer. First, we hav e determinate the volume of the magnetic core \nnecessary for the storage of ener gy and the accumulated losses. Then we have calculated the \n\n                   ISSN: 1693-6930 \nTELKOMNIKA  Vol. 11, No. 4, December 2013:  669 – 682 \n682\ngeometrical parameters taking into account the maximum area occupied by the windings. We \nhave used the S-parameters method to determine the technological parameters.  \nNext, by using a software simulation PSIM6.0, we have compared the waveforms of the \nconverter output voltages for the three simulati ons. Finally, by using the software FEMLAB3.1, \nwe have visualized the electromagnetic phenomen on in planar micro-transformers, with and \nwithout magnetic core. The aim of this simulation is to study the electromagnetic compatibility of \nthe micro-transformer with the vicinity components in the converter. \nWe conclude that the results of dimensioning in this paper are interesting indeed. \n \n \nReferences \n[1] V Boyer, N Godefroy. Alimentation à découpage Flyb ack. M1-IUP GEII. Université Joseph Fourier. \n[2] Q Laurent, Y Heinrich. Réalisation d'un converti sseur Flyback. Projet ENPU, INSA. Strasbourg. \n[3] JYs Le Chenadec. Alimentation à découpage, Etude,  Choix et Dimensionnement des Alimentations à \nDécoupage Usuelles. Lycée Louis ARMAND. Strasbourg. \n[4] P Gomes. Monolithic Power Combiners in CMOS  technologies for WLAN applications. Instituto \nSuperior Técnico. Universida de Técnica de Lisboa. 2011. \n[5] B Estibals, C Alonso, A Sa lles, J Schanen, R Perret. “ Validation d’outils de simulation d’éléments \ninductifs pour convertisseur statique intégré “. Laboratoire d’Analyse et d’Architecture des Systèmes \nLAAS du CNRS. Toulouse et Laboratoire d’Electrotechnique de Grenoble. France. \n[6] Fu Keung Wong. High Frequency Transformer for Switching Mode Power Supplies. School of \nMicroelectronic Engineering. Facult y of Engineering and Information Technology Griffith University. \nBrisbane. Australia. 2004. \n[7] A Ghannam. Conception et intégration \"above IC\" d’inductances à fort coefficient de surtension pour \napplications de puissance RF. Université Toulouse III– Paul Sabatier. 2010. \n[8] X Margueron. Elaboration sans prototypage du ci rcuit équivalent de transformateurs de type planar. \nLaboratoire d'Electrotechnique de Grenoble. Université Joseph Fourier. 2006. \n[9] C Alonso. “Contribution à l’optimisation, la gestion  et le traitement de l’énergie“. Université Paul \nSabatier – Toulouse III. 2003. \n[10] D Kehrer. “Design of Monolithic Integrated Lumped Transformers in Silicon-based Technologie sup to \n20 GHz”. Wien University. 2000. \n[11] R Thüringer. “Characterization of Integrated Lumped Inductors and Transformers”. Wien University. \n2002. \n[12] Y Maycvskiy. Analysis and Modeling of Mono lithic On-Chip Transformers on Silicon Substrates. \nOregon State University. United States of America. 2005. \n[13] Shwetabh Verma, Jose M Cruz. “On-chip Inductors and Transformers”. SMLI TR-99-79. 1999. \n[14] YK Koutsoyannopoulos. Systematic Analysis and Modeling of Integrated Inductors and Transformers \nin RF IC Design.  Analog and Digital Signal Processing. 2000; 47(8): 699. \n[15] Xun Liu, S Y Ron Hui. Equivalent Circuit Modeling of a Multilayer Planar Winding Array Structure for \nUse in a Universal Contactless Battery Charging Platform. IEEE transactions on power electronics.  \n2007; 22(1). \n[16] A Salles. Conception d’éléments passifs magnétiques pour convertisseurs de faible puissance.  \nUniversité Toulouse III. Paul Sabatier. 2008. \n[17] S Musunuri , PL Chapman , J  Zou , C Liu. Design Issues for Monolithic DC–DC Converters. IEEE \nTransactions On Power Electronics. 2005; 20(3). \n[18] Kharagpur. DC to DC Converters, Fly-Back Type Switched Mode Power Supply. Version 2 EE IIT. \n[19] Andreas Weisshaar. Analysis and Modeling of Monolithic On-Chip Transformers on Silicon. 2005. \n[20] Xu Daoxian. Characterization and modeling of Mi cro-wave spiral Transformers and inductors. Peking \nUniversity. China. 2005. \n[21] O'Donnell, Magali Brunet, Paul McCloskey, Joe O’Brien, Seán Cian, Ó Mathúna. Micro transformers \nand Inductors using Permalloy Thin Films. Cork. Ireland. \n[22] B Allard, S Azzopardi, Jc crebier, Z Khatir, E Labouré, T Lebey, Jl sanchez. Enjeux Et Défis de \nL'intégration 3D en Électronique de Puissance. ISP3D. \n[23] Alberto M Pernía, Miguel J Prieto, Juan M Lopera. High Power Density DC/DC Converter Using Thick-\nFilm Hybrid Technology . Universidad de Oviedo. Campus de Viesques. Gijón (Asturias). Spain. \n[24] K Ammous. Contribution à la constructi on systématique des m odèles moyens de convertisseur de \npuissance. Institut national des sciences appliquées. Lyon. 2002. \n ",
  "topic": "Flyback transformer",
  "concepts": [
    {
      "name": "Flyback transformer",
      "score": 0.7982669472694397
    },
    {
      "name": "Transformer",
      "score": 0.7084143161773682
    },
    {
      "name": "Dimensioning",
      "score": 0.7067081928253174
    },
    {
      "name": "Flyback converter",
      "score": 0.6403635740280151
    },
    {
      "name": "Computer science",
      "score": 0.5062221884727478
    },
    {
      "name": "Distribution transformer",
      "score": 0.4387107491493225
    },
    {
      "name": "Voltage",
      "score": 0.42606133222579956
    },
    {
      "name": "Delta-wye transformer",
      "score": 0.4153726100921631
    },
    {
      "name": "Electronic engineering",
      "score": 0.37813276052474976
    },
    {
      "name": "Electrical engineering",
      "score": 0.37307918071746826
    },
    {
      "name": "Engineering",
      "score": 0.15396720170974731
    },
    {
      "name": "Aerospace engineering",
      "score": 0.0
    }
  ]
}