{
  "title": "A Comprehensive Image Steganography Tool using LSB Scheme",
  "url": "https://openalex.org/W381881868",
  "year": 2015,
  "authors": [
    {
      "id": null,
      "name": "Electrical Department, Faculty of Engineering-Shoubra, Benha University, Cairo, Egypt",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2413605445",
      "name": "Sahar A. El Rahman",
      "affiliations": [
        "Benha University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W6684277110",
    "https://openalex.org/W2038917571",
    "https://openalex.org/W2113259592",
    "https://openalex.org/W2160659824",
    "https://openalex.org/W2117523387",
    "https://openalex.org/W2153631546",
    "https://openalex.org/W2111282197",
    "https://openalex.org/W2137655442",
    "https://openalex.org/W6606318847",
    "https://openalex.org/W2142287519",
    "https://openalex.org/W2142599580",
    "https://openalex.org/W2138760583",
    "https://openalex.org/W2132135171",
    "https://openalex.org/W2186900305",
    "https://openalex.org/W2354349676",
    "https://openalex.org/W2188976134",
    "https://openalex.org/W2339234989",
    "https://openalex.org/W154544624",
    "https://openalex.org/W4311373256",
    "https://openalex.org/W4285719527",
    "https://openalex.org/W3142067920",
    "https://openalex.org/W2167036037",
    "https://openalex.org/W1983147739"
  ],
  "abstract": "As a consequence of the fact, transmitting data has been fast and easy these days due to the development of the Internet.Where internet is the most important medium for confidential and non-confidential communications.Security is the major matter for these communications and steganography is the art of hiding and transmitting secret messages through carriers without being exposed.This paper presents a secured model for communication using image steganography.The main concern is to create a Java-based tool called IMStego that hides information in images using Least Significant Bit (LSB) algorithm (1-LSB) and modified Least Significant one Bit algorithm, i.e.Least Significant 2 Bits algorithm (2-LSB).IMStego is a more comprehensive security utility where it provides user-friendly functionality with interactive graphical user interface and integrated navigation capabilities.It provides the user with two operations, which are hiding secret data into images and extracting hidden data from images using 1-LSB or 2-LSB algorithm.IMStego tool hides secrete information in color static images with formats BMP and PNG.",
  "full_text": "I.J. Image, Graphics and Signal Processing, 2015, 6, 10-18 \nPublished Online May 2015 in MECS (http://www.mecs-press.org/) \nDOI: 10.5815/ijigsp.2015.06.02 \nCopyright © 2015 MECS                                                        I.J. Image, Graphics and Signal Processing, 2015, 6, 10-18 \nA Comprehensive Image Steganography Tool \nusing LSB Scheme \n \nSahar A. El_Rahman \nElectrical Department, Faculty of Engineering-Shoubra, Benha University, Cairo, Egypt \nEmail: sahr_ar@yahoo.com \n \n \nAbstract—As a consequence of the fact, transmitting data \nhas been fast and easy these days due to the development \nof the Internet. Where internet is the most important \nmedium for confidential and non -confidential \ncommunications. Security is the major matter for these \ncommunications and steganography is the art of hidin g \nand transmitting secret messages through carriers without \nbeing exposed. This paper presents a secured model for \ncommunication using image steganography. The main \nconcern is to create a Java-based tool called IMStego that \nhides information in images usin g Least Significant Bit \n(LSB) algorithm (1-LSB) and modified Least Significant \none Bit algorithm, i.e. Least Significant 2 Bits algorithm \n(2-LSB). IMStego is a more comprehensive security \nutility where it provides user -friendly functionality with \ninteractive graphic al user interface and integrated \nnavigation capabilities. It provides the user with two \noperations, which are hiding secret data into images and \nextracting hidden data from images using 1 -LSB or 2 -\nLSB algorithm. IMStego tool hides secrete information in \ncolor static images with formats BMP and PNG.  \n \nIndex Terms —Cryptography, Data Hiding,  Image \nSteganography, Information Security,  Least Significant \nBit \n \nI.  INTRODUCTION \nThe growth of Internet users has raised the possibility \nof their data lost or modified by a third party. One of the \nsolutions for protecting data from any potential risk is \nsteganography. Users over the Internet nowadays are \nstruggling with keeping their data secured against any \nattack done by unauthorized people during transmission . \nTherefore, messages that meant to be revealed only by \nthe intended receiver could be exposed. To protect users’ \ndata from being manipulated, steganography is used to \nhide their data in different types of multimedia. Since \nimages are the most widely used medium today and \nhuman visual perception of colors is limited.  \nSteganography is a protection method driven from \nGreek words that means “secret writing”. This method is \nused to hide secret information within other unsuspicious \nones in such a way that it is  impossible to detect its \nexistence. On the other hand, cryptography is concerned \nabout hiding the meaning of the message rather than its \nexistence by using a process called “encryption” [1]. \nTable. 1 shows a comparison between steganography and \ncryptography. \nTable 1. Steganography vs. Cryptography. \n Steganography Cryptography \nDefinition Hiding the existence \nof the message \nHiding the meaning of \nthe message \nCarrier Any digital media Usually text based \nKey Optional Necessary \nObjective Secrete \ncommunication Data protection \nVisibility Never Always \nFails when Detected De-ciphered \n \nSecurity is the major matter for the communications \nover of the internet and steganography is most widely \nrecognized tool for information security [ 2]. \nSteganography is the process of hiding information in \nsuch a way that prevents the detection of hidden \nmessages. In this technique, no one apart from the sender \nand the intended recipient even realize that there is a \nhidden message [ 3]. it  hides a secre t message within \ncover medium such as image, video, text, audio [ 4]. \nThere are two major types of steganography throughout \nhistory, technical and linguistic. Technical steganography \nis more based upon scientific methods of hiding \ninformation while linguist ic employs more creative and \nnon-apparent methods [5].   \nSteganography systems can be grouped by the type of \ncovers used (graphics, sound, text, executable) or by the \ntechniques used to modify the covers [ 4][6][7]. In image \nsteganography, the cover media i s the cover image and \nthe stegomedia is the stegoimage. The images can be \nmanipulated in either spatial domain or frequency domain \nand accordingly there are two main classes into which the \nsteganography techniques may be divided [8].  \nThere are two directions of steganography (as shown in \nFig. 1) protection against detection and protection against \nremoval. The first direction aims to prevent the message \nfrom being detected by any unauthorized third party. The \nsecond direction is called “document marking” wh ich \nconsist of two branches: “watermarking” that hides \ntrademarks into images, music and other types of \nmultimedia and “fingerprinting” which are hidden serial \nnumbers that enable the owner of an intellectual property \nto know the costumer who has broken hi s license \nagreement [9]. \n A Comprehensive Image Steganography Tool using LSB Scheme 11 \nCopyright © 2015 MECS                                                        I.J. Image, Graphics and Signal Processing, 2015, 6, 10-18 \n \nFig. 1. Steganography directions. \nImage steganography has many applications, especially \nin today’s modern, high -tech world. Most people on the \ninternet has a concern about privacy and secrecy. For two \nparties, image steganograph y allows to communicate \nsecretly and covertly. For some morally-conscious people \nis allowed to safely whistle blow on internal actions. Also, \nit allows for copyright protection on digital files using the \nmessage as a digital watermark. One of the other mai n \napplications for image steganography is for the high-level \nor top -secret documents transportation between \ninternational governments [ 4]. Also, it can be used in \nseveral fields such as: human rights organization, medical \nimaging system, military field and  correcting media \ntransition errors. \nSteganographic techniques have various properties \nwhich characterize their strengths and weaknesses. \nProperties include the following: Security, Embedding \ncapacity, Perceptual transparency, Computational \ncomplexity, and Robustness [10][11][12].  \nA. Steganography General Process \nA cover and a message are two basic models required \nin steganography. The message to be hidden in the cover \nis known as “embedded message” where the process of \nhiding the message is called “embedding ”. A password \ncalled “stego-key” might be required for embedding the \nmessage. The resulting file is known as “stego-object” \nwhich contains a combination of the cover and the \nembedded message. Both cover and embedded message \ncan be any type of multimedia. T he technique of \nsteganography requires the existence of an encoder and a \ndecoder. The encoder is used for hiding data while the \ndecoder is used for extracting data. The following \nformula and Fig. 2.  show the general process of \nsteganography [1]. \n \nCover + Embedded message + Stego-key = Stego-object \n                                                                                         (1) \n \n \nFig. 2. Generic process of encoding and decoding. \nII.  RELATED WORK \nThere are a lot of software products and tools th at help \nin embedding secret messages inside other files. In -order \nto accomplish the concept of steganography successfully; \nboth of the sender and receiver need to install the same \nsoftware. The following is a list of some steganography \ntools: \nA. White Noise Storm \nWhite Noise Storm is a DOS based tool that could \neasily embed secret messages in cover images without \nany degradation. However, the integrity of the cover \nimage could be severely affected by noise. The tool uses \nLSB steganography technique to embed se cret messages \nin PCX files. The main disadvantage of this tool is the \nloss of many bits that can be used to hold information. \nAdditionally it uses large cover images to store \ninformation that it could be stored in a smaller cover \nimages using other tools [13]. \nB. StegoDos \nStegoDos is public domain software that only works on \n320x200 pixel images with 256 colors. The tool uses LSB \nsteganography technique to hide secret messages. The \nmain disadvantage of the tool is the size restriction that \nlimits the user’s co ver image to 320x200 pixels in -order \nto have a stego -image that is similar to the original one. \nAnother disadvantage is the dependence on the end -of-\nfile character to end the message that does not have any \nsignificance work since the message after retrieva l \nappears to contain garbage [13]. \nC. StegCure \nStegCure uses three different LSB steganography \ntechniques. In compared with the other tools, StegCure \noffers a better security and has a user -friendly \nfunctionality with interactive graphical user interface \n(GUI) and integrated navigation capabilities. Also, it can \nprevent any attacks by restricting the user to one attempt \nto retrieve the secret message [14]. \nD. IMStego & Similar Tools Comparison \n12 A Comprehensive Image Steganography Tool using LSB Scheme  \nCopyright © 2015 MECS                                                        I.J. Image, Graphics and Signal Processing, 2015, 6, 10-18 \nTable 2. shows a comparison between IMStego tool \nand other image steganography tools. \nTable 2. Image steganography tools comparison \n White \nNoise \n Storm \n[13] \nStegoDos \n[13] \nStegCure \n[14] IMStego \nCapacity of \nSecret \nMessage \nLimited \nhiding \ncapacity \nLimited \nhiding \ncapacity \nLimited \nhiding \ncapacity \nOptimum \nhiding \ncapacity \nImage Size - 320x200 - Variable \nsize \nImage \nFormat PCX \nLossless \n(Ex. GIF \nand \nBMP) \nGIF BMP & \nPNG \nEfficiency Low Low Medium Medium \nShared Key No Yes No Yes \n \nIII.  PROPOSED ALGORITHM \nIn the proposed system LSB substitution is  used to \nembed the message into an ima ge. It works by adjusting \nthe LSB of the carrier image’s pixels  whereas, the last bit \nof each byte in the image is changed to a bit of the secret \nmessage that is known standard LSB (1-LSB).   Also, we \nuse 2-LSB method that differs from the standard LSB \nmethod by allowing more data to be hidden into the cover \nimage. The idea of this method is almost similar to the \nstandard LSB, except that it replaces the 2 -LSB of each \nbyte of the cover image instead of one bit. \nThe LSB insertion differs depending on the num ber of \nbits in an image. In 8 -bit images, the last bit of each byte \nin the image is changed to a bit of the secret message. \nHowever, it has a major limitation, which is embedding \nonly small size data into images. While in 24 -bit images, \nthe last bit of eac h RGB component is changed which \nallows more data to be hidden. LSB concept can be \ndescribed as follows: if the LSB of the cover’s pixel \nvalue C(i,j) is equal to the message bit m to be embedded, \nC(i,j) remain unchanged; if not, set the LSB of C(i,j) to m. \nThe message embedding procedure can be described \nusing the equation below [15]: \n \n    (2) \n \nLSB is effective in using BMP and PNG images since \nthe compression in both of them is lossless. However, \nlarge in size BMP images are required to be used as a \ncover. LSB algorithm can also be used with GIF formats, \nbut the main problem is that the whole color palette \nwould be changed whenever the LSB is modified. To \navoid this problem, grey-scale GIF images are used since \nthey contain 256 shades and the changes will be done \ngradually so that it will be very hard to detect [16]. \nA. Sender Side \nThe whole process of hiding message is explained in \nFig. 3 and Table 3. \nTable 3. The process of message embedding at the sender side. \n1: Read the text message, which is to be hidden in the cover image. \n2: Convert each character of secret message to its equivalent ASCII \ncode. \n3: Convert each ASCII code to its 8 bit binary equivalent. \n4: Determine the length of the message and add it at the header of \nmessage. \n5: Read the cover image row by row. \n6: Convert the pixels of the image from decimal to binary. \n7: Calculate the LSB of each pixel of the cover image. \n8: Replace the LSB of each byte in the cover image with a bit of the \nsecret message. \n9:Repeat the replacement process until no bit is left to be \nembedded. \n \n \nFig. 3. Entire embedding process at the sender side. \n Text to Byte Conversion \nEach character of the message to be hidden is \nconverted to its equivalent ASCII, which then converted \ninto bytes [17]. Fig. 4-a shows an example of this type of \nconversion. \n Message Embedding in Digital Image \nAs mentioned before, each pixel of a 24 -bit image has \nthree-color components, which are RGB and their values \nrange from 0 -255. The first pixels of the image are used \nto save the length of the embedded  message. To hide the \ntext into the image, first the image  is read as an array of \npixel values. Then each component of the RGB is \nconverted to 8-bit binary digits [17] as shown in Fig. 4-b . \nAfter that, the LSB encoder will calculate the LSBs of \nthe image's bytes and then replace each of them with a bit \nof the message [17] as described in Fig. 4-c. \nB. Receiver Side \nThe whole retrieval process is described in Fig. 5-a and \nTable 4. \n A Comprehensive Image Steganography Tool using LSB Scheme 13 \nCopyright © 2015 MECS                                                        I.J. Image, Graphics and Signal Processing, 2015, 6, 10-18 \nTable 4. The process of message retrieval at the receiver side. \n1:    Read the stego-image row by row. \n2:    Get the length of the message from the first pixels. \n3:    Calculate the LSB of each pixel in the stego-image. \n4:    Convert each byte into its equivalent ASCII value. \n5:    Convert ASCII values to characters to get the secret message. \n6:    Repeat until retrieving the entire message. \n Retrieve Message \nThe process of retrieving the message is reversal of the \nencoding process. The length of the message obtained \nfrom the first pixels of the image is used, so the \nextracting process  knows when to stop. The retrieving \nprocess can be done by extracting the LSBs of each pixel \nin the stego -image in one array. Then, each byte is \nconverted back to its equivalent ASCII value, which is \nstored in a byte array [17]. See Fig. 5-b. \n Byte to Text Conversion \nThe byte array used in the message retrieval process is \nnow converted into message by reading the array byte by \nbyte to get each character in the message [17]. \nC. Shared Key \nTo make the algorithm more secure, communicating \nparties will share a stego-key \nk  to be used as a seed for a \nPRNG function. This would help the algorithm to spread \nthe bits of the secret message over the cover instead of \nhiding them sequentially. The output of the PRNG is a \nrandom sequence \n1 nKK\n  where n is the length of \nmessage bits. The sequence is then used by the sender to \ngenerate a sequence of pixel indices \niy  where \n \n11yk\n                                   (3) \n \n1 ,2ii iiy y k  \n                    (4) \n \nMessage bit \ni  would then be embedded into the LSB \nof the pixel \niy  and thus the order in which the secret \nmessage bits are embedded would be determined pseudo-\nrandomly. \nAt the receiver side the same stego -key will be used to \nreconstruct the same random sequence \nik  and therefore \nthe entire sequence of pixel indices \niy  is obtained to \nextract the hidden bits of the secret message [18]. \n \nIV.  TOOL DESIGN AND IMPLEMENTATION \nIMStego tool is considered to be a standalone \napplication where it does not require using neither a \ndatabase nor web server. It is expected to perform  two \nmain operations: hiding and extracting. IMStego tool will \nhave the following screens. \n \n \n \nA. IMStego Main Screens \n Home Screen \nIt is the main Home screen that appears to the user \nwhen opening the IMStego tool, which contains a \ndescription about the tool. I t contains a help icon that \nbriefly explains the concept of image steganography and \nan Exit button to close the tool as shown in Fig. 6-a. \n Hide Screen \nIn this screen the LSB embedding algorithm is \nperformed by taking  cover image, shared key and secret \nmessage as inputs to produce a stego -image as an output . \nFig. 6-b shows the “Hide” tab how will look like. \n \n \n(a) Text to byte conversion. \n \n \n(b) Image conversion. \n \n \n(c) Inserting the message bits into the image. \nFig. 4. Sender side\n14 A Comprehensive Image Steganography Tool using LSB Scheme  \nCopyright © 2015 MECS                                                        I.J. Image, Graphics and Signal Processing, 2015, 6, 10-18 \n \n(a) The entire retrieval process. \n \n \n(b) Message retrieval process. \nFig. 5. Receiver side \n Extract Screen \nIn this Screen the LSB extracting algorithm is \nperformed by taking the stego -image and the shared key \nas inputs to produce the hidden message as an output. Fig . \n6-c shows the “Extract” tab how will look like. \n \n \n(a) IMStego Home Screen. \n \n \n(b) IMStego Hide Screen \n \n(c) IMStego Extract Screen \nFig. 6. IMStego main screens \nB. Steganography Processes \nTo implem ent the LSB algorithm in IMStego,  \nNetBeans software and Java programming lan guage are \nused. After that, the following steps to complete building \nthe tool. \n Hiding Process \n1. The users choose a BMP or PNG image and once the \nimage is selected, a path and a preview of the chosen \nimage will be displayed. \n2. The users select the stego method (1-LSB or 2-LSB). \n3. They enter 4 - 8 numerical digits as a key that must \nbe shared between the sender and the intended \nreceiver.  \n4. After that, they will type their message in the \nspecified place. \n5. When the users press the “Hide” button the entered \nkey will be validated then the message length will be \nchecked and based on that, one of the following \ndecisions will be made: (a) if the entered key was \ninvalid, an error dialog will be displayed, (b) if the \nmessage length exceeded the image length, a \nwarning will pop up to the users telling them that the \nimage is not big enough, and (c) if the message \nlength and the key were acceptable, LSB calculation \nwill take place. \n6. Then a popup window will appear to inform the \nusers that the message was hidden successfully.  \n7. Then they choose a location for saving the stego -\nimage.    \n8. At the end the stego-image will be displayed. \n Extracting Process \n1. The users choose a BMP or PNG stego-image, a path \nand a preview of the chosen image will be displayed.  \n2. The users Select the stego method  (1-LSB or 2-LSB). \n3. they enter 4 - 8 numerical digits as a key that must be \nidentical to the key entered in the hiding process.  \n4. When the users press the “Extract” button the entered \nkey will be validated where an error dialog will be \ndisplayed if the enter ed key was invalid, but in case \nit was acceptable, LSB calculation will take place to \nextract the length of the hidden message.\n A Comprehensive Image Steganography Tool using LSB Scheme 15 \nCopyright © 2015 MECS                                                        I.J. Image, Graphics and Signal Processing, 2015, 6, 10-18 \n5. If the image contains a message, the LSB calculation \nwill take place to extract the hidden message. \n6. The extracted message will b e displayed in the \nspecified place. \n \nV.  RESULTS \nIn IMStego tool that uses 24 -bit images, since they \noffer much more flexibility when used in steganography \nwhere they allow hiding more information than 8 -bit \nimages without affecting the quality of the imag e. \nIMStego will be worki ng on BMP and PNG image \nformats. Based on the comparison between image formats, \nBMP has the ability to hide large amount of information \nwithout causing any visual distortions . PNG format is \nconsidered to be one of the most popular f ormats used on \nthe Internet today.  \nAlso, IMStego tool prompt s the users to select stego-\nmethod and enter a key for hiding and extracting \nprocesses. It provides interactive user interface with the \nhelp and notification messages (Error, Informative…) as \nshown in Table 7 and Table 8. Also, IMStego will not be \nrestricted with a specific image size or number of \nmessage characters to be hidden, but the length of the \nmessage will be determined, based on the size of the \nchosen image. For example, if they chose an image with a \nsize of 640x480 the number of message characters to be \nhidden can be calculated with the following formula: (one \ncharacter = 8 bits). \n \nNumber of characters = ((Number of pixels * Number of \neach pixel bits used) / 8)                                                (5) \n \nSo, they can hide (640x480 * 3) / 8 = 115,200 bytes (or \n921,600 bits) by using the 1 - LSBs of the RGB values of \neach pixel. But in case the number of message bits \nexceeded the number of image LSBs a warning message \nwill pop up to the users telling them th at the image is not \nbig enough. Table  5 shows more examples about \ncalculating the size of secret messages for different image \nsizes. \nTable 5. Examples of different image sizes. \nSize \n(Pixels) \nMESSAGE \nBits Bytes \n800x60\n0 1,440,000  180,000  \n450x45\n0 607,500 75,937 \n564x42\n3 715,716 89,464 \n720x60\n0 1,296,000 162,000 \n \nA. IMStego features \n1. The original images and the resulting stego -images \nlook alike. \n2. Stego-images contain no visual distortions that lead \nthem to be suspected.  \n3. The extracted message is the same as t he hidden \nmessage when the entered key is correct. \n4. The time is very small for hiding and extracting \nprocesses. \n5. it work on Mac OS and Windows platforms. \n6. Processing time increases when message length \nincrease. \n7. it worked well with different: (a) image formats  \n(BMP and PNG), and (b) image, message and key \nsizes. (Case studies(1)&(2)&(3) in Fig. 7,Fig. 8,Fig. \n9 and Table 6. ) \n8. there are no differences between the stego -images of \nboth standard LSB and 2 -LSB methods. (Case \nstudy(4) in Fig. 10 and Table 6. ). \n9. IMStego provides interactive user graphical interface \nas described above. \n \nVI.  CONCLUSION \nThe risks of unauthorized access to secrete information \nare increasing everyday with the development of new \ntechnologies. As a solution image steganography can be \nused to protect our data from being revealed by \nunintended receivers.  IMStego tool  accomplish the \nHiding process, Extracting process, Shared key, Variable \nimage size, Support BMP & PNG color image formats, \nMessage integrity, and Multiple message languages using \n1-LSB and 2 -LSB algorithms.  The experimental results \nshow the proposed tool provides acceptable image quality \nin a way that does not allow anyone to detect their \nexistence and a large message capacity. \nTable 6. Case Studies \nCase Studies (1)&(2)&(3) \nStego Method: 1-LSB \nImage Type: RGB \nImage Format: .PNG \nImage Size: 706 X 437 \nKey: 6 digits \nThe difference between case studies is message language \nCase Study (1) Case Study (2) Case Study (3) \nEnglish Arabic Japanese \nSee Fig. 7 See Fig. 8 See Fig. 9 \nCase Study (4) \nStego Method: 1-LSB  & 2-LSB \nImage Type: RGB  \nImage  Type:  .bmp \nImage Size:  500 X 333 \nMessage Language: English  \n     Key: 6 digits \nFig. 10 shows a comparison between original image and the two \nmethods’ stego-images. \n16 A Comprehensive Image Steganography Tool using LSB Scheme  \nCopyright © 2015 MECS                                                        I.J. Image, Graphics and Signal Processing, 2015, 6, 10-18 \n \n(a) Browsing original image. \n \n \n(b) Hiding process. \n \n \n(c) Successful hiding process. \n \n \n(d) Save window. \n \n \n(e) Stego-image display. \n \n \n(f) Browsing stego-image. \n \n \n(g) Extracting Process. \n \n \n(h) Successful extracting process. \nFig. 7. Case Study (1): Message language( English)\n A Comprehensive Image Steganography Tool using LSB Scheme 17 \nCopyright © 2015 MECS                                                        I.J. Image, Graphics and Signal Processing, 2015, 6, 10-18 \n \n(a) Successful hiding process. \n \n \n(b) Successful extracting process. \nFig. 8. Case Study (2): Message language( Arabic) \n \n(a) Successful hiding process. \n \n \n(b) Successful extracting process. \nFig.9. Case Study(3): Message language( Japanese) \n \n(a) Original image. \n \n \n(b) LSB stego-image. \n \n \n(c) 2-LSB stego-image. \nFig. 10. A comparison between original image and stego-images. \nTable 7. Notification (Informative) messages \nCase Description Informative Messages \nAfter completing the \nhiding process \nsuccessfully the tool \nwill show this message \ninforming the user that \nthe hiding process was \ncompleted successfully.  \nExtracting a message \nfrom an image that does \nnot contain a hidden \nmessage will force the \ntool to show this \nmessage informing the \nuser that the selected \nimage does not have a \nhidden message.  \n \nInformative message #1. \nInformative message #2. \n18 A Comprehensive Image Steganography Tool using LSB Scheme  \nCopyright © 2015 MECS                                                        I.J. Image, Graphics and Signal Processing, 2015, 6, 10-18 \nTable 8. Notification (Error) messages. \nCase Description Error Messages \nClicking on the \n“Hide” or “Extract” \nbuttons without \nchoosing an image \nwill force the tool to \nshow this error \nmessage.  \n \nClicking on the \n“Hide” or “Extract” \nbuttons after: (a) \nentering a key that is \nnot in the range \nbetween 4 to 8 digits, \n(b) entering letters, \nor (c) special \ncharacters will force \nthe tool to show this \nerror message.  \n \nClicking on “Hide” \nbutton without \nentering a message \nwill force the tool to \nshow this error \nmessage. The user \nmust type a message \nbefore performing \nany hiding process.  \nREFERENCES \n[1] A. Kumar, \"Steganography: A Data Hiding Technique,\" \nIJCA, vol. 9, no. 7, Nov. 2010, pp. 19-23. \n[2] Mamta Juneja, “ A Covert Communication  Model-Based \non Image Steganography”, International Journal of \nInformation Security and Privacy (IJISP) , Volum e 8, \nIssue 1. Copyright © 2014. 19 pages. \n[3] Nirmalya Chowdhury, Puspita Manna, “An Efficient \nMethod of Steganography using Matrix Approach”, \nCopyright © 2012 MECS I.J. Intelligent Systems and \nApplications, 2012, 1, pp32 -38.  (http://www.mecs -\npress.org/) DOI: 10.5815/ijisa.2012.01.04. \n[4] Phad Vitthal S., Bhosale Rajkumar S., Panhalkar Archana \nR., “A Novel Security Scheme for Secret Data using \nCryptography and Steganography”,  Copyright © 2012 \nMECS I.J. Computer Network and Information Security, \n2012, 2, pp36-42. (http://www.mecs-press.org). \n[5] Manish Mahajan, Dr. Navdeep Kaur, “Adaptive \nSteganography: A survey of Recent Statistical Aware \nSteganography Techniques”, Copyright © 2012 MECS I.J. \nComputer Network and Information Security, 2012, 10, \npp76-92. (http://www.mecs -press.org/) DOI: \n10.5815/ijcnis.2012.10.08 . \n[6] Shailender Gupta, Ankur Goyal, Bharat Bhushan, \n“Information Hiding Using Least Significant Bit \nSteganography and Cryptography”, Copyright © 2012 \nMECS I.J. Modern Education and Computer Science, \n2012, 6, pp27 -34. (http://www.mecs -press.org/) DOI: \n10.5815/ijmecs.2012.06.04. \n[7] M. Husain and M. Hussain, \"A Survey of Image \nSteganography Techniques,\" IJAST, v ol. 54, May 2013, \npp. 113-124. \n[8] Rajeev Kumar, Khushil K. Saini, and Satish Chand, “A \nNew Steganography Technique Using Snake Scan \nOrdering Strategy”, Copyright © 2013 MECS I.J. Image, \nGraphics and Signal Processing, 2013, 6, pp25 -32. \n(http://www.mecs-press.org/) DOI: \n10.5815/ijigsp.2013.06.04. \n[9] J. Cummins et al., “Steganography and Digital \nWatermarking,” School of Computer Science, The \nUniversity of Birmingham, 2004, pp. 1-24.  \n[10] T. Morkel, J. Eloff and M. Olivier, “An Overview of \nImage Steganography,” in proc.  5th Annual ISSA Conf., \nSandton, South Africa, 2005. [Was: Proceedings of the \nFifth Annual Information Security South Africa \nConference]. \n[11] G V Chaitanya, D Vamsee Krishna, L Anjaneyulu, “A 3 -\nLevel Secure Histogram Based Image Steganography \nTechnique”, Copyr ight © 2013 MECS I.J. Image, \nGraphics and Signal Processing, 2013, 4, pp60 -70. \n(http://www.mecs-press.org/) DOI: \n10.5815/ijigsp.2013.04.08. \n[12] Amir Farhad Nilizadeh, Ahmad Reza Naghsh Nilchi, \n“Steganography on RGB Images Based on a “Matrix \nPattern” using Rand om Blocks”, Copyright © 2013 \nMECS I.J. Modern Education and Computer Science, \n2013, 4, pp8 -18. (http://www.mecs -press.org/) DOI: \n10.5815/ijmecs.2013.04.02. \n[13] N. F. Johanson and S.Jajodia. “Exploring Steganography: \nSeeing The Unseen,” IEEE CJ, February 1998, pp. 26-43. \n[14] L. Y. Por et al., “StegCure: A Comprehensive \nSteganographic Tool Using Enhanced LSB Scheme,” \nWSEAS Transactions on Computers, vol. 7, no. 8, August \n2008, pp. 1309-1318. \n[15] N. Jain, S. Meshram and S. Dubey, \"Image \nSteganography Using LSB and Edge De tection \nTechnique,\" IJSCE, vol. 2, no. 3, July 2012, pp. 217-222. \n[16] F. Choudhury et al., \"Analysis of Various Steganography \nAlgorithms and Their Implementation,\" B.T thesis,North \nEastern Hill University, Meghalaya, India, 2011 -2012. \nAvailable: http://www.scr ibd.com/doc/61193138/17 \n[Accessed: 7 Nov. 2013]. \n[17] S. Singh and G. Agarwal, \"Use of Image to Secure Text \nMessage With The Help of LSB Replacement,\" EIJAER, \nvol. 1, no. 1, May 2013, pp. 200-205. \n[18] K. Hemachandran and S. Laskar, \"Steganography Based \non Random Pi xel Selection For Efficient Data Hiding,\" \nIJCSE, vol. 4, no. 2, March 2013, pp. 31-44. \n \n \n \nAuthor’ s profile \n \nSahar Abd El_Rahman was born Cairo, \nEgypt, B.Sc. Electronics & \ncommunication, Electrical Engineering \nDepartment. Benha University, Shoubra \nFaculty of Engineering, Cairo -Egypt. \nM.Sc. in an AI Technique Applied to \nMachine Aided Translation, Electronic \nEngineering, Electrical Engineering \nDepartment, Benha University, Shoubra Faculty of Engineering, \nCairo-Egypt, May2003. PHD. in Reconstruction of High -\nResolution Image from a Set of Low -Resolution Images, \nElectronic Engineering, Electrical Engineering Department, \nBenha University, Shoubra Faculty of Engineering, Cairo-Egypt \nin Jan2008. \n Error message #1. \n Error message #2. \n Error message #3 ",
  "topic": "Least significant bit",
  "concepts": [
    {
      "name": "Least significant bit",
      "score": 0.9568792581558228
    },
    {
      "name": "Steganography",
      "score": 0.8277240991592407
    },
    {
      "name": "Computer science",
      "score": 0.7970943450927734
    },
    {
      "name": "Steganography tools",
      "score": 0.5801664590835571
    },
    {
      "name": "The Internet",
      "score": 0.5619257688522339
    },
    {
      "name": "Information hiding",
      "score": 0.5309478640556335
    },
    {
      "name": "Image (mathematics)",
      "score": 0.44242122769355774
    },
    {
      "name": "Computer vision",
      "score": 0.39342325925827026
    },
    {
      "name": "Artificial intelligence",
      "score": 0.35502225160598755
    },
    {
      "name": "Theoretical computer science",
      "score": 0.3381023406982422
    },
    {
      "name": "Computer security",
      "score": 0.3212537169456482
    },
    {
      "name": "World Wide Web",
      "score": 0.18143975734710693
    },
    {
      "name": "Operating system",
      "score": 0.1356615424156189
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I207547235",
      "name": "Benha University",
      "country": "EG"
    }
  ],
  "cited_by": 12
}