{
  "title": "An Interleaved High Step-Up DC-DC Converter Based on Integration of Coupled Inductor and Built-in-Transformer With Switched-Capacitor Cells for Renewable Energy Applications",
  "url": "https://openalex.org/W4205656692",
  "year": 2021,
  "authors": [
    {
      "id": "https://openalex.org/A5026842181",
      "name": "Ramin Rahimi",
      "affiliations": [
        "Missouri University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5066442591",
      "name": "Saeed Habibi",
      "affiliations": [
        "Missouri University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5082594439",
      "name": "Mehdi Ferdowsi",
      "affiliations": [
        "Missouri University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5083592028",
      "name": "Pourya Shamsi",
      "affiliations": [
        "Missouri University of Science and Technology"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W3038492924",
    "https://openalex.org/W3156855852",
    "https://openalex.org/W3034030220",
    "https://openalex.org/W4206401556",
    "https://openalex.org/W3186546512",
    "https://openalex.org/W2096684630",
    "https://openalex.org/W2003268606",
    "https://openalex.org/W2770148090",
    "https://openalex.org/W1965215843",
    "https://openalex.org/W2165024739",
    "https://openalex.org/W2997307029",
    "https://openalex.org/W2999423079",
    "https://openalex.org/W2790063571",
    "https://openalex.org/W2751111878",
    "https://openalex.org/W2557996688",
    "https://openalex.org/W2102804329",
    "https://openalex.org/W2514607130",
    "https://openalex.org/W2514517314",
    "https://openalex.org/W2222937336",
    "https://openalex.org/W2117729580",
    "https://openalex.org/W2024655227",
    "https://openalex.org/W2124074251",
    "https://openalex.org/W2164889222",
    "https://openalex.org/W2965602701",
    "https://openalex.org/W2895729993",
    "https://openalex.org/W2056471381",
    "https://openalex.org/W2049323560",
    "https://openalex.org/W2180399084",
    "https://openalex.org/W2751507538",
    "https://openalex.org/W2106384788",
    "https://openalex.org/W2084614570",
    "https://openalex.org/W2344846164",
    "https://openalex.org/W2093056990",
    "https://openalex.org/W2153499767",
    "https://openalex.org/W2010518284",
    "https://openalex.org/W2800371789",
    "https://openalex.org/W2972200675"
  ],
  "abstract": "This paper proposes an interleaved high step-up DC-DC converter with the coupled inductor (CI) and built-in transformer (BIT) for renewable energy applications. Two double-winding (2W) CIs and one triple-winding (3W) BIT are integrated with the switched-capacitor (SC) voltage multiplier cells (VMCs) to achieve high-voltage gains without extreme duty cycles. The CIs and BIT turns-ratios provide two other degrees of freedom&#x2014;in addition to the duty cycle&#x2014;to adjust the voltage gain that leads to increased design flexibility. The diodes turn off naturally under the zero-current switching (ZCS) conditions because their current falling rates are controlled by the leakage inductances of the CIs and BIT; therefore, the diodes&#x2019; reverse-recovery problems are alleviated. Moreover, employing passive diode-capacitor clamp circuits, the voltage stresses of the switches are limited to a low value far less than the output voltage. Additionally, the leakage inductances energies are recycled and transferred to the output to further extend the voltage gain. Furthermore, due to the interleaved structure, the input current ripple and current stresses of the components are reduced. The proposed converter is analyzed in detail and then compared with similar converters that employed CIs and/or BIT along with passive/active clamp circuits for the MOSFETs. Finally, to verify the feasibility of the proposed converter, the experimental results of a 200 W prototype with output voltage of 400 V and voltage gain of 25 are presented.",
  "full_text": "Received December 9, 2021, accepted December 19, 2021, date of publication December 24, 2021,\ndate of current version January 4, 2022.\nDigital Object Identifier 10.1 109/ACCESS.2021.3138390\nAn Interleaved High Step-Up DC-DC Converter\nBased on Integration of Coupled Inductor and\nBuilt-in-Transformer With Switched-Capacitor\nCells for Renewable Energy Applications\nRAMIN RAHIMI\n, (Graduate Student Member, IEEE),\nSAEED HABIBI\n , (Graduate Student Member, IEEE), MEHDI FERDOWSI\n, (Member, IEEE),\nAND POURYA SHAMSI, (Senior Member, IEEE)\nDepartment of Electrical and Computer Engineering, Missouri University of Science and Technology, Rolla, MO 65409, USA\nCorresponding author: Ramin Rahimi (r.rahimi@mst.edu)\nABSTRACT This paper proposes an interleaved high step-up DC-DC converter with the coupled induc-\ntor (CI) and built-in transformer (BIT) for renewable energy applications. Two double-winding (2W) CIs\nand one triple-winding (3W) BIT are integrated with the switched-capacitor (SC) voltage multiplier cells\n(VMCs) to achieve high-voltage gains without extreme duty cycles. The CIs and BIT turns-ratios provide\ntwo other degrees of freedom—in addition to the duty cycle—to adjust the voltage gain that leads to increased\ndesign ﬂexibility. The diodes turn off naturally under the zero-current switching (ZCS) conditions because\ntheir current falling rates are controlled by the leakage inductances of the CIs and BIT; therefore, the diodes’\nreverse-recovery problems are alleviated. Moreover, employing passive diode-capacitor clamp circuits, the\nvoltage stresses of the switches are limited to a low value far less than the output voltage. Additionally, the\nleakage inductances energies are recycled and transferred to the output to further extend the voltage gain.\nFurthermore, due to the interleaved structure, the input current ripple and current stresses of the components\nare reduced. The proposed converter is analyzed in detail and then compared with similar converters that\nemployed CIs and/or BIT along with passive/active clamp circuits for the MOSFETs. Finally, to verify the\nfeasibility of the proposed converter, the experimental results of a 200 W prototype with output voltage of\n400 V and voltage gain of 25 are presented.\nINDEX TERMS DC-DC converter, high step-up, high-voltage gain, coupled inductor, built-in transformer,\nswitched-capacitor (SC), voltage multiplier cell (VMS), photovoltaic, fuel cell, renewable energy.\nI. INTRODUCTION\nRenewable energy sources, such as photovoltaic (PV) and\nfuel cells have received much attention in recent years [1], [2].\nA hybrid renewable energy-based system is shown in Fig. 1,\nwhere the PV and fuel cells are used as renewable energy\nsources; the voltage of these renewable energy sources is less\nthan 50 V , which is relatively low compared to that of the\nDC link’s voltage (e.g., 300-400 V) [3]. Thus, a high step-\nup DC-DC converter is required as an interface between the\nrenewable energy sources and DC link, as depicted in Fig. 1.\nThe associate editor coordinating the review of this manuscript and\napproving it for publication was Kan Liu\n.\nFIGURE 1. A hybrid renewable energy-based system with PV and fuel\ncells.\nThe traditional boost DC-DC converter can provide a\nhigh-voltage gain under extremely large duty cycles; how-\never, it suffers from high voltage and current stresses in\nthe semiconductor devices, reverse-recovery problem in the\n34\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License.\nFor more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/\nVOLUME 10, 2022\nR. Rahimiet al.: Interleaved High Step-Up DC-DC Converter Based on Integration of CI and BIT\noutput, diode, large ripple on the input current and the output\nvoltage and high power losses [4], [5]. To eliminate these\neffects, voltage-boosting (VB) techniques were presented to\nextend the voltage gain of the conventional boost converter\nwithout an extremely high duty cycle. The VB techniques\nare based on switch-capacitor (SC) voltage multiplier cells\n(VMCs) [6], switched-inductor (SL) VMCs [7], coupled-\ninductor (CI) [8], built-in transformer (BIT) [9], cascaded\nstructure [10], quadratic converter [11], and Z-source/quasi\nZ-source converters [12]. Any potential combination of the\nmentioned VB techniques were considered to achieve a high\nstep-up converter, such as those in [13]–[16]. Along with\nVB techniques, the interleaved structure is beneﬁcial because\na low input current ripple is obtained that reduces the size\nof the input ﬁlter, increases the lifetime of the renewable\nenergy sources, reduces the current stresses on the compo-\nnents, and improves the efﬁciency [17], [18]. In [19]–[21],\ninterleaved converters integrated with SC VMCs were intro-\nduced, and they suffered from high current transitions on\nthe capacitors and required a large number of diodes and\ncapacitors to achieve high-voltage gains. To eliminate the\nextreme instantaneous currents of the capacitors in the SC\nCMCs, the boost inductors can be replaced by CIs, or a\nBIT can be inserted into the converter topology—the energy\nstored in the leakage inductances of the CIs and BIT can be\nabsorbed and recycled by either passive or active clamped\ntechniques [22], [23]. In addition, the existence of the leak-\nage inductances meant the current falling rates of diodes\nwere controlled, and zero-current switching (ZCS) conditions\nare achieved in the turn-off instants of the diodes, thereby\nimproving the converter efﬁciency. In [24], an interleaved\nconverter was presented that integrated an asymmetric SC\nVMC with double-winding (2W) CIs and employed passive\nclamp circuits to recycle the energy of the leakage induc-\ntances and limit the voltage stresses on the main switches.\nAnother 2W CI-based interleaved converter was introduced\nin [25] in which, like the topology in [24], the secondary\nwindings of the CIs were integrated into SC VMCs to extend\nthe voltage gain. Other 2W CI-based interleaved convert-\ners were proposed in [26]–[29]. The interleaved converters\nin [30]–[33] used two triple-winding (3W) CIs to further\nextend the voltage gains. The interleaved converters in [34]\nand [35] utilized the 2W and 3W BIT, respectively. In inter-\nleaved converters without CI and BIT, the voltage gain is only\nadjusted with the duty cycle of the main switches. By con-\ntrast, for the converters with either CI or BIT, there were\ntwo degrees of freedom—duty cycle and turns-ratio—that\nmade the voltage gain adjustment ﬂexible. The interleaved\nconverters in [36], [37] took advantage of both the CI and BIT\nto further enhance the voltage gain; these converters utilized\ntwo 2W CIs and one 3W BIT, where the secondary windings\nof CIs, along with the secondary and tertiary windings of\nBIT, were combined with the SC VMCs to achieve a high\nvoltage gain. Having three degrees of freedom for converters\nwith both CI and BIT (duty cycle of the main switches, turns-\nratio of the CIs, and turns-ratio of the BIT) resulted in a\nﬂexible deign that was appropriate for the high-voltage gain\napplications. Therefore, the usage of the CI together with BIT\nintegrated with SC VMCs is the most effective technique used\nto further increase the voltage gain.\nConsidering the previously discussed information, in this\npaper, an interleaved high step-up DC-DC converter with two\n2W CIs and one 3W BIT is proposed to achieve high-voltage\ngains without extremely high cycle cycles. Passive clamped\ncircuits are used to absorb and recycle the leakage induc-\ntances energies and limit switches voltage stresses to a value\nfar less than the output voltage. The leakage inductances pro-\nvide the proposed converter with turn-off ZCS conditions for\nthe diodes that improve efﬁciency. Also, the reverse recovery\nproblem of the diodes is suppressed. The voltage gain and\nthe voltage stresses for the semiconductor devices can be\ncontrolled ﬂexibly by three parameters, including turns-ratio\nof the 2W CIs, turns-ratio of the 3W BIT, and duty cycle of\nthe switches. Furthermore, low-voltage-rated semiconductor\ndevices with low ON-state resistances are adopted for the\nproposed converter, thus leading to the reduction of the con-\nduction losses. Additionally, due to the interleaved structure\nof the proposed converter, the input current ripple and the\ncurrent stresses of the components decrease signiﬁcantly.\nThe rest of this paper is organized as follows: Section II\nintroduces the topology of the proposed converter and ana-\nlyzes its operation modes. Section III presents a steady-state\nanalysis of the proposed converter. The design considera-\ntions of the proposed converter are presented in Section IV.\nIn Section V, a comparison analysis in terms of voltage\ngain, normalized voltage stresses, and components count is\naccomplished, and that proves the superior performance of\nthe proposed converter compared to other similar existing\ncounterparts. Section VI presents experimental results to val-\nidate the study, and the overall conclusion is presented in\nSection VII.\nII. PROPOSED CONVERTER AND OPERATING MODES\nThe proposed converter is shown in Fig. 2; the power switches\nare denoted by Q1 and Q2, which are gated in interleaved\nmanner with a 180 ◦phase shift. There are two 2W CIs whose\ncoupling references are denoted by ‘‘\n’’ and‘‘\n ’’— each CI\nis modeled as the combination of a magnetizing inductance,\nan ideal 2W transformer, and the leakage inductance for each\nwinding; Lk1 and Lk2 are the leakage inductances of primary\nFIGURE 2. Proposed converter.\nVOLUME 10, 2022 35\nR. Rahimiet al.: Interleaved High Step-Up DC-DC Converter Based on Integration of CI and BIT\nwindings; Lm1 and L2 are the magnetizing inductances; Np1\nand Np2 are the number of the primary turns; the secondary\nturns are shown by Ns1 and Ns2. Also, there is a 3W BIT\nwhose reference points are represented by ‘‘\n ’’; the primary,\nsecondary, and tertiary windings’ turns of the BIT are denoted\nby np, ns, and nt , respectively; Lk3 is the leakage inductance of\nthe primary side for BIT. Each of secondary and tertiary wind-\nings of the BIT are connected in-series with the secondary\nwinding of CI for each phase, resulting in the total leakage\ninductances of Lk4 and Lk5. Dc1 and Dc2 are the clamp diodes;\nCc1 and Cc2 are the clamp capacitors. Diode-capacitors pairs\n(Dc1, Cc1) and (D c2, Cc2) make the clamp circuits, leading\nto limit the voltage stresses on switches Q1 and Q2, and\nthey recycle the energy stored in the leakage inductances;\nDr1 and Dr2 represent the regenerative diodes; Cm1 and Cm2\ndenote the intermediate energy storage capacitors; Do and\nCo represent the output diode and capacitor, respectively.\nThere is a total of ﬁve diodes and ﬁve capacitors. The input\nvoltage, output voltage, and load are represented by Vin, Vo,\nand R, respectively. The turns-ratios of the CIs represented by\nN1 =Ns1/Np1, N2 =Ns2/Np2; for the BIT, the turns-rations\nare denoted by nsp =ns/np and ntp =nt /np. The duty cycle\n(D) of the power switches is more than 0.5, and during a\nswitching period T , the proposed converter has 8 operation\nmodes. Fig. 3 illustrates the key current waveforms of the\nproposed converter; it should be noted that the scales of the\ncurves are not the same in Fig. 3. To analyze the proposed\nconverter, the following assumptions are made: the converter\noperates at steady-state condition and continuous conduc-\ntion mode (CCM); the capacitors are large enough such that\ntheir voltages are constant. The voltage drops on the diodes\nare neglected. The equivalent circuits for different operating\nmodes are depicted in Fig. 4 and explained as follows:\nMode 1 (Fig. 4a, t0 ≤t ≤t1): This operating mode is too\nshort and begins when switch Q1 starts to conduct at t =t0;\nswitch Q2 and output diode Do keep their ON states from\nthe previous operating mode (Mode 8). Leakage inductances\nLk3, Lk4, and Lk5 release their energies quickly to the output\nside through diode Do. In addition, these leakage induc-\ntances control the current falling rate of Do—accordingly, the\nreverse-recovery problem of Do is alleviated by the leakage\ninductances. The current through magnetizing inductances\nLm1 and Lm2 increase linearly. The relationships in this mode\nare as:\n\n\nVLm1 =Vin −VLk1 =Lm1\ndiLm1 (t)\ndt\nVLm2 =Vin −VLk2 =Lm2\ndiLm2 (t)\ndt\n(1)\n\n\n\n\n\niDo(t) =Io +iCo(t) =Io +Co\ndVo(t)\ndt\n=iLk4(t) =−i Lk5(t)\niLk1(t) =iLm1(t) +ip1(t) =iLm1(t) −N1iDo(t)\niLk2(t) =iLm2(t) +ip2(t) =iLm2(t) +N2iDo(t)\n(2)\n{\n(nsp +ntp)VLk3 =−V Lk4 +VLk5 −Vo −N1VLm1\n+N2VLm2 +VCm1 +VCm2\n(3)\nFIGURE 3. Key waveforms of the proposed converter.\n\n\n\n\n\n\n\n(nsp +ntp)Lk3\ndiLk3 (t)\ndt\n=−L k4\ndiLk4 (t)\ndt +Lk5\ndiLk5 (t)\ndt −Vo\n−N1VLm1 +N2VLm2 +VCm1 +VCm2\n(4)\nMode 2 (Fig. 4b, t1 ≤t ≤t2): This operation mode begins\nwhen Do turns off with ZCS condition at t =t1; both switches\nQ1 and Q2 remain in ON state. Inductances L m1, L m2, L k1,\nand L k2 are charged by the input voltage, and the load is\nsupplied solely by the output capacitor. The key relationships\nare as:\n\n\n\n\n\nVLm1 +VLk1 =VLm2 +VLk2 =Vin\niLm1 (t) =iLk1 (t) =iLm1 (t1) + Vin\nLm1 +Lk1\n(t −t1)\niLm2 (t) =iLk2 (t) =iLm2 (t1) + Vin\nLm2 +Lk2\n(t −t1)\n(5)\nMode 3 (Fig. 4c, t2 ≤t ≤t3): At t =t2, the gate signal\nbecomes zero for Q2, and clamp diode Dc2 turns on to clamp\nthe voltage across Q2 to VCc2; simultaneously, regenerative\ndiodes Dr1 and Dr2 start to conduct because the reverse\nvoltages across them becomes zero. As the currents through\ndiodes Dr1 and Dr2 increase, the current through diode Dc2\ndecreases. By means of the conducting current through the\n36 VOLUME 10, 2022\nR. Rahimiet al.: Interleaved High Step-Up DC-DC Converter Based on Integration of CI and BIT\nFIGURE 4. Operation modes in one switching period: (a) Mode 1 [t0-t1], (b) Mode 2 [t1-t2], (c) Mode 3 [t2-t3], (d) Mode 4 [t3-t4], (e) Mode 5 [t4-t5],\n(f) Mode 6 [t5-t6], (g) Mode 7 [t6-t7], (h) Mode 8 [t7-t8].\nsecondary windings of the CIs and secondary and tertiary\nwindings of the BIT, clamp capacitor Cc1 is discharged and\nintermediate capacitors Cm1 and Cm2 are charged. The mag-\nnetizing inductance Lm1 is charged, while Lm2 transfers the\nenergy to the secondary side. When the energy of leakage\ninductance Lk2 is completely absorbed by Cc2, diode Dc2 is\nreverse-biased and turns off with ZCS condition at the end of\nthis mode. The relationships for this mode are as (6)-(8).\n\n\n\n\nVLm1 +VLk1 =Vin\nVLm2 +VLk2 =Vin −VCc2\nVpBIT +VLk3 =−V Cc2\n(6)\n\n\n\nN1VLm1 +VLk4 +nspVLk3\n=VCm1 −VCc1 −(nsp +1)VCc2\nN2VLm2 +VLk5 −ntpVLk3 =(ntp +1)VCc2 −VCm2\n(7)\n\n\n\n\n\n\n\n\n\n\n\n\niLk1 (t) =iLm1 (t) +ip1(t) =iLm1 (t) +N1iDr1 (t)\niLk2 (t) =iLm2 (t) +ip2(t) =iLm2 (t) +N2iDr2 (t)\niLk3 (t) =−n spiDr1 (t) −ntpiDr2 (t)\niLk4 (t) =−i Dr1 (t)\niLk5 (t) =iDr2 (t)\n(8)\nMode 4 (Fig. 4d, t3 ≤t ≤t4): At t =t3, clamp diode Dc2\nturns off with ZCS condition because its current decreases\nto zero after the leakage energy of Lk2 is fully transferred.\nThe diode current rate is controlled by the leakage induc-\ntance, thus there is no turn-off reverse-recovery problem.\nThe currents of both diodes D r1 and D r2 start to decrease.\nThe mechanism of the energy transferring is the same as the\nprevious operation mode. In this mode, the relationships are\nVOLUME 10, 2022 37\nR. Rahimiet al.: Interleaved High Step-Up DC-DC Converter Based on Integration of CI and BIT\nFIGURE 5. Voltage gain versus duty cycle for different values ofN and n.\nobtained as (9)-(12).\n\n\n\nVLm1 +VLk1 =Vin\nVLm2 +VLk2 −VpBIT −VLk3 =Vin\nVpBIT +VLk3 =VLm2 +VLm1 +VLk2 −VLk1\n(9)\n{\n(N1 +nsp +1)VLm1 −(nsp +1)(VLm2 +VLk2 −VLk1 )\n+VLk4 +nspVLk3 =VCm1 −VCc1\n(10)\n{\nntp(VLm1 +VLk1 +VLk3 −VLk2 )\n−(N2 +ntp)VLm2 −VLk5 =VCm2 −VCc2\n(11)\n\n\n\n\n\n\n\n\n\niLk1 (t) =iLm1 (t) +ip1(t) =iLm1 (t) +N1iDr1 (t)\niLk2 (t) =iLm2 (t) +ip2(t) =iLm2 (t) +N2iDr2 (t)\niLk3 (t) =−n spiDr1 (t) −ntpiDr2 (t)\niLk4 (t) =−i Dr1 (t)\niLk5 (t) =iDr2 (t)\n(12)\nMode 5 (Fig. 5e, t4 ≤t ≤t5): At t =t4, this mode begins\nwhen switch Q2 turns on. This operation mode ends when the\ncurrents through regenerative diodes Dr1 and Dr2 decrease\nto zero, and accordingly, the energy at the secondary/tertiary\nwindings of the CIs and BIT reaches zero. Dr1 and Dr2 turn\noff with ZCS condition at t =t5. The circuit relationships of\nthis mode are as:\n\n\n\nVLm1 +VLk1 =Vin\nVLm2 +VLk2 =Vin\nVpBIT =−V Lk3\n(13)\n{\nN1VLm1 +VLk4 +nspVLk3 =VCm1 −VCc1\n−N2VLm2 −VLk5 +ntpVLk3 =VCm2 −VCc2\n(14)\n\n\n\n\n\n\n\n\n\niLk1 (t) =iLm1 (t) +ip1(t) =iLm1 (t) +N1iDr1 (t)\niLk2 (t) =iLm2 (t) +ip2(t) =iLm2 (t) +N2iDr2 (t)\niLk3 (t) =−n spiDr1 (t) −ntpiDr2 (t)\niLk4 (t) =−i Dr1 (t)\niLk5 (t) =iDr2 (t)\n(15)\nMode 6 (Fig. 4f, t 5 ≤t ≤t6): Diodes Dr1 and Dr2 turn\noff at t =t5, while switches Q1 and Q2 remain in ON state.\nMagnetizing inductances Lm1 and Lm2 are charged by the\ninput voltage, which is the same as Mode 2. The relationships\nare as:\n{\nVLm1 +VLk1 =VLm2 +VLk2 =Vin\nVpBIT =0 (16)\n\n\n\n\n\n\n\niLm1 (t) =iLk1 (t) =iLm1 (t6) + Vin\nLm1 +Lk1\n(t −t6)\niLm2 (t) =iLk2 (t) =iLm2 (t6) + Vin\nLm2 +Lk2\n(t −t6)\nip1(t) =ip2(t) =iLk3 (t) =iLk4 (t) =iLk5 (t) =0\n(17)\nMode 7 (Fig. 4g, t6 ≤t ≤t7): This mode is similar to\nMode 3. At t =t6, clamp diode Dc1 is forward-biased, then\nthe voltage across Q1 is clamped to VCc1; the voltage across\noutput diode Do reaches zero, and it is forward-biased. The\nstored energy in magnetizing inductance Lm1 is transferred to\nthe secondary side. As the current through Do increases, the\ncurrent through Dc1 decreases. Intermediate capacitors Cm1\nand Cm2 are discharged. The relationships for this mode aren\nas (18)-(20).\n\n\n\nVLm1 +VLk1 =Vin −VCc1\nVLm2 +VLk2 =Vin\nVpBIT +VLk3 =VCc1\n(18)\n\n\n\nN2VLm2 −N1VLm1 −VLk4 +VLk5\n−(nsp +ntp)VLk3\n=Vo −(nsp +ntp +1)VCc1 −VCm1 −VCm2\n(19)\n\n\n\n\n\n\n\n\n\niLk1 (t) =iLm1 (t) +ip1(t) =iLm1 (t) −N1iDo (t)\niLk2 (t) =iLm2 (t) +ip2(t) =iLm2 (t) +N2iDo (t)\niLk3 (t) =(nsp +ntp)iDo (t)\niLk4 (t) =iDo (t)\niLk5 (t) =−i Do (t)\n(20)\nMode 8 (Fig. 4h, t7 ≤ t ≤ t8): At t =t7, the current\nthrough clamp diode Dc1 decreases to zero, and it turns\noff with ZCS condition due to leakage inductance Lk1. The\ncurrent of Do starts to decrease, and its decreasing rate is\ncontrolled by the leakage inductances. The energy stored in\nthe magnetizing inductor Lm1 is continuously transferred to\noutput. The relationships for this mode are as:\n\n\n\nVLm1 +VLk1 +VpBIT +VLk3 =Vin\nVLm2 +VLk2 =Vin\nVpBIT +VLk3 =VLm2 −VLm1 +VLk2 −VLk1\n(21)\n\n\n\n\n−(N1 +nsp +ntp +1)VLm1\n+(N2 +nsp +ntp +1)VLm2\n−(nsp +ntp)VLk3 +(nsp +ntp +1)(VLk2 −VLk1 )\n−VLk4 +VLk5 =Vo −VCm1 −VCm2\n(22)\n\n\n\n\n\n\n\n\n\niLk1 (t) =iLm1 (t) +ip1(t) =iLm1 (t) −N1iDo (t)\niLk2 (t) =iLm2 (t) +ip2(t) =iLm2 (t) +N2iDo (t)\niLk3 (t) =(nsp +ntp)iDo (t)\niLk4 (t) =iDo (t)\niLk5 (t) =−i Do (t)\n(23)\n38 VOLUME 10, 2022\nR. Rahimiet al.: Interleaved High Step-Up DC-DC Converter Based on Integration of CI and BIT\nIII. STEADY-STATE ANALYSIS OF THE PROPOSED\nCONVERTER\nTo simplify the steady-state analysis of the proposed con-\nverter, Modes 1 and 5 with the short durations were ignored.\nA. VOLTAGE GAIN\nIgnoring the leakage inductances, Modes 3 and 4 are the\nsame; similarly, Modes 7 and 8 are assumed to be the same.\nThe, by applying the voltage–second balance law to magne-\ntizing inductances Lm1 and Lm2, the following equations are\nwritten:\n2(D −1\n2)Vin +2(1 −D)Vin +(1 −D)VCc1 =0 (24)\n2(D −1\n2)Vin +2(1 −D)Vin +(1 −D)VCc2 =0 (25)\nFrom (24) and (25), the voltages on capacitors Cc1 and Cc2\nare obtained as:\nVCc1 =VCc2 = 1\n1 −DVin (26)\nConsidering Mode 3, the following relationship is written:\n{\nVCm1 =VCc1 +(nsp +1)VCc2 +N1Vin\nVCm2 =(ntp +1)VCc2 −N2(Vin −VCc2 ) (27)\nSubstituting (26) in (27), the voltages across capacitors\nCm1 and Cm2 are obtained as:\n\n\n\nVCm1 =2 +nsp +(1 −D)N1\n1 −D Vin\nVCm2 =1 +ntp +DN2\n1 −D Vin\n(28)\nConsidering Mode 7, the following equation is obtained:\nVo =(nsp +ntp +1)VCc1 +VCm1 +VCm2 (29)\nSubstituting (26) and (28) in (29), the voltage of the output\ncapacitor is extracted as:\nVCo =Vo =4 +2(nsp +ntp) +N1 +N2\n1 −D Vin (30)\nAccordingly, the ideal voltage gain is obtained as:\nM =Vo\nVin\n=4 +2(nsp +ntp) +N1 +N2\n1 −D (31)\nIf the turns-ratios of the CIs are equal to N (i.e.,\nN1 =N2 =N) and the turns-ratios of the BIT are equal\nto n (i.e., nsp =ntp =n), the capacitors’ voltages and voltage\ngain are simpliﬁed as:\nVCc1 =VCc2 = 1\n1 −DVin\nVCm1 =2 +n +(1 −D)N\n1 −D Vin\nVCm2 =1 +n +DN\n1 −D Vin\nVCo =Vo =4 +4n +2N\n1 −D Vin (32)\nM = Vo\nVin\n=4 +4n +2N\n1 −D =4(1 +n +N\n2 )\n1 −D (33)\nAs explored in the above analysis, the voltage gain of\nthe proposed converter is controlled by three parameters: the\nturns-ratio of the CIs (N ), the turns-ratio of the BIT ( n),\nand the duty cycle of the switches (D); thus, there are three\ndegrees of freedom to extend the voltage gain without an\nextreme duty cycle at high voltage gains. The plot of the\nvoltage gain is sketched in Fig. 5 for different values of N, n,\nand D. As observed, the voltage gain increases signiﬁcantly\nas the duty cycle and the turns-ratios increase, which makes\nthe proposed converter reach high voltage gains without\nextreme duty cycles in high step-up applications.\nB. EFFECT OF LEAKAGE INDUCTANCES ON VOLTAGE GAIN\nIn fact, the leakage inductances of the CIs and BIT are not\nzero. By analyzing the current of the output diode, the effect\nof leakage inductances on the voltage gain is clariﬁed. The\ncurrent of Do ﬂows through the circuits during Modes 7 and 8;\nthe duration of the Mode 7 (1t 7 = t7-t6) is supposed to\nbe 0.6 ×(1 −D)T for the designed converter in this paper.\nAdditionally, the current-falling rate of diode Do (diDo/dt) is\nnearly zero during Mode 8. Additionally, the average current\nof Do is equal to the output current (I o). Thus, the peak current\nof the output diode can be obtained as:\n\n\n\n\n\n\n\n\n\n1\nT\n∫ T\n0\niDo(t) =Io\n→1\nT\n(\n1\n2 ×0.6 ×(1 −D)T ×IDo,peak\n+0.4 ×(1 −D)T ×IDo,peak\n)\n=Io\n→IDo,peak = 10Io\n7(1 −D)\n(34)\nKnowing the peak current of Do, the voltage gain is\nobtained in (35), as shown at the bottom of the next page.\nAs obvious, the voltage gain reduces slightly as the leakage\ninductances increase.\nC. SEMICONDUCTOR DEVICES VOLTAGE STRESSES\nThe voltage stresses of the semiconductor devices are given\nby (36)-(41).\nVQ1 =VQ2 = 1\n1 −DVin = 1\n4(1 +n +N\n2 )\nVo (36)\nVDc1 = 2\n1 −DVin = 1\n2(1 +n +N\n2 )\nVo (37)\nVDc2 = 1\n1 −DVin = 1\n4(1 +n +N\n2 )\nVo (38)\nVDr1 =2(1 +n +N\n2 )\n1 −D Vin =1\n2Vo (39)\nVDr2 =2n +N\n1 −D Vin = n +N\n2\n2(1 +n +N\n2 )\nVo (40)\nVDo =2(1 +2n +N)\n1 −D Vin = 1 +2n +N\n2(1 +n +N\n2 )\nVo (41)\nVOLUME 10, 2022 39\nR. Rahimiet al.: Interleaved High Step-Up DC-DC Converter Based on Integration of CI and BIT\nAs the turns-ratio of either CIs or BIT increases, the voltage\nstresses of semiconductors Dc1, Dc2, Q1, and Q2 decrease\nsigniﬁcantly when compared to the output voltage; thus,\nlow-voltage-rated switches with a low RDS(on) are employed,\nwhich reduces the conduction losses. Also, the voltage stress\nof the regenerative diode Dr1 is equal to half the output\nvoltage, and VDr2 is less than the output voltage.\nD. COMPONENTS AVERAGE CURRENT\nThe average currents of the leakage and magnetizing induc-\ntances are calculated as:\n\n\n\n\n\nILm1 =ILm2 =ILm =2 +2n +N\n1 −D Io\nILk1 =ILk2 =ILm\nILk3 =ILk4 =ILk5 =0\n(42)\nThe average root mean square (rms) currents of the semi-\nconductor devices are as:\n\n\n\nIDc1avg =IDc2avg =IDr1avg =IDr2avg =IDoavg =Io\nIQ1avg =IQ2avg =2 +2n +N\n1 −D Io\n\n\n\n\n\n\n\n\n\n\n\nIDc1rms =IDc2rms = 10\n3√2(1 −D)Io\nIDr1rms =IDr2rms =IDorms\n= 2 +2n +N\n(1 +2n +N)\n√\n1 −D\nIo\nIQ1rms =IQ2rms =(4 +4n +2N)\n√\nD\n1 −D Io\n(43)\nIV. DESIGN CONSIDERATIONS\nA. COUPLED INDUCTORS AND BUILT-IN TRANSFORMER\nDESIGN\n1) LIMITATION OF TURNS-RATIOS\nGiven that the duty cycle of the switches is higher than 0.5,\nit can be written as:\nD =1 −4(1 +n +N\n2 )\nM ≥0.5 →n +N\n2 ≤M −8\n8 (44)\n2) MAGNETIZING INDUCTANCES OF CIS\nFor any arbitrary ripple current, Lm1 =Lm2 =Lm is obtained\nfrom:\nLm = VinD\nfsw1iL\n(45)\nTo operate in CCM, the magnetizing inductance of\nCIs must be higher than the critical inductance that is\nobtained from (46).\n\n\n\n\n\n\n\n1iLm = VinD\nfswLm\n= VoD\nfswLmM\nILm =ILm1 =ILm2 =2 +2n +N\n1 −D Io =M\n2 Io\nR =Vo\nIo\n1iLm =2ILm →Lm =Lcrit →Lcrit = DR\nM2fsw\n(46)\n3) NUMBER OF TURNS OF CIS’ WINDINGS\nHaving the ﬂux density variation (1B CI) and the cross-\nsectional area of the core (A c,CI) for the CIs, the number of\nturns for the primary winding (N p) is determined from (47);\nthen, the number of the secondary winding’ turns (N s) is\nobtained by having the CIs turns-ratio (N ).\nNp = VinD\n1BCI Ac,CI fsw\n(47)\n4) NUMBER OF TURNS OF BIT’S WINDINGS\nUsing 1BBIT and Ac,BIT for the BIT mean the number of\nturns for the primary winding (n p) is calculated from (48), and\nthe numbers of turns for the secondary and tertiary windings\n(ns, nt ) are obtained from the obtained BIT turns-ratio (n).\nnp = VCc1 D\n1BBIT Ac,BIT fsw\n= VinD\n(1 −D)1BBIT Ac,BIT fsw\n(48)\nB. CAPACITORS DESIGN\nThe voltages of the capacitors are determined from (32).\nBy knowing the maximum ripple voltages (1V Cmax) of the\ncapacitors, the capacitances can be determined as:\n\n\n\nCc1, Cc1, Cm1, Cm2 ≥ 4 +4n +2N\n5fsw(1 +2n +N)1VC max\nIo\nCo ≥ DIo\nfsw1VC max\n(49)\nV. CIRCUIT PERFORMANCE COMPARISON\nIn this section, comparisons are made between the proposed\nconverter and other interleaved high step-up converters in\nterms of the component’s numbers, voltage gains, normal-\nized voltage stress on power switches, and normalized total\nvoltage stress on all diodes, as listed in Table 1; the volt-\nages are normalized to the input voltage. The high step-up\nconverters in [16], [34], [35] are based on the integration\nthe normal inductor and BIT with the SC VMCs, and the\nconverters in [27], [30], [32], [33] extend the voltage gain\nthrough integration the CIs with the SC VMCs. To adjust the\nvoltage gain, there are two degrees of freedom for the con-\nverters in [16], [27], [30], [32]–[35], one of which is the duty\ncycle of the switches and the other is the turns-ratio of the\nM = 4(1 +n +N\n2 )\n1 −D + 50fsw\n21(1−D)R\n(\nN2(Lk1 +Lk2) +4n2Lk3 +Lk4 +Lk5\n) (35)\n40 VOLUME 10, 2022\nR. Rahimiet al.: Interleaved High Step-Up DC-DC Converter Based on Integration of CI and BIT\nTABLE 1. Comparison of proposed converter with other interleaved high step-up converters.\nFIGURE 6. The voltage gain comparison forN = n = 1.\nCIs or BIT. However, the proposed converter and converters\nin [36], [37] offer three degrees of freedom (i.e., D, n, N) for\nadjusting the voltage gain because they are developed based\non the combination of BIT and CIs into the SC VMCs, which\nresults in a ﬂexible deign that is appropriate for high-voltage\ngain applications. The converters in [16], [34], [35] have\nthree magnetic cores, while other converters and proposed\nconverter have two magnetic cores.\nIn the comparison of the voltage gain, as seen from Fig. 6,\nthe proposed converter has the highest voltage gain for the\nwhole duty cycle range. According to Fig. 7, illustrating the\nnormalized voltage stress on the switches, the proposed con-\nverter offers the lowest voltage stress on the switches under\nthe same turns-ratios and voltage gain. As for the voltage\nFIGURE 7. The comparison of the normalized voltage stress on switches\nfor N = n = 1.\nstresses on the diodes, it is fair to compare the total voltage\nstress on all the diodes, which is performed in the last cilium\nof Table 1 and depicted in Fig. 8. As obvious, under the\nvoltage gain and input voltage, the proposed converter pro-\nvides the lowest total voltage stress on the diodes compared\nto other converters. Thus, semiconductor devices with low\nON-state resistances and low-forward-voltage drops could be\nemployed, which reduces the conduction losses and converter\ncost.\nAmong all the converters, the two converters in [36], [37]\nare the most similar ones to the proposed converter. Like the\nproposed converter, the converters in [36], [37] took advan-\ntage of an interleaved structure with two 2W CIs and one 3W\nBIT to achieve high voltage gains. Also, all three converters\nVOLUME 10, 2022 41\nR. Rahimiet al.: Interleaved High Step-Up DC-DC Converter Based on Integration of CI and BIT\nFIGURE 8. The comparison of the normalized total voltage stress on\ndiodes forN = n = 1.\nFIGURE 9. The experimental prototype.\nemploy passive diode-capacitor clamp circuits to absorb the\nleakage energy of the circuit and pass it to the output to\nfurther extend the voltage gain. However, the proposed con-\nverter approximately doubles the voltage gain under the same\nturns- ratios and duty cycle conditions and with lower number\nof components compared with the converters in [36], [37].\nFurthermore, for a given voltage gain with the same turns-\nratios for the magnetically coupled devices, the proposed\nconverter has a smaller duty cycle compared to the converters\nin [16], [27], [30], [32]–[37]; thus, according to (49), the\nproposed converter has the smallest output voltage ripple.\nVI. EXPERIMENTAL RESULTS\nTo verify the feasibility of the proposed converter, an exper-\nimental setup was developed, as shown in Fig. 9, with the\nspeciﬁcations listed in Table 2. Ferrite cores ETD59/31/\n22-3C97 and ETD54/28/19-3C90 were used to implement the\n2W CIs and 3W BIT, respectively. The DC resistances of the\nwindings for 2W CIs are as Rp1 =Rs1 =Rp2 =Rs2 =\n0.01 , and for the 3W BIT, the windings’ DC resistances\nare as Rp = Rs = Rt = 0.06 , where Rp, Rs, and Rt\nrepresent the DC resistances of the primary, secondary, and\ntertiary windings, respectively.\nFigs. 10(a)-(h) show the experimental current and voltage\nwaveforms for in the input voltage of 16 V and duty cycle of\n0.6. According to Fig. 10(a), the measured output voltage and\ncurrent are 391 V and 0.5 A, respectively. As exempliﬁed, the\nproposed converter achieves a high voltage of 391 V from\nTABLE 2. Specifications of experimental setup.\na low input voltage of 16 V with the duty cycle of 0.6 that\nis not an extreme duty cycle. There is a deviation of 9 V\nfrom the ideally calculated 400 V in (32), which is due to\nthe parasitic elements of the circuit. Fig. 10(b) illustrates the\nvoltages across capacitors Cc1, Cc2, Cm1, and Cm2, which are\nrelatively in agreement with the values calculated from (32),\nnamely are VCc1 =VCc2 =40 V ,VCm1 =136 V , andVCm2 =\n104 V . The semiconductors’ voltages and currents are shown\nin Figs. 10(c)-(f). As presented, the measured voltage stresses\nmatch theoretically calculated values from (36) and (39)-(41)\nas VQ1 = VQ2 = 40 V , VDr1 = 200 V , VDr2 = 120 V ,\nand VDo = 320 V . As seen, the voltage stresses across\nthe switches are far less than the high output voltage, thus\nleading to adopting low-voltage-rated MOSFETs with low\nON-state resistances. In addition, there is no reverse-recovery\nproblem for the diodes because they turn off naturally with\nZCS conditions. Fig. 10(g) shows the input current and cur-\nrents of leakage inductances Lk1 and Lk2. The input current\nripple is small, and that is beneﬁcial for the input renewable\nenergy source. The average currents of Lk1 and Lk2 are about\n6.25 A, showing a proper current sharing between CIs in\nthe interleaved structures, thereby resulting in the reduction\nof the components’ current stresses. The currents of leakage\ninductances Lk3, Lk4, and Lk5 are shown in Fig. 10(h), and\nthey agree with Fig. 3.\nIn addition, the dynamic response of the output voltage for\na 40% step change in the output load is depicted in Fig. 10(i).\nThe output power is changed from 200 W to 120 W and vice\nversa. This dynamic response illustrates the inherent stability\nof the proposed converter; there is a little voltage change\nthat can be eliminated if a closed-loop control with a proper\nbandwidth is employed to manipulate the duty cycle of the\nswitches for compensating the voltage change.\nFig. 11 shows the measured efﬁciency curve of the pro-\nposed converter for the various load powers—with the input\n42 VOLUME 10, 2022\nR. Rahimiet al.: Interleaved High Step-Up DC-DC Converter Based on Integration of CI and BIT\nFIGURE 10. The experimental results under full load forVin = 16 V: (a)-(h) current and voltage waveforms; (i) dynamic response of the output voltage\nfor the 40 % step change in the load.\nFIGURE 11. The measured efficiency versus the output power for the\nproposed converter.\nvoltage of 16 V and duty cycle of 0.6. The maximum efﬁ-\nciency is 96.97 % at the load of 100 W, and the full-load\nefﬁciency is 95.53 %. As seem from Fig. 11, the efﬁciency\nof the proposed converter rises ﬁrst and then reduces as the\noutput power increase. The reason is that for the output power\nless than 100 W, the converter operates in discontinuous\nconduction mode (DCM); however, for output power higher\nthan 100 W, the converter operates in CCM. In the DCM,\nthe components’ ripple currents are higher compared to the\nCCM, which leads to lower efﬁciency in comparison with\nCCM.\nTo evaluate analytical loss distribution in the components\nof the proposed converters, the parasitic elements of the\ncomponents are considered to calculate the losses of the\ncomponents, which are described below.\nThe losses of the switches consist of the conduction loss\nand switching loss, which are expressed as (50).\n\n\n\n\n\n\n\n\n\nPQ1 =PQ1, cond +PQ1, sw\n=RDS (on)I2\nQ1rms\n+V 2\nQ1 Cossfsw\nPQ2 =PQ2, cond +PQ2, sw\n=RDS (on)I2\nQ2rms\n+V 2\nQ2 Cossfsw\nPQ =PQ1 +PQ2\n(50)\nDue to the turn-off ZCS conditions, the revere-recovery\nlosses of the diodes are ignored in the loss and only their\nconduction losses are considered; thus, the diodes losses are\nexpressed as (51).\n\n\n\n\n\n\n\n\n\n\n\n\n\nPDc1 =RDc1 I2\nDc1rms\n+VFDc1\nIDc1avg\nPDc2 =RDc2 I2\nDc2rms\n+VFDc2\nIDc2avg\nPDr1 =RDr1 I2\nDr1rms\n+VFDr1\nIDr1avg\nPDr2 =RDr2 I2\nDr2rms\n+VFDr2\nIDr2avg\nPDo =RDo I2\nDorms +VFDo IDoavg\nPD =PDc1 +PDc2 +PDr1 +PDr2 +PDo\n(51)\nVOLUME 10, 2022 43\nR. Rahimiet al.: Interleaved High Step-Up DC-DC Converter Based on Integration of CI and BIT\nFIGURE 12. The analytical loss distribution of the proposed converter at\nfull load.\nThe losses of the capacitors are given by (52).\n\n\n\n\n\n\n\n\n\n\n\nPCc1 =RCc1 I2\nCc1rms\nPCc2 =RCc2 I2\nCc2rms\nPCm1 =RCm1 I2\nCm1rms\nPCm2 =RCm2 I2\nCm1rms\nPCo =RCo I2\nCorms\nPC =PCc1 +PCc2 +PCm1 +PCm2 +PCo\n(52)\nThe losses of the 2W CIs and 3W BIT are extracted by (53),\nwhere Pcore,CI1, Pcore,CI2, Pcore,BIT are the core losses of the\n2W CIs and 3W BIT, which are extracted from the datasheets\nof the selected magnetic cores.\n\n\n\n\n\n\n\n\n\nPCI1 =Rp1 I2\nLk1, rms +Rs1 I2\nLk4, rms +Pcore,CI1\nPCI2 =Rp2 I2\nLk2, rms +Rs2 I2\nLk5, rms +Pcore,CI2\nPBIT =RpI2\nLk3, rms +RsI2\nLk4, rms\n+Rt I2\nLk5, rms +Pcore,BIT\nPCIs+BIT =PCI1 +PCI2 +PBIT\n(53)\nThe total loss of the proposed converter is given by (54).\nPLoss =PQ +PD +PC +PCIs+BIT (54)\nConsidering (50)-(54), the analytical loss distribution in\nthe components at full load is obtained, which shown in\nFig. 12; as observed, the largest losses occur in the power\nswitches.\nVII. CONCLUSION\nIn this paper, an interleaved high step-up DC-DC converter\nwas introduced for renewable energy applications, including\nthe PV and fuel cells. Double 2W CIs and one 3W BIT\nare combined with the SC VMCs to offer increased design\nﬂexibility to adjust the voltage gain. Compared to competitors\npresented in literature, the proposed converter yields the high-\nest voltage gain and lowest voltage stresses on the switches\nwith a low number of magnetic cores. Due to the low voltage\nstresses on the switches, which are provided by the passive\ndiode-capacitor clamps, low-voltage-rated MOSFETs with\nlow ON-state resistances are selected, which contributes to\nthe reduction in conduction losses. Due to the interleaved\nstructure, the input current ripple and current stresses for\nthe components are reduced. The diodes’ reverse-recovery\nproblem is suppressed because leakage inductances of the CIs\nand BIT provide the diodes with turn-off ZCS conditions.\nThe feasibility and performance of the proposed converter\nwere validated through a 200 W experimental setup with a\nvoltage gain of 25 and full-load efﬁciency of 95.53 %. The\nproposed converter could be utilized for the integration of PV\nand fuel cells onto a 400 V DC bus in the renewable energy\napplications.\nREFERENCES\n[1] M. L. Alghaythi, R. M. O’Connell, N. E. Islam, M. M. S. Khan, and\nJ. M. Guerrero, ‘‘A high step-up interleaved DC-DC converter with voltage\nmultiplier and coupled inductors for renewable energy systems,’’ IEEE\nAccess, vol. 8, pp. 123165–123174, 2020.\n[2] J. Ai, M. Lin, H. Liu, and P. Wheeler, ‘‘A family of high step–up DC–DC\nconverters with Nc step-up cells and M–source clamped circuits,’’ IEEE\nAccess, vol. 9, pp. 65947–65966, 2021.\n[3] S. Hasanpour, Y . P. Siwakoti, A. Mostaan, and F. Blaabjerg, ‘‘New semi-\nquadratic high step-up DC/DC converter for renewable energy appli-\ncations,’’ IEEE Trans. Power Electron., vol. 36, no. 1, pp. 433–446,\nJan. 2021.\n[4] R. Rahimi, S. Habibi, M. Ferdowsi, and P. Shamsi, ‘‘Z-source-based\nhigh step-up DC-DC converters for photovoltaic applications,’’ IEEE\nJ. Emerg. Sel. Topics Power Electron., early access, Dec. 1, 2021, doi:\n10.1109/JESTPE.2021.3131996.\n[5] R. Rahimi, S. Habibi, M. Ferdowsi, and P. Shamsi, ‘‘A three-winding\ncoupled inductor-based interleaved high-voltage gain DC–DC converter\nfor photovoltaic systems,’’ IEEE Trans. Power Electron., vol. 37, no. 1,\npp. 990–1002, Jan. 2022.\n[6] D. Cao and F. Zheng Peng, ‘‘Zero-current-switching multilevel modular\nswitched-capacitor DC-DC converter,’’ in Proc. IEEE Energy Convers.\nCongr. Expo., Sep. 2009, pp. 3516–3522.\n[7] Y . Jiao, F. L. Luo, and M. Zhu, ‘‘V oltage-lift-type switched-inductor cells\nfor enhancing DC–DC boost ability: Principles and integrations in Luo\nconverter,’’IET Power Electron., vol. 4, no. 1, pp. 131–142, 2011.\n[8] B. Prashant Reddy Baddipadiga, V . Anand Kishore Prabhala, and\nM. Ferdowsi, ‘‘A family of high-voltage-gain DC–DC converters based\non a generalized structure,’’ IEEE Trans. Power Electron., vol. 33, no. 10,\npp. 8399–8411, Oct. 2018.\n[9] W. Li and X. He, ‘‘High step-up soft switching interleaved boost converters\nwith cross-winding-coupled inductors and reduced auxiliary switch num-\nber,’’IET Power Electron., vol. 2, no. 2, pp. 125–133, Mar. 2009.\n[10] S. Chen, T. Liang, L. Yang, and J. Chen, ‘‘A cascaded high step-up DC–DC\nconverter with single switch for microsource applications,’’ IEEE Trans.\nPower Electron., vol. 26, no. 4, pp. 1146–1153, Apr. 2011.\n[11] G. Guru Kumar, K. Sundaramoorthy, V . Karthikeyan, and E. Babaei,\n‘‘Switched capacitor–inductor network based ultra-gain DC–DC con-\nverter using single switch,’’ IEEE Trans. Ind. Electron., vol. 67, no. 12,\npp. 10274–10283, Dec. 2020.\n[12] P. Kumar and M. Veerachary, ‘‘Z-network plus switched-capacitor boost\nDC–DC converter,’’ IEEE J. Emerg. Sel. Topics Power Electron., vol. 9,\nno. 1, pp. 791–803, Feb. 2021.\n[13] D. Yu, J. Yang, R. Xu, Z. Xia, H.-H. C. Iu, and T. Fernando, ‘‘A family of\nmodule-integrated high step-up converters with dual coupled inductors,’’\nIEEE Access, vol. 6, pp. 16256–16266, 2018.\n[14] A. M. S. S. Andrade, E. Mattos, L. Schuch, H. L. Hey, and\nM. L. D. S. Martins, ‘‘Synthesis and comparative analysis of very high\nstep-up DC–DC converters adopting coupled-inductor and voltage multi-\nplier cells,’’ IEEE Trans. Power Electron., vol. 33, no. 7, pp. 5880–5897,\nJul. 2018.\n[15] Y . Ye, K. W. E. Cheng, and S. Chen, ‘‘A high step-up PWM DC-DC\nconverter with coupled-inductor and resonant switched-capacitor,’’ IEEE\nTrans. Power Electron., vol. 32, no. 10, pp. 7739–7749, Oct. 2017.\n[16] W. Li, W. Li, X. Xiang, Y . Hu, and X. He, ‘‘High step-up interleaved\nconverter with built-in transformer voltage multiplier cells for sustain-\nable energy applications,’’ IEEE Trans. Power Electron., vol. 29, no. 6,\npp. 2829–2836, Jun. 2014.\n[17] G. R. C. Mouli, J. H. Schijffelen, P. Bauer, and M. Zeman, ‘‘Design and\ncomparison of a 10-kW interleaved boost converter for PV application\nusing Si and SiC devices,’’ IEEE J. Emerg. Sel. Topics Power Electron.,\nvol. 5, no. 2, pp. 610–623, Jun. 2016.\n44 VOLUME 10, 2022\nR. Rahimiet al.: Interleaved High Step-Up DC-DC Converter Based on Integration of CI and BIT\n[18] M. Fekri, H. Farzanehfard, and E. Adib, ‘‘An interleaved high step-up DC-\nDC converter with low input current ripple,’’ in Proc. 7th Power Electron.\nDrive Syst. Technol. Conf. (PEDSTC), Feb. 2016, pp. 437–442.\n[19] V . Anand Kishore Prabhala, P. Fajri, V . Sai Prasad Gouribhatla, B. Prashant\nBaddipadiga, and M. Ferdowsi, ‘‘A DC–DC converter with high voltage\ngain and two input boost stages,’’ IEEE Trans. Power Electron., vol. 31,\nno. 6, pp. 4206–4215, Jun. 2016.\n[20] S. Lee, P. Kim, and S. Choi, ‘‘High step-up soft-switched converters using\nvoltage multiplier cells,’’ IEEE Trans. Power Electron., vol. 28, no. 7,\npp. 3379–3387, Jul. 2013.\n[21] C.-M. Young, M.-H. Chen, T.-A. Chang, C.-C. Ko, and K.-K. Jen, ‘‘Cas-\ncade cockcroft–Walton voltage multiplier applied to transformerless high\nstep-up DC–DC converter,’’ IEEE Trans. Ind. Electron., vol. 60, no. 2,\npp. 523–537, Feb. 2013.\n[22] K. I. Hwu and Y . T. Yau, ‘‘High step-up converter based on coupling\ninductor and bootstrap capacitors with active clamping,’’ IEEE Trans.\nPower Electron., vol. 29, no. 6, pp. 2655–2660, Jun. 2014.\n[23] Y . Zhao, W. Li, and X. He, ‘‘Single-phase improved active clamp coupled-\ninductor-based converter with extended voltage doubler cell,’’ IEEE Trans.\nPower Electron., vol. 27, no. 6, pp. 2869–2878, Jun. 2012.\n[24] T. Liu, M. Lin, and J. Ai, ‘‘High step-up interleaved DC–DC converter with\nasymmetric voltage multiplier cell and coupled inductor,’’ IEEE J. Emerg.\nSel. Topics Power Electron., vol. 8, no. 4, pp. 4209–4222, Dec. 2020.\n[25] Y . Zheng, W. Xie, and K. M. Smedley, ‘‘Interleaved high step-up converter\nwith coupled inductors,’’ IEEE Trans. Power Electron., vol. 34, no. 7,\npp. 6478–6488, Jul. 2019.\n[26] K.-C. Tseng, C.-C. Huang, and W.-Y . Shih, ‘‘A high step-up converter with\na voltage multiplier module for a photovoltaic system,’’ IEEE Trans. Power\nElectron., vol. 28, no. 6, pp. 3047–3057, Jun. 2013.\n[27] K.-C. Tseng and C.-C. Huang, ‘‘High step-up high-efﬁciency interleaved\nconverter with voltage multiplier module for renewable energy system,’’\nIEEE Trans. Power Electron., vol. 61, no. 3, pp. 1311–1319, Mar. 2014.\n[28] X. Hu, G. Dai, L. Wang, and C. Gong, ‘‘A three-state switching boost\nconverter mixed with magnetic coupling and voltage multiplier techniques\nfor high gain conversion,’’ IEEE Trans. Power Electron., vol. 31, no. 4,\npp. 2991–3001, Apr. 2016.\n[29] M. Forouzesh, Y . Shen, K. Yari, Y . P. Siwakoti, and F. Blaabjerg, ‘‘High-\nefﬁciency high step-up DC-DC converter with dual coupled inductors\nfor grid-connected photovoltaic systems,’’ IEEE Trans. Power Electron.,\nvol. 33, no. 7, pp. 5967–5982, Jul. 2018.\n[30] W. Li and X. He, ‘‘An interleaved winding-coupled boost converter with\npassive lossless clamp circuits,’’ IEEE Trans. Power Electron., vol. 22,\nno. 4, pp. 1499–1507, Jul. 2007.\n[31] K.-C. Tseng, J.-Z. Chen, J.-T. Lin, C.-C. Huang, and T.-H. Yen,\n‘‘High step-up interleaved forward-ﬂyback boost converter with three-\nwinding coupled inductors,’’ IEEE Trans. Power Electron., vol. 30, no. 9,\npp. 4696–4703, Sep. 2015.\n[32] L. He and Y . Liao, ‘‘An advanced current-autobalance high step-up con-\nverter with a multicoupled inductor and voltage multiplier for a renewable\npower generation system,’’ IEEE Trans. Power Electron., vol. 31, no. 10,\npp. 6992–7005, Oct. 2016.\n[33] W. Li, Y . Zhao, J. Wu, and X. He, ‘‘Interleaved high step-up converter\nwith winding-cross-coupled inductors and voltage multiplier cells,’’ IEEE\nTrans. Power Electron., vol. 27, no. 1, pp. 133–143, Jan. 2012.\n[34] W. Li, W. Li, X. He, D. Xu, and B. Wu, ‘‘General derivation law of\nnonisolated high-step-up interleaved converters with built-in transformer,’’\nIEEE Trans. Ind. Electron., vol. 59, no. 3, pp. 1650–1661, Mar. 2012.\n[35] W. Li, X. Xiang, C. Li, W. Li, and X. He, ‘‘Interleaved high step-up\nZVT converter with built-in transformer voltage doubler cell for distributed\nPV generation system,’’ IEEE Trans. Power Electron., vol. 28, no. 1,\npp. 300–313, Jan. 2013.\n[36] T. Nouri, N. V osoughi, S. H. Hosseini, E. Babaei, and M. Sabahi,\n‘‘An interleaved high step-up converter with coupled inductor and built-\nin transformer voltage multiplier cell techniques,’’ IEEE Trans. Ind. Elec-\ntron., vol. 66, no. 3, pp. 1894–1905, Mar. 2018.\n[37] T. Nouri, N. Nouri, and N. V osoughi, ‘‘A novel high step-up high efﬁ-\nciency interleaved DC–DC converter with coupled inductor and built-in\ntransformer for renewable energy systems,’’ IEEE Trans. Ind. Electron.,\nvol. 67, no. 8, pp. 6505–6516, Aug. 2020.\nRAMIN RAHIMI (Graduate Student Member,\nIEEE) received the B.Sc. degree in electrical engi-\nneering from the University of Tabriz, Tabriz, Iran,\nin 2013, and the M.Sc. degree in electrical engi-\nneering from the University of Tehran, Tehran,\nIran, in 2016. He is currently pursuing the Ph.D.\ndegree in electrical engineering with the Depart-\nment of Electrical and Computer Engineering,\nMissouri University of Science and Technology\n(formerly UMR), Rolla, MO, USA.\nHis research interests include power electronics, DC distribution systems,\nand design and implementation of power converters for the renewable energy\napplications, and electric vehicles.\nSAEED HABIBI (Graduate Student Member,\nIEEE) received the B.S. degree in electrical engi-\nneering from the K. N. Toosi University of Tech-\nnology, Tehran, Iran, in 2015, and the M.S. degree\nin electrical engineering with focus on power elec-\ntronics from the University of Tehran, Tehran, Iran,\nin 2018. He is currently pursuing the Ph.D. degree\nin electrical engineering with the Department of\nElectrical and Computer Engineering, Missouri\nUniversity of Science and Technology (formerly\nUMR), Rolla, MO, USA.\nHis research interests include power electronics, direct current distribution\nand systems, renewable energies, and energy storage systems.\nMEHDI FERDOWSI (Member, IEEE) received\nthe B.S. degree in electronics from the University\nof Tehran, Tehran, Iran, in 1996, the M.S. degree\nin electronics from the Sharif University of Tech-\nnology, Tehran, in 1999, and the Ph.D. degree in\nelectrical engineering from the Illinois Institute of\nTechnology, Chicago, in 2004.\nHe joined the Faculty of the Missouri Univer-\nsity of Science and Technology (formerly UMR),\nRolla, in 2004, where he is currently a Professor\nwith the Electrical and Computer Engineering Department. His research\ninterests include the areas of power electronics, energy storage, smart grid,\nvehicular technology, and wide bandgap devices. Since 2004, he has been\nsuccessful in securing more than ﬁve million in funding—his individual\nshare. The published results of his scholarly activities include two book\nchapters and over 140 archival journals and conference proceedings. He has\ngraduated more than 30 M.Sc. and Ph.D. students. He was a recipient of\na National Science Foundation Career Award, in 2007. He has received\nseveral outstanding teaching awards and recognitions from Missouri S&T.\nHe received Missouri S&T’s Faculty Excellence Award, in 2017. He and his\nstudents won a best paper award at the IEEE Vehicle Power and Propulsion\nConference, in 2008. He also won a best poster award at the IEEE Interna-\ntional Conference on Renewable Energy Research and Applications, in 2014.\nHe is an Associate Editor of the IEEE TRANSACTIONS ON POWER ELECTRONICS.\nPOURYA SHAMSI (Senior Member, IEEE)\nreceived the B.Sc. degree in electrical engineering\nfrom the University of Tehran, Iran, in 2007, and\nthe Ph.D. degree in electrical engineering from\nThe University of Texas at Dallas, USA, in 2012.\nHe is currently a Woodard Associate Professor\nin electrical engineering with the Missouri Univer-\nsity of Science and Technology (formerly UMR).\nHis research interests include power electronics,\nmicrogrids, wide bandgap devices, MV inverters,\nand motor drives.\nVOLUME 10, 2022 45",
  "topic": "Inductor",
  "concepts": [
    {
      "name": "Inductor",
      "score": 0.7367309331893921
    },
    {
      "name": "Voltage multiplier",
      "score": 0.6421244144439697
    },
    {
      "name": "Capacitor",
      "score": 0.5884404182434082
    },
    {
      "name": "Electrical engineering",
      "score": 0.5567483901977539
    },
    {
      "name": "Transformer",
      "score": 0.5082628130912781
    },
    {
      "name": "Duty cycle",
      "score": 0.506950855255127
    },
    {
      "name": "Voltage",
      "score": 0.5017175674438477
    },
    {
      "name": "Boost converter",
      "score": 0.4829111099243164
    },
    {
      "name": "Diode",
      "score": 0.43130674958229065
    },
    {
      "name": "Electronic circuit",
      "score": 0.43081745505332947
    },
    {
      "name": "Switched capacitor",
      "score": 0.4134160876274109
    },
    {
      "name": "Forward converter",
      "score": 0.4112122356891632
    },
    {
      "name": "Voltage spike",
      "score": 0.410250186920166
    },
    {
      "name": "Electronic engineering",
      "score": 0.399198055267334
    },
    {
      "name": "Computer science",
      "score": 0.38722115755081177
    },
    {
      "name": "Engineering",
      "score": 0.27964767813682556
    },
    {
      "name": "Voltage divider",
      "score": 0.2763793468475342
    },
    {
      "name": "Dropout voltage",
      "score": 0.14606308937072754
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I20382870",
      "name": "Missouri University of Science and Technology",
      "country": "US"
    }
  ]
}