{
    "title": "Toward Human-Centered Automated Driving: A Novel Spatiotemporal Vision Transformer-Enabled Head Tracker",
    "url": "https://openalex.org/W4210740016",
    "year": 2022,
    "authors": [
        {
            "id": "https://openalex.org/A2171667394",
            "name": "Zhongxu Hu",
            "affiliations": [
                "Nanyang Technological University"
            ]
        },
        {
            "id": "https://openalex.org/A2114723734",
            "name": "Yiran Zhang",
            "affiliations": [
                "Nanyang Technological University"
            ]
        },
        {
            "id": "https://openalex.org/A2103148487",
            "name": "Yang Xing",
            "affiliations": [
                "Cranfield University"
            ]
        },
        {
            "id": "https://openalex.org/A2099385492",
            "name": "Yifan Zhao",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2162306453",
            "name": "Dongpu Cao",
            "affiliations": [
                "University of Waterloo"
            ]
        },
        {
            "id": "https://openalex.org/A2095731128",
            "name": "Chen Lv",
            "affiliations": [
                "Nanyang Technological University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W1974744233",
        "https://openalex.org/W6762718338",
        "https://openalex.org/W2963644257",
        "https://openalex.org/W1896788142",
        "https://openalex.org/W2957744218",
        "https://openalex.org/W2998505840",
        "https://openalex.org/W2497643754",
        "https://openalex.org/W2770745281",
        "https://openalex.org/W3124849147",
        "https://openalex.org/W2783653384",
        "https://openalex.org/W2964320807",
        "https://openalex.org/W3117658046",
        "https://openalex.org/W3127334354",
        "https://openalex.org/W2615547864",
        "https://openalex.org/W4214588794",
        "https://openalex.org/W2955425717"
    ],
    "abstract": "Accurate dynamic driver head pose tracking is of great importance for driver–automotive collaboration, intelligent copilot, head-up display (HUD), and other human-centered automated driving applications. To further advance this technology, this article proposes a low-cost and markerless headtracking system using a deep learning-based dynamic head pose estimation model. The proposed system requires only a red, green, blue (RGB) camera without other hardware or markers. To enhance the accuracy of the driver’s head pose estimation, a spatiotemporal vision transformer (ST-ViT) model, which takes an image pair as the input instead of a single frame, is proposed. Compared to a standard transformer, the ST-ViT contains a spatial–convolutional vision transformer and a temporal transformer, which can improve the model performance. To handle the error fluctuation of the head pose estimation model, this article proposes an adaptive Kalman filter (AKF). By analyzing the error distribution of the estimation model and the user experience of the head tracker, the proposed AKF includes an adaptive observation noise coefficient; this can adaptively moderate the smoothness of the curve. Comprehensive experiments show that the proposed system is feasible and effective, and it achieves a state-of-the-art performance.",
    "full_text": null
}