{
    "title": "Natural language modelled and printed in 3D: a multi-disciplinary approach",
    "url": "https://openalex.org/W4214950352",
    "year": 2022,
    "authors": [
        {
            "id": "https://openalex.org/A5055501553",
            "name": "Alex Pillen",
            "affiliations": [
                "University College London"
            ]
        },
        {
            "id": "https://openalex.org/A5029587993",
            "name": "Emma-Kate Matthews",
            "affiliations": [
                "University College London"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W1594229016",
        "https://openalex.org/W4234261680",
        "https://openalex.org/W1970000328",
        "https://openalex.org/W3046828703",
        "https://openalex.org/W2079016248",
        "https://openalex.org/W2074166735",
        "https://openalex.org/W2036143846",
        "https://openalex.org/W4236710880",
        "https://openalex.org/W2477175324",
        "https://openalex.org/W4293582985",
        "https://openalex.org/W4254350352",
        "https://openalex.org/W2726519390",
        "https://openalex.org/W2498543620",
        "https://openalex.org/W2147033629",
        "https://openalex.org/W3150868948",
        "https://openalex.org/W2767433310",
        "https://openalex.org/W2153174837",
        "https://openalex.org/W4388119254",
        "https://openalex.org/W2032190815",
        "https://openalex.org/W3193397673",
        "https://openalex.org/W632681236",
        "https://openalex.org/W2085215355",
        "https://openalex.org/W4297806135",
        "https://openalex.org/W4300575888",
        "https://openalex.org/W2106814120"
    ],
    "abstract": null,
    "full_text": "ARTICLE\nNatural language modelled and printed in 3D:\na multi-disciplinary approach\nAlex Pillen 1✉ & Emma-Kate Matthews 2\nNatural language is a high-dimensional form that evolved through innovation and repetition\nover millennia. We tend to imagine language in the shape dictated by our writing system, as\nwords on a page, or as sound. The aim of this paper is to explore how one aspect of this high-\ndimensional form could be rendered in 3D. Contemporary software developed for the pro-\nduction of ﬁlm and video animation became a tool for us to model natural language. The\npaper begins with an overview of historical material about features of language and com-\nputational design that became relevant for our project. The whole system and structure of a\nlanguage, its grammar has been compared to a geometry for centuries, as principles that\ndeﬁne its shape. One aspect of this complex conﬁguration was selected for 3D modelling;\nevidentiality. This aspect of every language points at the evidence for what people are saying.\nThe paper lays out the research trajectory that allowed us to conceive of evidentiality as a\nthird dimension, which is often lost in translation. We offer a step-by-step account of our\nmethodology and 3D design process. Ourﬁndings consist of four introductory prototypes and\ndigital 3D images, each one designed on the basis of a short language sample. The portrayal\nof a language excerpt as a digitally frozen shape enabled us to print natural language in 3D.\nSuch 3D language objects not only extend the legacy of form-ﬁnding within computational\ndesign, but also allows for spatial intuition to help us get a more solid grasp of languages we\nmay not speak.\nhttps://doi.org/10.1057/s41599-022-01089-5 OPEN\n1 Department of Anthropology, University College London, London, UK.2 The Bartlett School of Architecture, University College London, London, UK.\n✉email: a.pillen@ucl.ac.uk\nHUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS|            (2022) 9:72 | https://doi.org/10.1057/s41599-022-01089-5 1\n1234567890():,;\nIntroduction\nT\nhe double helix of DNA and structure of virus particles are\nby now familiar as images that circulate widely. By con-\ntrast, the shape of humanity’s natural languages, and their\nhigh-dimensional form mostly remain to be explored and mod-\nelled as visual material. The contemporary software we have at\nour disposal and methods for digital design allow us to visualise\nnatural forms of human language. This is a multi-disciplinary\neffort, which relies upon a study of language combined with\nexpertise within architecture and design.\nThe structure of language in its elementary form unfolds along\na timeline, as one phrase succeeds another. Scholars of spoken\ndiscourse record speech and later produce it in a written format\nas a transcript. Conventions for transcription vary (Bucholtz,\n2000), but generally the lines of the transcript are made to\nresemble the structure of speech. A brief pause at the end of a\nphrase, as it were, punctuates speech. When producing a written\nrecord of spoken language, it is important to visualise such pat-\nterns on the page, moving to the next line after a pause in the\nutterance. Likewise, the intonation of speech is another element\nthat leads to the organisation of lines on the page (Hymes,2003,\np. 96). When written down, speech therefore does not look like\nprose. The structure of spoken language is re ﬂected in each\ntranscript. The organisation of the lines of a transcript is an\nimplicit patterning within language (Hymes, 1994). In spoken\nlanguage, the units that correspond to sentences are called“ver-\nses”. People speak in verses not prose, and discovering the lines of\na transcript leads to an understanding of the structure of language\nthat is otherwise not possible. It is this elementary structure\nreﬂected in a transcript that forms the basis of our study, as we\nbegan to model natural language as a three-dimensional (3D)\nshape (see Fig.1).\nThe research question we address here is how aspects of the\nhigh-dimensional form of natural language could be rendered in\n3D. In order to do so, weﬁrst present historical sources on the\ntimeworn comparison between the grammar of language and the\n“geometry” of a ﬁgure, its shape or arrangement of its parts. For\nthe purpose of this study we selected one grammatical feature,\nevidentiality and we discuss its historic roots. After this section on\nthe historical background to our project, we continue with a\nreview of the literature, which includes both references to the\nstudy of language and relevant material on computational 3D\nmodelling. A method section follows with a detailed lay-out of the\nsteps we took to construct a 3D digital image from a language\nsample. The paper’s main section presents theﬁndings, and the\nfour prototypes we developed. Each one is based on a distinct\nlanguage sample, from the Kurdish language, an Amazonian\nlanguage, an ancient dialect of Neo-Assyrian, and American\nEnglish. Finally, in the conclusion we reveal images of the samples\nof natural language printed in 3D, along with a discussion of the\nproject’s contribution to both computational design and our\nunderstanding of natural language as a high-dimensional form.\nHistorical background\nBesides the elementary form of spoken language revealed in a\ntranscript, grammar is a structural element that equally deter-\nmines the shape of language. Grammar is deﬁned as the whole\nstructure and system of a language, and has been compared to a\ngeometrical order for centuries. Within mathematics, geometry\nstands for the study of the spatial relationships between the lines,\nangles, and surfaces of things. Flat shapes such as circles or\nsquares describe boundaries in two dimensions. Their\n3-dimensional equivalents, spheres and cubes, reveal an orienta-\ntion and situation within 3-dimensional space. A thirteenth\ncentury Archbishop of Canterbury in England (Robert Kilwardby\n1215–1279) had pointed out a correspondence between theﬁelds\nof grammar and geometry. His work later prompted the Dutch\nphilosopher Spinoza (1632–1677) to treat grammar in a geo-\nmetric manner in the seventeenth century. Spinoza in turn\ninﬂuenced ideas by the linguist Whorf (Jakobson,1968, p. 605),\nbest known for the Whorf hypothesis. This is a principle sug-\ngesting that the structure of a language affects its speakers ’\nworldview, and that people’s perceptions are relative to the lan-\nguage they speak (Carroll et al.,2012). A less well-known aspect\nof Whorf’s oeuvre is his attention to“a geometry of form prin-\nciples characteristic of each language” (Jakobson, 1981, pp. 76–77,\noriginal emphasis). This Whorﬁan notion informed the early\nstage of our research. But what does geometry mean in this\ninstance?\nThe distinctive property of grammar lies in its abstractive\npower, as it abstracts itself from anything that is particular,\nconcrete— the actual words or discourse. What is left are the\nabstract designs of the structure of phrases, the grammatical rules.\nIn this way, grammar resembles geometry. Geometry is an\nabstract construction that presents an idealistic formalisation of\nthe size and shape of things. For instance, we know that the earth\nis not a perfect sphere, but it is represented as one in celestial\nglobes. What underlies both geometry and grammar is the\nabstractive power of human thought. We superimpose simple\ngeometrical relations upon the particular objects we see, and we\nmap out grammatical ﬁgures upon concrete instances of verbal\nexpression. Jakobson notes that he relation between language and\nits grammatical features is like“the relation between physical and\ngeometric bodies”. The physique of language subsumes words\nresembling a geometric body, that “mimic the abstract role of\nspatial coordinates” in a physical world (Jakobson, 1968, pp.\n605–606). This time-honoured comparison between grammar\nand geometry forms the historical background to our study. The\ncomplexity of such“a geometry of form principles” in language\nmeant that they were evoked throughout the ages but never\nvisualised. Here, we explore if contemporary developments in\narchitecture and 3D design can bring about such a visualisation.\nThe familiar visual representations of an astronomer or che-\nmist represent spatial or geometric qualities of planets and\nmolecules and converts them to a scale that is visible to the\nhuman eye without telescope or microscope. By contrast natural\nlanguage is commonly envisaged as a virtual entity, only seen by\nmeans of writing systems, from which we deduct the sound and\nmeaning of words. Should we therefore conceive of Whorf ’s\nnotion of “a geometry of form principles” (Jakobson, 1981, pp.\n76–77) that typiﬁes a language as only a metaphor? Could this be\nan imaginative portrayal of natural language, as an immaterial\nentity, without spatial or geometric characteristics of its own? On\nthe contrary, natural language often acts as a placeholder for\nFig. 1 Illustration of a transcript of recorded speech in an Amazonian\nlanguage. Provided in small script, without translation and arranged around\na central axis only to reveal the elementary structure of a spoken language\nsample (Aikhenvald, 2003, pp. 630–635).\nARTICLE HUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS | https://doi.org/10.1057/s41599-022-01089-5\n2 HUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS|            (2022) 9:72 | https://doi.org/10.1057/s41599-022-01089-5\nmaterial, observable entities, and its grammar re ﬂects this\npotential. The category of words Jakobson brought to the fore in\nthis respect were pronouns (Jakobson,1968, pp. 605–606). The\nhe, she or you, of conversation or discourse anchor language into\nits surrounding reality in a particular manner. In each utterance\nsuch pronouns can stand for a different person, shifting from\ncontext to context. Language is held in place by the concrete\nﬁllers of any given sequence of pronouns. This process doesn’t\nlimit itself to people or social reality, but also concerns inanimate\nfeatures. For example, the English language features this for\nnearby entities, and that for things that are further away. The\nprinciple remains the same, as a generic and relatively abstract\nterm can be used as a“receptor” that ties language into reality, as\na web of meaning with deﬁnite spatial characteristics. In each\nutterance one can ﬁnd ephemeral “placeholders”, with concrete\npeople or things that stand foryou, she or that. The spatial nature\nof language is thereby not only a metaphor, but is central to the\nstudy of language in its spoken, interactive form.\nThere are other features of natural language that also manifest\na concrete orientation towards social and material realities. For\nexample, evidentiality which ties language to elements of reality\nthat have been observed, witnessed. The term evidence reﬂects the\nrelevance of sight from the Latin “to see” (videre), but can of\ncourse also be based on hearing or other senses. All languages\nhave the means for establishing evidence for what one is saying,\nand feature evidentiality. Evidentiality portrays the way verbal\nexpression is tied into perception, and indicates the source of the\ninformation, as seen, heard or otherwise sensed. This involves the\ngrounding of an utterance in a body of facts and ﬁrst-hand\nexperiences, a set of events witnessed in a particular place. Evi-\ndentiality acts as a momentary placeholder providing coordinates\nof perception as speech unfolds. It belongs to a wider group of\nlanguage features that act as “placeholders” for material and\nobservable entities. Such “receptors” or “placeholders” are cor-\nnerstones of a language ’s “geometry of form principles ”\n(Jakobson, 1981, pp. 76–77) at the meeting point between an\nutterance and its concrete, physical situation.\nThese features of natural language stood out as we began to\nrespond to our research question. Could contemporary develop-\nments in architecture and 3D design, and the modelling software\ndeveloped for the production ofﬁlm and video animation become\nrelevant for the visualisation of natural language? Natural lan-\nguages are high-dimensional forms, and this paper only offers an\ninitial foray into a largely unexplored terrain. For the purpose of\ncreating a prototype we opted for a well-de ﬁned and single\ngrammatical feature as a speciﬁc dimension to model language in\n3D: evidentiality. It has received much scholarly attention across\nthe ﬁelds of both linguistics and anthropology, which has gen-\nerated a wealth of data.\nMuch like the comparison of geometry and language, a\npreoccupation with evidentiality has a long history. It was Franz\nBoas who had ﬁrst set out the linguistic method of anthro-\npology, the study of languages and cultures in Science Magazine\nin the nineteenth century ( 1899,p .9 5 ) .H i so e u v r eb r o u g h t\nhome a critical awareness of the evidential strength in native\nAmerican languages, such as Kwakiutl. Later, in 1942, he\nremarked that “we would read our newspapers with much\ngreater satisfaction if, in the same way as Kwakiutl, our lan-\nguage, too, would compel journalists to state whether their\nreports were based on self-experience, on inference, or on\nhearsay” (Jakobson, 1971a, p. 483). It was the linguist Jakobson\nwho later coined the term evidential and portrayed the sys-\ntematic distinction between “vouched for ” and other events\n(1971b, p. 135). Evidentials operate along a continuum from\nfacts based on ﬁrst-hand experience, information that was\nheard, seen or otherwise sensed, to information that was\nreported by somebody else, to hearsay, or indeed speculative\nthought void of tangible sense.\nThe hierarchy of evidential values depend on a cultural context,\nwhether for example seeing or hearing carries more evidential\nweight. Likewise, the importance of the function of evidentiality is\nlanguage-speciﬁc, and is an aspect of linguistic relativity (Hymes,\n1966; Jakobson,1985). Our perception of the world and our ways\nof thinking about it are deeply inﬂuenced by the structure of the\nlanguages we speak. Evidentiality is a prominent aspect of such\nrelativity as it concerns the way language is tied into perception\nand reﬂects a hierarchy of evidential value. In general, ideas about\nlanguage structure and its use vary from one culture and social\ncontext to another (Hymes,1966; Schieffelin et al.,1998). Like-\nwise, verbal expression isn ’t a single assumed phenomenon,\n“language” as we know it, but understandings of its existence, the\nkind of entity it is, vary across cultures (Demuro and Gurney,\n2021). In view of this complexity, we limit this study to an ele-\nmentary grammatical feature that characterises moments in ver-\nbal expression that encode perception: evidentiality. Such markers\nof perceptible reality are conceived as a set of coordinates,\nreﬂecting the manner in which language is tied into perception.\nRelevant literature\nIn approximately a quarter of the world\n’s languages grammar\ndictates that the evidence for what is said must be marked. Such\nobligatory grammatical evidentiality has been documented most\nextensively for Native American, Amazonian, and Australian\nAboriginal languages. Further categories of inference, assump-\ntion, hearsay or indeed speculative thought void of tangible sense,\nare marked by contrast to evidential precision (Boas, 1911;\nAikhenvald, 2018). The existing literature on evidentiality is\nextensive, and includes work written by anthropologists who pay\nattention to the social context of evidential language in spoken\nforms (Hill and Irvine,1992; Kuipers,2013). However, it was not\npossible to include social factors within the modelling process,\nwhich is solely based on the recorded speech events themselves.\nTo ﬁrst conceive of language in 3D we relied on existing concepts\nwithin the literature, the notion that narratives can be studied in\nterms of their pattern (Hymes, 1982) and their texture\n(Johnstone, 1990). Such seminal work allowed us to develop the\nnotion of an arrangement of evidentials across an utterance as an\naspect of the shape of language now to be visualised in 3D.\nThe research process that led to the modelling and visualisation\nof natural language in 3D was also guided by a body of literature\non the history of design. The software that is currently used for\nthe production of ﬁlm and video animation seemed apposite to\nbegin to work with the complex and dynamic shapes of natural\nlanguage. This is also known as “spline-based” software. A\n“spline” or ﬂexible curve is deﬁned in mathematics, as a curve\nconstructed so that it passes through a set of points. Such curves\nthen form the basis for the modelling of spline-based 3D surfaces\nthat make video animation possible. For the visualisation of\nlanguage in 3D, it was necessary toﬁrst disaggregate taken for\ngranted aspects of the historic development of such spline-based\ndesign tools. We turned to the historical roots of parametric\ndesign to discern elementary tools for our project.\nSpline surface geometries have been used for centuries in crafts\nsuch as ship building. Historically, splines were typically drawn\non a horizontal surface using aﬂexible strip arranged as a curve\nbetween a series of carefully positioned lead weights, known as\n“ducks”. Likewise, the Catalan architect Gaudí used weights on a\nstring to design the iconic model of the church crypt of the\nColònia Güell. The parameters for this design are the string\nlength, the weights, and the nodes where the string is attached,\nwhile the outcome of the model automatically derives from\nHUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS | https://doi.org/10.1057/s41599-022-01089-5 ARTICLE\nHUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS|            (2022) 9:72 | https://doi.org/10.1057/s41599-022-01089-5 3\ngravity (Davis, 2013). Gaudí’s architecture contained the main\nfeatures of what would become“parametric design” in a digital\nage, conceived in terms of parameters that vary or can be\nadjusted. He could generate different versions of his model,\nthrough simple physical adjustment of strings and weights. This\nhands-on approach led to him to be called Gaudí“the geometer”\n(e.g., Català, 2007) and he was known as an architect especially\nskilled in geometry. This model for design and architecture\nseemed well-suited to begin to work with“the geometry of form\nprinciples” characteristic of natural languages (Jakobson, 1981,\npp. 76–77). Without insights from Gaudí’s oeuvre we would not\nhave been able to conceive of the perceptual anchor points of\nlanguage as weights, along an abstract gravitational axis, reﬂecting\nthe relative evidence they provide. We developed a form of\nparametric design with parameters derived from the elementary\nstructure of spoken language as well as its grammar. Each marker\nof evidentiality is conceived as a “weight of evidence ” that\ninﬂuences what is said in its immediate vicinity.\nThe history of spline-based architecture includes a further\nelement that proved essential for our design process. We did not\nwish to construct evidential weights that pointed away from the\nviewer. This would be counterintuitive. It made sense to depict\nthe evidential bases of the utterance as close-by, with the more\nspeculative aspects of language use placed at a distance. The\nsegments where language tied into perception for the original\nspeaker now point towards the viewer. This kind of inversion is\nalready sedimented into the history of parametric design, and we\ndeveloped our project in parallel to historical design processes.\nWithin architecture models created with string and weights were\ninverted and turned upwards to be built as arches for chapels or\nchurches. The Catalan Architect Gaudí did not have to manually\ncalculate architectural outputs, but could derive the shape of the\ncurves through the force of gravity of the weights acting on\nstrings (Burry, 2011, pp. 152–170, Davis, 2013), This type of\nmodelling goes back to seventeenth century philosophy and\narchitecture, or Robert Hooke’s saying“as hangs theﬂexible line,\nso but inverted will stand the rigid arch” (Hooke, 1675,p .3 ;\nHeyman, 1995, p. 7 quoted in Davis, 2013). In other words,\nstrings with weights settle into a shape, and can then be inverted\nto point upwards as an architectural model. Gaudí used this\nprinciple to design the Colònia Güell chapel by creating an\ninverted model using strings weighed down with birdshot lead\npellets (Burry, 2007). Our method adheres to this tradition but\nconcerns natural language. String-based methods of design have\nbeen around for centuries, including the method of inversion,\nwhich we applied to 3D language models too. We frame evi-\ndential coordinates as exerting a gravitational pull re\nﬂecting the\nweight of evidence. Afterwards we inverted the model with evi-\ndentiality and closeness to perceptible reality pointing upwards\ntowards the viewer, and experienced as nearby. Perceptual clo-\nseness for the original speaker was mimicked for the viewer faced\nwith the model’s protruding sections.\nOur design process is equally indebted to literature on classical\nantiquity. The act of visualising language as a virtual material logic\nis timeworn and sedimented into our vocabulary. The written\nword is a visual representation and notation of acoustic shapes in\nlanguage, yet also inhabits a ﬁgurative space as “text”, derived\nfrom the Latin for“woven” (textus). In ancient Greece, the verbal\narts of song making and epic narration of Homeric poetry was\nvisualised as the craft of pattern-weaving and sewing (expressed by\nthe verbs huphaínein “weave”,o r rháptein “sew”) (Fanfani et al.,\n2016; Nagy, 2017). Such textile picturing of language lives on in\nour language as “text”, “hymn”,o r “rhapsody”. Likewise, our\nmodels evoke aﬁgurative (Allen, 2000, pp. 32–33, 40) texture of\nlanguage. Elements of language interlace with observable reality,\nand together they are conceived as a digitally woven fabric.\nComparable to a“text” as a ﬁgurative rendering of language, the\ngeometric texture of natural language is also ﬁgurative, but is\nconceptualised as“woven” in 3D.\nMethods\nNatural language is a high-dimensional form. We ought not be\ndeceived into seeing language in the form employed by our\nwriting system, as words, and sentences (Port,2010, p. 304). Nor\ncan its visualisation be limited to 2-dimensional “texts”,o ra\nhomogeneous plane of language laid out on paper and conceived\nas “superimposed upon” a solid surface (cf. Ingold,2016, p. 59;\nIngold, 2017, p. 54, 132). A model of language in 3D is based on a\nstandard set of coordinates along thex, y and z-axis of Cartesian\ngeometry. This is the method for making 3D objects commonly\nused in 3D modelling software. We mapped speciﬁc language\nfeatures onto this system of coordinates to create a 3D repre-\nsentation of language (see Fig.2). This process depends on the\nselection of language features, and the extraction of the form of\nlanguage from its meaning-based aura. What we deliberately left\nout here is the word structure or semantic organisation of lan-\nguage. We selected and extracted the basic structure of language,\nits progression along a timeline, as a sequence of “syllables”.\nSyllables are the units of pronunciation including one vowel\nsound, which are the building blocks of words. This approach\ndepends on the study of language as sound, an approach pio-\nneered by Steven Feld and Don Brenneis (e.g.,2004). The design\nprocess was also based on our previous work in experimental\narchitecture (Matthews, 2017), and the spatial conceptualisation\nof language (Pillen,2017). This led to a portrayal of language as a\nfrozen, abstracted, syllabic, sonic structure woven into perceptible\nreality by means of evidentiality.\nThe 3D models emerged from a translation of linguistic data\ninto a visual programming language (Grasshopper integrated\nwith Rhino’s 3-D modelling tools). A detailed breakdown of the\n3D design process follows. First a transcript was manually for-\nmatted indicating the relative weight of each evidential as a\nnumber. This is the point where linguistic units are given a\nnumerical value. For the sake of brevity, we demonstrate this\nFig. 2 The Cartesian coordinate system used to present language in 3D.\nThe parameters of a transcript mapped out ontox, y and z-axes.\nFig. 3 A brief example of coded evidentiality in the transcript of an\nAmazonian language sample.Evidentials are marked in bold with their\nrelative weight indicated as a numerical value in brackets.\nARTICLE HUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS | https://doi.org/10.1057/s41599-022-01089-5\n4 HUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS|            (2022) 9:72 | https://doi.org/10.1057/s41599-022-01089-5\nprinciple through one example, the relative weighting of evi-\ndentials in an Amazonian language, Tariana. On the basis of\nresearch in linguistics combined with ethnography a hierarchy of\npreferred evidentials can be discerned within a speech commu-\nnity. In other words, certain evidentials are more highly valued. In\nthe Tariana language speakers are grammatically obliged to\nindicate the nature of the evidence they convey. Such evidence\nfalls into ﬁve categories. First of all a visual evidential for infor-\nmation obtained through direct visual observation and secondly a\nnon-visual evidential for evidence based on other senses. Further\ncategories indicate an absence of direct visual or non-visual evi-\ndence. The third concerns inferred evidence based on an observed\nevent or state, and the fourth a reported evidential or the repe-\ntition of information related by someone else. Finally, there is a\nﬁfth category of assumed evidential referring to information\nobtained through reasoning or common sense without visual or\nnon-visual experience (Aikhenvald, 2003: pp. 287–323). Such a\nhierarchy of evidential categories is language and culture speciﬁc,\nhence the need for rigorous research including methods from\nlinguistics and ethnography to determine the value of each evi-\ndential. Based on this existing research, we gave numerical values\nto each evidential category in a language sample thereby coding\ntheir evidential weight (see Fig.3).\nThe formatted transcript is then entered into an Excel\nSpreadsheet, which separates out each line of the transcript on its\nown row and lists the relative evidential weightings within the\nbody of the text. The Excel spreadsheet is then read by the\nGrasshopper script, which determines the number of syllables in\neach line of the transcript. The software also searches for square\nbrackets to create a list with the numbers of the evidential\nweightings and their locations within the structure of the tran-\nscript. Data from the language samples are then organised by a\nfamiliar Cartesian system of axesx, y and z (see Fig. 2 above)\nthrough an initial digital threading of sequences of syllables on a\ntimeline. The x-axis depicts the timeline of speech as one phrase\nsucceeds another, with they-axis indicating the number of syl-\nlables in each line of a transcript. Thex- and y-axis can thereby\nrepresent the elementary structure of language re ﬂected in a\ntranscript. By now the model is a digitally woven pattern with two\nparameters that are given numerical values, the length of the\n“warp” deﬁned by the length of thex-axis or timeline, and length\nof the“weft” (ﬁlling yarn) being they-axis or number of syllables\nin a line of transcript. At this point we have the warp and the weft\nof a digital fabric based on the elementary structure of language\ndiscussed in the introduction, but it isﬂat.\nNotation alone, whether in the form of written language or as a\ndrawing in two-dimensional (2D) space, is too reductive to have\nthe capacity to communicate complex, implicit aspects of natural\nlanguage. Such knowledge can be invoked through other visual\nand physically tangible means. Here, we propose a 3D image of a\nlinguistic connectedness to evidence. This method of converting a\nlinguistic, evidential value to a numeric one is the point at which\nthe image obtains its parametric and ﬁgurative character. The\nlines of a transcript or text are suspended between points in 3D\nspace, and no longer feature as notation drawn on a surface.\nDigital curves were constructed by locating control points in the\nwoven structure (Jabi,2013), which can be thought of as virtual\nevidential weights. The third dimension orz-axis indicates such\nrelative evidential weight within a language sample, at points\nwhere language is tied into the source of information, the evi-\ndence. Evidential markers thereby take on a virtual weight along a\ndigital spline, or ﬂexible curve. This way a selected geometric\n“wireframe” of natural language was designed, a still skeletal 3D\nmodel along axyz axis.\nOnce this set of instructions for the computer— the algorithm—\nis created, any number of transcripts can be imported for 3D\nrendering. The elementary structure of the transcript and the\nevidential weightings or“input” change from one language sample\nto another. The main advantage of using a parametric, 3D\nscripting tool is that it allows for the output wireframe geometry to\nrebuild itself according to any imported transcript, making it\npossible to compare many different transcripts, without having to\nmanually rebuild the geometry from scratch. When the software\nor Grasshopper script has detected all the data in the transcript it\ncan start generating the 3D geometry (see Fig.4).\nThe software is understood to have a“morphogenetic” func-\ntion as it creates the 3D shape.“Morphogenesis” is a term bor-\nrowed from biology where organisms develop a shape, body plan\nstarting from an initial formless collection of cells. Software for\n3D design, allows for a comparable“genesis of form” based on\nimported numerical data. The evidential weights are conceived as\nvirtual material forces that gives shape to the wireframe. To\nportray natural language as a 3D object, the digital weave of warp\nand weft (ﬁlling yarn) is virtually completed to appear as a\nsmooth, woven undulating surface as opposed to a loosely woven\nseries of individual threads. This is the moment the digital fabric\nhas been realised (see Fig.5). Thisﬁnal element of the 3D design\nprocess is determined by the measured coordinates of the wire-\nframe, but also has a series of material characteristics such as the\nFig. 5 Aﬁrst image of natural language in 3D.Formulated as a digitally\nwoven fabric.\nFig. 4 A visual representation of the“algorithm” or sequence of instructions for Rhino’s 3D modelling software.A set of rules for importing and\nprocessing the transcripts, in addition to creating the 3D geometry.\nHUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS | https://doi.org/10.1057/s41599-022-01089-5 ARTICLE\nHUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS|            (2022) 9:72 | https://doi.org/10.1057/s41599-022-01089-5 5\nability to drape, or fold. Computated, parametric design thus\nmakes possible a qualitative reading of an otherwise abstract,\nnumeric dataset distilled from natural language.\nPrototypes\nWe selected language samples for the purpose of creating\nexploratory prototypes. The project began with a single prototype\nof a spoken Kurdish language sample. Kurdish is the language\nthat is central to the research of one of the co-authors. Initially\nthis research project only included one language. Once we had\ndeveloped a method and aﬁrst visualisation emerged, we were\ncurious about the potential of other datasets. To this effect we\ndeveloped a dialogue with a seminal author within the study of\nevidentiality (Aikhenvald, 2018). Amazonian languages are\nknown to have the richest array of evidentials that are currently\ndocumented. We chose a transcript in Tariana as a second\nsample, as Tariana has the most extensive system of evidentials of\nall the Arawak languages in Northwest Amazonia (Aikhenvald,\n2003). The reason for the inclusion of this language was twofold.\nFirst of all, to visualise a most complex form of evidentiality in a\nlanguage few people are familiar with. Secondly because this\nexample, and many others like it concerns an endangered lan-\nguage, for which 3D visualisation could complement existing\nlanguage documentation for future archives.\nHowever, it is important not to give the impression that\ncomplex evidential systems can only be found in the small-scale\nindigenous groups in the Amazon, Australia or Native America.\nThis led to the decision to juxtapose the 3D model of the Ama-\nzonian language sample with models based on two further lan-\nguages. Indeed, the study of evidentiality is not limited to the\nlimited class of languages that obligatorily encode the source of\nthe information but concerns related phenomena in all languages\n(Fox, 2001: p. 168). Based on expertise available within our wider\nresearch team, we questioned whether data from an ancient\nlanguage would allow us to model its evidential dynamics in 3D.\nThe third selected language was spoken in the Neo-Assyrian\nperiod. This led to a model based on records of an argument in\nAkkadian extracted from a cuneiform clay tablet from the eighth\nor seventh century BC. Finally, colleagues who had been shown\nthe models urged us on to include a sample of English, which led\nto a fourth andﬁnal model.\nOur focus was on the 3D design process itself, and the way in\nwhich it brings the evidential character of each language sample\nto the surface. The selected languages are unrelated and reﬂect\nour research trajectory, with the aim of testing the possibility of a\nfew initial 3D prototypes. We relied on the elementary structure\nof language described in our introduction, as a point of departure.\nThe transcript of each language sample reveals the lines, as well as\nthe length of each line. For the spoken samples in Kurdish, and\nAmazonian language and American English, the lines are made to\nresemble the structure of speech governed by pauses and into-\nnation patterns. The elementary structure of the written Akka-\ndian sample was determined by the lines on the cuneiform clay\ntablet from which it was extracted.\nThe model of evidentiality in Kurdish is based on a transcript\nof oral discourse in Kurdish by a co-author of this paper. The\ntranscript for this image is part of her corpus of narratives in\nKurmancî Kurdish about a lost homeland in Turkey and Syria,\nbroadcast via Kurdish media. Data on Kurdish, spoken by mil-\nlions in the Middle East and Europe’s cosmopolitan cities docu-\nment large-scale evidentialﬁnesse. The coding of this sample was\nbased on known markers of evidentiality documented by linguists\n(Johanson and Utas, 2000; Bulut, 2000). One notable evidential\ncategory is “direct reported speech”, a word-for-word quotation\nof a witnessed utterance, and representation of the voices of\nothers. The blue highlights in the digitally frozen language\nexcerpts indicate such overt references to the source of quoted\nmaterial. Crests that protrude towards the viewer indicate the\nexplicit linguistic ties to perceptible reality when originally uttered\n(see Fig. 6).\nThe next model depicts a transcript in Tariana, an Amazonian\nlanguage. The selected sample is part of a corpus of stories of\nvaried genres recorded since 1991 and features a total of 120\nevidentials over 33 lines. It is an account entitled“The Yano-\nmami”\nabout an encounter with a neighbouring people. Theﬁrst\n10 lines of this language sample were presented as an excerpt\nearlier to illustrate a transcript of recorded speech (see Fig.1).\nHere, we add an English translation, presented as prose to convey\nthe meaning of this excerpt in a nutshell, and to offer a moment\nof respite from geometric abstraction: “Here is another (story)\nagain. I will tell about what’s their name, Howler Monkey people,\nwhat I saw myself. I will tell (about) what I saw myself. There, in\nVenezuela, what’s its name, out of the Orinoco river, comes out\nanother (river) called Kunukunuma. Then our boss was (there),\nthen we went upstream, and arrived at the mouth of that river. He\nsaid, “There are Howler Monkey People (Yanomami) who owe\nme,” they say he took a gun, and they took a teacher from there.\n“So I will pay you with maniocﬂour,” he said to me,“so go and\nget (what they owe me) ”. “OK,” we said, four of us went,\n(including) one from the mouth of this river, who spoke the\nlanguage, we went. Oh! Then we went far. It was very early, four\no’clock. We went and entered (the river) and went until it was\nmidday, then we arrived. We arrived, it was very dangerous, in\nthe nice area, then we arrived at a real plain at the hill, said to be\n“Descent of a hill of a deer and an evil spirit” called “Peak”, then,\nif one looks up, there was a green lofty mountain standing (there).\nFig. 6 Prototype of sample in Kurdish (Kurmancî or Northern Kurdish).\nBlue highlights indicate word-for-word quotation.\n Fig. 7 Prototype of sample in an Amazonian language (Tariana).Tariana\nhas the most extensive system of evidentials amongst the Arawak\nlanguages.\nARTICLE HUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS | https://doi.org/10.1057/s41599-022-01089-5\n6 HUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS|            (2022) 9:72 | https://doi.org/10.1057/s41599-022-01089-5\nWe arrived close to this mountain”. Evidentials are genre-speciﬁc,\nand this narrative relies on visual, non-visual and reported evi-\ndentials. Such obligatory grammatical markers indicate whether\nthe information was obtained through direct observation, whe-\nther the evidence is based on other senses, or whether the\ninformation was related by someone else and is reported here\n(Aikhenvald, 2003, pp. 287–323, 630–637). The crests featuring in\nnearly every section of this 3D language model are a visual hint\nfor non-Tariana speakers of how the linguistic threads are tied\ninto the source of the information they encode (see Fig.7).\nA further prototype is based on an ancient language and data\nextracted from a cuneiform tablet of Neo-Assyrian origin\n(Parpola, 1978). The analysis of the material is derived from a\nwider study of the evidence-based language designs that under-\npinned the construction of an Assyrian empire (Kanchan,2018,\npp. 30–65). The data have been extracted from a cuneiform tablet\nand letter entitled“The Crimes of Guzana”. This is a letter with\ncomplaints addressed to the king about the unruly city of Guzana.\nHere, we add an English translation of a noteworthy segment of\nthe sample, conveyed in prose for the sake of brevity:“Their other\ncrime: In the reign of the father of the king, my lord, they wrote\nthe silver quota of the shepherds on an Assyrian document and\non an Aramaic document and sealed the amount of silver with\nthe neck seals of the treasurer Nabû -qati-ṣ abat, the village man-\nager, and the scribe, with their neck seals (and) with the (royal)\nstamp seal, saying:“If they don’t pay this year, they will die!” But\nwhen a bribe was made, they cut off the stamp seals and their\nneck seals, and threw them away. Did they not cut them off\narbitrarily? Qurdî , the chariot driver of the treasury horses, is\ntreading on the authority of the palace. He has laid his hands on\nthe cone of Iš tar, saying: “Strike me! Let’s see (what happens)!\nBring me an iron knife, so I can cut it off and stick it in the\ngovernor’s ass!” I am unable to tell“what else” he has said about\neverybody” (Luukko, 2012). Rendered in 3D, our image’s highly\ntextured sections re ﬂect the evidentials (Kanchan, personal\ncommunication) and evidence used to support the complaints\n(see Fig. 8).\nEnglish as a global, modern language has its own repertoire of\nevidential devices. Users of English regard knowledge as factual\nmuch of the time, expressing it without overt evidential qualiﬁ-\ncation (Chafe, 1986, p. 271). Such a stance is reﬂected in the\nevidential value of an indicative sentence. A vast majority of\nsentences are in the“indicative mood”, and include a verb that\nmakes a statement of fact. Likewise, an evidential value is dis-\nplayed in phrases that mirror knowledge based on belief or opi-\nnion (Frajzyngier, 1985). But the grammatical encoding of\nevidentiality is not obligatory as has been documented most\nextensively for Native American, Amazonian, and Australian\nAboriginal languages. For English, scholars have used the term\n“evidentiality” in its broadest sense, as an attitude towards evi-\ndence and knowledge (Chafe,1986, p. 262) distinct from com-\npulsory evidentiality dictated by a language’s grammar. A ﬁnal\nprototype is based on a sample of American English, a section of a\n2004 US presidential debate analysed within the literature on\nlinguistic anthropology (Lempert and Silverstein, 2012, pp.\n147–160). The resulting image is characterised by the gentle\nundulation of its vaulted geometry. In theﬁrst 3 images above the\ncitation of information related by others via reported speech\nmarkers is shown as a blue highlight. The monochromeﬁnish of\nthis ﬁnal model reﬂects the absence of direct reported speech, in\nthis particular sample (see Fig.9).\nThe sample for each language was picked amongst uncountable\npossible others. Each model is unique and the chosen language\nsamples belong to a particular genre within a language, including\nnarrative, a letter to a king, and political rhetoric. Numerous\nother samples would have been equally valuable for this research.\nA guiding principles was the availability of a language sample in a\npublished or public format. We made sure our coding relied on\nanalyses by experts (Johanson and Utas, 2000; Bulut, 2000,\nAikhenvald, 2003, Kanchan personal communication, Lempert\nand Silverstein, 2012). Our research question speci ﬁcally\naddresses the possibility to model natural language in 3D.\nDebates about comparative grammar, and the comparison of\nevidential systems across languages belong to a different dis-\ncipline, cast in the language of linguists. Our models are tan-\ngential to such debates and ought to be appraised in their own\nright for their capacity to render a particular language sample\nin 3D.\n“Orthographic” projection is the most common method used to\ndisplay 3D objects, as 2D drawings of a top view, a front view and\na side view. This is the classic method architects use to draw plans.\nAn orthographic view is the usual projection of choice for dis-\nplaying visual representations of numeric datasets too (Tufte,\n2001, p. 9, 39, 43). We are used to seeing 2D graphs along anx-\nand y-axis, be it in weather or stock market charts. As we assigned\nnumerical values to the evidential weight of linguistic elements, we\ndid not wish to simply add a graph or an abstract 2D image to the\nexisting literature on evidentiality. Instead, we visualised evidential\nweight as a 3-dimensional geometric distortion, by assigning\n“different levels of value”\non thez-axis (Romanyshyn,1989, p. 41,\n43, 53). Moving away from a 2D representation of language,\nmeans that a dominant image is challenged: language as text laid\nout on a page. In the same vein, language no longer features as a\nlinguistic trace superimposed upon the surface of reality. In lieu of\nreality being “a solid globe upon the outer surface of which” (cf.\nIngold, 2017, p. 63) languages unfold, a“reality-effect” is digitally\nwoven in 3D. Barthes coined this term for modern textual devices\nFig. 8 Prototype of sample in the Neo-Assyrian dialect of Akkadian.Data\nsourced from cuneiform clay tablet (ca. 911–612 BC) in the British Museum\nCollection (Kanchan, personal communication).\nFig. 9 Prototype of sample in American English.Evidentiality is not\nconsidered a grammatical category in English and is optional.\nHUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS | https://doi.org/10.1057/s41599-022-01089-5 ARTICLE\nHUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS|            (2022) 9:72 | https://doi.org/10.1057/s41599-022-01089-5 7\nthat establish literary texts as realistic (Barthes,1989, p.141–148).\nWe borrow the term, but here“reality-effect” stands for language’s\n3D shape and interplay with perceptible reality, as strands of\nlanguage dock into perceptual anchor points. Meanwhile“place-\nholders” within discourse, such as evidentials, act as receptors for\nobservable phenomena in the social and material world. The\nconglomerate of a particular language sample and perceptible\nreality appears textile. 3D design reveals language “threaded\nthrough” or woven into observable reality as“an all-enveloping\ninfusion” (cf. Ingold,2017, pp. 53, 36), and“reality-effect”.\nThe results of this study are four prototypes, each documenting\na brief instance of language use. The shape of the model based on\nthe Kurdish sample allows a viewer to observe the regular\noccurrence of undulations throughout the model. This 3D pattern\nindicates a sustained presence of evidentials, whilst the equally\nprevalent blue highlights reveal reported speech, or directly cited\ninformation. In the model of the Amazonian language there are\ncrests in nearly every section of the 3D discursive structure. This\nshape reﬂects the fact that evidentials are obligatory in the\ngrammar of this language and occur in all the lines of the tran-\nscript. The characteristics of the geometry of the sample from an\nancient language, Akkadian are distinct too. Here, the middle\nsection of the narrative on the crimes of the citizens of Guzana is\nhighly textured with the blue highlights indicating a reliance on\nreported information. One can see how language is threaded\nthrough the perceptual evidence for the complaints addressed to\nthe king. Finally, the model based on American English stands\nout for its monochrome undulating waves and almost uniform\nshape. This result adheres to expectations since the transcript did\nnot include directly quoted material, which would have generated\nblue highlights. Also, English speakers are not obliged by gram-\nmatical rules to indicate the source of their information at all\ntimes, as is the case for Amazonian languages. Hence the less\ndramatic peaks and vales in this ﬁnal model. This signiﬁcant\ncontrast between the 3D models based on the Amazonian and\nEnglish language samples is a re ﬂection of this grammatical\ndivergence.\nEach 3D shape and model is of course unique, linked to a\nspeciﬁc and brief manifestation of a language. We would\nencourage our readers to look at the models again, whilst envi-\nsaging them as a“reality-effect”, a momentary fusion of language\nand observable reality. The unique shape of each prototype offers\na reminder of the diversity of reality-effects across languages and\npeoples. We often have the impression we can learn another\nlanguage through the principle of translation. The intricate nature\nof evidential systems is often lost in translation though. Especially\nif translation is based on the question“what does this mean?”,o r\n“how can I make myself understood?” The observation of the\nvisual clues in our prototypes goes some way towards answering a\nwider question about living a reality through another language.\nBrieﬂy entertaining the possibly of seeing oneself speaking\nKurdish, Akkadian, an Amazonian language or English now\nincludes a rare visual awareness of the reality-effect of each lan-\nguage. Language as an all-enveloping infusion isn’t just a concept.\nOur 3D models allow us to reveal the role of a distinct language as\na mould for conﬁgurations of the observable. This is the central\nmessage our study conveys.\nConclusions: natural language printed in 3D\nOur research question addressed the possibility to model an\naspect of natural language in 3D. This project reveals that it was\nthe development of advanced software for video animation that\nallows for a digital image of natural language to be woven in 3D.\nThe prototypes are both communicative and inquisitive. Their\nform was uncertain until they were created, at which point they\nrevealed the shape of each language sample designed in 3D. For\nus the “guide rails into the blindness of an as yet un-realised\ndimension” (Evans, 1997, p. 173) were made of 2 elements. The\nﬁrst element was the conversion of a hierarchy of evidential\nweights into a set of numbers by co-author, Alex Pillen. As a\nsecond element, co-author Emma-Kate Matthews developed the\nalgorithm or the instructions for the 3D software programme.\nLater the resulting 3D image was printed as a 3D object. Aﬁrst\n3D print of a stretch of language was made in strong andﬂexible\nNylon Plastic (PA12, Polyamide) to accentuate the textility of the\nmodel (see Fig.10a). To 3D print in nylon plastic, a bed of nylon\npowder is used to then sinter the powder with a laser layer by\nlayer, solidifying the powder through a process called“Selective\nLaser Sintering”. A second model was produced in a silver alloy\nselected as a softer, malleable metal and chosen for its ability to\nshowcase intricate details (see Fig. 10b). A later model was\ncommissioned to be made in a rubber-like material (not shown\nhere) to further accentuate the fabric-like nature of the prints. We\nawait the invention of new materials to be able to print further\ndigitally frozen linguistic shapes, in which the thickness of the\nindividual “linguistic ﬁbres” can be reduced further.\nThis project builds upon existing work within the history of\nparametric design and the study of evidentiality within linguistics\nand the anthropology of language. To lay out our contribution to\neach of theseﬁelds, we begin with design, notably the work of Frei\nOtto at the Institute for Lightweight Structures at the University\nof Stuttgart, who extrapolated the method of the architect Gaudí.\nDesigning with parametric models became a way of“form ﬁnd-\ning”, and Otto no longer relied on strings or weights. His method\nof formﬁnding included, amongst other things, minimal surfaces\nderived from soapﬁlms. If two soap bubbles come into contact,\nthey merge and a thinﬁlm is created in between them, a delicate\nlayer of liquid surrounded by air. Such soapﬁlms have been used\nas a model for 3D design (Otto and Rash,1996). Spline-based\ncomputation or 3D modelling has thus become a search space for\nthe projection of new forms (Hight, 2013, pp. 419–420). Our\nproject builds upon this legacy of formﬁnding and would be hard\nto imagine without references to Otto’s oeuvre. Natural forms can\nFig. 10 3D Prints of a Kurdish language sample.In nylon plastic (a), and a silver alloy placed on a reﬂective surface (b).\nARTICLE HUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS | https://doi.org/10.1057/s41599-022-01089-5\n8 HUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS|            (2022) 9:72 | https://doi.org/10.1057/s41599-022-01089-5\nbe transposed into digital format, a computer-generated 3D\nimage, which often leads to valuable new material objects or\nbuildings. Our research extends this remit to include source\nmaterial more ethereal than soapﬁlms, an ephemeral utterance or\nﬂeeting speech event (see Fig. 11). An age-old comparison of\ngeometry and natural language became the starting point for our\nparametric reasoning. Natural language is conceived as an\nabstract force, that brings visual and auditory observations\ntogether into a particular conﬁguration. We can now set up a\nformatted transcript as a space through which algorithms search\nto project its geometric shape in 3D.\nSecondly, we offer a critical reﬂection on our contribution to\nthe study of language and evidentiality. The prototypes’vaulted\ngeometries are a new mode of exploration of the time-honoured\ncomparison between grammar and geometry. Linguistic relativity\nand the language-speciﬁc role (Hymes,1966; Jakobson, 1985)o f\nan evidential function become concrete. The most elaborate and\nwell-documented evidential systems belong to endangered lan-\nguages in small-scale societies. In an era of rapid loss of linguistic\ndiversity (Walsh, 2005), language visualisation in 3D concerns\nlanguages that will not leave behind a written record, and whose\nevidential systems are often lost in translation. Besides, analyses\nby linguists document evidentiality for a given language, but are\nunlikely to reveal the pattern and dynamic deployment of an\nevidential function in real time as an utterance unfolds in situ.\nOne could question why we chose to focus on the history of\nparametric design as a starting point for our project. Indeed,\nother modelling techniques within architecture and design may\nbe relevant to study the architecture of natural language. The\nrationale for choosing parametric design methods is the follow-\ning. Parametric design, be it in Gaudí ’s architecture or con-\ntemporary software programmes is deﬁned by “parameters” that\nvary and can be easily adjusted. Parametric design underlies the\ndevelopment of contemporary software for video animation and\nﬁlm. Likewise, language is a ﬂuid system that is in constant\nmotion. Its grammatical features change from minute to minute.\nIn our study, a grammatical marker becomes a“parameter” that\naffects the other aspects of language in its immediate vicinity. The\nposition of grammatical elements in the elementary structure of\nlanguage— along the lines of the transcript— varies, as does their\neffect. A grammatical feature such as evidentiality is thereby\ndeﬁned as one “parameter” or variable that can be edited\naccording to the data-input, and given an evidential value. The\nother parameter that varies is the number of syllables in the line\nof a transcript. Within parametric design the relationship between\nelements is used to inform the design of complex structures. Here,\nthis concerns the dynamic relation between a grammatical\nelement and the surrounding structure of a language sample,\nwhich alters the resulting geometry. The“parametric” software\nwe used thus allowed us to both generate and visualise the\n“geometry of form principles ” (Jakobson,\n1981, pp. 76 –77)\ninherent in a transcript as language unfolds. For now, as this is\nuncharted territory, we have opted for displaying the language\nsamples as frozen in time, and limited our data-input to a brief\ntranscript for each language. The capacity of parametric design to\ngenerate moving images on the basis of rapidly changing para-\nmeters remains relevant though.\nWhat our project entails for research in the not too distant\nfuture remains an open question. We anticipate that larger\ndatasets could be imported, and that moving images of evolving\nshapes in natural language could be produced. Parametric design\nin architecture eventually led to contemporary 3D animation for\nvideos, games, andﬁlms. Likewise, our research trajectory leaves\nroom for future visualisations of the spatial dynamics of natural\nlanguages. We began with a single and concise grammatical\ncategory, evidentiality, but look forward to other 3D explorations\nof distinct languages. As mentioned earlier, evidentiality is part of\na wider category of ephemeral“placeholders” that constitute the\nspatial nature of language. Visualising the use of pronouns, of\nyou, she or we across spoken languages, or the equivalents ofthis\nand that in English with contemporary software for video ani-\nmation would equally be fascinating. Its complexity and scope\nleading to open questions for future research. We anticipate that\nthe development of algorithms on the basis of other grammatical\nfeatures, and use of large datasets, could shed light on language\ndynamics that remain overlooked or underresearched.\nWe also ought to question how such 3D visualisations con-\ntribute to our “knowledge” of the recorded language samples.\nSometimes visible patterns in nature can be modelled mathe-\nmatically. Let’s think for example about a spiralling shell of a\nsnail, the structure of the pineapple, or indeed bubbles and foam\nin the sea. High-dimensional forms in language and the patterns\nof grammar have evolved naturally in humans through use and\nrepetition over millennia. We designed a parametric image of the\n“reality-effect”, which theﬂow of language generates by means of\nevidentiality. It is the history of mathematics that has shown us\nthe signiﬁcance of the physical representation of concepts. It\nseemed difﬁcult to develop a correct imagination of complex\nmulti-dimensional surfaces, such as Boy ’s surface (Weisstein,\n2021), without having a model at hand which could be touched\nand rotated to understand its multiple faces simultaneously. For\nsuch essential geometries, a model— be it realised and observed,\nor only vividly imagined - was not a means to a pedagogical end,\nFig. 11 A fabric-like digital image of natural spoken language.As a 3D\n“text”, derived from the Latin for“woven” (textus).\nFig. 12 A nylon prototype made via the latest industrial type of 3D\nprinting (Multi Jet Fusion).Exhibits the ﬁne details of this Amazonian\nlanguage sample designed in 3D.\nHUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS | https://doi.org/10.1057/s41599-022-01089-5 ARTICLE\nHUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS|            (2022) 9:72 | https://doi.org/10.1057/s41599-022-01089-5 9\nbut played a role in the development of mathematics (Ording,\n2011). In comparison our task is limited but we equally ask what\nkind of “knowledge” our prototypes bring about.\nMathematical objects, an astronomer’s orrery, or the chemist’s\nmolecular model all engender“tacit knowledge”. Such knowledge\nis often a valid anticipation of their yet indeterminate implica-\ntions— of further understandings arrived at in the end (Polanyi,\n2009, p. 24). As we tried to grasp evidentiality in itsﬁgurative\nform based on spatial intuition we kept in mind this idea of“tacit\nknowledge”. The models’effect could not be produced by means\nof a typical drawing, a diagram, or notation on a page. The\nprototypes lead to additional knowledge in material form, an\nunspoken form of knowledge, which can be presented visually\n(see Fig. 12). To bring about such knowledge 3D printing of the\nmodels seemed essential. This was the most challenging and\narguably least successful aspect of our study. The majority of our\nmodels were rejected by the manufacturer. Their structure was\ntoo complex for current 3D printing techniques or the individual\nlinguistic ﬁbres were too thin. They would have simply melted\ntogether in the printer. Each 3D print we present here was pre-\nceded by half a dozen unsuccessful attempts. This process points\nat the limits of the scale of our study, and the level of detail that\ncan be meaningfully observed once the datasets are enlarged. For\nnow, we opted for short transcripts, but we are of course curious\nabout the potential visualisation of larger and more diverse\nsamples. It remains to be assessed whether a novel printing\ntechnique with new materials or video animation will be most\neffective to reveal the shape of large natural language samples.\nMany aspects of languages around the world can’t be translated\ninto English because the equivalent meaning and cultural fra-\nmework doesn’t exist. Likewise, it is not easy to translate evi-\ndential ﬁnesse from one language to another, unrelated language.\nEvidentiality features as a topic in comparative grammar and\nlinguistics, but is often secluded within technical treatises. By\ncontrast we are all familiar with the way fabrics behave, regardless\nof the languages we speak. The woven nature of the prototypes\nbuilds upon such familiarity and allows a tacit, non-explicit\nencounter with diverse language samples. The models and 3D\nprinted objects do not possess a particularly simple form, but\ntheir shape follows a general law that can be discerned, both by\nmeans of grammar and spatial intuition. Contemplating the 3D\nshape of a natural language sample differs from a linguist ’s\nexercise in analytical lucidity, and constitutes a form of tacit\nknowing of languages we may not speak.\nData availability\nData analysed during this study are included in this published\narticle, or can be accessed via the bibliography.\nReceived: 29 December 2020; Accepted: 16 February 2022;\nReferences\nAikhenvald AY (ed.) (2018) The Oxford handbook of evidentiality. Oxford Uni-\nversity Press, Oxford\nAikhenvald AY (2003) A grammar of Tariana, from Northwest Amazonia. Cam-\nbridge University Press, Cambridge\nAllen S (2000) Mapping the unmappable: On notation. In: Allen S, Agrest D,\nOstrow S (eds.) Practice: Architecture, technique and representation. Rou-\ntledge, London, pp. 30–45\nBarthes R (1989) The rustle of language. University of California Press, Berkeley,\nLos Angeles\nBoas F (1899) Anthropology. Science 9(212):93–96\nBoas F (1911) The handbook of American Indian languages. Government Printing\nOfﬁce, Washington\nBucholtz M (2000) The politics of transcription. J Pragmat 32:1439–1465\nBulut C (2000) Indirectivity in Kurmanci. In: Johanson L, Utas B (eds.) Evidentials,\nIranian and neighbouring languages. Mouton de Gruyter, Berlin, New York,\nNY, pp. 147–184\nBurry M (2007) Innovative aspects of the Colònia Güell Chapel project. In: Burry\nM (ed.) Gaudí unseen: Completing the Sagrada Família. Jovis, Berlin, pp.\n59–61\nBurry M (2011) Scripting cultures: Architectural design and programming. John\nWiley & Sons Ltd, Chichester\nCarroll JB, Levinson SC, Lee P (eds.) (2012) Language, thought, and reality:\nSelected writings of Benjamin Lee Whorf. MIT Press, Cambridge, MA\nCatalà C (2007) Gaudí, the geometer. In: Burry M (ed.) Gaudí unseen: Completing\nthe sagrada família. Jovis, Berlin, pp. 81–85\nChafe W (1986) Evidentiality in English conversation and academic writing. In:\nChafe W, Nichols J (eds.) Evidentiality: The linguistic coding of epistemology.\nAblex Publishing Corporation, Norwood, New Jersey, pp. 261–272\nDavis D (2013) A history of parametric. Available via https://\nwww.danieldavis.com/a-history-of-parametric/ Accessed 16 Feb 2022\nDemuro E, Gurney L (2021) Languages/languaging as worldmaking: The ontolo-\ngical bases of language. Lang Sci 83:1–13\nEvans R (1997) Translations from drawing to building and other essays. Archi-\ntectural Association Publications, London\nFanfani G, Harlow M, Nosch M (eds.) (2016) Spinning fates and the song of the\nloom: The use of textiles, clothing and cloth production as metaphor, symbol\nand narrative device in Greek and Latin literature. Oxbow Books, Oxford,\nHavertown, PA\nFeld S, Brenneis D (2004) Doing anthropology in sound. Am Ethnol 31(4):461–474\nFox B (2001) Evidentiality: Authority, responsibility and entitlement in English\nconversation. J Ling Anthropol 11:167–192\nFrajzyngier Z (1985) Truth and the indicative sentence. Stud Lang 9(2):243–254\nHeyman J (1995) The stone skeleton: Structural engineering of masonry archi-\ntecture. Cambridge University Press, Cambridge\nHight C (2013) Manners of working: Fabricating representation in digital based\ndesign. In: Crysler CG, Cairns SH, Heynen H (eds.) The SAGE handbook of\narchitectural theory. Sage Publications Ltd, Thousand Oaks, CA, pp. 410–429\nHill JH, Irvine JT (eds.) (1992) Responsibility and evidence in oral discourse.\nCambridge University Press, Cambridge\nHooke R (1675) A description of helioscopes, and some other instruments. Royal\nSociety, London\nHymes D (1966) Two types of linguistic relativity. In: Bright W (ed) Socio-\nlinguistics: Proceedings of the UCLA Sociolinguistics Conference 1964.\nMouton, The Hague, pp. 114–167\nHymes D (1982) Narrative form as a“grammar” of experience: Native Americans\nand a glimpse of English. J Educ 164(2):121–142\nHymes D (1994) Ethnopoetics, oral-formulaic theory, and editing texts. Oral Tradit\n9:330–370\nHymes D (2003) Now I only know so far: Essays in ethnopoetics. University of\nNebraska Press, Lincoln, London\nIngold T (2016) Lines: A brief history. Routledge, London, New York, NY\nIngold T (2017) Correspondences: Knowing from the inside. The University of\nAberdeen, Aberdeen\nJabi W (2013) Parametric design for architecture. Laurence King Publishing,\nLondon\nJakobson R (1968) The poetry of grammar and grammar of poetry. Lingua\n21:597–609\nJakobson R (1971a) Franz Boas ’ approach to language. In: Roman Jakobson\nselected writings II: Word and language. Mouton, The Hague, Paris, pp.\n477–488\nJakobson R (1971b) Shifters, verbal categories and the Russian verb. In: Roman\nJakobson selected writings II: Word and language. Mouton, The Hague, Paris,\npp. 130–147\nJakobson R (1981) Grammatika i geometrija (Грамматика и геометрия, grammar\nand geometry). In: Rudy S (ed.) Roman Jakobson selected writings III.\nMouton Publishers, The Hague, Paris, New York, pp. 75–78\nJakobson R (1985) Metalanguage as a linguistic problem. In: Rudy S (ed.) Roman\nJakobson selected writings VII: Contributions to comparative mythology.\nStudies in linguistics and philology, 1972-1982. De Gruyter Mouton, The\nHague, pp. 113–121\nJohanson L, Utas B (eds.) (2000) Evidentials: Turkic, Iranian and neighbouring\nlanguages. Mouton de Gruyter, Berlin, New York, NY\nJohnstone B (1990) Stories, communities, and place: Narratives from middle\nAmerica. Indiana University Press, Bloomington\nKanchan C (2018) Empire’s inner theatre: Interiority and power during the Neo-\nAssyrian period, c. 750-650 BC. Dissertation, University College London\nKuipers J (2013) Evidence and authority in ethnographic and linguistic perspective.\nAnn Rev Anthropol 42:399–413\nLempert M, Silverstein M (2012) Creatures of politics: Media, message, and the\nAmerican presidency. Indiana University Press, Bloomington,Indianapolis\nARTICLE HUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS | https://doi.org/10.1057/s41599-022-01089-5\n10 HUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS|            (2022) 9:72 | https://doi.org/10.1057/s41599-022-01089-5\nLuukko M (2012) Crimes of Guzana. Available via the Open Richly Annotated\nCuneiform Corpus. http://oracc.org/saao/P313461/ accessed 16 Feb 2022\nMatthews EK (2017) The Architectural instrumentalist: Exploring spatio-temporal\ninterdependence in the composition of performed music and architectural\nspace. Design Ecol 6:35–60\nNagy G (2017) On weaving and sewing as metaphors for ancient Greek verbal arts.\nClassical inquiries. Studies on the ancient world from Centre for Hellenic Studies,\nHarvard University. Available viahttps://classical-inquiries.chs.harvard.edu/on-\nweaving-and-sewing-as-metaphors-for-ancient-greek-verbal-arts/Accessed 16\nFeb 2022\nOrding P (2011) Mathematical objects. Cabinet 41:51–55\nOtto F, Rasch B (1996) Finding form: Towards an architecture of the minimal. Axel\nMenges, Stuttgart\nParpola S (1978) British Museum Collection, excavated at Nineveh (modern\nKuyunjik), Primary Publication CT53, 046, CDLI no. P313461. Available via\nhttps://cdli.ucla.edu/search/search_results.php?\nSearchMode=Text&ObjectID=P313461, and https://cdli.ucla.edu/dl/lineart/\nP313461_l.jpg Accessed 16 Feb 2022\nPillen A (2017) The space that will never beﬁlled: Sharp communication and the\nsimultaneity of opposites. Curr Anthropol 58(6):718–738\nPolanyi M (2009) The tacit dimension. The University of Chicago Press, Chicago,\nLondon\nPort RF (2010) Language as a social institution: Why phonemes and words do not\nlive in the brain. Ecol Psychol 22:304–326\nRomanyshyn RD (1989) Technology as symptom and dream. Routledge, London\nSchieffelin BB, Woolard KA, Kroskrity PV (eds.) (1998) Language ideologies:\nPractice and theory. Oxford University Press, Oxford\nTufte ER (2001) The visual display of quantitative information. Graphics Press\nLLC, Cheshire\nWalsh M (2005) Will indigenous languages survive? Ann Rev Anthropol\n34:293–315\nWeisstein EW (2021) Boy surface. In: MathWorld - A Wolfram web resource.\nAvailable via https://mathworld.wolfram.com/BoySurface.html Accessed 16\nFeb 2022\nAcknowledgements\nSpecial thanks to Alexandra Aikhenvald for pointing out relevant Amazonian data, and\nto Chaitanya Kanchan for the selection and coding of the Akkadian language sample. We\nalso would like to acknowledge reviews by the anthropologists Aeron O’Connor, Liz Fox,\nIzzy Gibbin, Joe Buckley, Natalie Marshall and Denisa Botescu. Earlier drafts of this\npaper were presented at the UCL Multimedia Anthropology Postgraduate Lab and the\nDepartmental Seminar of the Institute of Social and Cultural Anthropology, University of\nOxford. At the Bartlett School of Architecture, University College London, we thank\nYeoryia Manolopoulou, for the ongoing support and stimulating conversation around\nthe topic. Stephen Colvin, Professor of Classics and Historical Linguistics at University\nCollege London gave us valuable advice. David Parkin, Department of Anthropology,\nUniversity of Oxford and Don Brenneis, University of California Santa Cruz supported\nour development of an anthropology of language at University College London. iMa-\nterialise in Leuven, Belgium, Shapeways UK and 3dPrintDirect UK manufactured the 3D\nprinted models. Photographs by Quentin Argenti. This research was funded by the\nBritish Academy (Grant No. MD160019).\nCompeting interests\nThe authors declare no competing interests\nEthical approval\nThis project is exempt from the requirement of approval by the UCL Ethics Committee.\nInformed consent\nInformed consent is not relevant to this study.\nAdditional information\nCorrespondence and requests for materials should be addressed to Alex Pillen.\nReprints and permission informationis available athttp://www.nature.com/reprints\nPublisher’s noteSpringer Nature remains neutral with regard to jurisdictional claims in\npublished maps and institutional afﬁliations.\nOpen Access This article is licensed under a Creative Commons\nAttribution 4.0 International License, which permits use, sharing,\nadaptation, distribution and reproduction in any medium or format, as long as you give\nappropriate credit to the original author(s) and the source, provide a link to the Creative\nCommons license, and indicate if changes were made. The images or other third party\nmaterial in this article are included in the article’s Creative Commons license, unless\nindicated otherwise in a credit line to the material. If material is not included in the\narticle’s Creative Commons license and your intended use is not permitted by statutory\nregulation or exceeds the permitted use, you will need to obtain permission directly from\nthe copyright holder. To view a copy of this license, visithttp://creativecommons.org/\nlicenses/by/4.0/.\n© The Author(s) 2022\nHUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS | https://doi.org/10.1057/s41599-022-01089-5 ARTICLE\nHUMANITIES AND SOCIAL SCIENCES COMMUNICATIONS|            (2022) 9:72 | https://doi.org/10.1057/s41599-022-01089-5 11"
}