{
    "title": "The Comparison Performance of Digital Forensic Tools Using Additional Root Access Options",
    "url": "https://openalex.org/W4214739301",
    "year": 2022,
    "authors": [
        {
            "id": "https://openalex.org/A5052485148",
            "name": "Aljo Leonardo",
            "affiliations": [
                "Universitas Amikom Yogyakarta",
                "Universitas Respati Yogyakarta"
            ]
        },
        {
            "id": "https://openalex.org/A5031212480",
            "name": "Rini Indrayani",
            "affiliations": [
                "Universitas Amikom Yogyakarta",
                "Universitas Respati Yogyakarta"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2982242325",
        "https://openalex.org/W2904756156",
        "https://openalex.org/W2997836625",
        "https://openalex.org/W2994330438",
        "https://openalex.org/W2884079571",
        "https://openalex.org/W2910840874",
        "https://openalex.org/W3012052223",
        "https://openalex.org/W2911739881",
        "https://openalex.org/W2763460207",
        "https://openalex.org/W3016872658",
        "https://openalex.org/W2941988636",
        "https://openalex.org/W3137335628",
        "https://openalex.org/W2926186299",
        "https://openalex.org/W3122365125",
        "https://openalex.org/W3093759093",
        "https://openalex.org/W2807831048",
        "https://openalex.org/W3044564311",
        "https://openalex.org/W3129453524",
        "https://openalex.org/W3147646780",
        "https://openalex.org/W2803855696",
        "https://openalex.org/W3122178952",
        "https://openalex.org/W2946934272",
        "https://openalex.org/W3003867073",
        "https://openalex.org/W2942374856",
        "https://openalex.org/W2990925386",
        "https://openalex.org/W3038126843",
        "https://openalex.org/W2980390299",
        "https://openalex.org/W2954272346",
        "https://openalex.org/W2768361425",
        "https://openalex.org/W2907516871",
        "https://openalex.org/W3049102544",
        "https://openalex.org/W2911386828",
        "https://openalex.org/W3139534033",
        "https://openalex.org/W3049174507",
        "https://openalex.org/W3081209775",
        "https://openalex.org/W3004228036",
        "https://openalex.org/W3107110976",
        "https://openalex.org/W2515876520",
        "https://openalex.org/W2924675185",
        "https://openalex.org/W3082766747",
        "https://openalex.org/W2805981793",
        "https://openalex.org/W2958740544",
        "https://openalex.org/W3170947218",
        "https://openalex.org/W3008603700",
        "https://openalex.org/W3087768853",
        "https://openalex.org/W3163284159",
        "https://openalex.org/W2906412882",
        "https://openalex.org/W2937617582",
        "https://openalex.org/W3012281215",
        "https://openalex.org/W2910913185",
        "https://openalex.org/W2909832217",
        "https://openalex.org/W3003346669",
        "https://openalex.org/W2983663702",
        "https://openalex.org/W2962385157",
        "https://openalex.org/W3016801056",
        "https://openalex.org/W2754545654",
        "https://openalex.org/W2954186579",
        "https://openalex.org/W3017973008",
        "https://openalex.org/W2958385189",
        "https://openalex.org/W3125001077"
    ],
    "abstract": "This research used MiChat and SayHi as materials for forensic investigations using three different tools, namely MOBILedit, Magnet Axiom, and Belkasoft. These three tools will show each performance in the forensic process. We also added a rooting process as an option if data cannot be extracted optimally even when using these three applications. The result of this study shows that the cases studied with processes without root access and with root access have the aim of complementing each other in obtaining evidence. So that these two processes complement each other's shortcomings. The main contribution of this research is a recommendation of a tool based on the best performance shown during the forensic process with rooting access and without rooting access. Based on the comparison, Magnet Axiom is superior with a total of 34 items of data found without root access, while MOBILedit is 30 items and 30 items for Belkasoft. While comparison using root access, Magnet Axiom and MOBILedit are superiors with a total of 36 items found in Magnet Axiom without root access, while MOBILedit is 36 items and 33 items for Belkasoft. Based on the test results, it can be concluded that the recommended tool according to the used scenario is Magnet Axiom.",
    "full_text": "Jurnal Ilmiah Teknik Elektro Komputer dan Informatika (JITEKI) \nVol. 7, No. 3, December 2021, pp. 512-521 \nISSN: 2338-3070, DOI: 10.26555/jiteki.v7i3.22381  512 \n \n \nJournal homepage: http://journal.uad.ac.id/index.php/JITEKI Email: jiteki@ee.uad.ac.id \n \nThe Comparison Performance of Digital Forensic Tools Using \nAdditional Root Access Options \n \nAljo Leonardo, Rini Indrayani \nFaculty of Computer Science, Universitas AMIKOM Yogyakarta , Yogyakarta, 55283, Indonesia \n \nARTICLE INFO  ABSTRACT \nArticle history: \nReceived December 06, 2021 \nRevised December 27, 2021 \nAccepted January 19, 2022 \n \n This research used MiChat and SayHi as materials for forensic investigations \nusing three different tools, namely MOBILedit, Magnet Axiom, and \nBelkasoft. These three tools will sho w each performance in the forensic \nprocess. We also added a rooting process as an option if data cannot be \nextracted optimally even when using these three applications. The result of \nthis study shows that the cases studied with processes without root access and \nwith root access have the aim of complementing each other in obtaining \nevidence. So that these two processes complement each other's shortcomings. \nThe main contribution of this research is a recommendation of a tool based \non the best performance show n during the forensic process with rooting \naccess and without rooting access. Based on the comparison, Magnet Axiom \nis superior with a total of 34 items of data found without root access, while \nMOBILedit is 30 items and 30 items for Belkasoft. While comparison using \nroot access, Magnet Axiom and MOBILedit are superiors with a total of 36 \nitems found in Magnet Axiom without root access, while MOBILedit is 36 \nitems and 33 items for Belkasoft. Based on the test results, it can be concluded \nthat the recommended tool according to the used scenario is Magnet Axiom. \nKeywords: \nMobile Phone; \nForensic; \nMiChat; \nSayHi Chat; \nRoot; \nDigital Evidence \nThis work is licensed under a Creative Commons Attribution -Share Alike 4.0 \n \nCorresponding Author: \nRini Indrayani, Universitas AMIKOM Yogyakarta, Yogyakarta, Indonesia  \nEmail: rini.i@amikom.ac.id \n \n1. INTRODUCTION  \nThe rapid development of technology affects almost all aspects of human life [1][2]. The application of \ntechnology with the latest updates is widely used in daily life [3]. One of the applications of technology that is \nfrequently used in human life is communication technology, especially mobile phones  [4][5]. Humans in \ncommunicating with each other are now very dependent on technology ranging from daily conversations to \nexchanging data and documents via mobile phones [6][7]. Mobile phones are now one of the most important \nvariables in future technology infrastructure [8]. Mobile phones now contain applications that are usually run \non desktop-based devices, thus increasing human dependence on mobile phones [9]. This dependence makes \ncommunication technology application manufacturers busy in producing applications. One type of product that \nis widely developed is a chat service application [10][11]. \nChat service applications can meet  human communication needs from the most basic communication \nneeds to communication needs at a higher level [12][13]. Basic communication needs such as voice telephone \nconversations and messaging  [14]. Meanwhile, communication needs at a higher level , such as sending \ndocuments that are integrated with other services and supported by security technologies such as cryptographic \nfunctions [15]. Various communication technology companies issue chat service application products, \nincluding Telegram, Whatsapp, Line, SayHi Chat, MiChat, and various other chat service products. Each \nproduct comes with the advantages of each feature  [16]. However, along with the convenience and \ncompleteness of the services provided, these various chat service products are often used as a medium for \ncriminal acts [17]. \nVarious criminal transactions such as child sexual abuse material  often occur using chat application \nservices [18][19]. Also, an application that is often in the spotlight is MiChat, which is often being a medium \n\nISSN 2338-3070 Jurnal Ilmiah Teknik Elektro Komputer dan Informatika (JITEKI)               513 \n Vol. 7, No. 3, December 2021, pp. 512-521 \n \n \nThe Comparison Performance of Digital Forensic Tools Using Additional Root Access Options (Aljo Leonardo) \nfor prostitution transactions [20]. Dating apps are also one of the digital platforms that are often the object of \npolice investigations [21], one application that is often in the spotlight is SayHi Chat, which is often being a \nmedium for online prostitution  [22]. Disclosure of prostitution cases by involving chat application media \nusually utilizes the digital forensic investigation process because sometimes perpetrators delete data to \neliminate digital evidence [20]. \nThe digital forensics investigation process can help the competent authorities to collect case evidence that \nwould normally have been removed from the data history [23][24][25][26][27]. All forensic procedures are \ncarried out with prudence and documented [28][29][30]. Various studies regarding the digital forensic \ninvestigation process on chat application services have been carried out before. One of them is research on law \nenforcement investigations with a forensic approach on the WhatsApp instant messaging application [15]. The \nforensic approach carried out is related to wiretapping, database decryption, and analysis of WhatsApp \napplication communication. This study also uses a test scenario for objective verifica tion of the results. The \nresult of this research is a recommendation of wiretapping methods that can be used by the authorities for the \nneeds of law enforcement investigations. \nA study about the forensic investigation of conversations in an Instagram application has also been carried \nout by [31]. This study compares the performance of Oxygen Forensics tools with Magnet Axiom in data \nextraction performance using the National Institute of Standards and Technology (NIST) method. The results \nof this study indicate that the performance of Magnet Axiom is superior with a performance percentage of \n100% and axiom magnets by 84%. \nForensic analysis of telegram and BBM instant messenger applications has also been carried out by [32]. \nEncrypted data contained in the telegram and BBM applications is extracted and then analyzed for investigative \npurposes. The encryption method found in the investigation process is SQL encryption. After successful data \nextraction, the data is decrypted with a certain protocol for being analyzed as digital evidence  [33]. Forensic \nanalysis of IM applicat ion's encrypted data was also carried out by [34]. This research uses the Wickr and \nPrivate Text Messaging forensic object. The result of this research is a protocol for decrypting the extracted \ndata from the forensic process on Wickr and Private Text Messaging platforms. \nThis research follows some basic forensic concepts that are also used by several previous studies, but we \nuse different platforms for the forensic process. We used MiChat and SayHi as materials for forensic \ninvestigations using 3 different tools, namely MOBILedit, Magnet Axiom, and Belkasoft. These three tools \nwill show each performance in the forensic process. We also added a rooting process as an option if data cannot \nbe extracted optimally even when using these three applications. The main contribution of this research is a \nrecommendation of a tool based on the best performance shown during the forensic process with rooting access \nand without rooting access. \n \n2. METHOD  \nThis study obtains information and analyzes the evidence by using the NIJ (National Institute of Justice) \nmethod. The stages of the method include the preparation stage, collection, examination, analysis, and reporting \n[20]. \n1. Preparation – Gathering information or issues to be raised, as well as preparing tools and materials to \nbe analyzed for investigation purposes [35]. \n2. Collection – Collection of physical evidence (smartphone). \n3. Examination – The process of extracting or acquiring data [36]. \n4. Analysis – The process of analyzing the extracted or acquired data [37]. \n5. Reporting – The final stage is to make a report  on the final results of the investigation and analysis \nthat has been carried out [38]. \nThe data extraction process at the examination stage utilizes the live forensic method  where researchers \ntry to carry out the extraction or acquisition process of digital evidence [39][40][41]. It is stored on smartphones \nthat have the MiChat and SayHi Chat applications installed. Extraction using MOBILedit Forensic Express \nPRO, Belkasoft Ev idence Center, and Magnet Axiom tools. The extracted data is used as material for the \nanalysis process. Data extraction is divided into three types based on the character of the data that can be \ncollected. They are logical, file system, and physical. Logical data extraction is the fastest and most supported \ndata extraction by any mobile phone [42]. Logical extraction can load data such as SMS & MMS, Call Logs, \nContacts, Media, and application data. Data file system extraction is a data extraction that can be done by \nexaminers to thoroughly examine the file system on the smartphone, not only data snippets but system files as \nwell [43][44]. This file system extraction can contain SMS & MMS, call logs, contacts, media, application \ndata, and all files (including hidden data, database, system, and logs). Physical data extraction is the most \ndetailed and extensive method. Physical extraction can contain SMS & MMS, call logs, contacts, media, \napplication data, all files (including hidden data, database, system, and logs), temporal data, and deleted data. \n514 Jurnal Ilmiah Teknik Elektro Komputer dan Informatika (JITEKI) ISSN 2338-3070 \n Vol. 7, No. 3, December 2021, pp. 512-521 \n \n \nThe Comparison Performance of Digital Forensic Tools Using Additional Root Access Options (Aljo Leonardo) \n \n2.1. Preparation (Identification) \nThe preparation stage was the stage where the researchers prepared some materials and tools for forensic \nprocess purposes [45]. The prepared items are mentioned as \n1) Laptop Acer Aspire E 14 E5-475G-70XV \n2) Smartphone Samsung Galaxy GT-19060 \n3) MOBILedit Forensics Express Pro Version 7.3.1.19798 (64-bit) \n4) Belkasoft Evidence Center version 9.9800.4928 \n5) Magnet Axiom version 4.10.0.23663 \n6) Oxygen Forensic Detective version 12.0.0.151 \n7) MiChat App version 1.3.149 \n8) SayHi Chat Application Version 8.33 \n9) Forensic Connector App \n10) iRoot for PC version 1.8.9.21144 \n11) USB Cable \n \n2.2. Collection \nThe collection stage is the stage where the researcher investigates to collect the form of physical evidence \nand documentation [46]. This study used the Samsung Galaxy Duos GT-19060 version of Android 4.2.2 as the \nphysical evidence, shown in Fig. 1. Physical device basic information of used physical evidence are explained \nin Table 1. \n \nFig. 1. Physical Evidence \n \nTable 1. Physical Device Basic Information \nNo. Information Item Description \n1 Manufacturer  Samsung \n2 Product GT-19060 \n3 HW Revision JDQ39 \n4 Platform Android \n5 SW Revision 4.2.2 (17) \n6 Serial Number  RF1F61SQQKB \n7 Unlocking Pattern 0124678 \n8 IMEI 352700062003099 \n9 Rooted  Yes/No* \n10 SIM Card Yes/No* \n11 Operator  MCC:510, MNC:10 \n \nWe use a scenario as a reference for the investigation process. A scenario in general investigative research \nis used to parameterize a unique indiv idual pattern [47][48]. This scena rio was carried out on the Samsung \nGalaxy GT -1960 Smartphone as the property of the perpetrators of online prostitution transactions. This \nresearch scenario positions the perpetrators to try to eliminate evidence of transactions by deleting conversation \nhistory and data from the MiChat and SayHi applications as online transaction media. The investigative process \nof this research seeks to uncover digital evidence that has been deleted using digital forensic protocols. \n \n2.3. Examination \nThe examination stage is th e stage where the researchers carried out several investigative processes to \nfind and retrieve the database from the MiChat application and SayHi Chat application. The examination stage \n\nISSN 2338-3070 Jurnal Ilmiah Teknik Elektro Komputer dan Informatika (JITEKI)               515 \n Vol. 7, No. 3, December 2021, pp. 512-521 \n \n \nThe Comparison Performance of Digital Forensic Tools Using Additional Root Access Options (Aljo Leonardo) \nhas an imaging process that occurs where the original data of the andr oid phone is copied for being analyzed \nin the next process  [49][50]. The imaging process is very important to maintain data integrity [51][52][53]. \nThe results of the examination process were analyzed to find the digita l evidence [54][55][56]. Researchers \nuse two options in the examination process, namely the process without rooting and the process with rooting  \n[57]. If the process without root access cannot find data from MiChat and SayHi Chat, then the device is rooted. \nSeveral stages of the process are carried out using three tools, namely MOBILedit, Magnet Axiom, and \nBelkasoft Evidence Center. The extraction process or data acquisition is divided into two, namely , without \nrooting and using root access, shown in Fig. 2, Fig. 3, Fig. 4, and Fig. 5. \n \n \nFig. 2. Examination process using MOBILedit without rooting \n \n \nFig. 3. Examination process using Magnet Axiom without rooting \n \n \nFig. 4. Examination process using Belkasoft without rooting \n\n516 Jurnal Ilmiah Teknik Elektro Komputer dan Informatika (JITEKI) ISSN 2338-3070 \n Vol. 7, No. 3, December 2021, pp. 512-521 \n \n \nThe Comparison Performance of Digital Forensic Tools Using Additional Root Access Options (Aljo Leonardo) \n \nFig. 5. Examination process with root access \n2.4. Analysis \nThe Analysis stage has the goal to carry out analytical actions and reveal the results of the examination \nstage [58][59]. In this stage, the researcher tried to analyze all the data that has been successfully acquired \npreviously, which has a connection with the MiChat and SayHi Chat applications. All data found are connected. \nCompleteness between contact data, avatars, conversation activities, multimedia files, and other data are \nassociated with each other. If the results of the analysis show that there are indications of data deletion and it \nis not revealed using a process without root, then proceed with the analysis process using the root process. The \nanalysis process is carried out by matching metadata, shown in Fig. 6. \n \nFig. 6. Metadata Matching Process from Data \n \n2.5. Reporting \nThe reporting stage is the result of the previous analysis that has been carried out on the MiChat and \nSayHi Chat analysis investigation process. All stages of the analysis were carried out reported at the reporting \nstage. The researcher explained in detail all the result sets and compared all the results of the analysis that has \nbeen carried out starting from the analysis without rooting access to the analysis using rooting access. \n \n3. RESULTS AND DISCUSSION  \nThe forensic process is an attempt to uncover digital evidence as much as possible  [60]. Therefore, the \nvarious processes needed are expected to support each other. If one process cannot solve a problem, then \nanother additional process is needed as long as it gets permission from t he competent authority and is under \napplicable regulations [61]. Usually, one process that is an additional option is the rooting process. In the \nprocess of investigating criminal cases, the forensic process as much as possible avoids the use of root access, \nbut if rooting is needed to complete the investigation process, the rooting process can be carried out by the \ncompetent authorities. The rooting process is the last option because the rooting process can open new security \nholes on the device [24]. \nTable 2 shows a comparison of the results of the analysis without rooting using MOBILedit. The data in \nthe table shows that almost all dat a in the SayHi Chat application can be extracted without having to use the \nrooting process. At the same time,  the data on the MiChat application cannot be extracted optimally by the \n\nISSN 2338-3070 Jurnal Ilmiah Teknik Elektro Komputer dan Informatika (JITEKI)               517 \n Vol. 7, No. 3, December 2021, pp. 512-521 \n \n \nThe Comparison Performance of Digital Forensic Tools Using Additional Root Access Options (Aljo Leonardo) \nprocess without rooting. Table 3 shows a comparison of the results of the analysis without rooting using Magnet \nAxiom. The data in the table shows that almost all data in the SayHi Chat application can be extracted without \nhaving to use the rooting process. In contrast, the data on the MiChat application cannot be extracted optimally \nby the process without rooting. Table 4 shows a comparison of the results of the analysis without rooting using \nBelkasoft. The data in the table shows that almost all data in the SayHi Chat application can be extracted \nwithout having to use the rooting process. In comparison, the data on the MiChat application cannot be \nextracted optimally by the process without rooting. Based on the comparison of Table 2, Table 3, and Table 4, \nMagnet Axiom is superior with a total of 34 items of data found without root access, while MOBILedit is 30 \nitems, and 30 items for Belkasoft. \n \nTable 2. Comparison of Analysis Without Root Access in MOBILedit \nRevealed Data  Amount of Revealed \nData in MiChat \nAmount of Revealed \nData in SayHi Chat \nDatabase File 0 2 \nAccount Name 0 2 \nContact List 0 6 \nContact Number  0 0 \nChat Logs 0 18 \nLocation 0 1 \nDeleted Message 0 1 \nSuspect Avatar 0 0 \nClient Avatar 0 0 \nImage File 0 0 \nVideo File 0 0 \n \nTable 3. Comparison of Analysis Without Root Access in Magnet Axiom \nRevealed Data Amount of Revealed \nData in MiChat \nAmount of Revealed \nData in SayHi Chat \nDatabase File 0 4 \nAccount Name 0 2 \nContact List 0 6 \nContact Number  0 0 \nChat Logs 0 18 \nLocation 0 1 \nDeleted Message 0 1 \nSuspect Avatar 1 0 \nClient Avatar 1 0 \nImage File 0 1 \nVideo File 0 1 \n \nTable 4. Comparison of Analysis Without Root Access in Belkasoft \nRevealed Data Amount of Revealed \nData in MiChat \nAmount of Revealed \nData in SayHi Chat \nDatabase File 0 2 \nAccount Name 0 2 \nContact List 0 6 \nContact Number  0 0 \nChat Logs 0 18 \nLocation 0 1 \nDeleted Message 0 1 \nSuspect Avatar 0 0 \nClient Avatar 0 0 \nImage File 0 0 \nVideo File 0 0 \n518 Jurnal Ilmiah Teknik Elektro Komputer dan Informatika (JITEKI) ISSN 2338-3070 \n Vol. 7, No. 3, December 2021, pp. 512-521 \n \n \nThe Comparison Performance of Digital Forensic Tools Using Additional Root Access Options (Aljo Leonardo) \nTable 5 shows that using MOBILedit with root access. Data extraction can be more optimal in both the \nSayHi application and the Mi chat application. Table 6 shows that using Magnet Axiom with root access. Data \nextraction can be more optimal in both the SayHi application and the Mi chat application. Table 7 shows that \nusing Belkasoft with root access. Data extraction can be more optimal in both the SayHi application and the \nMiChat application. Based on the comparison of Table 5, Table 6, and Table 7, Magnet Axiom and MOBILedit \nare superiors with a total of 36 items found in Magnet Axiom without root access, while MOBILe dit is 36 \nitems and 33 items for Belkasoft. \n \nTable 5. Comparison of Analysis Using Root Access in MOBILedit \nRevealed Data Amount of Revealed \nData in MiChat \nAmount of Revealed \nData in SayHi Chat \nDatabase File 14 5 \nAccount Name 2 2 \nContact List 18 6 \nContact Number  2 0 \nChat Logs 17 18 \nLocation 1 1 \nDeleted Message 0 1 \nSuspect Avatar 0 1 \nClient Avatar 0 1 \nImage File 0 1 \nVideo File 0 0 \n \nTable 6. Comparison of Analysis Using Root Access in Magnet Axiom \nRevealed Data Amount of Revealed \nData in MiChat \nAmount of Revealed \nData in SayHi Chat \nDatabase File 13 6 \nAccount Name 2 2 \nContact List 18 6 \nContact Number  2 0 \nChat Logs 18 18 \nLocation 1 1 \nDeleted Message 1 1 \nSuspect Avatar 1 0 \nClient Avatar 1 0 \nImage File 0 1 \nVideo File 0 1 \n \nTable 7. Comparison of Analysis Using Root Access in Belkasoft \nRevealed Data Amount of Revealed \nData in MiChat \nAmount of Revealed \nData in SayHi Chat \nDatabase File 13 5 \nAccount Name 2 2 \nContact List 18 6 \nContact Number  2 0 \nChat Logs 18 18 \nLocation 1 1 \nDeleted Message 1 1 \nSuspect Avatar 0 0 \nClient Avatar 0 0 \nImage File 0 0 \nVideo File 0 0 \nISSN 2338-3070 Jurnal Ilmiah Teknik Elektro Komputer dan Informatika (JITEKI)               519 \n Vol. 7, No. 3, December 2021, pp. 512-521 \n \n \nThe Comparison Performance of Digital Forensic Tools Using Additional Root Access Options (Aljo Leonardo) \n4. CONCLUSION \nBased on the results without root access, MiChat managed to find evidence in the form of 2 avatars and \ncan only be found using the Magnet Axiom tool. While the result s for SayHi Chat on MOBILedit, Magnet \nAxiom, and Belkasoft managed to findings in the form of evidence of database files, conversation activities, \nand other evidence information. Meanwhile, specifically for Axiom Magnet tools, authentic evidence was \nfound in the form of 1 picture (proof of transaction) and one video (proof of transaction). \nBased on the results through rooting access, MiChat managed to find evidence in the form of 2 avatars, \nand this can only be found using the Magnet Axiom tool. Other pieces of evidence were found in the form of \ndatabase files conversation activities accompanied by other supporting evidence. While the results for SayHi \nChat on MOBILedit, Magnet Axiom, and Belkasoft managed to get findings in the form of evidence of database \nfiles, conversation activities, and other evidence. Especially for Magnet Axiom tools, authentic evidence was \nfound in the form of an image file (proof of transaction) and one video file (proof of transaction). Especially \nfor MOBILedit, you can find authen tic evidence in the form of 1 image file and two avatars of suspect and \nclient accounts. \nThe SayHi Chat evidence obtained through root access is more complete , and in more detail regarding \nthe evidence obtained, it is different when without root access. Wh ile more evidence of MiChat was found \nwhen it was done with the smartphone rooting process. This is because the cases studied with processes without \nroot access and root access have the aim of complementing each other in obtaining evidence. So that these two \nprocesses complement each other's shortcomings , b ased on the test results, it can be concluded that the \nrecommended tool according to the used scenario is Magnet Axiom. \n \nREFERENCES \n[1] A. Okutan and Y. Çebi, “A Framework for Cyber Crime Investigation,” Procedia Comput. Sci., vol. 158, pp. 287–\n294, Jan. 2019. https://doi.org/10.1016/j.procs.2019.09.054 \n[2] Q. Do, B. Martini, and K. K. R. Choo, “The role of the adversary model in applied security research,” Comput. Secur., \nvol. 81, pp. 156–181, Mar. 2019. https://doi.org/10.1016/j.cose.2018.12.002 \n[3] M. M. Singh and A. A. Bakar, “A Systemic Cybercrime Stakeholders Architectural Model,” Procedia Comput. Sci., \nvol. 161, pp. 1147–1155, Jan. 2019. https://doi.org/10.1016/J.PROCS.2019.11.227 \n[4] U. Hur, M. Park, G. Kim, Y. Park, I. Lee, and J. Kim, “Data acquisition methods using backup data decryption of \nSony smartphones,” Digit. Investig., vol. 31, p. 200890, Dec. 2019. https://doi.org/10.1016/j.fsidi.2019.200890  \n[5] X. Lin, T. Chen, T. Zhu, K. Yang, and F. Wei, “Automated forensic analysis of mobile applications on Android \ndevices,” Digit. Investig., vol. 26, pp. S59–S66, 2018. https://doi.org/10.1016/j.diin.2018.04.012 \n[6] M. Rath, B. Pati, and B. K. Pattanayak, “An Overview on Social Networking: Design, Issues, Emerging Trends, and \nSecurity,” Soc. Netw. Anal., pp. 21–47, Jan. 2019. https://doi.org/10.1016/B978-0-12-815458-8.00002-5 \n[7] M. Bas Seyyar and Z. J. M. H.  Geradts, “Privacy impact assessment in large-scale digital forensic investigations,” \nForensic Sci. Int. Digit. Investig., vol. 33, p. 200906, Jun. 2020. https://doi.org/10.1016/j.fsidi.2020.200906 \n[8] M. de Gruijter and C. J. de Poot, “Cognitive challenges at the crime scene: The importance of social science research \nwhen introducing mobile technologies at the crime scene,” Forensic Sci. Int., vol. 297, pp. e16 –e18, Apr. 2019. \nhttps://doi.org/10.1016/J.FORSCIINT.2019.01.026 \n[9] W. J. Buchanan, S. Chiale, and R. Macfarlane, “A methodology for the security evaluation within third-party Android \nMarketplaces,” Digit. Investig., vol. 23, pp. 88–98, 2017. https://doi.org/10.1016/j.diin.2017.10.002 \n[10] C. Hargreaves and A. Marshall, “SyncTriage: Using synchronisation artefacts to optimise acquisition order,” Digit. \nInvestig., vol. 28, pp. S134–S140, Apr. 2019. https://doi.org/10.1016/j.diin.2017.10.002 \n[11] C. M. S. Steel, E. Newman, S. O. Rourke, and E. Quayle, “Forensic Science International : Digital Investigation An \nintegrative review of historical technology and countermeasure usage trends in online child sexual exploitation \nmaterial offenders,” Forensic Sci. Int. Digit. Investig. , vol. 33, p. 300971, 2020.  \nhttps://doi.org/10.1016/j.fsidi.2020.300971 \n[12] J. Choi, J. Yu, S. Hyun, and H. Kim, “Digital forensic analysis of encrypted databas e files in instant messaging \napplications on Windows operating systems: Case study  with KakaoTalk, NateOn and QQ messenger,” Digit. \nInvestig., vol. 28, pp. S50–S59, Apr. 2019. https://doi.org/10.1016/j.diin.2019.01.011 \n[13] G. Cornelis, R. Seelt, and N. Le -khac, “Forensic Science International : Digital Investigation Forensic analysis of \nMatrix protocol and Riot . im application,” Forensic Sci. Int. Digit. Investig. , vol. 36, p. 301118, 2021.  \nhttps://doi.org/10.1016/j.fsidi.2021.301118 \n[14] M. Nicoletti and M. Ber naschi, “Forensic analysis of Microsoft Skype for Business,” Digit. Investig., vol. 29, pp. \n159–179, Jun. 2019. https://doi.org/10.1016/j.diin.2019.03.012 \n[15] D. Wijnberg and N. Le -khac, “Forensic Science International : Digital Investigation Identifying interception \npossibilities for WhatsApp communication,” Forensic Sci. Int. Digit. Investig. , vol. 38, p. 301132, 2021.  \nhttps://doi.org/10.1016/j.fsidi.2021.301132 \n[16] Y. C. Tok, C. Wang, and S. Chattopadhyay, “Stitcher: Correlating digital forensic evidence on i nternet-of-things \ndevices,” Forensic Sci. Int. Digit. Investig., vol. 35, p. 301071, Dec. 2020. https://doi.org/10.1016/j.fsidi.2020.301071 \n[17] J. Park, Y. H. Jang, and Y. Park, “New flash memory acquisition methods based on firmware update protocols for \nLG Android smartphones,” Digit. Investig., vol. 25, pp. 42–54, 2018. https://doi.org/10.1016/j.diin.2018.04.002 \n520 Jurnal Ilmiah Teknik Elektro Komputer dan Informatika (JITEKI) ISSN 2338-3070 \n Vol. 7, No. 3, December 2021, pp. 512-521 \n \n \nThe Comparison Performance of Digital Forensic Tools Using Additional Root Access Options (Aljo Leonardo) \n[18] H. Lee, T. Ermakova, V. Ververis, and B. Fabian, “Forensic Science International : Digital Investigation Detecting \nchild sexual abuse material : A comprehensive survey,” Forensic Sci. Int. Digit. Investig., vol. 34, p. 301022, 2020. \nhttps://doi.org/10.1016/j.fsidi.2020.301022 \n[19] C. H. Ngejane, J. H. P. Eloff, T. J. Sefara, and V. N. Marivate, “Forensic Science International : Digital Investigation \nDigital forensics supported by machine learning for the detection of online sexual predatory chats,” Forensic Sci. Int. \nDigit. Investig., vol. 36, p. 301109, 2021. https://doi.org/10.1016/j.fsidi.2021.301109 \n[20] K. Dwi, O. Mahendra, and I. K. Ari, “Digital Forensic Analysis of Michat Applications on Android as Digital Proof \nin Handling Online Prostitution Cases,”  vol. 9, no. 3, pp. 381 –390, 2021.  \nhttps://doi.org/10.24843/JLK.2021.v09.i03.p09 \n[21] N. Dwi, W. Cahyani, D. Ph, K. R. Choo, and D. Ph, “DIGITAL & MULTIMEDIA SCIENCES An Evidence-based \nForensic Taxonomy of Windows Phone Dating Apps,” no. 7, 2018.  \n https://doi.org/10.1111/1556-4029.13820 \n[22] A. Phan, K. Seigfried -Spellar, and K. -K. R. Choo, “Threaten me softly: A review of potential dating app risks,” \nComput. Hum. Behav. Reports, vol. 3, p. 100055, Jan. 2021. ttps://doi.org/10.1016/j.chbr.2021.100055 \n[23] E. Casey, “Mat uration of digital forensics,” Digit. Investig. , vol. 29, pp. A1 –A2, Jun. 2019.  \nhttps://doi.org/10.1016/j.diin.2019.05.002 \n[24] D. Kim and S. Lee, “Forensic Science International : Digital Investigation Study of identifying and managing the \npotential evidence for effective Android forensics,” Forensic Sci. Int. Digit. Investig. , vol. 33, p. 200897, 2019.  \nhttps://doi.org/10.1016/j.fsidi.2019.200897 \n[25] P. Mullan, C. Riess, and F. Freiling, “Forensic source identification using JPEG image headers: The case of \nsmartphones,” Digit. Investig., vol. 28, pp. S68–S76, Apr. 2019. https://doi.org/10.1016/j.diin.2019.01.016 \n[26] G. Horsman, “Digital Evi dence Certainty Descriptors (DECDs),” Forensic Sci. Int. Digit. Investig. , vol. 32, p. \n200896, Mar. 2020. https://doi.org/10.1016/j.fsidi.2019.200896 \n[27] E. Casey, “Strengthening trust: Integration of digital investigation and forensic science,” Forensic Sci. Int. Digit. \nInvestig., vol. 33, p. 301000, Jun. 2020. https://doi.org/10.1016/j.fsidi.2020.301000 \n[28] E. Gentry and M. Soltys, “SEAKER: A mobile digital forensics triage device,” Procedia Comput. Sci., vol. 159, pp. \n1652–1661, 2019. https://doi.org/10.1016/j.procs.2019.09.335 \n[29] R. O. Andrade and S. G. Yoo, “Cognitive security: A comprehensive study of cognitive science in cybersecurity,” J. \nInf. Secur. Appl., vol. 48, p. 102352, Oct. 2019. https://doi.org/10.1016/j.jisa.2019.06.008 \n[30] N. Akatyev and J. I. Jam es, “Evidence identification in IoT networks based on threat assessment,” Futur. Gener. \nComput. Syst., vol. 93, pp. 814–821, Apr. 2019. https://doi.org/10.1016/j.future.2017.10.012 \n[31] I. Riadi, A. Yudhana, M. Caesar, and F. Putra, “Forensic Tool Comparison on Instagram Digital Evidence Based on \nAndroid with The NIST Method,” vol. 5, no. 2, pp. 235–247, 2018. https://doi.org/10.15294/sji.v5i2.16545 \n[32] G. Kim, M. Park, S. Lee, Y. Park, I. Lee, and J. Kim, “Forensic Science International : Digital Investigation A study \non the decryption methods of telegram X and BBM-Enterprise databases in mobile and PC,” Forensic Sci. Int. Digit. \nInvestig., vol. 35, p. 300998, 2020. https://doi.org/10.1016/j.fsidi.2020.300998 \n[33] G. Horsman, “Formalising investigative decision making in digita l forensics: Proposing the Digital Evidence \nReporting and Decision Support (DERDS) framework,” Digit. Investig. , vol. 28, pp. 146 –151, Mar. 2019.  \nhttps://doi.org/10.1016/j.diin.2019.01.007 \n[34] G. Kim, S. Kim, M. Park, Y. Park, I. Lee, and J. Kim, “Forensic Science International : Digital Investigation Forensic \nanalysis of instant messaging apps : Decrypting Wickr and private text mess aging data,” Forensic Sci. Int. Digit. \nInvestig., vol. 37, p. 301138, 2021. https://doi.org/10.1016/j.fsidi.2021.301138 \n[35] T. Wu, F. Breitinger, and S. O’Shaughnessy, “Digital forensic tools: Recent advances and enhancing the status quo,” \nForensic Sci. Int. Digit. Investig., vol. 34, p. 300999, Sep. 2020. https://doi.org/10.1016/j.fsidi.2020.300999 \n[36] E. OliveiraJr, A. F. Zorzo, and C. V. Neu, “Towards a conceptual model for promoting digital forensics experiments,” \nForensic Sci. Int. Digit. Investig., vol. 35, p. 301014, Dec. 2020. https://doi.org/10.1016/j.fsidi.2020.301014 \n[37] G. Tully, N. Cohen, D. Compton, G. Davies, R. Isbell, and  T. Watson, “Quality standards for digital forensics: \nLearning from experience in England & Wales,” Forensic Sci. Int. Digit. Investig., vol. 32, p. 200905, Mar. 2020.  \nhttps://doi.org/10.1016/j.fsidi.2020.200905 \n[38] R. Yokota, Y. Hawai, K. Tsuchiya, D. Imoto, M. Hirabayashi, N. Akiba, H. Kakuda, K. Tanabe, M. Honma, and K. \nKurosawa, “A revisited visual-based geolocalization framework for forensic investigation support tools,” Forensic \nSci. Int. Digit. Investig., vol. 35, p. 301088, Dec. 2020. https://doi.org/10.1016/j.fsidi.2020.301088 \n[39] M. Guido, J. Buttner, and J. Grover, “Rapid differential forensic imaging of mobile devices,” DFRWS 2016 USA - \nProc. 16th Annu. USA Digit. Forensics Res. Conf. , vol. 18, pp. S46 –S54, 2016.  \nhttps://doi.org/10.1016/j.diin.2016.04.012 \n[40] C. Jin, R. Wang, and D. Yan, “Source smartphone identification by exploiting encoding characteristics of recorded \nspeech,” Digit. Investig., vol. 29, pp. 129–146, Jun. 2019. https://doi.org/10.1016/j.diin.2019.03.003 \n[41] M. Park, O. Yi, and J. Kim, “A methodology for the decryption of encrypted smartphone backup data on android \nplatform: A case study on the latest samsung smartphone backup system,” Forensic Sci. Int. Digit. Investig., vol. 35, \np. 301026, Dec. 2020. https://doi.org/10.1016/j.fsidi.2020.301026 \n[42] P. Feng, Q. Li, P. Zhang, and Z. Chen, “Logical acquisition method based on data migration for Android mobile \ndevices,” Digit. Investig., vol. 26, pp. 55–62, 2018. https://doi.org/10.1016/j.diin.2018.05.003 \n[43] J. Wagner, A. Rasin, K. Heart, R. Jacob, and J. Grier, “DB3F & DF-Toolkit: The Database Forensic File Format and \nthe Database Forensic Toolkit,” Digit. Investig. , vol. 29, pp. S42 –S50, Jul. 2019.  \nISSN 2338-3070 Jurnal Ilmiah Teknik Elektro Komputer dan Informatika (JITEKI)               521 \n Vol. 7, No. 3, December 2021, pp. 512-521 \n \n \nThe Comparison Performance of Digital Forensic Tools Using Additional Root Access Options (Aljo Leonardo) \nhttps://doi.org/10.1016/j.diin.2019.04.010 \n[44] A. Fukami, R. Stoykova, and Z. Geradts, “A new model for forensic data extraction from encrypted mobile devices,” \nForensic Sci. Int. Digit. Investig., vol. 38, p. 301169, 2021. https://doi.org/10.1016/j.fsidi.2021.301169 \n[45] L. F. Sikos, “Packet analysis for network forensics: A comprehensive survey,” Forensic Sci. Int. Digit. Investig., vol. \n32, p. 200892, Mar. 2020. https://doi.org/10.1016/j.fsidi.2019.200892 \n[46] G. Horsman and N. Sunde, “Part 1: The need for peer review in digital forensics,” Forensic Sci. Int. Digit. Investig., \nvol. 35, p. 301062, Dec. 2020. https://doi.org/10.1016/j.fsidi.2020.301062 \n[47] T. Holt and D. S. Dolliver, “Forensic Science International : Digital Investigation Exploring digital evidence \nrecognition among front-line law enforcement of fi cers at fatal crash scenes,” Forensic Sci. Int. Digit. Investig., vol. \n37, p. 301167, 2021. https://doi.org/10.1016/j.fsidi.2021.301167 \n[48] K. Opasiak and W. Mazurczyk, “(In)Secure Android Debugging: Security analysis and le ssons learned,” Comput. \nSecur., vol. 82, pp. 80–98, May 2019. https://doi.org/10.1016/j.cose.2018.12.010 \n[49] E. Casey, “Interrelations between digital investigation and forensic science,” Digit. Investig., vol. 28, pp. A1 –A2, \nMar. 2019. https://doi.org/10.1016/j.diin.2019.03.008 \n[50] D. Mothi, H. Janicke, and I. Wagner, “A novel principle to validate digital forensic models,” Forensic Sci. Int. Digit. \nInvestig., vol. 33, p. 200904, Jun. 2020. https://doi.org/10.1016/j.fsidi.2020.200904 \n[51] R. M. Carew and D. Errickson, “Imaging in forensic science: Five years on,” J. Forensic Radiol. Imaging, vol. 16, \npp. 24–33, Mar. 2019. https://doi.org/10.1016/j.jofri.2019.01.002 \n[52] T. Latzo, R. Palutke, and F. Freiling, “A universal taxonomy and survey of forensic memory acquisition techniques,” \nDigit. Investig., vol. 28, pp. 56–69, Mar. 2019. https://doi.org/10.1016/j.diin.2019.01.001 \n[53] G. Singh and K. Sin gh, “Digital image forensic approach based on the second -order statistical analysis of CFA \nartifacts,” Forensic Sci. Int. Digit. Investig. , vol. 32, p. 200899, Mar. 2020.  \nhttps://doi.org/10.1016/j.fsidi.2019.200899 \n[54] R. M. A. Mohammad, “An Enhanced Multiclass Support Vector Machine Model and its Application to Classifying \nFile Systems Affected by a Digital Crime,” J. King Saud Univ. - Comput. Inf. Sci. , Oct. 2019.  \nhttps://doi.org/10.1016/j.jksuci.2019.10.010 \n[55] W. Jo, Y. Shin, H. Kim, D. Yoo, D. Kim, C. Kang, J. Jin, J. Oh, B. Na, and T. Shon, “Digital Forensic Practices and \nMethodologies for AI Speaker Ecosystems,” Digit. Investig. , vol. 29, pp. S80 –S93, Jul. 2019.  \nhttps://doi.org/10.1016/j.diin.2019.04.013 \n[56] P. Sharma, D. Arora, and T. Sakthivel, “Enhanced Forensic Process for Improving Mobile Cloud Traceability in \nCloud-Based Mobile Applications,” Procedia Comput. Sci. , vol. 167, no. 2019, pp. 907 –917, 2020.  \nhttps://doi.org/10.1016/j.procs.2020.03.390 \n[57] S. J. Yang, J. H. Choi, K. B. Kim, R. Bhatia, B. Saltaformaggio, and D. Xu, “Live acquisition of main memory data \nfrom Android smartphones and smartwatches,” Digit. Investig. , vol. 23, pp. 50 –62, 2017.  \nhttps://doi.org/10.1016/j.diin.2017.09.003 \n[58] G. S. Morrison and F. Kelly, “A statistical procedure to adjust for time -interval mismatch in forensic voice  \ncomparison,” Speech Commun., vol. 112, pp. 15–21, Sep. 2019. https://doi.org/10.1016/j.specom.2019.07.001 \n[59] G. Horsman, “Opinion: Does the field of digital forensics have a consistency problem?,” Forensic Sci. Int. Digit. \nInvestig., vol. 33, p. 300970, Jun. 2020. https://doi.org/10.1016/j.fsidi.2020.300970 \n[60] A. Fukami and K. Nishimura, “Forensic analysis of water damaged mobile devices,” Digit. Investig., vol. 29, pp. \nS71–S79, 2019. https://doi.org/10.1016/j.diin.2019.04.009 \n[61] G. Humphries, R. Nordvik, H. Manifavas, P. Cobley, and M. Sorell, “Law Enforcement educational challenges for \nmobile forensics,” Digit. Investig., vol. 38, p. 301129, 2021. https://doi.org/10.1016/j.fsidi.2021.301129 \n "
}