{
  "title": "Design of Children’s Motor Training Tools Using Sensor-Based Agility Components in Physical Education Learning",
  "url": "https://openalex.org/W4220688978",
  "year": 2022,
  "authors": [
    {
      "id": "https://openalex.org/A5086521132",
      "name": "Anton Komaini",
      "affiliations": [
        "State University of Padang"
      ]
    },
    {
      "id": "https://openalex.org/A5055543985",
      "name": "Hermanzoni",
      "affiliations": [
        "State University of Padang"
      ]
    },
    {
      "id": "https://openalex.org/A5053604786",
      "name": "Sri Handayani",
      "affiliations": [
        "State University of Padang"
      ]
    },
    {
      "id": "https://openalex.org/A5046144742",
      "name": "Muhamad Sazeli Rifki",
      "affiliations": [
        "State University of Padang"
      ]
    },
    {
      "id": "https://openalex.org/A5089796582",
      "name": "Yanuar Kiram",
      "affiliations": [
        "State University of Padang"
      ]
    },
    {
      "id": "https://openalex.org/A5025740379",
      "name": "Novadri Ayubi",
      "affiliations": [
        "State University of Semarang",
        "Universitas Negeri Surabaya"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W3131284090",
    "https://openalex.org/W2786737053",
    "https://openalex.org/W2751289061",
    "https://openalex.org/W3000533587",
    "https://openalex.org/W4200517233",
    "https://openalex.org/W2801584758",
    "https://openalex.org/W3198323661",
    "https://openalex.org/W2274960998",
    "https://openalex.org/W2801468331",
    "https://openalex.org/W2985580581",
    "https://openalex.org/W2474552435",
    "https://openalex.org/W2771722199",
    "https://openalex.org/W3087191340",
    "https://openalex.org/W2516609688",
    "https://openalex.org/W4226405112",
    "https://openalex.org/W2005162614",
    "https://openalex.org/W2891511863",
    "https://openalex.org/W2221465426",
    "https://openalex.org/W2944902714",
    "https://openalex.org/W2032663170",
    "https://openalex.org/W2087560482",
    "https://openalex.org/W2131867432",
    "https://openalex.org/W2156955950",
    "https://openalex.org/W3096122048",
    "https://openalex.org/W2215223753",
    "https://openalex.org/W2954539377",
    "https://openalex.org/W3125760164"
  ],
  "abstract": "Abstract— The This study aims to design a motor skill training tool for children using sensor-based agility components in pgysical education learning. This study uses a research and development design. the materials used are Arduino, Connector, LED, Sensor tool, Power button, and Tool cover. After the product design is made, Collecting research data by conducting direct interviews with experts. it will then be validated by a competent expert. In this study, we asked for validation from three experts, namely: (1) evaluation and exercise evaluation (2) instrumentation physicist (3) motor skills expert. Collecting research data by conducting direct interviews with experts. Based on the expert validation test, the design of skill training tools using sensor-based agility components gets effective results, so that they can be used to carry out motor skills exercises. The importance of motor skills as the basis for every child's active life, with the help of tools to help children to encourage themselves to practice, Design of motor skills training tools with sensor-based agility components has the potential and effectiveness to train children's motor skills.",
  "full_text": "Short Paper—Design of Children’s Motor Training Tools Using Sensor-Based Agility Components…\nDesign of Children’s Motor Training Tools  \nUsing Sensor-Based Agility Components  \nin Physical Education Learning\nhttps://doi.org/10.3991/ijim.v16i05.29731\nAnton Komaini1(), Hermanzoni1, Sri Gusti Handayani1, \nMuhamad Sazeli Rifki1, Yanuar Kiram1, Novadri Ayubi2\n1Faculty of Sports Science, Universitas Negeri Padang, Padang, Indonesia\n2Postgraduate, Universitas Negeri Surabaya, Surabaya, Indonesia\nantonkomaini@fik.unp.ac.id\nAbstract—The This study aims to design a motor skill training tool for chil -\ndren using sensor-based agility components in pgysical education learning. This \nstudy uses a research and development design. the materials used are Arduino, \nConnector, LED, Sensor tool, Power button, and Tool cover. After the product \ndesign is made, Collecting research data by conducting direct interviews with \nexperts. it will then be validated by a competent expert. In this study, we asked \nfor validation from three experts, namely: (1) evaluation and exercise evaluation \n(2) instrumentation physicist (3) motor skills expert. Collecting research data by \nconducting direct interviews with experts. Based on the expert validation test, the \ndesign of skill training tools using sensor-based agility components gets effec -\ntive results, so that they can be used to carry out motor skills exercises. The \nimportance of motor skills as the basis for every child’s active life, with the help \nof tools to help children to encourage themselves to practice, Design of motor \nskills training tools with sensor-based agility components has the potential and \neffectiveness to train children’s motor skills.\nKeywords—motor skills, exercise, agility, sensor technology\n1 Introduction\nPhysical activity is very decisive and becomes an important thing for children’s lives \nbecause it has a good impact on children’s health and development [1,2]. Physical, cog-\nnitive, and social development are closely related to children’s motor skills [3–6]. Good \nmotor skills are considered very important and also form the basis for an active lifestyle \nfor every child [7,8]. On the other hand, motor skills depend on new connections in the \ncentral nervous system and the experience of interacting with the environment [9,10]. \nIn addition, motor skills are one of the determining factors for children’s success in \nachieving sports achievements and motivation [11,12]. Poor motor skills will result in a \nchild limiting himself to participate in physical activities with the surrounding environ-\nment, so that it will also have an impact on social understanding [9].\niJIM ‒ Vol. 16, No. 05, 2022\n207\nShort Paper—Design of Children’s Motor Training Tools Using Sensor-Based Agility Components…\nIt is reported that 41 million children worldwide are obese due to poor motor skills \nso that children are lazy to do physical activities or sports [13]. The World Health Orga-\nnization (WHO) recognizes poor motor skills in children, one of which is caused by a \ndevelopmental coordination disorder [14]. In general, this occurs due to lack of motor \nskills training at an early age [15,16].\nOne alternative solution to overcome poor motor skills is to do physical exercise \nsuch as agility training. Agility training has the potential to improve the quality of \nmotor skills by controlling and maintaining body position when changing directions \n[17]. In addition, agility training also leads to balance skills, speed, and physical coordi-\nnation skills [18]. Today various sensor technologies are combined with sports devices \n[19]. It is also driven by technological advances and lower costs. Sensor technology is \nwidely used to measure heart rate and measure temperature that is embedded in per -\nsonal devices such as smartphones and digital watches [19–23]. However, until now \nthere has never been a combination of sensor technology tools and agility components \nto improve children’s motor skills in the physical education learning process.\nOur research aims to design a motor skill training tool for children using sensor-based \nagility components in physical education learning.\n2 Research methods\nThis research is a type of research with research and development design. After the \nproduct design is made, this research requires validation by competent experts. Valida-\ntion is carried out by competent experts aiming to find out the weaknesses and strengths \nof the product. In this study, the researcher asked for validation from three experts, \nnamely: (1) sports evaluation and measurement expert (2) instrumentation physicis \nexpert (3) motor skills expert. Collecting data in this study by conducting direct inter -\nviews with experts.\nMaterials\na)\n b)\n c)\nFig. 1. a) Arduino, b) Connector, c) LED [24]\n208\nhttp://www.i-jim.org\nShort Paper—Design of Children’s Motor Training Tools Using Sensor-Based Agility Components…\nFig. 2. Sensor tool [25]\nFig. 3. Power button [25]\nFig. 4. Tool cover [26]\niJIM ‒ Vol. 16, No. 05, 2022\n209\nShort Paper—Design of Children’s Motor Training Tools Using Sensor-Based Agility Components…\nOverview of the use of the tool:\nFig. 5. Use of tools [26]\n3 Results\nFig. 6. Design results of motor skills training tools using sensor-based agility components\n210\nhttp://www.i-jim.org\nShort Paper—Design of Children’s Motor Training Tools Using Sensor-Based Agility Components…\nFig. 7. The final product of motor skills training tools\nExpert validation test\nTable 1. The results of the interview validation test for the accuracy of the tool\nExpert\nInterview Result\nAccuracy\nSports evaluation and \nmeasurement\nBasically, the development of an exercise tool to improve the motor skills \nof the agility component refers to the definition of the variables observed \nfirst. If according to the definition, then the tool can be used in training \nthe agility. Overall, the product developed represents the definition of the \nvariable being trained, namely agility. So that this tool can be used as an \nexercise tool to improve the motor skills of the agility component.\nInstrumentation physicis The concept is in accordance with the concept of agility work from \nthe point of view of physics. It’s just that it needs to be adjusted to the \nneeds of the sports branch. In principle, the instrument developed was \nappropriate to measure agility. It is necessary to pay attention to the \ncomponents used so that they are closer to the purpose of developing \nthe tool, such as sensors and other components.\nMotor skills In terms of motor skills, this tool can provide a higher movement \nexperience specifically for the agility component.\niJIM ‒ Vol. 16, No. 05, 2022\n211\nShort Paper—Design of Children’s Motor Training Tools Using Sensor-Based Agility Components…\nTable 2. Interview validation test results for the implementation of the tool\nExpert\nInterview Result\nImplementation\nSports evaluation and \nmeasurement\nTo determine the measurement results can be done in several ways, one of \nwhich is through several repetitions. So based on the observations made, \nthe implementation of data collection was developed in accordance with \nthe measurement principle.\nInstrumentation physicis In accordance with the principle of carrying out measurements.\nMotor skills If viewed from the side of the implementation principle, it can be said that \nthe designed product work procedure is correct. However, it needs to be \nfurther adjusted to the sports needs that each child is interested in.\nTable 3. Interview validation test results for tool improvement\nExpert\nInterview Result\nImprovement\nSports evaluation and \nmeasurement\nThe tool should be more mobile and easy to operate. So it needs \nimprovement on several sides of the tool. Like the connecting cable for \neach sensor.\nInstrumentation physicis In terms of software and hardware as well as the work program of the tool, \nit is necessary to improve and test the requirements for developing agility \ninstruments. Among other things, test the accuracy of the tool and test \nthe consistency of the tool. Furthermore, in order to avoid system errors \ncaused by damage to internal components, it is necessary to redesign \nthe components used. One of them is the manufacture of tools must be \npackaged properly, so that it is more sturdy when moved around (mobile).\nMotor skills Variations of training forms need to be developed, with the meaning that \nthe tool must be portable to adapt to the desired form of agility training.\n4 Discussion\nTraining children’s motor skills can be done by doing exercises such as agility exer-\ncises. Our research explains that the validity test was carried out with Sports evaluation \nand measurement experts, this tool can be used in training agility, the overall tool that \nhas been designed includes all components related to agility. On the other hand, the \nimplementation of data collection was developed in accordance with the measurement \nprinciple. Then the improvement in the design of this tool is more on several sides \nof the tool, such as the connecting cable for each sensor to make it easier to operate. \nInstrumentation physicis expert explained that from the point of view of physics this \ntool was in accordance with the concept of physics, the implementation was in accor -\ndance with the implementation of measurements and to avoid system errors caused \nby damage to internal components, it was necessary to redesign the components used. \nOne of them is that the tool manufacturer must be packaged properly, so that it is more \nsturdy when being moved. Furthermore, the motor skills expert explained that this tool \ncan provide high movement experience in the agility component, so that with this tool \nchildren can do exercises to improve their motor skills. In terms of the implementation \n212\nhttp://www.i-jim.org\nShort Paper—Design of Children’s Motor Training Tools Using Sensor-Based Agility Components…\nof the design of this tool, the working procedures of this tool have been designed prop-\nerly. On the other hand, improvements are needed in the form of variations in the forms \nof movement that are further developed so that when doing exercises this tool can \nadjust the desired form of exercise.\nCoupled with research (Dapp, Gashaj and Roebers, 2021) [1] Regular physical exer-\ncise is effective in training the motor skills of long-term children. On research (Paul, \nGabbett and Nassis, 2016) [27] Reporting Training a child’s motor skills can be done \nby doing exercises such as agility training. Physical education taught by a professional \nteacher is very important to stimulate motor coordination so that it has a good impact \non children’s motor development [28]. The research design that we have designed also \nhas the potential to provide assistance to teachers in implementing motor skills training \nusing more effective and efficient tools.\nBased on the development data carried out above. so we believe and believe this \nis the progress of a tool product that is designed to be more effective than the manual \ntraining model. Therefore. This tool is suitable to be used to improve the motor skills \nof the agility component.\n5 Conclusion\nThe importance of motor skills as the basis for every child’s active life, with the help \nof tools to help children to encourage themselves to practice, Design of motor skills \ntraining tools with sensor-based agility components has the potential and effectiveness \nto train children’s motor skills in psysical education learning.\n6 Acknowledgment\nWe would like to thank all the teams involved in this research, especially the experts \nso that we can complete the design of children’s motor training tools using sensor-based \nagility components properly. And it cannot be separated from the role of lecturers, \nresearch subjects for their excellent cooperation so that research can be carried out \nsmoothly.\n7 References\n [1]  Dapp, L. C., Gashaj, V . & Roebers, C. M. Physical activity and motor skills in chil -\ndren: A differentiated approach. Psychol. Sport Exerc. (2021) https://doi.org/10.1016/  \nj.psychsport.2021.101916\n [2]  Chen, W., Hammond-Bennett, A., Hypnar, A. & Mason, S. Health-related physical fitness \nand physical activity in elementary school students. BMC Public Health. (2018) https://doi.\norg/10.1186/s12889-018-5107-4\n [3]  Hestbaek, L. et al. Influence of motor skills training on children’s development evaluated in \nthe Motor skills in PreSchool (MiPS) study-DK: Study protocol for a randomized controlled \ntrial, nested in a cohort study. Trials (2017) https://doi.org/10.1186/s13063-017-2143-9\niJIM ‒ Vol. 16, No. 05, 2022\n213\nShort Paper—Design of Children’s Motor Training Tools Using Sensor-Based Agility Components…\n [4]  Chang, Y . T. Physical activity and cognitive function in mild cognitive impairment. ASN \nNeuro (2020) https://doi.org/10.1177/1759091419901182\n [5]  A yubi, N. & Komaini, A. The Impact of the COVID-19 Pandemic on Children’s Motor \nSkills (Literature Review). Int. J. Res. Publ . 90, 66–70 (2021) https://doi.org/10.47119/\nIJRP1009011220212517\n [6]  Komaini, A. & Mardela, R. Differences of fundamental motor skills stunting and non stunting \npreschool children in kindergarten in North Padang. in IOP Conference Series: Materials \nScience and Engineering (2018) https://doi.org/10.1088/1757-899X/335/1/012131\n [7]  Wainwright, N. et al. Developing children’s motor skills in the Foundation Phase in Wales \nto support physical literacy. Educ. 3–13 (2020) https://doi.org/10.1080/03004279.2019.163\n3374\n [8]  Komaini, A. et al. Motor learning measuring tools: a design and implementation using sen-\nsor technology for preschool education. Int. J. Interact. Mob. Technol. (2021) https://doi.\norg/10.3991/ijim.v15i17.25321\n [9]  Leonard, H. C. The impact of poor motor skills on perceptual, social and cognitive devel -\nopment: The case of developmental coordination disorder. Frontiers in Psychology  (2016) \nhttps://doi.org/10.3389/fpsyg.2016.00311\n [10] Gao, Z., Chen, S., Sun, H., Wen, X. & Xiang, P. Physical Activity in Children’s Health and \nCognition. BioMed Research International (2018) https://doi.org/10.3390/ijerph15040800\n [1 1]  W ood, A. P., Imai, S., McMillan, A. G., Swift, D. & DuBose, K. D. Physical activity types \nand motor skills in 3–5-year old children: National Youth Fitness Survey. J. Sci. Med. Sport \n(2020) https://doi.org/10.1016/j.jsams.2019.11.005\n [12] Figueroa, R. & An, R. Motor skill competence and physical activity in preschoolers: \nA review. Matern. Child Health J. (2017) https://doi.org/10.1007/s10995-016-2102-1\n [13] Zeng, N. et al. Effects of physical activity on motor skills and cognitive development in \nearly childhood: A systematic review. BioMed Research International (2017) https://doi.\norg/10.1155/2017/2760716\n [14] dos Santos, L. R. V . & de Castro Ferracioli, M. Prevalence of children identified with motor \ndifficulties. Brazilian J. Occup. Ther. (2020) https://doi.org/10.4322/2526-8910.ctoAO1847\n [15] Geertsen, S. S. et al. Motor skills and exercise capacity are associated with objective mea -\nsures of cognitive functions and academic performance in preadolescent children. PLoS One \n(2016) https://doi.org/10.1371/journal.pone.0161960\n [16] Forte, R., Ditroilo, M., Boreham, C. A. & DE Vito, G. Strength training and gross-motor \nskill exercise as interventions to improve postural control, dynamic functional balance and \nstrength in older individuals. J. Sports Med. Phys. Fitness  (2021) https://doi.org/10.23736/\nS0022-4707.21.11947-4\n [17] João, P. V . et al. Physical activity with agility motor development for children ages 6–10. \nSci. Sports (2014) https://doi.org/10.1016/j.scispo.2014.08.095\n [18] Eler , N. & Eler, S. The effect of agility exercises on the COD speed and speed in terms \nof the frequency of the training. Univers. J. Educ. Res . (2018) https://doi.org/10.13189/\nujer.2018.060908\n [19] Li, R. T. et al. Wearable performance devices in sports medicine. Sports Health (2016) \nhttps://doi.org/10.1177/1941738115616917\n [20] Kwon, S. Bin et al. Estimating maximal oxygen uptake from daily activity data measured by \na watch-type fitness tracker: Cross-sectional study. JMIR mHealth uHealth (2019) https://\ndoi.org/10.2196/13327\n [21] McKenzie, J. E. & Osgood, D. W. Validation of a new telemetric core temperature monitor. \nin Journal of Thermal Biology (2004) https://doi.org/10.1016/j.jtherbio.2004.08.020\n214\nhttp://www.i-jim.org\nShort Paper—Design of Children’s Motor Training Tools Using Sensor-Based Agility Components…\n [22] T erbizan, D. J., Dolezal, B. A. & Albano, C. Validity of seven commercially avail -\nable heart rate monitors. Meas. Phys. Educ. Exerc. Sci. (2002) https://doi.org/10.1207/\nS15327841MPEE0604_3\n [23] Bandodkar , A. J. & Wang, J. Non-invasive wearable electrochemical sensors: A review \nTrends in Biotechnology (2014). https://doi.org/10.1016/j.tibtech.2014.04.00\n [24] D’Ausilio, A. Arduino: A low-cost multipurpose lab equipment. Behav. Res. Methods \n(2012). https://doi.org/10.3758/s13428-011-0163-z \n [25] Rackus, D. G., Shamsi, M. H. & Wheeler, A. R. Electrochemistry, biosensors and microflu-\nidics: a convergence of fields. Chem. soc. Rev. (2015). https://doi.org/10.1039/C4CS00369A \n [26] Salimi, Z. & Ferguson-Pell, M. W. Investigating the test-retest reliability of Illinois Agility \nTest for wheelchair users. PLoS One (2020). https://doi.org/10.1371/journal.pone.0241412 \n [27] Paul, D. J., Gabbett, T. J. & Nassis, G. P. Agility in team sports: Testing, training and factors \naffecting performance. Sports Medicine (2016). https://doi.org/10.1007/s40279-015-0428-2 \n [28] Gallahue, D. L., Ozmun, J. C. & Goodway, J. C. Compreendendo o desenvolvimento motor: \nbebês, crianças, adolescentes e adultos. AMGH Editora Ltda (2013) \n8 Authors\nAnton Komaini, is a Doctor in Motor Learning. He is a Lecturer in the Department \nof Sports Science, Faculty of Sports Science, Universitas Negeri Padang, Indonesia. His \nresearch areas include Motor Learning, and Sports Education. Email: antonkomaini @\nfik.unp.ac.id\nHermanzoni, is a Senior Lecturer in the Department of Sports Coaching, Faculty \nof Sports Science, Universitas Negeri Padang, Indonesia. His research fields include \ncoaching volleyball sports. Email: hermanzoni@fik.unp.ac.id\nSri Gusti Handayani, is a Lecturer in the Department of Sports Education, Faculty \nof Sports Science, Universitas Negeri Padang, Indonesia. His research areas include \nSports Education. Email: srigusti@fik.unp.ac.id\nMuhamad Sazeli Rifki, is a Lecturer at the Department of Sports Science, Faculty \nof Sports Science, Universitas Negeri Padang, Indonesia. His research areas include \nV olleyball learning, and sports nutrition. Email: msr_rifki@fik.unp.ac.id\nYanuar Kiram, is a Lecturer in the Sports Coaching Study Program, Faculty of \nSports Science, Universitas Negeri Padang, Indonesia. His research areas include \nMotor Learning. Email: yanuarkiram@fik.unp.ac.id\nNovadri Ayubi, is a Doctoral Student in Sports Science at the Universitas Negeri \nSurabaya, Indonesia. His research areas include sports health. Email: novadriayubii@\nyahoo.com\nArticle submitted 2022-01-24. Resubmitted 2022-02-25. Final acceptance 2022-02-27. Final version \npublished as submitted by the authors.\niJIM ‒ Vol. 16, No. 05, 2022\n215",
  "topic": "Test (biology)",
  "concepts": [
    {
      "name": "Test (biology)",
      "score": 0.4434850811958313
    },
    {
      "name": "Motor skill",
      "score": 0.4242889881134033
    },
    {
      "name": "Arduino",
      "score": 0.4212311804294586
    },
    {
      "name": "Computer science",
      "score": 0.4109801948070526
    },
    {
      "name": "Engineering",
      "score": 0.40724891424179077
    },
    {
      "name": "Human–computer interaction",
      "score": 0.3896268308162689
    },
    {
      "name": "Psychology",
      "score": 0.17778950929641724
    },
    {
      "name": "Embedded system",
      "score": 0.0967022180557251
    },
    {
      "name": "Paleontology",
      "score": 0.0
    },
    {
      "name": "Biology",
      "score": 0.0
    },
    {
      "name": "Psychiatry",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I245308123",
      "name": "State University of Padang",
      "country": "ID"
    },
    {
      "id": "https://openalex.org/I148158369",
      "name": "State University of Semarang",
      "country": "ID"
    },
    {
      "id": "https://openalex.org/I23758234",
      "name": "Universitas Negeri Surabaya",
      "country": "ID"
    }
  ],
  "cited_by": 19
}