{
    "title": "Prediction of the Degree of Polymerization in Transformer Cellulose Insulation Using the Feedforward Backpropagation Artificial Neural Network",
    "url": "https://openalex.org/W4281861336",
    "year": 2022,
    "authors": [
        {
            "id": "https://openalex.org/A5028282152",
            "name": "Bonginkosi Thango",
            "affiliations": [
                "University of Johannesburg"
            ]
        },
        {
            "id": "https://openalex.org/A5079866137",
            "name": "Pitshou N. Bokoro",
            "affiliations": [
                "University of Johannesburg"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W3087075202",
        "https://openalex.org/W2317513259",
        "https://openalex.org/W2966915211",
        "https://openalex.org/W2037112532",
        "https://openalex.org/W2006373187",
        "https://openalex.org/W3112452392",
        "https://openalex.org/W2047762225",
        "https://openalex.org/W3013444895",
        "https://openalex.org/W3199865215",
        "https://openalex.org/W2344696956",
        "https://openalex.org/W2993725192",
        "https://openalex.org/W3134472053",
        "https://openalex.org/W2132458875",
        "https://openalex.org/W2334598439",
        "https://openalex.org/W3083548522",
        "https://openalex.org/W2770912739",
        "https://openalex.org/W2150295375",
        "https://openalex.org/W2001624979",
        "https://openalex.org/W1969287169",
        "https://openalex.org/W2965357500",
        "https://openalex.org/W2079745766",
        "https://openalex.org/W1968072408",
        "https://openalex.org/W2114551520",
        "https://openalex.org/W4205662013",
        "https://openalex.org/W3115455277",
        "https://openalex.org/W2121589417",
        "https://openalex.org/W3192621415",
        "https://openalex.org/W3112742641",
        "https://openalex.org/W3023859620"
    ],
    "abstract": "The life expectancy of power transformers is primarily determined by the integrity of the insulating oil and cellulose paper between the conductor turns, phases and phase to earth. During the course of their in-service lifetime, the solid insulating system of windings is contingent on long-standing ageing and decomposition. The decomposition of the cellulose paper insulation is strikingly grievous, as it reduces the tensile strength of the cellulose paper and can trigger premature failure. The latter can trigger premature failure, and to realize at which point during the operational life this may occur is a daunting task. Various methods of estimating the DP have been proposed in the literature; however, these methods yield different results, making it difficult to accurately estimate a reliable DP. In this work, a novel approach based on the Feedforward Backpropagation Artificial Neural Network has been proposed to predict the amount of DP in transformer cellulose insulation. Presently, no ANN model has been proposed to predict the remaining DP using 2FAL concentration. A databank comprising 100 data sets—70 for training and 30 for testing—is used to develop the proposed ANN using 2-furaldehyde (2FAL) as an input and DP as an output. The proposed model yields a correlation coefficient of 0.958 for training, 0.915 for validation, 0.996 for testing and an overall correlation of 0.958 for the model.",
    "full_text": null
}