{
    "title": "Unlocking the Hidden Capacity of the Electrical Grid Through Smart Transformer and Smart Transmission",
    "url": "https://openalex.org/W4293208066",
    "year": 2022,
    "authors": [
        {
            "id": "https://openalex.org/A1981475371",
            "name": "Marco Liserre",
            "affiliations": [
                "Kiel University"
            ]
        },
        {
            "id": "https://openalex.org/A2164077005",
            "name": "Marcelo A. Perez",
            "affiliations": [
                "Federico Santa María Technical University"
            ]
        },
        {
            "id": "https://openalex.org/A2616839709",
            "name": "Marius Langwasser",
            "affiliations": [
                "Kiel University"
            ]
        },
        {
            "id": "https://openalex.org/A2150862685",
            "name": "Christian A. Rojas",
            "affiliations": [
                "Federico Santa María Technical University"
            ]
        },
        {
            "id": "https://openalex.org/A2146660198",
            "name": "Ziqi Zhou",
            "affiliations": [
                "Kiel University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2109176395",
        "https://openalex.org/W1966751624",
        "https://openalex.org/W2996323006",
        "https://openalex.org/W1971473054",
        "https://openalex.org/W3083675755",
        "https://openalex.org/W2974739011",
        "https://openalex.org/W2956359064",
        "https://openalex.org/W2079720152",
        "https://openalex.org/W3023520775",
        "https://openalex.org/W2622359289",
        "https://openalex.org/W2442002586",
        "https://openalex.org/W3154122279",
        "https://openalex.org/W1994959046",
        "https://openalex.org/W3182898258",
        "https://openalex.org/W2971579635",
        "https://openalex.org/W2921112787",
        "https://openalex.org/W2112242185",
        "https://openalex.org/W2007949701",
        "https://openalex.org/W2047617506",
        "https://openalex.org/W2987447721",
        "https://openalex.org/W3024702869",
        "https://openalex.org/W2905927937",
        "https://openalex.org/W2915406526",
        "https://openalex.org/W3081965210",
        "https://openalex.org/W2897459764",
        "https://openalex.org/W2791103336",
        "https://openalex.org/W2914659810",
        "https://openalex.org/W2996528132",
        "https://openalex.org/W2883919122",
        "https://openalex.org/W2125577409",
        "https://openalex.org/W2912753047",
        "https://openalex.org/W2558332336",
        "https://openalex.org/W2523572237",
        "https://openalex.org/W2524275263",
        "https://openalex.org/W2057175642",
        "https://openalex.org/W2071133126",
        "https://openalex.org/W3013125307",
        "https://openalex.org/W2605762779",
        "https://openalex.org/W3114739027",
        "https://openalex.org/W2611380482",
        "https://openalex.org/W2173928183",
        "https://openalex.org/W2570551416",
        "https://openalex.org/W2276907186",
        "https://openalex.org/W2776904577",
        "https://openalex.org/W2030937307",
        "https://openalex.org/W2163474410",
        "https://openalex.org/W2999527218",
        "https://openalex.org/W3095602429",
        "https://openalex.org/W3154079927",
        "https://openalex.org/W2912424077",
        "https://openalex.org/W2768882149",
        "https://openalex.org/W2551826318",
        "https://openalex.org/W2669566973",
        "https://openalex.org/W2438616010",
        "https://openalex.org/W2529186219",
        "https://openalex.org/W3120784924",
        "https://openalex.org/W2905626661",
        "https://openalex.org/W2570301988",
        "https://openalex.org/W2946282136",
        "https://openalex.org/W3009020898",
        "https://openalex.org/W2804532778",
        "https://openalex.org/W3119514135",
        "https://openalex.org/W2773596837",
        "https://openalex.org/W2808627324",
        "https://openalex.org/W2740591315",
        "https://openalex.org/W3037228521",
        "https://openalex.org/W3088119030",
        "https://openalex.org/W2810050724",
        "https://openalex.org/W2525013347",
        "https://openalex.org/W2604697518",
        "https://openalex.org/W2582030908",
        "https://openalex.org/W2928716549",
        "https://openalex.org/W2968462769",
        "https://openalex.org/W2741400370",
        "https://openalex.org/W2899449751",
        "https://openalex.org/W2766106330",
        "https://openalex.org/W3184051488",
        "https://openalex.org/W2072738774",
        "https://openalex.org/W2049794797",
        "https://openalex.org/W2028434004",
        "https://openalex.org/W2098747318",
        "https://openalex.org/W3080386872",
        "https://openalex.org/W1976540877",
        "https://openalex.org/W2050511943",
        "https://openalex.org/W1981742640",
        "https://openalex.org/W3156458560",
        "https://openalex.org/W3021410417",
        "https://openalex.org/W3017331368",
        "https://openalex.org/W2621975476",
        "https://openalex.org/W3132481093",
        "https://openalex.org/W2969538234",
        "https://openalex.org/W2887697376",
        "https://openalex.org/W2139287504",
        "https://openalex.org/W2399554266",
        "https://openalex.org/W2323355716",
        "https://openalex.org/W2748377889",
        "https://openalex.org/W2769782772",
        "https://openalex.org/W2320011536",
        "https://openalex.org/W2897415196",
        "https://openalex.org/W3008163654",
        "https://openalex.org/W2151389342",
        "https://openalex.org/W2974055213",
        "https://openalex.org/W2797779488",
        "https://openalex.org/W2897328359",
        "https://openalex.org/W3032357782",
        "https://openalex.org/W2755887995",
        "https://openalex.org/W2515363549",
        "https://openalex.org/W2910330341",
        "https://openalex.org/W2772352852",
        "https://openalex.org/W2321805541",
        "https://openalex.org/W2517271236",
        "https://openalex.org/W2898927164",
        "https://openalex.org/W2917905096",
        "https://openalex.org/W2794537110",
        "https://openalex.org/W2343550325",
        "https://openalex.org/W2905201462",
        "https://openalex.org/W2955892364",
        "https://openalex.org/W2793225529"
    ],
    "abstract": "Power systems are experiencing a rapid and dra- matic transformation driven by the massive integration of non- dispatchable renewable energy sources such as wind and solar and highly variable loads such as electric vehicles and air conditioning. This challenges existing grid assets eventually leading to update them which in turn increase significantly the costs of the sustainable technologies. Power electronics is a pivotal technology for electrical power processing for renewable energies and sustainable transportation. By means of ”smart” functionalities power electronics converters already embedded in such applications, can also contribute to guaranteeing the overall system stable operation. Anyway this cooperative contribution from distributed devices may be not enough leading to the need in the voltage transformation and power transmission of ”system level” power electronics solutions. In the case of large charging stations a Smart Transformer while in the case of large solar and wind parks integration Medium or High Voltage Direct Current Transmission are system level solutions. This paper wants to review the potential of using such infrastructures to increase the capacity of existing grid assets avoiding or deferring their upgrade and hence reducing the overall costs of renewables integration and of the electrification of transport sector. In fact the power converters embedded in Smart Transformer (ST) and High Voltage Direct Current (HVDC) can provide fast frequency and voltage response and precise control of power flow acting at system level much more effectively and feasibly for system operators as the distributed power converters embedded in several small sources and users. This paper reviews for the first time these two key power electronics ”system level” solutions together - Smart Transformer and High Voltage Direct Current -....",
    "full_text": "                                                                                                    © 2023 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works.   Digital Object Identifier   10.1109/JPROC.2022.3157162  Proceedings of the IEEE Unlocking the Hidden Capacity of the Electrical Grid Through Smart Transformer and Smart Transmission\n  Marco Liserre Marcelo A. Perez Marius Langwasser Christian A. Rojas Ziqi Zhou  Suggested Citation M. Liserre, M. A. Perez, M. Langwasser, C. A. Rojas and Z. Zhou, \"Unlocking the Hidden Capacity of the Electrical Grid Through Smart Transformer and Smart Transmission,\" in Proceedings of the IEEE, vol. 111, no. 4, pp. 421-437, April 2023, doi: 10.1109/JPROC.2022.3157162. \n1\nUnlocking the Hidden Capacity of the Electrical\nGrid through Smart Transformer and Smart\nTransmission\nMarco Liserre, Fellow, IEEE, Marcelo A. Perez,Senior Member, IEEE,\nMarius Langwasser, Member, IEEE, Christian A. Rojas,Senior Member, IEEE,\nand Ziqi Zhou,Student Member, IEEE\nAbstract—Power systems are experiencing a rapid and dra-\nmatic transformation driven by the massive integration of non-\ndispatchable renewable energy sources such as wind and solar\nand highly variable loads such as electric vehicles and air\nconditioning. This challenges existing grid assets eventually\nleading to update them which in turn increase signiﬁcantly\nthe costs of the sustainable technologies. Power electronics is a\npivotal technology for electrical power processing for renewable\nenergies and sustainable transportation. By means of ”smart”\nfunctionalities power electronics converters already embedded in\nsuch applications, can also contribute to guaranteeing the overall\nsystem stable operation. Anyway this cooperative contribution\nfrom distributed devices may be not enough leading to the need\nin the voltage transformation and power transmission of ”system\nlevel” power electronics solutions. In the case of large charging\nstations a Smart Transformer while in the case of large solar and\nwind parks integration Medium or High Voltage Direct Current\nTransmission are system level solutions. This paper wants to\nreview the potential of using such infrastructures to increase\nthe capacity of existing grid assets avoiding or deferring their\nupgrade and hence reducing the overall costs of renewables\nintegration and of the electriﬁcation of transport sector. In fact\nthe power converters embedded in Smart Transformer (ST)\nand High Voltage Direct Current (HVDC) can provide fast\nfrequency and voltage response and precise control of power\nﬂow acting at system level much more effectively and feasibly for\nsystem operators as the distributed power converters embedded\nin several small sources and users. This paper reviews for\nthe ﬁrst time these two key power electronics ”system level”\nsolutions together - Smart Transformer and High Voltage Direct\nCurrent - starting from their basic functionalities and showings\nhow they can go beyond them showing how with grid forming\nfunctionalities they can offer new ”Smart Grid” tools to enhance\nthe capability of the existing electric grid infrastructures.\nIndex Terms—Power electronics, smart transformers, high\nManuscript received Month Day, 2021; accepted Month Day, 2022. Date\nof publication Month Day, 2022; date of current version Month Day, 2022.\nThis work was supported by the Advanced Center for Electrical and\nElectronics Engineering AC3E (ANID/FB0008), the Solar Energy Research\nCenter SERC (ANID/FONDAP/15110019), ANID/Fondecyt Regular Grant\n1210757 and ANID/Fondecyt Regular Grant 1211826. The authors gratefully\nacknowledge funding from the European Union’s Horizon 2020 research and\ninnovation programme under the Marie Sklodowska-Curie grant agreement\nNo 861398 (Wingrid) and by the German Federal Ministry of Education and\nResearch (BMBF) within the Kopernikus Project ENSURE ‘New ENergy grid\nStructURes for the German Energiewende’ (03SFK1I0-2).\n(Corresponding author: Marcelo A. Perez.)\nM. Liserre, M. Langwasser and Z. Zhou are with the Chair of Power Elec-\ntronics, Kiel University, 24143, Kiel Germany (e-mail: ml@tf.uni-kiel.de).\nM. A. Perez and C. A. Rojas are with the Department of Electronics,\nUniversidad Tecnica Federico Santa Maria, Valparaiso 2390123, Chile (e-mail:\nmarcelo.perez@usm.cl, christian.rojas@usm.cl).\nvoltage dc transmission, power system regulation, electrical grid\nstability.\nI. I NTRODUCTION\nElectrical grids are suffering large demand variability\ncaused mainly by highly variable loads such as air con-\nditioning and electric vehicles [1]. The broader integration\nof renewable energies such as wind and solar is expected\nto worsen the situation resulting in further congestion and\nunderutilization of the electrical network [2]. Most of these\nloads and energy sources are connected to the grid by using\npower electronics converters.\nHowever during the last years, it has been registered not\nonly a steadily increasing number of distributed power elec-\ntronics converters but also ”system level” power electronics\nconverters have been embedded into the electrical grid to\nperform a multitude of tasks, as shown in Fig. 1. Due to\nthe fast dynamical response of currents and voltages, these\nconverters are used in a STATic COMpensator (STATCOM)\nto control reactive power, maintaining the voltage amplitude\nat a given level and increasing the transmission capability of\nthe lines. Also, they are employed to manage Energy Storage\nSystems (ESS) to inject active power providing fast frequency\nregulation. High V oltage dc (HVDC) systems offer a cost-\neffective solution for long-distance bulk energy transmission.\nSmart Transformers (ST) provide voltage level transformation\nand a wide variety of ancillary services such as reactive power\ncompensation, harmonic ﬁltering, voltage sag compensation,\nfrequency regulation, dc grids, among others [3].\nDespite distributed and system-level power converters have\nbecome an essential component of power grids [4], they are\nusually associated with the reduction of system inertia, sub-\nsynchronous oscillations, and other problems. Recent analyses\nshow that a change in the control strategies can attenuate these\nissues allowing to take real advantage of the controllability and\nﬂexibility power converters bring to the electrical grid [5].\nPower electronics-interfaced renewable energies, such as\nwind turbines and PV plants, offer no rotational inertia to\nthe system. This reduced inertia increases the rate of change\nof frequency (RoCoF) that may trigger frequency relays and\ncauses the automatic under-frequency load shedding. Alterna-\ntive frequency support methods for low inertia power systems,\nsuch as virtual inertia, have been proposed. The virtual inertia\n2\nHVAC\nHVAC\nHVAC\nHVDCMV DG\nSG\nAC\nDC\nDC\nAC\nSG\nMVAC LVAC\nMVAC\nLVACLVDG\nMV DG\nST ST\nLVDC ESS\nDC loads\nSTATCOM\nFig. 1. Power electronics technologies in the electrical grids\nis achieved by providing an extra power proportional to the\nRoCoF. The additional energy can be provided from the\nrotational inertia of wind turbines, derating the operation of\nthe renewable (PV or wind) generation, or from the energy\nstorage system (ESS) [6].\nIn transmission systems the power ﬂow is mostly uncon-\ntrolled. A “power loop,” which corresponds to power circu-\nlating long paths, even several nations, could lead to poor\nutilization of the transmission grid [7]. One of the most con-\nsolidated technology to increase power transmission capability\nand introduce more controllability in the ac system is the well-\nknown High V oltage dc (HVDC) system [8]. The use of direct\ncurrent in a hybrid grid scheme and the coordination among\nenergy carriers [9] together with Smart Grid technologies [10],\nis attempting to give the electrical grid more ﬂexibility in\ncontrolling the power ﬂow.\nAlso, at the distribution level is possible to increase the\npower capability of the system [11]. For example, it has been\ndemonstrated that the improvement of voltage controllability\ncan unlock up to 3,2 GW of untapped potential [12]. This\nincrement of grid capacity can be done through Smart Trans-\nformers which can control the voltage proﬁle, increasing the\ndamping in case of power mismatch [13]. Consequently, the\nlarger damping reduces the Rate of Change of Frequency\n(ROCOF), allowing the increase of wind penetration up to\n20 % [6]. In general, to increase the damping of the system\nusing distributed generation requires a grid forming control\nscheme [4].\nThis paper reviews both smart voltage transformation and\ntransmission starting from classifying the adopted operation\nas grid following and grid forming, since the latter has been\nemerging in the last years as fundamental contribution to the\nelectric grid stability, then protections in power electronics\ndominated grid are discussed. In the following the two main\ntechnologies, Smart Transformer and HVDC, are reviewed,\nfocusing on their conﬁgurations and features but also the\nchallenges these devices and their associated control schemes\nmust withstand. Although only two applications are described,\nits operation and challenges are common to other applications\nsuch as active ﬁlters, ESSs and others. Furthermore, STs\nand HVDC systems are two enablers to energy transition\nConverter\nModulation\nFilter PCC Grid\nvm\nvc\nig Zg\nvg\nFig. 2. Grid connected converter.\ntechnology and good examples to illustrate the role of power\nelectronics ”system level” solutions into the future power grid.\nII. I NTEGRATION OF POWER ELECTRONICS CONVERTERS\nINTO THE ELECTRIC GRID\nDistributed Power Generation System (DPGS) based on\nrenewable resources such as wind and solar, as well as\nSTATCOM, ESS, HVDC and ST devices are integrated into\nthe electrical grid through power electronics converters fol-\nlowing the conﬁguration shown in Figure 2. The converter is\ncontrolled by the modulation voltage and is connected to the\npoint of common coupling (PCC) using a ﬁlter.\nThe control strategy of converters can be conﬁgured as\neither grid-following (GFL) mode or grid forming (GFM)\nmode, which entitles converters the characteristics of a current\nsource or a voltage source, respectively. A correct operation of\nGFL converters needs to identify the electric grid impedance\nand design correctly the PLL, while GFM converters may rein-\nforce the system stability. Main differences of GFM and GFL\nconverters are summarized in following aspects: i) operation\nprinciple, ii) response to grid events and iii) synchronization\nprocesses [14].\nA. Grid Following and Grid Forming Operation\nGrid connected power converters are conventionally con-\ntrolled in GFL mode acting as a controlled current source\nfollowing the frequency of the reference voltage. Converters\nwith GFL were originally designed to deliver power to the grid\nby controlling the current, synchronizing its operation with\nthe grid voltage. This control strategy can increase the grid\nstability by controlling active and reactive power depending\non the demand but it does not give support to the grid voltage\nif this is weak or not existent. The performance of the GFL\nis usually affected by the grid voltage condition, as well as,\ninteractions with other power converters in the grid can cause\nvoltage and frequency alterations.\nPower converters can be otherwise controlled in GFM\nmode generating a voltage source at its terminals for other\nconverters and loads. The concept of GFM converter was\nﬁrstly introduced in microgrid applications to enhance system\nstability and resiliency of power grid with high percentage\nof power-electronics-based energy generation. Unlike GFL\noperation mode, the GFM regulates the active or reactive\npower by directly controlling its voltage at output terminals\ngenerating a voltage source. This operation mode can create a\nvoltage in a node were there are no other generators connected\n3\na)\nb)\nSynchronization\nPower\nController\nCurrent\nController\nvc\nig\nvm\niref\nig\nθg\nvc\nφmvc\nig\nPower\nController\nVoltage\nController\nvm\num\nSynchronization\nθg\nvref\nWeak grid support\nSelf-synchronization\nFig. 3. Simpliﬁed control schemes for converters [15]. (a) GFL. (b) GFM.\nGFL Converter GFM Converterig ig\nvc vg\nZg\nZI E\nZgZ\nvc vg\na) b)\nFig. 4. Simpliﬁed representations of converters working with GFL and GFM\noperating modes: (a) GFL and (b) GFM.\nor can provide voltage support when the grid is weak. The last\noption requires a precise coordination with existing generators.\nConverters controlled with GFM offer voltage reference for\nother converters controlled by GFL during grid faults or\noperation in islanded mode [15].\nThe simpliﬁed control schemes of GFM converter and GFL\nare shown in Figure 3. Both control schemes have the same\nobjective which is to regulate the active or reactive power\nby using power controllers. In the GFL operation a current\ncontroller is required to manage the current generated by the\nconverter. This controller requires external synchronization\nwith the grid voltage and frequency. The GFM operation\nrequires a voltage control, the reference voltage angle, ampli-\ntude and frequency of which can be given ﬂexibly by power\ncontroller and synchronization unit in weak grid support or\nself-synchronization mode. In both modes the output of the\ncontrol system is the modulating voltage required by the power\nconverter.\nA converter working with GFL operating mode can be\nrepresented by a controlled current sourceI in parallel with\na high impedanceZ, as shown in Fig. 4 a), while a converter\nworking with GFM can be represented by a controlled voltage\nsource E in series with a low impedanceZ [16], as shown\nin Figure 4 b). Both models are interchangeable by Thevenin\nand Norton equivalents and the actual difference rests on the\nvalue of the impedanceZ, which in the case of GFM shall be\nas low as possible to guarantee the voltage source behavior.\nB. Response to Grid Faults\nThe GFM operating mode maintains the voltage phasorE\nconstant in terms of magnitude and phase while GFL applies\na) b)\nIg\nIg\nVg Vg\nVc Vc\nZgIg (Zg+Z)Ig\nNormal\nFault\nNormal\nFault\nE\nFig. 5. Phasor diagrams of reactions to grid faults of grid-connected\nconverters: a) GFL and b) GFM.\nthe same behaviour to grid currentig. As a result, these two\nconverters performs differently when a grid fault occurs.\nThe GFL operating mode contributes to a change of con-\nverter voltage phasorvc during the grid fault due to the con-\nstant output current phasor. Generally, GFL operation needs\na synchronization unit to track the new amplitude and phase\nof vc and then calculate the new current setpoint. Therefore,\nthere is a variation of converter voltage phasorvc during the\ngrid fault as shown in Fig. 5 a). As for GFM operating mode,\nwhen the same grid event occurs, it keeps internal converter\nvoltage E unchanged, which is not affected by perturbation\nof grid voltage vg. Therefore, converter in GFM operation\nmode leads to instantaneous variation of currentig, as shown\nin Fig. 5 b). Due to the intrinsic behavior of voltage source\nbehind an impedance, GFM converter reacts to the grid event\nfaster than GFL control compensates instantaneous reactive\npower after grid fault to meet grid codes [17]. A possible\ncontrol solution to the fault current limiting problem in GFM\nis given by the virtual impedance [17]. The principle idea is to\nlimit the converter reference voltage according to the variable\nvirtual impedance and thus avoiding the excessive over-current\nduring the low-voltage ride-through action. Nevertheless, the\nGFM converter still risks of over-current issues when a severe\ngrid fault occurs thus damaging the converter hardware com-\nponents. In this condition the current is limited only by the\ninput ﬁlter hence, a proper design to ensure a current limitation\nshould be provided.\nC. Synchronization Approach\nThe GFL controller needs a synchronization unit which is\noften implemented by a Phase-Locked-Loop (PLL) [18]. Fig.\n6 (a) shows a typical control scheme of synchronous reference\nframe PLL. As seen in the ﬁgure, it identiﬁes the amplitude\nand phase angle of the grid by sampling the three-phase grid\nvoltages. The amplitude and phase shift of output current\ncan be calculated according to the deﬁned active power and\nreactive power.\nAlthough the PLL shows good performance in identifying\ngrid voltages, it can generate stability issues to the converter\nunder weak grid condition, which could be overcame at cost\nof control bandwidth of PLL. Conversely, the decrease of the\ncontrol bandwidth leads to poor dynamics of acquiring grid\nvoltage angle which cannot satisfy the requirement of quick\nreactions to grid faults [19]. The bandwidth of PLL will be\nlimited when the converter operates at low short-circuit-ratio\n(SCR) grid and there are other PLL-based converters nearby.\n4\n\u0001ref\nabc\ndq +\ns\ns+\n-\n+\n-\n+\n-\nDp\nJs\na)\nb)\nvc \u0001m\n\u0001m\n\u0001m\n\u0001ref\nvcd\nvcq\nPI 1\n\u0001n\n1 1 1Pref\nP\nFig. 6. Control scheme of converter synchronization: a) SRF-PLL and b)\nsynchronverter.\nMoreover, the interaction between these PLL-based converters\nbecomes stronger with the decrease of SCR [19].\nAs for GFM converter, it can be self-synchronized to the\ngrid by power control approached which emulates the power\nsynchronization principles of a real synchronous generator\n(SG) , such as power synchronization control [20], droop\ncontrol [21] and synchronverter control [22]. Synchroniza-\ntion based on synchronverter approach has become more\npopular because it doesn’t require a different unit for pre-\nsynchronization and normal operation. The control scheme of\nsynchronization control is shown in Fig. 6 b). Results indicate\nthat the synchronverter-based GFM converter operating nearby\nhelps to enhance robust stability of the PLL-based converter\n[23] under weak grid condition. therefore, GFM converters\nare much more suitable for weak grid condition compared to\nGFL converters. However, GFM converters are more likely to\nbehave instablity under stiff grid condition [24].\nWith the increasing penetration of renewable energy and\ndistributed energy resources (DERs), the inertia offered by SGs\nto the system is decreased, which leads to frequency stability\nissues [25]. Operators in South Australia are already facing\nobstacles regarding the high penetration of inverter-based\nsources during certain periods of the day [26]. Due to different\noutput characteristics of GFL converter and GFM converter,\ntheir response to frequency variation would be different. For a\nmixed system which includes SGs, GFM converters and GFL\nconverters, the increase share of GFM converters helps to pro-\nvide more damping to frequency swing while GFL converters\ngenerates the opposite effect with the increase of its share [4].\nTherefore, reserves of GFM converters in a low-inertia system\nhas the potential to greatly reduce frequency swings as well\nas reduce rate of change of frequency (ROCOF), allowing a\nlarger percentage of power converters integrated to the grid.\nD. Challenges for Grid Forming Operation\nAlthough GFM control has better frequency response than\nGFL and enhances system stability, there are still many\nchallenges needed to be addressed.\na) Synchronization stability: It’s of great signiﬁcance for a\nconverter to keep synchronization with the grid. In GFM\nmode the current injected to the grid can be derived by\nthe power angle relationship between the grid voltage and\nthe equivalent output voltage of the converter. Under stiff\ngrid condition, even a small disturbance of grid voltage can\nlead to an instantaneous change of current, causing large\npower variations. Therefore, control method with much\nmore damping and robustness against large variation of\nSCR are required [27].\nb) Synchronization during faults: During severe grid faults the\ntransient stability of GFM control with power synchroniza-\ntion and synthetic inertia exhibits a second-order nonlinear\ndynamics behavior, which is similar to the power-swing\ndynamics of SGs [28]. The fault current is generally con-\ntrolled by the PLL, which also performs similar dynamics\nas the power-swing dynamics of SGs potentially triggering\nthe over-current protection during the transient [29]. There-\nfore, a PLL approach to perform faster dynamics during\nsevere grid faults should be investigated.\nc) Current limitation and fault-ride through (FRT): Under\ngrid faults, over-currents may damage the hardware of the\nconverter or may trigger over-current protection. Therefore,\nproper strategies to deal with over-currents, as well as, ride\nthrough strategies should be implemented [30].\nd) Transition between islanded and grid-connected modes:\nThe converter may be disconnected from the grid during\nfault, which may causes signiﬁcant deviations and oscilla-\ntions due to the undesired mismatch of frequency, voltage\nor non-zero through-power. Therefore, strategies that can\nbe applied in the grid-connected mode and the islanded\nmode are required ensuring seamless-transitions between\nboth operating modes [31].\nE. Power system protection with increasing power electronic\nconverter integration\nThe conventional power system protection is based on\ncurrent sensing devices, such as over-current relays, reclosers\nand fuses [32]. These devices monitor the fault current ﬂow\nand generate trip signals to the circuit breaker in case the\nfault current exceeds a pre-deﬁned threshold. However, this\napproach is based on the assumption of radial feeders and\nunidirectional power ﬂow, which isn’t necessarily true with the\nincreasing penetration of power electronics based RES [33].\nMoreover, the RES change the fault level (as they contribute\nonly with small portion to the fault currents) and havevariable\npower in-feed by nature. In consequence, the conventional\npower system protection experiences a number of challenges\n[32]: 1) Blinding of protection, i.e. upstream relays will sense\nlower fault currents if the downstream integrated RES share\nincreases, 2) False or sympathetic tripping, i.e. due to the\nbidirectional fault current ﬂow a relay in a healthy feeder\nmay trip on the backward fault current, 3) Islanding problems\nin microgrids [33], in which the fault current magnitude and\ndirection changes from grid-connected to islanded mode and 4)\nLoss of coordination, i.e. a sequential false operation of relays,\nwhich may also impact the distance relays of the transmission\nsystems, in which false tripping due to under- or over-reach\nissues of the protection zone may result. Consequently, faults\nwithin the protection region may be overseen (under-reach)\n5\nTABLE I\nPOWER SYSTEM PROTECTION SCENARIOS .\n3RZHU\u0003V\\VWHP\u0003SURWHFWLRQ\u0003VFHQDULRV\n&RQYHQWLRQDO\u0003UDGLDO\u0003JULG\u0003ZLWK\u0003XQLGLUHFWLRQDO\u0003SRZHU\u0003ÀRZ\u001d\n2YHU\u0010FXUUHQW\u0003UHOD\\\u0003EDVHG\u0003SURWHFWLRQ\n0HVKHG\u0003JULG\u0003ZLWK\u0003LQFUHDVLQJ\u0003VKDUH\u0003RI\u0003SRZHU\u0003HOHFWURQLFV\u001d\n$GDSWLYH\u0003RYHU\u0010FXUUHQW\u0003SURWHFWLRQ\u0003VFKHPHV\n\u0014\u0013\u0013\b\u0003SRZHU\u0003HOHFWURQLFV\u0010EDVHG\u0003JULG\u001d\n'\\QDPLF\u0003VWDWH\u0003HVWLPDWLRQ\u0010EDVHG\u0003SURWHFWLRQ\u0003\nand false tripping on external faults (over-reach) may happen.\nAs indicated in Table I in the intermediate meshed grid\nscenario, novel protection schemes are necessary, which can\nbe classiﬁed in adaptive and non-adaptive strategies [32]. In\nthe adaptive protection, the relay settings are changed with\nrespect to the changing fault level in the power system to\nensure a reliable distinction between normal loading and fault\ncondition. This requires the interconnection of relays, switch-\ning devices and control centers with reliable bi-directional\ncommunication infrastructure. Alternatively, additional devices\ncan be installed to minimize or block the RES fault current\ncontribution (non-adaptive strategy). Directional over-current\nrelays can be employed to avoid sympathetic tripping. In\na close to 100% power electronics based grid, a general-\nization of the differential protection approach, the so-called\ndynamic state estimation based protection can be seen as a\nviable protection solution without any a priori protection relay\nsettings [34]–[36]. Enabled by the wide-spread existence of\nphasor measurement units (PMU) and advanced communica-\ntion infrastructure, multiple measurements (e.g. currents and\nvoltages at the terminals as well as inside the protection zone\nand thermal parameters) are captured to create a model of\nthe dynamics of power system states. Testing the consistency\nbetween the real-time PMU measurements and the dynamical\nmodel of the protection zone a reliable fault sensing can\nbe guaranteed. The conﬁdence level, i.e. the ﬁt between the\nmeasurements and dynamic model, results to be close to one\nin normal operation or external fault condition and drops to\nalmost zero during internal faults, which in turn initiates the\ntrip signal to the circuit breaker. The beneﬁts of the dynamic\nstate estimation based protection are simpliﬁed protection\nsettings without coordination with other protection functions,\nits immunity to current inversion and the capability to detect\nhigh-impedance faults dependably and securely.\nIII. S MART TRANSFORMER\nThe Smart Transformer (ST) is a power electronics-based\ntransformer with advanced control functionalities to allow ﬂex-\nible AC and DC distribution and the possibility to provide grid\nservices [13]. Thus, it is not a one-by-one replacement of the\nconventional transformer [37] with the limited functionality\nto step up/down the voltage between primary and secondary\nside, but instead forms an active and smart node to allow\nhigh penetration of distributed renewable energy, integration\nof storage in the electric distribution grid and electriﬁcation\nof transport and heating [38].\nThe ST is also known as energy router [39] or energy hub,\nwhich describes its main responsibility in the power system:\nTo manage the transmission and distribution of energy (similar\nto an information network) and allow for dynamic adjustments\nof energy ﬂow [40] and real-time communication among grid\nelements [41]. As explained with more details in the following\nsections, the ST can measure grid variables, observe the grid\nstatus and perform optimization and complex control tasks.\nIn the demonstrator project LV-Engine [42] a ﬁt-for-purpose\nST is intended to be implemented in the secondary substation\nof the Scottish distribution grid with the aim to enhance the\nﬂexibility and release more capacity for the connection of\nlow carbon technologies. The project LV-Engine establishes\nﬁve main use cases of the ST in the near future, which are\noptimum real time phase voltage regulation through GFM\nmode, a meshed LV network operation, the provision of LVDC\nsupply for electric vehicles charging, phase balancing and\npower capacity sharing between secondary substations.\nThe replacement of conventional transformers by their smart\ncounterpart has to be understood as a process. However,\nalready smaller share of ST in the grid brings improvements\nin terms of released capacity in existing LV network for\nconnection of future RES generation and load prior to costly\ngrid reinforcements, the increased ﬂexibility and adaptability\nto cope with uncertainties in how energy will be generated and\nconsumed and lastly the expected avoidance of losses through\nmore efﬁcient DC based integration of EV charging. Thus, the\nproject LV-Engine expects ﬁnancial savings of 62 million £by\n2030 and 528 million £ by 2050 with only 16% of GBs 11\nkV / LV transformers being substituted by 2050.\nAnother recent utilization of the ST can be found in the\nGerman initiative ENSURE [43], in which ﬁeld trials of the\nST in a hybrid AC/DC grid infrastructure at distribution grid\nlevel are carried out with the aim to efﬁciently integrate EV\ncharging infrastructure and PV systems.\nA. Smart Transformer Control in Hybrid and Meshed Grids\nThe classical conﬁguration of the distribution grid is a radial\nac grid. However, the increasing share of RES and the need\nto efﬁciently integrate storage or EV charging stations calls\nfor hybrid and meshed distribution grids, which combine dc\nand ac grids and allow more ﬂexible power ﬂow as each grid\nnode is at least supplied from two sides [44]. The ST, even\nwhen operated in parallel with conventional transformers [45],\ncan be seen as an enabler of such grid scenario as it provides\ndc connectivity [46] and allows to route the energy ﬂow, i.e.,\nin contrast to conventional secondary substation transformers,\ncan control the active and reactive power exchange with the\nconnected grids [40].\nThe control of the ST can be divided in three main control\nlayers [40], which are shown in Tab. II. The inner control layer\nis the current or voltage control layer including also the mod-\nulation. At this level the balancing of dc-link voltages, power\nbalancing in the dc/dc isolation stage and the closed-loop\n6\nTABLE II\nOVERVIEW OF ST CONTROL .\nFirst control layer\nThird control layer\n•\n• System level communation\n• Power grid monitoring\n• Generation of set-points for\u0001rst\ncontrol layer\n•\n• Dynamic grid voltage control\n• Dc and ac microgrid integration\n• Dc-link voltage balancing\n• Power balancing of isolated converters\n• Grid-forming/following control\n• Modulation\n•\nSmart Transformer Control Overview\nSecond control layer\nFault-recon\u0001guration and protections\nPower flow and quality managment\nGeneration of set-points for active\nand reactive power demand\nvoltage or current control are performed. The second control\nlayer is responsible for the provision of set-points to the inner\ncontrol layer. It involves grid services, power ﬂow control,\ndynamic grid voltage control (e.g., low-voltage ride through)\nand possible dc microgrid control for the integration of storage\nand distributed energy resources. In the outer control layer, set-\npoints for active and reactive power are deﬁned coordinating\nmultiple STs and other grid assets such as DG and loads,\nand allocate their respective power ﬂows. It involves system\nlevel communication among several STs and grid monitoring.\nAs an example, in a ST-fed variable frequency distribution\ngrid, in which due to the asynchronous interconnection the\nLV grid frequency can be chosen independently of the MV\ngrid frequency, the ST can interact with the local generators\nand load characteristics to control the LV power demand [47].\nThe meshed grid operation allows more ﬂexible control\nscheme of the ST as the grid voltage can be established\nalready by the parallel conventional power transformer. Thus,\nthe LV inverter can be controlled in GFL to achieve a more\nﬂexible power control to provide supports in the LV ac grid\nand high current quality. The integration of ESS in the dc\nlink increases the dc voltage control ﬂexibility, i.e., either\nachieving independent operation of ST and MV ac grid support\nor allowing for so-called dual microgrid operation, if the ESS\nis controlling the LV dc voltage.\nThe ST enables meshed grid conﬁgurations as shown in 7.\nConnecting two parallel LV ac feeders at the busbar is possible\nto achieve equal power demand distribution, i.e., to balance\nfeeders with high load and high distributed generation (DG)\nin-feed. Consequently, the appliances overload condition and\nfeeder voltage proﬁle can be improved. By re-conﬁguring the\nnetwork in a ring topology closing the loop at the end of the\nfeeder through the normal open point similar beneﬁts can be\nobtained.\nIn the case of a upstream power transformer outage or\nmaintenance, the ST can establish a microgrid in both the\nLV and MVac side by switching the control operation of\nboth MV and LV converter into GFM. This dual microgrid\noperation allows - assuming the presence of sufﬁciently large\nHVDC\nSG\nSTST\nSTST\nSTATC OM\nLVDC\nESS\nMVAC\nMV DG\nMV DG\nConventiona l substation\nPow er electronics-based  substation\nAC g rid\nDC grid\nMVDC\nFig. 7. ST in meshed grids\nbattery energy storage systems (BESS) as primary power\nsource - continuous power supply of the loads with control\nof voltage and frequency in both grids [48]. Closing the\nnormally open point to establish the ring grid conﬁguration,\nthe dual microgrid can be achieved with reduced line losses\nas compared to the radial grid conﬁguration and the voltage\nalong the feeder can be maintained within the speciﬁed grid\ncode limits [44].\nIn the multi-port topology, the ST provides direct dc con-\nnections in low and medium voltage. This allows the direct\nand efﬁcient integration of e.g., BESS [49] and ST-connected\nRES with reduced operating losses, reducing the number of\npower conversion stages and keeping the grid infrastructure\nlight [49], and the possibility to offer harmonic compensation\nand improved power quality [45]. The ST enables hybrid\nmicrogrids, i.e., ac and dc microgrids, which can be operated\nin zones of local energy balance by either centralized [50]\nor decentralized [51] power management schemes and the ST\nonly provides the backup power in case the local DG and\nstorage can no longer maintain the power balance.\nA future scenario the LV dc port of the ST is extended\nto establish an extra dc line to connect with the dc bus of\ndistributed generation converters and dc loads. Bringing the\nDG active power supply and loads closer together and draining\npower from the ST only in case the DGs are insufﬁcient to\nsupply the loads, increases further the efﬁciency or in case\nof reverse power ﬂow and allows a reduction of the ST LV\nac/dc converter [52]. A novel interconnected topology of the\nmultiport ST has been presented in [53], which considers\noptimal power routing by design based on the power demand\nin the LV dc and LV ac grids.\nInterconnecting two STs in distinct MV feeders through an\nadditional MV dc line achieves higher grid resilience towards\nfaults and supply redundancy [54]. The ST itself can also\nincrease the grid resilience by riding through single-phase\nfaults in the downstream grid controlling the phase angle as\nproposed in [55].\nThe ST with integrated storage can also provide a\ndispatched-by-design operation of the LV distribution grid\n7\nTABLE III\nCLASSIFICATION OF ST GRID SERVICES .\n*ULG\u00036HUYLFHV\u00033URYLGHG\u0003E\\\u000367\n\n\n\n\n9ROWDJH\u0003VXSSRUW\u0003\u000b6WHDG\\\u0003VWDWH\u0003DQG\u0003/957\f\n5HDFWLYH\u0003SRZHU\u0003FRPSHQVDWLRQ\u0003DW\u0003+9\u001209\u0003VXEVWDWLRQ\n3RZHU\u0003TXDOLW\\\u0003LPSURYHPHQWV\n,VODQGLQJ\u0003FRQWURO\u0003\u000b+LJK\u0003'*\u0003LQ\u0003/9\f\n\n\n,QWHJUDWLRQ\u0003RI\u0003(9\u0010FKDUJLQJ\u0003VWDWLRQV\n,QWHJUDWLRQ\u0003RI\u0003VWRUDJH\u0003IRU\u0003GLVWSDWFKLQJ\n,PSHGDQFH\u0003LGHQWL¿FDWLRQ\n\n\n\n\n\n\n/RDG\u0003LGHQWL¿FDWLRQ\n5HYHUVH\u0003SRZHU\u0003ÀRZ\u0003FRQWURO\n67\u0003RYHUORDG\u0003FRQWURO\n6RIW\u0003ORDG\u0003UHGXFWLRQ\n'DPSLQJ\u0003RI\u0003KDUPRQLFV\u0003DQG\u0003UHVRQDQFHV\n/9\u0010VLGH\u0003SRZHU\u0003TXDOLW\\\n &RQWURO\u0003RI\u0003K\\EULG\u0003DQG\u0003PHVKHG\u0003JULGV\n[56], while ensuring improved voltage control performance\nin LV and MV network with respect to the base case of\nconventional power transformer and separate LV storage unit.\nAnother future scenario facilitated by the ST is a multi-\nfrequency distribution grid, in which point-to-point energy\ntransfer from a particular sender to a particular receiver is\nenabled by the ST’s potential to modulate more than one single\nfrequency in its output voltage waveform [57].\nB. Smart Transformer Grid Services\nWhat makes the STsmart are the advanced control func-\ntionalities and the distribution grid services that are enabled\nthereof [58]. In Table III, a classiﬁcation of the potential\nservices that a three-stage ST can provide to the MV ac and\nLV ac grid, as well as, the advantages that are facilitated by\nthe dc connectivity is given.\nA strategy using the ST to identify the load dependence\non the grid voltage in real-time by means of intentional small\nvoltage perturbations and capturing the respective load power\nresponse has been proposed [59]. The knowledge on load\nsensitivity allows a proper and smooth control action, for\ninstance, voltage control for stability purposes or voltage and\nfrequency regulation, under an increased demand variability\nand different loading conditions in the power grid.\nA soft load reduction control to avoid load shedding has\nbeen developed, which enables the ST to decrease the con-\nsumed load active power by controlling the voltage in the LV\ngrid according to the identiﬁed load sensitivity [60]. Likewise,\nthe ST can guarantee a pre-speciﬁed load ﬂexibility to the\ntransmission or distribution system operator and maintain\nits own operational safety by means of overload control.\nMoreover, the load control can be applied to improve the\nvoltage proﬁle in the MV grid prior to the action of on-load\ntap changers [61].\nThe reduction of the grid equivalent inertia due to the\nincreasing number of PE-connected DG units requests a\nfrequency regulation with high dynamics. The ST can pro-\nvide such service by controlling the load consumption as\npower reserve, both upward and downward, during frequency\nvariations [62]. A study case in the Irish transmission grid\nsystem with wide-spread use of ST has been investigated,\nintroducing a ﬂexible demand control to support the frequency\nand simultaneously the voltage by reactive power control with\nthe aim to increase the grid’s hosting capacity for renewable\nenergy systems. A 10 % increase in wind penetration without\nany additional storage units has been achieved [6].\nAs countermeasure towards the reverse power ﬂow from the\nLV to MV side of the distribution grid in the case of high DG\npower generation and low load demand, the ST can modify\nthe voltage waveform by varying the frequency in the LV grid\nin order to interact with the local DG units, which in turn will\nvary their power output avoiding the reverse power ﬂow and\npossible voltage rise in the MV side [63].\nThe ST can be exploited to enhance the possibility of\nislanding operation in multi-microgrids. Multi-microgrids are\ndeﬁned as MV grid interconnecting several aggregated LV\nmicrogrids aiming to increase the distribution grid resilience.\nIn [64] robust control strategies for ST with and without\nintegrated storage units have been presented, which aim to\ncoordinate the ﬂexibility of distributed resources in LV and\nMV grid as well as the optional storage unit in order to\nguarantee a successful multi-microgrid operation in islanded\nmode. The ST can be controlled such that the LV microgrid\nfrequency is modulated following the MV grid frequency,\nwhich allows the participation of LV DGs in the MV primary\nfrequency regulation. Furthermore, the storage unit integrated\nin the ST LV dc link enables the restoration of the LV MG\nfrequency, once the MV frequency is resettled within the dead-\nband limits.\nThe control concepts established for the islanding operation\ncan be extended to a local black start operation in case of\nupstream voltage level blackout or fault in the HV grid. The\nST LV inverter will transit to GFM and especially if equipped\nwith ESS will be able to initiate a soft-start [65] preventing the\nST from high inrush currents and maintaining balanced MV\ndc-link voltages [66] and create references for the frequency\nand voltage in the multi-microgrid with the aim to recover\npre-fault conditions of load and generation levels and ﬁnally\nto allow the re-synchronization to the upstream grid [67].\nForming a non-synchronous interconnection between the LV\nand MV ac grids, the ST decouples the two and hence prevents\nharmonic propagation from one side to the other. In addition,\nthe advanced control functionalities allow further improvement\nof grid power quality in terms of harmonics and resonances.\nAs demonstrated in [68], the ST can effectively reduce the\nunbalance degree in the MV grid and considerably improve\nthe current quality in MV and voltage quality in LV grid. The\nST can actively identify grid resonances by mono-frequency\nexcitation to allow resonance adaptivity of the grid forming\ncontrol strategy to LV grid variations [69]. Moreover, the ST\ncan be seamlessly equipped with ﬁlter-based or multi-loop-\nbased active damping controller to shape its output impedance,\ndamp possible grid resonances and increase the grid stability\nand the stability of the local DG controllers [70].\n8\nThe ﬂexibility reached with the implementation of ser-\nvices reported in Table II demands important hardware or\nsoftware modiﬁcations into the traditional ST architecture.\nThis additional complexity is directly traduced in terms of\ncost for the ST unit. As solution, in [58], the grid-tailored\ndesign approach has been proposed, which considers the\napparent power controllability of the ST to achieve up to 20%\nreduction in terms of costs and footprint with respect to the\nconventional transformer design approach. In fact, depending\non the requested grid service functionality savings achieved in\none stage of the ST can compensate the additional costs of\nother stages. In the design approach semiconductor, cooling\nsystem and capacitor bank design have been considered. The\nconventional strategy to prove beneﬁts of grid services in\nterm of cost is the utilization of Real-Time simulation-based\ntesting of STs under different grid services, faults and load\nrequirements [71].\nC. Smart Transformer Maintenance-oriented Control\nReliability and maintenance costs are still key concerns for\nthe ST [72], in which an industry survey identiﬁed the thermal\nstress of power semiconductors and capacitors as the main\nsource of failure [73].\nAs demonstrated in the European Research Council (ERC)\nConsolidator Grant HEART (Highly Efﬁcient And Reliable\nsmart Transformer) and the following ERC Proof of Concept\nGrant U-HEART (Unbreakable- Highly Efﬁcient and Reliable\nsmart Transformer) modularity in the design, i.e., serial or\nparallel connection of basic power electronic building blocks,\ncreates inherent fault tolerant capability and self-healing fea-\ntures to increase the STs robustness and reliability [72].\nA software-based approach to reduce the thermal stress on\nthe STs components is given by the active thermal control\n[74]. Due to the activation and deactivation of PEBBs to in-\ncrease the STs efﬁciency, different components are exposed to\ndifferent failure mechanisms and stress. However, to increase\nthe system reliability and avoid or delay as much as possible\nthe failures dependent on the processed power, the PEBBs\ncan be unequally loaded (which is referred to as ”Power\nRouting”) to shift the stress from older to newer components\n[74] considering the estimation of the junction temperature on\nthe basis of thermo-sensitive electrical parameters [75], and\nthe remaining useful lifetime. Likewise, lower safety margins\nand thus a lighter infrastructure can be realized [72].\nThe active thermal control (ATC) concept can be imple-\nmented at different layers [75] ranging from modulation,\nchanging the switching frequency or modulation type [76],\n[77], to converter or system level control, where the dc-link\nvoltage control can be adapted or the active/ reactive power\nproﬁles can be reshaped introducing virtual resistors to mirror\nthe aging of the individual PEBBs [78]. This power routing\nconcept is applied to increase the remaining useful lifetime,\nreduce the maintenance costs and increase the availability of\npower supply and grid services through prognostic mainte-\nnance [79].\nD. Remaining Challenges\nIn the recent decade, several implementation issues of STs\nhave been sorted. However, there are still some technological\nand economic challenges to overcome before SSTs fully\nreplace conventional transformers [40]. These challenges are\nsummarized below.\nSTs are still more expensive than traditional transformers.\nHowever, semiconductor technology is continuously improv-\ning, developing new efﬁcient and cheaper high voltage/current\nsemiconductor devices. Modular design enables self-healing\nfeatures, i.e., the correct fault operation bypassing damaged\npowers cells. In fact, a modular design allows reduce the power\nouting and balance the aging cell effects, thus failure rate is\nreduced and their lifetime is improved. Furthermore, a ST\nconﬁguration requires an high-frequency isolation transformer,\nthen the incorporation of fast semiconductor devices can be\npotentially good for ST operation [80]. In this sense, the\nutilization of new highly efﬁcient components, such as fast\nhigh-voltage Si-IGBTs, SiC-MOSFETs and GaN-HEMTs will\nopen new research lines. One of the major beneﬁts attained\nfrom the utilization of wide bandgap devices arises from their\nability to operate at high switching frequencies while still\nmaintaining a high efﬁciency. Moreover, the increase of the\nbreakdown voltage, enabled by the development of HV SiC\ndevices, translates into the utilization of fewer devices in a\ntopology. The collection of these two aspects contribute to\na reduced footprint, system losses (once the technology is\nmatured) and CO2 emissions. Although extremely beneﬁcial,\nthe challenges attached to their full utilization still need to\nbe completely addressed. From the series arrangement of the\nSiC dies and challenges in managing the high dv/dt [81] to\nthe requirements for appropriate packages, able to ensure the\nhigh voltage insulation and good thermal performance, these\ndevices have not yet found a mass scale opportunity to bring\ndown their prices and make them competitive with Si-based\nsolutions [82].\nOther relevant operation challenges such as increased over-\ncurrent and overvoltage capabilities during grid faults, fault de-\ntection and precise synchronization methods based on spread\ncommunication lines and real-time security algorithms must\nbe adopted and solved in order to increase the robustness of\nST substations. Finally, there are still several challenges to in-\ncrease the utilization of STs into the power grid. Developing of\nnew standards and grid codes oriented to deﬁne the interaction\nbetween STs and the power grid is a mandatory task in order\nto make ST an industrial product [40].\nIV . HVDCSYSTEMS\nHVDC have proved to be cost efﬁcient alternative to\nac transmission for long distance energy transmission due\nto the lower cost of lines and reduced same right-of-way\n(RoW) [83]. Urban areas infeed and off-shore wind farms\nusing underground or submarine cable also beneﬁts from this\ntechnology [84]. The interconnection of asynchronous grids,\neven with different frequencies, can also take advantage of\nthis technology using back-to-back systems in which there\nis no transmission line involved [85]. The fast dynamical\n9\nresponse, improved stability and distributed control capability\nof HVDC might be the key to increase renewable energies\nutilization [86]. Moreover, HVDC can be embedded in the\nlegacy AC power system [87]. Increasing the interconnectivity,\nthe embedded HVDC has the potential to reinforce the hosting\ncapacity of the AC grid by providing control services and thus\nreducing the investment needed in terms of conventional grid\ninfrastructure upgrades.\nHVDC technology is rather mature, but as the number\nof HVDC in worldwide power systems is increasing new\nchallenges have been emerged. Reduction of interarea sub-\nsynchronous oscillations, fast frequency regulation, weak grid\noperation and protection strategies for increasing reliability are\nsome of them. In this section a review of HVDC technologies\nand recent advances on the topics mentioned previously are\ndiscussed.\nA. HVDC Technologies\nThyristor based HVDC technology was introduced in the\n1970 decade proving to be lighter, cheaper, more reliable and\nmore efﬁcient than the previous technology based on mercury\nvalves [88]. This HVDC technology uses line commutated\nconverters (LCC) which are composed by an arrangement\nof six switches, each one made of several semiconductors\nconnected in series to achieve the transmission DC voltage\nrange. To control the DC voltage and hence the active power,\nthe ﬁring angle is modiﬁed and, intrinsically, there is a\ncoupled relationship between active and reactive power. These\nconverters requires reactive power and cannot be connected to\npassive grids which do not have voltage sources in the AC side\nor weak grids where the reactive power could not be properly\ncontrolled.\nThe six pulse rectiﬁer generates characteristic harmonics\nin the ac current and in the dc voltage requiring large ﬁlters\nin both sides. It is possible to connect several six-pulse\nrectiﬁers using a transformer with phase-shifted secondaries\ngenerating a multipulse input current (12/24/36 pulses). In Fig.\n8 a) is depicted a 12-pulse LCC-based HVDC system. This\nconﬁguration reduces the harmonics in the DC voltage and\nAC current but also reduces the overall efﬁciency due to the\ntransformer [89]. The reactive power requirements of LCC-\nbased HVDC can be reduced by using Capacitor Commutated\nConverters (CCC) as is presented in Fig. 8 b).\nV oltage source converters (VSC) with force commutated\nsemiconductors (IGBT) were introduced in HVDC systems\nemploying modular multilevel converter (MMC). The main\nadvantage of this topology is that the generated voltage is\ncomposed by several small voltage steps, hence important\nimprovements are obtained as such as minimization of har-\nmonic generation, elimination of the input ﬁlter, low HF\nnoise, low switching losses, low semiconductor switching\nfrequency, and nearly sinusoidal AC voltage waveforms. These\nconverters do not require any reactive power compensation,\nand moreover they can control independently both active and\nreactive power with high dynamic, hence these converters can\nbe connected to weak networks and even to passive networks\nwithout synchronous generators in it. However, compared to\nAC\nSystem 1\nAC\nSystem 2\nDC\nSystem\nLine\nLine\nLine\nLine\nLine\nLine\nDC\nSystem\nAC\nSystem 1\nAC\nSystem 2\nDC\nSystem\nAC\nSystem 1\nAC\nSystem 2\na)\nb)\nc)\nMMC \nSubmodule \n(SM) (Fig. 9)\nFig. 8. HVDC Technologies: a) LCC, b) CCC and c) MMC\na) b)\nc)\nd)\nFig. 9. MMC submodules: a) half-bridge submodule (HBSM), b) full-bridge\nsubmodule (FBSM), c) cross-connected submodule (CCSM) and clamped-\ndouble submodule (CDSM).\nLCC-based HVDC the DC voltage and power transmission\ncapability is lower [90]. A conventional MMC-based HVDC\nsystem is presented in Fig. 8 c).\nThis technology is based on the series connection of several\nvoltage source simple submodules as shown in Fig. 9. The\nhalf-bridge submodule (HBSM) shown in Fig. 9 a) provides\nlow switching count but it generates only zero and posi-\n10\ntive voltages. Other possibility is the full-bridge submodule\n(FBSM) depicted in Fig. 9 b). It generates zero, positive and\nnegative voltages, then this type of cells can be used either\nfor ac or dc systems. On the other hand, advanced bipolar\nsubmodules such as the cross-connected submodule (CCSM)\nin Fig. 9 c) and the clamped double submodule (CDSM) in 9\nd) can be used o provide fault blocking capabilities.\nLCC-based and VSC-based HVDC technologies offer ad-\nvantages and the same time some technical drawbacks. LCC-\nbased HVDC systems needs large amounts of reactive power\nto deliver active power and large ﬁlters for the high harmonic\ncontent. On the other hand, VSC-based systems provide in-\ndependent control of active and reactive power in addition to\neasier reversal power ﬂow capability. Furthermore, VSC-based\nHVDC systems are less efﬁcient than LCC-based HVSC and\nhave much higher cost due to large number of semiconductors\n[91]. The combination of both units can be a potential solu-\ntion, combining the advantages ofLCC-based and VSC-based\nHVDC technologies. However, with the continuous technology\nimprovement of semiconductor devices such as high-speed\nIGBTs and power MOSFETs a massive utilization of MMC-\nbased units in new HVDC projects is expected.\nFast semiconductors devices as SiC-MOSFETs have been\nevaluated for use in MMC cells and it was found that they\ncould further reduce the losses, improving the efﬁciency and\nincreasing the power density [92], [93] to the detriment of\na high cost. Finally, a potential use of fast high-voltage Si-\nIGBTs and SiC-MOSFETs in MMC-based HVDC systems is\nin the protection bypass, breaker circuits and in dc-MMC units\nfor direct photovoltaic energy integration [94].\nB. HVDC Control Stategies\nThere are different control strategies depending on the\ncontrol objectives. At system level, different control strategies\nare required to interface the HVDC system with the ac grid\nsuch as voltage margin control, droop control, voltage and\nfrequency regulation, synthetic inertia and grid forming. These\nstrategies, however, are common to all devices connected in\na grid. This section is focused on control strategies required\nspeciﬁcally for HVDC system.\nThe controllers needed in an HVDC system are classiﬁed by\nfour functional levels according with the International Council\non Large Electric Systems (CIGRE) guide [95], shown in Fig.\n10: station-, upper-, lower- and hardware-level controls. The\nstation controls provide the set-points for active power (P),\nDC voltage (VDC), reactive power (Q) or AC voltage (V AC)\nrequired by the next control level. Upper-level control address\nthe HVDC mode operation which depends on the HVDC con-\nﬁguration (back-to-back, point-to-point, multi-terminal) but is\nindependent of the converter topology. The upper level control\npresents two main control operation modes: grid-following and\ngrid-forming control modes. In the grid-following mode, the\nunit can be connected to a non-islanded AC system, where\nactive and reactive power control or DC-link voltage control\nand AC-grid voltage control can be achieved. Both alternatives\nhave an internal decoupled current control and the lower level\nreference generation is synchronous with the grid voltage by\nDispatch Control Setpoints\n(P, Q, Vdc, Vac, fg, others)\nStation\nControl\nUpper-Level\nControl\nLower-Level\nControl\nHardware\nLevel\nControl\nOperation Mode Selector\nGrid Following Grid Forming\n•\n•\n•\nCapacitor Ripple Controller\nCapacitor Voltage Balancing\nCirculating Current Suppression\nModulation\nSwitching Pulse Generation\nFault Protection Device\n•\n•\nFig. 10. Hierarchy Control Structure of HVDC-VSC MMC Systems.\nHVDC Control Strategies\nPower Angle Control\nVirtual Inertia Control\nVoltage Cotroller Oscillator\nAC Voltage Droop Control\nVector Current Control\nActive Power Control\nReactive Power Control\nDC Voltage Control\nAC Voltage Droop Control\nFig. 11. Classiﬁcation of control strategies for HVDC\nusing a Reference-Frame-Phase-Locked-Loop (SRF-PLL) or\nDouble Decoupled SRF-PLL in case of unbalanced AC system\nconnection. On the other hand, if the grid-forming control\nmode is selected, the unit can be connected to an islanded\nAC system, and the grid voltage must be synthesized by the\nconverter unit. The HVDC control strategies are summarized\nin Fig. 11.\nLower-level controls address the modulation and dedicated\ncontrol constrains for the converter operation hence they\nmust be designed speciﬁcally for LCC or MMC convert-\ners. Due to the large number of voltage levels in MMC-\nbased HVDC units, the Staircase or Nearest-Level Modulation\n(NLM) provides a simple implementation and calculation of\ngating signals. A combination of NLM and PWM, in which\nonly one submodule per arm is modulated, can reduce the\nlow-frequency current distortion generated by NLM without\nincreasing the modulation complexity [96]. On the other hand,\nin industrial applications, high-frequency PWM is not used\nto avoid increasing commutation losses and optimal-pulse\npattern generation is preferred [97]. If PWM is required, a\ncarrier equal to the fundamental power-line (50Hz or 60Hz) as\nswitching frequency per semiconductor device can be adopted.\n11\nV. CHALLENGES TO INTEGRATE HVDC INTO ELECTRICAL\nGRIDS\nNew power converter technologies based on voltage source\nconverters have pushed the use of HVDC on new applications\nresulting in a wide variety of challenges which must be\naddressed during the next years. Most of these challenges are\nsummarized in Table IV and they are related to the growth of\nrenewable energy sources integrated to the electrical system\nin order to increase efﬁciency, stability and reliability. In this\nsection several of these challenges are described.\nA. Sub Synchronous Interarea oscillations\nThe interaction of the HVDC controllers and the mechanical\ntime constant of the ac machines can lead to low frequency\noscillations also called as sub synchronous resonances (SSR).\nThese resonances might lead to large voltage and currents\nexcursions damaging the system components and activating\nthe protection devices. Even when these resonances are limited\nin amplitude, if they are generated continuously, torsional\noscillations can lead to the fatigue and eventual failure of the\nrotating machines.\nThe LCC-HVDC can generate SSR if the equivalent\nimpedance generate by the rectiﬁer station has a strong modal\nresonance. The solution proposed to reduce these oscillations\nis modifying the tuning of the controller parameters in order\nto generate active damping [98].\nThis effect is less likely to occur in VSC-HVDC because\nthe dynamics of the controllers are faster than LCC-HVDC.\nHowever, it has been demonstrated, using modal frequency\nlinear analysis, that this effect can be still produced, particu-\nlarly if the HVDC station is implemented with constant power\ncontrol. In this condition the impedance is reduced and there\nexists a small damping to avoid oscillations [99].\nInterarea SSR can be also generated by the primary control\nimplemented in the HVDC station for frequency regulation.\nThis type of interaction between the primary control and\nmechanical elements of the grid can lead to very slow SSR in\nthe order of 0.1-0.7Hz and, which can be avoided, or at least\nreduced, by a proper design of the controller [100].\nAlthough the main cause of SSR is the interaction of the\ncontroller with mechanical devices, for long lines it can also be\nproduced in the HVDC line by an oscillating power exchange\nbetween stations. The DC ﬁlters increase the resonance peak\nand, in this case, it is possible to reduce it by limiting the gain\nof the controller for subsynchronous frequencies [101].\nAnother cause of SSR is in multiterminal HVDC due to\nthe master-slave conﬁguration in which there is only one\nstation controlling the DC voltage and all the other stations are\ncontrolling power. In these cases the most commonly proposed\nsolution is to model a resistor in series with the DC line into\nthe control system in order to produce virtual damping [102].\nThe main challenge to reduce SSR is the requirement to\nperform a modal analysis of the system in order to model the\ncoupling between the HVDC and ac systems and identify the\ncause of the oscillation. This task is not trivial and required a\ndetailed knowledge of the parameters of lines and generators,\nas well as, the different conﬁgurations of the grid [103].\nTABLE IV\nCHALLENGES TO INTEGRATE HVDC INTO ELECTRICAL GRIDS .\n•\nHVDC Challenges\nSubsynchronous\nresonances\nFast frequency\nregulation\nWeak grid\noperation\nFaults and\nprotections\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\nFrequency and voltage resonance\nPower modulation\nOnline identiﬁcation of oscillations\nIncorporation of energy storage\nFast control of DC voltage\nMultiterminal HVDC\nVSC-HVDC voltage support\nGrid forming strategies\nResonant circuits for breakers\nInherent VSC-HVDC fault capability\nAC and DC fault tolerant operation\n• Ultrafast fault detection and location\nOne possible solution is to apply an active power modu-\nlation in which the power of each HVDC station is linked\nto the frequency variation similarly to droop control [104].\nIf the dynamics of the source are neglected this method is\nonly limited by the available power, but if these dynamics are\nconsidered there exists a fundamental limit to the performance\ngiven by the ratio between modal frequencies [105].\nThe ﬂexibility achieved with the implementation of chal-\nlenges reported in Table IV demands important modiﬁcations\ninto the conventional control schemes summarized in Fig.\n11. On the other hand, if conventional control schemes are\nretained without modiﬁcations, undesired loop energy ﬂow\nmay appears by increasing the converter losses and complexity\nof HVDC protection systems [106].\nB. Fast frequency regulation\nLarge-scale integration of renewable energy has increasingly\nreduced the inertia of power systems because this kind of\nenergy sources does not provide any inertia in the case of\nphoto-voltaic solar energy and only a very little mechanical\ninertia in the case of wind power. The reduction of the system\ninertia might lead to larger and faster frequency deviations\nwhich can activate protection systems and reduce their sta-\nbility. Note that, the implementation of the synthetic inertia\nconcept in power systems with high penetration of renewable\nenergy sources is performed with a derated maximum power-\npoint tracking (MPPT) operation also named ﬂexible MPP and\nenergy storage source installations.\nIn this scenario, VSC-HVDC, due to the fast dynamical\nresponse of currents, can be used to alleviate this problem by\nincorporating synthetic inertia and damping into the system.\nThe control system of the HVDC must be modiﬁed to mimic\nthe behavior of a synchronous machine in which the frequency\nis related to the power extracted or injected, hence from the\npoint of view of the grid, and the HVDC station becomes a\nlarge synchronous machine with synthetic mechanical inertia\nassociated.\nSimilar to a mechanical system, the slow rate of change of\nfrequency provided by the inertia consumes or adds kinetic\n12\nenergy from the rotating machine. With synthetic inertia, the\nenergy comes from the DC terminals of the HVDC station,\nwhich doesn’t inherently have an energy storage system to\ncope with the energy. Several methods to provide this energy\nfrom the DC-link have been proposed, such as increasing the\nDC capacitance by installing distributed capacitors along the\nDC line [107]. The DC voltage can also be modiﬁed to provide\nthis energy, but in HVDC systems, there are strict limitations\nregarding DC voltage due to isolation and operation issues\n[108].\nIn a multi-terminal HVDC conﬁguration with a master-slave\ncontrol scheme, the energy required to provide synthetic inertia\ncan be easily obtained from the master station as well as the\nAC system is large enough to be considered as an inﬁnite\nsystem [109]. Distributed battery energy storage connected to\neach submodule of the HVDC station can provide the required\nenergy to implement synthetic inertia. The main challenge of\nthis alternative is the internal current and energy control to\nkeep the batteries charged without compromise the control\nof AC and DC currents [110]. As an alternative to battery\nenergy storage installation, the HVDC can be also equipped\nwith additional controller to exploit the energy reserve of\nnearby ﬂexible voltage-dependent loads to implement primary\nfrequency control or synthetic inertia [111].\nFinally, in offshore wind farms connected by an HVDC\nlink to the coast, the inland station can provide synthetic\ninertia using the kinetic energy of the wind turbines. Although\nthis energy can be obtained by coordinating both HVDC\nstations, a communication-free strategy is preferred in which\nthe synthetic inertia control extracts energy from the DC line\nand the other station detects the variation of DC voltage and\ncompensate it by extracting the energy from the turbines [112].\nC. Operation with weak grids\nWeak grids are electrical systems in which the frequency\nand voltage amplitude have large variations depending on the\noperating conditions. The deﬁnition of a weak grid involves\nits impedance and inertia.\nDepending on the HVDC technology the interaction with\nweak grids can be completely different. HVDC systems based\non LCC are usually focused on bulk energy transmission and\nhence there are not designed to be connected to small weak\ngrids. The use of thyristors requires a precise synchronization\nwith the grid frequency and the amplitude of the voltage must\nbe stable for proper polarization of the semiconductors. In\nweak grids both features are variable, hence the performance\nof the LCC-HVDC can be affected. On the other hand, the\nphase angle control couples the active and reactive power and\na capacitor bank to provide reactive power compensation is\nusually designed for the nominal operation. In the case of\nweak grids, this capacitor can overcompensate reactive power\nleading to a reduced power factor and increasing the voltage\namplitude. Although these drawbacks, it is possible to modify\nthe HVDC station and its control to operate with weak grids if\nnecessary, for example, to power transmission to islands [113].\nAlternatively, and hybrid HVDC composed by a CCC-\nHVDC connected in series with a VSC-HVDC can reduce the\nreactive power required by the station allowing its use into\nweak grids [114].\nThe preferred choice to connect weak grids is using VSC-\nHVDC both in GFL and GFM operation. In GFL operation the\namount of transferred power is directly linked with the margin\nof stability, hence in a weak grid there exists a limitation\nto the transferred power [115]. In this condition, the vector\ncontrol cannot operate with large power demand, but it can\nbe modiﬁed tuning its parameters with a slower dynamics and\ngenerating a virtual voltage to improve synchronization [116].\nGrid forming operation of VSC-HVDC can provide a more\nsuitable connection to weak grids integrating the HVDC as a\npower generator which helps to stabilize the grid. A frequency-\nbased synchronization control has been proposed in which the\nHVDC can provide the nominal power and is not affected\nby variation in the system frequency. In case of failure, to\navoid high currents the internal loop can be switched to vector\ncontrol [117].\nD. HVDC breakers and fault protection\nA mechanical switch with a resonant circuit to provide zero\ncrossing current can be employed to implement a DC circuit\nbreaker (DCCB) using a full bridge circuit to simplify the de-\nsign of the oscillation cycle and provide consecutive interrup-\ntion capability [118]. Combining surge arresters, mechanical\nswitches, semiconductor devices and current limiters a circuit\nbreaker can be implemented. The precise synchronization of\nthese devices into the DCCB is a key factor to avoid large\novervoltages [119].\nLCC-HVDC suffer commutation failures which can lead to\nhigh currents through the devices and might destroy them. To\nmitigate this failure a predictive strategy in which the phase\nangle of the device is modiﬁed in order to reduce the effect\nof the failure has been proposed [120].\nVSC-HVDC can provide DC fault capability by changing\nthe design of the submodules in the MMC. However, this\nalternative allows large currents to circulate through the MMC\nand increase the costs. The mechanical and semiconductor\nhybrid DCCB with an active short-circuit path to ground\ncan be used in the MMC providing fast fault current clear-\nance without large current circulating through the submodules\n[121]. However, the design of hybrid DCCB is complex and\nhas to be evaluated in a large variety of grid conditions, for\nwhich fast and precise analytical methods are required [122].\nA combination of an ac circuit breaker (ACCB) and the\noperation of the MMC itself is proposed to manage both ac\nand dc faults. In the event of ac faults the ACCB operates as its\nnormal operation and for DC faults the converter is conﬁgured\nin a way also the ACCB clears the faults. In order to proper\noperation this structure requires a fast detection of dc faults\n[123].\nThe single-phase to ground is the most common ac fault.\nIn this condition a voltage sag is produced and the MMC\nrequires an strategy to avoid capacitor over-voltages and\nprovide fault tolerant operation isolating the fault from the\ndc side. Therefore, the power of the HVDC system is not\nreduced during the failure. A compensation control strategy\n13\ncan be developed to detect the unbalanced voltages and act\nover the current references to achieve the mentioned goals\n[124].\nFault protection in DC systems is challenging because short\ncircuit current has a very fast dynamic. The peak amplitude of\nthe short circuit current is necessary for conventional DCCB\nand ACCB correct operation. Thus, ultrafast fault detection,\nlocation and protection is still a mandatory challenge particu-\nlarly in HVDC and ESS. Thus, the development of solid-state\ncircuit breakers (SSCB) solutions are designed to meet the\nchallenging protection speed and power density required by\nfuture power grid.\nVI. C ONCLUSION AND FUTURE TRENDS\nSystem level ”power electronics” solutions for the electric\ngrid both in the voltage adaptation and power transfer are\ndiscussed in a common perspective in the paper. Both the\npresented technologies shall have the capability to operate in\ngrid-forming mode despite in meshed-grid operation also grid-\nfollowing mode is requested. Protections are also highlighted\nas a key technology where a strong interaction with power\nelectronics is expected. The possibility to inﬂuence the grid\nvoltage and consequently the power ﬂow and the connected\nloads is found to be one of the key features of smart trans-\nformer and transmission technologies.\nREFERENCES\n[1] J. Kassakian, R. Schmalensee, G. Desgroseilliers, T. Heidel, K. Afridi,\nA. Farid, J. Grochow, W. Hogan, H. Jacoby, J. Kirtley, H. Michaels,\nI. Perez-Arriaga, D. Perreault, N. Rose, G. Wilson, N. Abudaldah,\nM. Chen, P. Donohoo, S. Gunter, and M. Technology,The Future of the\nElectric Grid: An Interdisciplinary MIT Study. Massachusetts Institute\nof Technology, 01 2011.\n[2] K. Moslehi and R. Kumar, “A reliability perspective of the smart grid,”\nIEEE Transactions on Smart Grid, vol. 1, no. 1, pp. 57–64, 2010.\n[3] A. Q. Huang, M. L. Crow, G. T. Heydt, J. P. Zheng, and S. J. Dale, “The\nfuture renewable electric energy delivery and management (freedm)\nsystem: The energy internet,”Proceedings of the IEEE, vol. 99, no. 1,\npp. 133–148, 2011.\n[4] R. H. Lasseter, Z. Chen, and D. Pattabiraman, “Grid-forming inverters:\nA critical asset for the power grid,”IEEE Journal of Emerging and\nSelected Topics in Power Electronics, vol. 8, no. 2, pp. 925–935, 2020.\n[5] D. Boroyevich, I. Cvetkovic, R. Burgos, and D. Dong, “Intergrid: A\nfuture electronic energy network?” IEEE Journal of Emerging and\nSelected Topics in Power Electronics, vol. 1, no. 3, pp. 127–138, 2013.\n[6] J. Chen, M. Liu, G. De Carne, R. Zhu, M. Liserre, F. Milano, and\nT. O’Donnell, “Impact of smart transformer voltage and frequency\nsupport in a high renewable penetration system,” Electric Power\nSystems Research, vol. 190, p. 106836, 2021. [Online]. Available:\nhttps://www.sciencedirect.com/science/article/pii/S0378779620306362\n[7] “Loop Flows Final Advice, EU Report,” https://ec.europa.eu/energy/\nsites/ener/ﬁles/documents/201310 loop-ﬂows study.pdf, accessed:\n2013-10.\n[8] A. Venzke, L. Halilbaˇsi´c, A. Barr´e, L. Roald, and S. Chatzivasileiadis,\n“Chance-constrained ac optimal power ﬂow integrating hvdc lines\nand controllability,” International Journal of Electrical Power &\nEnergy Systems, vol. 116, p. 105522, 2020. [Online]. Available:\nhttps://www.sciencedirect.com/science/article/pii/S0142061519309275\n[9] B. Rego de Vasconcelos and J.-M. Lavoie, “Recent advances in\npower-to-x technology for the production of fuels and chemicals,”\nFrontiers in Chemistry, vol. 7, p. 392, 2019. [Online]. Available:\nhttps://www.frontiersin.org/article/10.3389/fchem.2019.00392\n[10] F. Li, W. Qiao, H. Sun, H. Wan, J. Wang, Y . Xia, Z. Xu, and P. Zhang,\n“Smart transmission grid: Vision and framework,”IEEE Transactions\non Smart Grid, vol. 1, no. 2, pp. 168–177, 2010.\n[11] “Sp energy networks,” https://www.spenergynetworks.co.uk/pages/lv\nengine.aspx#tablist1-tab5, accessed: 2013-10.\n[12] A. Ballanti and L. F. Ochoa, “V oltage-led load management in whole\ndistribution networks,”IEEE Transactions on Power Systems, vol. 33,\nno. 2, pp. 1544–1554, 2018.\n[13] M. Liserre, G. Buticchi, M. Andresen, G. De Carne, L. F. Costa, and\nZ.-X. Zou, “The smart transformer: Impact on the electric grid and\ntechnology challenges,”IEEE Industrial Electronics Magazine, vol. 10,\nno. 2, pp. 46–58, 2016.\n[14] R. Rosso, X. Wang, M. Liserre, X. Lu, and S. Engelken, “Grid-Forming\nConverters: Control Approaches, Grid-Synchronization, and Future\nTrends—A Review,” IEEE Open Journal of Industry Applications ,\nvol. 2, pp. 93–109, 2021.\n[15] ——, “Grid-forming converters: Control approaches, grid-\nsynchronization, and future trends—a review,”IEEE Open Journal of\nIndustry Applications, vol. 2, pp. 93–109, 2021.\n[16] J. Rocabert, A. Luna, F. Blaabjerg, and P. Rodr´ıguez, “Control of power\nconverters in ac microgrids,”IEEE Transactions on Power Electronics,\nvol. 27, no. 11, pp. 4734–4749, 2012.\n[17] R. Rosso, S. Engelken, and M. Liserre, “On the implementation of a\nfrt strategy for grid-forming (gfm) converters under symmetrical and\nasymmetrical grid faults,”IEEE Transactions on Industry Applications,\npp. 1–1, 2021.\n[18] Z.-X. Zou and M. Liserre, “Modeling phase-locked loop-based syn-\nchronization in grid-interfaced converters,”IEEE Transactions on En-\nergy Conversion, vol. 35, no. 1, pp. 394–404, 2020.\n[19] R. Rosso, M. Andresen, S. Engelken, and M. Liserre, “Analysis of\nthe interaction among power converters through their synchronization\nmechanism,” IEEE Transactions on Power Electronics, vol. 34, no. 12,\npp. 12 321–12 332, 2019.\n[20] L. Zhang, L. Harnefors, and H.-P. Nee, “Power-synchronization control\nof grid-connected voltage-source converters,” IEEE Transactions on\nPower Systems, vol. 25, no. 2, pp. 809–820, 2010.\n[21] S. D’Arco and J. A. Suul, “Virtual synchronous machines — clas-\nsiﬁcation of implementations and analysis of equivalence to droop\ncontrollers for microgrids,” in2013 IEEE Grenoble Conference, 2013,\npp. 1–7.\n[22] Q.-C. Zhong, P.-L. Nguyen, Z. Ma, and W. Sheng, “Self-synchronized\nsynchronverters: Inverters without a dedicated synchronization unit,”\nIEEE Transactions on Power Electronics, vol. 29, no. 2, pp. 617–630,\n2014.\n[23] R. Rosso, S. Engelken, and M. Liserre, “Robust stability investigation\nof the interactions among grid-forming and grid-following converters,”\nIEEE Journal of Emerging and Selected Topics in Power Electronics,\nvol. 8, no. 2, pp. 991–1003, 2020.\n[24] Y . Liao, X. Wang, F. Liu, K. Xin, and Y . Liu, “Sub-synchronous control\ninteraction in grid-forming vscs with droop control,” in2019 4th IEEE\nWorkshop on the Electronic Grid (eGRID), 2019, pp. 1–6.\n[25] M. E. Elkhatib, W. Du, and R. H. Lasseter, “Evaluation of inverter-\nbased grid frequency support using frequency-watt and grid-forming\npv inverters,” in2018 IEEE Power Energy Society General Meeting\n(PESGM), 2018, pp. 1–5.\n[26] “Black system south australia 28 september 2016,” [OL], https://www.\naemo.com.au/ Accessed March, 2017.\n[27] X. Wang, M. G. Taul, H. Wu, Y . Liao, F. Blaabjerg, and L. Harne-\nfors, “Grid-synchronization stability of converter-based resources—an\noverview,” IEEE Open Journal of Industry Applications, vol. 1, pp.\n115–134, 2020.\n[28] L. Harnefors, M. Hinkkanen, U. Riaz, F. M. M. Rahman, and\nL. Zhang, “Robust analytic design of power-synchronization control,”\nIEEE Transactions on Industrial Electronics, vol. 66, no. 8, pp. 5810–\n5819, 2019.\n[29] H. Geng, L. Liu, and R. Li, “Synchronization and reactive current\nsupport of pmsg-based wind farm during severe grid fault,” IEEE\nTransactions on Sustainable Energy, vol. 9, no. 4, pp. 1596–1604,\n2018.\n[30] M. G. Taul, X. Wang, P. Davari, and F. Blaabjerg, “An overview\nof assessment methods for synchronization stability of grid-connected\nconverters under severe symmetrical grid faults,”IEEE Transactions\non Power Electronics, vol. 34, no. 10, pp. 9655–9670, 2019.\n[31] T. Qoria, F. Gruson, F. Colas, G. Denis, T. Prevost, and X. Guil-\nlaud, “Critical clearing time determination and enhancement of grid-\nforming converters embedding virtual impedance as current limitation\nalgorithm,” IEEE Journal of Emerging and Selected Topics in Power\nElectronics, vol. 8, no. 2, pp. 1050–1061, 2020.\n[32] V . Telukunta, J. Pradhan, A. Agrawal, M. Singh, and S. G. Srivani,\n“Protection challenges under bulk penetration of renewable energy\nresources in power systems: A review,”CSEE Journal of Power and\nEnergy Systems, vol. 3, no. 4, pp. 365–379, 2017.\n14\n[33] H. J. Laaksonen, “Protection principles for future microgrids,”IEEE\nTransactions on Power Electronics, vol. 25, no. 12, pp. 2910–2918,\n2010.\n[34] J. Zhao, A. G´omez-Exp´osito, M. Netto, L. Mili, A. Abur, V . Terzija,\nI. Kamwa, B. Pal, A. K. Singh, J. Qi, Z. Huang, and A. P. S.\nMeliopoulos, “Power system dynamic state estimation: Motivations,\ndeﬁnitions, methodologies, and future work,” IEEE Transactions on\nPower Systems, vol. 34, no. 4, pp. 3188–3198, 2019.\n[35] Y . Liu, A. P. S. Meliopoulos, R. Fan, L. Sun, and Z. Tan, “Dynamic\nstate estimation based protection on series compensated transmission\nlines,” IEEE Transactions on Power Delivery, vol. 32, no. 5, pp. 2199–\n2209, 2017.\n[36] A. P. S. Meliopoulos, G. J. Cokkinides, P. Myrda, Y . Liu, R. Fan,\nL. Sun, R. Huang, and Z. Tan, “Dynamic state estimation-based\nprotection: Status and promise,”IEEE Transactions on Power Delivery,\nvol. 32, no. 1, pp. 320–330, 2017.\n[37] A. Q. Huang, “Medium-voltage solid-state transformer: Technology for\na smarter and resilient grid,”IEEE Industrial Electronics Magazine,\nvol. 10, no. 3, pp. 29–42, 2016.\n[38] S. Falcones, R. Ayyanar, and X. Mao, “A dc-dc multiport-converter-\nbased solid-state transformer integrating distributed generation and\nstorage,” IEEE Transactions on Power Electronics, vol. 28, no. 5, pp.\n2192–2203, 2013.\n[39] Y . Xu, J. Zhang, W. Wang, A. Juneja, and S. Bhattacharya, “Energy\nrouter: Architectures and functionalities toward energy internet,” in\n2011 IEEE International Conference on Smart Grid Communications\n(SmartGridComm), 2011, pp. 31–36.\n[40] F. Ruiz, M. A. Perez, J. R. Espinosa, T. Gajowik, S. Stynski, and\nM. Malinowski, “Surveying solid-state transformer structures and\ncontrols: Providing highly efﬁcient and controllable power ﬂow in\ndistribution grids,” IEEE Industrial Electronics Magazine, vol. 14,\nno. 1, pp. 56–70, 2020.\n[41] J. R. Aguero, E. Takayesu, D. Novosel, and R. Masiello, “Modernizing\nthe grid: Challenges and opportunities for a sustainable future,”IEEE\nPower and Energy Magazine, vol. 15, no. 3, pp. 74–83, 2017.\n[42] “Lv engine project website.” [Online]. Available: https://www.\nspenergynetworks.co.uk/pages/lv engine.aspx\n[43] “Ensure project website.” [Online]. Available: https://www.\nkopernikus-projekte.de/projekte/ensure\n[44] R. Zhu, M. Liserre, M. Langwasser, and C. Kumar, “Operation and\ncontrol of the smart transformer in meshed and hybrid grids: Choosing\nthe appropriate smart transformer control and operation scheme,”IEEE\nIndustrial Electronics Magazine, vol. 15, no. 1, pp. 43–57, 2021.\n[45] R. Zhu, G. De Carne, F. Deng, and M. Liserre, “Integration of large\nphotovoltaic and wind system by means of smart transformer,”IEEE\nTransactions on Industrial Electronics, vol. 64, no. 11, pp. 8928–8938,\n2017.\n[46] X. She, X. Yu, F. Wang, and A. Q. Huang, “Design and demonstration\nof a 3.6-kv-120-v/10-kva solid-state transformer for smart grid appli-\ncation,” IEEE Transactions on Power Electronics, vol. 29, no. 8, pp.\n3982–3996, 2014.\n[47] Z.-X. Zou, G. De Carne, G. Buticchi, and M. Liserre, “Smart\ntransformer-fed variable frequency distribution grid,”IEEE Transac-\ntions on Industrial Electronics, vol. 65, no. 1, pp. 749–759, 2018.\n[48] C. Kumar and M. Liserre, “A new prospective of smart transformer\napplication: Dual microgrid (dmg) operation,” inIECON 2015 - 41st\nAnnual Conference of the IEEE Industrial Electronics Society, 2015,\npp. 004 482–004 487.\n[49] C. Kumar, R. Zhu, G. Buticchi, and M. Liserre, “Sizing and soc\nmanagement of a smart-transformer-based energy storage system,”\nIEEE Transactions on Industrial Electronics, vol. 65, no. 8, pp. 6709–\n6718, 2018.\n[50] X. She, A. Q. Huang, S. Lukic, and M. E. Baran, “On integration of\nsolid-state transformer with zonal dc microgrid,”IEEE Transactions on\nSmart Grid, vol. 3, no. 2, pp. 975–985, 2012.\n[51] X. Yu, X. She, X. Zhou, and A. Q. Huang, “Power management for dc\nmicrogrid enabled by solid-state transformer,”IEEE Transactions on\nSmart Grid, vol. 5, no. 2, pp. 954–965, 2014.\n[52] D. Das, V . M. Hrishikesan, C. Kumar, and M. Liserre, “Smart\ntransformer-enabled meshed hybrid distribution grid,”IEEE Transac-\ntions on Industrial Electronics, vol. 68, no. 1, pp. 282–292, 2021.\n[53] J. Kuprat, M. Andresen, V . Raveendran, and M. Liserre, “Modular\nsmart transformer topology for the interconnection of multiple isolated\nac and dc grids,” in 2020 IEEE Energy Conversion Congress and\nExposition (ECCE), 2020, pp. 4836–4841.\n[54] H. Vadakkedath Madhavan, C. Kumar, and M. Liserre, “An mvdc based\nmeshed hybrid microgrid enabled using smart transformers,” IEEE\nTransactions on Industrial Electronics, pp. 1–1, 2021.\n[55] G. De Carne, M. Langwasser, R. Zhu, and M. Liserre, “Smart\ntransformer-based single phase-to-neutral fault management,” IEEE\nTransactions on Power Delivery, vol. 34, no. 3, pp. 1049–1059, 2019.\n[56] X. Gao, F. Sossan, K. Christakou, M. Paolone, and M. Liserre, “Con-\ncurrent voltage control and dispatch of active distribution networks\nby means of smart transformer and storage,”IEEE Transactions on\nIndustrial Electronics, vol. 65, no. 8, pp. 6657–6666, 2018.\n[57] S. Br¨uske, G. De Carne, and M. Liserre, “Multi-frequency power\ntransfer in a smart transformer based distribution grid,” inIECON 2014\n- 40th Annual Conference of the IEEE Industrial Electronics Society,\n2014, pp. 4325–4331.\n[58] L. Ferreira Costa, G. De Carne, G. Buticchi, and M. Liserre, “The smart\ntransformer: A solid-state transformer tailored to provide ancillary\nservices to the distribution grid,”IEEE Power Electronics Magazine,\nvol. 4, no. 2, pp. 56–67, 2017.\n[59] G. De Carne, M. Liserre, and C. V ournas, “On-line load sensitivity\nidentiﬁcation in lv distribution grids,” IEEE Transactions on Power\nSystems, vol. 32, no. 2, pp. 1570–1571, 2017.\n[60] G. De Carne, G. Buticchi, M. Liserre, and C. V ournas, “Load control\nusing sensitivity identiﬁcation by means of smart transformer,”IEEE\nTransactions on Smart Grid, vol. 9, no. 4, pp. 2606–2615, 2018.\n[61] S. Giacomuzzi, M. Langwasser, G. De Carne, G. Buja, and M. Liserre,\n“Smart transformer-based medium voltage grid support by means of\nactive power control,”CES Transactions on Electrical Machines and\nSystems, vol. 4, no. 4, pp. 285–294, 2020.\n[62] G. De Carne, G. Buticchi, M. Liserre, and C. V ournas, “Real-time\nprimary frequency regulation using load power control by smart\ntransformers,” IEEE Transactions on Smart Grid, vol. 10, no. 5, pp.\n5630–5639, 2019.\n[63] G. De Carne, G. Buticchi, Z. Zou, and M. Liserre, “Reverse power\nﬂow control in a st-fed distribution grid,”IEEE Transactions on Smart\nGrid, vol. 9, no. 4, pp. 3811–3819, 2018.\n[64] M. Couto, J. P. Lopes, and C. Moreira, “Control strategies for\nmulti-microgrids islanding operation through smart transformers,”\nElectric Power Systems Research , vol. 174, p. 105866, 2019.\n[Online]. Available: https://www.sciencedirect.com/science/article/pii/\nS0378779619301798\n[65] S. Pugliese, G. Buticchi, R. A. Mastromauro, M. Andresen, M. Liserre,\nand S. Stasi, “Soft-start procedure for a three-stage smart transformer\nbased on dual-active bridge and cascaded h-bridge converters,”IEEE\nTransactions on Power Electronics, vol. 35, no. 10, pp. 11 039–11 052,\n2020.\n[66] S. Pugliese, M. Andresen, R. A. Mastromauro, G. Buticchi, S. Stasi,\nand M. Liserre, “A new voltage balancing technique for a three-\nstage modular smart transformer interfacing a dc multibus,” IEEE\nTransactions on Power Electronics, vol. 34, no. 3, pp. 2829–2840,\n2019.\n[67] R. Zhu, M. Andresen, M. Langwasser, M. Liserre, J. P. Lopes,\nC. Moreira, J. Rodrigues, and M. Couto, “Smart transformer/large\nﬂexible transformer,” CES Transactions on Electrical Machines and\nSystems, vol. 4, no. 4, pp. 264–274, 2020.\n[68] R. Zhu, G. Buticchi, and M. Liserre, “Investigation on common-mode\nvoltage suppression in smart transformer-fed distributed hybrid grids,”\nIEEE Transactions on Power Electronics, vol. 33, no. 10, pp. 8438–\n8448, 2018.\n[69] Z.-X. Zou, G. Buticchi, and M. Liserre, “Grid identiﬁcation and adap-\ntive voltage control in a smart transformer-fed grid,”IEEE Transactions\non Power Electronics, vol. 34, no. 3, pp. 2327–2338, 2019.\n[70] Z. Zou, G. Buticchi, and M. Liserre, “Analysis and stabilization\nof a smart transformer-fed grid,” IEEE Transactions on Industrial\nElectronics, vol. 65, no. 2, pp. 1325–1335, 2018.\n[71] A. Benigni, T. Strasser, G. De Carne, M. Liserre, M. Cupelli, and\nA. Monti, “Real-Time Simulation-Based Testing of Modern Energy\nSystems: A Review and Discussion,” IEEE Industrial Electronics\nMagazine, vol. 14, no. 2, pp. 28–39, 2020.\n[72] M. Liserre, G. Buticchi, J. I. Leon, A. Marquez Alcaide, V . Raveendran,\nY . Ko, M. Andresen, V . G. Monopoli, and L. Franquelo, “Power\nrouting: A new paradigm for maintenance scheduling,”IEEE Industrial\nElectronics Magazine, vol. 14, no. 3, pp. 33–45, 2020.\n[73] J. Falck, C. Felgemacher, A. Rojko, M. Liserre, and P. Zacharias,\n“Reliability of power electronic systems: An industry perspective,”\nIEEE Industrial Electronics Magazine, vol. 12, no. 2, pp. 24–35, 2018.\n[74] M. Liserre, M. Andresen, L. Costa, and G. Buticchi, “Power routing\nin modular smart transformers: Active thermal control through uneven\n15\nloading of cells,”IEEE Industrial Electronics Magazine, vol. 10, no. 3,\npp. 43–53, 2016.\n[75] M. Andresen, K. Ma, G. Buticchi, J. Falck, F. Blaabjerg, and M. Lis-\nerre, “Junction temperature control for more reliable power electron-\nics,” IEEE Transactions on Power Electronics, vol. 33, no. 1, pp. 765–\n776, 2018.\n[76] Y . Ko, M. Andresen, G. Buticchi, and M. Liserre, “Power routing for\ncascaded h-bridge converters,”IEEE Transactions on Power Electron-\nics, vol. 32, no. 12, pp. 9435–9446, 2017.\n[77] Y . Ko, V . Raveendran, M. Andresen, and M. Liserre, “Thermally com-\npensated discontinuous modulation for mvac/lvdc building blocks of\nmodular smart transformers,”IEEE Transactions on Power Electronics,\nvol. 35, no. 1, pp. 220–231, 2020.\n[78] V . Raveendran, M. Andresen, G. Buticchi, and M. Liserre, “Thermal\nstress based power routing of smart transformer with chb and dab\nconverters,” IEEE Transactions on Power Electronics, vol. 35, no. 4,\npp. 4205–4215, 2020.\n[79] M. Andresen, V . Raveendran, G. Buticchi, and M. Liserre, “Lifetime-\nbased power routing in parallel converters for smart transformer ap-\nplication,” IEEE Transactions on Industrial Electronics, vol. 65, no. 2,\npp. 1675–1684, 2018.\n[80] S. Alvarez, M. Bellini, U. Vemulapati, F. Canales, and M. Rahimo,\n“SiC: Technology Enabler for MV DC/DC Galvanically Insulated Mod-\nular Converters,” in2018 International Power Electronics Conference\n(IPEC-Niigata 2018 -ECCE Asia), 2018, pp. 4009–4015.\n[81] T. Kimoto and Y . Yonezawa, “Current status and perspectives\nof ultrahigh-voltage sic power devices,” Materials Science in\nSemiconductor Processing, vol. 78, pp. 43–56, 2018, wide band gap\nsemiconductors technology for next generation of energy efﬁcient\npower electronics. [Online]. Available: https://www.sciencedirect.com/\nscience/article/pii/S1369800117319066\n[82] K. Sun, E. Raszmann, J. Wang, X. Lin, R. Burgos, D. Dong, and\nD. Boroyevich, “Modeling, design, and evaluation of active dv/dt\nbalancing for series-connected sic mosfets,” IEEE Transactions on\nPower Electronics, vol. 37, no. 1, pp. 534–546, 2022.\n[83] M. Aredes, R. Dias, A. F. Da Cunha De Aquino, C. Portela, and\nE. Watanabe, “Going the distance,”IEEE Industrial Electronics Mag-\nazine, vol. 5, no. 1, pp. 36–48, 2011.\n[84] T. Garrity, “Shaping the future of global energy delivery,”IEEE Power\nand Energy Magazine, vol. 1, no. 5, pp. 26–30, 2003.\n[85] W. Long and S. Nilsson, “Hvdc transmission: yesterday and today,”\nIEEE Power and Energy Magazine, vol. 5, no. 2, pp. 22–31, 2007.\n[86] D. Povh, “Use of hvdc and facts,”Proceedings of the IEEE, vol. 88,\nno. 2, pp. 235–245, 2000.\n[87] K. Schonleber, A. Oudalov, A. Krontiris, and P. Lundberg, “Opportu-\nnities for embedded high-voltage direct current: Evaluating the beneﬁts\nfor the legacy ac grid,”IEEE Power and Energy Magazine, vol. 18,\nno. 5, pp. 58–63, 2020.\n[88] D. Tiku, “dc power transmission: Mercury-arc to thyristor hvdc valves\n[history],”IEEE Power and Energy Magazine, vol. 12, no. 2, pp. 76–96,\n2014.\n[89] T. J. Hammons, V . F. Lescale, K. Uecker, M. Haeusler, D. Retzmann,\nK. Staschus, and S. Lepy, “State of the art in ultrahigh-voltage\ntransmission,” Proceedings of the IEEE, vol. 100, no. 2, pp. 360–390,\n2012.\n[90] M. Bahrman and P.-E. Bjorklund, “The new black start: System\nrestoration with help from voltage-sourced converters,”IEEE Power\nand Energy Magazine, vol. 12, no. 1, pp. 44–53, 2014.\n[91] M. Ashraf, Y . Nazih, F. Alsokhiry, K. H. Ahmed, A. S. Abdel-\nKhalik, and Y . Al-Turki, “A New Hybrid Dual Active Bridge Modular\nMultilevel Based DC–DC Converter for HVDC Networks,” IEEE\nAccess, vol. 9, pp. 62 055–62 073, 2021.\n[92] T. Yin, C. Xu, L. Lin, and K. Jing, “A SiC MOSFET and Si IGBT\nHybrid Modular Multilevel Converter With Specialized Modulation\nScheme,” IEEE Transactions on Power Electronics, vol. 35, no. 12,\npp. 12 623–12 628, 2020.\n[93] S. Ji, L. Zhang, X. Huang, J. Palmer, F. Wang, and L. M. Tolbert,\n“A Novel V oltage Balancing Control With dv/dt Reduction for 10-kV\nSiC MOSFET-Based Medium V oltage Modular Multilevel Converter,”\nIEEE Transactions on Power Electronics, vol. 35, no. 11, pp. 12 533–\n12 543, 2020.\n[94] C. A. Rojas, S. Kouro, M. A. Perez, and J. Echeverria, “DC–DC MMC\nfor HVdc Grid Interface of Utility-Scale Photovoltaic Conversion\nSystems,” IEEE Transactions on Industrial Electronics, vol. 65, no. 1,\npp. 352–362, 2018.\n[95] J. Jardini et al., “Guide for the development of models for hvdc\nconverters in a hvdc grid - working group b4.57.”\n[96] M. A. Perez, S. Ceballos, G. Konstantinou, J. Pou, and R. P. Aguilera,\n“Modular multilevel converters: Recent achievements and challenges,”\nIEEE Open Journal of the Industrial Electronics Society, vol. 2, pp.\n224–239, 2021.\n[97] V . Spudic and T. Geyer, “Model Predictive Control Based on Optimized\nPulse Patterns for Modular Multilevel Converter STATCOM,”IEEE\nTransactions on Industry Applications, vol. 55, no. 6, pp. 6137–6149,\n2019.\n[98] W. Du, Z. Zhen, and H. Wang, “The subsynchronous oscillations\ncaused by an lcc hvdc line in a power system under the condition of\nnear strong modal resonance,”IEEE Transactions on Power Delivery,\nvol. 34, no. 1, pp. 231–240, 2019.\n[99] N. Prabhu and K. R. Padiyar, “Investigation of subsynchronous reso-\nnance with vsc-based hvdc transmission systems,”IEEE Transactions\non Power Delivery, vol. 24, no. 1, pp. 433–440, 2009.\n[100] L. Harnefors, N. Johansson, and L. Zhang, “Impact on interarea modes\nof fast hvdc primary frequency control,”IEEE Transactions on Power\nSystems, vol. 32, no. 2, pp. 1350–1358, 2017.\n[101] G. Pinares and M. Bongiorno, “Analysis and mitigation of instabil-\nities originated from dc-side resonances in vsc-hvdc systems,”IEEE\nTransactions on Industry Applications, vol. 52, no. 4, pp. 2807–2815,\n2016.\n[102] Y . Liu, A. Raza, K. Rouzbehi, B. Li, D. Xu, and B. W. Williams,\n“Dynamic resonance analysis and oscillation damping of multiterminal\ndc grids,”IEEE Access, vol. 5, pp. 16 974–16 984, 2017.\n[103] W. Du, Q. Fu, and H. Wang, “Subsynchronous oscillations caused by\nopen-loop modal coupling between vsc-based hvdc line and power\nsystem,” IEEE Transactions on Power Systems, vol. 33, no. 4, pp.\n3664–3677, 2018.\n[104] L. Harnefors, N. Johansson, L. Zhang, and B. Berggren, “Interarea\noscillation damping using active-power modulation of multiterminal\nhvdc transmissions,” IEEE Transactions on Power Systems, vol. 29,\nno. 5, pp. 2529–2538, 2014.\n[105] J. Bj¨ork, K. H. Johansson, and L. Harnefors, “Fundamental perfor-\nmance limitations in utilizing hvdc to damp interarea modes,”IEEE\nTransactions on Power Systems, vol. 34, no. 2, pp. 1095–1104, 2019.\n[106] M. J. Perez-Molina, D. M. Larruskain, P. Egu´ıa Lopez, and G. Buigues,\n“Challenges for Protection of Future HVDC Grids,”Frontiers in Energy\nResearch, vol. 8, no. 33, pp. 1–6, 2020.\n[107] J. Zhu, C. D. Booth, G. P. Adam, A. J. Roscoe, and C. G. Bright,\n“Inertia emulation control strategy for vsc-hvdc transmission systems,”\nIEEE Transactions on Power Systems, vol. 28, no. 2, pp. 1277–1287,\n2013.\n[108] M. M. Kabsha and Z. H. Rather, “A new control scheme for fast\nfrequency support from hvdc connected offshore wind farm in low-\ninertia system,” IEEE Transactions on Sustainable Energy, vol. 11,\nno. 3, pp. 1829–1837, 2020.\n[109] L. Huang, H. Xin, H. Yang, Z. Wang, and H. Xie, “Interconnecting\nvery weak ac systems by multiterminal vsc-hvdc links with a uniﬁed\nvirtual synchronous control,”IEEE Journal of Emerging and Selected\nTopics in Power Electronics, vol. 6, no. 3, pp. 1041–1053, 2018.\n[110] P. D. Judge and T. C. Green, “Modular multilevel converter with\npartially rated integrated energy storage suitable for frequency support\nand ancillary service provision,”IEEE Transactions on Power Delivery,\nvol. 34, no. 1, pp. 208–219, 2019.\n[111] M. Langwasser, G. De Carne, M. Liserre, and M. Biskoping, “Primary\nfrequency regulation using hvdc terminals controlling voltage depen-\ndent loads,”IEEE Transactions on Power Delivery, vol. 36, no. 2, pp.\n710–720, 2021.\n[112] X. Liu and A. Lindemann, “Control of vsc-hvdc connected offshore\nwindfarms for providing synthetic inertia,”IEEE Journal of Emerging\nand Selected Topics in Power Electronics, vol. 6, no. 3, pp. 1407–1417,\n2018.\n[113] A. Yogarathinam, J. Kaur, and N. R. Chaudhuri, “Impact of inertia\nand effective short circuit ratio on control of frequency in weak grids\ninterfacing lcc-hvdc and dﬁg-based wind farms,”IEEE Transactions\non Power Delivery, vol. 32, no. 4, pp. 2040–2051, 2017.\n[114] J. Kaur and N. R. Chaudhuri, “A coordinating control for hybrid hvdc\nsystems in weak grid,”IEEE Transactions on Industrial Electronics,\nvol. 66, no. 11, pp. 8284–8295, 2019.\n[115] J. Khazaei, M. Beza, and M. Bongiorno, “Impedance analysis of\nmodular multi-level converters connected to weak ac grids,” IEEE\nTransactions on Power Systems, vol. 33, no. 4, pp. 4015–4025, 2018.\n[116] M. F. M. Arani and Y . A.-R. I. Mohamed, “Analysis and performance\nenhancement of vector-controlled vsc in hvdc links connected to very\nweak grids,”IEEE Transactions on Power Systems, vol. 32, no. 1, pp.\n684–693, 2017.\n16\n[117] C. Guo, W. Liu, C. Zhao, and R. Iravani, “A frequency-based syn-\nchronization approach for the vsc-hvdc station connected to a weak\nac grid,” IEEE Transactions on Power Delivery, vol. 32, no. 3, pp.\n1460–1470, 2017.\n[118] W. Sima, Z. Fu, M. Yang, T. Yuan, P. Sun, X. Han, and Y . Si, “A novel\nactive mechanical hvdc breaker with consecutive interruption capability\nfor fault clearances in mmc-hvdc systems,” IEEE Transactions on\nIndustrial Electronics, vol. 66, no. 9, pp. 6979–6989, 2019.\n[119] S. Wang, C. E. Ugalde-Loo, C. Li, J. Liang, and O. D. Adeuyi, “Bridge-\ntype integrated hybrid dc circuit breakers,”IEEE Journal of Emerging\nand Selected Topics in Power Electronics, vol. 8, no. 2, pp. 1134–1151,\n2020.\n[120] S. Mirsaeidi, X. Dong, D. Tzelepis, D. M. Said, A. Dy ´sko, and\nC. Booth, “A predictive control strategy for mitigation of commutation\nfailure in lcc-based hvdc systems,” IEEE Transactions on Power\nElectronics, vol. 34, no. 1, pp. 160–172, 2019.\n[121] G. Liu, F. Xu, Z. Xu, Z. Zhang, and G. Tang, “Assembly hvdc breaker\nfor hvdc grids with modular multilevel converters,”IEEE Transactions\non Power Electronics, vol. 32, no. 2, pp. 931–941, 2017.\n[122] M. Langwasser, G. De Carne, M. Liserre, and M. Biskoping, “Fault cur-\nrent estimation in multi-terminal hvdc grids considering mmc control,”\nIEEE Transactions on Power Systems, vol. 34, no. 3, pp. 2179–2189,\n2019.\n[123] S. Wang, K. H. Ahmed, G. P. Adam, A. M. Massoud, and B. W.\nWilliams, “A novel converter station structure for improving mul-\ntiterminal hvdc system resiliency against ac and dc faults,” IEEE\nTransactions on Industrial Electronics, vol. 67, no. 6, pp. 4270–4280,\n2020.\n[124] S. Cui, H.-J. Lee, J.-J. Jung, Y . Lee, and S.-K. Sul, “A comprehensive\nac-side single-line-to-ground fault ride through strategy of an mmc-\nbased hvdc system,”IEEE Journal of Emerging and Selected Topics\nin Power Electronics, vol. 6, no. 3, pp. 1021–1031, 2018.\nMarco Liserre (S’00-M’02-SM’07-F￿13) received\nthe MSc and PhD degree in Electrical Engineering\nfrom the Bari Technical University in 1998 and\n2002, respectively. He has been Associate Profes-\nsor at Bari Technical University and from 2012\nProfessor in reliable power electronics at Aalborg\nUniversity (Denmark). From 2013 he is Full Pro-\nfessor and he holds the Chair of Power Electronics\nat Kiel University (Germany). He got offered and\ndeclined professorships at the Technical Universities\nof Ilmenau, Munich and Hamburg. He has published\nmore than 600 technical papers (1/3 of them in international peer-reviewed\njournals), a book and 2 granted Patents, with more under evaluation, some\nof them involving companies. These works have received more than 45000\ncitations. Marco Liserre is listed in ISI Thomson report “The world’s most\ninﬂuential scientiﬁc minds” from 2014. In 2022 he joined part-time Fraunhofer\nISIT as Deputy Director and Director of a new Center for “Electronic Energy\nSystems” funded for 5 Million Euro. He is member of IAS, PELS, PES and\nIES. He has been serving all these societies in different capacities. In PELS\nhe is AdCom member (second mandate), Co-Editor of the IEEE Open Access\nJournal in Power Electronics, Associate Editor of TPEL and JESTPE, Guest\nEditor of Several Special Issues of JESTPE, Technical Committee Chairman\nof the new Committee on Electronic Power Grid Systems and Member of the\nIEEE Digital Committee, IES-Liaison responsible, eGrid 2021 Workshop Co-\nchairman and PEDG 2022 Co-chairman and organizer in Kiel. He has received\nthe IES 2009 Early Career Award, the IES 2011 Anthony J. Hornfeck Service\nAward, the 2014 Dr. Bimal Bose Energy Systems Award, the 2017 IEEE PELS\nSustainable Energy Systems Technical Achievement Award, the 2018 IEEE-\nIES Mittelmann Achievement Award and 6 IEEE Journal Awards.\nMarcelo A. Perez(Senior Member, IEEE) received\nthe Engineer degree in electronic engineering, the M.\nSc. degree in electrical engineering, and the D. Sc.\ndegree in electrical engineering from the University\nof Concepcion, Concepcion, Chile, in 2001, 2003,\nand 2006, respectively. From 2006 to 2009, he held\na postdoctoral position, and from 2009 to 2013, he\nworked as an associate researcher at the Universidad\nTecnica Federico Santa Maria, Valparaiso, Chile.\nFrom 2013 to 2015, Dr. Perez worked as a research\nfellow at the Technical University of Dresden, Dres-\nden, Germany. From 2015 to 2019 he was an assistant professor and since\n2019 he is an associate professor at the department of electronic engineering\nin Universidad Tecnica Federico Santa Maria. Dr. Perez is currently a main\nresearcher of the Advanced Center for Electric and Electronic Engineering\n(AC3E) and an associated researcher of the Solar Energy Research Center\n(SERC- Chile). He has co-authored two book chapters and more than 140\njournal and conference papers. Dr. Perez was the recipient of the IEEE\nIndustry Applications Magazine 1st prize paper award of 2012, the second-\nbest paper award in the IEEE Transactions on Power Electronics in 2016.\nHe has been the IEEE-IES Region 9 Chapter Coordinator, and currently he\nis President of the IEEE-IES Chapter Chile. Dr. Perez is Associate Editor\nin the IEEE Transactions on Power Electronics and the IEEE Transactions\non Industrial Electronics. His main interests are multilevel power converters\ntopologies, control of power converters, electromobility, smart grids, HVDC\nsystems, and energy harvesting.\nMarius Langwasser received his M.Sc. and Ph.D.\ndegrees from Kiel University, Germany, in 2016\nand 2021, respectively. Currently, he is senior post-\ndoctoral scientiﬁc staff member and leader of the\ngroup “Hybrid Grids” at the Chair of Power Elec-\ntronics at Kiel University, Germany. He is responsi-\nble for the Kopernikus-project ENSURE and Marie\nSkłodowska-Curie Research Action Wingrid. His\nresearch interests include control and protection of\nhybrid grids and ancillary service provision with\nHVDC and Smart Transformers.\nChristian A. Rojas (Senior Member, IEEE) was\nborn in Vallenar, Chile, in 1984. He received the\nEngineer degree in electronic engineering from the\nUniversidad de Concepci´on, Concepci´on, Chile, in\n2009, and the Ph.D. degree in electronic engineering\nfrom the Universidad T´ecnica Federico Santa Mar´ıa\n(UTFSM), Valpara´ıso, Chile, in 2013.\nHe is currently an Assistant Professor with the\nElectronic Engineering Department at UTFSM. His\nresearch interests include electric transportation,\nphotovoltaic conversion systems and model predic-\ntive control of power converters and drives.\nDr. Rojas is an Associate Editor for the IEEE JOURNAL OF EMERGING\nAND SELECTED TOPICS IN INDUSTRIAL ELECTRONICS and IET\nPOWER ELECTRONICS.\nZiqi Zhou (Student Member, IEEE) received the\nB.S. degree in Electrical Engineering and Automa-\ntion from the School of Electrical and Electronic\nEngineering, Huazhong University of Science and\nTechnology, Wuhan, China, in 2016, and the M.Sc.\ndegree in Electrical Engineering from China Uni-\nversity of Mining and Technology, Xuzhou, China,\nin 2020. He is currently working toward the Ph.D.\ndegree at the Chair of Power Electronics, Kiel\nUniversity, Germany. His current research interests\ninclude control of power converters."
}