{
  "title": "Comparative Evaluation of 3D Filaments, Used in Additive Manufacturing of Biomedical Tools; Using Fuzzy Promethee.",
  "url": "https://openalex.org/W4294316914",
  "year": 2022,
  "authors": [
    {
      "id": "https://openalex.org/A4294320635",
      "name": "Basil Duwa",
      "affiliations": [
        "Near East University"
      ]
    },
    {
      "id": "https://openalex.org/A4293787033",
      "name": "Efe Precious Onakpojeruo",
      "affiliations": [
        "Near East University"
      ]
    },
    {
      "id": "https://openalex.org/A2741776933",
      "name": "Berna Uzun",
      "affiliations": [
        "Universidad Carlos III de Madrid"
      ]
    },
    {
      "id": "https://openalex.org/A2808024198",
      "name": "Ilker Ozsahin",
      "affiliations": [
        "Weill Cornell Medicine",
        "Cornell University"
      ]
    },
    {
      "id": "https://openalex.org/A2710443081",
      "name": "Dilber Uzun Ozsahin",
      "affiliations": [
        "University of Sharjah"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2043704558",
    "https://openalex.org/W2912231129",
    "https://openalex.org/W6602294205",
    "https://openalex.org/W4280649103",
    "https://openalex.org/W2768685444",
    "https://openalex.org/W3212975868",
    "https://openalex.org/W4226200175",
    "https://openalex.org/W3194659115",
    "https://openalex.org/W2805786898",
    "https://openalex.org/W3132825741",
    "https://openalex.org/W3209627406",
    "https://openalex.org/W3057706408",
    "https://openalex.org/W3186785514",
    "https://openalex.org/W3182830930",
    "https://openalex.org/W3100817146",
    "https://openalex.org/W3217574076",
    "https://openalex.org/W3212990511",
    "https://openalex.org/W3021852216",
    "https://openalex.org/W3121928962",
    "https://openalex.org/W3200859975",
    "https://openalex.org/W2765579251",
    "https://openalex.org/W2089320091",
    "https://openalex.org/W3191506263",
    "https://openalex.org/W2967566376",
    "https://openalex.org/W2605568328"
  ],
  "abstract": "Abstract The additive manufacturing technique is currently revolutionizing the healthcare industry. This technology utilizes modern approaches to develop advanced medical equipment and artificial body tissues. The 3D filament is regarded as one of the major components of the 3D printing technique. These filaments have peculiar characters to print different objects. Similarly, hospital and biomedical tools, such as syringes, catheters, insulin pens, and surgical gloves, for instance, are produced using non-biodegradable plastics, which could be toxic and unsafe to the environment. Therefore, there is a need to produce these biomedical tools using safe and environmentally friendly filaments. Therefore, this study evaluates and compares the major 3D filaments used in Fused deposition modeling, using a multi-criteria decision-making technique called the fuzzy preference ranking organization method for enrichment evaluations (PROMETHEE). The variables were evaluated based on parameters such as strength, warp, flexibility, heat resistance, biodegradability, average cost, resistance to UV, food safety, print temperature, speed, and ease of print. The result recorded PLA with a net flow of 0.0316 as the preferred and extensively used 3D printing filaments in additive manufacturing of biomedical tools based on applied parameters/set preference, selected criteria, and important weights allocated to the selected criteria. PC is second with a net flow of 0.0069. In contrast, TPE ranked least with a negative net flow result of -0.0327.",
  "full_text": "Page 1/9\nComparative Evaluation of 3D Filaments, Used in Additive Manufacturing ofBiomedical Tools; Using Fuzzy Promethee.\nBasil Duwa Near East University\nEfe Precious Onakpojeruo  (  efeprecious.onakpojeruo@neu.edu.tr )Near East University\nBerna Uzun Carlos III University of Madrid, Statistics Department, Getafe, Madrid, Spain\nIlker Ozsahin Brain Health Imaging Institute, Department of Radiology, Weill Cornell Medicine, New York, New York 19965, USA\nDilber Uzun Ozsahin University of Sharjah, Medical Diagnostic Imaging Department, College of Health Science, Sharjah, United Arab Emirates\nResearch Article\nKeywords: Additive manufacturing, Biomedical tools, Fuzzy PROMETHEE, 3D \u0000laments\nPosted Date: September 2nd, 2022\nDOI: https://doi.org/10.21203/rs.3.rs-2020207/v1\nLicense:     This work is licensed under a Creative Commons Attribution 4.0 International License.   Read Full License\nPage 2/9\nAbstract\nThe additive manufacturing technique is currently revolutionizing the healthcare industry. This technology utilizes modern approaches to develop advancedmedical equipment and arti\u0000cial body tissues. The 3D \u0000lament is regarded as one of the major components of the 3D printing technique. These \u0000lamentshave peculiar characters to print different objects. Similarly, hospital and biomedical tools, such as syringes, catheters, insulin pens, and surgical gloves, forinstance, are produced using non-biodegradable plastics, which could be toxic and unsafe to the environment. Therefore, there is a need to produce thesebiomedical tools using safe and environmentally friendly \u0000laments. Therefore, this study evaluates and compares the major 3D \u0000laments used in Fuseddeposition modeling, using a multi-criteria decision-making technique called the fuzzy preference ranking organization method for enrichment evaluations(PROMETHEE). The variables were evaluated based on parameters such as strength, warp, \u0000exibility, heat resistance, biodegradability, average cost, resistanceto UV, food safety, print temperature, speed, and ease of print. The result recorded PLA with a net \u0000ow of 0.0316 as the preferred and extensively used 3Dprinting \u0000laments in additive manufacturing of biomedical tools based on applied parameters/set preference, selected criteria, and important weightsallocated to the selected criteria. PC is second with a net \u0000ow of 0.0069. In contrast, TPE ranked least with a negative net \u0000ow result of -0.0327.\n1. Introduction\nAdditive manufacturing (AM), is considered one of the most sophisticated technologies, used in constructing complex geometries and structures by thelayering of three-dimensional model data. Similarly, AM is commonly known as 3D printing, due to the character it exhibits in the creation of three-dimensionalobjects from digital CAD or 3D models. Thus, this includes processes such as depositing, connecting, or solidifying materials in layers, under computer controlto create a three-dimensional object. In contrast to the traditional methods, additive manufacturing (AM) techniques construct objects, by adding materialssimultaneously to one another using the 3D printer. Hence, the use of AM lowers material waste, decreases production time, and removes the majority ofmanual procedures that need skill. According to statistics, the adoption of AM technologies, as opposed to conventional machining, has decreased rawmaterial waste globally by as much as 40 percent [1].\nFurthermore, on February 01, 2022, the research and markets global publishers in 3-D printing, predicted the medical and pharmaceutical applications of thetechnique around the globe. It was estimated that the Additive manufacturing market in healthcare was valued above one million dollars with a clearestimation of more than \u0000ve million dollars in revenue. Undoubtedly, this technique is rapidly emerging as an improved and distinct multi-dimensionalresearch \u0000eld that can blend with any \u0000eld. The number of ways that 3D printing can be used in medicine is fast growing and is anticipated to completelytransform health care. The fabrication of tissue and organs, the creation of custom-designed implants, anatomical products, prosthetics, and drug delivery areamong the advantages of the AM technique [2].\n1.1 Classi\u0000cation of Additive Manufacturing:\nAdditive manufacturing is adopted in biomedical applications used in the printing of individualized patient-speci\u0000c implants for a variety of body parts. Theprinting of prosthetics, and the printing of various types of surgical equipment and medical devices are all examples of how AM has transformed the medical\u0000eld. AM makes innovation possible by facilitating the simple fabrication of exceedingly complex structures through the layer-by-layer construction ofcomponent elements [3].\n3-D \u0000laments are important components, used in the additive manufacturing processes, that enable the smooth running of the printer and in getting thedesired product after printing. In other words, Fused deposition modeling (FDM) 3D printing \u0000lament is commonly utilized in general applications in different\u0000elds of study. A wide variety of \u0000laments are available, each with its unique properties and printing temperature requirements. Both 1.75 mm and 2.85 mm\u0000lament is commonly available in both standard diameter sizes [4].\n1.2 Applications of Additive manufacturing (AM):\n1.2.1. Medical Applications:\nIn the medical sector, researchers have applied different additive manufacturing methods and techniques. The American Professional Association (APA)predicted that the applications of additive manufacturing will grow by $9.7 billion in dentistry, which is about 35 percent annually. Therefore, the use of 3Dprinting in the medical \u0000eld is also increasing daily. Thus, this printing method contributes to around 11 percent of the medical industry's revenue, regardlessof the medical device or implant it is used [6]. The production of customized medical devices or parts is driving an increase in the application of additivemanufacturing. Using scienti\u0000c evaluation and statistics from the Web of Science, a total of 1157 research papers published on additive manufacturing forbiomedical purposes and applications since 2011 [7].\nEvery patient is considered to be different and unique, which thus reveals the potential of AM in medical \u0000elds and their applications tailored to each patient.Similarly, Personalized implants, medical models, and saw guides are the most common medical clinical applications. 3D printing in medicine can make useof a wide range of materials. The utility/properties necessary in the manufacturing of the \u0000nal part or AM model are the primary determinants in materialselection.\nSurgeons have been looking into the possibility of using 3D printing technology to develop a wide variety of medical applications. The patient-speci\u0000canatomical components, as well as the patient-centered prosthesis and implants, are all able to be manufactured with accurate precision using 3D printingtechnology. The widespread use of this technology in the healthcare sector is demonstrated by the massive popularity of its application [8].\n1.2.2. Applications in Architecture:\nPage 3/9\nThe usage of a blueprint or plan in the design process of a building makes additive manufacturing a highly helpful tool for architects. Architects often designbuildings using one of these two methods. These designs are too di\u0000cult to interpret for the average person because of their level of detail. Many times,architects are unable to precisely convey their ideas, therefore they are forced to create renderings, which can be a time-consuming process. All of that hasbeen changed because to AM, as models are now direct scaled representations of the drawings, and it helps bring gorgeous concepts to life. It could be anadded source of value for a project or the deciding factor in whether or not your proposal is successful [9].\n1.2.3. Applications in Education:\nThe goal and objective of any academic institution that is interested in improving the synergy and cooperation that exist between students and teachers is thepursuit of better strategies to improve the quality of education. As a consequence, educational institutions have been compelled to keep up with the rapidchanges that have been occurring in technology. Students today are getting more and more experience with new and cutting-edge methods of education, suchas online virtual classrooms and online learning. AM is a topic that is receiving a great deal of attention in the world of education currently. AM has alsoevolved as modern technology and is increasingly being acknowledged as an innovative educational facilitator. This technique has found its way into severalschool systems, research institutions, and even curriculum design, as academic establishments have come to realize its signi\u0000cance and how it assists in thesuccess of education. This is because these institutions have come to realize that this technology enables the achievement of successful educationalexperiences [10].\n1.2.4. Application in Marketing:\nTo exhibit new items to consumers and prospects before they go on sale, salespeople and marketers bene\u0000t greatly from using modeled products. Consumersgain a deeper understanding and more lasting memories of a product when they are allowed to physically interact with it [11].\n1.2.5. Application to the Environment:\nNowadays, additive manufacturing, or AM, is a technology that is widely employed and has various applications in a variety of businesses as well as research\u0000elds. This is because this technology offers a wide variety of advantages in the manufacturing and design processes, as well as in the distribution of goodsto end users. The freedom of design, \u0000exibility, high levels of personalization, and waste reduction are among the primary advantages offered by thistechnology. There are also many other advantages. In addition, compared to the methods that are more traditionally used, AM is seen as a moreenvironmentally friendly way of production. It offers a wide range of advantages in terms of sustainable manufacturing design, quality, and optimization.\nThe importance of Additive manufacturing cannot be over-emphasized, it cut across every sector of human life. However, its application in healthcare is one ofthe most important criteria, that directly affect human life. Therefore, it has become imperative to assess the major \u0000laments used in the production of variousmaterials [12].\n2. Related Studies\nIt was projected that the value of the global additive manufacturing market would reach USD 13.84 billion in 2021, and between 2022 and 2030, a compoundannual growth rate (CAGR) of 20.8 percent is forecast. Similarly, it is expected that the total number of 3D printer units shipped around the world wouldincrease to 21.5 million by the year 2030, from a \u0000gure of 2.2 million in 2021. It is anticipated that factors such as an increase in demand for prototypeapplications from a variety of industries and industrial verticals, such as healthcare, automotive, and aerospace & military, as well as active research anddevelopment in 3D printing, will drive the market. This growth in demand for prototype applications is expected to occur in the coming years [13].\nLuyu Zhou (2018), constructively analyzed the different forms of 3D printers and materials used in art design, focusing on China. In his study, Zhou chooseChinese art designers as the objects to express the signi\u0000cance of 3D printing to their designs, based on the \u0000ndings of the study of the situation of 3Dprinting in China. He then separates all of the art design \u0000elds into 14 distinct specialties based on the departments that are established in China's mostprestigious universities and then analyzes the professional characteristics of the work performed in each specialty to determine the preferred requirementsand primary concerns that art designers from each specialty to consider when selecting and making use of 3D printers and materials. Zhou provides somerecommendations for art designers working in a variety of professions regarding the selection and purchase of 3D printers and materials by analyzing thebene\u0000ts and drawbacks of performance characteristics of 3D printers, including printing accuracy, printing speed, printable materials, and printing volume. Inaddition, the author examines the colors, tensile strength, and \u0000exibility of the materials that are most commonly found on the Chinese market and has apositive reputation [14].\nSimilarly, Kumar et al compared the life cycle assessment of different 3D printed products with \u0000lament materials such as PLA, PETG, and ABS. In their study,the environmental effects of three of the most common materials used for 3D printing were investigated: PLA, PETG, and ABS. The evaluation is carried outconsidering the entirety of the product's life cycle, to determine the relative impacts of each phase. The PETG material was discovered to be the friendliest tothe environment across all of the mid-point and end-point characteristics, whereas the ABS material was discovered to be the least favorable to theenvironment. PLA material, despite coming from natural resources and being capable of biodegradation, has the largest negative impacts on water depletionand freshwater ecotoxicity. This is even though PLA material is biodegradable [15].\n2.1 Types of Filaments:\na. Polylactic Acid (PLA):\nPLA is a more popular 3D printer \u0000lament because of its general characteristics, such as simplicity, availability, and biodegradability. It is odorless andpossesses a pleasant smell, because of its natural state, made from sugarcane, maize starch, and other organic products. In addition, the printing temperature\nPage 4/9\nis quite low, because this \u0000lament does not easily warp, and a heating bed is not required in the printing.\nPLA has become a widely used material due to its low production costs. It was the second most widely used bioplastic in the world in 2010, even though it isnot a commodity polymer. Several \u0000aws in the physical and processing aspects of this technology have prevented it from being widely used. In 3D printing,PLA is the most commonly used plastic \u0000lament material. Therefore, it is a suitable material for this because of its low melting point, strong strength, minimalthermal expansion, good layer adhesion, and high heat resistance when annealed. In comparison to other commonly used 3D printing polymers, PLA's heatresistance is the lowest without annealing [16].\nb. Acrylonitrile butadiene styrene (ABS):\nAcrylonitrile butadiene styrene abbreviated as ABS is a 3D printing \u0000lament that is resistant to high temperatures. However, PLA is the material that is morecommonly used for everyday and casual applications, but ABS has better mechanical characteristics. Additionally, ABS warp more but has morecomplications during printing. Furthermore, ABS is a terpolymer created through the polymerization of styrene, polybutadiene, and acrylonitrile. Possibleproportions include 15–35% acrylonitrile, 40–60 percent styrene, and 5–30 percent butadiene.\nSome of the disadvantages of ABS \u0000laments is that it requires adequate ventilation before use. Also, ABS that has been melted produces vapors that are bothpoisonous with an offensive smell. However, ABS is superior to PLA despite having some limitations. Because of its superior material qualities, it can tolerateboth high temperatures and a great deal of pressure. Make use of it for things that you frequently handle, heat, or drop [17].\nc. Polyethylene Terephthalate (PETG):\nPETG is the most popular type of thermoplastic polymer resin that belongs to the polyester family. It is utilized in the production of \u0000bers for garments,containers for beverages and foods, thermoforming for manufacturing, and engineering resins when combined with glass \u0000ber. Similarly, PETG is renownedfor its long-lasting properties, including its \u0000exibility, tolerance to high temperatures, and resistance to impact. It is commonly used to print functionalmaterials that will be subjected to sudden or prolonged stress. When compared to its contemporary \u0000laments, this \u0000lament is easier to print, clearer, and lessbrittle. However, PETG may be able to satisfy someone’s requirements if the person is undecided between PLA and ABS. Some of PETG’s characteristicsinclude its ability to print easily, similar to PLA, but it also has the \u0000exibility and resistance of ABS [18].\nd. Thermoplastic Elastomers (TPE):\nThermoplastic elastomers, also known as thermoplastic rubbers, are a type of copolymer or a physical combination of polymers (typically plastic and rubber)that include components with both thermoplastic and elastomeric attributes. The term \"thermoplastic elastomers\" (TPE) is occasionally used interchangeablywith \"thermoplastic rubbers.\" TPE is a rubber-like \u0000lament that is utilized in the manufacturing of stretchable and long-lasting products. It is capable ofwithstanding strain and force that is beyond the capabilities of PLA and ABS. Therefore, because of its qualities, it is suitable for use in the 3D printing of awide variety of items, including but not limited to toys, medical supplies, and components for automobiles. Some of the characteristics include its ability to beclearer after printing, easy to use, and less brittle. However, extrusion might be challenging, also, the printing pace is considerably slower. In addition, for animproved 3D printing experience, you can get around this problem by using a variation of the material known as TPE [19].\ne. Nylon:\nNylon is a family of synthetic polymers called polyamides, and it is the general designation for this group. Thermoplastic material with a silk-like appearance,nylon is often derived from petroleum and can be molten-processed into threads, \u0000lms, or other forms. Nylon is a strong \u0000lament that can be utilized in theproduction of working prototypes, gears, and other sorts of mechanical components. Because it absorbs a lot of moisture, coloring it either before or after theprinting process is very simple [20].\nSimilar to ABS, Nylon \u0000lament demands a high temperature for both the print bed and the nozzle. If you do not use a heated bed, you will experience warpingand below-average output. The fact that nylon must be printed at a high temperature makes the material more di\u0000cult to work with, but it also gives thematerial a high level of durability and resistance to abrasion and impact.\nAnother aspect of working with nylon that can be troublesome is the material's hygroscopic quality, which is its capacity to take up moisture from thesurrounding air. The product's quality can be negatively impacted by even brief contact with dampness. When you print with an exposed nylon \u0000lament, ratherthan getting a smooth \u0000nish, you will get \"bubbles\" in the output of your 3D printer. To ensure that it stays in pristine shape, you should always keep it stored ina cool, dry place [21].\nf. Polycarbonates (PC):\nPC is a class of thermoplastic polymers that, within their molecular structures, contain carbonate groups. The polycarbonates that are utilized in engineeringare materials that are durable and sturdy, and some grades are transparent to the human eye. Furthermore, they may be worked readily and easily molded andthermoformed. Thus, because of these qualities, polycarbonates are useful in a wide variety of applications.\nFurthermore, PC is one of the most durable \u0000laments because it is resistant to both high temperatures and rapid physical shocks. This makes it one of thestrongest \u0000laments. As a result of its transparency and a moderate degree of adaptability, it is an essential component in the manufacturing of componentsfor the automotive, electrical, and mechanical industries. Therefore, because polycarbonate absorbs moisture in the air much as nylon does, you need to focuson keeping it safe to preserve its quality [22].\nPage 5/9\ng. Acrylonitrile styrene acrylate (ASA):\nAcrylonitrile styrene acrylate (ASA), which is also referred to as acrylic styrene acrylonitrile, is described as an amorphous thermoplastic, developed as apotential substitute to acrylonitrile butadiene styrene (ABS), with better weather tolerance. It is frequently used in the automotive industry and is a popularchoice among manufacturers.\nSimilarly, prints made using ASA \u0000laments are heat-resistant, robust, and more rigid than those made with ABS \u0000laments. ASA \u0000lament is an alternative toABS \u0000lament. Due to its superior resistance to the effects of ultraviolet light and severe weather, it is ideal for use in applications that are exposed to theelements. In addition to this, it is not affected by contact with chemicals. However, even though it is generally considered to be a superior version of ABS, ASAstill warps during printing [23].\n3. Methodology Of The Study\n3.1. Fuzzy PROMETHEE and Application\nThe PROMETHEE technique is a method for making diverse multi-criteria decisions. In other words, the PROMETHEE decision-making technique hugelydepends on accurate data for a particular study [24]. The data used in this study was derived from different online databases such as Makecarl 3D printinghub and Wikipedia, 2022.\nFurthermore, data in real-world problems are not always clear values and typically vary between ranges. In this way, fuzzy logic and its applications enabledecision makers to analyze ambiguous decision models and assess uncertain data, more concretely than the traditional methods. The fuzzy PROMETHEEtechnique is also a hybrid model that is based on the evaluation of variable systems, and it has applications in a wide range of sectors such as architecture,sociology, engineering, medicine, biomedicine, and so on [25]. The PROMETHEE technique is based on the simultaneous evaluation of selected alternativeswith regard to factors selected as criteria. When compared to other multi-criteria decision-making techniques, this model is one of the simplest and moste\u0000cient in terms of conceptualization and execution. It is a simple outranking strategy that has been effectively applied to solving real-life problems. Thefuzzy PROMETHEE homogeneous technique satis\u0000es the requirements for simplicity when deployed. To successfully apply this technique, two crucialvariables are required: the weights of criteria and the decision maker's preference function when evaluating the overall relevance of the alternatives in thecontext of each criterion. Following this methodology, the fuzzy PROMETHEE technique has been successfully applied in different literature [26].\nIn this study, the fuzzy PROMETHEE technique was deployed to compare, rank, and evaluate different types of 3D \u0000laments (PLA, ABS, PETG, TPE, NYLON, PC,and ASA) used in additive manufacturing of biomedical tools and to identify the most widely used and preferred 3D \u0000laments, based on applied parametersand assigned important weights of the selected criteria. Therefore, to achieve this objective, the following criteria were obtained and de\u0000ned. They include;strength, warp, \u0000exibility, heat resistance, biodegradability, average cost/kg, resistance to UV light, food safety, printing temperature, speed, and ease inprinting. In de\u0000ning the criteria, the parameters in Tables 1 & 2 and their importance weights were determined as a linguistic fuzzy scale. Thereafter, the fuzzyvalues were defuzzi\u0000ed using the Yager index. Finally, the visual PROMETHEE program was deployed for simulation using the Gaussian preference functions.\nTable 1Fuzzy Scale of Linguistic values with important weights for criteriaLinguistic scale for ranking Triangular Fuzzy Scale Importance ratings of criteria\nVery High (VH) (0.75, 1, 1) strength, food safety, speed,\nHigh (H) (0.50, 0.75, 1) warp, \u0000exibility, heat resistance, resistance to UV light, printing temperature,\nMedium (M) (0.25, 0.50, 0.75) biodegradability, easy to print\nLow (L) (0, 0.25, 0.50) average cost/kg,\nVery Low (VL) (0, 0, 0.25)  \nPage 6/9\nTable 2Data set of alternatives and Criteria with corresponding parameters (very high (VH), high (H), moderate (M), low (L), very low (VL))Aim Max Max Max Max Max Min Max Max Min Max Max\nAlternatives/criteria Strength Warp Flexibility Heatresistance Biodegradability Averagecost/kg$\nResistanceto UV Foodsafety Printtemperature Speed Easytoprint\nPLA\n[27]\nM L L H YES 25 YES NO M VH VH\nABS\n[28]\nVH VH H VH NO 35 YES NO M VH M\nPETG\n[29]\nH M H VH NO 35 YES YES H VH H\nTPE\n[30]\nM L VH H YES 45 YES NO H L L\nNYLON\n[31]\nM M M H NO 30 NO NO M M L\nPC\n[32]\nM M M H YES 30 NO NO VH M L\nASA\n[33]\nH H L VH NO 35 YES YES H M M\n4. Results And Discussion\nThe PROMETHEE Table 3 below, shows the complete ranking results for the most preferred 3D printing \u0000laments. The result indicates that PLA with a net \u0000owof 0.0316 is among the most preferred and most widely used 3D printing \u0000laments in additive manufacturing of biomedical tools based on appliedparameters/set preference, selected criteria, and assigned important weights of the selected criteria. Followed by PC with a net \u0000ow of 0.0069. While TPEranked the lowest with a negative net \u0000ow result of -0.0327 (Table 3).\nTable 3PROMETHEE Preference Net \u0000owRank Alternatives Phi Phi+ Phi-\n1 PLA 0,0316 0,0359 0,0043\n2 PC 0,0069 0,0201 0,0131\n3 NYLON 0,0038 0,0181 0,0143\n4 PETG -0,0006 0,0150 0,0156\n5 ASA -0,0035 0,0136 0,0171\n6 ABS -0,0056 0,0117 0,0173\n7 TPE -0,0327 0,0052 0,0379\nIt is important to understand that even though PLA ranks \u0000rst on the ranking list of preferred 3D printing \u0000laments used in additive manufacturing ofbiomedical tools, based on the applied criteria, alternatives, assigned weights to criteria, and set the preferences as presented in this study, preferred 3Dprinting \u0000lament types may differ from one decision-maker to another. The obtained result from this study does not set a standard but it only shows that fuzzyPROMETHEE can be applied in making proper decisions when the choice of selecting the most preferred 3D printing \u0000laments in additive manufacturing ofbiomedical tools arises. Different decision-makers may come up with different 3D printing \u0000laments based on their selected criteria and choice of alternatives.The conclusion reached by any decision-maker will not set a universal standard for the identi\u0000cation of the most e\u0000cient 3D printing \u0000laments since all 3Dprinting \u0000laments are unique in their own way. \nTo properly evaluate and compare the 3D printing \u0000laments discussed in this study and as well as identify the most preferred 3D printing \u0000lament based oncriteria and alternatives, a proper literature search is needed and an expert opinion is required.\nFigure 1 shows that PLA has a wide positive standing on the following criteria; average cost, biodegradability, resistance to UV, speed, ease of print, and printtemperature. Also, a slim negative standing for heat resistance, strength, warp, \u0000exibility, and food safety. The more the criteria are positioned to the positive(+) sign on the graph, the more positively it contributes to our alternative. Similarly, the less the criteria are positioned to the negative sign (-) on the graph, theless positively it contributes to our alternatives. This explanation applies to the other alternatives seen in Fig. 1 below.\nPage 7/9\nFigure 1 shows the positive and negative parts of the types of 3D printing \u0000laments considered in this study based on the designated weights.\nThe order of preference followed by the \u0000gure above is due to the various assigned weights to criteria, their order in the graph will change if the weights ofcriteria are been altered. Biomedical engineers, 3D designers, clinicians, and people who wish to purchase a 3D printing machine but are uncertain about whichtype to go for, are now guaranteed to make a better choice using the fuzzy PROMETHEE technique when the need of choosing the most preferred 3D printing\u0000laments used in additive manufacturing of biomedical tools arises based on collective weight and preference selection.\nThe PROMETHEE \u0000ow network shown in Fig. 2 above indicates the distance between the alternative. Showing the positive and negative components of the\u0000ow network, PLA has a wide distance of e\u0000cacy compared to other alternatives. This indicates that the results in this study are correct and deplorable.\n5. Conclusion\nThis study has shown that fuzzy PROMETHEE can be deployed to compare, evaluate and rank different types of 3D printing \u0000laments, and to identify themost preferred option used in additive manufacturing of biomedical tools. Criteria and weights that in\u0000uence the ranking and comparison of the 3D printing\u0000lament types were decided upon by the expert in this \u0000eld and researched literature. Fuzzy PROMETHEE can be deployed to identify the optimal 3D printing\u0000lament used in the additive manufacturing of biomedical tools amongst others. With this technique, all available 3D printing \u0000laments used in the additivemanufacturing of biomedical tools can be evaluated, compared, and ranked systematically by choosing as many criteria as deemed necessary based on thedecision-maker’s preference. The fuzzy PROMETHEE method is highly regarded with signi\u0000cant e\u0000ciencies in comparing, evaluating, and ranking alternativeswhen compared to other MCDM methods. Qualitative and quantitative data that has no crisp values are included in the decision-making process in this study,these fuzzy values have too many parameters to be set properly with other methods however, fuzzy PROMETHEE can handle this kind of vague data properly.By deploying fuzzy PROMETHEE for comparing, evaluating, and ranking different types of 3D printing \u0000lament used in the additive manufacturing ofbiomedical tools, the result indicates that PLA with a net \u0000ow of 0.0316 is among the most preferred and most widely used 3D printing \u0000laments in additivemanufacturing of biomedical tools based on applied parameters/set preference, selected criteria, and assigned important weights of the selected criteria.Followed by PC with a net \u0000ow of 0.0069. While TPE ranked the lowest with a negative net \u0000ow result of -0.0327.\nThis study has solved the problems of uncertainty regarding making an appropriate decision. In the existing literature, there is no organized method ofchoosing the most preferred 3D printing \u0000lament used in the additive manufacturing of biomedical tools. The only process of deciding in this regard is bychoosing an option from experience or people’s review, this method is often regarded as unprofessional and time-consuming. But with the help of this study,concerned researchers, biomedical engineers, 3D printing designers, etc. can now partake in an intelligent decision-making process, and professionally makedecisions when appropriate.\nLimitations of Study\nExpert opinion is at all times needed for appropriate assigning of importance weights to criteria and grading alternatives. This process is the major challengein multi-criteria decision-making studies.\nDeclarations\nCompeting interests: The authors declare that they have no known competing \u0000nancial interests or personal relationships that could have appeared toin\u0000uence the work reported in this paper.\nReferences\n1. Gross, B. C., Erkal, J. L., Lockwood, S. Y., Chen, C., & Spence, D. M. (2014). Evaluation of 3D printing and its potential impact on biotechnology and thechemical sciences.\n2. Research and markets (2022), “Global markets for 3D printing 2021-2026”  https://www.researchandmarkets.com/reports/5447647/global-markets-for-3d-printing-2021-2026.\n3. Liu, Z., Wang, Y., Wu, B., Cui, C., Guo, Y., & Yan, C. (2019). A critical review of fused deposition modeling 3D printing technology in manufacturing polylacticacid parts. The International Journal of Advanced Manufacturing Technology, 102(9), 2877-2889.\n4. Chua, C. K., Leong, K. F., & An, J. (2020). Introduction to rapid prototyping of biomaterials. In Rapid prototyping of biomaterials (pp. 1-15). WoodheadPublishing.\n5. Rouf, S., Malik, A., Singh, N., Raina, A., Naveed, N., Siddiqui, M. I. H., & Haq, M. I. U. (2022). Additive manufacturing technologies: industrial and medicalapplications. Sustainable Operations and Computers.\n\u0000. Alexandrea P (2018), “The growing market for additive manufacturing in the medical sector” 3D natives. https://www.3dnatives.com/en/medical-additive-manufacturing070520174/\n7. Web of science (2011) https://www.webofscience.com/wos/woscc/basic-search\n\u0000. Domínguez-Rodríguez, G., Ku-Herrera, J. J., & Hernández-Pérez, A. (2018). An assessment of the effect of printing orientation, density, and \u0000ller pattern onthe compressive performance of 3D printed ABS structures by fuse deposition. The International Journal of Advanced Manufacturing Technology, 95(5),1685-1695.\n9. Pajonk, A., Prieto, A., Blum, U., & Knaack, U. (2022). Multi-material additive manufacturing in architecture and construction: A review. Journal of BuildingEngineering, 45, 103603.\nPage 8/9\n10. Huang, Y., & Leu, M. C. (2014). Frontiers of Additive Manufacturing Research and Education.\n11. Lam, J., Kwee, B. J., Ricles, L. M., & Sung, K. E. (2022). Development of Additive Manufacturing-Based Medical Products for Clinical Translation andMarketing. In Bone Tissue Engineering (pp. 267-292). Springer, Cham.\n12. Javaid, M., Haleem, A., Singh, R. P., Suman, R., & Rab, S. (2021). Role of additive manufacturing applications towards environmental sustainability.Advanced Industrial and Engineering Polymer Research, 4(4), 312-322.\n13. Market Analysis Report (2020), “Additive Manufacturing Market Size, Share & Trends Analysis Report By Component, By Printer Type, By Technology, BySoftware, By Application, By Vertical, By Material, By Region, And Segment Forecasts, 2022 – 2030” https://www.grandviewresearch.com/industry-analysis/additive-manufacturing-market#:~:text=Report%20Overview,20.8%25%20from%202022%20to%202030.\n14. Zhou, L. (2018). A Comparative Analysis of 3D Printers and Printing Materials for Art Designers in China.\n15. Kumar, R., Kumar, M., & Chohan, J. S. (2021). The role of additive manufacturing for biomedical applications: A critical review. Journal of ManufacturingProcesses, 64, 828-850.\n1\u0000. Arockiam, A. J., Subramanian, K., Padmanabhan, R. G., Selvaraj, R., Bagal, D. K., & Rajesh, S. (2021). A review on PLA with different \u0000llers used as a\u0000lament in 3D printing. Materials Today: Proceedings.\n17. Cress, A. K., Huynh, J., Anderson, E. H., O’neill, R., Schneider, Y., & Kele ş , Ö. (2021). Effect of recycling on the mechanical behavior and structure ofadditively manufactured acrylonitrile butadiene styrene (ABS). Journal of Cleaner Production, 279, 123689.\n1\u0000. Sepahi, M. T., Abusalma, H., Jovanovic, V., & Eisazadeh, H. (2021). Mechanical Properties of 3D-Printed Parts Made of Polyethylene Terephthalate Glycol.Journal of Materials Engineering and Performance, 30(9), 6851-6861.\n19. Awasthi, P., & Banerjee, S. S. (2021). Fused deposition modeling of thermoplastic elastomeric materials: Challenges and opportunities. AdditiveManufacturing, 46, 102177.\n20. Guessasma, S., Belhabib, S., & Nouri, H. (2021). Effect of printing temperature on microstructure, thermal behavior, and tensile properties of 3D printednylon using fused deposition modeling. Journal of Applied Polymer Science, 138(14), 50162.\n21. Yin, J. (2021). Improving the Properties of Recycled Aggregate Concrete Pavement Brick by Addition of Waste Nylon Filament. International Journal ofPavement Research and Technology, 1-13.\n22. Vidakis, N., Petousis, M., Velidakis, E., Spiridaki, M., & Kechagias, J. D. (2021). Mechanical performance of fused \u0000lament fabricated and 3D-printedpolycarbonate polymer and polycarbonate/cellulose nano\u0000ber nanocomposites. Fibers, 9(11), 74.\n23. Kumar, S. R., Sridhar, S., Venkatraman, R., & Venkatesan, M. (2021). Polymer additive manufacturing of ASA structure: In\u0000uence of printing parameters onmechanical properties. Materials Today: Proceedings, 39, 1316-1319.\n24. Yildirim, F. S., Sayan, M., Sanlidag, T., Uzun, B., Ozsahin, D. U., & Ozsahin, I. (2021). Comparative evaluation of the treatment of COVID-19 with multicriteriadecision-making techniques. Journal of Healthcare Engineering, 2021.\n25. Albarwary, S. A., Kibarer, A. G., Mustapha, M. T., Hamdan, H., & Ozsahin, D. U. (2021). The E\u0000ciency of AuNPs in Cancer Cell Targeting Compared to OtherNanomedicine Technologies Using Fuzzy PROMETHEE. Journal of Healthcare Engineering, 2021.\n2\u0000. Ozsahin, D. U., Uzun, B., Musa, M. S., Helwan, A., Wilsona, C. N., Nurçina, F. V., ... & Ozsahin, I. (2017). Evaluating cancer treatment alternatives using fuzzyPROMETHEE method. International journal of advanced computer science and applications, 8(10).\n27. Lunt, J. (1998). Large-scale production, properties, and commercial applications of polylactic acid polymers. Polymer degradation and stability, 59(1-3),145-152.\n2\u0000. Jayanth, N., Jaswanthraj, K., Sandeep, S., Mallaya, N. H., & Siddharth, S. R. (2021). Effect of heat treatment on mechanical properties of 3D printed PLA.Journal of the Mechanical Behavior of Biomedical Materials, 123, 104764.\n29. Prabhu, R., & Devaraju, A. (2021). A recent review of tribology, and rheology of biodegradable and FDM compatible polymers. Materials Today:Proceedings, 39, 781-788.\n30. Makecarl 3D printing Hub https://makercarl3d.com/blog/3D-printing-\u0000laments\n31. Lay, M., Thajudin, N. L. N., Hamid, Z. A. A., Rusli, A., Abdullah, M. K., & Shuib, R. K. (2019). Comparison of physical and mechanical properties of PLA, ABS,and nylon 6 fabricated using fused deposition modeling and injection molding. Composites Part B: Engineering, 176, 107341.\n32. All 3DP (2022) https://all3dp.com/1/3d-printer-\u0000lament-types-3d-printing-3d-\u0000lament/\n33. Staff, P. D. L. (1997). Handbook of plastics joining: a practical guide. William Andrew. https://books.google.com.cy/books?hl=en&lr=&id=azO3TgQh3rUC&oi=fnd&pg=PP1&dq=Staff,+PDL+(1997).+Handbook+of+Plastics+Joining:+A+Practical+Guide.+Elsevier+Science.+p.+515.+ISBN+9780815517665.+Retrieved+2017-01-11.&ots=0qnZj3YBSp&sig=uPW9eYEMctbZ1S-DpbAoZZ2mJe4&redir_esc=y#v=onepage&q&f=false\nFigures\nPage 9/9\nFigure 1\nApplications of AM\nFigure 2\n Figure 1. Showing the positive and negative ranking results.\nFigure 3\nFigure 2: PROMETHEE \u0000ow network",
  "topic": "Ranking (information retrieval)",
  "concepts": [
    {
      "name": "Ranking (information retrieval)",
      "score": 0.7230842113494873
    },
    {
      "name": "Fused deposition modeling",
      "score": 0.6427211761474609
    },
    {
      "name": "Flexibility (engineering)",
      "score": 0.6389778256416321
    },
    {
      "name": "3D printing",
      "score": 0.6095951795578003
    },
    {
      "name": "Computer science",
      "score": 0.5456803441047668
    },
    {
      "name": "Fuzzy logic",
      "score": 0.48593631386756897
    },
    {
      "name": "Manufacturing engineering",
      "score": 0.3726505637168884
    },
    {
      "name": "Engineering drawing",
      "score": 0.32108092308044434
    },
    {
      "name": "Artificial intelligence",
      "score": 0.26880645751953125
    },
    {
      "name": "Mechanical engineering",
      "score": 0.23733797669410706
    },
    {
      "name": "Engineering",
      "score": 0.2261916995048523
    },
    {
      "name": "Mathematics",
      "score": 0.20960316061973572
    },
    {
      "name": "Statistics",
      "score": 0.10814416408538818
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I69050122",
      "name": "Near East University",
      "country": "CY"
    },
    {
      "id": "https://openalex.org/I50357001",
      "name": "Universidad Carlos III de Madrid",
      "country": "ES"
    },
    {
      "id": "https://openalex.org/I205783295",
      "name": "Cornell University",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I4387153466",
      "name": "Weill Cornell Medicine",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I29891158",
      "name": "University of Sharjah",
      "country": "AE"
    }
  ]
}