{
    "title": "Molecular set transformer: attending to the co-crystals in the Cambridge structural database",
    "url": "https://openalex.org/W4312955973",
    "year": 2022,
    "authors": [
        {
            "id": "https://openalex.org/A3026188892",
            "name": "Aikaterini Vriza",
            "affiliations": [
                "University of Liverpool"
            ]
        },
        {
            "id": "https://openalex.org/A1964129200",
            "name": "Ioana Sovago",
            "affiliations": [
                "Cambridge Crystallographic Data Centre"
            ]
        },
        {
            "id": "https://openalex.org/A2122102332",
            "name": "Daniel Widdowson",
            "affiliations": [
                "University of Liverpool"
            ]
        },
        {
            "id": "https://openalex.org/A1757564466",
            "name": "Vitaliy Kurlin",
            "affiliations": [
                "University of Liverpool"
            ]
        },
        {
            "id": "https://openalex.org/A2101198357",
            "name": "Peter A. Wood",
            "affiliations": [
                "Cambridge Crystallographic Data Centre"
            ]
        },
        {
            "id": "https://openalex.org/A2154868734",
            "name": "Matthew S. Dyer",
            "affiliations": [
                "University of Liverpool"
            ]
        },
        {
            "id": "https://openalex.org/A3026188892",
            "name": "Aikaterini Vriza",
            "affiliations": [
                "University of Liverpool"
            ]
        },
        {
            "id": "https://openalex.org/A1964129200",
            "name": "Ioana Sovago",
            "affiliations": [
                "Cambridge Crystallographic Data Centre"
            ]
        },
        {
            "id": "https://openalex.org/A2122102332",
            "name": "Daniel Widdowson",
            "affiliations": [
                "University of Liverpool"
            ]
        },
        {
            "id": "https://openalex.org/A1757564466",
            "name": "Vitaliy Kurlin",
            "affiliations": [
                "University of Liverpool"
            ]
        },
        {
            "id": "https://openalex.org/A2101198357",
            "name": "Peter A. Wood",
            "affiliations": [
                "Cambridge Crystallographic Data Centre"
            ]
        },
        {
            "id": "https://openalex.org/A2154868734",
            "name": "Matthew S. Dyer",
            "affiliations": [
                "University of Liverpool"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W3112789966",
        "https://openalex.org/W2952268342",
        "https://openalex.org/W2128535536",
        "https://openalex.org/W1969117627",
        "https://openalex.org/W1988367399",
        "https://openalex.org/W2040475019",
        "https://openalex.org/W4255886946",
        "https://openalex.org/W2009032263",
        "https://openalex.org/W2733090315",
        "https://openalex.org/W2947550602",
        "https://openalex.org/W2799964757",
        "https://openalex.org/W3082542432",
        "https://openalex.org/W3087471863",
        "https://openalex.org/W2319902168",
        "https://openalex.org/W4243517382",
        "https://openalex.org/W2142802964",
        "https://openalex.org/W2318118297",
        "https://openalex.org/W2553696397",
        "https://openalex.org/W3089569512",
        "https://openalex.org/W3135335241",
        "https://openalex.org/W3165597838",
        "https://openalex.org/W3185190616",
        "https://openalex.org/W2966357564",
        "https://openalex.org/W3023204497",
        "https://openalex.org/W2791355014",
        "https://openalex.org/W2038310963",
        "https://openalex.org/W2959623824",
        "https://openalex.org/W2947423323",
        "https://openalex.org/W3044724994",
        "https://openalex.org/W3214916886",
        "https://openalex.org/W3008588639",
        "https://openalex.org/W2530298367",
        "https://openalex.org/W6602830419",
        "https://openalex.org/W3116202926",
        "https://openalex.org/W2973049920",
        "https://openalex.org/W3205964505",
        "https://openalex.org/W2043092002",
        "https://openalex.org/W3094640617",
        "https://openalex.org/W2593436234",
        "https://openalex.org/W3162418059",
        "https://openalex.org/W3103092523",
        "https://openalex.org/W1508044906",
        "https://openalex.org/W2612690371",
        "https://openalex.org/W4235427483",
        "https://openalex.org/W4285605356"
    ],
    "abstract": "Molecular set transformer is a deep learning architecture for scoring molecular pairs found in co-crystals, whilst tackling the class imbalance problem observed on datasets that include only successful synthetic attempts.",
    "full_text": "Molecular set transformer: attending to the co-\ncrystals in the Cambridge structural database†\nAikaterini Vriza, ab Ioana Sovago,c Daniel Widdowson,bd Vitaliy Kurlin,bd\nPeter A. Wood c and Matthew S. Dyer *ab\nIn this paper we introduce molecular set transformer, a Pytorch-based deep learning architecture designed\nfor solving the molecular pair scoring task whilst tackling the class imbalance problem observed on datasets\nextracted from databases reporting only successful synthetic attempts. Our models are being trained on all\nthe existing molecular pairs that form co-crystals and are deposited in the Cambridge Structural Database\n(CSD). Given any new molecular combination, the primary objective of the tool is to be able to select the\nmost eﬀective way to represent the pair and then assign a score coupled with an uncertainty estimation.\nMolecular set transformer is an attention-based framework which learns the important interactions in\nthe various molecular combinations by trying to reconstruct its input by minimizing its bidirectional loss.\nSeveral methods to represent the input were tested, both ﬁxed and learnt, with the Graph Neural\nNetwork (GNN) and the Extended-Connectivity Fingerprints (ECFP4) molecular representations to\nperform best showing an overall accuracy higher than 75% on previously unseen data. The\ntrustworthiness of the models is enhanced by adding uncertainty estimates which aims to help chemists\nprioritize at the early materials design stage both the pairs with high scores and low uncertainty and pairs\nwith low scores and high uncertainty. Our results indicate that the method can achieve comparable or\nbetter performance on speciﬁc APIs for which the accuracy of other computational chemistry and\nmachine learning tools is reported in the literature. To help visualize and get further insights of all the\nco-crystals deposited in CSD, we developed an interactive browser-based explorer ( https://csd-\ncocrystals.herokuapp.com/). An online Graphical User Interface (GUI) has also been designed for\nenabling the wider use of our models for rapidin silico co-crystal screening reporting the scores and\nuncertainty of any user given molecular pair (https://share.streamlit.io/katerinavr/streamlit/app.py).\n1 Introduction\nThe tendency of various molecules to form multi-component\ncrystal structures has been linked to the observation of several\nnew properties in organic materials. Understanding the\nmolecular basis of co-crystallization and predicting whether two\nmolecules will form a co-crystal or not can have a signicant\nimpact in the design of functional materials and especially in\nthe drug discovery process. As a concept it is very similar to the\ndrug pairing scoring,\n1 although in our case instead of drug–\ndrug interactions we are interested in the formation of co-\ncrystals. Although the crystal structure of a material is what\ndetermines its properties and is the most trustworthy indicator\nthat a co-crystal can indeed exist, crystal structure prediction is\ntime consuming and thus prohibitive for quick co-former\nscreening. Data-driven approaches have shown great promise\nfor developing time eﬃcient tools that can learn the patterns\nfrom the existing data and perform predictions with a high\nsuccess rate. However, they still suﬀer from many limitations in\nterms of dening the appropriate representations of the target\nmaterials and achieving reliable predictions based solely on\nknown instances or otherwise biased datasets.\nThe aim of this work is to develop predictive models for co-\ncrystal formation that can generalize to all types of currently\nknown co-crystals, ranging from pharmaceutical to electronic co-\ncrystals. For that reason, the workow proposed in our previous\nwork,\n2 i.e., training using only the‘positive data’, will be adjusted\nand scaled-up to cover all the existing co-crystals in the Cam-\nbridge structural database (/C24 7500 molecular combinations). Key\nimprovements of this framework include the consideration of\nvarious molecular representation techniques, hyperparameter\ntuning, uncertainty estimation and extensive benchmarking.\naDepartment of Chemistry and Materials Innovation Factory, University of Liverpool,\n51 Oxford Street, Liverpool L7 3NY, UK. E-mail: M.S.Dyer@liverpool.ac.uk\nbLeverhulme Research Centre for Functional Materials Design, University of Liverpool,\nOxford Street, Liverpool L7 3NY, UK\ncCambridge Crystallographic Data Centre, 12 Union Road, Cambridge CB2 1EZ, UK\ndMaterials Innovation Factory and Computer Science Department, University of\nLiverpool, Liverpool, L69 3BX UK\n† Electronic supplementary information (ESI) available: Dataset description;\nhyperparameters tuning; models description; additional results. See\nhttps://doi.org/10.1039/d2dd00068g\nCite this:Digital Discovery, 2022,1,8 3 4\nReceived 28th June 2022\nAccepted 29th September 2022\nDOI: 10.1039/d2dd00068g\nrsc.li/digitaldiscovery\n834 | Digital Discovery, 2022,1,8 3 4–850 © 2022 The Author(s). Published by the Royal Society of Chemistry\nDigital\nDiscovery\nPAPER\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\nView Journal\n | View Issue\nFeature representation has a major impact on the eﬀectiveness of\nMachine Learning (ML) models especially on imbalanced data-\nsets. In this context, if both the positive and negative or unknown\nclasses with high amount of disproportionality are well-\nrepresented with non-overlapping distributions, good classica-\ntion rates can be obtained by the ML classiers.\nMolecular set transformer, which is an attention based\nautoencoder designed for sets, is the key building block of our\nclassier. The training of our model was performed in a way\nsuch that the reconstruction error is minimized and also an\nuncertainty aware component was added. The uncertainty\nestimates of each prediction can mitigate the eﬀect of out-of-\ndistribution examples and provide a degree of con dence\nwith which the classier ranks every new datapoint. Thenal\nmodels were tested in real case scenarios using several inde-\npendent external co-crystal screening datasets collected from\nliterature. To showcase the applicability of the methodology,\nthe best performing model was used for ranking a molecular\npairs dataset extracted from ZINC20 database, considering the\ndrug delivery and solubility of the co-formers.\n1.1 Trends in co-crystal research\nCo-crystals are crystalline materials composed of two or more\ndiﬀerent uncharged molecular compounds in a particular\nstoichiometry. Over the past years signicant attention has been\nreceived both from academia and industry due to their possible\napplications in the pharmaceutical and electronic materials\nindustries. This can be veried by the exponential increase in\ndeposited co-crystals in the Cambridge structural database over\nthe recent years (Fig. 1). Looking at the timeline, it can be\nobserved that the rst co-crystals were composed of smaller\nmolecules, as indicated by the average length of their SMILES\n(Simplied Molecular Input Line Entry System). The highest\ncomplexity among the molecular pairs is observed around the\nearly 90's with the discovery of the fullerene (C\n60) co-crystals.3\nMoreover, an increasing interest in co-crystals with electronic\nproperties is also observed, based on statistics extracted from\nWeb of Science\n4 using as key words‘co-crystal’ and ‘electronic’.\nIn pharmaceutical co-crystals at least one of the components is\nan Active Pharmaceutical Ingredient (API), whereas the co-crystals\nof electronic interest are mainly composed from polyaromatic\nhydrocarbons (PAHs) which arep-electron rich molecules. For\npharmaceutical applications, co-crystallization is an important\ntechnique for improving the physicochemical properties of the\nAPI without interfering with the chemical behaviour. For\nexample, many pharmaceutical compounds do not make it to the\ncommercial market due to their low solubility. The incorporation\nof a co-former into the API can result in signicantly higher\nsolubility levels in comparison to any crystal form of the API itself.\nFig. 1 Bar chart with the timeline of co-crystals structures deposited in CSD. The bars are colour-coded based on the complexity of the\nmolecules that form the co-crystals, as indicated from the average length of the SMILES strings. The increase of publications regarding electronic\nco-crystals is shown in the inset. It can be observed that there are two signiﬁcant trends,i.e., for designing more complex and electronically\ninteresting co-crystals.\n© 2022 The Author(s). Published by the Royal Society of Chemistry Digital Discovery, 2022,1,8 3 4–850 | 835\nPaper Digital Discovery\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\nIn electronic co-crystals, the existence of two or more diﬀerent\nmolecules, which can play the roles of a donor and an acceptor,\ngenerates charge transfer complexes with potential electronic\napplications,e.g., near-infrared photothermal materials.\nThe constituent molecules are arranged in appropriate\ncrystal packing such that the electronic transport can be ach-\nieved between the highest occupied molecular orbital (HOMO)\nof the donor and the lowest unoccupied molecular orbital\n(LUMO) of the acceptor.\n5 The rst example of such a co-crystals\nwas the TTF-TCNQ complex.6\n1.2 Interactions between molecular pairs\nCo-crystallization relies purely on intermolecular interactions,\nand it therefore opens a new range of potential combinations of\nbuilding blocks to be investigated. If the two building blocks\ncontain only one binding site each and if there is only one way in\nwhich those two moieties can be connected a heteromeric syn-\nthon can be formed. However, synthetic predictability deterio-\nrates quickly when the number of potentially interacting moieties\non each reactant is increased or in cases where one or both\nreactants lack strong directional moieties. The intermolecular\ninteractions that are present in co-crystals are largely dominated\nby hydrogen bonds. Within the crystal structure the molecules\nwith appropriate functionalities will arrange themselves in\na packing arrangement in an attempt to maximize the number\nand strength of the hydrogen bonding interactions within the\nsolid-state crystal.\n7 Alongside H-bonding, other interactions\nappear to play a signicant role in the formation of stable\nstructures, i.e., halogen bonding andp– p stacking (Table S1†).\nHalogen bonds are another type of non-covalent bonding\nwhich is typically formed between iodine- or bromine atoms\n(the halogen-bond donor) and an appropriate halogen-bond\nacceptor (electron-pair donor) such as an N-heterocycle.\n8\nHydrogen and halogen bonds display important strength and\ndirectionality and thus oﬀer a good starting point for supra-\nmolecular strategies that simultaneously encompass two\ndiﬀerent non-covalent interactions.\nThe p– p interactions play a key role in the electronic struc-\nture of the materials and refer to the attractive interactions\nbetween adjacent p systems such as aromatic rings. Aromatic\nrings of neighbouring molecules can arrange themselves in\na variety of diﬀerent orientations, each of which can allow forp–\np stacking interactions to form.\n9 Despite the importance of the\np– p interactions, they are still quite underrepresented among\nthe co-crystal forming molecular pairs as they are relatively\nweak in comparison to hydrogen or halogen bonding.\n1.3 Data-driven approaches for in silico co-crystal screening\nFollowing the trend of increasing interest in co-crystal\nsynthesis, data-driven methods aimed towards reducing the\ntime needed to screen co-crystals are being actively developed.\nThe rst such data-driven method was proposed back in 2009 by\nFabian, who rst analysed the co-crystals in the Cambridge\nstructural database and extracted important statistics that drive\nco-crystallization.\n10 Since then, several other data-driven work-\nows have been developed, either focusing on a co-crystal\nsubset2,11–13 or on the whole co-crystal dataset. 14,15 The\ncommon ground in the aforementioned approaches is that they\nall use a negative dataset and focus on training binary classi-\ners. Labels in chemistry can be expensive (more experiments),\nunsustainable (solvents) or in some cases unreliable (diﬀerent\nexperimentalist and/or diﬀerent conditions might enable the\nsynthesis of a materials that was previously labelled as nega-\ntive). For that reason, this work is focused only on the infor-\nmation we have at hand and try to make better use of it.\nPreviously, we used a focussed co-crystal dataset, referring top–\np interconnected polyaromatic hydrocarbons (PAHs) co-\ncrystals. We implemented and compared several one class\nclassication approaches and designed a neural network for\none class classi cation which outperformed the standard\nanomaly detection algorithms. Indeed, we managed to synthe-\nsize two new co-crystals based on the Pareto optimal co-formers\nwhich had the highest similarity to TCNQ, well known for its\napplication in electronically active co-crystals. During this study\nwe noted that the absence of negative data limited the evalua-\ntion of the performance of our algorithms to the true positive\nrate (TPR) alone. In this study we present a dataset of positive\nand negative co-crystallisation data to enable more robust\nevaluation of our algorithms.\n2 Methods\nOur workow (Fig. 2) is the following: (i) we created the co-\ncrystals dataset by screening the CSD for crystal structures\ncomposed of two diﬀerent organic molecules following the\nprocess described below. (ii) We tested four diﬀerent repre-\nsentations for the molecular pairs (bothxed and learnt) to be\ngiven as an input to the machine learning model. (iii) For each\ndiﬀerent representation we trained our model aer modifying\nits loss function to a bidirectional loss. The hyperparameters of\nthe network were tuned such that the reconstruction loss was\nminimized. (iv) The trained models were then used for scoring\nand evaluating a benchmark database created from experi-\nmental co-crystal screening data collected from publicly avail-\nable resources.\n2.1 Creating the datasets\n2.1.1 Training dataset. A key part of the development of\na data-driven approach is the creation of a curated dataset that\nis reliable and can be used for training. The co-crystal dataset\nused for training the models was extracted from CSD 2020 using\nthe CSD Python API (version 3.0.4)\n16 and an in-house python\nscript. The CSD database contains more than one million\ncrystal structures of small molecules and metal – organic\nmolecular crystals resolved by X-ray and neutron diﬀraction\nexperiments. The whole database was screened with the\nfollowing constraints:\n(i) The structures should be only organic, not polymeric, not\nionic and should not contain metals.\n(ii) The structures should have 3D coordinates and no\ndisorder so that they can be modelled as periodic sets of points,\ndened by a motif of points that repeats according to a basis.\n836 | Digital Discovery, 2022,1,8 3 4–850 © 2022 The Author(s). Published by the Royal Society of Chemistry\nDigital Discovery Paper\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\n(iii) Duplicates, i.e., crystals with the same unit molecules,\nare ruled out based on the CSD identier by dropping out\nstructures that have therst 6 letters the same.\n(iv) The structures should have exactly two distinct molecules\nindependent of the stoichiometry,i.e., the CSD entry CSATBR\nwith SMILES string: OC( ]O)c1cc(Cl)ccc1O$OC(]O)c1cc(Cl)\nccc1O$CN1C]NC2]C1C(]O)NC(]O)N2C, has three mole-\ncules in the asymmetric unit, however there are only two\ndiﬀerent co-formers with 2 : 1 stoichiometry. Given the CSD\nrefcode identier, the SMILES string representation is extracted\nand split into the subsequent strings (one SMILES string for\neach molecule in the structure). A structure proceeds only if\naer removing the duplicate strings in each structure, only two\ndiﬀerent strings remain. In that way we incorporate within the\nco-crystals dataset only structures that belong to di ﬀerent\nmolecular stoichiometries.\n(v) Neither of the two diﬀerent molecules in the extracted\nstructure should be a solvent or single atom, as listed in the\nappendix Table S2.†\nThis process resulted in a dataset of 7479 molecular pairs.\nThe dataset was further reduced aer removing the datapoints\nthat exist in the validation set giving a training dataset of 7075\nmolecular pairs consisting of 4343 diﬀerent single molecules.\n2.1.2 External validation datasets. As the interest around\nco-crystals is rising, several studies report both the successful\nand unsuccessful results from the synthetic attempts. However,\nthe results are not reported in a consistent manner and an\nextensive literature screening is unavoidable. For the validation\nand comparison of our models a benchmark database was\ncreated. This was a time-consuming process that took over 2\nmonths to screen all the related literature, collect the experi-\nmental data and then convert them in machine readableles\n(csv les). In most of the papers the overall screening experi-\nments were reported as supplementary information and only\nthe names of the molecules as well as the outcome, i.e.,\nsuccessful or unsuccessful co-crystallization, were given. We\nidentied the correct SMILES strings given the names and then\nassign the label ‘1’ for successful and ‘0’ for unsuccessful\nexperiments. It should be also noted that the experimental\nvalidation of a successful co-crystal was not always performed\nwith a detailed crystal structure determination process, but in\nmany cases IR or PXRDs observations were enough for catego-\nrizing a molecular pair as a positive or negative example. As\nWang et al.stated,\n14 there are cases where a molecular pair has\nbeen reported as negative, however aer some years the struc-\ntures were experimentally proven to be positive. As such,\na negative pair may be better dened as a pair that is less likely\nto co-crystallize, not necessarily a pair that will never co-\ncrystallize under any experimental conditions. Furthermore, it\nis postulated that an unfavourable co-crystallization might be\ndue to stronger homomeric than heteromeric interactions\nbetween the co-formers.\n17 In this work the labels have been\nFig. 2 Schematic illustration of the training and validation process followed in this work. Molecular set transformer was trained using only\npositively labelled data collected from CSD. After the optimal models were found, we validated our approach on external validation datasets\npreviously ‘unseen’ from the network.\n© 2022 The Author(s). Published by the Royal Society of Chemistry Digital Discovery, 2022,1,8 3 4–850 | 837\nPaper Digital Discovery\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\ncorrected in a similar way as proposed from Wanget al.14 A\ndetailed analysis regarding the creation of the external valida-\ntion database also reporting the experimental methods used to\nsynthesize the co-crystals can be found in the ESI on Section\n1.3.† The wide range of diverse categories containing both\npositive and negative outcomes are listed based on chronolog-\nical order in Table 1.\n2.2 Data representation\nIn machine learning for chemistry applications, molecules are\ntranslated into a numerical vector of axed size, namely the\nmolecular representation or molecularngerprint. A molecular\nngerprint can be either xed or learned, depending on\nwhether the algorithm will always return the same vector for\na molecule (Morganngerprint, molecular descriptors) or will\nlearn a task-speci c, database dependant vector (neural\nngerprint, message passingngerprint).\n25,26\n2.2.1 Fixed molecular features\n2.2.1.1 Molecular descriptors. The rst case study was on the\nuse of molecular descriptors extracted from a freely available\nlibrary, namely Mordred.\n27 Mordred can calculate more than\n1800 numerical representations of molecular properties and/or\nstructural features using prede ned algorithmic rules. The\ndisadvantage of this approach is that the library is not further\nupdated and as a result many packages start deprecating, which\nmight result in NaN (Not a Number) values. In this work the\nNaN values have been replaced with 0 s.\n2.2.1.2 Morgan ngerprint. Morgan Fingerprint (MF) or else\nextended connectivity ngerprint (ECFP) is generated by\nassigning unique identiers, i.e., Morgan identiers, to all the\nsubstructures within a dened radius around all heavy atoms in\na molecule.\n28 These identiers are aerwards hashed to a vector\nwith axed length. In this work we used the MF of radius 2 with\nlengths 2048 and 4096 extracted from RDKit library.29\n2.2.2 Learned molecular ngerprints with pretraining.\nDeep learning models usually require a large amount of labelled\ndata to be trained e ﬃciently. However, not all tasks have\nenough data to train on and in numerous cases the labels are\nnot available or are very costly to attain. One approach to help\nachieving better results is pretraining, i.e., a model is rst\ntrained on an auxiliary task for which more data exist and then\nthe pretrained model starts with more favourable weights than\nrandomly initialized ones to achieve a downstream task.\n30 For\nattaining a learned vector, a large, labelled dataset is needed,\nsuch that the algorithm will learn the best representation based\non the task to be predicted. As in our case no training labels are\navailable, we followed a transfer learning approach by using\npretrained models in diﬀerent tasks where labelled large data-\nsets exist. Transfer learning can be an eﬀective way for reducing\nthe training bias. We used two diﬀerent models pretrained in\nvery diﬀerent tasks, (i) a graph-neural networkngerprint pre-\ntrained in a self-supervised manner with masking on 2 million\nunlabelled molecules from ZINC15 database.\n31 Each molecule is\nrepresented as a 300-dimensional vector a er applying the\npretrained model. (ii) A natural language processing (NLP)\nbased ngerprint which is learning the molecularngerprint by\ntranslating the SMILES string to the chemical name trained in 1\nmillion molecules from ChEMBL.\n2.2.2.1 Using pre-trained graph neural networks with transfer\nlearning. Graph neural networks (GNNs) have found many\napplications in chemistry data as molecules can be easily rep-\nresented as graphs with the atoms being the nodes and the\nbonds being the edges. GNNs learn parametrized mappings\nfrom graph-structured objects to continuous feature vectors and\nhave achieved state-of-the art performance in a wide variety of\nproblems for property prediction or materials classication. In\nthis work, we used a pre-trained GNN model released by Hu\net al.\n31 to generate the representation of our molecules on the\nco-crystal pairs. The selected model was pretrained in a self-\nsupervised way with attribute masking, according to which\nthe node/edge attributes,i.e., atoms or bonds, of molecules in\na large unlabelled dataset are masked and then the GNN tries to\npredict those attributes based on the neighbourhood structure.\nThis learnt representation was further used as the input to\nmolecular set-transformer, as an alternativengerprint. More\ndetails about the GNN architecture are provided in the ESI on\nSection 1.4.1 and Fig. S5.†\n2.2.2.2 Using natural language processing (NLP) based models\nand transfer learning.One NLP-based pretrained model, namely\nChemBERTa\n32 was tested for encoding the molecular SMILES in\na learned vector. The vital part for processing text-based\nchemical representations for deep learning models is the\ntokenization, i.e., how to break SMILES strings into a sequence\nof standard units, known as tokens. The tokens are supposed to\nTable 1 Publicly available co-crystal screening datasets consisting of 1094 negative and 1317 positive examples\nDataset name Dataset description Year Number or data Ref.\n1. Artemisinin dataset Artemisinin + co-formers 2010 75 (73 negatives + 2 positives) 18\n2. MEPS dataset 18 APIs against di ﬀerent co-formers 2014 432 (300 negatives + 132 positives) 19\n3. H-bond synthons dataset 20 APIs + 34 co-formers (always the same) 2017 680 (408 negatives + 272 positives) 11\n4. Propyphenazone dataset Propyphenazone + co-formers 2017 89 (81 negatives + 8 positives) 20\n5. Phenolic acids dataset Phenolic acids as co-formers 2018 225 (58 negatives + 167 positives) 13\n6. Dicarboxylic acids dataset Dicarboxylic acids as co-formers 2019 710 (104 negatives + 606 positives) 12\n7. (des)loratadine dataset Desloratadine & loratadine + co-formers 2020 82 (17 negatives + 65 positives) 21\n8. Linezolid dataset Linezolid + co-formers 2021 19 (9 negatives and 10 positives) 22\n9. Pyrene dataset Pyrene + co-formers with electronic similarity to TCNQ 2021 6 (4 negatives + 2 positives) 2\n10. Praziquantel dataset Praziquantel + co-formers 2021 30 (18 negatives + 12 positives) 23\n11. MOP dataset 2-Amino-4,6-dimethoxypyrimidine (MOP) + 63 co-formers 2021 63 (22 negative + 41 positives) 24\n838\n| Digital Discovery, 2022,1,8 3 4–850 © 2022 The Author(s). Published by the Royal Society of Chemistry\nDigital Discovery Paper\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\ncontain the essential structural information that can reliably\nand consistently characterize the molecules. ChemBERTA is\na RoBERTa-like transformer model that learns molecular\nngerprints through semi-supervised pre-training of the\nsequence-to-sequence language model, using masked-language\nmodelling of a large corpus of 10 million SMILES strings from\nPubChem. The raw SMILES were tokenized using a Byte-Pair\nEncoder (BPE) from the Hugging face tokenizers library. More\ndetails about the ChemBERTa architecture are provided in the\nESI on Section 1.4.2.†\n2.3 Molecular set transformer\nTraditional ML approaches usually operate on xed dimen-\nsional vectors or matrices. However, there are several problems\nthat demand the input to be order invariant,i.e., a set. Deep\nlearning tasks dened on sets usually require learning func-\ntions to be permutation invariant. To deal with this issue in our\nprevious work,\n2 we designed an One Class Classier by using\nDeepSVDD network and replacing the convolutional autoen-\ncoder with a Set Transformer adapted from the work of Lee\net al.\n33 The main architectural di ﬀerences to our previous\nworkow is that the feed forward neural network, i.e.,\nDeepSVDD, was completely removed, and that the loss function\nof Set Transformer has been replaced by bidirectional recon-\nstruction loss, such that the model will behave as an attention-\nbased autoencoder.\nIn its simplest form the autoencoder has two components:\nan encoder and a decoder. The encoder takes an input and\ntransforms it into a latent representation which is usually\na more compact representation than the original datapoint. On\nthe other hand, the decoder is trying to reconstruct the original\ninput from the latent dimension. Mathematically, for a given\ndatapoint x, the encoder compresses the information to a vector\nz, and the decoder decompresses the data into a reconstructed\nsample ^x. To learn these transformations, neural networks are\nused as computational and optimizable building blocks for the\nencoder and decoder. The encoder and decoder are then opti-\nmized according to a loss, which is a low reconstruction error\n(kx − ^xk).\n34 Molecular set transformer captures the input in\na permutation invariant way. However, to ensure that the output\nis order invariant as well, a permutation invariant training\ntechnique was applied by integrating a bidirectional recon-\nstruction loss function to the original model.35\nThe way the molecular set transformer extracts the features\nis key for capturing the complexity of the problem. Molecular\nset transformer‘looks’ in all the features across a single mole-\ncule as well as in all the features of the pairing molecule. In that\nway the latent dimension holds information for the relation\nbetween the features for each molecular pair. Molecular set\ntransformer uses a learnable pooling operation, instead of\na xed pooling operation such as mean, to combine the set\ninput such that most of the information is preserved aer\ncompressing the data. The pooling operation is the dot-product\nattention with SoMax (i.e., the self-attention mechanism). In\nthis way, a richer representation of the input data is ensured,\nthat captures higher-order interactions which are important for\nco-crystal design.\n2.4 Hyperparameter tuning\nAs the performance of the neural network is highly dependent\non the choice of the hyperparameters,i.e., algorithm network\nvariables, the hyperparameters were tuned using Weights and\nBiases soware.\n36 The model was trained on all‘positive’ co-\ncrystal data, excluding those molecular pairs that belong to\nthe validation sets. The training was performed without labels\nand with a diﬀerent set of parameters each time, having as the\nnal goal to minimize the bidirectional reconstruction loss.\nAer the identication of the optimal set of parameters for each\nmodel, the models were retrained using the selected hyper-\nparameters and used for the evaluation on the external valida-\ntion datasets.\n2.5 Evaluation metrics\nThe evaluation of the molecular set transformer inspired\nmodels is performed in the external datasets containing\nexperimental results from co-crystal screening data (Table 2).\nThe datasets are balanced between the two classes of co-crystal\nand not observing a co-crystal, with 1317 positives and 1094\nnegatives assigned as 1 and 0 respectively (Table 1). The eval-\nuation metrics used are described below.\nThe Area Under Curve (AUC) is dened as the probability\nthat a classier will rank a randomly chosen positive instance\nhigher than a randomly chosen negative one. When a model\nTable 2 Evaluating molecular set transformer with diﬀerent input representations on the external benchmark dataset. The metrics include the\nArea Under the Curve (AUC), speciﬁcity (TNR) and F1 score. The performance of two traditional one-class classiﬁcation algorithms is also re-\nported as baseline performance\nModel AUC Speci city F1\nMolecular set transformer + GNNc 0.76 /C6 0.001 0.69 /C6 0.004 0.73 /C6 0.005\nMolecular set transformer + ECFP4 (4096)b 0.75 /C6 0.005 0.71 /C6 0.006 0.72 /C6 0.005\nMolecular set transformer + Mordred descriptorsa 0.74 /C6 0.007 0.68 /C6 0.005 0.7 /C6 0.005\nMolecular set transformer + ECFP4 (2048)b 0.73 /C6 0.004 0.71 /C6 0.005 0.71 /C6 0.005\nMolecular set transformer + ChemBERTad 0.66 /C6 0.005 0.65 /C6 0.005 0.63 /C6 0.005\nIsolation forest44 + ECFP4 (2048)b 0.65 0.58 0.64\nkNN45+ ECFP4 (2048)b 0.62 0.56 0.61\na 1023 dimensions.b 2048 dimensions.c 600 dimensions.d 354 dimensions.\n© 2022 The Author(s). Published by the Royal Society of Chemistry Digital Discovery, 2022,1,8 3 4–850 | 839\nPaper Digital Discovery\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\nscores all the positive data higher than the negatives the AUC\nscore is 1. A random classier has an AUC value of 0.5, whereas\nif the AUC values is less than 0.5 the performance is worse than\nrandom, i.e., the negative points are scored higher than the\npositives. AUC was used for evaluating the models as a metric\nthat is independent from the selection of a certain division\nthreshold to separate the positive from the negative samples\nand is only aﬀected by the ranking of the samples. Other\nmethods developed for co-crystal screening also report the AUC\nof their models in external validation data, as such this metric\nwas suitable for comparison with other workows.\nThe F1 score is dened as the harmonic mean of precision\nand recall, where TP stands for true positives, TN for true\nnegatives, FP for false positives, and FN for false negatives\npredicted by the classier:\nF1 score ¼\nTP\nTP þ 1\n2 ðFP þ FNÞ\nSpecicity or else True Negative Rate (TNR) is an indicator of\nhow correctly the model is predicting the negative class:\nSpecificity ¼ TN\nTN þ FP\n2.6 Adding an uncertainty aware component\nMachine learning techniques can be used as a powerful and\ncost-eﬀective strategy to learn from existing datasets and\nperform predictions on new unseen data. The standard\napproach is to train the network to minimize a prediction loss.\nHowever, the resultant model remains ignorant to its prediction\ncondence. Herein, we demonstrate the use of Monte Carlo\nDropout Ensembling as a Bayesian approximation technique to\nprovide uncertainty estimates on the network's scores.\nDropout is a well-established technique for training neural\nnetworks by stochastically setting the weight of each node in the\nnetwork to zero with probability p at every training step.\nDropout was initially introduced as a way to avoid overtting;\nhowever, it has been applied is several other works as a strategy\nto approximate Bayesian inference.\n37–39\n3 Results\n3.1 Co-crystal space exploration\nIn order to get insights from the existing co-crystals in the CSD,\nwe initially categorize them in terms of the type of bonding that\nconnects the molecules in the crystal structure. The three main\nbonding types involve hydrogen bonding, halogen bonding and\nweak interactions (p– p stacking). A two-dimensional visualiza-\ntion including all the existing co-crystals in the CSD was created\nusing a new crystal invariant, namely Pointwise Distance\nDistribution (PDD), previously introduced by Widdowson\net al.\n40,41 PDD was used to represent the co-crystal structure\nderived from the Crystallographic Information File (CIF). The\ndistance between all the existing co-crystals was measured\nusing the Earth Mover's Distance (EMD) between the PDD\ninvariants and the TMAP algorithm was used to draw the co-\ncrystals tree map (Fig. 3). TMAP outputs a Minimum Span-\nning Tree of the crystal dataset by joining all crystal structures\ninto a connected tree without cycles by minimizing the total\nlength, where each edge is measured by EMD between PDD\ninvariants. Hence any crystal is always connected to its nearest\nneighbour.\n42 More details regarding the PDD invariant can be\nfound in the ESI on Section 1.2 and Fig. S2– S4.† As shown in\nFig. 3, the structures are being color-coded based on the inter-\nactions group they belong to. It can be seen that the co-crystal\nspace is dominated by molecules connected via hydrogen-\nbonds.\nFor getting a further insight regarding the electronic char-\nacteristics of the molecular pairs that form the co-crystals, the\nHOMO– LUMO gap between the two molecules was calculated\nusing PM6 semiempirical method.\n43 The calculation was per-\nformed by taking the minimum HOMO – LUMO di ﬀerence\nbetween the two isolated co-formers as min(LUMO mol2–\nHOMOmol1, LUMOmol1– HOMOmol2). Apparently, the HOMO –\nLUMO gap is smaller for the weakly bounded molecular pairs,\nas the majority of the co-crystals is this area form charge\ntransfer complexes showing semi-conducting properties.\nFurthermore, it was also observed that the HOMO– LUMO gap of\nthe weakly bound molecular pairs is lower than that of the\nsingle molecule semiconductors, as shown in the ESI Fig. S1.† It\nis postulated that co-crystallization might be a powerful tech-\nnique for designing organic electronic materials with a smaller\nbandgap of their constituent single-component structures.\nFurther on, the shape of the individual molecules that form\nthe co-crystal pairs is also investigated. Molecular pairs are\nsorted such that therst co-former has larger molecular weight\nthan the second co-former. In the PMI plots presented in Fig. 4\nwe visualize the shape distribution of the two sets of co-formers.\nIt can be seen that the molecules used therst co-former\n(known as API for the pharmaceutical co-crystals) cover\na wider area on the plot indicating that the molecules are more\nshape-diverse than those used as second co-formers (or known\nas excipients for the pharmaceutical co-crystals case). The\nfrequency of the molecules appearing asrst and second co-\nformers was counted, with the top ten molecules of each cate-\ngory are being visualized in Fig. 5.\n3.2 Model comparison\nAs we have established the one-class approach, based on set-\ntransformer, for dealing with the co-crystallization problem,\nwhat remains is to identify the most eﬀective representation of\nour molecules. Herein, we compare four diﬀerent representa-\ntion strategies that make use of the 2D molecular structure.\nBased on each molecular pair's representation method, we\ndeveloped four diﬀerent workows. In addition, two traditional\none class classication algorithms,i.e., kNN and Iforest with the\nMorgan ngerprint as the molecular representation, were\ntrained and tested on the same data as the molecular set\ntransformer (Table 2).\nThe four diﬀerent models based on the diverse representa-\ntion techniques were trained on the‘positive’ co-crystal data. A\n840 | Digital Discovery, 2022,1,8 3 4–850 © 2022 The Author(s). Published by the Royal Society of Chemistry\nDigital Discovery Paper\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\nFig. 3 TMAP of the co-crystal space based on the Pointwise Distance Distribution (PDD) of the crystal structures.41 The co-crystals are color\ncoded based on the main interactions in between the two diﬀerent molecules. Hydrogen bonding is the dominating interaction, whereas the\ninteresting electronic properties arise in the area of the weak interactions where the pairwise HOMO– LUMO diﬀerence enables charge transfer\ninteractions.\nFig. 4 PMI plots of the two co-crystal components, sorted such that theﬁrst molecule in the pair is the one with the highest molecular weight.\nThe corners of the triangle show the most linear, most circular and most spherical molecules in the dataset. On the left, the shape distribution of\nthe molecules found as theﬁrst co-former is shown, covering a wide are of the triangle. On the right plot, the molecules found as the second co-\nformer covering a smaller surface area of the triangle.\n© 2022 The Author(s). Published by the Royal Society of Chemistry Digital Discovery, 2022,1,8 3 4–850 | 841\nPaper Digital Discovery\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\ndataset collection containing 11 di ﬀerent experimental co-\ncrystal screening datasets was used for the validation and\ncomparison of the models. It should be highlighted that for fair\ncomparisons all the overlapping molecular pairs between the\ntraining and the validation datasets were removed from the\ntraining set, such that the models haven't previously‘seen’ any\nof the molecular pairs they are validated on. As there are no\nlabels on the training data, the training task of all the models is\nto minimize the reconstruction loss of the autoencoder, which\nis the building block of the molecular set transformer. We\nexplored the relation between the network parameters and the\nnal accuracy on the external data by performing grid search on\nthe learning rate, the batch size, the weight decay, the number\nof epochs and the dropout rate. The range of the hyper-\nparameters is presented in the ESI Table S3.† All the hyper-\nparameter contributions for the GNN-based model are plotted\non the parallel coordinates plot as shown in Fig. 6a. The parallel\ncoordinate plots for the tested models can be found in the ESI,\nFig. S6– S8.† The range of the hyperparameters, the recon-\nstruction loss of the network and the total validation accuracy\non the‘unseen’ from the network data,i.e., test data, are shown\nin the parallel axes.\nThe parallel co-ordinate plots of the other three models are\nsummarized in the ESI, Fig. S3– S5.† A visual inspection of the\nrelations among the parallel coordinates reveals that there is\na strong correlation between the reconstruction loss and the\nvalidation accuracy (Fig. 6b).\nAer the selection of the best performing hyperparameters,\nthe models were retrained, and their performance on the\nunseen data is reported in Table 2. The performance measures\ninclude the Area Under the Curve (AUC), sensitivity and F1-\nscore.\nThe validation dataset is balanced so the standard metrics\ncan be used to evaluate the performance of the di ﬀerent\nmodels. Finding an accuracy of 75% is a signicant result\nconsidering the fact that the validation data are not extremely\nreliable especially concerning the negative cases. The experi-\nmental validation of the reported successful or unsuccessful co-\ncrystals was not always performed with a detailed crystal\nstructure determination process, but with IR or PXRDs\nFig. 5 The ten most popular molecules appear as (a) theﬁrst co-former and (b) the second co-former and their frequency of appearance on the\nCSD co-crystals dataset.\n842 | Digital Discovery, 2022,1,8 3 4–850 © 2022 The Author(s). Published by the Royal Society of Chemistry\nDigital Discovery Paper\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\nobservations. There are several cases that a molecular pair was\nreported as unable to form a crystal structure and aerwards\ntrying diﬀerent conditions from a diﬀerent researcher gave\na successful result (see Methods, external validation datasets).\nFrom the above, it can be concluded that the molecular set\ntransformer using either Morgan (ECFP4) or GNNngerprints\nperform well with unseen data. Fig. 7 shows the probability\nranking of the list of co-formers on the validation data. The\nscores distribution between the true positives and true negatives\nfor each model as well as the confusion matrices are presented in\nthe Appendix Fig. S11 and S12† respectively. We can see that in\nall models the true positive data points tend to stack on the top of\nthe ranking scatterplot and getting scores close to 1. The exper-\nimentally observed hits are signicantly enriched at the top,\nindicating that virtual screening is a promising tool for focusing\nexperimental eﬀorts and reducing the number of experiments\nrequired to identify successful molecular pairs. The selection of\nthe ‘best’ representation is dependent on the domain of appli-\ncation. Numerous studies have shown that GNN ngerprint\ncould yield more promising results, whereas other studies claim\nthat there is not much diﬀerence.\n46 We should also consider the\nfact that a GNN representation is not as easily interpretable as\nthe molecular descriptors of the Morganngerprint.\nFor developing an ML-based co-crystal screening tool which\ncould be benecial for selecting the next pair to be synthesized\nexperimentally, we need to incorporate two important consid-\nerations of an experimental planning strategy, (i) exploitation,\ni.e., the need for a quick win where we can immediately identify\na successful co-crystal among the top ranking percentile and (ii)\nexploration, i.e., investigating those cases which seem to diﬀer\nFig. 6 (a) Parallel coordinates plot showing the contribution of hyperparameters towards theﬁnal task, i.e., the minimization of the recon-\nstruction loss. Importantly, it can be observed that as the reconstruction error decreases, the validation accuracy on previously unseen data\nincreases. (b) Scatterplot visualizing the correlation between the validation accuracy and the reconstruction loss. Each run with the diﬀerent\nparameters is color-coded with a diﬀerent color. The plots were generated using wandb library (https://wandb.ai/).\n© 2022 The Author(s). Published by the Royal Society of Chemistry Digital Discovery, 2022,1,8 3 4–850 | 843\nPaper Digital Discovery\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\nthe most from the data the ML model has been trained on. This\ncould be achieved by incorporating uncertainty consideration to\nthe model. Looking ahead on the uncertainty of the predictions,\nthe points with higher uncertainties either contain one co-\nformer which belong to a category of molecules not known for\nforming co-crystals, e.g., mannitol sugar or co-former combi-\nnations that have not be seen in co-crystals, e.g., acid– acid\nmolecular pairs. It can be seen that the points predicted as\nnegatives from the model have the higher uncertainties that\nwere misclassied as negatives (false negatives) tend to have\nhigher uncertainty in comparison to the true positives (Fig. 8).\nPoints with uncertainties above 0.005 are worth being rein-\nvestigated especially if they contain molecules that are known to\nform co-crystals. As ML models can only give reliable predic-\ntions on their domain of expertise,i.e., training data, having an\nindication about the uncertainty of each prediction is very\nimportant as points with low scores but high uncertainty might\nalso be interesting synthetic targets. Nevertheless, our model is\na one class classier that has been trained only in the positive\nclass, it is expected that it is going to show the lowest uncer-\ntainty for those points regarded as inliers (positive) from the\nmodel, whereas the points seen as outliers (negative class) tend\nto get high uncertainty scores.\n3.3 Interpretability of the predictions\nAs the key goal is to generate both predictive models and to gain\nphysical insights for the co-crystallization driving forces, an\nexplainable AI technique was applied. Shapley additive expla-\nnations (SHAP) is implemented for rationalizing the scoring of\neach molecular pair by using feature weights represented as\nShapley values from game theory.\n47 SHAP is a model-agnostic\nmethod where sensitivity analysis is used to investigate the\ninuence of systematic feature values changes on the model\noutput. SHAP-generated explanations can be categorized as\nglobal, i.e., summarizing the relevance of input features in the\nmodel or local,i.e., based on individual predictions.\nOf course, the choice of the molecular ‘representation\nmodel’ is an important factor governing the explainability and\nperformance of the AI model as it determines the content and\ntype of the obtained interpretability, i.e., physicochemical\nproperties, functional groups. The features of the input vector\nFig. 7 Probability ranking by the four diﬀerent models used in this work for the external validation sets. The external data consist of two balanced\nclasses of positive and negative data. Yellow dots indicate known co-crystals, whereas unsuccessful co-former pairs are represented as purple\ndots. The red line is a selected threshold highlighting discrimination between the classes. The experimentally observed hits are signiﬁcantly\nenriched at the top-ranking percentile, indicating that virtual screening is a promising tool for focusing experimental eﬀorts.\n844 | Digital Discovery, 2022,1,8 3 4–850 © 2022 The Author(s). Published by the Royal Society of Chemistry\nDigital Discovery Paper\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\nare randomly set on and oﬀ, thereby examining feature inu-\nence in thenal scoring. In that way we can get better insights\nabout which features played an important role in the ranking.\nThe advantage of using Shapley values is that we can get local\ninterpretations, meaning that for any single pair or subset of\nmolecular pairs we can‘see’ which where the molecular char-\nacteristics that played an important role. Shapley local expla-\nnations can also be directly used to highlight the important\nfunctional groups, when molecules are represented as bit\nstrings (Morganngerprint). We used the RDKit functionality\n48\nto map the important bit vectors detected by the SHAP library to\nthe molecular structure, following the same approach to\nRodr´ıguez-P´erez et al.49 In Fig. 9, we present some example pairs\nin which the molecular bits that have the highest contribution\ntowards a high scoring are highlighted.\n3.4 Benchmarking with current available methods\nThe importance of developing accurate and time-eﬃcient co-\ncrystal screening models is showcased by the number of\napproaches that have been developed for this task in the past\nyears.\n24,50,51 Most of these approaches are targeting pharma-\nceutical co-crystals, i.e., pre-screening co-formers against\nseveral APIs, due to the importance of making the API more\nsoluble such that is can be delivered to the body more easily. To\nFig. 8 (a) Confusion matrix of the GNN model (b) matrix of uncertainties related to the True Positive (TP), True Negative (TN), False Positive (FP)\nand False Negative (FN) classes of the GNN mode, (c) error bars indicating the uncertainty of the predictions on the true negative and false\npositive points and (d) error bars indicating the uncertainty of the predictions on the false negative and true positive points. It can be observed that\nthe model shows lower uncertainty for the datapoints which are considered positive.\nFig. 9 Three examples of diclofenac co-crystals when using Shapley\nlocal explanations to visualize the important bits of the molecular graph\nthat drove to high scores of the molecular set transformer. The bits with\nthe highest importance are highlighted with red circles. It can be observed\nthat the two most important groups are the– OH group of the API\n(diclofenac) and the N group of the co-former which can form H-bonds.\n© 2022 The Author(s). Published by the Royal Society of Chemistry Digital Discovery, 2022,1,8 3 4–850 | 845\nPaper Digital Discovery\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\nprove the eﬀectiveness of our method, we compared our two\nbest models, molecular set transformer using either GNN or\nMorgan ngerprints, with other screening approaches that are\ncurrently used and report their performance on publicly avail-\nable data, see ESI Table S3.†\nThe comparisons are performed against two physical model-\nling methods and two machine learning methods on single APIs\nversus the co-formers. As shown in Fig. 10, the evaluation metric\nis the AUC per each API. The two physical modelling methods are\nCOSMO-RS\n52 and a method based on calculated gas phase\nmolecular electrostatic potential surfaces (MEPS).19 The two ML\nmodels refer to a screening tool developed from Wanget al.14 and\nCCGnet50 developed from Jianget al.\nCOSMO-RS relies on the observation that if the enthalpy\nbetween an API-co-former mixture is more negative than the\nenthalpy of the pure components, then the formation of a co-\ncrystal between the two components is highly possible. The\nmethod assesses the miscibility of two components in a super\ncooled liquid phase according to their excess enthalpy,DH\nex,\nwhich is the diﬀerence between enthalpy of the mixture and\nthose of the pure components. The more negative theDHex the\nmore likely the components are to form a stable structure.\nOn the other hand, MEPS is based on an electrostatic model\nthat treats intermolecular interactions as point contacts between\nspecic polar interaction sites on molecular surfaces. The MEPS\nof a molecule is calculated in the gas phase, and this is used to\nidentify a discrete set of surface site interaction points (SSIPs),\nwhich are described by H-bond donor and H-bond acceptor\nparameters a and b. SSIPs identify conventional H-bond donor\nand acceptor sites as well as less polar sites that make weak\nFig. 10 Head-to-head comparison of our best models on individual APIs with other models and methods reported in literature.\n846 | Digital Discovery, 2022,1,8 3 4–850 © 2022 The Author(s). Published by the Royal Society of Chemistry\nDigital Discovery Paper\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\nelectrostatic interactions, so they completely describe the surface\nproperties of a molecule and can be used to calculate the total\ninteraction of a molecule with its environment.\n19\nRegarding the ML models that have been developed for co-\ncrystal screening, they are based on supervised training of\nbinary classiers. A large-scale machine learning model, indi-\ncated as the Wang method, based on random forest and\nMorgan ngerprint have been previously tested on most of the\ntwelve APIs shown in Fig. 10.\nAnother recent data-driven method, namely CCGnet\ncombining 3D molecular structures and some important\nmolecular ngerprints was tested on the MOP and ibuprofen\nexternal datasets (Fig. 10 grey bars) as these were the only two\nAPIs that were not part in their training set and a reliable out-of-\ndistribution evaluation score could be calculated. The accuracy\nin the two previously unseen from their model cases is smaller\nthan the other ML models tested in this work.\nNote that the majority of methods we are comparing with are\neither based on theoretical models, or ML binary classiers. Our\nmethodology is only based on neural networks and only positive\ndata was used due to the lack of reliable negative data points\nwithin our training set. It is noteworthy that the molecular set\ntransformer was able to have comparable accuracy to compu-\ntational chemistry models although it was based only on the\nmolecular ngerprint. Both our models show the lowest\nperformance for the itraconazole dataset which is the smallest\ndataset containing only 8 entries. Itraconazole (Fig. 11) is a large\nmolecule not only containing many diﬀerent functional groups\nbut also an unusual N– N bonding into two of the aromatic\nrings. Although four itraconazole co-crystals are reported as\na hit in the literature extracted dataset, there is only one itra-\nconazole co-crystal deposited in the CSD, i.e., itraconazole:-\nsuccinic acid (CSD id: REWTUK). Moreover, there are very few\nexamples of co-crystals with chemically similar molecules. As\nsuch, the performance of our models is limited by the fact that\nthere not enough molecular pairs for training containing\nsimilar compounds.\n3.5 Dataset of suggested experiments – ZINC20\nTo further demonstrate the applicability of the methodology,\none of our best performing models,i.e., the Morganngerprint\nmodel, was used for predicting high-probability molecular pairs\nfrom a freely available database with purchasable molecules,\nnamely ZINC20.\n53 We extracted all the neutral in-stock\nmolecules getting a starting dataset of 6 883 326 molecules\nrepresented as SMILES strings. Out of them we selected only\nthose that have Tanimoto similarity > 0.8 with the molecules\nthat form all the known co-crystals in CSD. That process limited\nthe dataset to 3119 single molecules.\nSolubility and lipophilicity are key parameters that can\ndictate the success or failure rate of drug discovery and devel-\nopment. Successful drug compounds should have lipophilicity\noptimal values between 2 and 3 to achieve the optimal\nbioavailability resistance to metabolism solubility and toxicity.\nTheir measurement is vital for bothin vivo and in silico evalu-\nation of drug properties. We followed similar approach to Zhao\net al.using SwissADME\n54 for the calculation of the logP values as\nan indicator for lipophilicity.55 By limiting the selected mole-\ncules based on lipophilicity, the molecular dataset was reduced\nto 300 molecules that pass all these constraints.\nAll the possible pairs between these molecules were gener-\nated and ranked based on our model. Those pairs that scored\nabove 0.8 are plotted in a 2D map and unsupervised clustering\nwas used to cluster them into similarity groups. The represen-\ntation used is the ngerprint and the distance metric is the\nTanimoto distance of the pairs. An interactive plot of the high\nscoring pairs is provided ( https://zinc20.herokuapp.com/)a s\ndemonstrated in Fig. 12. The molecular pairs identied from\nthe screening were projected into a two-dimensional map and\nwere grouped into chemical families using thek-means clus-\ntering algorithm. By selecting one point in the interactive map\na table is printed which displays the SMILES strings of the two\nmolecules, the molecular diagrams as well as the score and\nuncertainty of each molecular combination. Overall, we identi-\ned /C24 2000 high-scoring potential molecular pairs with low\nFig. 11 Itraconazole molecular structure.\nFig. 12 2D UMAP embedding of the chemical space of the high\nscoring co-crystal pairs, colour-coded byk-means clusters identiﬁed\nusing the 2D UMAP coordinates. For each selected point a table is\ndisplayed showing the images of the molecular pairs, the score of the\nmodel and the uncertainty of the prediction.\n© 2022 The Author(s). Published by the Royal Society of Chemistry Digital Discovery, 2022,1,8 3 4–850 | 847\nPaper Digital Discovery\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\nuncertainty, which cover a diverse set of shapes in the molecular\nspace. These pairs could be good possible synthetic targets for\nachieving novel co-crystals.\n4 Conclusions\nIn this work our primary goal was to develop a computational\nscreening tool for prioritizing molecular pairs which can form\nstable multicomponent structures, namely co-crystals. To ach-\nieve this, we introduce molecular set transformer, an attention\nbased neural network, which is capable of learning how to\nrepresent molecular sets. Our machine learning framework has\nthree main parts: (1) data curation and representation, (2)\na machine-learning algorithm with hyperparameter tuning and\n(3) validation on external literature data. Therst part involves\nthe extraction of all the available co-crystals from the Cam-\nbridge structural database and the testing of several represen-\ntation techniques, both xed (Mordred descriptors, Morgan\nngerprint) and learned representations (GNN, ChemBERTa).\nWe demonstrated that pre-trained models can be eﬀectively\nused as‘encoders’ for molecules to generate structural features.\nThese features can then be used as input to the neural network\nto predict molecular pairs for co-crystallization. It was found\nthat using pretrained models to encode the molecules, reduced\nthe uncertainty on the ranking as the models were pretrained\non a signicantly larger corpus of molecules instead of only on\nmolecules that form co-crystals.\nThe second part refers to the design of the neural network by\nsetting an eﬀective training strategy. As opposed to the currently\nexisting co-crystal screening approaches which rely on the\nextraction or generation of a negative dataset with molecular\npairs that are highly unlikely to co-crystallize to train binary\nclassiers, our work illustrates the use of only the positive class.\nMolecular set transformer is trained on all the known positive\ndata and isne-tuned with the task to eﬃciently reconstruct the\ninput pair. Each molecular pair is‘seen’ as a set, as such the\nmodel is order invariant and can capture the bidirectionality of\nthe problem.\nFinally, the third part is about measuring the performance of\nour model on external datasets consisting of both positive and\nnegative data. The benchmarking dataset was created by\nsearching for experimental reports and is provided in this work\nas a well-curated validation dataset for further use in testing co-\ncrystal screening methodologies. Our approach was compared\nto other ML and physical modelling methods, showing similar\nor better performance on well-known APIs. It is noteworthy that\na model trained only in one class in an unsupervised manner\nperforms equally or better than supervised binary classiers.\nOverall, this work is aiming towards contributing to the co-\ncrystal design eld by addressing the major challenges faced\nin current data-driven for materials discovery. The problems\naddressed herein are the lack of negative data, the eﬀect that\ndiﬀerent molecular representations have in the model's\nperformance, the uncertainty calibration of the model's\npredictions, the extrapolation on previously unseen data and\nthe interpretability of the models. A solution to these problems\nis given by providing models that can evaluate diverse\nmolecular pairs for their possibility to form co-crystals, not\nlimited to pharmaceutical co-crystals but also co-crystals of\nelectronic interest. The usefulness of the proposed approach is\nfurther demonstrated by ranking combinations from ZINC20\nand providing an interactive map of high-ranking high-certainty\ncombinations. Furthermore, the co-crystal screening tool is\nopen source and could provide a ranking and an uncertainty\nestimate for any user provided molecular pair. In that way both\npositive and negative co-crystal datasets could be created and\nexperimentally validated.\nData availability\nWe provide detailed instructions for the installation, training,\nand general usage of the open-source molecular set transformer\non GitHub. In addition, pre-trained network weights for the\nmodels reported in this work are available for download. The\nfollowing les are available with this publication: (1) GitHub\nrepository with the source code,gures, and example co-crystal\nscreening: https://github.com/lrcfmd/\nMolecularSetTransformer. (2) An interactive browser-based\nexplorer with all the co-crystals deposited in CSD linked with\nWebCSD: https://csd-cocrystals.herokuapp.com/. (3) An online\nGUI for rapid in silico co-crystal screening: https://\nshare.streamlit.io/katerinavr/streamlit/app.py. (4) An\ninteractive plot of high scoring molecular pairs extracted from\nZINC20 https://zinc20.herokuapp.com/ and (5) ESI† with the\nbenchmarking datasets gathered from publicly available\nresources.\nConﬂicts of interest\nThere are no conicts to declare.\nAcknowledgements\nWe thank the Cambridge Crystallographic Data Centre for the\nprovision of studentship funding to A. V. V. K. acknowledges\nEPSRC grant EP/R018472/1 and the Royal Academy of Engi-\nneering Industrial Fellowship IF2122\\186. The authors thank\nthe Leverhulme Trust for fundingvia the Leverhulme Research\nCentre for Functional Materials Design (RC-2015-036).\nReferences\n1 B. Rozemberczki, S. Bonner, A. Nikolov, M. Ughetto,\nS. Nilsson and E. Papa, Proceedings of the Thirty-First\nInternational Joint Conference on Articial Intelligence, 2022,\npp. 5530– 5537.\n2 A. Vriza, A. B. Canaj, R. Vismara, L. J. Kershaw Cook,\nT. D. Manning, M. W. Gaultois, P. A. Wood, V. Kurlin,\nN. Berry, M. S. Dyer and M. J. Rosseinsky,Chem. Sci., 2021,\n12, 1702– 1719.\n3 V. A. Nadtochenko, V. V. Gritsenko, O. A. D ’yachenko,\nG. V. Shilov and A. P. Moravskii,Russ. Chem. Bull., 1996,\n45(5), 1224– 1225.\n848 | Digital Discovery, 2022,1,8 3 4–850 © 2022 The Author(s). Published by the Royal Society of Chemistry\nDigital Discovery Paper\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\n4 Clarivate, https://clarivate.com/webofsciencegroup/\nsolutions/web-of-science/, (accessed September 2, 2021).\n5 H. Alves, A. S. Molinari, H. Xie and A. F. Morpurgo,Nat.\nMater., 2008,7, 574– 580.\n6 J. R. Kirtley and J. Mannhart,Nat. Mater., 2008,7, 520– 521.\n7 J. J. Dannenberg,J. Am. Chem. Soc., 1998,120, 5604.\n8 C. B. Aaker¨oy, N. C. Schultheiss, A. Rajbanshi, J. Desper and\nC. Moore,Cryst. Growth Des., 2009,9, 432– 441.\n9 C. A. Hunter, K. R. Lawson, J. Perkins and C. J. Urch,J. Chem.\nSoc., Perkin Trans. 2, 2001, 651– 669.\n10 L. F´abi´an, Cryst. Growth Des., 2009,9, 1436– 1443.\n11 J. G. P. Wicker, L. M. Crowley, O. Robshaw, E. J. Little,\nS. P. Stokes, R. I. Cooper and S. E. Lawrence,\nCrystEngComm, 2017,19, 5336– 5340.\n12 M. Przybyłek, T. Jeli´nski, J. Słabuszewska, D. Zi´ołkowska,\nK. Mroczy´nska and P. Cysewski, Cryst. Growth Des., 2019,\n19, 3876– 3887.\n13 M. Przybyłek and P. Cysewski,Cryst. Growth Des., 2018, 18,\n3524– 3534.\n14 D. Wang, Z. Yang, B. Zhu, X. Mei and X. Luo,Cryst. Growth\nDes., 2020,20, 6610– 6621.\n15 J. Devogelaer, H. Meekes, P. Tinnemans, E. Vlieg and\nR. Gelder,Angew. Chem., Int. Ed., 2020,59\n, 21711– 21718.\n16 C. R. Groom, I. J. Bruno, M. P. Lightfoot and S. C. Ward,Acta\nCrystallogr., Sect. B: Struct. Sci., Cryst. Eng. Mater., 2016, 72,\n171– 179.\n17 C. B. Aaker¨oy and A. S. Sinha, inCo-crystals: Preparation,\nCharacterization and Applications , The Royal Society of\nChemistry, 2018, pp. 1– 32.\n18 S. Karki, T. Frii´c, L. F´abi´an and W. Jones,CrystEngComm,\n2010, 12, 4038– 4041.\n19 T. Grecu, C. A. Hunter, E. J. Gardiner and J. F. McCabe,Cryst.\nGrowth Des., 2014,14, 165– 171.\n20 L. K. Mapp, S. J. Coles and S. Aitipamula,Cryst. Growth Des.,\n2017, 17, 163– 174.\n21 N. Sarkar, J. Mitra, M. Vittengl, L. Berndt and C. B. Aaker¨oy,\nCrystEngComm, 2020,22, 6776– 6779.\n22 M. Khalaji, M. J. Potrzebowski and M. K. Dudek, Cryst.\nGrowth Des., 2021,21, 2301– 2314.\n23 J.-J. Devogelaer, M. D. Charpentier, A. Tijink, V. Dupray,\nG. Coquerel, K. Johnston, H. Meekes, P. Tinnemans,\nE. Vlieg, J. H. ter Horst and R. de Gelder, Cryst. Growth\nDes., 2021,21, 3428– 3437.\n24 D. Wu, B. Zhang, Q. Yao, B. Hou, L. Zhou, C. Xie, J. Gong,\nH. Hao and W. Chen,Cryst. Growth Des., 2021, 21, 4531–\n4546.\n25 K. Yang, K. Swanson, W. Jin, C. Coley, P. Eiden, H. Gao,\nA. Guzman-Perez, T. Hopper, B. Kelley, M. Mathea,\nA. Palmer, V. Settels, T. Jaakkola, K. Jensen and\nR. Barzilay,J. Chem. Inf. Model., 2019,59, 3370– 3388.\n26 K. V. Chuang, L. M. Gunsalus and M. J. Keiser,J. Med. Chem.,\n2020, 63, 8705\n– 8722.\n27 H. Moriwaki, Y. S. Tian, N. Kawashita and T. Takagi, J.\nCheminf., 2018,10,1 – 14.\n28 E. J. Gardiner, J. D. Holliday, C. O'Dowd and P. Willett,\nFuture Med. Chem., 2011,3, 405– 414.\n29 G. Landrum, P. Tosco, B. Kelley, N. sriniker, R. Vianello,\nA. Ric, B. Cole, A. Savelyev, M. Swain, S. Turk,\nD. N. A. Vaucher, E. Kawashima, M. W ´ojcikowski,\nD. Probst, G. Godin, D. Cosgrove, A. Pahl, J. P.,\nF. Berenger, J. L. strets123, N. O'Boyle, P. Fuller,\nJ. H. Jensen, G. Sforna and D. Gavid, rdkit/rdkit:\n2020_03_1 (Q1 2020) Release, https://zenodo.org/record/\n3732262, (accessed November 27, 2021).\n30 A. M. Dai, Q. v. Le, inProceedings of the 28th International\nConference on Neural Information Processing Systems -\nVolume 2 Adv. Neural Inf. Process. Syst. , MIT Press,\nCambridge, MA, USA, 2015, vol. 28, pp. 3079– 3087.\n31 W. Hu, B. Liu, J. Gomes, M. Zitnik, P. Liang, V. Pande and\nJ. Leskovec, arXiv preprint arXiv:1905.12265 [cs.LG], 2016.\n32 S. Chithrananda, G. Grand and B. Ramsundar, arXiv\npreprint, arXiv:2010.09885, 2010.\n33 J. Lee, Y. Lee, J. Kim, A. R. Kosiorek, S. Choi and Y. W. Teh,\nProceedings of Machine Learning Research, 2019, vol. 97, pp.\n3744– 3753.\n34 I. Goodfellow, Y. Bengio and A. Courville,Deep Learning, MIT\nPress, 2016.\n35 D. Yu, M. Kolbaek, Z. H. Tan and J. Jensen, inICASSP, IEEE\nInternational Conference on Acoustics , Speech and Signal\nProcessing - Proceedings, 2017, pp. 241– 245.\n36 L. Biewald,Weights & Biases, https://www.wandb.com.\n37 J. P. Janet, C. Duan, T. Yang, A. Nandy and H. J. Kulik,Chem.\nSci., 2019,10, 7913– 7922.\n38 P. Schwaller, T. Laino, T. Gaudin, P. Bolgar, C. A. Hunter,\nC. Bekas and A. A. Lee,ACS Cent. Sci., 2019,5, 1572– 1583.\n39 L. Hirschfeld, K. Swanson, K. Yang, R. Barzilay and\nC. W. Coley,J. Chem. Inf. Model., 2020,60, 3770– 3780.\n40 D. Widdowson, M. M. Mosca, A. Pulido, A. I. Cooper and\nV. Kurlin,Match, 2021,87, 529– 559.\n41 D. Widdowson and V. Kurlin,Proceedings of NeurIPS, 2022.\n42 D. Probst and J. L. Reymond,J. Cheminf., 2020,12, 12.\n43 T. Saito, Y. Kitagawa and Y. Takano,\nJ. Phys. Chem. A, 2016,\n120, 8750– 8760.\n44 F. T. Liu, K. M. Ting and Z. H. Zhou, inProceedings - IEEE\nInternational Conference on Data Mining, ICDM, 2008, pp.\n413– 422.\n45 S. Ramaswamy, R. Rastogi and K. Shim, Association for\nComputing Machinery(ACM), 2000, pp. 427– 438.\n46 D. Jiang, Z. Wu, C.-Y. Hsieh, G. Chen, B. Liao, Z. Wang,\nC. Shen, D. Cao, J. Wu and T. Hou,J. Cheminf., 2021, 13,\n1– 23.\n47 S. M. Lundberg and S. I. Lee, in Advances in Neural\nInformation Processing Systems, 2017, vol. 2017, pp. 4766–\n4775.\n48 Using the new ngerprint bit rendering code, https://\nrdkit.blogspot.com/2018/10/using-new-ngerprint-bit-\nrendering-code.html.\n49 R. Rodr´ıguez-P´erez and J. Bajorath,J. Med. Chem., 2020,63,\n8761– 8777.\n50 Y. Jiang, Z. Yang, J. Guo, H. Li, Y. Liu, Y. Guo, M. Li and X. Pu,\nNat. Commun., 2021,12, 5950.\n51 D. Wang, Z. Yang, B. Zhu, X. Mei and X. Luo,Cryst. Growth\nDes., 2020,20, 6621.\n© 2022 The Author(s). Published by the Royal Society of Chemistry Digital Discovery, 2022,1,8 3 4–850 | 849\nPaper Digital Discovery\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online\n52 Y. A. Abramov, C. Loschen and A. Klamt,J. Pharm. Sci., 2012,\n101, 3687– 3697.\n53 J. J. Irwin, K. G. Tang, J. Young, C. Dandarchuluun,\nB. R. Wong, M. Khurelbaatar, Y. S. Moroz, J. Mayeld and\nR. A. Sayle,J. Chem. Inf. Model., 2020,60, 6065– 6073.\n54 A. Daina, O. Michielin and V. Zoete,Sci. Rep., 2017,7,1 – 13.\n55 Z. W. Zhao,¨O. H. Omar, D. Padula, Y. Geng and A. Troisi,J.\nPhys. Chem. Lett., 2021,12, 5009– 5015.\n850 | Digital Discovery, 2022,1,8 3 4–850 © 2022 The Author(s). Published by the Royal Society of Chemistry\nDigital Discovery Paper\nOpen Access Article. Published on 29 September 2022. Downloaded on 11/5/2025 5:29:41 PM. \n This article is licensed under a \nCreative Commons Attribution 3.0 Unported Licence.\nView Article Online"
}