{
    "title": "On the effectiveness of compact biomedical transformers",
    "url": "https://openalex.org/W4321749402",
    "year": 2023,
    "authors": [
        {
            "id": "https://openalex.org/A2757931577",
            "name": "Omid Rohanian",
            "affiliations": [
                "University of Oxford"
            ]
        },
        {
            "id": "https://openalex.org/A4287895949",
            "name": "Mohammadmahdi Nouriborji",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1576228199",
            "name": "Samaneh Kouchaki",
            "affiliations": [
                "University of Surrey"
            ]
        },
        {
            "id": "https://openalex.org/A2057169223",
            "name": "David A Clifton",
            "affiliations": [
                "University of Oxford",
                "Suzhou Research Institute"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2136437513",
        "https://openalex.org/W6778883912",
        "https://openalex.org/W2169099542",
        "https://openalex.org/W2100627415",
        "https://openalex.org/W3024922541",
        "https://openalex.org/W2145870108",
        "https://openalex.org/W2911489562",
        "https://openalex.org/W3141847762",
        "https://openalex.org/W2071879021",
        "https://openalex.org/W2788388592",
        "https://openalex.org/W2154142897",
        "https://openalex.org/W1981208470",
        "https://openalex.org/W6739901393",
        "https://openalex.org/W6773815586",
        "https://openalex.org/W3008374555",
        "https://openalex.org/W4385245566",
        "https://openalex.org/W4292779060",
        "https://openalex.org/W2149369282",
        "https://openalex.org/W2346452181"
    ],
    "abstract": "Abstract Motivation Language models pre-trained on biomedical corpora, such as BioBERT, have recently shown promising results on downstream biomedical tasks. Many existing pre-trained models, on the other hand, are resource-intensive and computationally heavy owing to factors such as embedding size, hidden dimension and number of layers. The natural language processing community has developed numerous strategies to compress these models utilizing techniques such as pruning, quantization and knowledge distillation, resulting in models that are considerably faster, smaller and subsequently easier to use in practice. By the same token, in this article, we introduce six lightweight models, namely, BioDistilBERT, BioTinyBERT, BioMobileBERT, DistilBioBERT, TinyBioBERT and CompactBioBERT which are obtained either by knowledge distillation from a biomedical teacher or continual learning on the Pubmed dataset. We evaluate all of our models on three biomedical tasks and compare them with BioBERT-v1.1 to create the best efficient lightweight models that perform on par with their larger counterparts. Results We trained six different models in total, with the largest model having 65 million in parameters and the smallest having 15 million; a far lower range of parameters compared with BioBERT’s 110M. Based on our experiments on three different biomedical tasks, we found that models distilled from a biomedical teacher and models that have been additionally pre-trained on the PubMed dataset can retain up to 98.8% and 98.6% of the performance of the BioBERT-v1.1, respectively. Overall, our best model below 30 M parameters is BioMobileBERT, while our best models over 30 M parameters are DistilBioBERT and CompactBioBERT, which can keep up to 98.2% and 98.8% of the performance of the BioBERT-v1.1, respectively. Availability and implementation Codes are available at: https://github.com/nlpie-research/Compact-Biomedical-Transformers. Trained models can be accessed at: https://huggingface.co/nlpie.",
    "full_text": null
}