{
  "title": "Factors Affecting Digital Tool Use in Client Interaction According to Mental Health Professionals: Interview Study",
  "url": "https://openalex.org/W4367593242",
  "year": 2023,
  "authors": [
    {
      "id": null,
      "name": "Lukka, Lauri",
      "affiliations": [
        "Aalto University"
      ]
    },
    {
      "id": null,
      "name": "Karhulahti, Veli-Matti",
      "affiliations": [
        "University of Jyväskylä"
      ]
    },
    {
      "id": "https://openalex.org/A5082608840",
      "name": "Palva J Matias",
      "affiliations": [
        "Wellcome Centre for Human Neuroimaging",
        "University of Glasgow",
        "University of Helsinki",
        "Aalto University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4205208574",
    "https://openalex.org/W2934186567",
    "https://openalex.org/W2158693921",
    "https://openalex.org/W2530268835",
    "https://openalex.org/W2077289112",
    "https://openalex.org/W3197232629",
    "https://openalex.org/W3044951923",
    "https://openalex.org/W3003162347",
    "https://openalex.org/W2968620208",
    "https://openalex.org/W2044661514",
    "https://openalex.org/W2143970799",
    "https://openalex.org/W2134813353",
    "https://openalex.org/W2015114767",
    "https://openalex.org/W3113891030",
    "https://openalex.org/W2769032457",
    "https://openalex.org/W3000041178",
    "https://openalex.org/W2809224378",
    "https://openalex.org/W2171501379",
    "https://openalex.org/W2026448758",
    "https://openalex.org/W3080591602",
    "https://openalex.org/W3173538575",
    "https://openalex.org/W3026387323",
    "https://openalex.org/W2032365826",
    "https://openalex.org/W4300681202",
    "https://openalex.org/W2080635446",
    "https://openalex.org/W2971896244",
    "https://openalex.org/W2922007928",
    "https://openalex.org/W2218513916",
    "https://openalex.org/W3128534511",
    "https://openalex.org/W4376133551",
    "https://openalex.org/W1982698797",
    "https://openalex.org/W4205983219",
    "https://openalex.org/W3049262897",
    "https://openalex.org/W4205339579",
    "https://openalex.org/W2258988981",
    "https://openalex.org/W3006990847",
    "https://openalex.org/W3083811062",
    "https://openalex.org/W2809940040",
    "https://openalex.org/W2042974047",
    "https://openalex.org/W2694642487",
    "https://openalex.org/W4205816655",
    "https://openalex.org/W2896957784",
    "https://openalex.org/W2948290265",
    "https://openalex.org/W2988986990",
    "https://openalex.org/W3034516154",
    "https://openalex.org/W2950361006",
    "https://openalex.org/W2346033637",
    "https://openalex.org/W2579093319",
    "https://openalex.org/W3171849509",
    "https://openalex.org/W2805939587",
    "https://openalex.org/W2120522957",
    "https://openalex.org/W2483716051",
    "https://openalex.org/W3023473272",
    "https://openalex.org/W3037803689",
    "https://openalex.org/W2341756679",
    "https://openalex.org/W2895871399",
    "https://openalex.org/W1966931250",
    "https://openalex.org/W2008913319",
    "https://openalex.org/W2092473556",
    "https://openalex.org/W2911793200",
    "https://openalex.org/W3208645186",
    "https://openalex.org/W2129660502",
    "https://openalex.org/W4296127454",
    "https://openalex.org/W2147417754",
    "https://openalex.org/W3017214408",
    "https://openalex.org/W2170827698",
    "https://openalex.org/W1979290264",
    "https://openalex.org/W2950504429",
    "https://openalex.org/W2135933369",
    "https://openalex.org/W2138664283",
    "https://openalex.org/W2023687307",
    "https://openalex.org/W2083869465",
    "https://openalex.org/W2016730811",
    "https://openalex.org/W2020155291",
    "https://openalex.org/W2419473118",
    "https://openalex.org/W2905522132",
    "https://openalex.org/W1766812542",
    "https://openalex.org/W2003174154",
    "https://openalex.org/W2801947150",
    "https://openalex.org/W2099697766",
    "https://openalex.org/W2981990831",
    "https://openalex.org/W2149436609",
    "https://openalex.org/W2330794397",
    "https://openalex.org/W4280518028",
    "https://openalex.org/W2161380409",
    "https://openalex.org/W2136608905",
    "https://openalex.org/W1851892858",
    "https://openalex.org/W2110917063",
    "https://openalex.org/W3134505682",
    "https://openalex.org/W2607036075",
    "https://openalex.org/W1968832457",
    "https://openalex.org/W2101270539",
    "https://openalex.org/W1989529511",
    "https://openalex.org/W2139074866",
    "https://openalex.org/W2765304416",
    "https://openalex.org/W3119587736",
    "https://openalex.org/W4205900283",
    "https://openalex.org/W4226062002",
    "https://openalex.org/W2619306859"
  ],
  "abstract": "Background Digital tools and interventions are being increasingly developed in response to the growing mental health crisis, and mental health professionals (MHPs) considerably influence their adoption in client practice. However, how MHPs use digital tools in client interaction is yet to be sufficiently understood, which poses challenges to their design, development, and implementation. Objective This study aimed to create a contextual understanding of how MHPs use different digital tools in clinical client practice and what characterizes the use across tools. Methods A total of 19 Finnish MHPs participated in semistructured interviews, and the data were transcribed, coded, and inductively analyzed. Results We found that MHP digital tool use was characterized by 3 distinct functions: communication, diagnosis and evaluation, and facilitating therapeutic change. The functions were addressed using analog tools, digitized tools that mimic their analog counterparts, and digital tools that use the possibilities native to digital. The MHP-client communication included various media alongside face-to-face meetings, the MHPs increasingly used digitized tools in client evaluation, and the MHPs actively used digitized materials to facilitate therapeutic change. MHP tool use was generally characterized by adaptability—it was negotiated in client interactions. However, there was considerable variance in the breadth of MHPs’ digital toolbox. The existing clinical practices emphasized MHP-client interaction and invited incremental rather than radical developments, which challenged the achievement of the scalability benefits expected from digital tools. Conclusions MHPs use digitized and digital tools in client practice. Our results contribute to the user-centered research, development, and implementation of new digital solutions in mental health care by classifying them according to their function and medium and describing how MHPs use and do not use them.",
  "full_text": "Original Paper\nFactors Affecting Digital Tool Use in Client Interaction According\nto Mental Health Professionals: Interview Study\nLauri Lukka1, MA; Veli-Matti Karhulahti2, PhD; J Matias Palva1,3,4, PhD\n1Department of Neuroscience and Biomedical Engineering, Aalto University, Espoo, Finland\n2Faculty of Humanities and Social Sciences, University of Jyväskylä, Jyväskylä, Finland\n3Neuroscience Center, Helsinki Institute of Life Science, University of Helsinki, Helsinki, Finland\n4Centre for Cognitive Neuroimaging, Institute of Neuroscience and Psychology, University of Glasgow, Glasgow, United Kingdom\nCorresponding Author:\nLauri Lukka, MA\nDepartment of Neuroscience and Biomedical Engineering\nAalto University\nRakentajanaukio 2\nEspoo, 02150\nFinland\nPhone: 358 440375666\nEmail: lauri.lukka@aalto.fi\nAbstract\nBackground: Digital tools and interventions are being increasingly developed in response to the growing mental health crisis,\nand mental health professionals (MHPs) considerably influence their adoption in client practice. However, how MHPs use digital\ntools in client interaction is yet to be sufficiently understood, which poses challenges to their design, development, and\nimplementation.\nObjective: This study aimed to create a contextual understanding of how MHPs use different digital tools in clinical client\npractice and what characterizes the use across tools.\nMethods: A total of 19 Finnish MHPs participated in semistructured interviews, and the data were transcribed, coded, and\ninductively analyzed.\nResults: We found that MHP digital tool use was characterized by 3 distinct functions: communication, diagnosis and evaluation,\nand facilitating therapeutic change. The functions were addressed using analog tools, digitized tools that mimic their analog\ncounterparts, and digital tools that use the possibilities native to digital. The MHP-client communication included various media\nalongside face-to-face meetings, the MHPs increasingly used digitized tools in client evaluation, and the MHPs actively used\ndigitized materials to facilitate therapeutic change. MHP tool use was generally characterized by adaptability—it was negotiated\nin client interactions. However, there was considerable variance in the breadth of MHPs’ digital toolbox. The existing clinical\npractices emphasized MHP-client interaction and invited incremental rather than radical developments, which challenged the\nachievement of the scalability benefits expected from digital tools.\nConclusions: MHPs use digitized and digital tools in client practice. Our results contribute to the user-centered research,\ndevelopment, and implementation of new digital solutions in mental health care by classifying them according to their function\nand medium and describing how MHPs use and do not use them.\n(JMIR Hum Factors 2023;10:e44681) doi: 10.2196/44681\nKEYWORDS\nclinical practice; digital mental health interventions; intervention design; mental health applications; mental health professionals;\nteletherapy; mobile phone\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 1https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nIntroduction\nBackground\nMental disorders are the leading cause of disease burden\nworldwide [1]. However, a substantial number of people with\nmental disorders fail to receive adequate support and treatment\nfor their challenges [2]. It is believed that digital technologies\ncan increase the effectiveness, accessibility, and\ncost-effectiveness of existing treatments, which is a considerable\nmotivation for their development [3-7].\nMental health professionals (MHPs) play a considerable role\nin how mental disorders are treated and which digital tools and\nmaterials are used in clinical practice. They act as gatekeepers\nfor web-based therapies [8] and exercise their influence by\nrecommending digital materials, platforms, and treatments to\ntheir clients [9]. Thus, alongside their clients, MHPs constitute\na second key user group [10] whose attitudes and needs are vital\nto understand when designing and developing new digital tools.\nMHP and client needs relate through the so-called therapeutic\nalliance. Bordin [11] describes that it consists of three factors:\n(1) a positive attachment bond between the MHP and their client,\n(2) their shared agreement on the therapy goals, and (3) pursuing\nthese goals through tasks in therapeutic interaction. The\ntherapeutic relationship has been found to substantially\ncontribute to the effectiveness of therapy [12,13]. Today, digital\ntools present changes and possibilities for the therapeutic\nalliance [14-16]—telehealth solutions facilitate the contact\nbetween the MHP and their client, and in counseling, the MHP\nmay facilitate the change through complementary digitized\nmaterials, digital therapies, and mobile apps. The therapeutic\nalliance is becoming digitally enhanced.\nMHP Digital Tool Use in Client Practice\nTelehealth Solutions\nThe COVID-19 crisis has substantially changed how MHPs\ninteract with their clients. Before the crisis, only a minority of\nthe interactions occurred remotely. A 2018 published survey\nfound that 57% of US psychologists did not engage in\ntelecounseling, with only 6% delivering >6 hours of\ntelecounseling per week [17]. Landlines and mobile phones\nwere considerably more commonly used. In Portugal,\nMendes-Santos et al [9] had similar findings: 30% of\npsychologists used digital technology to support their clients,\nmost often via telephone, email, and SMS text messages; only\n9% used videoconferencing. Such low use likely reflects the\nnumerous barriers to using telehealth solutions, including the\nperceived dehumanization of the therapeutic environment, client\nand clinician suitability factors, and the prohibitive costs of the\nsolutions, as well as issues with reimbursement, confidentiality,\nand data protection [18,19]. However, the pandemic has forced\ntherapists to offer their services remotely [20-22], and today,\ndigital media increasingly facilitate client contact.\nDigital Materials\nClients can use psychoeducational materials independently to\nalleviate their psychiatric symptoms, such as depression [23].\nMHPs also often recommend complementary web-based\nmaterials to be accessed between therapy sessions [9,24],\nincluding websites, forums, blogs, social media, and support\ngroups. The need for recommendations exists as not all abundant\nweb-based materials comply with and reflect the best treatment\npractices [3]. To help both MHPs and their clients navigate\nweb-based materials, digital mental health hubs have been\ncreated. Canadian eMentalHealth.ca, for example, provides\ninformation on mental health, self-assessment forms, and contact\npoints to health care, and the 2 million annual users generally\nfind the service positive [25]. In Finland, MentalHub (in Finnish,\n“Mielenterveystalo”), developed by the Helsinki University\nHospital (HUS), serves a similar purpose. It provides\npsychoeducation, self-guided treatments, symptom navigators,\nservice directories, and internet therapies [26].\nDigital Mental Health Interventions\nComprehensive and structured digital treatment programs have\nalso been developed. These emerging therapies have been called\ncomputer-assisted therapy [27] and internet-delivered\npsychological treatments [28]; we use the concept of digital\nmental health interventions (DMHIs) [29]. A recent\nmeta-analysis found that therapist-supported internet-based\ninterventions yield similar effects as face-to-face cognitive\nbehavioral therapy (CBT) [30]. Indeed, MHP contact is\nbeneficial in motivating and engaging the client in the digital\nintervention. DMHIs with therapist support are more effective\nthan without it [31,32]. Similar to traditional face-to-face\ntherapy, the quality of the mediated therapeutic alliance during\nthe DMHI contributes to treatment outcomes [33]. Moreover,\nit appears that the richness of the contact facilitates treatment\nresults—face-to-face support is more effective than telephone\nsupport, which is more effective than email support [27].\nUnguided, guided, and blended therapies have been actively\ndeveloped and used. An example of a guided DMHI is the\nHUS-provided, physician-referred 12-session CBT program for\ngeneralized anxiety disorder [34]. The program is theoretically\nbased on several models of anxiety, trained therapists offer\nsupport through the program using asynchronous messages, and\nthe program includes persuasive elements such as simulation\nand reminders to increase client engagement. HUS has\ndeveloped internet therapies for other mental disorders as well,\nsuch as depression, attention-deficit/hyperactivity disorder, and\nbipolar disorder [35], which are referred to in this research as\n“national DMHI.” Blended therapies combine both digital and\nface-to-face interaction [36]. In the United Kingdom, Stawarz\net al [37] reported a blended approach comprising initial\nface-to-face meetings, subsequent web-based therapy sessions,\nand independent work by the client between sessions. Generally,\nMHPs are more favorable toward blended approaches than\nunguided therapies [8,38-40]. This reflects their profession that\nemphasizes the importance of the healing therapeutic\nrelationship which frames discussions on digital tools.\nMental Health Apps\nFinally, the rapid proliferation of smartphones has brought\nhealth care to the clients’ pockets, and the use of mental health\napps is growing [41]. In contrast to the DMHIs that are often\ndeveloped and delivered in association with health care\norganizations and may also be clinician-prescribed and\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 2https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nreimbursed, mental health apps are often distributed directly to\nconsumers and may be used independently of health care contact\n[42]. In some countries, 50% of mental health service–using\nyouth [43] and 10% of outpatient psychiatry clinic patients have\nused mental health apps [44]. An example of a commercial\nmental health app is “Calm,” which offers a mindfulness\nmeditation intervention that can reduce stress [45] and increase\nwell-being [46]. An example of a Finnish publicly funded mental\nhealth app is “Chillaa,” which is targeted to youth aged 13 to\n15 years and aims to reduce stress and social anxiety [47].\nMental health apps may complement therapies [48], and some\nMHPs recommend them to their clients. In Portugal, 28% of\npsychologists had recommended apps to their clients [9],\nwhereas in examining mental services for the youth, Bell et al\n[43] found that 84% of clinicians had recommended apps to\ntheir clients. However, there have been considerable concerns\nregarding the quality and evidence base of the app content\n[49-53] as well as their privacy [54], which, together with the\nlack of guidance [55], diminish their credibility and slow their\nadoption in mental health care [56].\nIn summary, MHPs use various digital tools in their client\npractice. Moreover, the use of fully digital and blended DMHIs\nis growing—a trend that is occurring alongside the proliferation\nof mobile mental health apps. The growing adoption of digital\ntechnologies in society and health care and the specific changes\nin the digital mental health landscape frame MHP attitudes\nregarding digital tools.\nStudy Aims\nPrevious research has examined MHP adoption of digital\ntechnologies, their attitudes toward them, and the factors\ninfluencing their implementation. However, less attention has\nbeen paid to how MHPs use digital tools in client practice. We\nposit that a qualitative, user-centered approach can provide rich,\nin-depth insights into the MHP working context and their\nattitudes, needs, preferences, and behavior regarding digital\ntools [57-60]—factors vital to their design, development, and\nimplementation.\nWe followed the hypothesis-generating qualitative research\ntradition [61] and focused on how MHPs describe their client\npractice [62]. How we conceptualized qualitative analysis in\nthis study reflected a perspective aptly described by Fossey et\nal [63]:\nQualitative research aims to address questions\nconcerned with developing an understanding of the\nmeaning and experience dimensions of humans’lives\nand social worlds. Central to good qualitative\nresearch is whether the research participants’\nsubjective meanings, actions, and social contexts, as\nunderstood by them, are illuminated.\nInitially, the study was planned to better understand MHP views\nand needs regarding DMHIs with game elements. The aim was\nbroken down into 2 areas the MHPs were familiar with: how\nthey perceived and used digital tools and how they viewed\ndigital games in client practice. In the very first interviews, it\nwas discovered that these 2 areas were separate—digital tool\nuse was MHP initiated, whereas playing digital games addressed\nclient behavior. Thus, this study focused on the first area, which\nwas further broken down into two specific research questions\n(RQs): How do MHPs use different digital tools in client\npractice? (RQ 1) and What characterizes MHPs’digital tool use\nin client practice in general? (RQ 2).\nTo further the study aims, 19 semistructured interviews with\nFinnish MHPs were conducted, analyzed inductively, and\nreported under the 2 RQs.\nMethods\nThe study was conducted in 3 phases: recruitment, interview,\nand analysis. A survey was used to gather background\ninformation, whereafter MHPs were invited to a semistructured\ninterview, and the transcribed interview data were analyzed\ninductively.\nEthics Approval\nThe study was approved by the Aalto University research ethics\ncommittee (D/508/03.04/2022), and the research design was\npreregistered in the Open Science Framework [64].\nData and Sampling\nThe guiding principle in participant recruitment was maximum\nlocal variation—the recruitment aimed to gather a diverse\nsample of Finnish MHPs with various educational backgrounds,\nwho worked in different organizational contexts, and with\nvarious client populations in health care. Finnish health care is\nprimarily public and organized by municipalities [65] and tiered\ninto low-threshold basic-level services for those with less severe\ndisorders and specialized psychiatric services for clients with\nmore severe disorders. The Finnish Student Health Service\nprovides mental health care services for university students [66],\nand occupational health care provides health care services and\nbrief counseling for the workforce. Rehabilitative psychotherapy\ndelivered by licensed psychotherapists can be reimbursed for\nup to 3 years [67].\nThe study participants were recruited through social media,\nlocal professional association channels, and health care\norganizations. Snowballing was used to recruit professionals\nfrom the expert networks of the interviewees. The participant\nrecruitment advertisements highlighted that the interviewees\nwere not expected to have experience using digital tools and\ntherapies to welcome participants with various levels of\nexperience. The study inclusion criteria were (1) being a licensed\nhealth care professional, (2) working with mental health, and\n(3) having at least one customer weekly. Interviews were\nconducted with a Finnish interview frame; thus,\nnon–Finnish-speaking participants were not included. The\nrecruitment and interviews took place between May 11, 2022,\nand September 8, 2022.\nA recruitment link shared on the web led the possible participant\nto a web-based survey in Finnish created using Webropol\nsoftware (Webropol Limited) and included an informed consent\nform and privacy notice. According to the service use statistics,\n833 people opened the digital questionnaire, of whom 109\n(13.1%) began to answer it, with 80 (73.4%) of the 109 MHPs\ncompleting it. A total of 34 respondents indicated their\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 3https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nwillingness to participate in the interviews, of whom 24 (71%)\nwere contacted by the first author via email. In total, 9% (3/34)\nof the respondents did not respond to the inquiry, and 6% (2/34)\nwithdrew before the interview: one because of a lack of time\nand another because of their considerable prejudices against the\ntopic.\nThe concept of saturation [68] was used to evaluate the\nsufficiency of the sample. The first author evaluated saturation\nusing analytic memoing conducted after each interview [69]\nand during coding, which was carried out in parallel to the\ninterviews. After approximately 12 interviews, the first author\nfound that they contributed less and less new information. After\na collaborative reflection of the analytic memos and initial codes\nwith the second author, it was deemed that the data from 19\ninterviews were sufficient to answer the RQs. Therefore, not\nall 34 respondents willing to be interviewed were contacted.\nThe sample size of 19 is aligned with a recent systematic review\nthat found that 9 to 17 interviews reached saturation in\nhomogenous study populations such as ours [70], as well as\nprevious research on interview sample sizes [71]. The\ncharacteristics of the interviewees are described in Table 1 and\nindividually in Table 2.\nTable 1. Characteristics of the interviewees (n=19).\nValuesVariable and category\nGender, n (%)\n13 (68)Woman\n6 (32)Man\nAge range (years), n (%)\n1 (5)18-29\n3 (16)30-39\n6 (32)40-49\n7 (37)50-59\n2 (11)60-69\nWorking status, n (%)\n15 (79)Full time\n4 (21)Part time\n0 (0)Not working\n18 (13.7; 1-43)Years of mental health work experience, mean (SD; range)\n18 (5.9; 9-30)Hours of customer work per week, mean (SD; range)\nEducation (multiple options may be chosen), n (%)\n2 (11)Practical nurse\n7 (37)Nurse\n11 (58)Psychologist\n7 (37)Psychotherapist\n1 (5)Social worker\n6 (32)Other\nContext of client work, n (%)\n12 (63)Specialized health care\n1 (5)Student health care\n6 (32)Independent practice\nClients with..., n (%)\n1 (5)Mild mental disorders\n7 (37)Moderate mental disorders\n11 (58)Severe mental disorders\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 4https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nTable 2. Individual characteristics of the interviewees (n=19).\nDigital tools used and dis-\ncussed in the interview\nClientsRoleWorking contextClinical educationNumber\nTTa and MAbAdults with mood disordersPsychosocial treatmentSpecialized health\ncare\nOccupational therapist1\nTMc and TTAdults with mood disordersPsychotherapyIndependent practicePsychologist psy-\nchotherapist\n2\nTM, TT, WMd, and digital\npsychological tests\nAdults with neuropsycholog-\nical challenges\nPsychological evaluationSpecialized health\ncare\nPsychologist psy-\nchotherapist\n3\nTM, TT, WM, and digital\ncognitive rehabilitation\ntherapy\nAdults with psychosis or\nprodromal symptoms\nPsychosocial treatmentSpecialized health\ncare\nNurse4\nTM, TT, WM, and MAYouth with psychological\nsymptoms\nEvaluation and consultationSpecialized health\ncare\nNurse psychotherapist5\nTT, WM, and digitized\nquestionnaires\nStudents with sexuality-relat-\ned challenges\nPsychological treatmentStudent health carePsychologist psy-\nchotherapist\n6\nTM, TT, and WMAdults with mood disordersEvaluation and psychosocial\ntreatment\nSpecialized health\ncare\nNurse7\nTT and client-introduced\napps\nAdults with mood disordersPsychotherapyIndependent practicePsychologist psy-\nchotherapist\n8\nTM and TTAdults with neuropsycholog-\nical challenges\nEvaluation and psychosocial\ntreatment\nSpecialized health\ncare\nNurse9\nTM, TT, and WMOlder adults with psychiatric\nchallenges\nPsychological evaluation and\npsychosocial treatment\nSpecialized health\ncare\nPsychologist10\nTM, TT, WM, and digitized\nquestionnaires\nOlder adults with psychiatric\nchallenges\nCare coordination and psy-\nchosocial treatment\nSpecialized health\ncare\nNurse11\nTT and WMAdults with psychiatric dis-\norders\nCare coordination and psy-\nchosocial treatment\nPsychiatric inpatient\nward\nNurse12\nTM, TT, and WMAdults with psychotic disor-\nders\nEvaluation and psychosocial\nrehabilitation\nSpecialized health\ncare\nNurse13\nTM and WMAdults with lowered ability\nto work\nPsychosocial treatment and\npsychological evaluation\nSpecialized health\ncare\nPsychologist14\nTM, TT, WM, and acted as\na DMHIe therapist\nAdults with mood disordersPsychosocial treatmentSpecialized health\ncare\nPsychologist15\nTM and TTAdults with psychiatric dis-\norders\nPsychotherapyIndependent practicePsychologist psy-\nchotherapist\n16\nTT and client-introduced\napps\nAdults with psychiatric dis-\norders\nPsychotherapyIndependent practicePsychologist psy-\nchotherapist\n17\nTT, WM, and rehabilitation\nsoftware\nPeople with neuropsycholog-\nical problems\nNeuropsychological rehabili-\ntation\nIndependent practicePsychologist18\nTT and therapy centers’\ndigital materials\nPeople with psychological\ntrauma-related problems\nPsychotherapyPsychotherapy centerPsychologist psy-\nchotherapist\n19\naTT: teletherapy.\nbMA: mobile app.\ncTM: telephone or messaging.\ndWM: web-based materials.\neDMHI: digital mental health intervention.\nSemistructured Interview\nThe interview was semistructured [72], focusing on the MHPs’\nsubjective experiences with digital tools in their professional\ncontext in client interaction. Although keeping with the RQs,\nattention was paid to ensuring that the interviews retained their\nflexibility and accommodated the variance in the interview\ncontexts. Using the typology by McIntosh and Morse [73], the\ninterview was primarily descriptive and interpretive, focusing\non discovering the interviewees’ experiential world as opposed\nto testing a particular theory aligned with consequent inductive\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 5https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\ndata analysis. The interview guide is presented in Multimedia\nAppendix 1.\nThe first author conducted the interviews remotely using Zoom\n(Zoom Video Communications). He is a clinical psychologist\nand service designer experienced in conducting interviews and\nversed in clinical mental health care. The interviews were\nrecorded after verbally confirming the interviewee’s consent\n(according to national research guidelines) and transcribed\nverbatim for analysis. The interview durations ranged from 47\nto 83 minutes, with an average duration of 56 (SD 9) minutes.\nThe total interview data duration was 18 hours 9 minutes, which\nled to transcribed materials of 96,707 words.\nInductive Data Analysis\nThe data analysis was conducted in 2 parts reflecting the\nhierarchical nature of the RQs: the use of specific digital tools\n(RQ 1) is subordinate to digital tool use in general (RQ 2).\nThrough this approach, we pursued transparency to the often\nnebulous theme generation and to establish rigor in the research\n[74] by showing the relationship between specific digital tool\nuse and higher-order themes. In this study, we defined themes\nas patterns in the data and followed the definition by DeSantis\nand Ugarriza [75]: “A theme is an abstract entity that brings\nmeaning and identity to a recurrent experience and its variant\nmanifestations. As such, a theme captures and unifies the nature\nor basis of the experience into a meaningful whole.” Thus, the\ntheme exhibited both unity across participants and internal\nvariance.\nThe interview data were analyzed inductively to establish the\nthemes bottom-up instead of deductively testing a particular\ntheory. This aimed to ensure that the interviewees’ perspectives\ncame across in the analysis rather than those of the researchers.\nWe are aware that some components of this analysis\napproach—such as assessing saturation or following COREQ\n(Consolidated Criteria for Reporting Qualitative Research)\nguidelines (refer to later sections)—are not promoted in thematic\nanalysis. Otherwise, the data analysis closely followed the 6-step\nprocess by Braun and Clarke [76] described as thematic analysis.\nIn the first step, “Familiarizing yourself with the data,” the first\nauthor transcribed the data verbatim and then confirmed the\ntranscription accuracy by relistening to the interview tapes with\nthe written transcription, which further familiarized him with\nthe data. In the second step, “Generating the initial codes,” the\nfirst author coded all the data using ATLAS.ti software (version\n22; ATLAS.ti GmbH), allowing for the initial organization of\nthe data into categories. Then, the first author conducted the\nthird, fourth, fifth, and sixth steps of the analysis—“Searching\nfor themes,” “Reviewing themes,” “Defining and naming\nthemes,” and “Producing the report”—per the 2 RQs. Reflexivity\nwas ensured by the ongoing reflection of code and theme\ngeneration through the first author’s clinical background and\nposition and the full context of all the data.\nTo answer RQ 1, the first author started to search for meanings\nby categorizing all instances where interviewees discussed\nspecific digital tool use, adding up to 349 codes. For example,\nall the instances in which the interviewees reflected on the\ndifferent ways in which they used telephone, SMS text\nmessages, WhatsApp, Skype, and Zoom to stay in touch with\ntheir clients were categorized per medium. These categories\nwere further grouped into a higher-order category of\n“Communication.” In total, 2 other categories were established:\ntool use related to psychiatric evaluation and diagnostics and\ntool use to facilitate therapeutic change. Because of the\ndescriptive, pragmatic nature of RQ 1, we chose to report these\n3 categories as domain summaries—“summaries of the range\nof meaning in the data related to a particular topic or ‘domain’\nof discussion” [77]. The domains comprised the 3 functions the\ndigital tools served, which were identified from the data. The\n3 categories were reviewed to ensure that they included all the\ndigital tools discussed in the interview, and they were named\nand reported in the Results section.\nAfter analyzing digital tool use for RQ 1, the first author began\nthe development of themes for RQ 2. A total of 335 initial codes\nincluded interviewees’reflections on how they viewed and used\ndigital tools in their client practice in general, and these initial\ncodes were searched for themes. For instance, the recurring\nnotion that digital tools do not replace face-to-face connections\nwas reflected on, similarly to mentions of how digital tools may\nalleviate resource problems in psychiatry and how it is essential\nto consider the client’s needs. This search led to the\nestablishment of 3 themes. MHP flexibility in client interaction\nrecurred in almost all interviews, and it was also the most\nfrequent coding category. Thus, the first theme described the\nclient-centered clinical approach that unified the participants.\nThe second theme contrasted with the first by highlighting the\nvariance in the MHP digital toolbox. Finally, a third theme was\nestablished by examining how digital tools influenced MHP\nwork. The names of the themes were refined several times to\nensure that they captured the essence of the interviewees’\naccounts. Particular attention was paid to ensuring that the\nthemes had internal consistency and described the whole data\nset.\nFurther efforts were made to ensure that the data analysis was\nreliable. The first and second authors met 2 times to reflect on\nthe data analysis, review the themes, and name them. The first\nauthor translated the interviewees’ quotes from Finnish into\nEnglish, and another researcher (Maria Vesterinen) reviewed\nthe translations, which led to minor clarifications. The results\nwere annotated with interview and paragraph references (eg,\n#1:100) to facilitate transparency. Member checking [78] was\nused to ensure that the interpretations made in the study\nrepresented the notions of the MHPs. The draft version of the\nmanuscript was sent to 5 MHPs in October 2022 and November\n2022: a total of 2 (40%) MHPs who were interviewed, 2 (40%)\nMHPs who were employed at HUS, and 1 (20%) independent\nMHP. Their feedback supported the findings, and only minor\nclarifications were made based on it. Finally, the researchers\nconfirmed that describing and analyzing the study results\nconformed to the COREQ guidelines [79].\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 6https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nResults\nHow Do MHPs Use Different Digital Tools in Client\nPractice? (RQ 1)\nOverview\nWe found that MHPs used digital tools in client practice for\nthree functions: (1) diagnosis and evaluation and (2) counseling,\nboth of which necessitate (3) communication with the client\n(Table 3). This evaluation aimed to create an understanding of\nthe client’s challenges and disorders to guide treatment. It\ntypically consisted of interviews and questionnaires\ncomplemented with psychological testing when a more thorough\nunderstanding of the client’s problems and cognition was\nrequired. Counseling sought to alleviate the clients’ symptoms\nand helped them cope with their challenges. Depending on the\nMHP’s education and role, it may be psychosocial support in\na clinic or psychiatric ward, neuropsychological rehabilitation,\nshort-term therapy, or psychotherapy. In this paper, the term\ncounseling is used to refer to all modes of psychosocial support\nand treatment. Both evaluation and counseling require contact\nwith the client—communication.\nTable 3. The 3 distinct functions that characterize mental health professional digital tool use in client interaction. The functions can be served through\nanalog, digitized, or digital solutions, of which examples are provided.\nMedium\nDigitalDigitizedAnalogFunction\nTeletherapy with advanced features such as\nvirtual reality and avatars\nTelephone, emails, messaging, and\nteletherapy with audio and video con-\nnection\nFace-to-face interaction and\nwritten letters\nCommunication\nResponsive and gamified tests and integra-\ntion of various data sources\nSending questionnaires via email and\nfilling questionnaires on the web\nPen-and-paper questionnaires\nand psychological tests\nDiagnosis and evaluation\nInteractive DMHIsa, mobile apps, and seri-\nous games\nSharing materials via email or through\nweb-based information portals\nBrochures, printed materials,\nand handouts\nCreating therapeutic change\naDMHI: digital mental health intervention.\nWe argue that MHP functions reflect the nature of their\nprofession and its practices. Thus, the need for communication\nwith the client, creating an understanding of their challenges\nthrough evaluation, and supporting them is likely to remain\nconstant over time, whereas how MHPs achieve these functions\nmay evolve and change. The change is driven by technological\nadvancement, which we describe on a continuum from analog\nto digitized and digital media. By analog, we refer to nondigital\nmedia; by digitized media, we refer to an analog medium\nconverted into digital without substantial changes or additions.\nIn contrast, digital refers to media that use the possibilities native\nto digital. We acknowledge that the lines between the 3 are not\nalways fully clear and keep evolving; however, the more detailed\nontological discussion must be left elsewhere.\nThe 3 MHP functions may be implemented in analog, digitized,\nor digital media. Regarding communication, the telephone\ndigitizes verbal interaction, and emails and SMS text messages\ndigitize written communication. In contrast, digital teletherapy\nsolutions can change the nature of the interaction by, for\ninstance, augmenting the conversation with interactive materials\nand features or placing the meeting in a fictional virtual reality\nenvironment with avatars. Concerning evaluation, a\npen-and-paper questionnaire can be digitized into a web\nquestionnaire that calculates the results. A digital evaluation\nsolution could enrich these data with psychophysiological\nmeasurements, mobile data, and electronic health records, or\nits execution could be responsive or gamified. The\ntherapy-complementing materials, such as patient guides and\nCBT worksheets, can be shared via email or on the web.\nMeanwhile, their digital implementation could, for instance,\nmake use of adaptive elements or take the form of a serious\ngame to make them more engaging and effective. To\nrecapitulate, we assert that the underlying function of the tools\nremains unchanged even when they grow more interactive,\nnetworked, and complex.\nThe results per function are described as a domain summary.\nThey are as follows: (1) MHPs use complementary channels in\nclient communication, (2) the evaluation of clients is being\ndigitized, and (3) MHPs support therapeutic change using digital\nmaterials.\nMHPs Use Complementary Channels in Client\nCommunication\nFace-to-Face Interaction\nMHPs found many unique benefits with face-to-face interaction.\nUnmediated contact allowed for a superior connection with the\nclient as the MHP could observe and react to nuances in client\nexpressions and behavior that would otherwise be lost. This\nalso enabled the MHP to generate a more reliable and accurate\nunderstanding of their problems, which was also valuable for\npsychological evaluation. Coming to the meeting in person also\nactivated the client, which was found to be beneficial for clients\nwith a tendency toward isolation and passivity. Finally, the\nin-person social interaction can be therapeutic in itself. An MHP\nfacilitating group therapy for clients with social anxiety\ndescribed the following:\nThe significant exposure is that you come to the group\nin person, and that you spend time with other people.\n[#15:62]\nThe prevailing sentiment regarding the value of face-to-face\nmeetings was succinctly described by an MHP working in\npsychiatry:\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 7https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nOf course, it [teletherapy] will never replace it\n[face-to-meetings]. We see a lot more than a person’s\nface when they arrive [to the practice]; there is the\npresence, the whole person. [#7:115]\nTelephone and SMS Text Messaging\nMHPs used the telephone and SMS text messages to schedule\nmeetings and checkups on their clients, and the telephone was\nalso occasionally used for counseling. Only 2 MHPs reflected\non the therapeutic potential of asynchronous messaging. One\nof them provided low-threshold support to their clients via\nWhatsApp, finding that merely exchanging messages could\nhelp them through a challenging situation and alleviate anxiety.\nAn MHP with an occupational focus found that the\ntime-independent nature of messages enhanced in-person\ntherapy and allowed the therapy to “live in the mind” of their\nclient between sessions. However, most MHPs’ client\ninteractions occurred in scheduled meetings.\nTeletherapy\nThe COVID-19 pandemic led many MHPs to convert some\nin-person meetings to a remote format, a practice that prevailed\neven after the pandemic. “The remote therapy has come to stay”\n(#15:39), as summarized by an MHP. Few MHPs explicitly\npreferred face-to-face meetings and were reluctant to schedule\nremote ones. The MHPs found remote meetings flexible and\nthat they had the benefit of saving the client travel time. Remote\nmeetings also facilitated a larger number of participants, both\nclients and MHPs, also from different locations. The decision\nbetween face-to-face therapy and teletherapy was often\ninfluenced by the client’s preference rather than readiness factors\nsuch as having a computer with a video camera and competence\nto use them. The readiness factors were only emphasized with\nsome geriatric clients.\nInterestingly, holding the meetings remotely did not necessarily\nchange their content, indicating that they were digitized\ncommunication rather than natively digital. The videoconference\nmeetings were found to be mediated counseling where, for\ninstance, screen sharing had a similar function to a whiteboard\nin an in-person meeting. When the clients’ problems were not\nconsiderably debilitating, they could reflect on their behavior\nand be present in the relationship; remote counseling occurred\nvery similarly to face-to-face meetings. An MHP conducting\nlong-term psychotherapies reflected the following:\nI can report that the therapy meeting works pretty\nmuch the same way. When I think back on the\nsessions, I don’t perceive a difference whether the\nsession was conducted remotely or in person because\nthe very same things happen, and it works in the same\nway. [#17:38]\nTo summarize, we found that MHPs used media—face-to-face\nmeetings, phone calls, messaging, and\nteletherapy—complementarily to serve different needs in the\ntherapeutic relationship. The client preference and readiness\ninfluenced the medium chosen. However, it appeared that the\ndifferent tools typically digitized the established practices rather\nthan changing their content substantially.\nThe Evaluation of Clients Is Being Digitized\nOverview\nMHP responsibilities often included evaluation and counseling\n(Table 2). Psychiatric care routinely began with an evaluation\nperiod and continued with counseling. However, the balance\nbetween the 2 varied—some MHPs offered mainly counseling\nservices, and one concentrated solely on psychological\nevaluation. Others blended evaluation and counseling in their\nwork.\nPen-and-Paper Materials\nMHPs routinely used pen-and-paper symptom questionnaires\nsuch as the Beck Depression Inventory [80] and Clinical\nOutcomes in Routine Evaluation-Outcome Measure [81] to\nevaluate the clients’ symptoms and track treatment progress.\nWhen a more extensive evaluation was needed, particularly on\nthe client’s cognition, psychological tests were conducted, and\nin the sample, they were performed exclusively on pen and\npaper. Some organizations had “digitized” the questionnaires\nimpromptu because of the coronavirus pandemic—they were\nsent to the clients via SMS text message or email, a practice\nthat one MHP considered questionable.\nDigital Platforms\nA more sustainable solution for managing questionnaire data\ncame from digital platforms that facilitate the collection,\nmanagement, and storage of client data. Many organizations\nwere picking up new systems to facilitate their work; however,\nthe progress in their implementation varied alongside the MHP\nexperiences of them. Some found the platforms beneficial and\nuseful, whereas others were not equally impressed by their\nunwieldy implementation or were concerned that their older\nclients could not use them without support.\nThe study found that the digitalization of questionnaires and\nclient data is underway in many organizations. Compared with\nthe adoption of communication software, which was found to\nbe necessary for the work, the adoption of questionnaire\nsoftware appeared slower. In addition, the analog pen-and-paper\nmaterials that the MHPs were accustomed to using did not\npropose considerable drivers for change.\nMHPs Support Therapeutic Change With Digital\nMaterials\nOverview\nWe found that most MHPs used some type of material to\naugment the effectiveness of counseling. The materials were\nused to give the client information—psychoeducation—on their\ndisorder or condition, such as depression, anxiety, psychosis,\nsleeping, or pain. This aimed to develop the client’s confidence\nand capability to self-manage the symptoms. “We have to help\nthe client to help themselves” (#14:127), explained an MHP on\ntheir philosophy regarding the materials. The visual materials\nalso complemented the discussion-oriented therapeutic contact.\nThey gave the client “something else than just talk” (#11:154):\nconcrete materials and tools to use.\nMHPs found that their clients’ reactions to the materials varied\nconsiderably. An MHP summarized the following:\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 8https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nSome think they are completely rubbish, useless slips\nof paper. Others think they are lovely: they appreciate\nthat there is something concrete. [#11:153]\nAn explanation for this difference was the variance in the\nclients’interest in reading and their capability for self-reflection.\nTo facilitate the adoption of the materials, the MHPs often\npresented them in the session, encouraged the client to explore\nthem after the meeting at their own pace, and followed up on\nthem.\nAnalog Materials\nSome MHPs handed out paper brochures on disorders, and\nothers handpicked materials from the internet or their own\nresources. The rationale for printing out or photocopying the\nmaterials was to make them more tangible and understandable,\nhelp the clients who do not have competency in finding the\nmaterials on the web themselves, and encourage clients to read\nthe materials.\nDigitized Materials\nAlmost all MHPs recommended digitized materials to their\nclients at least occasionally. The most common resource was\nthe national MentalHub, which includes materials per disorder\nwith separate content for youth. Its modular structure was found\nto be convenient, and the interactive sections and questionnaires\nwere appreciated. In addition, third-sector services and materials,\nvideos, and handpicked materials were recommended.\nMobile Apps\nThe MHPs rarely used or recommended mobile apps to their\nclients. When apps were used, the MHPs were personally\nfamiliar with them or the app was published by a credible public\norganization and targeted to the MHP clientele, as was the case\nwith the youth-targeted Chillaa app.\nDMHI Materials\nMany MHPs had an indirect experience with DMHIs, most\ncommonly with the national DMHI prescribed to their clients.\nThey found that it could facilitate access to therapy for clients\nin sparsely populated areas, complemented the MHP know-how\nin specific domains, and was an option for new clients as they\nwaited for therapist contact for “2-3 months” (#13:125) or “4\nmonths” (#6:105).\nDespite the advantages, the MHPs were generally at least\nsomewhat hesitant and cautious regarding DMHIs. The\nnontransparent nature of the contents of the national DMHI\ndiscouraged it from being recommended. The MHPs perceived\nthat DMHIs were most suitable for clients with relatively mild\npsychiatric problems, such as subclinical anxiety, stress, or\nrelationship challenges. In contrast, many MHPs worked in\nspecial health care or with clients who had considerable clinical\nchallenges and sought help because they could not manage their\nbehavior without support. Thus, the clients needed and expected\nface-to-face reflection—“the ears and voice of the other person”\n(#6:119). The MHPs found that interpersonal contact—the\ntherapeutic alliance between the MHP and the client—was\nconstitutional, vital, healing, and remedial, and the lack of\nhuman interaction was the primary concern of almost all MHPs\nregarding DMHIs. If DMHIs were used, MHPs explicitly\npreferred supported over unsupported interventions. An MHP\nconducting long-term psychotherapy described the following:\nPersonal contact is of utmost importance. I believe\nthat everyone may not need it, but the majority do.\nSome may get, at least for some time, help and relief\nfrom their socialization with a machine but it cannot\nreplace a human. [#2:145]\nMHPs actively used materials in their client interactions. Across\nthe media, the function of the materials was to help the client\ngain insights into their symptoms and ways to manage them.\nTherefore, we propose that the therapy-supporting materials\ncould be viewed in a continuum from analog brochures to\ndigitized self-help materials to (therapist-supported) structured\nDMHIs.\nWhat Characterizes the MHPs’ Digital Tool Use in\nClient Practice in General? (RQ 2)\nOverview\nAfter analyzing how MHPs used particular digital tools, we\nexamined their digital tool use in general in the context of their\nclient work. The analysis of the interview data established three\nthemes: (1) digital tool use is negotiated in client interaction,\n(2) autonomy and contexts diversify MHPs’ digital toolbox,\nand (3) existing practices invite incremental developments\n(Figure 1).\nThe three themes correspond with the nature of MHPs’ work,\nwhich we characterize as (1) client-centered, (2) independent,\nand (3) a service. MHPs exhibited client-centricity by being\nclosely mindful of their clients and adjusting their digital tool\nuse according to the perceived needs of their clients. This\nnegotiation was shaped by the possibilities in the MHP toolbox.\nAs MHPs had independence and autonomy in compiling their\ntoolboxes, there was considerable heterogeneity in their contents\nand breadth. Third, the MHP work was a service—it focused\non intangible interaction, was difficult to standardize, was\nproduced and consumed simultaneously, and could not be stored\n[82]. The MHPs perceived that the digital tools augmented the\ninterpersonal service they offered and, therefore, offered\nincremental rather than radical developments to the existing\npractices.\nWe describe how the MHP work was influenced by 3 layers of\ncontext. The clinical context included practices and expectations\nfor flexible interpersonal MHP-client interaction. The\norganizational context may provide the MHP with tools such\nas digital platforms and processes for using them. The broader\ntechnological and cultural developments influenced the digital\ntools available in society and the MHP and client willingness\nand competency in using them.\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 9https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nFigure 1. In total, 3 themes describe how mental health professionals (MHPs) used digital tools in client practice.\nDigital Tool Use Is Negotiated in Client Interaction\nAlmost all MHPs highlighted how they adjusted their behavior\nto their clients’ individual situations, needs, and symptoms in\nboth evaluation and counseling. They adjusted, for instance,\nthe focus of the evaluation; its duration; the frequency of\ncounseling; and the therapeutic techniques, exercises,\nquestionnaires, and digital tools used. MHPs may, for instance,\noffer their clients the possibility of choosing between\nface-to-face and remote meetings and whether a particular\ntherapy was conducted in pen and paper or digitally assisted.\nRather than following a rigid care routine, the MHPs found it\nvital to tailor the interaction to the client in the moment.\nMHPs found negotiation and flexibility necessary because of\nthe considerable variance in their clientele. Although they may\nwork with a particular group of people, there was still substantial\nvariation in the life context, symptoms, and needs of their\nclients; moreover, the clients’ situations may fluctuate. Thus,\nthe key question in counseling was “finding the right tool at the\nright time” (#17:95). This position also reflected the nature of\npsychological problems—the MHP cannot directly influence\nthe behavior of the client, who is ultimately responsible for the\nchange. Flexibility also meant fostering client autonomy. An\nMHP described the following:\nI have the overall approach that I offer the client\ndifferent means, tools, and then they decide. [#1:83]\nSupporting client autonomy was also exhibited in how using a\ndigital tool can be client-initiated and how MHPs considered\nclient readiness and preferences in their tool recommendations.\nOverall, digital tools were perceived to serve higher-order\ntherapeutic aims; they were “a means to an end” (#5:202).\nOur research showed how MHPs prioritized establishing a\nworking therapeutic relationship with their clients by adapting\ntheir behavior and the tools used. This reflected a client-centered\nprofession, position, and practice.\nAutonomy and Contexts Diversify the MHP Digital\nToolbox\nThe MHP can only suggest exercises, materials, and tools that\nthey know of, can access, and perceive as beneficial. The digital\npossibilities at the MHP disposal are referred to in this paper\nas the MHP digital toolbox, in which we found considerable\nvariance. On one end, the digital toolbox was considerably\nlimited—the MHPs used digitized and digital tools only to\ncommunicate with the client. “The only time when electricity\nflows through the wires is when we use the telephone”\n(#14:195), expressed an MHP of their nondigital care pathways.\nOn the other end, MHPs used a breadth of communication\nchannels, digitized and digital materials, and even apps and\nwere aware of the national DMHI.\nMHPs have the autonomy to compile their toolboxes. “When I\nam travelling, I may pick up something that I find works well\nfor rehabilitation purposes: it can be a booklet, a game, or\nwhatever” (#18:201), reflects an MHP. Thus, the MHPs’attitude\ntoward, interest in, and experience with digital solutions\ninfluenced the breadth of their digital toolbox. Those with more\nexperience with digital tools showed higher competence and\nmore positive attitudes toward them. Some MHPs proactively\nreflected on how they were generally curious about new digital\ntools, sought training on them, explored them on their own, and\neven participated in their development. Others exhibited a far\nmore restricted and cautious stance on digital tools and\nself-perceived their digital skills as low and avoided their use.\nAlthough MHPs have the autonomy to shape their digital\ntoolbox, their freedom is limited and influenced by the\npossibilities in their organizational and societal context. Larger\norganizations often provided the MHPs with communication\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 10https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nand questionnaire platforms and restricted them to the chosen\nplatform, whereas MHPs working in their own practice had\nmore liberty to choose these tools. The availability of credibly\nperceived digital tools, such as MentalHub psychoeducational\nmaterials, national DMHIs, third-sector resources, and some\napps, encouraged their uptake. The external societal context\nalso influenced the MHPs through their clientele—some clients\nrequested remote meetings and introduced apps in counseling.\nMany MHPs found that their clients had the competency and\nmeans to use telehealth channels and they could search for and\naccess digital content with little guidance, which was related to\nthe digital tools being broadly used in Finnish society.\nDigital tool use was influenced by the breadth of the MHP\ndigital toolbox that the MHP can compile independently. Its\ncontents were limited by the possibilities in the MHP\norganizational and societal context, and MHP attitudes,\npreferences, and experiences influenced tool uptake.\nExisting Practices Invite Incremental Developments\nAside from the national DMHI, we found that the presently\nused and emerging tools brought incremental developments to\nthe client practice. The teletherapy solutions reduced travel\ntimes but did not change the nature of counseling itself, the\ndigitization of the pen-and-paper questionnaires allowed the\nsame instruments to be filled on the web, and digitized\npsychoeducational materials served the same purpose as analog\nhandouts. In other words, the digitized tools allowed the MHP\nto perform the tasks they already performed in an analog manner\nbut more effectively. These developments retained the nature\nof MHP work as a service; did not offer the scalability benefits\nexpected from digital interventions; and, therefore, did not\ndirectly address the insufficient resources in mental health care,\nwhich many MHPs were conscious of.\nThe MHPs’principal hesitancy regarding digital treatments was\ntheir perceived insufficiency for their clients. Most MHPs\nhighlighted how their clients had severe challenges and needed\ntherapist interaction and that unsupported digital treatments\nwere best suited for those with mild challenges. In addition,\ntheir clients sought counseling and expected interpersonal\ncontact rather than a digital solution. Some MHPs were aware\nof how their position in the mental health ecosystem may have\naffected their thinking and attitudes. “This may be associated\nwith my position in the treatment and service chain. It brings\nthe view that [DMHI] was not enough and that what is needed\nis something longer and more intensive” (#8:144), an MHP\npondered. In general, MHPs viewed that their professional\nservice could not be replaced by a digital tool as its core lay\nspecifically in human interaction.\nDespite limitations, many MHPs could imagine the benefits\nthat digital tools can offer in the future. They could extend the\nreach and access to therapy services in remote areas and offer\nspecialized therapy services. They could lower the threshold to\nseek help and be helpful to clients who withdraw from others,\nare anxious and uncommunicative in MHP interaction, or have\ndifficulties reflecting on their emotions verbally. Digital content\ncould be more attractive; engaging; experience-rich; interactive;\nflexible; and, therefore, more effective than analog materials.\nThrough their presence in the client’s everyday life, digital\ninterventions may provide flexible support whenever and\nwherever the client wants and needs it; they could activate the\nclient through notifications and adaptive exercises and give\nthem encouraging, timely feedback. Overall, the digital\npossibilities could expand the treatment portfolio:\nWe need a large toolbox if we want to help everyone\nbecause people are so different. Also, they have\ndifferent needs, different skills, and different\ncapabilities to participate in something. So, we need\na toolbox with a wrench, a screwdriver, all sorts of\nthings. [#16:221]\nIn summary, the digital tools implemented in existing client\ninteraction–emphasizing practices were likely to contribute to\nincremental developments in MHP work. Although many MHPs\nwere interested in new digital tools, their perspective was limited\nby their clientele, client expectations, and the nature of their\nwork as a service.\nDiscussion\nPrincipal Findings\nIt has been suggested that digital tools may aid in closing the\nmental health treatment gap. Unfortunately, even if effective,\nmany new interventions fail in their implementation in complex\nreal-life environments [83]. To facilitate this change, it is\nnecessary to understand how MHPs use digital tools in clinical\npractice. Our study showed that digitized and digital tools were\nbecoming a part of the clinical practice—MHPs used various\nchannels in client interaction, the evaluation and diagnosis of\nclients were being digitized, and web-based materials were\nfrequently used to complement counseling. The MHPs used the\ntools flexibly, adapting to their clients; there was variance in\nthe breadth of MHP digital toolboxes; and the tools offered\nprimarily incremental developments in MHP practice. These\nfindings have vital implications for developing and\nimplementing digital tools in mental health care.\nContributions to Existing Research\nOur research exhibited how MHPs use multiple channels to\ncommunicate with their clients. Most interviewed MHPs\nengaged their clients face-to-face and through telecounseling,\na change that the COVID-19 pandemic has expedited [20-22].\nPrevious research has found that teletherapy offers convenience\nand flexibility [20], which we also identified as a motivator.\nWe enrich previous findings by highlighting how the platforms\nfor communication may be flexibly chosen per client and that\nthere was considerable variance in MHP practices. Regarding\nmessaging, for instance, only 2 MHPs explained how they used\nasynchronous messaging to support their clients. This finding\ninvites consideration of how MHP services could be\nsystematically augmented with, for instance, messaging [84] to\nimprove treatment adherence and monitoring and offer support.\nPrevious research has found that MHPs perceive DMHIs as\ncomplementary to face-to-face therapies, prefer blended over\nstand-alone digital interventions, and consider unguided\ninterventions insufficient for clients with substantial challenges\n[8]. We had similar findings and suggest that they may be\nexplained by MHPs viewing the core of their work as lying in\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 11https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nclient interaction, where technologies hold a secondary,\nsupportive role. This position reflects the history and nature of\nthe profession and is supported by studies that have found the\ntherapeutic alliance to be an essential common factor for\ntherapeutic outcomes [12,85,86]. This also suggests that the\ndigital transformation in mental health care may be driven by\nclient and systemic needs rather than by MHP-driven motivators.\nThe former includes the growing demand for mental health care,\nimproving access to treatment in underserved areas, and offering\nan alternative to interpersonal treatments.\nMHP attitudes toward digital tools may be explained by their\nexperiences with them. Indeed, the 2 go hand in hand—attitudes\nare related to tool use [87,88], and use is related to more positive\nattitudes toward digital tools [9]. The direction of causality,\nhowever, remains unclear: do MHPs who consider the tools\nmore positively use them more often, or do those who begin to\nuse them grow more positive in their attitudes? Regardless, our\nresearch complements the findings by describing how positive\nattitudes and experiences might manifest in a broader digital\ntoolbox whose contents can be used flexibly in client interaction.\nAs the digital transformation progresses, this may lead to a\ngrowing divide between MHPs with extensive digital tools at\ntheir disposal and those who double down on the face-to-face\napproach.\nThe relationship between MHP attitudes and digital tool use\nmay be conceptualized using the theory of planned behavior\n[89]. It posits that positive intentions are associated with the\nlikelihood of the associated behavior occurring. Positive\nintentions, in turn, are influenced by the favorability of attitudes,\npositive social norms, and perceived ease or difficulty in\nperforming the behavior. The theory has found empirical support\nin studies of MHP attitudes [87,90,91]—professionals are more\nlikely to use digital tools when they view them favorably, their\npeers use them, and they find the tools easy to use, and these 3\nfactors can offer conceptual avenues for facilitating tool\nimplementation.\nImplications for Digital Tool Development\nThe dominant mental health service delivery model reflects its\npsychotherapeutic roots—highly trained professionals offer\nservices in one-on-one in-person settings [92]. However, as the\nneed for mental health services grows, there is ever more\nawareness of the limitations of the delivery model—it lacks\nscalability as it is closely tied to a scarce human resource, MHP\ntime. However, uncoupling time from the service delivery\nchallenges the very fundament the services are based on, the\ninterpersonal therapeutic alliance [11]. Our research suggests\nthat MHPs may view telehealth solutions and digitized\nquestionnaire suites more favorably than digital interventions\nas the former complements personal interaction, whereas the\nlatter challenges it. We surmise that these attitudes may extend\nto other technological developments such as artificial\nintelligence, chatbots, social media, and virtual reality [7,93],\nwhich may be viewed as disrupting the beneficial qualities of\nthe therapeutic relationship unnecessarily.\nWe suggest consciously distinguishing 3 modes of treatment\n(Figure 2) to alleviate the tension between them. Psychosocial\ninterventions such as counseling are founded on interpersonal\ninteraction and the therapeutic relationship [11,85,86];\nbiomedical treatments such as psychiatric medication and\nelectroconvulsive therapy affect the nervous system; and\nindependently used interventions such as psychoeducational\ncourses [23] and digital interventions [94] are based on clients\nacquiring new skills, building motivation, and creating\nopportunities to change [95]. Psychosocial interventions are\nflexible, interpersonal, and adaptive to the client, but on a\nsocietal scale, their benefits are tied to the available MHP\nresources. Psychiatric medications are scalable but may have\nside effects. Independently used interventions can offer best\npractice psychoeducation and guidance at a scale whenever and\nwherever, yet they lack the empathetic and motivating\ninterpersonal connection.\nDifferentiating between the different modes of treatment can\nhelp clients and clinicians perceive their complementary\npotential. Associating an independently used intervention with\na web-based program or course instead of therapy may help\nestablish realistic expectations and facilitate reaching clients\nwho expect and benefit from such an approach. Interestingly,\nwe found that many MHPs already encouraged their clients to\naccess analog or digitized materials between sessions. Thus,\nsome MHPs appear to have adopted a blended approach [36]\nwhere the treatment uses both psychosocial and publicly\navailable, independently used components. However, the\nself-adopted practices lacked consistency, which invites the\nconsideration of systemic ways to improve service processes.\nFocusing on psychosocial interventions, our model (Table 3)\nallo ws for the dif ferentiation of which\nfunction—communication, evaluation and diagnosis, and\nfacilitating therapeutic change—the digital tool relates to. This\nallows developers and health care management to advance a\nuser-centered position and connect the solution with existing\npractices and MHP and client needs. However, further research\nis needed to understand how to harmonize the 3 modes of\ntreatment in clinical practice so that they complement each other\nthroughout the client journey.\nTraining and education are commonly recommended to improve\nMHP digital tool adoption and use [10,39,96-99]. This\nindividual-focused approach is synergistic with the autonomy\nand independence that MHPs enjoy in their work, which may\nalso diminish the impact of group- or organizational-level\nchange efforts [100]. We maintain that training may be sufficient\nto implement digitized tools that suggest incremental changes\nin clinical practices. In contrast, the digital tools that present\nradical changes to the modus operandi must be accompanied\nby substantial structural changes. Several frameworks may be\nhelpful in this regard [101]. They include the Consolidated\nFramework for Implementation Research [8,83]; Promoting\nAction on Research Implementation in Health Services\n[102,103]; and the Nonadoption, Abandonment, Scale-up,\nSpread, and Sustainability framework [104,105]. All these\nframeworks highlight how creating a usable digital tool is not\nenough—it needs to be considered in terms of the adopters,\nclinical practices, organizational care processes, and societal\ncontext. Our work complements these models by illuminating\nthe MHP-client implementation context (Figure 1).\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 12https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nFigure 2. Differentiating between 3 modes of treatment. Psychosocial interventions are based on interpersonal interaction, biomedical interventions\naffect the nervous system, and independently used interventions encourage change through learning.\nLimitations\nThis research was conducted in Finland, and the results showed\nthat the external context influences MHP behavior and attitudes.\nFinland is highly developed digitally [106]. Of the adult\npopulation, 93% use the internet [107], and web-based\ninteraction with governmental services is very common [106].\nIn health care, e-services, including e-prescriptions, are\ncommonly used, and public and many private services have\nintegrated their patient data into a shared repository called Kanta\n[108]. The status of DMHIs for depression has been legitimized\nby their acceptance into the national clinical practice guidelines\n[109]. Aligned with the theory of planned behavior [89], the\nsocietal digital development and broad use of digital devices in\nhealth care are likely to influence MHP and client attitudes\npositively and contribute to their adoption.\nThe study recruitment efforts sought to attract participants from\nvarious backgrounds as well as those who held a more critical\nstance on digital tools. However, the sample included only a\nfew critical voices and several MHPs with substantial knowledge\nof digital tools and therapies. The research theme likely attracted\nthose with a more positive stance on the topic and may not\nrepresent the entire MHP population. The interviewees included\npsychologists, psychotherapists, nurses, and an occupational\ntherapist who worked in various contexts, with clients of\ndifferent ages, and with clients who had various disorders. One\nMHP was experienced in conducting a national DMHI. The\nsample did not include physicians or MHPs from private\noccupational health care or basic-level health care for\nnonstudents, providing avenues for future research efforts. In\naddition, the study does not necessarily reflect the positions of\nthe health care leadership who may not directly work with\nclients and are responsible for managing and developing the\nservice and information systems used within them. Further\nresearch may be needed to understand the leadership position\nand strategy and consider the change in management efforts\nrequired to implement the solutions in organizational settings\n[109].\nConclusions\nNew digital tools are being actively developed in mental health\ncare, and scalable solutions are expected to alleviate the global\nmental health problem. This study illuminated the context of\nMHPs, who play a crucial role in adopting and implementing\nnew technologies in client interaction. Our research showed\nthat MHP work involves 3 key functions: communicating with\nthe client, diagnosing and evaluating them, and facilitating\ntherapeutic change. Teletherapy was widely accepted and\nadopted alongside other media, and the evaluation of clients\nwas becoming more digitized. Digitized psychoeducational\nmaterials were widely used, but MHPs hesitated to recommend\nstand-alone digital therapies that were perceived as insufficient\nfor their clients.\nWe characterized the MHP work as a client-centered\nindependent service. The MHPs adjusted the techniques,\ninteractions, and tools used per client. The MHPs had the\nindependence and autonomy to choose the tools used from a\nrange of possibilities. This created heterogeneity in the digital\ntoolboxes, which were influenced by MHP preference,\norganizational context, and tools available in the external\nenvironment. The digital tools introduced to this service context\noften proposed incremental rather than radical developments,\nconsiderably limiting their impact. More research is needed to\nexamine when and how scalable, independently used\ninterventions can best complement psychosocial interventions\nand for whom they may work independently.\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 13https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nAcknowledgments\nLL and JMP are funded by the Jane and Aatos Erkko Foundation and Technology Industries of Finland Centennial, The Future\nMakers Program, and Business Finland Research2Business (42173/31/2020). VMK is funded by the Academy of Finland (grant\n353267) and the European Research Council under the European Union Horizon Europe research and innovation program (grant\n101042052). The authors would like to thank all the mental health professionals who participated in the research, Saara Tikka\nand Sini Oksanen for their help in the transcriptions of the first 5 interviews, and Maria Vesterinen for her valuable input with\nthe translation of the quotes.\nAuthors' Contributions\nLL designed the study, conducted the interviews, transcribed them, conducted the interview data analysis, wrote the initial version\nof the manuscript, and revised it. VMK contributed to the analysis of the data and revised the manuscript. JMP contributed to the\napproach and structure of the paper and revised the manuscript.\nConflicts of Interest\nNone declared.\nMultimedia Appendix 1\nThe interview guide.\n[DOCX File , 28 KB-Multimedia Appendix 1]\nReferences\n1. GBD 2019 Mental Disorders Collaborators. Global, regional, and national burden of 12 mental disorders in 204 countries\nand territories, 1990-2019: a systematic analysis for the global burden of disease study 2019. Lancet Psychiatry 2022\nMar;9(2):137-150 [FREE Full text] [doi: 10.1016/S2215-0366(21)00395-3] [Medline: 35026139]\n2. Kohn R, Saxena S, Levav I, Saraceno B. The treatment gap in mental health care. Bull World Health Organ 2004\nNov;82(11):858-866 [FREE Full text] [Medline: 15640922]\n3. Bucci S, Schwannauer M, Berry N. The digital revolution and its impact on mental health care. Psychol Psychother 2019\nJun;92(2):277-297 [doi: 10.1111/papt.12222] [Medline: 30924316]\n4. Hollis C, Morriss R, Martin J, Amani S, Cotton R, Denis M, et al. Technological innovations in mental healthcare: harnessing\nthe digital revolution. Br J Psychiatry 2015 Apr;206(4):263-265 [FREE Full text] [doi: 10.1192/bjp.bp.113.142612] [Medline:\n25833865]\n5. Murray E, Hekler EB, Andersson G, Collins LM, Doherty A, Hollis C, et al. Evaluating digital health interventions: key\nquestions and approaches. Am J Prev Med 2016 Nov;51(5):843-851 [FREE Full text] [doi: 10.1016/j.amepre.2016.06.008]\n[Medline: 27745684]\n6. Rebello TJ, Marques A, Gureje O, Pike KM. Innovative strategies for closing the mental health treatment gap globally.\nCurr Opin Psychiatry 2014 Jul;27(4):308-314 [doi: 10.1097/YCO.0000000000000068] [Medline: 24840160]\n7. Torous J, Bucci S, Bell IH, Kessing LV, Faurholt-Jepsen M, Whelan P, et al. The growing field of digital psychiatry: current\nevidence and the future of apps, social media, chatbots, and virtual reality. World Psychiatry 2021 Oct;20(3):318-335\n[FREE Full text] [doi: 10.1002/wps.20883] [Medline: 34505369]\n8. Davies F, Shepherd HL, Beatty L, Clark B, Butow P, Shaw J. Implementing web-based therapy in routine mental health\ncare: systematic review of health professionals' perspectives. J Med Internet Res 2020 Jul 23;22(7):e17362 [FREE Full\ntext] [doi: 10.2196/17362] [Medline: 32706713]\n9. Mendes-Santos C, Weiderpass E, Santana R, Andersson G. Portuguese psychologists' attitudes toward internet interventions:\nexploratory cross-sectional study. JMIR Ment Health 2020 Apr 06;7(4):e16817 [FREE Full text] [doi: 10.2196/16817]\n[Medline: 32250273]\n10. Titov N, Hadjistavropoulos HD, Nielssen O, Mohr DC, Andersson G, Dear BF. From research to practice: ten lessons in\ndelivering digital mental health services. J Clin Med 2019 Aug 17;8(8):1239 [FREE Full text] [doi: 10.3390/jcm8081239]\n[Medline: 31426460]\n11. Bordin ES. The generalizability of the psychoanalytic concept of the working alliance. Psychother: Theory Res Pract\n1979;16(3):252-260 [FREE Full text] [doi: 10.1037/h0085885]\n12. Horvath AO, Del Re AC, Flückiger C, Symonds D. Alliance in individual psychotherapy. Psychotherapy (Chic) 2011\nMar;48(1):9-16 [doi: 10.1037/a0022186] [Medline: 21401269]\n13. Martin DJ, Garske JP, Davis MK. Relation of the therapeutic alliance with outcome and other variables: a meta-analytic\nreview. J Consult Clin Psychol 2000 Jun;68(3):438-450 [Medline: 10883561]\n14. D'Alfonso S, Lederman R, Bucci S, Berry K. The digital therapeutic alliance and human-computer interaction. JMIR Ment\nHealth 2020 Dec 29;7(12):e21895 [FREE Full text] [doi: 10.2196/21895] [Medline: 33372897]\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 14https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\n15. Pihlaja S, Stenberg JH, Joutsenniemi K, Mehik H, Ritola V, Joffe G. Therapeutic alliance in guided internet therapy programs\nfor depression and anxiety disorders - a systematic review. Internet Interv 2017 Nov 17;11:1-10 [FREE Full text] [doi:\n10.1016/j.invent.2017.11.005] [Medline: 30135754]\n16. Wisniewski H, Torous J. Digital navigators to implement smartphone and digital tools in care. Acta Psychiatr Scand 2020\nApr;141(4):350-355 [FREE Full text] [doi: 10.1111/acps.13149] [Medline: 31930477]\n17. Glueckauf RL, Maheu MM, Drude KP, Wells BA, Wang Y, Gustafson DJ, et al. Survey of psychologists’ telebehavioral\nhealth practices: technology use, ethical issues, and training needs. Prof Psychol Res Pr 2018 Jun;49(3):205-219 [FREE\nFull text] [doi: 10.1037/pro0000188]\n18. Lovejoy TI, Demireva PD, Grayson JL, McNamara JR. Advancing the practice of online psychotherapy: an application of\nRogers' diffusion of innovations theory. Psychotherapy (Chic) 2009 Mar;46(1):112-124 [doi: 10.1037/a0015153] [Medline:\n22122574]\n19. Perle JG, Langsam LC, Nierenberg B. Controversy clarified: an updated review of clinical psychology and tele-health. Clin\nPsychol Rev 2011 Dec;31(8):1247-1258 [doi: 10.1016/j.cpr.2011.08.003] [Medline: 21963670]\n20. Feijt M, de Kort Y, Bongers I, Bierbooms J, Westerink J, IJsselsteijn W. Mental health care goes online: practitioners'\nexperiences of providing mental health care during the COVID-19 pandemic. Cyberpsychol Behav Soc Netw 2020\nDec;23(12):860-864 [doi: 10.1089/cyber.2020.0370] [Medline: 32815742]\n21. Molfenter T, Heitkamp T, Murphy AA, Tapscott S, Behlman S, Cody OJ. Use of telehealth in mental health (MH) services\nduring and after COVID-19. Community Ment Health J 2021 Oct;57(7):1244-1251 [FREE Full text] [doi:\n10.1007/s10597-021-00861-2] [Medline: 34165695]\n22. Taylor CB, Fitzsimmons-Craft EE, Graham AK. Digital technology can revolutionize mental health services delivery: the\nCOVID-19 crisis as a catalyst for change. Int J Eat Disord 2020 Jul;53(7):1155-1157 [FREE Full text] [doi:\n10.1002/eat.23300] [Medline: 32449523]\n23. Cuijpers P, Muñoz RF, Clarke GN, Lewinsohn PM. Psychoeducational treatment and prevention of depression: the \"coping\nwith depression\" course thirty years later. Clin Psychol Rev 2009 Jul;29(5):449-458 [doi: 10.1016/j.cpr.2009.04.005]\n[Medline: 19450912]\n24. Evans DJ. South African psychologists’ use of the internet in their practices. S Afr J Psychol 2014 Jun;44(2):162-169\n[FREE Full text] [doi: 10.1177/0081246314527874]\n25. Jeong D, Cheng M, St-Jean M, Jalali A. Evaluation of eMentalHealth.ca, a Canadian mental health website portal: mixed\nmethods assessment. JMIR Ment Health 2019 Sep 06;6(9):e13639 [FREE Full text] [doi: 10.2196/13639] [Medline:\n31493328]\n26. Mielenterveystalo.fi - aina tukena. Mielenterveystalo.fi. URL: https://www.mielenterveystalo.fi/ [accessed 2023-06-05]\n27. Wright JH, Owen JJ, Richards D, Eells TD, Richardson T, Brown GK, et al. Computer-assisted cognitive-behavior therapy\nfor depression: a systematic review and meta-analysis. J Clin Psychiatry 2019 Mar 19;80(2):18r12188 [FREE Full text]\n[doi: 10.4088/JCP.18r12188] [Medline: 30900849]\n28. Andersson G. Internet-delivered psychological treatments. Annu Rev Clin Psychol 2016;12:157-179 [doi:\n10.1146/annurev-clinpsy-021815-093006] [Medline: 26652054]\n29. Borghouts J, Eikey E, Mark G, De Leon C, Schueller SM, Schneider M, et al. Barriers to and facilitators of user engagement\nwith digital mental health interventions: systematic review. J Med Internet Res 2021 Mar 24;23(3):e24387 [FREE Full\ntext] [doi: 10.2196/24387] [Medline: 33759801]\n30. Hedman-Lagerlöf E, Carlbring P, Svärdman F, Riper H, Cuijpers P, Andersson G. Therapist-supported Internet-based\ncognitive behaviour therapy yields similar effects as face-to-face therapy for psychiatric and somatic disorders: an updated\nsystematic review and meta-analysis. World Psychiatry 2023 Jun;22(2):305-314 [FREE Full text] [doi: 10.1002/wps.21088]\n[Medline: 37159350]\n31. Andersson G, Titov N. Advantages and limitations of internet-based interventions for common mental disorders. World\nPsychiatry 2014 Feb;13(1):4-11 [FREE Full text] [doi: 10.1002/wps.20083] [Medline: 24497236]\n32. Moshe I, Terhorst Y, Philippi P, Domhardt M, Cuijpers P, Cristea I, et al. Digital interventions for the treatment of depression:\na meta-analytic review. Psychol Bull 2021 Aug;147(8):749-786 [doi: 10.1037/bul0000334] [Medline: 34898233]\n33. Kaiser J, Hanschmidt F, Kersting A. The association between therapeutic alliance and outcome in internet-based psychological\ninterventions: a meta-analysis. Comput Human Behav 2021 Jan;114:106512 [FREE Full text] [doi:\n10.1016/j.chb.2020.106512]\n34. Ritola V, Lipsanen JO, Pihlaja S, Gummerus EM, Stenberg JH, Saarni S, et al. Internet-delivered cognitive behavioral\ntherapy for generalized anxiety disorder in nationwide routine care: effectiveness study. J Med Internet Res 2022 Mar\n24;24(3):e29384 [FREE Full text] [doi: 10.2196/29384] [Medline: 35323119]\n35. Nettiterapiat.fi. Mielenterveystalo.fi. URL: https://www.mielenterveystalo.fi/fi/nettiterapiat [accessed 2023-06-05]\n36. Wentzel J, van der Vaart R, Bohlmeijer ET, van Gemert-Pijnen JE. Mixing online and face-to-face therapy: how to benefit\nfrom blended care in mental health care. JMIR Ment Health 2016 Mar 09;3(1):e9 [FREE Full text] [doi: 10.2196/mental.4534]\n[Medline: 26860537]\n37. Stawarz K, Preist C, Tallon D, Thomas L, Turner K, Wiles N, et al. Integrating the digital and the traditional to deliver\ntherapy for depression: lessons from a pragmatic study. In: Proceedings of the 2020 CHI Conference on Human Factors in\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 15https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\nComputing Systems. 2020 Apr 23 Presented at: CHI '20; April 25-30, 2020; Honolulu, HI, USA p. 1-14 URL: https://dl.\nacm.org/doi/10.1145/3313831.3376510 [doi: 10.1145/3313831.3376510]\n38. Pine R. Teachers’and health professionals’attitudes towards adolescent mental health and digital mental health interventions.\nAdv Ment Health 2020 Sep 06;19(3):295-305 [FREE Full text] [doi: 10.1080/18387357.2020.1814160]\n39. Schuster R, Pokorny R, Berger T, Topooco N, Laireiter AR. The advantages and disadvantages of online and blended\ntherapy: survey study amongst licensed psychotherapists in Austria. J Med Internet Res 2018 Dec 18;20(12):e11007 [FREE\nFull text] [doi: 10.2196/11007] [Medline: 30563817]\n40. Vigerland S, Ljótsson B, Bergdahl Gustafsson F, Hagert S, Thulin U, Andersson G, et al. Attitudes towards the use of\ncomputerized cognitive behavior therapy (cCBT) with children and adolescents: a survey among Swedish mental health\nprofessionals. Internet Interv 2014 Jul;1(3):111-117 [FREE Full text] [doi: 10.1016/j.invent.2014.06.002]\n41. Auxier B, Bucaille A, Westcott K. Mental health goes mobile: the mental health app market will keep on growing. Deloitte\nInsights. 2021. URL: https://www2.deloitte.com/za/en/insights/industry/technology/\ntechnology-media-and-telecom-predictions/2022/mental-health-app-market.html [accessed 2023-06-05]\n42. Rubanovich CK, Mohr DC, Schueller SM. Health app use among individuals with symptoms of depression and anxiety: a\nsurvey study with thematic coding. JMIR Ment Health 2017 Jun 23;4(2):e22 [FREE Full text] [doi: 10.2196/mental.7603]\n[Medline: 28645891]\n43. Bell IH, Thompson A, Valentine L, Adams S, Alvarez-Jimenez M, Nicholas J. Ownership, use of, and interest in digital\nmental health technologies among clinicians and young people across a spectrum of clinical care needs: cross-sectional\nsurvey. JMIR Ment Health 2022 May 11;9(5):e30716 [FREE Full text] [doi: 10.2196/30716] [Medline: 35544295]\n44. Torous J, Wisniewski H, Liu G, Keshavan M. Mental health mobile phone app usage, concerns, and benefits among\npsychiatric outpatients: comparative survey study. JMIR Ment Health 2018 Nov 16;5(4):e11715 [FREE Full text] [doi:\n10.2196/11715] [Medline: 30446484]\n45. Huberty J, Green J, Glissmann C, Larkey L, Puzia M, Lee C. Efficacy of the mindfulness meditation mobile app \"calm\"\nto reduce stress among college students: randomized controlled trial. JMIR Mhealth Uhealth 2019 Jun 25;7(6):e14273\n[FREE Full text] [doi: 10.2196/14273] [Medline: 31237569]\n46. Clarke J, Draper S. Intermittent mindfulness practice can be beneficial, and daily practice can be harmful. An in depth,\nmixed methods study of the \"calm\" app's (mostly positive) effects. Internet Interv 2019 Nov 16;19:100293 [FREE Full\ntext] [doi: 10.1016/j.invent.2019.100293] [Medline: 31890639]\n47. Ahonala A, Lopperi I. Yläkouluikäisten käyttäjäkokemuksia Chillaa-mobiilisovelluksesta. Diaconia University of Applied\nSciences. 2022. URL: https://www.theseus.fi/bitstream/handle/10024/745815/Ahonala_Lopperi.\npdf?sequence=2&isAllowed=y [accessed 2023-06-05]\n48. Wang L, Fagan C, Yu CI. Popular mental health apps (MH apps) as a complement to telepsychotherapy: guidelines for\nconsideration. J Psychother Integr 2020 Jun;30(2):265-273 [FREE Full text] [doi: 10.1037/int0000204]\n49. Carlo AD, Hosseini Ghomi R, Renn BN, Areán PA. By the numbers: ratings and utilization of behavioral health mobile\napplications. NPJ Digit Med 2019 Jun 17;2:54 [FREE Full text] [doi: 10.1038/s41746-019-0129-6] [Medline: 31304400]\n50. Huguet A, Rao S, McGrath PJ, Wozney L, Wheaton M, Conrod J, et al. A systematic review of cognitive behavioral therapy\nand behavioral activation apps for depression. PLoS One 2016 May 02;11(5):e0154248 [FREE Full text] [doi:\n10.1371/journal.pone.0154248] [Medline: 27135410]\n51. Kertz SJ, MacLaren Kelly JM, Stevens KT, Schrock M, Danitz SB. A review of free iPhone applications designed to target\nanxiety and worry. J Technol Behav Sci 2017 Jan 11;2(2):61-70 [FREE Full text] [doi: 10.1007/s41347-016-0006-y]\n52. Martinengo L, Stona AC, Griva K, Dazzan P, Pariante CM, von Wangenheim F, et al. Self-guided cognitive behavioral\ntherapy apps for depression: systematic assessment of features, functionality, and congruence with evidence. J Med Internet\nRes 2021 Jul 30;23(7):e27619 [FREE Full text] [doi: 10.2196/27619] [Medline: 34328431]\n53. Stawarz K, Preist C, Tallon D, Wiles N, Coyle D. User experience of cognitive behavioral therapy apps for depression: an\nanalysis of app functionality and user reviews. J Med Internet Res 2018 Jun 06;20(6):e10120 [FREE Full text] [doi:\n10.2196/10120] [Medline: 29875087]\n54. Huckvale K, Prieto JT, Tilney M, Benghozi PJ, Car J. Unaddressed privacy risks in accredited health and wellness apps:\na cross-sectional systematic assessment. BMC Med 2015 Sep 07;13:214 [FREE Full text] [doi: 10.1186/s12916-015-0444-y]\n[Medline: 26404673]\n55. Pierce B, P. Twohig M, Levin ME. Perspectives on the use of acceptance and commitment therapy related mobile apps:\nresults from a survey of students and professionals. J Contextual Behav Sci 2016 Oct;5(4):215-224 [FREE Full text] [doi:\n10.1016/j.jcbs.2016.08.001]\n56. Huckvale K, Nicholas J, Torous J, Larsen ME. Smartphone apps for the treatment of mental health conditions: status and\nconsiderations. Curr Opin Psychol 2020 Dec;36:65-70 [FREE Full text] [doi: 10.1016/j.copsyc.2020.04.008] [Medline:\n32553848]\n57. Bevan Jones R, Stallard P, Agha SS, Rice S, Werner-Seidler A, Stasiak K, et al. Practitioner review: co-design of digital\nmental health technologies with children and young people. J Child Psychol Psychiatry 2020 Aug;61(8):928-940 [FREE\nFull text] [doi: 10.1111/jcpp.13258] [Medline: 32572961]\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 16https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\n58. Brown T. Design thinking. Harvard Business Review. 2008 Jun. URL: https://hbr.org/2008/06/design-thinking [accessed\n2023-06-05]\n59. Fleming TM, de Beurs D, Khazaal Y, Gaggioli A, Riva G, Botella C, et al. Maximizing the impact of e-therapy and serious\ngaming: time for a paradigm shift. Front Psychiatry 2016 Apr 18;7:65 [FREE Full text] [doi: 10.3389/fpsyt.2016.00065]\n[Medline: 27148094]\n60. Scholten H, Granic I. Use of the principles of design thinking to address limitations of digital mental health interventions\nfor youth: viewpoint. J Med Internet Res 2019 Jan 14;21(1):e11528 [FREE Full text] [doi: 10.2196/11528] [Medline:\n31344671]\n61. Kidder LH, Fine M. Qualitative and quantitative methods: when stories converge. New Dir Program Eval 1987;1987(35):57-75\n[FREE Full text] [doi: 10.1002/ev.1459]\n62. Gephart Jr RP. Qualitative research and the academy of management journal. Acad Manage J 2004 Aug;47(4):454-462\n[FREE Full text] [doi: 10.5465/amj.2004.14438580]\n63. Fossey E, Harvey C, McDermott F, Davidson L. Understanding and evaluating qualitative research. Aust N Z J Psychiatry\n2002 Dec;36(6):717-732 [doi: 10.1046/j.1440-1614.2002.01100.x] [Medline: 12406114]\n64. Lukka L, Karhulahti VM, Palva M. Mental health professionals’views and needs regarding game-based digital therapeutics.\nOpen Science Framework. 2022. URL: https://osf.io/b8eg6 [accessed 2023-04-17]\n65. Social welfare and healthcare in Finland. Ministry of Social Affairs and Health. 2019. URL: https://stm.fi/documents/\n1271139/14654750/Factsheet_SocialWelfareAndHealthCare_Finland.pdf/f99fee59-aac7-036f-d2b3-b4138532bead/\nFactsheet_SocialWelfareAndHealthCare_Finland.pdf [accessed 2023-06-05]\n66. Finnish Student Health Service. URL: https://www.yths.fi/en/fshs/finnish-student-health-service/ [accessed 2023-06-05]\n67. Rehabilitative psychotherapy. Kela. URL: https://www.kela.fi/rehabilitative-psychotherapy [accessed 2023-06-05]\n68. Low J. A pragmatic definition of the concept of theoretical saturation. Sociol Focus 2019;52(2):131-139 [FREE Full text]\n[doi: 10.1080/00380237.2018.1544514]\n69. Saldaña J. The Coding Manual for Qualitative Researchers. 3rd edition. Thousand Oaks, CA, USA: SAGE Publication;\n2016.\n70. Hennink M, Kaiser BN. Sample sizes for saturation in qualitative research: a systematic review of empirical tests. Soc Sci\nMed 2022 Jan;292:114523 [FREE Full text] [doi: 10.1016/j.socscimed.2021.114523] [Medline: 34785096]\n71. Guest G, Bunce A, Johnson L. How many interviews are enough?: An experiment with data saturation and variability.\nField Methods 2006 Feb;18(1):59-82 [FREE Full text] [doi: 10.1177/1525822X05279903]\n72. Knott E, Rao AH, Summers K, Teeger C. Interviews in the social sciences. Nat Rev Methods Primers 2022 Sep 15;2(1):73\n[FREE Full text] [doi: 10.1038/s43586-022-00150-6]\n73. McIntosh MJ, Morse JM. Situating and constructing diversity in semi-structured interviews. Glob Qual Nurs Res 2015 Aug\n14;2:2333393615597674 [FREE Full text] [doi: 10.1177/2333393615597674] [Medline: 28462313]\n74. Grodal S, Anteby M, Holm AL. Achieving rigor in qualitative analysis: the role of active categorization in theory building.\nAcad Manage Rev 2021 Jul;46(3):591-612 [FREE Full text] [doi: 10.5465/amr.2018.0482]\n75. DeSantis L, Ugarriza DN. The concept of theme as used in qualitative nursing research. West J Nurs Res 2000\nApr;22(3):351-372 [doi: 10.1177/019394590002200308] [Medline: 10804897]\n76. Braun V, Clarke V. Using thematic analysis in psychology. Qual Res Psychol 2006 Jan;3(2):77-101 [doi:\n10.1191/1478088706qp063oa]\n77. Braun V, Clarke V. Reflecting on reflexive thematic analysis. Qual Res Sport Exerc Health 2019;11(4):589-597 [FREE\nFull text] [doi: 10.1080/2159676x.2019.1628806]\n78. Carlson JA. Avoiding traps in member checking. Qual Rep 2010 Jan 09;15(5):1102-1113 [FREE Full text] [doi:\n10.46743/2160-3715/2010.1332]\n79. Tong A, Sainsbury P, Craig J. Consolidated criteria for reporting qualitative research (COREQ): a 32-item checklist for\ninterviews and focus groups. Int J Qual Health Care 2007 Dec;19(6):349-357 [doi: 10.1093/intqhc/mzm042] [Medline:\n17872937]\n80. Beck AT, Steer RA, Ball R, Ranieri W. Comparison of beck depression inventories -IA and -II in psychiatric outpatients.\nJ Pers Assess 1996 Dec;67(3):588-597 [doi: 10.1207/s15327752jpa6703_13] [Medline: 8991972]\n81. Barkham M, Mellor-Clark J, Connell J, Cahill J. A core approach to practice-based evidence: a brief history of the origins\nand applications of the CORE-OM and CORE system. Couns Psychother Res 2006;6(1):3-15 [FREE Full text] [doi:\n10.1080/14733140600581218]\n82. Moeller S. Characteristics of services – a new approach uncovers their value. J Serv Mark 2010;24(5):359-368 [FREE Full\ntext] [doi: 10.1108/08876041011060468]\n83. Damschroder LJ, Aron DC, Keith RE, Kirsh SR, Alexander JA, Lowery JC. Fostering implementation of health services\nresearch findings into practice: a consolidated framework for advancing implementation science. Implement Sci 2009 Aug\n07;4:50 [FREE Full text] [doi: 10.1186/1748-5908-4-50] [Medline: 19664226]\n84. Berrouiguet S, Baca-García E, Brandt S, Walter M, Courtet P. Fundamentals for future mobile-health (mHealth): a systematic\nreview of mobile phone and web-based text messaging in mental health. J Med Internet Res 2016 Jun 10;18(6):e135 [FREE\nFull text] [doi: 10.2196/jmir.5066] [Medline: 27287668]\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 17https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\n85. Cuijpers P, Reijnders M, Huibers MJ. The role of common factors in psychotherapy outcomes. Annu Rev Clin Psychol\n2019 May 07;15:207-231 [doi: 10.1146/annurev-clinpsy-050718-095424] [Medline: 30550721]\n86. Wampold BE. How important are the common factors in psychotherapy? An update. World Psychiatry 2015\nOct;14(3):270-277 [FREE Full text] [doi: 10.1002/wps.20238] [Medline: 26407772]\n87. Wangberg SC, Gammon D, Spitznogle K. In the eyes of the beholder: exploring psychologists' attitudes towards and use\nof e-therapy in Norway. Cyberpsychol Behav 2007 Jun;10(3):418-423 [doi: 10.1089/cpb.2006.9937] [Medline: 17594266]\n88. Feijt MA, de Kort YA, Bongers IM, IJsselsteijn WA. Perceived drivers and barriers to the adoption of eMental health by\npsychologists: the construction of the levels of adoption of eMental health model. J Med Internet Res 2018 Apr 24;20(4):e153\n[FREE Full text] [doi: 10.2196/jmir.9485] [Medline: 29691215]\n89. Ajzen I. The theory of planned behavior. Organ Behav Hum Decis Process 1991 Dec;50(2):179-211 [FREE Full text] [doi:\n10.1016/0749-5978(91)90020-t]\n90. Clough BA, Rowland DP, Casey LM. Development of the eTAP-T: a measure of mental health professionals' attitudes and\nprocess towards e-interventions. Internet Interv 2019 Oct 21;18:100288 [FREE Full text] [doi: 10.1016/j.invent.2019.100288]\n[Medline: 31890635]\n91. Godin G, Bélanger-Gravel A, Eccles M, Grimshaw J. Healthcare professionals' intentions and behaviours: a systematic\nreview of studies based on social cognitive theories. Implement Sci 2008 Jul 16;3:36 [FREE Full text] [doi:\n10.1186/1748-5908-3-36] [Medline: 18631386]\n92. Kazdin AE, Rabbitt SM. Novel models for delivering mental health services and reducing the burdens of mental illness.\nClin Psychol Sci 2013 Apr;1(2):170-191 [FREE Full text] [doi: 10.1177/2167702612463566]\n93. Schmid AM, Kurpicz-Briki M. The digital transformation of mental health care and psychotherapy - a market and research\nmaturity analysis. Stud Health Technol Inform 2022 May 16;292:63-68 [doi: 10.3233/SHTI220322] [Medline: 35575850]\n94. Ritterband LM, Thorndike FP, Cox DJ, Kovatchev BP, Gonder-Frederick LA. A behavior change model for internet\ninterventions. Ann Behav Med 2009 Aug;38(1):18-27 [FREE Full text] [doi: 10.1007/s12160-009-9133-4] [Medline:\n19802647]\n95. Michie S, van Stralen MM, West R. The behaviour change wheel: a new method for characterising and designing behaviour\nchange interventions. Implement Sci 2011 Apr 23;6:42 [FREE Full text] [doi: 10.1186/1748-5908-6-42] [Medline: 21513547]\n96. Bruno R, Abbott JA. Australian health professionals’attitudes toward and frequency of use of internet supported psychological\ninterventions. Int J Ment Health 2015;44(1-2):107-123 [FREE Full text] [doi: 10.1080/00207411.2015.1009784]\n97. Donovan CL, Poole C, Boyes N, Redgate J, March S. Australian mental health worker attitudes towards cCBT: what is the\nrole of knowledge? Are there differences? Can we change them? Internet Interv 2015 Nov;2(4):372-381 [FREE Full text]\n[doi: 10.1016/j.invent.2015.09.001]\n98. Ganapathy A, Clough BA, Casey LM. Organizational and Policy Barriers to the Use of Digital Mental Health by Mental\nHealth Professionals. Telemed J E Health 2021 Dec;27(12):1332-1343 [doi: 10.1089/tmj.2020.0455] [Medline: 33646057]\n99. Schröder J, Berger T, Meyer B, Lutz W, Hautzinger M, Späth C, et al. Attitudes towards internet interventions among\npsychotherapists and individuals with mild to moderate depression symptoms. Cognit Ther Res 2017 Apr 22;41(5):745-756\n[FREE Full text] [doi: 10.1007/s10608-017-9850-0]\n100. Ferlie EB, Shortell SM. Improving the quality of health care in the United Kingdom and the United States: a framework\nfor change. Milbank Q 2001;79(2):281-315 [FREE Full text] [doi: 10.1111/1468-0009.00206] [Medline: 11439467]\n101. Nilsen P. Making sense of implementation theories, models and frameworks. Implement Sci 2015 Apr 21;10:53 [FREE\nFull text] [doi: 10.1186/s13012-015-0242-0] [Medline: 25895742]\n102. Kitson AL, Rycroft-Malone J, Harvey G, McCormack B, Seers K, Titchen A. Evaluating the successful implementation\nof evidence into practice using the PARiHS framework: theoretical and practical challenges. Implement Sci 2008 Jan 07;3:1\n[FREE Full text] [doi: 10.1186/1748-5908-3-1] [Medline: 18179688]\n103. Helfrich CD, Damschroder LJ, Hagedorn HJ, Daggett GS, Sahay A, Ritchie M, et al. A critical synthesis of literature on\nthe promoting action on research implementation in health services (PARIHS) framework. Implement Sci 2010 Oct 25;5:82\n[FREE Full text] [doi: 10.1186/1748-5908-5-82] [Medline: 20973988]\n104. Greenhalgh T, Wherton J, Papoutsi C, Lynch J, Hughes G, A'Court C, et al. Beyond adoption: a new framework for theorizing\nand evaluating nonadoption, abandonment, and challenges to the scale-up, spread, and sustainability of health and care\ntechnologies. J Med Internet Res 2017 Nov 01;19(11):e367 [FREE Full text] [doi: 10.2196/jmir.8775] [Medline: 29092808]\n105. James HM, Papoutsi C, Wherton J, Greenhalgh T, Shaw SE. Spread, scale-up, and sustainability of video consulting in\nhealth care: systematic review and synthesis guided by the NASSS framework. J Med Internet Res 2021 Jan 26;23(1):e23775\n[FREE Full text] [doi: 10.2196/23775] [Medline: 33434141]\n106. Finland in the digital economy and society index. European Commission. 2022. URL: https://digital-strategy.ec.europa.eu/\nen/policies/countries-digitisation-performance [accessed 2023-06-05]\n107. Väestön tieto- ja viestintätekniikan käyttö. Tilastokeskus. 2021. URL: https://www.stat.fi/til/sutivi/2021/\nsutivi_2021_2021-11-30_fi.pdf [accessed 2023-06-05]\n108. Vehko T, Ruotsalainen S, Hyppönen H. E-health and e-welfare of Finland: check point 2018. National Institute for health\nand Welfare. 2018. URL: https://urn.fi/URN:ISBN:978-952-343-326-7 [accessed 2023-06-05]\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 18https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX\n109. The working group of the Finnish Medical Society Duodecim and the Finnish Psychiatric Association. Depressio. Käypä\nhoito-suositus. 2022. URL: https://www.kaypahoito.fi/hoi50023 [accessed 2023-06-05]\nAbbreviations\nCBT: cognitive behavioral therapy\nCOREQ: Consolidated Criteria for Reporting Qualitative Research\nDMHI: digital mental health intervention\nHUS: Helsinki University Hospital\nMHP: mental health professional\nRQ: research question\nEdited by A Kushniruk; submitted 29.11.22; peer-reviewed by L Weinert, D Adler, J Andrews; comments to author 29.01.23; revised\nversion received 16.03.23; accepted 30.04.23; published 10.07.23\nPlease cite as:\nLukka L, Karhulahti VM, Palva JM\nFactors Affecting Digital Tool Use in Client Interaction According to Mental Health Professionals: Interview Study\nJMIR Hum Factors 2023;10:e44681\nURL: https://humanfactors.jmir.org/2023/1/e44681\ndoi: 10.2196/44681\nPMID:\n©Lauri Lukka, Veli-Matti Karhulahti, J Matias Palva. Originally published in JMIR Human Factors (https://humanfactors.jmir.org),\n10.07.2023. This is an open-access article distributed under the terms of the Creative Commons Attribution License\n(https://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and reproduction in any medium,\nprovided the original work, first published in JMIR Human Factors, is properly cited. The complete bibliographic information,\na link to the original publication on https://humanfactors.jmir.org, as well as this copyright and license information must be\nincluded.\nJMIR Hum Factors 2023 | vol. 10 | e44681 | p. 19https://humanfactors.jmir.org/2023/1/e44681\n(page number not for citation purposes)\nLukka et alJMIR HUMAN FACTORS\nXSL•FO\nRenderX",
  "topic": "Toolbox",
  "concepts": [
    {
      "name": "Toolbox",
      "score": 0.6869544386863708
    },
    {
      "name": "Digital health",
      "score": 0.5428791046142578
    },
    {
      "name": "Mental health",
      "score": 0.5404677391052246
    },
    {
      "name": "Computer science",
      "score": 0.49070513248443604
    },
    {
      "name": "Scalability",
      "score": 0.4599446654319763
    },
    {
      "name": "Digital media",
      "score": 0.44774091243743896
    },
    {
      "name": "Adaptability",
      "score": 0.42712506651878357
    },
    {
      "name": "Knowledge management",
      "score": 0.41645127534866333
    },
    {
      "name": "Health care",
      "score": 0.3679662346839905
    },
    {
      "name": "Psychology",
      "score": 0.2761583626270294
    },
    {
      "name": "World Wide Web",
      "score": 0.18536168336868286
    },
    {
      "name": "Programming language",
      "score": 0.0
    },
    {
      "name": "Database",
      "score": 0.0
    },
    {
      "name": "Biology",
      "score": 0.0
    },
    {
      "name": "Ecology",
      "score": 0.0
    },
    {
      "name": "Economics",
      "score": 0.0
    },
    {
      "name": "Economic growth",
      "score": 0.0
    },
    {
      "name": "Psychotherapist",
      "score": 0.0
    }
  ]
}