{
  "title": "Systematic comparison of tools used for m6A mapping from nanopore direct RNA sequencing",
  "url": "https://openalex.org/W4362635637",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A2132490356",
      "name": "Zhen-Dong Zhong",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A4365169974",
      "name": "Ying-Yuan Xie",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A4288732708",
      "name": "Hong‐Xuan Chen",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A4365169976",
      "name": "Ye-Lin Lan",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A2153303520",
      "name": "Xue‐Hong Liu",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A4365169978",
      "name": "Jing-Yun Ji",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A2097999994",
      "name": "Fu Wu",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A2686733807",
      "name": "Lingmei Jin",
      "affiliations": [
        "Guangzhou Institutes of Biomedicine and Health",
        "Chinese Academy of Sciences"
      ]
    },
    {
      "id": "https://openalex.org/A2170641362",
      "name": "Jiekai Chen",
      "affiliations": [
        "Guangzhou Institutes of Biomedicine and Health",
        "Chinese Academy of Sciences"
      ]
    },
    {
      "id": "https://openalex.org/A4313786480",
      "name": "Daniel W Mak",
      "affiliations": [
        "University of Hong Kong"
      ]
    },
    {
      "id": "https://openalex.org/A2096838815",
      "name": "Zhang Zhang",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A3176959533",
      "name": "Guan-Zheng Luo",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A2132490356",
      "name": "Zhen-Dong Zhong",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A4365169974",
      "name": "Ying-Yuan Xie",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A4288732708",
      "name": "Hong‐Xuan Chen",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A4365169976",
      "name": "Ye-Lin Lan",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A2153303520",
      "name": "Xue‐Hong Liu",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A4365169978",
      "name": "Jing-Yun Ji",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2097999994",
      "name": "Fu Wu",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A2686733807",
      "name": "Lingmei Jin",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2170641362",
      "name": "Jiekai Chen",
      "affiliations": [
        "Guangzhou Institutes of Biomedicine and Health"
      ]
    },
    {
      "id": "https://openalex.org/A4313786480",
      "name": "Daniel W Mak",
      "affiliations": [
        "University of Hong Kong"
      ]
    },
    {
      "id": "https://openalex.org/A2096838815",
      "name": "Zhang Zhang",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    },
    {
      "id": "https://openalex.org/A3176959533",
      "name": "Guan-Zheng Luo",
      "affiliations": [
        "Sun Yat-sen University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4200064844",
    "https://openalex.org/W2627064270",
    "https://openalex.org/W2972933339",
    "https://openalex.org/W2071930821",
    "https://openalex.org/W2803154276",
    "https://openalex.org/W3186661411",
    "https://openalex.org/W3133117790",
    "https://openalex.org/W3081143873",
    "https://openalex.org/W2078964320",
    "https://openalex.org/W2065847836",
    "https://openalex.org/W2953460056",
    "https://openalex.org/W2955930197",
    "https://openalex.org/W2973421587",
    "https://openalex.org/W2996159306",
    "https://openalex.org/W3016950990",
    "https://openalex.org/W3202435251",
    "https://openalex.org/W3007172120",
    "https://openalex.org/W1984783889",
    "https://openalex.org/W2591367881",
    "https://openalex.org/W2950063384",
    "https://openalex.org/W2980511028",
    "https://openalex.org/W3119738125",
    "https://openalex.org/W4308772822",
    "https://openalex.org/W4225743429",
    "https://openalex.org/W3184504420",
    "https://openalex.org/W2971454256",
    "https://openalex.org/W2999689892",
    "https://openalex.org/W3107659143",
    "https://openalex.org/W3043981686",
    "https://openalex.org/W3176201285",
    "https://openalex.org/W3046736896",
    "https://openalex.org/W3213101281",
    "https://openalex.org/W2632544498",
    "https://openalex.org/W3174760894",
    "https://openalex.org/W2007429249",
    "https://openalex.org/W3162353597",
    "https://openalex.org/W3179265187",
    "https://openalex.org/W2989499631",
    "https://openalex.org/W4285796355",
    "https://openalex.org/W2754391888",
    "https://openalex.org/W3180605715",
    "https://openalex.org/W4300689744",
    "https://openalex.org/W3205308293",
    "https://openalex.org/W3170621487",
    "https://openalex.org/W3135900624",
    "https://openalex.org/W2466739815",
    "https://openalex.org/W6912789341",
    "https://openalex.org/W2582252439",
    "https://openalex.org/W4362635637"
  ],
  "abstract": "Abstract N6-methyladenosine (m6A) has been increasingly recognized as a new and important regulator of gene expression. To date, transcriptome-wide m6A detection primarily relies on well-established methods using next-generation sequencing (NGS) platform. However, direct RNA sequencing (DRS) using the Oxford Nanopore Technologies (ONT) platform has recently emerged as a promising alternative method to study m6A. While multiple computational tools are being developed to facilitate the direct detection of nucleotide modifications, little is known about the capabilities and limitations of these tools. Here, we systematically compare ten tools used for mapping m6A from ONT DRS data. We find that most tools present a trade-off between precision and recall, and integrating results from multiple tools greatly improve performance. Using a negative control could improve precision by subtracting certain intrinsic bias. We also observed variation in detection capabilities and quantitative information among motifs, and identified sequencing depth and m6A stoichiometry as potential factors affecting performance. Our study provides insight into the computational tools currently used for mapping m6A based on ONT DRS data and highlights the potential for further improving these tools, which may serve as the basis for future research.",
  "full_text": "Article https://doi.org/10.1038/s41467-023-37596-5\nSystematic comparison of tools used for m6A\nmapping from nanopore direct RNA\nsequencing\nZhen-Dong Zhong1,4,Y i n g - Y u a nX i e1,4,H o n g - X u a nC h e n1,Y e - L i nL a n1,\nXue-Hong Liu1,J i n g - Y u nJ i1,F uW u1,L i n g m e iJ i n2,J i e k a iC h e n2,\nDaniel W. Mak3, Zhang Zhang1 & Guan-Zheng Luo1\nN6-methyladenosine (m6A) has been increasingly recognized as a new and\nimportant regulator of gene expression. To date, transcriptome-wide m6A\ndetection primarily relies on well-established methods using next-generation\nsequencing (NGS) platform. However, direct RNA sequencing (DRS) using the\nOxford Nanopore Technologies (ONT) platform has recently emerged as a\npromising alternative method to study m6A. While multiple computational\ntools are being developed to facilitate the direct detection of nucleotide\nmodiﬁcations, little is known about the capabilities and limitations of these\ntools. Here, we systematically compare ten tools used for mapping m6A from\nONT DRS data. Weﬁnd that most tools present a trade-off between precision\nand recall, and integrating results from multiple tools greatly improve per-\nformance. Using a negative control could improve precision by subtracting\ncertain intrinsic bias. We also observed variation in detection capabilities and\nquantitative information among motifs, and identiﬁed sequencing depth and\nm6A stoichiometry as potential factors affecting performance. Our study\nprovides insight into the computational tools currently used for mapping m6A\nbased on ONT DRS data and highlights the potential for further improving\nthese tools, which may serve as the basis for future research.\nOver 150 types of RNA modiﬁcations have been discovered across all\ndomains of life1. The most abundant and best-characterized type of\nmodiﬁcation found in the eukaryotic mRNA is N6-methyladenosine\n(m6A)2,3. The discovery of the m6A demethylase fat mass- and obesity-\nassociated protein (FTO) highlights the reversible and dynamic nature\nof this RNA modiﬁcation, which may serve as a novel regulator in gene\nexpression\n4. Subsequent studies have revealed that m6A is modulated\nby a complex network composed of“writer”, “eraser” and “reader”\nproteins3, through which it can co-transcriptionally and post-\ntranscriptionally inﬂuence essential RNA metabolic processes, includ-\ning pre-mRNA splicing and polyadenylation as well as mRNA export,\ndecay and translation\n5. Recent functional studies have demonstrated\nthe essential role of m6A in physiological and pathological processes\nin various organisms, further advancing our knowledge and under-\nstanding of RNA biology\n6,7.\nOwing to the rapid development of m6A detection methods that\nhave been developed on the next-generation sequencing (NGS) plat-\nform, the m6A landscape has since been documented in a number of\nReceived: 23 March 2022\nAccepted: 21 March 2023\nCheck for updates\n1MOE Key Laboratory of Gene Function and Regulation, Guangdong Province Key Laboratory of Pharmaceutical Functional Genes, State Key\nLaboratory of Biocontrol, School of Life Sciences, Sun Yat-sen University, 510275 Guangzhou, China.2CAS Key Laboratory of Regenerative Biology,\nGuangzhou Institutes of Biomedicine and Health, Chinese Academy of Sciences, Guangzhou, China.3School of Biomedical Sciences, LKS Faculty of\nMedicine, The University of Hong Kong, Hong Kong, China.4These authors contributed equally: Zhen-Dong Zhong, Ying-Yuan Xie.\ne-mail: zhangzhang@mail.sysu.edu.cn ; luogzh5@mail.sysu.edu.cn\nNature Communications|         (2023) 14:1906 1\n1234567890():,;\n1234567890():,;\ndifferent organisms8. Currently, there are two main NGS-based stra-\ntegies that are employed in transcriptome-wide m6A mapping: (i)\nantibody-dependent methods, such as MeRIP-seq and miCLIP\n9,10,a n d\n(ii) antibody-independent methods, such as m6A-REF-seq/MAZTER-\nseq11,12 and DART-seq13. The most widely used MeRIP-seq protocol\nemploys antibodies to enrich RNA fragments containing m6A; how-\never, this approach suffers from the drawback of high false-positive\nrates as a result of non-speciﬁc antibody binding\n14– 16 and hence, inac-\ncurate stoichiometric estimates. Meanwhile, m6A-REF-seq/MAZTER-\nseq utilizes an endonuclease that explicitly cleaves unmethylated ACA\nmotifs but leaves the (m6A)CA intact. This approach precisely identi-\nﬁes m6A sites with single-base resolution and accurately quantiﬁes\nmethylation rates, yet it is limited to a speciﬁc sequence context. For\nexample, while the endonuclease MazF speciﬁcally recognizes ACA\nmotifs, it only covers approximately 16-25% of m6A sites of the whole\ntranscriptome\n11. In DART-seq, the efﬁciency and speciﬁcity of exo-\ngenously expressed APOBEC1-YTH fusion proteins, which are known\nto induce C-to-U deamination at sites adjacent to m6A methylated\nsites, have not yet been thoroughly characterized. Most importantly,\nall of these NGS-based methods are limited to the detection of\naggregate RNA molecule information and are incapable in accurately\nquantifying the stoichiometry at the molecular level. Accordingly, a\nn o v e lm 6 Ad e t e c t i o nm e t h o dw i t hb o t hh i g hr e s o l u t i o na n dq u a n t iﬁ-\ncation capability is greatly needed to overcome these limitations.\nIn the last decade, third-generation sequencing (TGS) technologies\nrepresented by two platforms, namely Paciﬁc Biosciences (PacBio) and\nOxford Nanopore Technologies (ONT), have emerged as promising\nalternatives for mapping nucleotide modiﬁcations\n17. PacBio sequencing\nidentiﬁes DNA modiﬁcations using the interpulse duration (IPD), an\napproach requiring high sequencing coverage but suffers from low\ndiscriminatory power\n18. On the other hand, the ONT sequencing plat-\nform directly sequences DNA or RNA based on the principle of mon-\nitoring shifts in electric current caused by the traversing of a single\nmolecule across a nanopore embedded within a synthetic polymer\nmembrane. The effect on theﬂow of the current through the pore by\nmodiﬁed bases may be distinct from their unmodiﬁed counterpart,\nthereby allowing for the detection of nucleotide modiﬁcations based on\nthe identiﬁed electric current differentials\n19,20.\nA pioneering study published in 2018 reported for theﬁrst time\nthe direct sequencing of native RNA molecules using the ONT\nplatform\n20. Since then, at least ten computational tools have been\ndeveloped to map the location of m6A methylation and to determine\nits stoichiometry from direct RNA sequencing (DRS) (Supplementary\nFig. 1a and Supplementary Table 1). These tools can generally be divi-\nded into two classes based on the strategies employed to identify\nmodiﬁed nucleotides (Fig.1a). Theﬁrst class relies on the detection of\nelectric current differentials. Brieﬂy, a continuous current is sub-\ndivided into“events” and then assigned to each nucleotide in a refer-\nence sequence using one of the two widely-used algorithms, namely\nNanopolish-eventalign\n19 or Tombo-resquiggle21. For each nucleotide,\ncurrent features such as the median, mean, standard deviation and\ndwell-time (i.e., the time a 5-mer sequence resided in the nanopore) are\nextracted and used as inputs for one of three different classiﬁcation\nmethods: statistical testing (e.g., used in Tombo\n21), machine learning\n(e.g., used in MINES22,N a n o m 6 A23 and m6Anet24) or clustering (e.g.,\nused in Nanocompore25 and xPore26)( F i g .1a). The second class of tools\nutilizes base-calling “errors” resulting from the change in current\ncaused by the presence of RNA modiﬁcations. Base-calling“errors”\nmay represent mismatches, insertions, deletions or variability of base\nquality scores. These types of information are collected and classiﬁed\nusing alignment results. To identify modiﬁed bases among the\n“errors”,E p i n a n o\n27 uses a pre-trained machine learning model, while\nother tools (e.g., DiffErr28,D R U M M E R29 and ELIGOS30) perform statis-\ntical testing to compare“errors” with an internal model or control\nsample. Given the high false-positive rate in deﬁning “errors”, a control\nsample with no (or low levels of) RNA modiﬁcation is usually necessary.\nAs ONT DRS sequencing captures both isoform and nucleotide\nmodiﬁcation information, it has been successfully applied in dissecting\na\n2.0\n2.5\n3.0\n3.5\n4.0Read length (log10 bp)\n7.5\n10.0\n12.5\n15.0Read average quality\n0.75\n0.80\n0.85\n0.90\n0.95\n1.00\nWT KO\nIden/g415ty\n(n = 1,309,027) (n = 1,316,561)\nb\n0\n2\n4\n6\n8\n02468 1 1 1 2 1 4 1 6 1 8\nReten/g415on /g415me (min)\nIntensity (c.p.s.)\nWT\nKO\nm6AC\nU G A\n×10⁴\nd\nc\nFast5\nFastq\nAlignment\nEventalign/Resquiggle\nCurrent feature Alignment feature\nm6A-modiﬁed\nUnmodiﬁed\nMINES (x/*)\nm6Anet (x/D)\nNanom6A (x/R)\nNanocompore\n(√/N)\nxPore (√/N)\nTombo (–/N)\nSta/g415s/g415cal test  Sta/g415s/g415cal test  ClusteringMachine learning Machine learning\nACATGGACTC\nA  C  A   T  G G        A   C   T  C*\nA1\na b\nd   c   \na+c b+d\nc+d\na+bB1\nB2\nA2\nDiﬀErr (√/N)\nELIGOS (–/N)\nDRUMMER (√/N)\nA\nm6A\nEpinano (–/R)\n*A   C   A   T   G   G   A C   T   C   \nDNA  strand\nRNA  strand\nm6A\nDirect RNA\nsequencing\n0\n500\n1000\n1500\n2000\nStart codon Stop codon\nFrequency\n0\n1\n2bits\n1 2 3 4 5 6 7\nVHGGACW\n2.8e-136\nFig. 1 | Tools and datasets used for m6A mapping based on the ONT DRS\nplatform. aPipeline and strategies employed by various m6A mapping tools.\nInformation on the requirement for a negative control, minimum coverage and\nmotif speciﬁcity for each tool is shown in brackets.“√” and “x” indicate the\nrequirement for a negative control, while“-” indicates that a negative control is\noptional.“N” indicates a lack of motif limitations, while“D” and “R” indicate DRACH\nand RRACH, respectively. Note that MINES detects m6A in AGACT and GGACH\nmotifs. b m6A detection and quantiﬁcation by LC-MS/MS using WT andMettl3 KO\nsamples.c Violin plots of ONT data features for WT and KO samples, the upper and\nlower limits represent the 75th and 25th percentiles, respectively, while the center\nline represents the median; upper and lower whiskers indicate ±1.5× the inter-\nquartile range (IQR). The number of reads is indicated in parentheses.d Metagene\ndistribution plot with motif preferences of m6A peaks identiﬁed from the MeRIP-\nseq data.\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 2\nthe role of m6A in shaping transcriptome complexity, such as through\nalternative splicing29,31, alternative polyadenylation23, circular RNA\nbiogenesis32 and other transcriptional events33. Despite a number of\nhighly sophisticated state-of-the-art computational tools that have\nbeen developed to detect and quantify m6A, a thorough evaluation\nand comparison of these tools is currently lacking. To address this gap,\nwe compared ten computational tools used for m6A mapping from\nONT DRS data and quantitatively evaluated their performance based\non two continuous evaluation metrics (Receiver Operating Char-\nacteristic (ROC) and Precision Recall (PR) curves), followed by the\nidentiﬁcation of m6A under a cutoff that is associated with the best\nF1 score. We found that most tools presented a trade-off between\nprecision and recall, and their performance largely improved with the\nintegration of the results from multiple tools. We also assessed the\nintrinsic preference for m6A-irrelevant sites and demonstrated that\nintroduction of a m6A-free negative control improved the perfor-\nmances of most tools. In addition, we found that the detection cap-\nability varied among motifs, as current differentials were less easily\ndetected in certain sequence contexts. For the quantitative tools, a\nwide discrepancy was observed among their stoichiometric estimates,\nalbeit with acceptable results in some of the motifs. We showed that\nthis comprehensive comparison between the multiple tools serves as a\nguide for best practices in m6A mapping and quantiﬁcation, as well as\nconducting of further analysis on the ONT DRS platform.\nResults\nDatasets used for ONT tool comparisons\nIn order to compare the computational tools currently available for\nm6A detection (Fig.1a, Supplementary Fig. 1a, and Supplementary\nTable 1), we conducted ONT DRS for mRNA from wild-type (WT) mouse\nembryonic stem cells (mESCs) and corresponding m6A-deﬁcient\nsamples with the major m6A methyltransferase Mettl3 knockout\n(KO). The mRNA derived fromMettl3KO samples were conﬁrmed to be\nvirtually absent of m6A by liquid chromatography-mass spectrometry\n(LC-MS/MS) (Fig.1b). We obtained 1.31 and 1.32 million reads for the WT\nand KO samples, respectively, with similar median read length of 1 kb\n(Fig. 1c). The average read quality scores were greater than 10 and the\nmedian identities of aligned reads were 90.7% and 92.1% for WT and KO\nsamples, respectively (Fig.1c). The average quality and alignment\nidentity of reads from WT samples were slightly lower than that from\nKO samples, suggesting that the presence of m6A may cause electric\ncurrent variability, and thus lead to more base-calling “errors”\n27\n(Fig.1c). We also calculated the coverage of aligned reads to annotated\ntranscripts and found that a large proportion of reads were almost full-\nlength in both samples (Supplementary Fig. 1b). Overall, the quality of\nthe DRS data was sufﬁcient for m6A detection.\nTo obtain validation datasets, we performed the well-\ncharacterized MeRIP-seq assay on WT andMettl3 KO samples. Peaks\nidentiﬁed in WT samples were distributed around stop codons with a\nconsensus sequence RRACH (R = A/G, H = A/T/C), while peaks from KO\nsamples were randomly distributed (Supplementary Fig. 1c). Given the\nabsence of m6A methylation in the KO samples, these m6A-irrelevant\npeaks were mainly due to the non-speciﬁc antibody binding. After\nexcluding the m6A-irrelevant peaks, a total of 18,069 high-conﬁdence\nm6A peaks were identiﬁed (Fig.1d). The ONT DRS platform detected\n903,637 and 895,031 RRACH motifs in WT and KO samples, respec-\ntively, and more than 40% (370,000) were supported by at leastﬁve\nreads (Supplementary Fig. 1d). The m6A sites identiﬁed in the same cell\nline by three independent NGS-based methods, i.e., m6A-REF-seq\n12,\nmiCLIP34 and miCLIP235, were also included as validation sets. To fur-\nther validate our results, two published DRS datasets derived from WT\nand Mettl3 KO mESCs samples were included as replicates30 (Supple-\nmentary Table 2). In addition, we also included published DRS datasets\nfrom WTArabidopsis(Col-0) and mutants defective of VIRILIZER (vir-1)\nas validation in distant species\n28 (Supplementary Table 2).\nA comparison between the performance of ten computa-\ntional tools\nIn order to assess the aforementioned ten tools’capability to identify\nm6A sites, we evaluated their performance based on m6A sites iden-\ntiﬁed using MeRIP-seq, miCLIP and miCLIP2 assays as ground truth\n(see Methods). In considering the limitations of each NGS-based\nmethod, we took the m6A sites identiﬁed by each NGS-based method\nor their intersection and union as validation sets separately. Since\ns o m et o o l sa r el i m i t e dt oR R A C Hm o t i f s ,w eo n l yr e t a i n e dt h es i t e s\nfound in this speciﬁc sequence context (Supplementary Table 3). We\nthen applied each computational tool to predict m6A and ranked the\nsites according to the conﬁdence scores reported by each tool. As\nsome tools require (DiffErr, DRUMMER, xPore, Nanocompore) or\nsupport (ELIGOS_diff, Epinano_delta, Tombo_com) to use negative\ncontrol sample, while others (ELIGOS, Epinano, Tombo, m6Anet,\nMINES and Nanom6A) do not, we therefore evaluated their perfor-\nmances in two separate modes which are hereinafter referred to as the\ncompare-mode and single-mode.\nWe ﬁrst quantiﬁed their performance using two continuous eva-\nluation metrics, the area under the ROC curve (ROC AUC) and PR curve\n(PR AUC). Among the tools using single-mode, m6Anet outperformed\nothers by achieving a ROC AUC of 0.68-0.94 and PR AUC of 0.20-0.52,\nfollowed by ELIGOS, Epinano and Nanom6A, while Tombo achieved\nt h el o w e s tR O CA U Ca n dP RA U C( F i g .2a, b and Supplementary\nFig. 2a). As MINES trained its models on 12 RRACH motifs butﬁltered\nt h eo u t p u tm 6 As i t e se x c e p tt h a tl o c a t e do nf o u rs e q u e n c e s( G G A C T ,\nGGACA, GGACC, AGACT), we modiﬁed its code to output all sites. Even\nthough MINES achieved the second lowest ROC AUC, the PR AUC was\nrelatively high (Fig.2a, b and Supplementary Fig. 2a). Notably, all tools\nperformed much better on four motifs (GGACT, GGACA, GGACC,\nAGACT), though their ranking remained unchanged (Supplementary\nFig. 3). In the compare-mode, xPore achieved the best ROC AUC of\n0.75-0.91 and PR AUC of 0.27-0.67, which were slightly higher than\nthose of Epinano_delta. Three error-based tools, ELIGOS_diff, DRUM-\nMER and DiffErr, achieved almost the same performance, which may\nbe due to the similar principle they follow (Fig.2c, d and Supple-\nmentary Fig. 2b). When using different validation sets, the ranking of\neach tool remained consistent, indicating that the relative perfor-\nm a n c eo ft h et o o l si sn o ta f f e c t e db yt h ec h o i c eo fv a l i d a t i o ns e t\n(Fig. 2a– d and Supplementary Fig. 2a, b). In addition, overall ranking\nwas not changed though the ROC and PR AUC of all tools improved by\ntaking the maximum of the predicted probability within each peak\nfrom MeRIP-seq results (see Methods) (Supplementary Fig. 2c).\nWe next assessed the precision of the top 20,000 m6A sites pre-\ndicted by each tool. Among the tools in single-mode, m6Anet constantly\nshowed the highest precision, with 90% of the top 2000 sites or 80% of\nthe top 5000 sites being supported by at least one NGS-based method\n(Fig. 2e, f and Supplementary Fig. 2d, e). In the compare-mode, xPore\nachieved the best precision for top 4000 m6A sites, but its performance\ndecreased sharply with the inclusion of additional sites. In contrast,\nEpinano_delta constantly showed the best precision for top 4000 to\n20,000 m6A sites (Fig.2g, h and Supplementary Fig. 2f, g). When ana-\nlyzing the relative location of top m6A sites, we found that those with\nhigher precision showed greater enrichment around stop codons, a\ncharacteristic distribution of m6A (Fig.2i, j). This was consistent with\npreviousﬁndings in mammalian species\n9,10. The presence of the GGACU\nconsensus sequence was more pronounced in m6A sites identiﬁed by\ntools with higher precision, also supporting previousobservations about\nthe distribution of m6A (Fig.2i, j).\nTo further conﬁrm the evaluation of each tool, we repeated the\naforementioned process on a published ONT DRS dataset that was\nderived from WT andMettl3 KO mESCs samples30. We found that all\nsingle-mode tools achieved nearly identical performance to their\nperformance using our data; tools in the compare-mode, on the other\nhand, generally performed worse, though their ranking remained\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 3\nunchanged (Supplementary Fig. 4a– d). Notably, the published mESCs\nwas found to be an incompleteMettl3 KO cell line with an estimated\n~40% of m6A still present30,36. This implies that a perfect negative\ncontrol absent of any m6A would be crucial for these compare-mode\ntools. Likewise, these tools showed superior m6A detection capability\nin the aforementioned motifs (GGACT, GGACA, GGACC, AGACT)\n(Supplementary Fig. 4c, d).\nAs some tools were constructed and tested on training data from\nmammalian species, they may have different performance in non-\nmammalian species in which the sequence preference and stoichio-\nmetry of m6A may vary. To further compare these tools in non-\nmammalian species, we evaluated their performance using published\nDRS data from theArabidopsis\n28. As expected, the performance of\nmachine-learning based tools was compromised when applied to the\nArabidopsis dataset, particularly m6Anet and MINES which were\ntrained on DRS data from human samples using miCLIP as the ground\ntruth (Supplementary Fig. 5). We reasoned that these two tools are not\ntrained extensively on AAACH motifs, which are the predominantly\noccurring m6A context inArabidopsisrather than AGACT and GGACH\nmotifs in human or mouse (Supplementary Table 4). On the other\nhand, most error-based tools performed better inArabidopsis (Sup-\nplementary Fig. 5), likely beneﬁting from a higher coverage (Supple-\nmentary Table 3). Accordingly, given that the size ofArabidopsis\ngenome is only 1/20 compared to that of the mouse genome, a higher\ncoverage was achieved with similar sequencing reads (Supplementary\nTable 3), leading to more base-calling“errors” occurred in the pre-\nsence of m6A and increasing the statistical power of error-based tools.\nHowever, as more than 10% of m6A were retained invir-1samples\n28,t h e\nperformance of the compare-mode did not signiﬁcantly improve\n(Supplementary Fig. 5). Similarly, the performance of the tools\nab cd\nef i\ngh j\n0% 20% 40% 60% 80% 100%\nPercentage\n0   methods 1   methods\n2   methods 3   methods\nValidated by\nTombo\nMINES\nNanom6A\nm6Anet\nELIGOS\nEpinano\n100%0% 20% 40% 60% 80%\nPercentage\n0   methods 1   methods\n2   methods 3   methods\nValidated by\nTombo_com\nNanocompore\nxPore\nDiﬀErr\nDRUMMER\nELIGOS_diﬀ\nEpinano_delta\n3\n4\nTo m b o\nMINES\nNanom6A\nm6Anet\nELIGOS\nEpinano\n0\n1\n2\nStart−codon Stop−codon\nDensity\n12345\n12345\n12345\n12345\n12345\n12345\n0.01.02.0\n0.0\n1.02.0\n0.01.02.0 Bits\nTombo\nMINES\nNanom6A\nm6Anet\nELIGOS\nEpinano\n0.01.02.0\n0.0\n1.02.0\n0.01.02.0\n0\n1\n2\n3\n4\nStart−codon Stop−codon\nDensity\nTo m b o _ c o m\nNanocompore\nxPore\nDiﬀErr\nDRUMMER\nELIGOS_diﬀ\nEpinano_delta\n12345\n12345\n12345\n12345\n12345\n12345\n0.01.02.0\n0.0\n1.02.0\n0.01.02.0 Bits\nxPore\nDiﬀErr\nDRUMMER\nELIGOS_diﬀ\n0.01.02.0\n0.0\n1.02.0\n0.01.02.0\n12345\nEpinano_delta\n0.01.02.0\nTombo_com\nNanocompore\n1\nFalse posi/g415ve rate\nTrue posi/g415ve rate\nTombo (AUC = 0.67)\nMINES (AUC = 0.70)\nNanom6A (AUC = 0.74)\nm6Anet (AUC = 0.82)\nELIGOS (AUC = 0.76)\nEpinano (AUC = 0.75)\n0 0.2 0.4 0.6 0.8 1\n0\n0.2\n0.4\n0.6\n0.8\n1\nRecall\nPrecision\nTombo (AUC = 0.12)\nMINES (AUC = 0.20)\nNanom6A (AUC = 0.21)\nm6Anet (AUC = 0.35)\nELIGOS (AUC = 0.19)\nEpinano (AUC = 0.22)\n0 0.2 0.4 0.6 0.8 1\n0\n0.2\n0.4\n0.6\n0.8\n0.2\n0.4\n0.6\n4,000\n8,000\n12,000\n16,000\n20,000\nPrecision\nNumber of top sites\nTombo MINES Nanom6A\nm6Anet ELIGOS Epinano\n0\n0.8\n2,000\n0\n6,000\n10,000\n14,000\n18,000\n0\n0.2\n0.4\n0.6\n0.8\n1\nROCAUC\nTombo MINES Nanom6A\nm6Anet ELIGOS Epinano\n0\n0.2\n0.4\n0.6PRAUC\nMeRIP-seq\nmiCLIP\nmiCLIP2\nUnion\nIntersec/g415on\n1\n0.6\n0.8\nFalse posi/g415ve rate\nTrue posi/g415ve rate\nTombo_com (AUC = 0.80)\nNanocompore (AUC = 0.77)\nxPore (AUC = 0.85)\nDiﬀErr (AUC = 0.80)\nDRUMMER (AUC = 0.80)\nELIGOS_diﬀ (AUC = 0.82)\n0 0.2 0.4 0.6 0.8 1\n0\n0.2\n0.4\nEpinano_delta (AUC = 0.84)\n1\nRecall\nPrecision\n0 0.2 0.4 0.6 0.8 1\n0\n0.2\n0.4\n0.6\n0.8\nTombo_com (AUC = 0.40)\nNanocompore (AUC = 0.41)\nxPore (AUC = 0.48)\nDiﬀErr (AUC = 0.35)\nDRUMMER (AUC = 0.35)\nELIGOS_diﬀ (AUC = 0.36)\nEpinano_delta (AUC = 0.45)\n0\n0.2\n0.4\n0.6\n0.8\n1\nROCAUC\nTombo_com Nanocompore xPore\nDiﬀErr DRUMMER ELIGOS_diﬀ\nEpinano_delta\n0\n0.2\n0.4\n0.8PRAUC\n0.6\nMeRIP-seq\nmiCLIP\nmiCLIP2\nUnion\nIntersec/g415on\n0.2\n0.4\n0.6Precision\nNumber of top sites\nTombo_com Nanocompore xPore\nDiﬀErr DRUMMER ELIGOS_diﬀ\n0\n0.8\nEpinano_delta\n4,000\n8,000\n12,000\n16,000\n20,000\n2,000\n0\n6,000\n10,000\n14,000\n18,000\nFig. 2 | Performance evaluation of ten tools for m6A detection capability.\na Receiver operating characteristic (ROC) curve (top) and Precision Recall (PR)\ncurve (bottom) for candidate sites detected by single-mode tools using the miCLIP\ndata as ground truth. Area under the curve (AUC) is indicated in parentheses.b ROC\nAUC (top) and PR AUC (bottom) for candidate sites detected by single-mode tools\nusing different NGS-based datasets as ground truth.c ROC curve (top) and PR curve\n(bottom) for candidate sites detected by compare-mode tools using the miCLIP\ndata as ground truth. AUC is indicated in parentheses.d ROC AUC (top) and PR AUC\n(bottom) for candidate sites detected by compare-mode tools using different NGS-\nbased datasets as ground truth.e Precision curve for top 20,000 m6A sites\ndetected by single-mode tools using the miCLIP data as ground truth.f Percentage\nfor m6A sites supported by various number of NGS-based methods. Top 2000 m6A\nsites detected by single-mode tools are counted.g Precision curve for top 20,000\nm6A sites detected by compare-mode tools using the miCLIP data as ground truth.\nh Percentage for m6A sites supported by various number of NGS-based methods.\nTop 2000 m6A sites detected by compare-mode tools are counted.i Metagene\nplots (left) of the transcriptome-wide m6A distribution for top 2000 m6A sites\ndetected by single-mode tools. The sequence motifs of these sites plotted by\nSeqlogo are shown on the right.j Metagene plots (left) of the transcriptome-wide\nm6A distribution for top 2000 m6A sites detected by compare-mode tools. The\nsequence motifs of these sites plotted by Seqlogo are shown on the right.\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 4\nimproved in four motifs (GGACT, GGACA, GGACC, AGACT), particu-\nlarly for m6Anet and MINES (Supplementary Fig. 6). We observed\nexactly the same results from other replicate dataset fromArabidopsis\n(Supplementary Fig. 7).\nIn summary, we found that the performance of computational\ntools for detecting m6A sites varied signiﬁcantly. Among those that\nonly used a wild-type (WT) sample, m6Anet performed the best. In\ncontrast, tools that used both WT and m6A-deﬁcient (KO) samples\nexhibited a comparable performance, with the exception of xPore and\nNanocompore, which omitted a number of m6A sites to be tested but\nhad higher precision within the top sites. Tombo, ELIGOS and Epinano\nall had improved performance when using their compare-mode with a\nnearly m6A-free sample as negative control. In addition, machine-\nlearning based tools may be affected by species-speciﬁc differences in\nm6A distribution and stoichiometry.\nIntrinsic bias of ONT tools in m6A detection\nTo determine the optimal cut-off value for each tool, we calculated the\nF1 scores under continuous cut-offs and selected the value that cor-\nresponded to the summed maximum F1 score when applied to the\nvalidation sets from miCLIP and miCLIP2 (Supplementary Fig. 8 and\nSupplementary Table 5). We detected 6410 to 35,475 m6A sites from\nWT samples and compared them to the validation sets from miCLIP\nand miCLIP2 (Fig.3a, b and Supplementary Fig. 9a, b). Among the\nsingle-mode tools, Tombo, Nanom6A, ELIGOS and Epinano detected\nmore m6A sites with higher recall rates, but at the cost of lower pre-\ncision (Fig.3a). While m6Anet and MINES omitted many of the sites to\nbe tested and lost recall rates due to the high coverage requirement or\nmotifs limitation, they achieved the highest F1 score thanks to their\nhigh precision (Fig.3a). Among the tools in the compare-mode, two\ntools based on clustering principle achieved the highest precision;\nab\ncd\ne\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0 \n10,000  \n20,000  \n30,000  \n40,000  \nValue\nCounts\nSites detected by ONT Sites veriﬁed by miCLIP\nPrecision Recall F1 score\nTombo MINES\nNanom6A m6An\net\nELIGOS Epinano\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0 \n10,000  \n20,000  \n30,000  \n40,000  \nValue\nCounts\nSites detected by ONT Sites veriﬁed by miCLIP\nPrecision Recall F1 score\nTombo_c\nom\nNano\ncompore\nxPore DiﬀErr\nDRUMMERELIGOS_diﬀEpinano_d\nelta\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0\n10,000\n20,000\n30,000\n40,000\nTombo MINES Nanom6A m6Anet ELIGOS Epinano\nSites detected in WT Sites calibrated by KO\nPrecision (WT) F1 score (WT)\nPrecision (WT-KO) F1 score (WT-KO)\nCounts\nValue\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0\n10,000\n20,000\n30,000\n40,000\nTombo MINES Nanom6A m6Anet ELIGOS Epinano\nSites detected in WT Sites calibrated by Random\nPrecision (WT) F1 score (WT)\nPrecision (WT-Random) F1 score (WT-Random)\nCounts\nValue\n0 10,000 20,000 30,000 40,000\nTombo\nMINES\nNanom6A\nm6Anet\nELIGOS\nEpinano\nWT KO|Random\nWT&KO WT&Random\nSites detected in Ra/g415o (% of WT)\nWT&KO WT&Random\n52.79\n20.21\n26.60\n6.64\n21.23\n12.16\n9.21\n6.78\n4.08\n0.61\n2.48\n2.07\nFig. 3 | Assessment of intrinsic bias and the effects of using a negative control\non m6A detection. a, b Precision, recall and F1 scores for single-mode tools (a)a n d\ncompare-mode tools (b) using miCLIP results as validation set.c Counts and per-\ncentages of recurrent m6A sites identiﬁed amongst samples. One-sided Hyper-\ngeometric tests were applied to calculate signiﬁcance. WT&KO, both in WT and KO;\nWT&Random, both in WT and Random; KO|Random, the total number in KO or\nRandom. d, e The m6A site counts and precision and F1 scores before and after\ncalibration with the results from KO (d)o rr a n d o m(e) samples. miCLIP results were\nused as a validation set. WT-KO, precision and F1 score for sites calibrated using KO\nresults. WT-random, precision and F1 score for sites calibrated with a randomly\nselected dataset.\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 5\nhowever, it was challenging to balance precision and recall rate for\nother tools, likely due to the failure of clustering (see Methods; Fig.3b).\nDiffErr, DRUMMER and ELIGOS_diff achieved almost the same per-\nformances (Fig.3b). Similar results were found when using the vali-\ndation set from miCLIP2 (Supplementary Fig. 9a, b). We also calculated\nprecision, recall and F1 score with higher coverage requirement.\nIncreasing the coverage from 5 to 20 resulted in a better F1 score for all\ntools, with most of them achieving a better precision and some\nachieving a better recall. However, increasing the coverage from 20 to\n50 did not result in better performance for most tools (and even\nslightly worse for some). Notably, the ranking of tools was nearly the\nsame regardless of different coverage requirements (Supplementary\nFig. 9). The performance of Tombo, ELIGOS and Epinano was better in\ncompare-mode than in single-mode, particularly in terms of precision\n(Fig.3a, b). This suggests that there might be an intrinsic preference for\ncertain sites that is unrelated to m6A and can be avoided when using\nthe compare-mode.\nAs the Mettl3 KO cell we used were veriﬁed to be free of m6A\n(Fig.1b), we expected no (or few) m6A sites would be detected using the\nsingle-mode tools. Strikingly, a substantial number of m6A sites (from\n983 to 30,207) were identiﬁed in the KO sample by most tools, with\nTombo even detecting a similar number of m6A sites in KO and WT\nsamples (Fig.3c). This suggests a systematic overestimation of m6A\nabundance by the tools. Sites detect e di nt h eK Os a m p l ed i dn o ts h o w\nclear enrichment around the stop codons when compared to the\nbackground (Supplementary Fig. 9c), thus implying a prevalence of false\npositives in the results. We found that the recurrence of m6A sites in WT\nsamples was signiﬁcantly higher in KO samples than in random datasets\n(see Methods; Fig.3c). For instance, 52.79% and 28.68% of the m6A sites\ndetected in the WT samples were also detected in the KO samples by\nTombo and Nanom6A, respectively, while only 9.21% and 4.52% of sites\nc o u l db ef o u n di nt h er a n d o md a t a s e t s( F i g .3c), thus suggesting a\npotential bias towards certain m6A-irrelevant sites. We inspected these\nsites that were detected in both WT and KO samples and found that\nsingle-nucleotide polymorphisms (SNPs) and insertions/deletions\n(indels) near RRACH motifs could contribute to this bias, particularly for\nELIGOS, which detects m6A by comparing“errors” to the background\nmodel and treat SNPs/indels as“errors” during m6A detection (Sup-\nplementary Fig. 9d, e). In addition, homopolymer near the RRACH motif\nwas also one of the causes of the bias (Supplementary Fig. 9d, e), as they\nmay lead to deletion“errors” signal and inaccurate events assignment.\nDespite these observations, a proportion of sites detected in both WT\nand KO samples could not be explained.\nWe next employed the KO samples as a negative control to test\nwhether it could help to identify false positives and thereby reﬁne the list\nof reported m6A sites. After subtracting the sites detected in the nega-\ntive control, we found that the precision of most tools in the single-mode\nwere signiﬁcantly improved, especially for Tombo and Nanom6A (Fig.3d\nand Supplementary Fig. 9h). Despite decreased recall rates, the F1 scores\nof these tools were improved (Fig.3d and Supplementary Fig. 9f, h). In\ncontrast, calibrating m6A sites using sites in random datasets mentioned\nabove did not improve the precision, but decreased the recall rates\n(Fig. 3e and Supplementary Fig. 9g, i). ELIGOS and Epinano performed\nbetter when using the compare-mode than directly subtracting the sites\nin negative control sample (Supplementary Fig. 9j, k). Overall, the\nintrinsic bias of each tool may lead to pervasive false positives and using\na negative control can improve their performance.\nDetection capabilities varied among motifs\nMost tools train separate machine learning models or build unique\nreference models to detect m6A sites with different sequence contexts\n(or motifs). Notably, m6A sites in AGACT/GGACH motifs tend to have\nbetter evaluation metrics (Supplementary Fig. 3). We hypothesized\nthat detection capabilities may vary among motifs. We found that the\nrecall rates for certain motifs, such as GGACT, GGACA, GGACC and\nAGACT, were signiﬁcantly higher than that of other motifs. On the\nother hand, some motifs such as AAACC, AAACA and GAACA showed\nextremely low recall rates (Fig.4a). In addition to the highest recall\nrates observed in the four motifs (GGACT, GGACA, GGACC and\nAGACT), they also consistently showed the highest precision (Fig.4b),\nsuggesting much better detection capabilities of most tools for these\nmotifs. Thisﬁnding was consistent for both current-based and error-\nbased tools (Supplementary Table 6), implying a difﬁculty in differ-\nentiating or detecting m6A sites within some 5-mer motifs. Similar\nresults were observed when using the miCLIP2 result as a validation set\n(Supplementary Fig. 10a, b and Supplementary Table 6).\nGiven theseﬁndings, we suspected that electric current differ-\nentials between the modiﬁed and unmodiﬁed bases may be modest for\nsome motifs, resulting in difﬁculties of distinguishing m6A from the\nAdenosine base (A). To test this hypothesis, we inspected 239 GGACA\nand 59 GAACA sites identiﬁed by m6A-REF-seq that were almost fully\nmethylated in WT samples but non-methylated in KO samples\n(methylation rate of WT - KO > 0.8). Next, we analyzed ONT reads\ncovering these m6A sites (for both WT and KO samples) to examine\ndiscrepancies in currents and base-calling“errors” proﬁles. Notably,\ncurrent intensity differed greatly between modiﬁed and unmodiﬁed\nGGACA motifs but not GAACA motifs (Fig.4c). In addition, modiﬁed\nreads with GGACA motif resulted in more base-calling“errors” com-\npared to unmodiﬁed reads, especially for deletions and mismatches; in\ncontrast, modiﬁed reads with GAACA motif showed little effect on the\nfrequency of base-calling “errors” (Fig. 4d, e and Supplementary\nFig. 10c). Nevertheless, the qualities of modiﬁed reads with either\nGGACA or GAACA motif were signiﬁcantly lower than that of unmo-\ndiﬁed reads (Supplementary Fig. 10c). We concluded that current\ndifferentials between m6A and A were relatively small at some\nsequence contexts, leading to poor performance of most tools\nencountering such motifs.\nPerformance of m6A quantiﬁcation\nAmong the ten computational tools evaluated, three of the current-\nbased tools (Tombo/Tombo_com, Nanom6A and xPore) are able to\nquantify methylation rates. Tombo/Tombo_com and Nanom6A detect\nm6A signal of single reads and thus allow for quantiﬁcation of m6A at\neach genomic location covered by multiple reads, while xPore estimates\nthe methylation rate by modeling a mixture of two Gaussian distribu-\ntions corresponding to unmodiﬁed and modiﬁed reads. To evaluate the\nability of each tool to quantify m6A sites, we compared their results to\nthose obtained from NGS-based methods. Weﬁrst calculated the\nenrichment score of each site using MeRIP-seq data, then divided the\nsites into seven categories according to their enrichment scores. When\ncomparing the methylation rates for sites belonging to different cate-\ngories, we found that sites with high enrichment scores also showed\nhigher methylation rates (Fig.5a). For all three tools, methylation rates\nwere positively correlated with the enrichment score, and xPore showed\nthe highest correlation (Fig.5a). To further assess their performance\nquantitatively, we utilized the validation set from m6A-REF-seq results\ncontaining quantitative information for individual m6A sites in four\nmotifs. These three tools showed largely different correlations with the\nvalidation set, among which Tombo and xPore achieved the lowest and\nthe highest correlations, respectively (Pearson’ r =0 . 2 1 f o r T o m b o a n d\nPearson’ r = 0.57 for xPore) (Fig.5b). Correspondingly, the results of\ndifferent tools were poorly correlated, with the lowest correlation\nbetween Tombo and Nanom6A (Pearson’ r =0 . 2 7 ) , a n d t h e h i g h e s t\ncorrelation between Nanom6A and xPore (Pearson’r =0 . 6 5 )( F i g .5b). In\naddition, Tombo_com always showed a higher correlation with other\nmethods than Tombo.\nGiven that previous reports on variable detection capabilities\namong different motifs, we investigated whether the performance of\nm6A quantiﬁcation also varied among different sequence contexts.\nDespite the low overall consistency among the three tested tools, we\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 6\nfound that they consistently showed higher correlations in speciﬁc\nmotifs (Fig. 5c and Supplementary Fig. 11a– f). For instance, when\ncomparing Tombo and Nanom6A, Pearson correlation coefﬁcients for\nm6A sites within the GGACT and AGACT motifs increased to 0.7, a\nvalue signiﬁcantly higher than that for all sites (0.27) (Fig.5c). Similar\nresults were observed for the otherﬁve pairs of comparisons (Sup-\nplementary Fig. 11a– e). Furthermore, increasing the coverage did not\nimprove the quantiﬁcation performance (Fig.5d and Supplementary\nFig. 11g).\nDetection capability is inﬂuenced by sequence coverage and\nm6A stoichiometry\nIn order to test whether the detection capability is affected by\nsequencing coverage, we compared the recall and precision across\ndifferent coverage intervals for each tool. Three error-based tools\n(ELIGOS/ELIGOS_diff, DRUMMER and DiffErr) and Nanocompore were\nsusceptible to low coverage, with their recall rates increasing drama-\ntically as coverage increased (Fig.6a), which explains the superior\nperformance of these tools inArabidopsiswith high sequencing depth\n(Supplementary Fig. 5). xPore and Tombo_com showed slightly lower\nrecall rates at higher coverage interval, while other tools remained\nstable (Fig.6a). In terms of precision, Tombo_com and Epinano_delta\nbeneﬁted most from the high coverage as did the performance of\nEpinano, Nanom6A and MINES, whereas other tools were less affected\nb yt h ec o v e r a g e( F i g .6b). These results were consistent when using\ndata from miCLIP2 as a positive control (Supplementary Fig. 12 and\nSupplementary Table 7). In general, the detection capabilities of dif-\nferent tools varied in their response to coverage (Fig.6ca n dS u p p l e -\nmentary Table 7).\nAs most m6A sites were partially methylated, we wondered whe-\nther the algorithms employed by different tools were also effective in\ndetecting m6A sites with low methylation level. To test this, we divided\nm6A sites that were detected by m6A-REF-seq intoﬁve categories\naccording to the methylation rate and compared the recall rate\nbetween different categories for each tool. As expected, it is difﬁcult\nfor all the tools to detect sites with low m6A levels (0-0.2); in contrast,\nthe recall rate is largely improved for the sites with high m6A levels\n(0.8– 1) (Fig.6d and Supplementary Table 8). To further investigate all\nab\ne Current intensity\n90\n100\n110\n120\n130\n140\nUNM\n(5,548 reads/\n9,335 events)\nMod\n(7,826 reads/\n16,149 events)\nGGACA\n100\n110\n120\n130\n140\nUNM\n(95 reads/\n190 events)\nMod\n(60 reads/\n91 events)\nchr3|96196914|−:GGACA\n80\n90\n100\n110\n120\n130\nUNM\n(903 reads/\n3,131 events)\nMod\nGAACA\n(1,140 reads/\n1,800 events)\n80\n90\n100\n110\n120\nUNM\n(76 reads/\n542 events)\nMod\n(30 reads/\n207 events)\nchr5|139338165|−:GAACA\n0.00\n0.25\n0.50\n0.75\n1.00\nUNM\n(249 sites)\nMod\n(239 sites)\nMismatch frequency\nGGACA\nUNM\n(59 sites)\nMod\n(61 sites)\nGAACA\n0.00\n0.25\n0.50\n0.75\n1.00\nUNM\n(249 sites)\nMod\n(239 sites)\nDele/g415on frequency\nGGACA\nUNM\n(59 sites)\nMod\n(61 sites)\nGAACA\ncd\n0\n1\n2\n3\n4\n5\n6\nTomboMINES\nNanom6Am6AnetELIGOSEpinano\nTombo_comNanocompore\nxPore DiﬀErr\nDRUMMERELIGOS_diﬀ\nEpinano_delta\nRela/g415ve recall\nAAACA AAACC AAACT AGACA AGACC AGACT\nGAACA GAACC GAACT GGACA GGACC GGACT\n0\n1\n2\n3Rela/g415ve precision\nTomboMINES\nNanom6Am6AnetELIGOSEpinano\nTombo_comNanocompore\nxPore DiﬀErr\nDRUMMERELIGOS_diﬀ\nEpinano_delta\nAAACA AAACC AAACT AGACA AGACC AGACT\nGAACA GAACC GAACT GGACA GGACC GGACT\nModiﬁed:\nUnmodiﬁed:\nA G TT GG A C A TT A G\nchr3|96196914|-:GGACA\n60\n95\nTTT A G AA C A T GG C\nchr5|139338165|-: GAACA\n30\n76\nModiﬁed:\nUnmodiﬁed:\nFig. 4 | Detection capabilities for m6A among sequence motifs. a, b Relative\nrecall rates (a) and precision (b) for 12 motifs bearing the consensus sequence\nRRACH. Relative recall rates/precision were calculated as the ratio of the recall/\nprecision for the sites in a speciﬁc motif to the overall mean (across all sites). A m6A\nproﬁle created from miCLIP results was used for validation.c Current intensity of\nmodiﬁed and unmodiﬁed sites in GGACA or GAACA motifs. The m6A candidate\nsites (methylation rate of WT– KO > 0.8) were identiﬁed using m6A-REF-seq and\nmarked as“Mod” (modiﬁed, sites in WT sample) or“UNM” (unmodiﬁed, sites in KO\nsample). This dataset was also used ind, e. For boxplots inc, d, the upper and lower\nlimits represent the 75th and 25th percentiles, respectively, while the center line\nrepresents the median; upper and lower whiskers indicate ±1.5× the interquartile\nrange (IQR). The number of reads and events aligned to the sites are indicated in\nparentheses.d A comparison of mismatch and deletion frequencies for modiﬁed\nand unmodiﬁed sites in GGACA and GAACA motifs. The number of sites is indicated\nin parentheses.e IGV snapshots of two speciﬁc sites in different motifs (GGACA and\nGAACA). Modiﬁcation status (modiﬁed or unmodiﬁed) was determined by m6A-\nREF-seq. Sites with allele frequency≥0.1 are indicated with corresponding colors.\nCoverage for each site is indicated on the left of each short sequence.\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 7\nRRACH motifs, we divided the m6A sites detected by miCLIP/miCLIP2\ninto six categories according to the site enrichment score quantiﬁed by\nMeRIP-seq. Similar results were observed for most tools, with\nsome exception when using data from the miCLIP as positive control\n(Fig. 6e, f and Supplementary Table 8). In conclusion, m6A sites with\nhigher methylation rates were easier to detect than those with lower\nmethylation rates.\nIntegrated analyses of multiple tools\nAs presented in the above, it can be difﬁcult to balance precision and\nrecall rates for most individual tools, even under their optimal cut-off\nsettings. For example, Epinano_delta achieved the highest recall rate\n(0.37) but with a very low precision (0.22), whereas m6Anet achieved\nthe best precision (0.42) at the cost of a low recall rate (0.19)\n(Fig. 3a, b). To test whether a combination of multiple tools can\nimprove performance, we intersected the top 5000 m6A sites repor-\nted by the different tools. Though the results of ELIGIS_diff, DRUMMER\nand DiffErr overlapped well with each other (0.6– 0.8), wherein the\noverlap ratio was less than 0.5 for most pairs of other tools (Fig.7a). A\nlow overlap ratio may indicate many false-positives as reported by\nmost tools; alternatively, different tools may capture different sets of\nauthentic m6A sites and the integration of these results could improve\nthe prediction performance. After merging the results reported by ten\ntools, we identiﬁed a total of 112,885 m6A sites. However, 54.98%\n(62,060) of the m6A sites were supported by only one tool, and only\n6.66% (7523) of m6A sites were supported by more than half of the\ntools (Fig. 7b). Strikingly, only 251 (0.22%) of the m6A sites were\nidentiﬁed by all of the tools (Fig.7b). We then compared the precision,\na\n0.00\n0.25\n0.50\n0.75\n1.00\n(0,1] (n = 175,575)\nSite enrichment\nMethyla/g415on rate by T ombo\n(1,2] (n = 40,642)(2,3] (n = 15,821)(3,4] (n = 10,135)(4,5] (n = 7,009)(5,6] (n = 5,252)>6 (n = 18,292)\n(0,1] (n = 173,692)\nSite enrichment\n(1,2] (n = 40,202)(2,3] (n = 15,651)(3,4] (n = 10,045)(4,5] (n = 6,929)(5,6] (n = 5,195)>6 (n = 18,104)\n0.00\n0.25\n0.50\n0.75\n1.00Methyla/g415on rate by T ombo_com\n0.00\n0.25\n0.50\n0.75\n1.00\n(0,1] (n = 173,448)\nSite enrichment\nMethyla/g415on rate by Nanom6A\n(1,2] (n = 41,507)(2,3] (n = 16,483)(3,4] (n = 10,702)(4,5] (n = 7,519)(5,6] (n = 5,707)>6 (n = 20,316)\n0.00\n0.25\n0.50\n0.75\n1.00\n(0,1] (n = 25,854)\nSite enrichment\nMethyla/g415on rate by xPore\n(1,2] (n = 6,517)(2,3] (n = 2,807)(3,4] (n = 1,927)(4,5] (n =1,456)(5,6] (n = 1,138)>6 (n = 4,650)\nb\nMethyla/g415on rate\nMethyla/g415on rate Density\nPearson’s\n0.21\nn = 1,743\n0.36\nn = 1,741\n0.45\nn = 1,740\n0.57\nn = 530\n0.62\nn = 275,003\n0.21\nn = 245,610\n0.43\nn = 43,727\n0.34\nn = 243,035\n0.58\nn = 43,728\n0.65\nn = 42,420\n0\n1\n0\n1\n0\n1\n0\n1\n01 01 01 01 01\nm6A-REF-seqTomboTombo_comNanom6AxPore\nm6A-REF-seq Tombo Tombo_com Nanom6A xPore\nc\n-0.2\n0\n0.2\n0.4\n0.6\n0.8\nGGACTAGACTGAACAGGACCRRACHAGACAGAACTAGACCGAACCGGACAAAACTAAACAAAACC\nPearson’s\nTombo - Nanom6A\nd\n0\n0.2\n0.4\n0.6\n0.8 Coverage <= 20 Coverage > 20 All\nPearson’s\nTombo-\nTombo_com\nTombo-\nNanom6A\nTombo-xPore Tombo_com-Nanom6ATombo_com-xPore Nanom6AxPore\nFig. 5 | Performance of Tombo/Tombo_com, Nanom6A and xPore for m6A\nquantiﬁcation. aThe distribution of methylation rates determined by each of the\nthree tools. m6A sites are classiﬁed into categories according to enrichment scores\nderived from MeRIP-seq. Violin plots show the distribution of detected methylation\nrates. In the boxplots, the lower and upper limits represent the 25th and 75th\npercentiles, respectively; the center line represents the median; and upper and\nlower whiskers indicate ±1.5×IQR. The number of sites occurring in each peak\ncategory are indicated in parentheses.b Correlations of methylation rates derived\nfrom m6A-REF-seq and those from each of the three tools. Pearson correlation\ncoefﬁcients and the number of sites for each paired comparison are indicated at the\ntop-right, with 2D-density plots of the methylation rates at the lower-left. The four\ndensity plots on the diagonal show the distribution of methylation rates in the m6A-\nREF-seq results and those of each tool.c Correlation coefﬁcients of methylation\nrates derived from Tombo and that from Nanom6A. m6A sites in different motifs\nare separately calculated.d Correlation coefﬁcients of methylation rates derived\nfrom paired tools. m6A sites with different sequencing coverage are separately\ncalculated.\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 8\nrecall and F1 scores of the integrated predictions to that of the same\nnumber of top m6A sites from each individual tool and found that the\nintegrated predictions achieved a better performance in terms of\nprecision, recall rate and F1 score (Fig.7c). Moreover, using m6A sites\nsupported by more than 4 or 5 tools achieved the highest F1 score\n(Fig. 7c), thus highlighting the effectiveness of integrating the pre-\ndictions from multiple tools.\nConsidering that TGS-based methods or NGS-based methods for\nm6A proﬁling may have their own superiorities and limitations, we\ncompared the m6A sites detected by TGS (obtained by merging the\nm6A sites from ten ONT tools) to those detected by NGS (obtained by\nmerging the m6A sites from miCLIP and miCLIP2). Even though the\nnumber of m6A sites from all ONT tools totaled 112,885, only 51.20%\n(19,239/37,577) of these sites that were detected by the NGS methods\ncould be recalled (Fig.7d). We further investigated the m6A sites\ndetected by the NGS methods but were not recalled by any of the ONT\ntools and found that 15.51% were located in intergenic regions and\n40.51% were covered by less thanﬁve ONT reads (Fig. 7d). After\nremoving the intergenic and low-coverage sites, we re-analyzed the\nnon-recall rates for sites with various sequence motifs, and found that\nm6A sites within the GGACT motifs exhibited a recall rate of more than\n0.9 while AAACC and AAACA motifs exhibited recall rates of 0.3\n(Fig.7e). Since only a small proportion (19,239/112,885) of merged sites\nwere supported by NGS methods, we investigated the characteristics\nof the remaining sites. These sites showed a clearer enrichment around\nthe stop codons when supported by more ONT tools (Fig.7f), while the\noverlap ratio of the m6A sites that were detected in mESCs KO samples\ndecreased (Supplementary Fig. 13f). This implies that the NGS method\nfailed to detect some of authentic m6A sites that were captured by the\nONT tools.\nDiscussion\nWith the development of NGS-based m6A detection methods, our\nunderstanding of the biological role of m6A has advanced con-\nsiderably. However, such methods have inherent limitations.\nRecently, ONT DRS has emerged as a promising alternative method\nof detecting RNA modiﬁcations. To date, approximately ten com-\nputational tools have been developed. With the goal of comprehen-\nsively evaluating the performance of these tools, we conducted a\ncomparative analysis of each tool’s detection capabilities, thereby\nproviding a guide for future studies using ONT DRS. Our analysis\nrevealed a variable performance when evaluated using the ROC and\nPR curves as continuous metrics, with which m6Anet and Epinano_-\ndelta performed the best in the single-mode tools and compare-\nmode tools, respectively. Moreover, a similar ranking was observed\nwhen using different validation datasets or the union and intersec-\ntion sets. We then applied these tools to the detected m6A sites\nunder a cut-off which correlated to the highest F1 score and found\nthat it was still challenging to balance precision and recall rates for\nsome tools. For example, m6Anet, xPore and Nanocompore achieved\nthe highest precision at the cost of lowest recall, while Tombo and\nTombo_com achieved the opposite. Nevertheless, integrated pre-\ndictions from all tools achieved better performance than individual\ntools, especially when using m6A sites which were supported by\nmultiple tools (>4). As for quantitation, methylation rates reported\nby Tombo/Tombo_com, Nanom6A and xPore showed positive cor-\nrelation to the enrichment score determined by MeRIP-seq, but were\npoorly agreed across ONT tools or with the methylation rates quan-\ntiﬁed by m6A-REF-seq. Taken together, there is still room for\nimprovement in the algorithms for the identiﬁcation and quantiﬁ-\ncation of RNA modiﬁcations from ONT DRS datasets.\nab\ndf\n0\n0.2\n0.4\n0.6\n0.8Rate by ELIGOS\nRecall Precision\n0\n0.2\n0.4\n0.6Rate by Tombo_com\n5-10 10-20 20-40 40-60 60-80 80-100>=100\nCoverage\n0\n1\n2\n3\n4\n0-0.2 0.2-0.4 0.4-0.6 0.6-0.8 0.8-1\nRela/g415ve recall\nMethyla/g415on rate\nTombo MINES Nanom6A m6Anet\nELIGOS Epinano Tombo_com Nanocompore\nxPore DiﬀErr DRUMMER ELIGOS_diﬀ\nEpinano_delta\n0\n0.4\n0.8\n1.2\n1.6\n0-1 1-2 2-3 3-4 4-5 5-6 >6\nRela/g415ve recall\nSite enrichment\nTombo MINES Nanom6A m6Anet\nELIGOS Epinano Tombo_com Nanocompore\nxPore DiﬀErr DRUMMER ELIGOS_diﬀ\nEpinano_delta\ne\n0\n0.5\n1\n1.5\n2\n0-1 1-2 2-3 3-4 4-5 5-6\nRela/g415ve recall\nSite enrichment\nTombo MINES Nanom6A m6Anet\nELIGOS Epinano Tombo_com Nanocompore\nxPore DiﬀErr DRUMMER ELIGOS_diﬀ\nEpinano_delta\nc\n0\n1\n2\n3\n4\n5-10 10-20 20-40 40-60 60-80 80-100 >=100\nRela/g415ve recall\nCoverage\nTombo MINES Nanom6A m6Anet\nELIGOS Epinano Tombo_com Nanocompore\nxPore DiﬀErr DRUMMER ELIGOS_diﬀ\nEpinano_delta\n0\n1\n2\n3\n4\n5-10 10-20 20-40 40-60 60-80 80-100 >=100\nRela/g415ve precision\nCoverage\nTombo MINES Nanom6A m6Anet\nELIGOS Epinano Tombo_com Nanocompore\nxPore DiﬀErr DRUMMER ELIGOS_diﬀ\nEpinano_delta\nFig. 6 | Detection sensitivity for m6A sites varies under different coverage and\nstoichiometry. a, b Relative recall rates (a) and precision (b) for m6A sites under\ndifferent coverage. Relative recall rates/precision were calculated as the ratio of the\nrecall rate/precision for m6A sites with a given coverage to the overall mean (across\nall sites). The validation set was derived from the miCLIP results. The same vali-\ndation set is also used inc. c Recall rates and precision of ELIGOS and Tombo_com\nfor m6A detection under different sequencing coverage.d– f Relative recall rates\nfor m6A sites with different methylation rate/site enrichment. Relative recall rates\nwere calculated as the ratio of the recall rate for m6A sites with a given methylation\nrate/site enrichment to the overall mean (across all sites). The validation sets were\nderived from the m6A-REF-seq (d), miCLIP (e)a n dm i C L I P 2(f)r e s u l t s .\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 9\nThere are two main challenges that need to be addressed. The\nﬁrst challenge relates to the variance in electric current intensity\nobserved during repeated sequencing of the same 5-mer motif,\nwhich is determined by the capability of ONT platform. Given that\nthe presence of m6A corresponds to small differences in current\nintensity, large amounts of background variation could render A\nand m6A indistinguishable\n37. The second challenge relates to the\ndata used to train machine learning models 38.O n ec o m m o n\nmethod to generate positive samples involves in vitro transcription\nwith dm6ATP instead of dATP; however, the distribution of m6A on\nthis artiﬁcial RNA may differ greatly from that found on a natural\nRNA. In addition, models trained on the DRS data containing\norganism-speciﬁc site information would have an inherent\nsequence bias. We believe synthetic positive samples with m6A\nsites located in predetermined locations with various motifs would\nbe more appropriate\n39.\nWe observed varying degrees of intrinsic bias towards some\nspeciﬁc sites in various tools. Beneﬁted from the use of nearly m6A-\nfree negative control, compared-mode tools generally performed\nbetter than single-mode tools. Analogously, introducing a negative\ncontrol (mESCMettl3 KO samples) as an extra calibrator effectively\nimproved the precision of single-mode tools, although negative con-\ntrol sample with residual m6A confounded the analysis. However, it is\nrelatively complicated to knockoutMettl3 in most cell types\n36,40,41 with\nsome m6A sites having been shown to be Mettl3-independent42,\nthereby making it virtually impossible to generate an ideal negative\ncontrol from a natural sample. Recently, we used a transcriptome-wide\nmodiﬁcation-free RNA library synthesized through in vitro transcrip-\ntion (IVT) to systematically calibrate epitranscriptomic maps proﬁled\nby NGS based methods\n16. In the detection of RNA modiﬁcations via\nONT DRS, this IVT RNA library holds great promise to serve as a gold\nstandard negative control in the future.\na\nb\nSites detected by ONT (n = 112,885) \n1 tool (62,060, 54.98%)\n2 tools (23,242, 20.59%)\n3 tools (9,375, 8.30%)\n4 tools (5,150, 4.56%)\n5 tools (3,185, 2.82%)\n6 tools (2,350, 2.08%)\n7 tools (1,815, 1.61%)\n8 tools (1,516, 1.34%)\n9 tools (1,181, 1.05%)\n10 tools (1,039, 0.92%)\n11 tools (967, 0.86%)\n12 tools (754, 0.67%)\n13 tools (251, 0.22%)\nSites supported by\nd\nNot annotated\n(2,845, 15.51%)\nCoverage < 5\n(7,676, 41.86%)\nCoverage >= 5\n(7,817, 42.63%)\nSites only detected\nby ONT\n93,646\n19,239\n51.20%\n18,338\n48.80%\nSites only detected\nby miCLIP/miCLIP2\ne\nT ombo\nMINES\nNanom6A\nm6Anet\nELIGOS\nEpinano\nT ombo_com\nNanocompore\nxPore\nDiﬀErr\nDRUMMER\nELIGOS_diﬀ\nEpinano_delta\nTo\nbmo\nSENI\nM\nA6monaN\ntenA6m\nSOGILE\nonanipE T\nmoc_obmo\neropmoconaN\neroPx\nrrEﬀiD DR\nRE\nM\nMU\nﬀid_SOGILE\natled_onanipE\nOverlap ra/g415o00 . 5 1\nc\nTombo MINES Nanom6A\nm6Anet\nTombo_com\nDiﬀErr\nEpinano_delta\n0\n1\n2\n3\nStart−codon Stop−codon\nDensity\n1 tool (n = 57,506)\n2 tools (n = 20,486)\n3 tools (n = 7,382)\n4 tools (n = 3,442)\n5−6 tools (n = 2,737)\n7−9 tools (n = 1,474)\n10−13 tools (n = 619)\nSites not detected by NGS-based \nmethods but supported by N ONT tools\n0\n0.2\n0.4\n0.6\n0.8\n1\nAAACC\nAAACA\nGAACA\nAGACC\nGAACC\nAAACT\nGAACT\nAGACA\nRRACH\nGGACC\nAGACT\nGGACA\nGGACT\nRecall\nf\n0\n0.1\n0.2\n0.3\n0.4\n0.5F1 score\nELIGOS Epinano\nNanocompore xPore\nDRUMMER ELIGOS_diﬀ\nIntegrated predic/g415on\n13\n0\n0.2\n0.4\n0.6\n0.8\n123456789 1 0 1 1 1 2 1\nSupported by >=N tools\nPrecision\n0\n0.2\n0.4\n0.6\n0.8\n1\n123456789 1 0 1 1 1 2 1 3\nRecall\nSupported by >=N tools\nFig. 7 | Assessment of m6A detection by integrating results from all tools.\na Recurrent sites ratio among top 5000 m6A sites detected by ONT tools. Heatmap\nshows the percentage of sites simultaneously detected by each pair of tools.\nb Percentage of sites identiﬁed by multiple tools.c Precision, recall rate and\nF1 scores of sites supported by more thanN tools versus identical number of top\nsites from individual tool. The validation set was derived from the miCLIP results.\nd Merged sites detected across all tools and percentage of these sites found in the\nmiCLIP/miCLIP2 results (left). Non-recalled sites were classiﬁed according to cov-\nerage (right).e Recall rates for m6A sites located in different motifs, using the\nmerged sites detected across all tools after removing intergenic and low-coverage\nm6A sites.f Metagene plots of the transcriptome-wide distribution of m6A sites\nthat could not be detected by NGS-based methods but supported by one or more\nONT tools.\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 10\nUnexpectedly, all tools displayed very divergent recall rates and\nprecision in different motifs. After excluding poorly sequenced reads\nand intronic or intergenic m6A sites, approximately 70% of the m6A\nsites detected by miCLIP/miCLIP2 were recalled from the merged m6A\nsites. High recall rates of up to 90% were seen in GGACT motifs, whereas\nlower rates of 20% were observed in AAACC motifs. Minor current dif-\nferentials between modiﬁed and unmodiﬁed A’s in some motifs may\ninduce false-negative results. To overcome this bottleneck, chemical\ndecorations would assist in making m6A more distinguishable from\nunmodiﬁed A when traversing the nanopore. Similar methods have\nbeen developed to detect inosine using the nanopore sequencing\n43.\nHere we represent theﬁrst comprehensive comparison of com-\nputational tools focused on detecting m6A in the ONT DRS dataset.\nRational oligo models and well-established BS-seq data have already\nbeen applied to the benchmarking of 5mC detection by nanopore\nsequencing\n44,45. However, there is no gold-standard method for m6A\ndetection with both single-base resolution and stoichiometric infor-\nmation on the NGS platform. Therefore, we conducted MeRIP-seq on\nthe same samples used in the ONT sequencing and employed pub-\nl i s h e dm 6 As e t sa si d e n t iﬁed by miCLIP, miCLIP2 and m6A-REF-seq.\nThough the value of evaluation metrics (ROC AUC, PR AUC, precision,\nrecall, F1 score) given in this study may not reﬂect the performance of\nthese tools completely and may be underestimated due to the low\nsequencing depth of DRS data, the comparison between tools would\nbe informative. Moreover, most of ourﬁndings still hold when using\ndifferent validation sets. In addition, we further observed that a pro-\nportion of m6A sites which were consistently captured by ONT tools\nwere likely to be authentic, but were not detected by previous NGS-\nbased methods. In conclusion, we provide a comprehensive compar-\nison of computational tools commonly used in m6A mapping\ndepending on the ONT DRS platform. Comparative information on the\ndetection capability, intrinsic bias and motif preferences between the\ndifferent tools provide valuable insights for the development of new\ndetection strategies and algorithms in future.\nMethods\nSample collection\nThe WT andMettl3 KO mESCs were validated in a previous study46.\nBrieﬂy, exons 5– 7o fMettl3 were replaced with puromycin and hygro-\nmycin resistance genes using CRISPR– Cas9 system. After selecting with\n1 μg/ml puromycin (Gibco, A1113802) and 200μg/ml hygromycin B\n(Sigma, V900372) for one week, diallelic KO colonies were cultured and\nveriﬁed by western blotting (see results in Liu et al.46). After extracting\ntotal RNA from the samples using TRIzol (Thermo Fisher Scientiﬁc,\n15596026), mRNA was isolated via a Dynabeads mRNA Puriﬁcation Kit\n(Thermo Fisher Scientiﬁc, 61006) with genomic DNA removal using\nTuRBO DNase kit (Thermo Fisher, AM2238).\nNanopore direct RNA sequencing and data preprocessing\nNanopore direct RNA sequencing was conducted following instructions\nprovided by Oxford Nanopore Technologies (Oxford, UK) using DRS\nkits (SQK-RNA002) and MinIONﬂowcells (FLO-MIN106D, R9.4.1 pore).\nAfter live basecalling using Guppy (v4.0.11) in MinKNOW, reads that\npassed the quality threshold (7) were then subjected to post-run\nbasecalling with the latest version of Guppy (v5.0.7) under default\nparameters. A reference transcriptomeﬁle was generated from the\nmouse genome reference and corresponding annotation (GENCO-\nDE.VM18) using convert2bed (v2.4.38) and bedtools (v2.26.0). The\nresulting FASTQ ﬁles were aligned to the mouse reference tran-\nscriptome using Minimap2 (v2.17) with parameter settings“-ax map-ont\n--MD”. Samtools (v1.6) was used toﬁlter secondary and supplementary\nalignments and convert aligned reads to the bam format. Public data-\nsets were preprocessed in the same way except thatArabidopsissam-\nples were aligned to the reference transcriptome generated from\nTAIR10 reference genome with Araport11 reference annotation.\nNGS-based validation sets\nThe raw MeRIP-seq data was downloaded from Zhang et al. 16\n(GSE151028). After quality control, clean reads were aligned to the\nmouse genome referenceﬁle (GRCm38/mm10) with HISAT2 (v2.1.0)\nfor peak calling using MACS2 (v2.1.2) (callpeak --keep-dup all -g mm\n--nomodel --extsize 200 -q 0.0001 --fe-cut-off 2). High conﬁdence\npeaks were obtained byﬁrst merging peaks from two WT replicates\nand then subtracting peaks identiﬁed in both KO replicates. Only peaks\ncontaining RRACH motif were retained since most ONT tools were\nlimited to this motif. Sites detected by ONT tools would be considered\nas true positives when they were found to be located in the peaks from\nMeRIP-seq. When using public miCLIP\n34,m i C L I P 235 and m6A-REF-seq12\ndatasets, m6A sites only in the RRACH motifs were kept. m6A proﬁles\nderived from miCLIP and miCLIP2 results were two main validation\nsets for all analysis. MeRIP-seq results were also used to compare tools\nwith continuous evaluation metrics. When using MeRIP-seq data as\nevaluation set, we roughly considered all sites falling in the peaks as\ntrue positives. m6A-REF-seq results provided reference modiﬁcation\nrate in the quantiﬁcation part. As for the validation sets forArabidopsis,\nwe also ﬁltered sites not containing RRACH motifs from the public\nMeRIP-seq\n47 and miCLIP28 datasets.\nm6A detection with multiple tools\nWe ran the tools with parameter settings described as follows, and the\ndetailed command and code are available at https://github.com/\nzhongzhd/ont_m6a_detection\n48.\nTombo (v1.5.1) needs to re-squiggle reads to assign raw current\nsignals to each base before further processing can be carried out.\nTombo now provides two methods for m6A detection: (1) a de novo\nnon-canonical base method with the command“detect_modiﬁcations\nde_novo” (represented by Tombo); and (2) a canonical sample com-\nparison method with the command “detect_modiﬁcations mod-\nel_sample_compare” (represented by Tombo_com). Theﬁrst approach\nwas used for routine analysis of single samples, while the second\napproach was used to combine analyses for negative control samples.\nSeveral statistics were obtained from Tombo, including the coverage\nand estimated fraction-modiﬁed values, and the latter were treated as\nscores for ranking.\nMINES uses coverage and fraction-modiﬁed values calculated by\nTombo as input to its random forest models (only for AGACT and\nGGACH motifs) and only reports signiﬁcant sites. Therefore, we\nmodiﬁe dt h ec o d et oo u t p u tt h em o d iﬁcation probability of all sites in\nall RRACH motifs. The modiﬁcation probabilities of sites were treated\nas scores for ranking. The modiﬁed version is available athttps://\ngithub.com/zhongzhd/ont_m6a_detection\n48.\nNanom6A (v2.0) extracts the median, mean, standard deviation\nand dwell time from normalized raw signals for each read after re-\nsquiggling with Tombo. The above features are then used as input for\nits XGBoost model which assigns a modiﬁcation probability for each\nread. Reads with a modiﬁcation probability >0.5 were considered\nmodiﬁed, and the modiﬁed fraction of sites were treated as scores for\nranking.\nm6Anet (v1.0) requires the results generated from running the\neventalign module in Nanopolish (0.13.2), which assigns raw current\nsignal to each base (like Tombo). The results are used as input to the\nm6Anet’s neural-network based Multiple Instance Learning model\nwhich produces probability-modiﬁed values per site. The probability-\nmodiﬁed values corresponding to each site were treated as scores for\nranking.\nNanocompore(v1.0.0) collapses the results from the Nanopolish\neventalign module to generate aﬁle containing the median intensity\nand dwell time; it also makes pairwise comparisons to the collapsed\nresults from a control sample. The Gaussian mixture model (GMM)\nlogitp values from statistical test results of sites were treated as scores\nfor ranking. Note that this tool outputs many sites with“nan” value due\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 11\nto failure in clustering, so sites with the“nan” values were assigned ap\nvalue of 1.\nxPore (v2.0) also uses the results from the Nanopolish eventalign\nmodule for all samples to make a conﬁguration ﬁle, and applies the\nmulti-sample two-Gaussian mixture model to obtain the estimated\nmodiﬁcation rate for each sample, a test statistic (z score) andp value\non differential modiﬁcation rates for each pairwise condition. Thez\nscores from statistical test results were treated as scores for ranking (as\nrecommended by the authors). Similar to Nanocompore, this tool\nomitted many sites in its result due to failure in clustering, so we\nassigned az score of 0 to these sites. Sites with modiﬁed distributions\nof current assigned in the opposite direction, were assigned az score\nof 0 according to xPore’s methods. In addition, sites with higher\nmethylation rate in KO than WT were also assigned az score of 0.\nDiffErr (v0.2) uses alignmentﬁles with a control as input. The\n−log10 p values from statistical test results of sites were treated as\nscores for ranking, and sitesﬁltered internally or with odds ratio (log)\n≤0w e r ea s s i g n e da−log10 p value of 0.\nDRUMMERalso uses alignmentﬁles for the sample and a control\nas input. Thep values (odds ratio) from statistical test results of sites\nwere treated as scores for ranking, and sitesﬁltered internally or with\nodds ratio≤1w e r ea s s i g n e dap value of 1.\nELIGOS(v2.0.1) offers two methods for the detection of modiﬁed\nnucleotides: (1) the identiﬁcation of RNA modiﬁcations compared to a\nrBEM5 + 2 model using“rna_mod” (represented by ELIGOS); and (2) the\nidentiﬁcation of RNA modiﬁcations compared to control conditions\nusing “pair_diff_mod” (represented by ELIGOS_diff). Theﬁrst method\nwas used for routine analyses of single samples, while the second was\nimplemented for combined analyses including negative control sam-\nples. Thep values (odds ratio) from statistical test results of sites were\ntreated as scores for ranking, and sitesﬁltered internally or with odds\nratio ≤1 were assigned ap value of 1.\nEpinano (v1.2.0) offers two kinds of Support Vector Machine\nmodels for m6A detection. These models have different features: (1)\nthe mean quality, and mismatch, insertion and deletion frequency of\neach base (represented by Epinano); and (2) the difference in mean\nquality, and in the mismatch, insertion and deletion frequency\nbetween the sample and a control for each base (represented by Epi-\nnano_delta). Theﬁrst method was used by default and the second\nwhen comparing to a negative control. The probability-modiﬁed from\npredicted results were treated as scores for ranking.\nTools comparison using ROC and PR curves\nSites in RRACH motif with more than 5 reads (except for m6Anet that\nrequired at least 20 reads) were tested by each tool and ranked\naccording to the signiﬁcant score as described above. We then con-\nverted the transcriptome coordinates to the genomic coordinates to\nmatch with the validation sets. Sites derived from multiple tran-\nscriptomic coordinates but aligned to the same genomic coordinate\nwere merged as follows: for Tombo/Tombo_com, MINES, Nanom6A,\nm6Anet and Epinano/Epinano_delta, the scores (fraction-modiﬁed/\nprobability-modiﬁed) were weighted averaging according coverage;\nfor Nanocompore, xPore, DiffErr, DRUMMER and ELIGOS, the best\nscores (p value/z score) were selected as representative. To objectively\ncompare the tools, we only kept the sites that were covered by all\nmethods and with a coverage≥20 in theﬁnal dataset for evaluation\nusing the ROC and PR curve. MeRIP-seq, miCLIP and miCLIP2 results\nmentioned above were applied as ground truth, and we also used the\nvalidation sets in the form of union and intersection of all the NGS-\nbased methods. As forArabidopsis, MeRIPseq and miCLIP results and\ntheir union and intersection were used as the validation sets.\nm6A determination with optimal cut-off\nTo determine the optimal cut-off for m6A detection, we varied the cut-\noffs and calculated F1 scores of sites in the RRACH motif covered by at\nleast 5 reads using the MeRIP-seq, miCLIP and miCLIP2 results as\nvalidation sets separately (note that m6Anet requires at least 20 reads\nand MINES only outputresults in 4 motifs).\nF1 score =\n2×p r e c i s i o n×r e c a l l\nprecision + recall\nAs the distribution of F1 scores were inconsistent between the\nvalidation set from MeRIP-seq and miCLIP/miCLIP2, we selected the\ncut-off corresponded to the maximum F1 score when adding up that of\nmiCLIP and miCLIP2 for following m6A detection process. Validation\nsets of miCLIP and miCLIP2 were used for the following precision and\nrecall calculation. Note that in evaluating the performance of these\nm6A detection tools, we only considered sites detected by NGS\nmethods (MeRIP-seq, miCLIP and miCLIP2) that were covered by\nminimal DRS reads (5, 20, 50 DRS reads requirement). When setting\nthe requirement at 5 DRS reads, we also took into consideration sites\nomitted by m6Anet (<20 reads) and MINES (not in four speciﬁcm o t i f )\nand treated them with the lowest score for recall calculation. m6A sites\ndetected under 5 DRS reads requirement were used for further\nanalysis.\nIntrinsic bias assessment\nS i t e si nt h eR R A C Hm o t i fw i t hm i n i m u m5r e a d s( t h ep o o l )i nMettl3KO\nsamples were tested by each tool and determined as m6A using the\noptimal cut-off described above.We then randomly sampled an iden-\ntical number of sites (== the number of m6A sites detected in KO\nsamples) from the pool as the random dataset for each tool. To test\nwhether these tools prefer some irrelevant m6A sites (intrinsic bias), we\ncompared two intersection“WT&KO” (m6A sites detected in WT and\nKO samples) and“WT&Random” (m6A sites detected in WT samples\nand existed in random dataset). If there were certain intrinsic bias, the\nWT&KO intersection should be greater than WT&Random intersection;\nwe applied one-side Hypergeometric tests to calculate the signiﬁcance.\nTo determine for the causeof the intrinsic bias, the input data of MeRIP-\nseq were used to call SNPs/indels compared to mm10 reference using\nbcftools with the key parameter“QUAL > 100”, and SNPs/indels were\nkept when supported by more than 2 of 4 samples (WT and KO with\nreplicates). In addition, theﬂanking sequence (upstream and down-\nstream 10 bp) of all candidate siteswere extracted and inspected for\nhomopolymer. We then compared the ratio of sites near SNPs/indels\n(within 5 bp) or homopolymer between the“WT&KO” intersection and\nsites in the RRACH motif with more than 5 reads (background) and\napplied one-sided Binomial tests to calculate signiﬁcance.\nComparisons of current intensities and base-calling“errors”\nbetween modiﬁed and unmodiﬁed 5-mer\nNanopolish eventalign was used to assign raw current to each base in\nthe reference genome. The results of sam2tsv pileup (v0558422) were\nused to calculate the frequency of mismatch, deletion and insertion\nand base quality. Highly-methylated m6A sites in GGACA and GAACA\nmotifs with a methylation rate differences >0.8 between WT and KO\nsamples as determined by m6A-REF-seq, were selected. The current\nintensities and base-calling“errors” of these sites extracted from WT\nsamples were treated as current intensities and base-calling“errors” of\nmodiﬁed 5-mer, while these extracted from KO samples were treated\nas current intensities and base-calling“errors” of unmodiﬁed 5-mer.\nWe compared the current intensities and base-calling“errors” between\nmodiﬁed and unmodiﬁed 5-mer for both GGACA and GAACA motifs.\nm6A quantiﬁcation\nTombo/Tombo_com and Nanom6A detect m6A at read level and\nsupport methylation rates calculation. Sites in the RRACH motif with\nmore than 5 reads were calculated. xPore outputs methylation rates\ndirectly in its result and tests the difference of methylation rates\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 12\nbetween WT and KO samples, so we used the methylation rates of WT\nsamples for all sites in the RRACH motif with more than 5 reads except\nfor sites which failed to cluster. Methylation rates from the m6A-REF-\nseq results were used for comparison. We also calculated the enrich-\nment score for these sites using the MeRIP-seq data (IP FPKM/Input\nFPKM) with featureCounts (v2.0.1) for comparison.\nReporting summary\nFurther information on research design is available in the Nature\nPortfolio Reporting Summary linked to this article.\nData availability\nAll data generated for this paper have been deposited in the NCBI Gene\nExpression Omnibus (GEO) database under accession number\nGSE195618. Published DRS datasets derived from WT andMettl3 KO\nmESC samples are obtained from the work of Jenjaroenpun et al.\n30 and\nare available through NCBI Sequence Read Archive (SRA) database\nunder accession number SRP166020. Published Arabidopsis DRS\ndatasets along with their KO variants are form Parker et al.\n28 and are\navailable through European Nucleotide Archive (ENA) database under\naccession numberPRJEB32782.\nCode availability\nThe analysis pipeline and all custom scripts used for this paper are\navailable athttps://github.com/zhongzhd/ont_m6a_detection48.\nReferences\n1. Boccaletto, P. et al. MODOMICS: a database of RNA modiﬁcation\npathways. 2021 update.Nucleic Acids Res.50,D 2 3 1–D235 (2022).\n2. Roundtree, I. A., Evans, M. E., Pan, T. & He, C. Dynamic RNA mod-\niﬁcations in gene expression regulation.Cell 169, 1187–1200 (2017).\n3. Zaccara, S., Ries, R. J. & Jaffrey, S. R. Reading, writing and erasing\nmRNA methylation.Nat Rev Mol Cell Biol.20,6 0 8–624 (2019).\n4. Jia, G. et al. N6-methyladenosine in nuclear RNA is a major substrate\nof the obesity-associated FTO.Nat. Chem. Biol.7,8 8 5–887 (2011).\n5. Yang, Y., Hsu, P. J., Chen, Y. S. & Yang, Y. G. Dynamic transcriptomic\nm(6)A decoration: writers, erasers, readers and functions in RNA\nmetabolism.Cell Res.28,6 1 6–624 (2018).\n6. Yu,Q.etal.RNAdemethylationincreasestheyieldandbiomassofrice\nand potato plants inﬁeld trials.Nat. Biotechnol.39,1 5 8 1–1588 (2021).\n7. Jiang, X. et al. The role of m6A modiﬁcation in the biological\nfunctions and diseases.Signal Transduct. Target. Ther.6, 74 (2021).\n8. Tang, Y. et al. m6A-Atlas: a comprehensive knowledgebase for\nunraveling the N6-methyladenosine (m6A) epitranscriptome.\nNucleic Acids Res.49,D 1 3 4–D143 (2021).\n9. Meyer, K. D. et al. Comprehensive analysis of mRNA methylation\nreveals enrichment in 3′ UTRs and near stop codons.Cell 149,\n1635–1646 (2012).\n10. Dominissini, D. et al. Topology of the human and mouse m6A RNA\nmethylomes revealed by m6A-seq.Nature 485,2 0 1–206 (2012).\n11. Garcia-Campos, M. A. et al. Deciphering the“m(6)A Code” via\nantibody-independent quantitative proﬁling. Cell. 178,\n731–747 (2019).\n12. Zhang, Z. et al. Single-base mapping of m(6)A by an antibody-\nindependent method.Sci. Adv.5,x 2 5 0( 2 0 1 9 ) .\n13. Meyer, K. D. DART-seq: an antibody-free method for global m(6)A\ndetection.Nat. Methods16,1 2 7 5–1280 (2019).\n14. Helm, M., Lyko, F. & Motorin, Y. Limited antibody speciﬁcity\ncompromises epitranscriptomic analyses.Nat. Commun.10,\n5669 (2019).\n15. McIntyre, A. et al. Limits in the detection of m(6)A changes using\nMeRIP/m(6)A-seq.Sci. Rep.10, 6590 (2020).\n16. Zhang, Z. et al. Systematic calibration of epitranscriptomic maps\nusing a synthetic modiﬁcation-free RNA library.Nat. Methods18,\n1213–1222 (2021).\n17. Amarasinghe, S. L. et al. Opportunities and challenges in long-read\nsequencing data analysis.Genome Biol.21,3 0( 2 0 2 0 ) .\n18. Flusberg, B. A. et al. Direct detection of DNA methylation during\nsingle-molecule, real-time sequencing.Nat. Methods7,\n461–465 (2010).\n19. Simpson, J. T. et al. Detecting DNA cytosine methylation using\nnanopore sequencing.Nat. Methods14,4 0 7–410 (2017).\n20. Garalde, D. R. et al. Highly parallel direct RNA sequencing on an\narray of nanopores.Nat. Methods15,2 0 1–206 (2018).\n21. Stoiber, M. et al. De novo identiﬁcation of DNA modiﬁcations\nenabled by genome-guided nanopore signal processing. Preprint at\nbioRxiv https://doi.org/10.1101/094672,(2017).\n2 2 . L o r e n z ,D .A . ,S a t h e ,S . ,E i n s t e i n ,J .M .&Y e o ,G .W .D i r e c tR N A\nsequencing enables m(6)A detection in endogenous transcript\nisoforms at base-speciﬁc resolution.RNA 26,1 9–28 (2020).\n23. Gao, Y. et al. Quantitative proﬁling of N(6)-methyladenosine at\nsingle-base resolution in stem-differentiating xylem of Populus tri-\nchocarpa using Nanopore direct RNA sequencing.Genome Biol.22,\n22 (2021).\n24. Hendra, C. et al. Detection of m6A from direct RNA sequencing\nusing a multiple instance learning framework.Nat. Methods19,\n1590–1598 (2022).\n25. Leger, A. et al. RNA modiﬁcations detection by comparative\nNanopore direct RNA sequencing.Nat. Commun.12\n, 7198 (2021).\n26. Pratanwanich, P. N. et al. Identiﬁcation of differential RNA mod-\niﬁcations from nanopore direct RNA sequencing with xPore.Nat.\nBiotechnol.39,1 3 9 4–1402 (2021).\n27. Liu, H. et al. Accurate detection of m(6)A RNA modiﬁcations in\nnative RNA sequences.Nat. Commun.10,4 0 7 9( 2 0 1 9 ) .\n28. Parker, M. T. et al. Nanopore direct RNA sequencing maps the\ncomplexity of Arabidopsis mRNA processing and m(6)A modiﬁca-\ntion. ELife 9, e49658 (2020).\n29. Price, A. M. et al. Direct RNA sequencing reveals m(6)A modiﬁca-\ntions on adenovirus RNA are necessary for efﬁcient splicing.Nat.\nCommun. 11, 6016 (2020).\n30. Jenjaroenpun, P. et al. Decoding the epitranscriptional landscape\nfrom native RNA sequences.Nucleic Acids Res.49,e 7( 2 0 2 1 ) .\n31. Watabe, E. et al. m(6) A-mediated alternative splicing coupled with\nnonsense-mediated mRNA decay regulates SAM synthetase\nhomeostasis.EMBO J.40, e106434 (2021).\n32. Wang, Y. et al. Proﬁling of circular RNA N6‐methyladenosine in\nmoso bamboo (Phyllostachys edulis) using nanopore‐based direct\nRNA sequencing.J. Integr. Plant Biol.62,1 8 2 3–1838 (2020).\n33. Wang, Y., Zhao, Y., Bollas, A., Wang, Y. & Au, K. F. Nanopore\nsequencing technology, bioinformatics and applications.Nat. Bio-\ntechnol.39,1 3 4 8–1365 (2021).\n34. Ke, S. et al. m(6)A mRNA modiﬁcations are deposited in nascent\npre-mRNA and are not required for splicing but do specify cyto-\nplasmic turnover.Genes Dev.31, 990–1006 (2017).\n35. Kortel, N. et al. Deep and accurate detection of m6A RNA mod-\niﬁcations using miCLIP2 and m6Aboost machine learning.Nucleic\nAcids Res.49, e92 (2021).\n36. Batista, P. J. et al. m(6)A RNA modiﬁcation controls cell fate tran-\nsition in mammalian embryonic stem cells.Cell Stem Cell.15,\n707–719 (2014).\n37. Begik, O. et al. Quantitative proﬁling of pseudouridylation dynamics\nin native RNAs with nanopore sequencing.Nat. Biotechnol.39,\n1278–1291 (2021).\n38. Alfonzo, J. D. et al. A call for direct sequencing of full-length RNAs to\nidentify all modiﬁcations. Nat. Genet.53, 1113–1116 (2021).\n39. Workman, R. E. et al. Nanopore native RNA sequencing of a human\npoly(A) transcriptome.Nat. Methods16,1 2 9 7–1305 (2019).\n4 0 . P o h ,H .X . ,M i r z a ,A .H . ,P i c k e r i n g ,B .F .&J a f f r e y ,S .R .A l t e r n a t i v e\nsplicing of METTL3 explains apparently METTL3-independent m6A\nmodiﬁcations in mRNA.PLoS Biol.20, e3001683 (2022).\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 13\n41. Lin, Z. et al. Mettl3-/Mettl14-mediated mRNA N(6)-methyladenosine\nmodulates murine spermatogenesis.Cell Res.27,1 2 1 6–1230 (2017).\n42. Satterwhite, E. R. & Mansﬁeld, K. D. RNA methyltransferase\nMETTL16: targets and function.W i l e yI n t e r d i s c i p .R e v .R N A13,\ne1681 (2021).\n43. Ramasamy, S. et al. Chemical probe-based nanopore sequencing\nto selectively assess the RNA modiﬁcations.ACS Chem. Biol.17,\n2704–2709 (2022).\n44. Liu, Y. et al. DNA methylation-calling tools for Oxford Nanopore\nsequencing: a survey and human epigenome-wide evaluation.\nGenome Biol.22, 295 (2021).\n45. Yuen, Z. W. et al. Systematic benchmarking of tools for CpG\nmethylation detection from nanopore sequencing.Nat. Commun.\n12, 3438 (2021).\n46. Liu, J. et al. The RNA m(6)A reader YTHDC1 silences retro-\ntransposons and guards ES cell identity.Nature 591,\n322–326 (2021).\n47. Shen, L. et al. N(6)-methyladenosine RNA modiﬁcation regulates\nshoot stem cell fate in Arabidopsis.Dev. Cell38,1 8 6–200 (2016).\n48. Zhong, Z. et al. Systematic comparison of tools used for m6A\nmapping from nanopore direct RNA sequencing.https://github.\ncom/zhongzhd/ont_m6a_detection, https://doi.org/10.5281/\nzenodo.7651738(2023).\nAcknowledgements\nThis work was supported by the Ministry of Science and Technology of\nChina (National Science and Technology Major Project, 2018YFA0109100,\n2019YFA0802203, 2022YFA0912900, and 2022YFC3400400), National\nNatural Science Foundation of China (92253202, 32271499, 32270644,\nand 32100461), and Shenzhen Bay Scholars Program.\nAuthor contributions\nG.-Z.L. conceived the project; Z.-D.Z. and Y.-Y.X. analyzed the data and\nwrote the manuscript; H.-X.C. conducted the experiments with the\nassistance from X.-H.L., J.-Y.J., Y.-L.L., F.W., L.J., and J.C.; Z.Z., D.W.M.\nand G.-Z.L. revised the manuscript. All authors reviewed the results and\napproved theﬁnal version of the manuscript.\nCompeting interests\nThe authors declare no competing interests.\nAdditional information\nSupplementary informationThe online version contains\nsupplementary material available at\nhttps://doi.org/10.1038/s41467-023-37596-5.\nCorrespondenceand requests for materials should be addressed to\nZhang Zhang or Guan-Zheng Luo.\nPeer review informationNature Communicationsthanks the anon-\nymous reviewers for their contribution to the peer review of this\nwork. Peer reviewer reports are available.\nReprints and permissions informationis available at\nhttp://www.nature.com/reprints\nPublisher’s noteSpringer Nature remains neutral with regard to jur-\nisdictional claims in published maps and institutional afﬁliations.\nOpen AccessThis article is licensed under a Creative Commons\nAttribution 4.0 International License, which permits use, sharing,\nadaptation, distribution and reproduction in any medium or format, as\nlong as you give appropriate credit to the original author(s) and the\nsource, provide a link to the Creative Commons license, and indicate if\nchanges were made. The images or other third party material in this\narticle are included in the article’s Creative Commons license, unless\nindicated otherwise in a credit line to the material. If material is not\nincluded in the article’s Creative Commons license and your intended\nuse is not permitted by statutory regulation or exceeds the permitted\nuse, you will need to obtain permission directly from the copyright\nholder. To view a copy of this license, visithttp://creativecommons.org/\nlicenses/by/4.0/.\n© The Author(s) 2023\nArticle https://doi.org/10.1038/s41467-023-37596-5\nNature Communications|         (2023) 14:1906 14",
  "topic": "Nanopore sequencing",
  "concepts": [
    {
      "name": "Nanopore sequencing",
      "score": 0.7104994058609009
    },
    {
      "name": "Computational biology",
      "score": 0.662299633026123
    },
    {
      "name": "Computer science",
      "score": 0.5672234296798706
    },
    {
      "name": "Biology",
      "score": 0.40637001395225525
    },
    {
      "name": "DNA sequencing",
      "score": 0.4049704074859619
    },
    {
      "name": "Data mining",
      "score": 0.36469823122024536
    },
    {
      "name": "Gene",
      "score": 0.26432016491889954
    },
    {
      "name": "Genetics",
      "score": 0.22499710321426392
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I157773358",
      "name": "Sun Yat-sen University",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I19820366",
      "name": "Chinese Academy of Sciences",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I2802148028",
      "name": "Guangzhou Institutes of Biomedicine and Health",
      "country": "CN"
    },
    {
      "id": "https://openalex.org/I889458895",
      "name": "University of Hong Kong",
      "country": "HK"
    }
  ]
}