{
  "title": "Large language models improve annotation of viral proteins",
  "url": "https://openalex.org/W4367595652",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A2098826340",
      "name": "Libusha Kelly",
      "affiliations": [
        "Albert Einstein College of Medicine"
      ]
    },
    {
      "id": "https://openalex.org/A4285697968",
      "name": "Zachary Flamholz",
      "affiliations": [
        "Albert Einstein College of Medicine"
      ]
    },
    {
      "id": "https://openalex.org/A3022129103",
      "name": "Steven Biller",
      "affiliations": [
        "Wellesley College"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2521169042",
    "https://openalex.org/W2940459311",
    "https://openalex.org/W3111609341",
    "https://openalex.org/W3081166727",
    "https://openalex.org/W3082026969",
    "https://openalex.org/W3176037658",
    "https://openalex.org/W2119859604",
    "https://openalex.org/W2732139758",
    "https://openalex.org/W3003110834",
    "https://openalex.org/W2971941821",
    "https://openalex.org/W3127656915",
    "https://openalex.org/W3033129278",
    "https://openalex.org/W3084775246",
    "https://openalex.org/W3137491981",
    "https://openalex.org/W2595997662",
    "https://openalex.org/W2943223175",
    "https://openalex.org/W3121345102",
    "https://openalex.org/W3189053267",
    "https://openalex.org/W2912735997",
    "https://openalex.org/W1501531009",
    "https://openalex.org/W2995514860",
    "https://openalex.org/W2943495267",
    "https://openalex.org/W3040739508",
    "https://openalex.org/W3165163830",
    "https://openalex.org/W3166142427",
    "https://openalex.org/W2256933318",
    "https://openalex.org/W2164753093",
    "https://openalex.org/W3009723183",
    "https://openalex.org/W4291017722",
    "https://openalex.org/W3014217095",
    "https://openalex.org/W3116526633",
    "https://openalex.org/W4288077875",
    "https://openalex.org/W3161519107",
    "https://openalex.org/W1999140385",
    "https://openalex.org/W1988102426",
    "https://openalex.org/W4200286045",
    "https://openalex.org/W4221042154",
    "https://openalex.org/W3177828909",
    "https://openalex.org/W2735062779",
    "https://openalex.org/W3031591096",
    "https://openalex.org/W2101234009",
    "https://openalex.org/W2750791471",
    "https://openalex.org/W2917828716",
    "https://openalex.org/W2786672974",
    "https://openalex.org/W2132022337",
    "https://openalex.org/W2158714788",
    "https://openalex.org/W3113163651",
    "https://openalex.org/W2774178591",
    "https://openalex.org/W1803102843",
    "https://openalex.org/W2950954328",
    "https://openalex.org/W2160378127",
    "https://openalex.org/W2031611770",
    "https://openalex.org/W3156458251",
    "https://openalex.org/W2811055647",
    "https://openalex.org/W2804822363",
    "https://openalex.org/W2950044547",
    "https://openalex.org/W4245209060",
    "https://openalex.org/W3146944767",
    "https://openalex.org/W4323664308",
    "https://openalex.org/W2997591727",
    "https://openalex.org/W3215102050",
    "https://openalex.org/W4306751335",
    "https://openalex.org/W4366598089",
    "https://openalex.org/W2972411752",
    "https://openalex.org/W2514983714",
    "https://openalex.org/W4287724045",
    "https://openalex.org/W4308616064",
    "https://openalex.org/W2495141184",
    "https://openalex.org/W2990618091",
    "https://openalex.org/W2154714625",
    "https://openalex.org/W3096218861",
    "https://openalex.org/W2004996851",
    "https://openalex.org/W1744825685",
    "https://openalex.org/W4313557758",
    "https://openalex.org/W3170084696",
    "https://openalex.org/W4295426379",
    "https://openalex.org/W3114961285",
    "https://openalex.org/W2918063357",
    "https://openalex.org/W4205773061",
    "https://openalex.org/W3168120530",
    "https://openalex.org/W3041773305",
    "https://openalex.org/W3132890345"
  ],
  "abstract": "Abstract Viral sequences are poorly annotated in environmental samples, a major roadblock to understanding how viruses influence microbial community structure. Current annotation approaches rely on alignment-based sequence homology methods, which are limited by available viral sequences and sequence divergence in viral proteins. Here, we show that protein language model representations capture viral protein function beyond the limits of remote sequence homology by targeting two axes of viral sequence annotation: systematic labeling of protein families and function identification for biologic discovery. Protein language model representations capture protein functional properties specific to viruses and expand the annotated fraction of ocean virome viral protein sequences by 37%. Among unannotated viral protein families, we identify a novel DNA editing protein family that defines a new mobile element in marine picocyanobacteria. Protein language models thus significantly enhance remote homology detection of viral proteins and can be utilized to enable new biological discovery across diverse functional categories.",
  "full_text": "Large language models improve annotation of viral\nproteins\nLibusha Kelly  (  libusha.kelly@einsteinmed.edu )\nAlbert Einstein College of Medicine\nZachary Flamholz \nAlbert Einstein College of Medicine https://orcid.org/0000-0002-0129-8836\nSteven Biller \nWellesley College https://orcid.org/0000-0002-2638-823X\nAnalysis\nKeywords:\nPosted Date: May 2nd, 2023\nDOI: https://doi.org/10.21203/rs.3.rs-2852098/v1\nLicense:   This work is licensed under a Creative Commons Attribution 4.0 International License.  \nRead Full License\nAdditional Declarations: There is NO Competing Interest.\nVersion of Record: A version of this preprint was published at Nature Microbiology on January 29th,\n2024. See the published version at https://doi.org/10.1038/s41564-023-01584-8.\nLarge language models improve annotation of viral proteins1\nZachary N. Flamholz1, Steve J. Biller2, and Libusha Kelly*1,32\n1Department of Systems and Computational Biology , Albert Einstein College of Medicine; Bronx, NY ,3\nUSA4\n2Department of Biological Sciences, Wellesley College; Wellesley , MA USA5\n3Department of Microbiology and Immunology , Albert Einstein College of Medicine; Bronx, NY , USA6\n*Corresponding author. Email: libusha.kelly@einsteinmed.edu7\nAbstract8\nViral sequences are poorly annotated in environmental samples, a major roadblock to understanding how viruses9\ninﬂuence microbial community structure. Current annotation approaches rely on alignment-based sequence ho-10\nmology methods, which are limited by available viral sequences and sequence divergence in viral proteins. Here,11\nwe show that protein language model representations capture viral protein function beyond the limits of remote12\nsequence homology by targeting two axes of viral sequence annotation: systematic labeling of protein families13\nand function identiﬁcation for biologic discovery . Protein language model representations capture protein func-14\ntional properties speciﬁc to viruses and expand the annotated fraction of ocean virome viral protein sequences by15\n37%. Among unannotated viral protein families, we identify a novel DNA editing protein family that deﬁnes a new16\nmobile element in marine picocyanobacteria. Protein language models thus signiﬁcantly enhance remote homol-17\nogy detection of viral proteins and can be utilized to enable new biological discovery across diverse functional18\ncategories.19\nViruses of microbes, hereafter, ’viruses’, are abundant in the environment and have wide-ranging impacts on13\nmicrobial communities. Most of what we know about viral diversity , ecology , and function comes from analysis of14\nsequences obtained from environmental samples, yet viruses are difﬁcult to identify , classify , and annotate. Thus,15\nwe make statements about viral impacts on microbial community structure and function based on a tiny fraction16\nof viral sequences with sufﬁcient similarity to existing references. In recent years, next-generation sequencing17\nand increasing computational resources have been applied to catalogue the world’s virome 1–7 . While there has18\nbeen substantial methodological progress in identifying viral DNA in whole community metagenomic sequence19\ndata 8–16 , sequence feature annotation and overall taxonomic assignment of identiﬁed uncultivated viral genomes20\n(UViGs) has lagged considerably . Viruses have no conserved marker genes to enable broad, uniﬁed, taxonomic21\nanalysis and thus most of the hundreds of thousands of new viruses uncovered in viral catalogue studies remain22\nunclassiﬁed 1–7 . Viral taxonomic classiﬁcation is generally based on using predicted UViG proteins as features23\nfor clustering-based 17–19 or machine learning-based 20 taxonomic classiﬁcation. Y et, as many as 86% of envi-24\nronmental viral protein clusters match uncharacterized protein families or have no hits at all 6,7,16,21,22. Improved25\nannotation of viral protein families ( VPFs) is thus a necessary , unrealized, step towards understanding the roles26\nof viruses in microbial ecology .27\n28\nViral protein annotation currently relies on sequence homology using state-of-the-art proﬁle Hidden Markov Model29\n(pHMM)-based approaches. For viral metagenomics, sequence homology methods suffer from two fundamental30\nlimitations: (1) the limited library of annotated viral protein sequences from which to construct probabilistic se-31\nquence models and (2) the rate at which viral proteins change, quickly diverging beyond recognition by traditional32\nsequence homology metrics. An alignment-free method that does not depend on constructing sequence proﬁles33\nfor statistical sequence homology and that can leverage functional homology between proteins could overcome34\nboth challenges.35\n36\nAdvances in the ﬁeld of natural language processing have increasingly been utilized to identify viral sequences37\nin whole community sequencing data, including k-mer frequency 9,11 and learned vector representation 10,16,23,2438\nmethods. In natural language processing, current state-of-the-art large language models are trained in an unsu-39\npervised manner on gigantic corpora of text. Recently , this approach has been used to train protein language40\nmodels (PLMs) on billions of protein sequences to learn real number vector representations of amino acids. PLMs41\ncapture physico-chemical properties of amino acids and can resolve protein structural and functional information42\nfrom sequence input alone 25–30 . Unlike sequence, structure and function of viral proteins are better maintained43\nover evolutionary time due to biochemical and ﬁtness constraints 31,32. We hypothesized that annotating VPFs44\nbased on functional homology captured in PLM-based protein representations, rather than strict protein sequence45\nhomology , would improve VPF annotation. Therefore, we developed a PLM-based viral protein function classiﬁer46\nand asked if it could improve the viral protein annotation problem.47\n48\nUsing curated VPF databases and recently published PLMs, we show that PLM-based representations of vi-49\nral protein sequences can capture viral functional homology beyond remote sequence homology . Our analysis50\nfocuses on the two axes of viral sequence annotation: systematic labeling of protein families and speciﬁc function51\nidentiﬁcation for biologic discovery . The ﬁrst is the ability to characterize VPFs in environmental viral proﬁling52\nstudies, where we utilize our PLM-based viral classiﬁer to expand the annotated fraction of VPFs collected from53\nthe ocean virome by 37%. The second is the functional characterization of speciﬁc proteins in UViGs of biological54\ninterest, which we demonstrate by using our functional classiﬁer to identify novel phage-like DNA editing proteins.55\nFinally , we show that the PLM-based representations capture functional groupings unique to viruses. PLMs thus56\ncapture features of viral proteins that aid in detecting remote homology , a necessary step toward understanding57\nthe functions of viral populations across the world.58\nResults59\nProtein language models capture viral protein function60\nT o determine whether PLMs can aid in annotating viral proteins, it is necessary to determine that PLMs capture61\nproperties of viral protein function and that they can identify sequence homology that is invisible to state-of-the-62\nart approaches to identify distantly related sequences such as pHMMs. We based our efforts on the Prokaryotic63\nvirus Remote Homologous Groups (PHROGs) database, a curated library of VPFs constructed to capture remote64\nsequence homology and manually annotated to high-level functional categories 21. Because the database was65\nconstructed to maximize remote sequence homology captured by each family , it is an ideal dataset to determine66\nwhether PLM-based representations can capture viral protein function beyond sequence homology . PHROGs67\ncontains 868,340 protein sequences clustered to 38,880 families, of which 5,088 are annotated to 9 functional68\nclasses (Supplemental T able 1).69\n70\nWe built our classiﬁcation model by embedding proteins in annotated families in the PHROGs database to a71\ndistributed representation using a PLM. Using a feed-forward neural network with sequence embeddings as input72\n(Figure 1), a functional annotation classiﬁer was trained on VPFs to predict the functional category of sequences73\nfrom held out VPFs. Five-fold cross validation over the entire annotated set was performed with proteins embed-74\nded using four trained PLMs. The PLM trained exclusively with the unsupervised objective of predicting masked75\namino acids on over 2.1 billion protein sequences from the Big Fantastic Database ( BFD) (T ransformer\nBFD 28)76\nperformed the best of the PLMs evaluated 28–30 (Supplemental T able 2, Supplemental Figure 1) and is used for77\nsubsequent experiments. Performance with T ransformerBFD for each category is shown in Figure 2. The multi-78\nclass classiﬁer achieved an average AUROC of 0.90 and average AUPRC of 0.62 across all classes and folds.79\n80\nA single classiﬁcation model was then trained on all annotated families as well as 14,280 families of the un-81\nknown function category in order to capture sequences that do not match the functional categories. Subsequent82\nto classiﬁer training, 57 PHROGs families were reclassiﬁed. The classiﬁer correctly predicted the re-annotation of83\n38/57 families (66.6%) despite being trained on the previous incorrect annotation for those families (Supplemental84\nT able 3). The performance on the reannotated families serves as a validation of the classiﬁer’s ability to capture85\nfunction. Our trained classiﬁer is available for download (https://github.com/kellylab/viral\nprotein function plm).86\nLanguage model protein embeddings capture phage biology87\nHaving determined that PLM-based representations of viral proteins can predict function, the viral protein em-88\nbedding space was investigated to understand what enables the PLM to detect differences between functions.89\nBecause a PLM can produce a dense vector representation for any protein sequence, we can interrogate the90\nsimilarity of sequences in a family and families in a functional category using vector similarity . VPFs were rep-91\nresented as the centroid of sequence embeddings for constituent proteins and visualized for the functionally92\nannotated PHROGs subset (Figure 3a).93\n94\nWhile the sequence-sequence vector similarity in families across all categories is high (Supplemental Figure95\n2a), the intra-category family-family similarity varies between functional categories (Supplemental Figure 2b).96\nFamilies in the transcription regulation category are most similar, with a median family-family similarity of 0.68,97\nwhile the integration and excision category had lowest median family-family similarity of 0.51. T o ask if there98\nare groupings of categories in the embedding space, we ﬁrst measured the category-category similarity as the99\naverage of the family-family vector similarity for all pairs of families between the categories (Supplemental Figure100\n3). We spectrally clustered the category-category distance matrix (Figure 3b), revealing a biologically meaningful101\npartition of functional categories into those relating to phage virion structure and infection (cluster1) and those102\nrelating to viral genome replication and other host derived genes (cluster2). The partition is apparent when vi-103\nsualizing the PHROGs embedding space (Figure 3c). Grouping of the functional categories into the two clusters104\nidentiﬁed greatly increases the performance of the PHROGs classiﬁer in ﬁve-fold cross validation (Figure 3d)105\nwhen compared to individual classes (Figure 2B) and when compared to random partitions of the categories into106\ngroups of two (Figure 3e).107\n108\nThe ability to classify phage structural proteins, termed phage virion proteins ( PVPs), is important for identifying109\nand grouping novel sequences, and a number of methods have been recently developed to tackle this prob-110\nlem 33,34. With the high performance of our cluster1 vs. cluster2 binary classiﬁer, we evaluated how PLM-based111\nclassiﬁcation compares with existing methods for PVP classiﬁcation. Using a PVP identiﬁcation task designed112\npreviously34,35, our method achieved on par performance with state-of-the-art approaches (T able 1).113\nImproved classiﬁcation of proteins from the global ocean virome114\nT o further validate the trained functional classiﬁer, we evaluated the performance of the classiﬁer against pHMM115\nannotation of the largest pan-ecosystem VPF database, EF AM, curated from UVIGs identiﬁed in the global116\noceans 22 (Supplemental Data 1). With different phage genome sources for database construction, viral genomes117\nin EF AM are not present in the PHROGs training sequences, making this dataset well-suited for an external val-118\nidation of our classiﬁer. T o assign true functional categories to the EF AM VPFs, we used proﬁle-proﬁle HMM119\nmatching with the PHROGs database (Supplemental Data 2). 80,942/240,311 (33.7%) of EF AM VPFs were as-120\nsigned a PHROGs function and these VPFs were predicted using our PLM-based functional classiﬁer trained on121\nPHROG VPFs (Figure 4a). The weighted average F1 score across all categories was 0.70 and is increased to122\n0.75 when the unknown function category is excluded (Supplemental T able 4).123\n124\nT o highlight the systematic annotation capability of our approach, the optimal F1 decision probability per cat-125\negory was used to predict the functional category of EF AM VPFs not captured by the PHROGs HMMs (Figure126\n4b). In total we expand the annotated fraction of EF AM by 39,258 families, a 37.8% increase over the number127\nannotated internal to the EF AM database supplemented with annotation by PHROGs (103,919 families).128\nPLMs enable identiﬁcation of novel phage DNA editing enzymes129\nIntegration and excision had the best prediction performance, therefore, VPFs in EF AM labeled to this category130\nwere used to highlight the ability of PLM-representations to uncover novel biology . Additionally , detection of genes131\nassociated with phage integration into host genomes is crucial in viral bioinformatics for the characterization of132\nphage genomes as temperate. EF AM VPFs predicted in this category can be stratiﬁed based on their annotation133\nin the EF AM database itself, with VPFs having average protein lengths>100 matching annotation to known inte-134\ngrase/recombinase proteins and VPFs with average protein lengths <100 matching known excisionases (Figure135\n4c). We validated our integration and excision prediction for EF AM VPFs that were not annotated in EF AM or by136\nPHROGs HMM matching using structure and domain predictions (Supplemental T able 5). Further investigation of137\npredicted EF AM integrase families led to the annotation of an integrase (cluster86903) on a previously reported138\nputative prophage in uncultured Alphaproteobacteria 36 highlighting the utility of this approach.139\n140\nOur method was also able to annotate related genes in non-viral contexts. We identiﬁed a novel integrase family141\n(cluster158946) located within marine picocyanobacterial genomes, including members of the globally abundant142\ncyanobacteria Prochlorococcus and Synechococcus. Phylogenetic analysis revealed these enzymes as a novel143\nsubgroup within the tyrosine integrase/recombinase family of site-speciﬁc integrases. These cyanobacterial inte-144\ngrases are distinct from other recombinases commonly seen in phages and bacterial mobile genetic elements,145\nintegrases recently described as being associated with T ycheposon mobile elements in Prochlorococcus 37, or146\ntyrosine recombinases associated with VEIME phage satellites 38 (Figure 5a). This protein has a different do-147\nmain structure than is typical of many tyrosine integrases 39, yet structural modeling conﬁrmed that this enzyme148\nretains the key catalytic residues required for activity 40 (Supplemental Figure 4). While found only within a sub-149\nset of available Prochlorococcus and Synechococcus genomes, where identiﬁed the integrase is typically found150\nupstream of one of two speciﬁc tRNAs, either tRNA-Phe or tRNA-Cys. tRNAs are frequent integration sites for151\nmobile genetic elements 41 and phylogenetic groupings of these enzymes correlate with their respective tRNA152\n(Figure 5b), suggesting that these may represent the integration site. The integrases are located in islands of153\nvariable genetic content and are also frequently , though not exclusively , found near a small serine recombinase154\n(Figure 5c-d). T ogether, these properties suggest that this novel enzyme deﬁnes a mobile genetic element within155\nmarine picocyanobacteria.156\nDiscussion157\nImproving viral protein annotation in environmental samples is a vital step towards understanding how viruses158\ninﬂuence microbial community structure. Current approaches annotate on average less than 30% of viral protein159\nfamilies in large, global, environmental metagenomes 6,7,16,21,22, meaning that our understanding of viruses of160\nmicrobes is based on a small fraction of phage genomes. Annotating viral proteins is also key to studies of viral161\nevolution42, characterization of isolate genomes 43, and to understand the role of viruses as disseminators of162\nDNA in microbial populations 44.163\n164\nOur work provides a proof of concept that high-level viral function can be learned with PLM-based representations165\nand extends remote homology detection beyond the ability of universally used, state-of-the-art, alignment-based166\nmethods. Furthermore, we used our PLM classiﬁer to discover novel biology in the oceans by interrogating pre-167\ndictions in the integration and excision category , unveiling a previously unrecognized DNA-editing enzyme in the168\nglobally abundant marine phototrophs Proclorococcus and Synechococcus that anchors a putative novel mobile169\ngenetic element.170\n171\nWe show that across all nine categories in PHROGs, a single multi-class classiﬁer was able to learn viral function172\nin a stratiﬁed ﬁve-fold cross validation across the annotated PHROGs VPFs. How does performance differ by173\ncategory? ”T ail” and ”DNA, RNA, and nucleotide metabolism” were the best performing categories and had the174\nhighest number of families, though not the highest number of sequences per family . T wo of the worst performing175\ncategories, ”moron, auxiliary metabolic gene and host takeover” and ”other”, are the categories that are least176\nspeciﬁc in their annotation, grouping sequence diverse and functionally distinct families into single categories.177\nThese categories also have the lowest number of average sequences per family , which may contribute to their178\nworse performance. While the ”integration and excision” class had the least number of families and the least num-179\nber of sequences, it had performance similar to ”head and packaging” and ”transcription regulation”. It remains180\nan open question how family sequence diversity and number of sequence contribute to classiﬁer performance.181\nHowever, that our multi-class classiﬁer can predict functional labels of held out VPFs demonstrates our classiﬁer182\nhas captured underlying homology beyond what is captured with alignment-based approaches.183\n184\nPLM training on the BFD45, the largest existing protein corpus that contains protein sequences from uncultivated185\ngenomes from metagenomic sequencing data, resulted in the best viral protein function classiﬁer performance.186\nInterestingly , supplemental supervision tasks in PLM training related to structure, such as predicting residue187\ncontacts in protein structures 30, or function, such as protein GO term annotation29, did not result in better classi-188\nﬁcation performance. It is possible that this is due to the dearth of viral protein representation in protein structure189\nand knowledge databases. Future work is necessary to determine if there are viral-speciﬁc supervised tasks that190\ncan enhance PLM training.191\n192\nA major advantage to an alignment-free classiﬁcation is the ability to make predictions even when a VPF does not193\nshare sequence homology with known proteins/families. T o ask if our classiﬁer could improve VPF annotation,194\nwe used VPFs from the ocean virome curated in the EF AM database. Using PHROGs HMM-labeled EF AM VPFs195\nas ground truth, our classiﬁer achieved a weighted F1 score of 0.75 for functional annotation.196\n197\nT o ask if our classiﬁer could uncover novel biology , we interrogated newly annotated EF AM VPFs of the integra-198\ntion and excision category , which had the highest predictive performance. We identiﬁed a novel mobile genetic199\nelement deﬁned by a previously unrecognized integrase related to the tyrosine integrase/recombinase family . The200\ngenomic context of these integrases indicates that their activity contributes to generating genomic diversity among201\nglobally abundant marine picocyanobacteria. We identiﬁed representative sequences of this integrase in cultured202\nisolate and single-cell genomes of Prochlorococcus and Synechococcus and found that the region immediately203\nsurrounding the integrase represents a genomic island whose length, gene content, and gene orientation varies204\namong individual genomes. V ariable genes found near the integrase include putative restriction/modiﬁcation sys-205\ntems, biosynthetic enzymes, and nutrient acquisition genes, indicating that the integrase-associated element can206\nmove genetic cargo of ecological relevance in the ocean. The consistent proximity of the integrase to two speciﬁc207\ntRNAs suggests these as likely integration sites for the element. The integrases are also frequently , though not208\nexclusively , found near a small serine recombinase which might contribute to resolving mobile element insertion209\ninto a target molecule 46. However, the speciﬁc mechanism through which this element is mobilized or integrated210\nis not yet known.211\n212\nAdditionally , proteins in the integration and excision functional category are related to the viral capacity to in-213\ntegrate its genome into a host. These proteins are of particular interest in viral proﬁling studies as they are used214\nto distinguish between lytic and temperate viral life-cycles 13,16,47. We note that mobile genetic elements, some215\nof which contain integrases, are widespread in environmental samples and are still being discovered and charac-216\nterized 37,38. Understanding the origins and dynamics of these elements remains an open question. Finally , the217\nability to detect proteins that function in host genome integration is crucial for the ﬁeld of phage therapy 48.218\n219\nAside from serving as feature embeddings for protein sequences in downstream tasks, PLM transformation of220\nviral proteins also captured underlying patterns of protein functions in viruses. The clustering together of families221\nthat function in virion formation and host lysis separately from families involved in metabolic processes, expres-222\nsion regulation, and host genome integration constitutes a biologically meaningful division of viral function. While223\nour original hypothesis was that sequences in different VPFs but the same functional category would help predict224\nunseen sequences of that function, reﬂecting shared evolution or functional redundancy in reticulate evolution,225\nwe were surprised that using sequences in related functions also aids in prediction. Having identiﬁed that PLM226\nembeddings capture this biology , we show that PLM-based representations outperform feature engineering and227\nuninformed but local learning through convolution for PVP classiﬁcation. As PVPs are crucial to initial phage-host228\ninteraction, the ability to better identify this class of proteins in UViGs will aid studies of phage-host speciﬁcity .229\n230\nOur study must acknowledge several limitations. In attempting to systematically annotate VPF function and high-231\nlight the ability to label integration and excision VPFs, we note that for experimentalists interested in annotating232\nUViGs there are a plethora of methods, parameters, and thresholds to decide, and they may arrive at an anno-233\ntation for a speciﬁc gene not annotated in large-scale approaches by thorough investigation. Annotation goals234\nare project-speciﬁc and may have different levels of granularity needed for annotation; here we have focused235\non protein family level annotations. In selecting the PHROGs database for training the functional classiﬁer we236\nbeneﬁted from the high-level functional category annotation as it collapses a wide array of annotation terms into237\ndeﬁned categories. However, the categories vary in their scope and while some are relatively narrow (integration238\nand excision; lysis) and their prediction can be relevant to experimentalists, the ones that are comparatively broad239\n(head and packaging; moron, auxiliary metabolic gene and host takeover) are limited in their ability to provide240\nspeciﬁc information when predicted. Finally , while we leverage previously trained PLMs due to the computational241\nresources necessary to train large language models and as proof of their ability to capture viral protein function,242\nthere may be more optimal approaches to train PLMs for viral function prediction. Future work will seek to deter-243\nmine whether there are supervised tasks that can increase performance of the functional classiﬁer.244\n245\nOur PLM-based classiﬁer is trained on the same data that underlies the PHROG pHMMs yet can detect homology246\nacross a larger sequence space, identifying integrase genes that the original pHMMs and other annotation tools247\nwere blind to. This suggests that PLMs are accessing features of sequence space that alignment-based meth-248\nods cannot. We hypothesize that these features reﬂect protein structure, as PLMs and large language models249\nmore generally , have been shown to be adept at capturing domain and structural features of proteins. Using our250\napproach, targeted hypotheses about protein function can be gleamed from PLM-based classiﬁcation and then251\ntested experimentally , providing a powerful method for directing study into currently hidden functions of interest.252\nMethods253\nViral protein sequence data254\nThe PHROGs VPF database v3 21 (https://phrogs.lmge.uca.fr/) was downloaded on 01/26/2022. Reannotation255\ndata was downloaded after v4 release. EF AM VPF database 22 was downloaded from project repository on256\nCyV erse Data Commons on 09/07/2022. PHANNs protein sequences and annotations35257\n(https://phanns.com/downloads) was downloaded on 01/17/2023.258\nProtein language models259\nProtein sequences were embedded to vectors using trained PLMs. T ransformer BFD PLM from the ProtT rans28260\nproject was used via the DeepChainBio/BioT ransformers python package. Sequences were embedded with261\npool mode=’mean’ and batch size=2. Sequences were cut off at 5,096 amino acids which is the limit of the262\nT ransformerBFD PLM. LSTM Uniref90 and LSTM Uniref90 MT from the ProSE 30 project were download from263\nthe project github repository (https://github.com/tbepler/prose) and protein sequences were embedded with the264\nembed sequences.py script with –pool avg. T ransformerUniref90 MT from the ProteinBERT29 project was down-265\nloaded from the project github repository (https://github.com/nadavbra/protein bert) and protein sequences were266\nembedded using the get model with hidden layers as outputs function in the proteinbert python package. All267\nprotein sequence embedding was performed on 2 NVIDIA TIT AN V GPUs.268\nClassiﬁer training and evaluation269\nT o test the ability of a model to predict functional category for a test sequence, all labeled PHROG families were270\nsplit into ﬁve, stratiﬁed sets for ﬁvefold cross-validation. In each split, training was done on all sequences in train-271\ning families while testing was performed on a single randomly selected sequence from the testing families. Data272\npreparation for model training was done using sklearn 49 methods StratiﬁedKFold and LabelBinarizer. The same273\ntraining-validation procedure was used for cluster1 vs. cluster2 ﬁvefold cross-validation.274\n275\nFor training the PHROGs functional category classiﬁer used in the EF AM classiﬁcation experiment, families276\nfrom the ’unknown function’ category were included as an additional functional category . However, because277\nthe unknown families may be missing annotation, any family that was predicted by the model trained without the278\nunknown function category with a score >0.5 was removed from training (n=19,512).279\n280\nThe classiﬁer architecture is a dense, feed-forward neural network trained with tensorﬂow 50. The network has281\nthree hidden layers of dimensions 512, 256, and 128 trained with 20% dropout and ReLU activation. The output282\nlayer is of dimension equal to the number of functional categories being predicted and has a softmax activation.283\nInput dimension is equal to the embedding vector length output from the PLM. For PLMs with embedding di-284\nmension greater than 1,024, an additional hidden layer of dimension 1,024 was added as the ﬁrst hidden layer.285\nThe model was ﬁt with the following parameters: n\nepoch=20, loss=categorical crossentropy , opt=Adam(0.0001),286\nbatch size=60. Class prediction is assigned based on the highest probability of the softmax layer. For binary clas-287\nsiﬁers based on binary clusters of PHROGs functional categories, the same architecture and training parameters288\nare used with the exception of n epochs=5.289\n290\nEvaluation for the classiﬁer was measured per-functional category using area under the receiver operating char-291\nacteristic curve (AUROC), area under precision-recall curve (AUPRC), and the F1-score: F1 =2 · TP\nTP + 1\n2 (FP +FN ) ,292\nwhere TP , FP , and FN are the number of true positive, false positive, and false negatives predicted, respec-293\ntively . ROC and PRC curves, AUC, and F1-score were all calculated using sklearn 49 methods roc curve, preci-294\nsion recall curve, and auc. In the case of PHROGs ﬁvefold cross-validation, true labels are known for holdout295\nfamilies. In the case of EF AM, true labels are assigned based on HMM matching of EF AM families to PHROG296\nfamilies. EF AM families were aligned using clustal omega v1.2.4 51 and searched against the PHROG HMM297\ndatabase using hhsearch 52. PHROGs functional label assignment was made if an EF AM family matched a298\nPHROGs HMM with e-value < 1.0e− 12. The label of the PHROGs family with the lowest e-value is considered299\nthe true label unless that label is unknown function in which case the next lowest family label is assigned. For300\npredicting EF AM category in the absence of PHROGs HMM hits, the decision threshold probability for category301\nassignment in EF AM was identiﬁed by calculating the per-category maximum F1-score. For EF AM VPFs with302\nannotation in the EF AM database, annotation terms present > 5 times in families predicted by the classiﬁer as303\nintegration and excision are shown to highlight the split around proteins of length 100 in the category .304\nViral protein family embedding space305\nPHROGs v4 annotation were used for interrogation of the embedding space. PHROGs families were collapsed306\nto centroid vectors by taking the column average of the vector representation of all proteins in a family . Uni-307\nform Manifold Approximation and Projection for Dimension Reduction (UMAP) in python 53 was used to visualize308\nembedded VPFs. Cosine similarity is a measure of similarity between two vectors and is calculated:309\ncosine similarity =\nPn\ni=1 uivi\nPn\ni=1 ui\nPn\ni=1 vi\n310\nwhere u and v are vectors of length n and xi is the i -th element of each vector. It is used to measure sequence-311\nsequence similarity and family-family similarity from protein vectors and family centroid vectors, respectively .312\nFamilies with vector similarities > 0.999 (n=312) were excluded from median family mean sequence-sequence313\nsimilarity calculation as some families have only duplicate sequences as PHROGs did not deduplicate protein314\nsequences. For intra-category similarity , pairwise similarity was calculated for all category families. For inter-315\ncategory similarity , each family in one category was compared to each family in another category with the mean316\nacross all pairwise comparisons constituting the category-category similarity . Differences in the distribution of317\nsimilarities between categories were evaluated with the independent student t-test with Bonferroni correction318\nusing statannotations 54. The category-category similarity matrix was converted to a network using networkx 55319\nand displayed with spectral\nlayout. The distance matrix was clustered using sklearn 49 SpectralClustering with320\nn clusters=2.321\nPhage virion protein classiﬁcation322\nPHANNs protein sequences were embedded using the T ransformerBFD PLM and a PVP vs other classiﬁer was323\ntrained with the same architecture and parameters as the cluster1 vs. cluster2 classiﬁer. T raining and testing324\nsequence split is as described previously34. All sequences in the 10 PHANNs validation splits for all PVP classes325\nare combined to a single PVP training set (n=154,183) and all 10 other validation splits were combined to a single326\nother training set (n=336,151). T esting was done on the held PVP sequences for all classes (n=14,477) and the327\nheld out other sequences (n=33,402).328\nViral protein sequence annotation validation tools329\nViral sequence predictions were manually validated using existing sequence and structural homology software.330\nIndividual sequence homology was performed with NCBI-hosted blastp 56 using the nr database and default pa-331\nrameters. Domain prediction was performed using InterPro57. MPI bioinformatics suite 58 was used for searching332\nprotein sequences against HMM databases using HHpred 59 with default databases (PDB mmCIF30 10 Jan,333\nUniProt-SwissProt-viral70 3 Nov 2021, COG KOG v1.0, PHROGs v4) and parameters and for searching se-334\nquence databases (nr30 17 jan) for HMM hits using HMMER 60 with default parameters. Phyre2 was used for335\nprotein structural fold prediction and 3D model prediction61.336\nInvestigation of predicted integrase protein families337\nA putative integrase protein sequence (MAK08069.1) from cluster158946 was used to search MGniFY for similar338\nsequences in metagenomic datasets. We took the ﬁrst MGnify hit, MGYP000503484273 (e-value 3.3E-257), and339\nused it as a seed to search the IMG-VR database for sequences in the Viral Protein Database using default cutoffs340\n(1E-5). This led to the discovery of putative integrase homologs from Prochlorococcus and Synechococcus341\ngenomes, which were interrogated further.342\nIntegrase analysis343\nNovel integrase sequences originally identiﬁed in IMG were used to query a custom database ofProchlorococcus344\ngenomes from cultured isolates and single cell genomes 37. Additional sequences, such as those from Syne-345\nchococcus, were retrieved through blastp searches of the NCBI nr database (Supplemental Data 3). The tyrosine346\nintegrase phylogeny was constructed from a set of tyrosine recombinases extracted from the UniRef50 database347\n(http://www.uniprot.org/uniref) using HMM models from ref 39; a set of integrases associated with Prochlorococ-348\ncus T ycheposons and cryptic elements37; and representative sequences VEIME-associated integrases38 (based349\non 40% identity clusters generated with MMSeqs2 62). Sequences were aligned with Mafft v7.520 63, a maximum350\nlikelihood phylogeny was generated using FastT ree v2.1.1164, and the tree was plotted using iTOL 65. Genome351\nregions surrounding the integrases were plotted in R using gggenomes 0.9.7.9000352\n(https://github.com/thackl/gggenomes).353\nProtein structure modeling of a novel integrase sequence354\nProtein structure can be conserved among very distantly related sequences. We previously utilized homology355\nmodeling approaches to identify distantly related structural homologs to novel viral capsid protein sequences 66.356\nHere, we took a similar approach to identify structures related to sequences in our putative novel integrase fam-357\nily . We utilized the fully automated protein structure homology-modelling server SWISS-MODEL via the Expasy358\nweb server 67 for template selection, target/template alignment, and model generation using default parameters359\nfor an integrase sequence from the Prochlorococcus P AC1 genome (WP 052038630). The top template, as360\nidentiﬁed by the Global Model Quality Estimate score, was PDB ID 1Z1B, the phage lambda integrase 68. The361\ntarget/template alignment has 13% sequence identity , consistent with our sequences not previously being iden-362\ntiﬁed as integrases. The MolProbity protein quality score, provided by SWISS-MODEL, which combines protein363\nstructure quality features that together reﬂect crystallographic resolution, was 2.269. The lambda integrase is a ty-364\nrosine recombinase with deﬁned active site residues Arg 212, Lys 235, His 308, Arg 311, His 333, and T yr 34268.365\nIn a study of catalysis requirements for tyrosine recombinases, the key residues strictly required for function were366\nidentiﬁed as the T yr (Y) and Lys (K) residues 40. The target/template alignment demonstrates that residues Arg367\n212, Lys 235, Arg 311, and T yr 342 are conserved in our target sequence (Supplemental Figure 4, panel A). The368\nsequence is modeled as a homo-tetramer, consistent with the quaternary structure of the template (Supplemental369\nFigure 4, panel B).370\nAcknowledgements371\nWe thank Thomas Hackl, Kathryn Kauffman, and Cole Matrishin for helpful discussions. Z.N.F . was supported372\nby the Einstein Medical Scientist T raining Program (2T32GM007288). S.J.B. was supported by grants from the373\nNational Science Foundation (OCE-2049004) and the Simons Foundation (Award ID 917971). L.K. is supported374\nin part by NIH NHLBI grant R01HL069438. Computational resources were supported by an award from the375\nGoogle Cloud Research Credits program (GCP19980904) to L.K. We thank the NVIDIA Academic Hardware376\nGrant Program for GPUs used in this work.377\nData availability378\nProtein sequence embeddings for PHROGs, EF AM, and PhaNNs are available for download from google cloud.379\nSee README on the project repository https://github.com/kellylab/viral-protein-function-annotation-with-protein-380\nlanguage-model for details on data download.381\nCode availability382\nCode for generating embeddings and using the classiﬁer is available on github at383\nhttps://github.com/kellylab/viral protein function plm. Code and data ﬁles used to generate ﬁgures and tables is384\navailable on github at https://github.com/kellylab/viral-protein-function-annotation-with-protein-language-model.385\nREFERENCES386\n[1] S. Roux et al. Ecogenomics and potential biogeochemical impacts of globally abundant ocean viruses.387\nNature, 537(7622):689–693, 2016.388\n[2] D . Paez-Espino et al. Uncovering Earth’s virome. Nature, 536(7617):425–430, 2016.389\n[3] A. C. Gregory et al. Marine DNA Viral Macro- and Microdiversity from Pole to Pole. Cell, 177(5):1109–390\n1123.e14, may 2019.391\n[4] A. M. ter Horst et al. Minnesota peat viromes reveal terrestrial and aquatic niche partitioning for local and392\nglobal viral populations. Microbiome, 9(1):233, 2021.393\n[5] A. C. Gregory et al. The gut virome database reveals age-dependent patterns of virome diversity in the394\nhuman gut. Cell Host & Microbe, 28(5):724–740.e8, 2020.395\n[6] L. F . Camarillo-Guerrero et al. Massive expansion of human gut bacteriophage diversity .Cell, 184(4):1098–396\n1109.e9, 2021.397\n[7] S. Nayfach et al. Metagenomic compendium of 189,680 DNA viruses from the human gut microbiome.398\nNature Microbiology, 6(7):960–970, 2021.399\n[8] S. Roux et al. Virsorter: mining viral signal from microbial genomic data. PeerJ, 3:e985, May 2015.400\n[9] J. Ren et al. VirFinder: a novel k-mer based tool for identifying viral sequences from assembled metagenomic401\ndata. Microbiome, 5(1):69, 2017.402\n[10] J. Ren et al. Identifying viruses from metagenomic data using deep learning. Quantitative Biology, 8(1):64–403\n77, 2020.404\n[11] D . E. Wood et al. Improved metagenomic analysis with Kraken 2. Genome Biology, 20(1):257, 2019.405\n[12] J. Guo et al. VirSorter2: a multi-classiﬁer, expert-guided approach to detect diverse DNA and RNA viruses.406\nMicrobiome, 9(1):37, 2021.407\n[13] K. Kieft et al. VIBRANT: automated recovery , annotation and curation of microbial viruses, and evaluation of408\nviral community function from genomic sequences. Microbiome, 8(1):90, 2020.409\n[14] M. J. Tisza et al. Cenote-T aker 2 democratizes virus discovery and sequence annotation. Virus Evolution,410\n7(1):veaa100, jan 2021.411\n[15] C. Glickman et al. Simulation study and comparative evaluation of viral contiguous sequence identiﬁcation412\ntools. BMC Bioinformatics, 22(1):329, 2021.413\n[16] A. P . Camargo et al. Y ou can move, but you can’t hide: identiﬁcation of mobile genetic elements with414\ngenomad. bioRxiv, 2023.415\n[17] J. P . Meier-Kolthoff and M. G ¨oker. VICTOR: genome-based phylogeny and classiﬁcation of prokaryotic416\nviruses. Bioinformatics, 33(21):3396–3404, 07 2017.417\n[18] H. Bin Jang et al. T axonomic assignment of uncultivated prokaryotic virus genomes is enabled by gene-418\nsharing networks. Nature Biotechnology, 37(6):632–639, 2019.419\n[19] C. Moraru. Virclust – a tool for hierarchical clustering, core gene detection and annotation of (prokaryotic)420\nviruses. bioRxiv, 2021.421\n[20] J. C. Pons et al. VPF-Class: taxonomic assignment and host prediction of uncultivated viruses based on422\nviral protein families. Bioinformatics, 37(13):1805–1813, 01 2021.423\n[21] P . T erzian et al. PHROG: families of prokaryotic virus proteins clustered using remote homology. NAR424\nGenomics and Bioinformatics, 3(3), 08 2021. lqab067.425\n[22] A. A. Zayed et al. efam: an expanded, metaproteome-supported HMM proﬁle database of viral protein426\nfamilies. Bioinformatics, 37(22):4202–4208, 06 2021.427\n[23] A. O. Abdelkareem et al. Virnet: Deep attention model for viral reads identiﬁcation. In 2018 13th International428\nConference on Computer Engineering and Systems (ICCES), pp. 623–626, 2018.429\n[24] P . T ynecki et al. Phageai - bacteriophage life cycle recognition with machine learning and natural language430\nprocessing. bioRxiv, 2020.431\n[25] E. Asgari and M. R. K. Mofrad. Continuous distributed representation of biological sequences for deep432\nproteomics and genomics. PLOS ONE, 10(11):1–15, 11 2015.433\n[26] M. Heinzinger et al. Modeling aspects of the language of life through transfer-learning protein sequences.434\nBMC Bioinformatics, 20(1):723, 2019.435\n[27] A. Rives et al. Biological structure and function emerge from scaling unsupervised learning to 250 million436\nprotein sequences. Proceedings of the National Academy of Sciences, 118(15):e2016239118, 2021.437\n[28] A. Elnaggar et al. Prottrans: T owards cracking the language of lifes code through self-supervised deep438\nlearning and high performance computing. IEEE T ransactions on Pattern Analysis and Machine Intelligence,439\npp. 1–1, 2021.440\n[29] N. Brandes et al. ProteinBERT: a universal deep-learning model of protein sequence and function. Bioinfor-441\nmatics, 01 2022. btac020.442\n[30] T . Bepler and B. Berger. Learning the protein language: Evolution, structure, and function. Cell Systems,443\n12(6):654–669.e3, 2021.444\n[31] A. Nasir and G. Caetano-Anoll ´es. A phylogenomic data-driven exploration of viral origins and evolution.445\nScience Advances, 1(8):e1500527, 2015.446\n[32] S. Balaji and N. Srinivasan. Comparison of sequence-based and structure-based phylogenetic trees of447\nhomologous proteins: Inferences on protein evolution. Journal of Biosciences, 32(1):83–96, 2007.448\n[33] C. Meng et al. Review and comparative analysis of machine learning-based phage virion protein identiﬁca-449\ntion methods. Biochimica et Biophysica Acta (BBA) - Proteins and Proteomics, 1868(6):140406, 2020.450\n[34] Z. Fang et al. DeePVP: Identiﬁcation and classiﬁcation of phage virion proteins using deep learning. Giga-451\nScience, 11, 08 2022. giac076.452\n[35] V . A. Cantu et al. Phanns, a fast and accurate tool and web server to classify phage structural proteins.453\nPLOS Computational Biology, 16(11):1–18, 11 2020.454\n[36] C. M. Mizuno et al. Genomes of abundant and widespread viruses from the deep ocean.mBio, 7(4):e00805–455\n16, 2016.456\n[37] T . Hackl et al. Novel integrative elements and genomic plasticity in ocean ecosystems. Cell, 186(1):47–457\n62.e16, 2023.458\n[38] J. M. Eppley et al. Marine viral particles reveal an expansive repertoire of phage-parasitizing mobile ele-459\nments. Proceedings of the National Academy of Sciences, 119(43):e2212722119, 2022.460\n[39] G. Smyshlyaev et al. Sequence analysis of tyrosine recombinases allows annotation of mobile genetic461\nelements in prokaryotic genomes. Molecular Systems Biology, 17(5):e9880, 2021.462\n[40] B. Gibb et al. Requirements for catalysis in the Cre recombinase active site. Nucleic Acids Research ,463\n38(17):5817–5832, 05 2010.464\n[41] K. P . Williams. Integration sites for genetic elements in prokaryotic tRNA and tmRNA genes: sublocation465\npreference of integrase subfamilies. Nucleic Acids Research, 30(4):866–875, 02 2002.466\n[42] E. V . Koonin et al. The global virome: How much diversity and how many independent origins? Environ-467\nmental Microbiology, 25(1):40–44, 2023.468\n[43] A. Shen and A. Millard. Phage genome annotation: Where to begin and end. PHAGE, 2(4):183–193, 2021.469\n[44] T . Borodovich et al. Phage-mediated horizontal gene transfer and its implications for the human gut micro-470\nbiome. Gastroenterology Report, 10, 04 2022. goac012.471\n[45] J. Jumper et al. Highly accurate protein structure prediction with alphafold. Nature, 596:583–589, 8 2021.472\n[46] E. Nicolas et al. The tn¡i¿3¡/i¿-family of replicative transposons. Microbiology Spectrum, 3(4):3.4.14, 2015.473\n[47] T . N. Mavrich and G. F . Hatfull. Bacteriophage evolution differs by host, lifestyle and genome. Nature474\nMicrobiology, 2, 7 2017.475\n[48] D . P . Pires et al. Current challenges and future opportunities of phage therapy.FEMS Microbiology Reviews,476\n44(6):684–700, 05 2020.477\n[49] F . Pedregosa et al. Scikit-learn: Machine learning in Python. Journal of Machine Learning Research ,478\n12:2825–2830, 2011.479\n[50] M. Abadi et al. T ensorFlow: Large-scale machine learning on heterogeneous systems, 2015. Software480\navailable from tensorﬂow.org.481\n[51] F . Sievers and D . G. Higgins. Clustal omega for making accurate alignments of many protein sequences.482\nProtein Science, 27(1):135–145, 2018.483\n[52] M. Steinegger et al. HH-suite3 for fast remote homology detection and deep protein annotation. BMC484\nBioinformatics, 20(1):473, 2019.485\n[53] L. McInnes et al. Umap: Uniform manifold approximation and projection for dimension reduction, 2018.486\n[54] F . Charlier et al. Statannotations, October 2022.487\n[55] A. A. Hagberg et al. Exploring network structure, dynamics, and function using networkx. In G. V aroquaux488\net al., editors, Proceedings of the 7th Python in Science Conference, pp. 11 – 15, Pasadena, CA USA, 2008.489\n[56] S. F . Altschul et al. Gapped BLAST and PSI-BLAST: a new generation of protein database search programs.490\nNucleic Acids Research, 25(17):3389–3402, 09 1997.491\n[57] T . Paysan-Lafosse et al. InterPro in 2022. Nucleic Acids Research, 51(D1):D418–D427, 11 2022.492\n[58] F . Gabler et al. Protein sequence analysis using the mpi bioinformatics toolkit. Current Protocols in Bioinfor-493\nmatics, 72(1):e108, 2020.494\n[59] L. Zimmermann et al. A completely reimplemented mpi bioinformatics toolkit with a new hhpred server at495\nits core. Journal of Molecular Biology , 430(15):2237–2243, 2018. Computation Resources for Molecular496\nBiology .497\n[60] S. C. Potter et al. HMMER web server: 2018 update. Nucleic Acids Research , 46(W1):W200–W204, 06498\n2018.499\n[61] L. A. Kelley et al. The phyre2 web portal for protein modeling, prediction and analysis. Nature Protocols,500\n10:845–858, 6 2015.501\n[62] M. Steinegger and J. S ¨oding. Mmseqs2 enables sensitive protein sequence searching for the analysis of502\nmassive data sets. Nature Biotechnology, 35:1026–1028, 11 2017.503\n[63] K. Katoh and D . M. Standley . MAFFT Multiple Sequence Alignment Software V ersion 7: Improvements in504\nPerformance and Usability. Molecular Biology and Evolution, 30(4):772–780, 01 2013.505\n[64] M. N. Price et al. Fasttree 2 – approximately maximum-likelihood trees for large alignments. PLOS ONE,506\n5(3):1–10, 03 2010.507\n[65] I. Letunic and P . Bork. Interactive T ree Of Life (iTOL) v5: an online tool for phylogenetic tree display and508\nannotation. Nucleic Acids Research, 49(W1):W293–W296, 04 2021.509\n[66] K. M. Kauffman et al. Viruses of the Nahant Collection, characterization of 251 marine Vibrionaceae viruses.510\nScientiﬁc Data , 5(1):180114, 2018.511\n[67] A. Waterhouse et al. SWISS-MODEL: homology modelling of protein structures and complexes. Nucleic512\nAcids Research, 46(W1):W296–W303, 05 2018.513\n[68] T . Biswas et al. A structural basis for allosteric control of dna recombination by integrase.Nature, 435:1059–514\n1066, 6 2005.515\n[69] V . B. Chen et al. MolProbity: all-atom structure validation for macromolecular crystallography . Acta Crystal-516\nlographica Section D, 66(1):12–21, Jan 2010.517\nFigure 1: Overview of training viral protein family (VPF) function classiﬁer using protein language models\n(PLMs). (a) VPFs collected from the PHROGs database with manual annotation to 9 functional categories 21.\n(b) Protein sequences are embedded using trained PLMs by averaging amino acid ( a) vectors ( v ) to a single\nembedding vector (e) of dimension d, and (c) used as input to a feed-forward multi-class classiﬁer.\nFigure 2: Functional category classiﬁcation of PHROGs VPFs with PLM-based protein embeddings. (a)\nReceiver operating characteristic curve with average area under curve (AUC) and standard deviation (SD) over\nﬁve folds. (b) Precision-recall curve with AUC and SD over ﬁve folds. Per fold, training is performed over all\nproteins in a family and testing is performed on a random single sequence from test families. Protein sequences\nwere embedded using the T ransformer\nBFD PLM and the classiﬁer consists of a three hidden layer dense neural\nnetwork and an output layer with softmax activation.\nFigure 3: Investigation of PLM-based embedding of PHROGs VPFs. (a) umap projection of PHROG VPFs.\nVPFs are represented as the centroid of sequence vectors. (b) Spectral network visualization of the inter-category\nfamily-family similarity (edge weight), which is measured as the mean family-family centroid similarity across all\nfamily pairs between two categories. The category-category similarity matrix is clustered with n=2 into two groups\n(black and yellow). (c) Spectral clusters are used to color PHROGs VPF umap projection. (d) Clusters are used\nas binary classes for PHROGs VPF classiﬁer as in 2B. (e) Classiﬁer performance on 10 random two group splits\nwith AUPRC averaged over groups and splits.\nFigure 4: Functional category classiﬁer validation and discovery with the EF AM database of VPFs curated\nfrom the ocean virome. (a) Precision-recall curve for EF AM VPFs labeled with PHROGs HMMs and predicted\nwith the PLM-based functional classiﬁer. Performance is measured with AUPRC and optimal F1-score. (b)\nNumber of VPFs in EF AM that are labeled to each functional category based on the category-speciﬁc optimal\nthreshold and not captured by PHROGs HMMs. (c) EF AM VPFs predicted integration and excision probability as a\nfunction of average protein length in the VPF . Annotation of excisionase (pink) and integase/recombinase (purple)\nterms are for VPFs annotated in EF AM (·). Structural prediction for two EF AM VPFs that do not match PHROGs\nHMMs and are unannotated in EF AM (x) are shown with predicted structure, one excisionase (cluster122519)\nand one integrase (cluster86903). Decision probability is the threshold of maximal F1 for integration and excision\ncategory prediction.\nFigure 5: Identiﬁcation of a novel integrase/recombinase within marine picocyanobacteria. (a) Phyloge-\nnetic relationship of the novel integrases (blue) in comparison with tyrosine recombinases described in marine\nviral parasites (VEIMES; yellow), cyanobacterial mobile element integrases (green) and classes commonly found\namong well-described phage and mobile elements (e.g. IS, PICIs, ICEs). (b) Phylogenetic groupings of full-length\n(>350aa) novel integrases in Prochlorococcus and Synechococcus, in relationship to the closest downstream\ntRNA (outer ring) and genome taxonomy (inner ring). Gaps reﬂect unknown tRNA associations from limitations\nof genome assemblies. (c and d) Genomic context of the novel integrase in selected marine Prochlorococcus\nand Synechococcus genomes, respectively . Colored genes indicate the novel integrase (blue), a small serine\nrecombinase frequently found near the integrase (red) and the downstream tRNA (purple or yellow). Shaded\nregions connect orthologous genes.\nMethod Recall (%) Precision (%) F1-score (%)\nPLM+FNN 90.32 96.88 93.48\n*DeePVP 88.10 96.75 92.22\n*PHANNs 91.68 76.11 83.17\nT able 1: PLM-based viral protein sequence embedding produces best performance in phage virion pro-\ntein (PVP) classiﬁcation task. PVP classiﬁcation task designed previously 34 with PHANNs dataset 35. * is\nperformance reported previously 34.\nSupplementary Files\nThis is a list of supplementary \u0000les associated with this preprint. Click to download.\nSupplementalData1.txt\nSupplementalData2.csv\nSupplementalData3.txt\nSupplemental.pdf\nsupplementaltable3.csv\nsupplementaltable5.csv",
  "topic": "Annotation",
  "concepts": [
    {
      "name": "Annotation",
      "score": 0.7203912734985352
    },
    {
      "name": "Computer science",
      "score": 0.5240488052368164
    },
    {
      "name": "Computational biology",
      "score": 0.4185486137866974
    },
    {
      "name": "Natural language processing",
      "score": 0.38553348183631897
    },
    {
      "name": "Data science",
      "score": 0.3280071020126343
    },
    {
      "name": "Artificial intelligence",
      "score": 0.27954375743865967
    },
    {
      "name": "Biology",
      "score": 0.2546461522579193
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I129975664",
      "name": "Albert Einstein College of Medicine",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I189731429",
      "name": "Wellesley College",
      "country": "US"
    }
  ]
}