{
    "title": "SkillBot: Towards Data Augmentation using Transformer language model and linguistic evaluation",
    "url": "https://openalex.org/W4362647036",
    "year": 2022,
    "authors": [
        {
            "id": null,
            "name": "Khatri, S.",
            "affiliations": [
                "London South Bank University"
            ]
        },
        {
            "id": "https://openalex.org/A2617460608",
            "name": "Iqbal M",
            "affiliations": [
                "London South Bank University"
            ]
        },
        {
            "id": null,
            "name": "Ubakanma, G.",
            "affiliations": [
                "London South Bank University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W6746512435",
        "https://openalex.org/W4205607981",
        "https://openalex.org/W2963108767",
        "https://openalex.org/W3174828871",
        "https://openalex.org/W2161518694",
        "https://openalex.org/W6739901393",
        "https://openalex.org/W2953450277",
        "https://openalex.org/W2998184481",
        "https://openalex.org/W3028999579",
        "https://openalex.org/W4287829148",
        "https://openalex.org/W3154157180",
        "https://openalex.org/W4320929802",
        "https://openalex.org/W4385245566",
        "https://openalex.org/W4293459943",
        "https://openalex.org/W3017465475",
        "https://openalex.org/W2896457183"
    ],
    "abstract": "Creating accurate, closed-domain, and machine learning-based chatbots that perform language understanding (intent prediction/detection) and language generation (response generation) requires significant datasets derived from specific knowledge domains. The common challenge in developing a closed-domain chatbot application is the lack of a comprehensive dataset. Such scarcity of the dataset can be complemented by augmenting the dataset with the use of state- of-the-art technologies existing in the field of Natural Language Processing, called ‘Transformer Models’. Our applied computing project experimented with a ‘Generative Pre-trained Transformer’ model, a unidirectional transformer decoder model for augmenting an original dataset limited in size and manually authored. This model uses unidirectional contextual representation i.e., text input is processed from left to right while computing embeddings corresponding to the input sentences. The primary goal of the project was to leverage the potential of a pre-trained transformer-based language model in augmenting an existing, but limited dataset. Additionally, the idea for using the model for text generation and appending the generated embedding to the input embedding supplied was to preserve the intent for the augmented utterances as well as to find a different form of expressions for the same intent which could be expressed by the potential users in the future. Our experiment showed improved performance for understanding language and generation for the chatbot model trained on the augmented dataset indicating that a pre-trained language model can be beneficial for the effective working of natural language-based applications such as a chatbot model trained on the augmented dataset indicating that a pre-trained language model can be beneficial for the effective working of natural language-based applications such as a chatbot",
    "full_text": null
}