{
  "title": "Synchronous Bilateral Breast Cancer: A Case Report Piloting and Evaluating the Implementation of the AI-Powered Large Language Model (LLM) ChatGPT",
  "url": "https://openalex.org/W4365503946",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A4365938568",
      "name": "Himani R Naik",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A1921243684",
      "name": "Andrew D. Prather",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A1872645924",
      "name": "Grzegorz T. Gurda",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2951663622",
    "https://openalex.org/W2916274801",
    "https://openalex.org/W2611051171",
    "https://openalex.org/W2336794604",
    "https://openalex.org/W3152158622",
    "https://openalex.org/W2755475109",
    "https://openalex.org/W2075806628",
    "https://openalex.org/W2151744107"
  ],
  "abstract": "Primary breast carcinoma is the most common cancer type in women, and although bilateral synchronous breast cancers (s-BBC) remain quite rare, the reported incidence may increase with the adoption of more sensitive imaging modalities. Here, we present a case of histomorphological and clinically distinct s-BBC, together with a discussion of clinical management decisions, prognosis, and treatment standards and how these relate to outcomes vis-à-vis more established standards in unifocal breast carcinoma. The case report also constitutes a pilot and formal evaluation of a large language model (LLM) of ChatGPT as a tool to aid in generating a single patient case report.",
  "full_text": "Review began\n 03/08/2023 \nReview ended\n 03/29/2023 \nPublished\n 04/14/2023\n© Copyright \n2023\nNaik et al. This is an open access article\ndistributed under the terms of the Creative\nCommons Attribution License CC-BY 4.0.,\nwhich permits unrestricted use, distribution,\nand reproduction in any medium, provided\nthe original author and source are credited.\nSynchronous Bilateral Breast Cancer: A Case\nReport Piloting and Evaluating the\nImplementation of the AI-Powered Large\nLanguage Model (LLM) ChatGPT\nHimani R. Naik \n \n, \nAndrew D. Prather \n \n, \nGrzegorz T. Gurda \n \n1.\n Gundersen Medical Foundation, Gundersen Lutheran Medical Center, La Crosse, USA \n2.\n Radiology, Gundersen\nLutheran Medical Center, La Crosse, USA \n3.\n Biology, University of Wisconsin-La Crosse, La Crosse, USA \n4.\n Pathology,\nGundersen Lutheran Medical Center, La Crosse, USA\nCorresponding author: \nGrzegorz T. Gurda, \ngtgurda@gundersenhealth.org\nAbstract\nPrimary breast carcinoma is the most common cancer type in women, and although bilateral synchronous\nbreast cancers (s-BBC) remain quite rare, the reported incidence may increase with the adoption of more\nsensitive imaging modalities. Here, we present a case of histomorphological and clinically distinct s-BBC,\ntogether with a discussion of clinical management decisions, prognosis, and treatment standards and how\nthese relate to outcomes vis-à-vis more established standards in unifocal breast carcinoma. The case report\nalso constitutes a pilot and formal evaluation of a large language model (LLM) of ChatGPT as a tool to aid in\ngenerating a single patient case report.\nCategories:\n Pathology, Radiology, Oncology\nKeywords:\n chatgpt aided case report, chatgpt, breast cancer risk, multifocal, bilateral, ductal carcinoma, breast\ncancer\nIntroduction\nThe text below was generated through a combination of ChatGPT queries and manual (human) writing and\nediting. The full constituent components of the text, including analysis of the writing, are presented in the\nappendices. \nSynchronous bilateral breast cancer (s-BBC) is a rare presentation of breast cancer, accounting for 1%-3% of\nall breast cancer cases. s-BBC is typically defined as the presence of invasive or in situ breast cancer in both\nbreasts diagnosed within six months of each other \n[1,2]\n. The diagnosis of s-BBC can be challenging, as the\ntumors can present at different stages and have different clinical presentations and histopathological\ncharacteristics. The prognosis and treatment options for s-BBC depend on several factors, including the\nstage, histological grade, and other prognostic factors of each individual tumor. Here, we present a case\nreport of a patient with s-BBC, one intermediate-risk ductal carcinoma in the right breast with positive right\naxillary lymph nodes, and one low-risk ductal carcinoma with lobular features in the left breast with\nnegative left axillary lymph nodes. We discuss the clinical management, prognosis, and treatment\nimplications of s-BBC.\nCase Presentation\nA 58-year-old woman presented with a history of a painless lump in her right breast. Mammography and\nultrasound showed a 4.5-cm suspicious mass in the mid-posterior upper outer quadrant of the right breast\n(Figure \n1A\n) and initially no significant suspicious lesions in the left breast (Figure \n1B\n). Following a\nmalignant diagnosis of the right breast mass upon ultrasound (US)-guided needle core biopsy, a contrast-\nenhanced diagnostic magnetic resonance imaging (MRI) of both breasts was performed and identified an\nadditional 1.5 cm of enhancing lesion in the upper inner quadrant of the left breast (Figure \n1C\n). \n1\n2\n3,\n4\n \n Open Access Case\nReport\n \nDOI:\n 10.7759/cureus.37587\nHow to cite this article\nNaik H R, Prather A D, Gurda G T (April 14, 2023) Synchronous Bilateral Breast Cancer: A Case Report Piloting and Evaluating the\nImplementation of the AI-Powered Large Language Model (LLM) ChatGPT. Cureus 15(4): e37587. \nDOI 10.7759/cureus.37587\nFIGURE\n 1: Pre-operative imaging\nA. Mammography, right breast, cranio-caudal (CC) view, white oval to indicate lesion area B. Mammography, right\nbreast, cranio-caudal (CC) view, no definite findings C. Magnetic resonance imaging (MRI), post-contrast T1,\nwhite ovals to indicate lesions bilaterally.\nAn MRI-guided needle biopsy was performed, establishing the diagnosis of invasive ductal carcinoma with\nlobular carcinoma of the left breast. The tumors were both estrogen receptor (ER) strongly positive,\nprogesterone receptor (PR) weakly to moderately positive, and HER2/neu-negative (Figure \n2\n); an E-cadherin\nimmunohistochemical stain showed strong, preserved membranous staining, supporting the\nhistomorphologic impression of a predominantly ductal phenotype but also focal lobular neoplasia in situ\n(ALH) of the left breast. \n2023 Naik et al. Cureus 15(4): e37587. DOI 10.7759/cureus.37587\n2\n of \n10\nFIGURE\n 2: Pre-operative pathology (needle core biopsies, right and left\nbreast)\nA. H&E, 20X, histomorphology of right-sided ductal carcinoma B. Estrogen receptor (ER) strong positivity,\nprogesterone receptor (PR) weak positivity (not shown) C. H&E, 20X, histomorphology of right-sided ductal\ncarcinoma with lobular features and adjacent atypical lobular hyperplasia (ALH) D. Partial loss of E-cadherin\nmembranous staining within ALH, preserved within invasive carcinoma; estrogen receptor (ER) strong positivity;\nprogesterone receptor (PR) weak-moderate positivity (not shown)\nThe patient had no family history of breast or ovarian cancer, and her risk assessment (the Gail model)\nindicated a low risk. The patient also met with a genetic counselor and underwent germline testing for high-\nprevalence breast cancer risk genes (Invitae, San Francisco, CA), but no pathologic variants (category 1 or 2)\nwere found. The patient was diagnosed with s-BBC and underwent a multidisciplinary evaluation at our\ninstitutional breast cancer tumor board to determine the best treatment plan.\nThe patient underwent a bilateral skin-sparing mastectomy with reconstruction, bilateral sentinel lymph\nnode biopsy, and axillary lymph node dissection. The final pathology revealed a 4.5 cm intermediate-grade\n(Nottingham combined grade 2 of 3) ductal carcinoma with 7 of 21 positive right axillary lymph nodes in the\nright breast and a 1.4 cm low-grade (Nottingham combined grade 1 of 3) ductal carcinoma with lobular\nfeatures in the left breast with negative left axillary lymph nodes. The patient’s pathologic staging (AJCC 8th\ned.) was, therefore, pT2 N2a on the right side and pT1c pN0(sn) on the left side.\nThe patient received adjuvant radiation therapy to the right breast and axilla, as well as systemic adjuvant\nAC-T chemotherapy, i.e., doxorubicin hydrochloride (Adriamycin) and cyclophosphamide, followed by\npaclitaxel (Taxol) and subsequent adjuvant endocrine therapy with a non-steroidal aromatase inhibitor (AI),\nanastrozole. The right breast was closely monitored with regular radiographic screening and clinical\nexaminations of the reconstructed breast tissue and implant, and there has been no evidence of disease\nrecurrence during the five-year follow-up period.\nDiscussion\nThe management of s-BBC depends on several factors, including the stage of the disease, the\nhistopathological characteristics of the tumors, the patient's health status, including age and comorbidities,\nas well as the patient's own health management preferences. Treatment options include breast-conserving\nsurgery, mastectomy, radiation therapy, and systemic therapy with chemotherapy, endocrine therapy, or\ntargeted therapy.\nBreast-conserving surgery (BCS) is a reasonable option for patients with s-BBC, provided that the tumors\ncan be completely excised with negative margins. The prognosis of s-BBC has long been considered to be\ngenerally worse than that of unilateral breast cancer, with worse overall survival than either unilateral or\nmetachronous breast cancer likely due to an earlier and perhaps higher risk of distant metastasis \n[1]\n. This has\nbeen re-appraised in more recent studies with larger sample sizes, stringent data collection at the outset,\nlonger follow-up, and multivariate adjustment for tumor biology to show that the inferior prognosis of s-\nBBC may not be due to the higher aggressiveness of cancers in this setting per se, but the combined\n2023 Naik et al. Cureus 15(4): e37587. DOI 10.7759/cureus.37587\n3\n of \n10\ndetrimental effect due to simultaneous malignancies \n[2,3]\n. The presence of positive lymph nodes is\nassociated with a worse prognosis, and patients with positive lymph nodes should receive adjuvant\nchemotherapy in addition to surgery and radiation therapy \n[4]\n. In this case, the patient received adjuvant\nchemotherapy based on the intermediate risk of right breast cancer.\nMastectomy may be considered or recommended in patients with large or multifocal tumors, an extensive\nintraductal component, or a strong family history of breast cancer \n[4]\n. Radiation therapy is recommended\nfor s-BBC patients who undergo breast-sparing surgery such as lumpectomy to reduce the risk of local\nrecurrence. Bilateral breast irradiation can be challenging with different fields and dose requirements for\nvariably aggressive tumors at two sites, but a hypofractionated schedule is technically feasible, can\nminimize acute toxicity/side effects, and shows no increase in the risk of significant late effects (for\ninstance, secondary malignancies such as angiosarcomas), though the study conclusions should be viewed\nwith caution due to the relatively short follow-up \n[5]\n. \nSystemic therapy with chemotherapy, endocrine therapy, or targeted therapy may be considered based on\nthe histological characteristics of the tumors and the patient's overall health. In our case, the patient\nreceived adjuvant endocrine therapy with an AI (anastrozole) given the hormone receptor-positive status of\nboth tumors, particularly the larger, more biologically aggressive right-sided tumor. In a retrospective study\nof 1,214 patients with s-BBC, there was a similar range of distribution for tumor size, pathological grade, ER\npositivity, and axillary lymph node involvement, and when corrected with multivariate competing risk\nmodels using both tumor sites as opposed to unilateral breast cancer, there was no difference in overall\nsurvival (Risk Ratio (RR) = 1.01, CI: 1.08-1.57, p=0.93) \n[2]\n. Similarly, in a large multi-site clinical trial based\non the utilization of a 70-gene signature in low-risk breast cancer patients, 238 s-BBC patients with the\nmultifocal disease showed a slightly elevated genomic risk profile versus unifocal breast cancer patients\n(high risk of 22.7% vs. 17.3%, odds ratio [OD] = 1.45, p=0.038), but no association in disease-free survival\n(DFS 96.9% vs. 97.1%, hazard ratio [HR] = 1.55, p=0.172) \n[3]\n, albeit with some limitations as to the general\napplicability of the study due to the characteristics of the patient accrual. Nearly all studies seem to agree\nwith the generally accepted paradigm that invasive lobular carcinoma and lobular neoplasia in situ\n(ALH/LCIS) are surrogate risk markers for the development of future breast cancer (in both breasts) and that\nlobular carcinoma in situ (LCIS) is a non-obligate precursor of breast cancer. In the studies discussed thus\nfar, the lobular phenotype was enriched in s-BBC, representing 11% in the unilateral setting versus 13.7%-\n15.6% in s-BBC \n[2]\n or 6.6% in metachronous BBC versus 8.6% in s-BBC \n[1]\n. For the patient presented in this\ncase report, there was documented lobular neoplasia in situ (ALH) in the smaller tumor, as well as lobular\nfeatures histomorphologically, albeit this characterization is difficult to stringently and uniformly apply. In\nterms of late recurrence and metastasis, there also does not appear to be a significant difference in the\nanatomic site and distribution of late/distal metastasis versus metachronous breast cancer (in descending\norder, bone, lymph nodes, lungs, liver, and brain, among others) \n[1]\n. Lastly, in the setting of s-BBC,\nconsideration of metastasis to the contralateral breast rather than two synchronous primary cancers should\nbe considered, especially if the tumors appear histomorphological similar, have similar receptor status, are of\nhigh grade/stage, have axillary metastasis on one side, but lack carcinoma in situ (DCIS/LCIS) in the\ncontralateral breast. More rigorous analytical approaches, such as next-generation sequencing, have shown\nthat about 5% of s-BBC may indeed constitute metastatic disease involving the contralateral breast rather\nthan multifocal synchronous cancers \n[6]\n. Although these advanced molecular diagnostics approaches are\ninformative in terms of further prognosis and management, they can be difficult to execute in a typical\nclinical setting and, due to some limitations, may still give equivocal results.\nAs stated in the case presentation, the patient underwent genetic counseling and underwent broad-panel\ngermline testing with negative results. Per current national comprehensive cancer network (NCCN)\nguidelines (version 3.2023), an indication for testing for high penetrance cancer susceptibility genes\n(BRCA1/2, CDH1, PALB2, PTEN, and TP53) is indicated in women with multiple primary breast cancers,\nregardless of age, and this includes both s-BBC and metachronous breast cancer \n[4]\n.\nThere is limited evidence on the optimal follow-up strategy for patients with s-BBC. The general approach is\nto follow the patient clinically after surgery, with imaging at least once or twice within the next two years \n[7]\n.\nMagnetic resonance imaging (MRI) may be considered for high-risk patients, such as those with a strong\nfamily history of breast or ovarian cancer or with dense breast tissue \n[8]\n. Adoption of more advanced and\nsensitive imaging techniques such as MRI may lead to increased detection of what would otherwise be\nclinically and grossly (by surgical pathology) occult carcinomas and thus lead to an increased reported\nincidence of s-BBC in the future.\nConclusions\ns-BBC is a rare presentation of breast cancer that requires a careful diagnostic and clinical management\napproach. Treatment options include breast-conserving surgery, mastectomy, radiation therapy, and\nsystemic therapy, with decisions currently most commonly driven by the more advanced and biologically\naggressive site of the tumor. The prognosis of s-BBC is generally thought to be either somewhat worse or\nquite similar to that of unilateral breast cancer. Close surveillance with regular mammography and clinical\nfollow-up is recommended for patients who undergo breast-conserving surgery to detect any new or\nrecurrent breast cancer. Given the relative rarity of this clinical setting, further research is needed to\n2023 Naik et al. Cureus 15(4): e37587. DOI 10.7759/cureus.37587\n4\n of \n10\ndetermine the optimal management, risk assessment (i.e., appropriate application of prognostic molecular\ntesting such as mammaprint or Oncotype), and risk-reduction strategies for patients with s-BBC.\nAppendices\nThree similar queries were attempted with ChatGPT, and analyzed by GPTzero (https://gptzero.me/):\nVer 1:  Perplexity 39; Burstiness 15.7 (entirely AI)\nVer 2:  Perplexity 44; Burstiness 22 (partly AI)\nVer 3:  Perplexity 35; Burstiness 16.7 (entirely AI)\nChatGPT queries\n2023 Naik et al. Cureus 15(4): e37587. DOI 10.7759/cureus.37587\n5\n of \n10\nFIGURE\n 3: ChatGPT queries\nThree ChatGPT queries, stepwise more complex, with initial text generated. The final component of AI-generated\ntext contained fragments from all three queries, but predominantly query #2.\nOne additional query (same as ver3) was attempted via BLOOM (a different LLM algorithm, trained with\ndomain-specific text)\nPerplexity 50.7; Burstiness 33.8 (partly AI)\nFor comparison, my most recent prior published case report is: Perplexity 120.3; Burstiness 88.8 (entirely\nhuman)\nLastly, the ChatGPT-assisted final version of the manuscript (~60% human text, discussion, and conclusion\n2023 Naik et al. Cureus 15(4): e37587. DOI 10.7759/cureus.37587\n6\n of \n10\nsections): Perplexity 62.3 Burstiness 45.8 (likely entirely human)\nMethods: Default setting for GPTzero API (beta); at a threshold of 0.65, 85% of AI documents are classified\nas AI, and 99% of human documents are classified as human.\nAuthor impressions (Dr. Gurda) \nUnfortunately, there is no such thing as a \"free lunch\" and not everything is as easy as it seems. The\ndiscussion sections generated by my queries to ChatGPT seemed to make sense, and superficially, the text\ngenerated appeared sensible, but the numbers and the citations produced were entirely fictitious. The\nauthors and the journals existed; the article titles and numbers made general sense but were apparently\npulled out of “thin air”, or rather generated by a confluence of text in the training set. As an example,\nChatGPT text reads: \n\"In a retrospective study of 166 patients with s-BBC who underwent BCS, the 10-year overall survival rate\nwas 77%, and the disease-free survival rate was 67%.\nThe study found that the presence of lobular carcinoma in situ, an extensive intraductal component, and\nlymph node involvement were significant predictors of worse outcomes (1).\nSun J, Huo L, Xie C, et al. The prognosis of synchronous bilateral breast cancer: a single-center experience.\nPLoS One. 2015;10(6):e0128343.\"\nIt sounds credible, but this study does not exist. The authors exist, the journal exists, but the article and,\nmost importantly, the data cited do not. Overall, for the purposes of generating a discussion section,\nChatGPT at this point in its development (early 2023) appears to mostly have the characteristics of a\n'confidence man' -- superficially accurate and strong, but the substance rings hollow.\nNonetheless, as stated elsewhere, I found ChatGPT and other LLMs to be useful in generating a skeletonized\noutline, organizing my thoughts about the subject in a logical manner (even if I had to gather the evidence\nfor the arguments being made in the discussion 'manually' later), and in general as a motivation to get\nstarted and/or overcome writer's block.\nLastly, the full text of the article. What was generated by ChatGPT (verbatim) is highlighted, and manual\nhuman entry and edits are in standard text (Figures \n4\n, \n5\n):\n2023 Naik et al. Cureus 15(4): e37587. DOI 10.7759/cureus.37587\n7\n of \n10\nFIGURE\n 4: Script as generated by ChatGPT (Part A)\n2023 Naik et al. Cureus 15(4): e37587. DOI 10.7759/cureus.37587\n8\n of \n10\nFIGURE\n 5: Script as Generated by ChatGPT (Part B)\nAdditional Information\nDisclosures\nHuman subjects:\n Consent was obtained or waived by all participants in this study. \nConflicts of interest:\n In\ncompliance with the ICMJE uniform disclosure form, all authors declare the following: \nPayment/services\ninfo:\n All authors have declared that no financial support was received from any organization for the\nsubmitted work. \nFinancial relationships:\n All authors have declared that they have no financial\nrelationships at present or within the previous three years with any organizations that might have an\ninterest in the submitted work. \nOther relationships:\n All authors have declared that there are no other\nrelationships or activities that could appear to have influenced the submitted work.\nAcknowledgements\nThe manuscript includes input from the AI-powered large language model (LLM) ChatGPT (OpenAI, San\nFrancisco, CA), although a significant (<50%) component of the text is manually (human) generated. Text\ngenerated by ChatGPT versus human input, as well as text analysis via GPTzero (OpenAI, San Francisco, CA)\nof the three queries to ChatGPT and one query via domain-trained LLM (Bloom), as well as author\nimpressions of the writing process, are available in the appendix.\n2023 Naik et al. Cureus 15(4): e37587. DOI 10.7759/cureus.37587\n9\n of \n10\nReferences\n1\n. \nSas-Korczyńska B, Kamzol W, Kołodziej-Rzepa M, Mituś JW, Wysocki WM: \nThe characteristics of bilateral\nbreast cancer patients\n. Now Jr Onc. 2018, 68:221-226.\n2\n. \nMejdahl MK, Wohlfahrt J, Holm M, et al.: \nBreast cancer mortality in synchronous bilateral breast cancer\npatients\n. Br J Cancer. 2019, 120:761-767.\n3\n. \nAalders KC, Kuijer A, Straver ME, et al.: \nCharacterisation of multifocal breast cancer using the 70-gene\nsignature in clinical low-risk patients enrolled in the EORTC 10041/BIG 03-04 MINDACT trial\n. Eur J Cancer.\n2017, 79:98-105. \n10.1016/j.ejca.2017.03.034\n4\n. \nGradishar WJ, Anderson BO, Balassanian R, et al.: \nBreast cancer, version 4. 2017, NCCN clinical practice\nguidelines in oncology\n. J Natl Compr Canc Netw. 2018, 16:310-20. \n10.6004/jnccn.2018.0012\n5\n. \nGadea J, Ortiz I, Roncero R, et al.: \nSynchronous bilateral breast cancer treated with a 3-week\nhypofractionated radiotherapy schedule: clinical and dosimetric outcomes\n. Clin Transl Oncol. 2021,\n23:1915-22. \n10.1007/s12094-021-02600-1\n6\n. \nBegg CB, Ostrovnaya I, Geyer FC, et al.: \nContralateral breast cancers: Independent cancers or metastases?\n.\nInt J Cancer. 2018, 142:347-56. \n10.1002/ijc.31051\n7\n. \nSchootman M, Jeffe DB, Lian M, Aft R, Gillanders WE: \nSurveillance mammography and the risk of death\namong elderly breast cancer patients\n. Breast Cancer Res Treat. 2008, 111:489-96. \n10.1007/s10549-007-9795-\n1\n8\n. \nSaslow D, Boetes C, Burke W, et al.: \nAmerican Cancer Society guidelines for breast screening with MRI as an\nadjunct to mammography\n. CA Cancer J Clin. 2007, 57:75-89. \n10.3322/canjclin.57.2.75\n2023 Naik et al. Cureus 15(4): e37587. DOI 10.7759/cureus.37587\n10\n of \n10",
  "topic": "Medicine",
  "concepts": [
    {
      "name": "Medicine",
      "score": 0.9718872308731079
    },
    {
      "name": "Modalities",
      "score": 0.6545984745025635
    },
    {
      "name": "Breast cancer",
      "score": 0.5795514583587646
    },
    {
      "name": "Medical physics",
      "score": 0.48525142669677734
    },
    {
      "name": "Treatment modality",
      "score": 0.47805100679397583
    },
    {
      "name": "Modality (human–computer interaction)",
      "score": 0.4758871793746948
    },
    {
      "name": "Radiology",
      "score": 0.41021373867988586
    },
    {
      "name": "Cancer",
      "score": 0.40210914611816406
    },
    {
      "name": "Surgery",
      "score": 0.2588275372982025
    },
    {
      "name": "Internal medicine",
      "score": 0.2025637924671173
    },
    {
      "name": "Artificial intelligence",
      "score": 0.11638104915618896
    },
    {
      "name": "Sociology",
      "score": 0.0
    },
    {
      "name": "Computer science",
      "score": 0.0
    },
    {
      "name": "Social science",
      "score": 0.0
    }
  ]
}