{
  "title": "Exploring the Impact of Artificial Intelligence language model ChatGPT on the User Experience",
  "url": "https://openalex.org/W4378834920",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A4289735588",
      "name": "Ahmed Al-Sa'di",
      "affiliations": [
        "Te Pūkenga",
        "Wellington Institute of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2105737523",
      "name": "Dave Miller",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A4289735588",
      "name": "Ahmed Al-Sa'di",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2105737523",
      "name": "Dave Miller",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W3206896625",
    "https://openalex.org/W3195625625",
    "https://openalex.org/W6849741078",
    "https://openalex.org/W4323256981",
    "https://openalex.org/W4360802167",
    "https://openalex.org/W4323531772",
    "https://openalex.org/W4366420437",
    "https://openalex.org/W2837955947",
    "https://openalex.org/W4320306010",
    "https://openalex.org/W3011186445",
    "https://openalex.org/W6848857030",
    "https://openalex.org/W4321446367",
    "https://openalex.org/W298147291",
    "https://openalex.org/W4313564799",
    "https://openalex.org/W2992301309",
    "https://openalex.org/W4291143240",
    "https://openalex.org/W4323650985"
  ],
  "abstract": "This study investigates the integration of AI language model tools, specifically ChatGPT, in the Design Thinking process to evaluate their effect on product design. While previous research has primarily focused on Design Thinking, limited research has been conducted on the application of AI tools in the process.&#x0D; This study involved redesigning two previous projects using AI tools in the Design Thinking process. We conducted interviews with five designers and analysed ten Product Manager reports to understand the impact of using AI tools on one of the most popular innovation and problem-solving approaches called Design Thinking.&#x0D; The findings indicate that integrating AI tools into the design thinking process, specifically in the Define and Ideate stages, can improve the efficiency and creativity of the UI. However, the successful implementation of AI tools requires a combination of technological expertise and creative design thinking.&#x0D; The study emphasizes the potential for AI tools to complement human creativity and expertise in the design process, rather than replace them. The results contribute to understanding the appropriate application of AI tools in design and innovation while underscoring the importance of keeping humans at the centre of the process.",
  "full_text": "International Journal on Technology, Innovation, and Management  (IJTIM) 3(1) -2023  \n \n \n \n \n \n \n \n \nExploring the Impact of Artificial Intelligence language model ChatGPT on the User \nExperience \nAhmed AL-Sa'di¹, Dave Miller² \n1Te Pūkenga Whitireia and WelTec, New Zealand  \n2Innovation and Research, NZQIR, New Zealand \n \nA R T I C L E   I N F O \n \n \n \nKeywords:  \nArtificial Intelligence, \nChatGPT, Language Model, \nDesign Thinking. \n \nReceived: Feb, 28, 2023 \nAccepted: Mar, 18, 2023 \nPublished: May, 23, 2023 \n \n \nA B S T R A C T  \n \nThis study investigates the integration of AI language model tools, specifically \nChatGPT 3.5, in one of the well -known approaches to problem-solving that focuses \non innovation and creation in use r experience, namely Design Thinking. The study \naims to evaluate the effect of using AI language model tools on product design. While \nprevious research has primarily focused on Design Thinking, limited research has \nbeen conducted on the applicat ion of AI t ools in the process. This study involved \nredesigning two previous projects with the help of ChatGPT AI tools in the Design \nThinking process. We conducted interviews with five designers and analysed ten \nProduct Manager reports to understan d the impact of us ing AI tools. The findings \nindicate that integrating AI tools into the Design Thinking process, specifically in the \nDefine and Ideate stages, can improve the efficiency and creativity of the UI. \nHowever, the successful implementation of AI tools requires a  combination of \ntechnological expertise and creative design t hinking. We emphasise the potential \nfor AI tools to complement human creativity and expertise in the design process, \nrather than replace them. We believe this study will contribute to understandi ng \nthe appropriate application of AI tools in design and innovation while underscoring \nthe importance of keeping humans at the centre of the process.\n \n1. INTRODUCTION  \nIn today's dynamic and rapidly evo lving \ntechnological landscape, organizations are actively \npursuing innovative strategies to maintain a \ncompetitive edge. Design Thinking, an innovation \napproach, has emerged as a prominent \nmethodology in this regard, and its impact on the \ndevelopment phase of innovation has been subject \nto extensive research (Ismail, 2022). \nInnovation is a crucial aspect of modern business, \nyet a significant number of product and service \ninnovations fail for various reasons related to the \ninnovation process, organization, resource \nendowment, and commercialization strategies, \namong others. Des ign Thinking, a formal creative \nproblem-solving method based on the application \nof the mindsets and tools of designers to the \nbusiness context, has been shown to enhance \nperformance in the development phase of the \ntechnological innovation process.  \nThe Fou rth Industrial Revolution (Industry 4.0) \nhas brought about significant changes in the way \nwe live and work, with the integration of artificial \nintelligence (AI) being a key aspect of this \ntransformation (Levy and Huli, 2019). In emerging \neconomies, AI has the potential to impact poverty \nreduction, innovation, infrastructure development, \nand progress towards the Sustainable \nDevelopment Goals (SDGs). AI can drive innovation \nContents available at the publisher website: G A F T I M . C O M \nJournal homepage: https://journals.gaftim.com/index.php/ij tim/index \n\nA.AL-Sa’di, & D. Miller        International Journal on Technology, Innovation, and Management (IJTIM) 3(1) -2023-  2 \nhttps://doi.org/10.54489/ijtim.v3i1.195                                                                                                    Publisher: GAFTIM, https://gaftim.com \nby enabling faster and more efficient development \nof new products and services. In emerging \neconomies, AI can be used to identify and a ddress \nspecific challenges such as improving agricultural \nproductivity or developing new renewable energy \nsolutions.  \nThe integration of AI tools, particularly ChatGPT, to \nsupport the Design Thinking process within the \ndomain of product design has received  limited \nresearch attention to date (Malefane Sekoboto and \nMazanai, 2022). Despite the increasing importance \nof AI in enhancing innovation and design, the \npotential of using AI tools to augment the Design \nThinking process remains an underexplored area \nof investigation. Specifically, the examination of \nhow ChatGPT can be leveraged to improve the \ndesign phase of technological innovation in the \ncontext of distant markets, advanced technologies, \nand undefined user needs has been sparse ly \nexplored in academic literature. Therefore, \nexploring the potential of AI tools, such as ChatGPT, \nin combination with Design Thinking principles to \nenhance product design is a promising area for \nfurther research (Micheli et al., 2019). \nOur study investigates the potential benefits and \nlimitations of integrating AI language model tools, \nspecifically ChatGPT 3.5, into the Design Thinking \nprocess for improving product design. We explore \nthe use of ChatGPT in combination with Design \nThinking principles to enhance the efficiency and \ncreativity of the design phases of technological \ninnovation. Our aim is to shed light on the impact \nof integrating AI tools into th e design thinking \nprocess, and to offer insights into how \norganizations can best leverage these tools to \nenhance their innovation efforts. \nIn the upcoming sections, we will discuss the \nconcept of Design Thinking for innovation, and its \nrelevance in the cur rent age of AI -powered \ninnovation and design. Then, we will outline our \nresearch methodology and present our key \nfindings, followed by a detailed discussion. Finally, \nwe will conclude by highlighting the implications of \nour research and suggesting avenues for future \nexploration. \n \n2. LITERATURE REVIEW \n2.1. Design Thinking for Innovation  \nDesign Thinking has emerged as a popular \napproach for creative problem -solving initiatives \nin recent years. At the heart of this approach is \nexperimentation, which is consid ered a \nfundamental trait of Design Thinking. Designers \nuse experiments to generate knowledge about the \nunknowns underlying an innovative idea, including \nits desirability, feasibility, and viability. By creating \nand processing information through \nexperimentation, designers can make accurate \ndesign decisions as projects unfold. This is because \ndesign thinking enables innovators to gain a \ndeeper understanding of user needs and \npreferences, leading to the development of \nsolutions that better meet those needs (Kim, 2023). \nDesign Thinking is an innovation process that \nemphasizes the use of prototypes as incomplete \nand approximate representations of the innovation \noutput during development (Sakirin and Ben Said, \n2023). The process involves actively intervening in \nreality and manipulating it to produce the desired \nresult (Verganti et al., 2020) . found that testing \nprototypes with target users helps to create a \nrealistic experience of what the innovation might \nbe, allowing users to provide reliable feedback  \n(Zhai, 2023). This feedback is crucial for innovators \nto make informed design decisions as projects \nprogress. It is important to note that incorporating \nhuman feedback in all phases of Design Thinking is \nvital to ensure that the end product is user -\ncantered and meets their needs. The involvement \nof users throughout the design process can lead to \nbetter design decisions and ultimately result in \ngreater user satisfaction (Kalla et al., 2023). \nDesign Thinking for innovation involves a \nstructured approach to identifying, defining, and \naddressing problems or opportunities. It involves \nthe use of empathy to understand the needs of \nusers, collaboration among stakeholders to \ngenerate and evaluate i deas, and experimentation \nto test and refine solutions  (Gao et al., 2023) . The \niterative nature of Design Thinking allows \ninnovators to make adjustments based on feedback \nfrom users and other stakeholders, leading to more \neffective and efficient solutions (Xu, 2019). \nInnovation is critical for companies to remain \ncompetitive in today's fast -paced and ever -\nevolving technological landscape. The design phase \nof innovation, where research and development \ntake place, is particularly important in ensuring the \nsuccess of new products and services  (Lund and \nWang, 2023). Design Thinking has been shown to \nbe effective in improving the  design phase of \ninnovation by helping innovators gain a deeper \nA.AL-Sa’di, & D. Miller        International Journal on Technology, Innovation, and Management (IJTIM) 3(1) -2023-  3 \nhttps://doi.org/10.54489/ijtim.v3i1.195                                                                                                    Publisher: GAFTIM, https://gaftim.com \nunderstanding of user needs and preferences, \nleading to the development of solutions that better \nmeet those needs. \nDesign Thinking is an approach that emphasizes \nexperimentation as a fundament al trait to foster \ninnovation. By designing and running experiments, \ndesigners can generate knowledge about \nunknowns underlying an innovative idea, making \naccurate design decisions as projects unfold. \nDesigners should adopt a mindset of discovery and \nembrace an exploratory approach to \nexperimentation, characterized by multiple, fast, \nand frugal prototypes that push the boundaries of \nwhat is possible. Through experimentation, \ndesigners can reduce cognitive biases, facilitate \ncommunication and coordination ac ross team \nmembers, and ultimately. \n \n2.2. Innovation and Design in the Age of AI \nInnovation and design are crucial aspects of any \norganization's success, and the advent of AI has \nbrought about a new paradigm in the way we \napproach these processes  (Arif et al., 2023) . AI is \nincreasingly being used in product design, testing \nand simulation, optimization, and generating ideas, \nproviding a range of benefits such as improved \nscalability, adaptability, and broader scope. This \nshift in focus calls for new theories and bring s \ndesign closer to leadership, which is inherently an \nactivity of sensemaking (Shaji George et al., 2023). \nRecent research has highlighted the potential \nimpact of AI on innovation and design processes. \nFor instance, a study by (Chubb et al., 2022)  \nexamined the role of AI in the product design \nprocess, particularly in ideation and iteration \nphases (Haleem et al., 2022) . The authors found \nthat AI can facilitate the generation of novel ideas \nand enhance the creativity of the d esign process. \nFurthermore, AI can improve product \ndevelopment by enabling real -time feedback and \ncontinuous improvement. \nAI can reinforce the principles of design thinking, \nparticularly in its ability to generate user-cantered \nsolutions and its iterative approach to problem -\nsolving (Enholm et al., 2022) . However, the use of \nAI in design and innovation is not wi thout its \nchallenges. One key issue is the potential for bias in \nAI algorithms, which can have significant \nimplications for product design and user \nexperience (Lo, 2023).  \nChatGPT is a cutting -edge AI language model tool \ndeveloped by OpenAI and launched in November \n2022. Since its launch, this widely-used chatbot has \nbecome extremely popular due to its remarkable \nability to process prompts and generate essays, \narticles, poems, and more in a \"human-like\" fashion \n(Verma, 2023). The use of ChatGPT in innovation \nand design is an area of great interest and potential \nimpact. With its advanced natural language \nprocessing capabilities, ChatGPT has been trai ned \non a vast amount of text data, enabling it to \ngenerate responses that closely resemble those of \nhuman beings  (Chasanidou et al., 2015) . This \ntechnology has the potential to revolutionize the \nway humans interact with machines and could \nhave significant implications for innovation and \ndesign processes. \nThe use of AI in innovation and design processes \nhas the potential to transform the way we \napproach problem -solving, product development, \nand user experience. While it brings significant \nbenefits, such as improved scalability and \nadaptability, it also presents challenges that need \nto be addressed  (Kim, 2023) . As such, \norganizations must carefully consider the \nimplications of AI and develop ethical frameworks \nto ensure its responsible and effective use in design \nand innovation. \n \n3. METHODOLOGY \nIn this section, we will outline the research \nmethodology used in the study. This includes the \ntype of data sources analysed, the time period of \nthe study, and the specific questions asked in the \ninterviews with UX designers, as well as some \ndetails of manager reports. The study involved a \nteam of five user experience (UX) designers, each \nwith at least 5 years of experience in the field. The \ndesigners were of various ages, ranging from late -\ntwenties to mid -forties, and were at different job \nlevels, including mid-level and senior UX designers. \nThe study was conducted by New Zealand Quality \nInnovation and Research (NZQRI), a private \ncompany specializing in providing con sultation in \ndesign, innovation, and research, and utilizing the \nDesign Thinking approach since early 2010. The \nresearchers and participants involved in the \nredesign and testing of the two mobile apps were \nall affiliated with NZQRI. \nThe study focused on re designing and testing two \nof the organization's previous mobile applications: \na disaster management system and a mental health \nA.AL-Sa’di, & D. Miller        International Journal on Technology, Innovation, and Management (IJTIM) 3(1) -2023-  4 \nhttps://doi.org/10.54489/ijtim.v3i1.195                                                                                                    Publisher: GAFTIM, https://gaftim.com \nassistance app. The application aimed to provide \ncritical information and assistance to communities \nin the event of a natural dis aster or emergency \nsituation. The second project focused on designing \na mental health support app that provides mental \nhealth resources and assistance to the people of \nNew Zealand, such as guided meditations, daily \nmood trackers, a directory of local menta l health \nprofessionals, and an anonymous forum for users \nto connect and share their experiences. \nThe interviews conducted with the UX designers \naimed to gather their perspectives and experiences \nwith using AI tools, specifically ChatGPT, in the \ndesign proc ess. The interviews were conducted \nfrom December 2022 to February 2023, and each \ninterview lasted for one hour, as shown in Table 1. \nDuring the interviews, the UX designers were \nasked semi -structured questions about their \nexperiences with using ChatGPT in the redesign \nprocess. The questions focused on how ChatGPT \nwas integrated into the design process, what types \nof tasks it was used for, and how it affected the \noverall project timeline. The UX designers were \nalso asked about the challenges they encountered  \nwhile using ChatGPT, such as issues with accuracy, \nrelevance, or suitability for the specific project. \nThe manager reports were generated by project \nmanagers within one New Zealand company and \ncovered a range of projects and initiatives, not just \nthe two mobile applications redesigned as part of \nthis study. The reports were produced between \nJanuary 2021 and February 2022, and each \nprovided an overview of the project's goals, \ntimeline, budget,  and key performance indicators  \n(KPIs). \nThe first data source was  team interviews, which \ntook place from December 2022 to February 2023 \nand involved five user experience (UX) designers \nwith at least 5 years of experience in the field. The \ntable lists examples of the types of questions asked \nduring the interviews, which focused on the \ndesigners' experiences with using ChatGPT in the \ndesign process, including any benefits or \nchallenges encountered, and their thoughts on the \nrole of AI tools in the future of UX design. \nThe second data source was product manager \nreports, which covered a period from January 2021 \nto February 2022 and included eight reports \nproduced by project product managers within one \nNew Zealand company. Table 1 provides examples \nof the information contained in these reports, \nwhich provided an overview of the goals, timeline, \nbudget, and key performance indicators (KPIs) of a \nrange of projects and initiatives within the \norganization, including the two mobile \napplications redesigned in the study. The reports \nalso included some commentary on the design \nprocess, although the level of detail varied \ndepending on the specific project. \n \n \n \n \nTable 1: Data Source\nType of data \nsource \nTime Evidence \nanalysed \nExamples  \nTeam \ninterviews \n01/12 2022 – \n01/02 /2023 \n5 interviews, 10  \nhr (two \ninterviews one \nhour each) \nHow did you find the experience of working with \nChatGPT? \nIn what ways did ChatGPT assist in the design process? \nDid using ChatGPT speed up the project process? If so, \nhow? \nWere there any challenges or limitations you \nencountered when using ChatGPT? \nHow do you see the role of AI tools like ChatGPT evolving \nin the field of UX design in the future? \nProduct \nManager \nreports \n01/12/2022 \n- \n06/02/2023 \n8 Reports The eight reports analysed in the study were all \nproduced by project Product Managers within one New \nZealand company. \nThe reports covered a range of projects and initiatives \nwithin the organization, not just the two mobile \napplications redesigned as part of the study. \nThe reports were generated between January 2021 and \nFeb 2022. \nEach report provided an overview of the project's goals, \nA.AL-Sa’di, & D. Miller        International Journal on Technology, Innovation, and Management (IJTIM) 3(1) -2023-  5 \nhttps://doi.org/10.54489/ijtim.v3i1.195                                                                                                    Publisher: GAFTIM, https://gaftim.com \ntimeline, budget, and key performance indicators (KPIs). \nThe reports also included some commentary on the \ndesign process, although this varied depending on the \nspecific project. \n4. FINDING AND DISCUSSION \nBased on the interviews and Product Manager \nreports, our study found that integrating AI tools \nsuch as ChatGPT into the product design process \ncan lead to significant improvements in efficiency, \ncreativity, and  user satisfaction. However, it is \nimportant to note that the successful \nimplementation of these tools requires a \ncombination of technological expertise and \ncreative design thinking. \n \nFigure 1: AI tools in Design Thinking \n4.1. Interview finding  \nThe interviews were aimed at exploring the role of \nChatGPT in the different phases of the Design \nThinking process, as well as its impact on product \ndesign outcomes and user satisfaction. In this \nsection, we present the findings of our interviews \nand discuss their implications for the use of AI tools \nin Design Thi nking. To achieve our goal, we \nconducted a series of semi -structured interviews \nwith designers and product managers who had \nexperience with Design Thinking and had used \nChatGPT in their work. \nOne major finding was that ChatGPT was \nparticularly useful in the ideation phase of product \ndesign. By generating new ideas and expanding \nupon existing ones, ChatGPT provided designers \nwith a wider range of options to consider, leading \nto more creative and innovative product designs. \nAs one designer stated, \"It [ChatGP T] helped us \nthink outside the box and come up with ideas \nwhich was very useful.\" \nThe experimental prototype redesigns also showed \nthe potential for ChatGPT to improve user \nsatisfaction. By incorporating user feedback into \nthe design process and using Chat GPT to generate \nand refine design features, the redesigned \nprototypes were more user -friendly and intuitive. \nThis was reflected in feedback from users, who \nreported greater ease of use and satisfaction with \nthe new designs. \nThe team began by using the desi gn thinking \nprocess to solve the pain points that could be \naddressed through a single app built with their \ncapabilities. They used the \"How Might We\" \ntechnique to solve the pain points and grouped \ntheir ideas using an \"Affinity Diagram\". They then \nprioritized the features by discussing which \nfeature had the most user value and least effort. \nThis highlights the initial steps taken by the team \nto solve the pain points of their target audience \nthrough the design thinking process. They used \nvarious techniques s uch as \"How Might We\" and \n\"Affinity Diagram\" to generate ideas and prioritize \nthem based on user value and effort. However, they \nfaced challenges in implementing a cohesive and \nuser-friendly design. \n\"With ChatGPT's involvement, the team was able to \nsignificantly improve the user interface design and \nreduce project time. Here's how ChatGPT made a \ndifference:\" \nThis emphasizes the impact of ChatGPT's \ninvolvement in improving the user interface design \nand reducing project time. The following points \nelaborate on how ChatGPT made a difference: \n\"Streamlined Design Thinking Process: ChatGPT \nhelped streamline the design thinking process, \nallowing the team to move from idea generation to \ndesign implementation more efficiently. By \nproviding suggestions and feedback on the team's \ndesign ideas, ChatGPT helped the team stay \nfocused on creating a user-friendly interface.\" \nFurthermore, throughout the study, ChatGPT was \n\nA.AL-Sa’di, & D. Miller        International Journal on Technology, Innovation, and Management (IJTIM) 3(1) -2023-  6 \nhttps://doi.org/10.54489/ijtim.v3i1.195                                                                                                    Publisher: GAFTIM, https://gaftim.com \nutilized to generate new design ideas and support \nthe ideation process. For example, we provided \ndetails an d ideas to ChatGPT, and then asked \nChatGPT to generate new design ideas. Table 2 \nshows the response from ChatGPT  \n \nTable 1:ChatGPT 3.5 generate new design ideas  \nDisaster Management System: \n Integrate real-time weather and emergency alerts to keep users informed of potential disasters in \ntheir area. \n Use ChatGPT to provide personalized emergency preparedness plans based on the user's location \nand needs. \n Implement a feature that allows users to report and t rack their safety status during a disaster, \nwhich can help emergency responders prioritize their efforts. \n Add a feature that allows users to connect with their neighbors or local community groups to \ncoordinate disaster response efforts. \n Utilize augmented reality to show users where the nearest evacuation routes, emergency shelters, \nand other important locations are during a disaster. \nMental Health Assistance App: \n Use ChatGPT to personalize mental health resources and support based on the user's individual \nneeds and goals. \n Implement a mood tracking feature that uses ChatGPT to suggest self -care activities or coping \nstrategies based on the user's current mood. \n Add a feature that connects users with mental health professionals for online counseling or therapy \nsessions. \n Incorporate gamification elements to make using the app feel more engaging and rewarding. \n Utilize machine learning algorithms to detect changes in the user's mood or behavior and provide \ntargeted support or intervention. \nThese are just a few ideas to get started with, but the possibilities are endless when combining AI and design \nthinking to support innovation. \n \nThis explains how ChatGPT streamlined the design \nthinking process, making it more efficient for the \nteam to move from idea generation to design \nimplementation. By providing suggestions and \nfeedback, ChatGPT helped the team stay focused on \ncreating a user-friendly interface. \n\"Improved Design Elements: ChatGPT \nrecommended the use of modern design elements \nand helped the team choose the right colour \nschemes and typography to make the app visually \nappealing and engaging. This led to a more \ncohesive and effective design that met the needs of \nthe target audience.\" \nThis highlights how ChatGPT improved the design \nelements of the app. They recommended modern \ndesign elements and helped the team choose the \nright colour schemes and typography to make the \napp visually appealing and engaging. This resulted \nin a more cohesive and effective design that met the \nneeds of the target audience. \n\"Faster Implementation: With ChatGPT's \nassistance, the team was able to implement the \ndesign more quickly, reducing project times and \nallowing the app to be launched more quickly.\" \nThis highlights how ChatGPT's involvement led to \nfaster im plementation of the design, resulting in \nreduced project times and a quicker launch of the \napp. \n \n4.2. Manger reports  \nThe Product Manager reports highlighted the \nsignificant value of AI tools such as ChatGPT in the \nDefine and Ideate stages of the design th inking \nprocess. While empathy is critical in understanding \nthe needs and wants of users, ChatGPT was found \nto be a useful asset in synthesizing data and \nanalysing observations to identify the core \nproblem. \nProduct Managers reported that ChatGPT enabled \nteams to analyse customer feedback and \nsynthesize that information into a clear and concise \nproblem statement quickly and accurately. By \nA.AL-Sa’di, & D. Miller        International Journal on Technology, Innovation, and Management (IJTIM) 3(1) -2023-  7 \nhttps://doi.org/10.54489/ijtim.v3i1.195                                                                                                    Publisher: GAFTIM, https://gaftim.com \nusing ChatGPT for data analysis, teams were able to \nmove forward into the Ideation phase with a solid \nfoundation for their  design thinking process. One \nProduct Manager reported, \"Using ChatGPT to \nanalyse customer feedback allowed us to identify \nthe most common pain points and concerns, giving \nus a clear problem statement to work from in the \nIdeation phase.\" \nMoreover, Product Managers reported that \nChatGPT was particularly useful in the Ideation \nphase of product design, where it helped designers \nto generate and refine design ideas. By using \nmachine learning algorithms to identify potential \nproduct features and designs, ChatGPT provided \ndesigners with a wider range of options to \nconsider, leading to more creative and innovative \nproduct designs. One Product Manager stated, \n\"ChatGPT was invaluable in the Ideation phase. It \nhelped us to generate ideas we never would have \nthought of on our own and to refine those ideas \nbased on user feedback.\" \nThe reports also indicated that AI tools such as \nChatGPT can help teams to work more efficiently \nby streamlining the design thinking process. By \nproviding a reliable and accurate analysis of \ncustomer feedback, ChatGPT helped teams to save \ntime and resources in the Define stage of the design \nthinking process. Additionally, by generating and \nrefining design ideas, ChatGPT helped teams to \nmove more quickly through the Ideation phase. As \none Product Manager noted, \"Using ChatGPT in the \ndesign thinking process helped us to work more \nefficiently and effectively. It allowed us to move \nmore quickly through the initial stages of product \ndesign, giving us more time to focus on the details \nin the later stages.\" \nThe Product Manager reports provided additional \nsupport for the positive impact of integrating AI \ntools such as ChatGPT into the product design \nprocess. However, they also highlighted the \nimportance of a collaborative approach that \ncombines technologic al expertise with creative \ndesign thinking. \nWhile ChatGPT was found to be most useful in the \nDefine and Ideate stages of design thinking, \nProduct Managers emphasized the crucial role of \nempathy in the overall process. Empathy allows \ndesigners to gain real insight into users and their \nneeds, and to set aside their own assumptions \nabout the world. Therefore, some Product \nManagers were hesitant to rely too heavily on AI \ntools in the empathy stage, as they felt it could \nundermine the human -cantered approach as \nshown in figure 1. \nHowever, when used in conjunction with human \nexpertise, ChatGPT  was seen as an asset for \nanalysing customer feedback, synthesizing \ninformation, and identifying core problems. This \nallowed designers to move forward into the \nIdeation phase with a solid foundation for the \ndesign thinking process, as one Product Manager \nnoted. Furthermore, the experimental prototype \nredesigns showed that ChatGPT could help \ndesigners generate and refine design features \nbased on user feedback, ultimately leading to \ngreater user satisfaction. \nDespite the benefits of AI tools, Product Managers  \nacknowledged the importance of human creativity \nand expertise in product design. As one Product \nManager stated, \"AI tools like ChatGPT can be \npowerful assets, but they are only as good as the \nhuman behind them.\" Designers must leverage \ntheir own creativit y and expertise to ensure that \nthe use of AI tools enhances the overall product \ndesign process. \nIn particular, the Prototype and Testing stages \nwere noted as important areas where human \nexpertise is critical. Product Managers stressed the \nimportance of hum an decision -making in testing \nand iterating on designs, as AI tools may not always \nbe able to account for the nuances of user \nexperience. As one Product Manager stated, \"We \nneed to balance the use of AI tools with human \njudgement to ensure that our designs  are not only \nefficient, but also intuitive and user-friendly.\" \n \n5. CONCLUSION \nThe study reveals that applying Design Thinking to \nthe R&D phase can lead to a more structured and \ncreative approach to early research, which in turn \nimproves the likelihood of successful innovation. \nBy examining this case, the article highlights the \npotential of AI and Design Thinking to support \ninnovation, even in the face of advanced \ntechnologies, distant markets, and unidentified \nuser needs. Overall, this study provides valua ble \ninsights into the application of AI and Design \nThinking principles to the research phase of \ninnovation within the New Zealand context. \nOne limitation of this study is the small sample size \nof interviewees and Product Manager reports. \nWhile the findings were consistent across \nA.AL-Sa’di, & D. Miller        International Journal on Technology, Innovation, and Management (IJTIM) 3(1) -2023-  8 \nhttps://doi.org/10.54489/ijtim.v3i1.195                                                                                                    Publisher: GAFTIM, https://gaftim.com \nparticipants, a larger sample size would provide \nmore robust data and potentially uncover \nadditional insights. \nAnother limitation is the limited scope of the \nexperimental prototype redesigns. The study only \nfocused on one product and one set of design \nfeatures, and the impact of ChatGPT on other \nproducts and design features may differ. \nAdditionally, the study did not e xplore the ethical \nconsiderations of integrating AI tools into the \ndesign process, such as data privacy and bias. \nFuture research should address these ethical \nconcerns to ensure the responsible and ethical use \nof AI in product design. \nFinally, while the st udy focused on the use of \nChatGPT specifically, there are many other AI tools \navailable that could potentially provide different \nbenefits and limitations. Further research could \nexplore the use of other AI tools in the design \nthinking process and compare t heir effectiveness \nto ChatGPT. \nfuture research can further explore the potential of \nintegrating AI tools like ChatGPT with design \nthinking in other areas of product design and \ndevelopment, such as marketing and customer \nservice. Additionally, further inves tigation can be \ndone on the potential ethical implications of using \nAI tools in the design thinking process, particularly \nin terms of bias and privacy concerns. Finally, \nlongitudinal studies can be conducted to examine \nthe long-term impact of integrating AI tools into the \ndesign thinking process on product success and \nuser satisfaction. \nIn conclusion, while integrating AI tools such as \nChatGPT into the product design process can lead \nto significant improvements in efficiency, \ncreativity, and user satisfacti on, it is important to \napproach their use with a balanced perspective. \nCombining technological expertise with creative \ndesign thinking, empathy, and human decision -\nmaking is critical for successful implementation. As \none Product Manager put it, \"AI is a to ol, not a \nsolution.\" \n \n \nREFERENCES \nArif, T. Bin, Munaf, U., Ul-Haque, I., 2023. The future of medical \neducation and research: Is ChatGPT a blessing or blight \nin disguise? Med. Educ. Online 28, 2181052. \nChasanidou, D., Gasparini, A.A., Lee, E., 2015. Design thinking \nmethods and tools for innovation, in: Lecture Notes in \nComputer Science (Including Subseries Lecture Notes in \nArtificial Intelligence and Lecture Notes in \nBioinformatics). pp. 12–23. \nChubb, J., Cowling, P., Reed, D., 2022. Speeding up to keep up: \nexploring the use of AI in the research process. AI Soc. \n37, 1439–1457. \nEnholm, I.M., Papagiannidis, E., Mikalef, P., Krogstie, J., 2022. \nArtificial Intelligence and Business Value: a Literature \nReview. Inf. Syst. Front. 24, 1709–1734. \nGao, J., Zhao, H., Yu, C., Xu, R., 2023. Exploring the Feasibility of \nChatGPT for Event Extraction. \nHaleem, A., Javaid, M., Singh, R.P., 2022. An era of ChatGPT as a \nsignificant futuristic support tool: A study on features, \nabilities, and challenges. BenchCouncil Trans. \nBenchmarks, Stand. Eval. 2, 100089. \nIsmail, I., 2022. Entrepreneurs’ competencies and \nsustainability of small and medium enterprises in \nTanzania. A mediating effect of entrepreneurial \ninnovations. Cogent Bus. Manag. 9. \nKalla, D., Candidate, D., Carolina, N., Smith, N., Candidate, D., \n2023. Study and Analysis of Chat GPT and its Impact on \nDifferent Fields of Study 8, 827–833. \nKim, S. -G., 2023. Using ChatGPT for language editing in \nscientific articles. Maxillofac. Plast . Reconstr. Surg. 45, \n13. \nLevy, M., Huli, C., 2019. Design thinking in a nutshell for \neliciting requirements of a business process: A case \nstudy of a design thinking workshop, in: Proceedings of \nthe IEEE International Conference on Requirements \nEngineering. pp. 351–356. \nLo, C.K., 2023. What Is the Impact of ChatGPT on Education? A \nRapid Review of the Literature. Educ. Sci. 13. \nLund, B.D., Wang, T., 2023. Chatting about ChatGPT: how may \nAI and GPT impact academia and libraries? Libr. Hi Tech \nNews 40. \nMalefane Sekoboto, S., Mazanai, M., 2022. A Design Thinking \nFramework for Circular Business Model Innovation \namong South African SMEs A K Design Thinking \nFramework for Circular. Bus. Model Innov. among South \nAfrican SMEs JDT 3, 19–36. \nMicheli, P., Wilner, S.J.S., Bhatti, S.H., Mura, M., Beverland, M.B., \n2019. Doing Design Thinking: Conceptual Review, \nSynthesis, and Research Agenda. J. Prod. Innov. Manag. \n36, 124–148. \nSakirin, T., Ben Said, R., 2023. User preferences for ChatGPT -\npowered conversational interf aces versus traditional \nmethods. Mesopotamian J. Comput. Sci. 24–31. \nShaji George, A., Hovan George, A., Martin, Asg., 2023. Partners \nUniversal International Innovation Journal (PUIIJ) A \nReview of ChatGPT AI’s Impact on Several Business \nSectors 9–23. \nVerganti, R., Vendraminelli, L., Iansiti, M., 2020. Innovation and \nDesign in the Age of Artificial Intelligence. J. Prod. Innov. \nManag. 37, 212–227. \nVerma, M., 2023. Novel Study on AI -Based Chatbot (ChatGPT) \nImpacts on the Traditional Library Management. \nXu, W., 2019. Toward human-centered AI: A perspective from \nhuman-computer interaction. Interactions 26, 42–46. \nZhai, X., 2023. ChatGPT User Experience: Implications for \nEducation. SSRN Electron. J. \n ",
  "topic": "Creativity",
  "concepts": [
    {
      "name": "Creativity",
      "score": 0.7600029706954956
    },
    {
      "name": "Process (computing)",
      "score": 0.5865510702133179
    },
    {
      "name": "Computer science",
      "score": 0.5662504434585571
    },
    {
      "name": "Design thinking",
      "score": 0.5661070942878723
    },
    {
      "name": "Product design",
      "score": 0.4931330382823944
    },
    {
      "name": "Product (mathematics)",
      "score": 0.48199954628944397
    },
    {
      "name": "Knowledge management",
      "score": 0.45922011137008667
    },
    {
      "name": "Engineering design process",
      "score": 0.4487322270870209
    },
    {
      "name": "New product development",
      "score": 0.42581576108932495
    },
    {
      "name": "Management science",
      "score": 0.3357788920402527
    },
    {
      "name": "Human–computer interaction",
      "score": 0.31307244300842285
    },
    {
      "name": "Engineering",
      "score": 0.23477688431739807
    },
    {
      "name": "Psychology",
      "score": 0.18685027956962585
    },
    {
      "name": "Management",
      "score": 0.08612290024757385
    },
    {
      "name": "Social psychology",
      "score": 0.0
    },
    {
      "name": "Operating system",
      "score": 0.0
    },
    {
      "name": "Geometry",
      "score": 0.0
    },
    {
      "name": "Mechanical engineering",
      "score": 0.0
    },
    {
      "name": "Mathematics",
      "score": 0.0
    },
    {
      "name": "Economics",
      "score": 0.0
    }
  ]
}