{
  "title": "Evaluating the wear of cutting tools using a tunnel boring machine laboratory simulator",
  "url": "https://openalex.org/W4382795528",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A5092375655",
      "name": "Hamid Mousapour",
      "affiliations": [
        null
      ]
    },
    {
      "id": "https://openalex.org/A5091714203",
      "name": "Hamid Chakeri",
      "affiliations": [
        null
      ]
    },
    {
      "id": "https://openalex.org/A5052948010",
      "name": "Mohammad Darbor",
      "affiliations": [
        null
      ]
    },
    {
      "id": "https://openalex.org/A5052614779",
      "name": "Amin Hekmatnejad",
      "affiliations": [
        null
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2142889660",
    "https://openalex.org/W1977279941",
    "https://openalex.org/W2281847179",
    "https://openalex.org/W3143904120",
    "https://openalex.org/W2557051539",
    "https://openalex.org/W2999278930",
    "https://openalex.org/W2138904753",
    "https://openalex.org/W3183275011",
    "https://openalex.org/W2072342670",
    "https://openalex.org/W2971260331",
    "https://openalex.org/W2755549691",
    "https://openalex.org/W1980701551",
    "https://openalex.org/W2883525747",
    "https://openalex.org/W3215547661",
    "https://openalex.org/W3043248445",
    "https://openalex.org/W2439530623",
    "https://openalex.org/W2790088252",
    "https://openalex.org/W4285792136",
    "https://openalex.org/W3009166278",
    "https://openalex.org/W1890996470",
    "https://openalex.org/W2093346029"
  ],
  "abstract": "Purpose. One of the most common problems in mechanized excavation is the cutting tool wear, which has a great impact on the final cost of the project and its duration. Also, one of the most important factors affecting the wear of cutting tools is the operating parameters of the tunnel boring machine (TBM). Within the framework of this research, a tunnel boring machine laboratory simulator was designed and constructed to investigate the tunnel excavation process in the laboratory. Methods. A few of the features of this device are that it operates horizontally, has a low rotation speed, keeps the pins in contact with fresh soil throughout the test, and has the possibility of measuring the torque of the device during the test. A study of the cutting tool wear was conducted using granulation prepared from Tabriz metro line 2, as well as using operating parameters of mechanized excavation machines, such as penetration rate and cutter head rotation speed. Findings. The research results showed that by reducing the rotation speed of the cutter head from 35 to 10 rpm, the average wear of cutting tools is reduced by 63%. Also, by reducing the excavation time from 80 to 10 minutes, the cutting tool wear is reduced by 58%. The wear of cutting tool increases with increasing moisture content from 0 to 10%, and then decreases with increasing moisture content from 10 to 25%. Originality. During this research, a new device was designed and built to simulate tunnel excavation mechanisms. This laboratory simulator measures wear percentage, penetration rate and torque. Practical implications. There has been significant progress in predicting soil abrasion rates, but there are few accepted models for predicting cutting tool wear and soil abrasion rates. During the design and construction of the tunnel boring machine laboratory simulator, the effect of operating parameters on wear of cutting tool was examined.",
  "full_text": " \nVolume 17 (2023), Issue 2, 28-34 \n \n________________________________ \nReceived: 14 December 2022. Accepted: 21 April 2023. Available online: 30 June 2023 \n© 2023. H. Mousapour, H. Chakeri, M. Darbor, A. Hekmatnejad \nMining of Mineral Deposits. ISSN 2415-3443 (Online) | ISSN 2415-3435 (Print) \nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License (http://creativecommons.org/licenses/by/4.0/), \nwhich permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited. \n28 \nhttps://doi.org/10.33271/mining17.02.028 \nEvaluating the wear of cutting tools using a tunnel boring \nmachine laboratory simulator \nHamid Mousapour1\n  \n, Hamid Chakeri1\n  \n, Mohammad Darbor1*\n  \n, Amin Hekmatnejad2\n  \n \n1 Sahand University of Technology, Tabriz, Iran \n2 Pontificia Universidad Católica de Valparaíso, Valparaíso, Chile \n*Corresponding author: e-mail darbor@sut.ac.ir \nAbstract \nPurpose. One of the most common problems in mechanized excavation is the cutting tool wear, which has a great impact \non the final cost of the project and its duration. Also, one of the most important factors a ffecting the wear of cutting tools is the \noperating parameters of the tunnel boring machine (TBM). Within the framework of  this research, a tunnel boring machine \nlaboratory simulator was designed and constructed to investigate the tunnel excavation process in the laboratory. \nMethods. A few of the features of this device are that it operates horizontally, has a low rotati on speed, keeps the pins in \ncontact with fresh soil throughout the test, and has the possibility of measuring the torque of the device duri ng the test. A study \nof the cutting tool wear was conducted using granulation prepared from Tabriz metro line 2, as well as using operating parame-\nters of mechanized excavation machines, such as penetration rate and cutter head rotation speed. \nFindings. The research results showed that by reducing the rotation speed of the cutter head from  35 to 10 rpm, the average \nwear of cutting tools is reduced by 63%.  Also, by reducing the excavation t ime from 80 to 10 minutes, the cutting tool wear is \nreduced by 58%. Th e wear of cutting tool increases with increasing moisture content from 0 to 10%, and then decreases with \nincreasing moisture content from 10 to 25%. \nOriginality. During this research, a new device was designed and built to simulate tunnel excavation mechan isms. This la-\nboratory simulator measures wear percentage, penetration rate and torque.  \nPractical implications.  There has been significant progress in predicting soil abrasion rates, but there are few a ccepted \nmodels for predicting cutting tool wear and soil abrasion rates. During the design and construction of the tunnel boring ma-\nchine laboratory simulator, the effect of operating parameters on wear of cutting tool was examined. \nKeywords: mechanized excavation, cutting tool wear, penetration rate, cutter head rotation speed, torque \n \n1. Introduction \nEarth pressure balance (EPB) mechanized excavation \nmachines are widely used in tunneling in urban areas and on \nsoft ground. These machines ar e preferred over  normal tun-\nneling in the soft ground due to the advantages of high pene-\ntration rate and minimiz ed environmental effects. The chal-\nlenging excavation activity due to high risks such as surface \nsettlement, structure damage and low penetration rate caused \nby the diversity of soil types along the excavation route  re-\nquires special measures to be studied and implemented [1]. \nThe schedule and cost estimation for various tunneling pro-\njects are directly influenced by the ability to predict tool wear \nwhen tunneling in pressurized soft ground using EPB and \nslurry shields. Effective planning for dealing with primary and \nsecondary wear on the machines , from machine design and \nfabrication to site management, is a key element for the suc-\ncess of projects [2]. Presently, evaluation of soil abrasivity is \nnot standard or unified. Most of the processes used are com-\nplex index processes that use highly simplified models and test \nconditions. These processes can measure the efficiency of the \nwear mechanism and are no t able  to refl ect the bonding \nstrength of the inner fabric, which is an essential factor  in \ndetermining the level of operational demands, i.e., the re-\nsistance to excavation [3]. Wear occurs not only in excavation \ntools, but also in the cut ter head and shie ld, screw conveyors \non EPB TBMs, slurry pipes, valves and pumps on TBMs [4]. \nTool life may be lower in the area of the cutter head center \ndue to the clogging and its adverse effect on cutting perfor-\nmance. A study of the wear of the EPB machine scrapers in the \nactive and passive mode of excavation shows that tool wear is \nhigher in an active mode. The difference in tool wear between \nactive and passive excavation modes can be up to 50% [5]. \nThe wear risks associated with various machine parts de-\npend on a variety of factors, including geological conditions, \nmachine characteristics, and operational factors (Table 1) [6]. \nThe LCPC rock abrasivity test was carried out by Abu \nBakar et al. (2020) using two different sample preparatio n \nmethods to study the ef fect of grain angularity. Preliminary \ntest results for both test modes show an increase in the LCPC \nabrasivity coefficient with an increase in the grain angularity  \nachieved after crushing and mixing of the sample in propor-\ntion to the original rounded grain fraction [7]. \nH. Mousapour, H. Chakeri, M. Darbor, A. Hekmatnejad. (2023). Mining of Mineral Deposits, 17(2), 28-34 \n \n29 \nTable 1. Parameters influencing tool wear in EPB tunneling [6] \nParameters influencing tool wear in EPB tunneling \nGeological  \nconditions \nSoil and rock type \nGrain size distribution \nGrain roundness \nEquivalent quartz \nDensity \nAbility/Cutability \nInhomogeneity \nWater table \nMachine  \ncharacteristics \nExcavation machine type \nThe number of cutting tools  \nPlanning cutting tools  \nHardness of cutting tool  \nCutter shape \nThe number of foam nozzles  \nPosition of foam nozzles  \nOperational \nfactors \nThrust and torque \nPenetration rate \nRotation speed of cutter head \nChamber confining pressure \nSoil conditioning parameters \nAdditive type  \nCutter head inspection \n \nThe LCPC test was used by Thuro and Kasling (2009 ) to \nstudy and classify soil and rock wea r [8]. Zhang et al. (2021) \ninvestigated the alloy hardness  effect on c utting tool wear \nand found that wear extent increases as alloy hardness de-\ncreases [9]. Jakobsen and Lohne (2013 ) examined abrasivity \nproperties at different moisture conten ts in a soil s ample and \nfound that weight loss of steel tools increase s with an in-\ncrease in water content from 0  to 8%, and decrease s with an \nincrease in water con tent from 8  to 25%  [10]. Rong et al. \n(2019) evaluated cutter wea r from operational parameters in \nEPB tunneling of Chengdu Metro, then developed quantitative \nrelationships between two input variables and cutter wear. It \nwas found that the average torque was 2000-4500 kN·m, and \nwith an increase in the number of rings, the cutter head \ntorque increases [11]. \nWithin the framework  of the relevant system properties, \nDullman et al. (2014 ) examined whether model mill tests \nwith simplified tools, such as the LCPC test, can approxi-\nmate the wear mechanism efficiency. Due to the test method, \ninfluences on th e results  are inevitable, for example , dis-\nturbed soil with altered grain size and shape, propeller geom-\netry, and operator influence. In this case, it seems rational to \nrely instead on conventional geot echnical-mineralogical \nparameters, which are usually we ll-standardized and easily \nreproducible. In th is case, quartz content, grain angularity, \nand grain size are relevant parameters  [3]. Rostami et al. \n(2012) developed a soil abrasivity test for tunneling in soft \nground using shie ld machines with Penn state soil abrasion \ntesting device. The value of tool wear and weight loss in-\ncreases significantly to an apparent maximum from a dry \nsample to the soil condition that is only wet, in this case at a \nwater content  of 7.5%.  But, when the moisture content ex-\nceeds 7.5%, the measured weight loss decreases  [2]. Jakob-\nsen et al. (2013)  recorded wear on soil samples . They show \nthat wear  increases with increasing  rotation speed . The soil \nmoisture influences the wear ( weight loss) of steel when \nexcavating soft ground in the new SGAT appara tus up to  \n500%. Proper application of correct soil conditioning can in \nsome cases reduce torque by up to 40%  [10]. The effect of \ngeomechanical properties on Cerchar Abrasivity Index (CAI) \nand its application for tunnelling was st udied by Young Ko \net al. (2 016) who found that the variation of CAI has the \ngreatest effect on disc cutter life predictions  [4]. Based o n \nexperimental pe rformance prediction models developed by \nAvunduk and Copur (2018), cutter head  torque increases as \nthe vane shear strength  and consistency index increase . The \nthrust force also decreases as the penetration depth of the fall \ncone increases. With an increase  in the plastic limit, the con-\nsistency index,  fall cone penetration depth  and the instanta-\nneous cutting rate decrease . A higher pl astic limit, a higher \nplasticity index, as well as a higher liquid limi t all result in  \nan increase  in the field -specific energ y. When  soil samples \nwere grouped according to their consistency index values, it \nwas observed that the average field-specific ene rgy values \nincrease with increasing consistency index [12]. \nAccording to Tarigh Azali et al. (201 2), in underground \nstructures, clay soils can clog machines and adhere to steel \nsurfaces of machines, significantly reducing their efficiency. \nAccording to th is study, no high risk of clogging was found \nalong the proposed tunnel route [13]. As shown by Amoun et \nal. (2017), low penetration rates at high face pressure in-\ncrease tool wear. Based on the results, tool wear can be re-\nduced by optimizing soil conditioni ng as well as other opera-\ntional parameters such as earth pressure, ma chine torque, \nthrust, penetration rate, and rotation speed [6]. The effect of \nmoisture content on the LCPC test results and tool wear in \nmechanized tunneling was studied by  Abu Bakar et a l. \n(2018) [14]. According to Lee et al. (2022), an increase in \nFoam Injection Ratio (FIR) is associated with a decrease in \nwear of cutting tools  [15]. According to Sun et al. (2020), \nparticle size distribution, test time, and moisture con tent \naffect the LCPC abrasivity tests of the sandy stratum. By \ndrying out or raising the soil moisture content than its satu-\nrated moisture content, the abrasivity of the soil can be re-\nduced [16]. According to Kupperle et al. (2 018, 2016), pin \nwear increases sharply as water  content increases. The \nweight loss decreases as the water content increases to 15% \nand then remains nearly constant until 25% water content. It \nis also shown that with a decreasing penetration rate, weight \nloss increases [17], [18]. According to Tang et al.  (2022), an \nappropriate water content facilitates redistribution of sand \nparticle and increase s cutter head torque, whereas excessive \nwater content damages the contacts between scrapers and \nsand particles and decreas es cutter head  torque. With an \nincrease in water content, scraper wear first increases and \nthen decreases  [19]. According to Lan et al. (2020), inner \ndisc cutter wear rate is linearly related to the position of the \ncutter head . They examine the relationship between wear \ncapacity and penetration  in terms of  rock UCS, as well as  \nthrust in view of the factors af fecting disc cutter wear \nrate [20]. According to Pelia et al. (2016), the machine \ntorque increases continuously with increasing test time [21]. \nDespite progress in predicting soil abrasi vity, only a few \nmodels have been  recognized for predicting cutting tool \nwear caused by soil abrasion  and operational parameters of \nexcavation machine . This study focuses on examining the \nimpact of machine operating parameters , such as cutter \nhead rotation spe ed, cutter head torque, penetration rate  and \nrotation time , on cutting tool wear while creating a labora-\ntory simulator for tunnel boring machines. To achieve this \ngoal, samples from Tabriz metro line 2 were used at  \nvarying moisture levels  of 5, 10, 15 and 20%. \nH. Mousapour, H. Chakeri, M. Darbor, A. Hekmatnejad. (2023). Mining of Mineral Deposits, 17(2), 28-34 \n \n30 \n2. Materials and methods \nIn the  laboratory of the Sahand University of Technolo-\ngy, a tunnel boring machine laboratory simulator was devel-\noped to simulate tunnel excavation mechanisms ( Fig. 1). It is \npossible to determine the abrasion and wear of  cutting tools \nin the cutter head using this device. \n \n \nFigure 1. Overview of the tunnel boring machine laboratory simu-\nlator: shaft and excavation chamber,  torque meter, mo-\ntor and gearbox, pneumatic jack, and air compressor \nThis device has a horizontal o peration, is ca pable of in-\njecting additives, is continuously in contac t with fresh soil, \nand has a cutter head similar to the TBM cutter head, which \nincludes central, middle and external cutting tools, as well as \nthe ability to adjust the penetration rate and rotation sp eed, \nrepresenting to a large extent  the excavation cond itions in a \ntunnel. Figures 2-4 illustrate the components of the laborato-\nry simulator fo r tunnel boring machines, including the shaft \nand excavation chamber, torque meters, gearboxes, pn euma-\ntic jacks, and air compressors. \n \n \nFigure 2. Excavation shaft inc luding spring, polyethylene piece,  \nand cutter head \n \nFigure 3. Schematic view of the excavation chamber \n \nFigure 4. Overview of the cutter head \nThe laboratory simulator for tunnel bo ring machines has \nfive measurable parameters, as shown in Table 2. \nThe samples were obtained from the western area of the \nTabriz city, the excavation site of the 5 th station of the Tabriz \nmetro line 2. The Tabriz metro line 2 extends from the west \nof Tabriz to the east of Tabriz with a length of 22.4 km. \nTable 2. Parameters of t he tunnel boring machine laboratory \nsimulator that can be measured \nQuantity Parameters \n15 pins  Excavation pins \n1-35 Rotation speed (rpm) \n0-300 Excavation range (mm) \nVariable Penetration rate \nVariable Torque \n0.001-19.5 Maximum grain size (mm) \nwhen adding soil Consolidation of soil \nAdding continuously \nduring the test Additives \nSteel Cutting tool material \n \nAs a result of exploration and geological studies conducted \nin this ar ea, fine-grained clay and silty alluvium occur in the \nsediments. In addition to fine-grained alluvial sediments, there \nare also sand layers, but the tunnel often passes through these  \nfine-grained alluvial sediments. According to Plinninger et al. \n(2003), the percentage of abrasive minerals in the tunnel route of \nthe Tabriz metro line 2 is between 5 and 20% [22]. Soil sample \nwas granulated using the dry technique (Fig. 5) and standard of \nASTM D 422-87 [23]. Figure 6 displays the grain size distribu-\ntion of the samples chosen to conduct the wear tests. \n \n \nFigure 5. Granulation of the sample prepared from the 5 th station \nof the Tabriz metro line 2 \n20\n30\n40\n50\n60\n70\n80\n90\n100\n0.0001 0.001 0.01 0.1 100\nPercent passing\nGrain size (mm)\n10\n0\n1 10\n \nFigure 6. The grain size distribution of the soil sample \nThe impact of soil moisture content,  cutter head  torque, \ncutter head rotation speed, excavation duration, and penetra-\ntion rate on cutting tool wear was investigated using 4 3 sepa-\nrate tests (Table 3). \nIn order to study the wear of cutti ng tools, t he laboratory \ntests were performed using tunnel boring machine laboratory \nsimulator. This new device is able to reproduce the excava-\ntion conditions of a tunnel to a large extent. \nH. Mousapour, H. Chakeri, M. Darbor, A. Hekmatnejad. (2023). Mining of Mineral Deposits, 17(2), 28-34 \n \n31 \nTable 3. Description of the tests performed on different samples \nTest \nNo. \nSoil moisture \ncontent (%) \nRotation speed \nof cutter head \n(rpm) \nExcavation \ntime (min) \nPenetration \nrate \n(mm/min) \n1-36 10 10, 15, 20, 25, \n30 & 35 \n10, 20, 30, \n40, 60 & 80 \n2.5, 3.3, 5, \n6.6, 10 & 20 \n37-40 5,10,15 & 20 35 40 5 \n41-43 5,10,15 & 20 35 60 5 \n3. Results and discussion \nIn this pape r, using the tunnel boring m achine laboratory \nsimulator, the influence of the excavation machine  operating \nparameters on the wear of the cutting tools  has been studied. \nFor this purpose, 3 6 different tests were performed on sam-\nples prepared with 10% moistu re content. The cutting tool \nwear is measured by their primary and secondary weighing \naccording to the following Equation: \n100%.\nWear percentageof cutting tool\nPrimary weight Secondary weight\nPrimary weight\n=\n−=\n          (1) \nThe study found that the wear of cutting tools is influ-\nenced by the excavation machine operating parameters. \n3.1. Effect of cutter head rotation speed \non cutting tool wear \nResearch conducted in recent years show s that the cutter \nhead rotation speed has a significant effect on the wear of \ncutting tools. Therefore, more research is required to achieve \nthe balance between improving machine performance an d \nreducing costs associated with tool wear. In this research, the \ncutter head rotation speed was examined in 36  tests to deter-\nmine how it affects wear of cutting tools using a tunnel bor-\ning machine laboratory simulator on samples prep ared with a \n10% moisture content and a density of 1.8  g/cm3. Tests were \nconducted at six rotation speeds of 10, 15, 20, 25, 30  and 35 \nrpm and excavation times of 10, 20 , 30, 40, 60  and 80 \nminutes. The results obtained, according to Figure 7, with an \nincrease in the cutter  head rotation speed , the cutting tools \nwear out more, because they collide with soil particles more \nfrequently. Due to the cohesiveness of soil particles with \neach other, cutting tools in cohesive soils are  also subjected \nto highe r contact pressures with the so il, resulting in an in-\ncreased wear rate of the cutting tools. \n \n0 0.\n0 2.\n0 4.\n0 6.\n0 8.\n1 0.\n1 2.\n1 4.\n1 6.\n5 15 25 35 45\nAvarage wear percentage\nCutter head rotaion speed (rpm) \n80 inM\n60 inM\n40 inM\n30 inM\n20 inM\n1 n0 Mi\n \nFigure 7. Effect of cutter head rotation speed and excavation time \non cutting tool wear \nAccording to the obtained results, with an increase in the \ncutter head rotation speed from 10 to 35  rpm, the wear of \ncutting tools has a relatively constant increase throughout the \nentire excavation times. By increasing the cutter head rotation \nspeed from 10 to 35 rpm, wear increases by more than 150%. \n3.2. Effect of penetration rate on cutting tool wear \nIn tunneling, one of the most important factors is the pen-\netration rate of the excavation machine. Increasing penetra-\ntion can increase excavation rate, but can also cause cutting \ntools to engage with soil particles under greater pressure. As \na result, the excavation machine torque increases. One of the \nimportant challenges in tunnel excavation projects is to de-\ntermine the appropriate penetration rate , taking into account \nthe increased excavation rate and the reduced machine torque \nto reduce the excavation cos t. In the previous section,  36 \ntests were prepared , which were also used to determine how \nthis affects th e wear of cutting tools , using a tunnel boring \nmachine laboratory simulator on samples prepared with 10% \nmoisture con tent and density of 1.8  g/cm3, in 6 penetration \nrates of 2.5, 3.3, 5, 6.6 , 10 and 20  mm/min with rotation \nspeeds of 10, 15, 20, 25, 30 and 35 rpm. \nFigure 8 shows the results of tests performed with differ-\nent rotation speeds and penetration rates. \n \n0 0.\n0 2.\n0 4.\n0 6.\n0 8.\n1 0.\n1 2.\n1 4.\n1 6.\n0 5 10 15 20 25\nAvarage wear percentage\nPenetration ratio (mm/min)\n3 m5 Rp\n3 m0 Rp\n2 m5 Rp\n2 m0 Rp\n1 m5 Rp\n1 m0 Rp\n \nFigure 8. Effect of penetration rate and  rotation speed on cutting \ntool wear \nIt is shown that  under the same excavation conditions, a \nreduction in penetration rate decreases the cutting tool \nwear, because  the excavation time is reduced  and t he en-\ngagement of cutting tools with soil particles is r educed. At \nall speeds of th e cutter head  rotation, the  cutting tool wear \ndecreases relatively constant ly with an increase in penetra-\ntion rate from 2.5 to 20  mm/min. The average wear per-\ncentage of cutti ng tool decreases by 58 % with increasing \npenetration ra te from 2.5 to 20 mm/min . \n3.3. Effect of excavation machine torque \non cutting tool wear \nThe excavation machine torque plays an important role in \nthe cost of excavation projects. The excavation machine \ntorque depends on factors such as penetration rate, soi l mois-\nture content, soil physical properties, cutter head shape, and \ncutter head  rotation speed. An increase in torque  due to the \nincrease in pressure on the excavation machine  causes an \nincrease in th e costs relat ed to the maintenance of the ma-\nchine, and the costs related to the increased wear of the cut-\nting tools and the cutter head.  \nH. Mousapour, H. Chakeri, M. Darbor, A. Hekmatnejad. (2023). Mining of Mineral Deposits, 17(2), 28-34 \n \n32 \nTo investigate the effect of the excavation machine \ntorque on the cutting tool wear, excavation was made for 10, \n20, 30, 40, 60, and 80 minutes (Fig. 9). \n \n0 0.\n0 2.\n0 4.\n0 6.\n0 8.\n1 0.\n1 2.\n1 4.\n1 6.\n5 15 25 35 45 55 65\nAvarage wear percentage\nTorque (N.m)\n8 n0 Mi\n60 M ni\n4 n0 Mi\n3 n0 Mi\n20 M ni\n1 n0 Mi\n \nFigure 9. Effect of machine torque on cutting tool wear \nThe results obtained from the tests show that with in-\ncreasing torque of the tunnel boring machine laboratory \nsimulator, the cutting tool wear decreases by about 60%. \n3.4. Effect of soil moisture content on cutting tool wear \nAnother parameter affecting the cutting tool wear is soil \nmoisture content. Studies have shown that the cutting tool \nwear increases with increasing soil moisture content up to a \ncertain value, and then decreases. To investigate the effect of \nsoil m oisture content on the cutting tool wear, 4 tests were \nperformed under the same conditions, with a rotation speed \nof 35 rpm, excavation time of 6 0 minutes and a soil density \nof 1.8 g/cm3. Soil moisture contents were 5, 10, 15, and 20%. \nAlso, for a more det ailed investigation, 4 other tests were \nperformed with the same specifications during the excavation \ntime of 40 minutes. The results show that the wear of cutting \ntools increases, at first, up to 10% m oisture content (Fig. 10) \nas a result of increased soil adhesion and increased engage-\nment between cutting tools and soil grains. \n \n0 0.\n0 2.\n0 4.\n0 6.\n0 8.\n1 0.\n1 2.\n0 5 10 15 20 25\nAvarage wear percentage\nM ist  o ure content\n60 Min\n40 Min\n \nFigure 10. Effect of soil moisture content on cutting tool wear in \ndifferent time periods \nThe cutting tool  average wear decreases when the mois-\nture content increases above 10% , b ecause soil grains be-\ncome more mobile and buoyant with increasing soil mois-\nture; this leads to a decrease in the average wear of cutting \ntools. Thus, when the soil structure approaches saturation, \nthe grains are surrounded by water particles, which leads to \nerosion of the continuous soil structure. In addition, coarse \nand abrasive particles become looser and less resistant to \nmovement, reducing tool wear. According to the experiments, \nwith an increase in moisture content from 10 to 20%, the aver-\nage percentage of wear of cutting tools decreases by 80%. \n3.5. Effect of soil moisture content on the torque and \nspecific energy required by the excavation machine \nTo investigate the effect of soil moisture on t he torque of \nthe excavation machine , as well as  on the spe cific energy, \npower diagrams and excavation machine torque rela ted to \neach test, according to data obtained , a torque meter  was \ninstalled in the main axis of the tunnel borin g machine labo -\nratory simulator (Figs. 11 and 12). \n \n0\n20\n40\n60\n80\n1 00\n1 02\n0 1 00 0 2 00 0 3 00 0 4 00 0 5 00 0\nPower (J/s)\nTime (s)\n5%\n1 %0\n1 %5\n2 %0\nM isto ure content\n \nFigure 11. Diagram of power at different moisture contents \n0\n5\n10\n15\n20\n25\n30\n0 1 00 0 2 00 0 3 00 0 4 00 0 5 00 0\nTorque (N.m)\nTime (s)\n5%\n1 %0\n1 %5\n2 %0\nM isto ure content\n \nFigure 12. Diagram of torque at different moisture contents \nWith the increase in soil moisture content from 5 to 20%, \nthe machine torque increases by 116% due to the co hesive-\nness of soil particles to each other and increased friction \nbetween soil particles and cutting tools. By incre asing the \ntorque of the device, the power increases, since it has a direct \ndependence on  the torque. Also, the energy consumed in \neach test increases. Specific energy (the ratio of energy used \nin each test to average wear) first decreases by 91% from 5 to \n10% moisture content and then increase s by 900% from 10 \nto 20% moisture content (Table 4). \nThe torque of laboratory simulator  increases with  \nsoil moisture content , and as torque increases, power  \nand energy consumption also increase . The specific energy \nfirst decrease s with increasing moisture content, and then \nsharply increases. \nH. Mousapour, H. Chakeri, M. Darbor, A. Hekmatnejad. (2023). Mining of Mineral Deposits, 17(2), 28-34 \n \n33 \nTable 4. Changes in the specific energy at different moisture contents \nMoisture \ncontent \nEnergy consumed \nin each test (J) \nAverage \nwear (kg) \nSpecific energy \n(J/kg) \n5 91818 0.07·10-3 1311.69·106 \n10 118908 1.1·10-3 108.10·106 \n15 152586 0.49·10-3 311.40·106 \n20 191574 0.21·10-3 912.26·106 \n \nSuggestions for future studies include: \n1. Evaluating the effect of soil moisture on  the wear of \ncutting tools under different conditions and granulations. \n2. Studying the influence of foam parameters on the wear \nof cutting tools. \n3. Investigating the effect of the arrangement and location \nof the cutter head cutting tools on wear rate and its mechanism.  \n4. Conclusions \nIt is common for cutting tools to wear out during mecha-\nnized excavation, which gre atly influences on  the project  \nfinal cost. To study  the tunnel excavation mechanisms, a  \ntunnel boring machine laboratory simulator was designe d \nand constructed within the framework  of this research. In \naddition to horizontal operation, low cutter head  rotating \nspeeds, continuous contact with fresh soil during testing, and \nspecific injection pressures of additives, this new device has \nseveral oth er characteristics.  By analyzing the grain size \ndistribution prepared from the Tabriz metro line 2, the effect \nof soil moisture content, cutter head torque, cutter head rota-\ntion speed, excavation durat ion and penetration rate on cut-\nting tool wear was inves tigated using 4 3 separate tests. The \nresults obtained from this study are as follows: \n1. As a result of increasing  rotation speed of the cutter \nhead from 1 0 to 35  rpm, the wear  rate of cutting tool s in-\ncreases by 150%. This is due to the fact that cutting t ools are \nmore likely to  collide with soil particles as the cutter head  \nrotates faster. Moreover, in cohesive soils , due to the cohe-\nsiveness of soil particles with each other, the cutting tools are \nmore likely to engage with the soil with a greater contact \npressure, thus leading them to their faster wear. \n2. The wear o f cutting tools decrease s by 40% when the \npenetration rate increases from 3.3 to 10  mm per minute. \nThis is due to the fact that  as penetration rate increases, the \nwear of cutting tools decrease s, since excavation time de-\ncreases. Therefore, the duration of the cutting tool interaction \nwith soil particles decreases with increasing penetration rate. \n3. Based on the results of research into soil moisture and \ncutting tool wear, it has been determined that with an increase \nin soil moisture content by 10%, wear increases due to in-\ncreased soil adhesion and contact  between cutting tools and \nsoil. With an increase in soil moisture content by 20%, wear is \nreduced by an average of 80%. As soil moisture content in-\ncreases, soil grains become more mobile and buoyant. The soil \nstructure loses its continuous state as it app roaches saturation \nas grains are surrounded by water particles, and coarse and \nabrasive particles become looser, resulting in less tool wear. \n4. When the soil moisture content increases from 5 to \n20%, the machine torque increases by 116 %, because soil \nparticles become more cohesive with each other , and friction \nincreases between soil particle s and cutting tools. Increasing \nthe torque of the devic e also increases its power, which will \nincrease the amount of energy consumed during testing. \nAcknowledgements \nThe fourth author acknowledges the funding of the Agen-\ncia Nacional de Investigación  y Desa rrollo (ANID), under \nthe grant project Fondecyt Iniciacion No. 11221093. \nReferences \n[1] Avunduk, E. (2018). Investigation of effects of soil conditioning . \nIstanbul, Turkey: Istanbul Technical University. \n[2] Rostami, J., Gharahbagh, E.A., Palomino, A.M., & Mosleh, M. (2012). \nDevelopment of soil abrasivity testing for soft ground tunneling using \nshield machines. Tunnelling and Underground Space Technology, (28), \n245-256. https://doi.org/10.1016/j.tust.2011.11.007 \n[3] Düllmann, J., Alber, M., & Plinninger , R.J. (2014 ). Determining soil \nabrasiveness by use of index tests versus using intrinsic soil parame-\nters. Geomechanics and Tunnelling , 7(1), 87 -97. \nhttps://doi.org/10.1002/geot.201310028  \n[4] Ko, T. Y., Kim, T. K., Son,  Y., & Jeon, S. (2016). Effect of geome-\nchanical properties on Cerchar Abrasivity Index (CAI) and its applica-\ntion to TBM tunnelling. Tunnelling and Underground Space Technolo-\ngy, (57), 99-111. https://doi.org/10.1016/j.tust.2016.02.006 \n[5] Farrokh, E. (2021). Primary and secondary tools’ life evaluation for \nsoft ground TBMs. Bulletin of Engineering Geology  and the Environ-\nment, (80), 4909-4927. https://doi.org/10.1007/s10064-021-02223-4 \n[6] Amoun, S., Sharifzadeh, M., Shahriar, K., Rostami, J., & Azali, S. T. \n(2017). Evaluation of tool wear in EPB tunneling of Tehran Metro, \nLine 7 Expansion. Tunnelling and Underground Space Technology , \n(61), 233-246. https://doi.org/10.1016/j.tust.2016.11.001 \n[7] Bakar, M.A., Zafar, Z., & Majeed, Y. (2020). Abrasiveness evaluation \nof selected river gravels of Paki stan using LCPC rock abrasivity test. \nBulletin of Engineering Geology and the Environment, (79), 2561-2577. \nhttps://doi.org/10.1007/s10064-019-01719-4 \n[8] Thuro, K., & Käsling, H. (2009). Classificatio n of the  abrasiveness of \nsoil and rock. Geomechanics an d Tunnelling , (2), 179 -188. \nhttps://doi.org/10.1002/geot.200900012 \n[9] Zhang, X. P., Tang, S. H., Liu, Q. S., Tu, X. B., Chen, P., & Li, F. Y. \n(2021). An e xperimental study on cutting tool hardness optimization  \nfor shield TBMs during dense fine silty sand ground tunneling. Bulletin \nof Engineering Geology and the Environment , (80), 6813 -6826. \nhttps://doi.org/10.1007/s10064-021-02327-x \n[10] Jakobsen, P. D., & Lo hne, J. (2013). Challenges of methods and ap-\nproaches for estimating soil abrasivity  in soft ground TBM tunnelling. \nWear, 308(1-2), 166-173. https://doi.org/10.1016/j.wear.2013.06.022 \n[11] Rong, X., Lu, H., Wang, M., Wen, Z., & Rong, X. (2019). Cutter wear \nevaluation from operational parameters in EPB tunneling of Chengdu \nMetro. Tunnelling and Underground Space Technology , (93), 103043. \nhttps://doi.org/10.1016/j.tust.2019.103043 \n[12] Avunduk, E., & Copur, H. (2018). Empirical modeling for predicting \nexcavation performance of EPB TBM based on soil properties. Tunnel-\nling and Underground Space Technolo gy, (71), 340 -353. \nhttps://doi.org/10.1016/j.tust.2017.09.016 \n[13] Azali, S. T., Ghafoori, M., Lashkaripour, G. R., & Hassanpour,  J. \n(2013). Engineering geological investigations of mechanized tunnel-\ning in soft ground: A case study, East -West lot of line 7, Te hran Met-\nro, Iran. Engineering Geology, (166), 170 -185. \nhttps://doi.org/10.1016/j.enggeo.2013.07.012  \n[14] Bakar, M.A., Majeed, Y., & Rostami, J. (2018). Influence of moistu re \ncontent on the LCPC test r esults and its implications on tool wear in \nmechanized tunneling. Tunnelling and Underground Space Technolo-\ngy, (81), 165-175. https://doi.org/10.1016/j.tust.2018.07.021 \n[15] Lee, H., Kim, D., Shin, D., Oh J., & Choi, H. (2022). Effect of foam \nconditioning on performance o f EPB shield tunnelling through labora-\ntory excavation test. Transportation Geotechnics , (32), 100692. \nhttps://doi.org/10.1016/j.trgeo.2021.100692 \n[16] Sun, Z., Yang, Z., Jiang, Y., Gao, H., Fang, K., & Yin, M. (2021). Influence \nof particle size distribution, test time, and moisture content on sandy stratum \nLCPC abrasivity test re sults. Bulletin of Engineering Geology and the \nEnvironment, (80), 611-625. https://doi.org/10.1007/s10064-020-01927-3 \n[17] Küpferle, J., Rottger, A., Thesien, W., & Alber, M. (2016). The RUB \ntunneling device – A newly developed test method to analyze and deter-\nmine the wear of excavation tools in soils.  Tunnelling and Underground \nSpace Technology, (59), 1-6. https://doi.org/10.1016/j.tust.2016.06.006 \n[18] Küpferle, J., Zizka, Z., Schoesser, B., Röttger, A., Alber, M., Thewes, M., \n& Theisen, W. (2018). Influence of the slurry -stabilized tunnel face on \nshield TBM tool wear regarding the soil mechanical changes  –\nExperimental evidence of changes in the trib ological system. Tunnel-\nH. Mousapour, H. Chakeri, M. Darbor, A. Hekmatnejad. (2023). Mining of Mineral Deposits, 17(2), 28-34 \n \n34 \nling and Underground Space Techno logy, (74), 206 -216. \nhttps://doi.org/10.1016/j.tust.2018.01.011 \n[19] Tang, S.H., Zhang, X.P., Liu, Q.S., Xie, W.Q., Wang, H.J., Li, X.F., & \nZhang, X.Y. (2022). New soil abrasion testing method for evalu ating \nthe influence of geological paramet ers of abrasive sandy  ground on \nscraper wear in TBM tunneling. Tunnelling and Underground Space \nTechnology, (128), 104604. https://doi.org/10.1016/j.tust.2022.104604 \n[20] Lan, H., Xia, Y., Miao, B., Fu, J., & Ji, Z. (2020). Prediction model of \nwear rate of inner disc cutter of engineering in Yinsong,  Jilin. Tunnel-\nling and Und erground Space Technology , (99), 1 03338. \nhttps://doi.org/10.1016/j.tust.2020.103338 \n[21] Peila, D., Picchio, A., Martinelli, D., & Negro, E.D. (2016). Laboratory \ntests on soil conditioning of clayey soil. Acta Geotechnica , 11(5), \n1061-1074. https://doi.org/10.1007/s11440-015-0406-8 \n[22] Plinninger, R., Käsling, H., Thuro, K., & Spaun, G. (2003). Test ing \nconditions and geomechanical properties influencing the CERCHAR \nabrasiveness index (CAI) value.  International Journal of Rock Me-\nchanics and  Mining Sciences , (40), 259 -263. \nhttps://doi.org/10.1016/S1365-1609(02)00140-5 \n[23] ASTM D422-63. (2007). Standard test method for particle -size analy-\nsis of soils. West Conshohocken, United States: ASTM International.  \nОцінювання зношування ріжучого інструмента з використанням  \nлабораторного симулятора прохідницької бурової машини \nХ. Мусапур, Х. Чакері, М. Дарбор, А. Хекматнежад \nМета. Оцінювання зношування рі жучого інструмента нового розробленого лабо раторного симулятора прохідницької бурової \nмашини для експериментального дослідження процесу проходки тунелю. \nМетодика. Використано розроблений лабораторний симулятор, що функціонує горизонтально, і має низьку швидкість обер-\nтання, утримує штифти в конта кті зі свіжим ґрунтом протягом усього випробування , а також володіє  можливістю вимірювання \nобертального моменту пристрою під час випробування . Дослідження зношування ріжучого інструменту було проведено із викори-\nстанням грануляції, отриманої з другої лінії метро у Табрізі, а також із застосуванням робочих параметрів механізованих виїмкових \nмашин, таких як швидкість проникнення та швидкість обертання ріжучої головки. \nРезультати. Встановлено, що при зниженні  швидкості обертання ріжучої г оловки з 35 до 10 оберт ів на хвилину середнє зно-\nшування ріжучих інструментів знижується на 63%. Встановлено, що зношування рі жучого інструменту знижується на 40% при \nзбільшенні швидкості проходки з 3.3 до 10 мм за хвилину. Це пов’язано з тим, що зі збільшенням швидкості проходки зменшується \nзнос ріжучого інструменту, оскільки скорочується час проходки.  Також за рахунок скорочення часу виїмкових робіт з 80 до \n10 хвилин зношування ріжучих інструментів знижується на 58%. Зношуванн я ріжучого інструменту збільшується зі збільшенням \nвологості від 0 до 10%, а потім знижується зі збільшенням вологості від 10 до 25%. \nНаукова новизна. Спроектовано та побудовано новий пристрій для імітації механізмів проходки тунелів, що вимірює відсоток \nзношування, швидкість проникнення і обертальний момент. \nПрактична значимість. Було досягнуто значного прогресу в прогнозуванні швидкості стирання ґрунту , але існує кілька зага-\nльноприйнятих моделей для прогнозування зношування ріжучого інструменту  та швидкості стирання ґрунту. Під час проектування \nта виготовлення лабораторного симулятора прохідницької бурової машини було досліджено вплив робочих параметрів  на зношу-\nвання ріжучого інструменту. \nКлючові слова:  механізовані виїмкові роботи, зношування ріжучих інструментів, швидкість проникнення, швидкість обер-\nтання ріжучої головки, обертальний момент ",
  "topic": "Rotational speed",
  "concepts": [
    {
      "name": "Rotational speed",
      "score": 0.594806432723999
    },
    {
      "name": "Excavation",
      "score": 0.576126754283905
    },
    {
      "name": "Engineering",
      "score": 0.5084863901138306
    },
    {
      "name": "Mechanical engineering",
      "score": 0.4259372651576996
    },
    {
      "name": "Geotechnical engineering",
      "score": 0.25434255599975586
    }
  ],
  "institutions": []
}