{
    "title": "Deformer: Denoising Transformer for Improved Audio Music Genre Classification",
    "url": "https://openalex.org/W4389049929",
    "year": 2023,
    "authors": [
        {
            "id": "https://openalex.org/A5016498026",
            "name": "J. H. Wang",
            "affiliations": [
                "Dongguk University"
            ]
        },
        {
            "id": "https://openalex.org/A5100733003",
            "name": "Shuyu Li",
            "affiliations": [
                "Dongguk University"
            ]
        },
        {
            "id": "https://openalex.org/A5076237464",
            "name": "Yunsick Sung",
            "affiliations": [
                "Dongguk University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W3135340083",
        "https://openalex.org/W4292622404",
        "https://openalex.org/W4380995588",
        "https://openalex.org/W4304080215",
        "https://openalex.org/W2977423666",
        "https://openalex.org/W2529337537",
        "https://openalex.org/W6704025895",
        "https://openalex.org/W2794150026",
        "https://openalex.org/W2963451564",
        "https://openalex.org/W2790840457",
        "https://openalex.org/W3173187964",
        "https://openalex.org/W4221161255",
        "https://openalex.org/W4283021596",
        "https://openalex.org/W4285028011",
        "https://openalex.org/W6608239544",
        "https://openalex.org/W1966311970",
        "https://openalex.org/W4313156423",
        "https://openalex.org/W4372341324",
        "https://openalex.org/W2340134902"
    ],
    "abstract": "Audio music genre classification is performed to categorize audio music into various genres. Traditional approaches based on convolutional recurrent neural networks do not consider long temporal information, and their sequential structures result in longer training times and convergence difficulties. To overcome these problems, a traditional transformer-based approach was introduced. However, this approach employs pre-training based on momentum contrast (MoCo), a technique that increases computational costs owing to its reliance on extracting many negative samples and its use of highly sensitive hyperparameters. Consequently, this complicates the training process and increases the risk of learning imbalances between positive and negative sample sets. In this paper, a method for audio music genre classification called Deformer is proposed. The Deformer learns deep representations of audio music data through a denoising process, eliminating the need for MoCo and additional hyperparameters, thus reducing computational costs. In the denoising process, it employs a prior decoder to reconstruct the audio patches, thereby enhancing the interpretability of the representations. By calculating the mean squared error loss between the reconstructed and real patches, Deformer can learn a more refined representation of the audio data. The performance of the proposed method was experimentally compared with that of two distinct baseline models: one based on S3T and one employing a residual neural network-bidirectional gated recurrent unit (ResNet-BiGRU). The Deformer achieved an 84.5% accuracy, surpassing both the ResNet-BiGRU-based (81%) and S3T-based (81.1%) models, highlighting its superior performance in audio classification.",
    "full_text": null
}