{
  "title": "How to use large language models in ophthalmology: from prompt engineering to protecting confidentiality",
  "url": "https://openalex.org/W4387373157",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A4360823789",
      "name": "Oliver Kleinig",
      "affiliations": [
        "University of Adelaide",
        "Royal Adelaide Hospital"
      ]
    },
    {
      "id": "https://openalex.org/A2787914957",
      "name": "Christina Gao",
      "affiliations": [
        "University of Adelaide",
        "Royal Adelaide Hospital"
      ]
    },
    {
      "id": "https://openalex.org/A2963464727",
      "name": "Joshua G. Kovoor",
      "affiliations": [
        "University of Adelaide",
        "Royal Adelaide Hospital"
      ]
    },
    {
      "id": "https://openalex.org/A2883694208",
      "name": "Aashray K. Gupta",
      "affiliations": [
        "University of Adelaide",
        "Gold Coast Hospital"
      ]
    },
    {
      "id": "https://openalex.org/A2021098718",
      "name": "Stephen Bacchi",
      "affiliations": [
        "Royal Adelaide Hospital",
        "Flinders University",
        "University of Adelaide"
      ]
    },
    {
      "id": "https://openalex.org/A2158921980",
      "name": "Weng Onn Chan",
      "affiliations": [
        "Royal Adelaide Hospital",
        "University of Adelaide"
      ]
    },
    {
      "id": "https://openalex.org/A4360823789",
      "name": "Oliver Kleinig",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2787914957",
      "name": "Christina Gao",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2963464727",
      "name": "Joshua G. Kovoor",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2883694208",
      "name": "Aashray K. Gupta",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2021098718",
      "name": "Stephen Bacchi",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2158921980",
      "name": "Weng Onn Chan",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W6739901393",
    "https://openalex.org/W4385476456",
    "https://openalex.org/W4376114558",
    "https://openalex.org/W4368340908",
    "https://openalex.org/W4381092249",
    "https://openalex.org/W4382652775",
    "https://openalex.org/W4367369313",
    "https://openalex.org/W4319868628",
    "https://openalex.org/W4318925155",
    "https://openalex.org/W4323350039",
    "https://openalex.org/W6850395682",
    "https://openalex.org/W4327946446"
  ],
  "abstract": null,
  "full_text": "www.nature.com/eye\nCOMMENT\nOPEN\nHow to use large language models in ophthalmology: from \nprompt engineering to protecting confidentiality\nOliver Kleinig\n ]]]\n1 , 2 ✉\n, Christina Gao\n1 , 2\n, Joshua G. Kovoor\n1 , 2\n, Aashray K. Gupta\n2 , 3\n, Stephen Bacchi\n1 , 2 , 4\nand Weng Onn Chan\n1 , 2\n© The Author(s) 2023\nEye (2024) 38:649–653; https://doi.org/10.1038/s41433-023-02772-w\nINTRODUCTION\nLarge language models (LLM) are complex predictive text \nalgorithms that generate sentences and paragraphs from a prior \nsequence of words [ 1 ]. With appropriate training, they can act \nconversationally by generating text following a user-provided \ninstruction or question. Commonly known modern LLMs include \nOpenAI’s GPT-3 and GPT-4, Google’s PaLM-2, and Meta’s Llama-2. \nThese models vary in design and performance. Information on \naccessing these models is included in the supplementary \ninformation.\nEach implementation of the same LLM (e.g. GPT-4) may behave \ndifferently due to differences in ‘fine-tuning’ training, plugin access \n[ 2 ], and initial instructions [ 3 ]. Early evidence suggests, when \nanswering ophthalmology examination questions, GPT-4 via the \nChatGPT or New Bing chatbot is the most performant [ 2 , 4 – 6 ]. \nUnderstanding how to effectively employ LLMs may have significant \nutility for clinical education and, in future, clinical practice.\nWHAT CAN LLMS DO?\nLLMs may be effective in language tasks like writing, editing, and \nsummarizing. For querying, LLMs excel at questions that are not \neasily web-searchable, or fact-finding without searchable key -\nwords. LLMs can also be queried to write code in R and other \nBox 1. The different outputs from ChatGPT (July 20 GPT-4 version) when asking “Briefly describe conjunctivitis” and “Briefly describe the epidemiology, \npathophysiology, diagnosis, and treatment of conjunctivitis”\nQuery Briefly describe conjunctivitis. Briefly describe the epidemiology, pathophysiology, diagnosis, and treatment of \nconjunctivitis.\nResponse Conjunctivitis, often referred to as “pink eye”, is an inflammation or infection of the \nconjunctiva, the transparent membrane that lines the inner part of the eyelids and \ncovers the white part of the eyes. This condition can be caused by several factors:  \n1. Bacterial or viral infections: These are the most common causes, often resulting \nfrom a cold or other respiratory infection. These forms of conjunctivitis are \ncontagious and can spread easily. \n2. Allergies: Allergic conjunctivitis happens when the body reacts to an allergen, \nsuch as pollen, dust mites, or animal dander, and is not contagious. \n3. Irritants: Exposure to irritants like chlorine in swimming pools, smog, smoke, or \ncertain cosmetics can also lead to conjunctivitis.  \nCommon symptoms include redness of the eyes, increased tear production, a gritty \nfeeling in the eyes, itchiness, and a discharge that can form a crust during sleep. \nTreatment varies based on the cause. Bacterial conjunctivitis can be treated with \nantibiotics, while viral conjunctivitis often resolves on its own. Allergic conjunctivitis \nmight be treated with antihistamines, and conjunctivitis from irritants usually clears \nup by avoiding the triggering factor.\nEpidemiology: Conjunctivitis, also known as pink eye, is a common condition \nworldwide. Its incidence varies based on the cause, whether it’s viral, bacterial, \nallergic, or due to other causes like chemical exposure or certain diseases. Viral \nconjunctivitis is often associated with respiratory infections and can spread easily in \nclose-knit communities, such as schools and nursing homes. Bacterial conjunctivitis \nis often seen in children and may occur with an ear infection. Allergic conjunctivitis \nis linked to seasonal allergies or exposure to specific allergens. \nPathophysiology: The conjunctiva is a clear tissue covering the white part of the \neye and the inside of the eyelids. Conjunctivitis is the inflammation of this tissue. \nDepending on the cause, the pathophysiology differs. In bacterial and viral \nconjunctivitis, the pathogens invade and irritate the conjunctiva, causing \ninflammation. In allergic conjunctivitis, exposure to allergens triggers an immune \nresponse, leading to inflammation. Chemical or irritant conjunctivitis occurs when \nthe conjunctiva is irritated by a foreign substance. \nDiagnosis: Conjunctivitis is often diagnosed based on a clinical examination and \npatient history. Symptoms can include redness in the white of the eye, increased \ntear production, a feeling of grittiness in the eye, itching, burning, blurred vision, \nand an increased sensitivity to light. A patient’s recent history of a cold, exposure to \na person with pink eye, or a history of allergies can also provide clues. In some \ncases, a sample of the discharge from the eye may be taken for laboratory analysis \nto confirm the diagnosis and to differentiate the cause. \nTreatment: Treatment for conjunctivitis depends on the cause. Viral conjunctivitis \ntypically resolves on its own without treatment, although cool compresses and \nartificial tears can help relieve symptoms. Bacterial conjunctivitis is treated with \nantibiotic eye drops or ointments. Allergic conjunctivitis is managed by avoiding \nthe allergen, if possible, and with antihistamines or anti-inflammatory medications. \nFor irritant conjunctivitis, the eye is often rinsed to remove the irritant, and then \ncool compresses and artificial tears can be used to soothe the eye. In all cases, \nmaintaining good eye hygiene is crucial to prevent the spread of infection. \nAlways consult a healthcare professional if you suspect you have conjunctivitis, as \nsome forms can be serious and require medical intervention.\n1\nRoyal Adelaide Hospital, Adelaide, SA, Australia. \n2\nUniversity of Adelaide, Adelaide, SA, Australia. \n3\nGold Coast University Hospital, Gold Coast, QLD, Australia. \n4\nFlinders University, \nAdelaide, SA, Australia. \n✉\nemail: oliver.kleinig@student.adelaide.edu.au\nReceived: 1 September 2023 Revised: 19 September 2023 Accepted: 21 September 2023 \nPublished online: 5 October 2023\n1234567 890();,:\nBox 2. Using ChatGPT (GPT-4, August 3 Version) to create an iterate on a patient handout for cataracts surgery\nPrompt Create me a patient handout for cataracts surgery.\nResponse Cataract Surgery: Patient Handout \nWhat is a Cataract? \nA cataract is a clouding of the eye’s natural lens, which lies behind the iris and the pupil. Cataracts are the most common cause of vision loss in people over the age of 40 and are the \nprincipal cause of blindness worldwide. \nWhat is Cataract Surgery? \nCataract surgery is a procedure to remove the lens of your eye and, in most cases, replace it with an artificial lens. \nWhen Is Surgery Recommended? \n- Difficulty in reading, driving, or performing daily tasks \n- Vision impairment that cannot be corrected with glasses \n- Decreased night vision \nPreparing for Surgery \nPre-operative Tests \n- Eye measurement tests \n- General health evaluation \nMedication \n- Inform your doctor about all medications you are taking \n- You may be advised to stop certain medications \nFasting \n- Typically, you will be asked to fast for 6–12 h before surgery \nThe Procedure \nDuration \n- Usually 15–20 min per eye \nSteps \n1. Local Anesthesia: Eye drops to numb the area \n2. Small Incision: Cut near the cornea \n3. Lens Removal: Broken up and vacuumed out \n4. Artificial Lens Insertion: A foldable lens is inserted \nAfter Surgery \nImmediate Care \n- You’ll be observed for complications for a short period \n- You may wear a protective eye shield or patch \nMedication \n- Antibiotic eye drops \n- Anti-inflammatory eye drops \nActivity \n- Avoid strenuous activities for a few weeks \n- No swimming for up to two weeks \n- Avoid rubbing your eyes \nRisks and Complications \n- Infection \n- Bleeding \n- Retinal detachment \n- Secondary cataract \n- Pressure increase inside the eye \nFollow-Up \n- One day after surgery \n- One week after surgery \n- One month after surgery \nFAQs \nQ: Is the procedure painful? \nA: Most patients report minimal discomfort, often describing a sensation of pressure. \nQ: When will my vision improve? \nA: Many people report clear vision within several hours, but each person heals differently. \nQ: Can cataracts come back? \nA: No, but a condition called “secondary cataract” might occur, which can be easily treated. \nImportant Contacts \nSurgeon: Dr. [Name] \nContact: [Contact Information] \nPlease consult your healthcare provider for personalized medical advice. \nDisclaimer: This handout is for informational purposes only and should not be considered as medical advice.* \n— \nWe hope this handout serves as a helpful guide for you as you prepare for cataract surgery. Feel free to ask your healthcare provider any additional questions you may have.\nPrompt Give me specific and targeted feedback on this handout.\nResponse Certainly! The handout is well-structured and provides a comprehensive overview of what a patient needs to know about cataract surgery. However, there are some areas where it could \nbe improved for clarity, depth, and engagement: \nStrengths: \n1. Structured Layout: The layout is well-organized, making it easy to follow. \n2. Use of Subheadings: Subheadings help to break down the text into manageable sections. \n3. FAQs: This is a valuable addition as it anticipates patient concerns. \nAreas for Improvement: \n1. Terminology: While the handout uses relatively simple language, medical terms like “Retinal detachment” or “Secondary cataract” may need explanations for the layperson. \n2. Visual Aids: The inclusion of diagrams or images could make the information easier to digest, particularly for visual learners. For instance, a diagram of the eye could be useful for \nexplaining what a cataract is. \n3. Personalization: Including a section where patients could jot down their own questions for the doctor might make the handout more interactive and personalized. \n4. Preparation Details: While you mention pre-operative tests, it might be useful to list common tests like a ‘slit-lamp examination’ or ‘visual acuity test’ so patients know what to expect. \n5. Post-Op Symptoms: A brief section on what normal and abnormal post-op symptoms look like could prepare patients for the recovery phase. \n6. Emergency Contacts: Adding a section for emergency contact details could be beneficial for immediate post-op care. \n7. Disclaimers and Citations: You include a general disclaimer, but it might be beneficial to cite sources or guidelines that the handout is based on. \n8. Contact Information: Expand this section to include not just the surgeon’s contact but also a helpline or nurse’s station for post-op concerns. \n9. Risks and Complications: This section could be more detailed. It would be beneficial to include how often these complications occur and what steps are taken to mitigate them. \n10. Checklist: A pre-operative and post-operative checklist could be a good addition. Patients could use it to track their preparations and recovery. \n11. Downloadable Resources: If this handout is also made available online, links to further reading or video explanations could be included. \nBy addressing these points, the handout can offer more depth while still remaining accessible to patients. Overall, it serves as a solid foundation and could be even more informative \nand engaging with these enhancements.\nPrompt Implement this feedback on the above patient handout\nO. Kleinig et al.  \n650\nEye (2024) 38:649 – 653\nlanguages. LLMs perform mathematical operations inaccurately \n[ 7 ]. Plugins like embedded calculators (Supplementary Informa -\ntion) can address specific LLM limitations.\nENGAGING LLMS\nLLMs are engaged through text input. Slight variations in input \ntext can cause significant variations in output [ 8 ]. Resultingly, \nhigh-quality prompting, or ‘prompt engineering’, is critical in \noptimizing LLM outputs.\nAsking the right question\nIt is widely accepted that providing specific instructions to LLMs \nyields more useful outputs [ 9 ]. For example, requesting a \nsummary of a condition’s epidemiology, pathophysiology, diag -\nnosis, and treatment is generally superior to asking for general \nResponse Cataract Surgery: Patient Handout \nWhat is a Cataract? \nA cataract is a clouding of the eye’s natural lens, which lies behind the iris and the pupil. Cataracts are the most common cause of vision loss in people over the age of 40 and are the \nprincipal cause of blindness worldwide. \n[Diagram of the Eye Showing Cataract Location] \nWhat is Cataract Surgery? \nCataract surgery is a procedure to remove the lens of your eye and, in most cases, replace it with an artificial lens. \nWhen Is Surgery Recommended? \n- Difficulty in reading, driving, or performing daily tasks \n- Vision impairment that cannot be corrected with glasses \n- Decreased night vision \nPreparing for Surgery \nPre-operative Tests \n- Slit-lamp Examination \n- Visual Acuity Test \n- Eye measurement tests \nMedication \n- Inform your doctor about all medications you are taking \n- You may be advised to stop certain medications \nFasting \n- Typically, you will be asked to fast for 6–12 h before surgery \nThe Procedure \nDuration \n- Usually 15–20 min per eye \nSteps \n1. Local Anesthesia: Eye drops to numb the area \n2. Small Incision: Cut near the cornea \n3. Lens Removal: Broken up and vacuumed out \n4. Artificial Lens Insertion: A foldable lens is inserted \nAfter Surgery \nImmediate Care \n- You’ll be observed for complications for a short period \n- You may wear a protective eye shield or patch \nMedication \n- Antibiotic eye drops \n- Anti-inflammatory eye drops \nActivity \n- Avoid strenuous activities for a few weeks \n- No swimming for up to two weeks \n- Avoid rubbing your eyes \nSymptoms to Watch \n- Normal: Mild discomfort, cloudy vision \n- Abnormal: Severe pain, vision loss \nRisks and Complications \n- Infection: Rare but serious. Immediate medical attention needed. \n- Bleeding: Rare and usually minor. \n- Retinal Detachment: Separation of retina from the back of the eye; requires immediate attention. \n- Secondary Cataract: Cloudiness that can occur months or years later; can be easily treated. \n- Pressure increase inside the eye: May require medication. \nFollow-Up \n- One day after surgery \n- One week after surgery \n- One month after surgery \nFAQs \nQ: Is the procedure painful? \nA: Most patients report minimal discomfort, often describing a sensation of pressure. \nQ: When will my vision improve? \nA: Many people report clear vision within several hours, but each person heals differently. \nQ: Can cataracts come back? \nA: No, but a condition called “secondary cataract” might occur, which can be easily treated. \nImportant Contacts \nSurgeon: Dr. [Name] \nContact: [Contact Information] \nNurse’s Station: [Contact Information] \nEmergency Contact: [Contact Information] \nYour Notes \n- [Your questions for the doctor] \n- [Your symptoms post-surgery] \n- [Your medication schedule] \nChecklists \nPre-Op Checklist \n- [ ] Completed all tests \n- [ ] Confirmed medications \n- [ ] Started fasting \nPost-Op Checklist \n- [ ] Follow-up appointments scheduled \n- [ ] Medication taken as advised \n- [ ] Activity restrictions followed \n*Disclaimer: This handout is for informational purposes only and should not be considered as medical advice. It is based on current medical guidelines as of [Year].* \n— \nWe hope this revised handout serves as a helpful guide for you as you prepare for cataract surgery. Feel free to ask your healthcare provider any additional questions you may have. For \nfurther reading, you can visit [Resource Link]. \n— \n**Sources and Guidelines**: [Source 1], [Source 2], [Source 3]\n*This process can be iterated multiple times to further refine the handout.\n**Note the outputs have been altered slightly for formatting purposes, no changes to content were made.\nThe LLM is first asked to create the patient handout. Then the LLM is prompted to give targeted feedback on the above handout. Lastly, the LLM is tasked with \nimplementing such feedback.\nO. Kleinig et al.   \n651\nEye (2024) 38:649 – 653 \n\ninformation (Box 1 ). Additionally, using specifiers such as “Provide \na brief/detailed summary of”, “Explain at a high-school/college- \ngrade/consultant level”, and “Present your findings in a table/as \ndot points” sets specific parameters to allow LLMs to generate \nmore useful outputs.\nPreparing the LLM\n‘Priming’ LLMs for expected inputs and responses is an emerging \npractice [ 2 ]. For example: “I am going to provide X; I want you to \noutput Y”. This strategy increases the chance of a useful output. \nExample outputs can also be offered to LLMs to style-mimic. \nOnline libraries of example ‘guiding prompts’ are emerging (for \nexample https://www.learnprompt.org/act-as-chat-gpt-prompts/ ).\nNotably, certain instructions could worsen output quality. \nChatGPT’s outputs are most accurate after explaining its reason -\ning [ 10 ]. Therefore, prompts that explicitly request LLMs omit \nreasoning could result in lower-quality outputs.\nAdditionally, during the same session, LLMs will consider \nprevious inputs and outputs in response [ 7 ]. Given their text- \ncompletion ‘urge’, LLMs will tend to mimic the format of prior \noutputs. This property may lower user workload as guiding \nprompts need only be typed once. Beginning a new session is \nprudent for unrelated conversations to reduce memory retention \nbias from prior outputs [ 5 , 11 ].\nIt is also an emerging practice to tell LLMs, “If you are not sure \nabout the answer, say you don’t know”. These uncertainty \nprompts may reduce, but not prevent, inaccurate outputs in \ncertain tasks [ 12 ].\nCompleting tasks\nAs LLMs are effective information summarizers, they may \nstreamline the non-creative parts of ophthalmological writing, \nsuch as abstract creation [ 13 , 14 ] or medical letter generation [ 15 ]. \nHowever, ChatGPT may omit or hallucinate information [ 14 , 15 ], \nso human oversight is required [ 15 ]. Additionally, the creative \ncomponents of medical writing (for example, drawing conclusions \nfrom data) are most accurately performed by a credible human \n[ 13 ].\nAs these models are pre-trained to complete text, LLMs \noccasionally fail to summarize or edit incomplete documents. \nThis is due to the ‘urge’ to complete the inputted text. In these \nsituations, it is best to provide LLMs with clearly fragmented or \ncompleted text.\nPowerful prompts\nPowerful prompts guide LLMs in higher-order tasks, such as \nrequesting more information for a conclusion. An LLM employed \nto diagnose ophthalmological conditions could be asked: “Patient \nX is [known information]. Keep asking me questions about patient \nX until you have sufficient information to arrive at a diagnosis.” \nThis method can minimize uncertainty and reduce the generality \nof responses provided by an LLM.\nAnother powerful prompt pattern is asking LLMs for feedback. \nFor example, it is possible to ask LLMs for feedback on a patient \nhandout and then request the LLM implement such feedback, as \nshown in Box 2 . This process can be iterated multiple times.\nLastly, when unsure of how to prompt an LLM, it is possible to \nask LLMs like ChatGPT to ask clarifying questions about a desired \ntask until it has sufficient information to write its own prompt. \nThe supplementary information includes an example prompt- \ngenerating prompt [ 16 ].\nOnline or local\nCritically, data provided to online LLMs such as ChatGPT and Bard \nmay be periodically reviewed by humans [ 17 ] or be used to train \nmodels [ 18 ]. Due to this insecurity, confidential data, even \ndeidentified, should never be shared with an online LLM [ 19 ]. It \nis possible to run some LLMs on-device, for example GPT4ALL \n( https://gpt4all.io ) and Llama-2 ( https://ai.meta.com/llama/ ). How -\never, this may result in an unfavorable trade-off between model \ncapability and speed on consumer-grade systems. Consequently, \nenterprise-hosted and institutionally and ethics committee \napproved LLMs may be the most appropriate LLM implementa -\ntion for analysis of confidential information.\nWHAT LIMITS LLMS?\nWhile powerful tools, LLMs have well-documented limitations \n[ 20 ]. Most significantly being inaccuracies [ 20 ], potential lack of \nknowledge of specialist fields and, for GPT-3 and GPT-4, knowl -\nedge of events and advancements following September 2021 [ 7 ]. \nFurthermore, LLM’s performance may vary; ChatGPT’s capability \n(GPT-3 and GPT-4) declined in early 2023 [ 21 ], potentially due to \nincreased safety training [ 10 ]. In the future, less safe models \nexplicitly trained for professionals, such as Med-PaLM-2, may \nallow ophthalmologists to access more powerful LLMs.\nCONCLUSION\nThe use of LLMs in ophthalmology is emerging and largely \nuntested. Understanding the function of an LLM as a powerful but \nfallible predictive text algorithm may guide optimal use of this \ntechnology. When using LLMs, choosing deliberately powerful \nprompts such as the forms suggested above will result in the \nhighest quality use of LLMs in ophthalmology.\nREFERENCES\n1. Vaswani A, Shazeer N, Parmar N, Uszkoreit J, Jones L, Gomez AN, et al. Attention \nis all you need. In: Proceedings of the 31st International Conference on Neural \nInformation Processing Systems. Red Hook, NY, USA: Curran Associates Inc.; \n2017. p. 6000–10. (NIPS’17).\n2. Kleinig O, Gao C, Bacchi S. This too shall pass: the performance of ChatGPT-3.5, \nChatGPT-4 and New Bing in an Australian medical licensing examination. Med J \nAust. [Internet]. https://doi.org/10.5694/mja2.52061 .\n3. Edwards B. Ars Technica. 2023 [cited 2023 Jul 23]. AI-powered Bing Chat spills its \nsecrets via prompt injection attack [Updated]. https://arstechnica.com/ \ninformation-technology/2023/02/ai-powered-bing-chat-spills-its-secrets-via- \nprompt-injection-attack/ .\n4. Raimondi R, Tzoumas N, Salisbury T, Di Simplicio S, Romano MR. Comparative \nanalysis of large language models in the Royal College of Ophthalmologists \nfellowship exams. Eye. 2023;9:1–4.\n5. Antaki F, Touma S, Milad D, El-Khoury J, Duval R. Evaluating the performance of \nChatGPT in ophthalmology: an analysis of its successes and shortcomings. \nOphthalmol Sci. 2023;3:100324.\n6. Cai LZ, Shaheen A, Jin A, Fukui R, Yi JS, Yannuzzi N, et al. Performance of \ngenerative large language models on ophthalmology board–style questions. Am \nJ Ophthalmol. 2023;254:141–9.\n7. OpenAI. GPT-4 Technical Report [Internet]. arXiv [Preprint] 2023 [cited 2023 Jul \n23]. Available from: http://arxiv.org/abs/2303.08774 .\n8. Reeves B, Sarsa S, Prather J, Denny P, Becker BA, Hellas A, et al. Evaluating the \nperformance of code generation models for solving Parsons problems with small \nprompt variations. In: Proceedings of the 2023 Conference on Innovation and \nTechnology in Computer Science Education V 1 [Internet]. New York, NY, USA: \nAssociation for Computing Machinery; 2023. p. 299–305. https://doi.org/10.1145/ \n3587102.3588805 .\n9. Ekin S. Prompt engineering for ChatGPT: a quick guide to techniques, tips, and best \npractices [Internet]. TechRxiv [Preprint] 2023 [cited 2023 Jul 23]. Available from: \nhttps://www.techrxiv.org/articles/preprint/Prompt_Engineering_For_ChatGPT_A_ \nQuick_Guide_To_Techniques_Tips_And_Best_Practices/22683919/2 .\n10. Bubeck S, Chandrasekaran V, Eldan R, Gehrke J, Horvitz E, Kamar E, et al. Sparks \nof artificial general intelligence: early experiments with GPT-4 [Internet]. arXiv \n[Preprint] 2023 [cited 2023 Jul 23]. Available from: http://arxiv.org/abs/ \n2303.12712 .\n11. Fijačko N, Gosak L, Štiglic G, Picard CT, Douma MJ. Can ChatGPT pass the life \nsupport exams without entering the American Heart Association Course? \nResuscitation [Internet]. 2023;185. https://www.resuscitationjournal.com/article/ \nS0300-9572(23)00045-X/fulltext .\n12. Zhu D, Chen J, Haydarov K, Shen X, Zhang W, Elhoseiny M. ChatGPT asks, BLIP-2 \nanswers: automatic questioning towards enriched visual descriptions [Internet]. \nO. Kleinig et al.  \n652\nEye (2024) 38:649 – 653\narXiv [Preprint] 2023 [cited 2023 Sep 1]. Available from: http://arxiv.org/abs/ \n2303.06594 .\n13. Kitamura FC. ChatGPT is shaping the future of medical writing but still requires \nhuman judgment. Radiology. 2023;307:e230171.\n14. Babl FE, Babl MP. Generative artificial intelligence: can ChatGPT write a quality \nabstract? Emerg Med Australas. [Internet]. https://onlinelibrary.wiley.com/doi/ \nabs/10.1111/1742-6723.14233 .\n15. Ali SR, Dobbs TD, Hutchings HA, Whitaker IS. Using ChatGPT to write patient \nclinic letters. Lancet Digit Health. 2023;5:e179–81.\n16. Littlefield B. PromptGenerator [Internet]. ChatGPT users - Skool. 2023. https:// \nwww.skool.com/chatgpt/promptgenerator?p=1e5ede93 .\n17. Google. Bard Help. Bard Privacy Help Hub. https://support.google.com/bard/ \nanswer/13594961?hl=en#human_review .\n18. OpenAI. OpenAI. Privacy policy. Available from: https://openai.com/policies/ \nprivacy-policy .\n19. Attowooll J. NewsGP. ‘Extremely unwise’: warning over use of ChatGPT for \nmedical notes. 2023. https://www1.racgp.org.au/newsgp/clinical/extremely- \nunwise-warning-over-use-of-chatgpt-for-m .\n20. Sallam M. ChatGPT utility in healthcare education, research, and practice: sys -\ntematic review on the promising perspectives and valid concerns. Health. \n2023;11:887.\n21. Chen L, Zaharia M, Zou J. How is ChatGPT’s behavior changing over time? \n[Internet]. arXiv [Preprint] 2023 [cited 2023 Jul 23]. Available from: http:// \narxiv.org/abs/2307.09009 .\nAUTHOR CONTRIBUTIONS\nAll authors contributed to the conception of the work and drafted and approved the \nmanuscript. Author OK also performed the major literature review and completed \nthe first manuscript draft. Authors SB and WOC were the principal supervisors of this \npiece and provided major editorial guidance.\nFUNDING\nOpen Access funding enabled and organized by CAUL and its Member Institutions.\nCOMPETING INTERESTS\nThe authors declare no competing interests.\nADDITIONAL INFORMATION\nSupplementary information The online version contains supplementary material \navailable at https://doi.org/10.1038/s41433-023-02772-w.\nCorrespondence and requests for materials should be addressed to Oliver Kleinig .\nReprints and permission information is available at http://www.nature.com/ \nreprints\nPublisher’s note Springer Nature remains neutral with regard to jurisdictional claims \nin published maps and institutional affiliations.\nOpen Access This article is licensed under a Creative Commons \nAttribution 4.0 International License, which permits use, sharing, \nadaptation, distribution and reproduction in any medium or format, as long as you give \nappropriate credit to the original author(s) and the source, provide a link to the Creative \nCommons licence, and indicate if changes were made. The images or other third party \nmaterial in this article are included in the article’s Creative Commons licence, unless \nindicated otherwise in a credit line to the material. If material is not included in the \narticle’s Creative Commons licence and your intended use is not permitted by statutory \nregulation or exceeds the permitted use, you will need to obtain permission directly \nfrom the copyright holder. To view a copy of this licence, visit http://creativecom -\nmons.org/licenses/by/4.0/ .\n© The Author(s) 2023\nO. Kleinig et al.   \n653\nEye (2024) 38:649 – 653 \n",
  "topic": "Confidentiality",
  "concepts": [
    {
      "name": "Confidentiality",
      "score": 0.6127958297729492
    },
    {
      "name": "Medicine",
      "score": 0.4614945650100708
    },
    {
      "name": "Optometry",
      "score": 0.43280911445617676
    },
    {
      "name": "Ophthalmology",
      "score": 0.3600529730319977
    },
    {
      "name": "Computer science",
      "score": 0.3355579376220703
    },
    {
      "name": "Computer security",
      "score": 0.22311478853225708
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I1320133117",
      "name": "Royal Adelaide Hospital",
      "country": "AU"
    },
    {
      "id": "https://openalex.org/I5681781",
      "name": "The University of Adelaide",
      "country": "AU"
    }
  ]
}