{
  "title": "GPDRP: a multimodal framework for drug response prediction with graph transformer",
  "url": "https://openalex.org/W4389856652",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A5075201846",
      "name": "Yingke Yang",
      "affiliations": [
        "Henan University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5006759058",
      "name": "Peiluan Li",
      "affiliations": [
        "Henan University of Science and Technology"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W3154648057",
    "https://openalex.org/W3035604179",
    "https://openalex.org/W2799710201",
    "https://openalex.org/W2471562228",
    "https://openalex.org/W2043398720",
    "https://openalex.org/W2108068107",
    "https://openalex.org/W2175970000",
    "https://openalex.org/W2129860849",
    "https://openalex.org/W2004638738",
    "https://openalex.org/W2197241765",
    "https://openalex.org/W2742007096",
    "https://openalex.org/W2807463161",
    "https://openalex.org/W2994958138",
    "https://openalex.org/W3005505802",
    "https://openalex.org/W3096561213",
    "https://openalex.org/W2097554668",
    "https://openalex.org/W2100980426",
    "https://openalex.org/W4297387432",
    "https://openalex.org/W4295900303",
    "https://openalex.org/W3116278528",
    "https://openalex.org/W2965750004",
    "https://openalex.org/W2170083676",
    "https://openalex.org/W2187351898",
    "https://openalex.org/W2099395323",
    "https://openalex.org/W2102651756",
    "https://openalex.org/W2170146596",
    "https://openalex.org/W2128710193",
    "https://openalex.org/W3093195220",
    "https://openalex.org/W3196486841",
    "https://openalex.org/W2075496629",
    "https://openalex.org/W4230947829",
    "https://openalex.org/W2970971581",
    "https://openalex.org/W2159707944",
    "https://openalex.org/W2130410032",
    "https://openalex.org/W4382631779",
    "https://openalex.org/W3150675149",
    "https://openalex.org/W6601955380"
  ],
  "abstract": null,
  "full_text": "GPDRP: a multimodal framework for drug \nresponse prediction with graph transformer\nYingke Yang1 and Peiluan Li1,2* \nBackground\nCancer, a highly complex disease, is caused by the interaction of various carcinogenic \nfactors. It significantly impacts global human health and poses a threat to human life. \nIndividuals with the disease exhibit heterogeneity in both genetic and phenotypic \naspects, primarily due to the tumor microenvironment’s clonal diversity of cancer cells \nand non-malignant cells with changed phenotypes. This heterogeneity leads to partial \nor non-responsiveness of certain patients to therapeutic strategies such as chemother -\napy, targeted therapy, and immunotherapy during the cancer treatment process [1]. In \nother words, even when implementing the same therapeutic strategies for patients of \nthe same cancer type, there are still variations in treatment responses, making responses \nto cancer treatment generally unpredictable. Additionally, it is important to note that \nAbstract \nBackground: In the field of computational personalized medicine, drug response \nprediction (DRP) is a critical issue. However, existing studies often characterize drugs \nas strings, a representation that does not align with the natural description of mol-\necules. Additionally, they ignore gene pathway-specific combinatorial implication.\nResults: In this study, we propose drug Graph and gene Pathway based Drug \nresponse prediction method (GPDRP), a new multimodal deep learning model for pre-\ndicting drug responses based on drug molecular graphs and gene pathway activity. \nIn GPDRP , drugs are represented by molecular graphs, while cell lines are described \nby gene pathway activity scores. The model separately learns these two types of data \nusing Graph Neural Networks (GNN) with Graph Transformers and deep neural net-\nworks. Predictions are subsequently made through fully connected layers.\nConclusions: Our results indicate that Graph Transformer-based model delivers \nsuperior performance. We apply GPDRP on hundreds of cancer cell lines’ bulk RNA-\nsequencing data, and it outperforms some recently published models. Furthermore, \nthe generalizability and applicability of GPDRP are demonstrated through its predic-\ntions on unknown drug-cell line pairs and xenografts. This underscores the interpret-\nability achieved by incorporating gene pathways.\nKeywords: Drug response prediction (DRP), Multimodal deep learning model, Graph \ntransformer, Drug molecular graphs, Pathway activity scores\nOpen Access\n© The Author(s) 2023. Open Access This article is licensed under a Creative Commons Attribution 4.0 International License, which permits \nuse, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original \nauthor(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third \nparty material in this article are included in the article’s Creative Commons licence, unless indicated otherwise in a credit line to the mate-\nrial. If material is not included in the article’s Creative Commons licence and your intended use is not permitted by statutory regulation or \nexceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http://\ncreativecommons.org/licenses/by/4.0/. The Creative Commons Public Domain Dedication waiver (http://creativecommons.org/publicdo-\nmain/zero/1.0/) applies to the data made available in this article, unless otherwise stated in a credit line to the data.\nRESEARCH\nYang and Li  BMC Bioinformatics          (2023) 24:484  \nhttps://doi.org/10.1186/s12859-023-05618-0\nBMC Bioinformatics\n*Correspondence:   \n15038522015@163.com\n1 School of Mathematics \nand Statistics, Henan University \nof Science and Technology, \nLuoyang 471000, China\n2 Longmen Laboratory, \nLuoyang 471003, China\nPage 2 of 16Yang and Li  BMC Bioinformatics          (2023) 24:484 \nnot all cancers and anticancer drugs are strongly associated with targetable genetic bio -\nmarkers. Therefore, relying solely on the relationship between drug targets or muta -\ntion status may be insufficient to predict the efficacy of specific targeted therapies [2, 3]. \nAnd implementing targeted therapies without taking drug resistance into account may \nreduce patient survival rates. Drug resistance may show up as the activation of alterna -\ntive signaling pathways promoting tumor growth or clonal expansion under the selective \npressure induced by treatment [4]. Therefore, drug response prediction (DRP) is criti -\ncally important in cancer therapy and has become a significant topic in personalized \nmedicine research. Accurate prediction of treatment response assists in designing more \neffective treatment plans for patients and provides valuable insights for the development \nof novel disease-inhibiting drugs.\nWith the rapid development of high-throughput genomics technologies, large-scale \npharmacogenomics databases have gradually accumulated. The Cancer Cell Line Ency -\nclopedia (CCLE) [5] provides a platform for systematic study of cell lines. The Genomics \nof Drug Sensitivity in Cancer (GDSC) [6] is one of the largest public databases, cover -\ning information regarding the sensitivity of cancer cells to drugs and related molecu -\nlar markers. The Cancer Therapeutics Response Portal (CTRPv2) [7] provides extensive \ndata on drug sensitivity. These high-throughput screening research resources collectively \nform a vast knowledge base [1]. Based on these abundant data resources, numerous \nresearchers have established various DRP models to predict the response of anticancer \ndrugs.\nMenden et  al. compared anticancer drug sensitivity prediction models constructed \nusing different methods by utilizing two large-scale drug genomics datasets, and demon-\nstrated that genomics can validate the response of specific drugs as an explanatory vari -\nable [8]. Ammad-Ud-Din et al. employed a novel nuclear norm-based Bayesian matrix \nfactorization approach that combined drug chemical structure features and genomic \ncharacteristics for DRP [9]. Zhang et al. introduced an integrated model to predict drug \nresponse in a specified cell line and demonstrated its superiority over the elastic net \nmodel [10]. Wang et al. predicted drug response by utilizing the chemical structure of \ndrugs and gene expression profiles, employing a similarity regularized matrix factoriza -\ntion method [11]. Chang et al. proposed the CDRscan, which utilizes cell lines’ genomic \nmutations and molecular fingerprints of drugs for predicting drug efficacy [12]; Sakel -\nlaropoulos et al. constructed a model named Precily based on gene expression data for \nDRP and demonstrated its superior performance over Elastic Net and Random Forest \nmodels [13]; Choi et  al. introduced an innovative deep neural network model named \nRefDNN for better drug resistance prediction and biomarker identification related to \ndrug response [14].\nDespite significant progress in DRP research, there are some issues worth consider -\ning. For instance, most studies represent drugs as strings, which is an unnatural way of \nrepresenting molecules and may result in the loss of structural information [15]. Addi -\ntionally, the pathway-specific combinatorial implication (or gene sets) of genes are dis -\nregarded, and gene expression levels are treated as independent variables, which may \noverly emphasize machine learning techniques [16, 17].\nTo address these issues, we propose GPDRP (Graph and Pathway based Drug \nresponse prediction), a novel multimodal deep learning architecture, that can predict \nPage 3 of 16\nYang and Li  BMC Bioinformatics          (2023) 24:484 \n \ndrug responses on cell lines by modeling drugs as molecular graphs. In addition, Graph \nTransformer was combined with Graph Isomorphism Network (GIN) to improve the \ncapacity for more precise DRP . We compared GPDRP with two recently published \nworks: Precily [18], which represents drug moleculars using simplified molecular-input \nline-entry system (SMILES) strings, and GraTransDRP [19], encoding cell lines’ genomic \nand epigenomic characteristics through one-hot encoding. Our approach performs \nbetter considering root mean square error (RMSE) and Pearson correlation coefficient \n(PCCs), according to experimental results. Also, by applying GPDRP to 15,094 drug-cell \nline pairs lacking response values and xenograft datasets, we demonstrated the poten -\ntial of the model to predict unknown drug-cell line pairs, as well as the applicability of \nthe model and interpretability using gene pathway scores. The primary contributions of \nGPDRP include:\n1. We integrate the drug molecular graph with gene pathway activity score, leveraging \nthe strengths of both types of data to enhance the predictive power of our model.\n2. We introduce GPDRP , a novel multimodal framework for DRP , which leverages \nGraph Convolutional Networks in conjunction with Graph Transformer and deep \nneural networks. The performance of GPDRP is demonstrated using the CCLE/\nGDSC dataset, and it outperforms two recently published models, Precily and \nGraTransDRP .\n3. GPDRP demonstrates the potential to predict unknown drug-cell line pairs. It was \nutilized to predict the pairs that were missing from the GDSC, and some published \nworks were located and discussed that supported our predictions.\n4. GPDRP exhibits excellent applicability. We applied it to predict the LNCaP xenograft \ndataset and provided explanations based on gene activity pathway scores.\nResults\nPerformance comparison on the CCLE/GDSC dataset\nTo assess GPDRP’s prediction accuracy, we trained the model using the CCLE/GDSC \ndataset and employed the same data splitting strategy as in Precily [18]. We separated \nthe dataset according to the cell lines, making sure that the test, validation, and training \nsets did not share any cell lines. Of the total drug-cell line pairs (80,056), we randomly \nselected 90% (72,156) for the dataset, with 80% of cell lines allocated to the training set \nand 10% to the validation set for hyperparameter tuning. The remaining 10% (7900) of \nthe pairs were designated for the testing set. The test results revealed a PCCs value of \n0.8833 and a RMSE value of 0.0321 in the best model as shown in Fig. 1.\nWe then compared GPDRP with some recently published models. For methods relying \non the identical dataset, PCCs and RMSE were computed. The performance is shown in \nFig. 1B and Table 1. Evidently, our model GPDRP outperforms Precily and GraTransDRP \nfor almost all graph convolutional networks. Among three GNN models: Graph Convo -\nlutional Networks (GCN), Graph Attention Networks (GAT), and GIN, the GIN model \nperformed the best, achieving a PCCs of 0.8827. This illustrates GIN’s potential for graph \nrepresentation and lends credence to the idea that GIN is one of the most potent GCN \nmodels [20]. Therefore, we considered combining GIN with the Graph Transformer, \nresulting in the best PCCs of 0.8833 and the best RMSE of 0.0321.\nPage 4 of 16Yang and Li  BMC Bioinformatics          (2023) 24:484 \nPrediction of responses for unknown drug‑cell line pairs\nIn this part, we used the optimal model, GPDRP_GIN_TRANSFORMER, to predict \nthe response for the processed 15,094 drug-cell line pairs lacking response values (see \nAdditional file 1 : Table S3). All the prediction results are provided in Additional file  1: \nTable S4. The predicted LN IC50 values for the unknown response pairs grouped by \ndrug are displayed in Fig.  2 using a box plot. Drugs are sorted by the median of their \ndistributions, with each drug’s box representing the numerical distribution of values \nassociated with its corresponding cell lines. The figure displays six drugs with the \nhighest values and six drugs with the lowest medians. As the true values for these \nunknown response pairs are unavailable, the accuracy of our prediction is determined \nby works as follows.\nThe LN IC50 is the logarithm of the concentration IC50 at which a drug inhibits bio -\nlogical activity. A smaller value indicates greater sensitivity of the cell lines to the drug, \nindicating its effectiveness. Our predictions identified the top six most effective drugs as \nBortezomib, Daporinad, Vinblastine, Vinorelbine, Paclitaxel, and Vincristine. It is note -\nworthy that Bortezomib, Vinblastine, Paclitaxel, and Vincristine were also identified as \npotentially effective drugs in the pioneering model proposed by Liu et al. [21].\nOur analysis identified Bortezomib as the most potent drug. Bortezomib has dem -\nonstrated extensive antitumor activity and has been shown to enhance the efficacy \nFig. 1 Performance comparison. A Scatter plot demonstrating the performance of GPDRP across all drug-cell \nline pairs in the CCLE/GDSC test data. P-value was calculated using a two-sided t-test. B Barplot shows the \nPearson’s correlation coefficients (PCCs) for different models\nTable 1 The performance comparison of PCCs and RMSE on the GDSC/CCLE dataset (the best \nperformance is in bold)\nModel PCCs RMSE\nPrecily [18] 0.8733 1.3773\nGraTransDRP [19] 0.8790 0.0333\nGPDRP_GCN 0.8774 0.0325\nGPDRP_GAT 0.8814 0.0322\nGPDRP_GIN 0.8827 0.0323\nGPDRP_GIN_TRANSFORMER 0.8833 0.0321\nPage 5 of 16\nYang and Li  BMC Bioinformatics          (2023) 24:484 \n \nof various chemotherapeutic drugs [22]. Its capacity to sensitize cell lines to numer -\nous other drugs was noted in a study by Friedman et al. [23]. Bortezomib, the initial \nproteasome inhibitor authorized for the treatment of malignant diseases, is approved \nfor addressing multiple myeloma and mantle cell lymphoma. It has shown positive \nclinical outcomes as a standalone treatment or as part of a combination therapy, \nenhancing the effects of chemotherapy/radiation or overcoming drug resistance [24]. \nNotably, in our predictions, the DOHH2 cell line exhibited the highest sensitivity to \nBortezomib among all the unknown drug-cell line combinations. DOHH2, a human \nnon-Hodgkin lymphoma cell line, is frequently used in lymphoma research, and there \nis evidence supporting Bortezomib’s potential in treating non-Hodgkin lymphoma \n[25].\nDaporinad, a potential small molecule compound, exhibits anti-tumor and anti-\nangiogenic properties. It binds to and inhibits nicotinamide phosphoribosyltransferase \n(NMPRTase), thereby suppressing the biosynthesis of nicotinamide adenine dinucleo -\ntide (NAD+) from nicotinamide (vitamin B3). This activity has the potential to exhaust \nenergy reserves in metabolically active tumor cells and trigger apoptosis. Furthermore, \nDaporinad may hinder the production of vascular endothelial growth factor (VEGF) in \ntumor cells, thereby inhibiting tumor angiogenesis. Daporinad has been clinically tested \nfor treating melanoma, cutaneous T-cell lymphoma, and B-cell chronic lymphocytic leu-\nkemia [26].\nVinblastine is employed in treating various cancers, including breast cancer, testicular \ncancer, lymphoma, neuroblastoma, Hodgkin’s and non-Hodgkin’s lymphoma, as well as \nfungal infections, histiocytosis, and Kaposi sarcoma [27]. Research by Brugie’res et  al. \nsuggested that vinblastine might be effective in treating relapsed anaplastic large cell \nFig. 2 Box plot of predicted LN IC50 values for unknown response pairs. The drugs are arranged based on \nthe median of their predicted LN IC50 values for cell lines. The horizontal axis denotes the drug names, and \nthe vertical axis denotes their LN IC50 values with cell lines. The top 6 drugs with the lowest median LN IC50 \nvalues indicate that they may be the most effective drugs, while 6 drugs with the highest median LN IC50 \nvalues suggest that they may be the most ineffective drugs\nPage 6 of 16Yang and Li  BMC Bioinformatics          (2023) 24:484 \nlymphoma, leading to durable remissions [28]. Vinorelbine, another vinca alkaloid drug, \nis frequently employed in cancer therapy, encompassing non-small cell lung cancer and \nbreast cancer [29]. Vincristine has maintained a steady role in cancer therapy research, \nbeing an integral part of anti-cancer treatment [30].\nPaclitaxel, often referred to as an ’anti-cancer superstar, ’ is a naturally occurring sec -\nondary metabolite extracted and purified from the bark of the yew tree, Taxus brevifolia. \nIt has been clinically validated to possess superior anti-tumor properties and is widely \nused in treating malignancies such as breast cancer, ovarian cancer, and gastric cancer. It \nis one of the most frequently used chemotherapeutic drugs in clinical practice [31].\nThe six least effective drugs identified in our study are AZD5991, Fludarabine, \nSB216763, AZD1208, Nelarabine, and Carmustine. A literature review revealed that \nthese drugs are typically used in combination therapies. For example, Nelarabine is used \nto treat relapsed or refractory T-cell acute lymphoblastic leukemia (T-ALL) and T-cell \nlymphoblastic lymphoma (T-LBL) following the failure of at least two previous treat -\nment regimens [32]. Fludarabine can have significant side effects, and careful monitor -\ning of hematologic and non-hematologic toxicities is recommended when used as an \nanti-cancer drug.\nIn conclusion, our method has shown exceptional performance in predicting drug \nresponses for unknown drug-cell line pairs, thereby confirming the accuracy and prac -\nticality of GPDRP . This allows us to better understand the effects of drugs on specific \ncell lines, offering robust support for drug development and the creation of personalized \ntreatment strategies.\nPredictions in LNCaP xenografts\nPatient-Derived Xenografts (PDXs) are widely used in vivo tumor models to investigate \ntherapeutic responses and forecast drug responses in cancer patients sharing analogous \ntraits. In our study, we applied the GPDRP method to analyze the GSE211856 dataset, \nwhich was obtained from the NCBI GEO database (www. ncbi. nlm. nih. gov/ geo/). This \ndataset comprises bulk RNA-seq data from an extensively annotated study on the pro -\ngression of prostate cancer, focusing on the responsiveness and development of resist -\nance to AR-targeted therapies. Androgens are required for the establishment and early \ngrowth of LNCaP xenograft tumors in male mice (pre-castration group, PRE-CX). Cas -\ntration reduces androgen receptor (AR) activity and tumor growth (post-castration \ngroup, POST-CX). This initial sensitivity to castration, however, consistently progresses \nto castration resistance (castration-resistant prostate cancer, CRPC). Further treatment \nof CRPC with the AR targeting drug enzalutamide (ENZ) produces an initial therapeu -\ntic reaction (ENZ Sensitive, ENZS), but resistance develops over time (ENZ Resistant, \nENZR). The dataset includes a total of 54 samples, encompassing multiple biological \nreplicates for each condition and treatment group, as summarized in Table 2.\nTo predict drug responses, we used the GPDRP_GIN_TRANSFORMER model trained \non the CCLE/GDSC dataset. By applying this model to the 54 samples (see Additional \nfile 1: Table S5), we obtained the predicted sensitivity of 173 drugs on LNCaP xenograft \ntumor samples, as depicted in Fig.  3. As our response values are continuous and Z-score \nnormalized with a mean of 0 and a standard deviation of 1, we employed Euclidean dis -\ntance for clustering analysis to enable comparison on a consistent scale. Figure  4 reveals \nPage 7 of 16\nYang and Li  BMC Bioinformatics          (2023) 24:484 \n \nTable 2 GSE211856 dataset overview\nSample Sample Size Group\nPRE-CX 9 Condition\nPOST-CX 8 Condition\nCRPC 10 Condition\nENZS 12 treatment\nENZR 15 treatment\nFig. 3 Predictions and analysis in LNCaP xenografts. A Heatmap represents the predicted LN IC50 values of \n173 drugs across the 54 samples, where lower LN IC50 values are indicated by bluer color bars, indicating \ngreater sensitivity of the predicted samples to the drugs. The samples were grouped based on the Euclidean \ndistance. B Boxplots showing the distribution of GSVA scores of proliferation-related pathways (n = 12) across \nthree clusters (n = 12, n = 25 and n = 17 samples from cluster 1, cluster 2 and cluster 3, respectively)\nFig. 4 Illustration of the predictive analysis workflow of GPDRP . A Drug molecular graph construction. The \nstructure information of drugs was collected from PubChem and we represented drugs as molecular graphs \nusing RDKit. B Gene pathway activity scores calculation. For the cancer cell lines obtained from CCLE, we \ncomputed pathway activity scores for canonical pathways using GSVA. C Two subnetworks for learning \ndrug features and cell line features respectively. GPDRP took molecular graphs of drugs and gene pathway \nactivity scores of cell lines as inputs to the drug subnetworks and cell line subnetworks, respectively. The two \nrepresentations are then concatenated and put through two FC layers to predict the response. D Results and \ndownstream analysis of this work. Including performance comparison, prediction of unknown drug-cell line \nresponse and predictions in LNCaP xenografts\nPage 8 of 16Yang and Li  BMC Bioinformatics          (2023) 24:484 \nthe division of the 54 samples into three main clusters. We summarized the samples \nwith the highest predicted values as Cluster 1, shown as the most red-colored region in \nFig.  3A. This cluster exhibits the strongest drug resistance, indicating the lowest drug \nsensitivity, and is mainly composed of tumor samples treated with ENZ (a total of 12 \nsamples, with 7 ENZS and 3 ENZR). Conversely, we summarized the samples with the \nlowest predicted values as Cluster 3, shown as the most blue-colored region in the figure, \nwhich demonstrates the highest sensitivity to the 173 drugs. Notably, ENZR samples are \ndistributed across all three clusters, suggesting heterogeneity in treatment outcomes and \nimplying that ENZ resistance may involve different underlying mechanisms, potentially \ninvolving interactions with stromal components in the tumor microenvironment [18].\nTo further elucidate the clustering results, we focused on pathway activity scores \nrelated to cell proliferation, as shown in Fig.  3B. The pathways related to cell prolifera -\ntion that we utilized are provided in Additional file  1: Table S6. Box plots were utilized \nto illustrate the variances in pathway activity scores among the three clusters. Cluster 1 \nexhibited the lowest pathway activity scores in cell proliferation-related pathways, which \nmay account for the lowest sensitivity to drug responses in this cluster. Conversely, \nCluster 3 displayed the highest pathway activity scores, indicating a higher prolifera -\ntion index, thereby explaining the increased sensitivity to drug responses in this cluster. \nTherefore, the use of gene activity scores makes the model results more interpretable.\nDiscussion\nAccurate prediction of drug response in cancer cells is pivotal for personalized oncology. \nThis work introduces GPDRP , a multimodal deep learning framework leveraging the \nGraph Transformer architecture to forecast the response to cancer treatment, utilizing \ninformation from both drug molecular graphs and gene pathway activity. We employed \nfour GNN variants: GCN, GAT, GIN and Graph Transformer with the combination of \nGIN, used for learning drug features. Subsequently, the drug-cell line pairs were used to \npredict LN IC50 values. Notably, our model combines drug molecule graphs with gene \npathway activity scores, outperforming some recently published methods in terms of \nperformance comparisons based on RMSE and PCCs.\nThe experimental results indicate that GPDRP outperforms in terms of RMSE and \nPCCs. Through performance comparison, we believe that representing drugs using \ngraphical structures may preserve the essence of their chemical structures, making \nit more appropriate than using strings. In this experiment, GPDRP_GIN_TRANS -\nFORMER demonstrated superior performance, possibly due to the addition of a Graph \nTransformer layer. Firstly, the multi-layer feature extraction capabilities of GIN and \nGraph Transformer complement each other. GIN excels in capturing local neighborhood \nfeatures, while the Graph Transformer layer effectively captures long-range dependen -\ncies and global relationships among nodes through its self-attention mechanism. The \ncombination of these two layers enables the model to learn more comprehensive and \ninformative graph structure features. Secondly, the integration of local and global infor -\nmation enhances the model’s representational power. GIN’s neighborhood aggregation \nprocess may overlook long-distance relationships, which can be effectively addressed \nby the Graph Transformer layer’s ability to capture global dependencies. By incorpo -\nrating the Graph Transformer layer after the GIN layers, the model achieves a better \nPage 9 of 16\nYang and Li  BMC Bioinformatics          (2023) 24:484 \n \nfusion of local and global information. This integration leverages the strengths of both \nmodels, allowing for comprehensive feature extraction, effective combinations of local \nand global information, and improved generalization abilities on graph data. Further -\nmore, when predicting responses for drug-cell line pairs with unknown responses in the \nCCLE/GDSC dataset, we identified Bortezomib, Daporinad, Paclitaxel, and vinca alka -\nloids as drugs with the lowest response values, highlighting their anti-tumor properties. \nConversely, drugs with the highest response values exhibited lower sensitivity to cancer, \nillustrating the model’s potential to learn from data and predict responses for new drug-\ncell line pairs. We further demonstrate the applicability of GPDRP in LNCaP xenografts \nand its interpretability using gene pathway activity scores.\nOne limitation of GPDRP is the interpretability of the model. We employ GNN to learn \nthe latent features of drug molecular graphs. While Nguyen et al. [15] demonstrated that \nGNN can assign significance to clearly defined chemical features automatically without \nprior knowledge, the majority of the learned latent variables still defy explanation using \navailable descriptors (specific details provided in Additional file  1: Supplementary Mate-\nrials C). Furthermore, our study solely focuses on cell lines, and when it comes to data \nsplitting based on drug compounds, the model falls short of achieving the anticipated \noutcomes (specific details provided in Additional file  1: Supplementary Materials D). \nThis may be attributed to the vast chemical space of drug compounds. In the future, we \nwill place a particular emphasis on researching model interpretability and give greater \nattention to drug-based research to enhance the model’s interpretability and improve its \neffectiveness in predicting drug responses. Additionally, RGCN and RGAT may enhance \nthe predictive capabilities of the model, and we will explore their use to achieve better \npredictive performance.\nConclusions\nIn this paper, we propose a multimodal deep learning model, GPDRP , which enables \nmore accurate prediction of drug responses. By employing drug molecular graphs as the \nrepresentation of drugs and leveraging GNN with Graph Transformer for feature extrac-\ntion, this approach may better preserve the structural information of drug molecules, \nenhancing the model’s understanding and predictive capability of drug features. Fur -\nthermore, through the incorporation of gene pathway activity scores, GPDRP provides \nvaluable interpretability. The introduction of this model holds significant implications, \noffering a precise tool for personalized medicine and cancer treatment, and driving \nadvancements in cancer research.\nMethods\nWe propose a multimodal deep learning architecture, called GPDRP for DRP . The DRP \nproblem is formulated as a regression task, wherein a drug-cell line pair serves as the \ninput and a continuous measurement of the response value LN IC50 of that pair serves \nas the output. Molecular graphs are used to represent drugs, which allows the model to \ndirectly capture atom-to-atom bonds. GPDRP is trained using the Pytorch [33]. Figure  4 \nillustrates the proposed framework.\nPage 10 of 16Yang and Li  BMC Bioinformatics          (2023) 24:484 \nData acquisition\nFor comparison purposes, we followed the same procedure as in Precily [18], obtain -\ning 550 CCLE cell lines’ bulk RNA-seq gene expression profiles that overlap with the \nGDSC2 dataset of the GDSC database. The relevant response data was extracted from \nthe GDSC2 dataset. We collected information on drug responses for 173 compounds, \nand their SMILES notations were retrieved using PubChemPy [34]. Specific data pro -\ncessing is provided in Additional file 1 : Supplementary Materials A.\nDrug molecular graph construction\nFor drug features, we perceive drug compounds as graphs depicting the interactions \namong atoms. Firstly, 173 molecular compounds’ chemical structure data was obtained \nin terms of a Canonical SMILES using PubChemPy (see Additional file 1: Table S1). Then \nusing the open-source cheminformatics program RDKit [35], we translated the Canoni -\ncal SMILES into the corresponding molecular graphs and extracted atomic features. We \nemployed a collection of atomic attributes adapted from DeepChem [36] to characterize \na node in the molecular graph. Each node is represented as a multidimensional binary \nfeature vector conveying five distinct pieces of information: the atomic symbol, the \nnumber of neighboring atoms, the number of neighboring hydrogen atoms, the implicit \nvalence of the atom, and whether the atom is part of an aromatic structure. The presence \nof a bond between a pair of atoms triggers the establishment of an edge. Consequently, \nan indirect binary graph, comprising nodes endowed with associated attributes, is con -\nstructed for each input Canonical SMILES.\nGene pathway activity scores calculation\nFor cell lines features, we used pathway activity scores (see Additional file  1: Table S2). \nBased on the gene expression matrix, we computed Gene Set Variation Analysis (GSVA) \nscores using the GSVA [37] R software package, utilizing 1329 gene sets from the Molec-\nular Signatures Database (MSigDB) [38] make up the c2 canonical pathway collection \n(MSigDB.CP .v.6.1, see Additional file  1: Supplementary), with min.sz set to 5. By cal -\nculating GSVA scores, we transformed the gene expression matrix into a GSVA score \nmatrix comprising 1329 pathway activity scores and 550 cell lines. The resulting GSVA \nscore matrix served as the cell line feature matrix. To enhance the convergence and sta -\nbility of the model, each feature is normalized to the [0,1] range using min–max scaling. \nFor the k th cell line on the i th pathway, the normalization is performed as follows:\nwhere xik represents the kth cell line’s pathway activity score on the ith pathway, while \nmin(xi) and max(xi) respectively denote the minimum and maximum values of pathway \ni across all cell lines.\nProcessing of the response variable\nAfter processing the drug and cell line data, we obtained 95,150 drug-cell line pairs. \nThere were 15,094 pairs for which corresponding response values LN IC50 are not \nˆxik = xik − min (xi)\nmax (xi) − min(xi) ,\nPage 11 of 16\nYang and Li  BMC Bioinformatics          (2023) 24:484 \n \navailable in the GDSC database, and 80,056 pairs have LN IC50. Therefore, we used \nthese 80,056 pairs along with their corresponding response values for model training \nand testing. Additional file  1: Supplementary Materials B contained the dataset’s sum -\nmary statistics. In addition, we scaled the drug response values LN IC50 values within \nthe range of (0,1) to facilitate the training. For a given LN IC50 value x , the actual \nvalue is y = ex , and the subsequent function is employed to normalize y : the actual\nin order to distribute the result more evenly on (0, 1),the parameter value of −0.1 is typi-\ncally selected when y is very small ( < 10−3 ) [8].\nTwo subnetworks for drugs and cell lines\nConceptually, GPDRP can be viewed as a multimodal deep learning model comprising \ntwo subnetworks designed for processing drug and cell line features.\nFor drug features, graph convolutional networks may be well-fitting for DRP because a \ngraph is used to represent the drug’s molecular structure. In light of the widespread uti -\nlization of Graph Convolutional Networks (GCN) in the context of drug response pre -\ndiction [19, 39, 40], we investigated four graph convolutional models, including Graph \nConvolutional Networks (GCN) [41], Graph Attention Networks (GAT) [42], Graph Iso-\nmorphism Network (GIN) [43] and Graph Transformer with the combination of GIN, all \nof which we described as follows. Following the GNN, a fully connected layer (FC layer) \nwas additionally utilized to transform the outcome into 128 dimensions.\nFor cell line features, we used pathway activity scores and employed deep neural net -\nworks (DNN) with three hidden layers to learn features. The DNN architecture con -\nsisted of an input layer succeeded by three dense layers with sizes of 512, 1024, and 128, \nrespectively, using Rectified Linear Unit (ReLU) as the activation function. The archi -\ntecture incorporated a dropout layer with a rate set to 0.2 after the second dense layer \nto prevent overfitting. Then the output was flattened to a 128-dimensional vector. Sub -\nsequently, the 256-dimensional vector, encompassing both drug and cell line features, \ntraversed two FC layers to predict drug response, with 1024 and 128 nodes respectively. \nThe LN IC50 was used to quantify GPDRP output and indicated how well a medication \ninhibited the growth of a particular cancer cell line. A high level of drug efficacy was \nindicated by small IC50 values, which suggested that the drug was sensitive to the cor -\nresponding cancer cell line [28]. The hyper-parameters utilized in our experiments are \nlisted in Table 3. They were chosen on the basis of prior research experience rather than \ntuned.\nGraph convolutional networks (GCN)\nPredicting a continuous value that represents the LN IC50 of drug sensitivity in cell \nlines is our main goal in this work. We employ GCN to learn about each drug graph \nrepresentation. Formally, G = (V , E) denotes the graph of a given drug, where V is the \nset of N ∈ R nodes, each characterized as a C-dimensional vector, and E represents \nthe set of edges, which is denoted by an adjacency matrix A ∈ RN ×N  . A node feature \nmatrix X ∈ RN ×C and an adjacency matrix A are inputs to the multi-layer GCN. Then \nˆy = 1\n1 + y−0.1 ,\nPage 12 of 16Yang and Li  BMC Bioinformatics          (2023) 24:484 \nit generates a node-level output Z ∈ RN ×F with F denoting the quantity of features each \nnode output. A normalized form is employed to express the propagation rule as follows:\nwhere ˜A = A + IN  , ˜D is the graph diagonal degree matrix. And σ is an activation \nfunction, H (l) ∈ RN ×C is the l - th  layer’s activation matrix, H(0) = X , W is learnable \nparameters.\nThree consecutive GCN layers are used in our GCN-based model, and the ReLU func -\ntion is applied after each layer. After the last GCN layer, a global max pooling layer is \nincorporated to capture the representation vector of the entire graph, which is then \ncombined with the representation of the cell line to predict the response value.\nGraph attention networks (GAT)\nThe GAT is constructed through the layering of a graph attention layer. It introduces an \nattention-based structure to acquire latent node representations within a graph, employ-\ning a self-attention mechanism. The GAT layer uses a weight matrix W to apply a linear \ntransformation to each node in a set of graph nodes that it receives as input. And the \nattention coefficients between node i and its first-order neighbors j are computed in the \ngraph as\nSubsequently, these attention coefficients undergo normalization through a softmax \nfunction and are employed to calculate the output features for the nodes as\nwhere σ( ·) is a non-linear activation function and αij are the normalized attention \ncoefficients.\nOur GAT-based model consists of three GAT layers activated by a ReLU func -\ntion, followed by a global max pooling layer to obtain the graph representation vector. \nH (l+1) = σ( ˜D− 1\n2 ˜A ˜D− 1\n2 H (l)W (l)),\nα(W xi, W xj).\nσ\nj∈N (i)\nαijW xj ,\nTable 3 Hyper-parameters for different graph neural network variants used in our experiments\nHyper‑parameters Setting\nActivation ReLu\nOptimizer Adam\nLearning rate 0.0001\nDropout 0.2\nGCN Layers 3\nGAT Layers 3\nGIN Layers 3\nGIN_TRANSFORMER Layers 3\nDNN Layers 3\nPage 13 of 16\nYang and Li  BMC Bioinformatics          (2023) 24:484 \n \nMulti-head-attentions are used for the first GAT layer, with the number of heads set to ten. \nThe second and third GAT’s output features are limited to 128.\nGraph Isomorphism network (GIN)\nThe GIN is a recent approach believed to attain optimal discriminative capability within \ngraph neural networks. It employs a multi-layer perceptron (MLP) model for updating \nthe node features as\nwhere µ is either a learnable parameter or a fixed scalar, x is the node feature vector, and \nN(i) is the set of nodes neighbor to i.\nThree GIN layers are stacked in our GIN-based model to build architecture, with a \nbatch normalization layer added after each layer. A global max pooling layer is added for \naggregating a graph representation vector, similar to previous architectures.\nGraph transformer\nGCN and GAT are designed to learn on homogeneous graphs. GIN updates node repre -\nsentations by utilizing only the features of local neighboring nodes, which may result in \ninsufficient capture of global information. In contrast, Transformer can facilitate better \nfeature learning for more generalized drug graphs. With its self-attention mechanism, \nTransformer can simultaneously consider the information from all nodes in the graph, \nenabling a more effective integration of global information.\nDrug graph G = (V , E) has a set of node type T v , and a set of edge type T e . There is an \nadjacency tensor A ∈ RN ×N ×K  , where K = |T e| and feature matrix X ∈ RN ×F . A meta-\npath is defined to predict new connections among nodes as\nwhere A ti is an adjacency matrix for the i th edge type of meta-path. For A ti , a soft adja -\ncency matrix Q using 1 × 1 convolution is\nwhere φ is a convolution layer and W φ ∈ R1×1×K . Combining with GCN, node represen-\ntations are constructed as\nZ is a function of neighborhood connectivity. Extracting features from the graph poses \nchallenges in determining the node positions because of the inherent characteristics of \nthe graph, the Graph Transformer utilizes Laplacian eigenvectors to address this con -\ncern as.\nwhere U and /Lambda1 are eigenvectors and eigenvalues, respectively.\nMLP\n\n(1 + µ)xi +\n�\nj∈N (i)\nxi\n\n,\nA P = A t1 ···A tp,\nQ = F(A,W φ ) = φ(A,softmax (W φ )),\nZ =\nC\ni=1 σ( ˜D−1\ni ˜A(l)\ni XW ) .\n/Delta1= I− D−1 /2 AD −1 /2 = U T /Lambda1U,\nPage 14 of 16Yang and Li  BMC Bioinformatics          (2023) 24:484 \nIn our model, we combined one Graph Transformer layer with two GIN layers to \nimprove feature extraction and prediction accuracy.\nPerformance evaluation\nTwo metrics were utilized to assess the performance of the models: Root Mean \nSquared Error (RMSE) and Pearson Correlation Coefficient (PCCs). RMSE is calcu -\nlated as the square root of the mean squared error, representing the average squared \ndifference between the actual and predicted responses. PCCs endeavors to gauge \nthe presence of a linear correlation between two variables. Given n samples, O is the \nactual response value, and Y is the predicted response value. The actual response \nwalue of ith sample is oi , and ith sample’s predicted response value is yi . RMSE is cal -\nculated as follows:\nThe PCCs of oi and yi is defined as follows:\nwhere σO and σY are the standard deviations of ground-truth O and predicted value Y , \nrespectively.\nAbbreviations\nGPDRP  Graph and gene pathway based drug response prediction method\nGNN  Graph neural networks\nDRP  Drug response prediction\nCCLE  The Cancer Cell Line Encyclopedia\nGDSC  The Genomics of Drug Sensitivity in Cancer\nCTRPv2  The cancer therapeutics response portal\nGIN  Graph isomorphism network\nSMILES  Simplified molecular-input line-entry system\nPCCs  Pearson correlation coefficient\nRMSE  Root mean square error\nGCN  Graph convolutional networks\nGAT   Graph attention networks\nSupplementary Information\nThe online version contains supplementary material available at https:// doi. org/ 10. 1186/ s12859- 023- 05618-0.\nAdditional file 1. Supplementary materials and tables.\nAcknowledgements\nWe thank Professor Luonan Chen for his kind guidance.\nAuthor contributions\nYY and PL designed the research; YY performed the research and wrote the manuscript; PL supervised and reviewed the \nmanuscript. PL supported the funding. All authors read and approved the final manuscript.\nFunding\nThis work is supported by National Natural Science Foundation of China (No. 61673008), the Young Backbone Teacher \nFunding Scheme of Henan (No. 2019GGJS079), Key R & Dand Promotion Special Program of Henan Province (No. \n212102310988), the Key Science and Technology Research Project of Henan Province of China (Grant No. 222102210053), \nthe Key Scientific Research Project in Colleges and Universities of Henan Province of China (Grant No. 21A510003), Inno-\nvation Team Support Program of Philosophy and social sciences in Henan province (No. 2024-CXTD-13).\nRMSE =\n√\n1\nn\n∑n\ni (oi− yi)2 .\nPCCs =\n∑n\ni (oi − yi)2\nσO σY\n.\nPage 15 of 16\nYang and Li  BMC Bioinformatics          (2023) 24:484 \n \nAvailability of data and materials\nPublicly available datasets were analyzed in this study. Data supporting the findings of this study are available in Cancer \nCell Line Encyclopedia at https:// sites. broad insti tute. org/ ccle/, Genomics of Drug Sensitivity in Cancer at https:// www. \ncance rrxge ne. org/ and NCBI GEO database (accession number GSE211856) at https:// www. ncbi. nlm. nih. gov/ geo/. The \ncode used for this paper is available on GitHub (https:// github. com/ yyk124/ GPDRP).\nDeclarations\nEthics approval and consent to participate\nNot applicable.\nConsent for publication\nNot applicable.\nCompeting interests\nThe authors declare that they have no competing interests.\nReceived: 13 September 2023   Accepted: 13 December 2023\nReferences\n 1. Feng F, Shen B, Mou X, Li Y, Li H. Large-scale pharmacogenomic studies and drug response prediction for personal-\nized cancer medicine. J Genet Genom. 2021;48(7):540–51.\n 2. Adam G, Rampášek L, Safikhani Z, Smirnov P , Haibe-Kains B, Goldenberg A. Machine learning approaches to drug \nresponse prediction: challenges and recent progress. NPJ Precis Oncol. 2020;4:19.\n 3. Maeda H, Khatami M. Analyses of repeated failures in cancer therapy for solid tumors: poor tumor-selective drug \ndelivery, low therapeutic efficacy and unsustainable costs. Clin Transl Med. 2018;7(1):11.\n 4. Lopez JS, Banerji U. Combine and conquer: challenges for targeted therapy combinations in early phase trials. Nat \nRev Clin Oncol. 2017;14(1):57–66.\n 5. Barretina J, Caponigro G, Stransky N, Venkatesan K, Margolin AA, Kim SG, et al. The Cancer Cell Line Encyclopedia \nenables predictive modelling of anticancer drug sensitivity. Nature. 2012;483(7391):603–7.\n 6. Yang W, Soares J, Greninger P , Edelman EJ, Lightfoot H, Forbes S, et al. Genomics of Drug Sensitivity in Cancer \n(GDSC): a resource for therapeutic biomarker discovery in cancer cells. Nucleic Acids Res. 2013;41(Database \nissue):D955–61.\n 7. Seashore-Ludlow B, Rees MG, Cheah JH, Cokol M, Price EV, Coletti ME, et al. Harnessing connectivity in a large-scale \nsmall-molecule sensitivity dataset. Cancer Discov. 2015;5(11):1210–23.\n 8. Menden MP , Iorio F, Garnett M, McDermott U, Benes CH, Ballester PJ, Saez-Rodriguez J. Machine learning prediction \nof cancer cell sensitivity to drugs based on genomic and chemical properties. PLoS ONE. 2013;8(4):e61318.\n 9. Ammad-ud-din M, Georgii E, Gönen M, Laitinen T, Kallioniemi O, Wennerberg K, et al. Integrative and personalized \nQSAR analysis in cancer by kernelized Bayesian matrix factorization. J Chem Inf Model. 2014;54(8):2347–59.\n 10. Zhang N, Wang H, Fang Y, Wang J, Zheng X, Liu XS. Predicting anticancer drug responses using a dual-layer inte-\ngrated cell line-drug network model. PLoS Comput Biol. 2015;11(9):e1004498.\n 11. Wang L, Li X, Zhang L, Gao Q. Improved anticancer drug response prediction in cell lines using matrix factorization \nwith similarity regularization. BMC Cancer. 2017;17(1):513.\n 12. Chang Y, Park H, Yang HJ, Lee S, Lee KY, Kim TS, et al. Cancer Drug Response Profile scan (CDRscan): a deep learning \nmodel that predicts drug effectiveness from cancer genomic signature. Sci Rep. 2018;8(1):8857.\n 13. Sakellaropoulos T, Vougas K, Narang S, Koinis F, Kotsinas A, Polyzos A, et al. A deep learning framework for predicting \nresponse to therapy in cancer. Cell Rep. 2019;29(11):3367-3373.e4.\n 14. Choi J, Park S, Ahn J. RefDNN: a reference drug based neural network for more accurate prediction of anticancer \ndrug resistance. Sci Rep. 2020;10(1):1861.\n 15. Nguyen T, Le H, Quinn TP , Nguyen T, Le TD, Venkatesh S. GraphDTA: predicting drug-target binding affinity with \ngraph neural networks. Bioinformatics. 2021;37(8):1140–7.\n 16. Ein-Dor L, Zuk O, Domany E. Thousands of samples are needed to generate a robust gene list for predicting out-\ncome in cancer. Proc Natl Acad Sci USA. 2006;103(15):5923–8.\n 17. Khatri P , Sirota M, Butte AJ. Ten years of pathway analysis: current approaches and outstanding challenges. PLoS \nComput Biol. 2012;8(2):e1002375.\n 18. Chawla S, Rockstroh A, Lehman M, Ratther E, Jain A, Anand A, et al. Gene expression based inference of cancer drug \nsensitivity. Nat Commun. 2022;13(1):5680.\n 19. Chu T, Nguyen TT, Hai BD, Nguyen QH, Nguyen T. Graph transformer for drug response prediction. IEEE/ACM Trans \nComput Biol Bioinform. 2023;20(2):1065–72.\n 20. Liu Q, Hu Z, Jiang R, Zhou M. DeepCDR: a hybrid graph convolutional network for predicting cancer drug response. \nBioinformatics. 2020;36(Supplement_2):i911–8.\n 21. Liu P , Li H, Li S, Leung KS. Improving prediction of phenotypic drug response on cancer cell lines using deep convo-\nlutional network. BMC Bioinform. 2019;20(1):1–4.\n 22. Ross JS, Schenkein DP , Pietrusko R, Rolfe M, Linette GP , Stec J, et al. Targeted therapies for cancer 2004. Am J Clin \nPathol. 2004;122(4):598–609.\nPage 16 of 16Yang and Li  BMC Bioinformatics          (2023) 24:484 \n•\n \nfast, convenient online submission\n •\n  \nthorough peer review by experienced researchers in your ﬁeld\n• \n \nrapid publication on acceptance\n• \n \nsupport for research data, including large and complex data types\n•\n  \ngold Open Access which fosters wider collaboration and increased citations \n \nmaximum visibility for your research: over 100M website views per year •\n  At BMC, research is always in progress.\nLearn more biomedcentral.com/submissions\nReady to submit y our researc hReady to submit y our researc h  ?  Choose BMC and benefit fr om: ?  Choose BMC and benefit fr om: \n 23. Friedman AA, Amzallag A, Pruteanu-Malinici I, Baniya S, Cooper ZA, Piris A, et al. Landscape of targeted anti-\ncancer drug synergies in melanoma identifies a novel BRAF-VEGFR/PDGFR combination treatment. PLoS ONE. \n2015;10(10):e0140310.\n 24. Chen D, Frezza M, Schmitt S, Kanwar J, Dou PQ. Bortezomib as the first proteasome inhibitor anticancer drug: cur-\nrent status and future perspectives. Curr Cancer Drug Targets. 2011;11(3):239–53.\n 25. Smith MR, Jin F, Joshi I. Bortezomib sensitizes non–Hodgkin’s lymphoma cells to apoptosis induced by antibodies to \ntumor necrosis factor–related apoptosis-inducing ligand (TRAIL) receptors TRAIL-R1 and TRAIL-R2. Clin Cancer Res. \n2007;13(18):5528s-s5534.\n 26. PubChem [Internet]. Bethesda (MD): National Library of Medicine (US), National Center for Biotechnology Informa-\ntion; 2004-. PubChem Compound Summary for CID 6914657, Daporinad; [cited 2023 July 17]. Available from: \nhttps:// pubch em. ncbi. nlm. nih. gov/ compo und/ Dapor inad\n 27. Wishart DS, Knox C, Guo AC, Shrivastava S, Hassanali M, Stothard P , Chang Z, Woolsey J. DrugBank: a comprehensive \nresource for in silico drug discovery and exploration. Nucleic Acids Res. 2006;34(suppl_1):D668-72.\n 28. Brugières L, Pacquement H, Le Deley MC, Leverger G, Lutz P , Paillard C, et al. Single-drug vinblastine as salvage \ntreatment for refractory or relapsed anaplastic large-cell lymphoma: a report from the French Society of Pediatric \nOncology. J Clin Oncol. 2009;27(30):5056–61.\n 29. Xu B, Sun T, Wang S, Lin Y. Metronomic therapy in advanced breast cancer and NSCLC: vinorelbine as a paradigm of \nrecent progress. Expert Rev Anticancer Ther. 2021;21(1):71–9.\n 30. Škubník J, Pavlíčková VS, Ruml T, Rimpelová S. Vincristine in combination therapy of cancer: emerging trends in clin-\nics. Biology. 2022;10(9):849.\n 31. Zhou X, Zhu H, Liu L, Lin J, Tang K. A review: recent advances and future prospects of taxol-producing endophytic \nfungi. Appl Microbiol Biotechnol. 2010;86:1707–17.\n 32. Gandhi V, Keating MJ, Bate G, Kirkpatrick P . Nelarabine. Nat Rev Drug Discovery. 2006;5(1):17–9.\n 33. Paszke A, Gross S, Massa F, Lerer A, Bradbury J, Chanan G, et al. Pytorch: An imperative style, high-performance deep \nlearning library. Advances in neural information processing systems 2019; 32.\n 34. Swain, M. PubChemPy: A way to interact with PubChem in Python. (2014).\n 35. Landrum G. RDKit: Open-source cheminformatics. 2006. Google Scholar 2006.\n 36. Ramsundar B, Eastman P , Walters P , Pande V. Deep learning for the life sciences: applying deep learning to genomics, \nmicroscopy, drug discovery, and more. O’Reilly Media, Inc; 2019\n 37. Hänzelmann S, Castelo R, Guinney J. GSVA: gene set variation analysis for microarray and RNA-seq data. BMC Bioin-\nform. 2013;14:1–5.\n 38. Subramanian A, Tamayo P , Mootha VK, Mukherjee S, Ebert BL, Gillette MA, et al. Gene set enrichment analy-\nsis: a knowledge-based approach for interpreting genome-wide expression profiles. Proc Natl Acad Sci. \n2005;102(43):15545–50.\n 39. Huang Z, Zhang P , Deng L. DeepCoVDR: deep transfer learning with graph transformer and cross-attention for \npredicting COVID-19 drug response. Bioinformatics. 2023;39(39 Suppl 1):i475–83.\n 40. Kim S, Bae S, Piao Y, Jo K. Graph convolutional network for drug response prediction using gene expression data. \nMathematics. 2021;9(7):772.\n 41. Kipf TN, Welling M. Semi-supervised classification with graph convolutional networks. arXiv: 1609. 02907. 2016 Sep 9.\n 42. Velickovic P , Cucurull G, Casanova A, Romero A, Lio P , Bengio Y. Graph Attention Networks Stat. \n2017;1050(20):10–48550.\n 43. Xu K, Hu W, Leskovec J, Jegelka S. How powerful are graph neural networks?. arXiv: 1810. 00826. 2018 Oct 1.\nPublisher’s Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.",
  "topic": "Interpretability",
  "concepts": [
    {
      "name": "Interpretability",
      "score": 0.8084696531295776
    },
    {
      "name": "Generalizability theory",
      "score": 0.5840290784835815
    },
    {
      "name": "Computer science",
      "score": 0.5691867470741272
    },
    {
      "name": "Pharmacogenomics",
      "score": 0.47291073203086853
    },
    {
      "name": "Computational biology",
      "score": 0.46104878187179565
    },
    {
      "name": "Artificial intelligence",
      "score": 0.4379490911960602
    },
    {
      "name": "Machine learning",
      "score": 0.4345037043094635
    },
    {
      "name": "Bioinformatics",
      "score": 0.2768510580062866
    },
    {
      "name": "Biology",
      "score": 0.2607152462005615
    },
    {
      "name": "Mathematics",
      "score": 0.1232810914516449
    },
    {
      "name": "Statistics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I167383011",
      "name": "Henan University of Science and Technology",
      "country": "CN"
    }
  ]
}