{
  "title": "Development and Application of Linear Variable Differential Transformer (LVDT) Sensors for the Structural Health Monitoring of an Urban Railway Bridge in Vietnam",
  "url": "https://openalex.org/W4387641744",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A2998779015",
      "name": "Nguyen Thi Cam Nhung",
      "affiliations": [
        "University of Transport and Communications"
      ]
    },
    {
      "id": "https://openalex.org/A2149534389",
      "name": "Le Van Vu",
      "affiliations": [
        "University of Transport and Communications"
      ]
    },
    {
      "id": "https://openalex.org/A2561956420",
      "name": "Huu Quyet Nguyen",
      "affiliations": [
        "University of Transport and Communications"
      ]
    },
    {
      "id": "https://openalex.org/A2977122330",
      "name": "Dang Thi Huyen",
      "affiliations": [
        "University of Transport and Communications"
      ]
    },
    {
      "id": "https://openalex.org/A2509999270",
      "name": "Duc Binh Nguyen",
      "affiliations": [
        "University of Minho"
      ]
    },
    {
      "id": "https://openalex.org/A5092937555",
      "name": "Minh Tran Quang",
      "affiliations": [
        "University of Minho"
      ]
    },
    {
      "id": "https://openalex.org/A2998779015",
      "name": "Nguyen Thi Cam Nhung",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2149534389",
      "name": "Le Van Vu",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2561956420",
      "name": "Huu Quyet Nguyen",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2977122330",
      "name": "Dang Thi Huyen",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2509999270",
      "name": "Duc Binh Nguyen",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A5092937555",
      "name": "Minh Tran Quang",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W4379185367",
    "https://openalex.org/W4386643486",
    "https://openalex.org/W2102301420",
    "https://openalex.org/W7036689125",
    "https://openalex.org/W4386636575",
    "https://openalex.org/W2911958892",
    "https://openalex.org/W361879378",
    "https://openalex.org/W4385780267",
    "https://openalex.org/W4382058003",
    "https://openalex.org/W4382699048",
    "https://openalex.org/W3023839587",
    "https://openalex.org/W2146144498",
    "https://openalex.org/W4210738954",
    "https://openalex.org/W2093111431",
    "https://openalex.org/W2018224168",
    "https://openalex.org/W2068511230",
    "https://openalex.org/W2048049033"
  ],
  "abstract": "Measuring the structure's displacement plays a very important role in ensuring the safe operation of railway bridges in general and urban railway bridges in particular. In Vietnam, traditional methods using high-precision mechanical gauges have been used to measure the displacement of railway bridges. However, these methods need a lot of effort in installation and traffic control during implementation. These methods are based on the static principle: The test loads are placed on the bridge structure, and then the structure's displacement is observed. The safety assessment and analysis results are guaranteed by multiplying the dynamic coefficients, leading to some assessments that may not be close to the actual exploitation of the bridge structure. Therefore, the current study presents a new solution for measuring the displacement of railway bridge structures. This method uses Linear Variable Differential Transformer (LVDT) sensors to record the continuous displacement of the structure during the time the train passes over the bridge. Through field measurements combined with a finite element analysis model, the research focuses on developing and applying LVDT sensors in urban railway bridge structure health monitoring. At the same time, the potential of developing this method in Vietnam in the future is evaluated.",
  "full_text": "Engineering, Technology & Applied Science Research  Vol. 13, No. 5, 2023, 11622-11627  11622   \n \nwww.etasr.com Nhung et al.: Development and Applica tion of Linear Variable Differential Transformer (LVDT) … \n \nDevelopment and Application of Linear \nVariable Differential Transformer (LVDT) \nSensors for the Structural Health Monitoring of \nan Urban Railway Bridge in Vietnam  \n \nNguyen Thi Cam Nhung \nUniversity of Transport and Communications, Vietnam  \nncnhung@utc.edu.vn  \n \nLe Van Vu \nUniversity of Transport and Communications, Vietnam \nvulv2704@gmail.com \n \nQuyet Nguyen Huu \nUniversity of Transport and Communications, Vietnam \nquyetutck57@gmail.com  \n \nHuyen Dang Thi \nUniversity of Transport and Communications, Vietnam \ndanghuyen02101998@gmail.com \n \nDuc Binh Nguyen  \nISISE, Department of Civil Engineering, University of Minho, Portugal \nbinhnd@utc.edu.vn \n \nMinh Tran Quang \nISISE, Department of Civil Engineering, University of Minho, Portugal \nminhtq@civil.uminho.pt (corresponding author) \nReceived: 16 July 2023 | Revised: 6 August 2023 | Accepted: 8 August 2023 \nLicensed under a CC-BY 4.0 license | Copyright (c) by the authors | DOI: https://doi.org/10.48084/etasr.6192 \nABSTRACT \nMeasuring the structure's displacement plays a very  important role in ensuring the safe operation of \nrailway bridges in general and urban railway bridge s in particular. In Vietnam, traditional methods us ing \nhigh-precision mechanical gauges have been used to measure the displacement of railway bridges. \nHowever, these methods need a lot of effort in inst allation and traffic control during implementation.  \nThese methods are based on the static principle: Th e test loads are placed on the bridge structure, an d \nthen the structure's displacement is observed. The safety assessment and analysis results are guaranteed by \nmultiplying the dynamic coefficients, leading to so me assessments that may not be close to the actual \nexploitation of the bridge structure. Therefore, the current study presents a new solution for measuring the \ndisplacement of railway bridge structures. This met hod uses Linear Variable Differential Transformer \n(LVDT) sensors to record the continuous displacemen t of the structure during the time the train passes  \nover the bridge. Through field measurements combine d with a finite element analysis model, the researc h \nfocuses on developing and applying LVDT sensors in urban railway bridge structure health monitoring. At \nthe same time, the potential of developing this method in Vietnam in the future is evaluated. \nKeywords-dynamic displacement; LVDT; urban railway \nEngineering, Technology & Applied Science Research  Vol. 13, No. 5, 2023, 11622-11627  11623   \n \nwww.etasr.com Nhung et al.: Development and Applica tion of Linear Variable Differential Transformer (LVDT) … \n \nI.  INTRODUCTION  \nThe urban railway is considered the backbone of the  \ntransport infrastructure system of any developed ci ty in the \nworld [1, 2]. Hanoi is no exception. Moreover, the need to \nbuild an urban railway network is becoming more urg ent than \never when the pressure of traffic congestion and en vironmental \npollution increasingly weighs on the narrow infrastructure fund \nof the Vietnamese capital. Putting into operation t he urban \nrailway network is expected not only to change the urban \nappearance of Hanoi and reduce congestion and accid ents, but \nto a greater extent, it will change the habit of us ing public \ntransport and the traffic culture of the people in the future. \nCurrently, Hanoi is expected to have 8 urban railwa y lines \ntotaling about 318 km. This is the first elevated u rban railway \nsystem in Vietnam. The first two railway lines buil t were Line \n2A, section Cat Linh - Ha Dong, and Line 3, section  Nhon - \nHanoi Railway Station. Therefore, timely detection and repair \nof problems related to the span structure are extre mely \nnecessary because the route is built in the roadway  of densely \npopulated and high-traffic routes, making repairs o n a large \nscale difficult. One of the causes affecting the da mage of \npartial span structures is also due to excessive de formation. In \nthe management and understanding of both new infras tructure \nusing new technologies and decaying infrastructure,  in \nparticular bridges and pavements, field testing is a topic that is \nbecoming more and more crucial. After an isolated a nd \npotentially catastrophic event, there is a requirement for precise \nand expensive diagnostics, load distribution verification, actual \nload-carrying capacity calculation, and structural performance \nevaluation. This helps to improve the efficiency of exploitation \nand increase the safety of railway infrastructure. At the same \ntime, the regular assessment will take timely remedial measures \nto avoid disrupting traffic and not affecting other  related \nindustries.  \nRailroad managers inspect bridges regularly to ensu re their \nsafety and prevent derailments, delays in network o peration, \nand loss of time and resources. The majority of con temporary \nbridge inspection techniques call for visual inspec tion [3] \nwhich often is not reliable [4-6]. The operational capacities of a \nbridge can be determined with the help of Structura l Health \nMonitoring (SHM) [7]. Railroad management organizations are \ninterested in measuring parameters and responses un der loads \nto objectively inform the safety and expansion of t heir \noperations. An essential component of SHM is the \nmeasurement of bridge displacement under dynamic lo ads \nbrought on by train motion [8-10]. The measured def lection \nresponse can be incorporated into a bridge finite element model \nto calculate back residual capacity, compare the in -service \nbehavior with the intended behavior, or determine the degree of \ndamage. According to the commonly used traditional method, \ndisplacement at a position on the structure is measured through \nstatic testing. The load is calculated and placed i n the most \nunfavorable position of the structure [11, 12]. The  equipment \nused here is high-precision mechanical gauges or hi gh-\nprecision surveying devices (Figure 1). The above m ethod has \nrelatively accurate results for the test loads. However, there are \na few shortcomings in this method. First, in order to perform \nthe static load test, it is necessary to stop the t raffic on the road \n(Figure 2). Second, the measured result is the disp lacement \ncaused by the test load, not the actual daily load on the bridge. \nThe test load is completely based on the experience  and the \ncalculations of the consultant. Therefore, the resu lts do not \nfully evaluate the entire response of the bridge. F urthermore, \nthis result only represents a specified moment of t he bridge, \nwhich is usually the maximum value when the test lo ad enters \nthe bridge. If an abnormality is present in the dyn amic \nresponse, this result will usually not be accuratel y evaluated \n[13]. \n \n \n(a) \n \n(b) \nFig. 1.  Measure displacement: (a) Use of high-precision mec hanical \ngauges, (b). surveying devices. \n \nFig. 2.  Static load test to inspection bridge. \nIn railway bridges, especially urban railway bridge s, it is \nimpossible to mobilize test loads from trains. The only way to \nmeasure displacement of a bridge structure is to me asure it \nduring its operation. Traditional methods are not e fficient \nenough and the obtained results will not have high accuracy. \nThis leads to the need to apply a new type of devic e to record \nthe dynamic displacement of the structure under the  effect of \noperating loads. Several researchers have developed  methods \nfor different types of devices. Authors in [14-16] used \naccelerometers to measure the horizontal displaceme nt of the \nstructure. The Global Positioning System (GPS) has also been \nused as a contact sensor to measure displacement [1 7-19]. \nAlthough these methods are relatively modern, the a ccuracy \nlevel is only acceptable. Besides, the equipment in vestment \ncost for the above solutions is relatively expensiv e, often not \nsuitable for management units. \n\nEngineering, Technology & Applied Science Research  Vol. 13, No. 5, 2023, 11622-11627  11624   \n \nwww.etasr.com Nhung et al.: Development and Applica tion of Linear Variable Differential Transformer (LVDT) … \n \nLVDT has been applied to many projects around the w orld \n[20], even though in Vietnam, this device is still in limited use. \nThis study proposes the use of LVDT sensors install ed on the \nurban railway bridge structure to measure the displ acement \nunder the effect of the train load in operation. Sy stem \nvalidation and development were conducted through f ield \nexperiments and finite element modeling. Finally, b arriers to \nusing LVDT for field applications were identified a nd possible \nsolutions to each problem were proposed. \nII.  LINEAR VARIABLE DIFFERENTIAL \nTRANSFORMER (LVDT) \nA.  Introducing LVDT \nThe LVDT is an essential kind of inductive transduc er. \nInductive transducers are those that operate on the  idea of a \ntransduction mechanism. In essence, an LVDT is a po sition \nsensor that can pick up on linear motion or vibrati ons and \ntranslate them into electrical signals or a fluctua ting electrical \ncurrent. The LVDT sensor transforms the linear move ment of \nthe object to which it is connected into a variable  electrical \nsignal that corresponds to that movement. The movem ent \nmight range from 0-0.5 mm to 0-1000 mm in laborator y, \nindustrial, and underwater contexts. This design has been in use \nfor many years for the precise measurement of displ acement \nand for positioning control in tight loops. \nB.  The LVDT Working Principle \nSimilar to a transformer, an LVDT has one main wind ing, \ndesignated P, and two secondary windings, designate d S1 and \nS2. The primary and secondary windings are wound on  a \nformer, which is a hollow cylindrical structure (Fi gure 3). The \nformer is frequently made of glass-reinforced polym er that has \nbeen clad in cylindrical steel and wrapped in a porous material. \nThe primary winding of the cylindrical former is in the middle, \nand on either side of it, two secondary windings ar e placed \nevenly separated from the center. Both secondary wi ndings \nhave the same number of turns and are connected to one \nanother in series opposition, meaning that they are  wound in \ndifferent directions yet are connected to one another.  \n \n \nFig. 3.  Structure of LVDT  \nThe electromagnetic law of Faraday serves as the \nfoundation for how LVDTs function. An alternating m agnetic \nfield is produced when the primary winding of the L VDT is \nconnected to the AC power source; this field genera tes an \nelectromotive force (emf) in the secondary windings . The \nsecondary signal alters as the core moves in this r egion (Figure \n4(a)). When the core is positioned in the center an d the two \nsecondary windings are arranged and connected in a specified \nconfiguration (push-pull mode), a zero signal is ob tained. The \nsignal grows as the core is moved away from this lo cation in \neither direction (Figure 4(b)). The signal output h as a linear \nrelationship with the actual mechanical movement of  the core \nas long as the windings are wound with a specific l evel of \nprecision. A phase-sensitive demodulator that switc hes at the \nsame frequency as the primary energizing supply the n \nprocesses the secondary output signal. This yields a final output \nthat, following rectification and filtering, provid es a DC or 4-\n20 mA output proportional to the core movement and also \nspecifies its direction, positive or negative from the center zero \npoint (Figure 4(c)). \n(a) \n \n(b) \n \n(c) \n \nFig. 4.  The LVDT working principle. \nC.  Advantages of the LVDT \nOne of the most outstanding features of the LVDT ov er \nother mechanical measuring devices is the absence o f friction. \nThis is because there is no direct contact between the moving \ncore and the other parts. This results in the devic e not being \neasily damaged. In terms of longevity, LVDT will be  more \ndurable than other devices. The LVDT does not need to employ \nan amplifier to amplify the signals because of its powerful \noutput signal and sensitivity to even very small di splacements. \nThis is very suitable for monitoring and measuring structures \nwith large displacements such as bridges. They typi cally use \nless than 1 W of electricity and exhibit less hyste resis loss, \nwhich improves their reliability. LVDT sensors are small and \nlightweight, they can be readily handled and aligne d to meet \nrequirements. In spite of their tiny size and light weight nature, \n\nEngineering, Technology & Applied Science Research  Vol. 13, No. 5, 2023, 11622-11627  11625   \n \nwww.etasr.com Nhung et al.: Development and Applica tion of Linear Variable Differential Transformer (LVDT) … \n \nLVDT can withstand mechanical shocks and vibrations . The \nabsolute value is provided by the LVDT. It implies that in the \nevent of an unexpected power outage, the LVDT does not lose \nits location data. If the measurement is redone, the output value \nstays the same as it was before to the power outage. \nFrom the above advantages, the application and \ndevelopment of LVDT in dynamic measurement and \nmonitoring of urban railway bridge structures is co mpletely \nappropriate. \nIII.  CASE STUDY \nA.  Hanoi Urban Railway, Cat Linh Ha Dong Line \nThe Hanoi Urban Railway system includes the urban \nrailway line connecting Cat Linh and Ha Dong (Figur e 5). The \nCat Linh - Ha Dong route has a total length of 13021.48 m. The \nentire route is built on high (overpass form). The main span \nstructure used is a combination of simple beams sup ported on \npiers. The span length main forms are 18.5, 20, 26,  29, 30, 32 \nm span structure with box cross section. Cat Linh -  Ha Dong \nurban railway line is designed to ensure a harmonio us \nconnection with other urban railway lines in the fu ture and bus \nstations along the route. \n \n \nFig. 5.  The Cat Linh-Ha Dong urban railway bridge. \nB.  Equipment Selection \nAs described above, the equipment used here is two LVDT \nsensors and dedicated cables for signal transmission (Figure 6). \n \n \nFig. 6.  LVDT sensors and cables. \nIn addition to the main part, LVDT displacement sen sors, \naccessories such as jigs, and fixing devices are al so equipped. \nA dedicated computer is used throughout the entire experiment. \nTo ensure the objectivity of the measurement results, a number \nof mechanical devices have been used and verified i n many \nexperiments (high-precision mechanical gauges). \nC.  Field test \nAt the center of a box girder span, a mechanical me asuring \ndevice and an LVDT sensor are installed (Figure 7). \n \n \n(a) \n \n(b) \n \n(c)  \nFig. 7.  Installation of the measuring equipment: (a) high-p recision \nmechanical gauges, (b) LVDT sensor, (c) data recording. \nA laptop is used with integrated measurement softwa re NI-\nLabVIEW 2014 (32-bit). It collects signals from the measuring \nheads during measurement and saves them as files. \nDisplacement is measured in both vertical and horiz ontal \ndirection of the structure. \nD.  Creation of the Finite Element Model \n(a) \n \n(b) \n \nFig. 8.  The finite element model of the structure. \n\nEngineering, Technology & Applied Science Research  Vol. 13, No. 5, 2023, 11622-11627  11626   \n \nwww.etasr.com Nhung et al.: Development and Applica tion of Linear Variable Differential Transformer (LVDT) … \n \nA finite element model was built based on the surve yed \nconditions and the profile of the project. The simu lated mobile \nload is a train moving at the speed according to th e operating \nprofile. The elements used are in the form of beams, the load is \nthe moving load of the train. \nIV.  RESULTS AND DISCUSSION \nThe simulation and experimental results are shown i n \nFigures 9 and 10. \n \n(a) \n \n(b) \n \nFig. 9.  Vertical displacement results. (a) Simulation, (b) experiment. \n(a) \n \n(b) \n \nFig. 10.  Horizontal displacement results. (a) Simulation, (b) experiment. \nBased on the results obtained from the model and th e \nexperiment, it can be seen that the measurement res ults from \nthe LVDT and the model are similar. The LVDT sensor  allows \nto record structural displacement data during the entire time the \ntrain is acting on the structure. Meanwhile, high-p recision \nmechanical gauges only allow a maximum value to be \nobserved. The comparison results between the model,  the \nLVDT sensor and the high-precision mechanical gauge s are \nsimilar, showing the reliability of the LVDT sensor . The \nmaximum vertical displacement value in the obtained  model is \n5.48 mm, LVDT is 5.68 mm, and high-precision mechan ical \ngauges are 5.5 mm. Because it is done automatically  and has a \nhigher sensitivity than human observation to mechan ical \nequipment, LVDT gives more accurate results. \nV.  CONCLUSION \nStructural displacement measurement plays a signifi cant \nrole in ensuring the safe operation of urban railwa y bridges. \nThis study proposes the use of LVDT sensors in stru ctural \nhealth monitoring (specifically displacement monito ring) on \nurban railway bridges. The displacement monitoring by LVDT \nis applied and gives good results on the actual bri dge. Field \ntests are designed for the application and developm ent of \nLVDT in structural displacement monitoring. The exp eriment \nconfirms the accuracy of the applied method and is combined \nwith the results of the finite element simulation. Through \ntesting on a real bridge, the obtained results show  the potential \nof LVDT when applied outside the laboratory. Althou gh the \ninitial investment cost may seem higher than that o f traditional \nsolutions, when it comes to long-term and performance aspects, \nthe LVDT shows its effectiveness when applied in pr actice. \nHere are some of the main conclusions of the current study: \n Applying LVDT in continuous displacement monitoring  of \nstructures gives better results than other traditio nal \nmethods. The obtained results are similar to the mo deling \nresults and the accuracy is greater than that of th e \ntraditional methods used in Vietnam. \n The result from LVDT is in the form of continuous d ata, \nand not discrete as when using high-precision mecha nical \ngauges. This leads to the easy observation of struc tural \nirregularities over long periods of time \n The results obtained from LVDT can be used for big data \napplications in structural health monitoring. Speci fically, \ntime series data can be used as an input to train a rtificial \nintelligence networks that are being developed recently. \nACKNOWLEDGMENT \nThis work was financed by research project \"B2022-G HA-\n03\" from the Ministry of Education and Training, Vi etnam. \nMinh Q. Tran was supported by the doctoral grant re ference \nPRT/BD/154268/2022, financed by Portuguese Foundati on for \nScience and Technology (FCT), under the MIT Portuga l \nProgram (2022 MPP2030-FCT). \nREFERENCES \n[1]  D. D. Van, \"A Research on the Load Calculation Meth od in Designing \nthe Traction Power Supply for Integrated Subway – MCR,\" Engineering, \nTechnology & Applied Science Research , vol. 13, no. 3, pp. 10882–\n10887, Jun. 2023, https://doi.org/10.48084/etasr.5909. \n[2]  A. Z. Bulum, M. Dugenci, and M. Ipek, \"Application of a Seat-based \nBooking Control Mechanism in Rail Transport with Cu stomer \nDiversion,\" Engineering, Technology & Applied Science Research , vol. \n12, no. 5, pp. 9126–9135, Oct. 2022, https://doi.org/10.48084/etasr.5171. \n\nEngineering, Technology & Applied Science Research  Vol. 13, No. 5, 2023, 11622-11627  11627   \n \nwww.etasr.com Nhung et al.: Development and Applica tion of Linear Variable Differential Transformer (LVDT) … \n \n[3]  How Freight Railroads Maintain Bridges . https://www.youtube.com/ \nwatch?v=OJfWv_lZwNk, 2013. \n[4]  D. Agdas, J. A. Rice, J. R. Martinez, and I. R. Las a, \"Comparison of \nVisual Inspection and Structural-Health Monitoring As Bridge \nCondition Assessment Methods,\" Journal of Performance of \nConstructed Facilities , vol. 30, no. 3, Jun. 2016, Art. no. 04015049, \nhttps://doi.org/10.1061/(ASCE)CF.1943-5509.0000802. \n[5]  N. T. C. Nguyen, M. Q. Tran, H. S. Sousa, T. V. Ngo , and J. C. Matos, \n\"Damage detection of structural based on indirect vibration measurement \nresults combined with Artificial Neural Network,\" Journal of Materials \nand Engineering Structures , vol. 9, no. 4, pp. 403–410, Dec. 2022. \n[6]  T. Q. Minh, S. S. Helder, and C. M. Jose, \"Applicat ion of AI Tools in \nCreating Datasets from A Real Data Component for St ructural Health \nMonitoring,\" in Data Driven Methods for Civil Structural Health \nMonitoring and Resilience: Latest Developments and Applications , CRC \nPress, 2023. \n[7]  M. S. Mohammed and K. Ki-Seong, \"Chirplet Transform  in Ultrasonic \nNon-Destructive Testing and Structural Health Monit oring: A Review,\" \nEngineering, Technology & Applied Science Research , vol. 9, no. 1, pp. \n3778–3781, Feb. 2019, https://doi.org/10.48084/etasr.2470. \n[8]  F. Moreu and J. M. LaFave, \"Current Research Topics: Railroad Bridges \nand Structural Engineering,\" University of Illinois , Newmark Structural \nEngineering Laboratory Report Series Report No. NSEL-032, Oct. 2012. \n[9]  T. Q. Minh, N. T. C. Nhung, N. H. Quyet, S. Helder,  S. Sou, and C. J. \nMatos, \"Opportunities and Challenges of Digital Twi ns in Structural \nHealth Monitoring,\" in Proceedings of the 4th International Conference \non Sustainability in Civil Engineering , Hanoi, Vietnam, Nov. 2023, pp. \n25–27. \n[10]  N. T. C. Nguyen, M. Q. Tran, H. S. Sousa, T. V. Ngo , and J. C. Matos, \n\"Damage detection of structural based on indirect vibration measurement \nresults combined with Artificial Neural Network,\" Journal of Materials \nand Engineering Structures «  JMES  », vol. 9, no. 4, pp. 403–410, Dec. \n2022. \n[11]  M. Q. Tran et al. , \"Structural Assessment Based on Vibration \nMeasurement Test Combined with an Artificial Neural  Network for the \nSteel Truss Bridge,\" Applied Sciences , vol. 13, no. 13, Jan. 2023, Art. \nno. 7484, https://doi.org/10.3390/app13137484. \n[12]  M. Q. Tran, H. S. Sousa, J. Matos, S. Fernandes, Q.  T. Nguyen, and S. \nN. Dang, \"Finite Element Model Updating for Composi te Plate \nStructures Using Particle Swarm Optimization Algori thm,\" Applied \nSciences , vol. 13, no. 13, an. 2023, Art. no. 7719, https:/ /doi.org/ \n10.3390/app13137719. \n[13]  C. Dong, S. Bas, M. Debees, N. Alver, and F. N. Cat bas, \"Bridge Load \nTesting for Identifying Live Load Distribution, Loa d Rating, \nServiceability and Dynamic Response,\" Frontiers in Built Environment , \nvol. 6, 2020, https://doi.org/10.3389/fbuil.2020.00046. \n[14]  J. Yang, J. B. Li, and G. Lin, \"A simple approach t o integration of \nacceleration data for dynamic soil–structure intera ction analysis,\" Soil \nDynamics and Earthquake Engineering , vol. 26, no. 8, pp. 725–734, \nAug. 2006, https://doi.org/10.1016/j.soildyn.2005.12.011. \n[15]  T. Nagayama, B. F. Spencer, and J. A. Rice, \"Struct ural health \nmonitoring using smart sensors,\" in World Forum on Smart Materials \nand Smart Structures Technology , CRC Press, 2008. \n[16]  A. I. Ozdagli, F. Moreu, J. A. Gomez, P. Garp, and S. Vemuganti, \"Data \nFusion of Accelerometers with Inclinometers for Ref erence-free High \nFidelity Displacement Estimation,\" presented at the  8th European \nWorkshop On Structural Health Monitoring (EWSHM 201 6), Bilbao, \nSpain, Jul. 2016. \n[17]  T.-L. Wang, V. K. Garg, and K.-H. Chu, \"Railway Bri dge/Vehicle \nInteraction Studies with New Vehicle Model,\" Journal of Structural \nEngineering , vol. 117, no. 7, pp. 2099–2116, Jul. 1991, https: //doi.org/ \n10.1061/(ASCE)0733-9445(1991)117:7(2099). \n[18]  X. Meng, A. H. Dodson, and G. W. Roberts, \"Detecting bridge dynamics \nwith GPS and triaxial accelerometers,\" Engineering Structures , vol. 29, \nno. 11, pp. 3178–3184, Nov. 2007, https://doi.org/1 0.1016/j.engstruct. \n2007.03.012. \n[19]  T.-H. Yi, H.-N. Li, and M. Gu, \"Experimental assess ment of high-rate \nGPS receivers for deformation monitoring of bridge,\" Measurement , vol. \n46, no. 1, pp. 420–432, Jan. 2013, https://doi.org/ 10.1016/j. \nmeasurement.2012.07.018. \n[20]  F. Moreu et al. , \"Dynamic Assessment of Timber Railroad Bridges \nUsing Displacements,\" Journal of Bridge Engineering , vol. 20, no. 10, \nOct. 2015, Art. no. 04014114, https://doi.org/10.10 61/(ASCE)BE.1943-\n5592.0000726. ",
  "topic": "Linear variable differential transformer",
  "concepts": [
    {
      "name": "Linear variable differential transformer",
      "score": 0.9075822234153748
    },
    {
      "name": "Bridge (graph theory)",
      "score": 0.7043331265449524
    },
    {
      "name": "Structural health monitoring",
      "score": 0.6802016496658325
    },
    {
      "name": "Engineering",
      "score": 0.6034488081932068
    },
    {
      "name": "Transformer",
      "score": 0.5586371421813965
    },
    {
      "name": "Displacement (psychology)",
      "score": 0.5401360988616943
    },
    {
      "name": "Structural engineering",
      "score": 0.48529332876205444
    },
    {
      "name": "Vertical displacement",
      "score": 0.4797050356864929
    },
    {
      "name": "Finite element method",
      "score": 0.4361329972743988
    },
    {
      "name": "Distribution transformer",
      "score": 0.21478724479675293
    },
    {
      "name": "Electrical engineering",
      "score": 0.13458064198493958
    },
    {
      "name": "Voltage",
      "score": 0.06841382384300232
    },
    {
      "name": "Medicine",
      "score": 0.0
    },
    {
      "name": "Internal medicine",
      "score": 0.0
    },
    {
      "name": "Psychotherapist",
      "score": 0.0
    },
    {
      "name": "Psychology",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I4210093659",
      "name": "University of Transport and Communications",
      "country": "VN"
    },
    {
      "id": "https://openalex.org/I99682543",
      "name": "University of Minho",
      "country": "PT"
    }
  ],
  "cited_by": 20
}