{
  "title": "Does surgeon sex and anthropometry matter for tool usability in traditional laparoscopic surgery? A systematic review and meta-analysis",
  "url": "https://openalex.org/W4383888102",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A5030743416",
      "name": "Jaime Hislop",
      "affiliations": [
        "Swinburne University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5081025159",
      "name": "Dominic Orth",
      "affiliations": [
        "Swinburne University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5076828619",
      "name": "Oren Tirosh",
      "affiliations": [
        "Swinburne University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5033590604",
      "name": "Mats Isaksson",
      "affiliations": [
        "Swinburne University of Technology"
      ]
    },
    {
      "id": "https://openalex.org/A5061107889",
      "name": "Chris Hensman",
      "affiliations": [
        "Monash University"
      ]
    },
    {
      "id": "https://openalex.org/A5083242794",
      "name": "John McCormick",
      "affiliations": [
        "Swinburne University of Technology"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1970200091",
    "https://openalex.org/W2152022354",
    "https://openalex.org/W2035579437",
    "https://openalex.org/W2086622839",
    "https://openalex.org/W1544518130",
    "https://openalex.org/W2321294375",
    "https://openalex.org/W4210498822",
    "https://openalex.org/W1988237815",
    "https://openalex.org/W3085480156",
    "https://openalex.org/W2887782074",
    "https://openalex.org/W2779242671",
    "https://openalex.org/W4294215472",
    "https://openalex.org/W2120771911",
    "https://openalex.org/W2081153572",
    "https://openalex.org/W3214718993",
    "https://openalex.org/W3080541010",
    "https://openalex.org/W2013045380",
    "https://openalex.org/W2575669288",
    "https://openalex.org/W1978306738",
    "https://openalex.org/W2905460546",
    "https://openalex.org/W2073991651",
    "https://openalex.org/W2099695605",
    "https://openalex.org/W2943002397",
    "https://openalex.org/W2692672328",
    "https://openalex.org/W3042673948",
    "https://openalex.org/W1997452264",
    "https://openalex.org/W1982869351",
    "https://openalex.org/W2081233144",
    "https://openalex.org/W2170607366",
    "https://openalex.org/W2051145188",
    "https://openalex.org/W1967047916",
    "https://openalex.org/W2893146736",
    "https://openalex.org/W2946565048",
    "https://openalex.org/W2096216721",
    "https://openalex.org/W3161454719",
    "https://openalex.org/W2621816991",
    "https://openalex.org/W2168062284",
    "https://openalex.org/W2736874013",
    "https://openalex.org/W2535792622",
    "https://openalex.org/W3138155299",
    "https://openalex.org/W2950140246",
    "https://openalex.org/W1992886384",
    "https://openalex.org/W2088432795",
    "https://openalex.org/W2402507652",
    "https://openalex.org/W2027473922",
    "https://openalex.org/W4225270948",
    "https://openalex.org/W2035094765",
    "https://openalex.org/W1973396194",
    "https://openalex.org/W3125322110",
    "https://openalex.org/W1981015040",
    "https://openalex.org/W2098402826",
    "https://openalex.org/W4318474997",
    "https://openalex.org/W2321383378",
    "https://openalex.org/W2080916715",
    "https://openalex.org/W4311261867",
    "https://openalex.org/W2071468704",
    "https://openalex.org/W2038157960",
    "https://openalex.org/W2004182912",
    "https://openalex.org/W3108203868",
    "https://openalex.org/W2151032124",
    "https://openalex.org/W2809070266",
    "https://openalex.org/W3003864860",
    "https://openalex.org/W2735880886",
    "https://openalex.org/W2069820903",
    "https://openalex.org/W4280516349",
    "https://openalex.org/W4298128294",
    "https://openalex.org/W2763766763",
    "https://openalex.org/W2946921794",
    "https://openalex.org/W2015807465",
    "https://openalex.org/W2004374507",
    "https://openalex.org/W2883187780",
    "https://openalex.org/W2048393033",
    "https://openalex.org/W2763073604",
    "https://openalex.org/W4220895570",
    "https://openalex.org/W2962401720",
    "https://openalex.org/W2128337520",
    "https://openalex.org/W4285223918",
    "https://openalex.org/W67147281",
    "https://openalex.org/W246286872",
    "https://openalex.org/W2156098321"
  ],
  "abstract": null,
  "full_text": "Vol:.(1234567890)\nSurgical Endoscopy (2023) 37:6640–6659\nhttps://doi.org/10.1007/s00464-023-10228-1\n1 3\nREVIEW ARTICLE\nand Other Inte rventional Techniques \nDoes surgeon sex and anthropometry matter for tool usability \nin traditional laparoscopic surgery? A systematic review \nand meta‑analysis\nJaime Hislop1 · Dominic Orth2 · Oren Tirosh2,3  · Mats Isaksson1 · Chris Hensman4,5,6,7 · John McCormick8\nReceived: 29 March 2023 / Accepted: 17 June 2023 / Published online: 11 July 2023 \n© The Author(s) 2023\nAbstract\nIntroduction Hand size, strength, and stature all impact a surgeon’s ability to perform Traditional Laparoscopic Surgery \n(TLS) comfortably and effectively. This is due to limitations in instrument and operating room design. This article aims to \nreview performance, pain, and tool usability data based on biological sex and anthropometry.\nMethods PubMed, Embase, and Cochrane databases were searched in May 2023. Retrieved articles were screened based \non whether a full-text, English article was available in which original results were stratified by biological sex or physical \nproportions. Article quality was discussed using the Mixed Methods Appraisal Tool (MMAT). Data were summarized in \nthree main themes: task performance, physical discomfort, and tool usability and fit. Task completion times, pain prevalence, \nand grip style results between male and female surgeons formed three meta-analyses.\nResults A total of 1354 articles were sourced, and 54 were deemed suitable for inclusion. The collated results showed that \nfemale participants, predominantly novices, took 2.6–30.1 s longer to perform standardized laparoscopic tasks. Female \nsurgeons reported pain at double the frequency of their male colleagues. Female surgeons and those with a smaller glove \nsize were consistently more likely to report difficulty and require modified (potentially suboptimal) grip techniques with \nstandard laparoscopic tools.\nConclusions The pain and stress reported by female or small-handed surgeons when using laparoscopic tools demonstrates \nthe need for currently available instrument handles, including robotic hand controls, to become more size-inclusive. However, \nthis study is limited by reporting bias and inconsistencies; furthermore, most data was collected in a simulated environment. \nAdditional research into how anthropometric tool design impacts the live operating performance of experienced female \nsurgeons would further inform this area of investigation.\nKeywords Gender · Discomfort · Ergonomics · Injury · Traditional laparoscopic surgery (TLS)\nTool usability considers how the physical characteris-\ntics, operating force, and intuitiveness of an instrument \ncontributes to user comfort and performance [1 ]. This is \nimpacted by the physical dimensions and strength of the \nuser. Usability is defined as “the capability in human func-\ntional terms to be used easily and effectively by the specified \nrange of users, given specified training and user support, to \nfulfill the specified range of tasks, within the specified range \n * Oren Tirosh \n otirosh@swin.edu.au\n1 Department of Mechanical Engineering and Product \nDesign Engineering, Swinburne University of Technology, \nMelbourne, VIC, Australia\n2 School of Health Sciences, Swinburne University \nof Technology, Melbourne, VIC, Australia\n3 Institute for Health and Sport, Victoria University, Footscray, \nVIC, Australia\n4 Department of Surgery, Monash University,, Melbourne, \nVIC, Australia\n5 Department of Surgery, University of Adelaide, Adelaide, \nSA, Australia\n6 Swinburne University of Technology, Melbourne, VIC, \nAustralia\n7 LapSurgery Australia, Melbourne, VIC, Australia\n8 Centre for Transformative Media Technologies, Swinburne \nUniversity of Technology, Melbourne, VIC, Australia\n6641Surgical Endoscopy (2023) 37:6640–6659 \n1 3\nof environmental scenarios” [2]. Laparoscopic surgeons, like \nmany professionals, are only as good as their tools. Their \nexisting skill may be enhanced or limited by the operating \nequipment they use. Poor tool fit can cause pain or nerve \ninjuries [3 , 4]. Handle diameter relative to glove size can \nalso impact the application of force with an instrument [5 ], \nmaking them more difficult to wield for those of above or \nbelow average hand size.\nEven though pain and injury have been reported since the \ninception of TLS [ 3, 4], evolutions in handle design have \noccurred at a gradual pace. This is partly owing to the material \nand physical design constraints of surgical tools to guarantee \nsterilizability and ensure patient safety. Additionally, there is \noften more attention given to instrument functionality on the \npatient’s side than the surgeon’s side. Countless tool tips exist \nfor tissue manipulation, dissection, cauterization, and morcel-\nlation. Comparatively few instrument manufacturers consider \nhow effective tool use is impacted by the handle design, weight \ndistribution, and balance of the tool, along with the physical \ndimensions of the user [6]. The elongated instruments required \nfor TLS, the fulcrum effect created by the surgical ports, and \nan inadequate working height increase the shoulder abduction \nof those with a shorter arm span [7 ]. In their survey study, \nMorton et al. [8] reported that surgeons who were not between \n160 and 184 cm tall and those who did not have a medium or \nlarge glove size were marginally more likely to experience \npain and injury than those who did. These studies demonstrate \nthat the well-documented ergonomic problems associated with \nTLS are exacerbated for surgeons of smaller stature and glove \nsize.\nFemale surgeons are, on average, shorter, have a reduced \narm span, wear a smaller glove size, and potentially have less \nstrength than their male colleagues, creating a perfect storm of \nergonomic challenges that could make them more susceptible \nto injury. Female medical students already choose nonsurgi-\ncal specialties or leave training programs at a higher rate than \nmales based on a desire for work-life balance, mentorship, a \nlack of female representation, or the experience of bias and \ndiscrimination [9 , 10]. Ergonomic problems arising from \nregularly using tools designed for larger hands should not be \nanother factor deterring women from pursuing lifelong surgi-\ncal careers. As concerns exist regarding the sustainable provi-\nsion of healthcare in the future [11, 12], it is vital to preserve \nthe physical and mental health of surgeons by addressing a \nvariety of factors including tool usability. This review inves-\ntigates how the design of laparoscopic equipment impacts the \ncomfort and performance of surgeons based on biological sex \nor anthropometry. The review collates results regarding task \nexecution, surgeons’ pain, as well as tool design and usability \nstratified by biological sex, height, or glove size.\nMethods\nThis study does not require ethics approval from an Insti-\ntutional Review Board (IRB) because it is a review based \npurely on the results of existing publications.\nSearch strategy\nA search of the PubMed, Embase, and Cochrane databases \noccurred in May 2023 using the following search strategy: \n(ergonomic OR ergonomics) AND (laparoscopic OR lapa-\nroscopy or minimally invasive) AND (anthropometric OR \nanthropometry OR gender OR women OR female OR glove \nsize OR height) AND (surgeon OR physician OR surgeons \nOR trainees OR residents OR students). This review fol-\nlowed PRISMA guidelines [13]. Authors JH and DO inde-\npendently screened the title and abstracts of articles for \ninclusion.\nInclusion criteria\nStudies were suitable for inclusion if they met the following \ncriteria:\n1. The full-text article was available in English;\n2. The study contained original data;\n3. Results regarding performance, discomfort, or tool usa-\nbility during TLS were stratified based on biological sex, \nheight, or glove size (although this was not required to \nbe the primary outcome or purpose of the study).\nThe following exclusion criteria were used to screen \nstudies:\n1. Meta-analyses or review articles that only considered \nresults of previous studies;\n2. Studies that did not focus on TLS;\n3. Studies that were only published as a supplemental \nabstract or summary;\n4. Studies without a specific, numerical result regarding \nbiological sex or anthropometry. Studies where simi-\nlarity and differences were only included as a discus-\nsion, or a p-value was provided without accompanying \nnumerical results were excluded (i.e., a statement such \nas “Women had significantly more symptoms than men \n(p < 0.01)” in isolation would not contain sufficient \ndetail for inclusion).\nIf the assessments of the two authors were conflicting, the \nscreening authors discussed their decisions until a consensus \nwas reached.\n6642 Surgical Endoscopy (2023) 37:6640–6659\n1 3\nReporting and methodological quality \nacross studies\nThe Mixed Methods Appraisal Tool (MMAT) [14] was used \nby JH to consider study quality. The MMAT is not designed \nto provide a score for individual studies or be used to exclude \nstudies that may be deemed to be of ‘low quality’. Rather, it \nis intended to identify potential points of concern regarding \nquality for multiple study designs. These designs include \nqualitative studies, quantitative studies that are randomized, \nnon-randomized, or descriptive, and mixed methods studies.\nData extraction and analysis\nStudy results were tabulated in Microsoft Excel by JH to \nidentify trends in the outcome data across studies. Data only \npresented in a graphical form was approximated using Web-\nPlotDigitizer [15]. Meta-analysis was performed for three \nmain parts of the review. Firstly, several studies provided \nthe completion times of standardized laparoscopic tasks \nstratified by biological sex. Forest plots of this information \nproduced the mean difference in execution time across stud-\nies. Secondly, multiple studies reported the proportion of \nrespondents experiencing discomfort while operating strat-\nified by biological sex or height. The prevalence or odds \nratios were collated into forest plots to determine existing \ntrends in the risk of pain across studies. Thirdly, two studies \nreported on the grip styles used for the Harmonic Scalpel \nand LigaSure tools. Trends of one-handed, modified one-\nhanded, and two-handed grips between male and female \nsurgeons were assessed. For all three outcome types, meta-\nanalysis was completed in OpenMeta[Analyst] using random \neffects models [16].\nResults\nSearch results\nIn total, 1333 studies were identified from database searches. \nA further 21 studies were identified through reference \nscreening and other sources. Three hundred and fifty-nine \nduplicates were removed. The abstracts of 995 studies were \nscreened; 291 full-text articles were examined for inclusion. \nThe full version was sought out for a high number of studies \nbecause comments on biological sex or anthropometry were \noften a secondary part of the analysis and not mentioned in \nthe study abstract. A further 234 articles were excluded for \nnot providing sufficient detail regarding differences based \non biological sex or anthropometry (i.e. only a description \nor statistical significance without corresponding numeric \nresults). Three studies were excluded for having duplicate \nor overlapping datasets as already included studies, despite \nbeing unique publications. Ultimately, 54 articles were \nincluded in total [17–70]. This process is depicted in Fig. 1.\nFig. 1  PRISMA diagram\nScreeningIncluded\ndatabase searching (n = 1333)\nremoved (n = 359)\nRecords screened (n = 995)\neligibility (n = 291)\nStudies included (n = 54)\nother sources (n = 21)\nSurveillance searches (n = 6)\nRecords excluded (n = 704)\nReasons for exclusion:\nSurgical procedure focus (n = 324)\nequipment (n = 113)\nAbstract only (n = 64)\nNo original results (n = 61)\nForeign language (n = 13)\nRecords excluded (n = 237)\nReasons for exclusion:\nInsuﬃcient results regarding biological \nsex or anthropometry (n = 234)\nDuplicate/overlapping data (n = 3)\n6643Surgical Endoscopy (2023) 37:6640–6659 \n1 3\nStudy characteristics\nThe included articles contained a variety of data types, \nincluding surveys, task metrics, physical measurements \nand prototypes, and measures of muscle activity or strength. \nSample size varied between three and 765. Differences based \non biological sex or anthropometry was a primary focus in \n35 out of 51 studies. Table  1 contains a summary of the \nincluded studies, organized based on the three main themes \nof this review: task performance, physical discomfort, and \ntool usability and fit.\nStudy quality\nQuantitative descriptive studies\nThis review included 20 surveys, classified as quantitative \ndescriptive studies [35– 40, 42–49, 51, 53, 56, 58, 60, 69]. \nAreas of concern highlighted by the MMAT are sampling \nstrategy, representation, appropriateness of measurement \nand analysis methods, and non-response bias. No survey \nstudies reported performing a sample size calculation prior \nto commencement, challenging the statistical strength of \nthese studies. Sample frames for the survey studies included \nsurgical societies [35, 38, 42–45, 48, 49, 53, 56, 60], social \nmedia [36, 69], or local universities and hospitals [37, 39, \n40, 46, 47, 49, 51, 58]. Five studies considered representa-\ntion and compared the demographics of their respondents in \nrelation to the rest of the target population [38, 43, 46, 49, \n60]. Surveys, when provided, were considered relevant for \naddressing the research aims. Some surveys were adapted \nfrom the previously validated Nordic Musculoskeletal \nQuestionnaire (NMQ) [35– 37, 39, 40] or existing unvali-\ndated surveys [39, 45, 47, 69]. The remaining studies used \noriginal surveys [38, 42–44, 46, 48, 49, 51, 53, 56, 58, 60]. \nSurvey validation with a smaller cohort was only mentioned \nin three articles [35, 37, 43]. Results were generally given \nas a prevalence, mean and standard deviation, or median \nand interquartile range. These types of tabulated data were \neasily understood and appropriate. Most studies provided a \nfull [38–40, 45–47, 49, 51, 58] or partial [35, 42, 48, 53, 60, \n69] set of p-values to demonstrate significant differences \nbased on demographic factors or the presence of symp-\ntoms. Eight studies performed univariate and multivariate \nanalysis to consider how factors such as biological sex or \nglove size contributed to risk of injury [35, 37, 38, 43, 45, \n46, 48, 49]. Stated response rates varied between 0.62 [69] \nand 64.2% [40]. Two studies based this calculation on the \nnumber of opened emails rather than sent emails, increas-\ning their response rate [35, 44]. Six studies recognized the \npossibility of nonresponse bias [37, 38, 42–44, 53], although \nonly three provided a calculation for how this may impact \nresults [37, 38, 43].\nQuantitative randomized controlled trials\nFour of the included studies were randomized control tri-\nals [17, 18, 20, 31]; in these articles results relating to bio-\nlogical sex or anthropometry were secondary outcomes. The \nMMAT focuses on the randomization process, initial compa-\nrability, blinding, compliance, and completeness of results. \nRegarding randomization, one study reported using the per-\nmuted block technique [ 17]; other studies made more gen -\neral comments about using an independent researcher [ 18] \nor computer randomization [31]. Following randomization, \nresulting groups were balanced regarding biological sex in \nthree articles [17, 20, 31]. The remaining study was a crosso-\nver trial meaning all subjects participated in both experi-\nmental conditions. Two studies reported similar baseline \nperformance between groups [17, 20]. Only Strandbygaard \net al. [31] mentioned concealing the groupings between \nallocation and data collection, although others stated their \nmethods of blinding the investigators to the experimental \ncondition of the participants [17, 18]. Regarding compli-\nance, Busshoff et al. [18] excluded results from some tasks \nthat were “not done according to study protocol”. Donnon \net al. [20] required participants to document their adherence \nto the intervention of practising visualization exercises in the \nweek between data collection sessions; however, compliance \nwas not reported in the study results. Strandbygaard et al. \n[31] reported dropout before and during trials. Otherwise, it \nwas assumed authors were reporting complete outcome data.\nQuantitative non‑randomized studies\nTwenty-nine non-randomized studies were included in this \nreview [19, 21–30, 32–34, 50, 52, 54, 55, 57, 59, 61–68, 70]. \nFor this study design, the MMAT considers appropriateness \nof measurement and analysis methods, administration of or \nexposure to intervention, completeness of results, accounting \nfor confounders, and generalizability. Data collection meth-\nods included physical measurements [50, 55, 59, 61, 63–67], \nEMG [52, 55, 59, 68], dynamometry [59, 61, 63, 70], and \nperformance metrics [19, 21–30, 32–34, 55]. All these meas-\nurement methods appeared to be relevant and appropriately \ncontrolled. Seven studies utilized questionnaires to refine \ntool handle prototypes [54, 55, 57, 62, 65, 66, 68]; by nature \nthese studies contained more subjectivity. There was no con-\ncern about adherence to an experimental condition because \nin most studies participants were grouped based on inherent \nqualities, rather than an applied intervention. The factors \nof interest (including biological sex, physical proportions \nor strength, handedness, and surgical experience) did not \nchange during the cross-sectional study [19, 21–30, 32–34, \n50, 52, 54, 55, 57, 59, 61–68, 70]. Regarding complete-\nness, a few studies reported dropout [24, 33] or incomplete \ndatasets [19, 21]. Studies explicitly referred to minimizing \n6644 Surgical Endoscopy (2023) 37:6640–6659\n1 3\nTable 1  Characteristics of the included studies\nStudy Year n Data type Focus Was biological sex/anthropom-\netry a primary or secondary \nfocus?\nTask performance\n Bingener et al. [23] 2008 30 Task metrics Difference in task performance between students with \nand without instruction on identifying common \nmistakes in laparoscopy\nSecondary\n Busshoff et al. [24] 2021 128 Task metrics Difference in task metrics of male and female medical \nstudents and surgeons performing laparoscopic tasks \nwith 2D and 3D visualization\nPrimary\n Datta et al. [25] 2020 135 Task metrics Difference in task metrics of medical students with \nand without gaming experience\nSecondary\n Donnon et al. [26] 2005 42 Task metrics Difference in task metrics of medical students based \non biological sex or the use of visualization exer-\ncises while developing laparoscopic skills\nPrimary\n Elneel et al. [27] 2008 50 Task metrics Difference in dexterity and ambidexterity of male and \nfemale medical students performing laparoscopic tasks\nPrimary\n Flyckt et al. [28] 2017 51 Task metrics Difference between predicted and actual FLS task \nscores depending on biological sex\nPrimary\n Grantcharov et al. [29] 2003 25 Task metrics Difference in task metrics of inexperienced residents \nperforming laparoscopic tasks based on biological \nsex, gaming experience, and other factors\nPrimary\n Hoops et al. [30] 2019 210 Task metrics Difference in task metrics and autonomy of male and \nfemale residents and attendings\nPrimary\n Kolozsvari et al. [31] 2011 32 Task metrics Predictors of inherent laparoscopic skill Primary\n Madan et al. [32] 2008 51 Task metrics Predictors of inherent laparoscopic skill Primary\n Mitchell et al. [33] 2019 64 Task metrics Interest and aptitude for laparoscopy among medical \nstudents\nSecondary\n Nomura et al. [34] 2018 270 Task metrics Predictors of inherent laparoscopic skill Primary\n Oussi et al. [35] 2021 47 Task metrics Predictors of inherent laparoscopic skill Primary\n Shane et al. [36] 2008 26 Trials to proficiency Difference in performance and skill acquisition \nbetween gamers and non-gamers\nSecondary\n Strandbygaard et al. [37] 2013 99 Task metrics Difference in performance and skill acquisition \ndepending on whether participants received instruc-\ntor feedback\nSecondary\n Thorson et al. [38] 2011 32 Task metrics Difference in task metrics of male and female medical \nstudents\nPrimary\n Van Hove et al. [39] 2008 35 Task metrics Predictors of inherent laparoscopic skill Primary\n White and Welch [40] 2012 132 Task metrics Difference in performance and skill acquisition of \nmale and female medical students and residents \nperforming laparoscopic tasks\nPrimary\n6645Surgical Endoscopy (2023) 37:6640–6659 \n1 3Table 1  (continued)\nStudy Year n Data type Focus Was biological sex/anthropom-\netry a primary or secondary \nfocus?\nPhysical discomfort\n Adams et al. [41] 2013 495 Survey results Pain prevalence and impact Secondary\n AlSabah et al. [42] 2019 113 Survey results Pain prevalence and impact Secondary\n Dalager et al. [43] 2019 284 Survey results Pain prevalence and impact Secondary\n Franasiak et al. [44] 2012 260 Survey results Pain prevalence and impact Secondary\n Galindo et al. [45] 2021 140 Survey results Pain prevalence and impact Primary\n Gutierrez-Diez et al. [46] 2018 129 Grip strength and survey results Pain prevalence and impact Secondary\n Hignett et al. [47] 2017 Part 1: 67\nPart 2: 11\nPart 1: survey results\nPart 2: observation and interviews\nPain prevalence and postural assessment Primary\n Janki et al. [48] 2017 127 Survey results Pain prevalence and impact Secondary\n Kapoor et al. [49] 2021 765 Survey results Pain prevalence and impact Primary\n Lloyd et al. [50] 2019 701 Survey results Pain prevalence and impact Secondary\n McDonald et al. [51] 2014 350 Survey results Pain prevalence and impact Secondary\n Quinn and Moohan [52] 53 Survey results Pain prevalence and impact Secondary\n Shepherd et al. [53] 2016 50 Survey results Pain prevalence and impact Secondary\n Sutton et al. [54] 2014 314 Survey results Pain prevalence and impact Primary\n Wong et al. [55] 2022 190 Survey results Pain prevalence and perception of instrument fit based \non biological sex\nPrimary\n Zehetner et al. [56] 2006 8 Physical measurements and joint angles Angle of cervical spine while using monitor at stand-\nard and preferred height\nPrimary\nTool usability and fit\n Adams et al. [57] 2008 65 Survey results Laparoscopic instrument ease of use according to \nbiological sex and glove size\nPrimary\n Armijo et al. [58] 2022 18 Electromyography (EMG) Difference in muscle activity between experienced \nmale and female laparoscopic surgeons\nPrimary\n Berguer and Hreljac [59] 2004 726 Survey results Laparoscopic instrument ease of use according to \nglove size\nPrimary\n DiMartino et al. [60] 2004 22 Physical measurements Optimal handle diameter and configuration based on \nhand size\nPrimary\n Du et al. [61] 2023 Part 1: 21\nPart 2: 30\nHand measurements, prototype design, EMG, motion \ncapture, and subjective rating\nPrototype tool design and evaluation based on 3D \nscanned hand anthropometry\nPrimary\n Filisetti et al. [62] 2015 138 Survey results Laparoscopic instrument ease of use according to \nglove size\nPrimary\n Gonzalez et al. [63] 2015 135 Ranking following simulated task Difference in preferred handle size based on hand/\nglove size\nPrimary\n6646 Surgical Endoscopy (2023) 37:6640–6659\n1 3\nTable 1  (continued)\nStudy Year n Data type Focus Was biological sex/anthropom-\netry a primary or secondary \nfocus?\n Green et al. [64] 2022 58 Hand measurements and survey results Perception of instrument discomfort and difficulty \nbased on hand anthropometry\nPrimary\n Kasai et al. [65] 2013 11 Grip strength and EMG To assess and ultimately improve laparoscopic grasper \ndesign\nPrimary\n Kono et al. [66] 2012 241 Survey results Laparoscopic instrument ease of use according to \nbiological sex and glove size\nPrimary\n Kono et al. [67] 2014 113 Grip strength and stapler activation force Compare hand length and grip force with stapler \nactivation force\nPrimary\n Kono et al. [68] 2022 3 Prototype design Customization of handle design for female surgeons Primary\n Matern and Waller [69] 1999 10 Existing anthropometric data, force measurements, \ngrip characteristics, prototype design\nConsideration of design of commercially available \ntool handles and prototype based on anthropometric \ndata\nPrimary\n Ordóñez-Ríos et al. [70] 2019 7 Physical measurements Ergonomics of operating theater based on surgeon's \nanthropometry\nPrimary\n Sreekanth et al. [71] 2019 120 Physical measurements Prototype tool design based on hand anthropometry Primary\n Sreekanth et al. [72] 2020 282 Prototype design and subjective rating Prototype tool design and feedback for customized \nlaparoscopic handle\nPrimary\n Stellon et al. [73] 2017 58 Hand measurements Consideration of design of commercially available \ntool handles based on participants' anthropometric \ndata\nPrimary\n Sun et al. [74] 2014 14 Hand measurements, prototype design, EMG, motion \ncapture, and subjective rating\nComparison of prototype to existing tool handle using \nsubjective and objective measures\nPrimary\n Weinreiche et al. [75] 2022 488 Survey results Perception of instrument fit based on glove size Primary\n Wong et al. [76] 2022 38 Grip strength and survey results Changes in applied force, workload and discomfort \nwhile using bipolar surgical tools\nPrimary\n6647Surgical Endoscopy (2023) 37:6640–6659 \n1 3\nthe impact of confounding variables by standardizing the \nexperimental setup and protocol [21, 61], including results \nfrom larger anthropometric studies [63, 67], controlling for \ndemographic factors between participant groups [24, 52], \nor using statistical analysis to explore demographic factors \nthat potentially influenced results [19, 22, 23, 25, 27, 28, \n32, 33, 57]. Only five studies compared the demographics, \nproportions, or performance of their participants to other \ncohorts or the wider population to discuss generalizability \n[24, 27, 61, 64, 67].\nMixed methods studies\nThe study by Hignett et al. [41] was the only one that used a \nmixed methods approach, utilizing surveys, postural assess-\nment, and semi-structured interviews. The survey was based \non previous studies [38, 45]. A brief description of the \nresults was provided without statistical analysis. Generaliza-\nbility, sample size, and nonresponse bias were not discussed. \nA validated postural scoring tool was used to assess partici-\npants with a broad range of statures, and results were pre-\nsented in full. Confounding variables may have been created \nby the difficulty of simulating positioning while operating. \nDescriptive interviews exploring theater and patient factors \nwere conducted followed by NVivo thematic analysis [71], \nalthough insufficient detail regarding the interview structure \nand thematic analysis results were provided.\nMeta‑analysis findings\nTask performance\nEighteen studies considered the difference in completion \ntimes and other task metrics between male and female par -\nticipants. Experience levels included novices or medical stu-\ndents [17–21, 25–30, 32, 34], surgical residents [22–24, 33, \n34], and practicing surgeons [18]. Several studies presented \ncompletion times for standardized laparoscopic parkour [72] \nor Fundamentals of Laparoscopic Surgery (FLS) [73] tasks \nand were combined in a meta-analysis. The collated results \nfrom Busshoff et al. [18], Datta et al. [19], Hoops et al. [24], \nand White and Welch [34] are presented in Fig. 2. These for-\nest plots show that female surgeons took significantly longer \nto complete the pegboard, suturing, rope pass, and papercut \ntasks than their male colleagues. The mean difference in \ntask completion times in seconds ranged from 2.63 to 30.1 s.\nIn addition to the meta-analysis results, multiple other \nstudies reported increased completion times and path lengths \nfor female participants. Bingener et al. [ 17] had novices \ncomplete six repetitions of a suturing exercise, and the \nfemale subjects consistently took an average of 25 s longer \nthan the male subjects to complete the exercise across groups \nand repetitions. Donnon et al. [20] required individuals to \ncomplete dextrous suturing and bead maneuvring tasks \nunder different visualization conditions. In the first session, \nthe mean difference between sexes was 8–44 s; the female \ncohort was consistently slower than their male counterparts. \nAfter a 1 week break the disparity increased, ranging from \n50 to 133 s. The median results from Elneel et al. [21] and \nGrantcharov et al. [23] suggested that male participants were \n11–27% faster with fewer unnecessary movements during \ntasks. The number and severity of errors was comparable \nbetween sexes for both studies. Nomura et al. [28] had a \nsimilar finding, with female medical students taking 9.6 s \nlonger to complete the pick-and-place task (p = 0.0565) and \nmoving their instruments 257–367 mm further (p  < 0.02). \nMitchell et al. [27 ] found that females took 3.5 s longer to \ncomplete the peg transfer task, although this difference was \nnot significant. Shane et al. [30] investigated trials to pro-\nficiency in pick-and-place and object passing tasks on the \nMinimally Invasive Surgical Trainer (MIST) system. Across \ntasks, females took a median of 10 more trials than males to \ndemonstrate proficiency (p = 0.006). Thorson et al. [32] had \n32 participants (16 male and 16 female) perform six rep-\netitions of an object passing task at two different difficulty \nlevels. Median MIST scores differed by 11–40 points, with \nfemale participants performing significantly worse on all \nmetrics measured by the trainer. Madan et al. [26] compared \nthe box trainer and MIST-VR performance of participants \nbased on various hobbies potentially impacting dexterity, \nsuch as sewing or gaming, as well as biological sex. Results \nshowed that practicing dextrous activities improved MIST-\nVR scores, although not significantly. Male participants \nachieved significantly higher MIST-VR scores than females.\nIn contrast, neither Oussi et al. [29], Kolozsvari et al. \n[25], nor Flyckt et al. [22] found a significant difference in \ntask performance based on biological sex. Oussi et al. [29] \nreported that although females consistently received higher \nscores across three simulated diathermy tasks than males, \nthis disparity was not significant and decreased with each \nattempt. Kolozsvari et al. [25] examined the learning curve \nof medical students and found that biological sex had no \ndifference on the initial and final peg transfer task scores, \nor the rate of skill acquisition. Flyckt et al. [22] examined \nconfidence between male and female surgical residents by \nhaving them complete FLS tasks and comparing the differ -\nence between their predicted and actual scores. Actual tasks \nscores were statistically similar between sexes. Despite per-\nforming equally well, the initial predictions of female resi-\ndents had underestimated their performance by 11.1–22.5 \npoints, whereas males had overestimated their scores by 4.2 \npoints on average.\nLong-term or follow-up data was available for at least \nsome of the participants involved in the studies by Hoops \net al. [24], Strandbygaard et al. [31], and Van Hove et al. \n[33] over varying time periods. Hoops et al. [24] measured \n6648 Surgical Endoscopy (2023) 37:6640–6659\n1 3\nFig. 2  A meta-analysis depict-\ning the mean difference of task \ncompletion times, measured \nin seconds, between male and \nfemale participants [18, 19, 24, \n34]. Results from two studies \nare separated by Postgraduate \nYear (PGY), Medical Students \n(MS), Non-Board-Certified \n(NBCS), and Board-Certified \nSurgeons (BCS). A positive \nmean difference indicates \nfemale surgeons took longer to \nfinish simulated exercises\n6649Surgical Endoscopy (2023) 37:6640–6659 \n1 3\nFLS task performance annually between the first and fourth \npostgraduate years of their students. Dropout was observed \nover this time; there were only 23 participants at the final \ntimepoint from the original 107. The results by Hoops et al. \nsuggest that the gender disparity increased between the first \nand fourth postgraduate years, as shown in Fig.  2. Strand-\nbygaard et al. [31] considered task performance based on \nwhether students received feedback or not. Initial results \nshowed that a longer time was required for female train-\nees to reach proficiency; this was only significant between \nthe groups that did not receive feedback. The 6-month fol-\nlow-up data, published in another study that otherwise did \nnot meet the inclusion criteria for this review, showed no \nsignificant differences between biological sexes [ 74]. Van \nHove et al. [33] reported the McGill Inanimate System for \nTraining and Evaluation of Laparoscopic Skills (MISTELS) \nscore pre and post-training, as well as one year later. Similar \nperformance was observed between biological sexes during \nthe training period; however, the female surgeons performed \nsignificantly better at follow-up. More specifically, the aver-\nage MISTELS score increased by 31 points for the female \ncohort, whereas it decreased by 46 among the male cohort.\nPhysical discomfort\nThe percentage of female respondents within survey stud-\nies ranged from 5.3 [36] to 78.4% [49]. Across studies, the \nheight, glove size, and experience were all generally lower \nfor female surgeons compared to their male colleagues. The \nlikelihood of experiencing physical symptoms due to bio-\nlogical sex or anthropometry was presented within articles \nin the form of prevalence or odds ratios. The relative risk \nof discomfort between biological sexes varied significantly \nbetween studies. Sutton et al. [48] reported that males were \ntwice as likely to experience pain in the lower extremities, \nwhereas Wong et al. [49] found that females were five times \nmore likely to experience pain overall. After accounting for \nadditional factors including glove size, height, age, expe-\nrience, caseload, and case length, the relative risk of dis -\ncomfort between biological sexes ranged from statistically \ninsignificant [35, 48, 49] to a sevenfold increase in the risk \nof female surgeons experiencing physical symptoms [38] \nacross studies.\nPrevalence estimates for pain ranged from 39 [44] to \n92.5% [38] for female surgeons and 46% [44] to 89% \n[40] for male surgeons. In most instances the proportion \nof females reporting symptoms was larger than males. \nPrevalence and odds ratio data were combined in a meta-\nanalysis to examine trends across studies [35– 40, 42, \n44–46, 49]. Figure  3 depicts the risk of female and male \nsurgeons experiencing symptoms stratified by anatomic \nregion. Overall, the odds ratio of female laparoscopists \nto experience injury was 2.16(1.27, 3.67) across studies. \nMore specifically, female surgeons were twice as likely to \nreport neck and shoulder pain than their male colleagues, \na statistically significant difference. Male and female sur -\ngeons were equally likely to experience lower back pain. \nThe lower limbs were the only site where males were more \nlikely to experience discomfort; however, this difference \nwas not significant.\nShepherd et al. [47] found that female surgeons experi-\nenced significantly more discomfort while operating than \ntheir male colleagues. This trend existed regardless of case \nlength although the disparity increased during longer pro-\ncedures. Those with a smaller glove size also reported \nmore pain, but the difference was only significant during \nshorter operations.\nSeveral survey studies presented the mean height of \nthose experiencing physical discomfort compared to \nthose without pain. Sutton et al. [48] and Lloyd et al. [44] \nreported that surgeons with symptoms were taller on aver -\nage, whereas Kapoor et al. [43], Franasiak et al. [38], and \nDalager et al. [37] found the opposite result. There was \nno observable trend across studies. Figure  4 depicts this \ninformation. Hignett et al. [41 ] and Zehetner et al. [50] \nexamined the impact of height on surgeons’ posture using \nphysical measurements and observation. Hignett et al. \n[41] scored the posture of 11 surgeons between 158.8 \nand 189.4 cm tall using a Rapid Entire Body Assessment \n(REBA) with three different surgical port configurations \nand two different abdomen depths representing  50th and \n 99th percentile Body Mass Indexes (BMIs). REBA scores \nranged between one and four, which are acceptably low-\nrisk. By performing an additional Pearson correlation test \non the results provided by Hignett et al., shorter surgeons \nobtained significantly higher REBA scores for the  50th \npercentile BMI abdominal cavity with the midline and \nbilateral port placements, configurations that would pos -\nsibly require the surgeon to rotate their back or bend over \nthe patient. Zehetner et al. [50] used the measurements \nof eight participants’ eye level as well as preferred and \nmaximum monitor heights to extrapolate possible neck \nangles of operating surgeons. Raising the monitor by 1 cm \nwould increase the neck angle by 0.48° when positioned \n120 cm from the monitor. At the preferred monitor height, \ncalculated neck angles were 4.8°–8.5° below the horizon-\ntal plane. At the maximum monitor height, neck angles \nwere 2.9°–14° above the horizontal plane depending on \nthe surgeon’s stature.\nOverall the included survey studies demonstrate that \nfemale surgeons are at a higher risk of injury. No trend \nwas found regarding surgeon height and discomfort from \nquestionnaire data, although Hignett et al. [41] and Zehet-\nner et al. [50] demonstrated how shorter surgeons may be \nadversely impacted by trocar position and monitor height. \n6650 Surgical Endoscopy (2023) 37:6640–6659\n1 3\nContributing factors for injury may include poor tool fit \nand the need to apply excessive force to properly operate \ninstruments, which were investigated in the studies sum-\nmarized below.\nTool usability and fit\nAdams et al. [51], Berguer and Hreljac [53], Filisetti et al. \n[56], Green et al. [58], Weinreiche et al. [69], and Wong \net al. [49] examined self-reported tool usability and grip \nstyles. Figure 5 depicts a meta-analysis of grip style results \nfrom Adams et al. [51] and Wong et al. [49] for the Har -\nmonic scalpel and LigaSure tools. Female surgeons were \n2.8–7.5 times more likely to use a modified one-handed or \ntwo-handed grip than their colleagues. Similar trends were \nreported for other instruments [49, 51]. Additionally, female \nsurgeons reported that laparoscopic tools were too large and \nawkward to use more frequently than male surgeons [49, \n51]. Regarding glove size, which is correlated with gender, \nBerguer and Hreljac [ 53] and Kono et al. [ 60] reported a \n4.3–28.8% increase in the proportion of time that surgeons \nwho wore size 6.5 or smaller reported difficulty when using \ndifferent instruments compared to those with a larger glove \nsize. Filisetti et al. [56] found that surgeons with a glove size \nbetween 7 and 8 consistently provided lower difficulty scores \nthan those with smaller or larger glove sizes. The retrieval \nbag had the highest difficulty score for all glove sizes. Green \net al. [58] found that all female respondents reported diffi-\nculty using surgical tools, compared with only 56% of males \n(p < 0.001). Significant correlations were found between \nincreased difficulty, pressure, and fatigue and shorter fin-\nger measurements (not including the thumb). Weinreiche \net al. [69] showed that 53% of those with a glove size of \n6.5 or below reported difficulty with laparoscopic tools, \ncompared to 32% of those with larger hands. Multivariate \nanalysis showed that female surgeons or those with a glove \nsize less than 7.0 were 3 to 5.5 times more likely to report \ndifficulty with surgical tools. Being a female surgeon or hav-\ning a smaller glove size were consistently associated with \nincreased difficulty using laparoscopic tools across studies.\nArmijo et al. [52] and Kasai et al. [59] both utilized Elec-\ntromyography (EMG) in their studies. Commonly, EMG \ndata is used in ergonomic investigations to examine muscle \nactivity and force. It is normalized and presented as a per -\ncentage of the Maximum Voluntary Contraction (%MVC) \nobtained during a controlled exercise. Additionally, EMG \ndata may be analyzed in the frequency domain, with a reduc-\ntion in the median frequency over time indicating muscle \nFig. 3  A meta-analysis of pain prevalence by anatomic region and \nbiological sex [35–40, 42, 44–46, 49]. An estimated odds ratio \ngreater than one indicates a larger proportion of female surgeons \nreporting pain\n▸\n6651Surgical Endoscopy (2023) 37:6640–6659 \n1 3\nfatigue. Kasai et al. [59] showed that female surgeons use \n100–122%MVC in their forearm muscles when operating a \nlaparoscopic stapler. Armijo et al. [52] obtained %MVC data \nto examine muscle activity, median frequencies to exam -\nine muscle fatigue, and survey data. The muscle activity of \nfemale participants was significantly higher for the upper tra-\npezius, flexor carpi radialis, and extensor digitorum muscles, \nindicating increased strain. The median frequencies of the \nEMG signal were significantly higher for the upper trapezius \nfor the female cohort and the extensor digitorum for the male \ncohort. However, no significant change in median frequency \nwas observed over time, suggesting the participants did not \nexperience muscle fatigue. The perceived fatigue of female \nsurgeons was significantly higher on several facets of the \nquestionnaire.\nMatern and Waller [63], Gutierrez-Diez et al. [40], Kasai \net al. [59], Kono et al. [61], DiMartino et al. [54], Gonzalez \net al. [57, 75], and Wong et al. [70] examined grip strength \nand diameter. Matern and Waller [63] investigated pinch \ngrip between the thumb and each other finger on both hands \nof participants. The strongest grip was achieved between \nthe thumb and middle fingers bilaterally. Male participants \nhad a 3–73% stronger pinch grip than female participants. \nAcross studies, females could only apply 62–67% of the \nforce applied by their male counterparts on a dynamom-\neter when using a power grip [40, 61, 70]. The study by \nKasai et al. [59] only included female participants, who \nhad a maximum strength of 266 ± 67 N when gripping the \ndynamometer. However, when using a laparoscopic stapler, \nparticipants could only exert 148 ± 40 N because the handle \ndiameter before compression (11 cm) was twice the size of \nthe dynamometer (5.3 cm). Kono et al. [61] found that the \nideal grip diameter, based on the cylinder width at which the \ngreatest amount of force could be applied to a dynamometer, \nwas 6.25–6.35 cm for males and 5.41–5.55 cm for females. \nDiMartino et al. [54] and Gonzalez et al. [57] both had par-\nticipants elect their preferred handle diameter by having \nthem grip or use prototypes of varying widths. This sub-\njective assessment resulted in an ideal width between 2.9 \nand 5.7 cm. When comparing the optimum handle diameter \nwith the participants’ anthropometric data in an additional \npublication, Gonzalez et al. found a consistent ratio between \npalm length and grip width of 2.97:1 [75]. Wong et al. [70] \nreported that the grip strength of all participants decreased \nto approximately 80% over a two-minute period using vari-\nous bipolar surgical tools. Significantly greater decreases \nin strength as well as increases in workload and discomfort \nwere found consistently for participants with a glove size \nless than 7 compared to those with larger hands.\nFigure 6 shows the most extreme values for the 5th and \n95th percentiles of hand measurement based on data from \nDu et al. [55], Green et al. [58], Kasai et al. [59], Kono et al. \n[61], Matern and Waller [63], Ordóñez-Ríos et al. [64], Sree-\nkanth et al. [65], and Stellon et al. [67]. Some of these values \nwere taken from the surgeons participating in the included \nstudies, other measurements came from larger anthropomet-\nric investigations referenced within the articles. Hand width \nand length varied by 3 cm and 5 cm, respectively. Finger \nwidth and length varied by 1.1 and 3 cm, respectively. Stel-\nlon et al. [67] was the only study to provide results regarding \ngrip diameter, which ranged from 4 to 5.6 cm. These meas-\nurements would have a bearing on the comfort and usability \nof laparoscopic tools.\nDu et al. [55], Kono et al. [62], Matern and Waller [63], \nSreekanth et al. [65, 66], and Sun et al. [68] presented han-\ndle prototypes based on anthropometry and ergonomic con-\nsiderations. These authors had different design priorities, \nas summarized in Table  2. Some overarching themes that \nexisted across studies were to reduce the weight and size of \nthe tool, allow adjustments or customization to fit the user’s \nhand size, and restore a neutral wrist position. Only Du et al. \n[55], Sreekanth et al. [ 66], and Sun et al. [ 68] presented \nresults regarding the difference between their prototype and \nexisting tool handles. Du et al. [55] demonstrated that their \nrefined prototype performed equally well regarding task time \nand performance, while reducing the muscle load on the \ntrapezius and increasing satisfaction compared to a similar \ncommercial product. Sreekanth et al. [66] administered a \nFig. 4  A meta-analysis of the average height in centimeters of surgeons reporting pain [37, 38, 43, 44, 48]. A positive mean difference indicates \nthat surgeons experiencing symptoms were taller on average\n6652 Surgical Endoscopy (2023) 37:6640–6659\n1 3\nFig. 5  A meta-analysis of grip style for the Harmonic Scalpel and LigaSure instruments [49, 51]. An odds ratio above one indicates females \nwere more likely than males to use the indicated grip style\n6653Surgical Endoscopy (2023) 37:6640–6659 \n1 3\nfive-point Likert scale survey to 80 participants and found \nan average increase in perceived grip, functionality, comfort \nand wrist posture of 1.5–2.3 points. It should be noted that \nonly male surgeons participated in this study. Sun et al. [68] \nevaluated EMG, motion capture and survey data from eight \nparticipants. Minor, inconclusive changes in muscle activity, \nwrist angle, and subjective ratings were found.\nDiscussion\nThis review examined the design of laparoscopic tools in \nterms of performance, comfort, and usability. The first meta-\nanalysis results showed that females completed all simulated \ntasks significantly slower than their male counterparts except \nfor circle cutting. Possible reasons for longer completion \ntimes could be the need for female participants to adjust their \ngrip while operating, the increased time or exertion required \nfor them to successfully activate laparoscopic tools, or the \nlearning curve when considering novices. It should be noted \nthat most of the included studies only recruited medical stu-\ndents and surgical residents, so the impact on experienced \nsurgeons during surgical procedures is unclear. While a dif-\nference of 30 s may not be noteworthy, in the context of a \n5 min task this represents a 10% increase in the completion \ntimes of female participants. It could be speculated that there \nmay be a cumulative effect during procedures leading to \nlonger operative times [76]. Female surgeons are unques-\ntionably skilled; their surgical outcomes and complication \nrates are the same as their counterparts [77, 78]. However, \nit is still vital to consider how they are impacted by the tools \nthey use to operate.\nThe effect of using 3D visualization and robotics on sur-\ngical skill acquisition has been explored in the literature. \nBusshoff et al. [ 18] examined the impact of 3D visualiza -\ntion on the task completion times of medical students and \nsurgeons and found that females’ times improved by 27.8% \ncompared to 25.3% for males ( p = 0.005), although males \nwere still faster overall. Chiu et al. [79] showed that female \nmedical students achieved significantly better results on a da \nVinci simulator during a suture sponge exercise on all met-\nrics except needle drops, achieving scores 50 points lower \nthan their colleagues. These studies provide limited support \nfor the use of surgical robotics to improve design equity in \nthe operating theater.\nFemale surgeons experienced neck and shoulder pain sig-\nnificantly more frequently than their male colleagues. This \nmay be related to increased neck flexion for shorter surgeons \n[50] and shoulder abduction for those with a smaller arm \nspan [7 ] or physically supporting and operating the lapa-\nroscopic tools. The peak operating force of laparoscopic \nstaplers, reported as requiring 250 N [59] or 21.8–42.3 kg \n[61], may place increased strain on female and small-handed \nsurgeons. Even if female surgeons can surpass these thresh-\nolds in some circumstances, force is inextricably linked to \ngrip diameter [59]. If female surgeons are required to operate \nwith tools they find large and awkward to use [49, 51], this \nwill place an artificial limitation on their maximum produc-\nible force. It may be impossible to accommodate everyone \nwhen considering tool dimensions, given that hand length \nand width vary by several centimeters between the 5th and \n95th percentiles of measurements; however, efforts should \nbe increased to create adjustable, body-scalable instruments \nthat are suitable for 95% of the surgical population [80].\nThis review highlights the inadequacy of tool design and \nfit for many surgeons. Studies used survey data, physical \nmeasurements, EMG, and grip force to demonstrate the \nshortcomings of existing instrument handles for female and \nsmall-handed surgeons. Several studies sought to address \nthis by creating new prototypes based on physical measure-\nments. Multiple options for collecting anthropometric data \nwere used across studies, varying in complexity. Sreekanth \net al. [66] reported 95% accuracy by simply tracing the \nhands of participants with pen and paper. Such a fast method \nrequiring little skill and no specialist equipment opens up \npossibilities for increasing communication between sur -\ngeons and manufacturers to improve tool fit. A step beyond \nthis would be utilizing the scanning and scaling technol -\nogy available in smartphones which is already being used to \n15.6–20.6\n6.7–9.7\n5.0–8.0\nØ4.0–5.6\n6.2–8.7\n3.9–9.6\n5.7–7.2\n7.1–8.9\n1.6–2.7\n1.6–2.7\n1.6–2.7\n1.5–2.5\n1.5–2.7\nFig. 6  The 5th and 95th percentiles of hand anthropometry presented \nacross studies in centimeters [55, 58, 59, 63–65, 67]\n6654 Surgical Endoscopy (2023) 37:6640–6659\n1 3\nTable 2  Summary of tool prototypes\nPrototype Design goals/modifications\nDu et al. [61]\n Optimize application of force by utilizing pistol grip and considering thumb position\nReduce pressure areas\nConsider finger range of motion to reduce overlap and improve flexibility\nReflect natural hand grip and minimize stretching by considering distance between the \nindex finger and thumb\nKono et al. [68]\n Reduce the weight and dimensions of purse string suture instrument to accommodate \nfemale surgeons\nThe prototype had a 26.4% reduction in weight and 15 mm reduction in length com-\npared to the existing tool\nMatern and Waller [69]\n (1)\n \n \n \n \n \n \n \n \n \n \n(2)\nCreate an intuitive, multifunctional, and adjustable tool handle\nMinimize and optimize dimensions to facilitate one-handed operation\nPosition controls so they are accessible and operated by the most sensitive areas of the \nhand\nEnsure instrument shaft is in line with the forearm’s longitudinal axis\n6655Surgical Endoscopy (2023) 37:6640–6659 \n1 3\ncustomize clothing and other products [81] to measure the \ndimensions of surgeons’ hands remotely. Direct measure-\nment methods with tape measures, callipers, or scanning \ndevices are also possible, although they require additional \ntools, time, and the physical presence of the surgeon. Lam \nand Huang [82] presented the possibility of taking measure-\nments from plaster casts of the hand in certain grip posi-\ntions. This method would be difficult to implement on a \nlarge scale, although may provide more dynamic informa-\ntion about the hand. If rapid and customizable prototyping \ntechniques could be utilized in the strict regulatory environ-\nment of the operating theater, the comfort and efficiency of \nsurgeons performing TLS would significantly improve.\nThis study has several limitations. Firstly, most exist-\ning studies assessing differences in performance based \non sex or anthropometry required medical students and \nsurgical residents to perform simulated tasks. Therefore, \nit is difficult to make inferences about the performance \nof more experienced laparoscopic surgeons in an oper -\nating environment. Secondly, reporting bias within the \nincluded studies may mean that articles were more likely \nto only report significant results, especially for second-\nary outcomes. This may increase the disparity of results \nbetween biological sexes or those of different glove sizes. \nThe decision to exclude studies that only gave a level of \nstatistical significance without corresponding numerical \nresults would have also impacted the review. However, \nstudies excluded for this reason included those showing \nboth significant and non-significant differences based on \ndemographic factors. Thirdly, there is a possibility that \nsome imprecision was introduced during the literature syn-\nthesis. Some studies reported results graphically. In these \ninstances, WebPlotDigitizer was used to obtain a numeri-\ncal result from pixel locations on the graph. The accu-\nracy of this process is limited by graph quality. Addition-\nally, there were instances where there were unexplained \ninconsistencies in the presented data. Where possible, the \nauthors were contacted to provide clarification. Otherwise, \ninferences were made, or the results were omitted.\nTable 2  (continued)\nPrototype Design goals/modifications\nSreekanth et al. [71, 72]\n Add palm support to increase handle contact area and grip force\nReorient thumb loop to improve thumb and wrist position\nUse rubber inserts to accommodate different hand sizes\nReduce tool mass (not achieved)\nSun et al. [74]\n Reorient handle direction to straighten wrist position\nIncrease finger loop size to accommodate middle and ring fingers\nBevel edge of thumb loop to accommodate angled position of thumb\n6656 Surgical Endoscopy (2023) 37:6640–6659\n1 3\nAlmost half of the meta-analyses produced an  I2 value \ngreater than 50%, a possible indicator of moderate to high \nheterogeneity. However, this should be interpreted cautiously. \nEfforts were made to only combine data of the same type \n(completion times of standardized tasks, injury prevalence, \nheight of surgeons reporting pain, and grip styles). The  I2 \nvalue suggests high variability in the completion times of \nthe intracorporeal suturing, rope pass, and paper cut tasks; \nhowever, individual studies all consistently show that female \nsurgeons took longer to finish these exercises. Regarding \npain prevalence, the two anatomic regions associated with \na significantly higher number of complaints among female \nsurgeons, the neck and shoulders, showed  I2 values below \n25%. These levels of heterogeneity are acceptably low. The \nvariability observed in the other anatomic regions could be \nrelated to demographic factors, sampling, or a smaller pro -\nportion of surgeons experiencing discomfort in these regions \n(potentially creating larger relative differences between males \nand females). Five of the six meta-analyses for grip styles \nwere homogeneous, although increased bias can occur in \nmeta-analyses of such a small number of studies. Overall, \ngiven the considerations discussed above, it is considered \nreasonable to place confidence in the results where significant \ndifferences were found based on biological sex.\nIn conclusion, there is some suggestion in the collated data \nthat laparoscopic tools are not suitably designed for female \nand small-handed surgeons, which may contribute to longer \ncompletion times of standardized tasks, increased neck and \nshoulder pain, and self-reported difficulty with various instru-\nments. Poor tool design would contribute to lower intraopera-\ntive comfort and performance, as would demographic factors. \nThese findings regarding the importance of tool fit are also \napplicable to robotic console design. No consistent trend was \nfound regarding surgeon height and physical discomfort. \nAdditionally, no evidence was found regarding what bearing \nthese results have on operating room performance. Research \nexamining the impact of poor tool fit on the surgical perfor-\nmance of experienced surgeons based on biological sex and \nglove size would be beneficial for this area of investigation. \nPossibilities for creating highly customizable or adjustable \ntool handles also warrant further exploration.\nFunding Open Access funding enabled and organized by CAUL and \nits Member Institutions. This review was commissioned and funded \nby CMR Surgical Ltd.\nDeclarations \nDisclosures Jaime Hislop, Dominic Orth, Oren Tirosh, Mats Isaksson, \nChris Hensman, and John McCormick have no additional conflicts of \ninterest or financial ties to disclose.\nOpen Access  This article is licensed under a Creative Commons \nAttribution 4.0 International License, which permits use, sharing, \nadaptation, distribution and reproduction in any medium or format, \nas long as you give appropriate credit to the original author(s) and the \nsource, provide a link to the Creative Commons licence, and indicate \nif changes were made. The images or other third party material in this \narticle are included in the article's Creative Commons licence, unless \nindicated otherwise in a credit line to the material. If material is not \nincluded in the article's Creative Commons licence and your intended \nuse is not permitted by statutory regulation or exceeds the permitted \nuse, you will need to obtain permission directly from the copyright \nholder. To view a copy of this licence, visit http:// creat iveco mmons. \norg/ licen ses/ by/4. 0/.\nReferences\n 1. Mohamed MS (2011) The perception of usability, ergonomics \nand aesthetics for three different types of tin snips. Int J Appl \n1:102–106\n 2. Shackel B (2009) Usability—context, framework, definition, \ndesign and evaluation. Interact Comput 21:339–346. https:// doi.  \norg/ 10. 1016/j. intcom. 2009. 04. 007\n 3. Sackier JM, Berci G (1992) A laparoscopic hazard for the surgeon. \nBr J Surg 79:713. https:// doi. org/ 10. 1002/ bjs. 18007 90751\n 4. Majeed AW, Jacob G, Reed MW, Johnson AG (1993) Lapa-\nroscopist’s thumb: an occupational hazard. Arch Surg 128:357. \nhttps:// doi. org/ 10. 1001/ archs urg. 1993. 01420 15011 7022\n 5. Edgren CS, Radwin RG, Irwin CB (2004) Grip force vectors for \nvarying handle diameters and hand sizes. Hum Factors 46:244–\n251. https:// doi. org/ 10. 1518/ hfes. 46.2. 244. 37337\n 6. Seagull FJ (2012) Disparities between industrial and surgical ergo-\nnomics. Work 41(Suppl 1):4669–4672. https:// doi. org/ 10. 3233/ \nWOR- 2012- 0107- 4669\n 7. Aitchison LP, Cui CK, Arnold A, Nesbitt-Hawes E, Abbott J \n(2016) The ergonomics of laparoscopic surgery: a quantitative \nstudy of the time and motion of laparoscopic surgeons in live \nsurgical environments. Surg Endosc 30:5068–5076. https:// doi.  \norg/ 10. 1007/ s00464- 016- 4855-4\n 8. Morton J, Stewart GD (2022) The burden of performing mini-\nmal access surgery: ergonomics survey results from 462 surgeons \nacross Germany, the UK and the USA. J Robot Surg. https:// doi. \norg/ 10. 1007/ s11701- 021- 01358-6\n 9. Gifford E, Galante J, Kaji AH, Nguyen V, Nelson MT, Sidwell \nRA, Hartranft T, Jarman B, Melcher M, Reeves M, Reid C, Jacob-\nsen GR, Thompson J, Are C, Smith B, Arnell T, Hines OJ, de Vir-\ngilio C (2014) Factors associated with general surgery residents’ \ndesire to leave residency programs: a multi-institutional study. \nJAMA Surg 149:948–953. https:// doi. org/ 10. 1001/ jamas urg. 2014. \n935\n 10. Trinh LN, O’Rorke E, Mulcahey MK (2021) Factors influencing \nfemale medical students’ decision to pursue surgical specialties: \na systematic review. J Surg Educ 78:836–849. https:// doi. org/ 10. \n1016/j. jsurg. 2020. 08. 050\n 11. Ellison EC, Pawlik TM, Way DP, Satiani B, Williams TE (2018) \nTen-year reassessment of the shortage of general surgeons: \nincreases in graduation numbers of general surgery residents are \ninsufficient to meet the future demand for general surgeons. Sur -\ngery 164:726–732. https:// doi. org/ 10. 1016/j. surg. 2018. 04. 042\n 12. Epstein S, Sparer EH, Tran BN, Ruan QZ, Dennerlein JT, Singhal \nD, Lee BT (2018) Prevalence of work-related musculoskeletal dis-\norders among surgeons and interventionalists: a systematic review \nand meta-analysis. JAMA Surg 153:e174947. https:// doi. org/ 10. \n1001/ jamas urg. 2017. 4947\n 13. Moher D, Liberati A, Tetzlaff J, Altman DG, PRISMA Group \nT (2009) Preferred reporting items for systematic reviews and \n6657Surgical Endoscopy (2023) 37:6640–6659 \n1 3\nmeta-analyses: the PRISMA statement. PLoS Med 6:e1000097. \nhttps:// doi. org/ 10. 1371/ journ al. pmed. 10000 97\n 14. Hong QN, Pluye P, Fàbregues S, Bartlett G, Boardman F, Cargo \nM, Dagenais P, Gagnon M-P, Griffiths F, Nicolau B (2018) \nMixed methods appraisal tool (MMAT), version 2018. Educ Inf \n34(4):285–291\n 15. Rohatgi A (2018) WebPlotDigitizer. San Francisco\n 16. Wallace BC, Dahabreh IJ, Trikalinos TA, Lau J, Trow P, Schmid \nCH (2012) Closing the gap between methodologists and end-\nusers: ras a computational back-end. J Stat Softw 49:1–15. https:// \ndoi. org/ 10. 18637/ jss. v049. i05\n 17. Bingener J, Boyd T, Van Sickle K, Jung I, Saha A, Winston J, \nLopez P, Ojeda H, Schwesinger W, Anastakis D (2008) Rand-\nomized double-blinded trial investigating the impact of a cur -\nriculum focused on error recognition on laparoscopic suturing \ntraining. Am J Surg 195:179–182. https:// doi. org/ 10. 1016/j. amjsu \nrg. 2007. 11. 001\n 18. Busshoff J, Datta RR, Bruns T, Kleinert R, Morgenstern B, Pfister \nD, Chiapponi C, Fuchs HF, Thomas M, Gietzelt C, Hedergott A, \nMöller D, Hellmich M, Bruns CJ, Stippel DL, Wahba R (2022) \nGender benefit in laparoscopic surgical performance using a \n3D-display system: data from a randomized cross-over trial. Surg \nEndosc 36(6):4376–4385\n 19. Datta R, Chon SH, Dratsch T, Timmermann F, Müller L, Plum \nPS, Haneder S, Pinto Dos Santos D, Späth MR, Wahba R, Bruns \nCJ, Kleinert R (2020) Are gamers better laparoscopic surgeons? \nImpact of gaming skills on laparoscopic performance in “Genera-\ntion Y” students. PLoS ONE 15:e0232341\n 20. Donnon T, DesCoteaux J-G, Violato C (2005) Impact of cogni -\ntive imaging and sex differences on the development of laparo-\nscopic suturing skills. Can J Surg 48:387–393\n 21. Elneel FHF, Carter F, Tang B, Cuschieri A (2008) Extent of \ninnate dexterity and ambidexterity across handedness and \ngender: implications for training in laparoscopic surgery. Surg \nEndosc 22:31–37. https:// doi. org/ 10. 1007/ s00464- 007- 9533-0\n 22. Flyckt RL, White EE, Goodman LR, Mohr C, Dutta S, Zanotti \nKM (2017) The use of laparoscopy simulation to explore gender \ndifferences in resident surgical confidence. Obstet Gynecol Int \n2017:1945801. https:// doi. org/ 10. 1155/ 2017/ 19458 01\n 23. Grantcharov TP, Bardram L, Funch-Jensen P, Rosenberg J \n(2003) Impact of hand dominance, gender, and experience with \ncomputer games on performance in virtual reality laparoscopy. \nSurg Endosc Interv Techn 17:1082–1085\n 24. Hoops H, Heston A, Dewey E, Spight D, Brasel K, Kiraly L \n(2019) Resident autonomy in the operating room: does gender \nmatter? Am J Surg 217:301–305\n 25. Kolozsvari NO, Andalib A, Kaneva P, Cao J, Vassiliou MC, \nFried GM, Feldman LS (2011) Sex is not everything: the role \nof gender in early performance of a fundamental laparoscopic \nskill. Surg Endosc 25:1037–1042. https:// doi. org/ 10. 1007/  \ns00464- 010- 1311-8\n 26. Madan AK, Harper JL, Frantzides CT, Tichansky DS (2008) \nNonsurgical skills do not predict baseline scores in inanimate \nbox or virtual-reality trainers. Surg Endosc 22:1686–1689. \nhttps:// doi. org/ 10. 1007/ s00464- 007- 9691-0\n 27. Mitchell PB, Ostby S, Mara KC, Cohen SL, Chou B, Green IC \n(2019) Career interest and psychomotor aptitude among medical \nstudents. J Surg Educ 76:1526–1533. https:// doi. org/ 10. 1016/j. \njsurg. 2019. 04. 006\n 28. Nomura T, Matsutani T, Hagiwara N, Fujita I, Nakamura Y, \nKanazawa Y, Makino H, Mamada Y, Fujikura T, Miyashita M, \nUchida E (2018) Characteristics predicting laparoscopic skill in \nmedical students: nine years’ experience in a single center. Surg \nEndosc 32:96–104. https:// doi. org/ 10. 1007/ s00464- 017- 5643-5\n 29. Oussi N, Renman P, Georgiou K, Enochsson L (2021) Base -\nline characteristics in laparoscopic simulator performance: \nthe impact of personal computer (PC)–gaming experience and \nvisuospatial ability. Surg Open Sci 4:19–25. https:// doi. org/ 10.  \n1016/j. sopen. 2020. 06. 002\n 30. Shane MD, Pettitt BJ, Morgenthal CB, Smith CD (2008) Should \nsurgical novices trade their retractors for joysticks? Videogame \nexperience decreases the time needed to acquire surgical \nskills. Surg Endosc 22:1294–1297. https:// doi. org/ 10. 1007/ \ns00464- 007- 9614-0\n 31. Strandbygaard J, Bjerrum F, Maagaard M, Winkel P, Larsen \nCR, Ringsted C, Gluud C, Grantcharov T, Ottesen B, Sorensen \nJL (2013) Instructor feedback versus no instructor feedback on \nperformance in a laparoscopic virtual reality simulator: a rand-\nomized trial. Ann Surg 257:839–844\n 32. Thorson CM, Kelly JP, Forse RA, Turaga KK (2011) Can we \ncontinue to ignore gender differences in performance on simu-\nlation trainers? J Laparoendosc Adv Surg Tech 21:329–333. \nhttps:// doi. org/ 10. 1089/ lap. 2010. 0368\n 33. Van Hove C, Perry KA, Spight DH, Wheeler-Mcinvaille K, \nDiggs BS, Sheppard BC, Jobe BA, O’Rourke RW (2008) Pre-\ndictors of technical skill acquisition among resident trainees in \na laparoscopic skills education program. World J Surg 32:1917–\n1921. https:// doi. org/ 10. 1007/ s00268- 008- 9643-4\n 34. White MT, Welch K (2012) Does gender predict performance \nof novices undergoing Fundamentals of Laparoscopic Surgery \n(FLS) training? Am J Surg 203:397–400\n 35. Adams SR, Hacker MR, McKinney JL, Elkadry EA, Rosenb-\nlatt PL (2013) Musculoskeletal pain in gynecologic surgeons. J \nMinim Invasive Gynecol 20:656–660. https:// doi. org/ 10. 1016/j. \njmig. 2013. 04. 013\n 36. AlSabah S, Al Haddad E, Khwaja H (2019) The prevalence \nof musculoskeletal injuries in bariatric surgeons. Surg Endosc \n33:1818–1827. https:// doi. org/ 10. 1007/ s00464- 018- 6460-1\n 37. Dalager T, Sogaard K, Boyle E, Jensen PT, Mogensen O (2019) \nSurgery is physically demanding and associated with multi-\nsite musculoskeletal pain: a cross-sectional study. J Surg Res \n240:30–39. https:// doi. org/ 10. 1016/j. jss. 2019. 02. 048\n 38. Franasiak J, Ko EM, Kidd J, Secord AA, Bell M, Boggess JF, \nGehrig PA (2012) Physical strain and urgent need for ergonomic \ntraining among gynecologic oncologists who perform minimally \ninvasive surgery. Gynecol Oncol 126:437–442. https:// doi. org/  \n10. 1016/j. ygyno. 2012. 05. 016\n 39. Galindo CME, Lang A, Ryan B, Cobb S (2021) Work-related \nmusculoskeletal symptoms and associated factors in laparo-\nscopic surgeons of Peruvian hospitals. In: Black NL, Neumann \nWP, Noy I (eds) Proceedings of the 21st Congress of the Inter -\nnational Ergonomics Association (IEA 2021). Springer, Cham, \npp 728–737\n 40. Gutierrez-Diez MC, Benito-Gonzalez MA, Sancibrian R, Gan-\ndarillas-Gonzalez MA, Redondo-Figuero C, Manuel-Palazuelos \nJC (2018) A study of the prevalence of musculoskeletal dis-\norders in surgeons performing minimally invasive surgery. Int \nJ Occup Saf Ergon 24:111–117. https:// doi. org/ 10. 1080/ 10803 \n548. 2017. 13376 82\n 41. Hignett S, Gyi D, Calkins L, Jones L, Moss E (2017) Human fac-\ntors evaluation of surgeons’ working positions for gynecologic \nminimal access surgery. J Minim Invasive Gynecol 24:1177–1183. \nhttps:// doi. org/ 10. 1016/j. jmig. 2017. 07. 011\n 42. Janki S, Mulder EEAP, IJzermans JNM, Tran TCK (2017) Ergo-\nnomics in the operating room. Surg Endosc 31:2457–2466. https:// \ndoi. org/ 10. 1007/ s00464- 016- 5247-5\n 43. Kapoor S, Mahomed K, Kapoor V (2021) Work-related mus-\nculoskeletal injuries among obstetricians and gynaecologists: a \n6658 Surgical Endoscopy (2023) 37:6640–6659\n1 3\ncross-sectional survey of Fellows of Royal Australian and New \nZealand College of Obstetricians and Gynaecologists (RANZ-\nCOG). Aust N Z J Obstet Gynaecol 61:785–792. https:// doi. org/ \n10. 1111/ ajo. 13339\n 44. Lloyd GL, Chung ASJ, Steinberg S, Sawyer M, Williams DH, \nOverbey D (2019) Is your career hurting you? The ergonomic \nconsequences of surgery in 701 urologists worldwide. J Endourol \n33:1037–1042. https:// doi. org/ 10. 1089/ end. 2019. 0150\n 45. McDonald ME, Ramirez PT, Munsell MF, Greer M, Burke WM, \nNaumann WT, Frumovitz M (2014) Physician pain and dis-\ncomfort during minimally invasive gynecologic cancer surgery. \nGynecol Oncol 134:243–247. https:// doi. org/ 10. 1016/j. ygyno. \n2014. 05. 019\n 46. Quinn D, Moohan J (2015) The trainees’ pain with laparoscopic \nsurgery: what do trainees really know about theatre set-up and \nhow this impacts their health. Gynecol Surg 12:71–76\n 47. Shepherd JM, Harilingam MR, Hamade A (2016) Ergonomics in \nlaparoscopic surgery—a survey of symptoms and contributing \nfactors. Surg Laparosc Endosc Percutan Tech 26:72–77. https://  \ndoi. org/ 10. 1097/ SLE. 00000 00000 000231\n 48. Sutton E, Irvin M, Zeigler C, Lee G, Park A (2014) The ergo-\nnomics of women in surgery. Surg Endosc 28:1051–1055. \nhttps:// doi. org/ 10. 1007/ s00464- 013- 3281-0\n 49. Wong JMK, Moore KJ, Carey ET (2022) Investigation of the \nassociation between surgeon sex and laparoscopic device ergo-\nnomic strain in gynecologic surgery. J Minim Invasive Gynecol \n29:984–991. https:// doi. org/ 10. 1016/j. jmig. 2022. 04. 019\n 50. Zehetner J, Kaltenbacher A, Wayand W, Shamiyeh A (2006) \nScreen height as an ergonomic factor in laparoscopic sur -\ngery. Surg Endosc 20:139–141. https:// doi. org/ 10. 1007/  \ns00464- 005- 0251-1\n 51. Adams DM, Fenton SJ, Schirmer BD, Mahvi DM, Horvath K, \nNichol P (2008) One size does not fit all: current disposable \nlaparoscopic devices do not fit the needs of female laparoscopic \nsurgeons. Surg Endosc 22:2310–2313\n 52. Armijo PR, Flores L, Pokala B, Huang C-K, Siu K-C, Oley -\nnikov D (2022) Gender equity in ergonomics: does muscle effort \nin laparoscopic surgery differ between men and women? Surg \nEndosc 36:396–401\n 53. Berguer R, Hreljac A (2004) The relationship between hand \nsize and difficulty using surgical instruments: a survey of 726 \nlaparoscopic surgeons. Surg Endosc 18:508–512. https:// doi.  \norg/ 10. 1007/ s00464- 003- 8824-3\n 54. DiMartino A, Doné K, Judkins T, Morse J, Melander J, Oley -\nnikov D, Hallbeck MS (2004) Ergonomic laparoscopic tool \nhandle design. Proc Hum Factors Ergonomics Soc Annu Meet \n48:1354–1358. https:// doi. org/ 10. 1177/ 15419 31204 04801 218\n 55. Du Y, Jiang R, Wang H (2023) Ergonomic design and assess-\nment of an improved handle for a laparoscopic dissector based \non 3D anthropometry. Int J Environ Res Public Health 20:2361. \nhttps:// doi. org/ 10. 3390/ ijerp h2003 2361\n 56. Filisetti C, Cho A, Riccipetitoni G, Saxena AK (2015) Analysis \nof hand size and ergonomics of instruments in pediatric mini-\nmally invasive surgery. Surg Laparosc Endosc Percutaneous \nTech 25:e159–e162\n 57. Gonzalez AG, Salgado DR, Moruno LG (2015) Optimisation \nof a laparoscopic tool handle dimension based on ergonomic \nanalysis. Int J Ind Ergon 48:16–24\n 58. Green SV, Morris DE, Naumann DN, Rhodes HL, Burns JK, \nRoberts R, Lang AR, Morris L (2022) One size does not fit all: \nimpact of hand size on ease of use of instruments for minimally \ninvasive surgery. Surgeon. https:// doi. org/ 10. 1016/j. surge. 2022. \n11. 001\n 59. Kasai R, Mizushima I, Muto T, Matsuo T, Tomizawa Y, Takeda \nS (2013) Ergonomic assessment of a laparoscopic stapler. Adv \nBiomed Eng 2:11–16. https:// doi. org/ 10. 14326/ abe.2. 11\n 60. Kono E, Tomizawa Y, Matsuo T, Nomura S (2012) Rating and \nissues of mechanical anastomotic staplers in surgical practice: a \nsurvey of 241 Japanese gastroenterological surgeons. Surg Today \n42:962–972. https:// doi. org/ 10. 1007/ s00595- 012- 0303-9\n 61. Kono E, Tada M, Kouchi M, Endo Y, Tomizawa Y, Matsuo T, \nNomura S (2014) Ergonomic evaluation of a mechanical anasto-\nmotic stapler used by Japanese surgeons. Surg Today 44:1040–\n1047. https:// doi. org/ 10. 1007/ s00595- 013- 0666-6\n 62. Kono E, Taniguchi K, Lee S-W, Ohdaira T, Uchiyama K (2022) \nLaparoscopic instrument for female surgeons: an innovative model \nfor endoscopic purse-string suture. Minim Invasive Ther Allied \nTechnol 31:642–645. https://  doi. org/ 10. 1080/ 13645 706. 2020. \n18517 24\n 63. Matern U, Waller P (1999) Instruments for minimally invasive \nsurgery: principles of ergonomic handles. Surg Endosc 13:174–\n182. https:// doi. org/ 10. 1007/ s0046 49900 934\n 64. Ordóñez-Ríos M, Salamea JC, Robles-Bykbaev V (2019) \nAnthropometric evaluation and operation room design analysis \nfor laparoscopic surgeries in Cuenca, Ecuador. In: Rebelo F, \nSoares MM (eds) Advances in ergonomics in design. Springer, \nCham, pp 190–200\n 65. Sreekanth MP, Ranganathan R (2019) Design and development \nof a customized laparoscopic forceps handle using fused deposi-\ntion modeling. J Chin Soc Mech Eng Trans Chin Inst Eng Ser C \n40:83–90\n 66. Sreekanth MP, Ranganathan R, Pugalendhi A (2020) Individual \ncustomization strategy accomplished by developing prototype \nof a laparoscopic forceps handle using additive manufacturing. \nRapid Prototyping J 26(4):689–697\n 67. Stellon M, Seils D, Mauro C (2017) Assessing the importance of \nsurgeon hand anthropometry on the design of medical devices. \nJ Med Devices Trans ASME 11(4):041004\n 68. Sun CY, Wang SY, Wang BC (2014) Ergonomic design and \nevaluation of laparoscopic instrument handle based on anthro-\npometry. Adv Mater Res 950:109–113. https:// doi. org/ 10. 4028/ \nwww. scien tific. net/ AMR. 950. 109\n 69. Weinreich HM, Babu M, Kamil R, Williams Q, Buhimschi IA \n(2022) Gender-differences of proceduralists in perception of \nhand-held surgical instrument fit—a cross-sectional survey. Am \nJ Surg 224:1482–1487. https:// doi. org/ 10. 1016/j. amjsu rg. 2022. \n05. 011\n 70. Wong JMK, Moore KJ, Lewis P, Reid M, Saul K, Carey ET (2022) \nErgonomic assessment of surgeon characteristics and laparoscopic \ndevice strain in gynecologic surgery. J Minim Invasive Gynecol \n29:1357–1363. https:// doi. org/ 10. 1016/j. jmig. 2022. 09. 552\n 71. Nowell LS, Norris JM, White DE, Moules NJ (2017) Thematic \nanalysis: striving to meet the trustworthiness criteria. Int J Qual \nMethods 16:1609406917733847. https://  doi. org/ 10. 1177/ 16094 \n06917 733847\n 72. Wahba R, Datta R, Hedergott A, Bußhoff J, Bruns T, Kleinert \nR, Dieplinger G, Fuchs H, Giezelt C, Möller D, Hellmich M, \nBruns C, Stippel D (2019) 3D vs. 4K display system—influence \nof “State-of-the-art”-display technique on surgical performance \n(IDOSP-Study) in minimally invasive surgery: protocol for a ran-\ndomized cross-over trial. Trials 20:1–8. https:// doi. org/ 10. 1186/ \ns13063- 019- 3330-7\n 73. Derossis AM, Fried GM, Abrahamowicz M, Sigman HH, Barkun \nJS, Meakins JL (1998) Development of a model for training and \nevaluation of laparoscopic skills 11. This work was supported \nby an educational grant from United States Surgical Corporation \n(Auto Suture Canada). Am J Surg 175:482–487. https:// doi. org/ \n10. 1016/ S0002- 9610(98) 00080-4\n6659Surgical Endoscopy (2023) 37:6640–6659 \n1 3\n 74. Bjerrum F, Maagaard M, Led Sorensen J, Rifbjerg Larsen C, \nRingsted C, Winkel P, Ottesen B, Strandbygaard J (2015) Effect of \ninstructor feedback on skills retention after laparoscopic simulator \ntraining: follow-up of a randomized trial. J Surg Educ 72:53–60. \nhttps:// doi. org/ 10. 1016/j. jsurg. 2014. 06. 013\n 75. Gonzalez Gonzalez A, Rodriguez Salgado D, Garcia Moruno L, \nSanchez Rios A (2018) An ergonomic customized-tool handle \ndesign for precision tools using additive manufacturing: a case \nstudy. Appl Sci 8(7):1200\n 76. Jackson TD, Wannares JJ, Lancaster RT, Rattner DW, Hutter MM \n(2011) Does speed matter? The impact of operative time on out-\ncome in laparoscopic surgery. Surg Endosc 25:2288–2295. https:// \ndoi. org/ 10. 1007/ s00464- 010- 1550-8\n 77. Wallis CJ, Ravi B, Coburn N, Nam RK, Detsky AS, Satkunasivam \nR (2017) Comparison of postoperative outcomes among patients \ntreated by male and female surgeons: a population based matched \ncohort study. BMJ 359:j4366. https:// doi. org/ 10. 1136/ bmj. j4366\n 78. Guiab K, Evans T, Brigode W, Stamelos G, Sebekos K, Siddiqi \nM, Capron G, Kaminsky M, Bokhari F (2022) Complications after \ninpatient laparoscopic cholecystectomy: effect of surgeon experi-\nence, procedure volume, and other surgeon-based characteristics. \nAm Surg. https:// doi. org/ 10. 1177/ 00031 34822 10840 83\n 79. Chiu H-Y, Kang Y-N, Wang W-L, Tong Y-S, Chang S-W, Fong \nT-H, Wei P-L (2020) Gender differences in the acquisition of \nsuturing skills with the da Vinci surgical system. J Formos Med \nAssoc 119:462–470. https:// doi. org/ 10. 1016/j. jfma. 2019. 06. 013\n 80. Van Veelen MA, Meijer DW, Goossens RHM, Snijders CJ (2001) \nNew ergonomic design criteria for handles of laparoscopic dissec-\ntion forceps. J Laparoendosc Adv Surg Tech A 11:17–26\n 81. Pei J (2022) 10—The effective communication system using 3D \nscanning for mass customized design. In: Zakaria N (ed) Digital \nmanufacturing technology for sustainable anthropometric apparel. \nWoodhead Publishing, Sawston, pp 211–229\n 82. Lam DKH, Huang W (2010) Development of an ergonomic han-\ndle for laparoscopic surgery. Springer, Berlin, pp 99–102\nPublisher's Note Springer Nature remains neutral with regard to \njurisdictional claims in published maps and institutional affiliations.",
  "topic": "Medicine",
  "concepts": [
    {
      "name": "Medicine",
      "score": 0.7799237966537476
    },
    {
      "name": "Usability",
      "score": 0.744861364364624
    },
    {
      "name": "Grip strength",
      "score": 0.5459919571876526
    },
    {
      "name": "Anthropometry",
      "score": 0.5113949179649353
    },
    {
      "name": "Meta-analysis",
      "score": 0.5072376728057861
    },
    {
      "name": "MEDLINE",
      "score": 0.49680426716804504
    },
    {
      "name": "Laparoscopic surgery",
      "score": 0.4507276713848114
    },
    {
      "name": "Task (project management)",
      "score": 0.4500565230846405
    },
    {
      "name": "Systematic review",
      "score": 0.4337605834007263
    },
    {
      "name": "Laparoscopy",
      "score": 0.4327358603477478
    },
    {
      "name": "Physical therapy",
      "score": 0.43091192841529846
    },
    {
      "name": "Medical physics",
      "score": 0.38950955867767334
    },
    {
      "name": "Surgery",
      "score": 0.26586782932281494
    },
    {
      "name": "Internal medicine",
      "score": 0.10322350263595581
    },
    {
      "name": "Computer science",
      "score": 0.08699700236320496
    },
    {
      "name": "Law",
      "score": 0.0
    },
    {
      "name": "Management",
      "score": 0.0
    },
    {
      "name": "Human–computer interaction",
      "score": 0.0
    },
    {
      "name": "Economics",
      "score": 0.0
    },
    {
      "name": "Political science",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I57093077",
      "name": "Swinburne University of Technology",
      "country": "AU"
    },
    {
      "id": "https://openalex.org/I56590836",
      "name": "Monash University",
      "country": "AU"
    }
  ]
}