{
  "title": "Artificial intelligence-based large language models and integrity of exams and assignments in higher education: the case of tourism courses",
  "url": "https://openalex.org/W4389275405",
  "year": 2023,
  "authors": [
    {
      "id": null,
      "name": "School of Tourism and Hotel Management, Harran University, Department of Tourism Guidance, Türkiye",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A1951923240",
      "name": "Abdullah Ulku",
      "affiliations": [
        "Harran University"
      ]
    },
    {
      "id": "https://openalex.org/A1951923240",
      "name": "Abdullah Ulku",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W4298130638",
    "https://openalex.org/W3119619682",
    "https://openalex.org/W3111996896",
    "https://openalex.org/W4323313947",
    "https://openalex.org/W4322621196",
    "https://openalex.org/W7017905194",
    "https://openalex.org/W3214942437",
    "https://openalex.org/W4378193514",
    "https://openalex.org/W4385562476",
    "https://openalex.org/W4387491382",
    "https://openalex.org/W4211262078",
    "https://openalex.org/W4256233687",
    "https://openalex.org/W4320009668",
    "https://openalex.org/W3211254352",
    "https://openalex.org/W4324046518",
    "https://openalex.org/W4323536358",
    "https://openalex.org/W4377234252",
    "https://openalex.org/W4312263439",
    "https://openalex.org/W3096674504",
    "https://openalex.org/W4206996334",
    "https://openalex.org/W4321368061",
    "https://openalex.org/W4308947461",
    "https://openalex.org/W4361204578",
    "https://openalex.org/W4320489204",
    "https://openalex.org/W3198430666",
    "https://openalex.org/W4313232683",
    "https://openalex.org/W4383552270",
    "https://openalex.org/W2886086267",
    "https://openalex.org/W4379034390",
    "https://openalex.org/W3177938779",
    "https://openalex.org/W2803643537",
    "https://openalex.org/W3153330729",
    "https://openalex.org/W4360939370",
    "https://openalex.org/W3189143628",
    "https://openalex.org/W3099407680",
    "https://openalex.org/W4319662928",
    "https://openalex.org/W2024436279",
    "https://openalex.org/W4285120456",
    "https://openalex.org/W4375850424",
    "https://openalex.org/W3179537005",
    "https://openalex.org/W3108656638",
    "https://openalex.org/W4380291613",
    "https://openalex.org/W3202282918",
    "https://openalex.org/W4377094181",
    "https://openalex.org/W4321499403",
    "https://openalex.org/W4294941545",
    "https://openalex.org/W3003733110",
    "https://openalex.org/W4220695000",
    "https://openalex.org/W1968233994",
    "https://openalex.org/W1222811865",
    "https://openalex.org/W4382518736",
    "https://openalex.org/W3083762786",
    "https://openalex.org/W4362723856",
    "https://openalex.org/W4384493378",
    "https://openalex.org/W3198890387",
    "https://openalex.org/W4361270914",
    "https://openalex.org/W3009335665",
    "https://openalex.org/W4229376924",
    "https://openalex.org/W4375858605",
    "https://openalex.org/W4321613736",
    "https://openalex.org/W2803256609",
    "https://openalex.org/W3207456925",
    "https://openalex.org/W3102947614",
    "https://openalex.org/W4300773878",
    "https://openalex.org/W4312051216",
    "https://openalex.org/W4381277798",
    "https://openalex.org/W2626481528",
    "https://openalex.org/W4385694164",
    "https://openalex.org/W4287598043"
  ],
  "abstract": "There is an increasing concern regarding the potential misuse of ChatGPT-4 in compromising the integrity of examinations and assignments. This study aims to examine the capabilities of ChatGPT-4 in critical thinking abilities, whether it poses a threat to examinations and assignments in higher education, and create a discussion agenda on this issue. ChatGPT-4 was asked to generate, answer, and criticize questions in tourism marketing, tourism management, tourism economics, tourist guidance, and gastronomy. The answers were evaluated according to universal critical thinking standards. The findings obtained from this study showed that ChatGPT-4 had commendable competence in several critical thinking standards and could produce human-like texts. However, there are certain domains that might be improved to comply more effectively with the expectations and norms of academia. Educators were recommended to use comprehensive approaches that combine technological and educational techniques to address the issue of cheating enabled by tools, such as ChatGPT-4, during assessment and exam processes.",
  "full_text": "Tourism & Management Studies, 19(4), 2023, 21-34  https://doi.org/10.18089/tms.2023.190402     \n21 \n \nArtificial intelligence-based large language models and integrity of exams and assignments in \nhigher education: the case of tourism courses \n \nInteligência artificial baseada em modelos de linguagem de grande escala e integridade de provas e trabalhos no \nensino superior: o caso dos cursos de turismo \nAbdullah Ülkü \nSchool of Tourism and Hotel Management, Harran University, Department of Tourism Guidance, Türkiye, \nabdullahulku@harran.edu.tr \n \n \nReceived: 14.08.2023; Revisions required: 14.09.2023; Accepted: 28.10.2023 \nAbstract \nThere is an increasing concern regarding the potential misuse of \nChatGPT-4 in compromising the integrity of examinations and \nassignments. This study aims to examine the capabilities of ChatGPT -4 \nin critical thinking abilities, whether it poses a threat to examinations  \nand assignments in higher education, and create a discussion agenda \non this issue. ChatGPT -4 was asked to generate, answer, and criticize \nquestions in tourism marketing, tourism management, tourism \neconomics, tourist guidance, and gastronomy. The answers were \nevaluated according to universal critical thinking standards. The \nfindings obtained from this study showed that ChatGPT -4 had \ncommendable competence in several critical thinking standards and \ncould produce human -like texts.  However, there are certain  domains \nthat might be improved to comply more effectively with the \nexpectations and norms of academia. Educators were recommended to \nuse comprehensive approaches that combine technological and \neducational techniques to address the issue of cheating enable d by \ntools, such as ChatGPT-4, during assessment and exam processes. \nKeywords: Large Language Models (LLM), Artificial Intelligence, \nChatGPT, Tourism Education, Exams, Integrity.\nResumo \nHá uma crescente preocupação em relação ao possível uso indevido do \nChatGPT-4 comprometendo a integridade de exames e trabalhos \nacadémicos. Este estudo visa examinar as capacidades do ChatGPT-4 nas \ncapacidades de pensamento crítico, avaliar se ele representa uma ameaça \npara exames e trabalhos no ensino superior e criar uma agenda de \ndiscussão sobre esse problema. Solicitou-se ao ChatGPT-4 que gerasse, \nrespondesse e criticasse perguntas nas áreas de marketing turístico, \ngestão do turismo, economia do turismo, informação turística e \ngastronomia. As respostas foram avaliadas de  acordo com padrões \nuniversais de pensamento crítico. Os resultados deste estudo mostraram \nque o ChatGPT-4 apresentou competência admirável em vários padrões \nde pensamento crítico e conseguiu produzir textos semelhantes aos \nhumanos. No entanto, há certos domínios que podem ser aperfeiçoados \npara atender mais efetivamente às expetativas e normas académicas. \nRecomenda-se que os educadores adotem abordagens abrangentes que \ncombinem técnicas tecnológicas e educacionais para lidar com o \nproblema da fraude, facil itada por ferramentas como o ChatGPT -4, \ndurante processos de avaliação e exames. \nPalavras-chave: Modelos de Linguagem de Grande Escala (LLM), \nInteligência Artificial, ChatGPT, Educação em Turismo, Exames, \nIntegridade.\n \n1. Introduction \nThe advent of digital transformation in education resulted in a \nnew era characterized by enhance d accessibility and new \nautonomy (Latifah, Budiyanto & Saputro,  2022; Nieuwoudt, \n2020). Students from different backgrounds now have the \nopportunity to attain their educational objectives without being \nrestricted by geographical or time restrictions (Gerashchenko & \nKovalev, 2021). However, the change is not without its challenges \n(Adzima, 2021; Montenegro-Rueda, Luque-de La Rosa, Sánchez-\nSerrano & Fernández-Cerero, 2021). The issue of integrity has \nbecome increasingly prominent with the widespread adoption of \nresources for educational instruction and assessment in \nuniversities (Comas-Forgas,  Lancaster, Calvo -Sastre & Sureda -\nNegreet, 2021; Klijn, Mdaghri Alaoui & Vorsatz, 2022). \nThe intersection of technology and education has long been a \nsubject of significant scholarly inquiry (Hashim, 2018; Rahm, \n2023). Learning Management Systems (LMS), such as Moodle, \nhave significantly transformed the learning process by \nproviding individuals with a collaborative platform that \nfacilitates new approaches to learning (David et al., 2022; \nMaslov, Nikou & Hansen, 2021) . However, with the increasing \nuse of assessments, there has been a growing concern over the \nreliability of these platforms (Ababneh, Ahmed & Dedousis, \n2022; Coghlan, Miller & Paterson, 2020; Duhaim, Al-mamory & \nMahdi, 2022; Nguyen et al., 2022). \nThe integration of sophisticated technology, especially artificial \nintelligence (AI), into educational settings has further \ncomplicated this discourse (Barrientos, Cuadros, Alba & Cruz, \n2021; Benvenuti et al., 2023) . In the field of examinations and \nassignments, the ChatGPT -4, a sophisticated language model \ndeveloped by OpenAI, distinguishes itself using its capacity to \ngenerate a narrative that exhibits human-like composition. This \nphenomenon presents both potential opportunities and ethical \ndilemmas (Susnjak, 2022). \nLarge Language Models (LLMs) have the potential to serve as a \nsupplemental resource for a variety of assessments and \nacademic tasks (Bernabei, Colabianchi, Falegnami & Costantino, \n2023). Additionally, they can offer deeper perspectives on the \nlearning process and customise evaluations according to \nstudents' particular knowledge, abilities, and experiences (Tsai,  \nOng & Chenet, 2023) .  In gene ral, LLMs have the capacity to \noffer efficient ways of evaluating learning, creating \nexaminations, replying to questions, and assessing \nperformance (Swiecki et al., 2022). \n\nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34 \n22 \n \nThe increased capabilities of ChatGPT may introduce new \ncomponents to this discourse. The recognized impact of LLMs \non enhancing education is well known (Essel et al., 2022; Naidu \n& Sevnarayan, 2023; Pérez, Daradoumis & Puig, 2020) . \nHowever, concerns are emerging regarding its potential for \nmisuse, especially in the context of assessments (AlAfnan, \nDishari, Jovic & Lomidze, 2023; C rawford, Cowling & Allen, \n2023; Oravec, 2023; Yau & Chan, 2023) . The development of \nadvanced models like ChatGPT raises significant concerns \nregarding the preservation of academic and exam integrity \n(Cotton, Cotton & Shipwayet, 2023; Currie, 2023; Eke, 2023; \nElbanna & Armstrong, 2023)  due to their ability to produce \ncontent that bypasses conventional plagiarism detection \nmethods (Misra & Chandwar, 2023).  \nStudies about cheating on exams and assignments \n(Chirumamilla & Sindre, 2019; Holden, Norris & Kuhlmeier, \n2021; Noorbehbahani, Mohammadi & Aminazadeh, 2022; Von \nGrunigen et al., 2018)  show that there are several ways to \ncheat, such as searching the Internet, joining social networks, \npretending to be another student, and wireless devices like \nearphones and microphones. The possib ility that ChatGPT -4 \nmay produce human -like messages and exhibit critical and \nintellectual thinking skills raises the concern that this chatbot \ncould be a new cheating method for exams and assignments \n(Susnjak, 2022) . In this direction, the research question was \nformed as  follows: “Do Large Language Models based on \nArtificial Intelligence represent a threat to the integrity of \nexams and assignments in Higher Education?” \nThe development of LLMs, such as ChatGPT -4, gives rise to \nnotable concerns due to their remarkable ability to produce \nnarratives that closely mimic human writing ability. The current \nliterature has examined the potential misuse of AI in the \ncontext of eval uations. Nevertheless, a noticeable lack of \nunderstanding exists regarding the particular results of \nexpanded LLMs in this specific domain, their capacities, and \ntheir potential to establish critical thinking standards.  \nThis study aims to investigate the impact of ChatGPT -4 on \nexams in the field of tourism and the possibility of using it as a \ncheating tool in these exams.  Also, this study aims to provide \nuseful information for educators. Specifically, it tries to shed \nlight on the many capabilities and po ssible disadvantages of \nChatGPT-4 when used in exams. By making a contribution to the \nscope of the ongoing discourse, this study enhances the existing \nbody of literature on this topic. This study  examines the \ncapabilities and potential challenges associate d with Language \nModel Models (LLMs), with an emphasis on ChatGPT -4, within \nthe academic domain. By engaging in this process, this study \naddresses the current knowledge gap and provides insights into \nthese models' use and potential misapplication in the con text \nof educational assessments. The findings of this study provide \npractical suggestions for educators and institutions. The \nrecommendations aim to limit the misusing of LLMs. This study \nalso advises on the ethical considerations of using LLMs within \nthe educational environment. \n2. Literature Review \nEducational environments and challenges have been changing \nrapidly. These changes have fostered a shift toward active \nlearning and creative thinking. Technology creates new learning \nsettings and methodologies. Students’ capacity to succeed in \ndifferent environments reflects their rising educational goals. \nChanging teachers’ perspectives and reorganising student -\nteacher interactions promote new educational methods \n(Petrolo et al., 2023) . These methods are digitalizat ion and \nvirtualization. They are used across various educational \nactivities to enhance overall learning outcomes and expand the \nscope of educational resources (Hwang, 2018). \nThe emergence of communication technologies has fostered the \nrise of distance learning (Yorkovsky & Levenberg, 2022). COVID-\n19 accelerated this shift, prompting educational institutions to \nrapidly transition from traditional to online instruction, \nnecessitating adjustments in scheduling, environment, and \ncurriculum (Agasisti & Soncin, 2021) . This digital shift in \neducation, popularized further by COVID -19, has made online \neducation a prevalent global method, primarily facilitated \nthrough the Internet and supported by devices like smartphones \nand tablets (Asaqli, 2020; Xie, Siau & Nah, 2020) . Online \neducation offers flexibility, allowing students to access less ons \nand resources anytime, anywhere, saving time and costs \nassociated with campus commutes (Mellieon, Jr & Robinson, \n2021). However, challenges exist. The absence of direct student-\nteacher interaction can complicate understanding, and the self-\npaced nature might diminish motivation. Connectivity issues and \nsubpar instructional materials can impede learning, especially in \nrural areas (Ilynykh, 2021). \nStudents may use some cheating methods during online exams \nand other assignments (Noorbehbahani, Mohammadi & \nAminazadeh, 2022). Students may search the Internet, join \nsocial networks, pretend to be another student, hide notes, and \nuse mobile phones, scientific calculators, MP3 players with \ncalculators, and wireless headphones and microphones. Also, \ncheating could include downloading papers and claiming them \nas one’s own, accessing test materials without authorization, \nand asking other students for answers. Teachers and students \nbelieve online examinations are easier to cheat. The biggest \nrisks are students working together or using forbidden tools \nduring the test (Holden et al., 2021).  \nLanier (2006)  reported that 41.1% of students admitted to \ncheating in online criminal justice and legal studies courses, \ncompared to 21.3% in face-to-face courses. King & Case (2014) \nfound that 15% of undergraduate business students admitted \nto cheating on exams, averaging 2.9 times each semester. \nWatson & Sottile (2010) noted that 32.7% of students across \nacademic areas admitted to cheating online. Dendir & Maxwell \n(2020) highlighted a higher likelihood of cheating in online \nclasses due to the absence of direct supervision and ease of \naccessing unapproved resources. However, not all online \nstudents cheat, and online proctoring can mitigate dishonesty \nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34     \n23 \n \nrisks. A Wiley (2020) survey of 800 global university educators \nfound that 93% believed online exams offer more opportunities \nfor cheating. \nA new risk has emerged with using AI in exams and assignments: \nUsing chatbots. Chatbots are software applications that \ncommunicate with people through text and speech on a certain \ntopic or ar ea. Chatbots offer many educational and training \npurposes. Recent advances in this subject indicate that \ncommunication with technology, whether through natural \nlanguage or speech, is more feasible due to technical \nimprovements and people’s growing familiar ity with engaging \ndigital entities (Smutny & Schreiberova, 2020). Chatbots may be \nused for exams and assessments (Kooli, 2023); students can ask \nchatbots any exam question and answer that question (Dias, \nKamdi, Gharat & Chudhari, 2019) . One of the most developed \nchatbots is ChatGPT. Susnjak (2022) mentioned that ChatGPT \ndemonstrates the ability to manifest critical thinking abilities and \nproduce writing that closely resembles reality with less input. \nConsequently, this poses a possible risk to the authenticity of \nexaminations, especially in higher education enviro nments \nwhere these assessments are more common.  \nThe advent of generative AI models, such as ChatGPT is an \nimportant advance in the constantly changing field of higher \neducation. Although these tools offer new and innovative \nmethods for teaching and learning, they create concerns about \nacademic integrity, especially in the context of assignments and \nexams (Perera & Lankathilaka, 2023). The availability of ChatGPT \nenables those with limited knowledge of technology to make use \nof its capabilities, potentially bypassing the challenges associated \nwith authentic learning. These models have the capability to \nrapidly generate a large amount of information, which presents \nchallenges for monitoring during assessments. Moreover, their \ncapacity to produce apparently original content presents a \nchallenge for traditional plagiarism detection methods. The \nexcessive dependence on AI has the potential to hinder the \ndevelopment of critical thinking skills while also presenting the \nhidden danger of AI models promoting or generating deceptive \nacademic material. Educators often encounter challenges in \ndistinguishing real student effort from content produced by \nartificial intelligence, which presents a complex and intricate \nsituation (Gimpel et al., 2023). \n LLMs can be used in distance learning or online exams, but they \ncan also pose a threat to the integrity of assignments. The \nintegration of AI into the field of higher education has caused a \nnew era in ways of teaching (Carvalho et al., 2022). One of the \nmajor advances in this field is ChatGPT. This adaptable language \nmodel has the potential to significantly improve the academic \nexperience for students by offering a variety of uses. ChatGPT \ncan serve as a tool for students to improve the effectiveness of \ntheir literature search techniques when completing \nassignments. Individuals can get selected collections of \nsignificant and up-to-date academic papers by entering specific \nquestions, improving their understanding of their selected \nsubject matter (Wagner, Lukyanenko & Paré, 2022) . However, \nstudents might use the advantages provided by ChatGPT in a \nnegative manner.  After completing the literature review, \nstudents can choose to use ChatGPT as a means to produce a \nwritten copy of their academic assignments. The accessibility of \nChatGPT could promote excessive reliance among students on \nthe model for solutions, thereby decreasing their preference \ntowards self -sufficient critical thinking and problem -solving \n(Jungherr, 2023; Putra, Rangka, Aminah & Aditama, 2023). \nIn the case that a significant number of students choose \nChatGPT as a means of requesting assistance, it is possible that \nthey might get standardised or similar responses in answer to \ntheir assignment questions. The procedure of homogeneity is \nan obstacle for educators in terms of detecting individual \nunderstanding and can potentially decrease the variety of \ndiverse viewpoints, which is a fundamental aspect of academic \ndiscussion. According to Hill (2023), to prevent this, educators \ncan provide an environment that encourages students to \ncritically evaluate and correct potential biases and similarities \npresent in the outputs produced by chatbots. \nThere is concern over the potential effects of ChatGPT on the \nacademic integrity of assignments. The discussion and worry \nregarding their performance on many exams and assignments \nhas generated significant attention and concern (Hill, 2023) . \nSome studies have been conducted on how ChatGPT performs \nin examinations in higher education institutions and other \nfields. According to a recent study in the medical domain (Gilson \net al., 2022), ChatGPT demonstrated performance equal to that \nof a  third-year medical student who successfully passed a \nmedical question -answer examination. In another medical \nstudy conducted by Kung et al. (2023) , ChatGPT s howed a \nperformance of over 60%, meeting the established \nstandard.  Lin et al. (2023)  found that ChatGPT exhibited \nsuperior performance compared to both ophthalmology \nresidents and practising ophthalmologists.  \nA study in the domain of law was undertaken by Choi, Hickman, \nMonahan & Schwarczet (2023). ChatGPT was evaluated in four \ndistinct final examinations a t the University of Minnesota. \nChatGPT answered over 95 multiple -choice questions and 12 \nessay questions. ChatGPT’s scores were sufficient to meet the \npassing requirements.  \nGeerling, Mateer, Wooten & Damodaran, 2023  evaluated \nChatGPT’s performance on a well -recognised economic \nknowledge assessment used in the United States. This \nassessment primarily focuses on assessing individuals’ \ncomprehension at the principle level.  ChatGPT achieved an \naccuracy rate of 63.3% in responding to microeconomics \nquestions, while it demonstrated an accuracy rate of 86.7% in \naddressing macroeconomics queries.  \nIn a study about tourism courses, the usage of ChatGPT has \nemerged as a significant concern concerning the \ntrustworthiness and dependability of  examinations (Göktaş, \n2023). The system exhibited weaknesses in accuracy and \nverification stages when responding to assignment questions \nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34 \n24 \n \nsince it offered inaccurate answers and referenced non-existent \nsources. Nevertheless, the system exhibited acceptable \nperformance in multiple-choice questions, correctly answering \n16 out of 20 questions. This outcome serves as a confirmation \nof its competence in assessing knowledge regarding multiple -\nchoice tourism-related topics. \nNewton & Xiromeriti (2023)  examined 41 research papers \nabout the performance of ChatGPT. These studies together \nused a sample of 46204 multiple -choice questions  (MCQs) \nderived from 97 distinct question sets. The researchers \ndiscovered that versions of ChatGPT using GPT -4 had a high \nsuccess rate in multiple -choice question (MCQ) examinations. \nThe collection of 41 studies encompasses various academic \ndisciplines, including medical, dentistry, computer science, life \nsupport, business, law, economics, mathematics, parasitology, \nphysics, chemistry, social work, engineering, anatomy, and \naccounting. Based on the available empirical evidence, it can be \nsaid that ChatGPT exhibits considerable potential as an \nassessment tool in several academic disciplines, assignments \nand exams. The significant challenge in academic evaluations is \ncharacterised by its consistent performance, adaptability with \nvarious question forms, and domain-specific proficiencies. \nAccording to Eke (2023) , generative AI systems like ChatGPT \npose a real threat to academic and exam integrity because they \ncan make students more likely to give the system their writing \nprojects. This could lead to copying and other forms of cheating \nin education. ChatGPT can write logical and interesting text, but \nit does not fully understand the complexities of human \nlanguage and conversation, which means that the system could \nsometimes come up with the wrong information, give damaging \ndirections or biased information, or have limited knowl edge \nbecause of how it was trained.  \nThe utilization of ChatGPT may have negative impacts on \nacademic and exam integrity due to its potential to enable \ndeceptive practices and cases of plagiarism. ChatGPT possesses \nthe ability to produce replies to questio ns that display a \nresemblance to human writing, hence presenting a difficulty in \ndistinguishing between text created by the machine and that \ngenerated by a human. The use of ChatGPT by students to \ngenerate homework or test responses might lead to instances  \nof academic dishonesty (Cotton, Cotton & Shipway, 2023). \nThis study considers the most advanced ChatGPT model, \nChatGPT-4. GPT-4, which was made available to the public in \nMarch 2023, is capable of accepting visual queries, can manage \n32,000 tokens at the same time, and has 100 trillion parameters \n(Barrot, 2023), whereas chatGPT -3.5 has 175 bil lion (Zaitsu & \nJin, 2023). This study seeks to assess the cognitive abilities of \nChatGPT-4, a recently constructed AI  agent, as well as its \ncapacity to generate human -like language in tourism exams. \nThere has been a growing apprehension over the potential \nmisuse of ChatGPT-4, as it has become more possible to use its \ncapabilities for the purpose of cheating on examinations, \ntrespassing upon the principles of academic honesty. \n3. Methodology \nThis study presents an explanation of the technique employed \nto assess the critical and higher -order thinking abilities of \nChatGPT. First, ChatGPT-4 was asked to create critical thinking \nquestions for undergraduate students in “tourism marketing, \ntourism management, tourism e conomics, tourist guidance, \nand gastronomy”. The questions should include a scenario. In \nthe second stage, ChatGPT -4 was asked to answer these \nquestions. Finally, ChatGPT -4 was asked to evaluate the \nanswers critically. The examples of the prompts entered for the \nthree phases are shown in Table 1. \nTable 1 - Promps to create questions, answers and criticism \nQuestion Please ask a critical and difficult question with a scenario for undergraduate students in \ntourism marketing. \nAnswer Please answer this question with examples and supporting information. \nCriticism Can you please critically evaluate the following response to the above question, listing its \nstrengths and weaknesses as well as suggestions for improvement? \nChatGPT was evaluated regarding its potential for formulating and \nanswering questions and thinking critically about these answers in \ntourism courses. The answers were examined according to the \ncritical thinking standards of Paul (2005) (Table 2).\n \nTable 2 - Critical thinking standards \nClarity \nCould you elaborate? \nCould you give me an example? \nCould you illustrate what you mean? \nAccuracy \nHow could we check on that? \nHow could we find out if that is true? \nHow could we verify or test that? \nPrecision \nCould you be more specific? \nCould you give me more details? \nCould you be more exact? \nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34     \n25 \n \nRelevance \nHow does that relate to the problem? \nHow does that bear on the question? \nHow does that help us with the issue? \nDepth \nWhat factors make this a difficult problem? \nWhat are some of the complexities of this question? \nWhat are some of the difficulties we need to deal with? \nBreadth \nDo we need to look at this from another perspective? \nDo we need to consider another point of view? \nDo we need to look at this in other ways? \nLogic \nDoes all this make sense together? \nDoes your first paragraph fit in with your last? \nDoes what you say follow from the evidence? \nSignificance \nIs this the most important problem to consider? \nIs this the central idea to focus on? \nWhich of these facts are most important? \nFairness Do I have any vested interest in this issue? \nAm I sympathetically representing the viewpoints of others? \nSource: Adapted from Paul (2005). \n \nCritical thinking is an idea that ties together what teachers and \nstudents need to know. It lets us help organizations change for \nthe better. When critical thinking is known in the right way, it \nhelps people internalize a deep knowledge of it. It is a skill that \npeople need to be able to examine, evaluate, and understand \nknowledge. It is a process of actively and skillfully \nconceptualizing, analyzing, synthesizing, and evaluating \ninformation to reach a conclusi on or solve a problem (Paul, \n2005). Figure  1  presents the possible critical thinking standards \nof ChatGPT-4 . \nFigure 1 - Possible critical thinking standards of ChatGPT-4 concerning tourism exams/assignments \n \n \nAccording to Paul (2005), the standards of critical thinking and \nintellectuality are below: \nClarity: It means understanding without ambiguity or \nconfusion. It means a statement is unambiguous. Because \nambiguity makes it hard to judge a statement’s accuracy or \nrelevance, clarity is a “gateway” criterion. Elaboration, \nillustration, and exemplification questions can improve \ncomprehension (Paul & Elder, 2013).  \nAccuracy: The lack of faults, blunders, or distortions and the state \nof being truthful and accurate are intellectual standards of \naccuracy. It signifies truthfulness. Thinking is always accurate, so \nit is safe to assume a statement’s accuracy hasn’t been fully \nassessed until its authenticity is validate d. One might ask \nquestions about facts and sources to strengthen their reasoning. \nPrecision: The ability to be precise is an intelligence criterion. It \nmeans a comment is clear and precise. Unless one specifies a \nstatement, one may not fully understand it. One can ask \nparticular questions to strengthen reasoning. \nRelevance: It is an intellectual criterion that requires a \nconnection to the topic. It must be significant and logically \nrelated to the issue. It means a comment is relevant to the \nsituation. Thoughts can always stray from the work, question, \nproblem, or issue at hand; thus, it is advisable to assume that \nindividuals have not properly examined their thinking until they \nhave considered all relevant topics, thoughts, and facts. Ask \nquestions to make sure your thoughts are relevant. \nDepth: It is considering all aspects of a situation, concept, or \nsubject. It means considering all factors. A statement or idea \nexamines a problem’s beliefs, implications, and impacts. \nThinking can uncover what is underlying or work on the surface. \nAsking questions about a problem’s assumptions, meanings, \nand consequences helps deepen thinking. \n\nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34 \n26 \n \nBreadth: Academic breadth requires openness and multi -\nperspective thinking. It means a statement or thought process \nrecognizes a problem’s complexity and considers other \nviewpoints. Open -mindedness demands multi -perspective \nreasoning. Assessing how much thought it takes to understand \na stream of thought is essential. \nLogic: Logical things do not conflict with each other. I t is \nfounded on rationality. A remark or concept makes sense and \ndoes not conflict with itself. Finding out how rational thought \nmight be beneficial. Asking questions to examine the \nconsistency, coherence, and veracity of reasoning and proof will \nhelp think rationally. \nSignificance: It is the intellectual norm of being significant, \nimpactful, or meaningful. It signifies that a remark or notion is \nsignificant, meaningful, and has significant implications. It is \ngood to assess a thought’s relevance to the situation. Questions \nabout the most essential facts, ideas, and thoughts about a \ntopic and what they mean or lead to are significant. \nFairness: Intellectual fairness excludes bias, dishonesty, partiality, \nself-interest, lying, and injustice. It means a statement or thought \nis fair, unbiased, and evaluates all important points of view \nwithout considering the speaker’s feelings or interests. Asking \nquestions encouraging people to explore alternative viewpoints \nand treat everyone equally, regardless of their feelings or goals, \ncan help them think more fairly. \n4. Results \nThis section presents the evaluation of the question generation \nand critical thinking skills of ChatGPT. The answers to each \nquestion are examined separately.  \n4.1 ChatGPT’s capability for question generation  \nTourism marketing  \nThe question developed regarding Tropica’s tourism marketing \nproblem addresses the key elements of sustainable tourism, \nfinancial objectives, and the intricate \"Tourist Life Cycle\" \nframework, thereby demonstrating ChatGPT’s understanding \nof the complex nature of tourism matters. Nevertheless, to \nfurther improve the depth of analysis, one might think about \nincluding empirical data-driven views or placing importance on \nthe cultural dimensions of Tropica. The question presented by \nChatGPT displays an important variety in its formulation. \nHowever, incr easing its depth and relevance to academic or \nprofessional conversations could be achieved by adding more \nspecific and data-oriented questions. \nTourism management \nThe question presented by ChatGPT on Marinelle’s economic \ntransition effectively underscores the inherent conflict \nbetween traditional means of subsistence and the emergence \nof new economic methods. The presented scenario exhibits a \nclear and cohesive depiction of the city’s change and the \nsubsequent difficulties that arise. While the question effectively \ncaptures the socio -cultural details, it would benefit from a \ndeeper exploration of specific management strategies to \nenhance precision. The importance of the topic is clear; yet, \naugmenting its complexity, including additional diverse aspects, \nsuch as environmental implications or worldwide trends in \ntourism, may prove beneficial. In addition, enhancing the scope \nof the analysis could be achieved by adding references to other \nglobal settings or considering the involvement of foreign actors, \ngiving an extensive point of view. The movement from a \ncomprehensive scenario to the search for answers \ndemonstrates coherent logic. However, a more comprehensive \nunderstanding might be achieved by highlighting the intricate \ninterplay of multiple components. \nTourism Economics \nThe question asked by ChatGPT regarding Econolia  combines \nthe fields of tourism and economic difficulties, demonstrating \nthe complex relationships among several sectors. This question \ndemonstrates a level of detail by effectively addressing both \nsevere and underlying crises. The quality of the text is apparent \nin its careful presentation of different economic concepts, such \nas the multiplier effect. It may be beneficial to incorporate \ncontemporary global trends or specific economic models \nrelated to tourism to enhance the relevance of future \nquestions. Furthermore, although the given scenario addresses \nimportant economic considerations, it would be beneficial to \ndelve into more complex implications, such as the socio-cultural \nconsequences of economic transformations. In brief, the \nquestion demonstrates an extensive understanding of the field \nof tourism economics, while there is potential for further \nenhancement to make it more consistent with the complexities \nobserved in real-world scenarios. \nTourist Guidance  \nThe question produced regarding \"Sylvantours\" addresses the \ninteraction of historical tourism with developing technology, \nnamely augmented reality (AR) and virtual reality (VR). The \ntext shows depth by emphasising a combination of cultural \nand technological fields and argues for a harmonic integration  \nof conserving authenticity and embracing innovation. \nHowever, further developing the topic would be beneficial by \ndescribing the components of Augmented Reality (AR) and \nVirtual Reality (VR) that are most important to visitor help. \nAdditionally, it would be useful to investigate the potential \nresponse from tourists visiting Techlandia regarding their use \nof AR and VR technologies. Although the current structure of \nthe case is logical, it might be enhanced by including deeper \nlinks between the applications of augmented reality (AR) and \nvirtual reality (VR) technologies and specific Ancienta \nlandmarks, increasing the overall relevance of the discussion. \nThe topic examines the key issues surrounding modern \ndifficulties in tourist guidance. However, it may bene fit from \na deeper examination of the complexities associated with \nusing technology in a heritage context.  \n \nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34     \n27 \n \nGastronomy  \nThe question presented addresses the contrast between \nGastroville’s existing culinary traditions and the emerging \nimpact of molecular gas tronomy. The question underlines the \nchange in gastronomic preferences by drawing attention to the \nissues experienced by traditional restaurants due to the \nemergence of locations such as \"MolecuEat.\" However, the \napproach's effectiveness could be enhanced by placing a higher \npriority on the socio-economic aspects of local enterprises or by \ndelving further into the psychological attraction of \ncontemporary vs traditional gastronomic encounters for \ncustomers. The current structure and clarity of the text capture \nthe essence of the gastronomy debate. However, to further \nenhance clarity, it may be beneficial to provide a more explicit \ndifferentiation between the preservation of culinary traditions \nand the commercial sustainability of restaurants. In conclusion, \nthe question sheds light on the dynamic culinary environment, \nalthough it would be beneficial to undertake a more complex \nexamination of gastronomic identity and the associated \neconomic consequences. \nChatGPT has shown an important skill level in formulating  \nquestions about many tourism aspects. It conveys key concepts \nranging from sustainability to the integration of technology \nwith heritage. The approach to tourist marketing employed by \nthe organization is firmly based on fundamental ideas, such as \nsustainability and the concept of the \"Tourist Life Cycle.\" In the \nfield of tourism management, it regulates the complex harmony \nbetween traditional practices and rising economic \nopportunities. The model demonstrates an effective grasp of \ncomplex economic processe s when applied to tourism \neconomics. However, it might potentially benefit from a more \nnuanced understanding of global trends. The endeavour’s \nexploration into providing visitor information demonstrates an \nappealing combination of technical progress and cu ltural \nauthenticity. Within the domain of gastronomy, it illustrates the \ncontinuous development of culinary customs in the midst of \ncontinuous gastronomic changes. In conclusion, although \nChatGPT demonstrates a basic understanding of tourism, there is \nroom for improvement in enhancing its depth and nuance. This \nimprovement would contribute to a better alignment between its \noutputs and the complexities observed in the real world.  \n4.2. Evaluation of Critical Thinking Skills of ChatGPT \nTourism marketing  \nClarity was noticed through the use of systematic explanations \nand the clear distinction between the problems at present and \npossible solutions. GPT-4 maintained high precision despite the \nlimited practical use of the hypothetical situations. The solution \nshowed precision by efficiently recognising the problems \nassociated with uncontrolled tourism growth and providing \nsustainable strategies to address them. However, an additional \nreview of the incorporation of local customs might have \nimproved the analysis . The discussion centred on the issues \nfaced by Tropica, with occasional angles exploring bigger global \ntrends that lacked a clear relevance. Regarding depth, the \nresponse properly recognized the complex issues involved in \nbalancing the economic benefits of tourism with its \nenvironmental and social consequences. However, a more \ncomprehensive examination of the fundamental factors at play \nwould have enhanced th e overall discourse. Breadth was \nmaintained by including a wide range of stakeholders and their \nperspectives. The narrative exhibited rationality as it \nsystematically explored the advantages, disadvantages, and \nfinally proposed balanced resolutions related  to the field of \ntourism. The significance of implementing sustainable practices \nin tourist locations, such as Tropica, was emphasized, indicating \nthat a more thorough investigation of the specific choices made \nby Tropica may have enriched the discourse. F inally, the \ndiscourse demonstrated a commitment to fairness by trying to \nachieve an equitable balance between the economic benefits \nderived from tourism and the potential negative consequences \nassociated with it. \nTourism Management  \nA clear sense of clarit y characterised the difference between \nMarinelle’s historical significance and contemporary tourist \ndemands. The importance of empirical information to support \narguments was emphasised by accuracy, while precision argued \nfor using specific examples to stre ngthen the suggested \nmethods. The concept of relevance is centred on the \nequilibrium between traditional principles and current goals, \nalthough it would be beneficial to link it further with Marinelle’s \nspecific characteristics. The review of cultural trad itions was \nconducted in a detailed way, considering the shifting \npreferences of tourists. This analysis suggests the possibility of \nconducting a deeper investigation. The breadth of the analysis \ncommendably covers a wide range of viewpoints, including \nthose of local residents as well as international tourists. The \nissue of integrating tradition with modernity was emphasised \nby logic, which suggests the need for a deeper examination of \ncause-and-effect relationships. The significance of Marinelle’s \ntransformation was highlighted, emphasizing the broader \nimplications. However, it is suggested that a more detailed \nexploration of specific situations might provide more \nunderstanding. Fairness finally highlighted a balanced \nconsideration of both traditional norms and progressive \nperspectives, arguing for a more impartial and well -rounded \ndiscussion. \nTourism Economics  \nThe emphasis on clarity was achieved by simplifying complex \nsubjects, hence ensuring the accessibility of the text. The \naccuracy improvement was achieved by including hypothetical \nscenarios in real economic circumstances, further supported by \nempirical evidence derived from economic research. The issue \nof precision was examined in relation to certain economic \nchallenges, although there was a suggestion  for a deeper look \ninto areas of impact and the diversification of businesses. The \nsignificance of tourism’s influence on the economy of Econolia \nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34 \n28 \n \nwas underlined. The evaluation examined the immediate and \npotential future implications of tourist dependence in relation \nto its depth. The breadth of this study underlined an extensive \nand varied viewpoint while also suggesting the need for \nadditional investigation into visitor attitudes and patterns of \npurchase. The current dual-economic situation of Econolia and \nits associated consequences were brought to attention through \nlogical examination. The emphasized significance of Econolia’s \nproblems lies in their wider implications for economies heavily \nrelying on tourism. Finally, the concept of fairness supports \nadopting an equal position while examining tourism economics' \npotential drawbacks and benefits. It recommends incorporating \nvarious viewpoints to ensure a comprehensive and well -\nrounded evaluation. \nTourist Guidance  \nAchieving clarity was made easier through the separation of \ntraditional attractions and emerging technologies. The \nimportance of accuracy was made clear by the practical growth \nof tourist information in real-world settings. This answer aims to \nexplain the advantages and disadvantages associated with \nintegrating technology in the context of historical tourism. The \nmain goal of the relevance aspect was to ensure that the \naugmented reality (AR) and virtual reality (VR) apps maintained \nthe cultural and historical integrity of Ancienta. The answer \nperformed an analysis of the complex influence of technology on \ncultural tourism while also suggesting a need for more research \ninto the fundamental drivers behind the use of technology. The \nbreadth of the answer showed a diverse range of perspectives \nwhile also highlighting possible paths for further research, such \nas the examination of international case studies. The issue of \nproperly integrating emerging technology with a deep historical \nbackdrop is highlighted by logic. The significance of technology \nwas emphasised, indicating the need for a deeper look into its \nsocio-cultural, economic, and perceptual consequences. Finally, \nthe principle of fairness promoted a comprehensive assessment \nof the advantages and disadvantages of implementing \naugmented reality (AR) and virtual reality (VR) technologies \nwithin a historically significant setting. \nGastronomy  \nAchieving clarity was realized by  deliberately combining \nhistorical culinary traditions with contemporary advancements, \nensuring accessibility to individuals who might not have a \nparticular interest in gastronomy. The primary concern of \naccuracy is in the real difficulties that occur when attempting to \nreconcile authenticity and innovation. The answer emphasised \nthe use of contemporary methodologies, specifically molecular \ngastronomy, in the context of traditional culinary \narrangements, although it could have provided a deeper \nexamination of its implications for culinary education. The \nimportance of relevance was underscored through the \nemphasis on modern techniques employed in preserving \ncooking traditions. The answer offered an examination of the \nconsequences associated with the integrati on of traditional \npractices and innovative approaches. However, it was \nrecommended that a deeper examination of the fundamental \nideologies involved be conducted. Breadth acknowledged the \nresponse’s ability to present a well -rounded viewpoint while \nsuggesting the advantages of integrating global contrasts. The \nlogical analysis presented a cohesive representation of the \nconfluence between the historical gastronomy of Gastroville \nand modern culinary skills. The significance of this culinary \njunction was discus sed, highlighting its global relevance and \nsuggesting the need for additional comprehensive research. \nLastly, the principle of fairness underscores the significance of \nadopting a neutral approach, arguing for the incorporation of a \nwide range of opinions t o achieve a comprehensive and \nbalanced perspective. \nThe critical thinking skills of ChatGPT show themselves when \nevaluated in different facets of tourism, as it consistently \nsuggests a strong dedication to clarity, precision, and depth. \nWithin the domain o f tourism marketing, ChatGPT shows an \neffective ability to evaluate and break down the complexity \nassociated with sustainable practices. However, a deeper \ninvestigation of the nuances related to local traditions could \nenhance the depth and quality of its a nalysis. When examining \nMarinelle’s tourism management, it skillfully negotiates the \ndelicate balance between maintaining its historical heritage and \nachieving present-day aims. However, a heightened emphasis \non complexity unusual to the local context coul d enhance the \ndepth and quality of its insights. Regarding the tourism \neconomics of Econolia, ChatGPT effectively simplifies complex \neconomic challenges. However, a deeper exploration of the \nvarious aspects of economic diversification could enhance the \ndepth of analysis. When examining tourist guidance, ChatGPT \neffectively identifies the conflict between traditional \nattractions and the increasing influence of modern technology, \nemphasizing the importance of thoroughly examining the root \ncauses that lead to the use of technology. Within gastronomy, \na harmonious combination of traditional culinary customs and \nmodern innovative techniques exists. However, a deeper \nexamination of the underlying ideas that support various \nculinary art forms could provide valuable insights. In summary, \nalthough ChatGPT provides a broad overview of various \nperspectives, a more focused examination of local-specific facts \nand fundamental philosophies could enhance the depth and \nprecision of its conversation. \n5. Discussion  \nThere has been a focus (Susnjak, 2022) on the value of critical \nthinking in both academic and practical contexts. The ability to \nobjectively examine information holds significant relevance, \nespecially in the contemporary world, where the Internet \nfacilitates the rapid dis semination of incorrect information. \nChatbots have the capacity to bring about a crucial change in \nvarious domains, such as the scientific realm, by expediting the \ndistribution of knowledge. ChatGPT can respond to questions, \nprovide informative cases, and join discussions with individuals \nseeking knowledge. \nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34     \n29 \n \nChatGPT can be utilized for evaluation objectives, such as \nevaluating the difficulty level in generating assessments. \nAccording to Ventayen (2023), the utilization of AI in academic \nsettings raises ethical considerations concerning academic and \nexam dishonesty issues. ChatGPT can write text that is nearly \nindistinguishable from content written by humans. This can \nmake it challenging for tools like Turnitin to find plagiarism. \nConcerns have been raised that students might use ChatGPT to \ncheat on tests or assignments (Skavronskaya, Hadinejad & \nCotterell, 2023). Figure 2 shows the potential features that \nChatGPT-4 can provide in tourism exams or assignments. The \nuse of ChatGPT as a means of academic dishonesty may occur \nwhen students overly depend on it to provide solutions rather \nthan employing it as a  supplementary resource that enhances \ntheir learning experience. \n \nFigure 2 - Using ChatGPT-4 for tourism exams and assignments \n \n \nSource: Created by the author. \nChatGPT  has several significant strengths. It uses an \nadvanced natural language model to produce logical and \ncoherent answers. Additionally, it has the capacity to \nenhance its own performance over time. ChatGPT exhibits \nsome drawbacks, a deficiency in deep unders tanding, and \nchallenges in assessing the quality of its generated \nresponses. The difficulties faced by the field of education \ninclude a deficiency in threatening the principles of \nacademic integrity and enabling the widespread occurrence \nof plagiarism. The  findings presented in a study conducted \nby  Farrokhnia, Banihashem, Noroozi & Wals (2023)  support \nthis study's results.  \nAccording to the results of this study, ChatGPT -4 \ndemonstrates notable capabilities in several intellectual \ncriteria; nonetheless, there are certain aspects that could \nbenefit from further improvement to better accord with \nacademic norms and expectations  (Figure 3) . This view is \nconsistent with the worries expressed by scholars in the \nwider academic field about the potential risks associated \nwith too much reliance on AI  for important tasks in the \nabsence of human supervision (Cotton et al., 2023; Currie, \n2023; Eke, 2023) .  \nThe ethical use of ChatGPT  in examinations depends on how \nit is integrated into the assessment process and how \nstudents use it (Elbanna & Armstrong, 2023) . Educators \nneed to ensure that students have a comprehensive \nunderstanding of the limitations associated with ChatGPT \nand that its use is closely supervised to reduce cases of \nacademic dishonesty.  ChatGPT -4, an AI language model, can \npotentially facilitate academic dishonesty by enabling \ncheating during examinations or assignments. Several \nstudies (Ali, Barhom, Marino & Dugga let, 2023; Atlas, 2023; \nCurrie, 2023; Geerling et al., 2023) support this view. The \nutilization of ChatGPT -4 can serve both positive and negative \nobjectives, and students who employ it without permission \nor in unethical ways are breaking the principles of academic \nhonesty. OpenAI, the organization responsible for the \ndevelopment of ChatGPT -4, is currently engaged in \nadvancing technology aimed at facilitating the identification \nof text produced by ChatGPT -4.\n \n\nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34 \n30 \n \nFigure 3 - ChatGPT-4 as a tool for tourism exams and assignments \n \nSource: Created by the author. \n \nConsequently, educators are advised to be proactive and \nethical when utilizing these tools. In summary, although \nChatGPT-4 possesses the potential to facilitate academic \ndishonesty during examinations and assignments, educational \nprofessionals and institutions should implement proactive \nmethods to counteract this issue and uphold the principles of \nacademic integrity. \n6. Conclusion \nThe rapid growth of AI, particularly in so phisticated language \nmodels, such as ChatGPT -4, has caused intense discussion \nregarding its implications for several fields, including tourism \neducation. The aim of this study within the field of tourism \neducation was to assess the capacity of ChatGPT-4 to generate \nand assess queries that require critical thinking across several \nsubdisciplines of tourism. The present study uses the critical \nthinking standards suggested by Paul (2005) to conduct a \nthorough assessment of the model's usefulness. \nWhen evaluating the performance of ChatGPT -4 in relation to \nthe critical thinking standards established by Paul (2005), many \nsignificant findings come to light. ChatGPT-4 effectively conveys \nconcepts precisely, demonstrating a limited degree of \ncomplexity. Although the model’s accuracy is often reliable, it \noccasionally relies on hypothetical circumstances that may lack \npractical significance. While ChatGPT -4 provides accurate \nreplies, there is room for improvement in terms of enriching the \ndepth of its content. The text  primarily emphasises the \nimportance of relevance, with intermittent deviations. \nAlthough many responses demonstrate depth, certain \nsituations necessitate a more nuanced examination. \nThe model demonstrates breadth by incorporating many \nopinions, although t here is potential for greater diversity. The \nlogical coherence exhibited by ChatGPT -4 is a notable feature, \nas it guarantees a systematic and organized development of \nideas. The examination of the key concepts or the significance \nof the subject matter has been partially accomplished, while a \nmore comprehensive investigation into wider implications may \nprove beneficial. Finally, with regard to fairness, the model tries \nto balance its replies; however, a more comprehensive \ndepiction of all viewpoints would improve its dedication to this \ncriterion. \nChatGPT-4 model shows competence in various aspects of \ncritical thinking, including clarity, accuracy, precision, \nrelevance, depth, breadth, logic, and fairness. However, there \nare still areas that could benefit from further improvement. The \nexpertise shown by artificial intelligence -based LLM, such as \nChatGPT-4, may be posed as a reasonable concern regarding \nthe preservation of the authenticity of examinations and \nacademic tasks within the realm of higher  education. Students \nmay misuse their capacity to provide clear, logical, and \npertinent feedback that showcases critical thinking to improve \nthe quality of their academic assignments artificially. Students' \npotential use of AI for completing assignments or  providing \nexam responses can hinder real -world education and the \ndevelopment of critical thinking skills and compromise the \nfundamental objectives of educational assessments. \nThe results of this study are significant for education. According \nto the results, it is highly likely that the use of ChatGPT in exams \nand assignments for marketing, management, economics, tour \nguiding, and gastronomy, which are important areas of tourism \neducation, will have significant effects. Consequently, the \nadvent of AI techno logies, such as ChatGPT -4 can offer \nadvantages and potential risks for tourism exams and \nassignments. According to the author of this study, it becomes \napparent that although AI models have achieved notable \nadvancements in natural language processing, they  are not \ndevoid of errors. \nTheoretical Implications  \n This study intends to fill the gap in the existing literature by \nexamining the ethical implications and issues associated with \nthe integration of AI in the field of education, specifically in \nrelation t o the comparison between conventional cheating \ntactics and AI-related risks. \nThe study highlights an important shift in our understanding of \nacademic honesty within today’s environment. The growing \nsophistication of AI and other digital technologies, \ndemonstrated by ChatGPT -4, presents complex problems that \npose a challenge to traditional understandings of cheating and \nacademic integrity. The process of evolution in academia calls \nfor researchers to seriously examine the fundamental principles \nthat define a cademic integrity in the modern era. Moreover, \n\nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34     \n31 \n \nthe study investigates the thinking skills of artificial intelligence, \nemploying ChatGPT-4’s effectiveness within the field of tourism \nas a norm for evaluation. The study provides valuable \nperspectives on the domain-specific capabilities of artificial \nintelligence and offers indications of its wider potential and \nlimitations within several academic disciplines. Furthermore, \nthe findings of the study about the competence of AI in \nproducing and addressing questions have the potential to bring \nabout an important change in the design of assessments. In \nfuture examinations, there is a potential shift towards \nemphasizing the assessment of advanced intellectual skills, \nsuch as critical thinking, innovation, and applied competencies, \nas opposed to simply assessing the ability to memorize and \nrecollect information. \n7. Recommendations \nChatGPT-4 has demonstrated considerable achievement in \nfulfilling the criteria of intellectual thinking standards and \nexhibiting writing talents that closely resemble those of \nhumans. The circumstance mentioned above presents a \npotential challenge to administering examinations in the \ncontext of tourism education. This section presents a set of \nrecommendations for educators to reduce this threat. \nCoghlan et al. (2020)  highlight that implementing online \nexamination supervision systems has effectively reduced cases \nof academic dishonesty and unethical behaviour. These systems \nspecifically address behaviour s such as copying test answers \nfrom peers or online sources and the unauthorized use of \ncheating technologies. Certain universities have offered \nreasons for utilizing these systems, whereas others have \ndecided to cease or decline their implementation. The author \nwarns that despite the implementation of these regulations, \nthere is a possibility of certain students engaging in academic \ndishonesty. \nThere is a diverse range of regulations that can be employed to \ndetect and reduce cases of academic dishonesty. T he \nregulations include various measures, such as identity \nverification, keyboard recognition, video proctoring, browser \ncontrol, test duration limitations, question and answer \nrandomization, the creation of cheat -resistant questions, and \nreducing the signi ficance of the exam in the overall course \nmarking. Offline or in -person proctored examinations may \npresent a more effective obstacle against cheating than online \nexams (Noorbehbahani et al., 2022). \nThe findings of a study indicate that the utilization of online \nproctoring has the potential to serve as an efficacious strategy \nin addressing instances of academic dishonesty within the \ncontext of online cou rses. Nevertheless, the research also \nunderscores the necessity for continuous improvement in all \naspects of distance education, including the level of instruction \nand knowledge acquisition, active participation, fairness, \ninclusivity, and moral behaviour.  Hence, higher education \ninstitutions that provide online courses must consider the \nincorporation of online proctoring as a fundamental \ncomponent of a holistic strategy aimed at maintaining academic \nand exam integrity within online learning settings (Dendir & \nMaxwell, 2020) . Potential solutions for this problem include \nadvancing innovative plagiarism detection mechanisms wi th \nenhanced capabilities in distinguishing AI -generated content \n(Skavronskaya et al., 2023). \nIn general, various methods can be implemented to prevent the \nutilization of ChatGPT -4 or similar tools  for academic \ndishonesty in examinations or assignments, particularly in the \ndomain of tourism education. The use of o nline exam \nsupervision or proctoring tools may reduce  academic \ndishonesty.  During exams, these systems can monitor students \nin real time and look for suspicious behaviour, like moving away \nfrom the exam tab or using another device. Using identity \nverification makes sure that the student who signed up for the \ntest is the one who is taking it. Keyboard recognition can \ndetermine if someone is using external tools or software by \nlooking for trends in how they write. The advancement of new \nplagiarism detection techniques capable of discerning AI -\ngenerated text is crucial to upholding online exam and \nassignment integrity. Offline or in -person supervised \nexaminations can more efficiently reduce cheating than the \nweb methods. The use of a restrictive time limit dur ing \nexaminations can effectively limit the opportunity for potential \ndishonesty. The use of randomization in the assignment of \nquestions ensures that every student is presented with an \nindividual set of questions, hence increasing the difficulty of \nsharing answers. Designing questions that require the \nutilization of critical thinking, practical application, and \nanalytical skills may deter students from seeking direct \nresponses from AI systems. In conclusion, a combination of \ntechnology solutions, improvemen ts to exam design, and a \nfocus on ethical behaviour can achieve the effective prevention \nof risks associated with tools like ChatGPT -4 in exams and \nassignments. \nStudies should be conducted across various academic \ndisciplines to investigate the critical thi nking capabilities and \nhuman-like writing abilities of ChatGPT -4. It is essential to \ndetermine the abilities or limitations of this chatbot in many \nacademic fields and to conduct a comprehensive assessment \ncovering various question formats, such as multiple-choice and \nopen-ended questions. This evaluation will enable an in -depth \nevaluation of its performance in an examination setting. \nLimitations and directions for further studies \nThe primary emphasis of this study focuses on the performance \nevaluation of C hatGPT-4 concerning intellectual criteria. The \nmodel’s range may not be comprehensive regarding its possible \nuses or potential misapplications across various academic and \nnon-academic contexts. The findings and recommendations \ncould apply particularly to t he context of tourism education. It \nis uncertain whether these findings may be readily generalised \nto other disciplines or fields of study without conducting more \nstudies. The discussion seems to be centred around \nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34 \n32 \n \nhypothetical scenarios and evaluations rat her than empirical \nstudies that involve actual students, educators, or examination \nsettings. The methodology, technologies, and issues associated \nwith online education are subject to continual change. The \nmaterial may not completely include all the details  or predict \nfuture difficulties within online examinations. \nFurther studies should be conducted across various academic \ndisciplines to investigate the critical thinking capabilities and \nhuman-like writing abilities of ChatGPT -4. It is essential to \ndetermine the abilities or limitations of this chatbot in many \nacademic fields. Furthermore, it is essential to subject ChatGPT-\n4 to a comprehensive assessment covering various question \nformats, such as multiple -choice and open -ended questions. \nThis evaluation wil l enable an in -depth evaluation of its \nperformance in an examination setting. \nDeclaration of competing interest: None \nReferences \nAbabneh, K. I., Ahmed, K., & Dedousis, E. (2022). Predictors of cheating \nin online exams among business students during the Covid pandemic: \nTesting the theory of planned behavior. The International Journal of \nManagement Education , 20(3), 100713. \nhttps://doi.org/10.1016/j.ijme.2022.100713 \nAdzima, K. (2021). Examining online cheating in higher education using \ntraditional classroom cheating as a guide. Electronic Journal of E -\nLearning, 18(6). https://doi.org/10.34190/JEL.18.6.002 \nAgasisti, T., & Soncin, M. (2021). Higher education in troubled times: On \nthe impact of Covid -19 in Italy. Studies in Higher Education , 46(1), 86–\n95. https://doi.org/10.1080/03075079.2020.1859689 \nAlAfnan, M. A., Dishari, S., Jovic, M. & Lomidze, K. (2023). Chatgpt as an \neducational tool: opportunities, challenges, and recommendations for \ncommunication, business writing, and composition courses. Journal of \nArtificial Intelligence and Technology , 3, 60 -68. \nhttps://doi.org/10.37965/jait.2023.0184 \nAli, K., Barhom, N., Marino, F. T., & Duggal, M. (2023). The thrills and \nchills of chatgpt: ımplications for assessments in undergraduate dental \neducation [Preprint]. MEDICINE & PHARMACOLOGY. \nhttps://doi.org/10.20944/preprints202302.0513.v1 \nAtlas, S. (2023). Chatgpt for higher education and professional \ndevelopment: a guide to conversational AI . University of Rhode Island \nDigitalCommons@URI. \nhttps://digitalcommons.uri.edu/cba_facpubs/548 \nBarrientos, A., Cuadros, M., Alba, J., & Cruz, A. S. (2021, October 27-29). \nImplementation of a remote system for the supervision of online exams \nthrough the use of cameras with artificial intelligence . 2021 IEEE \nEngineering International Research Conference (EIRCON) , 1 –4. \nhttps://doi.org/10.1109/EIRCON52903.2021.9613352 \nBarrot, J. S. (2023). Using ChatGPT for second language writing: Pitfalls \nand potentials. Assessing Writing , 57, 100745. \nhttps://doi.org/10.1016/j.asw.2023.100745 \nBenvenuti, M., Cangelosi, A., Weinberger, A., Mazzoni, E., Benassi, M., \nBarbaresi, M., & Orsoni, M. (2023). Artificial intelligence and human \nbehavioral development: A perspective on new skills and competences \nacquisition for the educational context. Computers in Human Behavior, \n107903. https://doi.org/10.1016/j.chb.2023.107903 \nBernabei, M., Colabianchi, S., Falegnami, A., & Costantino, F. (2023). \nStudents’ use of large language models in engineering education: A case \nstudy on technology acceptance, perceptions, efficacy, and detection \nchances. Computers and Education: Artificial Intelligence , 100172. \nhttps://doi.org/10.1016/j.caeai.2023.100172 \nCarvalho, L., Martinez-Maldonado, R., Tsai, Y.-S., Markauskaite, L., & De \nLaat, M. (2022). How can we design for learning in an AI world? \nComputers and Education: Artificial Intelligence , 3, 100053. \nhttps://doi.org/10.1016/j.caeai.2022.100053 \nChirumamilla, A., & Sindre, G. (2019). Mitigation of cheating in online \nexams: Strengths and limitations  (A. V. S. Kumar, Ed.). IGI Global. \nhttps://doi.org/10.4018/978-1-5225-7724-9 \nChoi, J. H., Hickman, K. E., Monahan, A., & Schwarcz, D. B. (2023). \nChatGPT goes to law school. SSRN Electronic Journal . \nhttps://doi.org/10.2139/ssrn.4335905 \nCoghlan, S., Miller,  T., & Paterson, J. (2020). Good proctor or “Big \nBrother”? AI ethics and online exam supervision technologies. \nhttps://arxiv.org/abs/2011.07647. \nComas-Forgas, R., Lancaster, T., Calvo -Sastre, A., & Sureda-Negre, J. \n(2021). Exam cheating and academic integrity breaches during the \nCOVID-19 pandemic: An analysis of internet search activity in Spain. \nHeliyon, 7(10), e08233. https://doi.org/10.1016/j.heliyon.2021.e08233 \nCotton, D. R. E., Cotton, P. A., & Shipway, J. R. (2023). Chatting and \ncheating: Ensuring academic integrity in the era of ChatGPT. \nInnovations in Education and Teaching International , 1 –12. \nhttps://doi.org/10.1080/14703297.2023.2190148 \nCrawford, J., Cowling, M., Central Queensland University, Australia, \nAllen, K. -A., & Monash University, Australia. (2023). Leadership is \nneeded for ethical ChatGPT: Character, assessment, and learning using \nartificial intelligence (AI). Journal of University Teaching and Learning \nPractice, 20(3). https://doi.org/10.53761/1.20.3.02 \nCurrie, G. M. (2023). Academic integrity and artificial in telligence: Is \nChatGPT hype, hero or heresy? Seminars in Nuclear Medicine , 53(5), \n719–730. https://doi.org/10.1053/j.semnuclmed.2023.04.008 \nDavid, A., Mihai, D., Mihailescu, M.-E., Carabas, M., & Tapus, N. (2022). \nScalability through distributed deployment for moodle learning \nmanagement system. Procedia Computer Science , 214, 34 –41. \nhttps://doi.org/10.1016/j.procs.2022.11.145 \nDendir, S., & Maxwell, R. S. (2020). Cheating in online courses: Evidence \nfrom online proctoring. Computers in Human Behavior Reports , 2, \n100033. https://doi.org/10.1016/j.chbr.2020.100033 \nDias, J., Kamdi,  D., Gharat, N., & Chudhari, P. (2019). Chatbot for \nGovernment Examination using AI. Journal of Engineering, 9(4), 58-62. \nDuhaim, A. M., Al -mamory, S. O., & Mahdi, M. S. (2022). Cheating \ndetection in online exams during Covid-19 pandemic using data mining \ntechniques. Webology, 19(1), 341 –366. \nhttps://doi.org/10.14704/WEB/V19I1/WEB19026 \nEke, D. O. (2023). ChatGPT  and the rise of generative AI: Threat to \nacademic integrity? Journal of Responsible Technology , 13, 100060. \nhttps://doi.org/10.1016/j.jrt.2023.100060 \nElbanna, S., & Armstrong, L. (2023). Exploring the integration of \nChatGPT in education: Adapting for the future. Management & \nSustainability: An Arab Review . https://doi.org/10.1108/MSAR-03-\n2023-0016 \nEssel, H. B., Vlachopoulos, D., Tachie-Menson, A., Johnson, E. E., & Baah, \nP. K. (2022). The impact of a virtual teaching assistant (chatbot) on \nstudents’ learning in Ghanaian higher education. International Journal \nof Educational Technology in Higher Education , 19(1), 57. \nhttps://doi.org/10.1186/s41239-022-00362-6 \nFarrokhnia, M., Banihashem, S. K., Noroozi, O., & Wals, A. (2023). A \nSWOT analysis of ChatGPT : Implications for educational practice and \nresearch. Innovations in Education and Teaching International , 1 –15. \nhttps://doi.org/10.1080/14703297.2023.2195846 \nGeerling, W., Mateer, G. D., Wooten , J., & Damodaran, N. (2023a). \nChatGPT has Mastered the Principles of Economics: Now What? SSRN \nElectronic Journal. https://doi.org/10.2139/ssrn.4356034 \nGerashchenko, I. P., & Kovalev, V. A. (2021). Formation of educational \necosystems through the digital transformation of the educational \nenvironment. SHS Web of Conferences, 121, 03004. \nhttps://doi.org/10.1051/shsconf/202112103004 \nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34     \n33 \n \nGilson, A., Saf ranek, C., Huang, T., Socrates, V., Chi, L., Taylor, R. A., & \nChartash, D. (2022). How Does ChatGPT Perform on the Medical \nLicensing Exams? The ımplications of large language models for medical \neducation and knowledge assessment  [Preprint]. Medical Educati on. \nhttps://doi.org/10.1101/2022.12.23.22283901 \nGöktaş, L. S. (2023). ChatGPT uzaktan eğitim sınavlarında başarılı olabilir \nmi turizm alanında doğruluk ve doğrulama üzerine bir araştırma (Can \nChatGPT succeed in distance education exams a research on accuracy \nand verification in tourism). Journal of Tourism and Gastronomy \nStudies, 2. https://doi.org/10.21325/jotags.2023.1224 \nHashim, H. (2018) . Application of technology in the digital era \neducation. International Journal of Research in Counseling and \nEducation, 1(2). https://doi.org/10.24036/002za0002 \nHill, B. (2023). Taking the help or going alone: ChatGPT and class \nassignments. SSRN Electronic Journa l.  \nhttps://doi.org/10.2139/ssrn.4465833 \nHolden, O. L., Norris, M. E., & Kuhlmeier, V. A. (2021). Academic \nıntegrity i n online assessment: A research review. Frontiers in \nEducation, 6, 639814. https://doi.org/10.3389/feduc.2021.639814 \nHwang, A. (2018). Online and Hybrid Learning. Journal of Management \nEducation, 42(4), 557 –563. \nhttps://doi.org/10.1177/1052562918777550 \nIlynykh, S. (2021). Online education: Trends and risks of digital \ntechnologies: VIII International Scientific and Practical Conference \n“Current problems of social and labour relations” (ISPC -CPSLR 2020), \nMakhachkala, Russia Federation. \nhttps://doi.org/10.2991/assehr.k.210322.126 \nJungherr, A. (2023). Using ChatGPT and Other Large Language Model \n(LLM) applications for academic paper assignments  [Preprint]. \nSocArXiv. https://doi.org/10.31235/osf.io/d84q6 \nKing, D. L., & Case, C. J. (2014). E-Cheating: Incidence and trends among \ncollege stud ents. Issues In Information Systems , 15(1). \nhttps://doi.org/10.48009/1_iis_2014_20-27 \nKlijn, F., Mdaghri Alaoui, M., & Vorsatz, M. (2022). Academic integrity \nin on-line exams: Evidence from a randomized field experiment. Journal \nof Economic Psychology , 93, 102555. \nhttps://doi.org/10.1016/j.joep.2022.102555 \nKung, T. H., Cheatham, M., Medenilla, A., Sillos, C., De Leon, L., Elepaño, \nC., Madriaga, M., Aggabao, R., Diaz -Candido, G., Maningo, J., & Tseng, \nV. (2023). Performance of ChatGPT on USMLE: Potential for AI-assisted \nmedical education using large language models. PLOS Digital Health , \n2(2), e0000198. https://doi.org/10.1371/journal.pdig.0000198 \nLanier, M. M. (2006). Academic integrity and distance learning. Journal \nof Criminal Justice Education , 17(2), 244 –261. \nhttps://doi.org/10.1080/10511250600866166 \nLatifah, R., Budiyanto, C. W., & Saputro, H. (2022). Digital \ntransformation readiness in education: A review. International Journal \nof Information and Education Technolog y, 12(8), 809 –815. \nhttps://doi.org/10.18178/ijiet.2022.12.8.1688 \nLin, J. C., Younessi, D. N., Kurapati, S. S., Tang, O. Y., & Scott, I. U. (2023). \nComparison of GPT -3.5, GPT -4, and human user pe rformance on a \npractice ophthalmology written examination. Eye. \nhttps://doi.org/10.1038/s41433-023-02564-2 \nMaslov, I., Nikou, S., & Hansen, P. (2021). Exploring user experience of \nlearning management system. The International Journal of Information \nand Learning Technology , 38(4), 344 –363. \nhttps://doi.org/10.1108/IJILT-03-2021-0046 \nMellieon, Jr, H. I., & Robinson, P. A. (2021). The New norm: Faculty \nPerceptions of condensed online learning. American Journal of Distance \nEducation, 35(3), 170 –183. \nhttps://doi.org/10.1080/08923647.2020.1847626 \nMisra, D. P., & Chandwar, K. (2023). ChatGPT, artificial intelligence and \nscientific writing: What authors, peer reviewers and editors should \nknow. Journal of the Royal College of Physicians of Edinburgh, 53(2), 90–\n93. https://doi.org/10.1177/14782715231181023 \nMontenegro-Rueda, M., Luque -de La Rosa, A., Sarasola Sánchez -\nSerrano, J. L., & Fernández -Cerero, J. (2021). Assessment in higher \neducation during the Covıd -19 pandemic: A systematic review. \nSustainability, 13(19), 10509. https://doi.org/10.3390/su131910509 \nNaidu, K., & Sevnarayan, K. (2023). ChatGPT: An ever -increasing \nencroachment of artificial intelligence in online assessment in distance \neducation. Online Journal of Co mmunication and Media Technologies , \n13(3), e202336. https://doi.org/10.30935/ojcmt/13291 \nNewton, P. M., & Xiromeriti, M. (2023). ChatGPT Performance on MCQ \nExams in Higher Education. A Pragmatic Scoping Review [Preprint]. \nhttps://doi.org/10.35542/osf.io/sytu3 \nNguyen, X.-A., Nguyen, S.-N., Nguyen, T.-T.-T., Luong, D.-H., & Tran, T.-\nG. (2022). Exploring Some academic dishonesty in remote online exams \nof vietnamese high school students in context of the Covid -19 \npandemic. Asian Journal of Education and Social Studies , 13 –26. \nhttps://doi.org/10.9734/ajess/2022/v33i130782 \nNieuwoudt, J. E. (2020). Investigating synchronous and asynchronous \nclass attendance as predictors of academic success in online education. \nAustralasian Journal of Educational Technology , 36(3), 15 –25. \nhttps://doi.org/10.14742/ajet.5137 \nNoorbehbahani, F., Mohammadi, A., & Aminazadeh, M. (2022). A \nsystematic review of research on cheating in online exams from 2010 \nto 2021. Education and Information Technologies , 27(6), 8413 –8460. \nhttps://doi.org/10.1007/s10639-022-10927-7 \nOravec, J. A. (2023). Artificial intelligence implications for academic \ncheating: expanding the dimensions of responsible human -AI \ncollaboration with Chatgp t and Bard. Jl. of Interactive Learning \nResearch, 34(2). \nPaul, R. (2005). The state of critical thinking today. New Directions for \nCommunity Colleges , 2005(130), 27 –38. \nhttps://doi.org/10.1002/cc.193 \nPaul, R., & Elder, L. (2013). Critical thinking: Intellectual standards \nessential to reasoning well within every domain of human thought, Part \nTwo. Journal of Developmental Ed Ucation, 37(1). \nPerera, P., & Lankathilaka, M. (2023). AI in higher education: A literature \nreview of chatgpt and guidelines for responsible implementation. \nInternational Journal of Research and Innovation in Social Science , \nVII(VI), 306–314. https://doi.org/10.47772/IJRISS.2023.7623 \nPérez, J. Q., Daradoumis, T., & Puig, J. M. M. (2020). Rediscovering the \nuse of chatbots in education: A systematic literature review. Computer \nApplications in Engineering E ducation, 28(6), 1549 –1565. \nhttps://doi.org/10.1002/cae.22326 \nPetrolo, D., Fakhar Manesh, M., & Palumbo, R. (2023). Unpacking \nbusiness, management, and entrepreneurship education online: \nInsights from a hyb rid literature review. The International Journal of \nManagement Education , 21(2), 100812. \nhttps://doi.org/10.1016/j.ijme.2023.100812 \nPutra, F. W., Rangka, I. B., Aminah, S., & Aditama, M. H. R. (202 3). \nChatGPT in the higher education environment: Perspectives from the \ntheory of high order thinking skills. Journal of Public Health . \nhttps://doi.org/10.1093/pubmed/fdad120 \nRahm, L. (2023). Educationa l imaginaries: Governance at the \nintersection of technology and education. Journal of Education Policy , \n38(1), 46–68. https://doi.org/10.1080/02680939.2021.1970233 \nSkavronskaya, L., Hadinejad, A. (Hana), & Cotterell, D. (2023). Reversing \nthe threat of artificial intelligence to opportunity: A discussion of \nChatGPT in tourism education. Journal of Teaching in Travel & Tourism, \n23(2), 253–258. https://doi.org/10.1080/15313220.2023.2196658 \nSmutny, P., & Schreiberova, P. (2020). Chatbots for learning: A review \nof educational chatbots for the Facebook Messenger. Computers & \nEducation, 151, 103862. \nhttps://doi.org/10.1016/j.compedu.2020.103862 \nSusnjak, T. (2022). ChatGPT: The End of Online Exam Integrity? . \nhttp://arxiv.org/abs/2212.09292 \nSwiecki, Z., Khosravi, H., Chen, G., Martinez-Maldonado, R., Lodge, J. M., \nMilligan, S., Selwyn, N., & Gašević, D. (2022). Assessment in the age of \nÜlkü, A. (2023). Tourism & Management Studies, 19(4), 2023, 21-34 \n34 \n \nartificial intelligence. Computers and Education: Artificial Intelligence, 3, \n100075. https://doi.org/10.1016/j.caeai.2022.100075 \nTsai, M.-L., Ong, C. W., & Chen, C. -L. (2023). Exploring the use of large \nlanguage models (LLMs) in chemical engineering education: Building \ncore course problem models with Chat -GPT. Education for Chemical \nEngineers, 44, 71–95. https://doi.org/10.1016/j.ece.2023.05.001 \nVentayen, R. J. M. (2023). ChatGPT by OpenAI: Students’ viewpoint on \ncheating using Artificial Intelligence-Based application. SSRN Electronic \nJournal. https://doi.org/10.2139/ssrn.4361548 \nVon Grunigen, D., De Azevedo E Souza, F. B., Pradarelli, B., Magid, A., & \nCieliebak, M. (2018). Best practices in e -assessments with a special \nfocus on cheating prevention. 2018 IEEE Global Engineering Education \nConference (EDUCON) , 893 –899. \nhttps://doi.org/10.1109/EDUCON.2018.8363325 \nWagner, G., Lukyanenko, R., & Paré, G. (2022). Artificial intelligence and \nthe conduct of literature reviews. Journal of Information Technology , \n37(2), 209–226. https://doi.org/10.1177/02683962211048201 \nWatson, G. R., & Sottile, J. (2010). Cheating in the digital age: do \nstudents cheat more in online courses?  \nhttps://mds.marshall.edu/cgi/viewcontent.cgi?article=1000&context=\neft_faculty \nWiley. (2020). White paper: Academic integrity in the age of online \nlearning. https://www.wiley.com/en-\nus/network/education/instructors/teaching-strategies/academic-\nintegrity-in-the-age-of-online-learning-3 \nXie, X., Siau, K., & Nah, F. F. -H. (2020). COVID-19 pandemic – online \neducation in the new normal and the next norm al. Journal of \nInformation Technology Case and Application Research, 22(3), 175–187. \nhttps://doi.org/10.1080/15228053.2020.1824884 \nYau, C., & Chan, K. (2023, February 17). University of Hong Kon g \ntemporarily bans students from using ChatGPT, other AI-based tools for \ncoursework. https://www.scmp.com/news/hong-\nkong/education/article/3210650/university-hong-kong-temporarily-\nbans-students-using-chatgpt-other-ai-based-tools-coursework \nYorkovsky, Y., & Levenberg, I. (2022). Distance learning in science and \nmathematics—Advantages and d isadvantages based on pre -service \nteachers’ experience. Teaching and Teacher Education , 120, 103883. \nhttps://doi.org/10.1016/j.tate.2022.103883 \nZaitsu, W., & Jin, M. (2023). Distinguishing ChatGPT(-3.5, -4)-generated \nand human -written papers through Japanese stylometric analysis. \nhttps://arxiv.org/abs/2306.01761 \n \n \n ",
  "topic": "Tourism",
  "concepts": [
    {
      "name": "Tourism",
      "score": 0.8071508407592773
    },
    {
      "name": "Cheating",
      "score": 0.7535006403923035
    },
    {
      "name": "Critical thinking",
      "score": 0.614672064781189
    },
    {
      "name": "Competence (human resources)",
      "score": 0.5889059901237488
    },
    {
      "name": "Psychology",
      "score": 0.40637025237083435
    },
    {
      "name": "Sociology",
      "score": 0.3665999472141266
    },
    {
      "name": "Pedagogy",
      "score": 0.3639453053474426
    },
    {
      "name": "Engineering ethics",
      "score": 0.3442038297653198
    },
    {
      "name": "Political science",
      "score": 0.32908910512924194
    },
    {
      "name": "Social psychology",
      "score": 0.1684514284133911
    },
    {
      "name": "Engineering",
      "score": 0.12770918011665344
    },
    {
      "name": "Law",
      "score": 0.08502310514450073
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I80538482",
      "name": "Harran University",
      "country": "TR"
    }
  ]
}