{
  "title": "Review of: \"Beyond Traditional Teaching: The Potential of Large Language Models and Chatbots in Graduate Engineering Education\"",
  "url": "https://openalex.org/W4387121289",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A5085187429",
      "name": "Yunjian Qiu",
      "affiliations": [
        "Southern California University for Professional Studies",
        "University of Southern California"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4387121289",
    "https://openalex.org/W4361860491"
  ],
  "abstract": "Potential competing interests: No potential competing",
  "full_text": "Review of: \"Beyond Traditional Teaching: The Potential of\nLarge Language Models and Chatbots in Graduate\nEngineering Education\"\nYunjian Qiu\n1\n1\n University of Southern California\nPotential competing interests:\n No potential competing interests to declare.\nThis paper delves into the potential applications of Large Language Models (LLMs), with a particular emphasis on\nChatGPT, in the realm of engineering education. The following strengths and weaknesses have been identified upon\nreview of this paper:\nStrengths:\n1\n. \nThe paper offers a thorough introduction to the evolution of chatbots and their subsequent applications in the\neducational sector.\n2\n. \nThe article showcases specific examples, encompassing both Input/Output (I/O) and CoT prompting, elucidating how\nChatGPT addresses diverse challenges in the engineering domain.\n3\n. \nThe paper delves deep into both the advantages and challenges associated with the implementation of ChatGPT in\neducational settings.\nWeaknesses:\n1\n. \n The paper falls short in delineating its major contributions to the existing body of knowledge.\n2\n. \nThere is a lack of clarity regarding the motivations behind undertaking this research. The paper could benefit from\npinpointing its unique position in the broader research landscape.\n3\n. \nThe paper provides an overview of pretraining and finetuning. However, it misses out on the nuances of in-context\nlearning, especially as seen in LLMs like GPT-3. And the section dedicated to LLMs needs further enhancement.\nInstead of a broad overview, a more detailed exposition of various LLMs would add value.\n4\n. \n While the paper underscores the potential of chatbots in engineering education, it predominantly focuses on\nChatGPT's capability to handle domain-specific queries. There is an absence of a deeper exploration into the\npedagogical aspects, such as the dynamics of chatbot-student interactions and the broader implications of integrating\nchatbots into the educational ecosystem.\nWhile the paper provides valuable insights into the applications of ChatGPT in engineering education, there are areas that\nrequire further refinement and elaboration. Addressing the identified weaknesses will undoubtedly elevate the quality and\nimpact of the research.\nQeios, CC-BY 4.0   路   Review, \nSeptember 29, 2023\nQeios ID: 9JIA39   路   https://doi.org/10.32388/9JIA39\n1\n/\n2\nQeios, CC-BY 4.0   路   Review, \nSeptember 29, 2023\nQeios ID: 9JIA39   路   https://doi.org/10.32388/9JIA39\n2\n/\n2",
  "topic": "Computer science",
  "concepts": [
    {
      "name": "Computer science",
      "score": 0.514777660369873
    },
    {
      "name": "Mathematics education",
      "score": 0.5135291218757629
    },
    {
      "name": "Graduate education",
      "score": 0.45020005106925964
    },
    {
      "name": "Graduate students",
      "score": 0.44307181239128113
    },
    {
      "name": "Psychology",
      "score": 0.2761843204498291
    },
    {
      "name": "Pedagogy",
      "score": 0.22490882873535156
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I2800817003",
      "name": "Southern California University for Professional Studies",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I1174212",
      "name": "University of Southern California",
      "country": "US"
    }
  ]
}