{
  "title": "Innovations in surgical training: exploring the role of artificial intelligence and large language models (LLM)",
  "url": "https://openalex.org/W4386179007",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A2152751212",
      "name": "Julián Varas",
      "affiliations": [
        "Pontificia Universidad Católica de Chile"
      ]
    },
    {
      "id": "https://openalex.org/A4367461834",
      "name": "Brandon Valencia-Coronel",
      "affiliations": [
        "Pontificia Universidad Católica de Chile"
      ]
    },
    {
      "id": "https://openalex.org/A345524638",
      "name": "Ignacio Villagran",
      "affiliations": [
        "Pontificia Universidad Católica de Chile"
      ]
    },
    {
      "id": "https://openalex.org/A2243455794",
      "name": "Gabriel Escalona",
      "affiliations": [
        "Pontificia Universidad Católica de Chile"
      ]
    },
    {
      "id": "https://openalex.org/A2110776178",
      "name": "Rocío Hernández",
      "affiliations": [
        "Pontificia Universidad Católica de Chile"
      ]
    },
    {
      "id": "https://openalex.org/A3145572758",
      "name": "Gregory Schuit",
      "affiliations": [
        "Pontificia Universidad Católica de Chile"
      ]
    },
    {
      "id": "https://openalex.org/A2304122293",
      "name": "Valentina Duran",
      "affiliations": [
        "Pontificia Universidad Católica de Chile"
      ]
    },
    {
      "id": "https://openalex.org/A4317583447",
      "name": "Antonia Lagos-Villaseca",
      "affiliations": [
        "Pontificia Universidad Católica de Chile"
      ]
    },
    {
      "id": "https://openalex.org/A2966156931",
      "name": "Cristián Jarry",
      "affiliations": [
        "Pontificia Universidad Católica de Chile"
      ]
    },
    {
      "id": "https://openalex.org/A2188257455",
      "name": "Andres Neyem",
      "affiliations": [
        "Pontificia Universidad Católica de Chile"
      ]
    },
    {
      "id": "https://openalex.org/A548588210",
      "name": "Pablo Achurra",
      "affiliations": [
        "Pontificia Universidad Católica de Chile"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4206750216",
    "https://openalex.org/W4214867253",
    "https://openalex.org/W2942623736",
    "https://openalex.org/W2085487772",
    "https://openalex.org/W2132115381",
    "https://openalex.org/W4280557200",
    "https://openalex.org/W3179325635",
    "https://openalex.org/W3007803772",
    "https://openalex.org/W4200122460",
    "https://openalex.org/W4311329155",
    "https://openalex.org/W1663984431",
    "https://openalex.org/W2008519615",
    "https://openalex.org/W2345630829",
    "https://openalex.org/W4300773258",
    "https://openalex.org/W2790209545",
    "https://openalex.org/W3193396633",
    "https://openalex.org/W3212407416",
    "https://openalex.org/W2266464013",
    "https://openalex.org/W4283723775",
    "https://openalex.org/W2944289235",
    "https://openalex.org/W4322504347",
    "https://openalex.org/W3153493693",
    "https://openalex.org/W3157626300",
    "https://openalex.org/W4376132115",
    "https://openalex.org/W4319318125",
    "https://openalex.org/W3177350052",
    "https://openalex.org/W1503398984",
    "https://openalex.org/W2142383816"
  ],
  "abstract": "ABSTRACT The landscape of surgical training is rapidly evolving with the advent of artificial intelligence (AI) and its integration into education and simulation. This manuscript aims to explore the potential applications and benefits of AI-assisted surgical training, particularly the use of large language models (LLMs), in enhancing communication, personalizing feedback, and promoting skill development. We discuss the advancements in simulation-based training, AI-driven assessment tools, video-based assessment systems, virtual reality (VR) and augmented reality (AR) platforms, and the potential role of LLMs in the transcription, translation, and summarization of feedback. Despite the promising opportunities presented by AI integration, several challenges must be addressed, including accuracy and reliability, ethical and privacy concerns, bias in AI models, integration with existing training systems, and training and adoption of AI-assisted tools. By proactively addressing these challenges and harnessing the potential of AI, the future of surgical training may be reshaped to provide a more comprehensive, safe, and effective learning experience for trainees, ultimately leading to better patient outcomes. .",
  "full_text": "Rev Col Bras Cir 50:e20233605\nDOI: 10.1590/0100-6991e-20233605-en\nInnovations in surgical training: exploring the role of artificial \nintelligence and large language models (LLM)\nInovações no treinamento cirúrgico: explorando o papel da inteligência artificial \ne dos grandes modelos de linguagem (LLM)\n INTRODUCTION\nS\nurgical training has traditionally followed the \napprenticeship model, in which trainees learn from \nmentors by observing and assisting experienced surgeons \nin the operating room 1. This approach, though valuable, \nis not without limitations. As surgical procedures have \nbecome increasingly complex and specialized, the need \nfor more structured and standardized training methods \nhas grown 2,3. Concerns about patient safety and the \nneed to objectively evaluate trainees’ performance \nhave prompted the search for innovative and reliable \ntraining modalities 4,5. The rise of Artificial Intelligence \nassisted education and simulation has become a \nrelevant component in surgical training, enabling a more \ncomprehensive, safe, and efficient learning experience for \ntrainees6-10.\nArtificial intelligence (AI) is a multidisciplinary \nfield of computer science focused on creating intelligent \nagents capable of performing tasks that typically require \nhuman-like cognition 11. AI systems employ techniques \nsuch as machine learning, deep learning, natural language \nprocessing, computer vision, and expert systems to \nperceive, reason, learn, and adapt to new information 11. \nMachine learning enables computers to learn from \ndata and make predictions or decisions without explicit \nprogramming, while deep learning uses artificial neural \nnetworks for sophisticated pattern recognition 12. Natural \n1 - Pontificia Universidad Católica de Chile, Experimental Surgery and Simulation Center, Department of Digestive Surgery - Santiago - Región Metropo-\nlitana - Chile 2 - Pontificia Universidad Católica de Chile, Carrera de Kinesiología, Departamento de Ciencias de la Salud, Facultad de Medicina - Santiago \n- Región Metropolitana - Chile 3 - Pontificia Universidad Católica de Chile, Computer Science Department, School of Engineering - Santiago - Región \nMetropolitana - Chile 4 - Pontificia Universidad Católica de Chile, Department of Otolaryngology - Santiago – Región Metropolitana - Chile\nJulian Varas1 \n ; Brandon Valencia coronel1 \n ; ignacio Villagrán2 \n ; gaBriel escalona1 \n ; rocio Hernandez3 \n ; gregory \nscHuit3 \n ; Valentina durán1 \n ; antonia lagos-Villaseca4 \n ;  cristian Jarry1\n ; andres neyem3 \n ; PaBlo acHurra1 \n .\nABSTRACTABSTRACT\nThe landscape of surgical training is rapidly evolving with the advent of artificial intelligence (AI) and its integration into education and \nsimulation. This manuscript aims to explore the potential applications and benefits of AI-assisted surgical training, particularly the use \nof large language models (LLMs), in enhancing communication, personalizing feedback, and promoting skill development. We discuss \nthe advancements in simulation-based training, AI-driven assessment tools, video-based assessment systems, virtual reality (VR) and \naugmented reality (AR) platforms, and the potential role of LLMs in the transcription, translation, and summarization of feedback. \nDespite the promising opportunities presented by AI integration, several challenges must be addressed, including accuracy and reliability, \nethical and privacy concerns, bias in AI models, integration with existing training systems, and training and adoption of AI-assisted tools. \nBy proactively addressing these challenges and harnessing the potential of AI, the future of surgical training may be reshaped to provide \na more comprehensive, safe, and effective learning experience for trainees, ultimately leading to better patient outcomes. . \nKeywords: Artificial Intelligence. Education, Medical. Learning Curve.\nEducation\n2\nRev Col Bras Cir 50:e20233605\nVaras\nInnovations in surgical training: exploring the role of artificial intelligence and large language models (LLM)\nenvironment where trainees can practice their skills \nbefore applying them in the operating room 15,16. AI has \nsignificantly expanded the potential of simulation-based \ntraining in various ways 17. One of the key advancements \nis the ability to provide personalized feedback to surgical \ntrainees6. By analyzing performance metrics and identifying \nareas of improvement, AI-powered systems can tailor \nfeedback to individual subjects, addressing their unique \nstrengths and weaknesses 18. This customized approach to \nfeedback not only enhances the learning process but also \nenables trainees to focus on specific areas that require \nfurther development.\nIn addition to personalized feedback, AI is \nrevolutionizing the assessment processes in surgical \ntraining. Traditional methods often rely on subjective \nevaluations by human observers, which can be prone to \nbias and inconsistency 15,19. AI-driven assessment tools, \non the other hand, can objectively measure surgical \nperformance by analyzing various data sources, such as \nmotion tracking, force measurements, historic feedback \ninputs, and video recordings 20,21. Some of these tools can \nprovide real-time feedback and generate standardized \nperformance scores, thus ensuring a more consistent and \nreliable evaluation of trainee progress 7,18.\nMoreover, AI has facilitated the rise of video-\nbased surgical assessment systems that leverage computer \nvision and machine learning techniques to analyze surgical \nvideos and extract valuable insights 7. These systems offer \ndata-driven feedback and objective evaluations, enabling \ntrainees and experienced surgeons to identify areas for \nimprovement and learn from best practices 22,23 (Table 1). \nlanguage processing allows AI systems to understand \nand generate human-like text or speech, and computer \nvision deals with the analysis and interpretation of visual \ninformation13. Expert systems involve rule-based decision-\nmaking based on predefined knowledge bases 14. By \nintegrating these diverse AI methodologies, researchers \ncan develop intelligent agents to tackle complex problems \nand transform various aspects of human life, including \nsurgical training and education.\nWhile there have been significant advancements \nin AI-assisted surgical training, the specific use of LLMs \nin facilitating communication and information processing \nwithin surgical training environments has been relatively \nunderstudied. Effective communication is a crucial aspect \nof surgical training, and leveraging LLMs to transcribe and \ntranslate feedback inputs from trainers to trainees can \ngreatly improve the learning experience and outcomes. \nThe paper aims to highlight the potential of LLMs \nin addressing this communication gap and explores their \napplications in transcription, translation, summarization \nof feedback data, and providing real-time corrections \nand recommendations to instructors. By addressing this \ngap, the paper contributes to the understanding of how \nLLMs can enhance surgical education and bridge the \ncommunication divide between trainers and trainees.\nAI-driven assessment and feedback\nSimulation-based training, in particular, \nhas proven to be a powerful adjunct to a traditional \napprenticeship. It offers a controlled and risk-free \nTable 1. AI-enhanced Video-Based Surgical Assessment and Training Systems.\nSystem Description\nTheator\nA video-based surgical assessment platform that uses AI and computer vision technology to \nanalyze surgical videos. Provides data-driven insights by annotating critical moments and key \nsteps during procedures, enabling surgeons and trainees to review their performance, identify \nareas for improvement, and learn from best practices. Compares individual surgeon performance \nagainst established benchmarks, allowing for objective assessments and personalized feedback.\nCSATS \n(Johnson & \nJohnson)\nA surgical video review and assessment platform that leverages AI and data analytics to evaluate \nsurgical performance. Provides objective feedback and recommendations based on expert peer \nreviews and data-driven insights. Offers educational content, such as lectures and case studies, to \nhelp surgeons improve their skills and techniques. CSATS encompasses a broad range of surgical \nspecialties, including general surgery, orthopedics, and urology.\n3\nRev Col Bras Cir 50:e20233605\nVaras\nInnovations in surgical training: exploring the role of artificial intelligence and large language models (LLM)\nAI-assisted predicting of performance and skill \ndevelopment\nAnother promising application of AI in surgical \ntraining is the prediction of trainees’ surgical performance \nand skill development. By utilizing machine learning \nalgorithms, AI systems can analyze historical performance \ndata and identify patterns that can be used to predict future \nperformance and technique progression 18. This predictive \ncapability can help trainers identify trainees in need of \nadditional support, as well as optimize training curricula \nbased on individual learning trajectories. Now that learning \nis moving from fixed training curriculums to competency-\nbased curriculums, AI provides a more objective and less \ntime-consuming assessment of trainees’ learning curves.\nAI and immersive technologies\nAI is playing a major role in the advancement \nof virtual reality (VR) and augmented reality (AR) \nsystems, especially in the field of surgical training. These \nimmersive technologies offer realistic and interactive \ntraining scenarios that can closely resemble real-life \nsurgical procedures 24-26. AI algorithms can be employed \nto generate complex, dynamic environments and unique \npatient-based anatomical models, allowing trainees to \npractice various surgical techniques and approaches in a \ncontrolled and safe setting. Additionally, AI can facilitate \nreal-time adaptation of the VR and AR scenarios based \non the trainee’s performance, ensuring a more engaging \nand effective learning experience25. Video-based feedback \nand evaluation are scaling fast with the help of AI. Video-\nrecorded practices are now automatically assessed by \nAI algorithms, and “copilot-like” recommendations for \ninstructors when providing feedback to trainees are now \npossible17,25 (Table 2).\nLarge Language Models in surgical education\nLarge language models (LLMs), a subset of \ngenerative AI models, have gained significant attention \nin recent years due to their ability to generate human-like \ntext based on input data. These models are trained on \nvast amounts of text from diverse sources, enabling them \nto understand and generate contextually appropriate \nresponses in various languages and domains 27. Examples \nof LLMs include OpenAI’s GPT-3 and the recently \nlaunched GPT-4. Despite the numerous advances in AI-\nassisted surgical training, there is still a notable gap in \nthe literature regarding applying large language models \n(LLMs) to surgical education, for instance, in facilitating \nthe transcription and translation of feedback inputs \nfrom trainers to trainees in simulated and video-based \nassessment environments. This gap is significant because \neffective communication is a critical aspect of surgical \ntraining, and addressing it could lead to considerable \nimprovements in the learning experience and outcomes \nfor trainees28,29.\nSystem Description\nSurgical AI\nA cloud-based platform that uses AI to analyze surgical videos and extract relevant data for per-\nformance assessment and improvement. Offers real-time feedback, detailed performance reports, \nand recommendations for best practices. Supports a wide range of surgical procedures and \nspecialties. It can be integrated with existing video recording systems in operating rooms, making \nit easily accessible for surgical teams.\nTouch Surgery\nA mobile app that provides AI-driven interactive surgical simulations and can also be used to \nanalyze surgical videos for performance assessment and improvement. Offers real-time feedback \nand performance tracking. Covers a wide range of surgical procedures across various specialties. \nAllows trainees to practice their skills, test their knowledge, and track their progress over time.\n4\nRev Col Bras Cir 50:e20233605\nVaras\nInnovations in surgical training: exploring the role of artificial intelligence and large language models (LLM)\nLLMs have demonstrated remarkable \ncapabilities in understanding and generating human-\nlike text, making them well-suited for tasks related \nto communication and information processing 27. \nIn surgical training, LLMs could be employed to \nautomatically transcribe spoken feedback provided by \ntrainers during simulations or video-based assessments. \nThis transcription could be used to create a written \nrecord of the feedback, allowing trainees to review and \nreflect on the suggestions and guidance received.\nLLMs could also be utilized to translate \nfeedback into different languages even in real time, \nthus overcoming potential language barriers between \ntrainers and trainees. With surgical training programs \nincreasingly attracting students from different \ncountries, language gaps can be a significant challenge \nto effective communication. By leveraging LLMs to \nprovide real-time or asynchronous translation, trainers \nand trainees could communicate more effectively, \nensuring that valuable feedback is accurately conveyed \nand understood 30. \nAnother potential application of LLMs in \nsurgical training is the extraction and summarization \nof key insights from large volumes of feedback data 31. \nBy analyzing feedback from multiple trainers or across \nnumerous training instances, LLMs could identify \nrecurring themes or patterns and provide students with \nconcise, actionable summaries. This approach could \nhelp trainees to prioritize their learning objectives and \nfocus on the most critical areas for improvement.\nSimilarly, LLM systems have the potential \nto improve instructors’ performance by providing \nreal-time corrections and feedback, helping them \nmeet minimum parameters and gradually improving \ntheir communication skills with trainees. The best \nclinician expert is not always the best at teaching \nand communicating learning experiences. However, \nsemantic feedback from an automatic artificial \nTable 2. Comparison of some AI-Driven Surgical Simulation Training Systems.\nSystem Description\nTouch Surgery\nProvides interactive surgical simulations using AI algorithms to analyze users' performance and \nprovide real-time feedback. Covers a wide range of surgical procedures across various specialties, \nallowing trainees to practice their skills, test their knowledge, and track their progress over time.\nOsso VR\nA virtual reality (VR) surgical training platform that employs AI to deliver realistic and immersive \nsimulations for various surgical procedures. Offers real-time performance metrics, personalized \nfeedback, and objective assessments, enabling trainees to hone their skills in a controlled and \nrisk-free environment.\nMimic \nTechnologies\nOffers the Da Vinci Skills Simulator, a simulation platform designed for robotic surgery training. \nUses AI-powered algorithms to analyze users' performance and provide objective feedback based \non multiple performance metrics and focusing on different aspects of robotic surgery, including \ndexterity, precision, and efficiency.\nSurgical \nScience\nProvides simulation training solutions, including the LapSim and EndoSim systems, designed for \nlaparoscopic and endoscopic surgery training, respectively. Utilizes AI algorithms to offer real-time \nfeedback, objective assessments, and performance tracking, helping trainees develop their skills \nand competencies in a safe and controlled setting.\nLapp \nSimulation \nTraining\nUses AI to understand when trainees commit mistakes during training and recommends which \ntype of feedback inputs instructors should provide asynchronously. Aims to enhance the learning \nprocess by offering targeted feedback based on individual-trainee performance and needs.\n5\nRev Col Bras Cir 50:e20233605\nVaras\nInnovations in surgical training: exploring the role of artificial intelligence and large language models (LLM)\nintelligence system may help the sender notice areas \nfor improvement in their teaching abilities.\nLLMs challenges in surgical training\nIntegrating large language models (LLMs) into \nsurgical training comes with various challenges, including \nensuring the accuracy and reliability of LLM-generated \ntranscriptions and translations, addressing ethical and \nprivacy concerns, and handling potential biases in the AI \nmodels. Below, we explore these challenges in greater \ndetail:\n• Accuracy and reliability: LLM-generated \ntranscriptions and translations must \nbe accurate and reliable to avoid \nmisunderstandings or misinterpretations \nthat could negatively impact the learning \nprocess. Inaccurate transcriptions might \ncause trainees to miss crucial feedback or \nmake incorrect decisions based on flawed \ninformation. Ensuring the quality of LLM-\ngenerated content requires continuous \nmonitoring, validation, and improvement \nof the models to minimize errors and \nmaximize the value of the AI-generated \noutputs.\n• Ethical and privacy concerns: The use \nof AI-generated feedback in surgical \ntraining may raise ethical and privacy \nconcerns, particularly when sensitive \npatient information is involved. Ensuring \ncompliance with data protection \nregulations, such as the Health Insurance \nPortability and Accountability Act (HIPAA) \nin the United States or the General Data \nProtection Regulation (GDPR) in the \nEuropean Union, is essential. Implementing \ndata anonymization techniques, secure \nstorage and transmission protocols, \nand access controls can help protect \nsensitive information and maintain patient \nconfidentiality.\n• Bias in AI models: AI algorithms, including \nLLMs, can inadvertently propagate biases \npresent in the training data. These biases \nmay manifest in the form of gender, racial, \nor cultural stereotypes, potentially leading \nto unfair or discriminatory feedback. To \naddress this issue, it is essential to develop \ntransparent and fair AI models by using \ndiverse and representative training data, \napplying bias-mitigation techniques, and \nrigorously testing the algorithms to identify \nand correct potential biases.\n• Integration with existing training systems: \nIntegrating LLMs into surgical training \nmay require substantial modifications to \nexisting training platforms and workflows. \nThis process can be complex and time-\nconsuming, requiring close collaboration \nbetween developers, trainers, and \ntrainees to ensure seamless integration \nand minimize disruptions to the training \nprocess.\n• Training and adoption: The successful \nimplementation of LLMs in surgical training \nrequires trainers, trainees, and their \ninstitutions to adapt to new technology \nand its workflows. This may involve \nproviding additional training to familiarize \nusers with the AI tools and addressing any \nresistance to change. Ensuring user buy-in \nis crucial for the effective adoption and use \nof LLMs in surgical training environments.\n• Cost and Talent: Implementing artificial \nintelligence in surgical training necessitates \nsubstantial financial investment and \nspecialized human expertise. To embark \non an AI project may entail considerable \nexpenses, making it challenging to \nconduct a proper cost-benefit assessment \ninitially. Nonetheless, major companies \nhave significantly invested in developing \nalgorithms that can be tailored to specific \ndomains, thereby enhancing their \npotential. Although the initial costs of \nthese services may be high, as is typically \nthe case with technological evolution, \nthese are expected to decrease over time. \nAt present, the cost and infrastructure \n6\nRev Col Bras Cir 50:e20233605\nVaras\nInnovations in surgical training: exploring the role of artificial intelligence and large language models (LLM)\nneeded to incorporate AI into surgical \ntraining continue to pose significant \nchallenges.\nAddressing these challenges is essential to \nharness the full potential of LLMs in surgical training \nand ensure their successful integration into training \nprograms and educational institutions. By proactively \nidentifying and addressing these challenges, it is \npossible to develop effective AI-assisted surgical training \nsolutions that may improve communication, enhance \nthe learning experience, and ultimately contribute to \nbetter patient outcomes.\n DISCUSSION AND CONCLUSION\nThe integration of AI into our society and \ndaily activities has begun progressively. As with other \ntechnologies, the surgical field has quickly adopted some \nof its benefits, and the complexity of surgical training \nhas made AI an interesting venture. We have presented \ntwo main ways in which AI-related technologies are \nbecoming part of the teaching experience.\nFirstly, AI-enhanced assessment methods are \nbeing used. Skill acquisition involves a trainer, a trainee, \nassessment tools, feedback delivery, and a training \ninstance. We have described some of the available tools \nor apps that can optimize the integration of these five \naspects of surgical training. Video-based platforms are \nshowing promising results, allowing not only AI-driven \nassessment (using various measurements) but also \nproviding relevant feedback based on previous and \ncontemporary data. On the other hand, LLM-based \ntechnologies address communication issues that are \ncritical for the learning process. Even when precise \nmetrics and formidable progress tracking are assured, \nfeedback and knowledge must be delivered correctly \nto make significant improvements in the trainee. LLMs \ncan help ensure that concepts are conveyed effectively, \nsuggest feedback to trainers, and help overcome \nlanguage barriers by translating in real-time.\nDespite the numerous benefits, implementing \nAI-based technologies and especially LLMs in surgical \ntraining poses significant challenges that can be \napproached from two perspectives. Firstly, from a \ntechnological standpoint, integrating AI-based tools \nand platforms into daily surgical education requires new \n“know-how,” and the integration of novel and “old” \nsystems may be disruptive, difficult, and expensive. \nCareful and gradual integration may reduce resistance \nto these innovative technologies, especially in more \nexperienced and traditional institutions. Secondly, \nfrom an educational perspective, concerns may arise \nregarding the reliability of “automatic” assessments, \nfeedback, and inputs. Regarding this topic, it is important \nto understand that AI is a probabilistic model used \nto analyze data, employing high-powered computer \ntechnology to organize information from many sources. \nCurrently, AI does not create new information in the \nstrict sense of the word, so many of its limitations \nand mistakes are attributable due to the low quality \nor insufficiency of its sources. Future research and \ndevelopment should aim to identify the best sources \nand provide filters to prevent inaccurate information \nfrom affecting the algorithm’s outcomes. It is our \nresponsibility to develop and apply safety measures to \ntrack interactions and identify any issues that may lead \nto misunderstandings or negatively impact the learning \nexperience. Ensuring data protection, reducing bias, \nand testing the real educational impact of AI-driven \ntools are other significant challenges that we will face \nin adopting these technologies. \nIn addition to the technical considerations, it \nis essential to highlight the ethical and legal challenges \nassociated with the use of AI and LLMs in surgical \npractice.\nFrom an ethical perspective, AI and LLMs in \nsurgery raise several concerns. The first one pertains \nto patient autonomy and informed consent. It’s crucial \nto ensure that patients thoroughly understand the \nnature and extent of AI and LLM involvement in their \ntreatment. Given the complexity of these technologies, \nconveying this information in a way that a layperson \ncan understand is challenging.\nThe second ethical concern relates to \naccountability. In instances where AI or an LLM might \nmake a mistake or provide suboptimal advice, it’s not \nimmediately clear who would be held responsible - \nthe developers, the medical practitioners relying on \nthe technology, or the institutions adopting it. This \nambiguity could lead to ethical dilemmas in practice.\n7\nRev Col Bras Cir 50:e20233605\nVaras\nInnovations in surgical training: exploring the role of artificial intelligence and large language models (LLM)\nThirdly, there is the question of bias and \nfairness. AI and LLMs are trained on vast datasets and \ncan inadvertently perpetuate existing biases in these \ndata, leading to unequal treatment outcomes. For \ninstance, if the training data are skewed towards a \nparticular demographic, the AI might be less effective \nwhen applied to patients from underrepresented \ndemographics.\nTurning to the legal challenges, the application \nof AI and LLMs in surgical practice sits at the intersection \nof several legal domains, including data protection, \nintellectual property rights, and medical malpractice. AI’s \nability to process large amounts of patient data raises \nquestions about data privacy and security. Furthermore, \nwho owns the intellectual property rights to AI and LLM-\nassisted surgical techniques or inventions? This is an area \nof law that is still evolving and has yet to catch up with \nthe rapid advancements in AI technology.\nIn the event of an adverse outcome, the legal \nliability is also a grey area. If an error occurs due to the \nadvice or assistance of an AI or LLM, traditional medical \nmalpractice doctrines may not apply. The use of AI \ncould blur the lines of responsibility, making it difficult \nto determine who is at fault.\nAlthough the potential benefits of AI and \nLLMs in surgical training are significant, it is important \nto recognize and discuss inherent limitations of these \ntechnologies. First, AI and LLMs are dependent on the \ndata they are trained on. If the data is incomplete, \nbiased, or not representative of the range of cases a \nsurgeon might encounter, the training and advice given \nmay be suboptimal. Additionally, these technologies \nmay lack the nuanced understanding of a human trainer, \nwho can interpret complex visual cues and adapt to the \ntrainee’s individual learning style in a way that AI and \nLLMs currently cannot.\nAnother limitation is the risk of over-reliance \non technology. Surgical trainees might rely too heavily \non AI and LLMs, which could impair the development of \ntheir independent decision-making skills. Furthermore, \nthe high costs associated with the development \nand implementation of AI and LLMs may make \nthese technologies inaccessible to some institutions, \nexacerbating existing inequities in surgical training.\nLooking to the future, several exciting research \ndirections are emerging. We need rigorous studies \nevaluating the impact of AI and LLMs on long-term surgical \nperformance and patient outcomes, which can help \nvalidate the effectiveness of these technologies. Novel \napproaches could also be explored, such as integrating \nAI and LLMs with virtual or augmented reality to create \nimmersive surgical training experiences. Furthermore, \nresearch should address the aforementioned limitations. \nFor example, studies could investigate how to effectively \ncombine AI and human mentorship in surgical training, \nor how to make these technologies more accessible to a \nbroader range of institutions.\nAs a conclusion, as technology advances and \nAI becomes more integrated into the medical field, it is \ncrucial to address the various challenges and limitations \nassociated with AI technology while exploring new \napplications and opportunities in surgical education. By \nembracing the transformative power of AI, the future \nof surgical training can be reshaped to provide a more \ncomprehensive, safe, and effective learning experience \nfor trainees.\nO cenário do treinamento cirúrgico está evoluindo rapidamente com o surgimento da inteligência artificial (IA) e sua integração \nna educação e simulação. Este artigo explora as aplicações e benefícios potenciais do treinamento cirúrgico assistido por IA, em \nparticular o uso de modelos de linguagem avançados (MLAs), para aprimorar a comunicação, personalizar o feedback e promover \no desenvolvimento de habilidades. Discutimos os avanços no treinamento baseado em simulação, ferramentas de avaliação \nimpulsionadas por IA, sistemas de avaliação baseados em vídeo, plataformas de realidade virtual (RV) e realidade aumentada (RA), \ne o papel potencial dos MLAs na transcrição, tradução e resumo do feedback. Apesar das oportunidades promissoras apresentadas \npela integração da IA, vários desafios devem ser abordados, incluindo precisão e confiabilidade, preocupações éticas e de privacidade, \nviés nos modelos de IA, integração com os sistemas de treinamento existentes, e treinamento e adoção de ferramentas assistidas por \nIA. Ao abordar proativamente esses desafios e aproveitar o potencial da IA, o futuro do treinamento cirúrgico pode ser remodelado \npara proporcionar uma experiência de aprendizado mais abrangente, segura e eficaz para os aprendizes, resultando em melhores \nresultados para os pacientes.\nPalavras-chave:  Inteligência Artificial. Educação Médica. Curva de Aprendizado.\nRESUMORESUMO\n8\nRev Col Bras Cir 50:e20233605\nVaras\nInnovations in surgical training: exploring the role of artificial intelligence and large language models (LLM)\n REFERENCES\n1. Halsted. The training of the surgeon. \nJAMA. 1904;XLIII(21):1553-4. doi:10.1001/\njama.1904.02500210043006.\n2.  Ortiz C, Vela J, Contreras C, Belmar F, Paul I, Zinco \nA, et al. A new approach for the acquisition of \ntrauma surgical skills: an OSCE type of simulation \ntraining program. Surg Endosc. 2022;36(11):8441–\n50. doi: 10.1007/s00464-022-09098-w.\n3.  Tejos R, Avila R, Inzunza M, Achurra P, Castillo R, \nRosberg A, et al. Impact of a simulated laparoscopic \ntraining program in a three-year General Surgery \nResidency. Arq Bras Cir Dig. 2019;32(2):e1436. \ndoi: 10.1590/0102-672020190001e1436.\n4.  Reznick RK, MacRae H. Teaching surgical \nskills--changes in the wind. N Engl J Med. \n2006;355(25):2664–9. doi: 10.1056/\nNEJMra054785.\n5.  Aggarwal R, Mytton OT, Derbrew M, Hananel D, \nHeydenburg M, Issenberg B, et al. Training and \nsimulation for patient safety. Qual Saf Health Care. \n2010;19 Suppl 2(Suppl 2):i34-43. doi: 10.1136/\nqshc.2009.038562.\n6.  Guerrero DT, Asaad M, Rajesh A, Hassan A, \nButler CE. Advancing Surgical Education: \nThe Use of Artificial Intelligence in Surgical \nTraining. Am Surg. 2023;89(1):49-54. doi: \n10.1177/00031348221101503.\n7.  Ward TM, Mascagni P, Madani A, Padoy N, \nPerretta S, Hashimoto DA. Surgical data science \nand artificial intelligence for surgical education. J \nSurg Oncol. 2021;124(2):221-30. doi: 10.1002/\njso.26496.\n8.  Mirchi N, Bissonnette V, Yilmaz R, Ledwos N, Winkler-\nSchwartz A, Maestro D. The Virtual Operative \nAssistant: An explainable artificial intelligence \ntool for simulation-based training in surgery and \nmedicine. PloS one. 2020;15(2):e0229596. doi: \n10.1371/journal.pone.0229596.\n9.  Bilgic E, Gorgy A, Young M, Abbasgholizadeh-\nRahimi S, Harley JM. Artificial intelligence in surgical \neducation: Considerations for interdisciplinary \ncollaborations. Surg Innov. 2022;29(2):137–8. doi: \n10.1177/15533506211059269.\n10.  Park JJ, Tiefenbach J, Demetriades AK. The role of \nartificial intelligence in surgical simulation. Front \nMed Technol. 2022;4:1076755. doi: 10.3389/\nfmedt.2022.1076755.\n11.  Goodfellow I, Bengio Y, Courville A. Deep learning. \nMIT Press; 2016.\n12.  Murphy KP. Machine Learning: A Probabilistic \nPerspective. MIT Press; 2012.\n13. Hirschberg J, Manning CD. Advances in \nnatural language processing. Science. \n2015;349(6245):261–6. doi: 10.1126/science.\naaa8685.\n14.  Jackson P. Introduction to Expert Systems. \nSingapore, Singapore: Addison Wesley Longman; \n1990.\n15.  Andersen DK. Fundamentals of surgical simulation: \nPrinciples and practices. JAMA. 2012;307(9):974. \ndoi: 10.1001/jama.2012.246.\n16.  Boza C, León F, Buckel E, Riquelme A, Crovari F, \nMartínez J, et al. Simulation-trained junior residents \nperform better than general surgeons on advanced \nlaparoscopic cases. Surg Endosc. 2017;31(1):135–\n41. doi: 10.1007/s00464-016-4942-6.\n17.  Belmar F, Gaete MI, Escalona G, Carnier M, \nDurán V, Villagrán I, et al. Artificial intelligence \nin laparoscopic simulation: a promising future for \nlarge-scale automated evaluations. Surg Endosc. \n2023;37(6):4942–6. doi: 10.1007/s00464-022-\n09576-1.\n18.  Hashimoto DA, Rosman G, Rus D, Meireles OR. \nArtificial intelligence in surgery: Promises and \nperils. Ann Surg. 2018;268(1):70–6. doi: 10.1097/\nSLA.0000000000002693.\n19.  Gumbs AA, Frigerio I, Spolverato G, Croner R, \nIllanes A, Chouillard E, et al. Artificial intelligence \nsurgery: How do we get to autonomous actions in \nsurgery? Sensors (Basel). 2021;21(16):5526. doi: \n10.3390/s21165526.\n20.  Ward TM, Mascagni P, Madani A, Padoy N, \nPerretta S, Hashimoto DA. Surgical data science \nand artificial intelligence for surgical education. J \nSurg Oncol. 2021;124(2):221–30. doi: 10.1002/\njso.26496.\n21.  Maier-Hein L, Eisenmann M, Sarikaya D, März K, \nCollins T, Malpani A, et al. Surgical data science \n9\nRev Col Bras Cir 50:e20233605\nVaras\nInnovations in surgical training: exploring the role of artificial intelligence and large language models (LLM)\nReceived in: 07/06/2023\nAccepted for publication: 14/07/2023\nConflict of interest: Dr. Julian Varas is the Founder of \nTraining Competence, an official spinoff startup from \nthe Pontificia Universidad Católica de Chile. Dr. Gabriel \nEscalona is the chief product officer of this startup. \nIgnacio Villagrán is a consultant for this startup. Training \nCompetence and the Pontificia Universidad Católica de \nChile are the proprietors of the rights and distribution of \nthe LAPP platform mentioned in this study.\nFunding source: The authors would like to acknowledge \nthe National Agency for Research and Development (ANID) \nunder the Scholarship Program DOCTORADO BECAS \nCHILE/2020 – 21202032, the National Center for Artificial \nIntelligence (CENIA), part of the Basal ANID funding \nFB210017 and Chilean Research Grants FONDECYT No \n1221490, 190616011 and 11201338.\nMailing address:\nJulian Varas\nE-mail: jevaras@uc.cl \n- from concepts toward clinical translation. Med \nImage Anal. 2022;76(102306):102306. doi: \n10.1016/j.media.2021.102306.\n22.  Twinanda AP, Shehata S, Mutter D, Marescaux \nJ, de Mathelin M, Padoy N. EndoNet: A deep \narchitecture for recognition tasks on laparoscopic \nvideos. IEEE Trans Med Imaging. 2017;36(1):86–\n97. doi: 10.1109/tmi.2016.2593957.\n23.  Gumbs A, Grasso V, Bourdel N, Croner R, Spolverato \nG, Frigerio I, et al. The advances in computer vision \nthat are enabling more Autonomous Actions in \nsurgery: A systematic review of the literature. \nSensors (Basel). 2022;22(13):4918. doi: 10.3390/\ns22134918.\n24.  Khan R, Plahouras J, Johnston BC, Scaffidi MA, \nGrover SC, Walsh CM. Virtual reality simulation \ntraining in endoscopy: a Cochrane review and \nmeta-analysis. Endoscopy. 2019;51(7):653–64. \ndoi: 10.1055/a-0894-4400.\n25.  von Ende E, Ryan S, Crain MA, Makary MS. Artificial \nintelligence, augmented reality, and virtual reality \nadvances and applications in interventional \nradiology. Diagnostics (Basel). 2023;13(5). doi: \n10.3390/diagnostics13050892.\n26.  Schmidt MW, Köppinger KF, Fan C, Kowalewski \nK-F, Schmidt LP, Vey J, et al. Virtual reality \nsimulation in robot-assisted surgery: meta-analysis \nof skill transfer and predictability of skill. BJS Open. \n2021;5(2). doi: 10.1093/bjsopen/zraa066.\n27.  Brown TB, Mann B, Ryder N, Subbiah M, Kaplan J, \nDhariwal P, et al. Language Models are Few-Shot \nLearners. arXiv:2005.14165v4. 2020:1-75. doi:  \n10.48550/arXiv.2005.14165.\n28.  Ötleş E, Kendrick DE, Solano QP, Schuller M, Ahle \nSL, Eskender MH, et al. Using natural language \nprocessing to automatically assess feedback \nquality: Findings from 3 surgical residencies. \nAcad Med. 2021;96(10):1457–60. doi: 10.1097/\nacm.0000000000004153.\n29.  Tustumi F, Andreollo NA, Aguilar-Nascimento \nJE de. Future of the language models in \nhealthcare: The role of ChatGPT. ABCD Arq Bras \nCir Dig. 2023;36:e1727. doi: 10.1590/0102-\n672020230002e1727.\n30.  Belmar F, Gaete MI, Durán V, Chelebifski S, Jarry C, \nOrtiz C, et al. Taking advantage of asynchronous \ndigital feedback: development of an at-home basic \nsuture skills training program for undergraduate \nmedical students that facilitates skills retention. \nGlobal Surg Educ. 2023;2(1):32. doi: 10.1007/\ns44186-023-00112-w.\n31.  Solano QP, Hayward L, Chopra Z, Quanstrom K, \nKendrick D, Abbott KL, et al. Natural language \nprocessing and assessment of resident feedback \nquality. J Surg Educ. 2021;78(6):e72–7. doi: \n10.1016/j.jsurg.2021.05.012.",
  "topic": "Computer science",
  "concepts": [
    {
      "name": "Computer science",
      "score": 0.5852710604667664
    },
    {
      "name": "Automatic summarization",
      "score": 0.5623032450675964
    },
    {
      "name": "Training (meteorology)",
      "score": 0.49942731857299805
    },
    {
      "name": "Virtual reality",
      "score": 0.47750991582870483
    },
    {
      "name": "Artificial intelligence",
      "score": 0.4539191722869873
    },
    {
      "name": "Augmented reality",
      "score": 0.417167603969574
    },
    {
      "name": "Meteorology",
      "score": 0.0
    },
    {
      "name": "Physics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I162148367",
      "name": "Pontificia Universidad Católica de Chile",
      "country": "CL"
    }
  ],
  "cited_by": 46
}