{
  "title": "Evaluation of Prompts to Simplify Cardiovascular Disease Information Using a Large Language Model",
  "url": "https://openalex.org/W4388519401",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A2256881792",
      "name": "Vishala Mishra",
      "affiliations": [
        "Duke University"
      ]
    },
    {
      "id": "https://openalex.org/A2549091777",
      "name": "Ashish Sarraju",
      "affiliations": [
        "Cleveland Clinic"
      ]
    },
    {
      "id": "https://openalex.org/A2307119062",
      "name": "Neil M Kalwani",
      "affiliations": [
        "VA Palo Alto Health Care System",
        "Stanford University"
      ]
    },
    {
      "id": "https://openalex.org/A2144680790",
      "name": "Joseph P. Dexter",
      "affiliations": [
        "Evolutionary Genomics (United States)",
        "University of Macau",
        "Harvard University"
      ]
    },
    {
      "id": "https://openalex.org/A2256881792",
      "name": "Vishala Mishra",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2549091777",
      "name": "Ashish Sarraju",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2307119062",
      "name": "Neil M Kalwani",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2144680790",
      "name": "Joseph P. Dexter",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W3210682857",
    "https://openalex.org/W4319062614",
    "https://openalex.org/W4361289889",
    "https://openalex.org/W2806749674",
    "https://openalex.org/W4377010595",
    "https://openalex.org/W3049456494"
  ],
  "abstract": "Abstract AI chatbots powered by large language models (LLMs) are emerging as an important source of public-facing medical information. Generative models hold promise for producing tailored guidance at scale, which could advance health literacy and mitigate well-known disparities in the accessibility of health-protective information. In this study, we highlight an important limitation of basic approaches to AI-powered text simplification: when given a zero-shot or one-shot simplification prompt, GPT-4 often responds by omitting critical details. To address this limitation, we developed a new prompting strategy, which we term rubric prompting. Rubric prompts involve a combination of a zero-shot simplification prompt with brief reminders about important topics to address. Using rubric prompts, we generate recommendations about cardiovascular disease prevention that are more complete, more readable, and have lower syntactic complexity than baseline responses produced without prompt engineering. This analysis provides a blueprint for rigorous evaluation of AI model outputs in medicine.",
  "full_text": "Evaluation of Prompts to Simplify Cardiovascular Disease Information Using a Large \nLanguage Model \n \nVishala Mishra, MBBS \n \nDepartment of Biostatistics and Bioinformatics, Duke University School of Medicine, Durham, \nNorth Carolina \n \nAshish Sarraju, MD \n \nDepartment of Cardiovascular Medicine, Cleveland Clinic, Cleveland, Ohio \n \nNeil M. Kalwani, MD, MPP \n \nVeterans Affairs Palo Alto Health Care System, Palo Alto, California \n \nDivision of Cardiovascular Medicine, Department of Medicine, Stanford University School of \nMedicine, Stanford, California  \n \nJoseph P. Dexter, PhD \nData Science Initiative and Department of Human Evolutionary Biology, Harvard University, \nCambridge, Massachusetts  \nInstitute of Collaborative Innovation, University of Macau, Macau \nCorresponding Authors: \n \nVishala Mishra \nDepartment of Biostatistics and Bioinformatics  \nDuke University School of Medicine  \n2424 Erwin Road \nDurham, NC 27705 \nvishala.mishra@duke.edu \n(240) 428-0497 \n \nJoseph P. Dexter  \nData Science Initiative and Department of Human Evolutionary Biology \nHarvard University \n11 Divinity Avenue \nCambridge, MA 02138 \njdexter@fas.harvard.edu  \n(802) 338-1330  \n \nWord Count: 559  \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted November 9, 2023. ; https://doi.org/10.1101/2023.11.08.23298225doi: medRxiv preprint \nNOTE: This preprint reports new research that has not been certified by peer review and should not be used to guide clinical practice.\nEvaluation of Prompts to Simplify Cardiovascular Disease Information Using a Large \nLanguage Model \n \nAbstract \nAI chatbots powered by large language models (LLMs) are emerging as an important source of \npublic-facing medical information. Generative models hold promise for producing tailored \nguidance at scale, which could advance health literacy and mitigate well-known disparities in the \naccessibility of health-protective information. In this study, we highlight an important limitation \nof basic approaches to AI-powered text simplification: when given a zero-shot or one-shot \nsimplification prompt, GPT-4 often responds by omitting critical details. To address this \nlimitation, we developed a new prompting strategy, which we term rubric prompting. Rubric \nprompts involve a combination of a zero-shot simplification prompt with brief reminders about \nimportant topics to address. Using rubric prompts, we generate recommendations about \ncardiovascular disease prevention that are more complete, more readable, and have lower \nsyntactic complexity than baseline responses produced without prompt engineering. This \nanalysis provides a blueprint for rigorous evaluation of AI model outputs in medicine. \n \n \n \n \n \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted November 9, 2023. ; https://doi.org/10.1101/2023.11.08.23298225doi: medRxiv preprint \nIntroduction | Many online patient educational materials about cardiovascular disease (CVD) \nare inaccessible for the general public.1 Artificial intelligence (AI) chatbots powered by large \nlanguage models (LLMs) are a potential source of public-facing CVD information.2,3 Generative \nlanguage models present risks related to information quality but also opportunities for producing \naccessible information about CVD at scale, which could advance the American Heart \nAssociation’s 2020 impact goals related to health literacy.4 Recent studies have used LLMs to \nsimplify medical information in different contexts,3,5 but quantitative comparison of prompt \nengineering strategies is needed to assess and optimize performance. In this cross-sectional \nstudy, we evaluate the completeness, readability, and syntactic complexity of CVD prevention \ninformation produced by GPT-4 in response to 4 kinds of prompts.  \n \nMethods | A set of 25 questions about fundamental CVD prevention topics was drawn from \nprior work.\n2 We devised 3 prompt strategies for generating simplified ChatGPT responses to \nthese questions, including a zero-shot prompt to use plain and easy-to-understand language, a \none-shot prompt with a sample simplified passage on an unrelated subject, and a combined \nprompt both to use simplified language and to cover specific key points (which we term rubric \nprompting). Responses to these 3 prompts were compared to baseline responses in which the \nprompt contained only the question about CVD. \nFor each question and prompt type, 3 independent responses were generated between \nApril - June 2023 using the GPT-4 version of ChatGPT with default parameters. Two authors \nwho are preventive cardiologists (A.S. and N.W.K.) scored the completeness of responses \naccording to a custom rubric; disagreements were resolved by consensus. We calculated 5 \nreadability scores using Readability Studio Professional (version 2019.3, Oleander Software) and \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted November 9, 2023. ; https://doi.org/10.1101/2023.11.08.23298225doi: medRxiv preprint \n2 measures of syntactic complexity using the L2 Syntactic Complexity Analyzer (version 3.3.3), \nas described previously.6 \nDifference from baseline completeness was assessed using Fisher’s exact test, and two-\nsample readability and syntactic complexity comparisons were done using the Wilcoxon rank-\nsum test. Statistical significance was set as P < .05.  \n \nResults | Baseline responses to 20 of the 25 (80%) questions were scored as complete (Table 1). \nCompleteness was significantly lower for both the zero-shot (8, 32%) and one-shot (8, 32%) \nsimplification prompts (P = .00140 and P = .00140, respectively), but significantly higher for the \nrubric prompts (25, 100%; P = .00140). All 3 prompts significantly improved readability \naccording to every metric and lowered 1 measure of syntactic complexity (Table 2).  \n \nDiscussion | We found that zero- and one-shot prompting of GPT-4 to produce simplified \ninformation about CVD generated more readable but less comprehensive responses. This loss of \ninformation, however, could be averted by combining a zero-shot simplification prompt with a \nshort reminder to include critical information (rubric prompting). Our findings highlight the \nimportance of optimizing prompts and incorporating expert clinical judgment when considering \nthe use of LLMs to produce patient education materials, especially for audiences with lower \nhealth literacy.\n3,5 As such, prospective guidelines for the use of AI in medicine should address \nthese trade-offs in prompt engineering and standardized evaluation of model outputs, as well as \nclinician and public outreach to cultivate relevant skills.  \nLimitations of the study include use of a single model at a specific point in time and \nabsence of reading comprehension data from patients. Future research should evaluate LLMs \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted November 9, 2023. ; https://doi.org/10.1101/2023.11.08.23298225doi: medRxiv preprint \ndeveloped for medical purposes and could integrate ongoing user testing with structured health \nliteracy assessment of responses.  \n \nVishala Mishra, MBBS \nAshish Sarraju, MD \nNeil M. Kalwani, MD, MPP \nJoseph P. Dexter, PhD  \n \nAuthor Affiliations: Department of Biostatistics and Bioinformatics, Duke University School of \nMedicine, Durham, North Carolina (Mishra); Department of Cardiovascular Medicine, \nCleveland Clinic, Cleveland, Ohio (Sarraju); Veterans Affairs Palo Alto Health Care System, \nPalo Alto, California (Kalwani); Division of Cardiovascular Medicine, Department of Medicine, \nStanford University School of Medicine, Stanford, California (Kalwani); Data Science Initiative \nand Department of Human Evolutionary Biology, Harvard University, Cambridge, \nMassachusetts (Dexter); Institute of Collaborative Innovation, University of Macau, Macau \n(Dexter).  \n \nCorresponding Authors: Vishala Mishra, MBBS, Department of Biostatistics and \nBioinformatics, Duke University School of Medicine, 2424 Erwin Road, Durham, NC 27705 \n(vishala.mishra@duke.edu); Joseph P. Dexter, PhD, Data Science Initiative and Department of \nHuman Evolutionary Biology, Harvard University, 11 Divinity Avenue, Cambridge, MA 02138 \n(jdexter@fas.harvard.edu).  \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted November 9, 2023. ; https://doi.org/10.1101/2023.11.08.23298225doi: medRxiv preprint \nAuthor Contributions: Drs Mishra and Dexter had full access to all of the data in the study and \ntake responsibility for the integrity of the data and the accuracy of the data analysis. \nConcept and design: Mishra, Sarraju, Dexter.  \nAcquisition, analysis, or interpretation of data: All authors.  \nDrafting of the manuscript: Mishra, Dexter.  \nCritical revision of the manuscript for important intellectual content: All authors.  \nStatistical analysis: Mishra, Dexter.  \nObtained funding: Dexter. \nSupervision: Mishra, Dexter.  \n \nConflict of Interest Disclosures: Dr Dexter reported receiving grants from the Harvard Data \nScience Initiative during the conduct of the study. No other disclosures were reported. \n \nFunding/Support: Dr Dexter was supported by a Harvard Data Science Fellowship.  \n \nRole of the Funder/Sponsor: The funders had no role in the design and conduct of the study; \ncollection, management, analysis, and interpretation of the data; preparation, review, or approval \nof the manuscript; and decision to submit the manuscript for publication. \n \nAdditional Contributions: We thank Stephen Blackwelder, PhD (Duke University Health System) \nfor helpful discussions and comments on the manuscript, and Vasudha Mishra, MBBS (AIIMS \nPatna) for assistance with data collection. They received no additional compensation for this work. \n \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted November 9, 2023. ; https://doi.org/10.1101/2023.11.08.23298225doi: medRxiv preprint \n1. Pearson K, Ngo S, Ekpo E, et al. Online Patient Education Materials Related to \nLipoprotein(a): Readability Assessment. J Med Internet Res. 2022;24(1):e31284. \ndoi:10.2196/31284. \n \n2. Sarraju A, Bruemmer D, Van Iterson E, et al. Appropriateness of Cardiovascular Disease \nPrevention Recommendations Obtained From a Popular Online Chat-Based Artificial \nIntelligence Model. JAMA. 2023;329(10):842-844. doi:10.1001/jama.2023.1044  \n \n3. Lee P, Bubeck S, Petro J. Benefits, Limits, and Risks of GPT-4 as an AI Chatbot for \nMedicine. N Engl J Med. 2023;388(13):1233-1239. doi:10.1056/NEJMsr2214184 \n \n4. Magnani JW, Mujahid MS, Aronow HD, et al. Health Literacy and Cardiovascular Disease: \nFundamental Relevance to Primary and Secondary Prevention: A Scientific Statement From the \nAmerican Heart Association. Circulation. 2018;138:e48-e74. \ndoi:10.1161/CIR.0000000000000579 \n \n5. Lyu Q, Tan J, Zapadka ME, et al. Translating radiology reports into plain language using \nChatGPT and GPT-4 with prompt learning: results, limitations, and potential. Vis Comput Ind \nBiomed Art. 2023;6(1):9. doi:10.1186/s42492-023-00136-5.  \n \n6. Mishra V, Dexter JP. Comparison of Readability of Official Public Health Information About \nCOVID-19 on Websites of International Agencies and the Governments of 15 Countries. JAMA \nNetw Open. 2020;3(8):e2018033. doi:10.1001/jamanetworkopen.2020.18033  \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted November 9, 2023. ; https://doi.org/10.1101/2023.11.08.23298225doi: medRxiv preprint \nTable 1. Evaluation of Completeness of Cardiovascular Disease Information \nGenerated Using 4 Large Language Model Prompt Strategies \n \n Consensus Grade for Each Prompta  \nQuestion Baseline Plain \nLanguage \n(Zero-Shot)  \nPlain \nLanguage \n(One-Shot) \nPlain \nLanguage \n(Rubric) \nHow can I prevent heart disease?  Complete Complete Complete Complete \nWhat is the best diet for the heart? Complete Complete Complete Complete \nWhat is the best diet for high blood \npressure and high cholesterol?  \nComplete Complete Complete Complete \nHow much should I exercise to stay \nhealthy?  \nComplete Inconsistent Incomplete Complete \nShould I do cardio or lift weights to \nprevent heart disease?  \nComplete Inconsistent Inconsistent Complete \nHow can I lose weight?  Complete Inconsistent Inconsistent Complete \nHow can I decrease LDL? Inconsistent Incomplete Incomplete Complete \nHow can I decrease triglycerides? Complete Complete Complete Complete \nWhat is lipoprotein(a)?  Complete Incomplete Incomplete Complete \nHow can I quit smoking? Complete Complete Inconsistent Complete \nWhat are the side effects of statins? Complete Inconsistent Complete Complete \nI have muscle pain with a statin. What \nshould I do? \nInconsistent \n \nInconsistent \n \nComplete Complete \nMy cholesterol is still high and I’m \nalready on a statin. What should I do?  \nInconsistent Incomplete Incomplete Complete \nWhat medications can reduce \ncholesterol other than statins? \nComplete Complete Inconsistent Complete \nWhat is ezetimibe? Complete Inconsistent Incomplete Complete \nWhat are Repatha and Praluent? Complete Incomplete Incomplete Complete \nWhat is inclisiran? Complete Incomplete Incomplete Complete \nWhat are the side effects of Repatha \nand Praluent?  \nComplete Complete Inconsistent Complete \nShould I take aspirin to prevent heart \ndisease? \nComplete Complete Complete Complete \nMy cholesterol panel shows \ntriglycerides 400 mg/dL. How should I \ninterpret this? \nComplete Inconsistent Complete Complete \nMy LDL is 200 mg/dL. How should I \ninterpret this? \nInconsistent Incomplete Incomplete Complete \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted November 9, 2023. ; https://doi.org/10.1101/2023.11.08.23298225doi: medRxiv preprint \nWhat does a coronary calcium score of \n0 mean? \nComplete Incomplete Incomplete Complete \nWhat does a coronary calcium score of \n100 mean? \nInconsistent Inconsistent Incomplete Complete \nWhat does a coronary calcium score of \n400 mean? \nComplete Incomplete Incomplete Complete \nWhat genetic mutations can cause high \ncholesterol?  \nComplete Inconsistent Incomplete Complete \naFor every prompt strategy, we generated 3 responses to each of the 25 questions about cardiovascular disease prevention. \n“Complete” indicates that all 3 responses received a full score according to our coverage rubric, “Incomplete” indicates that all 3 \nresponses received less than a full score, and “Inconsistent” indicates that some responses were “Complete” and others \n“Incomplete.” Grades shown were determined by consensus between two reviewers.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted November 9, 2023. ; https://doi.org/10.1101/2023.11.08.23298225doi: medRxiv preprint \nTable 2. Comparison of Readability and Syntactic Complexity of Cardiovascular \nDisease Information Generated Using 4 Large Language Model Prompt \nStrategiesa \n \n Prompt \nReadability \nFormulas \nBaseline Plain \nLanguage \n(Zero-Shot) \nDifference \nFrom \nBaselinec \nPlain \nLanguage \n(One-Shot) \nDifference \nFrom \nBaselined \nPlain \nLanguage \n(Rubric)  \nDifference \nFrom \nBaselinee \nFKGL 13.4 (3.2) \n[9.4-17.4] \n9.7 (3.6) \n[5.4-13.7] \n-4.2 (2.7) \n[-8.3, 0.1] \nP < .001 \n3.8 (2.4) \n[1.2-7.5] \n-9.4 (2.8) \n[-14.5, -5.8] \nP < .001 \n8 (2.2) \n[4.6-12.5] \n-5.3 (2.6) \n[-8.7, -0.1] \nP < .001 \nSMOG 14.8 (2.9) \n[11.6-18.1] \n12.1 (2.9) \n[8.4-15] \n-3.6 (2.2) \n[-7.5, 0.6] \nP < .001 \n7.9 (2) \n[5.1-10] \n-7.1 (2.5) \n[-11.2, -4.0] \nP < .001 \n10.9 (1.5) \n[8.1-14.4] \n-4.1 (2.5) \n[-7.1, 0.1] \nP < .001 \nGFI 14 (4.9) \n[9.1-19] \n11.3 (5.1) \n[4.8-15.3] \n-4.0 (3) \n[-10.4, 2.8] \nP < .001 \n6.3 (2.2) \n[3.2-9.9] \n-7.5 (4.3) \n[-14.3, -3.4] \nP < .001 \n10.2 (2.4) \n[6.1-16] \n-3.9 (3.5) \n[-9.7, 0.3] \nP < .001 \nFORCAST 11.5 (0.7) \n[10.5-12.7] \n10.2 (0.9) \n[8.6-12.3] \n-1.3 (1.0) \n[-3.4, 1.4] \nP < .001 \n8.8 (1.2) \n[7-10.7] \n-2.7 (1.1) \n[-5.4, -0.7] \nP < .001 \n9.7 (0.9) \n[8.3-11.5] \n-1.9 (0.9) \n[-3.1, -0.1]  \nP < .001 \nCLI 13.8 (2) \n[9.4-16.9] \n10.4 (2.8) \n[6.7-14.5] \n-3.7 (2.3) \n[-7.5, 0.7] \nP < .001 \n6.2 (2.3) \n[1.7-10.4]  \n-7.8 (2.5) \n[-15, -3.3] \nP < .001 \n9.4 (1.5) \n[6.3-12]  \n-4.5 (2) \n[-8.6, 0.7] \nP < .001  \nSyntactic \nComplexity\nb \n       \nMLC 15 (3.9) \n[10.4, 23.6] \n12.3 (5) \n[8, 36] \n-1.8 (5.3) \n[-9.6, 22.9] \nP = .010 \n8.7 (2.9) \n[6.4, 21] \n-5.7 (4.2) \n[-11.9, 3.3] \nP < .001 \n9.6 (1.5) \n[7.7, 15.5] \n-4.2 (3.8) \n[-11.6, 0.6] \nP < .001  \nDC/T 0.3 (0.3) \n[0.1, 1] \n0.3 (0.3) \n[0, 1.3] \n0 (0.3) \n[-0.5, 1] \nP = .36 \n0.2 (0.2) \n[0, 0.5] \n-0.2 (0.2) \n[-1, 0.3] \nP < .001  \n0.6 (0.3) \n[0.2, 1.1]  \n0.2 (0.3) \n[-0.4, 0.7] \nP > .999  \nAbbreviations: CLI, Coleman-Liau Index; DC/T, dependent clauses/T-unit; FKGL, Flesch-Kincaid Grade Level; FORCAST, Ford, \nCaylor, Sticht formula; GFI, Gunning Fog Index; IQR, interquartile range; MLC, mean length of clause; SMOG, Simple Measure of \nGobbledygook.  \naFor every prompt strategy, we generated 3 responses to each of the 25 questions about cardiovascular disease prevention. \nMedian, IQR, and range are reported for the 4 sets of 75 responses.  \nbMLC is a measure of elaboration at the clause level (i.e., number of words per clause), and DC/T is a measure of subordination.   \ncDifference between responses to the baseline and plain language prompts. P values are from a one-tailed Wilcoxon signed rank \ntest.  \ndDifference between responses to the baseline and plain language with example prompts. P values are from a one-tailed Wilcoxon \nsigned rank test.  \neDifference between responses to the baseline and plain language with coverage prompts. P values are from a one-tailed Wilcoxon \nsigned rank test.  \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted November 9, 2023. ; https://doi.org/10.1101/2023.11.08.23298225doi: medRxiv preprint ",
  "topic": "Rubric",
  "concepts": [
    {
      "name": "Rubric",
      "score": 0.9570247530937195
    },
    {
      "name": "Blueprint",
      "score": 0.790165901184082
    },
    {
      "name": "Computer science",
      "score": 0.6248246431350708
    },
    {
      "name": "Generative grammar",
      "score": 0.5902261734008789
    },
    {
      "name": "Construct (python library)",
      "score": 0.5278934240341187
    },
    {
      "name": "Health literacy",
      "score": 0.4972515404224396
    },
    {
      "name": "Language model",
      "score": 0.4266747832298279
    },
    {
      "name": "Artificial intelligence",
      "score": 0.352183073759079
    },
    {
      "name": "Psychology",
      "score": 0.2561194598674774
    },
    {
      "name": "Mathematics education",
      "score": 0.18297162652015686
    },
    {
      "name": "Health care",
      "score": 0.1275751292705536
    },
    {
      "name": "Engineering",
      "score": 0.10696545243263245
    },
    {
      "name": "Political science",
      "score": 0.09479144215583801
    },
    {
      "name": "Programming language",
      "score": 0.09262153506278992
    },
    {
      "name": "Mechanical engineering",
      "score": 0.0
    },
    {
      "name": "Law",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I170897317",
      "name": "Duke University",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I1316902750",
      "name": "Cleveland Clinic",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I97018004",
      "name": "Stanford University",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I204866599",
      "name": "VA Palo Alto Health Care System",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I204512498",
      "name": "University of Macau",
      "country": "MO"
    },
    {
      "id": "https://openalex.org/I4210109333",
      "name": "Evolutionary Genomics (United States)",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I136199984",
      "name": "Harvard University",
      "country": "US"
    }
  ],
  "cited_by": 2
}