{
    "title": "Precious1GPT: multimodal transformer-based transfer learning for aging clock development and feature importance analysis for aging and age-related disease target discovery",
    "url": "https://openalex.org/W4380686399",
    "year": 2023,
    "authors": [
        {
            "id": "https://openalex.org/A4226849921",
            "name": "Anatoly Urban",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A3188391189",
            "name": "Denis Sidorenko",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A3138761369",
            "name": "Diana Zagirova",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2111649279",
            "name": "Ekaterina Kozlova",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A4380711431",
            "name": "Aleksandr Kalashnikov",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A3178465533",
            "name": "Stefan Pushkov",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2140807457",
            "name": "Vladimir Naumov",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A4364576969",
            "name": "Viktoria Sarkisova",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A4222059953",
            "name": "Geoffrey Ho Duen Leung",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2562894394",
            "name": "Hoi-Wing Leung",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A4222059952",
            "name": "Frank W. Pun",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2519134501",
            "name": "Ivan V Ozerov",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A4316671022",
            "name": "Alex Aliper",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1981210495",
            "name": "Feng Ren",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1968157102",
            "name": "Alex Zhavoronkov",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2096158640",
        "https://openalex.org/W2399240576",
        "https://openalex.org/W2954087019",
        "https://openalex.org/W2306570595",
        "https://openalex.org/W2991407313",
        "https://openalex.org/W2783205838",
        "https://openalex.org/W4220717877",
        "https://openalex.org/W4322770093",
        "https://openalex.org/W2397757171",
        "https://openalex.org/W3088580802",
        "https://openalex.org/W2960630681",
        "https://openalex.org/W2736137960",
        "https://openalex.org/W2805002767",
        "https://openalex.org/W2891868449",
        "https://openalex.org/W3015295307",
        "https://openalex.org/W3028405346",
        "https://openalex.org/W2900972799",
        "https://openalex.org/W3192224792",
        "https://openalex.org/W2310078843",
        "https://openalex.org/W2100651100",
        "https://openalex.org/W2415875234",
        "https://openalex.org/W2949676527",
        "https://openalex.org/W2962862931",
        "https://openalex.org/W2972190464",
        "https://openalex.org/W3165645117",
        "https://openalex.org/W4313430490",
        "https://openalex.org/W1974047233",
        "https://openalex.org/W2121091193",
        "https://openalex.org/W2949100461",
        "https://openalex.org/W3084870657",
        "https://openalex.org/W4224276389",
        "https://openalex.org/W4211154726",
        "https://openalex.org/W2054502486",
        "https://openalex.org/W2895872098",
        "https://openalex.org/W4224986476",
        "https://openalex.org/W2767227539",
        "https://openalex.org/W3012229909",
        "https://openalex.org/W4286776155",
        "https://openalex.org/W2895375285",
        "https://openalex.org/W2955598861",
        "https://openalex.org/W2005293946",
        "https://openalex.org/W2467573936",
        "https://openalex.org/W3164236065",
        "https://openalex.org/W2886869332",
        "https://openalex.org/W3144321992",
        "https://openalex.org/W2977415384",
        "https://openalex.org/W2018838463",
        "https://openalex.org/W3027055147",
        "https://openalex.org/W3088521497",
        "https://openalex.org/W3111356309",
        "https://openalex.org/W4295924947"
    ],
    "abstract": "Aging is a complex and multifactorial process that increases the risk of various age-related diseases and there are many aging clocks that can accurately predict chronological age, mortality, and health status. These clocks are disconnected and are rarely fit for therapeutic target discovery. In this study, we propose a novel approach to multimodal aging clock we call Precious1GPT utilizing methylation and transcriptomic data for interpretable age prediction and target discovery developed using a transformer-based model and transfer learning for case-control classification. While the accuracy of the multimodal transformer is lower within each individual data type compared to the state of art specialized aging clocks based on methylation or transcriptomic data separately it may have higher practical utility for target discovery. This method provides the ability to discover novel therapeutic targets that hypothetically may be able to reverse or accelerate biological age providing a pathway for therapeutic drug discovery and validation using the aging clock. In addition, we provide a list of promising targets annotated using the PandaOmics industrial target discovery platform.",
    "full_text": "www.aging-us.com 4649 AGING \nINTRODUCTION \n \nAging is a complex, multifactorial process that results \nfrom a multitude of interacting biological mechanisms \noccurring at different levels within an organism [1]. \nThe development of accurate, physiologically \nmeaningful biomarkers of aging is crucial for \nassessing the efficacy of potential anti -aging therapies \nand advancing the field of aging research [2,  3]. Deep \nneural networks (DNNs) have demonstrated \nremarkable success in various applications, including \nbiomedical research [4, 5]. Population- specific aging \nclocks have been developed using large datasets from \ndiverse ethnic groups, enabling more accurate \npredictions of chronological age and biological age, as \nwell as assessment of all -cause mortality [6]. \nMoreover, artificial intelligence (AI) -driven plat forms, \nsuch as PandaOmics, have facilitated the identification \nand prioritization of novel aging- associated targets for \ndrug discovery and repurposing [7]. Recent studies \nhave also demonstrated the value of AI in advancing \nlongevity research by harnessing the power of next -\ngeneration sequencing data and omics technologies \n[8]. \nwww.aging -us.com AGING 2023 , Vol. 15, No. 11 \nResearch Paper \nPrecious1GPT: multimodal transformer-based transfer learning for \naging clock development and feature importance analysis for aging \nand age-related disease target discovery \n \nAnatoly Urban1, Denis Sidorenko1, Diana Zagirova1, Ekaterina Kozlova1, Aleksandr \nKalashnikov2, Stefan Pushkov1, Vladimir Naumov1, Viktoria Sarkisova1, Geoffrey Ho Duen \nLeung1, Hoi Wing Leung1, Frank W. Pun1, Ivan V. Ozerov1, Alex Aliper1,2, Feng Ren3, Alex \nZhavoronkov1,2 \n \n1Insilico Medicine, Pak Shek Kok, New Territories, Hong Kong \n2Insilico Medicine, Masdar City, United Arab Emirates \n3Insilico Medicine, Shanghai, China \n \nCorrespondence to: Alex Zhavoronkov; email: alex@insilico.com  \nKeywords: transformers, deep learning, therapeutic target discovery, aging biomarkers, human aging  \nReceived: April 21, 2023 Accepted: May 24, 2023 Published: June 13, 2023 \n \nCopyright: © 202 3 Urban et al. This is an open access article distributed under the terms of the Creative Commons \nAttribution License (CC BY 3.0), which permits unrestricted use, distribution, and reproduction in any medium, provided the \noriginal author and source are credited. \n \nABSTRACT \n \nAging is a complex and multifactorial process that increases the risk of various age-related diseases and there \nare many aging clocks that can accurately predict chronological age, mortality, and health status. These clocks \nare disconnected and are rarely fit for therapeutic target discovery. In this study, we propose a novel approach \nto multimodal aging clock we call Precious1GPT utilizing methylation and transcriptomic data for interpretable \nage prediction and target discovery developed using a transformer-based model and transfer learning for case-\ncontrol classification. While the accuracy of the multimodal transformer is lower within each individual data \ntype compared to the state of art specialized aging clocks based on methylation or transcriptomic data \nseparately it may have higher practical utility for target discovery. This method provides the ability to discover \nnovel therapeutic targets that hypothetically may be able to reverse or accelerate biological age providing a \npathway for therapeutic drug discovery and validation using the aging clock. In addition, we provide a list of \npromising targets annotated using the PandaOmics industrial target discovery platform. \nwww.aging-us.com 4650 AGING \nInsilico Medicine has been at the forefront of using \ngenerative AI in biology since 2016 [ 9–11]. Their \nresearch has led to the development of generative \nbiology approaches that utilize generative systems to \ngenerate synthetic biological data, including their first \nsuccessful demonstration taking place at the National \nInstitute of Aging [12 ]. In addition to target \ndiscovery, Insilico has also developed capabilities in \ngenerative chemist ry [4, 13– 15]. These approaches \nhave been successfully applied to various diseases and \naging and have shown potential in identifying novel \ncompounds and accelerating drug development  \n[16–18]. As the aging population continues to grow, \nthere is an urgent need for new therapeutic targets to \ndelay and treat age -related diseases. Therefore, the \napplication of generative biology approaches in \nexploring the complex interplay between aging and \ndiseases holds great promise for identifying potential \nnovel targets and accelerating drug development \nefforts. \n \nDeep aging clocks have been developed for various \napplications in pharmaceutical research and \ndevelopment. For example, DeepMAge, a methylation \naging clock developed using deep learning, shows \nremarkable accuracy and biological relevance in \npredicting human age and identifying health- related \nconditions [ 19]. Moreover, deep aging clocks could \npotentially be used for target identification, drug \ndiscovery, data quality control, and synthetic patient \ndata generation [3]. Additionally, the use of AI to \ncomprehend the intricate interplay between the \nmicroenvironment within the human body and the \nexternal environment has shown promise in revealing \nthe role of external factors in aging [8]. The \nintegration of deep learning techniques with genomics \nand other omics data has enabled comprehensive \ncomparisons of DNA repair transcriptomes in species \nwith extreme lifespan differences, shedding light on \nthe potential role of DNA repair as a longevity \nassurance system [2 0]. \n \nDespite the progress made in developing deep aging \nclocks and AI -based biomarkers, there are still several \nchallenges and opportunities for improvement in the \nfield of biohorology [ 16]. The development of deep \nlearning, DNNs, and generative approaches is expected  \nto significantly advance the field, leading to more \naccurate and robust aging biomarkers [ 16]. \nFurthermore, in silico methods for screening and \nranking potential geroprotective candidates, based on \ntheir ability to regulate age -related changes in signaling \npathway clouds, hold promise for accelerating the \ndiscovery of effective interventions and reducing the \ntime and cost of pre -clinical work and clinical trials \n[21]. For instance, GeroScope could predict novel \ngeroprotectors from existing human ge ne expression \ndata by mapping expression differences between young \nand old subjects to age -related signaling pathways and \nranking known substances (potential geroprotector \ncandidates) based on their likelihood to target \ndifferential pathways and mimic the young signalome \n[22]. Similarly, the human gut microbiome has been \nshown to have a strong association with host age, and \ndeep learning -based models have been developed to \npredict host age based on gut microflora taxonomic \nprofiles, further providing insights into potential aging \nbiomarkers [17]. \n \nTo identify aging biomarkers associated with age -\nrelated diseases, in the present work, we combined the \nability of aging clocks to predict biological age and thus \ngrasp molecular changes accompanied by senescence \nand our target ID approach to establish genes that are \nrelated to the development of diseases. This provides us \nwith a novel perspective on uncovering the molecular \nmechanisms of diseases in the context of aging, \nallowing us to identify promising strategies to delay and \ntreat age-related diseases. \n \nRESULTS \n \nPerformance of the transformer- based multimodal \naging clock \n \nIn the current study, we have developed a \ncomprehensive pipeline, as illustrated in Figure 1. The \npipeline consists of several key steps, including training \na multimodal transformer -based regressor on normal \nsample data for age prediction and subsequently using \nthe learned weights to fine -tune a transformer -based \nclassifier for distinguishing between case and control \nsamples. Next, we perform gene prioritization by \nemploying the feature importance values obtained from \nthe regressor to rank genes based on their relevance to \naging and utilizing the importance values from the \nclassifier to rank genes in terms of their relevance to \nboth aging and disease. Finally, we analyze the resulting \ngene lists using the PandaOmics TargetID Platform to \ngain insights into potential targets for age -related \ndiseases. In this study, we implemented a transformer -\nbased architecture to accommodate both numerical and \ncategorical data as input for our predictive model. This \nstrategy, which we call Precious1GPT, enables the \nconstruction of multimodal classifiers and regressors \nthat can effectively process diverse data types, such as \nRNA-seq expression data and epigenomics methylation \ndata taking into account data type and tissue type. \nConsequently, our model demonstrates proficiency in \nage prediction and case- control classification, \nshowcasing its versatility in handling multifaceted \ninputs. \nwww.aging-us.com 4651 AGING \nWe employed Optuna [23], a hyperparameter optimizer, \nto optimize the parameters for each model. We \noptimized L1 and L2 regularization, the activation \nfunction, dropout value, batch size, the number of \nneurons in hidden layers, and the gradient update used. \nThe final regression metrics for the optimized models \nare shown in Table 1, calculated for the epigenetic and \nexpression sub- datasets and for the whole dataset, \nrespectively. The metrics were calculated by splitting \nthe data to train (80%) and test (20%) set with \nstratification by sample tissue. For five -fold cross-\nvalidation stratified by tissue and data modality, results \nare shown in Supplementary Table 1. Metrics for \nindividual tissues are shown in Supplementary Table 2. \nThe methylation data subset, expression data subset, \nand all the test data combined were also calculated for \neach metric. Learning curves depicting MAE during \ntraining are shown in Supplementary Figure 1. \n \nImportant genes for age prediction \n \nSHapley Additive exPlanations (SHAP) values [ 24] are \na technique for explaining the output of machine \nlearning models. From the regressor model, we obtained \na list of features ranked by their SHAP values \nrepresenting their importance for age prediction \n(Supplementary Table 3). Pathway enrichment analysis \nwas subsequently performed for  the top -100 genes \nranked based on the SHAP values, which showed that \nthese genes are implicated in multiple pathways \nassociated with aging and age-related diseases (Table 2). \nIdentification of potential targets for age -related \ndiseases through feature importance analysis \n \nUtilizing the feature importance analysis based on \nSHAP values, we generated a list of genes associated \nwith aging (Supplementary Table 3). We then compared \nthese genes with known drug targets in our in- house \ndatabase to identify potentia l therapeutic interventions \nfor 4 selected age- related diseases, namely idiopathic \npulmonary fibrosis (Supplementary Table 4), chronic  \nobstructive pulmonary disease (COPD) (Supplementary \nTable 5), Parkinson’ s disease (PD) (Supplementary \nTable 6) and heart failure (Supplementary Table 7). \nEvaluation metrics for case -control classifiers are \nshown in Supplementary Table 8. \n \nWe adopted a transfer learning approach to identify \ngenes involved in disease development in the context of \naging. We first trained a DL -model as a regressor to \npredict age using an age dataset. Subsequently, we fine -\ntuned the model by re -training it as a case -control \nclassifier while keeping the previously learned weights \nfrozen, with the exception of the last layer . The SHAP \nvalues generated from this analysis were then used to \ndetermine the relative importance of molecular features \nin driving disease development in the context of aging. \nThis allowed us to identify specific genes that are \ninvolved in disease development in the context of aging \nand determine their relative importance. To establish a \nbaseline, we trained the same classifiers on the  \ncomplete feature set. For a number of diseases, we  \n \n \n \nFigure 1. Pipeline of the current study. The pipeline involves training a multimodal transformer -based regressor on normal sample \ndata to predict age, followed by transferring the learned weights to a transformer -based classifier for distinguishing between  case and \ncontrol samples. Gene prioritization is then performed using feature importance values obtained from the regressor to rank ge nes \naccording to their relevance to aging and using importance values from the classifier to rank genes according to thei r relevance to both \naging and disease. Finally, the gene lists are analyzed using the PandaOmics TargetID Platform. \n\nwww.aging-us.com 4652 AGING \nTable 1. Multimodal transformer-based regressor metrics were evaluated on the hold- out test dataset (20% of \nall data). \nMetric Methylation data Expression data Combined \nMAE 4.227 6.287 5.622 \nRMSE 6.129 8.155 7.560 \nR2 0.934 0.584 0.807 \nMdAE 2.880 5.098 4.336 \nNumber of samples in test set 4,019 2,730 6,749 \n \nTable 2. Reactome pathway analysis results for the top-100 genes selected based on the SHAP values. \nPathway P-value Odds ratio Combined score \ntRNA Processing in Mitochondrion R-HSA-6785470 0.036 33.99 112.78 \nAmino Acid Transport Across Plasma Membrane R-HSA-352230 0.002 13.77 86.96 \nSuppression Of Apoptosis R-HSA-9635465 0.043 27.19 85.36 \nVasopressin-like Receptors R-HSA-388479 0.043 27.19 85.36 \nHighly Sodium Permeable Postsynaptic Acetylcholine Nicotinic Receptors \nR-HSA-629587 0.050 22.66 67.72 \nCytosolic Sulfonation of Small Molecules R-HSA-156584 0.011 13.68 61.37 \n \nobserved a slight but significant increase in \nclassification metrics (Supplementary Table 8). These \nresults indicated that the last layer of the neural \nnetwork, which was trained to predict biological age, \ncontains sufficient inform ation to differentiate between \ncase and control. \n \nTo validate the performance of our model and to \nestablish its ability to accurately estimate age based on \nmethylation data, we acquired two methylation datasets \nfrom the Gene Expression Omnibus (GEO) reposi tory - \none on cells that were reprogrammed to induced \npluripotent stem cells (iPSC) (dataset GSE54848) and \nthe other on fibroblasts of the developing fetuses \n(dataset GSE76641). The selection of the independent \ndataset on the developing cells, along with r everse \naging cells data, allows us to provide another level of \nvalidation evidence confirming the potency of the \ntrained model. These datasets were processed using the \nsame methods as our primary dataset on age -related \nmethylation, and we used the model to  predict age. In \norder to increase the robustness of our validation, we \nused the same processing methods for both the iPSC \nand fetus datasets as we had for our primary dataset. \nThis ensured consistency and minimized the \npossibility of any discrepancies or variations in our \nresults due to differences in processing methods. The \nresults were consistent with expectations, as \niPSCs become younger during induction (Figure 2, \nLeft) and fetal tissue  becomes older during \ndevelopment (Figure 2, Right). \nManual analysis of the resulting targets \n \nUtilizing a transfer learning approach, we have built \naging-aware case- control classifiers and extracted \nfeature importance values from them. The lists of top -\n200 genes ranked by expression classifiers w ere \nretrieved (Supplementary Tables 4–7) and considered as \na starting point for further target identification and \nprioritization techniques offered by the AI -powered \nPandaOmics platform to propose a list of promising \nnovel targets for age -related diseases.  According to \nPandaOmics TargetID platform, APLNR was ranked \ntop-20 for all 4 diseases, while IL23R was ranked top-\n20 for COPD, PD, and heart failure (Figure 3, \nSupplementary Figures 2–4). APLNR and IL23R were \ntherefore selected as the most promising targe ts for \ntreating multiple age -related diseases. In general, \nAPLNR, a receptor for Apelin and Elabela peptide \nligands, is involved in regulating several important \nphysiological processes, including cardiovascular \nfunction, fluid balance, and metabolism. IL23R is a \nreceptor for the pro-inflammatory cytokine IL-23 and is \nassociated with chronic inflammation, which is \nconsidered to be one of the hallmarks of aging [ 25]. \nAccumulating evidence demonstrated that the \neffectiveness of our approach in addressing various age-\nrelated diseases, as documented in existing literature, \nprovides further validation for our approach. Therefore, \nour unique approach with the amplificati on of \nPandaOmics allows us to identify various potential \ntargets associated with essential aging -driven tissue \nwww.aging-us.com 4653 AGING \n \n \nFigure 2. Validation of age -predictor model using induced pluripotent stem cells (iPSC) and fetal tissues methylation data . \nLeft: Predictions of the multimodal transformer for iPSC induction dataset, days after transfection with reprogramming factors. Right: \nPredictions of the multimodal transformer for embryonic tissue dataset, weeks after last menstruation, averaged across tissues. \n \n \n \nFigure 3. Example of Target ID output for chronic obstructive pulmonary disease. Top-200 genes from expression classifiers were \napplied as a gene list in PandaOmics corresponding project for COPD, and a filter for small molecules was applied to  identify druggable \ntargets. Twenty genes highly ranked by PandaOmics are shown. \n\nwww.aging-us.com 4654 AGING \ndysfunction, which may be useful for the delay and \ntreatment of multiple age-related diseases. \n \nDISCUSSION \n \nThe development of “ aging clocks,” based on machine \nlearning models that predict age based on biological \ndata, has become a major milestone in aging research. \nNevertheless, such an approach has severe limitations, \nsuch as a lack of ability to explain biological processes \naccompanied by aging and, t hus, the ability to propose  \ntherapeutic interventions to compensate for age -related \ndeterioration [ 26]. Additionally, aging clocks can be \nused to monitor the effectiveness of interventions and \ntherapies designed to target age -related diseases [ 27]. \nFor example, if an intervention is able to slow down the \naging process, as measured by the aging clock, it may \nbe more likely to be effective in delaying or treating \nage-related diseases. This can be done by comparing the \naging clock values of an individual befor e and after the \nintervention and measuring the change in the aging \nclock value, which may indicate the effectiveness of the \nintervention. The development of Precious1GPT, a \nmultimodal aging clock using a transformer -based \nmodel and transfer learning for ca se-control \nclassification, as well as the identification of potential \ntherapeutic targets for age- related diseases through \nfeature importance analysis, has demonstrated the \npotential of our approach in deciphering the molecular \nmechanisms of aging. The tra nsformer-based model \nallowed for the integration of multi- omics data and \nimproved the accuracy of the aging clock, while the \ntransfer learning approach facilitated the identification \nof disease -related genes in the context of aging. \nHowever, our study has several limitations, including \nthe reliance on publicly available datasets, which may \ncontain noisy and low -quality data. Future research \nshould focus on validating the identified targets using \nexperimental methods and exploring the potential of \nnew drug targets. \n \nSeveral aging clocks have been proposed in the \nliterature, each with its own strengths and limitations. \nSome of the most prominent aging clocks include the \nEpigenetic Clock, DNAm PhenoAge, and the \ntranscriptomic-based Aging.AI clock [ 28–31]. These \nclocks utilize various molecular markers, such as DNA \nmethylation or gene expression patterns, to predict an \nindividual’s chronological age. Our proposed \nmultimodal aging clock uses a transformer-based model \nand transfers learning to integrate divers e data sources, \nincluding epigenetic and transcriptomic data, and to \npredict age with high accuracy. When compared to \nexisting aging clocks, our approach demonstrates \nseveral advantages. First, the multimodal nature of our \napproach enables the integration of different omics data \ntypes, leading to a more comprehensive and accurate \nassessment of an individual ’s biological age. By \nincorporating multiple data types, our aging clock can \ncapture a wider range of molecular changes associated \nwith aging, leading to  a more reliable and informative \nmodel. Second, the use of transformer -based deep \nlearning models allows our approach to capturing \ncomplex relationships between features, which can lead \nto improved age prediction accuracy. In contrast, \ntraditional aging clocks like the Epigenetic Clock and \nDNAm PhenoAge rely on linear regression models, \nwhich may not be able to fully capture the complexity \nof age -related molecular changes. Third, our approach \nemploys transfer learning for case-control classification, \nenabling the identification of potential targets for age -\nrelated diseases. This aspect of our method offers a \nsignificant advantage of Precious1GPT over existing \naging clocks, as it not only allows for accurate age \nprediction but also contributes to the discovery of novel \ntherapeutic targets for age-related diseases. \n \nUnexpectedly, our model could not identify the genes \nwhich play key roles in known age -related pathways \n(SIRT, mTOR, and AMPK) as important genes (i.e., \ntop-200) for age prediction. However, such a \nphenomenon was also observed in published DL age \nprediction models [ 32]. To further test if the most \nimportant genes (i.e., top- 100) share any biological \nfeatures, we performed pathway enrichment analysis \nwhich revealed that the list of identified genes is  \nsignificantly enriched in the following pathways that are \nassociated with the aging process: \n \n1. tRNA Processing in Mitochondrion (R -HSA-\n6785470): This pathway is involved in the processing of \ntransfer RNAs (tRNAs) within the mitochondria, which \nis essent ial for proper mitochondrial protein synthesis \nand overall mitochondrial function. Mitochondrial \ndysfunction has been implicated in the aging process \nand age -related diseases, such as neurodegenerative \ndisorders and metabolic syndromes [33]. \n \n2. Amino Acid  Transport Across Plasma Membrane \n(R-HSA-352230): This pathway describes the transport \nof amino acids across the plasma membrane, a crucial \nprocess for maintaining cellular homeostasis and protein \nsynthesis. Dysregulation of amino acid transport may \nlead to imbalances in protein synthesis and degradation, \nwhich could contribute to cellular senescence, a \nhallmark of aging [25]. \n \n3. Suppression of Apoptosis (R -HSA-9635465): This \npathway is involved in the regulation of apoptosis, a \ncrucial cellular process th at controls cell death and \ntissue homeostasis. Dysregulation of apoptosis has been \nlinked to aging and age -related diseases such as cancer, \nwww.aging-us.com 4655 AGING \nneurodegenerative disorders, and cardiovascular \ndiseases [34]. \n \n4. Vasopressin-like Receptors (R -HSA-388479): This \npathway focuses on the signaling of vasopressin- like \nreceptors, which play a role in water homeostasis, blood \npressure regulation, and stress response. Alterations in \nthese processes have been associated with age- related \nphysiological changes, such as decreased stress \nresilience and increased risk of hypertension [35]. \n \n5. Highly Sodium Permeable Postsynaptic \nAcetylcholine Nicotinic Receptors (R -HSA-629587): \nThis pathway deals with the function of acetylcholine \nnicotinic receptors, whic h are involved in \nneurotransmission and neuromuscular function. \nImpairment of neurotransmission and synaptic function \nhas been implicated in aging and age -related \nneurodegenerative disorders, such as Alzheimer's and \nParkinson’s diseases [36]. \n \n6. Cytosolic Sulfonation of Small Molecules (R-HSA-\n156584): This pathway describes the process of \ncytosolic sulfonation, a phase II detoxification reaction \nthat helps to maintain cellular redox homeostasis and \nprotects cells from oxidative stress. Oxidative stress has \nbeen widely recognized as a major contributor to the \naging process and the development of age -related \ndiseases. \n \nThe transfer learning approach utilized in this study \nenabled the construction of aging- centered case-control \nclassifiers. These models were u sed to obtain lists of \ngenes ranked by both their association with aging and \ndiseases. Fibrotic disease, inflammatory disease, \nneurological disease, and cardiovascular disease are \ncommon disease classes in humans. To represent these \ncategories, we have sel ected different age- related \ndiseases, including idiopathic pulmonary fibrosis, \nCOPD, PD, and heart failure, for each disease class. \nWith the application of PandaOmics, APLNR, and \nIL23R are identified as the most potential aging targets \nfor delaying and tre ating multiple age -related diseases. \nAPLNR was in top -20 predictions for all four selected \ndiseases. A declining Apelin/APLNR signaling \npromotes aging, whereas its restoration extended \nhealthspan [ 37], and endogenous Apelin is protective \nagainst age-related loss of retinal ganglion cells in mice \n[38], further revealing its critical role in regulating \naging. While the expression of both Apelin and APLNR \ndecreases with increasing age [ 37], agonism of apelin \nreceptors produces beneficial effects in fibrotic, \ncardiovascular, and cognitive disorders [ 39–41]. Taken \ntogether, targeting Apelin- APLNR signaling represents \na very promising approach for the treatment of \nmultiple age-related complications. Another potential \nmulti-disease target that was in top -20 predict ions for \nCOPD, PD, and heart failure is IL23R, a receptor for \nIL-23 pro- inflammatory cytokine. Upregulation of the \np19 subunit expression and IL -23 protein production in \ndendritic cells was observed in aged mice and may \nrepresent a potential mechanism for inadequate \ninflammatory responses in aging [ 42]. In the COPD \nmurine model, IL -23\n−/− mice developed significantly \nlower static compliance values and decreased \nemphysematous changes in the lung tissue compared to \nWT mice [43]. Though the role of IL-23 is understudied \nin PD, neuroinflammation is a typical pathological \nfeature of many neurodegenerative diseases, while \nemerging evidence indicates that sustained activation of \nmicroglia and astrocytes is central to dopaminergic \ndegeneration in PD [44]. IL -23 can a lso enhance age -\nassociated inflammation in Alzheimer ’s disease [ 45], \nlikely to cause the accumulation of cellular damage and \ncompromise the body’s ability to repair itself. Local \nproduction of IL-23 in the Central Nervous System has \nbeen demonstrated for a strocytes and infiltrating \nmacrophages under inflammatory conditions [ 46]. \nAltogether, agonizing Apelin/APLNR signaling and \nantagonizing IL23/IL23R axis may serve as potential \ntherapeutic strategies for delaying and treating multiple \nage-related complications . These findings provide \ninsights into potential targets for the delay and treatment \nof age-related diseases and demonstrate the utility of the \ntransfer learning approach in identifying important \ngenes associated with age-related dysfunction. \n \nAs there is a huge bet on AI and transformer \napplications in biomedicine, we expect future studies to \nfocus on developing further the approach proposed in \nthis paper, including possible integration of larger \nproprietary disease -specific datasets and validation of \nthe identified targets in the wet lab setting. Moreover, \nexploring the potential of new drug targets and \noptimizing our model’s performance will be crucial for \nadvancing our understanding of the molecular \nmechanisms of aging and developing reliable \ninterventions for age -related diseases. Ultimately, there \nis a great hope that Precious1GPT and its continued \ndevelopment and refinement will contribute \nsignificantly to the improvement of human health and \nlongevity. \n \nMATERIALS AND METHODS \n \nData sources fo r multimodal aging clock \ndevelopment \n \nTo train our models, we used several datasets, including \npublicly available and in -house-built ones. For training \nage prediction models based on the epigenetic status of \ntissue, we employed 450 k Illumina Methylation a rray \nwww.aging-us.com 4656 AGING \ndata from EWAS Data Hub [ 47] (number of samples = \n8,374). \n \nFor building age prediction models based on the \ntranscriptomics status of tissue, we employed RNA -\nSequencing data from the GTEx project [48] (number of \nsamples = 12,453). We trained our models  in a tissue -\nagnostic fashion. For methylation, data distribution of \nsamples across ages is shown in Supplementary Figure \n5A and across tissues in Supplementary Figure 5B . For \nexpression data, distribution of samples across ages is \nshown in Supplementary F igure 6 A, across tissues in \nSupplementary Figure 6B. \n \nFor assessing prediction results and predicting disease \ntargets using age -pretrained models, we used custom \ndatasets from the PandaOmics software [ 49] for 4 \nselected age- related diseases: idiopathic pulmonary \nfibrosis, COPD, PD, and heart failure from where we \nhave obtained samples annotated as carrying disease \n(case samples) and healthy ones (control samples). \n \nTo evaluate possible interventions to prevent \nsenescence development, we have constructed dat asets \ncontaining only features corresponding to genes for \nwhich approved drugs exist. For this, we have used an \nin-house constructed database of approved drugs and \ntheir targets based on the information from [50]. \n \nAs input features for our age prediction models were \neither beta values averaged across CpG probes \nannotated as TS200 region from Illumina 450k \nMethylation Array for epigenomic data or TPM values \nfor protein coding (genes) for expression datasets \naccordingly. \n \nFor the DNA methylation data, we obt ained the ß-\nvalues from the CNCB data hub, where the raw data \nwere obtained using the GMQN package developed by \nthe CNCB [47]. \n \nIn our study, we have opted for the TSS200 region as \nthe most interpretable for age prediction. Following the \naggregation of corresponding beta -values, we are left \nwith approximately 14,000 features representing \naverage methylation of proximal promoter regions. \n \nThis choice of region is based on its potential to offer \na more accurate and comprehensive assessment of age -\nrelated changes in methylation patterns. The TSS200 \nregion, situated within 200 base pairs upstream of the \ntranscription start site, is known to play a crucial role \nin gene regulation [ 51]. As such, it is expected to \nexhibit significant age -related c hanges in methylation \npatterns, providing a robust basis for predicting \nbiological age. \nTo further enhance the interpretability of our age \nprediction model, we utilized machine learning \ntechniques to identify and select the most informative \nfeatures from t he 14,000-feature dataset. This allowed \nus to refine our model, ensuring that it captures the most \nrelevant age-related methylation changes in the TSS200 \nregion. In addition, the selected features can potentially \nshed light on the molecular mechanisms unde rlying \naging, as well as the development of age -related \ndiseases. \n \nBy focusing on the TSS200 region, we aim to not only \nimprove the accuracy of our aging clock but also gain a \ndeeper understanding of the complex relationship \nbetween DNA methylation, aging, and age -dependent \ndiseases. This knowledge can then be used to develop \ntargeted therapeutic interventions aimed at mitigating \nthe impact of age -related diseases and improving \noverall health and quality of life in aging populations. \n \nFor gene expression models, we have used TPM values \nwhich were back -corrected using ComBat [ 52] and \nquantile-normalized using qnorm [53]. For performance \nevaluations, we employed a shuffle split stratified by \nsample tissue, leaving 20% of all data for the test set. \n \nTransformer-based model for multimodal aging \nclock \n \nGiven the abundance of omics data available for various \nexperimental conditions and the distinct challenges of \npredicting one omic data type from another, we propose \nthe development of a transformer -based model to \nestimate sample age across different sample types. This \nmulti-tissue, multi- omics transformer -based age \nprediction model aims to harness the power of deep \nlearning to effectively integrate diverse data sources and \nimprove age prediction accuracy. \n \nTransformers have demonstrated remarkable success in \nvarious applications, particularly in natural language \nprocessing tasks. Their capacity to model long- range \ndependencies and capture complex relationships among \nfeatures makes them well -suited for multi- omics data \nintegration. By leveraging the transformer architecture, \nour proposed model is able to identify and exploit \nrelevant information from different omics data types, \nsuch as genomics, transcriptomics, proteomics, and \nmetabolomics, as well as different tissue types. \n \nBy developing a multi -tissue, multi-omics transformer-\nbased age prediction model, we hope to enhance the \naccuracy and generalizability of aging clocks, \nultimately contributing to a better understanding of the \naging process and facilitating the development of \ntargeted therapies for age-related diseases. \nwww.aging-us.com 4657 AGING \nMore formally about the transformer model. Let 𝑋𝑋 be \nthe input matrix of size (N, D) containing epigenetic \n(methylation) and expression data, and Z  be the input \nmatrix of size (N, M) containing categorical data. Let Y \nbe the output matrix of size (N, 1)  containing the \npredicted age values. Since we used TabTransformer \n(LINK), we represented the model as a function F that \ntakes X and Z as input and returns Y as output:  Y = F \n(X, Z). The model consists of multiple linear and \nattention layers, each of which applies a set of \nlearnable parameters to the input and produces an \noutput. We represent each layer as a function G that \ntakes an input matrix  A and a set of  \nlearnable parameters  W and b, and produces an output \nmatrix: \n \n \n()\n( )( )\n()\nB : B G A,W ,b\nRe LU AW b B G A,W ,b\nRe LU AW b\n= =\n+= =\n+\n \n \nThe TabTransformer [54] model consists of multiple \nlayers, including self -attention layers and feedforward \nlayers. Let A be the output of the previous layer, and let \nW\nq, Wk, and Wv be learnable weight matrices of size (D, \ndk). The self -attention layer computes the attention \nmatrix A’ as follows: \n \n \nT\nqk\nvv\nk\nAW (W )A soft max W O A W\nd\n′′= =\n \n \nwhere Wq, Wk, and W v are weight matrices of size ( D, \ndk). The feedforward layer computes the output matrix  \nH as follows: \n \n ( ) ( ) H G O ,W ,b ReLU OW b= = +11 1 1  \n \nwhere W1 is a weight matrix of size  (h, dh), and b1 is a \nbias vector of size  (1, dh). We repeat the self -attention \nand feedforward layers multiple times to create a deep \nTabTransformer model. Next, we apply a feedforward \nlayer with weight matrix W1 and bias b1 to the output of \nthe self-attention layer: H = ReLU (OW1 + b1). Finally, \nwe apply a linear layer with weight matrix  W2 and bias \nb2 to the output of the last feedforward layer to produce \nthe final output matrix Y: \n \n Y HW b= + 22  \n \nTo train the TabTransformer model, we used mean \nsquared error (MSE) loss that measures the difference \nbetween the predicted age values and the true age \nvalues. Let 𝑌𝑌� be the predicted age values and Ytrue be the \ntrue age values: \n ()\nN\nl true ,i\ni\nˆL YYN =\n= −∑\n2\n1\n1\n \n \nOverall, the experiment involves training a \nTabTransformer model on a dataset containing \nepigenetic (methylation) and expression data, as well as \ncategorical data (tissue and dataset type), to predict age \nvalues. The model consists of multiple layers, in cluding \nself-attention and feedforward layers, and is trained \nusing a loss function such as MSE. \n \nIn the present study, we utilized PyTorch Tabular [ 55], \nwhich is built on top of PyTorch, for all the work with the \ntransformer. PyTorch Tabular provides a hi ghly \noptimized and efficient way of handling tabular data with \nPyTorch. We used PyTorch Tabular’s various functions \nand modules to preprocess the input data, construct the \ntransformer architecture, and train it on the data. \n \nIn the model, all the hyperpara meters, such as learning \nrate, dropout rate, number of hidden layers, and \nactivation functions, were determined through the use of \nOptuna [23], a hyperparameter optimization framework. \nThe values of these parameters were chosen based on \ntheir performance d uring multiple rounds of training \nand validation. Based on our experiments, the optimal \nhyperparameters for TabTransformer are a model \narchitecture with hidden layers of size 128, 2048, and \n128, dropout probability of 0, “ELU” activation \nfunction, a learni ng rate of 0.00023, “ AdamW” \noptimizer, weight decay of 0, and a batch size of 96. \n \nTransfer learning for case-control classification \n \nTo build models which take into account both senescent \nand clinical status, we employed a transfer learning \nstrategy. Initially, we trained a model as a regressor to \npredict age in an age dataset. Subsequently, we froze \nthe model weights, excluding the final layer, and re -\ntrained the resulting model as a case- control classifier. \nThe derived SHAP values indicate the significance of \neach molecular feature in disease development \nconcerning aging. This approach enabled us to \ndetermine the relative importance of various molecular \nfeatures in driving disease development within the \naging context. The pipeline is depicted in Figure 1. \n \nFeature importance analysis \n \nSHAP values, a mathematical method of feature \nimportance analysis that constitutes a robust and \ninterpretable technique for elucidating the contributions \nof individual features in complex predictive models, is \nbased on the Shapley value from game theory and \ninvolves computing the contribution of each feature to \nwww.aging-us.com 4658 AGING \nexplain the final predictions of machine learning models \n[24]. SHAP values explain individual predictions and \nidentify the most important features in the model. \nAdditionally, the employment of SHAP values for \nfeature analysis offers a considerable advantage in \nmultimodal settings, where discerning the interplay \nbetween various factors is indispensable for the \ndevelopment of accurate and efficacious aging clocks. \n \nPathway enrichment analysis \n \nPathway enrichment analysis was performed on the list \nof top-100 genes ranked by their SHAP values obtained \nfrom the regressor model with the pathways available \non the Reactome database. R package Enrichr was used \nto calculate the enrichment levels and p- values. \nPathways with p-value < 0.05 were considered as \nsignificantly enriched. \n \nManual analysis of resulting targets \n \nCombination of aging clocks and target ID represents an \ninteresting approach to identifying targets for aging-\nassociated diseases. To illustrate the applicability of this \napproach for target identification, we have investigated \n4 diseases associated with aging: idiopathic pulmonary \nfibrosis, chronic obstructive pulmonary disease \n(COPD), Parkinson’s disease (PD), and heart failure in \nPandaOmics. Gene lists of top -200 genes ranked by \nexpression classifiers were used in Target ID projects \nfor the mentioned diseases, along with a filter for small \nmolecules to identify potential druggable proteins \nacross these lists. \n \nAbbreviations \n \nAI: Artificial intelligence; COPD: Chronic Obstructive \nPulmonary Disease; DNN: Deep Neural Network; DL: \nDeep Learning; iPSC: induced Pluripotent Stem Cells; \nML: Machine Learning; PD: Parkinson’s Disease; \nSHAP: SHapley Additive exPlanations. \n \nAUTHOR CONTRIBUTIONS \n \nAU – Software, methodology, project administration, \nwriting (reviewing and editing), model optimization, DS \n– Writing, software, methodology, data processing, DZ \n– Data curation, manuscript reviewing, EK –  Data \ncuration, reviewing, AK – Data collection, resources, \nSP – Software, methodology, VN – Writing (reviewing \nand editing), supervision, VS –  Writing, methodology, \nformal analysis, GL and HL – Writing (reviewing and \nediting), FP – Data curation, Writing (reviewing and \nediting), IO –  Writing (reviewing and edit ing), \nsupervision, AA – Writing (reviewing and editing), \nsupervision, FR – Conceptualization, resources, \nsupervision, AZ – Conceptualization, resources, \nsupervision. \n \nACKNOWLEDGMENTS \n \nWe greatly thank Elizaveta Ekimova for her kind help \nwith the preparation of the figures. \n \nCONFLICTS OF INTEREST \n \nThe authors are affiliated with Insilico Medicine, a \ncommercial company developing and using generative \nartificial intelligence and other next- generation AI \ntechnologies and robotics for drug discovery, drug \ndevelopment, and aging research. Utilizing its \ngenerative AI platform and a range of deep aging \nclocks, Insilico Medicine has developed a portfolio of \nmultiple therapeutic programs targeting fibrotic \ndiseases, cancer, immunological diseases, and a range \nof age-related diseases. \n \nFUNDING \n \nThis study received no specific grant from any funding \nagency in the public, commercial, or not -for-profit \nsectors. \n \nREFERENCES \n \n1. Moskalev AA , Aliper AM , Smit-McBride Z , Buzdin A , \nZhavoronkov A. Genetics and epigenetics of aging and \nlongevity. Cell Cycle. 2014; 13:1063–77. \nhttps://doi.org/10.4161/cc.28433 \nPMID:24603410 \n2. Putin E , Mamoshina P , Aliper A, Korzinkin M , \nMoskalev A, Kolosov A, Ostrovskiy A, Cantor C, Vijg J, \nZhavoronkov A . Deep biomarkers of human aging: \nApplication of deep neural networks to biomarker \ndevelopment. Aging (Albany NY). 2016; 8:1021–33. \nhttps://doi.org/10.18632/aging.100968 \nPMID:27191382 \n3. Zhavoronkov A , Mamoshina P . Deep Aging Clocks: \nThe Emergence of AI -Based Biomarkers of Aging and \nLongevity. Trends Pharmacol Sci. 2019; 40:546–9. \nhttps://doi.org/10.1016/j.tips.2019.05.004 \nPMID:31279569 \n4.  Mamoshina P , Vieira A, Putin E , Zhavoronkov A . \nApplications of Deep Learning in Biomedicine.  Mol \nPharm. 2016; 13:1445–54. \nhttps://doi.org/10.1021/acs.molpharmaceut.5b00982 \nPMID:27007977 \n5.  Zhavoronkov A , Li R, Ma C , Mamoshina P . Deep \nbiomarkers of aging and longevity: from research to \napplications. Aging (Albany NY). 2019; 11:10771–80. \nwww.aging-us.com 4659 AGING \nhttps://doi.org/10.18632/aging.102475 \nPMID:31767810 \n 6. Mamoshina P , Kochetov K , Putin E , Cortese F, Aliper \nA, Lee WS , Ahn SM , Uhn L , Skjodt N, Kovalchuk O , \nScheibye-Knudsen M , Zhavoronkov A . Population \nSpecific Biomarkers of Human Aging: A Big Data Study \nUsing South Korean, Canadian, and Eastern European \nPatient Populations.  J Gerontol A Biol Sci Med Sci . \n2018; 73:1482–90. \nhttps://doi.org/10.1093/gerona/gly005 \nPMID:29340580 \n 7. Pun FW , Leung GHD , Leung HW , Liu BHM , Long X, \nOzerov IV , Wang J , Ren F , Aliper A, Izumchenko E , \nMoskalev A , de Magalhães JP , Zhavoronkov A . \nHallmarks of aging -based dual -purpose disease and \nage-associated targets predicted using PandaOmics \nAI-powered discovery engine.  Aging (Albany NY) . \n2022; 14:2475–506. \nhttps://doi.org/10.18632/aging.203960 \nPMID:35347083 \n 8. Marino N , Putignano G , Cappilli S, Chersoni E , \nSantuccione A, Calabrese G , Bischof E , Vanhaelen Q , \nZhavoronkov A , Scarano B , Mazzotta AD , Santus E . \nTowards AI -driven longevity research: An overview.  \nFront Aging. 2023; 4:1057204. \nhttps://doi.org/10.3389/fragi.2023.1057204 \nPMID:36936271 \n 9. Aliper A, Plis S, Artemov A , Ulloa A, Mamoshina P , \nZhavoronkov A . Deep Lear ning Applications for \nPredicting Pharmacological Properties of Drugs and \nDrug Repurposing Using Transcriptomic Data.  Mol \nPharm. 2016; 13:2524–30. \nhttps://doi.org/10.1021/acs.molpharmaceut.6b00248 \nPMID:27200455 \n10. Shayakhmetov R, Kuznetsov M, Zhebrak A, Kadurin A, \nNikolenko S , Aliper A, Polykovskiy D . Erratum: \nAddendum: Molecular Generation for Desired \nTranscriptome Changes With Adversarial \nAutoencoders. Front Pharmacol. 2020; 11:1236. \nhttps://doi.org/10.3389/fphar.2020.01236 \nPMID:32973498 \n11. Aliper A, Zavo ronkovs A, Zhebrak A, Kadurin A, \nPolykovskiy D, Shayakhmetov R. Mutual information \nadversarial autoencoder. US11403521B2 . 2022. \nhttps://patents.google.com/patent/US11403521B2/en/. \n12. Moore JH, Raghavachari N, and Workshop Speakers. \nArtificial Intelligence Based Approaches to Identify \nMolecular Determinants of Exceptional Health and Life \nSpan-An Interdisciplinary Workshop at the National \nInstitute on Aging. Front Artif Intell. 2019; 2:12. \nhttps://doi.org/10.3389/frai.2019.00012 \nPMID:33733101 \n13. Kadurin A , Nikolenko S , Khrabrov K , Aliper A, \nZhavoronkov A . druGAN: An Advanced Generative \nAdversarial Autoencoder Model for de Novo \nGeneration of New Molecules with Desired Molecular \nProperties in Silico. Mol Pharm. 2017; 14:3098–104. \nhttps://doi.org/10.1021/acs.molpharmaceut.7b00346 \nPMID:28703000 \n14. Putin E , Asadulaev A , Ivanenkov Y , Aladinskiy V, \nSanchez-Lengeling B, Aspuru-Guzik A, Zhavoronkov A. \nReinforced Adversarial Neural Computer for de Novo \nMolecular Design. J Chem Inf Model . 2018; 58:1194–\n204. \nhttps://doi.org/10.1021/acs.jcim.7b00690 \nPMID:29762023 \n15. Polykovskiy D , Zhebrak A , Vetrov D , Ivanenkov Y , \nAladinskiy V, Mamoshina P, Bozdaganyan M, Aliper A, \nZhavoronkov A , Kadurin A. Entangled Conditional \nAdversarial Autoencoder for de Novo Drug Discovery.  \nMol Pharm. 2018; 15:4398–405. \nhttps://doi.org/10.1021/acs.molpharmaceut.8b00839 \nPMID:30180591 \n16. Galkin F, Mamoshina P , Aliper A, de Magalhães JP , \nGladyshev VN, Zhavoronkov A . Biohorology and \nbiomarkers of aging: Current state -of-the-art, \nchallenges and opportunities.  Ageing Res Re v. 2020; \n60:101050. \nhttps://doi.org/10.1016/j.arr.2020.101050 \nPMID:32272169 \n17. Galkin F, Mamoshina P, Aliper A, Putin E, Moskalev V, \nGladyshev VN, Zhavoronkov A . Human Gut \nMicrobiome Aging Clock Based on Taxonomic \nProfiling and Deep Learning.  iScience. 2020; \n23:101199. \nhttps://doi.org/10.1016/j.isci.2020.101199 \nPMID:32534441 \n18. Zhavoronkov A , Mamoshina P , Vanhaelen Q , \nScheibye-Knudsen M , Moskalev A , Aliper A. Artificial \nintelligence for aging and longevity research: Recent \nadvances and perspectives.  Ageing Res Rev . 2019; \n49:49–66. \nhttps://doi.org/10.1016/j.arr.2018.11.003 \nPMID:30472217 \n19. Galkin F, Mamoshina P , Kochetov K , Sidorenko D , \nZhavoronkov A . DeepMAge: A Methylation Aging \nClock Developed with Deep Learning.  Aging Dis. 2021; \n12:1252–62. \nhttps://doi.org/10.14336/AD.2020.1202 \nPMID:34341706 \n20. MacRae SL , Croken MM , Calder RB , Aliper A, \nMilholland B , White RR, Zhavoronkov A , Gladyshev \nVN, Seluanov A , Gorbunova V , Zhang ZD , Vijg J. DNA \nrepair in species with extreme lifespan differences.   \n \nwww.aging-us.com 4660 AGING \nAging (Albany NY). 2015; 7:1171–84. \nhttps://doi.org/10.18632/aging.100866 \nPMID:26729707 \n21. Zhavoronkov A, Buzdin AA, Garazha AV, Borisov NM, \nMoskalev AA. Signaling pathway cloud regulation for \nin silico screening and ranking of the potential \ngeroprotective drugs. Front Genet. 2014; 5:49. \nhttps://doi.org/10.3389/fgene.2014.00049 \nPMID:24624136 \n22. Aliper A, Belikov AV, Garazha A , Jellen L, Artemov A, \nSuntsova M, Ivanova A, Venkova L, Borisov N, Buzdin \nA, Mamoshina P, Putin E, Swick AG, et al. In search for \ngeroprotectors: in sili co screening and in vitro \nvalidation of signalome -level mimetics of young \nhealthy state. Aging (Albany NY). 2016; 8:2127–52. \nhttps://doi.org/10.18632/aging.101047 \nPMID:27677171 \n23. Akiba T, Sano S, Yanase T, Ohta T, Koyama M. \nOptuna: A Next -generation Hyperparameter \nOptimization Framework. 2019.  \nhttps://doi.org/10.48550/arXiv.1907.10902 \n24. Lundberg S, Lee SI. A Unified Approach to Interpreting \nModel Predictions. 2017.  \nhttps://doi.org/10.48550/arXiv.1705.07874 \n25. Canfield CA, Bradshaw PC. Amino acids in the \nregulation of aging and ag ing-related diseases. Transl \nMed Aging. 2019; 3:70–89. \nhttps://doi.org/10.1016/j.tma.2019.09.001 \n26. Holzscheck N, Falckenhayn C, Söhle J, Kristof B, Siegner \nR, Werner A, Schössow J, Jürgens C, Völzke H, Wenck \nH, Winnefeld M , Grönniger E , Kaderali L . Modeling \ntranscriptomic age using knowledge -primed artificial \nneural networks. NPJ Aging Mech Dis. 2021; 7:15. \nhttps://doi.org/10.1038/s41514-021-00068-5 \nPMID:34075044 \n27. Buckley MT, Sun ED, George BM, Liu L, Schaum N, Xu \nL, Reyes JM, Goodell MA, Weissman IL, Wyss-Coray T, \nRando TA, Brunet A. Cell-type-specific aging clocks to \nquantify aging and rejuvenation in neurogenic regions \nof the brain. Nat Aging. 2023; 3:121–37. \nhttps://doi.org/10.1038/s43587-022-00335-4 \nPMID:37118510 \n28. Horvath S . DNA methylation age of human tissues \nand cell types. Genome Biol. 2013; 14:R115. \nhttps://doi.org/10.1186/gb-2013-14-10-r115 \nPMID:24138928 \n29. Hannum G , Guinney J , Zhao L , Zhang L , Hughes G , \nSadda S , Klotzle B , Bibikova M , Fan JB, Gao Y , \nDeconde R, Chen M, Rajapakse I, et al. Genome-wide \nmethylation profiles reveal quantitativ e views of \nhuman aging rates. Mol Cell. 2013; 49:359–67. \nhttps://doi.org/10.1016/j.molcel.2012.10.016 \nPMID:23177740 \n30. Levine ME , Lu AT , Quach A , Chen BH , Assimes TL , \nBandinelli S, Hou L , Baccarelli AA, Stewart JD , Li Y , \nWhitsel EA, Wilson JG, Reiner AP, et al. An epigenetic \nbiomarker of aging for lifespan and healthspan.  Aging \n(Albany NY). 2018; 10:573–91. \nhttps://doi.org/10.18632/aging.101414 \nPMID:29676998 \n31. Liu Z, Leung D, Thrush K, Zhao W, Ratliff S, Tanaka T, \nSchmitz LL , Smith JA , Ferrucci L, Levine ME . \nUnderlying features of epigenetic aging clocks in vivo \nand in vitro. Aging Cell. 2020; 19:e13229. \nhttps://doi.org/10.1111/acel.13229 \nPMID:32930491 \n32. de Lima Camillo LP, Lapierre LR, Singh R. A pan -tissue \nDNA-methylation epigenetic clock based on deep \nlearning. npj Aging. 2022; 8:1–15. \nhttps://doi.org/10.1038/s41514-022-00085-y \n33. Amorim JA, Coppotelli G, Rolo AP, Palmeira CM, Ross \nJM, Sinclair DA. Mitochondrial and metabolic \ndysfunction in ageing and age -related diseases.  Nat \nRev Endocrinol. 2022; 18:243–58. \nhttps://doi.org/10.1038/s41574-021-00626-7 \nPMID:35145250 \n34. Tower J. Programmed cell death in aging.  Ageing Res \nRev. 2015; 23:90–100. \nhttps://doi.org/10.1016/j.arr.2015.04.002 \nPMID:25862945 \n35. Birder LA , Wolf-Johnston AS , Jackson EK , Wein AJ , \nDmochowski R. Aging incre ases the expression of \nvasopressin receptors in both the kidney and urinary \nbladder. Neurourol Urodyn. 2019; 38:393–7. \nhttps://doi.org/10.1002/nau.23830 \nPMID:30311671 \n36. Takata K , Kimura H , Yanagisawa D , Harada K , \nNishimura K , Kitamura Y , Shimohama S , Tooyama I . \nNicotinic Acetylcholine Receptors and Microglia as \nTherapeutic and Imaging Targets in Alzheimer's \nDisease. Molecules. 2022; 27:2780. \nhttps://doi.org/10.3390/molecules27092780 \nPMID:35566132 \n37. Rai R, Ghosh AK, Eren M, Mackie AR, Levine DC, Kim \nSY, Cedernaes J , Ramirez V , Procissi D, Smith LH , \nWoodruff TK, Bass J, Vaughan DE. Downregulation of \nthe Apelinergic Axis Accelerates Aging, whereas Its \nSystemic Restoration Improves the Mammalian \nHealthspan. Cell Rep. 2017; 21:1471–80. \nhttps://doi.org/10.1016/j.celrep.2017.10.057 \nPMID:29117554 \n38. Ishimaru Y , Sumino A , Shibagaki F, Yamamuro A , \nYoshioka Y, Maeda S. Endogenous Apelin Is Protective \nAgainst Age-Associated Loss of Retinal Ganglion Cells \nwww.aging-us.com 4661 AGING \nin Mice. Front Aging Neurosci. 2020; 12:58. \nhttps://doi.org/10.3389/fnagi.2020.00058 \nPMID:32296325 \n39. Wang H, Cong L, Yin X, Zhang N, Zhu M, Sun T, Fan J, \nXue F , Fan X , Gong Y . The Apelin -APJ axis alleviates \nLPS-induced pulmonary fibrosis and endothelial \nmesenchymal transformation in mice by promoting \nAngiotensin-Converting Enzyme 2.  Cell Signal . 2022; \n98:110418. \nhttps://doi.org/10.1016/j.cellsig.2022.110418 \nPMID:35882286 \n40. Zhou Q , Chen L , Tang M , Guo Y , Li L . Apelin/APJ \nsystem: A novel promising target for anti -aging \nintervention. Clin Chim Acta. 2018; 487:233–40. \nhttps://doi.org/10.1016/j.cca.2018.10.011 \nPMID:30296443 \n41. Luo H , Han L , Xu J . Apelin/APJ system: A novel \npromising target for neurodegenerative diseases.  J \nCell Physiol. 2020; 235:638–57. \nhttps://doi.org/10.1002/jcp.29001 \nPMID:31254280 \n42. El Mezayen R , El Gazzar M , Myer R , High KP . Aging-\ndependent upregulation of IL -23p19 gene expression \nin dendritic cells is associated with differential \ntranscription factor binding and histone \nmodifications. Aging Cell. 2009; 8:553–65. \nhttps://doi.org/10.1111/j.1474-9726.2009.00502.x \nPMID:19624579 \n43. Fujii U, Miyahara N, Taniguchi A, Waseda K, Morichika \nD, Kurimoto E, Koga H , Kataoka M , Gelfand EW , Cua \nDJ, Yoshimura A , Tanimoto M , Kanehiro A. IL-23 Is \nEssential for the Development of Elastase- Induced \nPulmonary Inflammation and Emphysema.  Am J \nRespir Cell Mol Biol. 2016; 55:697–707. \nhttps://doi.org/10.1165/rcmb.2016-0015OC \nPMID:27351934 \n44. MacMahon Copas AN , McComish SF, Fletcher JM , \nCaldwell MA . The Pathogenesis of Parkinson's \nDisease: A Complex Interplay Between Astrocytes, \nMicroglia, and T Lymphocytes?  Front Neurol . 2021; \n12:666737. \nhttps://doi.org/10.3389/fneur.2021.666737 \nPMID:34122308 \n45. Mohammadi Shahrokhi V , Ravari A, Mirzaei T , Zare-\nBidaki M, Asadikaram G, Arababadi MK. IL-17A and IL-\n23: plausible risk factors to induce age -associated \ninflammation in Alzheimer's disease.  Immunol Invest. \n2018; 47:812–22. \nhttps://doi.org/10.1080/08820139.2018.1504300 \nPMID:30081688 \n46. Nitsch L , Schneider L , Zimmermann J , Müller M . \nMicroglia-Derived Interleukin 23: A Crucial Cytokine in \nAlzheimer's Disease? Front Neurol. 2021; 12:639353. \nhttps://doi.org/10.3389/fneur.2021.639353 \nPMID:33897596 \n47. Xiong Z, Li M, Yang F, Ma Y, Sang J, Li R, Li Z, Zhang Z, \nBao Y . EWAS Data Hub: a resource of DNA \nmethylation array data and metadata.  Nucleic Acids \nRes. 2020; 48:D890–5. \nhttps://doi.org/10.1093/nar/gkz840 \nPMID:31584095 \n48. Lonsdale J, Thomas J, Salvatore M, Phillips R, Lo E, \nShad S, Hasz R, Walters G, Garcia F, Y oung N, Foster \nB, Moser M, Karasik E, et al , and GTEx Consortium . \nThe Genotype -Tissue Expression (GTEx) project.  Nat \nGenet. 2013; 45:580–5. \nhttps://doi.org/10.1038/ng.2653 \nPMID:23715323 \n49. PandaOmics Insilico Medicine. \n https://insilico.com/pandaomics. \n50. Home - ClinicalTrials.gov. https://clinicaltrials.gov/. \n51. Tang J, Zou J, Zhang X, Fan M, Tian Q, Fu S, Gao S, Fan \nS. PretiMeth: precise prediction models for DNA \nmethylation based on single methylation mark.  BMC \nGenomics. 2020; 21:364. \nhttps://doi.org/10.1186/s12864-020-6768-9 \nPMID:32414326 \n52. Zhang Y , Parmigiani G , Johnson WE . ComBat-seq: \nbatch effect adjustment for RNA -seq count data. NAR \nGenom Bioinform. 2020; 2:lqaa078. \nhttps://doi.org/10.1093/nargab/lqaa078 \nPMID:33015620 \n53. van der Sande M, van Heeringen S. qnorm. 2021. \nhttps://github.com/Maarten-vd-Sande/qnorm. \n54. Huang X, Khetan A, Cvitkovic M, Karnin Z. \nTabTransformer: Tabular Data Modeling Using \nContextual Embeddings. 2020.  \nhttps://doi.org/10.48550/arXiv.2012.06678 \n55. Joseph M. PyTorch Tabular: A Framework for Deep \nLearning with Tabular Data. 2021. \nhttps://doi.org/10.48550/arXiv.2104.13638  \n \nwww.aging-us.com 4662 AGING \nSUPPLEMENTARY MATERIALS \n \nSupplementary Figures \n \n \n \nSupplementary Figure 1. Multimodal transformer learning curves on the train and 20% hold -out test datasets. \n \n \n \nSupplementary Figure 2. Example of t arget ID output for idiopathic pulmonary fibrosis. Top-200 genes from expression \nclassifiers were applied as a gene list in PandaOmics corresponding project for idiopathic pulmonary fibrosis, and a filter for small molecules \nwas applied to identify druggable targets. Twenty genes highly ranked by PandaOmics are shown. \n\nwww.aging-us.com 4663 AGING \n \n \nSupplementary Figure 3. Example of t arget ID output for Parkinson’s disease. Top-200 genes from expression classifiers were \napplied as a gene list in PandaOmics corresponding project for PD, and a filter for small molecules was applied to identify druggable targets. \nTwenty genes highly ranked by PandaOmics are shown. \n \n \n \nSupplementary Figure 4. Example of t arget ID output for heart failure. Top-200 genes from expression classifiers were applied as a \ngene list in PandaOmics corresponding project for heart failure, and a filter for small molecules was applied to identify druggable targets. \nTwenty genes highly ranked by PandaOmics are shown. \n\nwww.aging-us.com 4664 AGING \n \n \nSupplementary Figure 5. Distribution by age (A) and tissues (B) for DNAm samples. Data was obtained from CNCB EWAS data hub. Ages \ndistributed from 0 to 110 years. Most of the samples are blood samples. \n \n \n \n \nSupplementary Figure 6. Distribution by age (A) and tissues (B) for RNA-seq samples. Data are obtained from the GTEx project. Ages are \ndistributed between 20 and 70 years. Brain and Skin samples comprise a bigger part of the dataset. \n \n  \n\nwww.aging-us.com 4665 AGING \nSupplementary Tables \n \nPlease browse Full Text version to see the data of Supplementary Tables 3–8. \n \nSupplementary Table 1. 5-fold cross-validation for multimodal transformer age prediction. \nMetric Combined Methylation Expression \nMAE 5.800+/−0.437 4.815+/−0.458 6.469+/−0.427 \nRMSE 7.665+/−0.436 6.680+/−0.520 8.266+/−0.403 \nR2 0.823+/−0.021 0.923+/−0.013 0.572+/−0.041 \nMdAE 4.546+/−0.517 3.569+/−0.486 5.335+/−0.588 \n \n \nSupplementary Table 2. Performance of multimodal model on different combinations of tissues and data \nmodalities. Estimates on 20% tissue-stratified hold-out test dataset. \nTISSUE MODALITY MAE R2 RMSE MSE MdAE MAD TEST_SAMPLES \nThyroid METHYLATION 2.456 0.900 4.287 18.381 0.567 0.609 21 \nBuccal epithelium METHYLATION 2.656 0.972 3.618 13.092 1.707 1.669 69 \nSaliva METHYLATION 3.170 0.959 4.237 17.948 2.249 2.069 107 \nMucosa METHYLATION 3.358 0.896 3.988 15.903 2.879 3.010 29 \nBrain METHYLATION 3.749 0.949 6.381 40.716 1.851 1.922 345 \nBlood METHYLATION 4.291 0.928 5.990 35.880 3.168 3.177 863 \nBrain EXPRESSION 4.483 0.640 5.954 35.446 3.539 3.372 528 \nBlood Vessel EXPRESSION 5.229 0.715 6.680 44.621 4.159 4.515 267 \nThyroid EXPRESSION 5.367 0.698 6.967 48.539 4.406 4.195 129 \nNerve EXPRESSION 5.461 0.656 7.075 50.061 4.479 4.448 124 \nTestis EXPRESSION 5.714 0.673 7.298 53.268 5.423 5.411 72 \nBreast METHYLATION 5.797 0.738 7.738 59.876 4.477 4.443 106 \nLiver METHYLATION 6.036 0.744 7.749 60.047 5.300 4.857 59 \nOvary EXPRESSION 6.070 0.672 8.488 72.052 4.460 4.425 36 \nAdrenal Gland EXPRESSION 6.085 0.683 7.431 55.216 5.729 5.729 52 \nPituitary EXPRESSION 6.154 0.199 7.633 58.267 5.666 5.091 56 \nSmall Intestine EXPRESSION 6.204 0.708 7.533 56.739 6.014 6.007 38 \nAdipose Tissue EXPRESSION 6.210 0.529 7.976 63.624 5.219 5.279 241 \nSalivary Gland EXPRESSION 6.296 0.532 8.413 70.781 4.595 4.454 33 \nKidney METHYLATION 6.315 0.908 7.951 63.222 5.968 5.826 58 \nSkin EXPRESSION 6.602 0.538 8.664 75.069 5.031 4.817 362 \nEsophagus EXPRESSION 6.647 0.626 8.317 69.169 5.484 5.507 289 \nProstate EXPRESSION 6.670 0.669 8.349 69.711 5.096 5.345 49 \nUterus EXPRESSION 6.724 0.619 8.063 65.016 5.714 5.905 29 \nLung EXPRESSION 7.018 0.399 9.223 85.067 5.069 5.393 115 \nBreast EXPRESSION 7.037 0.521 8.919 79.541 5.798 5.230 92 \nMuscle EXPRESSION 7.040 0.558 8.604 74.027 5.981 5.584 160 \nHeart EXPRESSION 7.059 0.403 8.799 77.421 6.302 6.405 172 \nColon EXPRESSION 7.204 0.590 9.143 83.598 6.241 6.118 156 \nStomach EXPRESSION 7.242 0.469 8.924 79.640 6.177 6.177 72 \nwww.aging-us.com 4666 AGING \nPancreas EXPRESSION 7.291 0.429 9.043 81.774 6.549 6.176 65 \nVagina EXPRESSION 7.436 0.311 9.372 87.826 5.883 5.364 31 \nLiver EXPRESSION 7.592 0.243 9.372 87.829 7.066 5.343 45 \nBlood EXPRESSION 8.158 0.397 10.617 112.724 6.288 6.303 186 \nSpleen EXPRESSION 9.050 0.346 11.204 125.526 6.770 7.227 48 \nKidney EXPRESSION 9.715 −0.118 12.731 162.079 8.318 7.508 18 \n \nSupplementary Table 3. Feature importance analysis for Aging clock. \n \nSupplementary Table 4. Feature importance analysis for Pulmonary fibrosis case-control classifier. \n \nSupplementary Table 5. Feature importance analysis for Chronic Obstructive Pulmonary Disease case -control \nclassifier. \n \nSupplementary Table 6. Feature importance analysis for Parkinson's disease case-control classifier. \n \nSupplementary Table 7. Feature importance analysis for Heart failure case-control classifier. \n \nSupplementary Table 8. Metrics for multimodal transformer -based case -control classifiers with and without \npretraining on aging data. \n \n "
}