{
  "title": "Learning tools used to translate resilience in healthcare into practice: a rapid scoping review",
  "url": "https://openalex.org/W4386096033",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A4202556679",
      "name": "Cecilie Haraldseid-Driftland",
      "affiliations": [
        "University of Stavanger"
      ]
    },
    {
      "id": "https://openalex.org/A2522565555",
      "name": "Heidi Dombestein",
      "affiliations": [
        "University of Stavanger"
      ]
    },
    {
      "id": "https://openalex.org/A2560354035",
      "name": "Anh Hai Le",
      "affiliations": [
        "Griffith University"
      ]
    },
    {
      "id": "https://openalex.org/A2186292847",
      "name": "Stephen Billett",
      "affiliations": [
        "Griffith University"
      ]
    },
    {
      "id": "https://openalex.org/A2147805597",
      "name": "Siri Wiig",
      "affiliations": [
        "University of Stavanger"
      ]
    },
    {
      "id": "https://openalex.org/A4202556679",
      "name": "Cecilie Haraldseid-Driftland",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2522565555",
      "name": "Heidi Dombestein",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2560354035",
      "name": "Anh Hai Le",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2186292847",
      "name": "Stephen Billett",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2147805597",
      "name": "Siri Wiig",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2752627686",
    "https://openalex.org/W1962184316",
    "https://openalex.org/W4212897451",
    "https://openalex.org/W2604639021",
    "https://openalex.org/W4233794181",
    "https://openalex.org/W4223492593",
    "https://openalex.org/W3016335358",
    "https://openalex.org/W2286828140",
    "https://openalex.org/W2603983415",
    "https://openalex.org/W3192940782",
    "https://openalex.org/W4229912774",
    "https://openalex.org/W2531870083",
    "https://openalex.org/W2043933168",
    "https://openalex.org/W2945852549",
    "https://openalex.org/W2774152093",
    "https://openalex.org/W2062612702",
    "https://openalex.org/W2550229469",
    "https://openalex.org/W2773037727",
    "https://openalex.org/W3166905108",
    "https://openalex.org/W2765360068",
    "https://openalex.org/W2083328625",
    "https://openalex.org/W2891377466",
    "https://openalex.org/W2945382546",
    "https://openalex.org/W3016540556",
    "https://openalex.org/W2554796766",
    "https://openalex.org/W3005102729",
    "https://openalex.org/W3116787229",
    "https://openalex.org/W2075950485",
    "https://openalex.org/W3092419658",
    "https://openalex.org/W2891378911",
    "https://openalex.org/W4288685827",
    "https://openalex.org/W2105321265",
    "https://openalex.org/W3137976401",
    "https://openalex.org/W3151825606",
    "https://openalex.org/W3019914104",
    "https://openalex.org/W2969241973",
    "https://openalex.org/W2973078083",
    "https://openalex.org/W4293548125",
    "https://openalex.org/W3017105996",
    "https://openalex.org/W4232850369",
    "https://openalex.org/W1983346236",
    "https://openalex.org/W1967143750",
    "https://openalex.org/W2155274319",
    "https://openalex.org/W2053833676",
    "https://openalex.org/W2097782859",
    "https://openalex.org/W4226280250",
    "https://openalex.org/W3095128409",
    "https://openalex.org/W4252684167",
    "https://openalex.org/W2894648531",
    "https://openalex.org/W2086417336",
    "https://openalex.org/W4225839192"
  ],
  "abstract": null,
  "full_text": "Haraldseid‑Driftland et al. \nBMC Health Services Research          (2023) 23:890  \nhttps://doi.org/10.1186/s12913‑023‑09922‑6\nRESEARCH ARTICLE Open Access\n© The Author(s) 2023. Open Access  This article is licensed under a Creative Commons Attribution 4.0 International License, which \npermits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the \noriginal author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or \nother third party material in this article are included in the article’s Creative Commons licence, unless indicated otherwise in a credit line \nto the material. If material is not included in the article’s Creative Commons licence and your intended use is not permitted by statutory \nregulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this \nlicence, visit http:// creat iveco mmons. org/ licen ses/ by/4. 0/. The Creative Commons Public Domain Dedication waiver (http:// creat iveco \nmmons. org/ publi cdoma in/ zero/1. 0/) applies to the data made available in this article, unless otherwise stated in a credit line to the data.\nBMC Health Services Research\nLearning tools used to translate resilience \nin healthcare into practice: a rapid scoping \nreview\nCecilie Haraldseid‑Driftland1  , Heidi Dombestein1*  , Anh Hai Le2, Stephen Billett2 and Siri Wiig1 \nAbstract \nBackground Historically, efforts to improved healthcare provisions have focussed on learning from and understand‑\ning what went wrong during adverse events. More recently, however, there has been a growing interest in seeking \nto improve healthcare quality through promoting and strengthening resilience in healthcare, in light of the range \nof changes and challenges to which healthcare providers are subjected. So far, several approaches for strengthening \nresilience performance have been suggested, such as reflection and simulation. However, there is a lack of studies \nthat appraise the range of existing learning tools, the purposes for which they are designed, and the types of learn‑\ning activities they comprise. The aim of this rapid scoping review is to identify the characteristics of currently available \nlearning tools designed to translate organizational resilience into healthcare practice.\nMethods A rapid scoping review approach was used to identify, collect, and synthesise information describing \nthe characteristics of currently available learning tools designed to translate organizational resilience into healthcare \npractice. EMBASE and Medline Ovid were searched in May 2022 for articles published between 2012 and 2022.\nResults The review identified six different learning tools such as serious games and checklists to guide reflection, \ntargeting different stakeholders, in various healthcare settings. The tools, typically, promoted self‑reflection either indi‑\nvidually or collaboratively in groups. Evaluations of these tools found them to be useful and supportive of resilience; \nhowever, what constitutes resilience was often difficult to discern, particularly the organizational aspect. It became \nevident from these studies that careful planning and support were needed for their successful implementation.\nConclusions The tools that are available for review are based on guidelines, checklists, or serious games, all of which \noffer to prompt either self‑reflection or group reflections related to different forms of adaptations that are being per‑\nformed. In this paper, we propose that more guided reflections mirroring the complexity of resilience in healthcare, \nalong with an interprofessional collaborative and guided approach, are needed for these tools to be enacted effec‑\ntively to realise change in practice. Future studies also need to explore how tools are perceived, used, and understood \nin multi‑site, multi‑level studies with a range of different participants.\nKeywords Resilience, Healthcare, Quality, Collaborative learning, Systems perspective, Learning tools\nBackground\nProviding safe, high-quality care is the principal goal for \nhealthcare systems worldwide [1]. Historically, efforts to \nimproved healthcare provision have focussed on learning \nfrom and understanding what went wrong during adverse \nevents [2]. Yet, more recently, there has been a growing \n*Correspondence:\nHeidi Dombestein\nheidi.dombestein@uis.no\n1 Centre for Resilience in Healthcare, Faculty of Health Sciences, University \nof Stavanger, N‑4036 Stavanger, Norway\n2 School of Education and Professional Studies, Griffith University, Mount \nGravatt, QLD 4122, Australia\nPage 2 of 11Haraldseid‑Driftland et al. BMC Health Services Research          (2023) 23:890 \ninterest in trying to improve healthcare quality from a \nresilience in healthcare perspective, and in understand -\ning how high-quality care is provided despite the range of \nchanges and challenges to which healthcare providers are \nsubjected during service provision [3–5].\nImportantly, there is a broad consensus amongst \nresearchers that resilience of healthcare systems needs \nto be strengthened [6]. Recent studies within the field \nof resilience in healthcare have explored the underlying \npotentials for resilience [7], described adaptive capacities \nfor resilience [8], defined the boundaries and concept of \nresilience [9], and sought to understand what contrib -\nutes to resilience in practice by describing what occurs \nin ordinary work processes and how work as done differs \nfrom work as imagined [10, 11]. Consequently, there is \nnow a growing consensus that the concept of resilience \nin healthcare entails the capacity to adapt to challenges \nand changes at different system levels in order to provide \nhigh-quality care [9]. It is also acknowledged that adap -\ntive capacities contribute to generating resilient health -\ncare systems [8] and that these adaptive capacities usually \nrequire an element of collaborative learning and working, \nas the complexities of changes and challenges can rarely \nbe addressed by individuals alone or by single healthcare \ndisciplinary knowledge [12]. Resilience in healthcare is a \nsystems perspective. This is of importance since it places \nthe responsibility for providing high-quality care on the \nsystem and the organisation, rather than on the individ -\nual. For a system to operate in a resilient manner, it needs \nto provide the individuals within it with the equipment \nand resources to enable resilient performance. As such, \nresilient healthcare is dependent on organisational learn -\ning, where the organisation continuously assimilates new \nknowledge and improves and adapts its systems’ rou -\ntines, rules, and performances based on both existing and \nnewly assimilated knowledge [13]. Organisations’ ability \nto strengthen resilient performance is therefore depend -\nent on intentional efforts to promote continuous and \ncollaborative learning to improve resilient performance \nof the system [7, 9]. To aid such processes, healthcare \norganisations, leaders, and staff need practical tools to \ndrive continuous learning processes and to facilitate the \nunderstanding of what constitutes resilience in health -\ncare and understandings of how resilience in healthcare \ncan be strengthened [12].\nResilience in healthcare builds on the concept of resil -\nience engineering that stems from other fields such as \ncognitive psychology and safety science [14] and has \nbeen widely used in other sectors such as aviation [15] \nand nuclear power [16]. As a result, tools for operational-\nising resilience engineering have been developed, such as \nserious games for industrial safety focusing on develop -\ning early warning indicators [17] or ‘Five steps to resilient \ndecision making’ aiming at develop insight into resilience \nstrategies [18]. There are also tools related to resilience \nengineering that focus on the aspect of proactive learn -\ning, such as proactive assessment of organisational and \nworkplace factors (PAOWF) that provides organisa -\ntions with an overview of how conditions change [19] \nand the proactive risk monitoring tool for organisational \nlearning in healthcare (PRIMO) that focuses on poten -\ntial failures [20]. In addition, there are tools focusing on \nresilience within disaster planning [21, 22] and others \nfor studying and understanding resilience performance \nin healthcare, such as the resilience analysis grid (RAG), \nthe functional resonance analysis methodology (FRAM), \nand the concepts for applying resilience engineering \n(CARE) model [14, 23, 24]. Nevertheless, there has been \na growing call for interventions that operationalise and \ntranslate organisational resilience into practice [25–28]. \nTo date, two different approaches for strengthening resil-\nience performance have been proposed broadly: reflec -\ntion, where current practices and ideas are thought about \nand discussed, and simulation, where real life events are \nimitated, practiced, and rehearsed [29–31]. However, \nthere is a lack of studies that systematically identify and \nappraise such learning tools, for which purpose they are \ndesigned, and what type of learning activities they entail. \nThis article begins to address this gap.\nAim and research questions\nThe aim of this rapid scoping review is to identify and \nappraise the characteristics of currently available learning \ntools designed to translate organisational resilience into \nhealthcare practice.\nThe research questions are:\n1) What learning tools are available to translate organi -\nsational resilience into healthcare practice?\n2) What are the characteristics of these tools?\nIn referring to these characteristics, we focus on type \nof tool, aim, pedagogical activities, pedagogical approach, \nand possible outcomes from implementing the tool.\nMethods\nA rapid scoping review approach was used to identify, \ncollect, and synthesise information describing the char -\nacteristics of currently available learning tools designed \nto translate organisational resilience into healthcare \npractice. The scoping review follows the methodological \nframework developed by Arksey and O’Malley [32], with \nimprovements by Peters et al. [33]. A rapid review tech -\nnique described by Tricco et al. [7, 34] was adopted as it \nallows for rapid collection of evidence to map a field of \nstudy. The method is compliant with the PRISMA-ScR \nPage 3 of 11\nHaraldseid‑Driftland et al. BMC Health Services Research          (2023) 23:890 \n \nreporting guideline and checklist [35], and is used to \ninform this review. Five stages of activities were enacted \nin the review: (a) identifying the research question, (b) \nidentifying relevant studies, (c) study selection, (d) chart -\ning the data, and (e) collating, summarising, and report -\ning the results [32].\nIdentifying the research question\nIn the last decade, resilience in healthcare as a research \nfield has expanded rapidly. Due to the novelty of the field, \na majority of the work has been focusing on theory build-\ning and defining the boundaries and concept of resilience \nin healthcare [7–10]. However, with the field develop -\ning, several studies have called for interventions help -\ning to operationalise resilience in healthcare [25, 27, 28]. \nBefore developing new tools and interventions it is thus \ntimely and appropriate to conduct a fresh scoping review \nover the existing literature to enable future studies to \nbuild on and learn from this knowledge. A rapid review \napproach was adopted since this methodology is particu -\nlarly helpful in capturing emerging tools and practices in \na resource-efficient way [36].\nIdentifying relevant studies\nThe search terms were selected to align with the popu -\nlation-concept-context (PCC) components that entail \ndefining a search string for each component and subse -\nquently combining them into the final search string [33, \n37]. EMBASE and Medline Ovid were searched in May \n2022. According to Tricco et al. [34], only two databases \nare required for a rapid scoping review, which allows \nfor a rapid collection of evidence to map a field of study. \nMedline Ovid was chosen to capture health service \nrelated studies, while EMBASE was chosen to capture \ninterdisciplinary studies. EMBASE also indexes health \nsystem research that is not indexed in Medline; as such, \nthe two databases complement each other. The search \nwas limited to include peer reviewed articles published in \nEnglish between 2012 and 2022. The design of the search \nstring was developed with support from a specialised \nlibrarian; the final search was conducted by one author \n(AL). Table  1 outlines the literature search and its cate -\ngorising into the participant, concept and context (PCC) \nframework. To ensure that all relevant articles were iden-\ntified, reference scanning of included articles and a man -\nual search in Google Scholar and relevant journals (such \nas BMC Health Services Research and Applied Ergonom-\nics) were conducted by two authors (CHD and HD).\nStudy selection\nBased on keywords in the research questions and famili -\narity with the literature, inclusion and exclusion crite -\nria were developed (see Table  2). The inclusion criteria \nused in our rapid scoping review related to type of par -\nticipant groups; type of setting; descriptions of learning \ntool; descriptions of organisational resilience; and type of \nstudy. One author (AL) applied the inclusion and exclu -\nsion criteria to all the records to determine their rel -\nevance. In line with the rapid review methodology [34], \ntwo authors (CHD and HD) independently checked 10% \nof the excluded records to ensure that relevant records \nwere not excluded on incorrect premises. No discrepan -\ncies among the excluded studies were detected. Check -\ning the initial included full text articles indicated that \nthe search figure and inclusion criteria had identified \na large number of studies that described the concept of \nlearning tool in a broad way. These studies did not have \nthe potential to address the research questions, as they \nTable 1 Search string EMBASE and Medline Ovid\nSearch no Query Result\n#1 Participant ’healthcare personnel’/exp OR ’healthcare personnel’ OR worker* OR ’healthcare worker*’ OR ’personnel’/exp \nOR personnel OR leader* OR manager*\n2,344,910\n#2 Concept ’learning tool*’ OR tool* OR ’serious games’ OR reflection OR ’reflexive practice’ OR ’collaborative learning’ 1,244,191\n#3 Concept resilien* OR ’resilience engineering’ OR safety*ii OR ’safety 2’ OR ’adaptive capacity’ OR adapt* OR ’organizational \nresilien*’\n962,671\n#4 Context healthcare OR ’health care’ 2,601,316\n#5 #1 AND\n#2 AND #3 AND #4\n4,126\n#6 #5 AND (2012:py OR 2013:py OR 2014:py OR 2015:py OR 2016:py OR 2017:py OR 2018:py OR 2019:py OR 2020:py \nOR 2021:py OR 2022:py)\n3,315\n#7 #5 AND (2012:py OR 2013:py OR 2014:py OR 2015:py OR 2016:py OR 2017:py OR 2018:py OR 2019:py OR 2020:py \nOR 2021:py OR 2022:py) AND ’article’/it\n1,887\n#8 #5 AND (2012:py OR 2013:py OR 2014:py OR 2015:py OR 2016:py OR 2017:py OR 2018:py OR 2019:py OR 2020:py \nOR 2021:py OR 2022:py) AND ’article’/it AND (’case study’/de OR ’evidence-based practice’/de OR ’intervention \nstudy’/de OR ’qualitative research’/de OR ’systematic review’/de)\n279\nPage 4 of 11Haraldseid‑Driftland et al. BMC Health Services Research          (2023) 23:890 \neither: lacked descriptions of the learning tool used, only \ndescribed tools that enabled researchers to study work \nprocesses rather than operationalising and strengthen -\ning resilience concepts, or that the tools were based on \na different concept of resilience stemming from other \nfields such as cognitive psychology or disaster plan -\nning which address other processes such as individual \nbehaviour rather than collaborative efforts. The concept \nof learning tool was, therefore, defined in a more spe -\ncific and purposeful way that included a means to sup -\nport practitioners to practically translate resilience into \npractice, in order to identify articles that could help meet \nthe research questions of operationalising resilience into \nhealthcare practice. Two authors (CHD and HD) further \nincluded or excluded articles based on this revised defini-\ntion (see Fig. 1).\nConsistent with the scoping review methodology, no \nquality appraisal was conducted to exclude articles based \non that assessment. As scoping reviews seek to develop a \ncomprehensive overview of the field rather than a quanti-\ntative or qualitative synthesis of data, there is no require -\nment to undertake methodological appraisal/risk of bias \nassessment of the sources to be included [32].\nCharting and summarising the data and reporting \nthe results\nTwo authors (CHD and HD) extracted key items of infor-\nmation obtained from each primary article into a data \ncharting form [32]. A draft of the charting form was \ndeveloped to allow efficient data coding. The form was \nleft open to allow editing and additional unforeseen data \nduring the analyses, which permitted the process to be \niterative. The data extraction process focused on the (a) \naim of the studies, (b) setting and participants, (c) type \nand descriptions of the tool, (d) pedagogical approach \nand activities, and (e) possible outcomes from imple -\nmenting the tool (please see Appendix 1 ‘Data chart -\ning form’ for details of the extracted data). To chart the \ndata further, authors SB and AL created a complemen -\ntary descriptive summary of the results, addressing the \nobjectives and research questions stated in the introduc -\ntory section of this review, consistent with the Preferred \nReporting Items for Systematic Reviews and Meta-Anal -\nyses Extension for Scoping Reviews reporting checklist \n(PRISMA- ScR) [35].\nResults\nThe search and descriptive analysis results are now pre -\nsented and discussed below.\nSearch results\nThe searches revealed 1,887 articles from the databases, \nof which 1,608 were filtered through study types using \nexclusion criteria (e.g., commentary, theoretical, edito -\nrial, studies without method description), thereby reduc -\ning the number of articles to 279. After reviewing their \ntitles and abstracts, 100 articles were excluded because \nthey did not meet the inclusion criteria regarding set -\ntings, language, or focus of the study (i.e., not learning/\nresilience, non-learning tool, clinical/medical focus, \nindividual/psychological aspect). The findings reported \nin those studies failed to satisfy the study’s objectives in \nterms of reporting resilience learning tool in healthcare \nsettings, leaving 179 full-text articles to be assessed for \neligibility. After full-text reviews, 176 additional stud -\nies were excluded due to the following: inconclusive \nTable 2 Inclusion and exclusion criteria\nInclusion criteria Exclusion criteria \nHealthcare settings Non‑healthcare settings i.e., work‑life or education \nDescribe learning tool and/or use of tools that aim to translate resilience \nin healthcare into practice by strengthening resilience in healthcare fea‑\ntures such as adaptations, adaptive capacity, safety II, learning, anticipation, \nmonitoring, responding into healthcare settings\nDescribing individual or psychological resilience (describing personal/\npsychological/individual/worker/professional resilience)\nIndividual/psychological aspect\nClinical/medical focus\nNot learning/resilience focus\nResilience engineering\nMust include description of tool and characteristics of tool, designed \nfor use by workers, personnel, and/or leaders in healthcare \nWithout description of tool or tool designed for use by others than per‑\nsonnel and leaders in healthcare such as researchers/patients/students \netc\nEmpirical studies and systematic reviews\nEvidence‑based practice, intervention studies, and case studies\nCommentary, theoretical articles, editorials, opinion papers \nQualitative, quantitative, or mixed‑methods designs Studies without methods description \nPeer reviewed articles reporting academic output Not reporting academic output and book chapters, books, conference \nproceedings, and grey literature \nArticles in English Language other than English\nPublished between 2012 and 2022 Published before 2012\nPage 5 of 11\nHaraldseid‑Driftland et al. BMC Health Services Research          (2023) 23:890 \n \nfindings about resilience learning tools (e.g., no resolu -\ntion to enhance resilience or discussion of resilience as a \nhealthcare concept), not being conducted in healthcare \ncontexts, and not empirical studies, reviews of perspec -\ntives or discussing resilience as an individual/psycho -\nlogical aspect or tools for researchers not practitioners. \nAdditional reference scanning of the three included arti -\ncles and a manual search in Google Scholar and relevant \njournals resulted in three additionally included articles. \nThe complete process, then, resulted in six articles being \nidentified for qualitative descriptive analysis. Workflow \nof the identification, screening, eligibility, and inclusion \nof the studies in the rapid scoping review according to \nthe PRISMA flow diagram [34, 37] can be found in Fig. 1.\nDescription of tools, pedagogical approach, and evaluation\nIn the analysis, each tool was assessed according to the \ntype and descriptions of the learning tool, pedagogical \napproach and activities, and outcomes and evaluations \nof the tool (see Table  3). Pedagogical approach entails \nhow the learning tool was designed to be used, either \nalone (individually) or in pairs/or groups (collectively). \nThe pedagogical approach is of particular interest since \ncollaborative learning is an important aspect of resilient \nhealthcare since healthcare is provided as a shared effort \nbetween a range of stakeholders [12].The analysis across \nthe tools provided insight into the patterns, needs, and \ncharacteristics needed to better succeed with a learning \ntool to translate resilience into practice and into what \nfurther studies need to emphasise.\nThe descriptive analysis of the results indicated that \nthere are learning tools targeting different stakehold -\ners (e.g., clinical and professional staff at different \nlevels, residents, practitioners, and policymakers) in \nvarious healthcare settings (e.g., hospitals, healthcare \ncentres, simulation centres). As presented in Table  3, \nall six articles identified a tool involving self-reflection \neither individually or collaboratively in groups. Whilst \nFig. 1 PRISMA flow diagram\nPage 6 of 11Haraldseid‑Driftland et al. BMC Health Services Research          (2023) 23:890 \none was designed using scenarios formulated in a game \n(i.e., serious game), the other five involved checklists to \nguide reflections on resilience capacities. Surveys were \nused to evaluate the implementations of the four tools, \nwhile research group discussion and pilot testing was \nused to evaluate the other two.\nIn detail, Jackson et  al. [40] reported on the serious \ncomputer-based game ‘Resilience Challenge’ in a hos -\npital setting, aiming to communicate principles of resil -\nient healthcare to clinicians and to prompt reflection \non practice related to safety and organisational resil -\nience. In this tool (i.e., the game), the players follow the \npatient through their hospital journey (e.g., emergency \ndepartment, orthopaedic ward, x-ray, medical ward, \netc.) and adopt multiple healthcare roles throughout \nthe game (e.g., registered nurse, doctor, nurse admin -\nistrator). In each scenario, the players face different \ndilemmas in making decisions to advance the game. \nThe players are given feedback for every choice made \nto prompt their reflection. This tool was evaluated \nthrough an online survey with 107 participants (i.e., \nplayers). The design (i.e., flow images and sound) was \nwell received: the players reported that it helped them \nreflect on their own practice related to safety issues, \nand how their actions influenced other parts of the sys -\ntem. Concerns were raised regarding the fact that the \ngame had ‘right’ answers, and the lack of understanding \nof organisational resilience for most participants.\nAlso in a hospital setting, Bartman et  al. [38] devel -\noped a checklist with short statements to be used as \nmental prompts to predict, respond to, and promote \nlearning. Examples of these statements include ‘pause \nto predict’ , ‘gather information’ , or ‘discuss with at least \ntwo team members’ . This tool was designed to improve \nclinical frontline staff’s situational awareness, anticipa -\ntion, responding, and learning, and to adapt to patients’ \nconditions. Initial testing of a prototype found an \nelevation in formal and more guided proactive safety \nhuddles to effectively address unusual and potential \nharmful situations.\nContextualised for anaesthetists, Hegde et  al. [41] \ndeveloped a tool in the form of an online questionnaire \n(i.e., resilience engineering tool to improve patient safety \n[RETIPS] for anaesthesia residents [RETIPS-AnRes]) in \nwhich respondents are asked to write a narrative where \nan adaptation occurred and to specify what worked well, \nwhich challenges and concerns triggered a particular \nresponse, and what resources were used. This tool was \nused to elicit narratives of adaptations that have contrib -\nuted to effectiveness in care delivery. Based on discus -\nsions in the article, the researchers concluded that the \ntool supported the concept of learning how things go \nwell in everyday work through helping the participants to \nreflect. However, the article also discussed that the tool \nis limited in its focus on individual learning and lacked \nan emphasis on and basis in realising change in organisa -\ntional practice.\nSituated in a simulation centre, Bentley et al. [39] devel-\noped a debriefing checklist with exemplary questions \nfor how to guide the debrief of clinicians from different \ndisciplines and simulations into resilience capacities. \nThe tool aims to facilitate inclusion of Safety-II analysis \ninto debriefings through questions related to variability, \nadaptability, flexibility, and workarounds. The tool imple-\nmentation was evaluated through a survey with 10 par -\nticipants; all reported that this tool would add value to \ntheir debriefings and that it was understandable and easy \nto use.\nTo improve patient safety through learning from eve -\nryday work, Wahl et  al. [43] developed the Green Line \nreflection tool as a short assessment. The reflection ses -\nsions were administered as 5- to 10-min huddles with all \navailable staff (i.e., nurses, nurse assistants, managers, \nand doctors). Reflections and discussions were based on \nopen-ended questions such as ‘How have we succeeded \ntoday?’ and follow-up questions such as ‘How did you \nmanage that?’ and ‘Can you describe more?’ . Ideas for \nimprovement were noted during each huddle to pro -\nmote collaborative learning. An evaluation survey was \nconducted with 151 evaluative responses for the tool. \nTable 3 Summary of characteristics of the included studies\nReference Description of tool Pedagogical approach Tool evaluation\nScenario-based Checklist Individually Collaboratively\nBartman et al. (2021) [38] √ √ √ Testing\nBentley et al. (2021) [39] √ √ Survey (n = 10)\nJackson et al. (2020) [40] √ √ Survey (n = 107)\nHegde et al. (2020) [41] √ √ Discussion\nHermelin et al. (2020) [42] √ √ √ Survey (n = 9)\nWahl et al. (2022) [43] √ √ Survey (151 respondents)\nPage 7 of 11\nHaraldseid‑Driftland et al. BMC Health Services Research          (2023) 23:890 \n \nParticipants reported difficulty in introducing reflec -\ntions based on learning from what goes well, as this was \nan unfamiliar approach. Also identified was the need for \ncareful planning and support from managers’ knowl -\nedge of the underpinning theory of this approach to staff  \nlearning and organisational enhancements.\nIn an article broadly addressed to policymakers, man -\nagers, and practitioners, Hermelin et  al. [42] reported \non guidelines to enhance organisational resilience in \ncrisis management and capability development. These \nguidelines comprised 13 cards of generic descriptions of \ncapabilities of resilience, called the DARWIN resilience \nmanagement guidelines (DRMG; DARWIN, 2019). In \naddition to reflections (i.e., both group and individual \napproaches), the activities outlined in the tool comprised \nlectures, workshops, and table-top simulations in which \ndifferent scenarios and ways to be prepared and adapt -\nable to diverse situations were discussed and appraised. \nThere were also suggestions for suitable interventions or \nactions for all kinds and levels of staff capabilities and a \nset of triggering questions to guide the self-reflections. \nThe tool implementation was evaluated through a sur -\nvey with only nine participants; positive feedback was \nreceived, indicating the content was deemed relevant and \ninteresting for the participants.\nPatterns across learning tools\nThese six tools offer a variety of approaches rather than \na variety of tools. This means that all tools offered some \nform of scenarios and examples as the basis for individual \nand collective consideration and reflection and, in four \nof the six tools, collaborative processes of engagement \nin addition to individual engagement. What is perhaps \nmissing in this mix is some form of guidance that assists \nthe engagement and effective translation into practice \nand the contributions of these tools.\nIn all, from this review of relevant literature, three key \nelements emerge. Firstly, a process is needed that goes \nbeyond individual reflections and accommodates col -\nlective and, ideally, interprofessional interactions as \nprocesses of collaboration. This implies that the poten -\ntial learning experiences cannot be limited to individ -\nual learning and development alone, but also require \nengagement through and outcomes associated with col -\nlaborative engagement and learning. Secondly, the tools’ \nscenarios, vignettes, or narratives used as the key focuses \nfor that engagement include elements that address work -\nplace or work practice requirements: that is, more than \nprompting individual learning, they are positioned to \nconsider and realise changes in work practices. Thirdly, \ngiven the complexity of the task of translating these \nmeans into resilience and practice and the interprofes -\nsional engagements required, some guidance is likely to \nbe needed to facilitate and realise the full learning poten -\ntial of these tools. Hence, the means through which these \ntools can be enacted may well need to include a guide, \nfacilitator, or advocate of some kind to facilitate and sup -\nport the reflections towards different and interconnected \nlevels and layers of resilience.\nDiscussion\nThis rapid scoping review found that only a limited num -\nber of learning tools exist that can translate resilience \ninto healthcare practice. Six tools were identified: one \ngame and five guides/checklists. In the following, we \ndiscuss the findings and suggest patterns and needs for \nfuture research.\nReflection: most used approach\nAll six tools included some form of reflection: through \nself-reflection [40, 41], group reflections [39, 43], or a \ncombination of both [38, 42]. Reflection is a commonly \nknown pedagogical approach which aims to stimulate \nlearning through interpreting and making sense of an \nexperience, and using that experience to guide decision-\nmaking and actions [44]. Several other studies have rec -\nommended reflections as the preferred method in terms \nof trying to enhance or understand the concept of resil -\nience in healthcare. Wiig et  al. [30] argued that criti -\ncal reflection helps to articulate tacit knowledge which \ncould bridge experience, knowledge, and action. Lyng \net  al. [8] argued that tools that facilitate reflection can \nsupport and strengthen resilience performance, perhaps \nmost effectively when those reflections are centred and \nfocused on actual instances, as exemplified here. Resil -\nience in healthcare is a complex concept in which a range \nof different adaptations are enacted and performed to \nprovide high-quality patient care; hence, collaborative \napproaches to reflective practice are required. This pro -\nvides the opportunity to view each situation as unique, \nand to take into account a range of aspects rather than \napplying a standardised solution [45]. As such, this might \nexplain why reflection as a pedagogical approach is a \ngood fit within efforts to advance resilience.\nResilience in healthcare has a systems dimension, \nmeaning that it is not only individuals but rather the sys -\ntem that needs to enact resilience [9, 46, 47], hence col -\nlaborative engagements are important. While individual \nor self-reflection can be useful for understanding the \nconcept of resilience, it is limited in its reach. On the one \nhand, a strong individual focus, when the aim is to pro -\nmote organisational resilience, could be problematic. On \nthe other hand, the link between individual and organisa-\ntional resilience is somewhat unclear, as it is the individu-\nals within the organisation who make up the teams and \nthe organisation and are, as such, a potentially important \nPage 8 of 11Haraldseid‑Driftland et al. BMC Health Services Research          (2023) 23:890 \ncontribution to the organisational phenomenon. A \nmore holistic view that includes individuals as well as a \nsystems-based approach might therefore be needed for \nstrengthening resilience in healthcare; future research is, \ntherefore, suggested to investigate this relation in more \ndetail.\nDifficulties grasping the concept\nThree of the articles [40, 41, 43] reported that participants \nhad difficulties in understanding and grasping the organi-\nsational aspect of resilience. This is, perhaps, not sur -\nprising, given the novelty of adjusting to a new approach \nof focusing on what goes well in a situation rather than \nfocusing on adverse events, which has been the ortho -\ndox approach to enhancing patient safety [3, 48]. Learn-\ning new skills and approaches, especially when they differ \nmarkedly from previous learnt skills, is demanding [49]. \nIn most of the studies, reflection was related to discuss -\ning adaptations that were made and why. Enhancing sys -\ntems resilience requires understanding of how individual, \ngroup, and systems adaptations interplay with and across \nparticipants, and how different levels and stakehold -\ners within the healthcare systems contribute to systems \nresilience [8]. All of this points to the importance of \nhaving a collaborative element to the processes through \nwhich these tools are enacted. Given the complex and \nmulti-partied nature of resilience, the reason participants \nstruggled to understand the concept of resilience might \nbe that the processes used to promote reflections failed \nto address this complexity. Instead, there is the risk that \nparticipants linked reflections only to the act of individ -\nual adaptations rather than incorporating and discussing \nthe multiple layers of understanding how different stake -\nholders contribute to organisational resilience. To better \naccommodate this complexity, reflection activities might \nbenefit from a more guided and collaborative approach \nrelated to different aspects of resilience that press them \nto consider system-level implications and practices, as \nsuggested by Lyng et al. [8].\nInterprofessional collaboration, cross sectional \nand cross levels: a solution to the problem?\nWithin the six included articles, four had a group \napproach, all of which included some sort of interpro -\nfessional collaborative element. Interprofessional col -\nlaboration, where multiple professions work together \nto achieve shared goals [50], is a commonly utilised \nand long-standing approach in organisations, institu -\ntions, and professions to achieve better outcomes than \nthrough single professions alone [51]. Such collabora -\ntions are also known for creating opportunities to learn \nand expand knowledge beyond orthodox ways of think -\ning [52], providing opportunities to tackle new, large, \nand complex problems through gathering and sharing \ninformation amongst different groups [53]. This was seen \nin Wahl et al. [43], who reported that the safety huddles \nhelped to create common values and cohesion between \nstaff members who were commonly working in different \nareas, which is perceived as an important aspect of resil -\nience in healthcare [8]. Interprofessional group reflec -\ntions could, thereby, enhance the potential to strengthen \nresilience. However, several of the included studies [40, \n41, 43] reported difficulties in grasping the concept of \nresilience and, in particular, the organisational aspect. \nInterprofessional group reflections might, therefore, not \nbe sufficient. Inclusion of both different professions and \nlevels might be needed to facilitate the understanding \nof the organisational aspects, potentially strengthening \nresilience performance through identifying and discuss -\ning diverse aspects of practice and their implications at a \nrange of levels within the organisation [54]. While indi -\nvidual reflective efforts can be useful to support capacity \nbuilding and the conditions to enhance resilience perfor -\nmance, tools for resilience in healthcare should include a \ncross-level, collaborative, and interprofessional approach. \nThis is necessary to facilitate understanding and accom -\nmodation of the organisational aspect of resilience in \nhealthcare and how resilience performance is created \nthrough a collaborative effort across stakeholders and \nlevels [55, 56].\nLack of studies and small study samples\nThis review identified a lack of tools for operationalis -\ning and translating resilience in healthcare into practice. \nIn addition, the evaluations of the tools were charac -\nterised by using small sample sizes, mostly restricted to \nthe hospital setting. There was also limited reporting on \nthe outcomes of the tools in the included studies. Those \nthat were reported were limited to focus on the design, \nuser friendliness, and value and frequency of tool usage. \nThe small scale of these samples, as well as the focus of \nthe evaluation, questions the veracity of the findings and \nprompts the need for more comprehensive and interpro -\nfessional approaches to the evaluation of such tools. The \ncomplexity of the resilience in healthcare concept also \nwarrants a more comprehensive evaluation design, one \nthat focuses not only on value and frequency of use, but \nthat also evaluates the whole implementation process \nand outcomes.\nThe lack of studies also indicates an underdeveloped \nfield and strengthens the objectives of this paper, as it \nunderscores the need for a summary of characteristics of \nthe existing tools to prompt further growth in this field \nof interest. Although the tools identified are deemed both \ninteresting and useful, the studies also report difficul -\nties in ‘getting the message across’ to the participants. As \nPage 9 of 11\nHaraldseid‑Driftland et al. BMC Health Services Research          (2023) 23:890 \n \nmentioned above, resilience in healthcare is a complex, \nmultilevel phenomenon which researchers and practi -\ntioners have struggled to define, explain, and operation -\nalise [9]. This might be the reason that several of the \nstudies identified through the initial searches reported \non tools to help researchers understand, explain, and \nmap resilience characteristics [14, 23, 24]. The novelty of \nthe field and the complexity of enacting these interven -\ntions might also explain why the studies included in this \npaper are mostly single-site and small-scale studies with \na limited number of participants. The field of resilience \nin healthcare draws on the resilience concept stemming \nfrom other sectors such as societal safety, engineering, \nand societal ecology and psychology [14, 57]. Some of \nthese sectors offer a relatively extensive range of tools \n[17–19] that could provide valuable contributions to the \nfield of resilience in healthcare. Future studies with cross-\nsite, multi-level, and interprofessional settings, drawing \non the previous work both within resilience in healthcare \nand similar work in other resilience sectors, are therefore \nneeded.\nLimitations and strengths\nThe rapid scoping study approach does not seek to assess \nquality of evidence and consequently cannot determine \nwhether particular studies provide robust or generalisable \nfindings [32]. Conducting a quality appraisal of included \narticles, even if this is not demanded according to the \nmethodology, could have strengthened our study. On \nthe other hand, the rapid scoping review methodology \nallows information from a broad range of peer-reviewed \narticles, that used diverse designs and methods, to be \nincluded and synthesised. The limited number of studies \nfound and discussed in this paper might be related to the \nnovelty of the area, but it is also noted that several con -\ntributions to the field are published within books [58–61] \ninstead of in peer reviewed articles. Choosing to include \nbook chapters, conference proceedings, and grey litera -\nture might have broadened the findings; however, the \npeer review process for such publications is sometimes \nlighter and to strengthen the validity of the study it was \nchosen to include only papers that had gone through the \nstrict peer review process of journal article publications.\nIn this study it was chosen to exclude studies with a \npure resilience engineering background. The identified \npapers in this category were deemed unfit for inclusion \nsince they covered areas such as disaster planning or loss \nof power and infrastructure [21, 62] and as such did not \ndescribe tools that enabled translation of organisational \nresilience into healthcare practice. However, future stud -\nies should explore resilience tools stemming from other \nsectors such as engineering, oil and gas, nuclear power, \nand how these can be of value for the healthcare sector.\nFinally, the studies included in this rapid scoping \nreview had different approaches and were used in differ -\nent contexts. Future studies could benefit from exploring \nhow the different settings influence the use of such tools.\nConclusion\nThrough this review, we have identified six learning \ntools designed to translate organisational resilience into \nhealthcare practice and the characteristics of these tools \nin terms of their aim, pedagogical approach and activi -\nties, and possible outcomes from implementing the tools. \nThe review found a limited range of learning tools to \ntranslate organisational resilience into healthcare prac -\ntice. The tools that are available are based on guidelines, \nchecklists, or serious games, all of which offer to prompt \neither self-reflection or group reflections related to differ-\nent forms of adaptations that are performed.\nBased on the findings, a more guided, collaborative, \nand interprofessional approach to such reflective pro -\ncesses is warranted. In this way, they may come to mir -\nror the complexity of resilience in healthcare. Future \nstudies need to explore how tools are perceived, used, \nand understood in cross-site, multi-level studies with a \nrange of participants. Moreover, the current evaluation \nof tools available to translate resilience into practice is \nlimited by small samples and limited appraisals across \nvarying healthcare contexts. Larger studies with mixed \nmethods designs, including cross level and cross con -\ntext (nursing homes, homecare, hospitals, mental health, \nGP , low- and high-income countries), are warranted and \nrecommended. Due to the methodological limitations \nof rapid scoping reviews, a comprehensive systematic \nreview is recommended when conducting further knowl -\nedge synthesis.\nAbbreviations\nSHARE  Centre for Resilience in Healthcare\nRiH  Resilience in Healthcare\nSupplementary Information\nThe online version contains supplementary material available at https:// doi. \norg/ 10. 1186/ s12913‑ 023‑ 09922‑6.\nAdditional file 1. \nAcknowledgements\nNot applicable.\nAuthors’ contributions\nCHD, SB, HD, and SW advanced the initial idea and protocol for the article. \nAL was responsible for performing all database searchers while CHD, SB, and \nHD helped with the screening and initial review of the articles. HD drafted \nthe methods section while SB and AL drafted the analysis section. All authors \nparticipated in analysis and CHD drafted the manuscript with significant \ncontributions from SW, HD, AL, and SB. All authors contributed with significant \nPage 10 of 11Haraldseid‑Driftland et al. BMC Health Services Research          (2023) 23:890 \ninput to drafts and revisions. All authors have read and approved the final \nmanuscript.\nFunding\nThis study was funded by the Norwegian Research Council, as a sub study \nunder the overall Resilience in Healthcare Project (RiH), project number \n275367. The RiH research program has received funding from the Research \nCouncil of Norway from the FRIPRO TOPPFORSK program, grant agreement \nno. 275367, The University of Stavanger, Norway, and NTNU Gjørvik, Norway; \nThe Norwegian Air Ambulance support the study with in‑kind funding.\nAvailability of data and materials\nAll articles that were used as basis for data are available online.\nDeclarations\nEthics approval and consent to participate\nNot applicable.\nConsent for publication\nNot applicable.\nCompeting interests\nThe authors declare that they have no competing interests. The author SW \nis a member of the editorial board (Associate Editor and Guest Editor of this \nspecial collection). SW had no role in the peer review or in the handling of this \nmanuscript.\nReceived: 28 October 2022   Accepted: 14 August 2023\nReferences\n 1. World Health Organization. Quality of care: A process for making strategic \nchoices in health systems. Geneva: World Health organization; 2006.\n 2. Hollnagel E. Safety‑I and Safety‑II: The Past and Future of Safety Manage‑\nment. Farnham: Ashgate; 2018.\n 3. Braithwaite J, Wears RL, Hollnagel E. Resilient health care: turning patient \nsafety on its head†. Int J Qual Health Care. 2015;27(5):418–20.\n 4. Hollnagel E, Wears RL, Braithwaite J: From Safety‑I to Safety‑II: a white \npaper. The resilient health care net: published simultaneously by the Uni‑\nversity of Southern Denmark, University of Florida, USA, and Macquarie \nUniversity, Australia 2015.\n 5. Vincent C, Amalberti R. Safer Healthcare: Strategies for the Real World. \nCham: Springer; 2016.\n 6. Blanchet K, Nam SL, Ramalingam B, Pozo‑Martin F. Governance and \ncapacity to manage resilience of health systems: towards a new concep‑\ntual framework. Int J Health Policy Manag. 2017;6(8):431–5.\n 7. Hollnagel E. Safety‑II in practice: developing the resilience potentials. \nNew York: Taylor and Francis; 2017.\n 8. Lyng HB, Macrae C, Guise V, Haraldseid‑Driftland C, Fagerdal B, Schibev‑\naag L, Wiig S. Capacities for resilience in healthcare; a qualitative study \nacross different healthcare contexts. BMC Health Serv Res. 2022;22(1):474.\n 9. Wiig S, Aase K, Billett S, Canfield C, Røise O, Njå O, Guise V, Haraldseid‑\nDriftland C, Ree E, Anderson J, et al. Defining the boundaries and \noperational concepts of resilience in the resilience in healthcare research \nprogram. BMC Health Serv Res. 2020;20(1):330.\n 10. Sujan MA, Spurgeon P , Cooke MW: Translating tensions into safe practices \nthrough dynamic trade‑offs: the secret second handover. In: Resilient \nHealth Care, Volume 2. edn. Oxford: CRC Press; 2017: 41–52.\n 11. Braithwaite J, Wears, R.L., & Hollnagel, E. : Resilient Health Care, Volume 3: \nReconciling Work‑as‑Imagined and Work‑as‑Done. Boca Raton: CRC Press. \n; 2016.\n 12. Haraldseid‑Driftland C, Aase K, Wiig S, Billett S. Developing a collaborative \nlearning framework for resilience in healthcare: a study protocol. BMJ \nOpen. 2021;11(8): e045183.\n 13. Crossan MM, Lane HW, White RE. An Organizational learning framework: \nfrom intuition to institution. Acad Manag Rev. 1999;24(3):522–37.\n 14. Anderson J, Ross A, Back J, Duncan M, Snell P , Walsh K, Jaye P . Implement‑\ning resilience engineering for healthcare quality improvement using \nthe CARE model: a feasibility study protocol. Pilot and feasibility studies. \n2016;2(1):61.\n 15. Mata TFD, Gajewski DW, Hall CK, Lacerda MC, Santos AG, Gomes JO, \nWoods DD: Application of Resilience Engineering on Safety in Offshore \nHelicopter Transportation. In: 2006 IEEE Systems and Information Engi‑\nneering Design Symposium: 28–28 April 2006 2006; 2006: 228–233.\n 16. Kitamura M: Resilience engineering for safety of nuclear power plant with \naccountability. In: Resilience Engineering in Practice, Volume 2 becoming \nresilient. edn. Edited by Nemeth C, Hollnagel E. Farnham Ashgate Publish‑\ning; 2016: 47–62.\n 17. Patriarca R, Falegnami A, De Nicola A, Villani ML, Paltrinieri N. Serious \ngames for industrial safety: an approach for developing resilience early \nwarning indicators. Saf Sci. 2019;118:316–31.\n 18. Bellamy LJ, Chambon M, van Guldener V. Getting resilience into safety \nprograms using simple tools ‑ a research background and practical \nimplementation. Reliab Eng Syst Saf. 2018;172:171–84.\n 19. EPRI: Final Report on Leading Indicators of Human Performance. In. \nEdited by Energy USDo. Washington DC: Palo Alto; 2001.\n 20. Sujan MA. A novel tool for organisational learning and its impact \non safety culture in a hospital dispensary. Reliab Eng Syst Saf. \n2012;101:21–34.\n 21. Wyte‑Lake T, Claver M, Der‑Martirosian C, Davis D, Dobalian A. Develop‑\ning a home‑based primary care disaster preparedness toolkit. Disaster \nMed Public Health Prep. 2017;11(1):56–63.\n 22. Lane SJ, McGrady E. Measures of emergency preparedness contributing \nto nursing home resilience. J Gerontol Soc Work. 2018;61(7):751–74.\n 23. MacKinnon RJ, Pukk‑Härenstam K, Kennedy C, Hollnagel E, Slater D. A \nnovel approach to explore Safety‑I and Safety‑II perspectives in in situ \nsimulations—the structured what if functional resonance analysis meth‑\nodology. Adv Simul. 2021;6(1):21.\n 24. Patriarca R, Di Gravio G, Costantino F, Falegnami A, Bilotta F. An ana‑\nlytic framework to assess organizational resilience. Saf Health Work. \n2018;9(3):265–76.\n 25. Righi AW, Saurin TA, Wachs P . A systematic literature review of resilience \nengineering: research areas and a research agenda proposal. Reliab Eng \nSyst Saf. 2015;141:142–52.\n 26. Berg SH, Akerjordet K, Ekstedt M, Aase K. Methodological strate‑\ngies in resilient health care studies: an integrative review. Saf Sci. \n2018;110:300–12.\n 27. Ellis LA, Churruca K, Clay‑Williams R, Pomare C, Austin EE, Long JC, \nGrødahl A, Braithwaite J. Patterns of resilience: a scoping review and \nbibliometric analysis of resilient health care. Saf Sci. 2019;118:241–57.\n 28. Iflaifel M, Lim RH, Ryan K, Crowley C. Resilient Health Care: a systematic \nreview of conceptualisations, study methods and factors that develop \nresilience. BMC Health Serv Res. 2020;20(1):324.\n 29. Macrae C, Draycott T. Delivering high reliability in maternity care: \nIn situ simulation as a source of organisational resilience. Saf Sci. \n2019;117:490–500.\n 30. Wiig S, Aase K, Bal R. Reflexive spaces: leveraging resilience into health‑\ncare regulation and management. J Patient Saf. 2020;17(8):e1681–4.\n 31. Deutsch E, Fairbanks T, Patterson M: Simulation as a tool to study systems \nand enhance resilience. In: Delivering Resilient Health Care. edn. Edited \nby Hollnagel E, Braithwaite J, Wears R. London: Ruthledge; 2019.\n 32. Arksey H, O’Malley L. Scoping studies: towards a methodological frame‑\nwork. Int J Soc Res Methodol. 2005;8(1):19–32.\n 33. Peters MDJ, Marnie C, Tricco AC, Pollock D, Munn Z, Alexander L, McIner‑\nney P , Godfrey CM, Khalil H. Updated methodological guidance for the \nconduct of scoping reviews. JBI Evidence Synthesis. 2020;18(10):2119–26.\n 34. Tricco A, Langlois E, Straus S. Rapid reviews to strengthen health policy \nand systems: a practical guide. In.: World Health Organization; 2017.\n 35. Tricco AC, Lillie E, Zarin W, O’Brien KK, Colquhoun H, Levac D, Moher \nD, Peters MDJ, Horsley T, Weeks L, et al. PRISMA Extension for Scop‑\ning Reviews (PRISMA‑ScR): checklist and explanation. Ann Intern Med. \n2018;169(7):467–73.\n 36. Tricco AC, Straus SE, Ghaffar A, Langlois EV. Rapid reviews for health \npolicy and systems decision‑making: more important than ever before. \nSyst Rev. 2022;11(1):153.\nPage 11 of 11\nHaraldseid‑Driftland et al. BMC Health Services Research          (2023) 23:890 \n \n•\n \nfast, convenient online submission\n •\n  \nthorough peer review by experienced researchers in your ﬁeld\n• \n \nrapid publication on acceptance\n• \n \nsupport for research data, including large and complex data types\n•\n  \ngold Open Access which fosters wider collaboration and increased citations \n \nmaximum visibility for your research: over 100M website views per year •\n  At BMC, research is always in progress.\nLearn more biomedcentral.com/submissions\nReady to submit y our researc hReady to submit y our researc h  ?  Choose BMC and benefit fr om: ?  Choose BMC and benefit fr om: \n 37. Peters MDJ, Godfrey CM, Khalil H, McInerney P , Parker D, Soares CB. Guid‑\nance for conducting systematic scoping reviews. Int J Evid Based Healthc. \n2015;13(3):141–6.\n 38. Bartman T, Merandi J, Maa T, Kuehn S, Brilli RJ. Developing tools to \nenhance the adaptive capacity (Safety II) of health care providers at a \nchildren’s hospital. Jt Comm J Qual Patient Saf. 2021;47(8):526–32.\n 39. Bentley SK, McNamara S, Meguerdichian M, Walker K, Patterson M, Bajaj K. \nDebrief it all: a tool for inclusion of Safety‑II. Adv Simul. 2021;6(1):9.\n 40. Jackson J, Iacovides J, Duncan M, Alders M, Maben J, Anderson J. Opera‑\ntionalizing resilient healthcare concepts through a serious video game \nfor clinicians. Appl Ergon. 2020;87: 103112.\n 41. Hegde S, Hettinger AZ, Fairbanks RJ, Wreathall J, Krevat SA, Jackson CD, \nBisantz AM. Qualitative findings from a pilot stage implementation of a \nnovel organizational learning tool toward operationalizing the Safety‑II \nparadigm in health care. Appl Ergon. 2020;82: 102913.\n 42. Hermelin J, Bengtsson K, Woltjer R, Trnka J, Thorstensson M, Pettersson \nJ, Prytz E, Jonson C‑O. Operationalising resilience for disaster medicine \npractitioners: capability development through training, simulation and \nreflection. Cogn Tech Work. 2020;22(3):667–83.\n 43. Wahl K, Stenmarker M, Ros A. Experience of learning from everyday work \nin daily safety huddles—a multi‑method study. BMC Health Serv Res. \n2022;22(1):1101.\n 44. Mezirow J. How critical reflection triggers transformative learning. Foster‑\ning critical reflection in adulthood. 1990;1(20):1–6.\n 45. Sergiovanni TJ: The principalship: A reflective practice perspective: ERIC; \n1987.\n 46. Anderson JE, Ross AJ, Macrae C, Wiig S. Defining adaptive capacity in \nhealthcare: a new framework for researching resilient performance. Appl \nErgon. 2020;87: 103111.\n 47. Wiig S, Fahlbruch B: Exploring Resilience A Scientific Journey from Prac‑\ntice to Theory. In.: Springer Open; 2018.\n 48. Hollnagel E: Safety‑I and Safety‑II: the past and future of safety manage‑\nment: CRC Press; 2014.\n 49. Billett S. Securing intersubjectivity through interprofessional workplace \nlearning experiences. J Interprof Care. 2014;28(3):206–11.\n 50. Mattessich PW, Monsey BR: Collaboration: what makes it work. A review \nof research literature on factors influencing successful collaboration: ERIC; \n1992.\n 51. Green BN, Johnson CD. Interprofessional collaboration in research, educa‑\ntion, and clinical practice: working together for a better future. J Chiropr \nEduc. 2015;29(1):1–10.\n 52. Vangen S, Huxham C. Nurturing collaborative relations: building trust in \ninterorganizational collaboration. J Appl Behav Sci. 2003;39(1):5–31.\n 53. van Rijnsoever FJ, Hessels LK. Factors associated with disciplinary and \ninterdisciplinary research collaboration. Res Policy. 2011;40(3):463–72.\n 54. Anders Ericsson K. Deliberate practice and acquisition of expert perfor‑\nmance: a general overview. Acad Emerg Med. 2008;15(11):988–94.\n 55. Ree E, Haraldseid‑Driftland C: How Can Digital Learning Tools be Used to \nPromote Resilience in Healthcare? In: Resilience in a Digital Age: Global \nChallenges in Organisations and Society. edn. Edited by Matos F, Selig \nPM, Henriqson E. Cham: Springer International Publishing; 2022: 231–245.\n 56. Haraldseid‑Driftland C, Aase K, Billett S, 2019–09–28 ‑‑‑: Collaborative \nlearning in resilient healthcare studies ‑ a meta‑synthesis. In: Resilience in \nHealthcare Net Meeting. Japan; 2019.\n 57. Aase K, Guise V, Billett S, Sollid SJM, Njå O, Røise O, Manser T, Anderson JE, \nWiig S. Resilience in healthcare (RiH): a longitudinal research programme \nprotocol. BMJ Open. 2020;10(10): e038779.\n 58. Hollnagel E, Braithwaite J, Wears R. Resilient health care. Boca Raton: CRC \nPress; 2013.\n 59. Johnson A, Lane P: Resilience Work‑As‑Done in everyday clinical work. In: \nResilient Health Care, Volume 3 Reconciling Work‑as‑Imagined and Work‑\nas‑Done. edn. Edited by Braithwaite J, Wears R, L., Hollnagel E. Boca Raton: \nCRC Press; 2016: 97–114.\n 60. Wears RL, Hollnagel E, Braithwaite J: Resilient health care: Ashgate Pub‑\nlishing, Ltd.; 2015.\n 61. Hollnagel E, Braithwaite J, Wears RL. Delivering Resilient Health Care. New \nYork: Routledge; 2018.\n 62. Vugrin ED, Verzi SJ, Finley PD, Turnquist MA, Griffin AR, Ricci KA, Wyte‑Lake \nT. Modeling hospitals’ adaptive capacity during a loss of infrastructure \nservices. Journal of Healthcare Engineering. 2015;6: 781325.\nPublisher’s Note\nSpringer Nature remains neutral with regard to jurisdictional claims in pub‑\nlished maps and institutional affiliations.",
  "topic": "Health care",
  "concepts": [
    {
      "name": "Health care",
      "score": 0.7179397940635681
    },
    {
      "name": "Resilience (materials science)",
      "score": 0.6972072124481201
    },
    {
      "name": "Health administration",
      "score": 0.511653482913971
    },
    {
      "name": "Health informatics",
      "score": 0.5110560655593872
    },
    {
      "name": "Psychological resilience",
      "score": 0.49111077189445496
    },
    {
      "name": "Medicine",
      "score": 0.46122151613235474
    },
    {
      "name": "Nursing research",
      "score": 0.4394332468509674
    },
    {
      "name": "Knowledge management",
      "score": 0.40491437911987305
    },
    {
      "name": "Psychology",
      "score": 0.2610664665699005
    },
    {
      "name": "Nursing",
      "score": 0.25816506147384644
    },
    {
      "name": "Public health",
      "score": 0.22353079915046692
    },
    {
      "name": "Computer science",
      "score": 0.2104511260986328
    },
    {
      "name": "Thermodynamics",
      "score": 0.0
    },
    {
      "name": "Physics",
      "score": 0.0
    },
    {
      "name": "Psychotherapist",
      "score": 0.0
    },
    {
      "name": "Economics",
      "score": 0.0
    },
    {
      "name": "Economic growth",
      "score": 0.0
    }
  ]
}