{
    "title": "Can Large Language Models Generate Outpatient Clinic Letters at First Consultation That Incorporate Complication Profiles From UK and USA Aesthetic Plastic Surgery Associations?",
    "url": "https://openalex.org/W4389450729",
    "year": 2023,
    "authors": [
        {
            "id": "https://openalex.org/A5072923239",
            "name": "Richard H R Roberts",
            "affiliations": [
                "Swansea University"
            ]
        },
        {
            "id": "https://openalex.org/A2901467326",
            "name": "Stephen R Ali",
            "affiliations": [
                "Swansea University"
            ]
        },
        {
            "id": "https://openalex.org/A2134274997",
            "name": "Thomas D. Dobbs",
            "affiliations": [
                "Swansea University"
            ]
        },
        {
            "id": "https://openalex.org/A1988305265",
            "name": "Iain S Whitaker",
            "affiliations": [
                "Swansea University"
            ]
        },
        {
            "id": "https://openalex.org/A5072923239",
            "name": "Richard H R Roberts",
            "affiliations": [
                "Swansea University"
            ]
        },
        {
            "id": "https://openalex.org/A2901467326",
            "name": "Stephen R Ali",
            "affiliations": [
                "Swansea University"
            ]
        },
        {
            "id": "https://openalex.org/A2134274997",
            "name": "Thomas D. Dobbs",
            "affiliations": [
                "Swansea University"
            ]
        },
        {
            "id": "https://openalex.org/A1988305265",
            "name": "Iain S Whitaker",
            "affiliations": [
                "Swansea University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2202790819",
        "https://openalex.org/W4292779060",
        "https://openalex.org/W4288089799",
        "https://openalex.org/W4323350039",
        "https://openalex.org/W4321850160",
        "https://openalex.org/W3016559051",
        "https://openalex.org/W2167179738",
        "https://openalex.org/W2763635937",
        "https://openalex.org/W3130980736",
        "https://openalex.org/W4361289889",
        "https://openalex.org/W4382278861",
        "https://openalex.org/W4380291159",
        "https://openalex.org/W4362511131",
        "https://openalex.org/W2076349649",
        "https://openalex.org/W4322717386",
        "https://openalex.org/W4226278401"
    ],
    "abstract": "Abstract The importance of written communication between clinicians and patients, especially in the wake of the Supreme Court case of Montgomery vs Lanarkshire, has led to a shift toward patient-centric care in the United Kingdom. This study investigates the use of large language models (LLMs) like ChatGPT and Google Bard in enhancing clinic letters with gold-standard complication profiles, aiming to improve patients’ understanding and save clinicians’ time in aesthetic plastic surgery. The aim of this study is to assess the effectiveness of LLMs in integrating complication profiles from authoritative sources into clinic letters, thus enhancing patient comprehension and clinician efficiency in aesthetic plastic surgery. Seven widely performed aesthetic procedures were chosen, and complication profiles were sourced from the British Association of Aesthetic Plastic Surgeons (BAAPS) and the American Society of Plastic Surgeons (ASPS). We evaluated the proficiency of the ChatGPT4, ChatGPT3.5, and Google Bard in generating clinic letters which incorporated complication profiles from online resources. These letters were assessed for readability using an online tool, targeting a recommended sixth-grade reading level. ChatGPT4 achieved the highest compliance in integrating complication profiles from BAAPS and ASPS websites, with average readability grades between eighth and ninth. ChatGPT3.5 and Google Bard showed lower compliance, particularly when accessing paywalled content like the ASPS Informed Consent Bundle. In conclusion, LLMs, particularly ChatGPT4, show promise in enhancing patient communications in aesthetic plastic surgery by effectively incorporating standard complication profiles into clinic letters. This aids in informed decision making and time saving for clinicians. However, the study underscores the need for improvements in data accessibility, search capabilities, and ethical considerations for optimal LLM integration into healthcare communications. Future enhancements should focus on better interpretation of inaccessible formats and a Human in the Loop approach to combine Artifical Intelligence capabilities with clinician expertise. Level of Evidence: 3",
    "full_text": null
}