{
    "title": "Automatic extraction of FAIR data from publications using LLM",
    "url": "https://openalex.org/W4388762522",
    "year": 2023,
    "authors": [
        {
            "id": "https://openalex.org/A5064912268",
            "name": "Luc Patiny",
            "affiliations": [
                "Rhodium Group (United States)"
            ]
        },
        {
            "id": "https://openalex.org/A5003838040",
            "name": "Guillaume Godin",
            "affiliations": [
                "Firmenich (Switzerland)"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2130629641",
        "https://openalex.org/W4386933346",
        "https://openalex.org/W4393476339",
        "https://openalex.org/W4235023933",
        "https://openalex.org/W4388762522",
        "https://openalex.org/W3146683208",
        "https://openalex.org/W4320727261",
        "https://openalex.org/W2900090807",
        "https://openalex.org/W2918096534",
        "https://openalex.org/W2605380649",
        "https://openalex.org/W4307468223",
        "https://openalex.org/W3030068589",
        "https://openalex.org/W2034354062",
        "https://openalex.org/W2620259134",
        "https://openalex.org/W591446518",
        "https://openalex.org/W1975147762",
        "https://openalex.org/W3118695441",
        "https://openalex.org/W4207004502",
        "https://openalex.org/W3158543275",
        "https://openalex.org/W4205238372",
        "https://openalex.org/W3186326839",
        "https://openalex.org/W2910838498",
        "https://openalex.org/W3203992401"
    ],
    "abstract": "Since the beginning of modern science, researchers have used a specific format to communicate their findings in a standardized language. Such formats help to ensure that results can be replicated and published. With the rise of digitalization, artificial intelligence has become increasingly important in combination with the scientific literature sources of data. This synergy serves as a foundation of robust models following central principles of FAIR (Findable, Accessible, Interoperable, Reusable) data. By having access to more precise data, it is reasonable to anticipate the development of improved models. Specifically, large neural networks have demonstrated a high level of responsiveness to the quality of the data used. Therefore, enhancing the data quality can potentially lead to a reduction in the size of neural networks. Large Language Models (LLMs) have proven to be incredibly effective at replicating human tasks. This is a significant improvement that not only automatizes process but also leads to better results. By combining human and LLM assistance, we can produce higher-quality content and solve repetitive tasks that would otherwise take years to complete. Those generative AI assistants can follow instructions to transform and extrapolate existing text. Our contribution outlines a method for automatically extracting experimental data of molecules from literature. Essentially by our prompt engineering, we demonstrate that this process can be made more cost-effective. Secondly, we use automated fact checking principles to ensure the original data quality as well as the data retrieval by LLM. Ultimately, our aim is to provide guidance for the publication of organic chemical experimental data to assist researchers and enhance FAIR data.",
    "full_text": null
}