{
  "title": "Unleashing the Potential of Generative AI, Conversational Agents and Chatbots in Educational Praxis: A Systematic Review and Bibliometric Analysis of GenAI in Education",
  "url": "https://openalex.org/W4388910605",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A2785356293",
      "name": "Aras Bozkurt",
      "affiliations": [
        "Anadolu University"
      ]
    },
    {
      "id": "https://openalex.org/A2785356293",
      "name": "Aras Bozkurt",
      "affiliations": [
        "Anadolu University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4387819982",
    "https://openalex.org/W4386251129",
    "https://openalex.org/W4362516849",
    "https://openalex.org/W4386452646",
    "https://openalex.org/W4385262278",
    "https://openalex.org/W4327672398",
    "https://openalex.org/W4386544117",
    "https://openalex.org/W3160856016",
    "https://openalex.org/W4383113923",
    "https://openalex.org/W4386574345",
    "https://openalex.org/W4366420437",
    "https://openalex.org/W4385422591",
    "https://openalex.org/W3118615836",
    "https://openalex.org/W4385553980",
    "https://openalex.org/W4366989878",
    "https://openalex.org/W2010815017",
    "https://openalex.org/W4321499901",
    "https://openalex.org/W4360891295",
    "https://openalex.org/W4379054888"
  ],
  "abstract": "In the rapidly evolving landscape of education, the pivotal axis around which transformation revolves is human-AI interaction. In this sense, this paper adopts a data mining and analytic approach to understand what the related literature tells us regarding the trends and patterns of generative AI research in educational praxis. Accordingly, this systematic exploration spotlights the following research themes: Interaction and communication with generative AI-powered chatbots; impact of the LLMs and generative AI on teaching and learning, conversational educational agents and their opportunities, challenges, and implications; leveraging Generative AI for enhancing social and cognitive learning processes; promoting AI literacy for unleashing future opportunities; harnessing Generative AI to expand academic capabilities, and lastly, augmenting educational experiences through human-AI interaction. Beyond the identified research themes and patterns, this paper argues that emotional intelligence, AI literacy, and prompt engineering are the trending research topics that require further exploration. Accordingly, it's in this praxis that emotional intelligence emerges as a pivotal attribute, as AI systems' ability to discern and respond to nuanced emotional cues plays a substantial role in the efficacy of educational interactions. Generative AI literacy then takes center stage, becoming an indispensable asset in an era permeated with AI technologies, equipping students with the tools to critically engage with AI systems, thereby ensuring they become active, discerning users of these powerful tools. Concurrently, prompt engineering, the art of crafting queries that yield precise and valuable responses from AI systems, empowers both educators and students to maximize the utility of AI-driven educational resources.",
  "full_text": "EDITORIAL\nCORRESPONDING AUTHOR:\nAras Bozkurt\nAnadolu University, Türkiye\narasbozkurt@gmail.com\nKEYWORDS:\nGenerative AI; GenAI; \nartificial intelligence; AI; \nchatbots; conversational \nagents; education; teaching; \nlearning; higher education; \neducational technology; \nGPT; generative pre-trained \ntransformer; ChatGPT; large \nlanguage models; LLMs; \nnatural language processing; \nsystematic review; bibliometric \nanalysis\nTO CITE THIS ARTICLE:\nBozkurt, A. (2023). Unleashing \nthe Potential of Generative \nAI, Conversational Agents \nand Chatbots in Educational \nPraxis: A Systematic Review \nand Bibliometric Analysis of \nGenAI in Education. Open \nPraxis, 15(4), pp. 261–270. DOI: \nhttps://doi.org/10.55982/\nopenpraxis.15.4.609\nUnleashing the Potential \nof Generative AI, \nConversational Agents and \nChatbots in Educational \nPraxis: A Systematic Review \nand Bibliometric Analysis of \nGenAI in Education\nARAS BOZKURT \nABSTRACT\nIn the rapidly evolving landscape of education, the pivotal axis around which \ntransformation revolves is human-AI interaction. In this sense, this paper adopts a \ndata mining and analytic approach to understand what the related literature tells \nus regarding the trends and patterns of generative AI research in educational praxis. \nAccordingly, this systematic exploration spotlights the following research themes: \nInteraction and communication with generative AI-powered chatbots; impact of the \nLLMs and generative AI on teaching and learning, conversational educational agents \nand their opportunities, challenges, and implications; leveraging Generative AI for \nenhancing social and cognitive learning processes; promoting AI literacy for unleashing \nfuture opportunities; harnessing Generative AI to expand academic capabilities, and \nlastly, augmenting educational experiences through human-AI interaction. Beyond \nthe identified research themes and patterns, this paper argues that emotional \nintelligence, AI literacy, and prompt engineering are the trending research topics that \nrequire further exploration. Accordingly, it’s in this praxis that emotional intelligence \nemerges as a pivotal attribute, as AI technologies often struggle to comprehend and \nrespond to the nuanced emotional cues. Generative AI literacy then takes center \nstage, becoming an indispensable asset in an era permeated with AI technologies, \nequipping students with the tools to critically engage with AI systems, thereby ensuring \nthey become active, discerning users of these powerful tools. Concurrently, prompt \nengineering, the art of crafting queries that yield precise and valuable responses \nfrom AI systems, empowers both educators and students to maximize the utility of \nAI-driven educational resources.\n262\nBozkurt   \nOpen Praxis   \nDOI: 10.55982/\nopenpraxis.15.4.609INTRODUCTION: WELCOME TO THE AGE OF THE ALGORITHMS \nAND GENERATIVE AI\nThe emergence of publicly available and accessible Generative AI applications by the very \nend of 2022 was undoubtedly an important milestone in the relatively old (Bozkurt, 2023a; \nŞenocak et al., 2023 ) and exciting journey of artificial intelligence (AI) (Bozkurt, 2023a). Due \nto its potential across different disciplines and domains of our lives, following the advent of \nChatGPT (OpenAI, 2022), there has been, metaphorically, a new AI gold rush and a race among \nmany other competitors announcing different generative AI technologies (Griffith & Metz, 2023; \nRudolph et al., 2023 ). For instance, following the advent of OpenAI’s ChatGPT; Google’s Bard, \nMicrosoft’s Copilot, Meta’s Llama, and X’s Grok were announced, and platforms and services \nsuch as DALL-E, Midjourney, Runway, Synthesia, Jasper, Notion, Perpexlity, Firefly, and many \nothers have become very popular.\nPerhaps what excites us is the capability of generative AI technologies to analyze the complex \npatterns and structures of human language. They are primarily trained to understand and \ngenerate human language, emulating one of the most sophisticated technologies, which is \nlanguage (Bozkurt, 2023b). Furthermore, considering its promises for co-creation and synthetic \ncontent generation (Bozkurt, 2023c; Bozkurt & Sharma, 2023), it can be argued that generative \nAI will become one of the most effective educational technologies in educational praxis. \nHowever, in the midst of this rush, it was also highlighted that while generative AI is a powerful \ntechnology in education, it still needs to be approached with more caution to ensure safe and \nresponsible use of it (Tlili et al., 2023).\nREFLECTIONS FROM THE RELATED LITERATURE: THE GOOD, THE \nBAD AND THE UGLY\nThe field of education was not indifferent to these exciting developments and carried out \ndifferent meta studies to reveal the good, bad, and ugly aspects of generative AI technologies. \nFor instance, Bozkurt et al. (2023) imagined a speculative future and argued that it is now “the \nbest of times to define human vs AI contribution to education because AI can accomplish \nmore and more educational activities that used to be the prerogative of human educators. \nTherefore, it is imperative to rethink the respective roles of technology and human educators \nin education with a future-oriented mindset.” (p. 53). In another study, İpek et al. (2023) noted \nthat AI integration in education has been already underway, enabling advanced cognitive tasks \nusing technology. This shift creates new opportunities in education, but educators must adapt \ncreatively to mitigate AI’s potential drawbacks, leading to an evolving educational landscape. \nThrough a rapid review study, Lo (2023) identified that while generative AI can assist instructors \nin creating course materials and offer suggestions and be a virtual tutor for students to answer \nquestions and promote collaboration, challenges exist, such as producing incorrect information \nand evading plagiarism checks. It’s, therefore, crucial to promptly update assessment methods \nand policies in educational institutions. By focusing large language models (LLMs), Yan et al. \n(2023) reported the LLMs in automating education such as profiling/labelling, detection, \ngrading, teaching support, prediction, knowledge representation, feedback, content generation, \nand recommendation. The researchers also identified a number of practical and ethical \nchallenges, including low technological readiness, lack of replicability and transparency and \ninsufficient privacy and beneficence considerations. In the their study, Bahroun et al. (2023) \nidentified key issues regarding the use of generative AI such as technology adoption, classroom \ndesign, assessment practices, language instruction, ethics, subject-specific education, learning \noutcomes, student engagement, challenges in AI integration, and innovative pedagogical \napproaches. Likewise, Pradana et al. (2023) stressed out that AI’s capacity to handle tasks \ndemanding knowledge and creative thinking, such as grading assignments and providing \nstudent counseling, could transform education. Nevertheless, challenges arise in ensuring \nAI-generated responses’ accuracy and reliability, along with apprehensions about replacing \neducators. Ansari et al. (2023), by highlighting the issues such as accuracy, reliability, academic \nintegrity, and other potential negative effects on cognitive and social development, further \npointed out that generative AI can be used as a teaching assistant, personalised tutor, \nassessment partner, and co-researcher in the educational settings.\n263\nBozkurt   \nOpen Praxis   \nDOI: 10.55982/\nopenpraxis.15.4.609Through their in-depth analysis, Yu and Guo (2023) highlighted that, to unleash its real potential \nin terms of personalized education, intelligent teaching, collaborative education, and virtual \nteaching, generative AI should first address the issues such as opacity and unexplainability, \ndata privacy and security, personalization and fairness, and effectiveness and reliability. Despite \nits rising popularity and expanded capabilities, Lambert and Stevens (2023) warn stakeholders \nin the educational landscapes regarding the concerns related to cheating, misinformation, \nbias, abuse, misuse, privacy, and safety. In their comprehensive study that is investigating \nthe impact of AI-powered chatbots, Dempere et al. (2023) emphasized generative AI’s \ntransformative potential and versatile uses in education. They noted advantages of generative \nAI such as research assistance, automated grading, and improved human-computer \ninteraction, yet, they also articulated concerns such as online test security, plagiarism, and \nbroader societal and economic impacts like job displacement, the digital literacy gap, and AI-\ninduced anxiety. Additionally, the researchers highlighted potential benefits such as simplified \nenrollment, enhanced student services, improved teaching, research support, and increased \nstudent retention. On the flip side, they also noted risks such as privacy breaches, misuse, bias, \nmisinformation, reduced human interaction, and accessibility issues were also recognized. \nAdditionally, Montenegro-Rueda et al. (2023) critically noted that generative AI technologies \nwill have a profound impact and that requires revisiting teacher/instructor roles in educational \nsettings where most of the practices will be driven by generative AI.\nIn all, the related literature reported the good, bad and ugly possibilities of generative AI that \nwe can encounter in the educational landscape. At this point, we need studies that examine \ngenerative AI technologies from a holistic perspective, and this is where this study comes in. \nIn this context, the main purpose of this paper is to identify and examine research trends and \npatterns in generative AI studies from the perspective of the educational landscape.\nMETHODOLOGY\nRESEARCH DESIGN\nBecause the main purpose of this study is to get a broader understanding and identify emerging \nresearch trends and patterns regarding the use of generative AI in education, the study \nadopted systematic literature review (Gough et al., 2012) and bibliometric analysis approaches \n(Donthu et al., 2021). Furthermore, it employed data mining and analytical techniques (Fayyad \net al., 2002), including t-SNE analysis (van der Maaten & Hinton, 2008), text mining (Feldman \n& Sanger, 2007) and social network analysis (SNA; Hansen et al., 2010). The rationale for using \nmultiple analytical methods was to triangulate the data, enhancing the reliability and validity \nof the analytics (Thurmond, 2001), and to investigate various layers of the research corpus in \norder to provide a more comprehensive perspective when addressing the research questions.\nINCLUSION CRITERIA AND RESEARCH SAMPLING\nThe study encompassed publications indexed in Scopus database, which were accessible through \nlibrary services or open access and had the specified search strings in their titles (see Table 1).  \nThe researcher opted for Scopus as our academic database for data retrieval due to its \nDATABASE SCOPUS (2022–2024).\nSearch Strings Article Title: “generative AI” OR “generative artificial intelligence” OR “gen AI” OR “GPT” OR \n“chatbot*” OR “conversational agent*” OR “chatgpt” OR “bard” OR “large language model*”\nAND\nTitle, abstract, keywords: “education*” OR “school*” OR “colleague*” OR “Tertiary Education” \nOR “teacher*” OR “student*”\nIdentification A total of 1427 documents were identified.\nScreening Subject area was limited to Social Sciences:\n•\t 875 papers from different subject areas were excluded.\nThe following document types were excluded\n•\t Note (n = 22), Letter (n = 15), Erratum (n = 1), Short Survey (n = 1)\nInclusion A total of 513 documents were included into the final research corpus. Table 1 Search strings and \nPRISMA protocol.\n264\nBozkurt   \nOpen Praxis   \nDOI: 10.55982/\nopenpraxis.15.4.609comprehensive coverage of publications, enabling an inclusive approach. To construct our \nresearch corpus, we utilized search strings pertaining to generative AI in education (see Table \n1). Following the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) \nprotocol (Page et al., 2021), the final research corpus consisted of 513 publications.\nLIMITATIONS\nThis paper recognizes certain limitations when interpreting the study’s findings. First and \nforemost, even though Scopus is the largest database for peer-reviewed publications, this \nstudy’s findings are reliant on data obtained from a single source, specifically publications \nindexed by Scopus. Despite the creation of a substantial research corpus through this search, \nit’s essential to note that articles related to generative AI in education can also be found in \nother databases, sources and formats, including the grey literature. Consequently, this study \nprovides only a partial perspective.\nFINDINGS AND DISCUSSION\nThe following sections report trends identified through bibliometric analysis and then reports \nresearch patterns identified through data mining and analytics approaches.\nRESEARCH CORPUS\nThe research corpus includes 513 papers published in 255 different sources between 2022–\n2024. A total of 1624 authors contributed to these studies and 105 of the relevant studies were \nwritten as single-author studies. These studies contain a total of 1327 keywords and 20733 \nreferences.\nANALYSIS OF THE TITLES THROUGH T-SNE ANALYSIS\nt-SNE analysis has enabled us to visualize the underlying local structure within high-\ndimensional data in three dimensions, thus revealing the thematic structure of titles through a \nstraightforward scatter plot. The analysis involved representing the titles in a three-dimensional \nspace, as shown in Figure 1. Subsequently, the researcher identified three prominent themes \nresulting from t-SNE analysis:\n•\t Interaction and communication with generative AI powered chatbots.\n•\t Impact of the LLMs and generative AI on teaching and learning.\n•\t Conversational educational agents and their opportunities, challenges, and implications.\nAccordingly, the first pink dimension, interaction and communication with generative AI powered \nchatbots, emphasizes the conversational aspects of generative AI technology, particularly \ninteraction and communication with chatbots powered by AI (see Figure 1 : generative, \nartificial, intelligence, chatbots, students, learning). This dimension highlights the relevance \nFigure 1 Analysis of the titles \nthrough t-SNE.\n\n265\nBozkurt   \nOpen Praxis   \nDOI: 10.55982/\nopenpraxis.15.4.609of generative artificial intelligence and chatbots in the context of students and learning. It \ntouches upon themes such as generative AI, artificial intelligence, chatbots, students, and \nlearning. The second green dimension, impact of the LLMs and generative AI on teaching and \nlearning, explores how LLMs and generative AI technology can influence higher education, \nconsidering elements like the impact, opportunities, and their role in the educational landscape \n(see Figure 1: GPT, large, language, models, higher, education, impact, opportunties). In the \nthird blue dimension, conversational educational agents and their opportunities, challenges, and \nimplications, the spotlight is on various research areas that warrant attention in the future, \nincluding assessment and evaluation, writing skills, and learners’ academic performance (see \nFigure 1: assesment, writing, practice, academic, performance). Furthermore, this dimension \ndelves into the opportunities and challenges associated with generative artificial intelligence \nand conversational agents. It also analyzes the potential consequences of using these \ntechnologies on students and teachers across K-12 and higher education levels (see Figure 1: \nfuture, implications, potential, challenges, students, teachers, school, university).\nANALYSIS OF THE ABSTRACTS THROUGHT TEXT MINING\nThe abstracts of the articles within the research corpus underwent analysis to examine the co-\noccurrence and lexical relationships among the words used (Figure 2), ultimately leading to the \nidentification of emerging themes. These themes were discovered by tracing interconnected \nlexical paths and are as follows:\n•\t Leveraging generative AI for enhancing social and cognitive learning processes.\n•\t Promoting AI literacy for unleashing future opportunities.\n•\t Harnessing generative AI to expand academic capabilities.\nThe first theme, leveraging generative AI for enhancing social and cognitive learning processes, \nunderscores the potential of generative AI with a focus on its conversational capabilities and its \ninfluence on educational processes. This theme emphasizes its impact on students’ experiences, \nknowledge acquisition, communication, engagement, as well as its role in facilitating social \nand cognitive development among learners (see the connected paths on Figure 2: students, \nexperience, knowledge, communication, engagement, conversational, agents, social, cognitive, \nlearners). The second theme, promoting AI literacy for unleashing future opportunities , \nhighlights the necessity of improving our understanding of AI and the requirement to develop \nnew literacies to effectively embrace these evolving technologies. It addresses the importance \nFigure 2 Analysis of the \nabstracts through text-mining.\n\n266\nBozkurt   \nOpen Praxis   \nDOI: 10.55982/\nopenpraxis.15.4.609of AI literacy for educators and its significance in the context of higher education, research, and \nthe need to prepare for the future adoption of AI (see the connected paths on Figure 2: literacy, \neducators, technology, AI, higher, education, research, need, future, adoption). The third \ntheme, harnessing generative AI to expand academic capabilities, underscores the potential of \ngenerative AI as a powerful educational tool to enhance and augment academic capabilities. \nIt points to its applications in critical areas such as academic tools, personalized learning, \naccessibility, and design, benefiting both students and higher education institutions (see the \nconnected paths on Figure 2: GPT, ChatGPT, tools, critical, academic; potential, generative AI, \nhigher education; personalized learning, accessibility; design, students, university).\nSOCIAL NETWORK ANALYSIS OF THE KEYWORDS\nThrough SNA, strategic keywords as nodes within the textual network were identified and \nsummarized, leading to the recognition of one prominent theme:\n•\t Augmenting educational experiences through human-AI interaction.\nThis theme highlights the novel form of interaction emerging within the educational context, \nparticularly focusing on the evolving human-machine interaction, more specifically human-\ngenerative AI interaction. The interconnected nodes in the keyword network (see connected \nnodes in Figure 3: artificial intelligence, chatbots, chatGPT, students, large language model, \ncomputational linguistics, language processing, natural language processing) collectively \nemphasize the significant shift in educational technologies, acknowledging that teaching and \nlearning are inherently social endeavors, and this new type of interaction holds substantial \npromise for the educational landscape.\nCONCLUSION: REVOLUTION, DISTRACTION, DISRUPTION, OR \nDESTRUCTION\nThis paper’s findings through data mining and analytics approaches have revealed seven \ndistinct themes and patterns that hold promise as potential research areas in the context of \ngenerative AI in educational praxis. These themes and patterns include:\n•\t Interaction and communication with generative AI powered chatbots.\n•\t Impact of the LLMs and generative AI on teaching and learning.\n•\t Conversational educational agents and their opportunities, challenges, and implications.\n•\t Leveraging generative AI for enhancing social and cognitive learning processes.\n•\t Promoting AI literacy for unleashing future opportunities.\n•\t Harnessing generative AI to expand academic capabilities.\n•\t Augmenting educational experiences through human-AI interaction.\nIn the ever-evolving landscape of education, the exploration of generative AI’s multifaceted \nimpact has uncovered a rich tapestry of themes. From the profound influence of interaction and \nFigure 3 Analysis of the \ntitles through social network \nanalysis.\n\n267\nBozkurt   \nOpen Praxis   \nDOI: 10.55982/\nopenpraxis.15.4.609communication with generative AI-powered chatbots to the transformative effects of Large \nLanguage Models (LLMs) and generative AI on teaching and learning, the journey of lifelong \nlearners has been marked by the discovery of conversational educational agents, with their \nvast array of opportunities, challenges, and implications. Leveraging generative AI to enhance \nsocial and cognitive learning processes has emerged as a promising avenue, while the call \nto promote AI literacy is recognized as a means to unleash future educational opportunities. \nThe harnessing of generative AI to expand academic capabilities showcases the technology’s \npower to reshape academia. Finally, the compelling prospect of augmenting educational \nexperiences through human-AI interaction has reshaped the educational landscape. As we \nconclude this exploration, it is evident that generative AI’s role in education extends far beyond \nthe mere adoption of technology; it encompasses a profound and transformative journey \nthat empowers learners, educators, and educational systems to embark on an exciting path \ntowards innovation, inclusivity, and excellence in the educational praxis.\nAs a final note, while the question of whether generative AI represents a revolutionary force, \na potential distraction, a disruptive element, or even a destructive influence, one certainty \nprevails: no educational technology, particularly in the case of generative AI, can be considered \nneutral. It will undoubtedly introduce numerous opportunities and challenges that demand \nour attention and exploration.\nFURTHER REMARKS\nBeyond the findings of this paper, there are three lines of research areas that can be considered \nfor future research directions. These are; emotional intelligence, AI literacy, and prompt \nengineering.\nFirst of all, one of the notable challenges associated with the integration of generative AI in \neducational settings is the potential lack of emotional intelligence. While these technologies \nexcel in processing information and generating responses, they often struggle to comprehend \nand respond to the nuanced emotional cues and needs of learners. The absence of emotional \nintelligence in AI systems can hinder their ability to provide effective support and personalized \nguidance, which are crucial elements in the learning process. As we continue to explore the \nimpact of generative AI in education, addressing this emotional intelligence gap becomes \nimperative to ensure that AI-enhanced educational experiences are not only informative but \nalso empathetic and supportive. Future research and development efforts, therefore, should \naim to bridge this gap and make generative AI a more holistic and emotionally intelligent tool \nin educational landscape.\nSecondly, the development of generative AI literacy  stands as a pivotal challenge and \nopportunity. Just as individuals learn to read, write, and interpret language, they must also \ngain proficiency in understanding, interacting with, and critically evaluating generative AI \ntechnologies. Building generative AI literacy is, therefore, essential not only for the current \ndigital age but also for shaping the future of education. By equipping learners with generative \nAI literacy, educational institutions can empower students to harness the full potential of \nthese technologies. This literacy entails not only knowing how to use AI-driven tools but also \nunderstanding the ethical considerations, biases, and limitations inherent in such systems. It \nencourages students to become discerning consumers and creators of AI-generated content, \nfostering critical thinking and digital citizenship. Generative AI literacy can be integrated into \nthe curriculum to cultivate a new generation of informed and responsible users. Students can \nexplore the algorithms that power AI, engage in discussions about AI’s societal impact, and \ndevelop the skills to collaborate with AI systems effectively. Additionally, educators should \nadapt their teaching methods to incorporate generative AI literacy, preparing students for a \nfuture where AI is an integral part of their personal and professional lives. In all, generative \nAI literacy in educational praxis ensures that students are not passive consumers but active \nparticipants in an AI-augmented world. It enables them to leverage AI’s capabilities while \npromoting ethical, responsible and thoughtful engagement with these powerful tools.\nLastly, prompt engineering emerges as a critical area of focus in the integration of generative \nAI into pedagogical practices. Prompt engineering involves the skill of crafting well-structured \nand effective queries or requests to extract desired responses from AI systems. It’s akin to \n268\nBozkurt   \nOpen Praxis   \nDOI: 10.55982/\nopenpraxis.15.4.609designing the questions in an educational assessment, and it plays a pivotal role in shaping \nthe quality of interactions between students and AI-powered educational tools. Educational \ninstitutions can greatly benefit from emphasizing prompt engineering within their curricula. By \nteaching students how to formulate clear and contextually relevant prompts, educators can \nempower learners to effectively leverage AI technologies for personalized learning experiences. \nStudents who are adept at prompt engineering will be able to elicit more tailored and insightful \nresponses from AI systems, enhancing their problem-solving skills and knowledge acquisition. \nFurthermore, educators themselves can benefit from understanding prompt engineering. They \ncan design prompts that challenge students’ critical thinking and problem-solving abilities, \nfostering deeper engagement and a more interactive learning environment. This approach \nfacilitates the creation of AI-enhanced educational content that aligns with specific learning \nobjectives and supports educators in providing valuable, individualized feedback. In this \ncontext, it can be argued that as AI continues to play a more prominent role in education, \nfostering expertise in prompt engineering becomes increasingly relevant.\nIn all, based on the findings of this study, it is possible to say that generative AI will affect all our \nlives, but considering the rapid development of generative AI technology, it is difficult to predict \nto what extent it will affect our lives. Nevertheless, AI is here to stay, and we can therefore \nembrace generative AI technologies and seize the opportunities they present. Last but not \nleast, it should also be noted that the future of education lies not in AI’s dominion but in the \nsymbiotic relationship between human and AI, forging an enriched, diversified, and adaptive \neducational ecosystem that caters to individual learning needs.\nETHICS AND CONSENT\nThe datasets used and/or analysed during the current study are available from the corresponding \nauthor on reasonable request.\nACKNOWLEDGEMENTS\nThe author of this paper, Dr. Aras Bozkurt, owes a debt of gratitude to John McCarthy, Marvin \nL. Minsky, Nathaniel Rochester and Claude E. Shannon, who first introduced the concept of \nartificial intelligence in their magnum opus work entitled A Proposal for the Dartmouth Summer \nResearch Project on Artificial Intelligence ; Isaac Asimov, who inspired the study of artificial \nintelligence with his arguments in his fictional work Three Laws of Robotics ; and Alan Turing, \nwho made significant contributions to the advancement of Artificial Intelligence studies with \na single but critical and thought-provoking question “ Can machines think?” and his simulation \ngame known as the Turing Test.\nFUNDING INFORMATION\nThis paper is funded by Anadolu University with grant number SBA-2023-1852.\nCOMPETING INTERESTS\nThe author has no competing interests to declare.\nAUTHOR CONTRIBUTIONS ( CREDIT )\nAras Bozkurt: Conceptualization, methodology, formal analysis, investigation, data curation, \nwriting—original draft preparation, writing—review and editing. The author has read and \nagreed to the published version of the manuscript.\nAUTHOR INFORMATION\nThis paper was reviewed and proofread with the assistance of OpenAI’s GPT-4, complementing \nthe human editorial process.\n269\nBozkurt   \nOpen Praxis   \nDOI: 10.55982/\nopenpraxis.15.4.609AUTHOR AFFILIATIONS\nAras Bozkurt  orcid.org/0000-0002-4520-642X \nAnadolu University, Türkiye\nREFERENCES\nAnsari, A. N., Ahmad, S., & Bhutta, S. M. (2023). Mapping the global evidence around the use of ChatGPT \nin higher education: A systematic scoping review. Education and Information Technologies, 1–41. DOI: \nhttps://doi.org/10.1007/s10639-023-12223-4\nBahroun, Z., Anane, C., Ahmed, V., & Zacca, A. (2023). Transforming Education: A Comprehensive Review \nof Generative Artificial Intelligence in Educational Settings through Bibliometric and Content Analysis. \nSustainability, 15(17), 12983. DOI: https://doi.org/10.3390/su151712983\nBozkurt, A. (2023a). Postdigital Artificial Intelligence. In P. Jandri (Eds.), Encyclopedia of Postdigital Science \nand Education. Cham: Springer. DOI: https://doi.org/10.1007/978-3-031-35469-4_2-2\nBozkurt, A. (2023b). Generative artificial intelligence (AI) powered conversational educational agents: \nThe inevitable paradigm shift. Asian Journal of Distance Education, 18(1), 198–204. DOI: https://doi.\norg/10.5281/zenodo.7716416\nBozkurt, A. (2023c). Generative AI, synthetic contents, open educational resources (OER), and open \neducational practices (OEP): A new front in the openness landscape. Open Praxis, 15(3), 178–184. \nDOI: https://doi.org/10.55982/openpraxis.15.3.579\nBozkurt, A., & Sharma, R. C. (2023). Generative AI and prompt engineering: The art of whispering to let \nthe genie out of the algorithmic world. Asian Journal of Distance Education, 18(2), i–vii. DOI: https://\ndoi.org/10.5281/zenodo.8174941\nBozkurt, A., Xiao, J., Lambert, S., Pazurek, A., Crompton, H., Koseoglu, S., Farrow, R., Bond, M., Nerantzi, \nC., Honeychurch, S., Bali, M., Dron, J., Mir, K., Stewart, B., Costello, E., Mason, J., Stracke, C. M., \nRomero-Hall, E., Koutropoulos, A., Toquero, C. M., Singh, L., Tlili, A., Lee, K., Nichols, M., Ossiannilsson, \nE., Brown, M., Irvine, V., Raffaghelli, J. E., Santos-Hermosa, G Farrell, O., Adam, T., Thong, Y. L., \nSani-Bozkurt, S., Sharma, R. C., Hrastinski, S., & Jandrić, P. (2023). Speculative futures on ChatGPT \nand generative artificial intelligence (AI): A collective reflection from the educational landscape. Asian \nJournal of Distance Education, 18(1), 53–130. DOI: https://doi.org/10.5281/zenodo.7636568\nDempere, J., Modugu, K. P., Hesham, A., & Ramasamy, L. (2023). The impact of ChatGPT on higher \neducation. The impact of ChatGPT on higher education. Frontiers in Education, 8, 1206936. DOI: \nhttps://doi.org/10.3389/feduc.2023.1206936\nDonthu, N., Kumar, S., Mukherjee, D., Pandey, N., & Lim, W. M. (2021). How to conduct a bibliometric \nanalysis: An overview and guidelines. Journal of Business Research, 133, 285–296. DOI: https://doi.\norg/10.1016/j.jbusres.2021.04.070\nFayyad, U., Grinstein, G. G., & Wierse, A. (Eds.) (2002). Information visualization in data mining and \nknowledge discovery. Morgan Kaufmann.\nFeldman, R., & Sanger, J. (2007). The text mining handbook: Advanced approaches in analyzing \nunstructured data. Cambridge University Press. DOI: https://doi.org/10.1017/CBO9780511546914\nGough, D., Oliver, S., & Thomas, J. (2012). An introduction to systematic reviews. Sage.\nGriffith, E., & Metz, C. (2023, March 14). ‘Let 1,000 flowers bloom’: A.I. funding frenzy escalates. The New \nYork Times. https://www.nytimes.com/2023/03/14/technology/ai-funding-boom.html?\nHansen, D., Shneiderman, B., & Smith, M. A. (2010). Analyzing social media networks with NodeXL: \nInsights from a connected world. Morgan Kaufmann. DOI: https://doi.org/10.1016/B978-0-12-\n382229-1.00002-3\nİpek, Z. H., Gözüm, A. İ. C., Papadakis, S., & Kallogiannakis, M. (2023). Educational Applications of the \nChatGPT AI System: A Systematic Review Research. Educational Process: International Journal, 12(3), \n26–55. DOI: https://doi.org/10.22521/edupij.2023.123.2\nLambert, J., & Stevens, M. (2023). ChatGPT and Generative AI Technology: A Mixed Bag of Concerns and \nNew Opportunities. Computers in the Schools, 1–25. DOI: https://doi.org/10.1080/07380569.2023.22\n56710\nLo, C. K. (2023). What is the impact of ChatGPT on education? A rapid review of the literature. Education \nSciences, 13(4), 410. DOI: https://doi.org/10.3390/educsci13040410\nMontenegro-Rueda, M., Fernández-Cerero, J., Fernández-Batanero, J. M., & López-Meneses, E. (2023). \nImpact of the Implementation of ChatGPT in Education: A Systematic Review. Computers, 12(8). DOI: \nhttps://doi.org/10.3390/computers12080153\nOpenAI. (2022). ChatGPT: Optimizing language models for dialogue. https://openai.com/blog/chatgpt/\nPage, M. J., McKenzie, J. E., Bossuyt, P. M., Boutron, I., Hoffmann, T. C., Mulrow, C. D., Shamseer, L., \nTetzlaff, J. M., Akl, E. A., Brennan, S. E., Chou, R., Glanville, J., Grimshaw, J. M., Hrobjartsson, A., \nLalu, M. M., Li, T., Loder, E. W., Mayo-Wilson, E., McDonald, S., …, & Moher, D. (2021). The PRISMA \n2020 statement: An updated guideline for reporting systematic reviews. The BMJ, 372(1). DOI: \nhttps://doi.org/10.1136/bmj.n71\n270\nBozkurt   \nOpen Praxis   \nDOI: 10.55982/\nopenpraxis.15.4.609\nTO CITE THIS ARTICLE:\nBozkurt, A. (2023). Unleashing \nthe Potential of Generative \nAI, Conversational Agents \nand Chatbots in Educational \nPraxis: A Systematic Review \nand Bibliometric Analysis of \nGenAI in Education. Open \nPraxis, 15(4), pp. 261–270. DOI: \nhttps://doi.org/10.55982/\nopenpraxis.15.4.609\nSubmitted: 03 November 2023 \nAccepted: 03 November 2023 \nPublished: 21 November 2023\nCOPYRIGHT:\n© 2023 The Author(s). This is an \nopen-access article distributed \nunder the terms of the Creative \nCommons Attribution 4.0 \nInternational License (CC-BY \n4.0), which permits unrestricted \nuse, distribution, and \nreproduction in any medium, \nprovided the original author \nand source are credited. See \nhttp://creativecommons.org/\nlicenses/by/4.0/.\nOpen Praxis is a peer-reviewed \nopen access journal published \nby International Council for \nOpen and Distance Education.\nPradana, M., Elisa, H. P., & Syarifuddin, S. (2023). Discussing ChatGPT in education: A literature review \nand bibliometric analysis. Cogent Education, 10(2), 2243134. DOI: https://doi.org/10.1080/233118\n6X.2023.2243134\nRudolph, J., Tan, S., & Tan, S. (2023). War of the chatbots: Bard, Bing Chat, ChatGPT, Ernie and beyond. \nThe new AI gold rush and its impact on higher education. Journal of Applied Learning and Teaching, \n6(1). DOI: https://doi.org/10.37074/jalt.2023.6.1.23\nŞenocak, D., Kocdar, S., & Bozkurt, A. (2023). Historical, philosophical and ethical roots of artificial \nintelligence. Pakistan Journal of Education, 40(1), 67–90. DOI: https://doi.org/10.30971/pje.\nv40i1.1152\nThurmond, V. A. (2001). The point of triangulation. Journal of Nursing Scholarship, 33(3), 253–258. DOI: \nhttps://doi.org/10.1111/j.1547-5069.2001.00253.x\nTlili, A., Shehata, B., Adarkwah, M. A., Bozkurt, A., Hickey, D. T., Huang, R., & Agyemang, B. (2023). What \nif the devil is my guardian angel: ChatGPT as a case study of using chatbots in education. Smart \nLearning Environments, 10(1), 1–24. DOI: https://doi.org/10.1186/s40561-023-00237-x\nvan der Maaten, L., & Hinton, G. (2008). Visualizing data using t-SNE. Journal of Machine Learning \nResearch, 9(2008), 2579–2605. http://www.jmlr.org/papers/volume9/vandermaaten08a/\nvandermaaten08a.pdf\nYan, L., Sha, L., Zhao, L., Li, Y., Martinez-Maldonado, R., Chen, G., Li, X., Jin, Y., & Gašević, D. (2023). \nPractical and ethical challenges of large language models in education: A systematic scoping review. \nBritish Journal of Educational Technology, 1–23. DOI: https://doi.org/10.1111/bjet.13370\nYu, H., & Guo, Y. (2023, June). Generative artificial intelligence empowers educational reform: current \nstatus, issues, and prospects. Frontiers in Education, 8, 1183162. DOI: https://doi.org/10.3389/\nfeduc.2023.1183162",
  "topic": "Praxis",
  "concepts": [
    {
      "name": "Praxis",
      "score": 0.8127076625823975
    },
    {
      "name": "Generative grammar",
      "score": 0.6803026795387268
    },
    {
      "name": "Computer science",
      "score": 0.4235355854034424
    },
    {
      "name": "Sociology",
      "score": 0.4213292896747589
    },
    {
      "name": "Data science",
      "score": 0.33382636308670044
    },
    {
      "name": "Mathematics education",
      "score": 0.3260188698768616
    },
    {
      "name": "Psychology",
      "score": 0.28978586196899414
    },
    {
      "name": "Epistemology",
      "score": 0.2247833013534546
    },
    {
      "name": "Artificial intelligence",
      "score": 0.19017350673675537
    },
    {
      "name": "Philosophy",
      "score": 0.08892467617988586
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I133743585",
      "name": "Anadolu University",
      "country": "TR"
    }
  ]
}