{
  "title": "A New Method to Represent the Harmonic Measurement Accuracy of Current Transformers",
  "url": "https://openalex.org/W4390873668",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A2021306001",
      "name": "Marco Faifer",
      "affiliations": [
        "Politecnico di Milano"
      ]
    },
    {
      "id": "https://openalex.org/A2222827606",
      "name": "Christian Laurano",
      "affiliations": [
        "Politecnico di Milano"
      ]
    },
    {
      "id": "https://openalex.org/A2592071400",
      "name": "Roberto Ottoboni",
      "affiliations": [
        "Politecnico di Milano"
      ]
    },
    {
      "id": "https://openalex.org/A2007455449",
      "name": "Sergio Toscani",
      "affiliations": [
        "Politecnico di Milano"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1987022216",
    "https://openalex.org/W4235812106",
    "https://openalex.org/W4235109919",
    "https://openalex.org/W3181190667",
    "https://openalex.org/W4289941625",
    "https://openalex.org/W3108997813",
    "https://openalex.org/W2019066066",
    "https://openalex.org/W2593838945",
    "https://openalex.org/W2949966765",
    "https://openalex.org/W3019672757",
    "https://openalex.org/W2795298520",
    "https://openalex.org/W2894908605",
    "https://openalex.org/W2098397735",
    "https://openalex.org/W3037280972",
    "https://openalex.org/W4312918801",
    "https://openalex.org/W1584270973",
    "https://openalex.org/W2946251599",
    "https://openalex.org/W3157000777",
    "https://openalex.org/W4362683601",
    "https://openalex.org/W2906651697",
    "https://openalex.org/W2162870748",
    "https://openalex.org/W4252099851",
    "https://openalex.org/W2150648248",
    "https://openalex.org/W1965392255",
    "https://openalex.org/W4229945280"
  ],
  "abstract": "Metrological performance of current transformers (CTs) is typically quantified in terms of ratio and phase errors. While they provide a good picture at the fundamental component, they are not as effective in condensing the accuracy of harmonic measurements in the presence of nonlinearity. This article proposes a new approach derived from the Volterra representation of the CT. The complex error has been adopted as the accuracy metric, split into a deterministic contribution (purely correlated with the measurand) and a circularly symmetric random term, whose spread depends on the fundamental magnitude; moreover, the proposed approach boils down to the usual ratio and phase errors if the CT exhibits negligible nonlinearity. The effectiveness of the developed method has been tested on an inductive CT, as a typical current transducer suffering from nonlinearity; nevertheless, results can be deemed as general since the approach has been derived from a behavioral model of the CT, and thus, independent of its operating principle. The impact of both measurement disturbances and uncertainty introduced by the nonideal calibration of the test setup has been also evaluated.",
  "full_text": " \n \nA New Method to Represent the Harmonic \nMeasurement Accuracy of Current Transformers  \n \nMarco Faifer, Senior Member, IEEE, Christian Laurano, Member, IEEE, Roberto Ottoboni, Fellow, IEEE,  \nand Sergio Toscani, Senior Member, IEEE\n \nAbstract—Metrological performance of current transformers \n(CTs) is typically quantified in terms of ratio and phase errors. \nWhile they provide a good picture at the fundamental, they are not \nas effective in condensing the accuracy of harmonic measurements \nin the presence of nonlinearity. This article proposes a new \napproach, derived from the Volterra representation of the CTs. \nThe complex error has been adopted as accuracy metric, split into \na deterministic contribution (purely correlated with the \nmeasurand) and a circularly symmetric random term, whose \nspread depends on the fundamental magnitude. Moreover, the \nproposed approach boils down to the usual ratio and phase errors \nif the CT exhibits negligible nonlinearity. The effectiveness of the \ndeveloped method has been tested on an inductive CT, as a typical \ncurrent transducer suffering from nonlinearity. Nevertheless, \nresults can be deemed as general, since the approach has been \nderived from a behavioral model of the CT, thus independent from \nits operating principle. The impact of both measurement \ndisturbances and uncertainty introduced by the non-ideal \ncalibration of the test setup has been also evaluated. \n \nIndex Terms— current measurement, current transformers, \ninstrument transformers, measur ement uncertainty, nonlinear \nsystems, power system harmonics. \nI. INTRODUCTION \nURING the last decade, we experienced a massive \ndiffusion of  nonlinear, power electronic-based devices \nin distribution grids. This trend is likely to continue, \nand possibly further grow in the years to come, driven \nby the decarbonization process and the development of electric \nmobility. From a power quality (PQ) point of view [1], the \nharmonic distortion [2] of current and voltage waveforms is \nexpected to further increase [3]. On the one hand, this is the \ndirect consequence of the higher penetration of harmonic-\ngenerating devices. On the other hand, the capacitive filters of \nsuch power electronic-based devices lower the resonant \nfrequencies of the grid, thus resulting in a stronger transfer of \nlow-order harmonics [4]. Moreover, the high-frequency content \nis going to grow, because of the increasing switching \nfrequencies adopted by the manufacturers. This incoming \nscenario boosts the importance of PQ assessment; in this \nrespect, instrument transformers (ITs) play a key role [5], [6]. \nIn this paper, the focus is moved towards harmonic \ndisturbances, representing one of the most severe power quality \nphenomena [2], responsible for lower efficiency, increased \nthermal and dielectric stresses and for the triggering of \n \nThis paper has been supported from Italian Ministerial grant PRIN 2022 \n“Next-generation distributed synchronized measurement systems for smart \ngrids with self-diagnostics capabilities and self-improvement of information \nquality,” n. 2022RYZJT9, CUP D53D23001470006. \nresonances. In this respect, advanced monitoring of harmonics \nallows detecting critical situations and, together with proper \ntechniques, identifying the most polluting users [7]. \nFurthermore, it would permit reconstructing the harmonic state \nof the grid [8], enabling a detailed analysis of the propagation \nof disturbances [9], as well as an effective study of corrective \nactions. Methods have been developed to limit the number of \nthe monitored nodes [10], thus reducing cost and complexity of \nthe infrastructure. \nThe significance of the results strongly depends on the \nquality of the available data: knowing the level of \ntrustworthiness has multifold importance. Firstly, it permits \nestimating the confidence level of the outcome, which is key \nwhen it influences critical decisions. Furthermore, it enables the \nmost effective exploitation of the available information: to be \nmore specific, it would be possible to tune the dependency of \nthe estimate on each incoming measurement so that it reflects \nits uncertainty level, as in the weighted least squares approach. \nFinally, it greatly helps an effective design and development of \nthe monitoring infrastructure.  \nThe accuracy of harmonic measurements depends on the \nadopted technique (e.g., the algorithm allowing to extract the \nharmonic phasors), but, as aforementioned, it is heavily affected \nby the ITs. Their overall performance is summarized by the \naccuracy class [11]. As far as the conventional voltage \ntransformers (VTs) for metering applications, [12] specifies \nmaximum ratio and phase errors at the fundamental, assumed \nto fall within 80 % and 120 % of its rated value. The same \napproach is adopted for low-power voltage transformers \n(LPVTs) [13].  \nAccuracy requirements for VTs devoted to harmonic \nmeasurements consist of ratio and phase errors limits that \nincrease with frequency [11]. However, when considering \ninductive VTs, it has been shown that providing a ratio and \nphase error value for each harmonic does represent an effective \nway to express accuracy [14]. The main reason is the nonlinear \nbehavior due to the iron core [15], making that the superposition \nprinciple no longer holds. The measurement of harmonics, \nwhose frequencies are multiple of the fundamental, suffers from \nharmonic distortion (HD) and intermodulation (IM) effects \nproduced by the (weakly) nonlinear input-output characteristic \n[16]. These considerations apply also to LPVTs, which may be \naffected by nonlinear phenomena. \n M. Faifer, C. Laurano, R. Ottoboni and S. Toscani are with the Dipartimento \ndi Elettronica, Informazione e Bioing egneria, Politecnico di Milano, 20133 \nMilan, Italy (e-mail: sergio.toscani@polimi.it). \n \nD\nThis article has been accepted for publication in IEEE Transactions on Instrumentation and Measurement. This is the author's version which has not been fully edited and \ncontent may change prior to final publication. Citation information: DOI 10.1109/TIM.2024.3353857\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License. For more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/\n \n \nDifferent challenges are faced when measuring currents, \nclaiming for a different way to express the performance \nachieved by current transformers (CTs). Firstly, the harmonic \ncontent of currents could be significantly stronger than that of \nvoltages. Then, under regular operation, their magnitudes may \nvary over a much broader range. Therefore, standards [17], [18] \nconcerning conventional and low-power CTs (LPCTs) set \naccuracy requirements at the fundamental component in a \ndifferent way with respect to VTs and LPVTs. In fact, for a \ngiven accuracy class, they prescribe ratio and phase error limits \ndown to at least 5 % of the rated primary current. These limits \nincrease noticeably at lower currents; implicitly, this takes into \naccount nonlinearity occurring in inductive CTs [19], [20], but \nalso in some LPCTs, depending on the operating principle. \nAs far as harmonic measurements, accuracy requirements for \nCTs are identical as those of VTs [11], thus consisting of phase \nand ratio error limits that increase with the harmonic order, but \nthey do not depend on the level of the measured component. In \nthis respect, [18] somehow admits that the present solution is \nnot fully satisfactory, stating that “…the improvement of the \nrelevant test procedures given there is under consideration by \nIEC TC 38”. \nIn this scenario, [21] investigated through numerical \nsimulations the behavior of ratio and phase errors of an \ninductive CT when it is employed to measure harmonics. \nResults show that their values are scattered over a very wide \nrange, and the spread strongly depends on the relative \nmagnitude of the harmonic to be measured with respect to the \nfundamental. In particular, the smaller the relative harmonic \namplitude is, the broader the scattering is. This is clearly not \nconsistent with how the relevant standards prescribe accuracy \nrequirements at the harmonics. The reason lays, once again, in \nthe nonlinear behavior of the CT, which makes that the mere \nratio and phase error values are not capable of properly \nexpressing accuracy at a given harmonic order, leading to either \na severe underestimation or overestimation. \nThe present article, which is the technical extension of [21], \ninvestigates and proposes an alternative and more effective \nmethod to properly represent the accuracy of harmonic current \nmeasurements through concise indexes, also in the presence of \nnonlinearity. The approach arises from a behavioral modeling \nof the CT based on the Volterra approach. Abstracting from its \noperating principle, the CT is treated as a weakly nonlinear time \ninvariant (NTI) system subject to periodic primary currents \nhaving realistic spectral content. The outcome of the analysis \nsuggests adopting the complex error as accuracy metric, which \nin turn is split into a deterministic and a stochastic contribution. \nThe first one is, by definition, purely related (proportional) to \nthe measurand. The second is produced by the HD and IM \ngenerated by the CT, consisting of a circularly symmetric \nrandom variable whose spread increases with the fundamental \nmagnitude. The parameters describing the behavior of the two \ncontributions can be easily computed from the experimental \ndata using the least-squares (LS) approach. Moreover, the \nproposed method can be considered as the generalization of the \nusual practice of rating the ratio and phase error, so that \nnonlinear effects are properly handled. \nExpressions that enable quantifying the impact of \nmeasurement disturbances and of the uncertain calibration of \nthe adopted setup have been derived. They have vital \nimportance in confirming the significance of the obtained \nresults, but also in designing and improving the experimental \nactivity. The approach has been tested on an inductive CT, as a \ntypical current transducer suffering from coupled dynamic and \nnonlinear effects. \nII. F\nRAMEWORK \nThe goal of this paper is proposing a simple yet effective \nmethod to condense the metrological performance of CTs in \nmeasuring power systems harmonics, also in the presence of \nnonlinearities. In particular, the approach should abstract from \nthe physical operating principle of the CT, so that the result is \nas flexible as possible. This Section presents the tools and the \nframework adopted during the study. It defines the measurand \n(i.e., the harmonic content of primary current waveforms) and \nintroduces a general, behavioral representation of the CT. \nA. Class of Primary Current Waveforms \nBefore carrying out the study, it is necessary to introduce a \nclass  of primary currents that is representative of those \ntypically found in distribution systems operating under steady-\nstate conditions. Each primary current waveform i\n1 is assumed \nto be periodic with fundamental frequency f0 (and angular \nfrequency ω0=2f0) equal to its rated value, thus it can be \nwritten as a Fourier series. Adopting the exponential \nformulation \n   \n00\n11 1\n1\n2\n2\njh t jh t\nh\nit Ih e I h e \n\n\n\n    (1) \nwhere I̅1(h) with h≥1 is the hth order harmonic phasor (its \namplitude corresponds to the rms value) of the primary current, \nnamely the quantity to be measured. Overbar denotes a \ncomplex-valued variable, while underbar indicates its \nconjugate; since i1 is real-valued, (1) implies I̅ 1(h)=I1(h). \nEquation (1) corresponds to a model for i1: each specific \nwaveform is characterized by a peculiar set of harmonic \nphasors, which can be considered as realizations of random \nvariables. In this respect, the class can be defined in terms of \nprobability density functions (PDFs) of the harmonic phasor \namplitudes and phase angles. Fundamental magnitude is \nassumed to be uniformly distributed between 5 % and 120 % of \nthe nominal primary current, namely the range used for rating \nthe accuracy class of measuring CTs [17]. When considering \nharmonic amplitudes, [22] provides the limits for devices \nhaving rated current greater than 16 A not subject to conditional \nconnection. These values (summarized in Table I) determine \nthe dispersions of the relative harmonic amplitudes with respect \nto the fundamental.  \nHowever, no information is given about the shape of their \nPDFs, nor about the phase angles: reasonable assumptions must \nbe introduced. Firstly, relative harmonic amplitudes and phases \nare considered as statistically independent. Supposing \nmaximum entropy, the relative harmonic amplitudes are \nThis article has been accepted for publication in IEEE Transactions on Instrumentation and Measurement. This is the author's version which has not been fully edited and \ncontent may change prior to final publication. Citation information: DOI 10.1109/TIM.2024.3353857\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License. For more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/\n \n \nuniformly distributed up to the corresponding limit, while \nphases follow rectangular distributions in the range [ , ). \nTherefore, all the primary current harmonic phasors are \ncomplex-valued random variables whose PDFs feature circular \nsymmetry [23]. \nTABLE I \nHARMONIC CURRENT AMPLITUDE LIMITS FROM IEC 61000-3-4:1998 \n(PERCENTAGE OF FUNDAMENTAL)  VALUES FOR SIMPLIFIED CONNECTION  \nOdd Order \nHarmonics \nEven Order \nHarmonics \nh Limit h Limit h Limit \n3 21.6 % 19 1.1 %  2 4.0 %  \n5 10.7 % 21 0.6 % 4 2.0 % \n7 7.2 % 23 0.9 % 6 1.3 % \n9 3.8 % 25 0.8 % 8 1.0 % \n11 3.1 % 27 0.6 % 10 0.8 % \n13 2.0 % 29 0.7 % ≥12 0.6 % \n15 0.7 % 31 0.7 %   \n17 1.2 % 33 0.6 %   \n  \nB. Behavioral Model of CTs \nFrom a behavioral point of view, a CT can be considered as \na (weakly) NTI system whose input is i1. Its output y2 is the \nquantity that is processed to extract the primary current \nharmonic phasors. In a conventional inductive CT, y2 \ncorresponds to the secondary current, but in general it could be \na voltage or even a discrete-time signal [24]. Under weak \nassumptions, the input-output behavior of an NTI system can \nbe represented through the Volterra approach [25]. In this case, \nit can be easily shown that the steady-state response to a \nperiodic input is periodic with the same period. Therefore, y\n2 \ncan be expressed as a Fourier series, written in the form (1). The \nexpression of the generic hth order harmonic phasor in the \noutput Y2(h) can be derived by applying the multivariable \nFourier transform to the Volterra representation. The result is \n \n  \n  \n1\n1\n22\n1\n11\n1 1\n,,\n,, .\nd\nn\nn\nd\nd\nd\nd\nd\ndn\nd n\nkh\nkk\nYh Y h\nHk k I k\n\n\n\n\n \n\n\n\n\n\n\n \n\n  (2) \nAccording to (2), the hth order harmonic phasor is the sum of \ninfinite contributions Y̅2(d)(h), each coming from a \nhomogeneous nonlinear subsystem characterized by its degree \nd. In turn, the dth degree contribution is the weighted sum of \nthe products between all the possible sets of d primary current \nphasors (with repetition) whose sum of their orders k1,…, kd \nequals h. The weight coefficient H̅ (d)(k1,…, kd) is the generalized \nfrequency response function of the dth degree subsystem \nevaluated in the set of angular frequencies  k1ω0,…, kdω0. It is \nworth noting that the subsystem having degree d=1 corresponds \nto the underlying linear system, while H̅ (1)(k1) is its frequency \nresponse function evaluated at the angular frequency k1ω0. \nIII. MODELING CT ERRORS \nThe previous Section introduced a behavioral relationship \nbetween primary and secondary harmonic phasors in a CT. If \nthe target is measuring the hth order harmonic I̅1(h), its estimate \nI̅1,e(h) has to be obtained from the secondary side. Typically, the \nCT behavior is assumed as linear, thus I̅1,e(h) is computed using \na complex-valued ratio K̅(h) that may vary according to h; in \nterms of formulas  \n   1, 2 .eI hK h Y h  (3) \nAdvanced reconstruction techniques have been proposed in \nthe literature with the purpose of mitigating the nonlinear \nbehavior of the CT [26]-[28]. However, for the sake of \nsimplicity, they will not be considered in the following. Overall \naccuracy in reconstructing a harmonic phasor can be quantified \nadopting the complex error, defined as \n        1\n1, 1 .\njIh\nehI h I h e\n\n  (4) \nAccording to (4), ξ̅(h) corresponds to the phasor I̅1,e(h) when it \nis represented in a reference frame whose origin is moved to the \nposition I̅1(h) and whose real axis has the same direction as that \nof I̅1(h). Metrological performance of instrument transformers \nis typically expressed in terms of (harmonic) ratio error ε(h) and \nphase error φ(h), defined as \n     \n\n  \n1, 1\n1\n1, 1 .\ne\ne\nI hI h\nh\nIh\nhI h I h\n\n\n\n\n \n (5) \nIt turns out that they are strongly related to ξ̅(h). In fact, \nintroducing the relative complex error ξ̅r(h)=ξ̅(h)/|I̅1(h)| while \nassuming |ξ̅r(h)|<<1, we have \n     \n  \n1\nr\nhhh j h\nIh\n     (6) \nwith φ(h) expressed in radians. Considering the reconstruction \nformula (3) and the CT model (2) subject to primary currents \nbelonging to the class  introduced in Section II. A, the \npreviously defined error metrics become random variables. \nThis is related to the definitional uncertainty of the \nreconstruction formula (3), namely to the mismatch between the \nactual and the assumed CT behavior. \nFor selecting the most appropriate method to condense the \naccuracy of CTs, a key step is analyzing the main statistical \nproperties of the complex error (4), so that its behavior can be \ncaptured by few parameters. Using (2) and separating the \ncontribution from the underlying linear system \n \n    \n    \n1\n1\n1\n1\n11\n2\n,,\n1\n,, , ,,\nd\nn\nn\nd\ndd\ndd\nd\nkh\nkk\nhK h H h I h\nKh H k k S h k k\n\n\n\n\n\n\n \n\n\n\n\n  \n  (7) \nwhere \n    \n1\n11\n1\n,, , .\nd\ndj I h\ndn\nn\nSh k k e I k\n\n\n   (8) \nThe right member of (7) is made of two terms. The first one \nis due to the mismatch between the adopted ratio K̅(h) and the \nfrequency response of the underlying linear system, multiplied \nby the magnitude of the measured harmonic phasor. The second \nterm depends on CT nonlinearity, and it is worth to be analyzed \nThis article has been accepted for publication in IEEE Transactions on Instrumentation and Measurement. This is the author's version which has not been fully edited and \ncontent may change prior to final publication. Citation information: DOI 10.1109/TIM.2024.3353857\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License. For more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/\n \n \nin more detail. It is the sum of contributions that, from a \nstatistical point of view, can be classified into two subsets. \n Let us consider the contributions coming from odd-degree \nsubsystems, so that d=2l+1, l positive integer. Moreover, let us \nfocus on a very specific subset b(h) of them, made of those \nproduced by the interaction between the primary-side hth order \nharmonic (therefore k1=h) and 2 l components so that their \nharmonic indexes k2,…, kd correspond to l couples of opposite \nintegers (e.g., m1,m1, m 2,m2,…, ml,ml). In this case, (8) is \nreal-valued, since it is the product between l+1 pairs of complex \nconjugate numbers. The corresponding contribution appearing \nin (7) results as \n     \n2\n11 1\n1\n,,\nl\nd\ndn\nn\nKhH k k I h I m\n\n  (9) \nthus it has constant, deterministic phase angle, while its \nmagnitude is proportional to the product between the \namplitudes of all the interacting primary harmonics. \nNow, let us study the subset \nc(h), including the rest of the \nnonlinear contributions appearing in (7). It comprises all of \nthose produced by even-degree subsystems and those coming \nfrom odd-degree subsystems, but not belonging to b(h). \nReminding that all the primary current harmonic phasors have \nindependent phases, uniformly distributed in [ , ) and \nindependent from the magnitudes, using (8) it can be easily \nproven that those contributions feature circularly symmetric \nPDFs [29]. Moreover, according to the features of class , the \nspread of their magnitudes depends on |I̅1(1)|d. \nA. Modeling Errors at Fundamental \nLet us investigate the behavior of the complex error (7) at the \nfundamental. Reminding that primary current harmonics are \nconsiderably smaller than the fundamental, (8) suggests that the \nmost significant error contributions due to CT nonlinearity are \nthose involving exclusively the fundamental primary current \nI̅\n1(1) or its conjugate. According to the considerations of the \nprevious paragraph, all of them belong to b(1). Moreover, from \n(9) and (7) it can be shown that they produce an overall error \nterm that is an odd-degree polynomial function in the \nfundamental magnitude. \nThe second largest nonlinear contributions are expected to be \nthose involving d1 times I̅1(1) (or its conjugate) and a different \nprimary current component, thus due to IM. Because of the \ninvolved components, they belong to c(1), thus having \ncircularly symmetric PDFs that produce scattering around the \naforementioned polynomial function. The amplitude of such \nscattering is strongly connected with the fundamental primary \ncurrent magnitude. \nIt is worth noting that the magnitudes of all these prevailing \nerror terms fade to zero as |I̅1(1)| approaches zero. This suggests \nadopting the relative complex error (6). Reminding (7) and the \nprevious considerations, we can write \n   \n     \n    \n,,\n1\n,1 1\n11 1\n111 1 1 .\nrr D r S\nrD Hg I K\n \n\n\n \n (10) \nξ̅r,D(1) represents the deterministic contribution to the relative \ncomplex error, embedding all the terms depending exclusively \non | I̅1(1)|, which is the magnitude of the measurand. In this \nrespect, g̅ 1(|I̅1(1)|) includes all the most significant nonlinear \nterms, those belonging to b(1). Using (6)-(9), g̅ 1(|I̅1(1)|) is a \nlinear combination of even and positive powers of the \nfundamental primary current magnitude. \nThe stochastic contribution ξ̅r,S(1) is due to all the terms \nbelonging to c(1). Therefore, it is a circularly symmetric \nrandom variable produced by IM, in particular the interaction \nbetween the fundamental primary current and other harmonics.  \nReminding (6), taking the real and imaginary parts of (10) \nleads to the usual ratio and phase errors. This is the theoretical \nexplanation why, as well-known for many years, amplitude-\ndependent ratio and phase errors provide a good representation \nof the metrological performance of the CT at the fundamental. \nB. Modeling Errors at Harmonics \nLet us analyze the most relevant complex error contributions \ndue to nonlinearity that affect the measurement of I̅1(h), h2. \nAs highlighted in Section III-A, the largest ones are expected to \nbe those containing only the fundamental component of the \nprimary current or its conjugate. However, since they do not \ninvolve I̅1(h), they necessarily belong to c(h), thus producing \na circularly symmetric error term whose spread depends on  \n|I̅1(1)|. They represent the direct impact of the fundamental on \nthe hth order harmonic, namely the HD. \nThe second largest kind of contribution are those due to IM, \ninvolving d1 times I̅1(1) (or its conjugate) and a different \nprimary current harmonic; most of them also belong to c(h). \nHowever, the rest belong to b(h): to be more specific those \ncoming from odd-degree subsystems with d=2l+1, involving l \ntimes the fundamental primary current, always paired with its \nconjugate, and I̅1(h). Their expressions can be written in the \nform (9) and, with some computations, it can be shown that \ntheir overall error contribution is a linear combination of even \npositive powers of |I̅1(1)| (let us call it g̅ h(|I̅1(1)|)) multiplied by \nK̅(h)|I̅1(h)|. Therefore  \n   \n     \n     \n1\n11 11 .\nDS\nDh\nhh h\nhH h g I K hI h\n\n\n\n \n (11) \nThe deterministic error contribution ξ̅D(h) is, by definition, \nthat purely related to |I̅1(h)|. It is clearly affected by the adopted \nratio K̅(h) and it includes the weak nonlinear contributions \nhaving deterministic phase angles, namely those in b(h). \nThe stochastic contribution ξ̅S(h) is due to the error terms \nbelonging to c(h) that, as far as harmonic measurements, are \nthose produced by the strongest nonlinearities. They result in a \ncircularly symmetric random variable, whose spread depends \non |I̅1(1)|. Reminding (8), it is worth noting that most of the error \nterms belonging to c(h) do not directly involve | I̅1(h)|, hence \nthey do not fade to zero as the measured harmonic approaches \nzero. Therefore, the relative complex error defined in (6) (and \nThis article has been accepted for publication in IEEE Transactions on Instrumentation and Measurement. This is the author's version which has not been fully edited and \ncontent may change prior to final publication. Citation information: DOI 10.1109/TIM.2024.3353857\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License. For more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/\n \n \nthus also the corresponding ratio and phase errors) exhibits very \nlarge values as long as a weak harmonic is measured: for this \nreason, it does not appear as a good candidate for expressing \naccuracy at harmonics. \nIV. EXPERIMENTAL SETUP \n The error models introduced in Section III have been derived \nfrom a behavioral representation of the CT. Therefore, they are \ngeneral with respect to the physical operating principle and \ncapable of considering coupled filtering and nonlinear effects. \nThe inductive CT is a typical current transducer that suffers \nfrom the aforementioned phenomena; thus, it represents a \nsuitable candidate for studying approaches aimed at condensing \nits metrological performance in the most effective way. For this \nreason, tests have been carried out on a class 0.5 inductive CT \nwith 10 VA rated burden, nominal ratio K\nn=50 A/5 A and f0=50 \nHz nominal frequency.  \nThe experimental activity requires injecting periodic primary \ncurrent waveforms belonging to class , sampling the primary \nand secondary waveforms under steady state conditions, \nextracting the harmonic phasors and processing the data. The \nschematic diagram of the adopted experimental setup is \nreported in Fig. 1. It resembles the architecture of the current \ngenerator presented in [30].  \n \nFig. 1.  Schematic diagram of the experimental setup. \nThe CT under test, feeding the rated burden, is supplied by an \nAETechron 7548 power amplifier connected to a transformer to \nincrease its maximum output current. Primary and secondary \ncurrents are measured by means of calibrated coaxial shunts \nhaving 20 kHz bandwidth and rated currents of 100 A and 10 A, \nrespectively. The power amplifier input voltage is provided by \na National Instruments USB-6356 multifunction I/O device, \nalso used to acquire the primary and secondary current \nwaveforms. It features 16-bit resolution, 1.25 MSample/s \nmaximum rate per channel (simultaneous sampling), \nsynchronized generation and sampling capability. Analog \nDevices AD215BY isolation amplifiers in noninverting \nconfiguration (100 nominal gain) have been adopted to magnify \nthe output voltages of the coaxial shunts, thus enabling a better \nexploitation of the range of the analog input channels. Their \nfrequency responses have been measured and compensated in \nthe frequency domain. After calibration, considering \nfrequencies up to 1.5 kHz, the residual mismatches between \nmagnitude and phase errors of the two current measurement \nchannels are below 200 ppm and 0.2 mrad, respectively. \nFinally, the accuracy of current generation has been \nimproved by measuring the frequency response function \nbetween the power amplifier input and the injected primary \ncurrent, while pre-compensating the waveforms to be \ngenerated. \nV. \n EXPERIMENTAL RESULTS \nA. Test Procedure \nThe experimental setup described in Section IV has been used \nto feed the CT under test with a set of R=2000 primary current \nwaveforms belonging to class , thus obtained by sampling the \nPDFs defined in Section II-A, considering harmonic orders up \nto 32. For each reference signal, once steady-state has been \nreached, the corresponding primary and secondary current \nwaveforms have been measured with rate fs=200 kHz. Since \nfs/f0 is integer, thanks to the synchronous generation and \nsampling capability of the adopted setup, exactly P=100 periods \nhave been acquired. Considering each rth waveform and pth \nperiod, primary and secondary current harmonic phasors \nI̅1,[r,p](h) and I̅2,[r,p](h) (up to the 30th order) have been extracted \nthrough DFT without leakage phenomena. For the sake of \nconvenience, their magnitudes will be expressed in per units \nwith respect to the rated primary and secondary currents of the \nCT under test. \nThese phasor measurements are clearly subject to the \nuncertainties introduced by the nonideal calibration of the \nprimary and secondary current measurement chains that, in this \ncase, comprise a shunt, an isolation amplifier, a data acquisition \nchannel. These uncertainties can be modeled with unknown \nmagnitude and phase errors that, for each harmonic order, \ndepend on neither r, nor p. \nEvaluated primary and secondary side phasors are also \nsubject to measurement disturbances, which have been \nconsidered as additive complex-valued random contributions \nhaving circularly symmetric PDFs. In this case, their second-\norder statistics is fully expressed by their (real-valued) \nvariances and a (complex-valued) covariance [29]. The \npresence of such disturbances makes that, for a given hth \nharmonic order, the P phasors measured in each acquired period \nof the same current waveform are different. Their impact can be \nmitigated by estimating the primary and secondary hth order \nharmonic phasors I̅\n1,[r](h) and I̅2,[r](h) by averaging over the P \nacquired periods of the rth excitation signal. Under the \naforementioned assumptions, the variances and covariance of \nof I̅1,[r](h) and I̅2,[r](h) due to measurement disturbances can be \nestimated as \n \n    \n    \n      \n22\n1, 1, ,\n1\n22\n2, 2, ,\n1\n2\n12, 1, , 2, ,\n1\n1\n1\n1\n1\n1\n1\nP\nrr p\np\nP\nrr p\np\nP\nrr p r p\np\nsh I h PP\nsh I h PP\nsh I h I h PP\n\n\n\n \n \n  \n\n\n\n (12) \nwith ΔI̅q,[r,p](h)=I̅q,[r,p](h)I̅q,[r](h), q{1,2}. The sample standard \ndeviations of the measured phasors are below 5ꞏ106 p.u. at the \nfundamental and about 2ꞏ106 p.u. at the harmonics. Correlation \nis significant only as far as the fundamental; in this case, the \nThis article has been accepted for publication in IEEE Transactions on Instrumentation and Measurement. This is the author's version which has not been fully edited and \ncontent may change prior to final publication. Citation information: DOI 10.1109/TIM.2024.3353857\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License. For more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/\n \n \nPearson correlation coefficient is about 0.5. \nB. Analyzing Errors at Fundamental \nFirstly, for each rth test waveform, the fundamental primary \ncurrent phasor has been reconstructed from the secondary side \nusing K̅ (1) corresponding to the nominal transformer ratio Kn; \nthe relative complex error ξ̅r,[r](1) has been evaluated. Starting \nfrom the hypothesis of the previous subsection, the calibration \nerror of the two reference current measurement channels \nintroduce a deterministic term  in ξ̅r(h), which is thus embedded \ninto ξ̅r,D(h) (see (10)). Its real and imaginary parts correspond to \nthe mismatch between their magnitude and phase errors, \nrespectively. Therefore, ξ̅r,D(h) is deemed as meaningful only as \nlong as it is significantly larger than the deterministic \ncontributions due the current measurement chain.  \n  Moreover, additive disturbances affecting I̅\n1,[r](h) and I̅2,[r](h) \nresult in a superimposed circularly symmetric random \ncontribution to ξ̅r(h), captured by ξ̅r,S(h). The corresponding \nstandard deviation can be estimated by propagating the sample \nvariances and covariance (12) through (6), thus obtaining \n  \n       \n \n222 2\n1, 2, 12,\n,\n1,\n2\n.\nr\nrr r\ner\nr\ns h Kh s h Khs h\nsh\nIh\n     \n(13) \nConsidering the fundamental component, its 95 th percentile \nvalue over the R tests is below 3 ꞏ105. This represents a lower \nbound for the detection of stochastic effects introduced by the \nCT under test. \nAccording to the considerations carried out in Section III-A, \nξ̅r,D(1) depends on the adopted ratio and it includes all the \nstrongest nonlinear terms (namely the elements of b(1)), \npurely related to the fundamental. ξ̅r,S(1) is due to the weaker \nnonlinear terms that belongs to c(1), hence it is expected to be \nmuch smaller.   \nIn order to carry out the study, it is important to identify a \nstrategy to separate ξ̅r,D(1) from ξ̅r,S(1). An attractive possibility \nis performing a LS fitting of the relative complex error data \nξ̅r,[r](1) with a proper parametric model for ξ̅r,D(1). In general, \nthe effectiveness of the procedure depends on the amount of \navailable data and on the capability of the selected model to \nfully capture the behavior of ξ̅r,D(1) through a concise set of \nparameters. ξ̅r,S(1) acts as a superimposed zero-mean noise with \ncircularly symmetric PDF [29]. Moreover, the LS solution has \na strong metrological meaning, since it corresponds to minimize \nthe sample variance of the stochastic error ξ̅r,S(1).  \n Reminding Section III-A and the structure of g̅ 1(|I̅1(1)|), one \nmay be tempted to represent ξ̅r,D(1) as a linear combination of \neven-degree powers of the fundamental magnitude. However, a \ngood fitting mandates for a large number of terms; on the other \nhand, the result may be plagued by significant oscillations, as it \noften happens when adopting a high-degree polynomial model. \nMuch better results are achieved if ξ̅\nr,D(1) is represented with \na complex-valued B-spline [31]. With this choice, the \ncoefficients can be easily computed through an ordinary LS \noptimization [31] and many tools are available for the purpose. \nThe obtained results are shown in Fig. 2. Spline knots have been \nobtained from 6 logarithmically spaced points, fully covering \nthe range of the fundamental magnitude. Blue crosses represent \nthe values of the relative complex error at the fundamental for \nthe R waveforms, plotted as function of the primary current \nfundamental magnitude. \nAccording to (6), the real and imaginary parts of ξ̅\nr(1) \nvirtually correspond to ratio and phase errors. Their magnitudes \nincrease as |I̅\n1(1)| reduces from 1.2 p.u. to 0.05 p.u.: they pass \nfrom 0.38 %, 0.20 crad, to 0.67 %, 1.1 crad, fully complying \nwith class 0.5 limits prescribed by [17]. In particular, [17] \nallows for broader ratio and phase errors at low fundamental \nmagnitudes, thus matching the observed behavior. \n \nFig. 2.  Relative complex error at the fundamental split into deterministic and \nstochastic contributions. Measurements obtained with Kn. \nThe red line in Fig. 2 corresponds to the B-spline model for \nξ̅r,D(1), obtained through LS fitting of ξ̅r,[r](1). Purple crosses \nrepresents the residuals, namely the estimated random \nrealizations of ξ̅\nr,S(1), which contain the effect of the other \nprimary harmonics on ξ̅r(1) as well as that of disturbances. As \nexpected, its distribution is zero-mean, but not exactly \ncircularly symmetric. The reason lies in the approximated \nmethod to separate between deterministic and stochastic \ncontributions to the complex error. On the other hand, this task \nis rather challenging, since the magnitude of ξ̅r,D(1) is much \nhigher than that of ξ̅r,S(1). Therefore, the estimates of ξ̅r,S(1) are \nprone to suffer interference from ξ̅r,D(1). Anyway, the impact of \nthe stochastic contribution can be quantified by the 95 th \npercentile value of its magnitude, which is about 0.03 %. This \nvalue is substantially larger than the standard deviation se̅r,[r](1), \nobtained using (13). Hence, the additive disturbances \nintroduced by the measurement process affecting ξ̅r,S(1) have \nnegligible impact.   \nAccuracy can be enhanced through a proper tuning of the ratio \nused to retrieve the primary current phasors from the secondary \nside. A possibility is choosing K̅ (h) so that the resulting \nvariance of the complex error is minimized, which corresponds \nto the Best Linear Approximation (BLA) [32] of the \nrelationship between primary and secondary side phasors. From \na mathematical point of view, it is the solution of a LS problem, \nwhose expression is \nThis article has been accepted for publication in IEEE Transactions on Instrumentation and Measurement. This is the author's version which has not been fully edited and \ncontent may change prior to final publication. Citation information: DOI 10.1109/TIM.2024.3353857\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License. For more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/\n \n \n    \n   \n \n1, 2,\n1\nBLA 2\n2,\n1\n \n.\nR\nrr\nr\nR\nr\nr\nIh Ih\nKh\nIh\n\n\n\n\n\n (14) \nIf a real-valued ratio is required, one may add such constraint \nto the optimization problem. In this case, the solution \ncorresponds to the real part of (14).  \nThe relative complex error at the fundamental has been \ncomputed adopting K̅ (1) = K̅ BLA(1) = 1.0040 ej0.002476 p.u., \nthen it has been decomposed into deterministic and stochastic \ncontributions through the previously described procedure. \nResults are reported in Fig. 3 and Fig. 4, showing the real and \nimaginary parts of the complex error, respectively. \n \nFig. 3.  Real part of the relative complex error at the fundamental split into \ndeterministic and stochastic contributions. Measurements obtained with K̅ BLA. \n \nFig. 4.  Imaginary part of the relative complex error at the fundamental split \ninto deterministic and st ochastic contributions. Measurements obtained with \nK̅ BLA. \nUsing K̅ BLA(1) instead of the nominal ratio produces a shift of \nξ̅r(1) in the complex plane, which is embedded into ξ̅r,D(1). \nRatio and phase errors become significantly smaller, now \nranging from 0.22 % to 0.04 % and from 0.83 crad to 0.08 \ncrad, respectively. Anyway, values remain significantly larger \nwith respect to the uncertainty due to the nonideal calibration \nof the current measurement channels. As expected, ξ̅r,S(1), \nrelated to scattering, is almost untouched by the choice of K̅ (1). \nFrom Fig. 3 and Fig. 4 it can be noticed that its contribution to \nthe spread of both ratio and phase errors is virtually identical. \nMoreover, it depends on the fundamental magnitude: a broader \ndistribution is observed at smaller magnitudes. It is worth \nhighlighting that the magnitude of ξ̅r,S(1) is significantly \nsmaller, albeit not negligible, when compared to that of ξ̅r,D(1).   \nAccording to the previous considerations, the metrological \nperformance of CTs in measuring the fundamental phasor can \nbe summarized through the deterministic contribution ξ̅r,D(1) of \nthe relative complex error, which is a function of the \nfundamental magnitude. It can be effectively modeled as a \ncomplex-valued B-spline, whose coefficients can be estimated \nwith the LS method. Overall accuracy degradation produced by \nthe presence of the other spectral components in the primary \nwaveforms is rather weak, because of the peculiar spectral \ncontent of current waveforms. For this reason, it can be \nquantified by a single parameter | ξ̅\nr,S(1)|95, which is the 95 th \npercentile value of the magnitude of ξ̅r,S(1) (obtained from the \nresidual of the LS problem) thus neglecting the dependence on \nthe fundamental magnitude. Finally, ξ̅r(1) can be easily \nconverted into magnitude and phase errors, more commonly \nused in practical applications. Thanks to the linearized \nrelationship (6), their deterministic contributions are the real \nand imaginary part of ξ̅r,D(1), respectively. Moreover, since \nξ̅r,S(1) follows a circularly-symmetric PDF, their stochastic \ncontributions are uncorrelated and share the same even-\nsymmetric PDF [29]. \nC. Analyzing Errors at Harmonics \nAfter having tackled the fundamental component, the \nmetrological behavior of the CT in measuring harmonics up to \nthe 30\nth order has been studied. For each rth excitation signal \nand hth order harmonic, the primary phasor is reconstructed \nwith a predetermined value of  K ̅(h). The resulting complex \nerror ξ̅[r](h) defined as in (11) has been computed. The non-ideal \ncalibration of the current measurement chains produces a \ncontribution to ξ̅D(h), whose real and imaginary parts \nrespectively correspond to their mismatches between \nmagnitude and phase errors at the hth order current harmonic, \nmultiplied by the magnitude of the measurand.   \nDisturbances affecting I̅\n1,[r](h) and I̅2,[r](h) translate into an \nadditive term included into  ξ̅S(h). This disturbance term is \ncircularly symmetric distributed; an estimate se̅,[r](h) of its \nstandard deviation is obtained by propagating the sample \nvariances and covariance (12) through the definition of the \ncomplex error (4). The resulting expression corresponds to (13) \nmultiplied by | I̅\n1,[r](h)|. The 95 th percentile value over the R \nexcitation signals has been computed, and it is below 3ꞏ106 p.u. \nfor all the considered harmonic orders. \nA detailed analysis requires separating ξ̅(h) into its \ndeterministic and stochastic contributions ξ̅D(h) and ξ̅S(h), as \ndefined in (11). Exploiting the same idea already adopted for \nthe fundamental, one should select and identify a model for \nξ̅D(h). However, the scenario is very different in this case. ξ̅S(h) \nis due to the nonlinear terms in c(h) that, according to Section \nIII-B, includes all the strongest error contributions. Conversely, \nξ̅D(h) embeds only very weak nonlinearities: this suggests \nrepresenting it with a very simple model. The most \nstraightforward solution is performing a zeroth order expansion \nThis article has been accepted for publication in IEEE Transactions on Instrumentation and Measurement. This is the author's version which has not been fully edited and \ncontent may change prior to final publication. Citation information: DOI 10.1109/TIM.2024.3353857\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License. For more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/\n \n \nof g̅ h in (11), so that ξ̅D(h) is defined by just one unknown \nparameter ͞η(h); if it is estimated through the LS method, it \nresults \n   \n  \n \n\n1\nBLA\n1.\nD hh I h\nKhh Kh\n\n\n\n\n (15) \nTherefore, the deterministic contribution to the absolute \ncomplex error has been assumed as proportional to the \namplitude of the measured harmonic. As from (15), the \ncoefficient ͞η(h) purely depends on the deviation between the \nselected value for K̅ (h) and the BLA, the latter including the \nimpact of the terms in b(h). Reminding (6), the real and \nimaginary part of ͞η(h) virtually correspond to a deterministic \nmagnitude and phase error, respectively. Hence, they also \nembed the mismatches between magnitude and phase errors of \nthe current measurement channels, acting as additive (yet \nunknown) real and imaginary contributions, respectively. \nξ̅S,[r](h), namely the realizations of the stochastic complex error, \nare then obtained as the residuals of the LS solution. \nLet us start investigating the measurement of the 3 rd order \nharmonic, notably the most affected by nonlinearity, in \nparticular the HD produced by the prevailing fundamental \ncomponent. Considering all the applied current waveforms, the \ncomplex error ξ̅(3) has been computed assuming K̅ (3)=Kn, then \nsplit into deterministic and stochastic contributions through \n(14) and (15); results are summarized in Fig. 5.  \n \nFig. 5.  Complex error at the 3 rd order harmonic split into deterministic and \nstochastic contributions. Measurements obtained with Kn. \nIt is evident how the stochastic contribution to the complex \nerror is extremely strong. If one adopts \nK̅ (3) = K̅ BLA(3) = 1.0030 ej0.001239 p.u., the deterministic \ncontribution approaches zero, thus it boils down to a vertical \nline passing from the origin of the complex plane. This choice \ndoes not affect ξ̅\nS(3), which can be considered as circularly \nsymmetric distributed with excellent approximation, as \nexpected from the considerations carried out in Section III-B. \nThanks to this feature, its behavior is fully captured by the \ndistribution of its magnitude, which worths to be studied.  \nFirstly, its spread is much larger with respect to the \ncontribution due to measurement disturbances (quantified by \nse̅,[r](3)) thus having negligible impact. Moreover, the \nscatterplot reported in Fig. 6 highlights that | ξ̅S(3)| is virtually \nuncorrelated with the relative amplitude of the measured \nharmonic with respect to the fundamental. From a quantitative \npoint of view, the Pearson correlation coefficient is below 2 %. \nOn the contrary, | ξ̅S(3)| shows a very noticeable increasing \ntrend with the fundamental magnitude. According to Section \nIII-B, the most significant terms embedded into ξ̅S are those \nrelated to the HD produced by the fundamental, but also those \ndue to the interaction (IM) between different components, in \nparticular the fundamental and another harmonic. Both these \ncontributions clearly depend on |I̅\n1(1)|, but they are responsible \nfor different features characterizing the behavior of | ξ̅S(3)|. As \nshown in Section III-B, the contribution due to HD is a \nunivariate polynomial in I̅1(1), responsible for the rising trend \nobserved in Fig. 6. On the other hand, the term produced by IM \nis a function of I̅1(1), but also of other harmonics. Hence, when \nplot as a function of |I̅1(1)|, it produces an increasing scattering \nthat is noticeable from a careful look at Fig. 6. \n \nFig. 6.  Scatterplot of th e magnitude of the stochastic complex error at the 3 rd \norder harmonic versus fundamental magnitude and relative amplitude of the 3rd \norder harmonic. \nA proper description of harmonic measurement accuracy \nrequires taking into account ξ̅S(h), in particular quantifying its \nspread as a function of the fundamental magnitude. \nUnfortunately, a simple yet general parametric model cannot be \nformulated; therefore, descriptive statistics must be employed. \nA possible solution is classifying the experimental values \nξ̅\nS,[r](h) according to the corresponding fundamental magnitude. \nIn this respect, the variational range of |I̅1(1)| has been split into \nthree uniform intervals. Since | I̅1(1)| has rectangular PDF over \nthe considered range, the obtained classes should have similar \ncardinalities. For each class, | ξ̅S(h)| can be characterized by its \n95th percentile value | ξ̅S(h)|95, as shown in Fig. 7. Both the \nincreasing trend due to HD and the scattering produced by IM \nare evident, with the first effect being stronger than the other. \nStarting from the previous considerations, accuracy in \nmeasuring harmonics can be expressed through a simple \nparametric model of the complex error. Reminding (15), the \ndeterministic contribution can be considered as proportional to \nthe fundamental magnitude, so its behavior is expressed by a \nunique complex number ͞η(h); its real and imaginary parts are \nalmost identical to the deterministic ratio and phase errors. The \nstochastic contribution has circularly symmetric distribution, \nThis article has been accepted for publication in IEEE Transactions on Instrumentation and Measurement. This is the author's version which has not been fully edited and \ncontent may change prior to final publication. Citation information: DOI 10.1109/TIM.2024.3353857\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License. For more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/\n \n \nand the spread of its magnitude can be quantified in terms of \n95th percentile values for different classes of fundamental \nmagnitude. The approach is somewhat similar to that adopted \nfor prescribing accuracy class limits for CTs, which change \naccording to the fundamental magnitude. \n \nFig. 7.  Scatterplot of the magnitude of  the stochastic complex error at the 3 rd \norder harmonic versus fundamental magnitude. Dashed line reports its 95 th \npercentile bounds for the different classes of fundamental amplitude. \nThe same analysis is carried out for the measurement of a \nhigher-order, even harmonic, thus affected by significantly \nweaker nonlinearity; in particular, the 8 th order current \nharmonic has been considered. The complex error ξ̅(8) has been \nobtained using the nominal ratio, then split into the \ndeterministic and stochastic contributions as usual; results are \nshown in Fig. 8. \n \nFig. 8.  Complex error at the 8 th order harmonic split in to deterministic and \nstochastic contributions. Measurements obtained with Kn. \nAccording to (15), ξ̅D(8) would be negligible having selected \nK̅ (8) = K̅ BLA(8) = 1.0025 ej0.000908 p.u. Also in this case, the \nspread of ξ̅S(8) is large with respect to se̅,[r](h), thus confirming \nthat the observed behavior is not the result of measurement \nartifacts. Moreover, its magnitude is virtually uncorrelated with \nthe relative amplitude of the considered harmonic (the Pearson \ncorrelation coefficient is below 5 ꞏ103), while it strongly \ndepends on |I̅1(1)|. However, as expected, the behavior of ξ̅S(8) \nis significantly different when compared to that observed at the \n3rd order harmonic. \nNonlinearity in CTs is essentially odd-degree, thus higher-\norder, even harmonics are not significantly affected by HD. \nThis is the reason why it is not possible to distinguish a clear \ntrend of |ξ̅S(8)| with respect to the fundamental magnitude. On \nthe other hand, IM is present, in particular that due to the \ninteraction between the fundamental and other primary current \ncomponents; this creates scattering in |ξ̅S(8)| that increases with \n|I̅1(1)|. Such features are evident when looking at Fig. 9 \n(showing |ξ̅S(8)| and its 95th percentile values in the three classes \nof fundamental magnitude), while comparing it with Fig. 6. \nIt is important to highlight that the 95th percentile value of the \nstochastic error contribution at the smallest class of \nfundamental magnitudes is 8.2ꞏ106 p.u., namely it has the same \norder of magnitude as the standard deviation se̅,[r](8) that \nquantifies the impact of measurement disturbances. Therefore, \n|ξ̅S(8)| could have been slightly overestimated at low \nfundamental amplitudes. This can be recognized from Fig. 9, \nsince |ξ̅S(8)| no longer decreases as |I̅1(1)| becomes smaller than \n0.2 p.u. Nevertheless, this does not undermine the relevance of \nthe obtained results. \n \nFig. 9.  Scatterplot of the magnitude of  the stochastic complex error at the 8 th \norder harmonic versus fundamental magnitude. Dashed line reports its 95 th \npercentile bounds for the different classes of fundamental amplitude. \nFor the sake of completeness, Fig. 10 summarizes the \nperformance achieved by the CT under test in measuring \nharmonics up to the 10th order. \n \nFig. 10.  Parameters quantifying deterministic and stochastic contributions to \nthe complex error for harmonics up to the 10 th order. Measurements obtained \nwith Kn. \nThis article has been accepted for publication in IEEE Transactions on Instrumentation and Measurement. This is the author's version which has not been fully edited and \ncontent may change prior to final publication. Citation information: DOI 10.1109/TIM.2024.3353857\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License. For more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/\n \n \nThe magnitude of ͞η(h) is always much higher than its \nuncertainty due to the mismatches between the ratio and the \nphase errors of the two current measurement channels, thus \nconfirming the significance of the values. When extending the \nanalysis above the 10\nth harmonic order, a slightly decreasing \ntrend with frequency is observed. \nAs far as stochastic errors, it is interesting to notice that, as \nexpected, the largest occurs at the 3 rd order harmonic. When \nlooking at higher-order harmonics while considering the \nsmallest class of fundamental amplitude, | ξ̅S(h)|95 is bigger at \nodd-order harmonics, namely those suffering by HD. However, \nat the largest class of fundamental magnitude, the 95 th \npercentile values of the stochastic error contributions are \nsimilar at both odd and even order harmonics. The reason is that \nIM due to the fundamental interacting with other components, \nwhich affects both even and odd harmonics, plays a significant \nrole in this case. As far as harmonic orders above the 10\nth, \n|ξ̅S(h)|95 progressively reduces for all the classes of fundamental \nmagnitude; at the 30th order harmonic it becomes just few times \nlarger than the contribution due to measurement disturbances. \nCONCLUSION AND FINAL REMARKS \nIn general, the accuracy of a CT in measuring harmonic \ncomponents cannot be properly quantified by a mere couple of \nratio and phase errors. The present article has proposed a new \napproach, derived from the Volterra model of the CT subject to \nperiodic primary current waveforms that resembles those \ntypically found in distribution grids.  \nThe complex error is adopted as accuracy figure, with the \ntarget of parametrizing a circular region in the complex plane \nwhere the actual harmonic phasor is likely to be for a given \nconfidence level.  Such complex error is decomposed into a \ndeterministic and a stochastic contribution that, in spite of the \nmathematical passages aimed at studying their statistical \nproperties, can be easily separated through a LS-based method. \nThe deterministic term is, by definition, purely related to the \nphasor to be measured. For each harmonic, it is expressed by a \nunique complex-valued number; its real and imaginary parts \nvirtually correspond to deterministic magnitude and phase \nerrors, respectively. The stochastic term is produced by \nnonlinearity, and it exhibits a circularly symmetric PDF; the \nspread of its magnitude becomes broader as the fundamental \namplitude increases. A proper quantification of this second \ncontribution can be performed by rating the 95\nth percentile \nvalue of its magnitude for different ranges of the fundamental \namplitude. It is worth highlighting that, if the CT were perfectly \nlinear (and having neglected measurement disturbances), the \nmagnitude of the stochastic contribution would be zero. In this \ncase, the proposed approach degrades in the usual magnitude \nand phase error for each harmonic. \nThe impact of measurement disturbances and of the \nuncertainty of the calibration setup on the evaluated \ncontributions has been quantified. On the one hand, it enables \nassessing the significance of the results. From the opposite \npoint of view, it helps determining the specifications of the test \nsetup for a given target uncertainty. \nThe effectiveness of the method has been validated on an \ninductive CT, notably characterized by mostly odd-degree \nnonlinearity. Nevertheless, achieved results can be deemed as \ngeneral, since the method is based on a behavioral model of the \nCT, thus independent from its operating principle. The \nproposed approach has multifold practical applications: other \nthan representing a good tradeoff between complexity and \nfidelity in representing the metrological behavior of a CT, it \nprovides valuable inputs for improving the relevant standards, \nin particular revising how accuracy requirements for harmonic \nmeasurements are prescribed. Moreover, it can be adopted in \nnumerical simulations to include a realistic representation of \nerrors introduced by CTs. This may help studying harmonic \nstate estimation techniques or methods for detecting harmonic \nsources under more realistic conditions. \nR\nEFERENCES \n[1] M. H. J. Bollen, \"What is power quality?\" Electr. Power Syst. Res., vol. \n66, no. 1, pp. 5–14, July 2003. \n[2] J. Arrilaga and E. N. R. Watson, Power System Harmonics , 2nd ed. \nHoboken, NJ, USA: Wiley, 2003. \n[3] H. Sharma, M. Rylander and D. Dorr, \"Grid Impacts Due to Increased \nPenetration of Newer Harmonic Sources,\" IEEE Transactions on Industry \nApplications, vol. 52, no. 1, pp. 99-104, Jan.-Feb. 2016. \n[4] N. Nakhodchi, M. H. J. Bollen and T. Busatto, \"Transfer of Harmonics in \nDistribution Networks,\" IEEE Transactions on Power Delivery , vol. 37, \nno. 3, pp. 1617-1626, June 2022. \n[5] Instrument transformers – The use of instrument transformers for power \nquality measurement, document IEC TR 61869-103, 2012. \n[6] G. Crotti et al., \"How Instrument Transfor mers Influence Power Quality \nMeasurements: A Proposal of Accuracy Verification Tests, \" Sensors, vol. \n22, no. 15, 2022. \n[7] D. Carta, C. Muscas, P. A. Pego raro, A. V. Solin as and S. Sulis, \n\"Compressive Sensing-Based Harmonic  Sources Identification in Smart \nGrids,\" IEEE Trans. Instrum. Meas., vol. 70, pp. 1-10, 2021. \n[8] C. Rakpenthai, S. Uatrong jit, N. R. Watson, and S. \nPremrudeepreechacharn, \"On harmonic state estimation of power system \nwith uncertain network parameters,\" IEEE Trans. Power Syst. , vol. 28, \nno. 4, pp. 4829–4838, Nov. 2013. \n[9] P. S. Wright, A. E. Christensen, P.  N. Davis and T. Lippert, \"Multiple-\nSite Amplitude and Phase Measurements of Harmonics for Analysis of \nHarmonic Propagation on Bornholm Island,\" IEEE Transactions on \nInstrumentation and Measurement , vol. 66, no. 6, pp. 1176-1183, June \n2017. \n[10] F. B. Bottura, M. Oleskovicz, T. D. Le and M. Petit, \"Optimal Positioning \nof Power Quality Meters for Mon itoring Potential Conditions of \nHarmonic Resonances in a MV Distribution System,\" IEEE Transactions \non Power Delivery, vol. 34, no. 5, pp. 1885-1897, Oct. 2019. \n[11] Instrument transformers - Part 1: General requirements , document IEC \n61869-1 ED2:2023. \n[12] Instrument transformers - Part 3: Additional requirements for inductive \nvoltage transformers, document IEC 61869-3:2011. \n[13] Instrument transformers - Part 11: Additional requirements for low-\npower passive voltage transformers, document IEC 61869-10:2017. \n[14]\n M. Faifer, A. Ferrero, C. Laurano, R. Ottoboni, S. Toscani and M. Zanoni, \n\"An Innovative Approach to Express Uncertainty Introduced by Voltage \nTransformers,\" IEEE Trans. Instrum. Meas. , vol. 69, no. 9, pp. 6696-\n6703, Sept. 2020. \n[15] M. Faifer, C. Laurano, R. Ottoboni, S. Toscani, M. Zanoni, \n\"Characterization of Voltage Inst rument Transformers Under Non-\nSinusoidal Conditions Based on the Best Linear Approximation, \"  IEEE \nTrans. Instrum. Meas., vol. 67, no. 10, pp. 2392-2400, Oct. 2018. \n[16] M. Faifer, C. Laurano, R.  Ottoboni, S. Toscani, M. Zanoni, G. Crotti, D. \nGiordano, L. Barbieri, M. Gondola and P. Mazza, \"Overcoming \nFrequency Response Measurements of Voltage Transformers: An \nApproach Based on Quasi-Sinusoidal Volterra Models,\" IEEE Trans. \nInstrum. Meas., vol. 68, no. 8, pp. 2800-2807, Aug. 2019. \nThis article has been accepted for publication in IEEE Transactions on Instrumentation and Measurement. This is the author's version which has not been fully edited and \ncontent may change prior to final publication. Citation information: DOI 10.1109/TIM.2024.3353857\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License. For more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/\n \n \n[17] Instrument transformers - Part 2: Additional requirements for current \ntransformers, document IEC 61869-2:2012. \n[18] Instrument transformers - Part 10:  Additional requirements for low-\npower passive current transformers, document IEC 61869-10:2017. \n[19] A. Cataliotti, D. Di Cara, A. E. Emanuel and S. Nuccio, \"A Novel \nApproach to Current Transformer Ch aracterization in the Presence of \nHarmonic Distortion,\" IEEE Trans. Instrum. Meas. , vol. 58, no. 5, pp. \n1446-1453, May 2009. \n[20] M. Kaczmarek and E. Stano, \"Nonlinearity of Magnetic Core in \nEvaluation of Current and Phase Errors of Transformation of Higher \nHarmonics of Distorted Current by Inductive Current Transformers,\" \nIEEE Access, vol. 8, pp. 118885-118898, 2020. \n[21] M. Faifer, C. Laurano, R. Ottoboni  and S. Toscani, \"Investigating and \nModeling the Harmonic Measurement Accuracy of Current \nTransformers,\" IEEE Int. Workshop on Applied Measurements for Power \nSystems, Cagliari, Italy, 2022. \n[22] Electromagnetic compatib ility (EMC) – Part 3.4:  Limits. Limitation of \nemission of harmonic currents in low-voltage power supply systems for \nequipment with rated current greater than 16 A, document IEC 61000-3-\n4:1998. \n[23] J. A. Gubner, Probability and random proces ses for electrical and \ncomputer engineers. Cambridge, UK: Cambridge University Press, 2006. \n[24] Instrument transformers - Part 9: Digital interface for instrument \ntransformers, document IEC 61869-9:2016. \n[25] M. Schetzen, The Volterra and Wiener Theories of Nonlinear Systems . \nMalabar, FL: Krieger, 2006. \n[26] A. J. Collin, A. Delle Femine, D. Gallo, R. Langella and M. Luiso, \n\"Compensation of Current Transfor mers’ Nonlinear ities by Tensor \nLinearization,\" IEEE Trans. Instrum. Meas. , vol. 68, no. 10, pp. 3841-\n3849, Oct. 2019. \n[27] C. Laurano, S. Toscani, and M. Zanoni, \"A Simple Method for \nCompensating Harmonic Distortion in Current Transformers: \nExperimental Validation,\" Sensors, vol. 21, no. 9, p. 2907, Apr. 2021. \n[28] M. Faifer, C. Laurano, R. Ottoboni and S. Toscani, \"Adaptive Polynomial \nHarmonic Distortion Compensation in Current and Voltage Transformers \nThrough Iteratively Updated QR Factorization,\" IEEE Trans. Instrum. \nMeas., vol. 72, pp. 1-10, 2023. \n[29] Steven M. Kay, Fundamentals of Statistical Signal Processing: \nEstimation Theory, vol. 1 . Upper Saddle River, NJ : Prentice Hall PTR, \n2010. \n[30] \nL. Cristaldi, M. Faifer, C. Lauran o, R. Ottoboni, S. Toscani and M. \nZanoni, \"A Low-Cost Generator for Testing and Calibrating Current \nTransformers,\" IEEE Trans. Instrum. Meas.,  vol. 68, no. 8, pp. 2792-\n2799, Aug. 2019. \n[31] C. De Boor,  A Practical Guide to Splines (Applied Mathematics Sciences \n27). New York, NY: Springer, 2001. \n[32] R. Pintelon, J. Schoukens, System Identification. A frequency domain \napproach, 2nd ed. Hoboken, NJ: Wiley, 2012. \n \n \nMarco Faifer (Senior Member, IEEE) \nwas born in Bormio, Italy, in 1978. He \nreceived the Laurea degree in electronic \nengineering and the Ph.D. degree in \nelectrical engineering from the \nPolitecnico di Milano, Milan, Italy, in \n2003 and 2009, respectively. He is \ncurrently an Associate Professor with the Dipartimento di \nElettronica, Informazione e Bioingegneria, Politecnico di \nMilano. His scientific activity is mainly concerned with DSP \ntechniques and the development of industrial sensors and \ndevices for high-voltage measurements. Moreover, he develops \nmeasurement algorithms for the characterization of electrical \ncomponents and materials. He also works in the field of \ndiagnostics for electrical devices. \nChristian Laurano (Member, IEEE) \nwas born in Lodi, Italy in 1990. He \nreceived the M.Sc. and Ph.D. degrees \n(cum laude) in electrical engineering \nfrom the Politecnico di Milano, Milan, \nItaly, in 2014 and 2018, respectively. \nFrom 2018 to 2020, he was a Post-\nDoctoral Researcher with the Politecnico di Milano. From 2020 \nto 2021, he was with the Measurement and Diagnostic Group, \nTransmission and Distribution Technology Department, RSE \nSpA. He is currently an Assistant Professor with the \nDipartimento di Elettronica, Informazione e Bioingegneria, \nPolitecnico di Milano. His main research interests include \ninnovative methods to model and characterize electrical \ntransducers, diagnostic techniques devoted to electrical grid \ncomponents, and power quality monitoring. \n \nRoberto Ottoboni (Fellow, IEEE) received \nthe Laurea and Ph.D. degrees from the \nPolitecnico di Milano, Milan, Italy, in 1987 \nand 1992, respectively. From January 2009 \nto December 2012, he was the Chair of the \nElectrical Engineering Department, \nPolitecnico di Milano. He is currently a Full \nProfessor of Electrical and Electronic \nMeasurements with the Dipartimento di Elettronica, \nInformazione e Bioingegneria, Politecnico di Milano. His \nresearch fields range from the study and analysis of digital \nsignal processing techniques for measurement to the study and \nimplementation of sensors, transducers, and measurement \nsystems for electrical quantities for industrial applications, with \nparticular attention to innovative sensors for medium and high \nvoltages and high current. \n  \nSergio Toscani (Senior Member, IEEE) \nreceived the M.Sc. (summa cum laude) and \nthe Ph.D. (summa cum laude) degrees in \nelectrical engineering from the Politecnico \ndi Milano, Italy, in 2007 and 2011, \nrespectively. From 2011 to 2020 he was \nAssistant Professor in Electrical and \nElectronic Measurement with the \nDipartimento di Elettronica, Informazione e Bioingegneria, \nPolitecnico di Milano, where he currently serves as an \nAssociate Professor. His research activity is mainly focused on \ndevelopment and testing of current and voltage transducers, \nmeasurement techniques for power systems, electrical \ncomponents and systems diagnostics. He is member of the \nIEEE Instrumentation and Measurement Society and of the \nIEEE TC-39 - Measurements in Power Systems. \n \nThis article has been accepted for publication in IEEE Transactions on Instrumentation and Measurement. This is the author's version which has not been fully edited and \ncontent may change prior to final publication. Citation information: DOI 10.1109/TIM.2024.3353857\nThis work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 License. For more information, see https://creativecommons.org/licenses/by-nc-nd/4.0/",
  "topic": "Current transformer",
  "concepts": [
    {
      "name": "Current transformer",
      "score": 0.7254757881164551
    },
    {
      "name": "Measurement uncertainty",
      "score": 0.6534640789031982
    },
    {
      "name": "Nonlinear system",
      "score": 0.6222118735313416
    },
    {
      "name": "Metrology",
      "score": 0.5712726712226868
    },
    {
      "name": "Harmonic analysis",
      "score": 0.5496554970741272
    },
    {
      "name": "Metric (unit)",
      "score": 0.5000331401824951
    },
    {
      "name": "Calibration",
      "score": 0.488395631313324
    },
    {
      "name": "Transformer",
      "score": 0.48693597316741943
    },
    {
      "name": "Harmonic",
      "score": 0.4627509117126465
    },
    {
      "name": "Observational error",
      "score": 0.45133689045906067
    },
    {
      "name": "Transducer",
      "score": 0.45073097944259644
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.42444485425949097
    },
    {
      "name": "Fundamental frequency",
      "score": 0.4200395941734314
    },
    {
      "name": "Computer science",
      "score": 0.40383845567703247
    },
    {
      "name": "Electronic engineering",
      "score": 0.3976615369319916
    },
    {
      "name": "Algorithm",
      "score": 0.372417151927948
    },
    {
      "name": "Mathematics",
      "score": 0.35453104972839355
    },
    {
      "name": "Voltage",
      "score": 0.25917530059814453
    },
    {
      "name": "Acoustics",
      "score": 0.2483680546283722
    },
    {
      "name": "Physics",
      "score": 0.2170133888721466
    },
    {
      "name": "Engineering",
      "score": 0.20586654543876648
    },
    {
      "name": "Electrical engineering",
      "score": 0.14390745759010315
    },
    {
      "name": "Artificial intelligence",
      "score": 0.11353740096092224
    },
    {
      "name": "Statistics",
      "score": 0.10595214366912842
    },
    {
      "name": "Control (management)",
      "score": 0.0
    },
    {
      "name": "Operations management",
      "score": 0.0
    },
    {
      "name": "Quantum mechanics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I93860229",
      "name": "Politecnico di Milano",
      "country": "IT"
    }
  ]
}