{
  "title": "A Study on the Implementation of Generative AI Services Using an Enterprise Data-Based LLM Application Architecture",
  "url": "https://openalex.org/W4390486238",
  "year": 2023,
  "authors": [
    {
      "id": "https://openalex.org/A2151415332",
      "name": "Cheon-Su Jeong",
      "affiliations": [
        "Samsung SDS (South Korea)",
        "Samsung (South Korea)"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W3195577433",
    "https://openalex.org/W394479730",
    "https://openalex.org/W3087589180",
    "https://openalex.org/W2907264846",
    "https://openalex.org/W4362515116",
    "https://openalex.org/W4380758928",
    "https://openalex.org/W4386840094"
  ],
  "abstract": "This study presents a method for implementing generative AI services by utilizing the Large Language Models (LLM) application architecture. With recent advancements in generative AI technology, LLMs have gained prominence across various domains. In this context, the research addresses the challenge of information scarcity and proposes specific remedies by harnessing LLM capabilities. The investigation delves into strategies for mitigating the issue of inadequate data, offering tailored solutions. The study delves into the efficacy of employing fine-tuning techniques and direct document integration to alleviate data insufficiency. A significant contribution of this work is the development of a Retrieval-Augmented Generation (RAG) model, which tackles the aforementioned challenges. The RAG model is carefully designed to enhance information storage and retrieval processes, ensuring improved content generation. The research elucidates the key phases of the information storage and retrieval methodology underpinned by the RAG model. A comprehensive analysis of these steps is undertaken, emphasizing their significance in addressing the scarcity of data. The study highlights the efficacy of the proposed method, showcasing its applicability through illustrative instances. By implementing the RAG model for information storage and retrieval, the research not only contributes to a deeper comprehension of generative AI technology but also facilitates its practical usability within enterprises utilizing LLMs. This work holds substantial value in advancing the field of generative AI, offering insights into enhancing data-driven content generation and fostering active utilization of LLM-based services within corporate settings.",
  "full_text": null,
  "topic": "Scarcity",
  "concepts": [
    {
      "name": "Scarcity",
      "score": 0.7538774013519287
    },
    {
      "name": "Generative grammar",
      "score": 0.6911931037902832
    },
    {
      "name": "Computer science",
      "score": 0.6880863904953003
    },
    {
      "name": "Context (archaeology)",
      "score": 0.5273193717002869
    },
    {
      "name": "Knowledge management",
      "score": 0.4783850908279419
    },
    {
      "name": "Data science",
      "score": 0.4661627411842346
    },
    {
      "name": "Generative model",
      "score": 0.45282799005508423
    },
    {
      "name": "Usability",
      "score": 0.4367262125015259
    },
    {
      "name": "Artificial intelligence",
      "score": 0.27757108211517334
    },
    {
      "name": "Human–computer interaction",
      "score": 0.1615751087665558
    },
    {
      "name": "Microeconomics",
      "score": 0.0
    },
    {
      "name": "Biology",
      "score": 0.0
    },
    {
      "name": "Paleontology",
      "score": 0.0
    },
    {
      "name": "Economics",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I4387155180",
      "name": "Samsung SDS (South Korea)",
      "country": null
    },
    {
      "id": "https://openalex.org/I2250650973",
      "name": "Samsung (South Korea)",
      "country": "KR"
    }
  ]
}