{
    "title": "Unit Test Generation Using Large Language Models: A Systematic Literature Review",
    "url": "https://openalex.org/W4396903441",
    "year": 2024,
    "authors": [
        {
            "id": "https://openalex.org/A5098622683",
            "name": "Dovydas Marius Zapkus",
            "affiliations": [
                "Vilnius University"
            ]
        },
        {
            "id": "https://openalex.org/A283374081",
            "name": "Asta Slotkiene",
            "affiliations": [
                "Vilnius University"
            ]
        },
        {
            "id": "https://openalex.org/A5098622683",
            "name": "Dovydas Marius Zapkus",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A283374081",
            "name": "Asta Slotkiene",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W4402042086",
        "https://openalex.org/W2959222533",
        "https://openalex.org/W4284664028",
        "https://openalex.org/W4392539602",
        "https://openalex.org/W4385965483",
        "https://openalex.org/W4391021472",
        "https://openalex.org/W3169933101",
        "https://openalex.org/W4389104713",
        "https://openalex.org/W4297676895",
        "https://openalex.org/W4281611258",
        "https://openalex.org/W4384615697",
        "https://openalex.org/W2124493593",
        "https://openalex.org/W4388286986",
        "https://openalex.org/W4387711873",
        "https://openalex.org/W4367669694"
    ],
    "abstract": "Unit testing is a fundamental aspect of software development, ensuring the correctness and robustness of code implementations. Traditionally, unit tests are manually crafted by developers based on their understanding of the code and its requirements. However, this process can be time-consuming, errorprone, and may overlook certain edge cases. In recent years, there has been growing interest in leveraging large language models (LLMs) for automating the generation of unit tests. LLMs, such as GPT (Generative Pre-trained Transformer), CodeT5, StarCoder, LLaMA, have demonstrated remarkable capabilities in natural language understanding and code generation tasks. By using LLMs, researchers aim to develop techniques that automatically generate unit tests from code snippets or specifications, thus optimizing the software testing process. This paper presents a literature review of articles that use LLMs for unit test generation tasks. It also discusses the history of the most commonly used large language models and their parameters, including the first time they have been used for code generation tasks. The result of this study presents the large language models for code and unit test generation tasks and their increasing popularity in code generation domain, indicating a great promise for the future of unit test generation using LLMs.",
    "full_text": null
}