{
  "title": "Application of large language models in the field of education",
  "url": "https://openalex.org/W4395955497",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A2174808784",
      "name": "Shiyi Shen",
      "affiliations": [
        "California University of Pennsylvania"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4318464200",
    "https://openalex.org/W4295413191",
    "https://openalex.org/W3156116246",
    "https://openalex.org/W4280609123",
    "https://openalex.org/W4323655724",
    "https://openalex.org/W4306294800",
    "https://openalex.org/W4247333054"
  ],
  "abstract": "This paper delves into the application of generative artificial intelligence and large language models in the field of education, with a particular focus on the rising trend of large language models. Large language models play a crucial role in intelligent tutoring systems by accurately understanding student queries through deep learning and providing personalized responses. Case studies showcase the exemplary utilization of natural language processing techniques and reasoning engines, albeit facing challenges related to real-time processing and privacy concerns. The latter part of the paper concentrates on the application of generative artificial intelligence and large language models in curiosity-driven learning and the integration of multimodal educational systems, emphasizing the technical frameworks and challenges associated with multimodal integration. Finally, the paper provides insights into future developments, highlighting research on the potential benefits in the field of education, while emphasizing concerns related to ethics and privacy.",
  "full_text": "Application of large language models in the field of education \nShiyi Shen \nUniversity of Pennsylvania \njessyshen99@foxmail.com \nAbstract. This paper delves into the application of generative artificial intelligence and large \nlanguage models in the field of education, with a particular focus on the rising trend of large \nlanguage models. Large language models play a crucial role in intelligent tutoring systems by \naccurately understanding student queries through deep learning and providing personalized \nresponses. Case studies showcase the exemplary utilization of natural language processing \ntechniques and reasoning engines, albeit facing challenges related to real -time processing and \nprivacy concerns. The latter part of the paper concentrates on the application of generative \nartificial intelligence and large language models in curiosity -driven learning and the integration \nof multimodal educational systems, emphasizing the technical frameworks and challenges \nassociated with multimodal integration. Finally, the pap er provides insights into future \ndevelopments, highlighting research on the potential benefits in the field of education, while \nemphasizing concerns related to ethics and privacy. \nKeywords: Generative Artificial Intelligence, Large Language Models, Educational Technology, \nIntelligent Tutoring Systems, Curiosity-Driven Learning, Problem Solving \n1.  Introduction \n1.1.  Background \nWith the rapid development of generative artificial intelligence, the application of large language models \nin the field of education has gradually become a focal point of attention in both the academic and \nindustrial sectors. The emergence of this technolo gy has brought unprecedented opportunities to \neducation but is also accompanied by a series of potential challenges. Educators and researchers are \nactively exploring how to integrate large language models to enhance student learning experiences and \nteaching effectiveness. \n1.2.  Purpose \nThe purpose of this paper is to delve into the application of generative artificial intelligence in the field \nof education, with a particular focus on the integration of large language models. We aim to reveal the \nopportunities presented by this technologi cal trend while concurrently examining challenges that may \nhave adverse effects on learning. Through analysis of the latest research and collaborative projects, we \nseek to provide a comprehensive understanding and valuable insights for decision-makers, educational \ntechnology developers, and researchers in the field of education. \nProceedings of the 3rd International Conference on Computing Innovation and Applied PhysicsDOI: 10.54254/2753-8818/34/20241163\n© 2024 The Authors. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0(https://creativecommons.org/licenses/by/4.0/).\n147\n1.3.  Research Questions and Objectives \nIn exploring the integration of large language models in education, we will focus on the following core \nquestions: How do large language models alter the landscape of educational technology? Can the \nintegration of large language models effectively enhance student learning outcomes? While exploring \nopportunities, how should we address potential challenges? By answering these questions, we aim to \nprovide decision-makers and practitioners in the education field with in -depth and substantive insights \nto guide their decisions and practices in adopting large language models in educational technology. \n1.4.  Overview of Paper Structure \nThis paper will be divided into several sections, systematically exploring the application of generative \nartificial intelligence in education. The second section will provide an overview of the basic concepts of \ngenerative artificial intelligence and current application cases in the education sector. The third section \nwill focus on the opportunities and challenges of large language models in education, categorized into \ntwo aspects: opportunities and challenges. Subsequent sections will concentrate on the in tegration of \nlarge language models in intelligent tutoring systems, analyzing collaborative projects through case \nstudies to explore their potential value in cultivating student curiosity and question posing. Following \nthat, we will conduct an in -depth stu dy of curiosity -driven dialogue agents, combining empirical \nresearch cases to highlight the application of large language models in promoting curiosity -driven \nlearning. The last two sections will perform a technical survey, evaluating the possibilities of multimodal \nintegrated educational systems and the synergies between large language models and other technologies. \nFinally, the seventh section will summarize research findings and provide insights into future directions \nfor integrating large language models in the field of education. \n2.  Application of Generative Artificial Intelligence in Education \n2.1.  Overview of Generative Artificial Intelligence \nGenerative artificial intelligence, as an emerging technology in the field of artificial intelligence, has \ngained prominence in the education sector in recent years. The core feature of this technology lies in its \nability to autonomously generate text, und erstand language, and engage in interactions, providing \neducators and learners with a new paradigm for learning. The fundamental concept of generative \nartificial intelligence is to simulate the creative thinking processes of humans, enabling it to produce \ncomplex, context-aware natural language outputs [1]. \n2.2.  Current Application Cases in Education \nCurrently, generative artificial intelligence has made significant strides in the field of education. \nInnovators in educational technology actively explore the integration of generative artificial intelligence \ninto schools, online education platforms, and tutoring systems to enhance the personalization and \neffectiveness of learning. Real -time intelligent tutoring, smart Q&A systems, personalized learning \nrecommendations, and other application cases are gradually becoming highlights in educational \npractices, offering students more intelligent and personalized learning support. \n2.3.  Technological Trends and Future Prospects \nWith the widespread application of generative artificial intelligence in education, technological trends \ncontinue to evolve. Particularly noteworthy is the rise of large language models, injecting greater \nlanguage understanding and generation capabilities into generative artificial intelligence. In the future, \nwe can expect to see generative artificial intelligence demonstrating its potential in various fields, \nincluding but not limited to more intelligent educational tutoring, instant problem -solving, and more \ncreative learning experiences. \nIn this section, we will delve into the key application areas of generative artificial intelligence in \neducation to reveal its potential advantages in enhancing educational effectiveness and driving learning \ninnovation. Through the exploration of current t echnological trends and future prospects, we aim to \nProceedings of the 3rd International Conference on Computing Innovation and Applied PhysicsDOI: 10.54254/2753-8818/34/20241163\n148\npresent readers with a comprehensive overview of generative artificial intelligence in education, laying \nthe foundation for in-depth analysis in subsequent chapters. \n3.  Large Language Models in the Education Sector: Opportunities and Challenges \n3.1.  Opportunities \nThe integration of large language models in education presents unprecedented opportunities for \npersonalized learning. Leveraging deep learning and natural language processing techniques, large \nlanguage models can comprehend students’ learning needs, interests, and subject proficiency, offering \ntailored learning content and support to each student. This opportunity allows educators to better address \nthe diverse learning needs of students, thereby improving learning outcomes and nurturing the individual \npotential of each student. \nThe integration of large language models also empowers teachers with greater teaching authority. \nThrough intelligent assistance systems, teachers can access real -time feedback, personalized teaching \nsuggestions, and customized teaching resources, better me eting the needs of each student in the \nclassroom. Teachers can focus more on individualized guidance, enhance classroom efficiency, and \nprovide more targeted support during critical moments in student development [2]. \n3.2.  Challenges \nDespite providing new opportunities for personalized learning, the reliance on large language models \nmay pose potential risks to children ’s learning. Excessive dependence on automated learning systems \nmay result in students losing their ability for independent learning and becoming overly reliant on \nmachine models. Additionally, the accuracy of the content generated by the models needs caref ul \nconsideration to prevent misinformation from negatively impacting students’ academic development. \nThe widespread adoption of large language models in education also brings challenges in terms of \ndata privacy and ethics. The extensive collection and analysis of students ’ personal information and \nlearning data may raise concerns about privacy. Moreover, the training data for the models may contain \ninherent biases, potentially leading to unfair impacts on student groups. Addressing these issues requires \nthe establishment of rigorous data privacy regulations and ethical frameworks to ensure the security of \nstudent information and equitable treatment. \nIn the following chapters, we will conduct a detailed analysis of these opportunities and challenges, \naiming to provide educators, decision -makers, and researchers with a more comprehensive \nunderstanding and offering possible methods and recommendations for addressing these issues. \n4.  Integration of Intelligent Tutoring Systems and Large Language Models \n4.1.   Overview of Intelligent Tutoring Systems \nIntelligent Tutoring Systems are educational tools that utilize artificial intelligence technology to \nprovide intelligent learning support. These systems analyze students ’ learning data, identify learning \nneeds, and offer personalized teaching suggestions. Their goal is to optimize students ’ learning \nexperiences, helping educators better meet the subject -specific needs of students. In recent years, with \nthe rise of large language models, Intelligent Tutoring Systems are gradually integrating this technology, \nfurther enhancing the systems’ level of intelligence [3]. \n4.2.  Role of Large Language Models in Tutoring Systems \nLarge language models play a crucial role in Intelligent Tutoring Systems. Firstly, these models can \ndeeply understand questions posed by students, infer potential subject knowledge, and provide specific \nand personalized answers. Secondly, based on student s’ learning history and performance, large \nlanguage models can adjust teaching content and difficulty, achieving more accurate personalized \nlearning support. By simulating the human teaching process, large language models not only provide \nefficient learning paths for students but also offer real-time feedback and guidance to educators. \nProceedings of the 3rd International Conference on Computing Innovation and Applied PhysicsDOI: 10.54254/2753-8818/34/20241163\n149\n4.3.  Case Study: Collaboration between EvidenceB and Inria Flowers \nIn-depth examination of the integration of large language models in Intelligent Tutoring Systems \ninvolves exploring the technical details through the collaborative project between EvidenceB and Inria \nFlowers. This project, founded on technological innovati on, aims to enhance students ’ learning \noutcomes in mathematics and science. \n4.3.1.  Exquisite Application of Natural Language Processing Technology. In this collaborative project, \nnatural language processing technology serves as a crucial technical foundation. Through deep learning \nmethods, large language models are trained to precisely understand questions posed by students. \nEmploying state-of-the-art natural language processing algorithms, the models can capture the grammar \nstructure, context, and potential knowledge points within questions, achieving more accurate semantic \nunderstanding [4]. \nThe successful application of this technology involves training on a large -scale corpus and fine -\ntuning the model parameters. By using rich and diverse subject texts, the model gains a comprehensive \nunderstanding of terms and knowledge structures in various subject areas. Additionally, the fine-tuning \nprocess requires meticulous adjustments to adapt the model to specific subject domains, ensuring higher \naccuracy and adaptability in answering student questions [5]. \n4.3.2.  Construction and Optimization of the Inference Engine. The inference engine of large language \nmodels is another technical highlight in this project. By combining the model’s profound understanding \nof subject knowledge with its logical reasoning capabilities, the inference engine can generate high -\nquality answers. This inference process may involve extracting information from knowledge graphs and \ndesigning logical reasoning rules. \nOn the technical front, building the inference engine requires handling large-scale knowledge graphs, \nensuring the model can efficiently retrieve and comprehend information within them. Additionally, to \nenhance the performance of the inference engine, advanced technical means such as parallel computing \nand distributed computing may be needed to address computational demands when dealing with \ncomplex problems. \n4.3.3.  Personalized Algorithm for Dynamic Learning Paths. Achieving dynamic personalized learning \npaths involves advanced personalized algorithms. This project may employ reinforcement learning or \nrecommendation system techniques from deep learning to dynamically adjust learning paths based on \nstudents’ subject proficiency and learning history. \nOn the technical front, this requires establishing a system capable of processing student data in real-\ntime and providing personalized recommendations. The model may need to update estimates of students’ \nsubject proficiency in real -time while considering the interrelatedness between subject areas for more \naccurate adjustments to the learning path. This process may involve online updates of model parameters \nand rapid recommendation algorithms. \n4.3.4.  Technical Challenges and Optimization Paths . While this project showcases the powerful \napplication of large language models in Intelligent Tutoring Systems, it also faces some technical \nchallenges. Real -time responsiveness and computational efficiency are crucial aspects that require \nmodel optimization to meet fast response requirements. Additionally, the construction of personalized \nlearning paths necessitates careful handling of student data privacy and security, employing clever \nprivacy protection techniques to balance personalization and privacy relationships [6]. \nOn the technical front, further optimization paths may include streamlining model structures and \napplying hardware acceleration to enhance computational efficiency. Moreover, adopting privacy \nprotection measures such as differential privacy or federated learning is essential to ensure the proper \nprotection of student data. \nProceedings of the 3rd International Conference on Computing Innovation and Applied PhysicsDOI: 10.54254/2753-8818/34/20241163\n150\n4.3.5.  Technological Prospects and Future Development Directions. Looking ahead, this collaborative \nproject opens up new possibilities for the technological application of large language models in \nIntelligent Tutoring Systems. The technical team can further explore the applicability of the model to a \nbroader range of sub ject areas and increase the system ’s intelligence by introducing more complex \nalgorithms and model structures. As technology continues to evolve, this project also provides valuable \nexperience for introducing more innovative and efficient solutions in the field of educational technology \nin the future. \n5.  Implementing Curiosity-Based Learning Dialogue Agents \n5.1.  Importance of Curiosity-Based Learning \nCuriosity-based learning, as a crucial learning mode, plays a key role in cultivating students ’ spirit of \nactive inquiry and problem -solving abilities. This learning approach not only encourages students to \nactively pose questions but also sparks their desire for in -depth exploration of knowledge. Curiosity -\nbased learning emphasizes students’ proactive exploration of subjects, contributing to the development \nof innovative thinking and critical reasoning skills. \n5.2.  Application of Large Language Models in Facilitating Curiosity-Based Learning \nThe application of large language models in the field of education opens up new possibilities for \npromoting curiosity-based learning. These models possess the capability to understand and generate \nknowledge across multiple domains, enabling them to provide  insightful and inspiring answers when \nlearners pose questions. Through simulating dialogue, large language models can stimulate students ’ \ncuriosity, guide them to actively engage in subject discussions, and encourage them to pose more \nprofound questions. \n5.3.  Abdelghani et al.’s Case Study (2023) \nTo further explore the practical effects of large language models in fostering curiosity -based learning, \nwe will introduce the research case study conducted by Abdelghani et al. in 2023. This study focuses on \nhow combining dialogue agents with large langua ge models can stimulate curiosity -based learning in \nstudents. By analyzing the interaction between students and the dialogue agents, the research team \ngained insights into the topics, depth of questions posed by students, and feedback on the model -\ngenerated answers. This case study will provide us with practical insights into how large language \nmodels can promote curiosity-based learning, enhancing our understanding of the potential value of this \ntechnology in the educational process [7]. \nIn the subsequent sections, we will delve deeper into the application of large language models in \ndialogue agents and how they influence students ’ curiosity-based learning. Through the analysis of \nspecific cases, our aim is to provide educators with practical recommendations on how to maximize the \nuse of large language models in promoting students’ curiosity-based learning. \n6.  Technical Survey: Integration of Multi-Module Technologies in Education \n6.1.  Integrating Various Technological Modules in Educational Systems \nThe rapid development of educational technology prompts us to explore how to integrate different \ntechnological modules to construct a more comprehensive and efficient educational system. Integrating \nmulti-module technologies such as virtual reality, artificial intelligence, and large language models holds \nthe potential to provide students with a richer learning experience. This comprehensive approach aims \nto optimize the teaching process, personalize learning, and enhance student engagement and depth of \nunderstanding. \nProceedings of the 3rd International Conference on Computing Innovation and Applied PhysicsDOI: 10.54254/2753-8818/34/20241163\n151\n6.2.  Improving the Synergy between Large Language Models and Other Technologies \nIn this technical survey, we will focus on exploring how to improve the synergy between large language \nmodels and other educational technologies. This includes integration with technologies like virtual \nreality and machine learning algorithms to optimize t he generation of instructional content and \npersonalized learning paths for students. By enhancing collaborative efforts, we aim to better leverage \nthe strengths of various technologies, elevating the overall intelligence and effectiveness of the \neducational system. \n6.3.  Case Study by Kasneci et al. (2023) \nIn this study, we delve into a research case conducted by Kasneci et al. in 2023, focusing on \ntechnological innovations in multi -module integrated education. This case provides a technological \nperspective, emphasizing how different technological modules co llaborate to improve the overall \nperformance of the educational system. \n6.3.1.  Technological Framework for Multi -Module Integration . Kasneci et al. ’s research case first \nfocuses on constructing a multi-module technological framework that integrates several key educational \ntechnology modules. These modules may include technologies from areas such as speech recognition, \nnatural language processing, computer vision, and machine learning. By synergistically utilizing these \ntechnological modules, the research team aims to achieve a more intelligent and comprehensive \neducational system [8]. \nIn the design of the t echnological framework, key issues involve collaboration and communication \nbetween modules. Possible technical means may include establishing unified data exchange standards, \ndesigning effective interfaces, and employing distributed computing. This helps ensure that each module \ncan efficiently share information, enabling effective decision-making and operations. \n6.3.2.  Integration of Speech Recognition and Natural Language Processing . Kasneci et al.’s research \nemphasizes the deep integration of speech recognition and natural language processing modules. By \ncombining these two key technologies, the research team attempts to enhance the system ’s \nunderstanding of student voice inputs and achieve more natural, seamless interactions. This may involve \nreal-time processing of speech signals, semantic analysis of text, and adaptability of the model to \ndifferent dialects and accents, posing technical challenges. \nAt the level of technical integration, advanced technologies like deep neural networks may be \nemployed to establish robust correlations between speech and text. This deep integration enables the \nsystem to more accurately understand students ’ questions and responses, providing finer support for \npersonalized learning. \n6.3.3.  Application of Computer Vision in Education. Another crucial technological module is computer \nvision, which Kasneci et al. include as an integral part of the research case in education. This module \nmay involve technologies such as facial expression recognition, attention detection, and gesture analysis. \nBy combining information from computer vision and other modules, the system can gain a more \ncomprehensive understanding of students’ states and behaviors during the learning process. \nAt the technical level, the integration of computer vision may require advanced technologies like \nconvolutional neural networks in deep learning. This helps extract key information from image and \nvideo data, enabling more accurate assessment of students ’ emotional states and learning behaviors. \nSimultaneously, the real-time processing of data and rapid inference by the model are focal points for \ntechnical optimization. \n6.3.4.  Real-time Decision Support by Machine Learning Algorithms . Kasneci et al.’s research further \nemphasizes the critical role of machine learning algorithms in real -time decision support. Through the \nanalysis and learning from data integrated across multiple modules, the system can achieve real -time \ndecision-making to adjust teaching strategies and personalize recommended learning content. \nProceedings of the 3rd International Conference on Computing Innovation and Applied PhysicsDOI: 10.54254/2753-8818/34/20241163\n152\nOn the technical side, machine learning algorithms such as online learning and incremental learning \nmay be employed to enable the system to adapt to students’ needs in a continuously changing learning \nenvironment. This may also include optimization and parameter adjustments to ensure the system \nmaintains efficient performance over prolonged usage. \n6.3.5.  Technical Challenges and Future Directions . The research case by Kasneci et al. reveals \ntechnological challenges faced by multi-module integrated education systems. One such challenge is the \ncoordination and communication between modules, requiring the design of an efficient technological \nframework. Additionally, addressing real -time processing and handling large -scale data are technical \nchallenges. \nIn future technological development directions, further optimization of each module ’s performance \nmay be necessary, along with exploring more efficient methods of technological integration and \nresearching new machine learning algorithms to enhance the system’s intelligence and adaptability. This \nresearch case provides valuable insights for constructing more intelligent multi -module education \nsystems in the future. \n7.  Conclusion and Prospects \nThrough an in-depth exploration of generative artificial intelligence and large language models in the \nfield of education, this paper has achieved a series of key research findings. Firstly, we discussed the \napplication trends of generative artificial intelligence in education, with a particular focus on the rise of \nlarge language models. This trend has brought opportunities to education, in cluding personalized \nlearning and teacher empowerment, while also presenting a series of challenges, such as potential risks \nto children’s learning and ethical considerations regarding data privacy. \nIn the subsequent sections of the paper, we delved into the integration of large language models in \nintelligent tutoring systems, exploring their advantages and potential impacts on personalized learning \nsupport. We further highlighted the application of l arge language models in fostering curiosity -driven \nlearning, inspiring student initiative through dialogue agents. Additionally, we introduced practical \ncases, such as the collaborative project between EvidenceB and Inria Flowers, as well as the research \nby Abdelghani et al., to showcase the practical application effects of large language models in \neducational environments. \nIn the Technical Survey section, we discussed how to integrate different technological modules to \nconstruct more intelligent educational systems and how to improve the synergy between large language \nmodels and other technologies. We introduced the research case by Kasneci et al., providing an in-depth \nanalysis of the practical effects of multi -module technological integration in enhancing students ’ \nacademic achievements. \nLooking ahead, we believe that the education sector will continue to benefit from the development \nof generative artificial intelligence and large language models. With ongoing technological \nadvancements, we anticipate the emergence of more intelligent and personalized educational solutions. \nHowever, at the same time, it is essential to continuously address ethical and privacy issues arising from \ntechnology and take measures to ensure the fair and just application of these technologies. \nFuture research directions may include a deeper exploration of the actual teaching effects of large \nlanguage models in education and further improvement in understanding students ’ learning processes. \nSimultaneously, research on multi-module technological integration is expected to be refined to realize \nthe collaborative advantages of different technological modules. We 8 look forward to educators, \ntechnology developers, and researchers collectively striving to propel the education sector towards a \nmore intelligent and inclusive future in this ever-evolving field. \nReferences \n[1] Kasneci, E., Seßler, K., Küchemann, S., Bannert, M., Dementieva, D., Fischer, F., … Kasneci, G. \n(2023, January 30). ChatGPT for Good? On Opportunities and Challenges of Large Language \nModels for Education. https://doi.org/10.35542/osf.io/5er8f \nProceedings of the 3rd International Conference on Computing Innovation and Applied PhysicsDOI: 10.54254/2753-8818/34/20241163\n153\n[2] FLOWERS - 2022 - Annual activity report. (n.d.). https://radar.inria.fr/report/2022/flowers/index. \nhtml \n[3] Ayanwale, M. A., Sanusi, I. T., Adelana, O. P., Aruleba, K., & Oyelere, S. S. (2022). Teachers ’ \nreadiness and intention to teach artificial intelligence in schools. Computers & Education: \nArtificial Intelligence, 3, 100099.  \n[4] https://doi.org/10.1016/j.caeai.2022.100099 \n[5] Katsarou, E. (2021). The Effects of Computer Anxiety and Self -Efficacy on L2 Learners ’ Self-\nPerceived Digital Competence and Satisfaction in Higher Education. Journal of Education and \nE-learning Research, 8(2), 158–172. https://doi.org/10.20448/journal.509.2021.82.158.172 \n[6] Oyelere, S. S., Sanusi, I. T., Agbo, F. J., Oyelere, A. S., Omidiora, J. O., Adewumi, A. E., & \nOgbebor, C. (2022). Artificial intelligence in African schools: Towards a contextualized \napproach. 2022 IEEE Global Engineering Education Conference (EDUCON) . \nhttps://doi.org/10.1109/educon52537.2022.9766550 \n[7] Kasneci, E., Sessler, K., Kü chemann, S., Bannert, M., Dementieva, D., Fischer, F., Gasser, U., \nGroh, G., Gü nnemann, S., Hü llermeier, E., Krusche, S., Kutyniok, G., Michaeli, T., Nerdel, \nC., Pfeffer, J., Poquet, O., Sailer, M., Schmidt, A., Seidel, T., . . . Kasneci, G. (2023). ChatGPT \nfor good? On opportunities and challenges of large language models for education. Learning \nand Individual Differences, 103, 102274. https://doi.org/10.1016/j.lindif.2023.102274 \n[8] Karch, T. (2022, October 3). Contrastive multimodal learning for emergence of Graphical \nSensory-Motor Communication. arXiv.org. https://arxiv.org/abs/2210.06468 \n[9] Abdelghani, R., Wang, Y. H., Yuan, X., Wang, T., Lucas, P., Sauzé on, H., & Oudeyer, P. Y. \n(2023). GPT-3 Driven Pedagogical Agent for Cultivating Curiosity in Children’s Questioning \nSkills. International Journal of Educational Artificial Intelligence, 1-36. \nProceedings of the 3rd International Conference on Computing Innovation and Applied PhysicsDOI: 10.54254/2753-8818/34/20241163\n154",
  "topic": "Generative grammar",
  "concepts": [
    {
      "name": "Generative grammar",
      "score": 0.7106066942214966
    },
    {
      "name": "Computer science",
      "score": 0.7103137969970703
    },
    {
      "name": "Field (mathematics)",
      "score": 0.6587318181991577
    },
    {
      "name": "Artificial intelligence",
      "score": 0.48045772314071655
    },
    {
      "name": "Curiosity",
      "score": 0.4568818509578705
    },
    {
      "name": "Language model",
      "score": 0.4391828179359436
    },
    {
      "name": "Focus (optics)",
      "score": 0.413216769695282
    },
    {
      "name": "Data science",
      "score": 0.33848467469215393
    },
    {
      "name": "Psychology",
      "score": 0.11350011825561523
    },
    {
      "name": "Mathematics",
      "score": 0.0
    },
    {
      "name": "Physics",
      "score": 0.0
    },
    {
      "name": "Pure mathematics",
      "score": 0.0
    },
    {
      "name": "Optics",
      "score": 0.0
    },
    {
      "name": "Social psychology",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I36788626",
      "name": "California University of Pennsylvania",
      "country": "US"
    }
  ]
}