{
    "title": "PMC-LLaMA: toward building open-source language models for medicine",
    "url": "https://openalex.org/W4394782456",
    "year": 2024,
    "authors": [
        {
            "id": "https://openalex.org/A2290108068",
            "name": "Chaoyi Wu",
            "affiliations": [
                "Shandong Jiaotong University",
                "Shanghai Jiao Tong University",
                "Shanghai Artificial Intelligence Laboratory"
            ]
        },
        {
            "id": "https://openalex.org/A2158158382",
            "name": "Weixiong Lin",
            "affiliations": [
                "Shanghai Jiao Tong University",
                "Shandong Jiaotong University",
                "Shanghai Artificial Intelligence Laboratory"
            ]
        },
        {
            "id": "https://openalex.org/A2107527362",
            "name": "Xiaoman Zhang",
            "affiliations": [
                "Shanghai Jiao Tong University",
                "Shanghai Artificial Intelligence Laboratory",
                "Shandong Jiaotong University"
            ]
        },
        {
            "id": "https://openalex.org/A2100362878",
            "name": "Ya Zhang",
            "affiliations": [
                "Shanghai Artificial Intelligence Laboratory",
                "Shandong Jiaotong University",
                "Shanghai Jiao Tong University"
            ]
        },
        {
            "id": "https://openalex.org/A2413558386",
            "name": "Weidi Xie",
            "affiliations": [
                "Shanghai Artificial Intelligence Laboratory",
                "Shandong Jiaotong University",
                "Shanghai Jiao Tong University"
            ]
        },
        {
            "id": "https://openalex.org/A2098837876",
            "name": "Yanfeng Wang",
            "affiliations": [
                "Shanghai Artificial Intelligence Laboratory",
                "Shanghai Jiao Tong University",
                "Shandong Jiaotong University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W4384071683",
        "https://openalex.org/W6810738896",
        "https://openalex.org/W2911489562",
        "https://openalex.org/W4297253404",
        "https://openalex.org/W3015453090",
        "https://openalex.org/W3162922479",
        "https://openalex.org/W2604748391",
        "https://openalex.org/W4319662928",
        "https://openalex.org/W3095319910",
        "https://openalex.org/W4391221150",
        "https://openalex.org/W4401042360",
        "https://openalex.org/W4226278401"
    ],
    "abstract": "Abstract Objective Recently, large language models (LLMs) have showcased remarkable capabilities in natural language understanding. While demonstrating proficiency in everyday conversations and question-answering (QA) situations, these models frequently struggle in domains that require precision, such as medical applications, due to their lack of domain-specific knowledge. In this article, we describe the procedure for building a powerful, open-source language model specifically designed for medicine applications, termed as PMC-LLaMA. Materials and methods We adapt a general-purpose LLM toward the medical domain, involving data-centric knowledge injection through the integration of 4.8M biomedical academic papers and 30K medical textbooks, as well as comprehensive domain-specific instruction fine-tuning, encompassing medical QA, rationale for reasoning, and conversational dialogues with 202M tokens. Results While evaluating various public medical QA benchmarks and manual rating, our lightweight PMC-LLaMA, which consists of only 13B parameters, exhibits superior performance, even surpassing ChatGPT. All models, codes, and datasets for instruction tuning will be released to the research community. Discussion Our contributions are 3-fold: (1) we build up an open-source LLM toward the medical domain. We believe the proposed PMC-LLaMA model can promote further development of foundation models in medicine, serving as a medical trainable basic generative language backbone; (2) we conduct thorough ablation studies to demonstrate the effectiveness of each proposed component, demonstrating how different training data and model scales affect medical LLMs; (3) we contribute a large-scale, comprehensive dataset for instruction tuning. Conclusion In this article, we systematically investigate the process of building up an open-source medical-specific LLM, PMC-LLaMA.",
    "full_text": null
}