{
    "title": "Quality of Answers of Generative Large Language Models Versus Peer Users for Interpreting Laboratory Test Results for Lay Patients: Evaluation Study",
    "url": "https://openalex.org/W4392506286",
    "year": 2024,
    "authors": [
        {
            "id": "https://openalex.org/A2098223376",
            "name": "Zhe He",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2748967210",
            "name": "Balu Bhasuran",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2091663374",
            "name": "Qiao Jin",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2167226821",
            "name": "Shubo Tian",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2227116473",
            "name": "Karim Hanna",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A3101052759",
            "name": "Cindy Shavor",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2157138200",
            "name": "Lisbeth Garcia Arguello",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2101572280",
            "name": "Patrick Murray",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2150237561",
            "name": "Zhiyong Lu",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2121470298",
        "https://openalex.org/W2412787004",
        "https://openalex.org/W2467260205",
        "https://openalex.org/W2912979893",
        "https://openalex.org/W2900132398",
        "https://openalex.org/W4390889423",
        "https://openalex.org/W2979507744",
        "https://openalex.org/W2401264319",
        "https://openalex.org/W2076935871",
        "https://openalex.org/W3105288833",
        "https://openalex.org/W2783062583",
        "https://openalex.org/W3096894716",
        "https://openalex.org/W2775320579",
        "https://openalex.org/W4282545866",
        "https://openalex.org/W3205708719",
        "https://openalex.org/W2895326857",
        "https://openalex.org/W2123855421",
        "https://openalex.org/W3023485293",
        "https://openalex.org/W4221073427",
        "https://openalex.org/W2791894937",
        "https://openalex.org/W2913010062",
        "https://openalex.org/W4381587418",
        "https://openalex.org/W4366603014",
        "https://openalex.org/W4378348993",
        "https://openalex.org/W2982090205",
        "https://openalex.org/W2991140398",
        "https://openalex.org/W4386306231",
        "https://openalex.org/W2911489562",
        "https://openalex.org/W2963716420",
        "https://openalex.org/W3046375318",
        "https://openalex.org/W2101105183",
        "https://openalex.org/W2963532001",
        "https://openalex.org/W2133512280",
        "https://openalex.org/W2136148671",
        "https://openalex.org/W4378783233"
    ],
    "abstract": "Background Although patients have easy access to their electronic health records and laboratory test result data through patient portals, laboratory test results are often confusing and hard to understand. Many patients turn to web-based forums or question-and-answer (Q&amp;A) sites to seek advice from their peers. The quality of answers from social Q&amp;A sites on health-related questions varies significantly, and not all responses are accurate or reliable. Large language models (LLMs) such as ChatGPT have opened a promising avenue for patients to have their questions answered. Objective We aimed to assess the feasibility of using LLMs to generate relevant, accurate, helpful, and unharmful responses to laboratory test–related questions asked by patients and identify potential issues that can be mitigated using augmentation approaches. Methods We collected laboratory test result–related Q&amp;A data from Yahoo! Answers and selected 53 Q&amp;A pairs for this study. Using the LangChain framework and ChatGPT web portal, we generated responses to the 53 questions from 5 LLMs: GPT-4, GPT-3.5, LLaMA 2, MedAlpaca, and ORCA_mini. We assessed the similarity of their answers using standard Q&amp;A similarity-based evaluation metrics, including Recall-Oriented Understudy for Gisting Evaluation, Bilingual Evaluation Understudy, Metric for Evaluation of Translation With Explicit Ordering, and Bidirectional Encoder Representations from Transformers Score. We used an LLM-based evaluator to judge whether a target model had higher quality in terms of relevance, correctness, helpfulness, and safety than the baseline model. We performed a manual evaluation with medical experts for all the responses to 7 selected questions on the same 4 aspects. Results Regarding the similarity of the responses from 4 LLMs; the GPT-4 output was used as the reference answer, the responses from GPT-3.5 were the most similar, followed by those from LLaMA 2, ORCA_mini, and MedAlpaca. Human answers from Yahoo data were scored the lowest and, thus, as the least similar to GPT-4–generated answers. The results of the win rate and medical expert evaluation both showed that GPT-4’s responses achieved better scores than all the other LLM responses and human responses on all 4 aspects (relevance, correctness, helpfulness, and safety). LLM responses occasionally also suffered from lack of interpretation in one’s medical context, incorrect statements, and lack of references. Conclusions By evaluating LLMs in generating responses to patients’ laboratory test result–related questions, we found that, compared to other 4 LLMs and human answers from a Q&amp;A website, GPT-4’s responses were more accurate, helpful, relevant, and safer. There were cases in which GPT-4 responses were inaccurate and not individualized. We identified a number of ways to improve the quality of LLM responses, including prompt engineering, prompt augmentation, retrieval-augmented generation, and response evaluation.",
    "full_text": null
}