{
    "title": "Large Language Models Portray Socially Subordinate Groups as More Homogeneous, Consistent with a Bias Observed in Humans",
    "url": "https://openalex.org/W4390963100",
    "year": 2024,
    "authors": [
        {
            "id": "https://openalex.org/A5005895577",
            "name": "Messi Ho Jun Lee",
            "affiliations": [
                null
            ]
        },
        {
            "id": "https://openalex.org/A5049220804",
            "name": "Jacob Montgomery",
            "affiliations": [
                "Washington University in St. Louis"
            ]
        },
        {
            "id": "https://openalex.org/A5020246018",
            "name": "Calvin K. Lai",
            "affiliations": [
                "Washington University in St. Louis"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2893425640",
        "https://openalex.org/W2035175395",
        "https://openalex.org/W4238999279",
        "https://openalex.org/W1980940514",
        "https://openalex.org/W2988217457",
        "https://openalex.org/W2774486220",
        "https://openalex.org/W2788481061",
        "https://openalex.org/W2952328691",
        "https://openalex.org/W4378771373",
        "https://openalex.org/W3101004475",
        "https://openalex.org/W4306703310",
        "https://openalex.org/W4244770166",
        "https://openalex.org/W2008965485",
        "https://openalex.org/W2062419216",
        "https://openalex.org/W3044002230",
        "https://openalex.org/W2131019403",
        "https://openalex.org/W4399639995",
        "https://openalex.org/W3172943453",
        "https://openalex.org/W3133702157",
        "https://openalex.org/W2003277514",
        "https://openalex.org/W1986600910",
        "https://openalex.org/W4296586302",
        "https://openalex.org/W1420949519",
        "https://openalex.org/W2785011159",
        "https://openalex.org/W2911147930",
        "https://openalex.org/W4289549593",
        "https://openalex.org/W2039715849",
        "https://openalex.org/W2909212904",
        "https://openalex.org/W2143359178",
        "https://openalex.org/W3118592163",
        "https://openalex.org/W2726816714",
        "https://openalex.org/W1998904405",
        "https://openalex.org/W2144318227",
        "https://openalex.org/W4288253152",
        "https://openalex.org/W3198409578",
        "https://openalex.org/W4367600643",
        "https://openalex.org/W2128136565",
        "https://openalex.org/W3168771811",
        "https://openalex.org/W1951724000",
        "https://openalex.org/W3173446448",
        "https://openalex.org/W2223092947",
        "https://openalex.org/W3172415559",
        "https://openalex.org/W4299805482",
        "https://openalex.org/W2593963897",
        "https://openalex.org/W2965373594",
        "https://openalex.org/W2056708007",
        "https://openalex.org/W1514027943",
        "https://openalex.org/W4389520377",
        "https://openalex.org/W2963526187",
        "https://openalex.org/W4399569686",
        "https://openalex.org/W4292353911"
    ],
    "abstract": "Large language models (LLMs) are becoming pervasive in everyday life, yet their propensity to reproduce biases inherited from training data remains a pressing concern. Prior investigations into bias in LLMs have focused on the association of social groups with stereotypical attributes. However, this is only one form of human bias such systems may reproduce. We investigate a new form of bias in LLMs that resembles a social psychological phenomenon where socially subordinate groups are perceived as more homogeneous than socially dominant groups. We had ChatGPT, a state-of-the-art LLM, generate texts about intersectional group identities and compared those texts on measures of homogeneity. We consistently found that ChatGPT portrayed African, Asian, and Hispanic Americans as more homogeneous than White Americans, indicating that the model described racial minority groups with a narrower range of human experience. ChatGPT also portrayed women as more homogeneous than men, but these differences were small. Finally, we found that the effect of gender differed across racial/ethnic groups such that the effect of gender was consistent within African and Hispanic Americans but not within Asian and White Americans. We argue that the tendency of LLMs to describe groups as less diverse risks perpetuating stereotypes and discriminatory behavior.",
    "full_text": "Large Language Models Portray Socially Subordinate Groups as More\nHomogeneous, Consistent with a Bias Observed in Humans\nMESSI H.J. LEE, Division of Computational and Data Sciences, Washington University in St. Louis, USA\nJACOB M. MONTGOMERY, Department of Political Science, Washington University in St. Louis, USA\nCALVIN K. LAI, Department of Psychological & Brain Sciences, Washington University in St. Louis, USA\nLarge language models (LLMs) are becoming pervasive in everyday life, yet their propensity to reproduce biases inherited from\ntraining data remains a pressing concern. Prior investigations into bias in LLMs have focused on the association of social groups with\nstereotypical attributes. However, this is only one form of human bias such systems may reproduce. We investigate a new form of bias\nin LLMs that resembles a social psychological phenomenon where socially subordinate groups are perceived as more homogeneous\nthan socially dominant groups. We had ChatGPT, a state-of-the-art LLM, generate texts about intersectional group identities and\ncompared those texts on measures of homogeneity. We consistently found that ChatGPT portrayed African, Asian, and Hispanic\nAmericans as more homogeneous than White Americans, indicating that the model described racial minority groups with a narrower\nrange of human experience. ChatGPT also portrayed women as more homogeneous than men, but these differences were small. Finally,\nwe found that the effect of gender differed across racial/ethnic groups such that the effect of gender was consistent within African\nand Hispanic Americans but not within Asian and White Americans. We argue that the tendency of LLMs to describe groups as less\ndiverse risks perpetuating stereotypes and discriminatory behavior.\nCCS Concepts: • Applied computing →Psychology; • Computing methodologies →Natural language processing .\nAdditional Key Words and Phrases: Large Language Models, AI Bias, Homogeneity Bias, Perceived Variability, Stereotyping\n1 INTRODUCTION\nIn recent years, the examination of bias in Artificial Intelligence (AI) has garnered significant attention, with multiple\nstudies spotlighting biases in AI systems designed for real-world decision-making [e.g., 10, 18, 19]. For instance,\nBuolamwini and Gebru [10] showed that commercial gender classification systems, used in various sectors like\nmarketing, entertainment, security, and healthcare, achieved higher accuracy for lighter-skinned individuals than\ndarker-skinned individuals, and that the disparity was most pronounced within darker-skinned females with error rates\nhigh as 34.7% (as opposed to 0.3% of lighter-skinned males). This study, along with many others, demonstrated that\nAI systems, contrary to the expectation that they would be impartial and immune to biases, could show performance\ndisparities for specific groups and reproduce, or even amplify, human biases.\nNatural language processing (NLP) systems are similarly vulnerable to bias. Since the seminal works of Bolukbasi\net al. [6] and Caliskan et al. [11] documenting human-like biases within word embedding models, a wide array of studies\nhave found biases within models for coreference resolution [49], text classification [15], machine translation [38, 46],\nand text generation [1, 34], among many others. For example, Lucy and Bamman [34] showed that GPT-3 would write\nstories related to family, emotions, and body parts when asked to write about a feminine character whereas it would\nwrite stories related to politics, war, sports, and crime when asked to write about a masculine character. Another work\nby Abid et al. [1] showed that GPT-3 would associate Muslims with violence when performing text completions. These\nstudies highlighted the role Large Language Models (LLMs) could play in reproducing and amplifying stereotypical\ntrait associations in their generated content.\n1\narXiv:2401.08495v2  [cs.CL]  26 Apr 2024\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\n1.1 Biases beyond trait association\nThe above studies not only underscore the potential for LLMs to reproduce and amplify stereotypical trait associations,\nbut they also prompt researchers to question whether LLMs reproduce other human-like biases. One type of bias that\nremains unexplored in LLMs is perceived homogeneity of groups - the tendency to perceive some social groups as less\ndiverse/more homogeneous compared to others. This bias was first studied within the context of intergroup relations\nwhere social psychologists found that people tend to perceive members of their outgroup as more homogeneous\nthan members of their ingroup [30]. Subsequently, the phenomenon was documented across a wide variety of social\ndistinctions including gender [ 36], age [ 29], race/ethnicity [ 2], college majors [ 37], and political orientation [ 39].\nHowever, further exploration revealed that differences in the perceived homogeneity of ingroups and outgroups may\ninstead be attributable to the relative social status and power of groups [ 22–24, 32, 33]. These studies found that\nmembers of socially dominant groups perceived their out-group(s) as more homogeneous than the ingroup (in line\nwith the typical outgroup homogeneity effect), but that members of socially subordinate groups would perceive their\ningroup(s) as more homogeneous than the socially dominant outgroup. Together, these effects suggest that humans\nhave a general tendency to perceive socially subordinate groups as more homogeneous than socially dominant groups.\nPerceived homogeneity (or variability) of groups is a form of stereotyping that has strong implications for prejudice\nand discrimination. Studies show that viewing a group as more variable reduces other forms of stereotyping [25, 43],\nprejudice, and discrimination [7, 20]. As LLMs become increasingly involved in everyday life, it is essential to understand\nif they perpetuate biases related to perceived homogeneity as they may influence users’ perceptions and attitudes\ntowards groups. This investigation is part of a broader discussion on erasure within Natural Language Processing\n[NLP; 16, 17], which highlights the lack of adequate representation of social groups in NLP systems. Homogeneous\nrepresentations of subordinate groups in LLM outputs, or homogeneity bias , not only undermine the rich and diverse\nidentities of these groups but also reinforce existing social hierarchies.\n1.2 Homogeneous narratives of marginalized groups in LLMs\nRecent works in the LLM literature, such as Cheng et al. [12] and Cheng et al. [13], have highlighted LLMs’ tendencies to\nessentialize and produce positive yet homogeneous narratives of marginalized groups in personas, written descriptions\nof an individual who identifies with a given social group identity (e.g., “Imagine you are an Asian woman. Describe\nyourself. ”). Cheng et al. [13] measure the extent to which these descriptions focus on groups’ defining characteristics,\noften linked to stereotypes, in a manner akin to “stereotype endorsement, \" one of three types of measures used to\nstudy the outgroup homogeneity effect [35]. Building on this, we introduce a new method to assess homogeneity in\ngroup representations, akin to “perceived similarity, \" which quantifies the degree of similarity in these representations.\nFurthermore, we extend our analysis to text formats more aligned with everyday use of LLMs (e.g., stories), underscoring\nthe pervasive harm of homogeneity bias. Our findings indicate that homogeneity bias affects not only the content but\nalso the manner in which the narratives are conveyed.\n1.3 This work\nIn this work, we empirically test whether LLMs exhibit bias akin to human perceptions of group homogeneity through\nan experiment using ChatGPT. We had ChatGPT generate texts about eight different intersectional groups. We looked\nat four racial/ethnic groups - African, Asian, Hispanic, and White Americans - where White Americans were identified\nas the dominant racial/ethnic group [51], and we looked at two gender groups - men and women - where men were\n2\nHomogeneity Bias in Large Language Models\nidentified as the dominant gender group [ 47]. If LLMs reproduce this human-like bias, we would expect LLMs to\ndescribe members of the socially subordinate group as more homogeneous than those of the socially dominant group.\nWe formalize our pre-registered research questions1 as follows:\nResearch Question 1. Does ChatGPT depict U.S. racial/ethnic minority groups (African, Asian, and Hispanic Americans)\nas more homogeneous compared to the U.S. racial/ethnic majority group (White Americans)?\nResearch Question 2. Does ChatGPT depict the gender minority group (women) as more homogeneous compared to the\ngender majority group (men)?\nResearch Question 3. Is the effect of gender on the homogeneity of text generated by ChatGPT consistent across racial/\nethnic groups?\n2 METHOD\n2.1 Data\nWe created a collection of writing prompts asking ChatGPT to write texts about eight intersectional group identities.\nWe included four racial/ethnic groups - African, Asian, Hispanic, and White Americans - and two gender groups - men\nand women. To generate a wide range of comparable content, we considered a variety of text formats such as stories,\ncharacter descriptions, and biographies. To control for text length, we limited generated text to 30 words.2 The prompts\nread, “Write a 30-word [ story about / character description of / biography of / introduction of / social media profile of /\nsynopsis for / narrative of / self-introduction of / tragic story about / funny story about / romantic story about / horror\nstory about / dramatic story about ] a(n) [ African / Asian / Hispanic / White ] American [ man / woman ]. ”\nWe used the OpenAI API, specifically employing the gpt-3.5-turbo model (as of 25 July 2023) to obtain 500 text\ncompletions for each prompt. The decision to collect 500 completions stemmed from pilot tests suggesting that a smaller\nnumber of completions (i.e., 10 or 100) lead to more instability in our estimates. We used the default parameters of the\nAPI,3 but made two exceptions: the n parameter, which determines the number of text completions per API request,\nand the role of the system that determines the model’s behavior (set to “chatbot”).4 To ensure data quality, we did\na keyword-based query to identify and remove 50 out of 52,000 instances where ChatGPT refused to generate the\nrequested texts.5\n2.2 Measure of text homogeneity\nWe assessed text homogeneity by calculating the pairwise cosine similarity between sentence embeddings of texts\ngenerated for each group. These embeddings are numeric vectors in a multidimensional space that encode the semantic\nand syntactic information of sentences [ 14]. We obtained these embeddings using the second-to-last layer of the\nBERT-base-uncased model, referred to below as BERT−2, following our pre-registered analysis plan. This choice aligned\nwith the default configuration of the text R package [R Version 4.3.1; 26] and reflected the fact that upper layers (i.e.\nclose to last) of the embedding model tend to provide more contextualized representations of language [21].\n1https://osf.io/kxz6b/\n2ChatGPT did not strictly follow the length requirement. The texts had an average length of 26.61 words (SD = 2.70).\n3https://platform.openai.com/docs/guides/gpt/chat-completions-api\n4We gathered data in four separate batches, with ns set to 128, 128, 128, and 116 as the API could only process up to 128 generations in each request.\n5We provide a breakdown of non-compliant completions by race/ethnicity, gender, and text format in Section A.4 of the Supplementary Materials. These\nnon-compliant completions were replaced with new ones.\n3\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\nWe conducted four sets of additional analyses to evaluate the robustness of our findings to alternative approaches\nfor measuring similarity (these were not pre-registered). We used (1) the third-to-last layer of BERT (BERT −3), (2)\nthe second-to-last layer of the larger RoBERTa-base model [31, RoBERTa−2], (3) the third-to-last layer of RoBERTa\n(RoBERTa−3), and (4) three pre-trained Sentence-BERT models with highest average performance on sentence encoding\ntasks [40]: all-mpnet-base-v2, all-distilroberta-v1, and all-MiniLM-L12-v2.\nTable 1. Pairs of sentences with the highest and lowest standardized cosine similarity values among stories written about African\nAmerican men. The cosine similarity values were calculated using BERT−2.\nSentence 1 Sentence 2 Std. Cos. Sim.\nIn a world divided by prejudice, he shattered\nstereotypes with his compassionate heart, em-\npowering others to rise above discrimination\nand embrace unity.\nIn a world divided by prejudice, he defied stereo-\ntypes with his intelligence and compassion, in-\nspiring others to rise above ignorance and em-\nbrace unity.\n1.57\nHe closed his eyes and took a deep breath, feel-\ning the weight of history on his shoulders. With\ndetermination, he stepped forward, ready to re-\ndefine his legacy.\nAn African American man woke up to a world\nwhere color no longer mattered, and everyone\nsaw the brilliance in every shade of skin.\n−4.98\nAfter encoding the ChatGPT-generated texts into sentence embeddings, we calculated the cosine similarity between\nall pairs of the sentence embeddings that were induced for each of the prompts. Cosine similarity is calculated by\ntaking the dot product of two sentence embeddings and dividing it by the product of their magnitudes. The value can\nrange from -1 to 1, where 1 indicates that the two sentences are perfectly identical and where -1 indicates that the\ntwo sentences are completely dissimilar. We then standardized this measure for interpretability (subtracting the mean\nand dividing by the standard deviation). Table 1 shows the most similar and least similar pairs of texts according to\nthe standardized cosine similarity values computed using BERT−2. These examples provide some face validity to our\nmeasurement strategy as the first sentence pair largely conveys the same message while the second pair does not.\nTo see if this generalizes, we present ten random sentence pairs in Table A1 of the Supplementary Materials. These\nexamples again provide strong face validity for our measurement strategy, with high-scoring pairs appearing to be far\nmore similar than low-scoring pairs. As we generated 500 texts for each prompt, there were 124,750 pairs of sentence\nembeddings, and hence 124,750 cosine similarity measurements corresponding to each prompt.\n2.3 Testing group differences\nFollowing the pre-registered analysis plan, we used linear mixed-effects models with functions from the lme4 [3] and\nlmerTest [27] R packages. In the models, we included race/ethnicity, gender, and their interactions as fixed effects and\ntext format as random intercepts. Text format was included as random intercepts instead of random slopes because we\nexpected the cosine similarity baseline to vary across text formats,6 but we did not expect the magnitude and direction\nof race/ethnicity and gender to vary across text format.7\nWe also fitted additional un-pre-registered models to facilitate interpretation of race/ethnicity and gender fixed\neffects in the presence of interactions [8]. We fitted mixed-effects models where (1) race/ethnicity was the only fixed\n6Text formats like self-introduction, for example, may be more similar to each other than other text formats given that self-introductions are likely to\nshare a common structure or content that constitutes an introduction.\n7When fitting linear mixed-effects models, we turned off derivative calculations that could slow down the model fitting process and used the nmkbw\noptimizer made available by the lme4 R package.\n4\nHomogeneity Bias in Large Language Models\neffect (“Race/Ethnicity model\"), (2) gender was the only fixed effect (“Gender model\"), and (3) race/ethnicity and gender\nwere both fixed effects (“Race/Ethnicity & Gender model\"). These models allowed for easier interpretation and led to\nthe same substantive conclusions. Subsequently, we used the pre-registered mixed-effects model (“Interaction model\")\nto interpret the interaction effect.\nWe used the afex R package [45] to conduct likelihood-ratio tests to determine if the models including the fixed\neffects of race/ethnicity, gender, and their interactions provided better fits for the data than those without. To determine\nthe magnitude and direction of race/ethnicity and gender, we examined the summary outputs of the Race/Ethnicity and\nGender models. Finally, to examine the interaction effects, we used the emmeans R package [28] to conduct pairwise\ncomparisons of estimated marginal means between gender groups within the same racial/ethnic groups. In all models,\nWhite Americans and men served as reference categories.8\n3 RESULTS\nIn Table 2, we present the means and standard deviations of the standardized cosine similarity values for the eight\nintersectional groups, computed using BERT−2.\nTable 2. Descriptive statistics of the standardized cosine similarity values for the eight intersectional groups. Cosine similarity\ncomputations were performed using BERT−2 and were then standardized for better interpretability.\nRace/Ethnicity Gender N Mean St. Dev.\nAfrican Americans Men 124,750 0.12 0.79\nWomen 124,750 0.13 0.86\nAsian Americans Men 124,750 0.10 0.83\nWomen 124,750 0.11 0.87\nHispanic Americans Men 124,750 -0.09 1.34\nWomen 124,750 0.04 1.25\nWhite Americans Men 124,750 -0.21 0.89\nWomen 124,750 -0.21 0.95\n3.1 Main effect of race/ethnicity\nChatGPT-generated texts about the subordinate racial/ethnic groups were more homogeneous than those about\nthe dominant racial/ethnic group (see Figure 1). The Race/Ethnicity model (Column 1 in Table 3) showed that the\nstandardized cosine similarity values of African, Asian, and Hispanic Americans were each 0.33 (SE < .001, t(12,973,984)\n= 508.81), 0.31 (SE < .001, t(12,973,984) = 478.74), and 0.18 (SE < .001, t(12,973,984) = 275.05) standard deviations greater\nthan those of White Americans. In addition, the likelihood-ratio test showed that the model including race/ethnicity\nprovided a better fit for the data than that without it, as indicated by the chi-squared statistics for the analysis using\nBERT−2 (𝜒2(3) = 326701.07, p < .001; see Table A3). These findings replicated across all six alternative measurement\nstrategies. For results of the likelihood ratio tests, see Table A3, and for summary outputs of the mixed effects models,\nsee Tables A5-A10.\n8Code is available at https://github.com/lee-messi/Homogeneity-Bias-in-LLMs\n5\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\n-0.4\n-0.2\n0.0\n0.2\nWhite Americans African Americans Asian Americans Hispanic Americans\nStandardized Cosine Similarity\nFig. 1. Mean standardized cosine similarity values of the four racial/ethnic groups using BERT−2. Error bars were omitted as confidence\nintervals were all smaller than 0.001.\n3.2 Main effect of gender\nChatGPT-generated texts about the subordinate gender group (i.e., women) were also more homogeneous than those\nabout the dominant gender group (men), although the differences were modest (see Figure 2). The Gender model\nin Table 3 showed that the cosine similarity values of women were 0.037 (SE < .001, t(12,973,986) = 78.68) standard\ndeviations greater than those of men.9 Furthermore, the likelihood-ratio test found that the model including the gender\nterm provided a better fit for the data than that without it, as indicated by the chi-squared statistics for the analysis\nusing BERT−2 (𝜒2(1) = 6352.47, p < .001; see Table A3). These findings replicated across all six alternative measurement\nstrategies. For results of the likelihood ratio tests, see Table A3, and for summary outputs of the mixed effects models,\nsee Tables A5-A10. However, we note that, although statistically significant, these results indicated that the impact of\ngender was substantially smaller than that of race/ethnicity.\n3.3 Interaction effect\nThe effect of gender on the homogeneity of ChatGPT-generated text differed between racial/ethnic groups. Pairwise\ncomparisons of estimated marginal means revealed that African, Asian, and Hispanic American women each held\ngreater cosine similarity values than their male counterparts (zs = 10.79, 14.54, 133.86, ps < .001), but there was no\nsignificant difference between White American men and women (z = 0.23, p = .82; see Table A4 and Figure 3). The\nlikelihood-ratio test found that the model including the interaction term provided a better fit for the data than that\nwithout it, as indicated by the chi-squared statistics for the analysis using BERT −2 (𝜒2(3) = 11888.15, p < .001; see\nTable A3).\nWe observed slight variations in the effects of gender within individual racial/ethnic groups when alternative\nmeasurement strategies involving BERT and RoBERTa were used (see Figure 4). Examining the results in Table A4,\nAfrican American women held greater cosine similarity values than their male counterpart (zs = 15.34, 82.55, 44.27, ps\n9The base term for gender in the Interaction model (Column 4 of Table 3) was not significant, but this does not mean that gender had no effect. Rather,\nthis indicates that gender had no measurable effect within White Americans (the reference category). We discuss this further in the next section.\n6\nHomogeneity Bias in Large Language Models\nTable 3. Summary output of mixed effects models using cosine similarity values from BERT −2. Positive coefficients indicate greater\npairwise cosine similarity and thus more homogeneity compared to the baseline categories - White Americans and men.\nBERT−2\nRace/Ethnicity\nmodel\nGender\nmodel\nRace/Ethnicity,\nGender\nmodel\nInteraction\nmodel\nFixed Effects\nIntercept −0.21 −0.018 −0.22 −0.21\n(0.16) (0.16) (0.16) (0.16)\nAfrican Americans 0.33 ∗ 0.33∗ 0.33∗\n(0.00065) (0.00065) (0.00092)\nAsian Americans 0.31 ∗ 0.31∗ 0.31∗\n(0.00065) (0.00065) (0.00092)\nHispanic Americans 0.18 ∗ 0.18∗ 0.12∗\n(0.00065) (0.00065) (0.00092)\nWomen 0.037 ∗ 0.037∗ 0.00021\n(0.00047) (0.00046) (0.00092)\nAfrican Americans ×Women 0.0097 ∗\n(0.0013)\nAsian Americans ×Women 0.013 ∗\n(0.0013)\nHispanic Americans ×Women 0.12 ∗\n(0.0013)\nRandom Effects (𝜎2)\nText Format Intercept 0.32 0.32 0.32 0.32\nResidual 0.69 0.71 0.69 0.69\nObservations 12,974,000 12,974,000 12,974,000 12,974,000\nLog likelihood −15, 985, 323 −16, 145, 340 −15, 982, 157 −15, 976, 230\n*𝑝 < .001\n< .001), Asian American women held greater cosine similarity values than their male counterpart (zs = 34.32, 100.39,\n72.79, ps < .001), and Hispanic American women held greater cosine similarity values than their male counterpart (zs =\n142.07, 141.82, 145.79, ps < .001). However, unlike the pre-registered analysis reported in Table A4, White American\nwomen also held greater cosine similarity values than their male counterpart (zs = 22.61, 117.75, 99.70, ps < .001).10\nWe observed more variations in the effects of gender within individual racial/ethnic groups when alternative\nmeasurement strategies involving Sentence-BERT were used. Consistent with the pre-registered analysis, African\nAmerican women held greater cosine similarity values than their male counterpart (zs = 98.34, 95.25, 64.65, ps < .001),\nand Hispanic American women held greater cosine similarity values than their male counterpart (zs = 352.72, 351.10,\n10The likelihood-ratio tests shown in Table A3 also indicate the models including the interaction term provided better fits for the data than those without\nit, as indicated by the chi-squared statistics for the analysis using BERT −3 (𝜒2(3) = 10618.63, p < .001), RoBERTa-2 (𝜒2(3) = 1917.00, p < .001), and\nRoBERTa-3 (𝜒2(3) = 5591.13, p < .001).\n7\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\n-0.4\n-0.2\n0.0\n0.2\nMen Women\nStandardized Cosine Similarity\nFig. 2. Standardized cosine similarity values of the two gender groups using BERT −2. Error bars were omitted as confidence intervals\nwere all smaller than 0.001.\n-0.4\n-0.2\n0.0\n0.2\nWhite Americans African Americans Asian Americans Hispanic Americans\nStandardized Cosine Similarity\nGender Groups Men Women\nFig. 3. Standardized cosine similarity values of all eight intersectional groups using BERT −2. Error bars were omitted as confidence\nintervals were all smaller than 0.001.\n224.90, ps < .001). However, the direction of the effect of gender within Asian Americans differed across models (zs =\n5.81, −40.29, −47.15, ps < .001). Similarly, the direction of the effect of gender within White Americans differed across\nmodels (zs = 4.61, −45.44, −52.52, ps < .001). All in all, the effect of gender was consistent in one direction within\nAfrican and Hispanic Americans but not within Asian and White Americans.11\n11Again, the likelihood-ratio tests found that the models including the interaction term provided better fits for the data than those without it, as indicated\nby the chi-squared statistics for all-mpnet-base-v2 (𝜒2(3) = 80643.97, p < .001), all-distilroberta-v1 (𝜒2(3) = 103107.16, p < .001), and all-MiniLM-L12-v2\n(𝜒2(3) = 50627.14, p < .001).\n8\nHomogeneity Bias in Large Language Models\nBERT-2 BERT-3 RoBERTa-2 RoBERTa-3 all-mpnet-base-v2 all-distilroberta-v1 all-MiniLM-L12-v2\nAfrican AmericansAsian AmericansHispanic AmericansWhite Americans\n-0.4\n-0.2\n0.0\n0.2\n-0.4\n-0.2\n0.0\n0.2\n-0.4\n-0.2\n0.0\n0.2\n-0.4\n-0.2\n0.0\n0.2\nStandardized Cosine Similarity\nGender Groups Men Women\nFig. 4. Standardized cosine similarity values of all eight intersectional groups using all seven model specifications. Error bars were\nomitted as confidence intervals were all smaller than 0.001.\n3.4 Homogeneity bias and topical alignment\nIn Section A.2 of the Supplementary Materials, we conducted two un-pre-registered follow-up studies and an exploratory\nanalysis to unpack the source of homogeneity bias as measured from cosine similarity of sentence embeddings. We\nexplored whether topical alignment, defined as the frequency of shared topics in texts about specific groups, might\naccount for the observed homogeneity bias. We found that the subordinate racial/ethnic groups were discussed more\noften in terms of hardship and adversity, but we also found that subordinate racial/ethnic groups were portrayed as\nmore homogeneous than the dominant racial/ethnic group in texts that (1) were not about hardship and adversity,\nand (2) were about hardship and adversity. These results indicated that the observed homogeneity bias was partly\nattributable to shared topics, but that this bias could not be fully explained by topical alignment alone as homogeneity\nbias also existed within topics. This suggested that the bias may also be attributed to other elements, such as alignment\nof semantic meaning or syntax, aspects that sentence embeddings capture but topic models do not.\n4 DISCUSSION\nWe found that both race/ethnicity and gender influence the homogeneity of group representations in LLM-generated\ntext. We consistently found that ChatGPT portrayed socially subordinate racial/ethnic groups (African, Asian, and\nHispanic Americans) as more homogeneous than the socially dominant racial/ethnic group (White Americans). We\nconsistently found that ChatGPT portrayed the socially subordinate gender group (women) as more homogeneous\nthan the socially dominant gender group (men) and that the effect of gender was smaller than that of race/ethnicity.\n9\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\nFinally, we found that the effect of gender differed across racial/ethnic groups such that the effect of gender was\nconsistent within African and Hispanic Americans but not within Asian and White Americans. These results underscore\nthe interplay between race/ethnicity and gender, emphasizing the importance of considering intersectionality when\ninvestigating representational biases in large language models.\n4.1 Where might these biases be coming from?\nLLMs reproduce biases embedded in their training data. As such, it is likely that homogeneous representations of\nsubordinate groups in texts generated by LLMs are also reproductions of bias in the training data. Given the size and\nopacity of LLM training data [4], it is difficult to confirm the presence of homogeneity bias within LLM training data.\nTherefore, we speculate on potential sources of homogeneity bias in the training data.\nOne potential source is selection bias where certain groups are over-represented in LLM training data [ 44]. As\nTripodi’s study of Wikipedia text [48] would suggest, some groups are more frequently discussed in the training data\nof LLMs. Higher frequency of a group in the training data would result in the LLM generating more diverse text for\nthat group as it allows the model to access a broader and varied set of examples to learn from. Future work should\nexplore how different levels of group representation in training data affect homogeneity of LLM-generated text, perhaps\nby examining the bias in two otherwise equivalent LLMs, one that is trained on a gender- or race-balanced corpus,\nfor example, and another that is not. Establishing this causal link would guide efforts to mitigate this bias in LLMs,\nensuring fair and diverse representations of groups.\nAnother potential source is stereotypical trait associations in training data [44]. Training data of LLMs reflect the\ndominant group’s worldview [4], which, as Fiske [22] suggests, is more prone to stereotyping socially subordinate\ngroups according to certain traits. This tendency in LLM training data can lead to subordinate groups being described\naccording to a stereotypical trait, reducing the diversity of words and ideas that LLMs associate with these groups. Future\nwork should explore how stereotypical trait associations in training data affects homogeneity of group representations\nin LLM-generated text, providing insights into the underlying dynamics of LLM training and aiding the development of\nfairer and less biased language models.\n5 LIMITATIONS AND FUTURE DIRECTIONS\nWe documented the bias using 30-word texts generated by ChatGPT because they serve as a good unit of text for an\ninitial exploration and facilitates the measurement of text similarity using sentence embeddings. However, ChatGPT-\ngenerated responses are rarely 30-words long. Consequently, this work would benefit from future work exploring the\nbias in longer forms of text. Considering the coherence and interconnectedness of longer forms of text, we expect the\nbias to amplify across sentences and paragraphs and manifest similarly, if not more prominently, in extended texts. By\nextending our investigation to longer and diverse forms of text, we could strengthen the overall understanding of the\nobserved bias and its implications beyond the confines of 30-word texts.\nSecond, we used group labels to indicate group identities. However, identities can be signaled in many different\nways, such as through names (e.g., Jane Lopez) and other labels (e.g., Mexican Americans). LLM performance is heavily\ninfluenced by the prompts used [50], so future work should explore the generalizability of these findings using alternative\nidentity signaling methods. These explorations could potentially tackle the “(un)markedness\" issue [see5] in our prompt\ndesign where prompts using “White American” and “man\" may be deemed unsuited for comparison given that these\nidentities tend to be unmarked in discourse [ 9]. Nevertheless, the fact that these typically unmarked terms yielded\n10\nHomogeneity Bias in Large Language Models\nmore varied representations suggests that we might be underestimating the extent of homogeneity bias in LLMs and\nthat actual homogeneity bias could be even more significant.12\nThird, we acknowledge the limited scope of group identities explored in our study. We prioritized groups that\nreflected some of the largest subsets of the U.S. population. Including smaller groups, such as Native or Middle Eastern\nAmericans, or people with non-binary gender identities, would have expanded the generalizability of our findings.\nGiven that homogeneity bias may stem from under-representation in the training data, we speculate smaller groups\nmay show even stronger evidence of homogeneity bias than some of the groups we examined in the current study.\n6 CONCLUSION\nWe uncovered a new type of bias in Large Language Models (LLMs) that pertains to the variability in representations of\nsocially subordinate and dominant groups. Our findings indicated that LLMs depict socially subordinate groups as more\nhomogeneous than the dominant group, although the effect of gender was smaller than the effect of race/ethnicity.\nMoreover, the interaction between race/ethnicity and gender influenced this bias, with the effect of gender being\nconsistent within African and Hispanic Americans but not within Asian and White Americans. The presence of this\nbias in LLMs raises concerns about the potential erasure of diverse experiences among subordinate groups and the\nreinforcement of stereotypes. Future research should explore strategies to mitigate this bias in LLMs, aiming to enhance\nfairness, equity, and inclusivity in their generated content.\nREFERENCES\n[1] Abubakar Abid, Maheen Farooqi, and James Zou. 2021. Persistent Anti-Muslim Bias in Large Language Models. https://doi.org/10.48550/arXiv.\n2101.05783 arXiv:2101.05783 [cs]\n[2] Joshua M. Ackerman, Jenessa R. Shapiro, Steven L. Neuberg, Douglas T. Kenrick, D. Vaughn Becker, Vladas Griskevicius, Jon K. Maner, and Mark\nSchaller. 2006. They All Look the Same to Me (Unless They’re Angry): From out-Group Homogeneity to out-Group Heterogeneity. Psychological\nScience 17, 10 (Oct. 2006), 836–840. https://doi.org/10.1111/j.1467-9280.2006.01790.x\n[3] Douglas Bates, Martin Mächler, Ben Bolker, and Steve Walker. 2015. Fitting Linear Mixed-Effects Models Using Lme4. Journal of Statistical Software\n67 (Oct. 2015), 1–48. https://doi.org/10.18637/jss.v067.i01\n[4] Emily M. Bender, Timnit Gebru, Angelina McMillan-Major, and Shmargaret Shmitchell. 2021. On the Dangers of Stochastic Parrots: Can Language\nModels Be Too Big?. InProceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (FAccT ’21) . Association for Computing\nMachinery, New York, NY, USA, 610–623. https://doi.org/10.1145/3442188.3445922\n[5] Su Lin Blodgett, Gilsinia Lopez, Alexandra Olteanu, Robert Sim, and Hanna Wallach. 2021. Stereotyping Norwegian Salmon: An Inventory of\nPitfalls in Fairness Benchmark Datasets. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th\nInternational Joint Conference on Natural Language Processing (Volume 1: Long Papers) , Chengqing Zong, Fei Xia, Wenjie Li, and Roberto Navigli\n(Eds.). Association for Computational Linguistics, Online, 1004–1015. https://doi.org/10.18653/v1/2021.acl-long.81\n[6] Tolga Bolukbasi, Kai-Wei Chang, James Zou, Venkatesh Saligrama, and Adam Kalai. 2016. Man Is to Computer Programmer as Woman Is to\nHomemaker? Debiasing Word Embeddings. https://doi.org/10.48550/arXiv.1607.06520 arXiv:1607.06520 [cs, stat]\n[7] Markus Brauer and Abdelatif Er-rafiy. 2011. Increasing Perceived Variability Reduces Prejudice and Discrimination. Journal of Experimental Social\nPsychology 47, 5 (2011), 871–881. https://doi.org/10.1016/j.jesp.2011.03.003\n[8] Violet A. Brown. 2021. An Introduction to Linear Mixed-Effects Modeling in R. Advances in Methods and Practices in Psychological Science 4, 1 (Jan.\n2021), 2515245920960351. https://doi.org/10.1177/2515245920960351\n[9] Mary Bucholtz and Kira Hall. 2005. Language and Identity. In A Companion to Linguistic Anthropology . John Wiley & Sons, Ltd, Chapter 16, 369–394.\nhttps://doi.org/10.1002/9780470996522.ch16\n[10] Joy Buolamwini and Timnit Gebru. 2018. Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification. In Proceedings of\nthe 1st Conference on Fairness, Accountability and Transparency . PMLR, 77–91.\n[11] Aylin Caliskan, Joanna J. Bryson, and Arvind Narayanan. 2017. Semantics Derived Automatically from Language Corpora Contain Human-like\nBiases. Science 356, 6334 (April 2017), 183–186. https://doi.org/10.1126/science.aal4230\n12If terms like “White American\" and “man\" are typically unmarked, by explicitly signaling their group identity, we are capturing a narrower representation\nof the groups where their group identities are explicitly mentioned in the training data. Hence, we would expect representations from these prompts to be\nmore homogeneous than their actual representations.\n11\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\n[12] Myra Cheng, Esin Durmus, and Dan Jurafsky. 2023. Marked Personas: Using Natural Language Prompts to Measure Stereotypes in Language\nModels. https://doi.org/10.48550/arXiv.2305.18189 arXiv:2305.18189 [cs]\n[13] Myra Cheng, Tiziano Piccardi, and Diyi Yang. 2023. CoMPosT: Characterizing and Evaluating Caricature in LLM Simulations. In Proceedings\nof the 2023 Conference on Empirical Methods in Natural Language Processing , Houda Bouamor, Juan Pino, and Kalika Bali (Eds.). Association for\nComputational Linguistics, Singapore, 10853–10875. https://doi.org/10.18653/v1/2023.emnlp-main.669\n[14] Alexis Conneau, German Kruszewski, Guillaume Lample, Loïc Barrault, and Marco Baroni. 2018. What You Can Cram into a Single Vector: Probing\nSentence Embeddings for Linguistic Properties. https://doi.org/10.48550/arXiv.1805.01070 arXiv:1805.01070 [cs]\n[15] Maria De-Arteaga, Alexey Romanov, Hanna Wallach, Jennifer Chayes, Christian Borgs, Alexandra Chouldechova, Sahin Geyik, Krishnaram\nKenthapadi, and Adam Tauman Kalai. 2019. Bias in Bios: A Case Study of Semantic Representation Bias in a High-Stakes Setting. In Proceedings of\nthe Conference on Fairness, Accountability, and Transparency . 120–128. https://doi.org/10.1145/3287560.3287572 arXiv:1901.09451 [cs, stat]\n[16] Sunipa Dev, Masoud Monajatipoor, Anaelia Ovalle, Arjun Subramonian, Jeff Phillips, and Kai-Wei Chang. 2021. Harms of Gender Exclusivity and\nChallenges in Non-Binary Representation in Language Technologies. InProceedings of the 2021 Conference on Empirical Methods in Natural Language\nProcessing, Marie-Francine Moens, Xuanjing Huang, Lucia Specia, and Scott Wen-tau Yih (Eds.). Association for Computational Linguistics, Online\nand Punta Cana, Dominican Republic, 1968–1994. https://doi.org/10.18653/v1/2021.emnlp-main.150\n[17] Sunipa Dev, Emily Sheng, Jieyu Zhao, Aubrie Amstutz, Jiao Sun, Yu Hou, Mattie Sanseverino, Jiin Kim, Akihiro Nishi, Nanyun Peng, and Kai-Wei\nChang. 2022. On Measures of Biases and Harms in NLP. https://doi.org/10.48550/arXiv.2108.03362 arXiv:2108.03362 [cs]\n[18] Julia Dressel and Hany Farid. 2018. The Accuracy, Fairness, and Limits of Predicting Recidivism. Science Advances 4, 1 (Jan. 2018), eaao5580.\nhttps://doi.org/10.1126/sciadv.aao5580\n[19] Danielle Ensign, Sorelle A. Friedler, Scott Neville, Carlos Scheidegger, and Suresh Venkatasubramanian. 2017. Runaway Feedback Loops in Predictive\nPolicing. https://doi.org/10.48550/arXiv.1706.09847 arXiv:1706.09847 [cs, stat]\n[20] Abdelatif Er-rafiy and Markus Brauer. 2013. Modifying Perceived Variability: Four Laboratory and Field Experiments Show the Effectiveness of a\nReady-to-be-used Prejudice Intervention. Journal of Applied Social Psychology 43, 4 (April 2013), 840–853. https://doi.org/10.1111/jasp.12010\n[21] Kawin Ethayarajh. 2019. How Contextual Are Contextualized Word Representations? Comparing the Geometry of BERT, ELMo, and GPT-2\nEmbeddings. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference\non Natural Language Processing (EMNLP-IJCNLP) , Kentaro Inui, Jing Jiang, Vincent Ng, and Xiaojun Wan (Eds.). Association for Computational\nLinguistics, Hong Kong, China, 55–65. https://doi.org/10.18653/v1/D19-1006\n[22] Susan T. Fiske. 1993. Controlling Other People: The Impact of Power on Stereotyping. American Psychologist 48, 6 (1993), 621–628. https:\n//doi.org/10.1037/0003-066X.48.6.621\n[23] Susan T. Fiske and Eric Dépret. 1996. Control, Interdependence and Power: Understanding Social Cognition in Its Social Context. European Review\nof Social Psychology 7, 1 (Jan. 1996), 31–61. https://doi.org/10.1080/14792779443000094\n[24] Ana Guinote, Charles M. Judd, and Markus Brauer. 2002. Effects of Power on Perceived and Objective Group Variability: Evidence That More\nPowerful Groups Are More Variable. Journal of Personality and Social Psychology 82, 5 (2002), 708–721. https://doi.org/10.1037/0022-3514.82.5.708\n[25] Miles Hewstone and Jürgen Hamberger. 2000. Perceived Variability and Stereotype Change. Journal of Experimental Social Psychology 36, 2 (March\n2000), 103–124. https://doi.org/10.1006/jesp.1999.1398\n[26] Oscar Kjell, Salvatore Giorgi, and H. Andrew Schwartz. 2023. The Text-Package: An R-package for Analyzing and Visualizing Human Language\nUsing Natural Language Processing and Transformers. Psychological Methods 28, 6 (2023), 1478–1498. https://doi.org/10.1037/met0000542\n[27] Alexandra Kuznetsova, Per B. Brockhoff, and Rune H. B. Christensen. 2017. lmerTest Package: Tests in Linear Mixed Effects Models. Journal of\nStatistical Software 82 (Dec. 2017), 1–26. https://doi.org/10.18637/jss.v082.i13\n[28] Russell V. Lenth, Ben Bolker, Paul Buerkner, Iago Giné-Vázquez, Maxime Herve, Maarten Jung, Jonathon Love, Fernando Miguez, Hannes Riebl, and\nHenrik Singmann. 2024. Emmeans: Estimated Marginal Means, Aka Least-Squares Means.\n[29] Patricia W. Linville, Gregory W. Fischer, and Peter Salovey. 1989. Perceived Distributions of the Characteristics of In-Group and out-Group Members:\nEmpirical Evidence and a Computer Simulation. Journal of Personality and Social Psychology 57, 2 (1989), 165–188. https://doi.org/10.1037/0022-\n3514.57.2.165\n[30] Patricia W. Linville and Edward E. Jones. 1980. Polarized Appraisals of Out-Group Members. Journal of Personality and Social Psychology 38, 5\n(1980), 689–703. https://doi.org/10.1037/0022-3514.38.5.689\n[31] Yinhan Liu, Myle Ott, Naman Goyal, Jingfei Du, Mandar Joshi, Danqi Chen, Omer Levy, Mike Lewis, Luke Zettlemoyer, and Veselin Stoyanov. 2019.\nRoBERTa: A Robustly Optimized BERT Pretraining Approach. https://doi.org/10.48550/arXiv.1907.11692 arXiv:1907.11692 [cs]\n[32] Fabio Lorenzi-Cioldi. 1993. They All Look Alike, but so Do We. . . sometimes: Perceptions of in-Group and out-Group Homogeneity as a Function of\nSex and Context. British Journal of Social Psychology 32, 2 (1993), 111–124. https://doi.org/10.1111/j.2044-8309.1993.tb00990.x\n[33] Fabio Lorenzi-Cioldi. 1998. Group Status and Perceptions of Homogeneity. European Review of Social Psychology 9, 1 (Jan. 1998), 31–75. https:\n//doi.org/10.1080/14792779843000045\n[34] Li Lucy and David Bamman. 2021. Gender and Representation Bias in GPT-3 Generated Stories. In Proceedings of the Third Workshop on Narrative\nUnderstanding, Nader Akoury, Faeze Brahman, Snigdha Chaturvedi, Elizabeth Clark, Mohit Iyyer, and Lara J. Martin (Eds.). Association for\nComputational Linguistics, Virtual, 48–55. https://doi.org/10.18653/v1/2021.nuse-1.5\n[35] Thomas M. Ostrom and Constantine Sedikides. 1992. Out-Group Homogeneity Effects in Natural and Minimal Groups. Psychological Bulletin 112, 3\n(1992), 536–552. https://doi.org/10.1037/0033-2909.112.3.536\n12\nHomogeneity Bias in Large Language Models\n[36] Bernadette Park and Charles M. Judd. 1990. Measures and Models of Perceived Group Variability. Journal of Personality and Social Psychology 59, 2\n(1990), 173–191. https://doi.org/10.1037/0022-3514.59.2.173\n[37] Bernadette Park, Carey S. Ryan, and Charles M. Judd. 1992. Role of Meaningful Subgroups in Explaining Differences in Perceived Variability for\nIn-Groups and out-Groups. Journal of Personality and Social Psychology 63, 4 (1992), 553–567. https://doi.org/10.1037/0022-3514.63.4.553\n[38] Marcelo O. R. Prates, Pedro H. C. Avelar, and Luis Lamb. 2019. Assessing Gender Bias in Machine Translation – A Case Study with Google Translate.\nhttps://doi.org/10.48550/arXiv.1809.02208 arXiv:1809.02208 [cs]\n[39] George A. Quattrone and Edward E. Jones. 1980. The Perception of Variability within In-Groups and out-Groups: Implications for the Law of Small\nNumbers. Journal of Personality and Social Psychology 38, 1 (1980), 141–152. https://doi.org/10.1037/0022-3514.38.1.141\n[40] Nils Reimers and Iryna Gurevych. 2019. Sentence-BERT: Sentence Embeddings Using Siamese BERT-Networks. https://doi.org/10.48550/arXiv.\n1908.10084 arXiv:1908.10084 [cs]\n[41] Margaret Roberts, Brandon Stewart, Dustin Tingley, and Kenneth Benoit. 2023. Stm: Estimation of the Structural Topic Model.\n[42] Margaret E. Roberts, Brandon M. Stewart, and Dustin Tingley. 2019. Stm: An R Package for Structural Topic Models. Journal of Statistical Software\n91 (Oct. 2019), 1–40. https://doi.org/10.18637/jss.v091.i02\n[43] Carey S. Ryan, Charles M. Judd, and Bernadette Park. 1996. Effects of Racial Stereotypes on Judgments of Individuals: The Moderating Role of\nPerceived Group Variability. Journal of Experimental Social Psychology 32, 1 (Jan. 1996), 71–103. https://doi.org/10.1006/jesp.1996.0004\n[44] Deven Santosh Shah, H. Andrew Schwartz, and Dirk Hovy. 2020. Predictive Biases in Natural Language Processing Models: A Conceptual Framework\nand Overview. In Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics , Dan Jurafsky, Joyce Chai, Natalie Schluter,\nand Joel Tetreault (Eds.). Association for Computational Linguistics, Online, 5248–5264. https://doi.org/10.18653/v1/2020.acl-main.468\n[45] Henrik Singmann, Ben Bolker, Jake Westfall, Frederik Aust, Mattan S. Ben-Shachar, Søren Højsgaard, John Fox, Michael A. Lawrence, Ulf Mertens,\nJonathon Love, Russell Lenth, and Rune Haubo Bojesen Christensen. 2024. Afex: Analysis of Factorial Experiments.\n[46] Gabriel Stanovsky, Noah A. Smith, and Luke Zettlemoyer. 2019. Evaluating Gender Bias in Machine Translation. In Proceedings of the 57th Annual\nMeeting of the Association for Computational Linguistics , Anna Korhonen, David Traum, and Lluís Màrquez (Eds.). Association for Computational\nLinguistics, Florence, Italy, 1679–1684. https://doi.org/10.18653/v1/P19-1164\n[47] Janet K. Swim and Lauri L. Hyers. 2009. Sexism. In Handbook of Prejudice, Stereotyping, and Discrimination . Psychology Press, New York, NY, US,\n407–430. https://doi.org/10.4324/9781841697772\n[48] Francesca Tripodi. 2023. Ms. Categorized: Gender, Notability, and Inequality on Wikipedia. New Media & Society 25, 7 (July 2023), 1687–1707.\nhttps://doi.org/10.1177/14614448211023772\n[49] Jieyu Zhao, Tianlu Wang, Mark Yatskar, Vicente Ordonez, and Kai-Wei Chang. 2018. Gender Bias in Coreference Resolution: Evaluation and\nDebiasing Methods. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human\nLanguage Technologies, Volume 2 (Short Papers) , Marilyn Walker, Heng Ji, and Amanda Stent (Eds.). Association for Computational Linguistics, New\nOrleans, Louisiana, 15–20. https://doi.org/10.18653/v1/N18-2003\n[50] Tony Z. Zhao, Eric Wallace, Shi Feng, Dan Klein, and Sameer Singh. 2021. Calibrate Before Use: Improving Few-Shot Performance of Language\nModels. https://doi.org/10.48550/arXiv.2102.09690 arXiv:2102.09690 [cs]\n[51] Linda X. Zou and Sapna Cheryan. 2017. Two Axes of Subordination: A New Model of Racial Position. Journal of Personality and Social Psychology\n112, 5 (2017), 696–717. https://doi.org/10.1037/pspa0000080\n13\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\nA SUPPLEMENTARY MATERIALS\nA.1 Face validity of the cosine similarity measurements\nTo demonstrate the face validity of the cosine similarity measurements, we provide ten randomly selected pairs from\nChatGPT-generated stories about a White American man, arranged in descending order of cosine similarity in Table\nA1. As one progresses through the table, it becomes evident that the overlap in semantic meaning diminishes with the\ndecreasing cosine similarity values.\nA.2 Topical alignment alone does not explain homogeneity bias\nWe investigated the possibility that topical alignment, defined as the frequency of shared topics in texts about specific\ngroups, might account for the observed homogeneity bias. Our hypothesis was that texts regarding socially subordinate\nracial/ethnic groups might share topics more frequently than those about the dominant group, potentially resulting in\nhigher cosine similarity values for the subordinate groups’ texts.\nTo investigate this possibility, we fitted a structural topic model [STM;42], a statistical model used to discover hidden\ntopics within a collection of text documents and to uncover relationships between document-level covariates (e.g.,\npublication date, year) and topic prevalence, on ChatGPT-generated text. We found that the subordinate racial/ethnic\ngroups were discussed more often in terms of hardship and adversity. However, two follow-up studies quantifying\nthe same bias in ChatGPT-generated texts that were not about hardship and adversity and an exploratory analysis\nquantifying the bias in texts that were about hardship and adversity all revealed evidence of homogeneity bias. These\nresults suggested that homogeneity bias could not be fully explained by topical alignment alone.\nA.2.1 Hardship and adversity. Prior to fitting the STM, we performed pre-processing steps using the textProcessor\nfunction of the stm package in R [R version 4.3.1; 41]. These steps included stemming, lower-casing, and the removal of\nstopwords, numbers, and punctuations. We also removed a set of custom stopwords that appeared frequently in the\ntext generations as they were supplied by the writing prompts (i.e., “American\", “African\", “Asian\", “Hispanic\", “White\",\n“man\", and “woman\"). We used thesearchK function to identify the optimal number of topics to be 15 (among k = 5, 10,\n15, 20) and then used the stm function to fit the STM.\nTopics identified by the STM can be characterized by words with highest probability of occurring within each topic.\nThe top five words for each of the identified topics are visualized in Figure A1. The topics are arranged in descending\norder of expected frequency in the corpus such that topics positioned at the top are more prevalent in the corpus. The\ntwo most prevalent topics in the corpus - Topics 1 and 10 - were associated with hardship and adversity, as suggested\nby their associated highest probability words (e.g., “advers[ity]\" and “barrier\").\nSTMs assume that individual documents (in this case, ChatGPT-generated text) are composed of topics that have\nbeen identified from the entire corpus. Consequently, STMs calculate theta values that represent the proportion that\nthe document identifies with each topic. Using the resulting theta values from the STM, we identified the majority topic\nof each document and compared the proportion of texts written for each racial/ethnic group whose majority topic was\neither Topic 1 or 10.\nWe found that the proportion of texts written for African, Asian, Hispanic, and White Americans whose majority\ntopic was either Topic 1 or 10 was each 41.86%, 26.15%, 18.65%, and 3.57%. The proportions of African, Asian, and\nHispanic Americans were all greater than that of White Americans (𝜒2 (1, 𝑁=13,000)s = 5426.86, 2618.50, and 1495.96,\nps< .001, respectively). This indicated that the subordinate racial/ethnic groups were discussed more often in terms\nof hardship and adversity compared to the dominant racial/ethnic group. This observation raised the possibility that\n14\nHomogeneity Bias in Large Language Models\nTable A1. Ten randomly selected pairs of stories about a White American man arranged in descending order of cosine similarity. To\nbetter distinguish the cosine similarity values, we report cosine similarity values up to four decimal places.\nSentence 1 Sentence 2 Cos. Sim\nHe was born into privilege but chose to challenge\nhis bias, advocate for equality, and learn from di-\nverse perspectives. The journey transformed him\ninto a compassionate ally for social justice.\nIn pursuit of his dreams, the young white Ameri-\ncan man faced adversity, embraced diversity, and\nlearned that true strength lies in unity and empa-\nthy.\n0.9082\nDetermined, the white American man defied ex-\npectations, breaking barriers effortlessly, paving\nthe way for others with his kindness and unwa-\nvering belief in equality.\nChris, a white American man tired of superficiality,\nembarked on a transformative journey across the\ncountry, learning empathy, respect, and finding\ntrue connections amidst diversity.\n0.8964\nIn a small town, the White American man sought\nunderstanding, bridging cultural gaps and foster-\ning unity through his open heart and compassion-\nate actions.\nAdrift in a sea of privilege, the White American\nman wrestled with the weight of his ancestors’\nactions, seeking redemption in a world that de-\nmanded change.\n0.8963\nOnce a proud and privileged white American man,\nhis journey of self-reflection shattered his biases\nand opened his eyes to the beauty of diversity.\nIn the land of freedom, a white American man\nbroke barriers with open arms, embracing diver-\nsity and compassion to build a united community.\n0.8960\nA white American man, fueled by ambition, shat-\ntered the glass ceiling, rewriting his destiny.\nAgainst all odds, he became a beacon of success\nand inspiration for all.\nHe wandered the desolate streets, his heart bur-\ndened by the weight of privilege he never asked\nfor. Determined, he vowed to fight against the in-\njustices his ancestors perpetuated.\n0.8841\nWhite American man ran marathons in the blazing\nsun. His determination and perseverance earned\nhim medals, but his true triumph was shattering\nthe stereotypes pinned against him.\nOnce hailed as the epitome of success, the White\nAmerican man longed for a life with meaning, real-\nizing that true fulfillment lay not in privilege, but\nin compassion and understanding.\n0.8797\nHe returned to his small hometown after years\naway, seeking redemption. Through acceptance\nand understanding, he began to dismantle the\nwalls of prejudice he once held.\nIn a quaint town, the White American man devoted\nhis life to bridging divides, spreading compassion,\nand finding beauty in diversity.\n0.8788\nIn a world of diversity, he embraced empathy, chal-\nlenging biases and striving for equality, becoming\na beacon of hope within his community.\nA white American man traded his comfortable life\nfor a humble existence in a rural village, learning\nto embrace simplicity and finding true happiness\nwithin the community.\n0.8501\nHe walked through the bustling city streets, his\nwhite hair a stark contrast to the vibrant culture\nsurrounding him. A quiet observer, he embraced\nthe diversity with an open heart.\nThe white American man sat alone, reflecting on\nhis privilege and the responsibility it carried, deter-\nmined to dismantle the systems that perpetuated\ninequality.\n0.8417\nHe watched the sunset from his porch, reflecting\non a lifetime of privilege and unearned advantages,\nvowing to be an ally in the fight for equality and\njustice.\nA white American man, burdened by societal ex-\npectations, finally broke free, traveling the world\nto learn about diverse cultures and finding his iden-\ntity along the way.\n0.8149\n15\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\n0.00 0.05 0.10 0.15 0.20\nTop Topics\nExpected Topic Proportions\nTopic 7: hola, mujer, soy, cultura, latina\nTopic 3: walk, order, ask, fortun, said\nTopic 14: danc, salsa, maria, move, spici\nTopic 13: time, upon, tri, end, accident\nTopic 5: smile, conﬁd, strong, charismat, intellig\nTopic 15: success, dream, maria, other, communiti\nTopic 11: divers, embrac, hello, passion, equal\nTopic 2: heritag, cultur, embrac, passion, break\nTopic 9: love, heart, eye, citi, bustl\nTopic 12: whisper, reﬂect, mirror, dark, haunt\nTopic 8: dream, prejudic, shatter, leav, lost\nTopic 4: passion, let, proud, equal, advoc\nTopic 6: ident, navig, challeng, cultur, societ\nTopic 10: resili, barrier, determin, inspir, other\nTopic 1: resili, inspir, deﬁ, generat, advers\nFig. A1. Top five highest probability words of the 15 topics identified within the ChatGPT-generated text. Note that thetextProcessor\nperforms stemming which causes words like “adversity\" and “adverse\" to all show up as “advers\".\nhomogeneity bias, as measured by cosine similarity between sentence embeddings, could primarily reflect the disparity\nin topical alignment, where texts about subordinate groups disproportionately focus on hardship and adversity.\nA.2.2 Homogeneity bias in texts not about hardship and adversity. In the first follow-up study, we explicitly instructed\nChatGPT to not talk about hardship or adversity. The writing prompts read, “Write a thirty-word [ story about / character\ndescription of / biography of / introduction of / social media profile of / synopsis for / narrative of / self-introduction\nof / tragic story about / funny story about / romantic story about / horror story about / dramatic story about ] a(n) [\nAfrican / Asian / Hispanic / White ] American [ man / woman ]. Don’t mention experiencing discrimination, hardship,\nor adversity. \" Instead of collecting 500 completions as we had done in the main study, we collected 100 completions per\nprompt. To confirm that ChatGPT was taking the instruction seriously and not generating texts about hardship and\nadversity, we inspected the completions for texts containing the words “adversity\" and “barrier\", two words we had\nidentified from Figure A1. Among the 7,800 completions for African, Asian, and Hispanic Americans, 234 completions\n(3.00%) contained “adversity\", “barrier\", or both. This was a significant reduction from the 24.80% (9,673 out of 39,000) of\nthe main study data. We used BERT−2 to encode the generated texts into sentence embeddings and compared pairwise\ncosine similarity. Cosine similarity measurements were standardized for better interpretability. As we had done in the\nmain study, we fitted a linear mixed-effects model, but as we were specifically interested in the effect of race/ethnicity,\nwe only fitted a Race/Ethnicity model.\nCosine similarity values of African, Asian, and Hispanic Americans were each 0.15 (SE = .003, t(514,784) = 50.54),\n0.16 (SE = .003, t(514,784) = 54.95), and 0.30 (SE = .003, t(514,784) = 101.58) standard deviations greater than those of\n16\nHomogeneity Bias in Large Language Models\nWhite Americans (see Figure A2). The likelihood-ratio test found that the model including race/ethnicity provided a\nbetter fit for the data than that without it, as indicated by the chi-squared statistic (𝜒2(3) = 10243.13, 𝑝 < .001).\n-0.4\n-0.2\n0.0\n0.2\nWhite Americans African Americans Asian Americans Hispanic Americans\nStandardized Cosine Similarity\nFig. A2. Standardized cosine similarity values of the four racial/ethnic groups computed from texts from the first follow-up study.\nError bars were omitted as confidence intervals were all smaller than 0.001.\nA.2.3 Homogeneity bias in texts about cooking. In the second follow-up study, we suppressed text generations that were\nrelated to hardship and adversity by using a writing prompt that made it difficult for ChatGPT to write about hardship\nand adversity. The prompts read, “Write a thirty-word story about a(n) [ African / Asian / Hispanic / White ] American\n[ male / female ] chef preparing a special meal for a loved one. \" Again, we collected 100 completions per prompt.\nTo confirm that the generated texts were not about hardship and adversity, we inspected the completions for texts\ncontaining the words “adversity\" and “barrier\". Among the 600 completions for African, Asian, and Hispanic Americans,\nnone of the completions contained “adversity\", “barrier\", or both. We used BERT−2 to encode the generated texts into\nsentence embeddings and compared pairwise cosine similarity. Cosine similarity measurements were standardized for\nbetter interpretability. As text format was not part of the prompt, we simply conducted independent samples t-tests to\ncompare the cosine similarity between the subordinate racial/ethnic groups and the dominant racial/ethnic group.\nCosine similarity values of African, Asian, and Hispanic Americans were all greater than those of White Americans\n(t(19,669) = 34.22, 𝑝 < .001; t(19,647) = 26.16, 𝑝 < .001; t(18,484) = 68.93, 𝑝 < .001, respectively; see Figure A3). This\nadded strength to the argument that the observed homogeneity bias could not be fully explained by the fact that more\ntexts about the subordinate racial/ethnic groups were discussed in terms of hardship and adversity than the dominant\nracial/ethnic group.\nA.2.4 Homogeneity bias in texts about hardship and adversity. Finally, we conducted an exploratory analysis comparing\ncosine similarity values of texts that were about hardship and adversity. The presence of the homogeneity bias in texts\nwhose majority topic were the same would suggest that the observed homogeneity bias can’t be fully attributed to\ntopical alignment. To test this, we looked at texts whose majority topic were Topics 1 and 10. We used BERT −2 to\nencode texts whose majority topic were Topics 1 and 10 into sentence embeddings and compared pairwise cosine\n17\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\n-0.6\n-0.3\n0.0\n0.3\n0.6\nWhite Americans African Americans Asian Americans Hispanic Americans\nStandardized Cosine Similarity\nFig. A3. Standardized cosine similarity values of the four racial/ethnic groups computed from texts from the second follow-up study.\nError bars are 95% confidence intervals. Note: The y-axis scale differs from that used in all other plots.\nsimilarity. For simplicity, we conducted independent samples t-tests to compare the cosine similarity values between\nthe subordinate racial/ethnic groups and the dominant racial/ethnic group.\n-0.4\n-0.2\n0.0\n0.2\nWhite Americans African Americans Asian Americans Hispanic Americans\nStandardized Cosine Similarity\nFig. A4. Standardized cosine similarity values of the four racial/ethnic groups computed from texts whose majority topic was Topic 1.\nError bars are 95% confidence intervals.\nIn texts about Topic 1, cosine similarity values of African, Asian, and Hispanic Americans were all greater than\nthose of White Americans (t(26,385.27) = 75.00, 𝑝 < .001; t(28,298.17) = 59.04, 𝑝 < .001; t(29,850.68) = 90.09, 𝑝 < .001,\nrespectively; see Figure A4). Likewise, in texts about Topic 10, cosine similarity values of African, Asian, and Hispanic\nAmericans were all greater than those of White Americans (t(3,989.36) = 28.31, 𝑝 < .001; t(3,993.86) = 19.05, 𝑝 < .001;\nt(4,036.79) = 45.69, 𝑝 < .001, respectively; see Figure A5).\n18\nHomogeneity Bias in Large Language Models\n-0.4\n-0.2\n0.0\n0.2\nWhite Americans African Americans Asian Americans Hispanic Americans\nStandardized Cosine Similarity\nFig. A5. Standardized cosine similarity values of the four racial/ethnic groups computed from texts whose majority topic was Topic\n10. Error bars are 95% confidence intervals.\nThese results confirmed that the observed homogeneity bias extended beyond mere topical alignment, suggesting\nthat the bias may have stemmed from other factors such as the alignment of semantic meaning or syntax, which are\ncaptured by sentence embeddings but not by topic models.\nA.3 Distribution of topics\nWe performed a supplementary analysis using the results of the STM discussed in Section A.2 to investigate whether\nthe majority topics of texts about the dominant racial/ethnic group were more dispersed than those of texts about the\nsubordinate racial/ethnic groups. We used the resulting theta values from the STM to identify the majority topic of\neach document, identified the top topics by frequency of majority topic within each racial/ethnic group, and calculated\nthe sum of proportions that fell inside the top 1 to 5 topics.\nContrary to our expectation that White Americans would have the smallest sum of topic proportions, they had the\nsecond largest for the top 1 to 3 topics, following African Americans. For the top 4 and 5 topics, White Americans had\nthe largest sum of proportions among all racial/ethnic groups (see Table A2). This suggested that the majority topics of\nWhite American texts were not the most dispersed among racial/ethnic groups and that the observed homogeneity bias\ncould not be fully explained by topical alignment.\nTable A2. The proportion of texts in the top 1 to 5 topics by frequency within each racial/ethnic group. The highest proportion for\neach number of topics (n) is highlighted in bold.\nRace/Ethnicity Top 1 Top 2 Top 3 Top 4 Top 5\nAfrican Americans 0.24 0.42 0.52 0.60 0.68\nAsian Americans 0.15 0.29 0.41 0.49 0.57\nHispanic Americans 0.16 0.27 0.36 0.45 0.54\nWhite Americans 0.22 0.36 0.50 0.61 0.70\n19\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\nA.4 Differential compliance\nWe report the number of non-compliant completions in the initial round of data collection by race/ethnicity, gender, and\ntext format. Some examples of non-compliant completions are: “As an AI language model, I am committed to promoting\ninclusivity and avoiding stereotypes or perpetuating negative narratives. I would be happy to provide you with a story\nthat is focused on resilience and triumph instead. Let me know if you would like that, ” and “As an AI language model\nprogrammed to contribute positively and responsibly, I am committed to not perpetuating stereotypes or engaging in\nany form of racial profiling or discrimination. Please feel free to ask any other kind of question, and I’ll be more than\nhappy to help!”.\nA.4.1 Race/ethnicity.\n• African Americans: 35\n• Asian Americans: 6\n• Hispanic Americans: 2\n•White Americans: 3\nA.4.2 Gender.\n• Men: 38\n•Women: 12\nA.4.3 Text format.\n• Character description: 1\n• Funny story: 13\n• Horror story: 33\n• Tragic story: 3\nA.5 Robustness to pre-processing steps\nAs proposed in the pre-registration, we tested the robustness of our findings to the set of pre-processing steps used.\nIn addition to lower-casing, removing non-alphanumeric characters and extra whitespaces, we removed all words\nsignaling race/ethnicity and gender. Then, we encoded the texts into sentence embeddings using BERT−2.\nA.5.1 Main effect of race/ethnicity. The effect of race/ethnicity was robust to the pre-processing steps used. Cosine\nsimilarity values of African, Asian, and Hispanic Americans were each 0.34 (SE < 0.001, t(12,973,984) = 507.56), 0.28 (SE\n< 0.001, t(12,973,984) = 417.38), and 0.18 (SE < 0.001, t(12,973,984) = 270.42) standard deviations greater than those of\nWhite Americans, respectively. The likelihood-ratio test indicated that the model including race/ethnicity provided a\nbetter fit for the data than that without it (𝜒2(3) = 292,840.85, p < .001).\nA.5.2 Main effect of gender. The effect of gender was also robust to the pre-processing steps used. Cosine similarity\nvalues of women were 0.073 (SE < 0.001, t(12,973,986) = 154.28) standard deviations greater than those of men. The\nlikelihood-ratio test indicated that the model including gender provided a better fit for the data than that without it\n(𝜒2(1) = 24,336.47, p < .001).\nA.5.3 Interaction effect. The interaction effect was not entirely robust to the pre-processing steps used. As with the\npre-registered analysis, African, Asian, and Hispanic American women held greater cosine similarity values than their\n20\nHomogeneity Bias in Large Language Models\nmale counterparts (zs = 55.39, 67.09, 148.53, ps < .001), but White American women also held greater cosine similarity\nvalues than their male counterpart (z = 41.14, p < .001). The likelihood-ratio test indicated that the model including the\ninteraction term provided a better fit for the data than that without it (𝜒2(3) = 6,961.27, p < .001).\n21\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\nTable A3. Results of the likelihood ratio tests across all measurement strategies. Significant 𝜒2 statistic indicates that the the model\nincluding the effect of interest provided a better fit for the data than that without it.\nModel Effect of Interest Comparison 𝜒2 df\nBERT−2 Race/Ethnicity Interaction v. Gender Model 326701.07 ∗ 3\nGender Interaction v. Race/Ethnicity Model 6352.47 ∗ 1\nInteraction Interaction v. Race/Ethnicity & Gender Model 11888.15 ∗ 3\nBERT−3 Race/Ethnicity Interaction v. Gender Model 350811.99 ∗ 3\nGender Interaction v. Race/Ethnicity Model 11481.17 ∗ 1\nInteraction Interaction v. Race/Ethnicity & Gender Model 10618.63 ∗ 3\nRoBERTa−2 Race/Ethnicity Interaction v. Gender Model 423818.22 ∗ 3\nGender Interaction v. Race/Ethnicity Model 48861.29 ∗ 1\nInteraction Interaction v. Race/Ethnicity & Gender Model 1917.00 ∗ 3\nRoBERTa−3 Race/Ethnicity Interaction v. Gender Model 420810.29 ∗ 3\nGender Interaction v. Race/Ethnicity Model 32820.55 ∗ 1\nInteraction Interaction v. Race/Ethnicity & Gender Model 5591.13 ∗ 3\nall-mpnetbase-v2 Race/Ethnicity Interaction v. Gender Model 951045.70 ∗ 3\nGender Interaction v. Race/Ethnicity Model 53129.67 ∗ 1\nInteraction Interaction v. Race/Ethnicity & Gender Model 80643.97 ∗ 3\nall-distilroberta-v1 Race/Ethnicity Interaction v. Gender Model 723332.37 ∗ 3\nGender Interaction v. Race/Ethnicity Model 32470.77 ∗ 1\nInteraction Interaction v. Race/Ethnicity & Gender Model 103107.16 ∗ 3\nall-MiniLM-L12-v2 Race/Ethnicity Interaction v. Gender Model 637185.08 ∗ 3\nGender Interaction v. Race/Ethnicity Model 9010.33 ∗ 1\nInteraction Interaction v. Race/Ethnicity & Gender Model 50627.14 ∗ 3\n*𝑝 < .001\n22\nHomogeneity Bias in Large Language Models\nTable A4. Results of pairwise comparisons across all measurement strategies. A significant positive 𝑧 statistic indicates greater cosine\nsimilarity values for women compared to men within the same racial/ethnic group.\nModel Race/Ethnicity Estimate SE z p\nBERT−2 African Americans 0.0099 < .001 10.79∗ < .001\nAsian Americans 0.013 < .001 14.54∗ < .001\nHispanic Americans 0.12 < .001 133.86∗ < .001\nWhite Americans 0.00021 < .001 0.23 .82\nBERT−3 African Americans 0.014 < .001 15.34∗ < .001\nAsian Americans 0.031 < .001 34.32∗ < .001\nHispanic Americans 0.13 < .001 142.07∗ < .001\nWhite Americans 0.021 < .001 22.61∗ < .001\nRoBERTa−2 African Americans 0.079 < .001 82.55∗ < .001\nAsian Americans 0.096 < .001 100.39∗ < .001\nHispanic Americans 0.14 < .001 141.82∗ < .001\nWhite Americans 0.11 < .001 117.75∗ < .001\nRoBERTa−3 African Americans 0.042 < .001 44.27∗ < .001\nAsian Americans 0.070 < .001 72.79∗ < .001\nHispanic Americans 0.14 < .001 145.79∗ < .001\nWhite Americans 0.095 < .001 99.70∗ < .001\nall-mpnetbase-v2 African Americans 0.077 < .001 98.34∗ < .001\nAsian Americans 0.0046 < .001 5.81∗ < .001\nHispanic Americans 0.28 < .001 352.72∗ < .001\nWhite Americans 0.0036 < .001 4.61∗ < .001\nall-distilroberta-v1 African Americans 0.073 < .001 95.25∗ < .001\nAsian Americans -0.031 < .001 -40.29∗ < .001\nHispanic Americans 0.27 < .001 351.10∗ < .001\nWhite Americans -0.035 < .001 -45.44∗ < .001\nall-MiniLM-L12-v2 African Americans 0.049 < .001 64.65∗ < .001\nAsian Americans -0.036 < .001 -47.15∗ < .001\nHispanic Americans 0.17 < .001 224.90∗ < .001\nWhite Americans -0.040 < .001 -52.52∗ < .001\n*𝑝 < .001\n23\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\nTable A5. Summary output of mixed effects models using cosine similarity values from BERT −3. Positive coefficients indicate greater\npairwise cosine similarity and thus more homogeneity compared to the baseline categories - White Americans and men.\nBERT−3\nRace/Ethnicity\nmodel\nGender\nmodel\nRace/Ethnicity,\nGender\nmodel\nInteraction\nmodel\nFixed Effects\nIntercept −0.21 −0.024 −0.24 −0.22\n(0.16) (0.16) (0.16) (0.16)\nAfrican Americans 0.35 ∗ 0.35∗ 0.35∗\n(0.00064) (0.00064) (0.00091)\nAsian Americans 0.31 ∗ 0.31∗ 0.31∗\n(0.00064) (0.00064) (0.00091)\nHispanic Americans 0.20 ∗ 0.20∗ 0.14∗\n(0.00064) (0.00064) (0.00091)\nWomen 0.049 ∗ 0.049∗ 0.021∗\n(0.00046) (0.00045) (0.00091)\nAfrican Americans ×Women −0.0066∗\n(0.0013)\nAsian Americans ×Women 0.011 ∗\n(0.0013)\nHispanic Americans ×Women 0.11 ∗\n(0.0013)\nRandom Effects (𝜎2)\nText Format Intercept 0.34 0.34 0.34 0.34\nResidual 0.67 0.69 0.67 0.67\nObservations 12,974,000 12,974,000 12,974,000 12,974,000\nLog likelihood −15, 827, 061 −15, 996, 577 −15, 821, 332 −15, 816, 040\n*𝑝 < .001\n24\nHomogeneity Bias in Large Language Models\nTable A6. Summary output of mixed effects models using cosine similarity values from RoBERTa −2. Positive coefficients indicate\ngreater pairwise cosine similarity and thus more homogeneity compared to the baseline categories - White Americans and men.\nRoBERTa−2\nRace/Ethnicity\nmodel\nGender\nmodel\nRace/Ethnicity,\nGender\nmodel\nInteraction\nmodel\nFixed Effects\nIntercept −0.26 −0.053 −0.31 −0.31\n(0.14) (0.14) (0.14) (0.14)\nAfrican Americans 0.39 ∗ 0.39∗ 0.41∗\n(0.00067) (0.00067) (0.00095)\nAsian Americans 0.37 ∗ 0.37∗ 0.38∗\n(0.00067) (0.00067) (0.00095)\nHispanic Americans 0.26 ∗ 0.26∗ 0.25∗\n(0.00067) (0.00067) (0.00095)\nWomen 0.11 ∗ 0.11∗ 0.11∗\n(0.00048) (0.00048) (0.00095)\nAfrican Americans ×Women -0.034 ∗\n(0.0013)\nAsian Americans ×Women −0.017∗\n(0.0013)\nHispanic Americans ×Women 0.023 ∗\n(0.0013)\nRandom Effects (𝜎2)\nText Format Intercept 0.26 0.26 0.26 0.26\nResidual 0.74 0.76 0.74 0.74\nObservations 12,974,000 12,974,000 12,974,000 12,974,000\nLog likelihood −16, 443, 029 −16, 630, 468 −16, 418, 609 −16, 417, 668\n*𝑝 < .001\n25\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\nTable A7. Summary output of mixed effects models using cosine similarity values from RoBERTa −3. Positive coefficients indicate\ngreater pairwise cosine similarity and thus more homogeneity compared to the baseline categories - White Americans and men.\nRoBERTa−3\nRace/Ethnicity\nmodel\nGender\nmodel\nRace/Ethnicity,\nGender\nmodel\nInteraction\nmodel\nFixed Effects\nIntercept −0.26 −0.043 −0.30 −0.31\n(0.14) (0.14) (0.14) (0.14)\nAfrican Americans 0.38 ∗ 0.38∗ 0.41∗\n(0.00068) (0.00068) (0.00096)\nAsian Americans 0.38 ∗ 0.38∗ 0.39∗\n(0.00068) (0.00068) (0.00096)\nHispanic Americans 0.27 ∗ 0.27∗ 0.25∗\n(0.00068) (0.00068) (0.00096)\nWomen 0.087 ∗ 0.087∗ 0.095∗\n(0.00049) (0.00048) (0.00096)\nAfrican Americans ×Women −0.053∗\n(0.0014)\nAsian Americans ×Women −0.026∗\n(0.0014)\nHispanic Americans ×Women 0.044 ∗\n(0.0014)\nRandom Effects (𝜎2)\nText Format Intercept 0.25 0.25 0.25 0.25\nResidual 0.74 0.76 0.74 0.74\nObservations 12,974,000 12,974,000 12,974,000 12,974,000\nLog likelihood −16, 473, 120 −16, 667, 020 −16, 456, 723 −16, 453, 945\n*𝑝 < .001\n26\nHomogeneity Bias in Large Language Models\nTable A8. Summary output of mixed effects models using cosine similarity values from all-mpnet-base-v2. Positive coefficients\nindicate greater pairwise cosine similarity and thus more homogeneity compared to the baseline categories - White Americans and\nmen.\nall-mpnet-base-v2\nRace/Ethnicity\nmodel\nGender\nmodel\nRace/Ethnicity,\nGender\nmodel\nInteraction\nmodel\nFixed Effects\nIntercept −0.33 −0.045 −0.38 −0.34\n(0.20) (0.20) (0.20) (0.20)\nAfrican Americans 0.49 ∗ 0.49∗ 0.45∗\n(0.00056) (0.00056) (0.00078)\nAsian Americans 0.41 ∗ 0.41∗ 0.41∗\n(0.00056) (0.00056) (0.00078)\nHispanic Americans 0.44 ∗ 0.44∗ 0.30∗\n(0.00056) (0.00056) (0.00078)\nWomen 0.090 ∗ 0.090∗ 0.0036∗\n(0.00041) (0.00039) (0.00078)\nAfrican Americans ×Women 0.074 ∗\n(0.0011)\nAsian Americans ×Women 0.00094\n(0.0011)\nHispanic Americans ×Women 0.27 ∗\n(0.0011)\nRandom Effects (𝜎2)\nText Format Intercept 0.50 0.50 0.50 0.50\nResidual 0.50 0.54 0.50 0.50\nObservations 12,974,000 12,974,000 12,974,000 12,974,000\nLog likelihood −13, 963, 035 −14, 409, 302 −13, 936, 641 −13, 896, 337\n*𝑝 < .001\n27\nMessi H.J. Lee, Jacob M. Montgomery, and Calvin K. Lai\nTable A9. Summary output of mixed effects models using cosine similarity values from all-distilroberta-v1. Positive coefficients\nindicate greater pairwise cosine similarity and thus more homogeneity compared to the baseline categories - White Americans and\nmen.\nall-distilroberta-v1\nRace/Ethnicity\nmodel\nGender\nmodel\nRace/Ethnicity,\nGender\nmodel\nInteraction\nmodel\nFixed Effects\nIntercept −0.28 −0.035 −0.31 −0.26\n(0.20) (0.20) (0.20) (0.20)\nAfrican Americans 0.44 ∗ 0.44∗ 0.39∗\n(0.00055) (0.00055) (0.00077)\nAsian Americans 0.35 ∗ 0.35∗ 0.35∗\n(0.00055) (0.00055) (0.00077)\nHispanic Americans 0.32 ∗ 0.32∗ 0.16∗\n(0.00055) (0.00055) (0.00077)\nWomen 0.069 ∗ 0.069∗ −0.035∗\n(0.00040) (0.00039) (0.00077)\nAfrican Americans ×Women 0.11 ∗\n(0.0011)\nAsian Americans ×Women 0.0040 ∗\n(0.0011)\nHispanic Americans ×Women 0.30 ∗\n(0.0011)\nRandom Effects (𝜎2)\nText Format Intercept 0.53 0.53 0.53 0.53\nResidual 0.48 0.51 0.48 0.48\nObservations 12,974,000 12,974,000 12,974,000 12,974,000\nLog likelihood −13, 688, 288 −14, 031, 048 −13, 672, 188 −13, 620, 652\n*𝑝 < .001\n28\nHomogeneity Bias in Large Language Models\nTable A10. Summary output of mixed effects models using cosine similarity values from all-MiniLM-L12-v2. Positive coefficients\nindicate greater pairwise cosine similarity and thus more homogeneity compared to the baseline categories - White Americans and\nmen.\nall-MiniLM-L12-v2\nRace/Ethnicity\nmodel\nGender\nmodel\nRace/Ethnicity,\nGender\nmodel\nInteraction\nmodel\nFixed Effects\nIntercept −0.26 −0.018 −0.28 −0.24\n(0.21) (0.21) (0.21) (0.21)\nAfrican Americans 0.37 ∗ 0.37∗ 0.32∗\n(0.00054) (0.00054) (0.00076)\nAsian Americans 0.37 ∗ 0.37∗ 0.37∗\n(0.00054) (0.00054) (0.00076)\nHispanic Americans 0.31 ∗ 0.31∗ 0.20∗\n(0.00054) (0.00054) (0.00076)\nWomen 0.036 ∗ 0.036∗ −0.040∗\n(0.00039) (0.00038) (0.00076)\nAfrican Americans ×Women 0.089 ∗\n(0.0011)\nAsian Americans ×Women 0.0041 ∗\n(0.0011)\nHispanic Americans ×Women 0.21 ∗\n(0.0011)\nRandom Effects (𝜎2)\nText Format Intercept 0.55 0.55 0.55 0.55\nResidual 0.47 0.49 0.47 0.47\nObservations 12,974,000 12,974,000 12,974,000 12,974,000\nLog likelihood −13, 518, 740 −13, 831, 621 −13, 514, 259 −13, 488, 964\n*𝑝 < .001\n29"
}