{
    "title": "From Angels to Artificial Agents? AI as a Mirror for Human (Im)perfections",
    "url": "https://openalex.org/W4397035351",
    "year": 2024,
    "authors": [
        {
            "id": "https://openalex.org/A2083831591",
            "name": "Pim Haselager",
            "affiliations": [
                "Radboud University Nijmegen"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W4375949262",
        "https://openalex.org/W4327672398",
        "https://openalex.org/W4229952927",
        "https://openalex.org/W4225744344",
        "https://openalex.org/W4321637473",
        "https://openalex.org/W4386773699",
        "https://openalex.org/W4383818129",
        "https://openalex.org/W3013288210",
        "https://openalex.org/W4313897454",
        "https://openalex.org/W842599055",
        "https://openalex.org/W2036479846",
        "https://openalex.org/W2251410821",
        "https://openalex.org/W2766447205",
        "https://openalex.org/W2528515017",
        "https://openalex.org/W3170495160",
        "https://openalex.org/W4321004985",
        "https://openalex.org/W2001771035",
        "https://openalex.org/W4353041380",
        "https://openalex.org/W6739901393",
        "https://openalex.org/W4379878854",
        "https://openalex.org/W4385245566",
        "https://openalex.org/W597066122",
        "https://openalex.org/W648152870",
        "https://openalex.org/W3128077823",
        "https://openalex.org/W1562655727",
        "https://openalex.org/W4241134934",
        "https://openalex.org/W2216222576",
        "https://openalex.org/W3028079887",
        "https://openalex.org/W4400906876",
        "https://openalex.org/W2320336678",
        "https://openalex.org/W2171301064",
        "https://openalex.org/W3132809700",
        "https://openalex.org/W1594134222"
    ],
    "abstract": "Artificial intelligence (AI) systems paradoxically combine high levels of certain types of intelligence and cognitive capacities (pattern recognition, reasoning, learning, memory, perception, etc.) with an absence of understanding and sentience (feeling, emotion). Apparently, it is possible to make great progress in modeling smartness without making progress towards genuinely understanding what all the clever reasoning is about. This is relevant when dealing with AI programs that produce potentially convincing propositional output on religious topics. This article suggests that smartness without genuine understanding cannot amount to authentic religiosity. Comparing ourselves with other entities, (in)animate or (super)natural, has always been a way for humans to understand ourselves better. Throughout the ages, many different types of beings and agents have functioned as tools for self-examination, presenting us with mirrors that reflect at least some of our characteristics, capacities, and (im)perfections. The recent progress in AI provides exciting, though sometimes worrisome, cases for a newly informed look at ourselves. Thus, AI may have profound effects on how we regard others and ourselves. The proud claim that humans are the smartest species on the planet may turn out not to mean all that much. Inspired by the example of Thomas Aquinas, the comparison of humans to our nearest neighbors in a newly extended great chain of being—namely, animals, angels, and AI—may deepen our appreciation of the features of homo sapiens that we share with many other organisms.",
    "full_text": null
}