{
  "title": "The Utility of Artificial Intelligence as an Example of Large Language Models in Healthcare Education. Dr. Sergio Grunbaum",
  "url": "https://openalex.org/W4399292442",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A5070706447",
      "name": "Sergio Grunbaum",
      "affiliations": [
        "Universidad Columbia del Paraguay"
      ]
    },
    {
      "id": "https://openalex.org/A5057145891",
      "name": "Priscilla de Souza Nunes",
      "affiliations": [
        null
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4376866715",
    "https://openalex.org/W4390545867",
    "https://openalex.org/W4389125438"
  ],
  "abstract": "En la era digital actual, la inteligencia artificial (IA) ha emergido como una fuerza transformadora en diversos campos, y la educación en salud no es una excepción. En este artículo, exploraremos el papel crucial de la inteligencia artificial, particularmente los Modelos de Lenguaje Grandes (LLMs), en la evolución de la educación en salud(1). En la era digital contemporánea, la inteligencia artificial (IA) ha surgido como una fuerza de cambio en múltiples ámbitos, y la educación en salud no queda al margen de esta transformación. Este artículo tiene como propósito examinar minuciosamente el papel esencial de la inteligencia artificial, centrándose especialmente en los Modelos de Lenguaje Grandes (LLMs), en el desarrollo de la educación en salud(1). La inteligencia artificial, o IA, se refiere a la capacidad de las máquinas para realizar tareas que normalmente requieren la intervención humana. En el contexto de la educación en salud, este avance tecnológico ha demostrado ser una herramienta invaluable. Desde diagnósticos médicos más precisos hasta la formación de profesionales de la salud, la IA ha dejado una huella significativa(1). Los Modelos de Lenguaje Grandes son una categoría especializada de inteligencia artificial que se enfoca en comprender y generar lenguaje humano de manera avanzada. En el ámbito educativo de la salud, estos modelos han resultado ser un cambio de paradigma al proporcionar una comprensión más profunda y contextualizada de los conceptos médicos(2). Es esencial explorar cómo la inteligencia artificial, en particular los Modelos de Lenguaje Grandes, han evolucionado y continuamente están dando forma a la educación en salud. Desde su introducción, estos modelos han influido en la forma en que los estudiantes y profesionales de la salud acceden, asimilan y aplican conocimientos médicos(2). En resumen, este artículo se sumergirá en los meandros de la inteligencia artificial y los Modelos de Lenguaje Grandes, desarrollando su papel revolucionario en la educación en salud. Se examinarán casos prácticos, beneficios concretos y desafíos éticos para proporcionar una visión completa de cómo la IA está transformando la manera en que aprendemos y enseñamos en el campo de la salud(2).",
  "full_text": null,
  "topic": "Artificial intelligence",
  "concepts": [
    {
      "name": "Artificial intelligence",
      "score": 0.5422033667564392
    },
    {
      "name": "Computer science",
      "score": 0.4684469997882843
    },
    {
      "name": "Health care",
      "score": 0.46016380190849304
    },
    {
      "name": "Economics",
      "score": 0.13584989309310913
    },
    {
      "name": "Economic growth",
      "score": 0.06759044528007507
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I3129402242",
      "name": "Universidad Columbia del Paraguay",
      "country": "PY"
    }
  ],
  "cited_by": 1
}