{
    "title": "Assessing the Capability of Large Language Models in Naturopathy Consultation",
    "url": "https://openalex.org/W4396546853",
    "year": 2024,
    "authors": [
        {
            "id": "https://openalex.org/A2556512418",
            "name": "Himel Mondal",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A5093971868",
            "name": "Satyalakshmi Komarraju",
            "affiliations": []
        },
        {
            "id": null,
            "name": "Sathyanath D",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2716609685",
            "name": "Shrikanth Muralidharan",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W4387500346",
        "https://openalex.org/W4393867901",
        "https://openalex.org/W4386141641",
        "https://openalex.org/W4384078169",
        "https://openalex.org/W4390314481",
        "https://openalex.org/W4386226838",
        "https://openalex.org/W5437866",
        "https://openalex.org/W4389450729",
        "https://openalex.org/W4386211085",
        "https://openalex.org/W4386845850",
        "https://openalex.org/W4381930847",
        "https://openalex.org/W4392748121",
        "https://openalex.org/W4376114558",
        "https://openalex.org/W4386033569",
        "https://openalex.org/W4394750846",
        "https://openalex.org/W4387496544",
        "https://openalex.org/W4388370035"
    ],
    "abstract": "Background The rapid advancements in natural language processing have brought about the widespread use of large language models (LLMs) across various medical domains. However, their effectiveness in specialized fields, such as naturopathy, remains relatively unexplored. Objective The study aimed to assess the capability of freely available LLM chatbots in providing naturopathy consultations for various types of diseases and disorders. Methods Five free LLMs (viz., Gemini, Copilot, ChatGPT, Claude, and Perplexity) were used to converse with 20 clinical cases (simulation of real-world scenarios). Each case had the case details and questions pertinent to naturopathy. The responses were presented to three naturopathy doctors with > 5 years of practice. The answers were rated by them on a five-point Likert-like scale for language fluency, coherence, accuracy, and relevancy. The average of these four attributes is termed perfection in his study. Results The overall score of the LLMs were Gemini 3.81±0.23, Copilot 4.34±0.28, ChatGPT 4.43±0.2, Claude 3.8±0.26, and Perplexity 3.91±0.28 (ANOVA F [3.034, 57.64] = 33.47, P <0.0001. Together, they showed overall ~80% perfection in consultation. The average measure intraclass correlation coefficient among the LLMs for the overall score was 0.463 (95% CI = -0.028 to 0.76), P = 0.03. Conclusion Although the LLM chatbots could help in providing naturopathy and yoga treatment consultation with approximately an overall fair level of perfection, their solution to the user varies across different chatbots and there was very low reliability among them.",
    "full_text": null
}