{
  "title": "SEETrials: Leveraging Large Language Models for Safety and Efficacy Extraction in Oncology Clinical Trials",
  "url": "https://openalex.org/W4391050675",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A2169884472",
      "name": "Kyeryoung Lee",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A2594549060",
      "name": "Hunki Paek",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A5006412664",
      "name": "Liang-Chin Huang",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A2101148351",
      "name": "C Beau Hilton",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2925389593",
      "name": "Surabhi Datta",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": null,
      "name": "Josh Higashi",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A5093247082",
      "name": "Nneka Ofoegbu",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A2143041298",
      "name": "Jingqi Wang",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A2277699381",
      "name": "Samuel  M. Rubinstein",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2170101497",
      "name": "Andrew J. Cowan",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2138501657",
      "name": "Mary Kwok",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2131248401",
      "name": "Jeremy L Warner",
      "affiliations": [
        "Brown University"
      ]
    },
    {
      "id": "https://openalex.org/A2105258892",
      "name": "Hua Xu",
      "affiliations": [
        "Yale University"
      ]
    },
    {
      "id": "https://openalex.org/A2097738364",
      "name": "Xiaoyan Wang",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A2169884472",
      "name": "Kyeryoung Lee",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A2594549060",
      "name": "Hunki Paek",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A5006412664",
      "name": "Liang-Chin Huang",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A2925389593",
      "name": "Surabhi Datta",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": null,
      "name": "Josh Higashi",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A5093247082",
      "name": "Nneka Ofoegbu",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A2143041298",
      "name": "Jingqi Wang",
      "affiliations": [
        "Dairy Management"
      ]
    },
    {
      "id": "https://openalex.org/A2131248401",
      "name": "Jeremy L Warner",
      "affiliations": [
        "Brown University"
      ]
    },
    {
      "id": "https://openalex.org/A2105258892",
      "name": "Hua Xu",
      "affiliations": [
        "Yale University"
      ]
    },
    {
      "id": "https://openalex.org/A2097738364",
      "name": "Xiaoyan Wang",
      "affiliations": [
        "Dairy Management"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4210734847",
    "https://openalex.org/W3135614472",
    "https://openalex.org/W4310641549",
    "https://openalex.org/W4316507348",
    "https://openalex.org/W1989497622",
    "https://openalex.org/W2117963308",
    "https://openalex.org/W4311906078",
    "https://openalex.org/W4252017059",
    "https://openalex.org/W1979518182",
    "https://openalex.org/W2103718021",
    "https://openalex.org/W2027652926",
    "https://openalex.org/W2966351171",
    "https://openalex.org/W2933950178",
    "https://openalex.org/W4221141777",
    "https://openalex.org/W4313197536",
    "https://openalex.org/W4312220150",
    "https://openalex.org/W4318751992",
    "https://openalex.org/W4385571728",
    "https://openalex.org/W4385461818",
    "https://openalex.org/W4386865118",
    "https://openalex.org/W4388496436",
    "https://openalex.org/W4361806442",
    "https://openalex.org/W4379538804",
    "https://openalex.org/W4388608412",
    "https://openalex.org/W4379232324",
    "https://openalex.org/W4327700049",
    "https://openalex.org/W4385456897",
    "https://openalex.org/W2609678219",
    "https://openalex.org/W2952495494",
    "https://openalex.org/W3102251128"
  ],
  "abstract": "ABSTRACT Background Initial insights into oncology clinical trial outcomes are often gleaned manually from conference abstracts. We aimed to develop an automated system to extract safety and efficacy information from study abstracts with high precision and fine granularity, transforming them into computable data for timely clinical decision-making. Methods We collected clinical trial abstracts from key conferences and PubMed (2012-2023). The SEETrials system was developed with four modules: preprocessing, prompt modeling, knowledge ingestion and postprocessing. We evaluated the system’s performance qualitatively and quantitatively and assessed its generalizability across different cancer types— multiple myeloma (MM), breast, lung, lymphoma, and leukemia. Furthermore, the efficacy and safety of innovative therapies, including CAR-T, bispecific antibodies, and antibody-drug conjugates (ADC), in MM were analyzed across a large scale of clinical trial studies. Results SEETrials achieved high precision (0.958), recall (sensitivity) (0.944), and F1 score (0.951) across 70 data elements present in the MM trial studies Generalizability tests on four additional cancers yielded precision, recall, and F1 scores within the 0.966-0.986 range. Variation in the distribution of safety and efficacy-related entities was observed across diverse therapies, with certain adverse events more common in specific treatments. Comparative performance analysis using overall response rate (ORR) and complete response (CR) highlighted differences among therapies: CAR-T (ORR: 88%, 95% CI: 84-92%; CR: 95%, 95% CI: 53-66%), bispecific antibodies (ORR: 64%, 95% CI: 55-73%; CR: 27%, 95% CI: 16-37%), and ADC (ORR: 51%, 95% CI: 37-65%; CR: 26%, 95% CI: 1-51%). Notable study heterogeneity was identified (&gt;75% I 2 heterogeneity index scores) across several outcome entities analyzed within therapy subgroups. Conclusion SEETrials demonstrated highly accurate data extraction and versatility across different therapeutics and various cancer domains. Its automated processing of large datasets facilitates nuanced data comparisons, promoting the swift and effective dissemination of clinical insights.",
  "full_text": "1 \nGranularly, Precisely, and Timely: Leveraging Large \nLanguage Models for Safety and Efficacy Extraction in \nOncology Clinical Trial Abstracts (SEETrials)  \n  \nHunki Paek, PhD1*, Kyeryoung Lee, PhD1 *, Surabhi Datta, PhD1, Liang-Chin Huang, \nPhD1, Josh Higashi1, Nneka Ofoegbu, PharmD1, Jingqi Wang, PhD1, Frank J. Manion, PhD1, \nJeremy L. Warner, MD2, Hua Xu, PhD3, Xiaoyan Wang, PhD1  \n   \n1 IMO health, Rosemont, IL 60018 USA \n2 Brown University, Providence, RI 02912 USA \n3 Yale University, New Haven, CT 06510 USA \n* Equal contribution \n \n  \n Corresponding author \n \nXiaoyan Wang, PhD \nIMO health, \n9600 West Bryn Mawr Avenue \nSuite 100, Rosemont, IL 60018 USA \nPhone: 8476136655 \nEmail: xw108@caa.columbia.edu \n \n \n \nKEYWORDS \nCancer Clinical Trial Outcome Extraction \nConference Abstracts  \nGPT-4 \nZero-shot Prompting \nLarge Language Model \n \n  \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \nNOTE: This preprint reports new research that has not been certified by peer review and should not be used to guide clinical practice.\n2 \nABSTRACT  \n \nObjective \nConference abstracts provide preliminary evidence for clinical trial outcomes. This study aims to \ndevelop an automatic extraction system to precisely extract and convert granular safety and \nefficacy information from abstracts into a computable format for timely downstream analysis. \n \nMaterials and Methods \nWe collected multiple myeloma clinical trial abstracts from ASCO, ASH, and PubMed (2012-\n2023) to develop SEETrials, a GPT-4 based system. Qualitative and quantitative evaluations \nwere conducted. Descriptive data analysis on efficacy and safety entities was performed. The \ngeneralizability of the system was tested in three other cancer trial studies. \n \nResults \nSEETrials achieved precision, recall, and F1 of 95.5%, 93.9%, and 94.7% across 70 data \nelements. Analysis of 245 multiple myeloma clinical trial abstracts revealed variations in safety \nand efficacy entity distribution across different modalities and phases. Application to other \ncancer trial studies demonstrated consistent performance with precision, recall, and F1 of 96.9%, \n95.4%, and 96.1%, respectively.  \n \nDiscussion \nQualitative error analysis identified a common source of inaccuracy, notably in cohort \nidentification and categorization. Phase1/2 studies prioritize early indications of treatment \nefficacy, while phase 2/3 studies emphasize prolonged effects. Adverse event distribution is \nconsistent across phases, with noticeable increases in fatal events in later phases, suggesting \nlonger follow-up or more patients may reveal severe adverse events missed in phase 1 safety \nstudies. \n \nConclusion \nSEETrials displayed high accuracy and generalizability to diverse drug modalities and disease \ndomains. Its capacity to streamline large-scale dataset analysis is crucial for advancing clinical \ntrial research, ensuring timely and accurate data extraction, and facilitating efficient \ndissemination. \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n3 \nINTRODUCTION \n \nEffective clinical decision-making relies profoundly on the continuous flow of data and \noutcomes derived from clinical trial studies [1]. The timely dissemination of clinical trial \noutcomes, including risks and benefits from early-phase trials, holds importance in facilitating \nwell-informed decision-making in patient care, ultimately influencing patient treatment outcomes \n[2]. Swift access to data also plays a critical role in optimizing patient recruitment for clinical \ntrials, a pivotal factor in expediting the development of novel treatments, particularly in high-\nneed medical areas such as oncology [3].  \n \nConference abstracts often serve as crucial sources of preliminary findings, unveiling clinical \ntrial results and providing insights into the efficacy and safety of investigational treatments. \nHowever, the retrieval of these abstracts poses a challenge, and trial results initially presented in \nthe conference abstracts may not progress to subsequent journal publication [4]. This \ndiscrepancy is significant, with more than 50% of outcomes from abstracts and nearly one-third \nof randomized trial results, initially introduced in conference abstracts, failing to advance to full \npublication, and this trend has not shown improvement over time [5]. Moreover, despite the \nrecommendation to include conference abstracts in systematic literature reviews by both \nCochrane and the United States National Academy of Sciences [6], concerns persist regarding \nthe unclear impact of unpublished conference abstracts on the final conclusions [7] and \ninconsistency between conference abstracts and papers in reporting results [8–10]. Given these \nvarious benefits and concerns, a complete and thorough systematic review requires clinical \noutcomes to be extracted not only from published articles but also from all conference abstracts. \nThis approach allows for the generation of a comprehensive clinical evidence base and for \ngaining insights into the consistency between results from the conference and full paper \nabstracts. Nevertheless, extracting granular information from these sources with sufficient \nprecision, particularly within the context of large-scale datasets, in a timely manner, poses an \nadditional challenge.  \n \nNatural Language Processing (NLP) has proven to be a transformative technology in the medical \nand clinical research domains, offering a significant advantage in extracting clinical data \nelements from unstructured free-text documents [11–13]. Recently, large language models \n(LLMs) have gained tremendous attention within the NLP domain, exhibiting remarkable \ncapabilities in understanding context, reasoning, and processing vast amounts of textual \ninformation [14–16]. The introduction of more potent generative pre-trained transformer (GPT) \nmodels such as ChatGPT and GPT-4, have prompted a thorough investigation into their \neffectiveness across diverse medical applications.  \n \nWithin the realm of information extraction from clinical documents, various LLMs have been \ndeployed in diverse applications, such as analyzing radiology reports [17–19] and electronic \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n4 \nhealth records [15]. In the clinical trial domain, LLMs play crucial roles in trial information \nretrieval [20], criteria text generation [21], and clinical trial eligibility criteria analysis [22].  \nDespite recognized limitations, ChatGPT has also demonstrated value in supporting systematic \nliterature reviews [23]. Notably, prior studies have not explored the application of these models \nfor extracting clinical trial outcomes from conference abstracts, especially in scenarios involving \ndense information presented in both text and tables.  \n \nIn this study, we present \"SEETrials,\" an innovative LLM pipeline designed to automatically \nextract safety and efficacy information from a substantial volume of conference and published \njournal abstracts related to multiple myeloma clinical trial studies. The significance of this study \nlies in addressing the challenge of extracting comprehensive information, especially from \nconference abstracts, which often contain condensed tables with crucial contents briefly \ndescribed or left unspecified due to word limitations. Furthermore, we evaluated the \ngeneralizability of our system by applying it to three additional types of cancer clinical trial \nstudies, assessing its effectiveness across diverse cancer research contexts. The overarching \nobjective is to enhance the accessibility of timely and precise clinical data in a computable \nformat for downstream analysis and synthesizing clinical evidence.  \n \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n5 \nBACKGROUND  \n \nConference abstracts play a crucial role in generating evidence for clinical decision-making \nacross diverse domains, but their dissemination is limited. Time lags from conference abstracts \nto full paper publication [4], and a low conversion rate from abstract to journal paper [9,24,25] \ncontribute to this disparity. Various factors, including time constraints [26] hinder the \npublication of abstracts in full journals. Publication bias further compounds this issue, resulting \nin the underrepresentation of \"not positive or negative\" results or \"positive but not statistically \nsignificant\" results in publications [5,27,28] despite the significance of all study results in \ninfluencing clinical decision-making and patient care. Difficulties in extracting information from \nfree-text formats also pose additional challenges.   \n \nWe focused on multiple myeloma clinical trial studies as a use case for development of our \nLLM model, recognizing the pressing need for timely and precise clinical data in this clinical \ncontext. Despite significant advancements in treatment options and survival rates over the last \n15 years, multiple myeloma remains an incurable malignancy, marked by elevated rates of \nrelapse and therapy resistance [29]. Furthermore, the introduction of numerous new therapies \nhas created significant uncertainty regarding therapy selection and sequencing, given the limited \navailability of consensus guidelines and recent systematic literature reviews [30,31]. Our \nanalysis concentrated on the most recent mechanism of action drugs developed in the last decade \nto explore the feasibility of ensuring timely access to accurate clinical outcomes from both \nannual conference abstracts and published journal abstracts. Leveraging the resulting LLM \npipeline should enhance clinical decision-making and facilitate patient recruitment in clinical \ntrials. \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n6 \nMATERIALS AND METHODS \n \nData \n \nFor the model development and evaluation, we collected 100 clinical trial abstracts related to \nmultiple myeloma from various drug groups, focusing on five different modalities. The sources \nincluded the American Society of Clinical Oncology (ASCO: https://ascopubs.org/jco/meeting ), \nAmerican Society of Hematology conferences (ASH: \nhttps://ashpublications.org/blood/issue/142/Supplement%201 ), and PubMed \n(https://pubmed.ncbi.nlm.nih.gov/ ) websites. The selection was based on keywords (“clinical \ntrial” AND “each modality”). The modalities covered are  1) chimeric antigen receptor T cell \ntherapy (CAR-T therapy) ; idecabtagene vicleucel and ciltacabtagene autoleucel, 2) Bispecific \nAntibodies (BsAbs)/Bispecific T cell engager (BiTE) therapy; talquetamab-tgvs, teclistamab-\ncqyv, and elranatamab-bcmm, 3) Antibody-drug conjugates (ADC) therapy; Belantamab-\nmafodotin, and 4) Cereblon E3 ligase modulator therapy (CELMoD) ; Iberdomide and \nMezigdomide 5) Others abstracts including Histone deacetylase inhibitor (HDACi) and immune \ncheckpoint inhibitors (ICI); pembrolizumab.   \n \nFor the prompt design phase, we used 20 abstracts, followed by 30 abstracts for prompt \ncalibration. Subsequently, another set of 50 abstracts was employed for the system evaluation. \n\"Prompt design\" involved creating initial prompts through manual scrutiny of abstracts, while \n\"prompt calibration\" refined prompts iteratively based on expert evaluation of the system output, \nboth guided by expert judgment (HP and KL). \n \nAfter establishing the system, we implemented the system on an additional 145 multiple \nmyeloma clinical trial study abstracts for comprehensive data analysis, resulting in a total of 245 \nabstracts used for the data analysis. To assess the generalizability of our system, we included 18 \nadditional clinical trial abstracts (6 related to breast cancer, 7 to non-small cell lung cancer, and 5 \nto leukemia) sourced from PubMed. \n \nSEETrials \n \nWe developed SEETrials to extract crucial details from clinical trial studies presented at annual \nconferences and published journal abstracts, leveraging the capabilities of GPT-4. The \nsubsequent sections outline the components of the system and Figure 1 provides a schematic \noverview. \n \nPre-processing steps for abstracts collection and table conversion  \n \nWe collected abstract texts from ASCO, ASH, and PubMed websites. Abstract texts from \nPubMed were directly saved in text format, while those from ASCO and ASH websites were \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n7 \ninitially captured in a Word file and later converted to a text file (UTF-8) to facilitate the \nefficient loading of a substantial number of abstracts for automated data extraction.  Notably, \nabstracts from annual conferences often contain tabular data structures, and the word to text file \nconversion process may lead to formatting issues or broken tables, creating challenges for GPT \ncomprehension. To address potential formatting issues, we developed an \"Automatic Table \nOrganizer\" module leveraging GPT, effectively realigning columns and rows. For ASH \nconference abstracts featuring tables in picture format, we applied Optical Character Recognition \n(OCR) to convert picture files into text files before employing the \"Automatic Table Organizer\" \nfor further processing. Two input variations for abstracts with tables were then generated, one \nwith the table included and one without. \n \nKnowledge ingestion \n \nSEETrials operates on a knowledge-driven framework and require foundational comprehension \nand knowledge of oncology and clinical trials. We did not presume that this knowledge was \ninherent in the GPT models we used. Rather we designed prompts to incorporate foundational \ncomprehension and knowledge of oncology clinical trials. We also incorporated an \nunderstanding of their primary and secondary endpoints for efficacy and safety outcome \nmeasurement.  \n \nPrompt modeling for data extraction and merging outcomes \n \nWe directed our GPT system to extract and align information related to cohort composition. To \nenhance GPT performance and output accuracy, we employed two distinct GPT modules for \neach of the comprehensive prompts: one for \"Individual cohorts/arms and entire group\" and \nanother for \" Individual cohorts/arms and subgroup group\".  \n \nEach prompt included three main components: a general instruction to extract study details, \nclinical safety and efficacy outcomes; the abstract text; and a query. The query explicitly \nrequested information on entities and values for specific tables, with detailed instructions for \nformatting.  \n \nThe outputs from both modules were combined in the subsequent step, where we merged outputs \nfrom the \"Individual cohorts/arms and entire group\" and \" Individual cohorts/arms and subgroup \ngroup\" modules. This merging process employed a prompt to accurately combine extracted \nentities and values and eliminate any overlaps.  \n \nTo finalize the output format, we transferred the results to csv file. In this file, each entity was \nrepresented in individual rows, and associated values for each cohort, entire group, or subgroup \nwere organized in columns to facilitate further downstream analysis. \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n8 \nPostprocessing \n \nWe implemented a post-processing module to refine outputs from the data extracting module by \naddressing two key formatting challenges: (1) addressing undesired allocations of entities and \ntheir corresponding values in the outputs and (2) ensuring that each cell within the value’s \ncolumn contained a singular value, optimizing the presentation for computational analysis.  \n \nEvaluation \nFor the system assessment, we used 50 randomly selected abstracts, manually annotated by \nknowledge experts (KL, NO, and HP). The evaluation was conducted in two ways: a strict \napproach and a relaxed approach. In the strict evaluation, entities and their values, whether in a \nsingle arm or multiple arms, were treated as a unified entity. Any inaccuracies or omissions in \nvalues across different arms, were considered as false positives or false negatives or both for \neach entity (each row in the output file). In the relaxed evaluation, entities and values for each \narm were assessed independently (each cell in the output file). We presented the precision, recall, \nand F1 scores of SEETrials for each abstract, considering both strict and relaxed evaluations. \n \nDescriptive Data Analysis  \n  \nThe Descriptive Data Analysis initiated with the normalization of extracted entities, converting \nterms such as \"OSR\" to \"Overall Survival Rate (OSR)\" for standardization. Subsequently, the \ntotal occurrences of entities across diverse modalities were tabulated, leading to the creation of a \nmaster data file. We examined the distribution and a quantitative overview of entities, \nspecifically emphasizing treatment efficacy and safety, in conjunction with trial phases.  \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n9 \nFigure 1. SEETrials System Overview.  \nSEETrials is an autonomous system designed to extract critical details from clinical trial studies \npresented at annual conferences and published journal abstracts. Utilizing the capabilities of \nGPT-4, the system is delineated in subsequent sections, with a schematic overview of its \ncomponents.  \n \n \n \nASCO, American Society of Clinical Oncology; ASH, American Society of Hematology; LLM, \nLarge language model; GPT, Generative Pre-trained Transformer; ORR, overall response rate; \nMRD, minimum residual disease. \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n10 \nRESULTS \n \nEstablishment and Evaluation of the LLM System, SEETrials \n \nRecognizing potential formatting challenges in abstracts with tables, we developed an \n\"Automatic Table Organizer\" GPT module. This module effectively realigned columns and rows \nin the text file, rectifying any formatting discrepancies. Following the application of the \nAutomatic Table Organizer, we observed improved table information extraction but noted a \ndecrease in performance for extracting main body text information (data not shown). To address \nthis, we input two abstract sets into our GPT system: one with organized tables and the other \nwithout tables. The outcomes from two different input sets were combined in the Merging \nmodule. \n \nThe performance evaluation of SEETrials, conducted on a subset of 50 selected abstracts, is \ndelineated in Table 1. The system demonstrated a high level of precision, recall, and F1 score, \nwith an overall performance of 95.5%, 93.9%, and 94.7%, respectively, across all Mechanisms \nof Action (MOAs) in strict evaluation. In the relaxed evaluation, the system exhibited an even \nhigher performance, achieving an overall precision of 98.1%, a recall of 98.9%, and an F1 score \nof 98.5%. Comprehensive details, including the total number of entities, and values counted, as \nwell as true positive, false positive, and false negative numbers, are provided in the \nsupplementary Table 1. \n  \nTable 1. Performance Metrics of the SEETrials System in Multiple Myeloma Clinical Trial \nStudy Abstracts. \n \n STRICT  RELAXED \nAbstract \nNo.    Precision     Recall     F1-score     Precision     Recall     F1-score  \nAverage 0.955 0.939 0.947 0.979 0.987 0.983 \n1 1 1 1 1 1 1 \n2 1 1 1 1 1 1 \n3 0.965 0.982 0.973 0.996 0.982 0.989 \n4 1 1 1 1 1 1 \n5 0.927 0.864 0.894 0.960 0.984 0.972 \n6 0.957 0.943 0.950 0.994 0.991 0.993 \n7 1 1 1 1 1 1 \n8 1 0.892 0.943 0.925 1 0.961 \n9 1 0.985 0.992 0.990 1 0.995 \n10 1 1 1 1 1 1 \n11 1 1 1 1 1 1 \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n11 \n12 0.917 0.917 0.917 0.975 0.975 0.975 \n13 1 0.975 0.987 0.980 1 0.990 \n14 0.960 0.960 0.960 1 0.990 0.995 \n15 0.824 0.824 0.824 0.949 0.949 0.949 \n16 1 1 1 1 1 1 \n17 1 0.980 0.990 0.992 1 0.996 \n18 1 0.941 0.970 0.970 1 0.985 \n19 0.962 0.962 0.962 0.990 0.990 0.990 \n20 0.635 0.635 0.635 0.878 0.878 0.878 \n21 0.923 0.947 0.935 0.982 0.966 0.974 \n22 1 1 1 1 1 1 \n23 1 1 1 1 1 1 \n24 0.931 0.915 0.923 0.972 0.979 0.976 \n25 1 0.891 0.942 0.924 1 0.961 \n26 0.984 0.984 0.984 0.996 0.996 0.996 \n27 1 0.962 0.980 0.974 1 0.987 \n28 1 0.944 0.971 0.977 1 0.988 \n29 1 1 1 1 1 1 \n30 1 1 1 1 1 1 \n31 1 0.983 0.992 0.994 1 0.997 \n32 1 1 1 1 1 1 \n33 0.900 0.900 0.900 0.990 0.985 0.987 \n34 1 0.979 0.989 0.986 1 0.993 \n35 0.914 0.914 0.914 0.983 1 0.991 \n36 0.816 0.816 0.816 0.969 0.987 0.978 \n37 0.767 0.742 0.754 0.934 0.988 0.961 \n38 1 1 1 1 1 1 \n39 1 1 1 1 1 1 \n40 1 1 1 1 1 1 \n41 1 1 1 1 1 1 \n42 1 1 1 1 1 1 \n43 1 1 1 1 1 1 \n44 0.974 0.974 0.974 0.995 0.995 0.995 \n45 1 1 1 1 1 1 \n46 0.792 0.764 0.778 0.939 0.939 0.939 \n47 0.972 0.921 0.946 0.949 0.978 0.964 \n48 0.895 0.819 0.855 0.914 0.952 0.933 \n49 1 1 1 1 1 1 \n50 0.760 0.760 0.760 0.982 0.949 0.965 \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n12 \nQualitative Error Analysis \n \nWe conducted a qualitative error analysis on individual documents, presenting our findings from \nthe abstracts with F1 scores lower than 80% (4/50 abstracts, # 20, 37, 46, and 50) in Figure 2.  \n \n• Case 1 (#20) is a phase 1 dose-escalation study determining the recommended phase 2 \ndosage (RP2D). It included information on the entire cohort and intervention dosage. \nHowever, data for treatment outcomes, including safety and efficacy, were derived from \na small portion of the RP2D group. The values were redundantly presented for both the \nentire group and the RP2D cohort (Figure 2A). \n \n• Case 2 (#37) represents a dose escalation study (trial phase information was not \nspecified). The study comprises four distinct arms, each associated with a different \ndosage. Despite the abstract's mention of these four arms and the investigational drug \ndosage for each, the cohort size and study findings outlined in the abstract pertain to the \ncombined cohorts 1 and 2, specifically the lowest two doses. Notably, SEETrials \nerroneously presented identical information for both cohort 1 and cohort 2, resulting in a \nuniform cohort size of 6 for each (Figure 2B). \n \n \n• Case 3 (#46) introduces a phase 1 dose-escalation study featuring two arms, each linked \nto a different dosage. The abstract provides information on cohort size and treatment \noutcomes for the overall group, as well as individual details for Arm 1 and Arm 2. \nFurthermore, the abstract introduces specific information about dose escalation \nsubgroups, encompassing cohort size and response rates. While SEETrials accurately \npredicted most entities and values for the entire cohort and Arms 1 and 2, it did not \ncapture information about the dose escalation subgroups (Figure 2C). \n \n• Case 4 (#50) is a phase 3 study with one control arm and three intervention arms with an \ninvestigated drug at three different dosages. SEETrials accurately extracted information \nfor the three intervention arms but missed details on the control arm. This led to all \nclinical finding entities being considered false negatives in STRICT evaluation (F1 \n76%), though in RELAXED evaluation, the overall performance was higher (F1 96%) \ndue to correct extraction for the three intervention arms (Figure 2D).  \n \nAs described, a prevalent source of inaccuracy in the extraction process pertains to cohort \nidentification and categorization. Abstracts frequently encompass diverse clinical information for \nmultiple cohorts, including Dose-escalation, Dose-expansion, RP2D groups, entire groups, and \nsubgroups. The lack of explicit descriptions in the text occasionally poses a challenge for the \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n13 \nsystem in determining the appropriate allocation of values. Additionally, our observations \nrevealed the presence of other errors in the extraction process. \n \n• Author’s affiliation information in PubMed abstracts was extracted and used as the study \nlocation in cases where actual study location was not mentioned in the abstracts. \n \n• Cohort size discrepancies arise when the initial abstract mentions a specific size (e.g., \nn=14) but describes outcomes for a different number (e.g., n=10). Lack of clarification \nabout the missing patients in the cohort further complicates allocation, leading to \noccasional misplacement of entities and values. \n \n• GPT occasionally captures only the percentage value (e.g., 25%) without extracting other \nrelevant information (e.g., 14 patients). To ensure output consistency, improvement is \nneeded for extracting all values and allocating them into separate cells. \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n14 \n \nFigure 2. Examples of the qualitative error analysis. A) Partial output from the abstract #20  \nASCO_ADC. B) Partial output from abstract #37 PubMed_CAR T. C) Partial output from abstract \n#46 ASCO_CAR T. D) Partial output from abstract #50_ASCO_CELDoM.  (Yellow Highlight: \nFalse Positive – Not annotated in Gold Standard but predicted by SEETrials; Red -Colored \nCharacters: False Negative – Annotated in Gold Standard but not predicted by SEETrials) \n \nA) \n \n \n \nB) \n \n \n \nC) \n \n \n \nD) \n \n \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n15 \nAnalyzing Extracted Entities from Abstracts \n \nWe curated a comprehensive dataset comprising 245 abstracts, covering diverse therapeutic \nmodalities. This includes 130 abstracts related to CAR-T cell therapies, 63 to BsAbs/BiTE \ntherapies, 38 to ADC therapies, 6 to CELMoD therapies, 4 to HDACi therapies, and 4 to ICI \ntherapies. Among these, there were 75, 47, 46, and 16 abstracts corresponding to phases 1, 1/2, 2, \nand 3. 61 abstracts did not have phase information. The distribution of clinical trial phases in \neach modality is detailed in Table 2. \n \nTable 3 and Supplemental Table 2 present the descriptive statistics of extracted clinical \noutcomes, focusing on treatment effectiveness and safety across three distinct modalities. \nThe complete list of extracted data elements was detailed in Figure 3.  Notably, the overall \nresponse rate emerged as the most frequently reported entity related to treatment efficacy in \nclinical trial abstracts, with percentages of 23.9% in CAR T studies, 27.3% in BsAbs/BiTE \nstudies, and 25% in ADC studies. Complete response rates were prominent, particularly in CAR \nT studies at 21.8% and in BsAbs//BiTE studies at 15.4%. Similarly, (very good) partial \nresponses were noteworthy in ADC studies, accounting for 20% of the mentions. \nThe entity of minimal residual disease featured prominently in CAR T cell therapy clinical trial \nabstracts (8%), surpassing mentions in BsAbs/BiTE (3.5%) and ADC (2.5%) studies. \n \nExamining safety-related entities, neutropenia emerged as the most frequently mentioned \nadverse event across all three modalities, with percentages of 13.4% in CAR T, 13.5% in \nBsAbs//BiTE, and 12.4% in ADC studies. Cytokine release syndrome was prevalent, with rates \nof 13.0% in CAR T, 9% in BsAbs//BiTE, and 8.6% in ADC studies. Thrombocytopenia and \nanemia were also commonly cited adverse events across modalities, showing variations in \npercentages. Infection occurrences were noted in 4.8% of CAR T studies, while higher \npercentages of 12% and 8.6% were observed in BsAbs/BiTE and ADC studies, respectively. \n \nFigure 4 provides a visual summary of the percentages of 11 efficacy and safety-related entities \nacross the three modalities, offering a comprehensive overview of the comparative landscape. \nThese findings contribute to a deeper understanding of the distinct clinical profiles associated \nwith CAR T cell therapy, BsAbs/BiTE, and ADC modalities, facilitating informed decision-\nmaking in therapeutic development. \n \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n16 \n \nTable 2. Characteristics overview of abstracts included. \n \n  Total  phase 1 phase 1/2 phase 2 phase 3 Not mentioned \nCART 130 40 16 26 5 43 \nBsAbs/BiTE 63 19 18 10 6 10 \nADC 38 10 9 10 2 7 \nCELMoD&Others 14 6 4 0 3 1 \nTotal 245 75 47 46 16 61 \nCAR T, chimeric antigen receptor T cell; BsAbs, Bispecific antibody; BiTE, Bispecific T cell \nengager; ADC, antibody drug conjugate; Cereblon E3 ligase modulator therapy, CELMoD. \n \n \nTable 3. Descriptive statistics of extracted clinical outcomes on treatment efficacy.  \n \nEntities related \nto efficacy \nCAR T (n) CAR T (%) BsAbs/BiTE (n) BsAbs/BiTE (%) ADC (n) ADC (%) \nORR        69 23.9 39 27.3 20 25.0 \nCR            63 21.8 22 15.4 8 10.0 \n(VG)PR           43 14.9 19 13.3 16 20.0 \nPFS      32 11.1 13 9.1 7 8.8 \nMRD     23 8.0 5 3.5 2 2.5 \nOS                 20 6.9 15 10.5 8 10.0 \nDoR           15 5.2 15 10.5 8 10.0 \nSD                  8 2.8 2 1.4 4 5.0 \nPD            7 2.4 0 0.0 0 0.0 \nTTR             5 1.7 3 2.1 2 2.5 \nMR                 4 1.4 3 2.1 1 1.3 \nTTP           0 0.0 3 2.1 0 0.0 \nTTTD 0 0.0 1 0.7 0 0.0 \nTTTF    0 0.0 0 0.0 0 0.0 \nTTNT      0 0.0 3 2.1 2 2.5 \nDCR           0 0.0 0 0.0 2 2.5 \nCAR T, chimeric antigen receptor T cell; BsAbs, Bispecific antibody; BiTE, Bispecific T cell \nengager; ADC, antibody drug conjugate; ORR, overall response rate; CR, complete response; \n(VG)PR, (very good) partial response; PFS, progression free survival; MRD, minimum residual \ndisease; OS, overall survivor; DoR, duration of response; SD, stable disease; PD, progressive \ndisease; TTR, time to response; MR, minimal response; TTP, time to progress; TTTD, time to \ntreatment discontinuation; TTTF, time to treatment failure; TTNT, time to next treatment; DCR, \ndisease control rate. \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n17 \nIn Figures 5 and 6, we present a detailed breakdown of trial numbers and percentages stratified \nby clinical trial phases (phases 1, 1/2, 2, and 3) for efficacy and safety-related entities, \nrespectively. Notably, response rates and status-related entities were frequently reported in phase \n1 studies, indicating a focus on early indications of treatment efficacy. Conversely, survival or \ntreatment duration-related entities were predominantly extracted in phase 2 studies, highlighting \na shift towards assessing prolonged treatment effects and overall therapeutic impact. \n \nThe distribution of adverse event entities exhibited consistency across different phases of \nclinical trials. Only noticeable differences were observed in fatal adverse events which appear \nsignificantly more in later phase trials compared to phase 1 initial study. This observation \nsuggests that longer follow-up times and or increased number of patients can show more severe \ngrade of adverse events that were not detected in phase 1 safety study.   \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n18 \nFigure 3. Comprehensive Overview of Extracted Granular Entities for Study details, \nTreatment Efficacy, and Safety.  This illustrates a comprehensive breakdown of extracted \ngranular entities, encompassing Study Details, Treatment Efficacy, and Treatment Safety \nparameters, with a total of 16, 18, and 36 entities respectively, offering a detailed overview of the \nclinical trial landscape. \n \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n19 \nFigure 4.  Comparative Landscape of Efficacy and Safety Entities Across CAR T, \nBsAbs/BiTE, and ADC Modalities.  This visual summary illustrates the percentages of 11 efficacy and 13 \nsafety-related entities across CAR T cell therapy, BsAbs/BiTE, and ADC modalities, providing a comprehensive \noverview of their comparative clinical profiles. A) Entities related to treat ment effectiveness. B) Entities related to \ntreatment safety.  \n \nCAR T, chimeric antigen receptor T cell; BsAbs, Bispecific antibody; BiTE, Bispecific T cell \nengager; ADC, antibody drug conjugate; ORR, overall response rate; CR, complete response; \n(VG)PR, (very good) partial response; PFS, progression free survival; MRD, minimum residual \ndisease; OS, overall survivor; DoR, duration of response; SD, stable disease; PD, progressive \ndisease; TTR, time to response; MR, minimal response; TTP, time to progress; TTTD, time to \ntreatment discontinuation; TTTF, time to treatment failure; TTNT, time to next treatment; DCR, \ndisease control rate; CRS, cytokine release syndrome; Aes, adverse events; ICANS, immune \neffector cell associated neurotoxicity syndrome. \n \n \n \n \n \n \n \n \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n20 \nFigure 5. Trial Numbers Stratified by Clinical Trial Phases for Efficacy-Related Entities.   \nA detailed breakdown of trial numbers and percentages is presented, categorizing clinical trials into phases 1, 1/2, 2, \nand 3 for efficacy-related entities. A and B: CAR T cell therapies. C and D: BsAbs/BiTE therapies. E and F: ADC \ntherapies.  \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n21 \nCAR T, chimeric antigen receptor T cell; BsAbs, Bispecific antibody; BiTE, Bispecific T cell \nengager; ADC, antibody drug conjugate; ORR, overall response rate; CR, complete response; \n(VG)PR, (very good) partial response; PFS, progression free survival; MRD, minimum residual \ndisease; OS, overall survivor; DoR, duration of response; SD, stable disease; PD, progressive \ndisease; TTR, time to response; MR, minimal response. \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n22 \nFigure 6. Trial Numbers Stratified by Clinical Trial Phases for Safety-Related Entities.  \nThis figure provides a detailed breakdown of trial numbers and percentages stratified by clinical trial phases (phases \n1, 1/2, 2, and 3) for safety-related entities. A and B: CAR T cell therapies. C and D: BsAbs/BiTE therapies. E and F: \nADC therapies. \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n23 \nCAR T, chimeric antigen receptor T cell; BsAbs, Bispecific antibody; BiTE, Bispecific T cell \nengager; ADC, antibody drug conjugate; CRS, cytokine release syndrome; FAEs, fatal adverse \nevents; ICANS, immune effector cell associated neurotoxicity syndrome. \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n24 \n \nEvaluating the Generalizability of the System \n \nWe implemented our system on randomly chosen cancer clinical trial studies, including two solid \ncancers (breast cancer and lung cancer) and one hematologic cancer (leukemia). The performance \nscores across 18 abstracts are highly consistent with both each o ther and the earlier 50 multiple \nabstracts (refer to Table 4). The average precision, recall, and F1 score s in strict evaluation were \n96.9%, 95.4%, and 96.1%, respectively. Comprehensive details, including the total number of \nentities, and values counted, as well as true positive, false positive, and false negative numbers, in \nthese 18 abstract analyses, are provided in the supplementary Table 2. \n \n \nTable 4. Performance Metrics of the SEETrials System in Various Cancer Clinical Trial Study \nAbstracts \n \n STRICT RELAXED \nAbstract \nNo. Disease type Precision Recall F1-score Precision Recall F1-score \nAverage   0.969 0.954 0.961 0.980 0.992 0.986 \n1 Breast cancer 1 1 1 1 1 1 \n2 Breast cancer 0.969 0.969 0.969 0.992 0.992 0.992 \n3 Breast cancer 0.970 0.914 0.941 0.942 1 0.970 \n4 Breast cancer 0.861 0.861 0.861 0.965 0.965 0.965 \n5 Breast cancer 1 1 1 1 1 1 \n6 Breast cancer 0.963 1 0.981 1 0.972 0.986 \n7 Lung cancer 1 1 1 1 1 1 \n8 Lung cancer 1 0.955 0.977 0.977 1 0.988 \n9 Lung cancer 0.838 0.838 0.838 0.959 0.959 0.959 \n10 Lung cancer 0.967 0.967 0.967 0.983 0.983 0.983 \n11 Lung cancer 0.958 0.958 0.958 0.993 0.993 0.993 \n12 Lung cancer 1 0.956 0.977 0.966 1 0.983 \n13 Lung cancer 1 1 1 1 1 1 \n14 Leukemia 1 0.963 0.981 0.981 1 0.990 \n15 Leukemia 1 0.936 0.967 0.975 1 0.987 \n16 Leukemia 0.973 0.973 0.973 0.989 0.995 0.992 \n17 Leukemia 0.925 0.925 0.925 0.981 0.981 0.981 \n18 Leukemia 1 0.976 0.988 0.982 1 0.991 \n \n \n \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n25 \nDISCUSSION \n \nIn the development of our knowledge-driven system, SEETrials, our primary aim was the \nsystematic extraction of clinical trial study details and treatment outcomes and their \ncorresponding values automatically, from abstracts of multiple myeloma clinical trial studies. \nThis encompassed both conference abstracts and published article abstracts. Our study \nsignificantly contributes by strategically addressing the challenge of extracting comprehensive \ninformation, particularly from conference abstracts. These abstracts often present condensed \ntables, where crucial content is concisely summarized or left unspecified in the main text due to \nword limitations. Moreover, our study significantly improved the accessibility of timely and \nprecise clinical data in a computable format for downstream data analysis.  \n \nThe implementation of \"SEETrials\" demonstrated remarkable potential, evidenced by high \nprecision, recall, and F1 scores of 95.5%, 93.9%, and 94.7%, respectively. These robust \nperformance metrics serve as a validation of the efficacy of our pipeline in the accurate \nextraction of detailed information from multiple myeloma clinical trial studies. Additionally, this \nstudy systematically explored the zero-shot capabilities of GPT-4 [20,32], particularly in tasks \nsuch as interventions and the recognition of treatment outcome entities. These tasks included the \nassociation of outcomes with corresponding values in each cohort and the classification of \ncohorts, all seamlessly executed through the use of efficiently designed single-turn prompts. \nNotably, our findings underscored the adaptability of a comprehensive prompt initially tailored \nfor a specific cancer clinical trial (e.g., Multiple Myeloma) to successfully extract trial \ninformation from diverse cancer types (e.g., breast cancer, lung cancer, and leukemia). This \nobservation underscores the expansive applicability of SEETrials, ensuring the uniform analysis \nof clinical trial study outcomes across diverse disease domains. Consequently, this enhances \nanalysis efficiency, scalability, and interoperability within the field. To our knowledge, this \nstudy marks a pioneering attempt to explore the zero-shot capabilities of a GPT-powered model \nfor the comprehensive extraction of clinical trial study outcomes from various types of abstracts, \nin addition to our previously established system—a generalizable clinical trial eligibility criteria \nextraction system powered by a large language model [22].  \n \nIn this study, we analyzed a range of drug modalities within the framework of multiple \nmyeloma, with specific emphasis on CAR-T, BsAbs/BiTE, ADCs, and CELMoD therapies. The \nexamination of treatment efficacy and safety outcome distributions across diverse drug \nmodalities and trial phases yielded valuable insights. A thorough understanding of how these \noutcomes vary across different modalities and phases is crucial for contextualizing clinical trial \nresults. Notably, phase 1 studies exhibit a prevalence of response rates and status-related entities, \nhighlighting an emphasis on early indicators of treatment efficacy while phase 2 studies have \nmore survival or treatment duration-related entities, indicating an evolving focus on prolonged \ntreatment effects and overall therapeutic impact as trials progress. Our study aligns with existing \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n26 \nliterature, revealing differences in infection occurrences among different modalities, reflecting \nconsistent safety profiles in CAR T studies, BsAbs/BiTE studies, and ADC studies [33,34]. \nInterestingly, our analysis indicates notable differences in the incidence of fatal adverse events \nbetween later phase trials and the initial phase 1 study. The increased prevalence of fatal adverse \nevents in later phases raises considerations regarding the dynamics of safety assessments over \ntime. A plausible explanation is the potential manifestation of more severe grades of adverse \nevents with longer follow-up times and an increased number of enrolled patients. This suggests \nthat certain adverse events, particularly those of a more critical nature, may not be readily \napparent during early clinical development, emphasizing the critical importance of extended \nfollow-up periods and larger patient cohorts. While phase 1 studies provide crucial insights into \ninitial safety profiles, the evolution of adverse events, particularly those with fatal outcomes, \nbecomes more apparent in subsequent phases. Therefore, these observed differences underscore \nthe need for sustained vigilance and thorough monitoring in later phases to capture and address \nadverse events that may emerge with prolonged exposure or in a broader patient population. \n \nWhile this study did not place significant emphasis on certain aspects, future work could delve \ninto critical details such as previous treatment history (e.g., the percentage of patients with a \ndifferent prior line of therapy, specific numbers like \"triple-class refractory\" multiple myeloma), \nthe percentage of high-risk cytogenetics or other high risk group patients, or the percentage of \npatients with specific biomarkers (e.g., PD-1 or mismatch repair status etc.) enrolled in the study \nfor more in-depth analysis. We also would like to expand the adaptability in various conference \nabstracts in future study. Furthermore, the feasibility test comparing treatment outcomes in \nearlier conference abstracts and subsequent full articles leveraging SEETrials’ potential can \naddress community inquiries. Concerns about reporting accuracy in conference abstracts arise \nfrom the lack of elaborate peer-reviews unlike publications [7].  \n \nCONCLUSION \n \nWe developed SEETrials, a GPT-based system with broad applicability, capable of identifying \ngranular safety and efficacy entities across various clinical trial studies. The system \ndemonstrated high precision, recall, and F1, affirming its reliability and accuracy. SEETrials \nshows significant potential in ensuring timely and accurate data extraction and facilitating \nefficient dissemination of clinical trial outcomes. \n \nFUNDING \nThis work did not receive any specific grant or funding support. \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n27 \nAUTHOR CONTRIBUTIONS \nHP, KL, SD and XW conceptualized the study design, spearheaded the development and \nevaluation of the system. HP, KL, SD, and LH led the data extraction, prompt engineering and \ncomputational analysis, and drafted the initial manuscript. HP, KL, and NO oversaw the \nknowledge ingestion, gold standard and coordinated the evaluation of the system. HP, KL, SD, \nLH, FM, JW, HX and XW edited and revised the manuscript. LH, JH, and JW provided the \ninfrastructure support for computation. All authors read and approved the final manuscript.   \n \nCONFLICT OF INTEREST STATEMENT \nHP, KL, SD, LH, NO, FM, JW, and XW are currently employees of IMO health Inc. JW is \ncurrently employees of Brown university. HX is currently employees of Yale university. No \nother conflict of interest.  \n \nDATA AVAILABILITY \nThe SEETrials source code, prompts, and output are available at [URL provided upon \nacceptance]. \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n28 \nReferences \n1  Subbiah V. The next generation of evidence-based medicine. Nat Med. 2023;29:49–58. \n2  Chen EX, Tannock IF. Risks and Benefits of Phase 1 Clinical Trials Evaluating New \nAnticancer Agents: A Case for More Innovation. JAMA. 2004;292:2150. \n3  Weber JS, Levit LA, Adamson PC, et al. American Society of Clinical Oncology Policy \nStatement Update: The Critical Role of Phase I Trials in Cancer Research and Treatment. \nJCO. 2015;33:278–84. \n4  Wright EC, Kapuria D, Ben-Yakov G, et al. Time to Publication for Randomized Clinical \nTrials Presented as Abstracts at Three Gastroenterology and Hepatology Conferences in \n2017. Gastro Hep Adv. 2023;2:370–9. \n5  Scherer RW, Meerpohl JJ, Pfeifer N, et al. Full publication of results initially presented in \nabstracts. Cochrane Database Syst Rev. 2018;11:MR000005. \n6  Scherer RW, Saldanha IJ. How should systematic reviewers handle conference abstracts? A \nview from the trenches. Syst Rev. 2019;8:264. \n7  Schmucker CM, Blümle A, Schell LK, et al. Systematic review finds that study data not \npublished in full text articles have unclear impact on meta-analyses results in medical \nresearch. PLoS ONE. 2017;12:e0176210. \n8  Rowhani-Farid A, Hong K, Grewal M, et al. Consistency between trials presented at \nconferences, their subsequent publications and press releases. BMJ Evid Based Med. \n2023;28:95–102. \n9  Snedeker KG, Campbell M, Totton SC, et al. Comparison of outcomes and other variables \nbetween conference abstracts and subsequent peer-reviewed papers involving pre-harvest or \nabattoir-level interventions against foodborne pathogens. Prev Vet Med. 2010;97:67–76. \n10  Li G, Abbade LPF, Nwosu I, et al. A scoping review of comparisons between abstracts and \nfull reports in primary biomedical research. BMC Med Res Methodol. 2017;17:181. \n11  Sheikhalishahi S, Miotto R, Dudley JT, et al. Natural Language Processing of Clinical Notes \non Chronic Diseases: Systematic Review. JMIR Med Inform. 2019;7:e12239. \n12  Cook MJ, Yao L, Wang X. Facilitating accurate health provider directories using natural \nlanguage processing. BMC Med Inform Decis Mak. 2019;19:80. doi: 10.1186/s12911-019-\n0788-x \n13  Dave AD, Ruano G, Kost J, et al. Automated Extraction of Pain Symptoms: A Natural \nLanguage Approach using Electronic Health Records. Pain Physician. 2022;25:E245–54. \n14  Singhal K, Azizi S, Tu T, et al. Large Language Models Encode Clinical Knowledge. \nPublished Online First: 2022. doi: 10.48550/ARXIV.2212.13138 \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n29 \n15  Yang X, Chen A, PourNejatian N, et al. A large language model for electronic health \nrecords. npj Digit Med. 2022;5:194. \n16  Arsenyan V, Shahnazaryan D. Large Language Models for Biomedical Causal Graph \nConstruction. Published Online First: 2023. doi: 10.48550/ARXIV.2301.12473 \n17  Reichenpfader D, Müller H, Denecke K. Large language model-based information extraction \nfrom free-text radiology reports: a scoping review protocol. Health Informatics 2023. \nhttps://doi.org/10.1101/2023.07.28.23292031 \n18  Fink HA, Linskens EJ, Silverman PC, et al. Accuracy of Biomarker Testing for \nNeuropathologically Defined Alzheimer Disease in Older Adults With Dementia. Ann Intern \nMed. 2020;172:669–77. \n19  Hasani AM, Singh S, Zahergivar A, et al. Evaluating the performance of Generative Pre-\ntrained Transformer-4 (GPT-4) in standardizing radiology reports. Eur Radiol. Published \nOnline First: 8 November 2023. doi: 10.1007/s00330-023-10384-x \n20  Hu Y, Ameer I, Zuo X, et al. Zero-shot Clinical Entity Recognition using ChatGPT. \nPublished Online First: 2023. doi: 10.48550/ARXIV.2303.16416 \n21  Peikos G, Symeonidis S, Kasela P, et al. Utilizing ChatGPT to Enhance Clinical Trial \nEnrollment. Published Online First: 2023. doi: 10.48550/ARXIV.2306.02077 \n22  Datta S, Lee K, Paek H, et al. AutoCriteria: a generalizable clinical trial eligibility criteria \nextraction system powered by large language models. J Am Med Inform Assoc. \n2023;ocad218. \n23  Anghelescu A, Firan FC, Onose G, et al. PRISMA Systematic Literature Review, including \nwith Meta-Analysis vs. Chatbot/GPT (AI) regarding Current Scientific Data on the Main \nEffects of the Calf Blood Deproteinized Hemoderivative Medicine (Actovegin) in Ischemic \nStroke. Biomedicines. 2023;11:1623. \n24  Collier T, Roadley-Battin M, Darlow C, et al. Analysis of conference abstract-to-publication \nrate in UK orthopaedic research. BMJ Evid Based Med. 2018;23:7–11. \n25  Coppens DG, Gardarsdottir H, van den Bogert CA, et al. Publication rates and reported \nresults in a cohort of gene- and cell-based therapy trials. Regen Med. 2020;15:1215–27. \n26  Scherer RW, Ugarte-Gil C, Schmucker C, et al. Authors report lack of time as main reason \nfor unpublished research presented at biomedical conferences: a systematic review. Journal \nof Clinical Epidemiology. 2015;68:803–10. \n27  Ioannidis JPA. Effect of the Statistical Significance of Results on the Time to Completion \nand Publication of Randomized Efficacy Trials. JAMA. 1998;279:281. \n28  Stern JM, Simes RJ. Publication bias: evidence of delayed publication in a cohort study of \nclinical research projects. BMJ. 1997;315:640–5. \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n30 \n29  Cowan AJ, Green DJ, Kwok M, et al. Diagnosis and Management of Multiple Myeloma: A \nReview. JAMA. 2022;327:464. \n30  Van Nieuwenhuijzen N, Frunt R, May AM, et al. Therapeutic outcome of early-phase \nclinical trials in multiple myeloma: a meta-analysis. Blood Cancer J. 2021;11:44. \n31  Tanenbaum B, Miett T, Patel SA. The emerging therapeutic landscape of relapsed/refractory \nmultiple myeloma. Ann Hematol. 2023;102:1–11. \n32  Kartchner D, Ramalingam S, Al-Hussaini I, et al. Zero-Shot Information Extraction for \nClinical Meta-Analysis using Large Language Models. The 22nd Workshop on Biomedical \nNatural Language Processing and BioNLP Shared Tasks. Toronto, Canada: Association for \nComputational Linguistics 2023:396–405. https://doi.org/10.18653/v1/2023.bionlp-1.37 \n33  Swan D, Murphy P, Glavey S, et al. Bispecific Antibodies in Multiple Myeloma: \nOpportunities to Enhance Efficacy and Improve Safety. Cancers (Basel). 2023;15:1819. \n34  Raje N, Anderson K, Einsele H, et al. Monitoring, prophylaxis, and treatment of infections in \npatients with MM receiving bispecific antibody therapy: consensus recommendations from \nan expert panel. Blood Cancer J. 2023;13:116. \n \n \n \n \n \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n31 \nSupplemental Table 1. Comprehensive summary of entities and values counted, true positive, \nfalse positive, and false negative numbers from multiple myeloma studies \n \nNote: Row means entities and their values, whether in a single arm or multiple arms, as a unified \nentity. Cell means entities and values for each arm, which were assessed independently. \n \nAbstract \nNo. \nTotal \nRows \nCompared  \n   True \nPositives  \n   False \nPositives  \n   False \nNegatives \nTotal Cells \nCompared  \n   True \nPositives  \n   False \nPositives  \n   False \nNegatives  \n1 53 46 0 0 138 138 0 0 \n2 59 55 0 0 165 165 0 0 \n3 61 55 2 1 285 279 1 5 \n4 34 31 0 0 93 93 0 0 \n5 48 38 3 6 264 242 10 4 \n6 76 66 3 4 350 342 2 3 \n7 39 34 0 0 204 204 0 0 \n8 40 33 0 4 111 99 8 0 \n9 70 66 0 1 201 198 2 0 \n10 61 58 0 0 290 290 0 0 \n11 50 43 0 0 172 172 0 0 \n12 29 22 2 2 120 117 3 3 \n13 46 39 0 1 200 195 4 0 \n14 29 24 1 1 100 99 0 1 \n15 38 28 6 6 272 258 14 14 \n16 36 33 0 0 132 132 0 0 \n17 55 48 0 1 245 240 2 0 \n18 38 32 0 2 136 128 4 0 \n19 30 25 1 1 104 103 1 1 \n20 68 40 23 23 189 166 23 23 \n21 42 36 3 2 117 112 2 4 \n22 28 24 0 0 144 144 0 0 \n23 34 30 0 0 240 240 0 0 \n24 66 54 4 5 300 281 8 6 \n25 68 57 0 7 192 171 14 0 \n26 67 60 1 1 549 547 2 2 \n27 56 50 0 2 156 150 4 0 \n28 42 34 0 2 180 170 4 0 \n29 33 29 0 0 87 87 0 0 \n30 45 42 0 0 126 126 0 0 \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n32 \n31 67 59 0 1 360 354 2 0 \n32 71 63 0 0 252 252 0 0 \n33 46 36 4 4 200 196 2 3 \n34 51 46 0 1 141 138 2 0 \n35 40 32 3 3 175 172 3 0 \n36 43 31 7 7 228 221 7 3 \n37 37 23 7 8 186 171 12 2 \n38 29 26 0 0 78 78 0 0 \n39 37 33 0 0 99 99 0 0 \n40 45 40 0 0 120 120 0 0 \n41 45 41 0 0 205 205 0 0 \n42 46 41 0 0 123 123 0 0 \n43 52 46 0 0 230 230 0 0 \n44 44 38 1 1 195 194 1 1 \n45 46 42 0 0 126 126 0 0 \n46 61 42 11 13 220 199 13 13 \n47 42 35 1 3 342 317 17 7 \n48 89 68 8 15 415 360 34 18 \n49 65 61 0 0 183 183 0 0 \n50 30 19 6 6 175 166 3 9 \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n33 \nSupplemental Table 2. Descriptive statistics of extracted clinical outcomes on treatment safety. \n \nEntities related to \nsafety CAR T (n) CAR T (%) BsAbs/BiTE \n(n) \nBsAbs/BiTE \n(%) ADC (n) ADC (%) \n Neutropenia                36 13.4 18 13.5 13 12.4 \n CRS              35 13.0 12 9.0 9 8.6 \n Thrombocytopenia     30 11.2 10 7.5 9 8.6 \n Anemia                          25 9.3 15 11.3 8 7.6 \n Neurotoxicity       25 9.3 10 7.5 3 2.9 \n Fatal AEs                   17 6.3 6 4.5 7 6.7 \n Fatigue          14 5.2 5 3.8 4 3.8 \n ICANS                            14 5.2 9 6.8 3 2.9 \n Infections                      13 4.8 16 12.0 9 8.6 \n Lymphopenia               13 4.8 6 4.5 4 3.8 \n Leukopenia                   10 3.7 2 1.5 1 1.0 \n Diarrhea                        9 3.3 2 1.5 2 1.9 \n Severe AEs                   5 1.9 1 0.8 3 2.9 \n Cytopenia                     4 1.5 1 0.8 1 1.0 \n URT Infections           3 1.1 1 0.8 1 1.0 \n AEs Leading \nDiscontinuation \n2 0.7 4 3.0 3 2.9 \n Constipation                2 0.7 0 0.0 1 1.0 \n DLT                 2 0.7 0 0.0 0 0.0 \n Hypertension               2 0.7 1 0.8 0 0.0 \n Hyponatremia              2 0.7 0 0.0 0 0.0 \nAEs Leading Dose \nReductions \n1 0.4 1 0.8 0 0.0 \n Dysgeusia   1 0.4 4 3.0 4 3.8 \n Dyspnea   1 0.4 1 0.8 0 0.0 \n Hematologic AEs 1 0.4 0 0.0 0 0.0 \n Nail- AEs                1 0.4 3 2.3 2 1.9 \n Skin-AEs               1 0.4 3 2.3 4 3.8 \n TRAEs (Gr≥3) 0 0.0 1 0.8 2 1.9 \n BCVA         0 0.0 0 0.0 0 0.0 \n Blurred vision 0 0.0 0 0.0 2 1.9 \n Dry eye 0 0.0 0 0.0 0 0.0 \nHypophosphatemia 0 0.0 0 0.0 2 1.9 \n Immune-AEs               0 0.0 0 0.0 0 0.0 \n ISR                    0 0.0 1 0.8 1 1.0 \n Keratitis                        0 0.0 0 0.0 0 0.0 \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n34 \n Keratometry  0 0.0 0 0.0 0 0.0 \n Keratopathy     0 0.0 0 0.0 3 2.9 \n Ocular-AEs                  0 0.0 0 0.0 1 1.0 \n PSN          0 0.0 0 0.0 2 1.9 \n Pneumonia        0 0.0 0 0.0 0 0.0 \n TRAEs      0 0.0 0 0.0 1 1.0 \nCAR T, chimeric antigen receptor T cell; BsAbs, Bispecific antibody; BiTE, Bispecific T cell \nengager; ADC, antibody drug conjugate; CRS, cytokine release syndrome; AEs, adverse events; \nICANS, immune effector cell associated neurotoxicity syndrome; URT, upper respiratory tract \ninfections; TRAEs, treatments related adverse events; BCVA, best corrected visual acuity; ISR, \ninjection site reaction; PSN, peripheral sensory neuropathy.   \n \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n35 \n \nSupplemental Table 3. Comprehensive summary of entities and values counted, true positive, \nfalse positive, and false negative numbers from multiple myeloma studies \n \nNote: Row means entities and their values, whether in a single arm or multiple arms, as a unified \nentity. Cell means entities and values for each arm, which were assessed independently. \n \nAbstract \nNo. Disease type \nTotal \nRows \nCompared  \n   True \nPositives  \n   False \nPositives  \nFalse \nNegatives  \nTotal Cells \nCompared  \n   True \nPositives  \n   False \nPositives  \n   False \nNegatives  \n1 Breast cancer 35 31 0 0 93 93 0 0 \n2 Breast cancer 38 31 1 1 128 127 1 1 \n3 Breast cancer 40 32 1 3 210 194 12 0 \n4 Breast cancer 42 31 5 5 144 139 5 5 \n5 Breast cancer 63 55 0 0 220 220 0 0 \n6 Breast cancer 30 26 1 0 108 104 0 3 \n7 Lung cancer 30 27 0 0 108 108 0 0 \n8 Lung cancer 52 42 0 2 176 168 4 0 \n9 Lung cancer 42 31 6 6 148 142 6 6 \n10 Lung cancer 33 29 1 1 120 118 2 2 \n11 Lung cancer 29 23 1 1 144 143 1 1 \n12 Lung cancer 51 43 0 2 180 172 6 0 \n13 Lung cancer 38 35 0 0 105 105 0 0 \n14 Leukemia 32 26 0 1 162 156 3 0 \n15 Leukemia 53 44 0 3 376 352 9 0 \n16 Leukemia 41 36 1 1 185 183 2 1 \n17 Leukemia 44 37 3 3 160 157 3 3 \n18 Leukemia 45 41 0 1 168 164 3 0 \n  \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint \n36 \n \nAll rights reserved. No reuse allowed without permission. \n(which was not certified by peer review) is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. \nThe copyright holder for this preprintthis version posted January 20, 2024. ; https://doi.org/10.1101/2024.01.18.24301502doi: medRxiv preprint ",
  "topic": "Generalizability theory",
  "concepts": [
    {
      "name": "Generalizability theory",
      "score": 0.7664449214935303
    },
    {
      "name": "Medicine",
      "score": 0.7224774956703186
    },
    {
      "name": "Clinical trial",
      "score": 0.6310911178588867
    },
    {
      "name": "Internal medicine",
      "score": 0.546104907989502
    },
    {
      "name": "Oncology",
      "score": 0.5257973074913025
    },
    {
      "name": "Adverse effect",
      "score": 0.5021607875823975
    },
    {
      "name": "Tolerability",
      "score": 0.41540202498435974
    },
    {
      "name": "Medical physics",
      "score": 0.33702197670936584
    },
    {
      "name": "Psychology",
      "score": 0.11891800165176392
    },
    {
      "name": "Developmental psychology",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I27804330",
      "name": "Brown University",
      "country": "US"
    },
    {
      "id": "https://openalex.org/I32971472",
      "name": "Yale University",
      "country": "US"
    }
  ],
  "cited_by": 4
}