{
    "title": "Enhancing IoT Security: Predicting Password Vulnerability and Providing Dynamic Recommendations using Machine Learning and Large Language Models",
    "url": "https://openalex.org/W4407739143",
    "year": 2025,
    "authors": [
        {
            "id": "https://openalex.org/A5116327233",
            "name": "Mariam Gewida",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2288680888",
            "name": "Yanzhen Qu",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W4401857375",
        "https://openalex.org/W4399710201",
        "https://openalex.org/W2963777176",
        "https://openalex.org/W2891406774",
        "https://openalex.org/W3157680283",
        "https://openalex.org/W3003377235",
        "https://openalex.org/W3161919951",
        "https://openalex.org/W4211205828",
        "https://openalex.org/W4220836074",
        "https://openalex.org/W4309728390",
        "https://openalex.org/W4401324453",
        "https://openalex.org/W4393985835",
        "https://openalex.org/W4224028562",
        "https://openalex.org/W4391285268",
        "https://openalex.org/W4396775672",
        "https://openalex.org/W3151685851"
    ],
    "abstract": "The rapid growth of IoT has increased security vulnerabilities, especially from weak passwords. This study aims to develop and validate a machine learning tool to predict password vulnerabilities in smart home IoT devices and provide dynamic recommendations using a Large Language Model (LLM). The research addresses gaps in existing security measures by offering a data-driven model that predicts vulnerabilities and provides real-time, tailored recommendations. Archival data from previous IoT security research, including password cracking attempts, were used to train the model. Testing involved real-world password data and adversarial scenarios, with performance evaluated using accuracy, precision, recall, and F1-score. The findings show significant improvements in recall and F1-score with the Retrieval Augmented Generation (RAG) architecture compared to the baseline, suggesting RAG’s potential in enhancing IoT security. Organizations can use this model to improve their infrastructure’s security, reducing risks from weak passwords.",
    "full_text": null
}