{
  "title": "Leveraging Knowledge Graphs and LLMs to Support and Monitor Legislative Systems",
  "url": "https://openalex.org/W4403582498",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A2593951953",
      "name": "Colombo Andrea",
      "affiliations": [
        "Politecnico di Milano"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2293099500",
    "https://openalex.org/W2996749332",
    "https://openalex.org/W6637646797",
    "https://openalex.org/W2965723991",
    "https://openalex.org/W2734291210",
    "https://openalex.org/W4390692489",
    "https://openalex.org/W4200468156",
    "https://openalex.org/W2942071337",
    "https://openalex.org/W1723826121",
    "https://openalex.org/W4281565922",
    "https://openalex.org/W2594908799"
  ],
  "abstract": "Knowledge Graphs (KGs) have been used to organize large datasets into structured, interconnected information, enhancing data analytics across various fields. In the legislative context, one potential natural application of KGs is modeling the intricate set of interconnections that link laws and their articles with each other and the broader legislative context. At the same time, the rise of large language models (LLMs) such as GPT has opened new opportunities in legal applications, such as text generation and document drafting. Despite their potential, the use of LLMs in legislative contexts is critical since it requires the absence of hallucinations and reliance on up-to-date information, as new laws are published on a daily basis. This work investigates how Legislative Knowledge Graphs and LLMs can synergize and support legislative processes. We address three key questions: the benefits of using KGs for legislative systems, how LLM can support legislative activities by ensuring an accurate output, and how we can allow non-technical users to use such technologies in their activities. To this aim, we develop Legis AI Platform, an interactive platform focused on Italian legislation that enhances the possibility of conducting legislative analysis and that aims to support lawmaking activities.",
  "full_text": null,
  "topic": "Legislature",
  "concepts": [
    {
      "name": "Legislature",
      "score": 0.6956987380981445
    },
    {
      "name": "Computer science",
      "score": 0.5412679314613342
    },
    {
      "name": "Political science",
      "score": 0.2750709652900696
    },
    {
      "name": "Law",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I93860229",
      "name": "Politecnico di Milano",
      "country": "IT"
    }
  ],
  "cited_by": 6
}