{
  "title": "Investigating the Predominance of Large Language Models in Low-Resource Bangla Language over Transformer Models for Hate Speech Detection: A Comparative Analysis",
  "url": "https://openalex.org/W4404669420",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A4366251941",
      "name": "Fatema Tuj Johora Faria",
      "affiliations": [
        "Ahsanullah University of Science and Technology"
      ]
    },
    {
      "id": "https://openalex.org/A2054568299",
      "name": "Laith H. Baniata",
      "affiliations": [
        "Gachon University"
      ]
    },
    {
      "id": "https://openalex.org/A2125711099",
      "name": "Sangwoo Kang",
      "affiliations": [
        "Gachon University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W6795438028",
    "https://openalex.org/W4393312568",
    "https://openalex.org/W4281634662",
    "https://openalex.org/W6846087274",
    "https://openalex.org/W4392942827",
    "https://openalex.org/W4389519004",
    "https://openalex.org/W4385570946",
    "https://openalex.org/W4404136417",
    "https://openalex.org/W4288767680",
    "https://openalex.org/W4313455947",
    "https://openalex.org/W4205791572",
    "https://openalex.org/W3108724972",
    "https://openalex.org/W3007805994",
    "https://openalex.org/W3209024753",
    "https://openalex.org/W4287888679",
    "https://openalex.org/W4385571726",
    "https://openalex.org/W6606982846",
    "https://openalex.org/W1584308190",
    "https://openalex.org/W4404534210",
    "https://openalex.org/W4304194094",
    "https://openalex.org/W3162112692",
    "https://openalex.org/W172260869"
  ],
  "abstract": "The rise in abusive language on social media is a significant threat to mental health and social cohesion. For Bengali speakers, the need for effective detection is critical. However, current methods fall short in addressing the massive volume of content. Improved techniques are urgently needed to combat online hate speech in Bengali. Traditional machine learning techniques, while useful, often require large, linguistically diverse datasets to train models effectively. This paper addresses the urgent need for improved hate speech detection methods in Bengali, aiming to fill the existing research gap. Contextual understanding is crucial in differentiating between harmful speech and benign expressions. Large language models (LLMs) have shown state-of-the-art performance in various natural language tasks due to their extensive training on vast amounts of data. We explore the application of LLMs, specifically GPT-3.5 Turbo and Gemini 1.5 Pro, for Bengali hate speech detection using Zero-Shot and Few-Shot Learning approaches. Unlike conventional methods, Zero-Shot Learning identifies hate speech without task-specific training data, making it highly adaptable to new datasets and languages. Few-Shot Learning, on the other hand, requires minimal labeled examples, allowing for efficient model training with limited resources. Our experimental results show that LLMs outperform traditional approaches. In this study, we evaluate GPT-3.5 Turbo and Gemini 1.5 Pro on multiple datasets. To further enhance our study, we consider the distribution of comments in different datasets and the challenge of class imbalance, which can affect model performance. The BD-SHS dataset consists of 35,197 comments in the training set, 7542 in the validation set, and 7542 in the test set. The Bengali Hate Speech Dataset v1.0 and v2.0 include comments distributed across various hate categories: personal hate (629), political hate (1771), religious hate (502), geopolitical hate (1179), and gender abusive hate (316). The Bengali Hate Dataset comprises 7500 non-hate and 7500 hate comments. GPT-3.5 Turbo achieved impressive results with 97.33%, 98.42%, and 98.53% accuracy. In contrast, Gemini 1.5 Pro showed lower performance across all datasets. Specifically, GPT-3.5 Turbo excelled with significantly higher accuracy compared to Gemini 1.5 Pro. These outcomes highlight a 6.28% increase in accuracy compared to traditional methods, which achieved 92.25%. Our research contributes to the growing body of literature on LLM applications in natural language processing, particularly in the context of low-resource languages.",
  "full_text": null,
  "topic": "Bengali",
  "concepts": [
    {
      "name": "Bengali",
      "score": 0.8148562908172607
    },
    {
      "name": "Computer science",
      "score": 0.5846167206764221
    },
    {
      "name": "Transformer",
      "score": 0.5756639838218689
    },
    {
      "name": "Natural language processing",
      "score": 0.4769267439842224
    },
    {
      "name": "Language model",
      "score": 0.456034779548645
    },
    {
      "name": "Linguistics",
      "score": 0.4371783435344696
    },
    {
      "name": "Artificial intelligence",
      "score": 0.4130200147628784
    },
    {
      "name": "Speech recognition",
      "score": 0.33397695422172546
    },
    {
      "name": "Engineering",
      "score": 0.13330194354057312
    },
    {
      "name": "Philosophy",
      "score": 0.06915828585624695
    },
    {
      "name": "Voltage",
      "score": 0.0
    },
    {
      "name": "Electrical engineering",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I135564639",
      "name": "Ahsanullah University of Science and Technology",
      "country": "BD"
    },
    {
      "id": "https://openalex.org/I12832649",
      "name": "Gachon University",
      "country": "KR"
    }
  ],
  "cited_by": 3
}