{
  "title": "Exploring the Credibility of Large Language Models for Mental Health Support: Protocol for a Scoping Review",
  "url": "https://openalex.org/W4404274459",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A5099002026",
      "name": "Dipak Gautam",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A134359679",
      "name": "Philipp Kellmeyer",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W4378227790",
    "https://openalex.org/W4393904418",
    "https://openalex.org/W4385774833",
    "https://openalex.org/W3130234976",
    "https://openalex.org/W3173845513",
    "https://openalex.org/W4392503764",
    "https://openalex.org/W4386173035",
    "https://openalex.org/W4206410242",
    "https://openalex.org/W4293689835",
    "https://openalex.org/W2891378911",
    "https://openalex.org/W2105321265",
    "https://openalex.org/W3092419658",
    "https://openalex.org/W3203243032",
    "https://openalex.org/W4393856140",
    "https://openalex.org/W2009957420",
    "https://openalex.org/W2324207353"
  ],
  "abstract": "Background The rapid evolution of large language models (LLMs), such as Bidirectional Encoder Representations from Transformers (BERT; Google) and GPT (OpenAI), has introduced significant advancements in natural language processing. These models are increasingly integrated into various applications, including mental health support. However, the credibility of LLMs in providing reliable and explainable mental health information and support remains underexplored. Objective This scoping review systematically maps the factors influencing the credibility of LLMs in mental health support, including reliability, explainability, and ethical considerations. The review is expected to offer critical insights for practitioners, researchers, and policy makers, guiding future research and policy development. These findings will contribute to the responsible integration of LLMs into mental health care, with a focus on maintaining ethical standards and user trust. Methods This review follows PRISMA-ScR (Preferred Reporting Items for Systematic Reviews and Meta-Analyses extension for Scoping Reviews) guidelines and the Joanna Briggs Institute (JBI) methodology. Eligibility criteria include studies that apply transformer-based generative language models in mental health support, such as BERT and GPT. Sources include PsycINFO, MEDLINE via PubMed, Web of Science, IEEE Xplore, and ACM Digital Library. A systematic search of studies from 2019 onward will be conducted and updated until October 2024. Data will be synthesized qualitatively. The Population, Concept, and Context framework will guide the inclusion criteria. Two independent reviewers will screen and extract data, resolving discrepancies through discussion. Data will be synthesized and presented descriptively. Results As of September 2024, this study is currently in progress, with the systematic search completed and the screening phase ongoing. We expect to complete data extraction by early November 2024 and synthesis by late November 2024. Conclusions This scoping review will map the current evidence on the credibility of LLMs in mental health support. It will identify factors influencing the reliability, explainability, and ethical considerations of these models, providing insights for practitioners, researchers, policy makers, and users. These findings will fill a critical gap in the literature and inform future research, practice, and policy development, ensuring the responsible integration of LLMs in mental health services. International Registered Report Identifier (IRRID) DERR1-10.2196/62865",
  "full_text": null,
  "topic": "Preprint",
  "concepts": [
    {
      "name": "Preprint",
      "score": 0.864997148513794
    },
    {
      "name": "Protocol (science)",
      "score": 0.6726234555244446
    },
    {
      "name": "Mental health",
      "score": 0.6138669848442078
    },
    {
      "name": "Credibility",
      "score": 0.6087603569030762
    },
    {
      "name": "Computer science",
      "score": 0.4688457250595093
    },
    {
      "name": "Psychology",
      "score": 0.418362021446228
    },
    {
      "name": "Data science",
      "score": 0.3619310259819031
    },
    {
      "name": "Applied psychology",
      "score": 0.34908753633499146
    },
    {
      "name": "Medicine",
      "score": 0.28992074728012085
    },
    {
      "name": "World Wide Web",
      "score": 0.2672492265701294
    },
    {
      "name": "Alternative medicine",
      "score": 0.16273200511932373
    },
    {
      "name": "Psychiatry",
      "score": 0.13713112473487854
    },
    {
      "name": "Political science",
      "score": 0.13143354654312134
    },
    {
      "name": "Law",
      "score": 0.0
    },
    {
      "name": "Pathology",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I177802217",
      "name": "University of Mannheim",
      "country": "DE"
    },
    {
      "id": "https://openalex.org/I4210090941",
      "name": "Institute for Biomedical Engineering",
      "country": "CH"
    },
    {
      "id": "https://openalex.org/I202697423",
      "name": "University of Zurich",
      "country": "CH"
    },
    {
      "id": "https://openalex.org/I161046081",
      "name": "University of Freiburg",
      "country": "DE"
    }
  ],
  "cited_by": 3
}