{
    "title": "The Challenges of Using Large Language Models: Balancing Traditional Learning Methods with New Technologies in the Pedagogy of Sociology",
    "url": "https://openalex.org/W4407190466",
    "year": 2025,
    "authors": [
        {
            "id": "https://openalex.org/A5086971637",
            "name": "Živa Kos",
            "affiliations": [
                "University of Ljubljana"
            ]
        },
        {
            "id": "https://openalex.org/A5083018224",
            "name": "Jasna Mažgon",
            "affiliations": [
                "University of Ljubljana"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W6681766317",
        "https://openalex.org/W1605954759",
        "https://openalex.org/W2952025101",
        "https://openalex.org/W3036659752",
        "https://openalex.org/W4384340967",
        "https://openalex.org/W4400214481",
        "https://openalex.org/W2635153012",
        "https://openalex.org/W2943012653",
        "https://openalex.org/W4319460874",
        "https://openalex.org/W2122328334",
        "https://openalex.org/W3184900232",
        "https://openalex.org/W2112031167",
        "https://openalex.org/W2938892948",
        "https://openalex.org/W4291018137",
        "https://openalex.org/W4284991798",
        "https://openalex.org/W4247507208",
        "https://openalex.org/W4237408834",
        "https://openalex.org/W2479820238",
        "https://openalex.org/W3087901857",
        "https://openalex.org/W4387873511",
        "https://openalex.org/W3083762786",
        "https://openalex.org/W4379143611",
        "https://openalex.org/W4404765630",
        "https://openalex.org/W4250629313",
        "https://openalex.org/W4391931433",
        "https://openalex.org/W3156614709",
        "https://openalex.org/W2147131251"
    ],
    "abstract": "The increasing use of artificial intelligence (hereafter AI) in education, particularly through large-scale language models such as ChatGPT and Bing, offers both challenges and opportunities. These models facilitate interaction in conversations and can perform tasks that require natural language processing, from answering questions to solving problems. However, their integration into education raises concerns about the credibility and reliability of the information they provide and about the role of the teacher, emphasizing the need for guided use in educational environments. This article contributes to the discourse from the perspective of the pedagogy of sociology, focusing on the role of chatbots in analyzing texts within the social sciences and humanities fields. Our pilot study, conducted with 17 first-year master’s students studying sociology, reveals that while chatbots can optimize the creation of summaries and the provision of basic information, their reliance on sources such as Wikipedia calls into question the depth and impartiality of the content. In addition, students have criticized chatbots for providing biased or inaccurate outputs. A significant part of our research has compared the epistemological and methodological approaches of chatbots with a traditional, independent literature analysis (deep reading), and we found notable differences in learning outcomes. However, a hybrid approach that combines AI tools with conventional methods offers a promising way to improve learning and teaching strategies and can enhance the critical analytical skills that are crucial for future pedagogies.",
    "full_text": null
}