{
  "title": "Creating virtual patients using large language models: scalable, global, and low cost",
  "url": "https://openalex.org/W4400593735",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A2148983146",
      "name": "David A. Cook",
      "affiliations": [
        "Mayo Clinic"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2036488299",
    "https://openalex.org/W2029342902",
    "https://openalex.org/W2943533685",
    "https://openalex.org/W4319825970",
    "https://openalex.org/W2316373143"
  ],
  "abstract": "Virtual patients (VPs) have long been used to teach and assess clinical reasoning. VPs can be programmed to simulate authentic patient-clinician interactions and to reflect a variety of contextual permutations. However, their use has historically been limited by the high cost and logistical challenges of large-scale implementation. We describe a novel globally-accessible approach to develop low-cost VPs at scale using artificial intelligence (AI) large language models (LLMs). We leveraged OpenAI Generative Pretrained Transformer (GPT) to create and implement two interactive VPs, and created permutations that differed in contextual features. We used systematic prompt engineering to refine a prompt instructing ChatGPT to emulate the patient for a given case scenario, and then provide feedback on clinician performance. We implemented the prompts using GPT-3.5-turbo and GPT-4.0, and created a simple text-only interface using the OpenAI API. GPT-4.0 was far superior. We also conducted limited testing using another LLM (Anthropic Claude), with promising results. We provide the final prompt, case scenarios, and Python code. LLM-VPs represent a ‘disruptive innovation’ – an innovation that is unmistakably <i>inferior</i> to existing products but substantially more <i>accessible</i> (due to low cost, global reach, or ease of implementation) and thereby able to reach a previously underserved market. LLM-VPs will lay the foundation for global democratization <i>via</i> low-cost-low-risk scalable development of educational and clinical simulations. These powerful tools could revolutionize the teaching, assessment, and research of management reasoning, shared decision-making, and AI evaluation (e.g. ‘software as a medical device’ evaluations).",
  "full_text": null,
  "topic": "Scalability",
  "concepts": [
    {
      "name": "Scalability",
      "score": 0.6032506823539734
    },
    {
      "name": "Computer science",
      "score": 0.5844775438308716
    },
    {
      "name": "Virtual patient",
      "score": 0.45937904715538025
    },
    {
      "name": "Medicine",
      "score": 0.2677614092826843
    },
    {
      "name": "Medical education",
      "score": 0.2613813579082489
    },
    {
      "name": "Operating system",
      "score": 0.09312444925308228
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I1330342723",
      "name": "Mayo Clinic",
      "country": "US"
    }
  ]
}