{
  "title": "A Unified Graph Transformer for Overcoming Isolations in Multi-modal Recommendation",
  "url": "https://openalex.org/W4403221702",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A2309982887",
      "name": "Zixuan Yi",
      "affiliations": [
        "University of Glasgow"
      ]
    },
    {
      "id": "https://openalex.org/A336997814",
      "name": "Iadh Ounis",
      "affiliations": [
        "University of Glasgow"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4306317751",
    "https://openalex.org/W4394973476",
    "https://openalex.org/W3189718596",
    "https://openalex.org/W2593116425",
    "https://openalex.org/W2194775991",
    "https://openalex.org/W2963655167",
    "https://openalex.org/W3045200674",
    "https://openalex.org/W2963367478",
    "https://openalex.org/W4379539462",
    "https://openalex.org/W3207267733",
    "https://openalex.org/W4288804669",
    "https://openalex.org/W2970641574",
    "https://openalex.org/W2984100107",
    "https://openalex.org/W4386071687",
    "https://openalex.org/W4384655891",
    "https://openalex.org/W2982108874",
    "https://openalex.org/W4295955103",
    "https://openalex.org/W4327644571",
    "https://openalex.org/W4284687944",
    "https://openalex.org/W3192113933",
    "https://openalex.org/W4309185982",
    "https://openalex.org/W4322718576",
    "https://openalex.org/W3205778609",
    "https://openalex.org/W3206477365"
  ],
  "abstract": "With the rapid development of online multimedia services, especially in e-commerce platforms, there is a pressing need for personalised recommender systems that can effectively encode the diverse multi-modal content associated with each item. However, we argue that existing multi-modal recommender systems typically use isolated processes for both feature extraction and modality encoding. Such isolated processes can harm the recommendation performance. Firstly, an isolated extraction process underestimates the importance of effective feature extraction in multi-modal recommendations, potentially incorporating non-relevant information, which is harmful to item representations. Second, an isolated modality encoding process produces disjoint embeddings for item modalities due to the individual processing of each modality, which leads to a suboptimal fusion of user/item representations for an effective user preferences prediction. We hypothesise that the use of a unified model for addressing both aforementioned isolated processes will enable the consistent extraction and cohesive fusion of joint multi-modal features, thereby enhancing the effectiveness of multi-modal recommender systems. In this paper, we propose a novel model, called Unified multi-modal Graph Transformer (UGT), which firstly leverages a multi-way transformer to extract aligned multi-modal features from raw data for top-k recommendation. Subsequently, we build a unified graph neural network in our UGT model to jointly fuse the multi-modal user/item representations derived from the output of the multi-way transformer. Using the graph transformer architecture of our UGT model, we show that the UGT model achieves significant effectiveness gains, especially when jointly optimised with the commonly used recommendation losses. Our extensive experiments conducted on three benchmark datasets demonstrate that our proposed UGT model consistently outperforms nine existing state-of-the-art recommendation approaches and by up to 13.97% over the best baseline.",
  "full_text": null,
  "topic": "Modal",
  "concepts": [
    {
      "name": "Modal",
      "score": 0.6623075008392334
    },
    {
      "name": "Computer science",
      "score": 0.6568441987037659
    },
    {
      "name": "Transformer",
      "score": 0.539122998714447
    },
    {
      "name": "Graph",
      "score": 0.43702441453933716
    },
    {
      "name": "Theoretical computer science",
      "score": 0.3010154068470001
    },
    {
      "name": "Engineering",
      "score": 0.14993178844451904
    },
    {
      "name": "Electrical engineering",
      "score": 0.12690851092338562
    },
    {
      "name": "Materials science",
      "score": 0.12328621745109558
    },
    {
      "name": "Voltage",
      "score": 0.11793497204780579
    },
    {
      "name": "Composite material",
      "score": 0.06418260931968689
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I7882870",
      "name": "University of Glasgow",
      "country": "GB"
    }
  ],
  "cited_by": 9
}