{
  "title": "Prompt matters: evaluation of large language model chatbot responses related to Peyronie’s disease",
  "url": "https://openalex.org/W4402430962",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A2097147626",
      "name": "Christopher J. Warren",
      "affiliations": [
        "Mayo Clinic in Florida",
        "WinnMed"
      ]
    },
    {
      "id": "https://openalex.org/A4212603770",
      "name": "Victoria S Edmonds",
      "affiliations": [
        "Mayo Clinic in Florida",
        "WinnMed"
      ]
    },
    {
      "id": null,
      "name": "Nicolette G Payne",
      "affiliations": [
        "WinnMed",
        "Mayo Clinic in Florida"
      ]
    },
    {
      "id": "https://openalex.org/A5095690448",
      "name": "Sandeep Voletti",
      "affiliations": [
        "Mayo Clinic in Arizona"
      ]
    },
    {
      "id": "https://openalex.org/A2995642506",
      "name": "Sarah Y. Wu",
      "affiliations": [
        "Mayo Clinic in Arizona"
      ]
    },
    {
      "id": "https://openalex.org/A5104280760",
      "name": "JennaKay Colquitt",
      "affiliations": [
        "Mayo Clinic in Arizona"
      ]
    },
    {
      "id": "https://openalex.org/A4208739824",
      "name": "Hossein Sadeghi-Nejad",
      "affiliations": [
        "New York University"
      ]
    },
    {
      "id": "https://openalex.org/A2065915894",
      "name": "Nahid Punjani",
      "affiliations": [
        "WinnMed",
        "Mayo Clinic in Florida"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2801100301",
    "https://openalex.org/W4383710066",
    "https://openalex.org/W4387242094",
    "https://openalex.org/W4382929886",
    "https://openalex.org/W4319460874",
    "https://openalex.org/W2123109647",
    "https://openalex.org/W3133142034",
    "https://openalex.org/W6853652096",
    "https://openalex.org/W4384564606",
    "https://openalex.org/W4382631890"
  ],
  "abstract": "Abstract Introduction Despite direct access to clinicians through the electronic health record, patients are increasingly turning to the internet for information related to their health, especially with sensitive urologic conditions such as Peyronie’s disease (PD). Large language model (LLM) chatbots are a form of artificial intelligence that rely on user prompts to mimic conversation, and they have shown remarkable capabilities. The conversational nature of these chatbots has the potential to answer patient questions related to PD; however, the accuracy, comprehensiveness, and readability of these LLMs related to PD remain unknown. Aims To assess the quality and readability of information generated from 4 LLMs with searches related to PD; to see if users could improve responses; and to assess the accuracy, completeness, and readability of responses to artificial preoperative patient questions sent through the electronic health record prior to undergoing PD surgery. Methods The National Institutes of Health’s frequently asked questions related to PD were entered into 4 LLMs, unprompted and prompted. The responses were evaluated for overall quality by the previously validated DISCERN questionnaire. Accuracy and completeness of LLM responses to 11 presurgical patient messages were evaluated with previously accepted Likert scales. All evaluations were performed by 3 independent reviewers in October 2023, and all reviews were repeated in April 2024. Descriptive statistics and analysis were performed. Results Without prompting, the quality of information was moderate across all LLMs but improved to high quality with prompting. LLMs were accurate and complete, with an average score of 5.5 of 6.0 (SD, 0.8) and 2.8 of 3.0 (SD, 0.4), respectively. The average Flesch-Kincaid reading level was grade 12.9 (SD, 2.1). Chatbots were unable to communicate at a grade 8 reading level when prompted, and their citations were appropriate only 42.5% of the time. Conclusion LLMs may become a valuable tool for patient education for PD, but they currently rely on clinical context and appropriate prompting by humans to be useful. Unfortunately, their prerequisite reading level remains higher than that of the average patient, and their citations cannot be trusted. However, given their increasing uptake and accessibility, patients and physicians should be educated on how to interact with these LLMs to elicit the most appropriate responses. In the future, LLMs may reduce burnout by helping physicians respond to patient messages.",
  "full_text": null,
  "topic": "Readability",
  "concepts": [
    {
      "name": "Readability",
      "score": 0.9475293159484863
    },
    {
      "name": "Conversation",
      "score": 0.6443297863006592
    },
    {
      "name": "Peyronie's disease",
      "score": 0.6296278238296509
    },
    {
      "name": "Medicine",
      "score": 0.5663146376609802
    },
    {
      "name": "Quality (philosophy)",
      "score": 0.45019271969795227
    },
    {
      "name": "The Internet",
      "score": 0.44841375946998596
    },
    {
      "name": "Family medicine",
      "score": 0.4452711045742035
    },
    {
      "name": "Disease",
      "score": 0.4149831235408783
    },
    {
      "name": "Psychology",
      "score": 0.35734105110168457
    },
    {
      "name": "Pathology",
      "score": 0.19954872131347656
    },
    {
      "name": "Computer science",
      "score": 0.1835411787033081
    },
    {
      "name": "World Wide Web",
      "score": 0.10280916094779968
    },
    {
      "name": "Communication",
      "score": 0.10050427913665771
    },
    {
      "name": "Programming language",
      "score": 0.0
    },
    {
      "name": "Philosophy",
      "score": 0.0
    },
    {
      "name": "Epistemology",
      "score": 0.0
    }
  ]
}