{
  "title": "Retrieval-augmented generation improves precision and trust of a GPT-4 model for emergency radiology diagnosis and classification: a proof-of-concept study",
  "url": "https://openalex.org/W4407566004",
  "year": 2025,
  "authors": [
    {
      "id": null,
      "name": "Fink, Anna",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Nattenmüller, Johanna",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Rau, Stephan",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Rau, Alexander",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2301929328",
      "name": "Tran Hien",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2189064443",
      "name": "Bamberg Fabian",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2461741612",
      "name": "Reisert, Marco",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2748260738",
      "name": "Kotter Elmar",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2003466857",
      "name": "Diallo Thierno",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Russe, Maximilian F.",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W4206307781",
    "https://openalex.org/W2033786024",
    "https://openalex.org/W4383501093",
    "https://openalex.org/W4380422747",
    "https://openalex.org/W4385230595",
    "https://openalex.org/W4386287921",
    "https://openalex.org/W4382182493",
    "https://openalex.org/W4383343032",
    "https://openalex.org/W4376640725",
    "https://openalex.org/W4327946446",
    "https://openalex.org/W4388594599",
    "https://openalex.org/W4381953225",
    "https://openalex.org/W4206981472"
  ],
  "abstract": "Abstract Objectives This study evaluated the effect of enhancing a GPT-4 model with retrieval-augmented generation on its ability to diagnose and classify traumatic injuries based on radiology reports. Materials and methods In this prospective proof-of-concept study, we used retrieval-augmented generation as a zero-shot learning approach to provide expert knowledge from the RadioGraphics top ten reading list for trauma radiology to the GPT-4 model, creating the context-aware TraumaCB. Radiological report findings of 50 traumatic injuries were independently generated by two radiologists. The performance of the TraumaCB compared to the generic GPT-4 was evaluated by three board-certified radiologists, assessing the accuracy and trustworthiness of the chatbot responses in the 100 reports created. Results The TraumaCB achieved 100% correct diagnoses, 96% correct classification, and 87% correct grading, outperforming the generic GPT-4 with 93% correct diagnoses, 70% correct classification, and 48% correct grading. TraumaCB sources consistently achieved a median rating of 5.0 for explanation and trust. Challenges encountered mainly involved traumatic injuries lacking widely accepted classification systems. Conclusion Augmenting a commercial GPT-4 model with retrieval-augmented generation improves its diagnostic and classification capabilities, positioning it as a valuable tool for efficiently assessing traumatic injuries across various anatomical regions in trauma radiology. Key Points Question Retrieval-augmented generation has the potential to enhance generic chatbots with task-specific knowledge of emergency radiology . Findings The TraumaCB excelled in accuracy, particularly in injury classification and grading, and provided explanations along with the sources used, increasing transparency and facilitating verification . Clinical relevance The TraumaCB provides accurate, fast, and transparent access to trauma radiology classifications, potentially increasing the efficiency of image interpretation in emergency departments and enabling customized reports based on local or individual preferences .",
  "full_text": null,
  "topic": "Grading (engineering)",
  "concepts": [
    {
      "name": "Grading (engineering)",
      "score": 0.6381174325942993
    },
    {
      "name": "Medicine",
      "score": 0.5872389078140259
    },
    {
      "name": "Medical diagnosis",
      "score": 0.5510054230690002
    },
    {
      "name": "Medical physics",
      "score": 0.48728668689727783
    },
    {
      "name": "Radiology",
      "score": 0.47391781210899353
    },
    {
      "name": "Certification",
      "score": 0.4315926134586334
    },
    {
      "name": "Computer science",
      "score": 0.42453011870384216
    },
    {
      "name": "Artificial intelligence",
      "score": 0.35424065589904785
    },
    {
      "name": "Civil engineering",
      "score": 0.0
    },
    {
      "name": "Engineering",
      "score": 0.0
    },
    {
      "name": "Law",
      "score": 0.0
    },
    {
      "name": "Political science",
      "score": 0.0
    }
  ]
}