{
    "title": "A Practical Application of Retrieval-Augmented Generation for Website-Based Chatbots: Combining Web Scraping, Vectorization, and Semantic Search",
    "url": "https://openalex.org/W4406603419",
    "year": 2025,
    "authors": [
        {
            "id": "https://openalex.org/A4378131371",
            "name": "Sangita Pokhrel",
            "affiliations": []
        },
        {
            "id": null,
            "name": "Bina K C",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A5102627373",
            "name": "Prashant Bikram Shah",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W3133702157",
        "https://openalex.org/W3030163527",
        "https://openalex.org/W2896457183",
        "https://openalex.org/W3173777717",
        "https://openalex.org/W3034671305",
        "https://openalex.org/W2136189984",
        "https://openalex.org/W3156789018",
        "https://openalex.org/W2952826391",
        "https://openalex.org/W4390486238",
        "https://openalex.org/W2998702515",
        "https://openalex.org/W3099700870",
        "https://openalex.org/W3169283738",
        "https://openalex.org/W2134502866",
        "https://openalex.org/W4255228204",
        "https://openalex.org/W4399496323",
        "https://openalex.org/W4389924421",
        "https://openalex.org/W4394582838",
        "https://openalex.org/W2981852735",
        "https://openalex.org/W2970641574",
        "https://openalex.org/W4311617432",
        "https://openalex.org/W4377970338",
        "https://openalex.org/W4403908451",
        "https://openalex.org/W2988937804"
    ],
    "abstract": "The Retrieval-Augmented Generation (RAG) model significantly enhances the capabilities of large language models (LLMs) by integrating information retrieval with text generation, which is particularly relevant for applications requiring context-aware responses based on dynamic data sources. This research study presents a practical implementation of a RAG model personalized for a Chabot that answers user inquiries from various specific websites. The methodology encompasses several key steps: web scraping using BeautifulSoup to extract relevant content, text processing to segment this content into manageable chunks, and vectorization to create embeddings for efficient semantic search. By employing a semantic search approach, the system retrieves the most relevant document segments based on user queries. The OpenAI API is then utilized to generate contextually appropriate responses from the retrieved information. Key results highlight the system's effectiveness in providing accurate and relevant answers, with evaluation metrics centered on response quality, retrieval efficiency, and user satisfaction. This research contributes a comprehensive integration of scraping, vectorization, and semantic search technologies into a cohesive chatbot application, offering valuable insights into the practical implementation of RAG models.",
    "full_text": null
}