{
    "title": "Evaluating artificial intelligence large language models’ performances in a South African high school chemistry exam",
    "url": "https://openalex.org/W4407254891",
    "year": 2025,
    "authors": [
        {
            "id": "https://openalex.org/A2184785619",
            "name": "Samuel Jere",
            "affiliations": [
                "University of Venda"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W4399028114",
        "https://openalex.org/W3086342064",
        "https://openalex.org/W4368340908",
        "https://openalex.org/W4378805624",
        "https://openalex.org/W1598829572",
        "https://openalex.org/W1622896514",
        "https://openalex.org/W4393941607",
        "https://openalex.org/W4319790168",
        "https://openalex.org/W4384616371",
        "https://openalex.org/W4383678461",
        "https://openalex.org/W4362471626",
        "https://openalex.org/W4379598302",
        "https://openalex.org/W4383818129",
        "https://openalex.org/W4387531855",
        "https://openalex.org/W2896420501",
        "https://openalex.org/W4367678106",
        "https://openalex.org/W4400933056",
        "https://openalex.org/W4323655724",
        "https://openalex.org/W2162821268",
        "https://openalex.org/W4319662928",
        "https://openalex.org/W2164777277",
        "https://openalex.org/W4392202731",
        "https://openalex.org/W4400871661",
        "https://openalex.org/W4394785902",
        "https://openalex.org/W3083762786",
        "https://openalex.org/W4389151134",
        "https://openalex.org/W4395477756"
    ],
    "abstract": "Gemini, ChatGPT Plus, and Claude 3.5 Sonnet are artificial intelligence (AI) chatbots with potential in education. Their capabilities, such as acting as virtual teaching assistants, offering personalized responses to learners’ queries, and summarizing content, make them versatile tools with the potential to assist learners. The chemistry section of physical sciences in South Africa is often considered challenging, and learners could benefit from virtual teaching assistants to supplement traditional instruction. However, little is known about AI chatbots’ abilities in solving high school chemistry problems. This descriptive case study examined the capabilities of Gemini, Claude 3.5 Sonnet, and ChatGPT Plus in accurately answering questions from the final grade 12 physical sciences chemistry exam in South Africa. The conceptual framework that guided the study was Bloom’s taxonomy of educational objectives. The responses were rigorously evaluated using the same criteria and rubrics applied to the candidates that year, ensuring a fair and robust comparison. The findings were that ChatGPT Plus performed at 47%, Gemini at 51% and Claude 3.5 Sonnet at 65%. All chatbots performed above the average performance of the candidates who sat for the paper that year, which was 46%. This has significant implications for policymakers, teachers, and learners regarding integrating large language models in teaching physical sciences and exam preparation.",
    "full_text": null
}