{
  "title": "Intent-based control and management framework for optical transport networks supporting B5G services empowered by large language models [Invited]",
  "url": "https://openalex.org/W4403459719",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A2166298535",
      "name": "Anna Tzanakaki",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A4202118537",
      "name": "Markos Anastasopoulos",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Victoria-Maria Alevizaki",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W3202950802",
    "https://openalex.org/W4392705152",
    "https://openalex.org/W6757451721",
    "https://openalex.org/W4312980540",
    "https://openalex.org/W2472948008",
    "https://openalex.org/W3002683348",
    "https://openalex.org/W2266460298",
    "https://openalex.org/W6867080646",
    "https://openalex.org/W3094143099",
    "https://openalex.org/W6739901393",
    "https://openalex.org/W2896457183",
    "https://openalex.org/W3015911661",
    "https://openalex.org/W2994179164",
    "https://openalex.org/W2862472526",
    "https://openalex.org/W2969564667",
    "https://openalex.org/W6736970989",
    "https://openalex.org/W2966974867",
    "https://openalex.org/W3133903773",
    "https://openalex.org/W4283784214",
    "https://openalex.org/W2964121744",
    "https://openalex.org/W4312593144",
    "https://openalex.org/W4399418589"
  ],
  "abstract": "This study focuses on the development of an intent-based networking (IBN) control and management framework automating operations of beyond 5G (B5G) infrastructures supported by optical transport networks to interconnect radio access and core networks. Currently, these infrastructures operate in accordance with the software defined networking (SDN) and network function virtualization (NFV) paradigm, relying on complex northbound and southbound interfaces to expose their (network) capabilities and apply suitable configuration policies to B5G infrastructure. B5G infrastructures are expected to operate over complex heterogeneous transport network and compute domains, each having its own programming language and interfaces. To address the increased complexity of this approach, the present study relies on generative artificial intelligence (GenAI) and large language models (LLMs) to significantly simplify the interaction between different layers and domains through automated translation of configuration policies from one domain to another. More specifically, the developed GenAI models are used to support automated operations of B5G infrastructures by 1) translating high-level intents provided by network operators expressed in the form of natural language into autogenerated optimization code used by the orchestrator and 2) creating autoconfiguration policies for the optical transport network. The semantic accuracy and complexity of the proposed framework to generate appropriate configuration policies are experimentally tested over an optical transport network interconnecting the radio access and core networks of a B5G infrastructure.",
  "full_text": null,
  "topic": "Computer science",
  "concepts": [
    {
      "name": "Computer science",
      "score": 0.5227741599082947
    },
    {
      "name": "Control (management)",
      "score": 0.5121221542358398
    },
    {
      "name": "Computer network",
      "score": 0.4628218114376068
    },
    {
      "name": "Business",
      "score": 0.40519702434539795
    },
    {
      "name": "Process management",
      "score": 0.32642972469329834
    },
    {
      "name": "Artificial intelligence",
      "score": 0.10600543022155762
    }
  ]
}