{
    "title": "Leveraging large language models for enhanced construction safety regulation extraction",
    "url": "https://openalex.org/W4405822181",
    "year": 2024,
    "authors": [
        {
            "id": "https://openalex.org/A3214732117",
            "name": "Si Van-Tien Tran",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2243819101",
            "name": "Jae-Hun Yang",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2111167653",
            "name": "Rahat Hussain",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2104590559",
            "name": "Nasrullah Khan",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A5094016889",
            "name": "Emmanuel Charles Kimito",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2147912577",
            "name": "Akeem Pedro",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A5115665993",
            "name": "Mehrtash Sotani",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A5006499626",
            "name": "Ung Kyun Lee",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2101221706",
            "name": "Chansik Park",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W3035120890",
        "https://openalex.org/W4295866383",
        "https://openalex.org/W4388689043",
        "https://openalex.org/W4389216323",
        "https://openalex.org/W4402670856",
        "https://openalex.org/W3126290224",
        "https://openalex.org/W2075192667",
        "https://openalex.org/W4384389809",
        "https://openalex.org/W4391669060",
        "https://openalex.org/W4394018844",
        "https://openalex.org/W6858023062",
        "https://openalex.org/W2386101327",
        "https://openalex.org/W2012594940",
        "https://openalex.org/W2392094333",
        "https://openalex.org/W1937677075",
        "https://openalex.org/W2739099189",
        "https://openalex.org/W1997717271",
        "https://openalex.org/W4220886081",
        "https://openalex.org/W4220917657",
        "https://openalex.org/W2136922540",
        "https://openalex.org/W3209447182",
        "https://openalex.org/W4389618734",
        "https://openalex.org/W4392212141",
        "https://openalex.org/W4386645144",
        "https://openalex.org/W4399851260",
        "https://openalex.org/W3129808657",
        "https://openalex.org/W4200111231",
        "https://openalex.org/W4382678493",
        "https://openalex.org/W4200248815",
        "https://openalex.org/W3098981070"
    ],
    "abstract": "The construction sector has long been known for its complicated safety requirements, which are critical to ensure the well-being of workers on site. However, interpreting these requirements and maintaining compliance can be difficult due to the amount and complexity of the paperwork involved. This leads to difficulty extracting safety information from requirement documents. Besides, information that is presented in a manner similar to human-like responses can improve employee understanding. This study proposed a Construction Safety Query Assistant (CSQA) approach to enhance the extraction and knowledge of construction safety regulations using Large Language Models (LLMs). CSQA comprises of three primary components: (1) the Construction Safety Investigation Module (CSI), which gathers and processes safety regulation documents through text extraction and preprocessing to build a searchable database; (2) the Safety Condition Identification Module (SCI), which utilizes LLMs to interpret user queries and extract relevant information from the CSI database, capitalizing on the models' ability to understand context and subtle textual nuances; and (3) the Safety Information Delivery Module (SID), which presents the retrieved information to users and integrates a feedback loop to refine the accuracy and relevance of responses based on user interaction. The CSQA approach was validated with 2 case studies that offered more contextually relevant, possibly lowering non-compliance risks, improving worker safety, and simplifying the consultation process in the construction sector. This study emphasizes its potential to transform access to crucial safety information in the construction industry.",
    "full_text": "  \nwww.itcon.org - Journal of Information Technology in Construction - ISSN 1874-4753 \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1026 \nLEVERAGING LARGE LANGUAGE MODELS FOR ENHANCED \nCONSTRUCTION SAFETY REGULATION EXTRACTION \nSUBMITTED: April 2024 \nREVISED: July 2024 \nPUBLISHED: December 2024 \nGUEST EDITORS: Vito Getuli, Farzad Rahimian, Nashwan Dawood, Pietro Capone, Alessandro Bruttini  \nDOI: 10.36680/j.itcon.2024.045 \nSi Van-Tien Tran, Research associate \nDepartment of Architectural Engineering, Catholic Kwandong University, Gangwon-Do 25601, Korea \ntranvantiensi1994@gmail.com \nJaehun Yang, Ph.D. Candidate \nDepartment of Architectural Engineering, Chung-Ang University, Seoul 06974, Korea \njhoon11@cau.ac.kr \nRahat Hussain, Ph.D. Candidate \nDepartment of Architectural Engineering, Chung-Ang University, Seoul 06974, Korea \nrahat4hussain@gmail.com  \nNasrullah Khan, Master Student \nDepartment of Architectural Engineering, Chung-Ang University, Seoul 06974, Korea \nnasazzam@cau.ac.kr  \nEmmanuel Charles Kimito, Master Student \nDepartment of Architectural Engineering, Chung-Ang University, Seoul 06974, Korea \nemmachalz@cau.ac.kr  \nAkeem Pedro, Research associate \nDepartment of Architectural Engineering, Chung-Ang University, Seoul 06974, Korea \nlanrepedro3@cau.ac.kr  \nMehrtash Sotani, Research associate \nDepartment of Architectural Engineering, Chung-Ang University, Seoul 06974, Korea \nsoltani@cau.ac.kr  \nUng-Kyun Lee, Associate Professor \nDepartment of Architectural Engineering, Catholic Kwandong University, Gangwon-Do 25601, Korea \nuklee@cku.ac.kr \nChansik Park, Professor \nDepartment of Architectural Engineering, Chung-Ang University, Seoul 06974, Korea \ncpark@cau.ac.kr \nSUMMARY: The construction sector has long been known for its complicated safety requirements, which are critical to ensure \nthe well-being of workers on site. However, interpreting these requirements and maintaining compliance can be difficult due to \nthe amount and complexity of the paperwork involved. This leads  to difficulty extracting safety information from requirement \ndocuments. Besides, information that is presented in a manner similar to human -like responses can improve employee \nunderstanding. This study proposed a Construction Safety Query Assistant (CSQA)  approach to enhance the extraction and \nknowledge of construction safety regulations using Large Language Models (LLMs). CSQA comprises of three primary \ncomponents: (1) the Construction Safety Investigation Module (CSI), which gathers and processes safety regulation documents \nthrough text extraction and preprocessing to build a searchable database; (2) the Safety Condition Identification Module (SCI), \nwhich utilizes LLMs to interpret user queries and extract relevant information from the CSI database, capit alizing on the \nmodels' ability to understand context and subtle textual nuances; and (3) the Safety Information Delivery Module (SID), which \npresents the retrieved information to users and integrates a feedback loop to refine the accuracy and relevance of responses \nbased on user interaction. The CSQA approach was validated with 2 case studies that offered more contextually relevan t, \npossibly lowering non-compliance risks, improving worker safety, and simplifying the consultation process in the construction \nsector. This study emphasizes its potential to transform access to crucial safety information in the construction industry. \nKEYWORDS: Construction safety document,  Large Language Models , Information extraction,  Retrieval-Augmented \nGeneration, Construction Safety Query Assistant. \nREFERENCE: Si Van-Tien Tran, Jaehun Yang, Rahat Hussain, Nasrullah Khan, Emmanuel Charles Kimito, Akeem Pedro, \nMehrtash Sotani, Ung-Kyun Lee, Chansik Park (2024). Leveraging large language models for enhanced construction safety \nregulation extraction. Journal of Information Technology in Construction (ITcon),  Special issue: ‘Managing the digital \ntransformation of construction industry (CONVR 2023)’, Vol. 29, pg. 1026-1038, DOI: 10.36680/j.itcon.2024.045 \nCOPYRIGHT: © 2024 The author(s). This is an open access article distributed under the terms of the Creative Commons \nAttribution 4.0 International (https://creativecommons.org/licenses/by/4.0/), which permits unrestricted use, distribution, and \nreproduction in any medium, provided the original work is properly cited.\n  \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1027 \n1. INTRODUCTION \nThe construction industry is a significant safety risk, with workplace accidents often resulting in substantial loss \nof life and considerable property damage repercussions (S. V .-T. Tran et al., 2023; Tran et al., 2021). According to \nthe Occupational Safety and Health Administration (OSHA), in 2022, the construction sector reported 1,056 of the \n5,486 total occupational fatalities, marking an 11 percent increase from 2021 and representing the second-highest \ncategory of workplace deaths  (“Census of Fatal Occupational Injuries Summary, 2022,” 2022) . In Korea, the \nconstruction industry has the highest number of fatal accidents compared to all other sectors, which amounts to \nover 50% (“Status of fatal accidents subject to disaster investigation in 2022,” 2022) . The recurrence of such \nincidents emphasizes the necessity for rigorous safety protocols and robust accident prevention strategies. \nLiterature indicates that a strategic enhancement of safety measures could significantly mitigate such hazards (Bao \net al., 2022; S. V . Tran et al., 2022; S. V . T. Tran et al., 2022). Therein, field compliance checking is a fundamental \npractice involving precise on -site evaluations to enforce safety standards. It aims to protect workers and \nsignificantly reduce accident rates (Jeong et al., 2023; Kang et al., 2023) . Enhanced safety protocols and strict \ncompliance adherence are crucial for reducing fatal accidents and adopting a safer construction environment. \nSafety training is crucial in the construction industry, as it enhances workers' skills and reduces the occurrence of \nunsafe situations (Kou Wei-mi, 2008) . It is a leading measure in driving safety performance and creating a \ncompetent workforce (N. Skeepers, 2016) . The transfer of non -technical skills, such as communication and \ndecision-making, is particularly important for migrant workers (Nielsen et al., 2022) . Safety training should be \ntailored to the challenges faced at each level of the organization (N. Skeepers, 2016) . The importance of safety \neducation in establishing a correct safety production concept is also emphasized (Liao Guo-rong, 2013). However, \nfinding relevant safety training information and general training materials was always challenging for construction \nemployees (Hussain et al., 2024b). The manual review of safety information from textual documents such as codes, \nstandards, and safety manuals present several challenges. These include the tedious and time-consuming nature of \nthe process, the potential for ambiguities in safety objectives (Lin et al., 2015) , and the difficulty in extracting \nrelevant data for unfamiliar users (McCluskey et al., 1988) . The need for better tool support for evidence \nmanagement is also highlighted (Nair et al., 2014) . To address these challenges, various approaches have been \nproposed. \nModern technologies have revolutionized the extraction of safety information, allowing for more efficient and \naccurate techniques to be proposed for extracting information related to accidents and injuries. For example, Feng \net al. suggested a framework based on deep learning algorithms to extract event -related information such as the \ndate, location, and type of accident from accident news reports  (Feng and Chen, 2021) . On the other hand, \nRupasinghe et al.  proposed a rule -based technique to extract hazard -related information from accident reports  \n(Rupasinghe and Panuwatwanich, 2021) . Similarly, (Baker et al., 2020)  suggested using Natural Language \nProcessing (NLP) techniques to identify injury precursors. However, there is still a lack of research focused on \nautomatically extracting requirements from construction safety rules to ensure compliance in the field. Additionally, \nthe automatic information extraction process needs to provide users with accurate and timely responses to their \ninquiries as human responses. Human-like text generation is crucial for construction safety information extraction \nbecause it significantly improves the accessibility and usability of complex safety regulations. \nLarge Language Models (LLMs), such as GPT and Bard, offer significant potential to support the construction \nindustry, particularly in construction safety information extraction  (Brozovsky et al., 2024) . These models are \nadept at processing large volumes of unstructured textual data shared in construction where safety reports, incident \nlogs, and compliance documents are prevalent (Saka et al., 2024) . LLMs can be trained to recognize descriptions \nof near-miss incidents and accidents from textual reports and extract relevant information such as the type of \nincident, involved equipment, and potential safety violations  (Wang and El -Gohary, 2023) . Furthermore, \nconversational AI, powered by LLMs, can provide real -time, context-specific responses to queries about safety \nprotocols and regulatory compliance. For instance, each construction project is unique, with specific safety \nrequirements, drawings , and vendor -specific rules. LLMs can be fine -tuned with project -specific datasets to \nevaluate these documents and deliver customized answers considering the project's unique context. This ability \nnot only improves the accuracy of the information provided but also ensures that safety practices are tailored to \nthe specific needs of each project. By integrating LLMs into safety management systems, construction companies \ncan enhance compliance monitoring, proactive hazard identification, and decision -making processes, ultimately \nfostering a safer and more compliant construction environment (Hussain et al., 2024b; S. Tran et al., 2023). \n \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1028 \nThis research proposes the Construction Safety Query Assistant (CSQA) approach. This innovative method utilizes \nLLM to extract and provide real-time answers to safety regulatory questions in the construction industry, thereby \nbridging the knowledge gap for professionals. The CS QA comprises three main components. The first, the \nConstruction Safety Investigation module (CSI), collects comprehensive safety regulations. The second \ncomponent, the Safety Condition Identification module (SCI), utilizes the database created by CSI. Here, the LLM \nanalyzes user-generated queries, sifts through the indexed regulations, and pinpoints the most relevant information \nbased on its extensive training in regulatory and safety contexts. The third component, the Safety Informati on \nDelivery (SID), is designed to interact directly with users. SID delivers the necessary safety information and \ngathers user feedback to refine and enhance the system's accuracy and performance. The paper structure provides \na literature review of the current landscape of construction safety information retrieval and the application of LLMs \nin this field. Following this, it details the proposed CSQA method, outlining each module's role and functionality \nin section 4 of the paper, which is dedicated to validating the proposed approach through a series of case scenarios \nthat demonstrate CSQA's practical application and effectiveness in real -world settings. The paper concludes by \ndiscussing the results and implications for future research and implementation in construction safety management. \n2. LITERATURE REVIEW \n2.1 Current state of construction safety information retrieval and extraction \nThroughout its evolution, the construction industry has become synonymous with intricate projects and the \ninherent safety concerns they entail. Consequently, a comprehensive array of safety regulations, guidelines, and \noptimal methodologies has been introduced over time. Historically, the retrieval and extraction of pertinent safety \ndata have predominantly relied on manual methodologies (Zhong et al., 2020). Professionals often encounter the \narduous task of sifting through extensive physical binders or digital archives. Despite its exhaustive nature, this \napproach is fraught with challenges. The time-intensive process of manual searches, coupled with the potential for \nhuman error, frequently results in critical safety directives being overlooked or inadequately incorporated (Tran et \nal., 2024). Moreover, the dynamic nature of construction projects, with their distinct challenges and parameters, \nnecessitates a customized understanding of safety regulations, which manual searches cannot provide efficiently \n(Wu et al., 2022). \nSignificant efforts have been made to streamline accessing safety information (Tran et al., 2021). Initially, safety \ninformation was moved to digital databases, allowing for keyword searches. While this transition did speed the \nretrieval process to some degree, it was not without downsides. Keyword searches often produce many results, \nnecessitating further filtering to identify relevant information. Furthermore, the lack of contextual understanding \nand the static nature of these databases limited their ability to provide nuanced interpretations for specific project \nscenarios. To address these challenges, Feng and Chen proposed a deep learning framework for extracting event -\nspecific information (such as date, location, and type of accident) from accident news reports for construction \nsafety management  (Feng and Chen, 2021) . Similarly, Rupasinghe and Panuwatwanich suggested a rule -based \ntechnique for identifying hazards in accident reports (Rupasinghe and Panuwatwanich, 2021). Baker et al. (Baker \net al., 2020) advocated for using natural language processing (NLP), which leverages a variety of textual patterns \nto detect precursors to injuries. These developments underscore the potential of advanced AI -driven methods for \nenhancing the efficiency of information retrieval and improving contextual understanding through the use of LLMs. \nNLP enables computers to understand and process human language text much like a person would. Within NLP, \nInformation Extraction (IE) is a specialized field dedicated to retrieving relevant information from text sources. \nBroadly speaking, there are two primary techniques for information extraction: (1) machine learning (ML) and (2) \nrule-based approaches. However, due to limited training data, research has predominantly focused on rule -based \ntechniques. The emergence of LLMs has revolutionized NLP by offering a transformative solution to this challenge. \nLLMs like GPT, Bard, and others have made remarkable advancements in knowledge curation, demonstrating \ntheir efficacy in deciphering and organizing complex scientific information. By leveraging vast amounts of  data, \nthese models have significantly enhanced our ability to extract valuable insights from text, marking a substantial \nleap forward in the field of natural language processing. These models are adept at extracting critical knowledge \nfrom extensive scien tific literature, excelling in protein interactions, biochemical pathways, gene regulatory \nnetworks, and identifying adverse drug events  (Gu et al., 2023) . (S. Tran et al., 2023)  indicated that LLM can \nenhance safety management in the construction industry. The ability of LLMs to process and analyze large datasets \nwith a high degree of accuracy has revolutionized the extraction information approach, making it possible to glean \n \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1029 \nvaluable insights at a pace and precision far exceeding traditional methods. \n2.2 The need to leverage LLM for enhanced construction safety information extraction \nWithin the construction industry, safety is a paramount concern, and the management of extensive safety \ndocumentation and guidelines is central to ensuring the welfare of all stakeholders. LLMs are crucial in extracting \nrelevant and actionable safety information from complex construction project documents (Saka et al., 2024).  \nThese models exhibit exceptional proficiency in discerning the contextual nuances of inquiries, thereby \nempowering them to retrieve precise information about safety protocols. This capability extends to extracting \nspecific guidelines on machinery handling procedures from an extensive repository of safety regulations. Moreover, \nLLMs offer the advantage of customization to project -specific datasets, thereby augmenting their efficacy in \nprocessing proprietary documents such as plans, safety regulations, and vendor-specific guidelines often archived \nin formats such as PDFs (S. Tran et al., 2023). Through training or fine-tuning project-specific datasets, LLMs can \nseamlessly integrate, and process confidential materials supplied by enterprises. This adaptability enables LLMs \nto furnish relevant and secure solutions while upholding the confidentiality of sensitive project-related information. \nThe integration of LLMs into construction safety management represents a paradigm shift in conventional \nmethodologies by automating the extraction and organization of pivotal safety data. This transformative pr ocess \nnot only mitigates the administrative burden but also substantially enhances the precision of safety compliance \nmeasures. (Hussain et al., 2024a) . LLMs excel in interpreting complex legal and technical language in diverse \nregulatory documents, ensuring that construction managers and safety officers are consistently well -informed \nwithout resorting to labor-intensive document reviews. Moreover, by generating customized training materials and \nproviding insights into prevalent safety issues and trends, LLMs foster a culture of safety and continuous \nimprovement (Bao et al., 2024; Hussain et al., 2024a; S. Tran et al., 2023). In light of the ever-changing landscape \nof construction sites, there's a pressing need for the development of technologies that can effectively adapt to these \ndynamic environments. LLMs, with their remarkable capacity to navigate the complexities of construction projects \nand manage diverse sets of data, emerge as invaluable assets in this pursuit. Therefore, investing in research to \nleverage LLMs for this purpose is not just advantageous but imperative for the advancement of construction safety. \n3. MATERIALS AND METHODS \n3.1 Research methodology \nThis study proposes a novel methodology utilizing LLMs to improve the extraction of construction safety \nregulations. The research framework is grounded in the design science approach articulated by Peffers et al.  \n(Peffers et al., 2007) , recognized for its efficacy in advancing technological and theoretical knowledge bases by \noffering innovative solutions to enhance established methodologies (vom Brocke et al. ).This methodological \napproach unfolds through five methodical steps: (i) problem identification and motivation establishment, (ii) \nobjectives delineation for the solution, (iii) system design and development, (iv) prototype creation, and (v) \nevaluation through practical application (Geerts, 2011; Kuechler and V aishnavi, 2008; Peffers et al., 2007). \nAs depicted in Figure 1 , the initial step involves recognizing the existing challenges in construction safety \ninformation retrieval and extraction through the lens of large language models (LLMs). The second step focuses \non setting clear objectives for the solution, explicitly targeting the enhancement of construction safety information \nextraction using LLMs. The third step involves the architectural design of the proposed system, detailing essential \nmodules, their interrelationships, and the selection of appropriate development platforms. A system prototype is \ndeveloped in the fourth step to demonstrate its functionality. The final step entails a case study implementation to \ntest the system's effectiveness. \n3.2 Proposed approach \nThe primary purpose of the Construction Safety Query Assistant (CSQA) approach is to enhance the extraction \nand understanding of construction safety regulations using LLM, with the key features, illustrated in Figure 2, \ncomprising three modules. The foundational element of this approach, the Construction Safety Investigation (CSI) \nmodule, focuses on the meticulous aggregation of safety regulations necessary for establishing a comprehensive \ninformation database. This module primarily processes a ra nge of PDF documents containing safety regulations \nand acts as the primary repository for raw safety data. Its essential functions include text extraction, preprocessing, \n \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1030 \nand global indexing. Text extraction is vital as it transforms the content of PDFs into a structured format that is \nmore accessible for further processing. Preprocessing involves cleaning and normalizing this text, setting the stage \nfor subsequent analytical stages. Subsequently, the Safety Condition Identification (SCI) module serves as a critical \nintermediary between the foundational database developed by the CSI module and the end -user interface. The \nprincipal role of the SCI module is to engage with the  CSI database to extract relevant safety information in \nresponse to user queries. This module's integration of a LLM is pivotal. Leveraging its extensive training, the LLM \nprocesses and interprets user queries in real time, scrutinizing the indexed regulat ions within the CSI database to \nprovide precise and contextually appropriate information. Incorporating the LLM enhances the accuracy, context \nsensitivity, and efficiency of the information retrieval process, ensuring swift and reliable responses to user \ninquiries. \n \nFigure 1: Research methodology. \n \n \nFigure 2: An approach of leveraging large language models for enhanced construction safety regulation extraction.  \n\n \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1031 \nFurthermore, the approach includes the Safety Information Delivery (SID) module, designed to effectively present \nthe processed safety information to end users. This module operates as the user interface, delivering clear, concise, \nand relevant answers to user queries. Additionally, it incorporates a feedback mechanism that allows users to assess \nthe accuracy and relevance of the information provided. This feedback is integral to the continuous refinement of \nthe system, enhancing its accuracy and reliability. By consistently integrating user feedback, the SID module \nadapts to evolving us er needs and preferences, sustaining its utility and efficacy in disseminating precise \nconstruction safety information. \n3.3 Prototype development \nFigure 3 depicts the prototype development process and tool used for the proposed approach. This prototype builds \nthe RAG (Retrieval-Augmented Generation) pipeline using Langchain as the selected library and Chroma as the \nvector storage solution. The RAG p ipeline is an essential component of Large Language Models (LLMs) and is \ncrucial for applications that require context-aware question-answering (Chen et al., 2024). The process flow starts \nwith unstructured information in the form of PDFs given by the users, as illustrated in Figure 4. The Chroma \ngenerates a vector database (VD) of high dimensional vectors of the unstructured information provided. Next, a \nquery asks for information, the query is converted to vector form, and a similarity is checked between VD vectors, \nresulting in the chunk of vectors related to the query. The following step takes the chunks and queries, decodes \nthem into hard text, inserts them in t he LLM prompt, which is processed by LLM, and outputs a generated \nformatted text required by the query asked. \n \nFigure 3: System architecture. \nTo begin with, the authors carefully evaluated the available libraries in the LLM domain and identified Langchain \nand LlamaIndex as the two leading options. After considering various factors, such as familiarity and integration \ncapabilities, we decided to proceed with Langch ain for this project. One of the critical components of the RAG \nframework is vector storage, which enables efficient retrieval of relevant contexts based on user queries. We \nextensively researched different vector storage solutions and found that Chroma of fers excellent integration \ncapabilities with Langchain. Therefore, Chroma was chosen as the vector storage solution for this project. \nImplementing the ' ingest ' method is the first step in building the RAG pipeline. This method is responsible for \nloading a document into vector storage. To accommodate the token limit of the LLM, we employ a two-step process. \nFirstly, the document is split into smaller chunks using the RecursiveCharacterSplitter provided by Langchain. \nThis ensures that each chunk falls within the acceptable token limit. Next, these chunks are vectorized using Qdrant \nFastEmbeddings, a lightweight embedding model. The vectorized chunks are then stored in Chroma, allowing \nefficient retrieval during the question-answering process. \n \nFigure 4: The workflow of CSQA. \n\n \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1032 \nThe second method in the RAG pipeline is the `ask` method, which handles user queries. When a user poses a \nquestion, the RetrievalQAChain is employed to retrieve relevant contexts (document chunks) using vector \nsimilarity search techniques. These contexts and the user's question are used to compose a prompt. The prompt is \nsourced from the Langchain hub, specifically the Langchain RAG Prompt for Mistral, which has been extensively \ntested and proven reliable for LLM prompting techniques. The composed prompt i s then used to request a \nprediction from the LLM server, which utilizes the \"Mistral 7B\" LLM model  (Jiang et al., 2023) . While \nimplementing the `ingest` method, we utilize PyPDFLoader to load PDF files the user uploads.  \nAdditionally, we employ the `filter_complex_metadata` function from Langchain to filter out complex metadata \nthat ChromaDB does not support. This ensures that only relevant and compatible information is stored in Chroma \nfor efficient retrieval. Chroma is u sed in conjunction with Qdrant FastEmbeddings for vector storage as the \nembedding model. Quadrant FastEmbeddings is a lightweight model transformed into a retriever with a score \nthreshold of 0.5 and k=3. This means the retriever returns the top three chunk s with the highest scores above 0.5, \nensuring high-quality and relevant context retrieval. Furthermore, we construct a simple conversation chain using \nthe Langchain Expression Language (LECL), which facilitates seamless communication between the various \ncomponents of the RAG pipeline. The `ask` method passes the user's question into the predefined conversation \nchain and returns the result, providing the user with the relevant answer or information they seek. \n4. CASE STUDY \nThe effectiveness of the proposed CSQA system is validated through rigorous evaluation in two meticulously \ndesigned case studies. These studies were purposefully crafted to address the disparate needs of safety managers \nand construction students. Figure 5 outlines the parameters of each case study, including the target audience, a \nscenario exemplifying a real -world situation, and the type of safety documentation employed.  In the first case \nstudy, safety management professionals are presented with the CSQA system as a tool to bolster existing safety \nprotocols specifically regarding ladder use. The seamless interface of the CSQA system facilitates expedient access \nto critical  safety regulations and guidelines, empowering safety managers to make informed decisions and \nimplement proactive risk mitigation strategies. The second case study is designed to underscore the pedagogical \npotential of the CSQA system. Construction studen ts leverage the system's functionalities as an learning \nenvironment to comprehensively explore scaffold safety regulations and best practices. Engaging in interactive \ndialogue facilitated by the CSQA platform, students not only cultivate a nuanced understanding of scaffold safety \nprinciples but also refine their analytical acumen and critical thinking skills . This dual approach, catering to both \nsafety managers and construction students, underscores the versatility and adaptability of the CSQA system in \nmeeting the diverse educational and operational needs within the construction industry. \n \nFigure 5: The case study design. \n4.1 Case-I: Use of Ladder \nThis case study was designed to investigate the efficacy of the CSQA system in promoting safety in ladder usage, \nwith a focus on safety professionals within the construction sector during hazards identifcation and mitigation \nprocess.The proper utilization of ladders is critical in construction environments to mitigate the risk of accidents \nand injuries. To assess the system's effectiveness, safety professionals are provided with the document “Stairways \nand Ladders: A Guide to OSHA Rules” (OSHA, 2003), which delineates essential safety regulations and guidelines \nconcerning ladder usage in construction settings. This document serves as the foundation for inquiries within the \nCSQA prototype system, enabling safety professionals to extract pertinent safet y information according to their \n\n \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1033 \nspecific needs and concerns. \nThrough the extraction and comprehension of each safety instructions stipulated by OSHA regulations, safety \nprofessionals can reinforce safety protocols and implement proactive measures to safeguard worker well -being. \nThe CSQA system facilitates seamless a ccess to critical safety information, empowering safety professionals to \nmake informed decisions and devise comprehensive safety strategies tailored to the unique requirements of \nconstruction projects. Engaging with the CSQA platform, safety professionals can explore various safety scenarios \nand seek information regarding ladder inspection procedures, appropriate ladder placement, weight capacity \nconsiderations, and suitable ladder selection based on task requirements and environmental conditions. For \ninstance, safety professionals may inquire about: The frequency and procedures for ladder inspection as outlined \nby OSHA regulations, Guidelines for selecting the appropriate ladder type based on task requirements, Safety \nmeasures to prevent ladder -related accidents in high-risk work environments. By addressing these crucial safety \naspects, safety professionals can effectively mitigate the risk of ladder -related incidents, including falls and \ninjuries, thereby fostering a culture of safety within the construction industry. \n \nFigure 6: Case Scenario for Ladder and CSQA Sample interface. \nIn this case, an A -type ladder with two workers working together was presented as a construction scenario (as \nillustrated in Figure 6). To prepare for the safety inspection process, the safety manager considers some potential \nhazard situations that may occur during the use of the ladder. The results of the prompting process were illustrated \nin Figure 6. In the scenario, a user inquires about protective measures to prevent workers from overreaching while \nusing a ladder. The system, referred to as 'isafe,' provides a detailed response, outlining five key measures: (1) \nensuring proper placement of the ladder at the correct angle and height to eliminate the need for overreaching, (2) \nusing extension ladders or ladder accessories to reach higher areas safely, (3) maintaining three points of contact \nto improve stability and prevent overreaching, (4) provi ding appropriate tools or equipment to reach objects \nwithout overreaching, and (5) training workers on proper ladder usage, emphasizing the dangers of overreaching \nand the importance of staying within a safe reach zone. \n\n \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1034 \n4.2 Case-II: Use of Scaffold \nIn the second case study, the authors evaluated the pedagogical efficacy of the CSQA approach by focusing on \nextracting safety information about scaffolding, which is critical for students studying construction safety \nregulations, particularly OSHA 1926 Su bpart L. This regulation is essential for ensuring safety in construction \nsettings where scaffolding is prevalent. For this study, a document titled “A Guide to Scaffold Use in the \nConstruction Industry” (OSHA, 2002)  was provided as a PDF and uploaded to the CSQA prototype system. \nStudents then interacted with the system, querying it according to their specific informational needs. For example, \none student inquired about the requirements for dismantling scaffolding by asking, “What are the OSHA \nregulations regarding scaffold dismantling procedures?” Through this interaction, students could deeply engage \nwith and understand the safety pro visions mandated by OSHA, which is crucial for preventing scaffold -related \naccidents such as falls, structural collapses, and falling objects. \nThis learning process underscores the importance of comprehensive safety regulation knowledge in fostering a \nsafety culture within the construction industry, emphasizing the prioritization of worker well -being to ensure \nsuccessful and safe construction pro jects. The case study also included scenarios involving fixed and mobile \nscaffolding at the construction site, as detailed in Figure 7. To facilitate the learning process about potential hazards, \nstudents also queried the system about specific safety scenarios, such as the maximum number of workers allowed \non the scaffolding at one time. As shown in Figure 5, the responses illustrated the extracted information relevant \nto these safety queries.  The CSQA responds with a detailed explanation that the maximum number of workers \ndepends on several factors, such as the scaffold's load capacity, platform dimensions, and type. It emphasizes the \nimportance of ensuring that scaffolds are not overloaded and that OSHA guidelines are followed, including the use \nof guardrails and fall protection. The response further notes that different types of scaffolds may have varying \ncapacity limits and that worker training, supervision, and engineering evaluations may b e necessary to determine \nsafe load and worker limits.  \n \nFigure 7: Case Scenario for Scaffold and CSQA Sample interface. \n4.3 System evaluation and results  \nTo comprehensively evaluate the effectiveness of the CSQA system, a subjective assessment was conducted using \na structured questionnaire. The questionnaire targeted four key criteria: learnability, interaction, communication \nand relevancy, as listed in  Table 1. These criteria were chosen to ensure a thorough examination of the system's \nperformance in extracting rules and understanding level of users. The questionnaire was distributed to a group of \n26 participants, including 10 undergraduate students, 7 graduate students (Master's and PhD courses), and 9 \n\n \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1035 \nindustry professionals, selected through purposive sampling to ensure varied perspectives and expertise in the \nfield. The evaluation utilized a Likert scale with possible scores ranging from 1 to 5, where 1 indicated strong \ndisagreement and 5 indicated strong agreement. \nTable 1: Mean score of evaluation criteria. \nEvaluation \nCriteria Purpose Min Max Mean \nScore \nLearnability \nMeasure the system's effectiveness in facilitating comprehension and learning of \nconstruction safety rules compared to conventional methods. \n3 5 3.8 Example Question: Did using the construction safety rules extraction system enhance \nyour understanding of safety regulations and protocols? \nInteraction \nAssess the ease and intuitiveness of user interaction with the system for navigating and \naccessing construction safety information. \n4 5 4.5 Example Question: How easy was it to navigate through the system and access \ninformation on construction safety rules? \nCommunication \nEvaluate the clarity and effectiveness of communication between users and the system \nin providing explanations and guidance on construction safety regulations. \n3 5 4.1 Example Question: Were the explanations and guidance provided by the system clear \nand helpful in understanding construction safety regulations? \nRelevancy \nDetermine the system's capability to deliver accurate and pertinent answers to users' \ninquiries regarding construction safety protocols and regulations. \n4 5 4.4 Example Question: Did the system provide relevant and accurate \nanswers to your queries about construction safety protocols? \n5. DISCUSSIONS  \nIn this study, the authors introduced the CSQA approach to enhance information retrieval from regulatory \ndocuments. The CSQA system leverages LLMs to provide accurate, context -specific responses to safety -related \nqueries. A proof -of-concept prototype was developed and implemented, a s outlined in section 3.2 . Evaluation \nresults from a case study with safety managers and construction students ascertained that the CQSA could \neffectively support project participants in retrieving accurate information pertinent to their inquiries regardin g \nconstruction safety protocols and regulations. Additionally, user feedback confirmed that the proposed approach \nwas convenient to use, and would empower safety professionals in making decisions and implement risk mitigation \nstrategies. Analysis of participants' responses revealed positive feedback across various evaluation criteria, with \nmean scores ranging from 3.8 to 4.5 on a scale of 1 to 5. Interaction received the highest mean score of 4.5, \nindicating that users found the system int uitive and easy to use. Communication and relevancy also scored well, \nwith mean scores of 4.4 and 4.3, respectively, highlighting the system's effectiveness in providing clear and \nrelevant responses. Learnability received a slightly lower mean score of 3.8, suggesting that while the system aided \nunderstanding, there may be areas for improvement in facilitating learning. Standard deviation values ranged from \n0.6 to 1.0, indicating moderate to high variability in participant responses across different aspects of the system's \nperformance. \nConstruction professionals, such as designers, may utilize our system to extract rules or information from \ndocuments during the design phase. Similarly, safety managers may rely on the CSQA system during the hazard \nmitigation process, while construction st udents may use it for educational purposes or to deepen their \nunderstanding of safety regulations. Similarly, site supervisors may also benefit from the system's capabilities, \nparticularly during routine safety inspections or when encountering unexpected s afety concerns on the job site. \nMoreover, contractors and subcontractors may find value in utilizing the CSQA system to ensure compliance with \nsafety regulations and standards throughout the construction process. \nHowever, while the CQSA shows promise in addressing the shortcomings of current methods for searching for \nsafety information, several considerations and limitations warrant further attention. Firstly, the study primarily \nfocuses on the optimization of a da tabase containing safety requirement information, without expounding on the \narchitecture of the algorithm employed and its precision in information retrieval. It would be worthwhile for future \nworks to delve further into this in order to provide insights into the scalability and overall efficiency of the proposed \nmethodology. Additionally, investigating the precision of the algorithm in information retrieval is essential for \nevaluating its accuracy and reliability in extracting safety requirement informatio n. Hence, this step would \ncontribute to the validation of the proposed approach. Secondly, the case study focused solely on the extraction of \nscaffolding-related information. It would be necessary to examine the approach for retrieval of information in a \n \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1036 \nbroader range of tasks and settings, to shed light on the the versatility and applicability of the proposed approach \nacross various safety-critical domains within the construction industry. Thirdly, the evaluation did not address the \nrisk of hallucinations or misunderstandings by the CSQA approach. These hallucinations can lead to the provision \nof incorrect or irrelevant information. Hence, there is a need to incorporate continuous feedback loops to mitigate \nthis risk, allowing users to report inaccuracies. This feedback is used to refine the model and improve the accuracy \nof responses over time. Future studies can also explore how this retrieval approach can be integrated into practice \nto enrich other safety management processes, such as Job Hazard Analysis (JHA) and safety training. \n6. CONCLUSION \nThe present study proposed the Construction Safety Query Assistant (CSQA), a novel system leveraging Large \nLanguage Models (LLMs) to enhance the extraction and comprehension of construction safety regulations. This \napproach seeks to mitigate the complexities inherent in retrieving and understanding detailed safety requirements \nfrom voluminous and intricate regulatory documents. Comprising three core modules —Construction Safety \nInvestigation (CSI), Safety Condition Identification (SCI), and Safety Informatio n Delivery (SID) —the CSQA \nsystem presents a structured and efficient methodology for processing, querying, and delivering safety information \ntailored to specific user needs. The demonstration through two case studies highlights the potential of CSQA to \nsignificantly improve safety management and training within the construction industry, enabling precise and rapid \naccess to critical safety information. \nThe study’s findings underscore the transformative potential of integrating LLMs into construction safety \nmanagement, offering a robust solution to longstanding challenges in safety regulation compliance and education. \nBy providing clear, context-specific responses, the CSQA system can enhance the efficiency and effectiveness of \nsafety mana gement practices. The broader implications of this study suggest that such technology can be \ninstrumental in creating safer construction environments and fostering a culture of compliance and continuous \nimprovement. \nFuture research will aim to expand the scope of the CSQA system to encompass a broader range of safety \nregulations and practical applications, providing a comprehensive tool for safety management across the \nconstruction industry. Implementing continuous feedback loops and enhancing the training data can help address \nthis issue, thereby improving the system's robustness and trustworthiness in practical applications. This effort will \nensure a safer working environment for all stakeholders and foster the adopt ion of intelligent systems in safety \nmanagement practices. \nACKNOWLEDGEMENTS  \nThis research was conducted with the support of the \"National R&D Project for Smart Construction Technology \n(No.RS-2020-KA156291)\" funded by the Korea Agency for Infrastructure Technology Advancement under the \nMinistry of Land, Infrastructure and Transport , and managed by the Korea Expressway Corporation and was \nsupported by Basic Science Research Program through the National Research Foundation of Korea (NRF) funded \nby the Ministry of Education (2020R1I1A3064165). \nThis paper is an extended version of our previous work which was presented at 23rd INTERNA TIONAL \nCONFERENCE ON CONSTRUCTION APPLICATIONS OF VIRTUAL REALITY (CONVR 2023), Florence, \nItaly. The authors acknowledge the support and feedback from Prof Farzad Rah imian and Dr Vito Getuli as the \nChairs of the International Scientific Committee of CONVR 2023. \nREFERENCES \nBaker, H., Hallowell, M.R., Tixier, A.J.P., 2020. Automatically learning construction injury precursors from text. \nAutom. Constr. 118, 103145. https://doi.org/10.1016/J.AUTCON.2020.103145 \nBao, L., Tran, S.V .T., Nguyen, T.L., Pham, H.C., Lee, D., Park, C., 2022. Cross-platform virtual reality for real -\ntime construction safety training using immersive web and industry foundation classes. Autom. Constr. 143, \n104565. https://doi.org/10.1016/J.AUTCON.2022.104565 \nBao, Q.L., Tran, S.V .T., Yang, J., Pedro, A., Pham, H.C., Park, C., 2024. Token incentive framework for virtual-\nreality-based construction safety training. Autom. Constr. 158, 105167. \n \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1037 \nhttps://doi.org/10.1016/J.AUTCON.2023.105167 \nBrozovsky, J., Labonnote, N., Vigren, O., 2024. Digital technologies in architecture, engineering, and construction. \nAutom. Constr. 158, 105212. https://doi.org/10.1016/J.AUTCON.2023.105212 \nCensus of Fatal Occupational Injuries Summary, 2022 [WWW Document], 2022. URL \nhttps://www.bls.gov/news.release/cfoi.nr0.htm (accessed 4.16.24). \nChen, J., Xiao, S., Zhang, P., Luo, K., Lian, D., Liu, Z., 2024. BGE M3 -Embedding: Multi -Lingual, Multi -\nFunctionality, Multi -Granularity Text Embeddings Through Self -Knowledge Distillation  \nhttps://doi.org/10.48550/arXiv.2402.03216 \nFeng, D., Chen, H., 2021. A small samples training framework for deep Learning -based automatic information \nextraction: Case study of construction accident news reports analysis. Adv. Eng. Informatics 47, 101256. \nhttps://doi.org/10.1016/J.AEI.2021.101256 \nGeerts, G.L., 2011. A design science research methodology and its application to accounting information systems \nresearch. Int. J. Account. Inf. Syst. 12, 142–151. https://doi.org/10.1016/J.ACCINF.2011.02.004 \nGu, Y ., Zhang, S., Usuyama, N., Woldesenbet, Y ., Wong, C., Sanapathi, P.-N., Wei, M., V alluri, N., Strandberg, E., \nNaumann, T., Poon, H., 2023. Distilling Large Language Models for Biomedical Knowledge Extraction: A \nCase Study on Adverse Drug Events. \nHussain, R., Sabir, A., Lee, D.Y ., Zaidi, S.F.A., Pedro, A., Abbas, M.S., Park, C., 2024a. Conversational AI-based \nVR system to improve construction safety training of migrant workers. Autom. Constr. 160, 105315. \nhttps://doi.org/10.1016/J.AUTCON.2024.105315 \nHussain, R., Zaidi, S.F.A., Pedro, A., Lee, H., Park, C., 2024b. Exploring construction workers’ attention and \nawareness in diverse virtual hazard scenarios to prevent struck -by accidents. Saf. Sci. 175, 106526. \nhttps://doi.org/10.1016/J.SSCI.2024.106526 \nJeong, H., Shin, Wonsang, 2023. An Analysis on the Safety Management Level of Domestic Medium Construction \nCompanies and Its Improvement Measures. Korean J. Constr. Eng. Manag. 24, 20 –30. \nhttps://doi.org/10.6106/KJCEM.2023.24.3.020 \nJiang, A.Q., Sablayrolles, A., Mensch, A., Bamford, C., Chaplot, D.S., Casas, D. de las, Bressand, F., Lengyel, G., \nLample, G., Saulnier, L., Lavaud, L.R., Lachaux, M.-A., Stock, P ., Scao, T. Le, Lavril, T., Wang, T., Lacroix, \nT., Sayed, W. El, 2023. Mistral 7B 1–9. \nKang, Jeong, H., Chae, J., Kang, Y ., 2023. Distribution of Occupational Safety and Health Management Costs \n(OSHMC) by Project Size and Activity Type with the Consideration of Accident Rates. Korean J. Constr. \nEng. Manag. 24, 44–51. https://doi.org/10.6106/KJCEM.2023.24.4.044 \nKou Wei-mi, 2008. On the education and training of production safety in building construction enterprises. \nKuechler, B., V aishnavi, V ., 2008. On theory development in design science research: anatomy of a research \nproject. Eur. J. Inf. Syst. 17, 489–504. https://doi.org/10.1057/EJIS.2008.40 \nLiao Guo-rong, 2013. Discussion on the importance of safety education in building construction. \nLin, H., Wu, J., Y uan, C., Luo, Y ., V an Den Brand, M., Engelen, L., 2015. A systematic approach for safety evidence \ncollection in the safety -critical domain, in: 9th Annual IEEE International Systems Conference, SysCon \n2015 - Proceedings. IEEE, pp. 194–199. https://doi.org/10.1109/SYSCON.2015.7116751 \nMcCluskey, E.G., Thompson, S., McSherry, D.M.G., 1988. Standards, Codes of Practice and Expert Systems. \nMeas. Control 21, 5–9. https://doi.org/10.1177/002029408802100102 \nN. Skeepers, 2016. Driving safety performance in the construction industry through safety induction and training \n-- as a leading measure. \nNair, S., De La V ara, J.L., Sabetzadeh, M., Briand, L., 2014. An extended systematic literature review on provision \nof evidence for safety certification. Inf. Softw. Technol. 56, 689 –717. \nhttps://doi.org/10.1016/j.infsof.2014.03.001 \n \n \n ITcon Vol. 29 (2024), Tran et al., pg. 1038 \nNielsen, K., Ng, K., Guglielmi, D., Lorente, L., P \\u atra\\c s, L., Vignoli, M., 2022. The importance of training \ntransfer of non-technical skills safety training of construction workers. Int. J. Occup. Saf. Ergon. 29, 444 –\n452. \nOccupational Safety and Health Administration (OSHA), U.S. Department of Labor, 2002. A Guide to Scaffold \nUse in the Construction Industry Small Business Safety Management Series OSHA 3150 2002 (Revised). \nOccupational Safety and Health Administration (OSHA), U.S. Department of Labor, 2003. Stairways and Ladders \nA Guide to OSHA Rules, OSHA 3124-12R 2003. \nPeffers, K., Tuunanen, T., Rothenberger, M.A., Chatterjee, S., 2007. A Design Science Research Methodology for \nInformation Systems Research. J. Manag. Inf. Syst. 24, 45 –77. https://doi.org/10.2753/MIS0742 -\n1222240302 \nRupasinghe, N.K.A.H., Panuwatwanich, K., 2021. UNDERSTANDING CONSTRUCTION SITE SAFETY \nHAZARDS THROUGH OPEN DA TA: TEXT MINING APPROACH. ASEAN Eng. J. 11, 160 –178. \nhttps://doi.org/10.11113/AEJ.V11.17871 \nSaka, A., Taiwo, R., Saka, N., Salami, B.A., Ajayi, S., Akande, K., Kazemi, H., 2024. GPT models in construction \nindustry: Opportunities, limitations, and a use case validation. Dev. Built Environ. 17, 100300. \nhttps://doi.org/10.1016/J.DIBE.2023.100300 \nStatus of fatal accidents subject to disaster investigation in 2022 [WWW Document], 2022. . Minist. Employ. \nLabor, Korea. URL https://www.moel.go.kr/news/enews/report/enewsView.do?news_seq=14546 \n(accessed 4.16.24). \nTran, S., Khan, N., Kimito, E.C., Pedro, A. [0000-0002-7884-5316], Soltani, M. [0000-0002-5217-2010], Hussain, \nR. [0000 -0002-6909-5189], Yoo, T. [0009 -0008-9739-1867], Park, C. [0000 -0003-2256-300X], 2023. \nExtracting Information from Construction Safety Requirements Using Lar ge Language Model 761 –767. \nhttps://doi.org/10.36253/979-12-215-0289-3.76 \nTran, S.V .-T., Lee, D., Bao, Q.L., Yoo, T., Khan, M., Jo, J., Park, C., 2023. A Human Detection Approach for \nIntrusion in Hazardous Areas Using 4D -BIM-Based Spatial -Temporal Analysis and Computer Vision. \nBuild. 2023, V ol. 13, Page 2313 13, 2313. https://doi.org/10.3390/BUILDINGS13092313 \nTran, S.V .-T., Lee, D., Pham, H.C., Dang, L.H., Park, C., Lee, U.-K., 2024. Leveraging BIM for Enhanced Camera \nAllocation Planning at Construction Job Sites: A V oxel-Based Site Coverage and Overlapping Analysis. \nBuild. 2024, V ol. 14, Page 1880 14, 1880. https://doi.org/10.3390/BUILDINGS14061880 \nTran, S.V ., Bao, L.Q., Nguyen, L.T., Pedro, A., 2022. Development of Computer Vision and BIM -cloud based \nAutomated Status Updating for Construction Safety Monitoring. \nTran, S.V .T., Khan, N., Lee, D., Park, C., 2021. A Hazard Identification Approach of Integrating 4D BIM and \nAccident Case Analysis of Spatial –Temporal Exposure. Sustain. 2021, V ol. 13, Page 2211 13, 2211. \nhttps://doi.org/10.3390/SU13042211 \nTran, S.V .T., Nguyen, T.L., Chi, H.L., Lee, D., Park, C., 2022. Generative planning for construction safety \nsurveillance camera installation in 4D BIM environment. Autom. Constr. 134, 104103. \nhttps://doi.org/10.1016/J.AUTCON.2021.104103 \nWang, X., El-Gohary, N., 2023. Deep Learning–Based Named Entity Recognition and Resolution of Referential \nAmbiguities for Enhanced Information Extraction from Construction Safety Regulations. J. Comput. Civ. \nEng. 37, 04023023. https://doi.org/10.1061/(ASCE)CP.1943-5487.0001064 \nWu, C., Li, X., Guo, Y ., Wang, J., Ren, Z., Wang, M., Y ang, Z., 2022. Natural language processing for smart \nconstruction: Current status and future directions. Autom. Constr. 134, 104059. \nhttps://doi.org/10.1016/J.AUTCON.2021.104059 \nZhong, B., He, W., Huang, Z., Love, P.E.D., Tang, J., Luo, H., 2020. A building regulation question answering \nsystem: A deep learning methodology. Adv. Eng. Informatics 46, 101195. \nhttps://doi.org/10.1016/J.AEI.2020.101195 "
}