{
    "title": "Leveraging on large language model to classify sentences: a case study applying STAGES scoring methodology for sentence completion test on ego development",
    "url": "https://openalex.org/W4407230212",
    "year": 2025,
    "authors": [
        {
            "id": "https://openalex.org/A5116182209",
            "name": "Xavier Bronlet",
            "affiliations": [
                null
            ]
        }
    ],
    "references": [
        "https://openalex.org/W3092722276",
        "https://openalex.org/W1444168786",
        "https://openalex.org/W4321455981",
        "https://openalex.org/W4200493897",
        "https://openalex.org/W2128157178",
        "https://openalex.org/W4310576793",
        "https://openalex.org/W2053154970",
        "https://openalex.org/W4387617694",
        "https://openalex.org/W4319348802",
        "https://openalex.org/W2157035015",
        "https://openalex.org/W6723874987",
        "https://openalex.org/W4392462461",
        "https://openalex.org/W2603020828",
        "https://openalex.org/W3046916485",
        "https://openalex.org/W6793100289",
        "https://openalex.org/W3012470805",
        "https://openalex.org/W6852418670",
        "https://openalex.org/W2238272118",
        "https://openalex.org/W2044517432",
        "https://openalex.org/W6628505203",
        "https://openalex.org/W4391971084",
        "https://openalex.org/W4313440285",
        "https://openalex.org/W4283688409",
        "https://openalex.org/W1882400742",
        "https://openalex.org/W1579838312",
        "https://openalex.org/W4390601273",
        "https://openalex.org/W435082822",
        "https://openalex.org/W1560984021",
        "https://openalex.org/W4378771755",
        "https://openalex.org/W231717993",
        "https://openalex.org/W4241947868"
    ],
    "abstract": "Introduction The emergence of artificial intelligence and the widespread availability of large language model open the door to text analysis at scale leveraging on complex classification instructions. This case study explores the possibility of using available large language models to measure ego development at scale and establish a methodology that can be applied to other classification instructions. Ego consists of the traits that influence how a person perceives and engages with the world, while ego development is a crucial aspect of adult personality growth, influencing behaviors and decisions in both personal and professional contexts. Accurate assessments of ego development stages are vital for creating effective strategies in organizational psychology and corporate analytics. Methods This case study investigates the agreement between expert and automated classifications of ego development stages, aiming to evaluate the potential of automation in this domain leveraging artificial intelligence and large language models. Cohen’s kappa statistic has been used to measure the agreement between classifications made by experts and those generated by an automated process leveraging large language models. Results The comparison between the scoring of experts and large language models yielded a weighted Kappa value of 0.779, indicating a substantial level of agreement that is statistically meaningful and unlikely to be due to chance. Discussion While this suggests valuable scoring that leverages large language models, it also highlights the opportunity for further refinement to closely match expert assessments. We observed low variability in aggregated values, demonstrating that the automated process functions effectively at scale. The robustness of aggregated data is particularly evident when calculating ego development scores for individuals, groups, corporate units, and entire corporations. This capability underscores the utility of the automated system for high-level evaluations and decision-making leveraging on a solid indicator. While the classification system developed in this case study shows promise, targeted enhancements may help to achieve a level of accuracy and reliability that improves alignment with experts’ evaluations for single sentences. The methodology developed in this case study appears to be useful to support other evaluations at scale that leverage large language models using other maps of classifications.",
    "full_text": null
}