{
  "title": "Large language model usage guidelines in Korean medical journals: a survey using human-artificial intelligence collaboration",
  "url": "https://openalex.org/W4405259807",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A2149346067",
      "name": "Sangzin Ahn",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W4323848232",
    "https://openalex.org/W4379259169",
    "https://openalex.org/W4327518740",
    "https://openalex.org/W4321351832",
    "https://openalex.org/W4385988359",
    "https://openalex.org/W4387034825",
    "https://openalex.org/W4385080756",
    "https://openalex.org/W4380360840",
    "https://openalex.org/W4384561707",
    "https://openalex.org/W4317390716",
    "https://openalex.org/W4391403616",
    "https://openalex.org/W4384625632",
    "https://openalex.org/W4379140845",
    "https://openalex.org/W4377823405",
    "https://openalex.org/W4390613603",
    "https://openalex.org/W4390374219",
    "https://openalex.org/W4387236500",
    "https://openalex.org/W4387823534"
  ],
  "abstract": "Background: Large language models (LLMs), the most recent advancements in artificial intelligence (AI), have profoundly affected academic publishing and raised important ethical and practical concerns. This study examined the prevalence and content of AI guidelines in Korean medical journals to assess the current landscape and inform future policy implementation.Methods: The top 100 Korean medical journals determined by Hirsh index were surveyed. Author guidelines were collected and screened by a human researcher and AI chatbot to identify AI-related content. The key components of LLM policies were extracted and compared across journals. The journal characteristics associated with the adoption of AI guidelines were also analyzed.Results: Only 18% of the surveyed journals had LLM guidelines, which is much lower than previously reported in international journals. However, the adoption rates increased over time, reaching 57.1% in the first quarter of 2024. High-impact journals were more likely to have AI guidelines. All journals with LLM guidelines required authors to declare LLM tool use and 94.4% prohibited AI authorship. The key policy components included emphasizing human responsibility (72.2%), discouraging AI-generated content (44.4%), and exempting basic AI tools (38.9%).Conclusion: While the adoption of LLM guidelines among Korean medical journals is lower than the global trend, there has been a clear increase in implementation over time. The key components of these guidelines align with international standards, but greater standardization and collaboration are needed to ensure the responsible and ethical use of LLMs in medical research and writing.",
  "full_text": null,
  "topic": "Publishing",
  "concepts": [
    {
      "name": "Publishing",
      "score": 0.6968221664428711
    },
    {
      "name": "Medical journal",
      "score": 0.4406808018684387
    },
    {
      "name": "Computer science",
      "score": 0.433233380317688
    },
    {
      "name": "Data science",
      "score": 0.4004803001880646
    },
    {
      "name": "Political science",
      "score": 0.2605345845222473
    },
    {
      "name": "Library science",
      "score": 0.20546364784240723
    },
    {
      "name": "Law",
      "score": 0.0
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I104338594",
      "name": "Inje University",
      "country": "KR"
    }
  ]
}