{
  "title": "Aligning Large Language Models for Enhancing Psychiatric Interviews Through Symptom Delineation and Summarization: Pilot Study",
  "url": "https://openalex.org/W4403063608",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A5107698107",
      "name": "Jae-hee So",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A5104247244",
      "name": "Joonhwan Chang",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2002788153",
      "name": "Eunji Kim",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2122025720",
      "name": "Junho Na",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2113468957",
      "name": "Jiyeon Choi",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A4382260331",
      "name": "Jy-yong Sohn",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2126226619",
      "name": "Byung Hoon Kim",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2102059704",
      "name": "Sang Hui Chu",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W4206688156",
    "https://openalex.org/W4281489185",
    "https://openalex.org/W4200409217",
    "https://openalex.org/W2986567973",
    "https://openalex.org/W4393160302",
    "https://openalex.org/W4384071683",
    "https://openalex.org/W4384561707",
    "https://openalex.org/W4388759569",
    "https://openalex.org/W4387440167",
    "https://openalex.org/W4392986561",
    "https://openalex.org/W4389431826",
    "https://openalex.org/W4392193048",
    "https://openalex.org/W4376871976",
    "https://openalex.org/W4386117324",
    "https://openalex.org/W4386765433",
    "https://openalex.org/W4385442373",
    "https://openalex.org/W4389519254",
    "https://openalex.org/W4240861882",
    "https://openalex.org/W4220732635",
    "https://openalex.org/W4200446580"
  ],
  "abstract": "Background Recent advancements in large language models (LLMs) have accelerated their use across various domains. Psychiatric interviews, which are goal-oriented and structured, represent a significantly underexplored area where LLMs can provide substantial value. In this study, we explore the application of LLMs to enhance psychiatric interviews by analyzing counseling data from North Korean defectors who have experienced traumatic events and mental health issues. Objective This study aims to investigate whether LLMs can (1) delineate parts of the conversation that suggest psychiatric symptoms and identify those symptoms, and (2) summarize stressors and symptoms based on the interview dialogue transcript. Methods Given the interview transcripts, we align the LLMs to perform 3 tasks: (1) extracting stressors from the transcripts, (2) delineating symptoms and their indicative sections, and (3) summarizing the patients based on the extracted stressors and symptoms. These 3 tasks address the 2 objectives, where delineating symptoms is based on the output from the second task, and generating the summary of the interview incorporates the outputs from all 3 tasks. In this context, the transcript data were labeled by mental health experts for the training and evaluation of the LLMs. Results First, we present the performance of LLMs in estimating (1) the transcript sections related to psychiatric symptoms and (2) the names of the corresponding symptoms. In the zero-shot inference setting using the GPT-4 Turbo model, 73 out of 102 transcript segments demonstrated a recall mid-token distance d&lt;20 for estimating the sections associated with the symptoms. For evaluating the names of the corresponding symptoms, the fine-tuning method demonstrates a performance advantage over the zero-shot inference setting of the GPT-4 Turbo model. On average, the fine-tuning method achieves an accuracy of 0.82, a precision of 0.83, a recall of 0.82, and an F1-score of 0.82. Second, the transcripts are used to generate summaries for each interviewee using LLMs. This generative task was evaluated using metrics such as Generative Evaluation (G-Eval) and Bidirectional Encoder Representations from Transformers Score (BERTScore). The summaries generated by the GPT-4 Turbo model, utilizing both symptom and stressor information, achieve high average G-Eval scores: coherence of 4.66, consistency of 4.73, fluency of 2.16, and relevance of 4.67. Furthermore, it is noted that the use of retrieval-augmented generation did not lead to a significant improvement in performance. Conclusions LLMs, using either (1) appropriate prompting techniques or (2) fine-tuning methods with data labeled by mental health experts, achieved an accuracy of over 0.8 for the symptom delineation task when measured across all segments in the transcript. Additionally, they attained a G-Eval score of over 4.6 for coherence in the summarization task. This research contributes to the emerging field of applying LLMs in psychiatric interviews and demonstrates their potential effectiveness in assisting mental health practitioners.",
  "full_text": null,
  "topic": "Preprint",
  "concepts": [
    {
      "name": "Preprint",
      "score": 0.9408789873123169
    },
    {
      "name": "Automatic summarization",
      "score": 0.8281092047691345
    },
    {
      "name": "Psychology",
      "score": 0.4769243597984314
    },
    {
      "name": "Computer science",
      "score": 0.32430940866470337
    },
    {
      "name": "Natural language processing",
      "score": 0.29340076446533203
    },
    {
      "name": "World Wide Web",
      "score": 0.2221258580684662
    }
  ]
}