{
  "title": "Understanding contraceptive switching rationales from real world clinical notes using large language models",
  "url": "https://openalex.org/W4409717995",
  "year": 2025,
  "authors": [
    {
      "id": "https://openalex.org/A4316189112",
      "name": "Brenda Y. Miao",
      "affiliations": [
        "University of California, San Francisco"
      ]
    },
    {
      "id": "https://openalex.org/A2995843509",
      "name": "Christopher Y. K. Williams",
      "affiliations": [
        "University of California, San Francisco"
      ]
    },
    {
      "id": "https://openalex.org/A5093887407",
      "name": "Ebenezer Chinedu-Eneh",
      "affiliations": [
        "University of California, San Francisco"
      ]
    },
    {
      "id": "https://openalex.org/A2890023934",
      "name": "Travis Zack",
      "affiliations": [
        "University of California, San Francisco",
        "UCSF Helen Diller Family Comprehensive Cancer Center"
      ]
    },
    {
      "id": "https://openalex.org/A2889180838",
      "name": "Emily Alsentzer",
      "affiliations": [
        "Brigham and Women's Hospital",
        "Harvard University"
      ]
    },
    {
      "id": "https://openalex.org/A284454978",
      "name": "Atul J. Butte",
      "affiliations": [
        "University of California, San Francisco",
        "Executive Office of the President"
      ]
    },
    {
      "id": "https://openalex.org/A2227363672",
      "name": "Irene Y Chen",
      "affiliations": [
        "University of California, Berkeley",
        "University of California, San Francisco"
      ]
    },
    {
      "id": "https://openalex.org/A4316189112",
      "name": "Brenda Y. Miao",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2995843509",
      "name": "Christopher Y. K. Williams",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A5093887407",
      "name": "Ebenezer Chinedu-Eneh",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2890023934",
      "name": "Travis Zack",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2889180838",
      "name": "Emily Alsentzer",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A284454978",
      "name": "Atul J. Butte",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2227363672",
      "name": "Irene Y Chen",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2592395378",
    "https://openalex.org/W2123229502",
    "https://openalex.org/W4281487946",
    "https://openalex.org/W3130338552",
    "https://openalex.org/W2904393686",
    "https://openalex.org/W2982153346",
    "https://openalex.org/W3096282994",
    "https://openalex.org/W4387425986",
    "https://openalex.org/W3097132139",
    "https://openalex.org/W2913031074",
    "https://openalex.org/W4321487837",
    "https://openalex.org/W3124677313",
    "https://openalex.org/W185624980",
    "https://openalex.org/W2994689047",
    "https://openalex.org/W2145270227",
    "https://openalex.org/W2095588973",
    "https://openalex.org/W4281644150",
    "https://openalex.org/W4384071683",
    "https://openalex.org/W4389421203",
    "https://openalex.org/W4361289889",
    "https://openalex.org/W4360887219",
    "https://openalex.org/W4389205282",
    "https://openalex.org/W4376602294",
    "https://openalex.org/W4383223222",
    "https://openalex.org/W4392822465",
    "https://openalex.org/W4401306979",
    "https://openalex.org/W4322718191",
    "https://openalex.org/W4401306886",
    "https://openalex.org/W4391940656",
    "https://openalex.org/W2022102836",
    "https://openalex.org/W2951036170",
    "https://openalex.org/W4396691546",
    "https://openalex.org/W4403603479",
    "https://openalex.org/W3185341429",
    "https://openalex.org/W4389156617",
    "https://openalex.org/W4221142221",
    "https://openalex.org/W4320486724",
    "https://openalex.org/W2949676527",
    "https://openalex.org/W2889326414",
    "https://openalex.org/W151377110",
    "https://openalex.org/W2289625907",
    "https://openalex.org/W3003257820",
    "https://openalex.org/W4385381606",
    "https://openalex.org/W3103145119",
    "https://openalex.org/W3101930090",
    "https://openalex.org/W2030498706"
  ],
  "abstract": null,
  "full_text": "npj |digital medicine Article\nPublished in partnership with Seoul National University Bundang Hospital\nhttps://doi.org/10.1038/s41746-025-01615-0\nUnderstanding contraceptive switching\nrationales from real world clinical notes\nusing large language models\nCheck for updates\nBrenda Y. Miao1 , Christopher Y. K. Williams1, Ebenezer Chinedu-Eneh2, Travis Zack1,3,\nEmily Alsentzer 4,5,A t u lJ .B u t t e1,6,10 & Irene Y. Chen7,8,9,10\nUnderstanding reasons for treatment switching is of signiﬁcant medical interest, but these factors are\noften only found in unstructured clinical notes and can be difﬁcult to extract. We evaluated the zero-\nshot abilities of GPT-4 and eight other open-source large language models (LLMs) to extract\ncontraceptive switching information from 1964 clinical notes derived from the UCSF Information\nCommons dataset. GPT-4 extracted the contraceptives started and stopped at each switch with\nmicroF1 scores of 0.85 and 0.88, respectively, compared to 0.81 and 0.88 for the best open-source\nmodel. When evaluated by clinical experts, GPT-4 extracted reasons for switching with an accuracy of\n91.4% (2.2% hallucination rate). Transformer-based topic modeling identiﬁed patient preference,\nadverse events, and insurance coverage as key reasons. Theseﬁndings demonstrate the value of\nLLMs in identifying complex treatment factors and provide insights into reasons for contraceptive\nswitching in real-world settings.\nPrescription contraceptives play a critical role in supporting women’s\nreproductive health and patients may switch between several contra-\nceptives throughout their health trajectories\n1– 3. With many contra-\nceptive options available, understanding the factors driving selection\nand switching can provide data to inform patient-provider decision\nmaking. Contraceptives may vary by active ingredient 4 with each\ncontraceptive group producing unique adverse event proﬁles that may\ncontribute to clinical decision making2,5. In addition, several other\nfactors, including personal preference,cost, availability, comorbidities\nand clinical constraints, may contribute to a patient’s decision to start,\nstop, or switch contraceptives6. With nearly 50 million women in the\nUnited States using contraceptives 7, understanding the factors that\ndrive contraceptives selection and switching is of signi ﬁcant\ninterest4,7,8.\nAfter a medication is prescribed, patients may elect to switch\ntreatments for reasons related to efﬁcacy, side effects, costs, access, or\npersonal preference9– 12. Contraceptive switching is common - 44% of\nwomen starting a contraceptive discontinued its use within 1 year, with\n76% resuming use of the same or another contraceptive within\n3m o n t h s13. However, the reasons behind treatment switches are often\ndocumented only in clinical notes, making them difﬁcult to analyze at\nscale. Manual annotation to create datasets is time-consuming and\nexpensive\n14– 16, particularly for complex clinical text, and the develop-\nment of machine learning models to automate this information\nextraction remains achallenging task\n17.\nRecently, the development of g eneral large language models\n(LLMs) has shown signiﬁcant promise in being able to extract medi-\ncation information without the need for manually annotated training\ndata (“zero-shot extraction”)18– 20. Despite concerns including factually\nincorrect information, clinicians a nd researchers remain optimistic\nthat these computational advances can translate to clinically-\nmeaningful use cases\n21– 24. Here, we evaluate the ability of GPT-4 to\nextract reasons for contraceptive selection strategies. These extracted\nvalues were used to understand differences in reasons for switching\nbetween patient populations using clinical notes from a large academic\nmedical center.\n1Bakar Computational Health Sciences Institute, University of California San Francisco, San Francisco, CA, USA.2Department of Medicine, University of California\nSan Francisco, San Francisco, CA, USA.3Helen Diller Family Comprehensive Cancer Center, University of California San Francisco, San Francisco, CA, USA.\n4Division of General Internal Medicine, Brigham and Women’s Hospital, Boston, MA, USA.5Harvard Medical School, Boston, MA, USA.6Center for Data-driven\nInsights and Innovation, University of California, Ofﬁce of the President, Oakland, CA, USA.7Computational Precision Health, University of California, Berkeley and\nUniversity of California, San Francisco, Berkeley, CA, USA.8Electrical Engineering and Computer Science, University of California, Berkeley, Berkeley, CA, USA.\n9Berkeley AI Research, University of California, Berkeley, Berkeley, CA, USA.10These authors contributed equally: Atul J. Butte, Irene Y. Chen.\ne-mail: miao.brenda1@gmail.com\nnpj Digital Medicine|           (2025) 8:221 1\n1234567890():,;\n1234567890():,;\nResults\nPatient cohort\nWe selected a contraceptive patient cohort using the UCSF Information\nCommons dataset25, which contained 133,778documented medication\norders for contraceptives. Condoms and emergency contraceptives orders\nwere removed, as were any prescriptions without start dates. The remaining\ncohort of 37,834 patients had a total of 100,593 relevant medication orders\nfor an intrauterine, oral, intravaginal,subdermal, transdermal, or injectable\ncontraceptive. We removed 5594 patients who did not have any follow up\nencounters at least 6 months after thelast contraceptive order and further\nﬁltered out 11,916 orders without associated clinical notes. Finally, we\nremoved 53,125 duplicate medication orders, leaving a contraceptive cohort\nconsisting of 39,712 medication orders across 20,274 unique patients\n(Fig. 1a).\nAmong this contraceptive cohort, 1515 (7.6%) patients experienced a\ntotal of 1964 contraceptive switches. Compared to patients who did not have\na contraceptive switch and had demographic information available\n(n = 15,907), patients with contraceptive switches tended to be younger,\nwith a mean age of 25.9 years (SD: 7.7) compared to 29.1 years (SD: 8.4,\np < 0.001, Table1). The mean time to a patient’s ﬁrst contraceptive switch\nwas 39.1 months (SD: 32.0 months). There was also a statistically signiﬁcant\ndifference in the proportion of patients with and without contraceptive\nswitches by patient race/ethnicity (p < 0.001). The largest difference\noccurred in patients with a race/ethnicity listed as“Black or African\nAmerican,” with 19.3% of such patients having a contraceptive switch\ncompared to 8.2% without. There was also a higher proportion of patients\nwith a contraceptive switch identifying as“Latinx” (19.3%) compared to the\nproportion of“Latinx” patients without contraceptive switches (15.1%).\n“White” (33.0%) or“Asian” (16.0%) patients had lower rates of contra-\nceptive switching in this cohort compared to the same groups without\nswitches, with 45.1% of patients without contraceptive switches identifying\nas “White” and 20.3% identifying as“Asian.”\nSwitching differed signiﬁcantly by theﬁrst contraceptive prescribed,\nwith the highest rates of switching following initial prescription of trans-\ndermal contraceptives (33.5%) and the lowest rates following initial pre-\nscription of intrauterine (5.1%) and oral (6.3%) contraceptives. The most\ncommon switch occurred in patients who were on oral contraceptives and\nswitched to intravaginal contraceptives (n = 205,n =1 0 . 5 % ) . T h e l e a s t\ncommon switch occurred from intrauterine to injectable contraceptives\n(n = 6, 0.31%, Supplementary Table 4).\nHuman evaluation of GPT4 extraction of contraceptive switching\nPrompt evaluation was performed on a held out set consisting of notes from\n5% of patients (n =9 3 c l i n i c a l n o t e s ) , a n d e v aluated against annotations\nfrom a clinical reviewer (Fig.1b). There was no signiﬁcant difference in\nperformance across the six prompts used to extract contraceptive infor-\nmation using zero-shot GPT-4, withmicro F1 scores ranging from 0.817 to\n0.849 (mean = 0.827, SD: 0.012) for extraction of contraceptive started, and\n0.827 to 0.881 (mean = 0.854, SD: 0.020) for extraction of contraceptive\nstopped (Fig.2a, b). The best prompt for medication stopping extraction\nused the specialist system conﬁguration and default prompt. Reasons\nextracted by this prompt were also evaluated by a clinical reviewer for both\naccuracy and rate of hallucination. Human evaluation showed that GPT-4\nwas capable of extracting these reasons with 91.4% accuracy and without\nhallucination 97.8% of the time (n = 93, Fig.2c). Given the high accuracy\nand minimal hallucination of this prompt for extracting information about\ncontraceptive stopping and reasons for stopping on the development\ndataset, this prompt was selected to extract contraceptive information from\nthe remaining clinical notes.\nThe performance of this prompt was also tested in several open source\nlanguage models (Gemma-7B-it\n26, Gemma2-9B-it27, Meta-Llama-3-8B-\nInstruct28,29, Meta-Llama-3.1-8B-Instruct30,S t a r l i n g - 7 B - a l p h a31,S t a r l i n g -\n7B-beta32), including two further trained on biomedical text (BioMistral-\n7B33, JSL-MedMNX-7B-SFT34). Of these models, Gemma2-9B-it showed\nthe best performance with the highest microF1 scores for both medication\nstart (0.806) and stop (0.882) extraction (Supplementary Table 8).\nGPT-4 contraceptive switching information extraction outper-\nforms baseline models\nZero-shot GPT-4 performance usingthe best prompt was also compared to\nbaseline models trained on differentproportions silver-standard labels\nderived from structured data. GPT-4 outperformed all baseline models,\nregardless of the proportion of training data used for baseline models\n(Fig. 3), with micro F1 scores of 0.828 and 0.439 on contraceptive start and\nstop extraction, respectively. The next best model was random forest trained\non TF-IDF representations, with a 0.714 (SD: 0.024) score on medication\nFig. 1 | Study overview. aWe selected a contraceptive patient cohort from the UCSF\nInformation Commons dataset. Among 20,274 patients with unique contraceptive\nprescriptions and associated clinical notes, 1515 (7.6%) patients experienced a total\nof 1964 total contraceptive switches.b Study overview to assess the ability for GPT4\nto extract contraceptive switching values from clinical notes, and to identify key\nreasons for switching using unsupervised clustering methods.\nhttps://doi.org/10.1038/s41746-025-01615-0 Article\nnpj Digital Medicine|           (2025) 8:221 2\nstart and 0.424 (SD: 0.009) on medication stopping. The cost for running all\nGPT-4 values, including prompt development and inference for the test set\nwas $78.40 based on a cost of $0.03 per1000 input tokens and $0.06 per 1000\noutput tokens.\nConcordance between silver-standard labels and human annotations\navailable showed a Cohen’s Kappa coefﬁcient of 0.585 for medication\nstarting labels and 0.217 for contraceptive stopping (n = 93). When we\nremoved notes without relevant contraceptives, determined by the human\nevaluator, concordance between these two methods increased to 0.960 for\ncontraceptives started and 0.644 for contraceptives stopped (Supplementary\nTable 5).\nIdentiﬁcation of reasons for contraceptive switching\nUnsupervised BERTopic topic modeling of extracted reasons for stopping\nacross the full dataset identiﬁed 19 topics, which were manually grouped into\n10 cohesive topics (Supplementary Table 6). Excluding the 1136 notes that\ndid not contain a relevant reason (topic 0, Supplementary Table 7), the most\nfrequently occurring topics containedterms related to spotting and irregular\nbleeding (topic 1,n = 272), desire to switch contraceptives (topic 2), and\nforgetting to take daily pills (topic 3,n =2 7 2 ) .T o p i c s4(n =6 8 ) ,6(n =2 1 ) ,\nand 7 (n = 21) described other adverse events of contraceptive use, including\nirritation and rash, weight gain and mood changes, and irregular menses and\npain. Topic 5 (n = 31) related to IUD malpositioning and removal, and\ntopic 9 (n = 12) related to implant removal. Finally, topic 8 included terms\nrelated to insurance coverage (Fig.4a).\nTopic clusters of reasons for switching were analyzed for enrichment in\npatient subsets stratiﬁed by race/ethnicity and age, both of which have been\nshown to be associated with differences in contraceptive selection\n2,5,35.\nW e i g h tg a i na n dm o o dc h a n g e( t o p i c6 )w e r ee n r i c h e di np a t i e n t sw h os e l f -\nreported as being“Latinx” or “Other”, and were less prevalent in patients\nself-reporting as“Black or African American”. Topic 9 (Implant removal)\nwas enriched in patients who self-reported a race/ethnicity of“Asian”,a n d\ntopic 8 (insurance coverage) was enriched in patients of“Black or African\nAmerican”, “Latinx”,o r “Multi-Race/Ethnicity” race/ethnicity (Fig.4b).\nWhen stratiﬁed by age, we found that patients in the“<21” age group tended\nto show enrichment in topic 8 (Insurance coverage) while patients in the\n“40 +” age group were more likely to switch based on reasons in topic 6\n(Weight gain and mood changes, Supplementary Fig. 1).\nDiscussion\nWe demonstrated that large language models can accurately extract treat-\nment switching rationales from associated clinical notes with clear impli-\ncations for better understanding of patient care. In the task of treatment\nswitches, GPT-4 performance, evaluated by both gold-standard manual\nannotation and automated analysis, was stable between six different\nprompts. We further showed that the vast majority of reasons for contra-\nceptive switching extracted by GPT-4 were correct, with minimal halluci-\nnations. Finally, we uncovered latent contraceptive-speciﬁc reasons for\nswitching medications by clustering embeddings derived from GPT-4\nextracted values.\nWhile switching contraceptives is not inherently negative, under-\nstanding the rationales behind these clinical decisions is crucial to closing\npotential gaps in care. Topic clusters ranged from treatment failure to\npatient preference, as well as adverse events and insurance reasons. We\nshowed that insurance coverage as a reason for switching disproportionately\naffected patients identifying as“Latinx” or “Black or African American”\nwhile switching due to IUD misplacement was enriched in patients iden-\ntifying as“White” or “Asian”. Additionally, we showed that weight gain and\nm o o dc h a n g e sa sr e a s o n sf o rs w i t c h i n gwere enriched in patient populations\nwho self-reported their race/ethnicity as“Latinx” or “Other”.Ap r e v i o u s\nstudy of weight gain with progestin-only contraceptive use also found that\nonly patients who reported their race as“Black” showed statistically sig-\nniﬁcant weight gain over 12 months\n36, but did not provide“Latinx” as a\ncategory for race and did not look at discontinuation rates. These and our\nﬁndings prompt the need for further investigation of weight gain with\ncontraceptive use in diverse populations to better understand the factors\ndriving contraceptive usage and switching. Other future work could\ninvestigate similar patterns in other conditions and medication treatment\nprotocols, as well as how switching may differ in patients stratiﬁed by other\nfactors, such as income or insurance status, which were not considered here\ndue to sparsity in the dataset.\nThe implications of our work on clinical research and practice are\nthreefold. First, ourﬁndings can increase clinicians’awareness of the diverse\nreasons for treatment switching, ranging from patient preferences and\nadverse events to insurance coverage issues. While the extracted rationales\nare not necessarily causal, this enhanced understanding may help healthcare\nproviders better anticipate potentialchallenges with contraceptive usage.\nSecond, by recognizing these factors in advance, clinicians may be able to\nimprove their initial treatment selection process, potentially reducing the\nfrequency of switches and enhancing patient satisfaction. Lastly, this\nknowledge can be used to set more accurate expectations for patients. By\nincorporating these insights into clinical practice, healthcare providers can\noptimize contraceptive management, leading to improved patient outcomes\nand experiences.\nWhile our study results highlight recent medical concerns regarding\nﬁnancial barriers to contraceptive access and socioeconomic inequities in\nreproductive health\n5,8,37, there are several limitations to consider. Our dataset\nis limited by sample size for contraceptive switching prediction and is\nderived from a large, academic medical center, which may introduce bias in\nthe types of patients or contraceptives captured. We also assume that clinical\nnotes contain information on all medications ordered at the same or pre-\nvious encounters, but some medications may not be discussed or docu-\nm e n t e d .T h i si sr eﬂected in poor concordance between structured data\nlabels and human evaluation, particularly for medication stopping values.\nSome contraceptives are also intendedfor longer-term use, which may affect\nTable 1 | Contraceptive prescription cohort demographics\nContraceptive\nswitch (n = 1515)\nNo switch\n(n = 15,907)\nSigniﬁcance\nProportion\nMean age (SD) 25.9 years (7.7) 29.1 years\n(8.4)\np < 0.001\nRace/Ethnicity (%) Missing (n = 32) Missing\n(n = 815)\np < 0.001\nWhite 490 (33.0%) 6813 (45.1%)\nLatinx 286 (19.3%) 2281 (15.1%)\nBlack or African\nAmerican\n286 (19.3%) 1237 (8.2%)\nAsian 237 (16.0%) 3071 (20.3%)\nOther 115 (7.8%) 1224 (8.1%)\nMulti-Race/\nEthnicity\n69 (4.7%) 466 (3.1%)\nPreferred\nLanguage (%)\nMissing (n = 5) p < 0.001\nEnglish 1474 (97.3%) 15405 (96.9%)\nSpanish 14 (0.9%) 281 (1.8%)\nOther 27 (1.8%) 216 (1.4%)\nFirst prescribed\ncontraceptive, (%)\np < 0.001\nImplant 160 (10.6) 799 (5.0) 20.0%\nInjectable 199 (13.1) 853 (5.4) 23.3%\nIntrauterine 64 (4.2) 1266 (8.0) 5.1%\nIntravaginal 244 (16.1) 1935 (12.2) 12.6%\nOral 661 (43.6) 10496 (66.0) 6.3%\nTransdermal 187 (12.3) 558 (3.5) 33.5%\nDemographic information from all patients with contraceptive medication prescriptions. Patients\nare stratiﬁed into groups with and without contraceptive modality switching. Signiﬁcance is reported\nbetween patients with and without contraceptive switching.\nhttps://doi.org/10.1038/s41746-025-01615-0 Article\nnpj Digital Medicine|           (2025) 8:221 3\ntime to switching. Additionally, because the de-identiﬁc a t i o np r o c e s si sn o t\nperfect, manual reviewof some notes identiﬁed several medication names\nthat were inappropriately redacted. This was particularly prevalent among\ncontraceptive brand names that resemble common patient names (eg.\n“Camila”\n38 or “Heather”39) that are deliberately redacted. Another limitation\nis that the medical history of each patient is not static per patient, and\nconfounding diagnoses or other relevant medical history were not con-\nsidered in this analysis. This study also grouped together contraceptives by\nmodality and analyzing switching within modalities could provide ample\ngrounds for future work. Additionally, while this study surfaces associations\nbetween speciﬁc demographic subpopulationsand contraceptive switching\nreasons, causal analyses and interventional approaches to address such\ndisparities will require further study.\nFinally, although LLMs demonstrate great promise and perfor-\nmance on many key clinical tasks\n21,40,41, another key limitation of our\nwork surrounds the nature of LLMs, which can lack transparency about\ntraining data, model development, and evaluation. There is little public\ninformation provided about GPT4’s training data, approach, or model\narchitecture. As a result, we refrain from making conclusions about why\nLLMs like the GPT-4 model produce certain results, and focus instead on\nevaluating overall performance and insights that can be derived from\nextraction of information from clinical notes. Additionally, although\nLLMs offer human-like input and output, the decision making processes\nof the models lack meaningful interpretability, which is of signiﬁcant\nimportance to clinical care. Our work’s impact on clinical practice and\npublic health should be considered through the lens of these limitations\nand concerns.\nIn conclusion, this study reveals differences in the reasons behind\ncontraceptive switching using information extracted from clinical notes\nwith a large language model. We showed that speciﬁc underserved\ndemographic groups are more likely to switch due to issues like insur-\nance coverage limitations or adverse events, going beyond information\nonly captured in structured medical record data. While our under-\nstanding of reasons for contraceptive switching will require external\nvalidation, the computational approach developed here enables a data-\ndriven understanding of what drives treatment decisions and where\ndisparities may exist. More broadly, these methods can unlock patient\nFig. 3 | GPT-4 performance compared to baseline.Following prompt evaluation,\nGPT-4 performance on the remaining test set was also compared to baseline model\nperformance for extraction of contraceptive (a) started andb stopped. Silver-\nstandard labels from structured data were used for training and evaluation of\nbaseline models, and for evaluation of zero-shot GPT-4.\nFig. 2 | Development of prompt to extract contraceptive switching information.\nGPT4-extracted values for contraceptive class (a) started andb stopped compared to\nhuman annotation (n = 93).c Human evaluation was also performed to assess\nwhether GPT-4 extracted reasons for contraceptive switching was accurate, and\ncontained only information speciﬁcally mentioned in the associated clinical note\n(not hallucination).\nhttps://doi.org/10.1038/s41746-025-01615-0 Article\nnpj Digital Medicine|           (2025) 8:221 4\nperspectives and values, moving towards more patient-centered care. As\nwe apply larger and more complex models to healthcare data, we must\nintentionally use these methods to better understand heterogeneous\npatient populations.\nMethods\nContraceptive switching cohort selection\nA contraceptive switching cohort wasselected from the UCSF Information\nCommons dataset, whichc o n t a i n sd e i d e n t iﬁed structured data and clinical\nFig. 4 | Clustering reasons for contraceptive switching using BERTopic.\na BERTopic modeling was used to cluster GPT-4 extracted reasons for contraceptive\nswitching, with nine key topics identiﬁed. Top terms for each cluster are shown.\nb Topics were assessed for enrichment amongst patient subgroups by race/ethnicity.\nHigher enrichment scores indicate higher prevalence of a topic written in notes\nwithin a patient subgroup.\nhttps://doi.org/10.1038/s41746-025-01615-0 Article\nnpj Digital Medicine|           (2025) 8:221 5\nnotes from over 6 million patients between 2012– 2023. Clinical text notes\nwere certiﬁed as deidentiﬁed as previously described25 and are usable by\nUCSF researchers as non-human subjects research, determined to be\nexempt from further review.\nWe identiﬁed all patients prescribed at least one contraceptive\ndocumented in the structured medication data based on a“therapeutic\nclass” label. Non-drug contraceptives (e.g diaphragms/cervical caps,\ncondoms, vaginal pH modulators, and spermicides), progestin and\nestrogen-containing agents not used for contraceptive purposes, and\nemergency contraceptives were r emoved (Supplementary Table 1).\nThe remaining contraceptives we re mapped to the following mod-\nalities: Oral, Implant, Intrauterine device (IUD), Injection (intra-\nmuscular or subcutaneous), Transdermal, and Intravaginal based on\nregular expression values (Supplementary Table 2). Contraceptives\nprescribed without a start date or associated clinical note and duplicate\norders at each encounter date were removed. Toﬁlter out short notes\nwithout any relevant information, only clinical notes containing >50\ntokens, created using encodings from OpenAI’s open-source tokenizer\ntiktoken\n42.\nThe dataset was furtherﬁltered to patients with encounters at least\n6 months after the prescription of theﬁrst contraceptive, ensuring those\nwithout a switch weren’t lost to follow-up. Prescriptions were sorted by\ndocumented start date, and encounters that contained a contraceptive\nswitch were retrieved. A contraceptive switch was deﬁned as a difference in\nprescribed contraceptive modalities between consecutive encounters.\nSelf-reported demographic information on race/ethnicity and pre-\nferred language were extracted from structured data, which was also used to\ncalculate age at date ofﬁrst contraceptive prescription. This study was\nconducted using retrospective, deidentiﬁed clinical data and was deter-\nmined to be exempt from IRB review. All data were stored or processed on\nHIPAA compliant hardware at UCSF or through a HIPAA compliant\nMicrosoft Azure instance (“UCSF Versa”). No data was transferred or\nstored by OpenAI; and OpenAI settings were maintained so that no prompt\ninformation would be stored, even temporarily.\nPrompt evaluation for extraction of contraceptive selection\nstrategy\nPrompting can have signiﬁcant effects on the accuracy of large language\nmodels43,44. We tested six prompts (Supplementary Table 3), varying both\nsystem information and output formats, to extract the following informa-\ntion: (1) which contraceptive was stopped, (2) which new contraceptive was\nstarted, and (3) why the contraceptive switch occurred. To avoid overﬁtting,\nthese six prompts were evaluated on a held-out subset of contraceptive\nswitching clinical notes from 5% of the patients. The model used was GPT-4,\nwith temperature set at 0, maximum response length capped at 500 tokens,\ntop_p set to 1, and all other parameters kept as default. A zero-shot approach\nwas used, with no additional information or training data provided outside\nof the encounter’s associated clinical note. Resulting values were mapped to\nthe six contraceptive modalities using regular expression values (Supple-\nmentary Table 2). All GPT-4 queries were performed using the“0613”\nversion of GPT-4 and wererun between November 13– 15, 2023.\nA clinical evaluator (EE) assessed the accuracy of GPT-4 extraction\nfor contraceptives started and stopped within each note. Micro F1 scores,\nwhich represent the harmonic mean of precision and recall scores, are\nreported. The best prompt was selected based on the highest average\nscore attained across all medications started/stopped determined by\nmanual evaluation. This prompt was also used to test the performance of\nseveral open-source language models\n26– 34. Greedy sampling, 8-bit\nquantization, and a maximum response length of 250 was used for all\nopen-source models.\nFor evaluation extracted reasons for GPT-4, the clinical reviewer was\nalso instructed to identify whether the extracted reason was accurate based\non the clinical note and whether anyhallucination occurred, which was\ndeﬁned as information produced by the language model that could not be\nderived from the clinical note.\nComparison of GPT-4 contraceptive information extraction to\nbaseline models\nThe best prompt selected from the development dataset was applied to the\nremaining 95%“test set” of the contraceptive switching cohort using the\nsame GPT-4 setup. We compared our LLM-based methods against several\ntraditional machine learning techniques, including logistic regression,\nrandom forest, and BERT-style models. Since human clinical annotations\nwere not available for this larger dataset, weak labels from structured data,\nspeciﬁcally which contraceptives were started and stopped at the associated\nclinical encounter, were used for training and evaluation in each of these\nmodels. Structured data may not reﬂect the contents of clinical notes if\npatients are prescribed contraceptives at a different facility or stop dates are\nnot documented, so we compared these silver-standard labels to human\nannotation for the 93 clinical notes in the prompt evaluation set using\nCohen’sK a p p ac o e fﬁcient to assess reliability between the two sources.\nTwo sets of logistic regression and random forest models were devel-\noped using either bag-of-words and term-frequency inverse document\nfrequency (TF-IDF)\n45 text representations. Multiclass classiﬁcation was\nperformed, with models predicting the modality of contraceptives started or\nstopped (oral, IUD, subdermal, intravaginal, injection, transdermal). We\nperformed 5-fold cross validation using a 70/10/20 split between train,\nvalidation, and test data. Due to differences in training sizes between\nbaseline models and GPT-4, this split is independent of the previous prompt\nevaluation and GPT-4 test sets. Hyperparameter tuning was performed\nusing a grid search of varying regularization values (C = [0.01, 0.1, 1, 10, 100,\n1000]) for logistic regression and both number of estimators and max depth\nfor random forest (n_estimators= [50, 100, 250, 500], max_depth = [20,\n50, 100]).\nThe UCSF-BERT model\n46 trained on a large corpus of clinical notes\nwas also used as a baseline. Again, we performed 5-fold cross validation\nusing a 70/10/20 split. Hyperparameter tuning was performed using\nOptuna\n47, and both learning rate and weight decay were varied (learning\nrate = (1e-5, 5e-5), weight decay = (4e-5, 0.01)). Models were trained for 5\nepochs, with early stopping. To accommodate for the 512 maximum token\nlength allowed by UCSF BERT, a sliding window was used withﬁnal pre-\ndiction selected by majority vote across all windows.\nTo simulate few-shot learning, we trained each of the baseline models\non random subsamples of 100%, 50%, 25%, 10%, 5%, and 1% of the training\ndata. Micro-averaged F1 scores are reported for each model on the held-out\ntest set.\nUnsupervised clustering of extracted reasons for contraceptive\nswitching\nGPT-4 was also used to extract reasons for contraceptive switching from the\ntest set using the best prompt. To identify key reasons for medication\nswitching, we applied BERTopic, a topic modeling method that clusters\ndocument embeddings, to all reasons extracted from both the prompt\nevaluation and test sets. The UCSF-BERT model was used to generate\nembeddings from the list of extracted reasons and embeddings were clus-\ntered by BERTopic\n45.B r i eﬂy, dimensionality reduction was applied to the\nembeddings using Uniform Manifold Approximation and Projection48\n(UMAP), with 5 components and 3 neighbors with euclidean distance\nmetrics. HDBSCAN\n49 was used to cluster reduced embeddings, with the\nnumber of topics dynamically chosen by the algorithm using“auto” settings\nfor nr_topics parameter, and TF-IDF used to identify key terms from each\ncluster. All other default parameters were used. Topics were manually\nreviewed and similar topics based on the top 10 most frequent terms in each\ntopic were grouped together.\nSubgroup analysis was performedto understand whether topics were\nassociated with speciﬁc patient demographics. Adapting from previous\nenrichment methods\n50, we used topic probabilities assigned to each docu-\nm e n tb yt h eB E R T o p i cm o d e lt oc a l c u l a te a weighted enrichment score that\ndescribes the relative contribution of each topic to patient subsets. Speciﬁ-\ncally, enrichment scores were calculated asθk;j ¼\nqn;k /C1 yn;jPN\nn¼1qn;k /C3\nPN\nn¼1yn;j\n,w h e r e\nhttps://doi.org/10.1038/s41746-025-01615-0 Article\nnpj Digital Medicine|           (2025) 8:221 6\nq(n,k) describes the weight of each topic k for note n, and y(n,j) are the\npatient subsets assigned to each note. The scores were normalized by total\ntopic weight, as well as by number of patients in each subset, and reported\nscores were log transformed. The same analysis was performed for patients\nstratiﬁed by age group, which were split into categories“<21”, “21– 30”,\n“31– 40”,a n d“40 +”.\nStatistics\nWe present means and standard deviations for continuous distribution, and\nutilize two-sidedt-tests to analyze differences in continuous distributions.\nTo evaluate differences in categorical data, Chi-square tests were applied.\nStatistical analyses were conducted using the SciPy package\n51,a n dap-value\n<0.05 was used to indicate statistical signiﬁcance.\nData availability\nClinical notes from this study are not publicly available, except for a subset of\nGPT4 extracted reasons for contraceptive switching from clinical notes.\nCode availability\nAll code to reproduce the methods described here are made available at\nhttps://github.com/BMiao10/contraceptive-switching.\nReceived: 9 March 2024;Accepted: 6 April 2025;\nReferences\n1. Sundaram, A. et al. Contraceptive failure in the United States:\nestimates from the 2006–2010 national survey of family growth.\nPerspect. Sex. Reprod. Health49,7 –16 (2017).\n2. Grady, W. R., Billy, J. O. & Klepinger, D. H. Contraceptive method\nswitching in the United States.Perspect. Sex. Reprod. Health34,\n135–145 (2002).\n3. Kungu, W., Agwanda, A. & Khasakhala, A. Prevalence of and factors\nassociated with contraceptive discontinuation in Kenya.Afr. J. Prim.\nHealth Care Fam. Med.14, 2992 (2022).\n4. Steinberg, J. R., Marthey, D., Xie, L. & Boudreaux, M. Contraceptive\nmethod type and satisfaction, conﬁdence in use, and switching\nintentions. Contraception 104, 176–182 (2021).\n5. Simmons, R. G. et al. Predictors of contraceptive switching and\ndiscontinuation within theﬁrst 6 months of use among highly effective\nreversible contraceptive initiative Salt lake study participants.Am. J.\nObstet. Gynecol.220, 376.e1–376.e12 (2019).\n6. Bellizzi, S., Mannava, P., Nagai, M. & Sobel, H. L. Reasons for\ndiscontinuation of contraception among women with a current\nunintended pregnancy in 36 low and middle-income countries.\nContraception 101,2 6–33 (2020).\n7. Daniels, K. & Abma, J. Current contraceptive status among women\naged 15–49: United States, 2015–2017. NCHS data brief, no 327.\nNatl. Cent. Health Stat. 388,1 –8 (2018).\n8. Robertson, C. & Braman, A. The new over-the-counter oral\ncontraceptive pill— assessing ﬁnancial barriers to access.N. Engl. J.\nMed. 389, 1352–1354 (2023).\n9. Kogut, S. J. Racial disparities in medication use: imperatives for\nmanaged care pharmacy.J. Manag. Care Spec. Pharm.26,\n1468–1474 (2020).\n10. Xie, Z., St. Clair, P., Goldman, D. P. & Joyce, G. Racial and ethnic\ndisparities in medication adherence among privately insured patients\nin the United States.PLoS ONE14, e0212117 (2019).\n11. Asiri, R., Todd, A., Robinson-Barella, A. & Husband, A. Ethnic\ndisparities in medication adherence? A systematic review examining\nthe association between ethnicity and antidiabetic medication\nadherence. PLOS ONE18, e0271650 (2023).\n12. Wilder, M. E. et al. The impact of social determinants of health on\nmedication adherence: a systematic review and meta-analysis.J.\nGen. Intern. Med.36, 1359–\n1370 (2021).\n13. Trussell, J. & Vaughan, B. Contraceptive failure, method-related\ndiscontinuation and resumption of use: results from the 1995 National\nSurvey of Family Growth.Fam. Plann. Perspect. 31,6 4–72, 93 (1999).\n14. Uzuner, Ö, Stubbs, A. & Lenert, L. Advancing the state of the art in\nautomatic extraction of adverse drug events from narratives.J. Am.\nMed. Inform. Assoc.27,1 –2 (2020).\n15. Uzuner, Ö, Solti, I., Xia, F. & Cadag, E. Community annotation\nexperiment for ground truth generation for the i2b2 medication\nchallenge. J. Am. Med. Inform. Assoc.17, 519–523 (2010).\n16. Moon, S., Pakhomov, S., Liu, N., Ryan, J. O. & Melton, G. B. A sense\ninventory for clinical abbreviations and acronyms created using\nclinical notes and medical dictionary resources.J. Am. Med. Inform.\nAssoc. 21, 299–307 (2014).\n17. Mahajan, D., Liang, J. J. & Tsou, C.-H. Toward understanding clinical\ncontext of medication change events in clinical narratives. InAMIA\nAnnu. Symp. Proc.21, 2021:833-842 (2021).\n18. Agrawal, M., Hegselmann, S., Lang, H., Kim, Y. & Sontag, D. Large\nlanguage models are zero-shot clinical information extractors.arXiv\nhttps://doi.org/10.48550/arXiv.2205.12689 (2022).\n19. Singhal, K. et al. Large language models encode clinical knowledge.\nNature 620, 172–180 (2023).\n20. Goel, A. et al. LLMs Accelerate Annotation for Medical Information\nExtraction. InProc 3rd Machine Learning for Health Symposium\n82–100 (PMLR, 2023).\n21. Lee, P., Bubeck, S. & Petro, J. Beneﬁts, limits, and risks of GPT-4 as an\nAI chatbot for medicine.N. Engl. J. Med.388, 1233–1239 (2023).\n22. Wornow, M. et al. The shaky foundations of clinical foundation\nmodels: a survey of large language models and foundation models for\nEMRs. arXiv https://doi.org/10.48550/arXiv.2303.12961 (2023).\n23. Alsentzer, E. et al. Zero-shot interpretable phenotyping of postpartum\nhemorrhage using large language models.Npj Digit. Med.6,1–10 (2023).\n24. Wang, M., Sushil, M., Miao, B. Y. & Butte, A. J. Bottom-up and top-\ndown paradigms of artiﬁcial intelligence research approaches to\nhealthcare data science using growing real-world big data.J. Am.\nMed. Inform. Assoc.30, 1323–1332 (2023).\n25. Radhakrishnan, L. et al. A certiﬁed de-identiﬁcation system for all\nclinical text documents for information extraction at scale.JAMIA\nOpen 6, ooad045 (2023).\n26. Gemma Team. et al. Gemma: open models based on gemini research\nand technology.arXiv\nhttps://doi.org/10.48550/arXiv.2403.08295(2024).\n27. Gemma Team. et al. Gemma 2: improving open language models at a\npractical size. arXivhttps://doi.org/10.48550/arXiv.2408.00118(2024).\n28. Touvron, H. et al. Llama: Open and efﬁcient foundation language\nmodels. ArXiv https://doi.org/10.48550/arXiv.2302.13971 (2023).\n29. Dubey, A. et al. The llama 3 herd of models.arXiv https://doi.org/10.\n48550/arXiv.2407.21783 (2024).\n30. Hugging Face. meta-llama/Meta-Llama-3.1-8B-Instruct. https://\nhuggingface.co/meta-llama/Meta-Llama-3.1-8B-Instruct (2024).\n31. Zhu, B. et al.Starling-7B: Improving Helpfulness and Harmlessness with\nRLAIF.https://openreview.net/forum?id=GqDntYTTbk#discussion(2024).\n32. Hugging Face.Nexusﬂow/Starling-LM-7B-beta. https://huggingface.\nco/Nexusﬂow/Starling-LM-7B-beta (2024).\n33. Labrak, Y. et al. Biomistral: a collection of open-source pretrained\nlarge language models for medical domains. 62th Annual Meeting of\nthe Association for Computational Linguistics (ACL'24) (2024).\n34. Hugging Face. johnsnowlabs/JSL-MedMNX-7B-SFT. https://\nhuggingface.co/johnsnowlabs/JSL-MedMNX-7B-SFT.\n35. Daniels, K. & Abma, J. C. Current contraceptive status among women\naged 15-49: United States, 2017-2019.NCHS Data Brief.388,1–8 (2020).\n36. Vickery, Z. et al. Weight change at 12 months in users of three\nprogestin-only contraceptive methods.Contraception 88, 503–508\n(2013).\n3 7 . C o h e n ,R . ,S h e e d e r ,J .&T e a l ,S .B .P r e d i c t o r so fd i s c o n t i n u a t i o no fl o n g -\nacting reversible contraception before 30 months of use by adolescents\nand young women.J. Adolesc. Health65,2 9 5–302 (2019).\nhttps://doi.org/10.1038/s41746-025-01615-0 Article\nnpj Digital Medicine|           (2025) 8:221 7\n38. CAMILA® (NORETHINDRONE TABLETS USP, 0.35 MG). https://\ndailymed.nlm.nih.gov/dailymed/fda/fdaDrugXsl.cfm?setid=\na786be85-49ba-4369-b510-7dccc10f7f18 (2018).\n39. HEATHER® (Norethindrone tablets, USP 0.35 mg). https://dailymed.\nnlm.nih.gov/dailymed/fda/fdaDrugXsl.cfm?setid=35b5ddb5-1729-\n4588-b2a2-ead56d78b6f9 (2021).\n40. Williams, C. Y. K. et al.JAMA Netw. Open7, e248895 (2024).\n41. Boussina, A. et al. Large language models for more efﬁcient reporting of\nhospital quality measures.NEJM AI1, 10.1056/aics2400420. (2024).\n42. OpenAI. openai/tiktoken. https://github.com/openai/tiktoken (2024).\n43. Liu, P. et al. Pre-train, prompt, and predict: a systematic survey of\nprompting methods in natural language processing.ACM Comput.\nSurv. 55,1 –195 (2023).\n44. Nori, H. et al. Can generalist foundation models outcompete special-\npurpose tuning? Case study in medicine.arXiv https://doi.org/10.\n48550/arXiv.2311.16452 (2023).\n45. Grootendorst, M. BERTopic: Neural topic modeling with a class-\nbased TF-IDF procedure.arXiv https://doi.org/10.48550/arXiv.2203.\n05794 (2022).\n46. Sushil, M., Ludwig, D., Butte, A. J. & Rudrapatna, V. A. Developing a\ngeneral-purpose clinical language inference model from a large\ncorpus of clinical notes.arXiv https://doi.org/10.48550/arXiv.2210.\n06566 (2022).\n47. Akiba, T., Sano, S., Yanase, T., Ohta, T. & Koyama, M. Optuna: A next-\ngeneration hyperparameter optimization framework. InProc. 25th\nACM SIGKDD International Conference on Knowledge Discovery &\nData Mining2623–2631 (IEEE, 2019).\n48. McInnes, L., Healy, J. & Melville, J. UMAP: Uniform manifold\napproximation and projection for dimension reduction.J Open Sour\nSoftw 3, 861 (2018).\n49. Campello, R. J. G. B., Moulavi, D. & Sander, J. Density-based\nclustering based on hierarchical density estimates. InAdvances in\nKnowledge Discovery and Data Mining(eds. Pei, J., Tseng, V. S., Cao,\nL., Motoda, H. & Xu, G.) 160–172 (Springer, Berlin, Heidelberg, 2013).\n50. Ghassemi, M. et al. Unfolding physiological state: mortality modelling\nin intensive care units.KDD Proc. Int. Conf. Knowl. Discov. Data Min.\nInt. Conf. Knowl. Discov. Data Min.2014,7 5–84 (2014).\n51. Virtanen, P. et al. SciPy 1.0: fundamental algorithms for scientiﬁc\ncomputing in Python.Nat. Methods17, 261–272 (2020).\nAcknowledgements\nResearch reported in this publication was supported by the National Center\nfor Advancing Translational Sciences, National Institutes of Health, through\nUCSF-CTSI Grant Number UL1 TR001872. The content is solely the\nresponsibility of the authors and does not necessarily represent the ofﬁcial\nviews of the National Institutes of Health. The authors acknowledge the use\nof the UCSF Information Commons computational research platform,\ndeveloped and supported by UCSF Bakar Computational Health Sciences\nInstitute in collaboration with IT Academic Research Services, Center for\nIntelligent Imaging Computational Core, and CTSI Research Technology\nProgram. We also thank Madhumita Sushil for valuable feedback on this\nproject.\nAuthor contributions\nConceptualization: B.Y.M., A.J.B., I.Y.C.; Data curation: B.Y.M., E.C.;\nSoftware/Formal analysis: B.Y.M., C.Y.K.W., E.C.; Methodology: B.Y.M.,\nC.Y.K.W., T.Z., I.Y.C.; Supervision: A.J.B., I.Y.C.; Writing– original draft\npreparation: B.Y.M., E.A., I.Y.C.; Writing– review & editing: B.Y.M.,\nC.Y.K.W., T.Z., E.A., A.J.B., I.Y.C. All authors have read and approved the\nﬁnal manuscript.\nCompeting interests\nBYM is an employee at SandboxAQ. CYKW has no conﬂicts of interest to\ndisclose. EC has no conﬂicts of interest to disclose. TZ has no conﬂicts of\ninterest to disclose. EA reports personal fees from Canopy Innovations,\nFourier Health, and Xyla; and grants from Microsoft Research. IYC is a\nminority shareholder in Apple, Amazon, Alphabet, and Microsoft. AJB is a\nco-founder and consultant to Personalis and NuMedii; consultant to Sam-\nsung, Mango Tree Corporation, and in the recent past, 10x Genomics, Helix,\nPathway Genomics, and Verinata (Illumina); has served on paid advisory\npanels or boards for Geisinger Health, Regenstrief Institute, Gerson Lehman\nGroup, AlphaSights, Covance, Novartis, Genentech, and Merck, and Roche;\nis a shareholder in Personalis and NuMedii; is a minor shareholder in Apple,\nFacebook, Alphabet (Google), Microsoft, Amazon, Snap, 10x Genomics,\nIllumina, CVS, Nuna Health, Assay Depot, Vet24seven, Regeneron, Sanoﬁ,\nRoyalty Pharma, AstraZeneca, Moderna, Biogen, Paraxel, and Sutro, and\nseveral other non-health related companies and mutual funds; and has\nreceived honoraria and travel reimbursement for invited talks from Johnson\nand Johnson, Roche, Genentech, Pﬁzer, Merck, Lilly, Takeda, Varian, Mars,\nSiemens, Optum, Abbott, Celgene, AstraZeneca, AbbVie, Westat, and many\nacademic institutions, medical or disease speciﬁc foundations and asso-\nciations, and health systems. Atul Butte receives royalty payments through\nStanford University, for several patents and other disclosures licensed to\nNuMedii and Personalis. Atul Butte’s research has been funded by NIH,\nPeraton (as the prime on an NIH contract), Genentech, Johnson and John-\nson, FDA, Robert Wood Johnson Foundation, Leon Lowenstein Foundation,\nIntervalien Foundation, Priscilla Chanand Mark Zuckerberg, the Barbara and\nGerson Bakar Foundation, and in the recent past, the March of Dimes,\nJuvenile Diabetes Research Foundation, California Governor’sO fﬁce of\nPlanning and Research, California Institute for Regenerative Medicine,\nL’Oreal, and Progenity. None of these organizations or companies had any\ninﬂuence or involvement in the development of this manuscript.\nAdditional information\nSupplementary informationThe online version contains\nsupplementary material available at\nhttps://doi.org/10.1038/s41746-025-01615-0\n.\nCorrespondenceand requests for materials should be addressed to\nBrenda Y. Miao.\nReprints and permissions informationis available at\nhttp://www.nature.com/reprints\nPublisher’s noteSpringer Nature remains neutral with regard to\njurisdictional claims in published maps and institutional afﬁliations.\nOpen AccessThis article is licensed under a Creative Commons\nAttribution 4.0 International License, which permits use, sharing,\nadaptation, distribution and reproduction in any medium or format, as long\nas you give appropriate credit to the original author(s) and the source,\nprovide a link to the Creative Commons licence, and indicate if changes\nwere made. The images or other third party material in this article are\nincluded in the article’s Creative Commons licence, unless indicated\notherwise in a credit line to the material. If material is not included in the\narticle’s Creative Commons licence and your intended use is not permitted\nby statutory regulation or exceeds the permitted use, you will need to\nobtain permission directly from the copyright holder. To view a copy of this\nlicence, visithttp://creativecommons.org/licenses/by/4.0/\n.\n© The Author(s) 2025\nhttps://doi.org/10.1038/s41746-025-01615-0 Article\nnpj Digital Medicine|           (2025) 8:221 8",
  "topic": "Commons",
  "concepts": [
    {
      "name": "Commons",
      "score": 0.5610234141349792
    },
    {
      "name": "Medicine",
      "score": 0.3615763187408447
    },
    {
      "name": "Political science",
      "score": 0.23215928673744202
    },
    {
      "name": "Law",
      "score": 0.1118563711643219
    }
  ]
}