{
    "title": "Virtual Patient Simulations Using Social Robotics Combined With Large Language Models for Clinical Reasoning Training in Medical Education: Mixed Methods Study",
    "url": "https://openalex.org/W4408098677",
    "year": 2025,
    "authors": [
        {
            "id": "https://openalex.org/A2119652366",
            "name": "Alexander Borg",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2148033639",
            "name": "Carina Georg",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A5114284965",
            "name": "Benjamin Jobs",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A3186366384",
            "name": "Viking Huss",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2746336171",
            "name": "Kristin Waldenlind",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2295149053",
            "name": "Mini Ruiz",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1897218682",
            "name": "Samuel Edelbring",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1791992558",
            "name": "Gabriel Skantze",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1988353107",
            "name": "Ioannis Parodis",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W2014266841",
        "https://openalex.org/W2954595068",
        "https://openalex.org/W2126260337",
        "https://openalex.org/W4319262193",
        "https://openalex.org/W2036488299",
        "https://openalex.org/W2788437953",
        "https://openalex.org/W2129889309",
        "https://openalex.org/W2025246226",
        "https://openalex.org/W3004804145",
        "https://openalex.org/W2746374179",
        "https://openalex.org/W3208423523",
        "https://openalex.org/W2009683697",
        "https://openalex.org/W2058737387",
        "https://openalex.org/W4280567834",
        "https://openalex.org/W2961793453",
        "https://openalex.org/W2745355696",
        "https://openalex.org/W4372348475",
        "https://openalex.org/W4392769984",
        "https://openalex.org/W4381956184",
        "https://openalex.org/W4389108554",
        "https://openalex.org/W4392744531",
        "https://openalex.org/W4403442768",
        "https://openalex.org/W4235790631",
        "https://openalex.org/W2133915381",
        "https://openalex.org/W4384912700",
        "https://openalex.org/W4321178818",
        "https://openalex.org/W2146401134",
        "https://openalex.org/W1542318638",
        "https://openalex.org/W2070389254",
        "https://openalex.org/W4389263544",
        "https://openalex.org/W2293392332",
        "https://openalex.org/W4381929535",
        "https://openalex.org/W1979290264",
        "https://openalex.org/W2058781550"
    ],
    "abstract": "Background Virtual patients (VPs) are computer-based simulations of clinical scenarios used in health professions education to address various learning outcomes, including clinical reasoning (CR). CR is a crucial skill for health care practitioners, and its inadequacy can compromise patient safety. Recent advancements in large language models (LLMs) and social robots have introduced new possibilities for enhancing VP interactivity and realism. However, their application in VP simulations has been limited, and no studies have investigated the effectiveness of combining LLMs with social robots for CR training. Objective The aim of the study is to explore the potential added value of a social robotic VP platform combined with an LLM compared to a conventional computer-based VP modality for CR training of medical students. Methods A Swedish explorative proof-of-concept study was conducted between May and July 2023, combining quantitative and qualitative methodology. In total, 15 medical students from Karolinska Institutet and an international exchange program completed a VP case in a social robotic platform and a computer-based semilinear platform. Students’ self-perceived VP experience focusing on CR training was assessed using a previously developed index, and paired 2-tailed t test was used to compare mean scores (scales from 1 to 5) between the platforms. Moreover, in-depth interviews were conducted with 8 medical students. Results The social robotic platform was perceived as more authentic (mean 4.5, SD 0.7 vs mean 3.9, SD 0.5; odds ratio [OR] 2.9, 95% CI 0.0-1.0; P=.04) and provided a beneficial overall learning effect (mean 4.4, SD 0.6 versus mean 4.1, SD 0.6; OR 3.7, 95% CI 0.1-0.5; P=.01) compared with the computer-based platform. Qualitative analysis revealed 4 themes, wherein students experienced the social robot as superior to the computer-based platform in training CR, communication, and emotional skills. Limitations related to technical and user-related aspects were identified, and suggestions for improvements included enhanced facial expressions and VP cases simulating multiple personalities. Conclusions A social robotic platform enhanced by an LLM may provide an authentic and engaging learning experience for medical students in the context of VP simulations for training CR. Beyond its limitations, several aspects of potential improvement were identified for the social robotic platform, lending promise for this technology as a means toward the attainment of learning outcomes within medical education curricula.",
    "full_text": null
}