{
  "title": "DepoScope: Accurate phage depolymerase annotation and domain delineation using large language models",
  "url": "https://openalex.org/W4401328222",
  "year": 2024,
  "authors": [
    {
      "id": "https://openalex.org/A5093126855",
      "name": "Robby Concha-Eloko",
      "affiliations": [
        "Institute for Integrative Systems Biology",
        "Universitat de València"
      ]
    },
    {
      "id": "https://openalex.org/A2099854306",
      "name": "Michiel Stock",
      "affiliations": [
        "Ghent University"
      ]
    },
    {
      "id": "https://openalex.org/A145057113",
      "name": "Bernard de Baets",
      "affiliations": [
        "Ghent University"
      ]
    },
    {
      "id": "https://openalex.org/A1667315942",
      "name": "Yves Briers",
      "affiliations": [
        "Ghent University"
      ]
    },
    {
      "id": "https://openalex.org/A2061755671",
      "name": "Rafael Sanjuán",
      "affiliations": [
        "Universitat de València",
        "Institute for Integrative Systems Biology"
      ]
    },
    {
      "id": "https://openalex.org/A2731024967",
      "name": "Pilar Domingo-Calap",
      "affiliations": [
        "Universitat de València",
        "Institute for Integrative Systems Biology"
      ]
    },
    {
      "id": "https://openalex.org/A3122816368",
      "name": "Dimitri Boeckaerts",
      "affiliations": [
        "Ghent University"
      ]
    },
    {
      "id": "https://openalex.org/A5093126855",
      "name": "Robby Concha-Eloko",
      "affiliations": [
        "Integrative Medicine Institute",
        "Institute for Integrative Systems Biology"
      ]
    },
    {
      "id": "https://openalex.org/A2099854306",
      "name": "Michiel Stock",
      "affiliations": [
        "Ghent University"
      ]
    },
    {
      "id": "https://openalex.org/A145057113",
      "name": "Bernard de Baets",
      "affiliations": [
        "Ghent University"
      ]
    },
    {
      "id": "https://openalex.org/A1667315942",
      "name": "Yves Briers",
      "affiliations": [
        "Ghent University"
      ]
    },
    {
      "id": "https://openalex.org/A2061755671",
      "name": "Rafael Sanjuán",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2731024967",
      "name": "Pilar Domingo-Calap",
      "affiliations": [
        "Institute for Integrative Systems Biology",
        "Integrative Medicine Institute"
      ]
    },
    {
      "id": "https://openalex.org/A3122816368",
      "name": "Dimitri Boeckaerts",
      "affiliations": [
        "Ghent University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W3023787861",
    "https://openalex.org/W3157992500",
    "https://openalex.org/W2070300719",
    "https://openalex.org/W3176919622",
    "https://openalex.org/W2027005563",
    "https://openalex.org/W2897531714",
    "https://openalex.org/W4282946147",
    "https://openalex.org/W3178799249",
    "https://openalex.org/W3196095379",
    "https://openalex.org/W112013909",
    "https://openalex.org/W2443992611",
    "https://openalex.org/W2999406779",
    "https://openalex.org/W3096218861",
    "https://openalex.org/W4391316987",
    "https://openalex.org/W2983772326",
    "https://openalex.org/W4377091239",
    "https://openalex.org/W4223644783",
    "https://openalex.org/W3146944767",
    "https://openalex.org/W4327550249",
    "https://openalex.org/W4388263226",
    "https://openalex.org/W3217216416",
    "https://openalex.org/W3202488381",
    "https://openalex.org/W3189053267",
    "https://openalex.org/W2265024698",
    "https://openalex.org/W4308616064",
    "https://openalex.org/W2950954328",
    "https://openalex.org/W3101667854",
    "https://openalex.org/W2972411752",
    "https://openalex.org/W2076048958",
    "https://openalex.org/W2127322768",
    "https://openalex.org/W2156125289",
    "https://openalex.org/W2165232124",
    "https://openalex.org/W4375858802",
    "https://openalex.org/W2033044694",
    "https://openalex.org/W2192991381",
    "https://openalex.org/W2165510614",
    "https://openalex.org/W3003829447",
    "https://openalex.org/W4226313562",
    "https://openalex.org/W2949676527",
    "https://openalex.org/W3177500196",
    "https://openalex.org/W4213112325",
    "https://openalex.org/W2126587104",
    "https://openalex.org/W2128007785",
    "https://openalex.org/W3191164977"
  ],
  "abstract": "Bacteriophages (phages) are viruses that infect bacteria. Many of them produce specific enzymes called depolymerases to break down external polysaccharide structures. Accurate annotation and domain identification of these depolymerases are challenging due to their inherent sequence diversity. Hence, we present DepoScope, a machine learning tool that combines a fine-tuned ESM-2 model with a convolutional neural network to identify depolymerase sequences and their enzymatic domains precisely. To accomplish this, we curated a dataset from the INPHARED phage genome database, created a polysaccharide-degrading domain database, and applied sequential filters to construct a high-quality dataset, which is subsequently used to train DepoScope. Our work is the first approach that combines sequence-level predictions with amino-acid-level predictions for accurate depolymerase detection and functional domain identification. In that way, we believe that DepoScope can greatly enhance our understanding of phage-host interactions at the level of depolymerases.",
  "full_text": "SOFTWA RE\nDepoScope: Accurate phage depolymerase\nannotation and domain delineation using\nlarge language models\nRobby Concha-Eloko\n1\n, Michiel Stock\n2\n, Bernard De Baets\nID\n2\n, Yves Briers\n3\n,\nRafael Sanjua ´ n\n1\n, Pilar Domingo-Calap\n1\n, Dimitri Boeckaerts\nID\n2,3\n*\n1 Institute for Integrat ive Systems Biology (I\n2\nSysBio), Universitat de Valencia-C SIC, Paterna, Spain,\n2 KERMIT , Department of Data Analysis and Mathematic al Modelling, Ghent Univers ity, Ghent, Belgium ,\n3 Laboratory of Applied Biotechnology , Department of Biotechn ology, Ghent Univers ity, Ghent, Belgium\n* dimi.boeck aerts@gmail .com\nAbstract\nBacteriophages (phages) are viruses that infect bacteria. Many of them produce specific\nenzymes called depolymera ses to break down external polysaccharide structures. Accurate\nannotation and domain identification of these depolymerases are challenging due to their\ninherent sequence diversity. Hence, we present DepoScope, a machine learning tool that\ncombines a fine-tuned ESM-2 model with a convolutional neural network to identify depoly-\nmerase sequences and their enzymatic domains precisely. To accomplish this, we curated\na dataset from the INPHARED phage genome database, created a polysaccharide-degr ad-\ning domain database, and applied sequential filters to construct a high-quality dataset,\nwhich is subsequently used to train DepoScope. Our work is the first approach that com-\nbines sequence-level predictions with amino-acid-leve l predictions for accurate depolymer-\nase detection and functional domain identification. In that way, we believe that DepoScope\ncan greatly enhance our understanding of phage-host interactions at the level of\ndepolymerases.\nIntroduction\nBacteriophages (phages in short) are viruses that can infect and kill bacteria. A subset of these\nphages contains polysaccharide-degradin g (PD) enzymes in their virion structure, typically\ncalled depolymerases. These play a crucial role in the initial step of the phage replication cycle,\ni.e., the recognition of specific host surface receptors [1,2]. In nature, bacteria are often found\nwithin biofilms. These comprise microbial communities that are enclosed in a matrix of poly-\nsaccharides, proteins, nucleic acids and lipids [3]. Phage depolymerases can degrade exopoly-\nsaccharides in biofilm matrices, allowing the phage to access secondary receptors [4]. In\naddition, depolymerases can disrupt the bacterial capsular polysaccharide (CPS), which is an\nimportant virulence factor in both Gram-positive and Gram-negative species [5] and can also\nprotect the bacteria from the immune system of its infecting host [6,7]. Despite their impor-\ntance, functional annotation of phage depolymerases remains challenging. This is specifically\nPLOS COMP UTATIONAL  BIOLOGY\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 1 / 15\na1111111111\na1111111111\na1111111111\na1111111111\na1111111111\nOPEN ACCESS\nCitation: Concha-E loko R, Stock M, De Baets B,\nBriers Y, Sanjua ´ n R, Domingo-C alap P, et al.\n(2024) DepoScop e: Accurate phage depolyme rase\nannotatio n and domain delineation using large\nlanguage models. PLoS Comput Biol 20(8):\ne1011831. https://d oi.org/10.1371/j ournal.\npcbi.1011831\nEditor: Yang Lu, University of Waterloo, CANADA\nReceived: January 15, 2024\nAccepted: July 20, 2024\nPublished: August 5, 2024\nPeer Review History: PLOS recognize s the\nbenefits of transpar ency in the peer review\nprocess; therefore, we enable the publication of\nall of the content of peer review and author\nresponse s alongside final, published articles. The\neditorial history of this article is available here:\nhttps://doi.o rg/10.1371/jo urnal.pcbi .1011831\nCopyright: © 2024 Concha-Elok o et al. This is an\nopen access article distributed under the terms of\nthe Creative Commons Attributio n License, which\npermits unrestricte d use, distribu tion, and\nreproduction in any medium, provided the original\nauthor and source are credited.\nData Availabilit y Statement: We provide full\naccess to our code, models and datasets on\nGitHub (https://git hub.com/dim iboeckaerts /\ndue to their high sequence diversity, which is a consequence of the ongoing coevolution\nbetween phages and their bacterial hosts [8,9]. A common approach for bacteria to evade\ninfection by phages is to limit access to the receptor by modifying, masking, or even removing\nthe receptor entirely [10,11]. This results in a high diversity of bacterial receptors, which is\nmatched by a diverse set of phage receptor-binding proteins and depolymerases [12]. For this\nreason, depolymerases are typically difficult to identify using alignment-based methods\n[13,14]. However, several computational tools and workflows have been developed to facilitate\nthe detection of phage depolymerases in phage genomes. In 2019, Latka et al. proposed a man-\nual identification process of phage proteins annotated as tail fiber, tail spike or hypothetical\nprotein using BLASTp, Phyre2, SWISS-MODEL, HMMER and HHPred [15]. The method is\nbased on homology with enzymatic domains and visual recognition of conserved structural\nfeatures. More recently, two automated, machine-learning-base d methods have been pro-\nposed. DePP is a Random Forest trained on several experimentally validated depolymerases to\ndiscriminate phage depolymerases from other proteins [16]. Similarly, PhageDPO combines a\nSupport Vector Machine and an artificial neural network to detect phage depolymerases [17].\nThe PhageDPO model was trained on a set of phage depolymerases that were collected based\non six depolymerase-associa ted protein domains. However, a limitation of both tools is the\navailability of only small or undiversified datasets to train their models (using only a limited\nnumber of depolymerase-associated protein domains or only experimentally validated\nsequences). In addition, beyond predicting a binary outcome for a protein sequence, we aim to\nprecisely identify the functional enzymatic domain in each protein, something none of the cur-\nrent tools can do.\nToday, recent advancements in protein language models and protein structure prediction\nenable us to tackle these outstanding issues in new ways. Protein language models are deep\nlearning-based models that are pre-trained on a large set of protein sequences in a self-super-\nvised way [18]. This means that such models learn to predict which amino acids are present in\nthe context of other amino acids, enabling them to learn general properties and even structural\nfeatures of protein sequences. Moreover, these pre-trained models can be fine-tuned on a spe-\ncific prediction task, which implies that what these models learned during pre-training can be\ntransferred and leveraged for other tasks. Typically, fine-tuning only requires relatively few\ndata points and allows making predictions at both the amino acid and the protein levels. Evo-\nlutionary Scale Modeling 2 (ESM-2) is a state-of-the-art protein language model developed by\nMeta AI that is freely available for reuse and for fine-tuning on specific tasks [19,20].\nHere, we leverage ESM-2 and the conserved structural features of phage depolymerases to\nannotate them functionally and characterize their enzymatic domains. We developed a new\nmachine learning tool called DepoScope consisting of a fine-tuned ESM-2 model, followed by a\nset of convolutional and dense neural network layers to both detect depolymerase protein\nsequences and precisely identify the location of their enzymatic domains. To accomplish this,\nwe collected protein sequences from the INPHARED phage genome database that were pro-\ncessed and filtered both at the sequence and the structure levels. At the sequence level, we\nscreened proteins against a custom database of hidden Markov model (HMM) profiles. These\nprofiles were collected and constructed based on Enzyme Commission (EC) numbers that are\nassociated with a PD activity, which allowed us to capture a great diversity of depolymerases at\nthe sequence level. We screened predicted protein structures against a collection of folds repre-\nsented in the Carbohydrate-Active Enzymes (CAZy) database with an associated PD activity.\nA recently developed tool can classify CAZymes broadly but is not specifically tailored towards\ndetecting phage depolymerases [21]. In the CAZy database, enzymes can be categorized into\ndifferent functional groups spanning glycoside hydrolases, glycosyltransferases, polysaccharide\nlyases, carbohydrate esterases, auxiliary activities and carbohydrate-binding modules [22]. Of\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 2 / 15\nDepoScop e) and Zenodo (https://doi. org/10.5281/\nzenodo.109 57073).\nFunding: MS and BDB received funding from the\nFlemish Government under the\n“Onderzoek sprogramma Articie ¨ le Intellig entie (AI)\nVlaanderen” program (https://w ww.\nflandersai research.be/ en). RS was financially\nsupported by grant GRISOLIAP /2020/158 from the\nConselleria d’Innovacio ´ , Universitats , Ciència i\nSocietat Digital (Generalit at Valenci ana, https://\ninnova.gva.e s/va/). PD-C was financially supported\nby a Ramo ´ n y Cajal contract RYC201 9-028015-I\nfunded by MCIN/AEI/1 0.13039/50 1100011033\n(https://w ww.aei.gob. es), ESF Invest in your future;\nESCMID Research Grant 202000 63 (https://w ww.\nescmid.org /); project PID2020- 112835RA-I0 0\nfunded by MCIN/AEI /10.13 039/50110001 1033;\nand project SEJIGENT/2021 /014 funded by\nConselleria d’Innovacio ´ , Universitats , Ciència i\nSocietat Digital (Generalit at Valenci ana). DB was\nfinancially supporte d by the Researc h Foundation –\nFlanders (FWO, https://www. fwo.be/en/), grant\nnumber 1S69520N. The funders had no role in\nstudy design, data collection and analysis, decision\nto publish, or preparation of the manuscript.\nCompeting interests : The authors have declared\nthat no competing interests exist.\nthese categories, glycoside hydrolases and polysaccharide lyases have a carbohydrate-degrad-\ning activity. The proteins that passed both screenings were used in a training set for both fine-\ntuning ESM-2 models to do token classification (i.e., to predict the location of the depolymer-\nase domain) and to construct a convolutional binary classifier on top of the fine-tuned model.\nThis novel approach of collecting data comprehensively and leveraging ESM-2 allows us to\nidentify phage proteins that act as depolymerases and locate the enzymatic domain in these\nproteins at a high accuracy.\nDesign and implementation\nPhage sequence data collection. A dataset of phage proteins from the INPHARED phage\ngenome database was collected in January 2023 [23]. This collection comprised 24,289 entries\nof complete phage genome sequences, of which each protein sequence was pre-annotated via\nthe PHROGS database, a protein resource specifically tailored for phage studies [24]. Protein\nsequences were then filtered according to their length, any sequence under 200 amino acids in\nlength was discarded from the dataset, which is the minimum length above which we expect to\nfind depolymerase domains [15,25]. A visual overview of the subsequent processing steps is\ngiven in Fig 1.\nGeneration of a polysaccharide-degr ading domains database\nTo represent the diversity of polysaccharide-degradin g enzymes, a comprehensive database of\ncarbohydrate catalytic domains was created. Domain entries from Interpro were fetched in\nFebruary 2023 [26]. These entries were filtered based on their associated EC numbers. More\nspecifically, those marked with E.C.4.4.2 and E.C.3.2.1, corresponding to carbon-oxygen lyases\nacting on polysaccharides and glycosidases, respectively, were selected. Further refinement of\nentries was carried out manually to retain only those for which the association with a carbohy-\ndrate-catalyzing activity was based on bibliographic evidence. The final set included 221 Inter-\npro entries (Tab A in S1 Table).\nThe protein sequences corresponding to each entry were downloaded using an adjusted\nversion of the template script from the Interproscan website. If the catalytic domain was found\nin an uninterrupted segment of the protein sequence we only extracted that domain. If not, the\nentire protein sequence was used. Each set of entry-specific sequences was clustered using the\nMMseqs tool [27], applying parameters “—cov-mode 1—seq-id-mode 1—min-seq-id 0.50 -c\n0.8”. A multiple sequence alignment (MSA) was generated for each cluster with FAMSA [28],\nand these alignments were filtered at 95% identity using the HHfilter command from HH-\nsuite3 software [29]. Subsequently, HMM profiles were built based on these filtered MSAs.\nLastly, the MSAs and HMM profiles served to construct an HHblits database, completing the\nformation of the PD domains database.\nScreening the proteins against the HHM profile database and subsequent\nfiltering\nMSAs for each sequence were generated from the initial set of proteins in the INPHARED\ndatabase using MMseqs in conjunction with the UniRef90 database [30]. The clustered\nsequences were subsequently realigned using Clustal Omega [31], and these final MSAs were\nscreened against the PD domains database using the HHblits command from the HH-suite3\nsoftware. Proteins with a bit score higher than 20 with at least 30 aligned positions on their\nsequence were considered a positive hit. This approach enabled the detection of remote\nhomologies within our MSAs, a valuable asset given the often-high sequence divergence but\nstructural conservation of depolymerase domains.\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 3 / 15\nSequential processing steps were implemented to reduce the protein count while preserving\nas much diversity as possible. First, the protein sequences were clustered using CD-HIT [32] at\nan identity threshold of 95% and an alignment coverage of 80%. The representative of each\ncluster (i.e., the longest sequence) was kept, narrowing the dataset from 11,513 to 6,816 pro-\nteins. Secondly, sequence embeddings were computed with ESM-2 [20] and clustered using\naffinity propagation [33], employing parameters “damping = 0.90, preference = None”, yield-\ning 389 clusters. Finally, we defined a list of annotations consistent with depolymerase activity\n(Tab B in S1 Table). For each annotation, we included up to five proteins per cluster in the\nfinal dataset. This process resulted in a collection of 1,926 proteins.\nScreening the protein 3D structures against the polysaccharide-degrading\nfold database\nThe 3D structures of the collection of 1,926 proteins were predicted using ESMFold [20]. A\ndatabase of domain folds associated with a PD activity (PD fold database) was generated based\nFig 1. Overvi ew of the data collecti on and preprocessin g steps at the sequence and the structure level. (a) Data collection involve d collect ing raw sequences\nfrom INPHARE D and InterPro carbohydr ate catalytic domains . Protein sequences were processed into multiple sequence alignments (MSAs), while the sequences\nrelated to the InterPro domains were used to construct profile Hidden Markov Models (HMMs ). Then, HHBlits was used to scan the constructe d HMMs against\nthe MSAs, followe d by additional clustering and affinity propagati on to increase the quality of the collected protein sequence data. (b) The remaining proteins were\nfurther filtered at the structur e level using ESMFold, FoldSeek and the CAZy database to get to a final training dataset that included sequences with the folds n-\nbladed β-propeller , right-han ded β-helix and triple helix. Icons attribut ions: Font Awesome Free 5.2.0 by @fontawesom e (CC by 4.0); Database by Delapouite (CC\nby 3.0). No change s were made to the icons.\nhttps://doi.o rg/10.1371/j ournal.pcb i.1011831.g 001\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 4 / 15\non the folds found in the glycoside hydrolase and the polysaccharides lyases families defined\nby CAZy (Tab C in S1 Table). The folds that were screened against included α/α toroid, right-\nhanded β-helix, TIM β/α-barrel, n-bladed β-propeller (with n > 3), Flavodoxin-like, and the\nα/β hydrolase folds (Fig 2).\nThe predicted structures of the 1,926 proteins were screened against this PD fold database\nusing FoldSeek [34]. For each iteration, a hit was considered significant if the associated proba-\nbility exceeded 0.5. For the right-handed β-helix, hits with a probability that the match is a true\npositive match greater than 0.2 were considered positive due to the greater divergence of the\nright-handed β-helix. Finally, a manual screening for proteins with a triple helix domain was\ndone. Triple-helix domains frequently require the assistance of intramolecular chaperones for\nFig 2. Identifie d polysacchari des-degradi ng folds in the set of proteins from the INPHARED database. Four different types of PD folds were identified with (a)\nthe right-han ded β-helix, (b) the n-bladed β-propeller, (c) TIM β/α-barrel and (d) the α/α toroid. The PD fold is colored in red, while the remaining part of the\nprotein was left in gold.\nhttps://doi.o rg/10.1371/j ournal.pcbi. 1011831.g002\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 5 / 15\ntheir accurate and stable folding [35,36]. This reliance highlights the intrinsic instability char-\nacteristic of these domains, often manifesting as structural disorder [37,38]. This instability\nengages in a multifaceted interplay with additional variables, such as the pre-chaperone activ-\nity disorder in the 3D conformation and the predictive capabilities of sequence-based models\nto accurately determine the protein’s 3D structure. These complexities introduce challenges to\nsearching for reliable structural similarities between those folds.\nDelineation of depolymerase domains\nThe 3D structure predictions of the proteins that demonstrated a significant hit with the PD\nfold database were used to identify corresponding (so-called) protein units: stable segments\nwithin a protein that fall between secondary structures and domains in terms of their complex-\nity. These were determined with SWORD2, which analyzes the spatial relationships between\nα-carbon atoms and optimizes for structural autonomy within these segments [39]. Every pro-\ntein unit identified was subsequently screened against the PD fold database to locate the best\nmatch. The delineation of the PD folds was inferred from the best match. These processes\nresulted in a final dataset of 602 right-handed β-helix, 96 n-bladed β-propeller and 146 triple-\nhelix depolymerase proteins for which the catalytic domain was precisely determined. As an\nexploratory step, feature representations of the delineated PD folds were computed with ESM-\n2 and plotted using t-SNE (S1 Fig).\nModel construction and evaluation\nDepoScope is built as a stacked model architecture with two parts (Fig 3). The first part is a\nfine-tuned ESM-2 model for a token classification and the second part is a pair of two convolu-\ntional layers and two forward neural layers for a binary classification task. Both modules have\nbeen trained sequentially, first considering the token classification task followed by the binary\nclassification.\nFor training and evaluation, a set of protein sequences that do not match any of the\ndescribed PD domains above were added to the dataset as ‘negative’ sequence instances for the\nmodel. We specifically chose to collect other proteins that are involved in catalytic activity and\nstructural proteins without catalytic activity, as those proteins would be potentially hard for\nthe model to correctly classify as negatives (Tab D in S1 Table). The full training dataset was\nsplit into three parts: 70% for the token classification task, 20% for the binary classification\ntask and 10% for the evaluation of both tasks.\nIn this study, the pretrained ESM-2 models (esm2_t6_8M_UR50D, esm2_t12_35-\nM_UR50D, esm2_t30_150M_UR50D configurations) were used to construct fine-tuned mod-\nels for a token classification task. Each amino acid of a given sequence was classified into a\nclass corresponding to the different PD domain folds that the model is being trained on. The\nmodel was fine-tuned using the Python libraries Transformers and Pytorch and optimized the\nmodel hyperparameters via Bayesian search with the Optuna package [40].\nIn addition, a second deep learning model on top of the ESM-2 fine-tuned token classifica-\ntion model was trained for a binary classification task (prediction score threshold of 0.5). Two\nconvolutional layers identify relevant patterns in the list of labels assigned to each amino acid.\nThese patterns are then processed by two forward neural network layers that output a predic-\ntion score reflecting how likely the protein sequence is a depolymerase. The final outputs of\nDepoScope are the list of labels for each amino acid and the probability associated with the\ninput sequence being a depolymerase. In order to validate the ability of the model to general-\nize, the Group Shuffle Split method was used to split the data. Specifically, the sequences were\nclustered with CD-HIT before training using a range of clustering values (0.25, 0.30, 0.35, 0.40,\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 6 / 15\n0.45, 0.65, 0.70, 0.75, 0.80, 0.85). No significant impact on the performances was observed,\nindicating an ability to generalize on unseen data (Tab E in S1 Table).\nBenchmarking against available tools\nThe DepoScope machine learning model was benchmarked for binary classification against\ntwo available tools for depolymerase detection: DePP and PhageDPO [16,17]. The source code\nof both tools was downloaded from their respective repositories on GitHub or Galaxy, and we\nran both tools locally in an iPython notebook. As an evaluation dataset, the depolymerase data-\nset included in Pires et al. (2016) was chosen, which was also used by the authors of DePP for\nbenchmarking [25]. More specifically, the protein sequences (> 200 amino acids) of all 142\nphage genomes in the Pires dataset were collected. To mitigate biases, sequences present in the\ntraining dataset of either of the tools were not considered. We asked each tool (including\nDepoScope) to make predictions for each of the protein sequences across all phage genomes.\nBased on these predictions, together with the true labels of each sequence (as given by Pires\net al. [25]), the recall (TP / [TP + FN]), precision (TP / [TP + FP]), F1 score ([precision + recall]\n/ [2 * precision * recall]), specificity (TN / [TN + FP]) and Matthews Correlation Coefficient\n(MCC; [TN*TP-FN*FP] / sqrt[(TP+FP)*(TP+FN)*(TN+FP )*(TN+FN)]) were computed to\ncompare the three tools across a range of performance metrics.\nResults\nDataset construction and processing\nWe initially collected 554,981 proteins from the INPHARED database (consisting of complete\nphage genomes) that were longer than 200 amino acids. These proteins were further processed\nFig 3. DepoScop e model architecture. DepoScope consists of a combinatio n of two deep learning models that perform token classificati on\nand binary classificati on, respective ly. The token classificati on model is a fine-tuned ESM-2 model that receives protein sequenc es as input,\nwhich are transforme d into tokens (one for each amino acid). For each token, the model learns to classify it as being part of a PD domain or\nnot in the finetuning process, with four distinct labels: “none”, “right-hande d β-helix”, “n-bladed β-propeller ” and “triple helix”. The outputs\nof this first model additionally serve as inputs to the second model, which is a combinatio n of two convolu tional layers and a dense layer that\nproduce a binary output, which reflects the prediction for the entire sequence of whether or not the protein is a depolymeras e.\nhttps://d oi.org/10.1371/j ournal.pc bi.1011831. g003\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 7 / 15\nin multiple steps. A total of 11,513 proteins presented a significant hit against a custom PD\ndomain database (comprising sequences across 221 InterPro entries). Their 3D structure pre-\ndictions were scanned against the PD fold database. A set of 984 proteins presented a signifi-\ncant hit with a fold from the PD fold database (Fig 1a). Most of the detected folds were right-\nhanded β-helices (844 times, 85.8%) and n-bladed β-propellers (119 times, 12.1%). Addition-\nally, 11 hits (1.1%) and 10 hits (1.0%) were identified as α/α toroid and TIM β/α-barrel folds,\nrespectively (Fig 2). We were then able to pinpoint the exact location of the PD domain in 602\nof the proteins harboring a right-handed β-helix and 96 out of those carrying an n-bladed β-\npropeller.\nWe annotated 146 triple helix domains manually and added these to the training set (Tab F\nin S1 Table). In summary, the training of our models included the right-handed β-helix, the n-\nbladed β-propeller and the triple helix folds. The TIM β/α-barrel and α/α toroid folds were\neventually not included in the training process of the model due to the low number of identi-\nfied instances. For every filtered protein sequence, each amino acid was labeled according to\nwhether it was part of a depolymerase domain and with the type of fold, resulting in four\nlabels: “none”, “right-handed β-helix”, “n-bladed β-propeller” and “triple helix”.\nFinally, negative sequences were added to the training dataset. In total, 1,409 proteins were\ncollected that matched the annotations of interest and these were added to the training dataset\nas negative instances. As the number of sequences in the positive and negative classes do not\ndiffer substantially, we have not considered artificially balancing the training dataset.\nTraining the model\nThe three different ESM-2 model configurations for finetuning were compared based on their\nperformances on the evaluation dataset and their computational requirements. As expected,\nthe ESM-2 30L had the highest MCC score of 0.903, followed by ESM-2 12L and ESM-2 6L\nwith MCC scores of 0.898 and 0.884, respectively (Table 1). The fine-tuned ESM-2 models\nmost often confused one of the PD domain tokens with the negative label token (not with\nother PD domain tokens) while maintaining the level of confusion relatively low (Fig 4). For\nthe binary classification task, DepoScope reaches an MCC score of 0.987, 0.975 and 0.958 for\nthe ESM-2 30L, ESM-2 12L and ESM-2 6L configurations, respectively (Table 1). The ESM-2\n12L mode configuration was kept as the final model because of the balance between the mem-\nory requirement and the model efficiency.\nBenchmark\nTo further evaluate DepoScope, we benchmarked it against two recently developed depolymer-\nase detection tools, DePP and PhageDPO, on the phage depolymerase dataset published by\nPires et al. (2016, Tab G in S1 Table) [25]. We computed six performance metrics (at a\nTable 1. Performance s of the fine-tuned models ESM-2 6L, ESM-2 12L and ESM-2 30L for the token classific ation task on the evaluatio n dataset (best results anno-\ntated in bold).\nTask Model size precision recall accuracy f1 MCC Running time (sec / 100 k amino acids scanned) Memory consumpti on (KB)\nToken classific ation ESM-2 6L 95.4% 95.4% 95.4% 95.4% 0.884 - -\nESM-2 12L 96.0% 96.0% 96.0% 96.0% 0.898 - -\nESM-2 30L 96.1% 96.1% 96.1% 96.1% 0.903 - -\nBinary classification ESM-2 6L 99.5% 95.6% 98.0% 97.5% 0.958 32.4 331.34\nESM-2 12L 100% 97.1% 98.8% 98.5% 0.975 89.7 600.11\nESM-2 30L 100% 98.5% 99.4% 99.3% 0.987 229.5 1769.26\nhttps://do i.org/10.1371/j ournal.pc bi.1011831. t001\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 8 / 15\nprediction threshold of 0.5 when relevant): precision (P), recall (R), accuracy, F1 score, MCC\nand the PR area-under-the-curve (Table 2). DepoScope outperforms both other tools on all\nmetrics except for recall. Moreover, reaching an MCC of 0.455, DepoScope was more than\ntwice as performant compared to the other tools, reaching MCC scores of 0.131 and 0.178 for\nDePP and PhageDPO, respectively.\nThis difference is largely explained by DepoScope’s ability to minimize false positive (FP)\npredictions, having a total of 123 FPs versus 2103 and 966 for DePP and PhageDPO, respec-\ntively. The recall was highest for DePP with 91.6%, while DepoScope and PhageDPO reached a\nrecall of 69% and 74.7%, respectively. Conversely, DePP and PhageDPO achieve precisions of\n3.5% and 6%, respectively, while DepoScope maintains a precision of 32%. Overall, DepoScope\nachieves a PR AUC of 42.3%, compared to 10.2% and 27.8% for DePP and PhageDPO, respec-\ntively. Most of the false negative predictions for DepoScope corresponded to the triple helix\nfold (18 out of 26), followed by α/β hydrolase (4 out of 26), the TIM β/α-barrel (2 out of 26)\nand the n-bladed β-propeller (2 out of 26). The performance of DepoScope was further\nassessed by analyzing the FP predictions. For each of the 123 FPs, the 3D structure was pre-\ndicted using ESMFold and then scanned against the PD fold database. Out of the 123 FPs, 78\nhad a significant hit against the PD fold database, with 41 right-handed β-helix and 37 n-\nbladed β-propeller. Manual investigations of the 45 remaining FPs revealed 32 proteins har-\nboring a PD fold. These findings suggest that Pires et al. [25] have missed some depolymerases\nFig 4. Confusion matrices of the token classific ation task for the T6, T12 and T30 configuration s of the fine-tuned ESM-2 model. Four labels were predicted\nby the models with “none”, “right-hande d β-helix”, “bladed β-propeller ” and “triple helix”.\nhttps://doi.o rg/10.1371/j ournal.pcbi. 1011831.g004\nTable 2. Benchmark results for the three tested models.\nModels precision recall specificity accuracy F1 MCC PR AUC\nDePP 3.5% 91.6% 60.9% 61.4% 6.7% 0.131 10.2%\nPhageDPO 6.0% 74.7% 82.0% 81.9% 11.2% 0.178 27.8%\nDepoSco pe 32.0% 69.0% 98.0% 97.2% 43.4% 0.455 42.3%\nDepoSco pe FP adjusted 81.4% 69.0% 99.8% 99.3% 74.5% 0.744 51.6%\nhttps://do i.org/10.1371/j ournal.pc bi.1011831. t002\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 9 / 15\nin the phage genomes (Tab H in S1 Table and S1 Data). For the remaining 13 FPs, no indica-\ntions were found that point to depolymerase activity. Those 13 FPs were annotated as hypo-\nthetical or structural proteins such as tail protein, tail fiber protein, tail sheath and baseplate\nproteins. When only considering the remaining 13 proteins as FPs, the MCC of DepoScope\nincreases to 0.744 (referred to as Deposcope FP adjusted).\nAvailability and future directions\nWe developed DepoScope, a language-model-based tool that can both detect depolymerase\nprotein sequences and accurately identify the amino acids involved in their enzymatic\ndomains. We firmly believe that open research is valuable for the field to keep moving forward\nswiftly. For this reason, we provide full access to our code, models and datasets on GitHub\n(https://github.com/dimiboeck aerts/DepoScope) and Zenodo (https://doi.org/10.5281/\nzenodo.10957073).\nOur work goes beyond the current state-of-the-art in depolymerase annotation by\napproaching data collection and processing in a novel and comprehensive way, followed by\nleveraging the protein language model ESM-2 [20]. Today, various protein language models\n(including ESM-2) are open-source and can be easily fine-tuned and adapted for down-\nstream predictive tasks. Moreover, protein language models are an area of active develop-\nment, which can result in future improvements of DepoScope as well. Specifically, our tool\ncan be refined at three different stages: the pretraining data collection, the pretraining model\narchitecture and the fine-tuning data. This is different from classical machine learning mod-\nels, which do not leverage a pretrained model and can only be improved in terms of feature\nengineering (equivalent to improving the model architecture of deep learning models) or\ntraining data. In addition, the transformer-based architecture of such models naturally\nallows for predictions at the level of individual tokens (here, amino acids). Such an approach\nhas been used previously for predicting protein secondary structure [19,41], and here we use\nit for amino acid level annotation. We believe that predictions at this level can give a refined\nlook at what exactly is being predicted by the model, especially when predictions are further\ninvestigated using 3D structure predictions. Consequently, such detailed predictions can\nimprove and simplify depolymerase engineering workflows, which typically require multiple\nmanual analysis steps [2]. On the contrary, making amino acid level predictions brings forth\nthe additional challenge of establishing reliable labels at the level of individual amino acids,\nwhich is not straightforward given the limited number of experimentally verified depolymer-\nase protein structures. Here, we overcame this challenge by implementing an elaborate data\nprocessing pipeline that included (1) the SWORD2 algorithm for delineating protein units,\n(2) a set of specific PD folds from the CAZy database and (3) the FoldSeek tool to screen\nmatching protein domains of interest. However, we believe that this processing pipeline can\nbe further improved (e.g., by making more explicit use of experimentally determined struc-\ntures and manually delineating their domains).\nFrom a broader perspective, it is apparent that the typical way in which researchers func-\ntionally annotate proteins is changing nowadays. Traditional methods, such as using align-\nment to detect homology or using profile HMMs as quantitative representations of functional\ndomains, are being complemented or replaced entirely with deep-learning-based models for\nannotation. A notable example is the work by Bileshi et al. [42], in which they use an ensemble\nof convolutional neural networks to annotate protein domains, which, combined with existing\nmethods, led to a significant expansion of the Pfam database. We believe that sophisticated\ndeep learning methods are indeed proving to be excellent complementary tools for protein\nfunctional annotation and will continue to be in the future. However, this does not diminish\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 10 / 15\nthe importance of experimental verification of protein function and manual curation of pro-\ntein sequence data and annotations.\nCompared to other tools for depolymerase annotation, DepoScope is more performant\nacross every computed metric except for recall. The reasons for this result are the limited num-\nber of data points (DePP) or the limited diversity in the underlying folds to collect data with\n(PhageDPO). Both DePP and PhageDPO result in many false positive predictions on the\nbenchmark dataset by Pires et al. [25]. The authors of DePP mitigate this by using a ranking\napproach. We argue that this is not a particularly useful output format because it prevents\nmaking a single annotation prediction for each protein separately and hence necessitates com-\nparing prediction scores across multiple proteins. In addition, our method also results in some\nfalse positive predictions, according to Pires. However, looking at the 3D structures of these\nproteins revealed that many of them match against PD domain folds in our training set, which\ncould indicate that some depolymerases were missed by Pires et al. in analyzing their phage\ngenomes [25].\nDepoScope has been trained to predict the presence of a selection of folds, including the β-\nhelix and the n-bladed β-propeller. Those conformations were the most prevalent in the folds\ndetected by our method, with the β-helix being by far the most abundant one. The potential\nbiochemical advantages of the β-helix could explain this unequal distribution. Firstly, the sta-\nbility of this conformation has been widely described [43]. This could permit the phage to\nactively infect hosts in different ecosystems. Secondly, the nature of the β-helix allows for a\nvast diversity in its length and sequence [44]. These features could benefit the phage in the face\nof the evolutionary arms race with the bacteria. The capsule is subject to rapid changes or\nswaps that put evolutionary pressures on the phage to adapt [8].\nSeveral uncommon folds have been observed in the collected phage proteins with a PD\nfold. To our knowledge, some of these folds have never been studied in the realm of viruses,\nspecifically in phages. Further investigation on the depolymerase activity in phages carrying\nthose folds could provide valuable insights into the activity and ecology of phages. Some of\nthose folds might hold interesting properties. Previous studies reported a substrate specific-\nity depending on the pH, which implies important ecological and technological implica-\ntions [45].\nOur tool succeeded at being highly performant in predicting the β-helix and the n-bladed\nβ-propeller in the phage genomes presented by Pires et al. [25], but not as much in predicting\nthe triple helix, which consisted most of the false negatives. We see two reasons that could\nexplain these errors. Firstly, the level of disorder in the triple helix domain (before trimeriza-\ntion), which only decreases after the activity of the chaperone [35,36]. This high level of disor-\nder can potentially make the pattern more complex and hampers proper prediction based only\non the sequence. Theoretically, this could be bypassed by adding more divergent sequences in\nthe training data and/or using a bigger pre-trained ESM-2 model, which can understand more\ncomplex relationships between amino acids, resulting in a higher sensitivity for more complex\npatterns. Secondly, the depolymerase activity in those proteins can be harder to assess. Indeed,\nin most cases, the depolymerase activity has been deduced from the presence of the chaperone\ndomain, which could potentially lead to false positives.\nIn conclusion, our study fundamentally rethinks the traditional understanding of depoly-\nmerases by offering a more accurate identification, including delineating the enzymatic\ndomain. We suggest that depolymerases should be defined as phage proteins with an enzy-\nmatic PD domain with a specific fold known for their ability to degrade polysaccharides.\nThese insights have broader implications, promising to enhance functional annotations in\nphages and potentially in other organisms facing complex annotation challenges.\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 11 / 15\nSupporting information\nS1 Fig. t-SNE representation of the PD domain fold. ESM-2 embedding representations\nwere computed for each PD domain fold of the training dataset.\n(DOCX)\nS1 Table. (Tab A) List of selected Interproscan entries associated with either E.C.4.4.2 or E.\nC.3.2.1 and a catalytic activity. (Tab B) Annotation of the proteins used for to filter in the\nsequences clustered with affinity propagation. (Tab C) Entries PD fold database. (Tab D)\nAnnotation of the proteins used for the negative set of the training data. (Tab E) Metrics of\nDeposcope on the evaluation dataset across different clustering values. (Tab F) Manually\nadded Triple Helices. (Tab G) Detailed benchmarking results of PhageDPO, DePP and Depo-\nScope on the Pires 2016 dataset. (Tab H) Manual analysis of the FPs and FNs in the bench-\nmark.\n(XLSX)\nS1 Data. Predicted structures of the FPs and FNs in the benchmark.\n(ZIP)\nAuthor Contributions\nConceptualization: Robby Concha-Eloko, Dimitri Boeckaerts.\nData curation: Robby Concha-Eloko.\nFormal analysis: Robby Concha-Eloko, Dimitri Boeckaerts.\nFunding acquisition: Bernard De Baets, Yves Briers, Rafael Sanjua ´ n, Pilar Domingo-Calap.\nMethodology: Robby Concha-Eloko, Dimitri Boeckaerts.\nProject administration: Dimitri Boeckaerts.\nSoftware: Robby Concha-Eloko.\nSupervision: Michiel Stock, Bernard De Baets, Yves Briers, Rafael Sanjua ´ n, Pilar Domingo-\nCalap, Dimitri Boeckaerts.\nValidation: Robby Concha-Eloko, Dimitri Boeckaerts.\nVisualization: Robby Concha-Eloko, Dimitri Boeckaerts.\nWriting – original draft: Robby Concha-Eloko, Dimitri Boeckaerts.\nWriting – review & editing: Robby Concha-Eloko, Michiel Stock, Bernard De Baets, Yves Bri-\ners, Rafael Sanjua ´ n, Pilar Domingo-Calap, Dimitri Boeckaerts.\nReferences\n1. Squeglia F, Barbara M, Agnieszka Ł, Alessia R, Briers Y, Drulis-K awa Z et al. Functiona l Studie s of a\nKlebsiella Phage Capsule Depolym erase Tailspike: Mechanist ic Insights into Capsular Degrada tion.\nStructure. 2020; 28(6): 613–624.e4. https://doi. org/10.1016/j .str.2020.0 4.015 PMID: 32386574\n2. Latka A, Lemire S, Grimon D, Dams D, Maciejews ka B, Lu T, et al. Engineeri ng the Modular Recept or-\nBinding Proteins of Klebsie lla Phages Switches Their Capsu le Serotyp e Specificity. mBio. 2021; 12(3):\ne00455–21. https:/ /doi.org/10.11 28/mBio.0 0455-21 PMID: 339477 54\n3. Flemming HC, Wingen der J. The Biofilm Matrix. Nature Reviews Microbiol ogy. 2010; 8(9): 623–33.\nhttps://doi.or g/10.103 8/nrmicro2 415 PMID: 20676145\n4. Gong Q, Wang X, Huang H, Sun Y, Qian X, Xue F, et al. Novel Host Recognition Mechanis m of the K1\nCapsule-S pecific Phage of Escherich ia Coli: Capsular Polysacc haride as the First Receptor and\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 12 / 15\nLipopolys accharide as the Second ary Receptor. Journal of Virology. 2021; 95 (18): e00920–21. https://\ndoi.org/10.11 28/JVI.0092 0-21 PMID: 34191582\n5. McDoug ald D, Rice SA, Barraud N, Steinberg PD, Kjelleberg S. Should We Stay or Should We Go:\nMechanism s and Ecologi cal Consequenc es for Biofilm Dispersal. Nature Reviews Microbiol ogy. 2012;\n10(1): 39–50. https://doi. org/10.1038/n rmicro26 95 PMID: 22120588\n6. Majkowska- Skrobek G, Latka A, Berisio R, Squeglia F, Maciejew ska B, Briers Y et al. Phage-Borne\nDepolym erases Decrease Klebsie lla Pneumoniae Resistan ce to Innate Defense Mechanism s. Fron-\ntiers in Microbiol ogy. 2018; 9:2517. https://doi.or g/10.338 9/fmicb.2018 .02517 PMID: 30405575\n7. Oliveira H, Drulis-Kaw a Z and Azeredo J. Exploiting Phage-D erived Carbohydr ate Depolymeras es for\nCombating Infectious Diseases. Trends in Microbiol ogy. 2022; 30(8): 707–9. https://doi.or g/10.1016/ j.\ntim.2022.05 .002 PMID: 35691880\n8. Haudique t M, Buffet A, Renduele s O and Rocha EPC. Interplay between the Cell Envelope and Mobile\nGenetic Elemen ts Shapes Gene Flow in Populat ions of the Nosoco mial Pathogen Klebsie lla Pneumo-\nniae. PLOS Biology. 2021; 19(7): e30012 76. https://doi.or g/10.137 1/journal.pb io.3001276 PMID:\n34228700\n9. Dunstan RA, Bamert RS, Belousoff MJ, Short FL, Barlow CK, Pickard DJ, et al. Mechanistic Insights\ninto the Capsule-Ta rgeting Depolymerase from a Klebsiella Pneumo niae Bacteriophag e. Microbiol ogy\nSpectrum . 2021; 9(1): e01023–21. https://doi.or g/10.1128/ Spectrum.0 1023-21 PMID: 34431721\n10. Hyman P, Abedon ST. Bacteriophag e Host Range and Bacteri al Resistanc e. Advances in Applied\nMicrobiol ogy. 2010; 70:217– 48. https://doi.or g/10.101 6/S0065-21 64(10)700 07-1 PMID: 20359459\n11. Dı ´ az-Muñoz SL, Koskella B. Bacteria—P hage Interactio ns in Natural Environm ents. Advances in\nApplied Microbiol ogy. 2014; 89:135– 83. https://doi.or g/10.101 6/B978-0- 12-800259- 9.00004-4 PMID:\n25131402\n12. Knecht LE, Veljkovic M, Fieseler L. Diversity and Function of Phage Encoded Depolym erases. Frontiers\nin Microbiol ogy. 2020; 10:2949 . https://doi.or g/10.338 9/fmicb.2019 .02949 PMID: 31998258\n13. Cantu VA, Salamon P, Seguritan V, Redfield J, Salamon D, Edwards RA, et al. PhANN s, a fast and\naccurate tool and web server to classify phage structural proteins. PLOS Computationa l Biology . 2020;\n6(11): e1007845. https:// doi.org/10.13 71/journal.p cbi.10078 45 PMID: 331371 02\n14. Flamholz ZN, Biller SJ, Kelly L. Large language models improve annotati on of prokaryotic viral proteins.\nNat Microbiol. 2024; 9, 537–549. https://do i.org/10.1038 /s41564- 023-01584- 8 PMID: 38287147\n15. Latka A, Leiman PG, Drulis-Ka wa Z, Briers Y. Modelin g the Architectu re of Depolyme rase-Containing\nReceptor Binding Proteins in Klebsie lla Phage s. Frontiers in Microbiol ogy. 2019; 10:2649. https://d oi.\norg/10.3389/ fmicb.2019.0 2649 PMID: 318031 68\n16. Magill DJ, Skvortsov TA. DePolym erase Predictor (DePP): A Machine Learning Tool for the Targete d\nIdentificati on of Phage Depolym erases. BMC Bioinf ormatics. 2023; 24(1): 208. https://doi. org/10.1186/\ns12859-023 -05341-w PMID: 3720861 2\n17. Vieira M, Duarte J, Doming ues R, Oliveira H, Dias O. PhageDP O: Phage Depolymerase Finder . BioR-\nxiv [Preprint]. 2023. Available from: https://doi.or g/10.110 1/2023.02.24 .529883\n18. Detlefsen NS, Hauberg S, Boomsma W. Learning Meaning ful Representa tions of Protein Sequences .\nNature Communic ations. 2022; 13(1): 1914. https://doi.or g/10.103 8/s41467-022- 29443-w PMID:\n35395843\n19. Rives A, Meier J, Sercu T, Goyal S, Lin Z, Liu J, et al. Biological Structure and Function Emerge from\nScaling Unsuperv ised Learning to 250 Million Protein Sequen ces. Procee dings of the National Acad-\nemy of Sciences. 2021; 118(15): e20162 39118. https://doi.or g/10.107 3/pnas.20 16239118 PMID:\n33876751\n20. Lin Z, Akin H, Rao R, Hie B, Zhu A, Lu W, et al. Evolutio nary-Scale Prediction of Atomic-Lev el Protein\nStructure with a Language Model. Science. 2023; 379, 1123–1 130. https://doi.or g/10.112 6/science.\nade2574 PMID: 36927031\n21. Thurimella K, Mohamed AMT, Graham DB, Owens RM, La Rosa SL, Plichta DR, et al. Protein Language\nModels Uncover Carbohydr ate-Active Enzyme Function in Metagen omics. BioRxiv [Preprint]. 2023.\n22. Drula E, Garon M-L, Dogan S, Lombar d V, Henrissat B, Terrapon N. The Carbohydr ate-Acti ve Enzyme\nDatabase: Functions and Literature. Nucleic Acids Research. 2022; 50(D1): D571–77. https://doi.or g/\n10.1093/ nar/gkab1045 PMID: 34850161\n23. Cook R, Brown N, Redgwell T, Rihtma n R, Barnes M, Clokie M, et al. INfrastruct ure for a PHAge REfer-\nence Databas e: Identificati on of Large-Scal e Biases in the Current Collection of Cultured Phage\nGenomes . PHAGE. 2021; 2(4): 214–23 . https://doi.or g/10.1089 /phage.2021.00 07 PMID: 36159887\n24. Terzian P, Ndela EO, Galiez C, Lossouar n J, Pe ´ rez Bucio RE, Mom R, et al. PHROG: Families of Pro-\nkaryotic Virus Proteins Cluste red Using Remo te Homology. NAR Genom ics and Bioinformatics . 2021;\n3(3): lqab067. https://doi.o rg/10.1093/na rgab/lqab06 7 PMID: 34377978\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 13 / 15\n25. Pires DP, Oliveira H, Melo LDR, Sillankorva S, Azeredo J. Bacteri ophage-En coded Depolym erases:\nTheir Diversity and Biotechnologi cal Applications. Applied Microbiol ogy and Biotechnology . 2016; 100\n(5): 2141–51. https://doi. org/10.1007/s 00253-015- 7247-0 PMID: 26767986\n26. Paysan-L afosse T, Blum M, Chugura nsky S, Grego T, Pinto BL, Salazar GA, et al. InterPro in 2022.\nNucleic Acids Research. 2023; 51(D1): D418–27. https://doi.or g/10.109 3/nar/gkac9 93 PMID:\n36350672\n27. Steinegger M, So ¨ ding J. MMseq s2 Enables Sensitive Protein Sequenc e Searching for the Analysis of\nMassive Data Sets. Nature Biotechnology . 2017; 35(11): 1026–28. https://d oi.org/10.103 8/nbt.398 8\nPMID: 290353 72\n28. Deorowicz S, Debudaj-Gr abysz A, Gudys A. FAMSA: Fast and Accurate Multiple Sequence Alignme nt\nof Huge Protein Families. Scientific Reports. 2016; 6(1): 33964. https://do i.org/10.1038 /srep339 64\nPMID: 276707 77\n29. Steinegger M, Meier M, Mirdita M, Vo ¨ hringer H, Haunsberg er SJ and So ¨ ding J. HH-Suite3 for Fast\nRemote Homolog y Detection and Deep Protein Annotation. BMC Bioinform atics. 2019; 20(1): 473.\nhttps://doi.or g/10.118 6/s12859 -019-3019-7 PMID: 31521110\n30. Suzek BE, Huang H, McGarvey P, Mazum der R, Wu CH. UniRef: Comprehen sive and Non-Redund ant\nUniProt Referenc e Clusters. Bioinformat ics. 2007; 23(10): 1282–88. https://doi.or g/10.109 3/\nbioinforma tics/btm098 PMID: 17379688\n31. Sievers F, Wilm A, Dineen D, Gibson TJ, Karplus K, Li W, et al. Fast, Scalable Generatio n of High-qu al-\nity Protein Multiple Sequence Alignme nts Using Clustal Omega . Molecular Systems Biology . 2011; 7\n(1): 539. https://doi.or g/10.103 8/msb.2011.7 5 PMID: 21988835\n32. Li W, Godzik A. Cd-Hit: A Fast Program for Clustering and Comparing Large Sets of Protein or Nucleo-\ntide Sequenc es. Bioinform atics. 2006; 22(13): 1658–59. https://doi.or g/10.109 3/bioinform atics/btl158\nPMID: 167316 99\n33. Frey BJ, Dueck D. Clustering by Passing Messages Between Data Points. Science. 2007; 315(5814) :\n972–76. https:// doi.org/10.11 26/science .1136800 PMID: 1721849 1\n34. Van Kempen M, Kim SS, Tumes cheit C, Mirdita M, Lee J, Gilchris t CLM, et al. Fast and Accurate Pro-\ntein Structure Search with Foldseek. Nature Biotechn ology. 2023; 42, 243–246. https://doi. org/10.\n1038/s41 587-023-0 1773-0 PMID: 37156916\n35. Schulz EC, Schwarzer D, Frank M, Stummey er K, Mu ¨ hlenhoff M, Dickmann s A, et al. Structur al Basis\nfor the Recognition and Cleavag e of Polysialic Acid by the Bacteri ophage K1F Tailspike Protein\nEndoNF. Journal of Molecular Biology. 2010; 397(1): 341–51. https://doi.or g/10.101 6/j.jmb.201 0.01.\n028 PMID: 200967 05\n36. Garcia-Dov al C, Casto ´ n J, Luque D, Granell M, Otero J, Llamas-Saiz A, et al. Structure of the Recep tor-\nBinding Carboxy-Ter minal Domain of the Bacteriophag e T5 L-Shaped Tail Fibre with and without Its\nIntra-Mo lecular Chaperone. Viruses. 2015; 7(12): 6424–4 0. https://doi.or g/10.3390/ v7122946 PMID:\n26670244\n37. Smith NL, Taylor EJ, Lindsay A-M, Charnock SJ, Turkenbu rg JP, Dodson EJ, et al. Structure of a Group\nA Streptococ cal Phage-En coded Virulence Factor Reveals a Catalytically Active Triple-Str anded β-\nHelix. Proceedings of the National Academy of Sciences. 2005; 102(49): 17652–57. https://doi.or g/10.\n1073/pnas .0504782102 PMID: 16314578\n38. Jena R, Garg DK, Achary MMV, Singh J, Tomar R, Choudhury L, Bansal R, et al. Applicat ion of a Pro-\ntein Domain as Chaperone for Enhanc ing Biological Activity and Stability of Other Proteins. Journal of\nBiotechn ology. 2020; 310: 68–79. https://doi.or g/10.101 6/j.jbiotec. 2020.01.017 PMID: 32014561\n39. Cretin G, Galoch kina T, Vande r Meersche Y, G de Brevern A, Postic G, Gelly J-C. SWORD2: Hierarchi -\ncal Analysis of Protein 3D Structures . Nucleic Acids Research. 2022; 50 (W1): W732–38. https://do i.\norg/10.1093/ nar/gkac3 70 PMID: 35580056\n40. Akiba T, Sano S, Yanese T, Ohta T, Koyama M. Optuna: A Next-Gen eration Hyperpar ameter Optimiza-\ntion Framework . Proceedings of the 25th ACM SIGKDD International Conferen ce on Knowled ge Dis-\ncovery & Data Mining. 2019; 2623–31.\n41. Elnaggar A, Heinzinger M, Dallago C, Rehawi G, Wang Y, Jones L, et al. ProtTra ns: Toward Under-\nstanding the Language of Life Throug h Self-Supe rvised Learning. IEEE Transaction s on Pattern Analy-\nsis and Machine Intelligence. 2020; 44(10): 7112–7127. https://doi. org/10.1109/TP AMI.2021 .309538 1\nPMID: 342328 69\n42. Bileschi ML, Belanger D, Bryant DH, Sanders on T, Carter B, Sculley D, et al. Using Deep Learning to\nAnnotate the Protein Universe. Nature Biotechn ology. 2022: 40 (6): 932–37. https://doi.or g/10.103 8/\ns41587-021 -01179-w PMID: 3519068 9\n43. Buth S, Menin L, Shneider M, Engel J, Boudko S, Leiman P. Structure and Biophysica l Properties of a\nTriple-Str anded Beta-Helix Comprising the Central Spike of Bacteri ophage T4. Viruses. 2015; 7(8):\n4676–4706. https:/ /doi.org/10.33 90/v7082 839 PMID: 262952 53\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 14 / 15\n44. Shneider MM, Buth SA, Ho BT, Basler M, Mekalanos JJ, Leiman PG. PAAR-Re peat Proteins Sharpen\nand Diversify the Type VI Secretion System Spike. Nature. 2013; 500(7462) : 350–53. https://doi.or g/\n10.1038/ nature12453 PMID: 23925114\n45. Pandey S, Mahanta P, Berger BW, Acharya R. Structural Insights into the Mechanis m of pH-Sele ctive\nSubstrat e Specificity of the Polysacch aride Lyase Smlt1473 . Journal of Biologic al Chemistry. 2021:\n297, (4):101014 . https:// doi.org/10.10 16/j.jbc.20 21.10101 4 PMID: 34358563\nPLOS COMP UTATIONAL  BIOLOGY\nDepoScope : Annotating phage depolymer ases based on deep learning\nPLOS Computationa l Biology | https:/ /doi.org/10.13 71/journal.p cbi.1011831 August 5, 2024 15 / 15",
  "topic": "Annotation",
  "concepts": [
    {
      "name": "Annotation",
      "score": 0.7084757685661316
    },
    {
      "name": "Computational biology",
      "score": 0.6813972592353821
    },
    {
      "name": "Convolutional neural network",
      "score": 0.6109044551849365
    },
    {
      "name": "Identification (biology)",
      "score": 0.603364109992981
    },
    {
      "name": "Domain (mathematical analysis)",
      "score": 0.5740998387336731
    },
    {
      "name": "Computer science",
      "score": 0.5433031916618347
    },
    {
      "name": "Genome",
      "score": 0.5145518183708191
    },
    {
      "name": "Bacteriophage",
      "score": 0.48782065510749817
    },
    {
      "name": "Artificial intelligence",
      "score": 0.4577570855617523
    },
    {
      "name": "Sequence (biology)",
      "score": 0.45677393674850464
    },
    {
      "name": "Phage display",
      "score": 0.45652735233306885
    },
    {
      "name": "Construct (python library)",
      "score": 0.4297764301300049
    },
    {
      "name": "Biology",
      "score": 0.3382641077041626
    },
    {
      "name": "Genetics",
      "score": 0.17964407801628113
    },
    {
      "name": "Gene",
      "score": 0.11333364248275757
    },
    {
      "name": "Botany",
      "score": 0.0
    },
    {
      "name": "Mathematics",
      "score": 0.0
    },
    {
      "name": "Antibody",
      "score": 0.0
    },
    {
      "name": "Escherichia coli",
      "score": 0.0
    },
    {
      "name": "Programming language",
      "score": 0.0
    },
    {
      "name": "Mathematical analysis",
      "score": 0.0
    }
  ]
}