{
    "title": "Computational toolkit for predicting thickness of 2D materials using machine learning and autogenerated dataset by large language model",
    "url": "https://openalex.org/W4408612999",
    "year": 2025,
    "authors": [
        {
            "id": "https://openalex.org/A2519688814",
            "name": "Chinedu E. Ekuma",
            "affiliations": [
                "Lehigh University"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W2163980958",
        "https://openalex.org/W4221044316",
        "https://openalex.org/W3025337708",
        "https://openalex.org/W4393199846",
        "https://openalex.org/W2010831213",
        "https://openalex.org/W2017871657",
        "https://openalex.org/W2962878147",
        "https://openalex.org/W2058122340",
        "https://openalex.org/W1978526397",
        "https://openalex.org/W3171459113",
        "https://openalex.org/W2759817426",
        "https://openalex.org/W2027563442",
        "https://openalex.org/W2944062981",
        "https://openalex.org/W4362721252",
        "https://openalex.org/W4375954642",
        "https://openalex.org/W4398156900",
        "https://openalex.org/W2120145199",
        "https://openalex.org/W2806275814",
        "https://openalex.org/W2952587573",
        "https://openalex.org/W2601081289",
        "https://openalex.org/W4393412023",
        "https://openalex.org/W2954996726",
        "https://openalex.org/W2275457611",
        "https://openalex.org/W2161538601",
        "https://openalex.org/W2051232586",
        "https://openalex.org/W3204406658",
        "https://openalex.org/W3100824689",
        "https://openalex.org/W3101694415",
        "https://openalex.org/W3103641517"
    ],
    "abstract": "The thickness of 2D materials not only plays a crucial role in determining the performance of nanoelectronic and optoelectronic devices but also introduces complexities in predicting volume-dependent properties, such as energy storage capacity, due to the intrinsic vacuum within these materials. Although a plethora of experimental techniques, including but not limited to optical contrast, Raman spectroscopy, nonlinear optical spectroscopy, near-field optical imaging, and hyperspectral imaging, facilitate the measurement of 2D material thickness, comprehensive data for many materials remain elusive. Over the past decade, the exponential proliferation of 2D materials and their heterostructures has outstripped the capabilities of conventional experimental and computational approaches. In this evolving landscape, machine learning (ML) has emerged as an indispensable tool, offering a scalable approach to augment these traditional methodologies. Addressing the critical gap, we introduce THICK2D—Thickness Hierarchy Inference and Calculation Kit for 2D Materials. This Python-based computational framework harnesses an autogenerated thickness database, developed using large language models, and advanced ML algorithms to facilitate the rapid and scalable estimation of material thickness, relying solely on crystallographic data. To demonstrate the utility and robustness of THICK2D, we successfully used the toolkit to predict the thickness of more than 8000 2D-based materials, sourced from two extensive 2D materials databases. THICK2D is disseminated as an open-source utility, accessible on GitHub at https://github.com/gmp007/THICK2D, and archived on Zenodo at https://10.5281/zenodo.11216648.",
    "full_text": null
}