{
    "title": "Enhancing stock price prediction using GANs and transformer-based attention mechanisms",
    "url": "https://openalex.org/W4403104467",
    "year": 2024,
    "authors": [
        {
            "id": "https://openalex.org/A5020272907",
            "name": "S. Li",
            "affiliations": [
                null
            ]
        },
        {
            "id": "https://openalex.org/A5101243461",
            "name": "Sijie Xu",
            "affiliations": [
                null
            ]
        }
    ],
    "references": [
        "https://openalex.org/W3172545452",
        "https://openalex.org/W2914316438",
        "https://openalex.org/W4224307738",
        "https://openalex.org/W4298110867",
        "https://openalex.org/W3211381684",
        "https://openalex.org/W3019860881",
        "https://openalex.org/W2912614123",
        "https://openalex.org/W4293125186",
        "https://openalex.org/W2905054207",
        "https://openalex.org/W3043424630",
        "https://openalex.org/W2735791872",
        "https://openalex.org/W4312222605",
        "https://openalex.org/W3006395403",
        "https://openalex.org/W3110982492",
        "https://openalex.org/W2987221721",
        "https://openalex.org/W3188511781",
        "https://openalex.org/W3193962426"
    ],
    "abstract": "Abstract Stock price prediction plays an important role in financial decision-making, enabling investors and analysts to make informed choices regarding trading and investment strategies. Traditional statistical methods have been utilized for the prediction of stock price, but it is often difficult for them to capture complex patterns, adapt to changing market conditions, handle large datasets, and automatically extract relevant features. Recent advancements in machine learning and deep learning offer promising solutions to address these challenges. In this paper, we propose a new approach to enhance the stock price prediction by leveraging generative adversarial networks (GANs) and transformer-based attention mechanisms. GANs are utilized to generate synthetic stock price data, and incorporating market sentiment and volatility. Attention mechanisms will selectively concentrate on the important features and patterns in the data, which may do good to the identification of key market indicators which will impact stock prices. By integrating market social media news which can tell about the sentiment and volatility, our model aims to improve the accuracy and robustness of stock price forecasts. We also address the limitations of GANs and attention mechanisms separately used in stock price prediction, such as unrealistic data generation and overfitting, by employing regularization techniques and incorporating additional data sources. Experimental evaluations using real-world stock market data will be conducted to compare the performance of our proposed models with conventional approaches. The findings of this research have implications for investors, financial analysts, and other stakeholders who are engaged in the stock market ecosystem, providing valuable insights for the investment strategies.",
    "full_text": null
}