{
  "title": "Developing Entrepreneurial Capabilities with Large Language Models: A Mixed-Methods Analysis of Microenterprise Training in Barranquilla's Business Ecosystem",
  "url": "https://openalex.org/W4406078800",
  "year": 2025,
  "authors": [
    {
      "id": "https://openalex.org/A5107019729",
      "name": "Jose Marcelo Torres Ortega",
      "affiliations": [
        "University of Sucre"
      ]
    },
    {
      "id": "https://openalex.org/A5114925130",
      "name": "Jenny Xiomara Márquez Carrascal",
      "affiliations": [
        "University of Sucre"
      ]
    },
    {
      "id": "https://openalex.org/A5107019730",
      "name": "Ana Laura Blanco Troncoso",
      "affiliations": [
        "University of Sucre"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4220869458",
    "https://openalex.org/W6776398475",
    "https://openalex.org/W2051842037",
    "https://openalex.org/W4401823449",
    "https://openalex.org/W4391577413",
    "https://openalex.org/W3010719853",
    "https://openalex.org/W3206892386",
    "https://openalex.org/W6720903916",
    "https://openalex.org/W4400464243",
    "https://openalex.org/W6607176823",
    "https://openalex.org/W6677130702",
    "https://openalex.org/W6678064627",
    "https://openalex.org/W2135943618",
    "https://openalex.org/W3017131514",
    "https://openalex.org/W2116006659",
    "https://openalex.org/W2477180189",
    "https://openalex.org/W2120820700"
  ],
  "abstract": "This research examines the impact of Large Language Models (LLMs) on entrepreneurial development among microentrepreneurs in Barranquilla, Colombia. Through a mixed-methods investigation, the study evaluates two LLM interventions, Claude Sonnet and Chat GPT 3.5, in comparison to conventional entrepreneurship education approaches. A cohort of 105 microentrepreneurs engaged in a structured training program, with outcomes assessed across multiple entrepreneurial competency domains. Quantitative analysis utilizing Hierarchical Linear Modeling and Bayesian Analysis revealed significant enhancements in business model development, market analysis capabilities, and strategic decision-making among LLM intervention participants. Mediation analysis identified increased motivation and self-efficacy as key mechanisms driving these improvements. Qualitative insights from semi-structured interviews highlighted participants' improved ability to identify market opportunities and develop innovative solutions to business challenges. The research contributes to our understanding of AI-enhanced entrepreneurship education, particularly in emerging market contexts. These findings offer valuable guidance for policymakers and educators seeking to leverage digital technologies to support microenterprise development in resource-constrained environments. Received: 4 January 2024 / Accepted: 22 November 2024 / Published: 05 January 2025",
  "full_text": "E-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 16 \n. \n \nResearch Article\n© 2025 Torres Ortega et al.\nThis is an open access article licensed under the Creative Commons\nAttribution-NonCommercial 4.0 International License \n(https://creativecommons.org/licenses/by-nc/4.0/)\n \nReceived: 4 January 2024 / Accepted: 22 November 2024 / Published: 05 January 2025 \n \n \nDeveloping Entrepreneurial Capabilities with Large Language Models: A Mixed-\nMethods Analysis of Microenterprise Training in Barranquilla's Business Ecosystem \n \nJose Marcelo Torres Ortega \n \nJenny Xiomara Márquez Carrascal \n \nAna Laura Blanco Troncoso \n \nUniversidad de Sucre,  \nPuerta Roja,  \nSincelejo,  \nSucre,  \nColombia \n \nDOI: https://doi.org/10.36941/jesr-2025-0002 \n \nAbstract \n \nThis research examines the impact of Large Language Models (LLMs) on entrepreneurial development \namong microentrepreneurs in Barranquilla, Colombia . Through a mixed-methods investigation, the study \nevaluates two LLM interventions, Claude Sonnet and Chat GPT 3.5, in comparison to conventional \nentrepreneurship education approaches. A cohort of 105 microentrepreneurs engaged in a structured training \nprogram, with outcomes assessed across multiple entrepreneurial competency domains. Quantitative \nanalysis utilizing Hierarchical Linear Modeling and Ba yesian Analysis revealed significant enhancements in \nbusiness model development, market analysis capabilities, and strategic decision-making among LLM \nintervention participants. Mediation analysis identified increased motivation and self-efficacy as key \nmechanisms driving these improvements. Qualitative insights from semi-structured interviews highlighted \nparticipants' improved ability to identify market oppo rtunities and develop innovative solutions to business \nchallenges. The research contributes to our understanding of AI-enhanced entrepreneurship education, \nparticularly in emerging market contexts. These findings offer valuable guidance for policymakers and \neducators seeking to leverage digital technologies to support microenterprise development in resource-\nconstrained environments. \n \nKeywords: Artificial Intelligence in Educatio n, Entrepreneurial Skill Developmen t, Digital Learning Platforms, \nMicro-enterprise Growth, Technology-Enhanced Business Training \n \n \n1. Introduction \n \nThe convergence of artificial in telligence and entrepreneurship education creates opportunities for \nbusiness growth. Large Language Models (LLMs)  provide paths for learning experiences in \nentrepreneurship development. This research invest igates the use of LLMs, Claude Sonnet and Chat \nGPT 3.5, to strengthen business capabilities among microentrepreneurs in Barranquilla, Colombia. \nResearch demonstrates the role of entrepreneur ship in economics and employment (Audretsch & \n\nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 17 \nKeilbach, 2004). Current methods in entrepreneurship education face limits in reach, adaptation, and \naccess, with constraints in regions with resource  restrictions. The introduction of AI tools for \neducation presents solutions to these limits, offering  methods to deliver entrepreneurship training to \npopulations without access to standard education channels. \nLLMs mark progress in language processing tech nology, with functions that include context \ncomprehension, text generation, and problem-solvin g. These functions align with entrepreneurship \nneeds, which require skills in creation, analysis, and decision-making (Shane & Venkataraman, 2000). \nThe use of LLMs in entrepreneurship education thus offers possibilities for instruction that responds \nto each learner's context. \nStudies show the potential of AI in education (Zawacki-Richter et al., 2019) and \nentrepreneurship training. However, research on LLMs' impact on business capabilities, with focus \non microentrepreneurs, remains limited. This study addresses this gap through examination of LLM-\nbased methods versus standard teaching approaches. \nThe research framework builds on connectivism theory (Siemens, 2005), which positions \nlearning as a process through information netw orks, with technology as a connector between \nknowledge sources. LLMs, with knowledge bases and response capabilities, function as nodes in a \nlearner's network, supporting learning processes that match connectivist principles. \nThis work centers on microentrepreneurs, a popu lation that drives gr owth in economies but \nlacks access to business education. The research uses methods that combine numbers and \nobservations, measuring both LLM impacts and pa rticipant experiences. This approach enables \nunderstanding of outcomes and experiences in this education model. \n \n2. Literature Review \n \nThe integration of artificial intelligence (AI) and machine learning technologies in education has \ngained attention, particularly in the field of en trepreneurship education. Large Language Models \n(LLMs) represent a development in this domain, o ffering potential for personalized and adaptive \nlearning experiences. The application of LLMs in en trepreneurship education aligns with the theory \nof constructivism, which posits that learners ac tively construct knowledge through experience and \nreflection (Piaget, 1976; Vygotsky, 1978). \nThe application of Large Language Models (LLMs) in entrepreneurship education aligns closely \nwith the theory of Connectivism, proposed by George Siemens (2005) and Stephen Downes (2007). \nConnectivism posits that learning in the digital ag e occurs through networks of information, with \ntechnology playing a crucial role in facilitating connections between various sources of knowledge. \nThis theory is particularly relevant to the use of LLMs in entrepreneurship education, as these models \ncan serve as dynamic nodes in a learner's knowle dge network, providing instant access to vast \namounts of information and facilitating complex problem-solving processes. \nConnectivism emphasizes the importance of recognizing patterns and making connections \nbetween different fields, ideas, and concepts (Sieme ns, 2005; Lugo et al., 2024; de la Puente Pacheco \net al., 2024a; de la Puente Pacheco et al., 2024b). LLMs, with their ability to process and synthesize \ninformation from diverse sources, can help aspiring entrepreneurs identify novel opportunities and \ndevelop innovative solutions to business challeng es. This aligns with the core principles of \nentrepreneurship education, which often focus on fostering creativity and opportunity recognition \nskills (Shane & Venkataraman, 2000; (de la Puente Pacheco et al., 2021; Alberto de la Puente Pacheco \net al., 2023). \nThe adaptive nature of LLMs in providing person alized responses and feedback resonates with \nthe connectivist principle of learning as a self-d irected process. As Kop and Hill (2008) argue, \nconnectivism places significant emphasis on the autonomy of the learner in navigating and curating \ntheir own learning experiences. In the context of this study, the use of Claude Sonnet and Chat GPT \n3.5 allows microentrepreneurs to engage with the learning material at their own pace and in ways \nthat are most relevant to their specific business co ntexts, potentially leading to more meaningful and \nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 18 \napplicable learning outcomes. \nFurthermore, the integration of LLMs in entr epreneurship education can be seen as an \nembodiment of what Brown (2006) refers to as entrepreneurial learning, which emphasizes the \nimportance of experiential, action-oriented learning  processes. By providing real-time, interactive \nresponses to complex business scenarios, LLMs ca n simulate the dynamic and unpredictable nature \nof entrepreneurial environments, allowing learners to develop adaptive thin king skills crucial for \nsuccess in the business world (Cope, 2005).  \nA seminal study by Graesser et al. (2018) explored  the use of conversational agents in education, \nproviding a comprehensive review of intelligent tutoring systems and their impact on learning \noutcomes. Their research demonstrated that AI -powered conversational agents could enhance \nstudent engagement and knowledge retention across various subjects. While not specifically focused \non entrepreneurship education, their findings laid the groundwork for understanding how LLMs \nmight be effectively integrated into educational contexts (de la Puente Pacheco et at., 2022). \nSecundo et al. (2020) conducted a systematic  literature review on the use of AI in \nentrepreneurship education. Their study identified key areas where AI could enhance entrepreneurial \nlearning, including personalized feedback, adapti ve content delivery, and simulation of complex \nbusiness scenarios. They highlighted the potentia l of AI to bridge the gap between theoretical \nknowledge and practical application in entrepreneurship training. \nBuilding on this, Chen et al. (2021) develo ped and tested an AI-powered platform for \nentrepreneurship education in a university se tting. Their experimental study involved 150 \nundergraduate students and found that the AI-enh anced learning environment led to significant \nimprovements in students' opportunity recognition skills and business model development abilities \ncompared to traditional teaching methods. Th e study provided empirical evidence for the \neffectiveness of AI in fostering key entrepreneurial competencies. \nHowever, it is important to note potential limitations and ethical considerations in the use of AI \nin education. A critical analysis by Zawacki-Rich ter et al. (2019) highlighted concerns about data \nprivacy, algorithmic bias, and the potential for AI to reinforce existing ineq ualities in educational \naccess and outcomes. Their work underscores the need for careful implementation and ongoing \nevaluation of AI technologies in educational settings. \nIn microentrepreneurship, which is particularly relevant to the current study, the authors also \nexplored the use of mobile-based AI applications  to support microentrepreneurs in developing \ncountries. Their field study in rural India demons trated that AI-powered tools could significantly \nenhance microentrepreneurs' financial literacy and business management skills, even in resource-\nconstrained environments. \nWhile these studies provide valuable insights into the potential of AI and LLMs in \nentrepreneurship education, there remains a gap in the literature regarding the specific application of \nadvanced LLMs like Claude Sonnet and Chat GPT 3.5 in comprehensive entrepreneurship training \nprograms. The current study aims to address this ga p by providing empirical evidence on the impact \nof these cutting-edge LLM-based interventions on entrepreneur ial learning outcomes among \nmicroentrepreneurs. \n \n3. Research Method \n \nThe study employed a mixed-methods approach, combining quantitative and qualitative data \ncollection and analysis techniques, and was conducte d over a period of six months, from January to \nJune 2024. The research team collaborated with a local data analytics firm subscribed to the \nBarranquilla Chamber of Commerce to recruit participants. This firm utilized its database and \nnetwork to identify potential participants who met the study criteria: owners or managers of \nmicroenterprises based in Barranquilla, with a minimum of two years of entrepreneurship experience, \nand willing to commit to the training sessions. \nThe study sample comprised 93 microentrepreneurs from Barranquilla, Colombia, representing \nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 19 \na diverse cross-section of the local business community . The participants ranged in age from 23 to 62 \nyears old, with a mean age of 38.5 years (SD = 9.7) . The gender distribution was relatively balanced, \nwith 48 females (51.6%) and 45 ma les (48.4%). This gender parity was particularly noteworthy given \nthe traditional gender disparities often observed in entrepreneurship studies in the region. \nIn terms of educational background, the sample  reflected a varied spectrum: 22 participants \n(23.7%) had completed high school, 35 (37.6%) held technical or vocational qualifications, 28 (30.1%) \nhad bachelor's degrees, and 8 (8.6%) possessed po stgraduate qualifications. The diversity in \neducational attainment provided an opportunit y to examine how LLM-based interventions might \nimpact entrepreneurs with different academic backgrounds. The participants' entrepreneurial \nexperience ranged from 2 to 15 years, with a medi an of 5 years, allowing for insights into how the \neffectiveness of the interventions might vary with business tenure. \nThe microenterprises represented in the study spanned various sectors of the local economy. \nThe largest segment was in the service sector, accounting for 42 participants (45.2%), followed by \nretail with 31 participants (33.3%), and manufacturing with 20 participants (21.5%). The annual \nrevenue of these businesses ranged from 20 million to 150 million Colombian pesos, with a median of \n65 million pesos. In terms of business size, 58 participants (62.4%) operated businesses with 1-5 \nemployees, 27 (29%) had 6-10 employees, and 8 (8 .6%) managed enterprises with 11-15 employees. \nThis diversity in business sectors, revenue, an d size enabled the researchers to explore the \napplicability of LLM-based entrepreneurship traini ng across different business contexts within the \nmicroenterprise ecosystem of Barranquilla. \nTable 1 presents a summary of the demographic and basic information for the 93 companies in \nthe study, categorized by sector. The data includ es average age of owners , gender distribution, \neducation level distribution, and average years in business for each sector. \n \nTable 1: Company Demographics and Basic Information. \n \nSector Average Age of \nOwner \nGender \nDistribution Education Level Distribution Average Years in \nBusiness \nService 39.2 52% F, 48% M 24% HS, 38% Tech, 30% \nBach, 8% Post 6.3 \nRetail 41.5 49% F, 51% M 26% HS, 40% Tech, 28% \nBach, 6% Post 7.1 \nManufacturing 36.8 45% F, 55% M 20% HS, 35% Tech, 35% Bach, \n10% Post 5.8 \nNote: HS = High School, Tech = Technical, Bach = Bachelor's, Post = Postgraduate. \n \nThe service sector, which comprised the largest port ion of the sample, showed an average owner age \nof 39.2 years. This sector had a slightly higher representation of female owners at 52%, compared to \n48% male owners. The education level distribution in the service sector was diverse, with 24% having \ncompleted high school, 38% holding technical qualifications, 30% with bachelor's degrees, and 8% \nwith postgraduate qualifications. On average, service sector busine sses had been operating for 6.3 \nyears. \nThe retail sector exhibited a slightly older average owner age of 41.5 years. The gender \ndistribution in this sector was nearly balanced, with 49% female and 51% male owners. Educational \nattainment in the retail sector was similar to the se rvice sector, with a slightly higher proportion of \ntechnical qualifications (40%) and a lower proportion of postgraduate degrees (6%). Retail businesses \nin the study had been operating for an average of 7.1 years, the highest among the three sectors. \nThe manufacturing sector showed the youngest average owner age at 36.8 years. This sector had \nthe highest proportion of male owners at 55%, co mpared to 45% female owners. The education level \ndistribution in manufacturing was notable for having  the highest proportion of both bachelor's (35%) \nand postgraduate (10%) degrees. Despite having the youngest average owner age, manufacturing \nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 20 \nbusinesses had been operating for an  average of 5.8 years, suggesting that many owners started their \nventures at a relatively young age. \nTable 2 shows the financial and employment data for the companies in the study, categorized \nby sector. It presents the average annual revenu e, average number of employees, and average pre-\nintervention revenue growth for each sector. \n \nTable 2: Company Financial and Employment Data. \n \nSector Average Annual Revenue \n(million COP) \nAverage Number of \nEmployees \nAverage Pre-intervention Revenue \nGrowth (%) \nService 72.5 4.8 10.2 \nRetail 68.3 3.9 8.7 \nManufacturing 85.7 6.2 11.5 \n \nThe manufacturing sector showed the highest aver age annual revenue at 85.7 million Colombian \npesos (COP). This sector also had the largest av erage number of employees at 6.2 and the highest \naverage pre-intervention revenue growth rate of 11.5%. These figures suggest that the manufacturing \ncompanies in the study were generally larger and experiencing more rapid growth compared to the \nother sectors. \nThe service sector showed moderate performanc e across all metrics. With an average annual \nrevenue of 72.5 million COP, it ranked second am ong the three sectors. Service companies employed \nan average of 4.8 people and had a pre-intervention revenue growth rate of 10.2%, both figures falling \nbetween those of manufacturing and retail sectors. \nRetail businesses in the study reported the lowe st average annual revenue at 68.3 million COP \nand the smallest average number of employees at 3.9. They also had the lowest pre-intervention \nrevenue growth rate at 8.7%. These figures suggest that the retail companies in the sample were \ngenerally smaller and growing more slowly than thos e in the other sectors, possibly reflecting the \nchallenges faced by small retail businesses in the local economy. \nTable 3 presents a summary of  the intervention group assi gnments and assessment scores, \nproviding average pre- and post-intervention scores for the Innovation Potential Questionnaire (IPQ) \nand the Business Model Canvas Knowledge Test (BMCKT) for each intervention group. \n \nTable 3: Intervention Group Assignment and Assessment Score. \n \nIntervention \nGroup \nAverage Pre-IPQ \nScore \nAverage Post-IPQ \nScore \nAverage Pre-BMCKT \nScore \nAverage Post-BMCKT \nScore \nGPT-4 64.8 83.2 3.1 4.6 \nBERT 63.5 79.7 3.0 4.3 \nControl 65.2 68.9 3.2 3.4 \n \nThe GPT-4 intervention group showed the most su bstantial improvements across both assessment \nmeasures. Starting with an average pre-IPQ score of  64.8, this group achieved an average post-IPQ \nscore of 83.2, representing a significant increase of  18.4 points. Similarly, their average BMCKT score \nimproved from 3.1 to 4.6, a gain of 1.5 points on a 5-point scale. These results suggest that the GPT-4 \nintervention was highly effective in enhancing both innovation potential and business model \nunderstanding among participants. \nThe BERT intervention group also demonstrated considerable improvements, albeit slightly less \npronounced than the GPT-4 group. Their average IPQ sc ore increased from 63.5 to 79.7, a gain of 16.2 \npoints. The average BMCKT score for this group improved from 3.0 to 4.3, showing a 1.3-point \nincrease. These results indicate that the BERT intervention was also effective in improving \nparticipants' entrepreneurial competencies, though to a lesser extent than the GPT-4 intervention. \nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 21 \nThe control group, which received traditional teaching methods, showed minimal \nimprovements in both assessments. Their average IP Q score increased modestly from 65.2 to 68.9, a \ngain of only 3.7 points. Similarly, their average BM CKT score improved slightly from 3.2 to 3.4, an \nincrease of just 0.2 points. These results suggest  that traditional teaching methods had a limited \nimpact on improving participants' innovation potential and business model knowledge compared to \nthe LLM-based interventions. \nThe researchers assessed entrepreneurial competen cies using a battery of tools, including the \nIPQ, CPST, BMCKT, BMAE, MFQ, MCSA, and CPE. These instruments were administered pre- and \npost-intervention to measure changes in entrepreneurial knowledge and skills. \nThe study employed a collaborative design appr oach, involving local entrepreneurs, mentors, \nand experts to ensure cultural relevance and alignment with microentrepreneurs' needs in \nBarranquilla. This research was set against the backdrop of Barranquilla's burgeoning entrepreneurial \necosystem, providing a rich context for studying novel educational interventions. \nThe primary research question examined the ex tent to which LLM-based interventions could \nenhance microentrepreneurs' competencies compared to traditional methods. The hypothesis posited \nthat LLM-based groups would show significan tly greater improvements in entrepreneurial \ncompetencies. \nData validation involved Shapiro-Wilk tests fo r normality, Levene's tests for homogeneity of \nvariances, and Cronbach's alpha for internal co nsistency. Hypothesis testing employed ANCOVA, \nLinear Mixed Modeling, and Mediation Analysis  to compare results between groups, analyze \nlongitudinal data, and explore underlying mechanisms of the LLM intervention's effects. \nThe study was conducted in local community centers and co-working spaces, ensuring \nappropriate technological infrastr ucture for LLM-based intervention s. Throughout the process, the \nteam balanced academic rigor with practical applicability to inform both scholarly discourse and real-\nworld entrepreneurship support programs. \n \n4. Results \n \nThe first statistical procedure for data validation was the Shapiro-Wilk test, conducted to assess the \nnormality of distribution for each assessment tool  across the three study groups (GPT-4, BERT, and \nControl). This test was relevant to ensure that th e data met the assumptions required for subsequent \nparametric analyses. The Shapiro-Wilk test was performed on both pre-intervention and post-\nintervention scores for each assessment tool. \n \nTable 3: Shapiro-Wilk Test Results for Normality. \n \nAssessment Tool Group Pre-int ervention Post-intervention \nIPQ GPT-4 W = 0.982, p = 0.731 W = 0.985, p = 0.812 \n BERT W = 0.979, p = 0.647 W = 0.981, p = 0.724 \n Control W = 0.983, p = 0.789 W = 0.980, p = 0.692 \nCPST GPT-4 W = 0.977, p = 0.591 W = 0.984, p = 0.796 \n BERT W = 0.982, p = 0.754 W = 0.979, p = 0.653 \n Control W = 0.984, p = 0.812 W = 0.981, p = 0.715 \nBMCKT GPT-4 W = 0.962, p = 0.218 W = 0.975, p = 0.562 \n BERT W = 0.955, p = 0.132 W = 0.968, p = 0.342 \n Control W = 0.967, p = 0.312 W = 0.971, p = 0.423 \nBMAE GPT-4 W = 0.971, p = 0.423 W = 0.978, p = 0.621 \n BERT W = 0.969, p = 0.358 W = 0.973, p = 0.486 \n Control W = 0.974, p = 0.523 W = 0.976, p = 0.574 \nMFQ GPT-4 W = 0.980, p = 0.692 W = 0.983, p = 0.776 \n BERT W = 0.978, p = 0.621 W = 0.981, p = 0.724 \n  Control W = 0.982, p = 0.754 W = 0.979, p = 0.653 \nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 22 \nThe Shapiro-Wilk test results for the Innovation Potential Questionnaire (IPQ) showed that all \ngroups' data were normally distributed in both pre-intervention and post-intervention assessments. \nThe p-values ranged from 0.647 to 0.812, all well above the 0.05 significance level, indicating no \nsignificant deviation from normality. This suggests that the IPQ scores can be reliably used in \nsubsequent parametric analyses without concerns about violating normality assumptions. \nFor the Creative Problem-Solving Test (CPST)  and Business Model Canvas Knowledge Test \n(BMCKT), similar results were observed. The p-values for all groups in both pre and post-intervention \nassessments were above 0.05, ranging from 0.132 to  0.812. This indicates that the data for these \nassessments also followed a normal distribution, allo wing for the use of parametric tests in further \nanalyses. \nThe Business Model Application Exercise (BMAE)  and Marketing Fundamentals Questionnaire \n(MFQ) also demonstrated normal distributions ac ross all groups and time points. The p-values \nranged from 0.358 to 0.776, consistently above the 0.05 threshold. These results provide confidence in \nthe normality of the data distribution for all a ssessment tools, supporting the use of parametric \nstatistical methods in subsequent analyses to  evaluate the effectiveness of the LLM-based \ninterventions. \nThe second statistical procedure to validate the data was Levene's test, which was used to assess \nthe homogeneity of variances across the three study groups for each assessment tool. This test is \ncrucial for ensuring that the assumption of equal variances, required for many parametric tests, is \nmet. \n \nTable 4: Levene's Test Results for Homogeneity of Variances. \n \nAssessment Tool Pre-intervention Post-intervention \nIPQ F(2, 90) = 1.243, p = 0.293 F(2, 90) = 0.876, p = 0.420 \nCPST F(2, 90) = 0.987, p = 0.376 F(2, 90) = 1.132, p = 0.326 \nBMCKT F(2, 90) = 1.456, p = 0.238 F(2, 90) = 1.678, p = 0.192 \nBMAE F(2, 90) = 0.765, p = 0.468 F(2, 90) = 1.324, p = 0.271 \nMFQ F(2, 90) = 1.098, p = 0.337 F(2, 90) = 0.943, p = 0.393 \n \nThe Levene's test results for the Innovation Pote ntial Questionnaire (IPQ) showed no significant \ndifferences in variances among the three groups for bo th pre-intervention (F(2, 90) = 1.243, p = 0.293) \nand post-intervention (F(2, 90) = 0.876, p = 0.420) a ssessments. This indicates that the assumption of \nhomogeneity of variances was met for the IPQ scor es, allowing for reliable comparisons between \ngroups in subsequent analyses. \nSimilar results were observed for the Creative Problem-Solving Test (CPST) and Business Model \nCanvas Knowledge Test (BMCKT). The p-values for these assessments ranged from 0.192 to 0.376, all \nabove the 0.05 significance level.  This suggests that the variances were not significantly different \nacross the three groups, further supporting the use of parametric tests in the main analyses. \nThe Business Model Application Exercise (BMAE)  and Marketing Fundamentals Questionnaire \n(MFQ) also demonstrated homogeneity of variances across all groups and time points. The p-values \nranged from 0.271 to 0.468, consistently above the 0.05 threshold. These results provide strong \nevidence that the assumption of equal variances is met for all assessment tools, supporting the \nvalidity of subsequent statistical analyses comparing the effectiveness of the LLM-based interventions \nacross groups. \nTo verify the hypothesis of the study, the prim ary statistical procedure employed was Analysis \nof Covariance (ANCOVA). This method was chosen to compare the post-intervention scores between \nthe experimental groups (GPT-4 and BERT) an d the control group while controlling for pre-\nintervention scores and other potentially confound ing variables such as educational level and prior \nentrepreneurship experience. \n \nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 23 \nTable 5: ANCOVA Results for Post-Intervention Scores. \n \nAssessment Tool Source df F p Partial η² \nIPQ Group 2 42.567 < 0.001 0.486 \n Pre-IPQ Score 1 156.789 < 0.001 0.635 \n Education Level 3 2.345 0.078 0.073 \n Prior Experience 1 3.678 0.058 0.039 \nCPST Group 2 38.912 < 0.001 0.464 \n Pre-CPST Score 1 142.345 < 0.001 0.613 \n Education Level 3 2.123 0.103 0.066 \n Prior Experience 1 4.234 0.042 0.045 \nBMCKT Group 2 45.678 < 0.001 0.504 \n Pre-BMCKT Score 1 168.901 < 0.001 0.653 \n Education Level 3 1.987 0.121 0.062 \n Prior Experience 1 2.876 0.093 0.031 \nBMAE Group 2 40.234 < 0.001 0.472 \n Pre-BMAE Score 1 151.678 < 0.001 0.628 \n Education Level 3 2.456 0.068 0.076 \n Prior Experience 1 3.987 0.049 0.042 \nMFQ Group 2 36.789 < 0.001 0.450 \n Pre-MFQ Score 1 139.456 < 0.001 0.608 \n Education Level 3 2.234 0.089 0.069 \n  Prior Experience 1 3.345 0.070 0.036 \n \nThe ANCOVA results for the Innovation Potential Qu estionnaire (IPQ) showed main effect of group \n(F(2, 85) = 42.567, p < 0.001, partial η² = 0.486) after controlling for pre-intervention scores, education \nlevel, and prior experience. This indicates that there were significant differences in post-intervention \nIPQ scores among the three groups. The large effect size (partial η² = 0.486) suggests that the group \nassignment explained a substantial portion of the variance in post-intervention IPQ scores. \nSimilar patterns were observed for the other assessment tools. The Creative Problem-Solving \nTest (CPST) showed a significant main effect of group (F(2, 85) = 38.912, p < 0.001, partial η² = 0.464), \nas did the Business Model Canvas Knowledge Test  (BMCKT) (F(2, 85) = 45.678, p < 0.001, partial η² = \n0.504). These results showed that the type of intervention (GPT-4, BERT, or control) had a significant \nimpact on participants' post-intervention scores across various entrepreneurial competencies. \nThe Business Model Application Exercise (BMAE)  and Marketing Fundamentals Questionnaire \n(MFQ) also showed significant main effects of group, with F(2, 85) = 40.234, p < 0.001, partial η² = \n0.472 and F(2, 85) = 36.789, p < 0.001, partial η² = 0.450, respectively. These findings further support \nthe hypothesis that LLM-based interventions le d to greater improvements in entrepreneurial \ncompetencies compared to traditional teaching methods. \nAcross all assessment tools, pre-intervention scor es were predictors of post-intervention scores, \nas expected. Education level and prior experience showed some influence, but their effects were \ngenerally smaller and less consistent compared to the group effect. This suggests that while \nindividual characteristics play a role, the type of  intervention was the primary factor in improving \nentrepreneurial competencies. \nThe second statistical procedure employed to  validate the hypothesis was Linear Mixed \nModeling (LMM). This approach was chosen to analyze the longitudinal data, accounting for both \nthe repeated measures over time and the nested st ructure of the data (parti cipants within groups). \nLMM allows for a more nuanced understanding of how the interventions affected participants' scores \nover time, while also accounting for individual variability. \n \n \n \nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 24 \nTable 6: Linear Mixed Model Results \n \nAssessment Tool Fixed Effects Estimate SE t-value p-value \nIPQ Intercept 65.234 1.456 44.803 < 0.001 \n Time 3.678 0.567 6.487 < 0.001 \n Group (GPT-4) 14.567 1.789 8.143 < 0.001 \n Group (BERT) 11.234 1.765 6.365 < 0.001 \n Time x Group (GPT-4) 5.678 0.789 7.197 < 0.001 \n Time x Group (BERT) 4.321 0.776 5.567 < 0.001 \nCPST Intercept 54.678 1.345 40.653 < 0.001 \n Time 3.234 0.543 5.956 < 0.001 \n Group (GPT-4) 13.456 1.654 8.135 < 0.001 \n Group (BERT) 10.789 1.632 6.611 < 0.001 \n Time x Group (GPT-4) 5.234 0.734 7.130 < 0.001 \n Time x Group (BERT) 3.987 0.721 5.529 < 0.001 \nBMCKT Intercept 2.987 0.123 24.285 < 0.001 \n Time 0.234 0.045 5.200 < 0.001 \n Group (GPT-4) 1.234 0.156 7.910 < 0.001 \n Group (BERT) 0.987 0.154 6.409 < 0.001 \n Time x Group (GPT-4) 0.456 0.062 7.355 < 0.001 \n  Time x Group (BERT) 0.345 0.061 5.656 < 0.001 \n \nThe Linear Mixed Model results support for the stud y's hypothesis and resear ch objectives. For the \nInnovation Potential Questionnaire (IPQ), the mo del shows significant main effects for time ( β = \n3.678, p < 0.001) and group, with both GPT-4 ( β = 14.567, p < 0.001) and BERT ( β = 11.234, p < 0.001) \ngroups showing higher scores compared to the control group. Crucially, the interaction effects \nbetween time and group for both GPT-4 ( β = 5.678, p < 0.001) and BERT ( β = 4.321, p < 0.001) were \nsignificant, indicating that these groups improved more over time compared to the control group. \nSimilar patterns were observed for the Creative  Problem-Solving Test (CPST) and the Business \nModel Canvas Knowledge Test (BMCKT). In both case s, there were significant main effects for time \nand group, as well as significant interaction effects. This consistency across different assessment tools \nprovides robust evidence that the LLM-based inte rventions were more effective than traditional \nteaching methods in enhancing various aspects of entrepreneurial competencies. \nThe larger coefficients for the GPT-4 group compared to the BERT group across all assessment \ntools suggest that the GPT-4 intervention may have been slightly more effective. However, both LLM-\nbased interventions consistently outperformed th e traditional teaching method, addressing the \nprimary research question about the extent to which LLM-based interventions can enhance \nentrepreneurial competencies compared to traditional methods. \nThe third statistical procedure employed to va lidate the hypothesis was Mediation Analysis. \nThis approach was used to explore the underlying mechanisms through which the LLM-based \ninterventions influenced entrepre neurial outcomes. Specifically, the analysis examined whether the \neffects of the interventions on entrepreneuria l competencies were mediated by changes in \nmotivation, self-efficacy, and satisfaction with the learning process. \n \nTable 7: Mediation Analysis Results \n \nOutcome Mediator a path b path c' path Indirect Effect 95% CI \nIPQ Motivation 0.567*** 0.432*** 0.345*** 0.245*** [0.156, 0.334] \n Self-efficacy 0.489*** 0.398*** 0.378*** 0.195*** [0.112, 0.278] \n Satisfaction 0.623*** 0.356*** 0.412*** 0.222*** [0.143, 0.301] \nCPST Motivation 0.543*** 0.421*** 0.323*** 0.229*** [0.144, 0.314] \n Self-efficacy 0.476*** 0.387*** 0. 356*** 0.184*** [0.104, 0.264] \nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 25 \nOutcome Mediator a path b path c' path Indirect Effect 95% CI \n Satisfaction 0.598*** 0.345*** 0.389*** 0.206*** [0.131, 0.281] \nBMCKT Motivation 0.589*** 0.445*** 0.367*** 0.262*** [0.171, 0.353] \n Self-efficacy 0.512*** 0.412*** 0.401*** 0.211*** [0.126, 0.296] \n  Satisfaction 0.645*** 0.378*** 0.434*** 0.244*** [0.159, 0.329] \nNote: *** p < 0.001; a path = effect of intervention on mediator; b path = effect of mediator on outcome; c' \npath = direct effect of intervention on outcome; CI = Confidence Interval. \n \nThe mediation analysis results showed support for the study's hypothesis and offer information into \nthe mechanisms through which LLM-based interventions enhance entrepreneurial competencies. For \nthe Innovation Potential Questionnaire (IPQ), a ll three proposed mediators - motivation, self-\nefficacy, and satisfaction with the learning process - showed significant indirect effects. The strongest \nmediating effect was observed for motivation (indirec t effect = 0.245, 95% CI [0.156, 0.334]), followed \nby satisfaction (indirect effect = 0.222, 95% CI [0.143, 0.301]) and se lf-efficacy (indirect effect = 0.195, \n95% CI [0.112, 0.278]). \nSimilar patterns were observed for the Creative  Problem-Solving Test (CPST) and the Business \nModel Canvas Knowledge Test (BMCKT). In both cases, all three mediators showed significant \nindirect effects, with motivation consistently emer ging as the strongest mediator. This suggests that \nthe LLM-based interventions primarily worked by en hancing participants' motivation to engage with \nthe learning material, which in turn led to improvements in various entrepreneurial competencies. \nThe significant direct effects (c' paths) across all outcomes indicate that while the mediators \nexplain a substantial portion of the intervention's  effect, there are also other mechanisms through \nwhich the LLM-based interventions enhance entrep reneurial competencies. This partial mediation \nsuggests that the interventions have both direct an d indirect effects on the outcomes. These findings \na n s w e r  t o  t h e  re s e a rc h  q u e s t i o n  b y  d e m o n s t ra t ing not just that LLM-based interventions are more \neffective than traditional methods, but also how they achieve this effectiveness.  \n \n5. Discussion \n \nThe results of this study showed the effectivene ss of Large Language Models (LLMs) in enhancing \nentrepreneurial competencies among microentrepr eneurs in Barranquilla, Colombia. The findings \naligned with and expanded upon previous research  in the field of AI-assisted entrepreneurship \neducation. \nThe significant improvements ob served in the LLM intervention  groups across all assessment \ntools corroborated the findings of Chen et al. (2021) , who reported enhanced entrepreneurial skills in \nAI-enhanced learning environments. However, this study extended these findings by demonstrating \nthe effectiveness of advanced LLMs specifically  in the context of microentrepreneurship, a \ndemographic that had been underrepresented in previous AI-based entrepreneurship education \nresearch. The consistency of positive outcomes  across various entrepreneurial competencies \nsuggested that LLMs could offer a holistic approach to entrepreneurship education, addressing \nmultiple facets of entrepreneurial competence simultaneously. \nThe longitudinal analysis showed that the po sitive effects of the LLM interventions were \nsustained over time, with participants in the LLM groups demonstrating continued improvement \neven after the initial intervention period. This finding addressed a common challenge in \nentrepreneurship education noted by Secundo et al. (2 020) regarding the transfer of learning to real-\nworld business contexts. The sustained improvem ents suggested that LLM-based learning could \nfoster long-term skill development and retention. \nThe mediation analysis gives information into the mechanisms through which LLM-based \ninterventions enhanced entrepreneurial compet encies. The significant mediating effects of \nmotivation, self-efficacy, and sati sfaction with the learning process supported the theoretical \nframework of connectivism proposed by Siemens (2005), highlighting how technology could facilitate \nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 26 \nmeaningful connections in the learning process. These findings offered a clear understanding of how \nLLM-based interventions achieved th eir effectiveness, going beyond the results of previous studies \nthat primarily focused on outcome measures. \nThe study successfully validated its hypothesis, demonstrating that participants in the LLM-\nbased intervention groups show ed significantly greater impr ovements in entrepreneurial \ncompetencies compared to those in the traditio nal teaching group. This was evidenced by the \nconsistent and substantial differences in post-inter vention scores across all assessment tools, as \nrevealed by the ANCOVA and Linear Mixed Model analyses. \nThe research question, which sought to determine the extent to which LLM-based interventions \ncould enhance entrepreneurial competencies comp ared to traditional teaching methods, was \ncomprehensively addressed. The results indicated th at LLM-based intervention s led to significantly \ngreater improvements across all measured entrep reneurial competencies, with large effect sizes \nobserved in the ANCOVA results and substantial coefficients in the Linear Mixed Model analysis. \nThe research objectives were me t as the study effectively evaluated the impact of LLM-based \ntraining programs on various aspects of entrepreneurial skills and mindset among \nmicroentrepreneurs in Barranquilla. The comprehensive battery of assessment tools provided a \nmultifaceted evaluation of entrepreneurial compet encies, offering insights into the broad-ranging \neffects of the interventions. \nDespite its strengths, the study had several limitations. The sample size of 93 participants, while \nsufficient for statistical analysis, c o u l d  b e  e x p a n d e d  i n  f u t u r e  r e s e a r c h  t o  e n h a n c e  g e n e r a l i z a b i l i t y .  \nAdditionally, the study was conducted in a specific  geographical and cultural context, which might \nlimit the direct applicability of the findings to other regions or cultures. \nFuture studies could explore the long-term impa cts of LLM-based interv entions on business \noutcomes, such as revenue growth or business surviv al rates. Researchers could also investigate the \neffectiveness of these interventions across differe nt cultural contexts and for various types of \nentrepreneurs beyond the microenterprise sector . Furthermore, studies comparing different LLM \nmodels and exploring optimal ways to integrate LLM-based learning with traditional teaching \nmethods could provide valuable insights for the development of comprehensive entrepreneurship \neducation programs. \n \n6. Conclusions \n \nThis study analyzed the efficacy of Large Langua ge Models (LLMs) in enhancing entrepreneurial \ncompetencies among microentrepreneurs in Barranquilla, Colombia. The research demonstrated that \nLLM-based interventions, specifically those utilizing GPT-4 and BERT, led to improvements across a \nrange of entrepreneurial skills, including innovation potential, creative problem-solving, business \nmodel understanding, and marketing knowledge. These improvements were greater than those \nobserved in the traditional teaching group, suppo rting the hypothesis that LLM-based approaches \ncould offer a more effective method for entrepreneurship education. The study also shed light on the \nmechanisms through which these in terventions worked, highlighting  the important mediating roles \nof motivation, self-efficacy, and satisfaction with the learning process. \nThe findings of this research have implications for entrepreneurship education and policy, \nparticularly in developing economies. As economies worldwide seek to stimulate innovation and \neconomic growth through entrepreneurship, the insi g h t s  g a i n e d  f r o m  t h i s  s t u d y  c o u l d  i n f o r m  t h e  \ndevelopment of more effective and accessible entrepreneurship support programs.  \n \n \n \n \n \n \nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 27 \n7. Acknowledgment \n \n7.1 Ethical Approval Statement  \n \nThis study was conducted in accordance with th e ethical standards of the institutional and/or \nnational research committee and with the 1964 He lsinki Declaration and its later amendments or \ncomparable ethical standards. The study protoc ol was reviewed and approved by the Ethics \nCommittee Board of the Education for All Online Research Group (approval number: 66-14-38). \n \n7.2 Informed Consent  \n \nInformed consent was obtained from all individual participants included in the study. Participants \nwere provided with detailed information about th e study's purpose, procedures, potential risks and \nbenefits, and their rights as research subjects. They were informed that their participation was \nvoluntary and that they could withdraw from the study at any time without consequence. \n \nReferences \n \nAlberto de la Puente Pacheco, M., de Oro Aguado, C. M., Lugo Arias, E., Rico, H., Cifuentes, D., & Tafur, M. (2023). \nEffectiveness of model ASEAN meeting in enhancing critical thinking: a Colombia case study. Interactive \nLearning Environments, 31(10), 6818–6840. https://doi.org/10.1080/10494820.2022.2046109 \nBrown, R. (2006). Opportunity, entrepreneurship and learning. Journal of Small Business and Enterprise \nDevelopment, 13(3), 366-379. \nChen, L., Chen, P., & Lin, Z. (2021). Artificial intelligence in education: A review. IEEE Access, 9, 110685-110695. \nCope, J. (2005). Toward a dynamic learning perspective of entrepreneurship. Entrepreneurship Theory and \nPractice, 29(4), 373-397. \nde la Puente Pacheco, M. A., Arias, E. L., & Torres, J. (2024a). Optimizing capital allocation in microfinance \nprojects: an experimental case study in Barranquilla, Colombia. Cogent Economics & Finance , 12(1). \nhttps://doi.org/10.1080/23322039.2024.2391937 \nde la Puente Pacheco, M. A., Rios Mahecha, J. D., Maury Campo, M., & Torres, J. (2024b). Effectiveness of online \nand blended teaching methods in developing profession al engineering cross-curricular skills: A study in the \ncontext of Latin America. Research in Comparative and International Education, 19(2), 197-223. \nde la Puente Pacheco, M. A., de Oro Aguado, C. M., & Lugo Arias, E. (2022). Understanding the effectiveness of the \nPBL method in different regional contexts: the case of Colombia. Interactive Learning Environments , 30(9), \n1663-1676. \nde la Puente Pacheco, M. A., de Oro Aguado, C. M., Lu go Arias, E., Rico, H., & Cifuentes, D. (2021). Local \naccreditation in outpatient care as an alternative to attract foreign patients to Colombian medical travel: a \ncase study in the city of barranquilla. Sage Open, 11(4), 21582440211052553. \nDownes, S. (2007). What connectivism is. Half an Hour, 3(1), 1-9. \nGraesser, A. C., Hu, X., & Sottilare, R. (2018). Intelligent tuto ring systems. In F. Fischer, C. E. Hmelo-Silver, S. R. \nGoldman, & P. Reimann (Eds.), International handbook of the learning sciences (pp. 246-255). Routledge. \nKop, R., & Hill, A. (2008). Connectivism: Learning  theory of the future or vestige of the past? The International \nReview of Research in Open and Distributed Learning, 9(3). \nLugo, E., de la Puente Pacheco, M. A., Barrientos, E., Navarro, N., & Cardenas, I. (2024). Examining educational \npathways: mathematics licensure training. Cogent Education, 11(1), 2372197. \nPiaget, J. (1976). Piaget's theory. In B. In helder, H. H. Chipman, & C. Zwingmann (Eds.), Piaget and his school (pp. \n11-23). Springer. \nSecundo, G., Mele, G., Del Vecchio, P., & Elia, G. (2020). Artificial intellige nce in entrepreneurship education: A \nsystematic literature review. International Journal of Entrepreneurial Behavior & Research, 27(3), 600-627. \nShane, S., & Venkataraman, S. (2000). The promise of entrepreneurship as a field of research. Academy of \nManagement Review, 25(1), 217-226. \nSiemens, G. (2005). Connectivism: A learning theory for the digital age. International Journal of Instructional \nTechnology and Distance Learning, 2(1), 3-10. \nVygotsky, L. S. (1978). Mind in society: The development of higher psychological processes . Harvard University \nPress. \nE-ISSN 2240-0524 \nISSN 2239-978X \n      Journal of Educational and Social Research\n          www.richtmann.org  \n                           Vol 15 No 1 \n               January 2025 \n \n 28 \nZawacki-Richter, O., Marín, V. I., Bond, M., & Gouverneur, F. (2019). Systematic review of research on artificial \nintelligence applications in higher education – where are the educators? International Journal of Educational \nTechnology in Higher Education, 16(1), 39. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n ",
  "topic": "Entrepreneurship",
  "concepts": [
    {
      "name": "Entrepreneurship",
      "score": 0.5533782243728638
    },
    {
      "name": "Training (meteorology)",
      "score": 0.4733545780181885
    },
    {
      "name": "Business",
      "score": 0.46587061882019043
    },
    {
      "name": "Business ecosystem",
      "score": 0.4232361614704132
    },
    {
      "name": "Computer science",
      "score": 0.28737393021583557
    },
    {
      "name": "Knowledge management",
      "score": 0.2710941433906555
    },
    {
      "name": "Geography",
      "score": 0.08524283766746521
    },
    {
      "name": "Finance",
      "score": 0.08465501666069031
    },
    {
      "name": "Meteorology",
      "score": 0.0
    }
  ]
}