{
  "title": "Industrial Maintenance Optimization Based on the Integration of Large Language Models (LLM) and Augmented Reality (AR)",
  "url": "https://openalex.org/W4408735891",
  "year": 2025,
  "authors": [
    {
      "id": "https://openalex.org/A2715030141",
      "name": "John Angelopoulos",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A3208330269",
      "name": "Christos Manettas",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2143964167",
      "name": "Kosmas Alexopoulos",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W4313445270",
    "https://openalex.org/W4398140525",
    "https://openalex.org/W4398243240",
    "https://openalex.org/W4388182168",
    "https://openalex.org/W4392974799",
    "https://openalex.org/W4389544380",
    "https://openalex.org/W4390098547",
    "https://openalex.org/W6815166935"
  ],
  "abstract": "Abstract Traditional maintenance procedures often rely on manual data processing and human expertise, leading to inefficiencies and potential errors. In the context of Industry 4.0 several digital technologies, such as Artificial Intelligence (AI), Big Data Analytics (BDA), and eXtended Reality (XR) have been developed and are constantly being integrated in a plethora of manufacturing activities (including industrial maintenance), in an attempt to minimize human error, facilitate shop floor technicians, reduce costs as well as reduce equipment downtimes. The latest developments in the field of AI point towards Large Language Models (LLM) which can communicate with human operators in an intuitive manner. On the other hand, Augmented Reality, as part of XR technologies, offers useful functionalities for improving user perception and interaction with modern, complex industrial equipment. Therefore, the context of this research work lies in the development and training of an LLM in order to provide suggestions and actionable items for the mitigation of unforeseen events (e.g. equipment breakdowns), in order to facilitate shop-floor technicians during their everyday tasks. Paired with AR visualizations over the physical environment, the technicians will get instructions for performing tasks and checks on the industrial equipment in a manner similar to human-to-human communication. The functionality of the proposed framework extends to the integration of modules for exchanging information with the engineering department towards the scheduling of Maintenance and Repair Operations (MRO) as well as the creation of a repository of historical data in order to constantly retrain and optimize the LLM.",
  "full_text": null,
  "topic": "Augmented reality",
  "concepts": [
    {
      "name": "Augmented reality",
      "score": 0.7485140562057495
    },
    {
      "name": "Computer science",
      "score": 0.4797574281692505
    },
    {
      "name": "Human–computer interaction",
      "score": 0.25869691371917725
    }
  ]
}