{
    "title": "Artificial Intelligence Text Processing Using Retrieval-Augmented Generation: Applications in Business and Education Fields",
    "url": "https://openalex.org/W4400287472",
    "year": 2024,
    "authors": [
        {
            "id": "https://openalex.org/A4202507858",
            "name": "Bogdan-Stefan POSEDARU",
            "affiliations": [
                "Bucharest University of Economic Studies"
            ]
        },
        {
            "id": "https://openalex.org/A4202507856",
            "name": "Florin-Valeriu Pantelimon",
            "affiliations": [
                "Bucharest University of Economic Studies"
            ]
        },
        {
            "id": "https://openalex.org/A5099983654",
            "name": "Mihai-Nicolae Dulgheru",
            "affiliations": [
                "Bucharest University of Economic Studies"
            ]
        },
        {
            "id": "https://openalex.org/A2773667833",
            "name": "Tiberiu Marian GEORGESCU",
            "affiliations": [
                "Bucharest University of Economic Studies"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W4382246105",
        "https://openalex.org/W4385571271",
        "https://openalex.org/W3139246636",
        "https://openalex.org/W2896457183",
        "https://openalex.org/W2250539671",
        "https://openalex.org/W3166265964",
        "https://openalex.org/W4387304047",
        "https://openalex.org/W4319599375",
        "https://openalex.org/W4365512576",
        "https://openalex.org/W4378574344",
        "https://openalex.org/W7075994569",
        "https://openalex.org/W2065135305",
        "https://openalex.org/W4385654693",
        "https://openalex.org/W4389984066"
    ],
    "abstract": "Abstract The article studies the current text processing tools based on Artificial Intelligence. A literature review is done emphasizing the dynamic evolution of AI-powered text analytics, having as its central tool ChatGPT and its capabilities. The focus is centered on the techniques and methods that are using embeddings in order to improve large language models (LLMs). In this paper is analyzed the current situation of the literature in terms of text processing using Retrieval-Augmented Generation and is highlighted the potential of this technology to enhance the interpretability and trust in applications critical, such as those related to education or business. AI has revolutionized natural language processing (NLP), which facilitated the machines to interpret and generate text efficiently and accurately. In addition, large language models with external knowledge bases have been developed. These are used to produce more accurate and contextually relevant text responses. This approach is called Retrieval-Augmented Generation (RAG is one of the most significant recent advancements in this field. Based on our study, two use cases are implemented to show the applicability of our study: one related to education and one related to business IT-related documents. The methodology describes the techniques used. This includes retrieval-augmented generation and embedding stored using vector databases. Our custom models are evaluated by comparing them to the general ones, without embeddings, showing superior performance. The article highlights remarkable progress in Retrieval-Augmented Generation (RAG), which is used for AI text processing with a focus on business and education fields. Further in this paper, many of the most significant highlights are presented, which include a scalable framework for AI applications, a new integration of Retrieval-Augmented Generation and embeddings, practical application demonstrations, bridging gaps in the analysis op AI text, significant development in AI performance and optimizing educational and business processes.",
    "full_text": null
}