{
    "title": "A survey of Large Language Model use in a hospital, research, and teaching campus",
    "url": "https://openalex.org/W4402467842",
    "year": 2024,
    "authors": [
        {
            "id": "https://openalex.org/A2947123903",
            "name": "Loretta Gasparini",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A3183446610",
            "name": "Nitya Phillipson",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2066532134",
            "name": "Daniel Capurro",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2130922297",
            "name": "Revital Rosenberg",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2196751365",
            "name": "Jim Buttery",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A3194987065",
            "name": "Jayne Howley",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2167529232",
            "name": "Sarath Ranganathan",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2510508844",
            "name": "Catherine Quinlan",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1000344976",
            "name": "Niloufer Selvadurai",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2566671309",
            "name": "Michael Wildenauer",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2109197430",
            "name": "Michael South",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2787086890",
            "name": "Gerardo Luis Dimaguila",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W3034723486",
        "https://openalex.org/W4323655724",
        "https://openalex.org/W4395067526",
        "https://openalex.org/W4400745921",
        "https://openalex.org/W4392643126",
        "https://openalex.org/W4386637335",
        "https://openalex.org/W4389794809",
        "https://openalex.org/W4385266429",
        "https://openalex.org/W4376866715",
        "https://openalex.org/W4377197101",
        "https://openalex.org/W4394956892",
        "https://openalex.org/W4390581359",
        "https://openalex.org/W4400451984",
        "https://openalex.org/W4393138990",
        "https://openalex.org/W2331393505"
    ],
    "abstract": "Abstract Background The use of Large Language Models (LLMs) has exploded since November 2022 but there is sparse evidence regarding LLM use in health, medical and research contexts. Objective To summarise the current uses of and attitudes towards LLMs across the clinical, research and teaching contexts in our campus. Design We administered a survey about LLM uses and attitudes. We conducted summary quantitative analysis and inductive qualitative analysis of free text responses. Setting In August-September 2023, we circulated the survey amongst all staff and students across our campus (approximately n=7500), a fully integrated paediatric academic hospital and research institute. Participants We received 281 anonymous survey responses. Main outcome measures We asked about participants’ knowledge of LLMs, their current use of LLMs in professional or learning contexts, and perspectives on possible future uses, opportunities, and risks of LLM use. Results Over 90% of respondents have heard of LLM tools and about two-thirds have used them in their work on our campus. Respondents reported using LLMs for a range of uses, including for generating or editing text and exploring ideas. Many, but not necessarily all, respondents seem aware of the limitations and potential risks of LLMs, including privacy and security risks. Various respondents expressed enthusiasm about opportunities of LLM use, including increased efficiency. Conclusions Our findings show LLM tools are already widely used on our campus. Guidelines and governance are needed to keep up with practice. We have developed recommendations for the use of LLMs on our campus using insights from this survey. What is known The known: The use of Large Language Models (LLMs) has increased rapidly since the introduction of ChatGPT in November 2022. The new: Most survey respondents are aware of, if not using, LLMs in their work across our hospital, research, and university campus. Diverse uses were reported, including generating or editing text and exploring ideas. There were varying attitudes towards LLMs. Perceived risks included privacy and security risks. A key perceived opportunity was increased efficiency. The implications: LLM tools are already widely used on our campus, highlighting the need for guidelines and governance to keep up with practice.",
    "full_text": null
}