{
  "title": "AI-HOPE-TGFbeta: A Conversational AI Agent for Integrative Clinical and Genomic Analysis of TGF-β Pathway Alterations in Colorectal Cancer to Advance Precision Medicine",
  "url": "https://openalex.org/W4411603813",
  "year": 2025,
  "authors": [
    {
      "id": "https://openalex.org/A5053209932",
      "name": "Ei Wen Yang",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A3080844596",
      "name": "Brigette Waldrup",
      "affiliations": [
        "Beckman Research Institute",
        "City of Hope"
      ]
    },
    {
      "id": "https://openalex.org/A4220524353",
      "name": "Enrique Velazquez‐Villarreal",
      "affiliations": [
        "Beckman Research Institute",
        "City of Hope"
      ]
    },
    {
      "id": "https://openalex.org/A5053209932",
      "name": "Ei Wen Yang",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A3080844596",
      "name": "Brigette Waldrup",
      "affiliations": [
        "Beckman Research Institute",
        "City of Hope"
      ]
    },
    {
      "id": "https://openalex.org/A4220524353",
      "name": "Enrique Velazquez‐Villarreal",
      "affiliations": [
        "Beckman Research Institute",
        "City of Hope"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2554977183",
    "https://openalex.org/W6809331450",
    "https://openalex.org/W4210327840",
    "https://openalex.org/W4404633611",
    "https://openalex.org/W4224217056",
    "https://openalex.org/W4408403213",
    "https://openalex.org/W4403531297",
    "https://openalex.org/W2888906654",
    "https://openalex.org/W3158410076",
    "https://openalex.org/W4405202601",
    "https://openalex.org/W2953900933",
    "https://openalex.org/W4396892455",
    "https://openalex.org/W2043363016",
    "https://openalex.org/W4406107767",
    "https://openalex.org/W4389308009",
    "https://openalex.org/W2992809542",
    "https://openalex.org/W4309736754",
    "https://openalex.org/W4392126555",
    "https://openalex.org/W4403163174",
    "https://openalex.org/W2262414037",
    "https://openalex.org/W2149441684",
    "https://openalex.org/W3028304854",
    "https://openalex.org/W4409190866",
    "https://openalex.org/W4406152279",
    "https://openalex.org/W2768869002",
    "https://openalex.org/W4396808902",
    "https://openalex.org/W4296801538",
    "https://openalex.org/W4403617164",
    "https://openalex.org/W4410382108",
    "https://openalex.org/W2549958142",
    "https://openalex.org/W4214648444",
    "https://openalex.org/W4225753899"
  ],
  "abstract": "Introduction: Early-onset colorectal cancer (EOCRC) is rising rapidly, particularly among the Hispanic/Latino (H/L) populations, who face disproportionately poor outcomes. The transforming growth factor-beta (TGF-β) signaling pathway plays a critical role in colorectal cancer (CRC) progression by mediating epithelial-to-mesenchymal transition (EMT), immune evasion, and metastasis. However, integrative analyses linking TGF-β alterations to clinical features remain limited—particularly for diverse populations—hindering translational research and the development of precision therapies. To address this gap, we developed AI-HOPE-TGFbeta (Artificial Intelligence agent for High-Optimization and Precision Medicine focused on TGF-β), the first conversational artificial intelligence (AI) agent designed to explore TGF-β dysregulation in CRC by integrating harmonized clinical and genomic data via natural language queries. Methods: AI-HOPE-TGFbeta utilizes a large language model (LLM), Large Language Model Meta AI 3 (LLaMA 3), a natural language-to-code interpreter, and a bioinformatics backend to automate statistical workflows. Tailored for TGF-β pathway analysis, the platform enables real-time cohort stratification and hypothesis testing using harmonized datasets from the cBio Cancer Genomics Portal (cBioPortal). It supports mutation frequency comparisons, odds ratio testing, Kaplan–Meier survival analysis, and subgroup evaluations across race/ethnicity, microsatellite instability (MSI) status, tumor stage, treatment exposure, and age. The platform was validated by replicating findings on the SMAD4, TGFBR2, and BMPR1A mutations in EOCRC. Exploratory queries were conducted to examine novel associations with clinical outcomes in H/L populations. Results: AI-HOPE-TGFbeta successfully recapitulated established associations, including worse survival in SMAD4-mutant EOCRC patients treated with FOLFOX (fluorouracil, leucovorin and oxaliplatin) (p = 0.0001) and better outcomes in early-stage TGFBR2-mutated CRC patients (p = 0.00001). It revealed potential population-specific enrichment of BMPR1A mutations in H/L patients (OR = 2.63; p = 0.052) and uncovered MSI-specific survival benefits among SMAD4-mutated patients (p = 0.00001). Exploratory analysis showed better outcomes in SMAD2-mutant primary tumors vs. metastatic cases (p = 0.0010) and confirmed the feasibility of disaggregated ethnicity-based queries for TGFBR1 mutations, despite small sample sizes. These findings underscore the platform’s capacity to detect both known and emerging clinical–genomic patterns in CRC. Conclusions: AI-HOPE-TGFbeta introduces a new paradigm in cancer bioinformatics by enabling natural language-driven, real-time integration of genomic and clinical data specific to TGF-β pathway alterations in CRC. The platform democratizes complex analyses, supports disparity-focused investigation, and reveals clinically actionable insights in underserved populations, such as H/L EOCRC patients. As a first-of-its-kind system studying TGF-β, AI-HOPE-TGFbeta holds strong promise for advancing equitable precision oncology and accelerating translational discovery in the CRC TGF-β pathway.",
  "full_text": null,
  "topic": "Cancer",
  "concepts": [
    {
      "name": "Cancer",
      "score": 0.5862031579017639
    },
    {
      "name": "Transforming growth factor",
      "score": 0.584492564201355
    },
    {
      "name": "Precision medicine",
      "score": 0.5765764117240906
    },
    {
      "name": "Colorectal cancer",
      "score": 0.555570125579834
    },
    {
      "name": "Medicine",
      "score": 0.40053021907806396
    },
    {
      "name": "Cancer research",
      "score": 0.3914109468460083
    },
    {
      "name": "Computational biology",
      "score": 0.35556378960609436
    },
    {
      "name": "Psychology",
      "score": 0.3423095643520355
    },
    {
      "name": "Internal medicine",
      "score": 0.2955520749092102
    },
    {
      "name": "Biology",
      "score": 0.2536878287792206
    },
    {
      "name": "Pathology",
      "score": 0.1749143898487091
    }
  ],
  "institutions": [
    {
      "id": "https://openalex.org/I4387156432",
      "name": "Beckman Research Institute",
      "country": null
    },
    {
      "id": "https://openalex.org/I4210110459",
      "name": "City of Hope",
      "country": "US"
    }
  ]
}