{
  "title": "A Survey on Hallucination in Large Language and Foundation Models",
  "url": "https://openalex.org/W4410329365",
  "year": 2025,
  "authors": [
    {
      "id": "https://openalex.org/A4307185099",
      "name": "Pegah Ahadian",
      "affiliations": [
        "Kent State University"
      ]
    },
    {
      "id": "https://openalex.org/A2156471281",
      "name": "Qiang Guan",
      "affiliations": [
        "Kent State University"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4221163727",
    "https://openalex.org/W4388585881",
    "https://openalex.org/W4226278401",
    "https://openalex.org/W4406753796",
    "https://openalex.org/W4378473839",
    "https://openalex.org/W3027879771",
    "https://openalex.org/W4391557947",
    "https://openalex.org/W4281557260",
    "https://openalex.org/W4380994347",
    "https://openalex.org/W2909737760",
    "https://openalex.org/W2951211142",
    "https://openalex.org/W2989831167",
    "https://openalex.org/W3127986942",
    "https://openalex.org/W3030163527",
    "https://openalex.org/W4402726948",
    "https://openalex.org/W4387609223",
    "https://openalex.org/W582134693",
    "https://openalex.org/W4281679115",
    "https://openalex.org/W4406983002"
  ],
  "abstract": "Generative text models, particularly large language models (LLMs) and foundation models, have influenced numerous fields, including high-quality text generation, reasoning, and multimodal synthesis. These models have been widely applied in healthcare, legal analysis, and scientific research. However, where accuracy and reliability are critical, generative text models pose a significant risk due to hallucination, where generated outputs include incorrect factuality, fabricated, or misleading information. In this survey, we present a review of hallucination in generative AI, covering its taxonomy, detection methods, mitigation strategies, and evaluation benchmarks. We first establish a structured taxonomy, distinguishing between intrinsic vs. extrinsic hallucination and factual vs. semantic hallucination, also discussing task-specific variations in areas such as summarization, machine translation, and dialogue generation. Next, we examine state-of-the-art hallucination detection techniques, including uncertainty estimation, retrieval-augmented generation (RAG), self-consistency validation, and internal state monitoring. We further explore mitigation strategies, such as fine-tuning, reinforcement learning from human feedback (RLHF), knowledge injection, adversarial training, and contrastive learning. Additionally, we review key evaluation metrics and benchmarks, including FEVER, TruthfulQA, HALL-E, and Entity-Relationship-Based Hallucination Benchmarks (ERBench), which serve as standardized measures for assessing hallucination severity. Despite notable efforts, hallucination remains an open challenge, necessitating further improvements in real-time detection, multimodal hallucination evaluation, and trustworthiness frameworks. We show critical research gaps including the need for standardized hallucination taxonomies, scalable mitigation techniques, and human-AI hybrid verification methods. Our survey aims to serve as a foundational resource for researchers and practitioners, providing insights into current methodologies and guiding future advancements in trustworthy and explainable generative AI.",
  "full_text": null,
  "topic": "Foundation (evidence)",
  "concepts": [
    {
      "name": "Foundation (evidence)",
      "score": 0.7180593013763428
    },
    {
      "name": "Linguistics",
      "score": 0.42164042592048645
    },
    {
      "name": "Psychology",
      "score": 0.40359556674957275
    },
    {
      "name": "Sociology",
      "score": 0.3597790002822876
    },
    {
      "name": "History",
      "score": 0.2632973790168762
    },
    {
      "name": "Archaeology",
      "score": 0.1510435938835144
    },
    {
      "name": "Philosophy",
      "score": 0.14717313647270203
    }
  ],
  "institutions": [],
  "cited_by": 1
}