{
    "title": "Research on the Application of Large Language Models in Classification and Indexing",
    "url": "https://openalex.org/W4410216216",
    "year": 2025,
    "authors": [
        {
            "id": "https://openalex.org/A2015532466",
            "name": "Michael Reynolds",
            "affiliations": [
                "University of Michigan–Flint",
                "University of Michigan–Ann Arbor"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W6854308750",
        "https://openalex.org/W6600140940",
        "https://openalex.org/W4404552614",
        "https://openalex.org/W4404609247",
        "https://openalex.org/W4403345250",
        "https://openalex.org/W6857563048",
        "https://openalex.org/W4402386854",
        "https://openalex.org/W4401626633",
        "https://openalex.org/W4410216216",
        "https://openalex.org/W6733142331",
        "https://openalex.org/W4403712178",
        "https://openalex.org/W4367059011",
        "https://openalex.org/W4384200891",
        "https://openalex.org/W6636026467",
        "https://openalex.org/W6600937397",
        "https://openalex.org/W4321610465",
        "https://openalex.org/W6912954327",
        "https://openalex.org/W4320497232",
        "https://openalex.org/W4318464200"
    ],
    "abstract": "With the rapid development of the information age, classification and indexing, as crucial components of knowledge organization and information retrieval, face critical challenges in efficiency and accuracy across various fields. Traditional classification and indexing methods exhibit significant shortcomings in semantic understanding, handling diverse datasets, and integrating domain knowledge. Large language models (LLMs), such as the GPT series, offer a new avenue for the intelligent transformation of classification and indexing through their powerful natural language processing capabilities. This study explores the application potential of LLMs in classification and indexing tasks. By analyzing the technical characteristics and current use cases of LLMs, the study investigates their performance in key tasks such as topic term extraction, classification label assignment, and cross-domain indexing support. Additionally, it examines challenges associated with applying LLMs, including matching model performance with classification requirements, addressing data privacy and ethical concerns, and integrating domain knowledge. Finally, by analyzing typical application cases, the study envisions the future development directions of LLMs in the field of classification and indexing. This research aims to provide theoretical foundations and technical support for the practical use of LLMs in classification and indexing tasks.",
    "full_text": null
}