{
  "title": "AI-HOPE-TGFbeta: A Conversational AI Agent for Integrative Clinical and Genomic Analysis of TGF-β Pathway Alterations in Colorectal Cancer to Advance Precision Medicine",
  "url": "https://openalex.org/W4410575456",
  "year": 2025,
  "authors": [
    {
      "id": "https://openalex.org/A5113468844",
      "name": "Ei-Wen Yang",
      "affiliations": [
        null
      ]
    },
    {
      "id": "https://openalex.org/A5077836653",
      "name": "Brigette Waldrup",
      "affiliations": [
        null
      ]
    },
    {
      "id": "https://openalex.org/A5030367465",
      "name": "Enrique Velazquez‐Villarreal",
      "affiliations": [
        null
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2554977183",
    "https://openalex.org/W4214648444",
    "https://openalex.org/W4210327840",
    "https://openalex.org/W4404633611",
    "https://openalex.org/W4224217056",
    "https://openalex.org/W4409461726",
    "https://openalex.org/W4404587563",
    "https://openalex.org/W2888906654",
    "https://openalex.org/W3158410076",
    "https://openalex.org/W4405202601",
    "https://openalex.org/W2953900933",
    "https://openalex.org/W4396892455",
    "https://openalex.org/W2043363016",
    "https://openalex.org/W4406107767",
    "https://openalex.org/W4389308009",
    "https://openalex.org/W2992809542",
    "https://openalex.org/W4309736754",
    "https://openalex.org/W4392126555",
    "https://openalex.org/W4403163174",
    "https://openalex.org/W2262414037",
    "https://openalex.org/W4233089003",
    "https://openalex.org/W3028304854",
    "https://openalex.org/W4409190866",
    "https://openalex.org/W4406152279",
    "https://openalex.org/W2768869002",
    "https://openalex.org/W4396808902",
    "https://openalex.org/W4408799113",
    "https://openalex.org/W4409407924",
    "https://openalex.org/W4404979720",
    "https://openalex.org/W3037750807"
  ],
  "abstract": "Abstract Introduction Early-onset colorectal cancer (EOCRC) is rising rapidly, particularly among Hispanic/Latino (H/L) populations, who face disproportionately poor outcomes. The TGF-β signaling pathway plays a critical role in colorectal cancer (CRC) progression by mediating epithelial-to-mesenchymal transition (EMT), immune evasion, and metastasis. However, integrative analyses linking TGF-β alterations to clinical features remain limited—particularly for diverse populations—hindering translational research and the development of precision therapies. To address this gap, we developed AI-HOPE-TGFbeta, the first conversational artificial intelligence (AI) agent designed to explore TGF-β dysregulation in CRC by integrating harmonized clinical and genomic data via natural language queries. Methods AI-HOPE-TGFbeta combines large language models (LLMs), a natural language-to-code interpreter, and a bioinformatics backend to automate statistical workflows. Tailored for TGF-β pathway analysis, the platform enables real-time cohort stratification and hypothesis testing using harmonized datasets from cBioPortal. It supports mutation frequency comparisons, odds ratio testing, Kaplan-Meier survival analysis, and subgroup evaluations across race/ethnicity, MSI status, tumor stage, treatment exposure, and age. The platform was validated by replicating findings on SMAD4, TGFBR2, and BMPR1A mutations in EOCRC. Exploratory queries were conducted to examine novel associations with clinical outcomes in H/L populations. Results AI-HOPE-TGFbeta successfully recapitulated established associations, including worse survival in SMAD4-mutant EOCRC patients treated with FOLFOX (p = 0.0001), and better outcomes in early-stage TGFBR2-mutated CRC patients (p = 0.00001). It revealed potential population-specific enrichment of BMPR1A mutations in H/L patients (OR = 2.63; p = 0.052) and uncovered MSI-specific survival benefits among SMAD4-mutated patients (p = 0.00001). Exploratory analysis showed better outcomes in SMAD2-mutant primary tumors vs. metastatic cases (p = 0.0010) and confirmed the feasibility of disaggregated ethnicity-based queries for TGFBR1 mutations, despite small sample sizes. These findings underscore the platform’s capacity to detect both known and emerging clinical-genomic patterns in CRC. Conclusions AI-HOPE-TGFbeta introduces a new paradigm in cancer bioinformatics by enabling natural language–driven, real-time integration of genomic and clinical data specific to TGF-β pathway alterations in CRC. The platform democratizes complex analyses, supports disparity-focused investigation, and reveals clinically actionable insights in underserved populations such as H/L EOCRC patients. As the first system of its kind studying TGF-β, AI-HOPE-TGFbeta holds strong promise for advancing equitable precision oncology and accelerating translational discovery in CRC TGF-beta pathway.",
  "full_text": "AI-HOPE-TGFbeta: A Conversational AI Agent for Integrative \nClinical and Genomic Analysis of TGF-β Pathway Alterations \nin Colorectal Cancer to Advance Precision Medicine \n \nEi-Wen Yang, Ph.D.1, Brigette Waldrup, BS2, Enrique Velazquez-Villarreal, M.D., \nPh.D., M.P.H.2,3,* \n \n1PolyAgent, San Francisco, CA \n2Department of Integrative Translational Sciences, Beckman Research Institute of City \nof Hope, Duarte, CA \n3City of Hope Comprehensive Cancer Center, Duarte, CA \n \n*Corresponding Author - evelazquezvilla@coh.org \n \nAbstract \n \nIntroduction: \nEarly-onset colorectal cancer (EOCRC) is rising rapidly, particularly among \nHispanic/Latino (H/L) populations, who face disproportionately poor outcomes. The \nTGF-β signaling pathway plays a critical role in colorectal cancer (CRC) progression by \nmediating epithelial-to-mesenchymal transition (EMT), immune evasion, and \nmetastasis. However, integrative analyses linking TGF-β alterations to clinical features \nremain limited—particularly for diverse populations—hindering translational research \nand the development of precision therapies. To address this gap, we developed AI-\nHOPE-TGFbeta, the first conversational artificial intelligence (AI) agent designed to \nexplore TGF-β dysregulation in CRC by integrating harmonized clinical and genomic \ndata via natural language queries. \n \nMethods: \nAI-HOPE-TGFbeta combines large language models (LLMs), a natural language-to-\ncode interpreter, and a bioinformatics backend to automate statistical workflows. \nTailored for TGF-β pathway analysis, the platform enables real-time cohort stratification \nand hypothesis testing using harmonized datasets from cBioPortal. It supports mutation \nfrequency comparisons, odds ratio testing, Kaplan-Meier survival analysis, and \nsubgroup evaluations across race/ethnicity, MSI status, tumor stage, treatment \nexposure, and age. The platform was validated by replicating findings on SMAD4, \nTGFBR2, and BMPR1A mutations in EOCRC. Exploratory queries were conducted to \nexamine novel associations with clinical outcomes in H/L populations. \n \nResults: \nAI-HOPE-TGFbeta successfully recapitulated established associations, including worse \nsurvival in SMAD4-mutant EOCRC patients treated with FOLFOX (p = 0.0001), and \nbetter outcomes in early-stage TGFBR2-mutated CRC patients (p = 0.00001). It \nrevealed potential population-specific enrichment of BMPR1A mutations in H/L patients \n(OR = 2.63; p = 0.052) and uncovered MSI-specific survival benefits among SMAD4-\n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \nNOTE: This preprint reports new research that has not been certified by peer review and should not be used to guide clinical practice.\nmutated patients (p = 0.00001). Exploratory analysis showed better outcomes in \nSMAD2-mutant primary tumors vs. metastatic cases (p = 0.0010) and confirmed the \nfeasibility of disaggregated ethnicity-based queries for TGFBR1 mutations, despite \nsmall sample sizes. These findings underscore the platform’s capacity to detect both \nknown and emerging clinical-genomic patterns in CRC. \n \nConclusions: \nAI-HOPE-TGFbeta introduces a new paradigm in cancer bioinformatics by enabling \nnatural language–driven, real-time integration of genomic and clinical data specific to \nTGF-β pathway alterations in CRC. The platform democratizes complex analyses, \nsupports disparity-focused investigation, and reveals clinically actionable insights in \nunderserved populations such as H/L EOCRC patients. As the first system of its kind \nstudying TGF-β, AI-HOPE-TGFbeta holds strong promise for advancing equitable \nprecision oncology and accelerating translational discovery in CRC TGF-beta pathway. \n \n \nIntroduction \n \nColorectal cancer (CRC) continues to rank among the most prevalent and lethal \ncancers globally, with a notable and rapid increase in early-onset cases—defined as \ndiagnoses occurring before age 50—over the past several decades [1–5]. This upward \ntrend is particularly pronounced in high-risk groups, including Hispanic/Latino (H/L) \nindividuals [6–10]. Although multiple oncogenic pathways contribute to CRC \ndevelopment and progression, the TGF-β signaling pathway plays a pivotal role by \nfacilitating processes such as epithelial-to-mesenchymal transition (EMT), immune \nsystem evasion, and metastatic spread [11–13]. However, efforts to comprehensively \ncharacterize TGF-β dysregulation in EOCRC—especially among underrepresented \npopulations—have been constrained by the underrepresentation of diverse patient \ncohorts in genomic databases and the absence of tools capable of linking clinical and \nmolecular data in an integrative manner [6,7,14,15]. \n \nThe TGF-β pathway is frequently altered in CRC through mutations in key components \nsuch as SMAD4, BMPR1A, and TGFBR2, which are associated with poor prognosis, \ntherapy resistance, and aggressive tumor phenotypes [16–19]. Recent studies suggest \nthat these mutations may present with distinct patterns in EOCRC compared to late-\nonset CRC (LOCRC), and may vary by ethnicity—highlighting a need for population-\nspecific investigation [6, 7,19, 20]. For example, alterations in BMPR1A and BMP7 have \nbeen identified in H/L patients with EOCRC, suggesting unique mechanisms of TGF-β \ndysregulation in this group [6, 7]. However, few tools exist that can efficiently integrate \nand stratify these genomic insights alongside clinical factors such as age, tumor stage, \ntreatment response, and microsatellite instability (MSI) status. \n \nAlthough public platforms such as The Cancer Genome Atlas (TCGA) and AACR \nGENIE provide rich datasets for CRC research, existing analysis tools—like cBioPortal \n[21] and UCSC Xena [22]—require multi-step workflows and offer limited functionality \nfor pathway-specific, population-disaggregated, or treatment-contextualized exploration \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \nin investigating CRC TGF-β dysregulation. These constraints disproportionately affect \nnon-computational researchers, impeding precision oncology efforts in real-world and \nsubpopulation contexts. \n \nThe emergence of artificial intelligence (AI), especially advancements in large language \nmodels (LLMs), has paved the way for conversational tools that convert natural \nlanguage input into executable data analysis pipelines [23–24]. Although these \ntechnologies have demonstrated potential in streamlining multi-omic investigations [25–\n30], there remains a lack of platforms specifically designed to target signaling pathways \nor to support integrative clinical-genomic research with an emphasis on hypothesis \ngeneration and health disparity considerations. \n \nAI-HOPE-TGFbeta (Artificial Intelligence agent for High-Optimization and Precision \nMedicine focused on TGF-β) was developed to directly address the lack of tools \ncapable of pathway-specific, integrative analysis in CRC. This conversational AI system \nenables users to pose natural language questions that are translated into executable \nworkflows, facilitating real-time synthesis of harmonized genomic and clinical data. With \nbuilt-in automation for statistical tasks—including Kaplan-Meier survival analysis and \nodds ratio estimation—the platform streamlines both validation studies and exploratory \ninvestigations across large datasets. In the present study, we: (1) created AI-HOPE-\nTGFbeta to enable user-friendly, pathway-centered interrogation of CRC cohorts; (2) \nassessed its performance by replicating well-established clinical-genomic associations \nin EOCRC; and (3) applied the system to reveal novel links between TGF-β mutations, \nmicrosatellite instability, tumor staging, and population-level variables. These results \nhighlight AI-HOPE-TGFbeta as an innovative and inclusive solution to support scalable, \ntranslational TGFbeta pathway research in precision oncology. \n \nMethods \n \nSystem Architecture and Workflow of AI-HOPE-TGFbeta \n \nAI-HOPE-TGFbeta (Artificial Intelligence agent for High-Optimization and Precision \nMedicine focused on TGF-β) is a natural language–enabled AI system engineered to \nexplore CRC with a specific focus on alterations within the TGF-β signaling pathway. \nThe platform is built on a layered, modular framework that integrates three core \ncomponents: a LLM for semantic query interpretation, a translation layer that converts \nuser prompts into executable code, and a statistical backend designed to automate \ncase generation, analytical processing, and result visualization. When a user submits a \nquestion in plain English, the system identifies the analytical intent, applies relevant \nfilters to harmonized clinical-genomic datasets, and generates a suite of outputs—\nincluding survival analyses, mutation frequencies, odds ratios, and explanatory text \nsummaries tailored to the context of the query (Figure 1). \n \nData Sources and Preparation for AI-HOPE-TGFbeta \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \nTo power its analyses, AI-HOPE-TGFbeta draws from harmonized CRC datasets \nderived from public repositories such as The Cancer Genome Atlas (TCGA) and \ncBioPortal, with a targeted focus on genes implicated in TGF-β signaling. Key genomic \nfeatures include alterations in SMAD4, TGFBR1, TGFBR2, BMPR1A, BMPR2, \nACVR1B, and BMP7. The accompanying clinical metadata encompass a broad array of \nattributes—patient age, disease stage, treatment history (including FOLFOX exposure), \nmicrosatellite instability (MSI) classification, ethnicity, tumor tissue origin (primary \nversus metastatic), and overall survival metrics. Raw data underwent extensive \npreprocessing to ensure analytical compatibility: files were converted into standardized, \ntab-delimited matrices with harmonized sample identifiers, and ontology-based \nframeworks such as OncoTree and the Disease Ontology were applied to unify clinical \nannotations. Mutation data were cross-validated across sources, and all TGF-β pathway \ngene sets were curated using publicly available knowledgebases to ensure accuracy \nand biological relevance. \n \nConversational Query Handling and Cohort Definition in AI-HOPE-TGFbeta \n \nAI-HOPE-TGFbeta enables users to initiate complex clinical-genomic analyses using \nnatural language inputs. Queries such as “Compare survival outcomes for SMAD4-\nmutated versus wild-type EOCRC patients treated with FOLFOX” or “Evaluate TGFBR1 \nmutation prevalence between H/L and non-Hispanic White (NHW) individuals” are \ninterpreted by a built-in large language model (LLM) based on the LLaMA 3 \narchitecture. This LLM translates conversational prompts into executable code that \nfilters datasets, defines cohorts, and launches the appropriate statistical analyses. \nWhen necessary, the system prompts the user for clarification to resolve ambiguity and \nensure accurate query interpretation. AI-HOPE-TGFbeta accommodates a wide range \nof stratification parameters, including genetic mutation status, microsatellite instability \n(MSI), tumor stage, race/ethnicity, and chemotherapy exposure, allowing users to \nflexibly define custom subgroups for targeted analysis. \n \nAnalytical Framework and Statistical Methods in AI-HOPE-TGFbeta \n \nAI-HOPE-TGFbeta’s analytical engine is powered by a Python-based bioinformatics \nworkflow that supports a comprehensive suite of statistical methods tailored for clinical-\ngenomic analysis. Categorical variables are evaluated using either chi-square or \nFisher’s exact tests, with odds ratios and corresponding 95% confidence intervals \ncalculated to quantify associations. For survival-related outcomes, the system \nimplements Kaplan-Meier estimations and log-rank tests to compare groups, while \nmultivariable Cox proportional hazards regression is available to adjust for confounding \nvariables in time-to-event analyses. The platform also includes specialized modules for \nexamining TGF-β pathway enrichment, identifying co-mutation patterns, and performing \nstratified survival analysis. Users can conduct subgroup comparisons across a variety of \ndimensions, including age groups (<50 vs. ≥50 years), racial and ethnic backgrounds \n(e.g., H/L vs. NHW), tumor sample type (primary vs. metastatic), and microsatellite \ninstability (MSI) status. \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \nPlatform Design and Validation Strategy \n \nAI-HOPE-TGFbeta was engineered with a strong emphasis on analytical rigor and \nreproducibility. At its core, the platform integrates a retrieval-augmented generation \n(RAG) mechanism that continuously references a structured biomedical knowledge \nbase to enhance the contextual accuracy of its outputs and reduce the likelihood of AI-\ngenerated errors or hallucinations. The system applies schema-guided prompting to \nstandardize how queries are interpreted and how results are formatted, ensuring \nconsistency across diverse analyses. To assess the reliability of the platform, we \nvalidated its performance by successfully reproducing known clinical-genomic \nrelationships from prior studies involving SMAD4, BMPR1A, and TGFBR2 in EOCRC [6, \n7], including stage-specific survival outcomes and mutation frequency disparities across \npatient populations. \n \nUsability Evaluation and Comparative Benchmarking \n \nTo assess the usability and performance of AI-HOPE-TGFbeta, we conducted a \ncomparative analysis against established platforms, including cBioPortal and UCSC \nXena. Evaluation criteria focused on speed of task execution, consistency of analytical \noutput, and flexibility in constructing complex, stratified cohort queries. Benchmark tasks \nincluded identifying EOCRC patients with SMAD4 mutations stratified by treatment \nstatus, generating Kaplan-Meier survival curves based on MSI subtypes, and analyzing \nTGFBR1 mutation frequency across racial and ethnic groups. Across all scenarios, AI-\nHOPE-TGFbeta outperformed existing tools in both response time and user interaction \nefficiency—particularly in handling intersectional analyses that required integration of \nclinical, genomic, and demographic filters. \n \nVisualization Capabilities and Exportable Results \n \nUpon completion of each analysis, AI-HOPE-TGFbeta produces a suite of high-quality \nvisual and tabular outputs designed for immediate interpretation and downstream \napplication. These include Kaplan-Meier survival curves, forest plots, mutation \nheatmaps, and summary data tables—each rendered using backend libraries such as \nMatplotlib and Plotly to ensure visual clarity and consistency. In addition to graphical \nelements, the system generates narrative summaries that interpret statistical findings \nwithin the context of existing TGF-β pathway literature. All outputs can be downloaded \nin formats suitable for publication, presentation, or integration into clinical decision-\nmaking workflows. \n \nResults \n \nBy converting user-generated natural language inputs into fully automated clinical-\ngenomic workflows, AI-HOPE-TGFbeta enables on-demand analysis of TGF-β signaling \ndisruptions in CRC. Its interactive conversational design allows users to define custom \ncohorts based on variables such as age, tumor stage, microsatellite instability (MSI) \nclassification, mutational status, treatment exposure, and racial or ethnic background. \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \nThe system then performs statistical evaluations—generating Kaplan-Meier survival \ncurves, odds ratio calculations, and corresponding visual outputs—with no additional \ncoding required. In both validation and discovery-focused queries, AI-HOPE-TGFbeta \nconsistently reproduced established associations and revealed new insights related to \nEOCRC, treatment efficacy, and pathway-specific biomarker patterns. \n \nIn validation ancestry-stratified analyses, AI-HOPE-TGFbeta identified a potential \ndisparity in the frequency of BMPR1A mutations among EOCRC patients across ethnic \ngroups (Figure 2). Specifically, the platform revealed that 4.58% of EOCRC h/l patients \nharbored BMPR1A mutations, compared to 1.79% of EOCRC NHW patients. This \ndifference translated to an odds ratio of 2.63 (95% CI: [1.093, 6.327]; p = 0.052), \nsuggesting that BMPR1A mutations were more than twice as likely to occur in the H/L \nEOCRC population. Although the association narrowly missed conventional thresholds \nfor statistical significance, these findings underscore the potential of AI-HOPE-TGFbeta \nto uncover emerging ancestry-linked molecular patterns that may otherwise be \noverlooked. Importantly, this analysis highlights the need for broader inclusion of racially \nand ethnically diverse populations in genomic studies to validate and extend these \nobservations. \n \nIn ancestry-specific survival analyses, AI-HOPE-TGFbeta evaluated the prognostic \nimpact of TGF-β pathway alterations in EOCRC among H/L patients (Figure S1). The \nplatform stratified EOCRC HL cases by mutation status in key TGF-β signaling genes, \nincluding SMAD4, TGFBR2, and BMPR1A. The case cohort consisted of 48 patients \nwith TGF-β pathway alterations (0.9% of the dataset), while the control cohort included \n105 patients without such mutations (1.9%). Kaplan-Meier survival analysis revealed no \nstatistically significant difference in overall survival between the two groups (p = \n0.8631), suggesting that TGF-β pathway mutations may not independently influence \nprognosis in EOCRC HL under current sample sizes. Despite the lack of significance, \nthis result underscores the value of AI-HOPE-TGFbeta in enabling fine-grained \nsubgroup analyses and generating hypotheses about context-dependent effects. The \nfindings also highlight the need for larger, ancestry-specific datasets to more definitively \nassess the clinical relevance of TGF-β signaling alterations in diverse EOCRC \npopulations. \n \nIn exploratory analyses, AI-HOPE-TGFbeta reproduced a key finding from published \nTGF-β literature regarding the prognostic relevance of SMAD4 mutations in EOCRC \npatients treated with FOLFOX chemotherapy (Figure 3). Using a natural language \nquery, the system stratified EOCRC patients (<50 years old) by SMAD4 mutation status \nand assessed treatment outcomes following FOLFOX (fluorouracil, leucovorin, and \noxaliplatin) administration. The case cohort included 188 SMAD4-mutated patients \n(3.4% of the dataset), while the control cohort included 1,066 SMAD4 wild-type patients \n(19.2%). Kaplan-Meier survival analyses revealed that SMAD4-mutated patients \nexhibited significantly worse overall and progression-free survival compared to wild-type \ncases (p = 0.0001 for both), consistent with prior reports linking SMAD4 loss to \nchemoresistance and aggressive tumor biology in EOCRC. These results highlight the \nability of AI-HOPE-TGFbeta to recapitulate known genotype-treatment-outcome \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \nrelationships and underscore the clinical importance of SMAD4 as a biomarker of poor \nprognosis in young CRC patients undergoing standard chemotherapy. \n \nAI-HOPE-TGFbeta also enabled exploratory ethnicity-specific analysis of TGFBR1 \nmutation patterns in CRC patients (Figure 4). This analysis compared TGFBR1-mutated \nH/Lpatients (case cohort, n = 11) to TGFBR1-mutated NHW patients (control cohort, n = \n79), highlighting the platform’s capacity to support disaggregated investigations despite \nsample imbalances. Although H/L individuals accounted for only 6.4% of the full \ndataset, AI-HOPE-TGFbeta successfully isolated a sufficient number of cases to \nperform comparative statistical analyses. Odds ratio testing, stratified by early-onset \nage (<50 years), yielded a value of 1.029 (95% CI: [0.563, 7.134], p = 0.454), \nsuggesting no significant difference in the mutation enrichment context across ethnic \ngroups. Kaplan-Meier survival curves similarly showed no statistically significant \ndifference in overall survival (p = 0.3561), despite apparent visual divergence between \ncurves. These findings reinforce the underrepresentation of H/L populations in existing \ngenomic datasets and underscore the potential of AI-HOPE-TGFbeta to enable focused \npopulation-level queries that can guide future efforts toward equity-driven precision \noncology. \n \nFurther analysis using AI-HOPE-TGFbeta revealed clinically significant associations \nbetween TGFBR2 mutation status and tumor stage in CRC patients (Figure 5). The \nplatform stratified TGFBR2-mutated cases into early-stage (Stage I–III) and late-stage \n(Stage IV) cohorts to assess the prognostic impact of disease stage in the context of \nTGF-β pathway disruption. Among the 307 TGFBR2-mutated patients analyzed, those \nwith early-stage disease (n = 235) exhibited markedly improved overall survival \ncompared to their late-stage counterparts (n = 72), with Kaplan-Meier analysis yielding a \nhighly significant p-value (p = 0.0000). Additionally, a 2×2 odds ratio analysis evaluating \nFOLFOX chemotherapy exposure revealed that early-stage patients were significantly \nmore likely to have received standard treatment (OR = 0.155, 95% CI: [0.082, 0.294], p \n= 0.000), suggesting potential treatment-related differences contributing to improved \noutcomes. These findings underscore the prognostic relevance of tumor stage among \nTGFBR2-mutated CRC patients and highlight AI-HOPE-TGFbeta’s capacity to integrate \nclinical and genomic variables for nuanced outcome stratification, supporting its use in \nguiding precision medicine strategies. \n \nAI-HOPE-TGFbeta was used to assess the prognostic significance of microsatellite \ninstability (MSI) status among SMAD4-mutated CRC patients (Figure S2). In this \nanalysis, patients were stratified by MSI phenotype, comparing those with MSI-high \n(Instable) tumors to those with MSI-stable counterparts. The case cohort included 78 \nSMAD4-mutated patients with MSI-Instable tumors (1.4% of the dataset), while the \ncontrol cohort comprised 710 SMAD4-mutated patients with MSI-Stable tumors \n(12.8%). Kaplan-Meier survival analysis revealed that MSI-Instable patients had \nsignificantly better overall survival than MSI-Stable patients (p = 0.00001), with clearly \ndivergent survival curves and non-overlapping 95% confidence intervals. This finding \nsuggests a potential protective interaction between MSI-associated immunogenicity and \nSMAD4 pathway disruption, supporting the clinical relevance of combining genomic and \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \nmolecular features in CRC prognosis. Moreover, the result highlights the utility of AI-\nHOPE-TGFbeta in uncovering context-dependent biomarker interactions that may \ninform immunotherapy stratification and precision treatment strategies. \n \nFinally, AI-HOPE-TGFbeta was employed to evaluate the prognostic relevance of tumor \nsample type in CRC patients harboring SMAD2 mutations (Figure S3). The platform \nstratified patients by tumor origin—primary versus metastatic—within the SMAD2-\nmutant cohort to assess survival differences across disease progression stages. The \ncase cohort included 209 patients with SMAD2-mutant primary tumors (3.8% of the \ndataset), while the control cohort consisted of 48 patients with SMAD2-mutant \nmetastatic tumors (0.9%). Kaplan-Meier survival analysis revealed significantly better \noverall survival in patients with primary tumors compared to those with metastatic \nlesions (p = 0.0010), with clear separation of survival curves and non-overlapping 95% \nconfidence intervals. This result supports prior evidence linking TGF-β signaling \ndysregulation to metastatic progression and underscores the clinical importance of \ntumor origin in prognostic modeling. Notably, this analysis highlights the strength of AI-\nHOPE-TGFbeta in dissecting context-specific molecular subgroups and advancing \nprecision oncology through AI-enabled stratification. \n \nTogether, these findings demonstrate the versatility and analytical power of AI-HOPE-\nTGFbeta in uncovering both validated and novel insights into TGF-β pathway alterations \nacross CRC subtypes and populations. By translating natural language prompts into \nexecutable clinical-genomic workflows, the platform enabled real-time, interpretable \nanalyses incorporating key variables such as age, tumor stage, MSI status, mutation \nprofiles, treatment exposure, and race/ethnicity. AI-HOPE-TGFbeta consistently \nrecapitulated known prognostic associations—such as SMAD4-driven chemoresistance \nand stage-specific TGFBR2 outcomes—while also identifying emerging patterns, \nincluding ancestry-linked BMPR1A disparities and context-dependent survival modifiers \nlike MSI status and tumor origin. These results highlight the potential of conversational \nAI to democratize integrative bioinformatics, support equity-driven investigations, and \naccelerate precision medicine through scalable, dynamic cohort interrogation and \nhypothesis generation. \n \n \nDiscussion \n \nAI-HOPE-TGFbeta represents a paradigm shift in precision oncology, offering a novel \nconversational artificial intelligence (AI) platform that enables real-time, natural \nlanguage–driven interrogation of TGF-β signaling dysregulation in CRC. By translating \nuser-defined prompts into rigorous, reproducible analyses that integrate genomic and \nclinical variables, the system addresses longstanding limitations in accessibility, \nusability, and stratified data exploration. Unlike conventional bioinformatics platforms \nthat often require complex scripting or multi-step workflows, AI-HOPE-TGFbeta \nstreamlines the analytical process, allowing researchers and clinicians—even those \nwithout programming expertise—to formulate and execute pathway-centric, population-\nspecific hypotheses with minimal friction. \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \n \nThe TGF-β signaling pathway is a central regulator of CRC progression, influencing \nprocesses such as epithelial-to-mesenchymal transition (EMT), immune evasion, and \nmetastasis. Mutations in TGF-β pathway genes—such as SMAD4, TGFBR2, \nand BMPR1A—are well-documented markers of poor prognosis and therapeutic \nresistance, particularly in EOCRC, which is rising at alarming rates in young adults and \nunderserved populations. Despite this clinical importance, integrative analysis of TGF-β \nalterations has been hindered by the fragmentation of clinical-genomic data, \nunderrepresentation of diverse populations, and the technical inaccessibility of \ntraditional analysis pipelines. AI-HOPE-TGFbeta was developed to close these gaps, \nempowering users to interrogate TGF-β dysregulation across molecular and \ndemographic contexts with unprecedented ease. \n \nA core strength of AI-HOPE-TGFbeta lies in its ability to validate known associations \nwhile surfacing novel insights. In this study, the platform successfully recapitulated key \nfindings from the TGF-β literature. These included the significantly worse overall and \nprogression-free survival observed in SMAD4-mutated EOCRC patients treated with \nFOLFOX chemotherapy, and the markedly better outcomes among early-\nstage TGFBR2-mutated patients compared to their late-stage counterparts. These \nresults not only confirmed the accuracy of AI-HOPE-TGFbeta’s analytic engine but also \nhighlighted its potential for reinforcing known clinical-genomic relationships in treatment \nstratification and prognosis modeling. \n \nAI-HOPE-TGFbeta also enabled hypothesis-driven, population-disaggregated analyses \nthat are critical for advancing health equity in cancer genomics. Through natural \nlanguage queries, the platform identified a potential disparity in the frequency \nof BMPR1A mutations among H/L EOCRC patients relative to their NHW \ncounterparts—an observation that approached statistical significance and may reflect \nunique molecular etiologies in underrepresented groups. Similarly, the system allowed \nfor survival analysis of TGFBR1-mutated CRC patients by ethnicity, demonstrating the \nplatform’s flexibility in handling small cohort comparisons and highlighting the persistent \nunderrepresentation of minority populations in genomic datasets. These findings \nunderscore the urgent need for inclusive datasets and the value of AI systems like AI-\nHOPE-TGFbeta that support such investigations despite cohort size limitations. \n \nBeyond ancestry and ethnicity, the platform uncovered clinically actionable interactions \nbetween TGF-β pathway genes and molecular or histopathological features. For \nexample, among SMAD4-mutated tumors, those with MSI-high status exhibited \nsignificantly better survival than MSI-stable counterparts. This suggests a potentially \nprotective immunologic interaction between MSI and TGF-β pathway disruption—an \nobservation that may have implications for immunotherapy response prediction in CRC. \nLikewise, AI-HOPE-TGFbeta identified a strong prognostic benefit for patients \nwith SMAD2-mutant primary tumors compared to those with metastatic lesions, \nreinforcing the relevance of tumor origin in outcome prediction and supporting the \ngrowing recognition of spatial tumor context in clinical decision-making. \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \nFrom a technical perspective, AI-HOPE-TGFbeta offers a uniquely powerful platform \nbuilt on LLMs, a RAG engine, and harmonized clinical-genomic data. The system \nintegrates structured biomedical ontologies to ensure accurate cohort definitions and \ninterpretable outputs. Benchmarking results revealed that AI-HOPE-TGFbeta \noutperforms widely used tools such as cBioPortal and UCSC Xena in execution speed, \nsubgroup flexibility, and multidimensional filtering—particularly for complex queries \ninvolving intersectional factors like age, race/ethnicity, MSI subtype, tumor stage, and \ntreatment exposure. These performance advantages position the platform as a scalable, \nnext-generation solution for precision oncology. \n \nNevertheless, there are important areas for continued development. Expanding the \nplatform to incorporate additional omics layers—including transcriptomics, proteomics, \nand spatial data—would enable deeper mechanistic insight into TGF-β–driven tumor \nbiology. Integration with federated learning frameworks and secure, privacy-preserving \ndata environments will be essential for real-world clinical deployment, especially in \nmulti-institutional settings where patient-level data must remain decentralized. Further, \ncomparative evaluations against other AI-powered bioinformatics agents are needed to \nassess the generalizability of AI-HOPE-TGFbeta beyond CRC and the TGF-β pathway, \npaving the way for a modular suite of disease- and pathway-specific AI agents. \n \nFinally, while AI-HOPE-TGFbeta was designed to lower the barriers to entry for \nresearchers working at the intersection of genomics and health disparities, broader \nefforts to support training, community engagement, and interdisciplinary collaboration \nwill be key to maximizing its impact. The platform is not a substitute for diverse data \ngeneration, but rather a catalyst for extracting meaningful insights from the data that \nalready exist—highlighting the need for ongoing investment in both algorithmic \ninnovation and inclusive data science. \n \n \nConclusion \n \nIn conclusion, AI-HOPE-TGFbeta enables a new era of integrative, equitable, and \nconversational bioinformatics by uniting advanced language models with clinical-\ngenomic reasoning. It provides an intuitive and powerful tool for validating known \nassociations, identifying novel biomarkers, and generating actionable hypotheses—\nparticularly in the context of early-onset CRC and underserved patient populations. As \nprecision oncology evolves, AI-HOPE-TGFbeta exemplifies the transformative potential \nof AI not only to accelerate discovery but also to bridge the gap between data and \nbalanced health outcomes across populations. \n \n \nReferences \n1. Bhandari A, Woodhouse M, Gupta S. Colorectal cancer is a leading cause of \ncancer incidence and mortality among adults younger than 50 years in the USA: \na SEER-based analysis with comparison to other young-onset cancers. J \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \nInvestig Med. 2017 Feb;65(2):311-315. doi: 10.1136/jim-2016-000229. Epub \n2016 Nov 18. PMID: 27864324; PMCID: PMC5564445. \n2. Venugopal A, Carethers JM. Epidemiology and biology of early onset colorectal \ncancer. EXCLI J. 2022 Jan 7;21:162-182. doi: 10.17179/excli2021-4456. PMID: \n35221839; PMCID: PMC8859644. \n3. Patel SG, Karlitz JJ, Yen T, Lieu CH, Boland CR. The rising tide of early-onset \ncolorectal cancer: a comprehensive review of epidemiology, clinical features, \nbiology, risk factors, prevention, and early detection. Lancet Gastroenterol \nHepatol. 2022 Mar;7(3):262-274. doi: 10.1016/S2468-1253(21)00426-X. Epub \n2022 Jan 26. PMID: 35090605. \n4. Santucci C, Mignozzi S, Alicandro G, Pizzato M, Malvezzi M, Negri E, Jha P, La \nVecchia C. Trends in cancer mortality under age 50 in 15 upper-middle and high-\nincome countries. J Natl Cancer Inst. 2025 Apr 1;117(4):747-760. doi: \n10.1093/jnci/djae288. PMID: 39576674; PMCID: PMC11972687. \n5. Sinicrope FA. Increasing Incidence of Early-Onset Colorectal Cancer. N Engl J \nMed. 2022 Apr 21;386(16):1547-1558. doi: 10.1056/NEJMra2200869. PMID: \n35443109. \n6. Monge C, Waldrup B, Carranza FG, Velazquez-Villarreal E. Molecular \nHeterogeneity in Early-Onset Colorectal Cancer: Pathway-Specific Insights in \nHigh-Risk Populations. Cancers (Basel). 2025 Apr 15;17(8):1325. doi: \n10.3390/cancers17081325. PMID: 40282501; PMCID: PMC12026214. \n7. Monge C, Waldrup B, Carranza FG, Velazquez-Villarreal E. WNT and TGF-Beta \nPathway Alterations in Early-Onset Colorectal Cancer Among Hispanic/Latino \nPopulations. Cancers (Basel). 2024 Nov 21;16(23):3903. doi: \n10.3390/cancers16233903. PMID: 39682092; PMCID: PMC11639970. \n8. Garcia S, Pruitt SL, Singal AG, Murphy CC. Colorectal cancer incidence among \nHispanics and non-Hispanic Whites in the United States. Cancer Causes Control. \n2018 Nov;29(11):1039-1046. doi: 10.1007/s10552-018-1077-1. Epub 2018 Aug \n28. PMID: 30155605; PMCID: PMC6628724. \n9. Muller C, Ihionkhan E, Stoffel EM, Kupfer SS. Disparities in Early-Onset \nColorectal Cancer. Cells. 2021 Apr 26;10(5):1018. doi: 10.3390/cells10051018. \nPMID: 33925893; PMCID: PMC8146231. \n10. Carranza FG, Waldrup B, Jin Y, Amzaleg Y, Postel M, Craig DW, Carpten JD, \nSalhia B, Hernandez D, Gutierrez N, Ricker CN, Culver JO, Chavez CE, Stern \nMC, Baezconde-Garbanati L, Lenz HJ, Velazquez-Villarreal E. Assessment of \nMYC Gene and WNT Pathway Alterations in Early-Onset Colorectal Cancer \nAmong Hispanic/Latino Patients Using Integrated Multi-Omics Approaches. \nmedRxiv [Preprint]. 2025 Feb 22:2024.12.05.24318588. doi: \n10.1101/2024.12.05.24318588. PMID: 40034762; PMCID: PMC11875251. \n11. Lieu CH, Golemis EA, Serebriiskii IG, Newberg J, Hemmerich A, Connelly C, \nMessersmith WA, Eng C, Eckhardt SG, Frampton G, Cooke M, Meyer JE. \nComprehensive Genomic Landscapes in Early and Later Onset Colorectal \nCancer. Clin Cancer Res. 2019 Oct 1;25(19):5852-5858. doi: 10.1158/1078-\n0432.CCR-19-0899. Epub 2019 Jun 26. PMID: 31243121; PMCID: \nPMC6774873. \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \n12. Tang J, Peng W, Tian C, Zhang Y, Ji D, Wang L, Jin K, Wang F, Shao Y, Wang \nX, Sun Y. Molecular characteristics of early-onset compared with late-onset \ncolorectal cancer: a case controlled study. Int J Surg. 2024 Aug 1;110(8):4559-\n4570. doi: 10.1097/JS9.0000000000001584. PMID: 38742845; PMCID: \nPMC11326018. \n13. Antelo M, Balaguer F, Shia J, Shen Y, Hur K, Moreira L, Cuatrecasas M, Bujanda \nL, Giraldez MD, Takahashi M, Cabanne A, Barugel ME, Arnold M, Roca EL, \nAndreu M, Castellvi-Bel S, Llor X, Jover R, Castells A, Boland CR, Goel A. A \nhigh degree of LINE-1 hypomethylation is a unique feature of early-onset \ncolorectal cancer. PLoS One. 2012;7(9):e45357. doi: \n10.1371/journal.pone.0045357. Epub 2012 Sep 25. PMID: 23049789; PMCID: \nPMC3458035. \n14. Alshenaifi JY, Vetere G, Maddalena G, Yousef M, White MG, Shen JP, Vilar E, \nParseghian C, Dasari A, Morris VK, Huey R, Overman MJ, Wolff R, Raghav KP, \nWillis J, Alfaro K, Futreal A, You YN, Kopetz S. Mutational and co-mutational \nlandscape of early onset colorectal cancer. Biomarkers. 2025 Feb;30(1):64-76. \ndoi: 10.1080/1354750X.2024.2447089. Epub 2025 Jan 9. PMID: 39761813; \nPMCID: PMC11856746. \n15. Papavassiliou KA, Delle Cave D, Papavassiliou AG. Targeting the TGF-β \nSignaling Axis in Metastatic Colorectal Cancer: Where Do We Stand? Int J Mol \nSci. 2023 Dec 4;24(23):17101. doi: 10.3390/ijms242317101. PMID: 38069421; \nPMCID: PMC10706985. \n16. Koveitypour Z, Panahi F, Vakilian M, Peymani M, Seyed Forootan F, Nasr \nEsfahani MH, Ghaedi K. Signaling pathways involved in colorectal cancer \nprogression. Cell Biosci. 2019 Dec 2;9:97. doi: 10.1186/s13578-019-0361-4. \nPMID: 31827763; PMCID: PMC6889432. \n17. Li X, Wu Y, Tian T. TGF-β Signaling in Metastatic Colorectal Cancer (mCRC): \nFrom Underlying Mechanism to Potential Applications in Clinical Development. \nInt J Mol Sci. 2022 Nov 20;23(22):14436. doi: 10.3390/ijms232214436. PMID: \n36430910; PMCID: PMC9698504. \n18. Laskar RS, Qu C, Huyghe JR, Harrison T, Hayes RB, Cao Y, Campbell PT, \nSteinfelder R, Talukdar FR, Brenner H, et al. Genome-wide association studies \nand Mendelian randomization analyses provide insights into the causes of early-\nonset colorectal cancer. Ann Oncol. 2024 Jun;35(6):523-536. doi: \n10.1016/j.annonc.2024.02.008. Epub 2024 Feb 24. PMID: 38408508; PMCID: \nPMC11213623. \n19. Li Q, Geng S, Luo H, Wang W, Mo YQ, Luo Q, Wang L, Song GB, Sheng JP, Xu \nB. Signaling pathways involved in colorectal cancer: pathogenesis and targeted \ntherapy. Signal Transduct Target Ther. 2024 Oct 7;9(1):266. doi: \n10.1038/s41392-024-01953-7. PMID: 39370455; PMCID: PMC11456611. \n20. Cancer Genome Atlas Network. Comprehensive molecular characterization of \nhuman colon and rectal cancer. Nature. 2012 Jul 18;487(7407):330-7. doi: \n10.1038/nature11252. PMID: 22810696; PMCID: PMC3401966. \n21. Cerami E, Gao J, Dogrusoz U, Gross BE, Sumer SO, Aksoy BA, Jacobsen A, \nByrne CJ, Heuer ML, Larsson E, Antipin Y, Reva B, Goldberg AP, Sander C, \nSchultz N. The cBio cancer genomics portal: an open platform for exploring \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \nmultidimensional cancer genomics data. Cancer Discov. 2012 May;2(5):401-4. \ndoi: 10.1158/2159-8290.CD-12-0095. Erratum in: Cancer Discov. 2012 \nOct;2(10):960. PMID: 22588877; PMCID: PMC3956037. \n22. Goldman MJ, Craft B, Hastie M, Repečka K, McDade F, Kamath A, Banerjee A, \nLuo Y, Rogers D, Brooks AN, Zhu J, Haussler D. Visualizing and interpreting \ncancer genomics data via the Xena platform. Nat Biotechnol. 2020 \nJun;38(6):675-678. doi: 10.1038/s41587-020-0546-8. PMID: 32444850; PMCID: \nPMC7386072. \n23. Chen Q, Hu Y, Peng X, Xie Q, Jin Q, Gilson A, Singer MB, Ai X, Lai PT, Wang Z, \nKeloth VK, Raja K, Huang J, He H, Lin F, Du J, Zhang R, Zheng WJ, Adelman \nRA, Lu Z, Xu H. Benchmarking large language models for biomedical natural \nlanguage processing applications and recommendations. Nat Commun. 2025 \nApr 6;16(1):3280. doi: 10.1038/s41467-025-56989-2. PMID: 40188094; PMCID: \nPMC11972378. \n24. Singhal K, Tu T, Gottweis J, Sayres R, Wulczyn E, Amin M, Hou L, Clark K, Pfohl \nSR, Cole-Lewis H, et al. Toward expert-level medical question answering with \nlarge language models. Nat Med. 2025 Mar;31(3):943-950. doi: 10.1038/s41591-\n024-03423-7. Epub 2025 Jan 8. PMID: 39779926; PMCID: PMC11922739. \n25. Manojlovic Z, Christofferson A, Liang WS, Aldrich J, Washington M, Wong S, \nRohrer D, Jewell S, Kittles RA, Derome M, Auclair D, Craig DW, Keats J, \nCarpten JD. Comprehensive molecular profiling of 718 Multiple Myelomas \nreveals significant differences in mutation frequencies between African and \nEuropean descent cases. PLoS Genet. 2017 Nov 22;13(11):e1007087. doi: \n10.1371/journal.pgen.1007087. PMID: 29166413; PMCID: PMC5699827. \n26. Xiao J, Yu X, Meng F, Zhang Y, Zhou W, Ren Y, Li J, Sun Y, Sun H, Chen G, He \nK, Lu L. Integrating spatial and single-cell transcriptomics reveals tumor \nheterogeneity and intercellular networks in colorectal cancer. Cell Death Dis. \n2024 May 10;15(5):326. doi: 10.1038/s41419-024-06598-6. PMID: 38729966; \nPMCID: PMC11087651. \n27. Monge C, Waldrup B, Carranza FG, Velazquez-Villarreal E. Molecular Alterations \nin TP53, WNT, PI3K, TGF-Beta, and RTK/RAS Pathways in Gastric Cancer \nAmong Ethnically Heterogeneous Cohorts. Cancers (Basel). 2025 Mar \n23;17(7):1075. doi: 10.3390/cancers17071075. PMID: 40227587; PMCID: \nPMC11987813. \n28. Monge C, Waldrup B, Carranza FG, Velazquez-Villarreal E. Comparative \nGenomic Analysis of Key Oncogenic Pathways in Hepatocellular Carcinoma \nAmong Diverse Populations. Cancers (Basel). 2025 Apr 13;17(8):1309. doi: \n10.3390/cancers17081309. PMID: 40282485; PMCID: PMC12025884. \n29. Carranza FG, Diaz FC, Ninova M, Velazquez-Villarreal E. Current state and \nfuture prospects of spatial biology in colorectal cancer. Front Oncol. 2024 Dec \n3;14:1513821. doi: 10.3389/fonc.2024.1513821. PMID: 39711954; PMCID: \nPMC11660798. \n30. Velazquez-Villarreal EI, Maheshwari S, Sorenson J, Fiddes IT, Kumar V, Yin Y, \nWebb MG, Catalanotti C, Grigorova M, Edwards PA, Carpten JD, Craig DW. \nSingle-cell sequencing of genomic DNA resolves sub-clonal heterogeneity in a \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \nmelanoma cell line. Commun Biol. 2020 Jun 25;3(1):318. doi: 10.1038/s42003-\n020-1044-8. PMID: 32587328; PMCID: PMC7316972. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \n \nFigure 1. Overview of AI-HOPE-TGFbeta Workflow. This figure illustrates the end-to-\nend workflow of AI-HOPE-TGFbeta, a conversational AI system developed to \ninvestigate TGF-β pathway dysregulation in colorectal cancer (CRC) through natural \nlanguage–guided, integrative bioinformatics. a) Users interact with the system using \nnatural language queries, such as assessing the survival outcomes of CRC patients \nwith SMAD4 mutations or comparing BMPR1A mutation prevalence between early-\nonset Hispanic/Latino (H/L) and non-Hispanic White (NHW) patients. b) The input is \ninterpreted through a graphical user interface (GUI) powered by a large language model \n(LLM), which converts user intent into executable code and applies relevant filters for \npatient subgroups, clinical stage, or treatment regimen. c) AI-HOPE-TGFbeta interfaces \nwith harmonized clinical and genomic datasets from resources such as TCGA and \ncBioPortal, focusing on key genes in the TGF-β pathway—including SMAD4, BMPR1A, \nTGFBR2, TGFB1, and BMP7. d) The platform performs automated statistical \nanalyses—such as Kaplan-Meier survival estimation, mutation frequency comparisons, \nand odds ratio testing—generating both visual and textual outputs. \n \n \n \n \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \n \n \n \n \nFigure 2. AI-HOPE-TGFbeta Analysis of BMPR1A Mutations in Early-Onset \nColorectal Cancer (EOCRC) among Hispanic/Latino (H/L) vs. Non-Hispanic White \n(NHW) Patients. a) Pie charts display the distribution of selected samples from the \noverall dataset following the application of query filters. The case cohort includes 153 \nEOCRC H/L patients (<50 years old, H/L ethnicity), representing 2.8% of the queried \npopulation. The control cohort includes 1,117 EOCRC NHW patients (<50 years old, \nWhite race, Non-Hispanic ethnicity), accounting for 20.2% of the filtered samples. b) A \n2×2 odds ratio analysis compares the frequency of BMPR1A mutations between the \ncase and control cohorts within the context of early-onset disease. The stacked bar plot \nshows the distribution of in-context (mutation present) and out-of-context (mutation \nabsent) samples in each group. BMPR1A mutations were present in 4.58% of H/Lcases \nand 1.79% of NHW controls. The odds ratio was 2.63 (95% CI: 1.093–6.327), with a p-\nvalue of 0.052, suggesting that BMPR1A mutations are over two and a half times more \nlikely in the H/L EOCRC population. \n \n \n \n \n \n \n \n \n \n \n \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \n \n \nFigure 3. AI-HOPE-TGFbeta Analysis of Early-Onset Colorectal Cancer (EOCRC) \nPatients Treated with FOLFOX Stratified by SMAD4 Mutation Status. This figure \npresents the output of a natural language query executed via AI-HOPE-TGFbeta, \ninvestigating the association between SMAD4 mutation status and survival outcomes \namong EOCRC patients treated with FOLFOX chemotherapy (Fluorouracil, Leucovorin, \nOxaliplatin). a) A histogram displays the age distribution for the full cohort (mean: 57.92 \nyears), contextualizing the selection of patients under age 50 as EOCRC cases. b) Pie \ncharts illustrate the selected sample distributions. The case cohort (SMAD4-mutated) \nincludes 188 patients (3.4%) from a total of 5543, while the control cohort (SMAD4 wild-\ntype) comprises 1066 patients (19.2%). These charts visualize the proportional \nrepresentation of each group within the broader dataset. c) Kaplan-Meier survival \nanalyses comparing overall survival and progression-free survival between SMAD4-\nmutated and wild-type EOCRC patients reveal significantly worse outcomes in the \nSMAD4-mutated group (p = 0.0001 for both endpoints), suggesting SMAD4 mutations \nmay confer treatment resistance or more aggressive disease behavior in young patients \nreceiving standard FOLFOX therapy. \n \n \n \n \n \n \n \n \n \n \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \n \n \nFigure 4. AI-HOPE-TGFbeta Analysis of TGFBR1-Mutated Colorectal Cancer \n(CRC) in Hispanic/Latino (H/L) vs. Non-Hispanic White (NHW) Patients. This figure \ndemonstrates the use of AI-HOPE-TGFbeta to examine ethnicity-specific patterns in \nCRC patients with TGFBR1 mutations. The analysis compares H/L individuals (case \ncohort) to NHW individuals (control cohort), all of whom carry TGFBR1 mutations. \na) The initial panel displays the distribution of ethnicities in the full dataset. H/L \nindividuals (X1) account for 6.4% of samples (n=357), while NHW individuals (X0) make \nup the majority (89.0%, n=4993). Both absolute counts and relative percentages are \nshown to contextualize the underrepresentation of H/L patients. b) Pie charts \nsummarize the number of selected samples after applying the query filters. The case \ncohort includes 11 samples (0.2% of the dataset) and the control cohort includes 79 \nsamples (1.4%), indicating that TGFBR1-mutated H/L CRC cases are rare but \nanalyzable using the platform. c) A 2x2 odds ratio analysis contextualized by age (less \nthan 50) compares the enrichment of in-context samples (defined by full query \nconditions) between the two cohorts. A stacked bar plot shows the distribution of in-\ncontext and out-of-context cases. The odds ratio is 1.029 with a 95% confidence interval \nof [0.563, 7.134], and a p-value of 0.454, suggesting no statistically significant \ndifference in age-stratified mutation context under current sample sizes. d) Kaplan-\nMeier survival curves compare overall survival between the case and control groups. \n \n \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \n \n \n \nFigure 5. AI-HOPE-TGFbeta Analysis of TGFBR2-Mutated Colorectal Cancer \n(CRC) by Tumor Stage: Early (Stage I–III) vs. Late (Stage IV). This figure showcases \nthe use of AI-HOPE-TGF-- to investigate survival and enrichment patterns among CRC \npatients with TGFBR2 mutations, stratified by tumor stage. The analysis compares \nearly-stage (Stage I–III) and late-stage (Stage IV) patients to evaluate how disease \nstage influences survival outcomes in the context of TGFBR2 pathway alterations. \na) Bar plots depict the distribution of tumor stages across the dataset. Patients with \nStage I–III tumors account for 57.2% of the cohort (n=3171), while Stage IV tumors \nmake up 42.8% (n=2372), providing context for defining early vs. late disease. b) Pie \ncharts summarize the sample selection following the user-defined query. The case \ncohort (TGFBR2-mutated patients with Stage I–III disease) includes 235 samples (4.2% \nof the total dataset), while the control cohort (TGFBR2-mutated patients with Stage IV \ndisease) includes 72 samples (1.3%). c) A 2x2 odds ratio test is performed using \nchemotherapy exposure (Fluorouracil, Leucovorin, Oxaliplatin) as a contextual filter. \nThe stacked bar plot visualizes the proportion of in-context and out-of-context samples \nin each group. The odds ratio is 0.155 with a 95% confidence interval of [0.082, 0.294], \nand a p-value of 0.0001, indicating a statistically significant enrichment of treatment \ncontext among early-stage TGFBR2-mutated patients. d) Kaplan-Meier survival curves \ncompare overall survival between the case and control cohorts. \n \n \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure S1. AI-HOPE-TGFbeta Analysis of TGF-β Pathway Alterations in Early-\nOnset Colorectal Cancer (EOCRC) Among Hispanic/Latino (H/L) Patients. \nThis figure demonstrates the use of AI-HOPE-TGFbeta to investigate overall survival in \nEOCRC HL patients stratified by TGF-β pathway alteration status. The case cohort \nincludes EOCRC HL patients harboring mutations in key TGF-β pathway genes (e.g., \nSMAD4, TGFBR2, BMPR1A), while the control cohort includes EOCRC HL patients \nwithout such alterations. a) Pie charts summarize the selection process from the total \ndataset. The case group (TGF-β–altered EOCRC HL) comprises 48 samples (0.9%), \nwhile the control group (TGF-β–unaltered EOCRC HL) includes 105 samples (1.9%), \nreflecting the relatively low frequency of TGF-β pathway mutations in this population. b) \nKaplan-Meier survival curves compare overall survival between the two groups. The x-\naxis indicates time in months, and the y-axis denotes survival probability. Shaded areas \nrepresent 95% confidence intervals. No significant difference in survival was observed \nbetween patients with and without TGF-β pathway alterations (p = 0.8631), suggesting \nthat these mutations may not independently drive prognosis in EOCRC HL under \ncurrent sample constraints. \n \n \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \n \n \nFigure S2. AI-HOPE-TGFbeta Analysis of SMAD4-Mutant Colorectal Cancer (CRC) \nPatients by Microsatellite Instability Status (MSI-High vs. MSI-Stable). This figure \nillustrates the application of AI-HOPE-TGFbeta to evaluate survival outcomes in CRC \npatients with SMAD4 mutations, stratified by microsatellite instability (MSI) status. The \ncase cohort includes patients with MSI-high (Instable) tumors, while the control cohort \nincludes patients with MSI-stable tumors. a) Bar plots summarize the dataset-wide \ndistribution of MSI subtypes. MSI-stable tumors (X0) are the most common, accounting \nfor 84.5% of samples (n=4,662), followed by MSI-instability (X1, 10.6%, n=586). The top \nchart shows absolute sample counts per MSI category, while the bottom panel displays \ntheir proportional representation. Labels were simplified for clarity, with original MSI \nvalues mapped to codes (e.g., X0 = Stable, X1 = Instable). b) Pie charts highlight the \ncohort selection process. The case group (SMAD4-mutated, MSI-Instable) includes 78 \nsamples (1.4% of the total dataset), and the control group (SMAD4-mutated, MSI-\nStable) includes 710 samples (12.8%). These charts provide visual context for the \nrelative rarity of MSI-high tumors in the SMAD4-mutant CRC population. c) Kaplan-\nMeier survival curves compare overall survival between MSI-Instable and MSI-Stable \ngroups within the SMAD4-mutated cohort. Patients with MSI-Instable tumors exhibit \nsignificantly improved survival outcomes relative to those with MSI-Stable tumors (p = \n0.0000), with a clear divergence between curves and non-overlapping 95% confidence \nintervals. \n \n \n \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint \n \nFigure S3. AI-HOPE-TGFbeta Analysis of SMAD2-Mutant Colorectal Cancer (CRC) \nPatients by Sample Type: Primary vs. Metastatic Tumors. This figure illustrates how \nAI-HOPE-TGFbeta enables survival analysis of CRC patients with SMAD2 mutations, \nstratified by tumor sample type (primary vs. metastatic) to assess clinical outcomes \nacross disease progression stages. a) The initial data exploration phase presents bar \nplots summarizing the distribution of tumor sample types. Primary tumors (X0) represent \nthe majority of samples (n=4,054; 73.1%), while metastatic tumors (X1) account for \n26.3% (n=1,457). The upper chart displays absolute counts per group, while the lower \nchart shows their relative proportions across the dataset. b) Based on the user-defined \nquery, pie charts depict the number of selected samples. The case cohort (primary \ntumor with SMAD2 mutation) includes 209 samples (3.8% of the dataset), while the \ncontrol cohort (metastatic tumor with SMAD2 mutation) includes 48 samples (0.9%). \nThese visualizations emphasize the relative prevalence of SMAD2 mutations in primary \nversus metastatic CRC. c) Kaplan-Meier survival curves compare overall survival \nbetween the case and control groups. Patients with SMAD2-mutant primary tumors \nexhibit significantly better survival than those with SMAD2-mutant metastatic tumors (p \n= 0.0010), as indicated by distinct curve separation and non-overlapping confidence \nintervals. \n . CC-BY-NC-ND 4.0 International licenseIt is made available under a \n is the author/funder, who has granted medRxiv a license to display the preprint in perpetuity. (which was not certified by peer review)\nThe copyright holder for this preprint this version posted May 21, 2025. ; https://doi.org/10.1101/2025.05.20.25327967doi: medRxiv preprint ",
  "topic": "Colorectal cancer",
  "concepts": [
    {
      "name": "Colorectal cancer",
      "score": 0.6402029991149902
    },
    {
      "name": "Transforming growth factor",
      "score": 0.5660696029663086
    },
    {
      "name": "Precision medicine",
      "score": 0.5421773195266724
    },
    {
      "name": "Traditional Chinese medicine",
      "score": 0.4257199466228485
    },
    {
      "name": "Computational biology",
      "score": 0.41441160440444946
    },
    {
      "name": "Cancer research",
      "score": 0.3903146982192993
    },
    {
      "name": "Cancer",
      "score": 0.3733544945716858
    },
    {
      "name": "Medicine",
      "score": 0.3700437545776367
    },
    {
      "name": "Biology",
      "score": 0.29281190037727356
    },
    {
      "name": "Internal medicine",
      "score": 0.2561229169368744
    },
    {
      "name": "Alternative medicine",
      "score": 0.17834559082984924
    },
    {
      "name": "Pathology",
      "score": 0.15410059690475464
    }
  ],
  "institutions": [],
  "cited_by": 5
}