{
  "title": "A protein language model for exploring viral fitness landscapes",
  "url": "https://openalex.org/W4410325217",
  "year": 2025,
  "authors": [
    {
      "id": "https://openalex.org/A5063344356",
      "name": "Jumpei Ito",
      "affiliations": [
        "The University of Tokyo"
      ]
    },
    {
      "id": "https://openalex.org/A5112946794",
      "name": "Adam Strange",
      "affiliations": [
        "The University of Tokyo"
      ]
    },
    {
      "id": "https://openalex.org/A5103212119",
      "name": "Wei Liu",
      "affiliations": [
        "SIB Swiss Institute of Bioinformatics",
        "University of Geneva",
        "The University of Tokyo"
      ]
    },
    {
      "id": "https://openalex.org/A5093891261",
      "name": "Gustav Joas",
      "affiliations": [
        "The University of Tokyo",
        "Karolinska Institutet"
      ]
    },
    {
      "id": "https://openalex.org/A5037212593",
      "name": "Spyros Lytras",
      "affiliations": [
        "MRC University of Glasgow Centre for Virus Research",
        "The University of Tokyo"
      ]
    },
    {
      "id": "https://openalex.org/A5018175091",
      "name": "Kei Sato",
      "affiliations": [
        "MRC University of Glasgow Centre for Virus Research",
        "Kumamoto University",
        "National Institute of Infectious Diseases",
        "The University of Tokyo"
      ]
    }
  ],
  "references": [
    "https://openalex.org/W1993210385",
    "https://openalex.org/W4317212025",
    "https://openalex.org/W4362609000",
    "https://openalex.org/W4281383093",
    "https://openalex.org/W3004280078",
    "https://openalex.org/W4297172779",
    "https://openalex.org/W4220908383",
    "https://openalex.org/W4293507952",
    "https://openalex.org/W4295777530",
    "https://openalex.org/W4306740332",
    "https://openalex.org/W4376223660",
    "https://openalex.org/W4376872235",
    "https://openalex.org/W4318683801",
    "https://openalex.org/W4367838604",
    "https://openalex.org/W4386618217",
    "https://openalex.org/W4386822937",
    "https://openalex.org/W4388712126",
    "https://openalex.org/W4391253039",
    "https://openalex.org/W4390548048",
    "https://openalex.org/W3206575932",
    "https://openalex.org/W4285059380",
    "https://openalex.org/W4402581472",
    "https://openalex.org/W4296211388",
    "https://openalex.org/W4392761745",
    "https://openalex.org/W4389398845",
    "https://openalex.org/W4311359167",
    "https://openalex.org/W4210665241",
    "https://openalex.org/W4390104078",
    "https://openalex.org/W3166142427",
    "https://openalex.org/W4327550249",
    "https://openalex.org/W3048714202",
    "https://openalex.org/W4403195233",
    "https://openalex.org/W3203433659",
    "https://openalex.org/W4390394037",
    "https://openalex.org/W4226443473",
    "https://openalex.org/W4400279796",
    "https://openalex.org/W4407307631",
    "https://openalex.org/W4380577051",
    "https://openalex.org/W4387540805",
    "https://openalex.org/W3121000782",
    "https://openalex.org/W4210494137",
    "https://openalex.org/W4317886130",
    "https://openalex.org/W4386878600",
    "https://openalex.org/W2952045272",
    "https://openalex.org/W4382059978",
    "https://openalex.org/W2170747616",
    "https://openalex.org/W6796581206",
    "https://openalex.org/W4391652655",
    "https://openalex.org/W2789843538",
    "https://openalex.org/W3005235420",
    "https://openalex.org/W2951878836",
    "https://openalex.org/W3200136332",
    "https://openalex.org/W4387164156",
    "https://openalex.org/W4312019047"
  ],
  "abstract": "Successively emerging SARS-CoV-2 variants lead to repeated epidemic surges through escalated fitness (i.e., relative effective reproduction number between variants). Modeling the genotype-fitness relationship enables us to pinpoint the mutations boosting viral fitness and flag high-risk variants immediately after their detection. Here, we present CoVFit, a protein language model adapted from ESM-2, designed to predict variant fitness based solely on spike protein sequences. CoVFit was trained on genotype-fitness data derived from viral genome surveillance and functional mutation assays related to immune evasion. CoVFit successively ranked the fitness of unknown future variants harboring nearly 15 mutations with informative accuracy. CoVFit identified 959 fitness elevation events throughout SARS-CoV-2 evolution until late 2023. Furthermore, we show that CoVFit is applicable for predicting viral evolution through single amino acid mutations. Our study gives insight into the SARS-CoV-2 fitness landscape and provides a tool for efficiently identifying SARS-CoV-2 variants with higher epidemic risk.",
  "full_text": "Article https://doi.org/10.1038/s41467-025-59422-w\nA protein language model for exploring viral\nﬁtness landscapes\nJumpei Ito 1,2 ,A d a mS t r a n g e1,W e iL i u1,3,4,19,G u s t a vJ o a s1,5,19,\nSpyros Lytras 1,6, The Genotype to Phenotype Japan (G2P-Japan) Consortium* &\nKei Sato 1,2,6,7,8,9\nSuccessively emerging SARS-CoV-2 variants lead to repeated epidemic surges\nthrough escalatedﬁtness (i.e., relative effective reproduction number between\nvariants). Modeling the genotype–ﬁtness relationship enables us to pinpoint\nthe mutations boosting viralﬁtness andﬂag high-risk variants immediately\nafter their detection. Here, we present CoVFit, a protein language model\nadapted from ESM-2, designed to predict variantﬁtness based solely on spike\nprotein sequences. CoVFit was trained on genotype–ﬁtness data derived from\nviral genome surveillance and functional mutation assays related to immune\nevasion. CoVFit successively ranked theﬁtness of unknown future variants\nharboring nearly 15 mutations with informative accuracy. CoVFit identiﬁed 959\nﬁtness elevation events throughout SARS-CoV-2 evolution until late 2023.\nFurthermore, we show that CoVFit is applicable for predicting viral evolution\nthrough single amino acidmutations. Our study gives insight into the SARS-\nCoV-2 ﬁtness landscape and provides a tool for efﬁciently identifying SARS-\nCoV-2 variants with higher epidemic risk.\nA primary challenge faced in controlling viral infectious diseases stems\nfrom the ability of viruses to evolve through mutations1.T h r o u g h o u t\nthe COVID-19 pandemic, SARS-CoV-2 variants with escalated spreading\npotential (i.e., ﬁtness) in the host population have successively\nemerged, leading to repeated epidemic surges\n2,3.T h eﬁtness of a virus\nis determined by multiple factors such as its ability to replicate efﬁ-\nciently within host cells, its capacity to evade innate immunity, and,\nmost notably, its ability to escape host population-level immunity\nshaped by vaccination and natural infection. By understanding how\nviruses enhance theirﬁtness in a pandemic through the lens of SARS-\nCoV-2 studies, we can learn critical insights for managing not just\nCOVID-19 but future viral infectious diseases as well.\nSARS-CoV-2 can alter itsﬁtness by acquiring mutations (including\nsubstitutions, insertions, and deletions) in viral proteins, with parti-\ncular emphasis on the spike (S) protein\n4. The S protein is the glyco-\nprotein essential for virus entry into the host cells via interaction with\nthe angiotensin-converting enzyme 2 (ACE2) receptor\n5.A l s o ,t h eS\nprotein is a primary target for neutralizing antibodies (Abs), which are\nkey components of the humoral immune response triggered by vac-\ncinations or natural infections\n6. Therefore, mutations in the S protein\nthat can affect its binding efﬁciency with ACE2 and its ability to evade\nneutralizing Abs tend to have a stronger impact on viralﬁtness2,3,7–19.\nIn genetics, ﬁtness is deﬁned as a measure of an organism’s\nreproductive success, passing on its genes to the next generation.\nReceived: 18 July 2024\nAccepted: 22 April 2025\nCheck for updates\n1Division of Systems Virology, Department of Microbiology and Immunology, The Institute of Medical Science, The University of Tokyo, Tokyo, Japan.\n2International Research Center for Infectious Diseases, The Institute of Medical Science, The University of Tokyo, Tokyo, Japan.3Department of Genetic\nMedicine and Development, University of Geneva Medical School, Geneva, Switzerland.4Swiss Institute of Bioinformatics, Geneva, Switzerland.5Division of\nImmunology and Respiratory Medicine, Department of Medicine, Karolinska Institutet, Stockholm, Sweden.6MRC-University of Glasgow Centre for Virus\nResearch, Glasgow, UK.7Graduate School of Medicine, The University of Tokyo, Tokyo, Japan.8International Vaccine Design Center, The Institute of Medical\nScience, The University of Tokyo, Tokyo, Japan.9Collaboration Unit for Infection, Joint Research Center for Human Retrovirus Infection, Kumamoto University,\nKumamoto, Japan.19These authors contributed equally: Wei Liu, Gustav Joas. *A list of authors and their afﬁliations appears at the end of the paper.\ne-mail: jampei@g.ecc.u-tokyo.ac.jp; KeiSato@g.ecc.u-tokyo.ac.jp\nNature Communications|         (2025) 16:4236 1\n1234567890():,;\n1234567890():,;\nAccordingly, theﬁtness of SARS-CoV-2 variants can be deﬁned as the\nrelative effective reproduction number (Re) between variants (here-\nafter,“ﬁtness” refers to relativeRe in this study)4,20–22. Re represents the\naverage number of secondary infections caused by an infected indi-\nvidual conditioned by the host population's immunity, which is in turn\nshaped by the history of vaccination and natural infections. Owing to\nadvancements in virus genome surveillance, it is now feasible to esti-\nmate the relativeR\ne of SARS-CoV-2 variants in almost real-time. Using\ntemporal data on variant detection frequencies with a logistic model,\nwe can estimate the R\ne values of various variants relative to a reference\nvariant, under certain assumptions— such as the relativeRe between\nvariants remaining constant over time (also see the second-to-last\nparagraph of the Discussion section)\n7. Based on the estimated relative\nRe, we can predict which variant(s) has the biggest advantage amongst\nco-circulating viruses at a given time and will likely become the next\nepidemic variant. Several research groups, including ours, have suc-\ncessfully utilizedRe or similar indicators to detect upcoming epidemic\nvariants and further elucidated the characteristics and risks these\nvariants possess through virological experiments\n23–28.\nThese conventional methods to estimate theﬁtness (relative\nRe) of variants are based on the accumulation rate of variant\nsequences. This means that theﬁtness of a newly emerged variant\ncannot be estimated until a suf ﬁcient number (e.g., ≥30) of\nsequences for that variant has accumulated. In contrast, if theﬁt-\nness of variants can be predicted based on their genotypes, it would\ntheoretically become possible to predict the ﬁtness of a newly\nemerged, unknown variant as soon as a single sequence is obtained.\nFurthermore, by establishing a ﬁtness prediction model, we can\nidentify mutations that contribute to increased viralﬁtness under\ngiven conditions (e.g., speciﬁc immune landscape). Moreover, since\nviruses like SARS-CoV-2 tend to evolve in a direction that increases\ntheir ﬁtness, understanding the virus’s ﬁtness landscape enables the\nprediction of their evolution.\nPrevious studies, including ours, have developed methods to\npredict theﬁtness (relativeR\ne) of variants based on their mutation\npatterns using a statistical modeling approach4,11,29,30.H o w e v e r ,t h e s e\nmodels simply representﬁtness as a linear combination of individual\nmutation effects, not considering interactions between mutations,\nnamely epistasis4,11,29,30. Furthermore, these statistical models cannot\nconsider the effect of mutations that have not yet emerged at the time\nof the training dataset creation. We speculated that these challenges\ncan be addressed using protein language models, an innovative tech-\nnology that has become increasingly popular in theﬁeld of natural\nlanguage processing\n31. Protein language models are large language\nmodels pretrained on extensive datasets of protein sequences, allow-\ning them to capture context-speciﬁc patterns within and across amino\nacid sequences. Protein language models can represent protein\nsequences as numerical vectors (i.e., embeddings) that reﬂect their\ncharacteristics and functions. By leveraging these embeddings, we can\nfurther develop a regression or classiﬁcation model from a protein\nlanguage model to address speciﬁc tasks, such asﬁtness prediction.\nMoreover, by employing a multitask learning framework, we can fur-\nther inform theﬁtness prediction process with functional data on\nindividual mutations, potentially enhancing the model’s predictive\naccuracy.\nIn this study, we developed CoVFit, a model to predict theﬁtness\n(relativeR\ne) of SARS-CoV-2 variants based on the S protein by utilizing\nthe state-of-the-art protein language model ESM-232.W e ﬁnetuned a\ncustomized ESM-2 model using (i) genotype–ﬁtness information,\nestimated from virus genome surveillance, and (ii) individual mutation\neffect information on evasion ability from humoral immunity, deter-\nmined by high-throughput deep mutational scanning (DMS)\nexperiments\n33. Using CoVFit, we have explored the currentﬁtness\nlandscape until late 2023 and the evolutionary potential of SARS-\nCoV-2.\nResults\nIntroduction of CoVFit\nWe developed CoVFit, aﬁtness prediction model based on S protein\nsequences by ﬁnetuning ESM-2 (Fig. 1a). To increase the model’s\nknowledge of the coronavirus S proteins, weﬁrst established ESM-\n2Coronaviridae, by performing additional pretraining (i.e., domain adap-\ntation) on the ESM-2 model with S protein sequences obtained from\n1506 Coronaviridae viruses (Figs. 1b and S1). The ESM-2\nCoronaviridae\nmodel demonstrates enhanced predictive capability in the masked\nlearning task speciﬁcally for SARS-CoV-2 S proteins, while retaining its\nperformance across a broader collection of proteins (Fig. S1c). Sub-\nsequently, utilizing a multitask learning framework, weﬁnetuned the\nmodel on both genotype–ﬁtness (relative R\ne)d a t aa n dD M Sd a t af o r\nthe ability to escape neutralization by monoclonal Abs (mAbs) (Fig.1b).\nConsequently, for a given S protein sequence, CoVFit can predict the\ncountry-speciﬁc ﬁtness value and the ability to escape from each mAb\n(Fig. S1a).\nTo assemble the genotype–ﬁtness dataset, weﬁrst classiﬁed viral\nsequences into S protein genotypes, deﬁned as groups of viruses\nsharing a unique set of mutations in S protein, using the genome\nsurveillance data up to November 2, 2023, obtained fromGISAID.\nSubsequently, we estimated the relativeR\ne of each genotype in each\ncountry byﬁtting a multinomial logistic model to temporal data on\ngenotype detection frequencies, as previously described2,3,7–19. Conse-\nquently, we obtained a total of 21,281 genotype–ﬁtness data points,\ncovering 12,817 genotypes across 17 countries (Figs.1b and S2a).\nConsistent with a previous study4, there is a clear trend where later-\nemerging variants exhibit higherRe values, resulting in the continuous\nreplacement of circulating variants (Fig. S2a). This result suggests that\nthe average relativeﬁtness of circulating variants increases over time\nlikely in response to the rising levels of population immunity in\nthe hosts.\nWe utilized an in vitro DMS dataset on the neutralization cap-\nabilities of mAbs, produced by Cao et al.\n24. A total of 173,384\nmutation–mAb DMS data points, covering 2096 types of mutations in\nthe receptor binding domain (RBD) in the S protein and 1548 mAbs,\nwere included in the dataset (Figs.1b and S2b). Aligning with previous\nﬁndings\n24, the effects of mutations on mAbs varied depending on their\nepitope classes (Fig. S2b–d). Variants exhibiting higherﬁtness, such as\nBQ.1.1 or XBB, exhibited an increased ability to evade these mAbs,\nsupporting the effectiveness of utilizing this information for predict-\ning ﬁtness (Fig. S2d).\nUsing theﬁve-fold cross-validation scheme, we generatedﬁve\nmodel instances of CoVFit (Fig.1b). These model instances were\nused to evaluate performance for the corresponding test data.\nAdditionally, these instances can provide the mean and variance of\npredictions for new data (e.g., data acquired after model training).\nHereafter these model instances are referred to as CoVFit\nNov23\n(subscript denoting the month and year when the genotype–ﬁtness\ndata were obtained).\nPrediction performance of CoVFit\nTo evaluate the prediction performance of the CoVFitNov23 model\ninstances, we examined the prediction performance of respective\nmodel instances using the corresponding test datasets. We selected\nSpearman’s rank correlation score as the main metric because we\nbelieve it is necessary to assess the model’s ability to predict the\nr a n k i n go fr e l a t i v eﬁtness between variants in order to prioritize\nvariants with high ﬁtness that are likely to spread. The resulting\nprediction performance for ﬁtness on data that doesn’t require\nextrapolation is notably high (Spearman ’s correlation: 0.990)\n(Fig. 2a–c). Also, prediction of escape ability from neutralization by\nmAbs reaches moderately high performance (Spearman’s correla-\ntion for each epitope class: 0.578–0.814) (Figs. 2a and S3a). The\nmodel’s higher predictive performance was also supported in\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 2\nevaluations stratiﬁed by sampling country and mAb type forﬁtness\nand immune escape ability, respectively (Fig. S3b, c). Even when\nvariants were stratiﬁed by country of circulation and emergence\ntime (on a weekly basis), a robust correlation was observed between\nﬁtness and predictedﬁtness (Fig. S3d, e). This result suggests that\nCoVFit can distinguish theﬁtness of variants emerging during the\nsame period with an effective level of accuracy. Together, we show\nthat CoVFit has sufﬁcient power to represent theﬁtness landscape\nas well as the effect of mutations on evasion from diverse types\nof mAbs.\nPrediction performance of CoVFit for unknown, future variants\nThis study aims to develop a model that can robustly predict the\nﬁtness of yet-to-emerge variants in addition to known variants.\nHowever, in the experiment shown in Fig.2, where the dataset is\nrandomly split into training and test sets, it is highly likely that\nvariants in the test set are very similar to those in the training set.\nIndeed, we analyzed the minimum amino acid difference between\nvariants in the test dataset and their closest counterparts in the\ntraining dataset (referred to as the minimum amino acid distance)\nand found that most variants have a distance of less thanﬁve amino\nFig. 2 | Prediction performance of CoVFit. aSpearman’s correlation scores for\npredicted relativeﬁtness values and mAb neutralization escape scores. Scores from\nﬁve cross-validation folds are shown as dots, with the mean represented by a bar\nand the standard deviation by an error bar. The correlation for mAbs was calculated\nin each epitope group.b Scatter plot forﬁtness prediction, aggregating results\nfrom ﬁve-fold cross-validation. Dot denotes the result of a certain viral genotype in\na speciﬁc country. Dot is colored by the Nextclade clade. The relativeﬁtness value\nwas scaled so that the 0.1 percentile and 99.9 percentile points fall between 0 and 1.\nA dashed line with a slope 1 and intercept 0 is shown.c Scatter plot inherited from\n(b) but colored by the emergence date of each genotype. Source data are provided\nas a Source Dataﬁle.\nFig. 1 | Overview of CoVFit. aConceptual framework of CoVFit. CoVFit is a protein language model designed to predict theﬁtness (relativeRe) of SARS-CoV-2 variants\nbased on their S protein sequences.b Outline of the training process used to develop CoVFit model instances.\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 3\nacids (Fig. S3f). This suggests that the task may be easier than the\nreal-world prediction task we aim to solve.\nHence, to evaluate the model’s prediction performance for\nunknown, future variants (i.e., extrapolation capacity), we synthesized\ndatasets for “past” and “future” variants by splitting the existing\ngenotype–ﬁtness dataset based on variants’emergence dates with a\nspeciﬁc cutoff date (e.g., February 28, 2022) (Fig.3a). Subsequently, we\ngeneratedﬁve instances of CoVFit solely using the past variant dataset\nwith theﬁve-fold cross-validation scheme and then evaluated its per-\nformance on the corresponding future variant dataset. We conducted\nthe same experiment for these eight cutoff dates, which were spaced\n1 month apart from January 31, 2022, to August 31, 2022 (Fig.3b). The\nearliest cutoff date corresponds to just after the emergence of BA.2,\nwhile the latest cutoff date is just before the emergence of BQ.1 and\nXBB lineages (Fig.3b). BQ.1 is a lineage that arose from BA.5 through a\nsequential evolutionary process, whereas XBB emerged through a non-\nsequential (or saltation-like) process, involving recombination in the S\ngene that resulted in the acquisition of 14 amino acid mutations.\nWe demonstrated that this series of trained model instances,\nCoVFit\nPast, successfully predicted that theﬁtness of future variants\nexceeds that of past variants (Figs. 3c and S4a). Furthermore,\nCoVFitPast showed a notable level of accuracy in predicting the relative\nﬁtness ranking of future variants (Figs.3d, e and S4a). For example,\nCoVFitFeb22, trained on data up to the emergence of BA.2.12.1, achieved\nFig. 3 | Prediction performance of CoVFit for unknown, future variants.\na Strategy for evaluating prediction performance on future variants. Model\ninstances, referred to as CoVFitPast, were trained on variant data prior to a speciﬁed\ncutoff date (e.g., January 31, 2022). Prediction performance for future variants was\nthen assessed using data from variants that emerged after this date.b Number of\nsequences from each clade in the past datasets with speciﬁc cutoff dates.c Fitness\npredictions for future (gray) and past (light gray) variants in the dataset with a\ncutoff date of February 28, 2022. Points represent results for each genotype, cal-\nculated as average values across countries andﬁve-fold predictions. A dashed line\nwith a slope of 1 and an intercept of 0 is included.d Fitness predictions for future\nvariants, with colors indicating Nextclade clade classiﬁcations. In addition to the\ndashed line with a slope of 1 and intercept 0, a gray estimated regression line, based\non mean prediction values, is displayed.e Scatter plot based on (d) but colored\naccording to the minimum amino acid distance from variants in the past data.\nf Predicted ﬁtness of genotypes within each Nextclade clade. Each clade’s dis-\ntribution (violin) and median value (dot) are shown. Individual panels display\nresults for datasets with different cutoff dates. Clades present in the past data are\nseparated by a dashed vertical line from those absent in the past data. Additionally,\nthe median observedﬁtness value of each clade is represented by a heatmap on the\nleft side.g Comparison of prediction performance metrics across methods,\nincluding Spearman’s correlation score,R-squared value, mean absolute error\n(MAE), and estimated regression slope. Source data are provided as a Source\nData ﬁle.\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 4\na Spearman correlation score of 0.862 for the future dataset\n(Fig. 3d, e). Moreover, we calculated the median predictedﬁtness for\neach viral clade in the future dataset and found that CoVFitFeb22\naccurately ranked the clade-medianﬁtness of future variants, includ-\ning BA.4, BA.5, BA.2.75, BQ.1, XBB, XBB.1.5, EG.5.1, and HK.3 (Fig.3f).\nGiven that the XBB lineages has≥14 amino acid differences from its\nclosest genetic counterparts in the past dataset, CoVFit’s extrapolation\ncapacity is notably effective (Fig.3e). Although prediction accuracy\ntended to decrease for variants with greater amino acid distances from\nthose in the past (training) dataset, this relationship was neither linear\nnor strictly monotonic (Fig. S4b). Finally, consistent results were\ngenerally observed across datasets with varying cutoff dates, high-\nlighting CoVFit’s extrapolation capacity for previously unknown,\nfuture variants (Figs.3f and S4a).\nHowever, we also found that CoVFit does not exhibit high gen-\neralization ability in some scenarios. For instance, CoVFit trained on\ndatasets that either completely lack or contain only a few sequences of\nBA.2.75 (before June 30, 2022) tended to overestimate theﬁtness\nranking of BA.2.75 with the K356T mutation, likely due to this muta-\ntion’s high immune escape effect by K356T (Figs.3fa n dS 4 a )\n34.F u r -\nthermore, in later cutoff dates (e.g., August 31, 2022), CoVFit tended to\nunderestimate theﬁtness value of XBB subvariants, although CoVFit\nwas able to correctly rank theﬁtness values of these variants (Fig. S4a;\nalso see the regression slope in Fig.3g). Moreover, in some cutoff dates\n(e.g., August 31, 2022), CoVFit underestimated theﬁtness ranking of\nBA.2.86, a variant that emerged through a saltation-like evolutionary\nprocess involving 30 mutations in the S protein and exhibited one of\nthe highestﬁtness levels in late 2023 (Fig.3f). This underestimation\nwas apparent even when CoVFit was trained on data up to just before\nthe emergence of BA.2.86 (e.g., July 31, 2023) (Fig. S4c). These results\nshow that while CoVFit has high extrapolation capacity, there are\nlimitations to its generalization ability, where prediction accuracy can\nbe inconsistent between training datasets for some more divergent\nprotein contexts.\nPerformance comparison with other prediction models\nNext, we evaluated CoVFit’s performance relative to other currently\navailable methods. A previous study by Obermeyer et. al established\nPyR0, a statistical model that can predict theﬁtness (relativeRe)o f\nunknown variants based on their mutation proﬁles4. Thus, we began\nby comparing CoVFit with PyR0. Two versions of the PyR0 model\ninstances are available: one trained on data up to January 20, 2022\n(covering variants up to BA.2), and another trained on data up to\nSeptember 19, 2022 (just before the emergence of BQ.1 and XBB).\nWhile these PyR\n0 models achieved an effective level of accuracy in\npredicting the ﬁtness of past variants, their Spearman correlation\nscores were negative when applied to future variants (Fig. S5).\nParticularly, PyR\n0 model instances underestimate variants with\ngreater amino acid distances from those in the past dataset, such as\nXBB lineages (Fig. S5a, b, right). These results suggest that PyR0 was\nunable to accurately rank future variantﬁtness in our experimental\nsetting, suggesting that CoVFit has a higher extrapolation capacity\nthan PyR\n0. This outcome likely reﬂects PyR0’s design as an inter-\npretable statistical model to identify mutations critical for ﬁt-\nness gains.\nTo gain additional insight into the extrapolation capacity of\nCoVFit, we constructed alternative prediction models using non-deep\nlearning methods, including LASSO, Random Forest, and Light Gra-\ndient Boosting Machine (LightGBM) (Fig.3g). These models demon-\nstrated prediction performance comparable to CoVFit in terms of\nSpearman correlation,R-squared, mean absolute error (MAE), and\nestimated the regression slope when applied to past variants. How-\never, when predicting the ﬁtness of future variants, CoVFit out-\nperformed these models on most metrics and cutoff dates, suggesting\nthat CoVFit has a higher extrapolation capacity than all these models.\nTo assess the impact of incorporating DMS data into CoVFit on\nthe efﬁcacy ofﬁtness prediction, we generated an additional model\ninstance, CoVFit\nnoDMS, by training without the DMS dataset and sub-\nsequently evaluated its predictive performance against the original\nmodel (Fig.3g). In predicting theﬁtness of past variants, CoVFitnoDMS\nexhibited prediction performance similar to the original CoVFit.\nHowever, CoVFitnoDMS substantially underperformed in predicting the\nﬁtness of future variants across most metrics and cutoff dates. Simi-\nlarly, we examined the impact of the domain adaptation step on pre-\ndiction performance and demonstrated the contribution of this step in\nachieving higher performance (Fig.3g). Removing the DMS dataset\nhad a much stronger effect than omitting the domain adaptation step,\nunderscoring the critical role of DMS dataset incorporation. Collec-\ntively, CoVFit’s higher extrapolation capacity is likely attributed to its\nincorporation of functional information on mutations and the appli-\ncation of domain adaptation frameworks.\nFitness elevation events during SARS-CoV-2 evolution\nTo deepen our understanding of theﬁtness landscape of SARS-CoV-2,\nwe developed a CoVFit-based phylogenetic framework to analyzeﬁt-\nness elevation throughout its evolution (Fig.4). First, we constructed a\nphylogenetic tree of 11,098 variants, which correspond to viral gen-\nome sequences encoding respective S protein genotypes. Subse-\nquently, ancestral S protein sequences at the internal nodes of the tree\nwere reconstructed (Fig.4a). We then inferred theﬁtness of all nodes,\nrepresenting both observed and reconstructed ancestral sequences,\nutilizing the latest CoVFit\nNov23 models (Fig.4ba n dF i g .S 6f o rO m i c r o n\nand all lineages, respectively). We obtainedﬁve predicted ﬁtness\nvalues per node via aﬁve-fold cross-validation scheme. Finally, we\nidentiﬁed branches whereﬁtness elevation was statistically signiﬁcant\n(false discovery rate, FDR < 0.1) by comparing predictedﬁtness values\nb e t w e e nag i v e nn o d ea n di t sp a r e nt node. Of the 9846 branches that\nacquired mutations in the S protein, 959 (9.7%) branches were identi-\nﬁed with signiﬁcant ﬁtness elevation (Fig. S6), including 542 branches\nwithin the Omicron lineages (Fig.4c). We observed increases in viral\nﬁtness both in the branches representing the most recent common\nancestor of major lineages and throughout their subsequent diversi-\nﬁcation (Figs.4ca n dS 6 ) .\nTo identify mutations critical forﬁtness elevation, we next cal-\nculated the averageﬁtness gain per mutation by examining branches\nwith the acquisition of a single mutation (Fig.4d and Fig. S6 for Omi-\ncron and all lineages, respectively). Mutations with higherﬁtness gain\n[per mutation] score are predominantly found in the RBD of the S\nprotein, particularly in its receptor binding motif (RBM), consisting of\nthe binding interface to ACE2\n35 (Figs. 4e, f and S6). Additionally, we\nidentiﬁed signiﬁcant non-RBD mutations, like the T19I and Q52H, in the\nN-terminal domain. We found that mutations with a greater impact on\nﬁtness elevation also tend to enhance the virus’s ability to evade\nhumoral immunity (Fig.4g). Furthermore, mutations with signiﬁcant\nﬁtness impact in Omicron lineages tend to have been acquired multi-\nple times in a convergent manner throughout Omicron’se v o l u t i o n\n(Fig. 4h). This association was evident in RBD mutations (Nagelkerke’s\npseudoR\n2: 0.392) but not in non-RBD mutations (Nagelkerke’sp s e u d o\nR2: 0.008).\nContext-speciﬁc effects of the F456L substitution\nWe found that acquisitions of some mutations were overrepresented\nin a speciﬁc phylogenetic lineage. For example, while the R346T sub-\nstitution was convergently acquired across Omicron lineages, the\nF456L substitution was markedly overrepresented in the XBB lineage,\nwith few occurrences in the BQ.1 lineage (Fig.5a). To quantify differ-\nences in theﬁtness effect of F456L among lineages, we performed in\nsilico mutational scanning analysis leveraging CoVFit\nNov23 by compu-\ntationally inducing F456L in various S protein backbones and inferring\nthe ﬁtness gain caused by this substitution (Fig.5b). The predicted\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 5\nﬁtness gain from F456L was markedly higher in the XBB lineage,\nfollowed by BQ.1, with other lineages showing substantially lower\ngains. Together, these results suggest that the ﬁtness-increasing\nimpact of F456L is speciﬁc to the XBB lineages (and possibly to BQ.1\nas well).\nTo gain mechanistic insights into the XBB-speciﬁc F456L effect on\nviral ﬁtness, we analyzed published DMS data. This includes the data\non mAb neutralization by Cao et al.\n24 and those on the RBD ACE2-\nbinding afﬁnity and protein stability by Taylor and Starr36. Substitu-\ntions at F456 has one of the largest impacts on neutralization escape,\naccording to the escape estimator data\n37, in various lineages including\nthe ancestral D614G strain’s S protein (Fig.5c). On the other hand, the\neffects of this mutation on ACE2 binding and protein expression were\ndifferent among S protein backbones. While F456L enhances ACE2\nbinding and protein expression in the XBB S protein, this substitution\nhas a negative effect on ACE2 binding and/or protein expression in all\ntested S backgrounds other than XBB (Fig.5d). The non-deleterious\neffect of F456L in ACE2 binding and expression, unique to XBB, has\nbeen conﬁrmed in both RBD and full S DMS assays in previous\nstudies\n24,38. These results suggest that F456L confers preferable effects\non the XBB’s S protein but confers a double-edged sword effect on\nother lineages’S protein. Together, the XBB-speciﬁc positive effect of\nF456L onﬁtness can be explained by the XBB-speciﬁc removal of the\ndeleterious effects of this mutation. This example validates the effec-\ntiveness of CoVFit to infer mutational effects in a context-speciﬁc\nmanner.\nCoVFit-based in silico DMS to predict subsequent mutations\nTo evaluate the potential of CoVFit in predicting viral evolution, we\ndeveloped a simulation method, namely CoVFit-based in silico DMS. In\nthis method, we computationally introduced every possible single\namino acid substitution into the S protein sequence of a speciﬁc var-\niant. Subsequently, theﬁtness gain from each substitution was inferred\nusing CoVFit.\nFig. 4 | Detection ofﬁtness elevation events during Omicron diversiﬁcation.\na Scheme to detect phylogenetic branches withﬁtness elevation utilizing CoVFit\nmodels. b Inference of change inﬁtness through Omicron’se v o l u t i o n .T h em a x -\nimum likelihood (ML) tree of Omicron lineages is shown. Branch color indicates an\ninferred ﬁtness value for each phylogenetic node, including both observed and\nreconstructed ancestral genotypes of S proteins in the phylogenetic tree.\nc Detection ofﬁtness elevation events during Omicron’s evolution. Dot color\nindicates inferredﬁtness gain in each branch, calculated as the difference in pre-\ndicted ﬁtness between a node and its parental node.d Mean ﬁt n e s sg a i no v e ra\nspeciﬁc mutation during Omicron evolution. Since some mutations have been\nacquired multiple times, the mean value ofﬁtness gain among acquisition events\nw a su s e da st h e“ﬁtness gain [per mutation]”score. The top 20 mutations regarding\nthis score are shown with the protein domain information.e Enrichment ofﬁtness-\nassociated mutations in the RBD, particularly in its RBM. The negative score is\nclipped to 0.f Mapping the site-wiseﬁtness gain score on the 3D structure of the\nancestral D614G S protein (PDB: 7BNN)\n56. If multiple mutation types are present in a\nspeciﬁc site, the maximum value is shown as the“ﬁtness gain [per site]” score.\nAmino acid side chains for the top 15 sites regarding this score are shown as sphere.\nThe plot was generated using Chimera X57. g Association ofﬁtness gain rank with\nthe mean mAb escape score. This escape score was calculated as the mean of the\nescape score across mAbs over a mutation. The ND group includes mutations not\nobserved in our phylogenetic analysis. The categories 1–50, 51–100, 101–,a n dN D\ninclude 39, 24, 75, and 1964 entries, respectively. The box represents the inter-\nquartile range (IQR; 25th to 75th percentile), with the horizontal line indicating the\nmedian (50th percentile). The whiskers extend to the smallest and largest values\nwithin 1.5 times the IQR from the lower and upper quartiles, respectively.\nh Association of theﬁtness gain [per mutation] score with the inferred acquisition\ncount. The estimated regression curve (line) with standard error (ribbon) by Pois-\nson regression using all mutations is shown. In addition, Nagelkerke’sp s e u d oR\n2\nvalues for Poisson regression analyses using all mutations, RBD mutations, and non-\nRBD mutations are shown. Source data are provided as a Source Dataﬁle.\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 6\nIn this study, we selected BA.2.86.1 as the target for in silico DMS\nanalysis to evaluate CoVFit’s performance in predicting the evolution\nof the BA.2.86.1 lineage. Following the emergence of BA.2.86.1, its\ndescendant lineage, JN.1, arose through the L455S mutation and\nrapidly spread worldwide. JN.1 demonstrated higherﬁtness than both\nBA.2.86.1 and the XBB subvariants circulating at the time, leading to a\nnear-complete replacement of the dominant lineage from XBB to the\nBA.2.86 lineage by early 2024\n23. Subsequently, JN.1 underwent further\ndiversiﬁcation, giving rise to various subvariants, such as KP.2\nand KP.3.\nThe genotype–ﬁtness dataset we used included one sequence\nof JN.1 and 11 sequences from other BA.2.86 lineages. To create a\nmodel that completely excluded knowledge of JN.1, we removed its\nsequence from the dataset and trained a new CoVFit model\ninstance, referred to as CoVFit\nwoJN1, for conducting in silico DMS\ntargeting BA.2.86.1. Finally, we calculated per-site ﬁtness gains\nbased on the in silico DMS analysis.\nThe results showed that the top 2% (20 sites) with the highest\npredictedﬁtness gains were signiﬁcantly enriched in the top 2% of sites\nwith the highest mutation frequencies within the BA.2.86.1 lineage\n(odds ratio: 29.4; P <1 . 0 E - 6 ) ( F i g .6a). This ﬁnding suggests that\nmutations with the highestﬁtness gains predicted by our model were\nindeed the ones acquired and subsequently in the BA.2.86 lineage.\nNotably, the mutation at site 455 (ranked 3rd; e.g., L455S) was theﬁrst\nto rapidlyﬁx within the viral population, coinciding with the expansion\nof JN.1 (Fig.6b, c). Similarly, the mutation at site 456 (ranked 1st; e.g.,\nF456L) becameﬁx e ds e c o n di nt h ep o p u l a t i o nd u r i n gt h es p r e a do f\nKP.2 and KP.3, descendants of JN.1 that harbored both L455S and\nF456L. Furthermore, the mutation at site 346 (ranked 6th; e.g., R346T)\ninitially increased in frequency alongside the expansion of KP.2, which\ncarried L455S, F456L, and R346T. However, its frequency later declined\nas KP.3, which carried L455S and F456L but lacked R346T, out-\ncompeted KP.2. Moreover, as of December 2024, JN.1 subvariants\nharboring R346T in addition to L455S and F456L— such as LP.8.1— have\nemerged and spread rapidly worldwide\n39.T h e s eﬁndings suggest that\nCoVFitwoJN1 successfully predicted, with an effective level of accuracy,\nthe mutations that were likely to be acquired and spread within the\nBA.2.86 population. This highlights the utility of CoVFit for predicting\nviral evolution through single amino acid mutations.\nCoVFit-CLI tool\nThe trained CoVFitNov23 model instances used in this study are avail-\nable as a command-line tool, CoVFit-CLI, from our GitHub repository\n(https://github.com/TheSatoLab/CoVFit). Additionally, the instances\ntrained on the latest genome surveillance data, CoVFit\nNov24,a r ea l s o\navailable. Researchers can use the standalone program to conveniently\nprovideﬁtness and DMS escape predictions for their own SARS-CoV-2\nS protein sequences. The CoVFit-CLI tool will receive periodic updates\nto the model instances, trained on the latest genomic surveillance data.\nDiscussion\nIn this study, we established CoVFit, a protein language model to\npredict the ﬁtness (i.e., relativeR\ne) of SARS-CoV-2 variants, which\nrepresents a variant’s relative ability to spread in the host population.\nPrevious studies have proposed statistical models predicting viral\nﬁtness\n4,11,29,30 as well as machine learning models predicting viral phe-\nnotypes strongly associated withﬁtness, such as immune evasion\nability40,41 or proteingrammaticality42,43. However, to our knowledge,\nCoVFit is theﬁrst machine learning model designed to directly predict\nviral ﬁtness beyond conventional statistical models.\nWe demonstrated that while CoVFit exhibits higher extrapolation\ncapacity compared to other methods, it also has certain limitations.\nCoVFit was able to predict theﬁtness of future, unknown variants, such\nas XBB and its descendant lineages, which are ~15 amino acids distant\nfrom the training data, with reasonable accuracy. This strong extra-\npolative ability likely stems from CoVFit’s integration of multitask\nlearning with DMS data, as indicated by ablation experiments (Fig.3g).\nHowever, CoVFit was unable to consistently predict theﬁtness ranking\nof BA.2.86, which has >30 amino acid differences compared to variants\nin the training data (Figs.3f and S4c). In other words, CoVFit appears\ncapable of extrapolating to moderate saltation-like events (e.g., the\nemergence of XBB) but struggles with larger saltation-like events (e.g.,\nthe emergence of BA.2.86, which is comparable to the emergence of\nOmicron in the number of spike mutations). Furthermore, we found\nFig. 5 | Context-speciﬁc effect of the F456L substitution. aExamples of con-\nvergent acquisitions of speciﬁc substitutions. A node indicates the acquisition\nevents, and node color denotesﬁtness gain at the acquisition events. Branch color\ndenotes the presence (gray) or absence (light gray) of speciﬁc substitutions in the\nreconstructed ancestral S protein sequences.b Fitness gain upon F456L in each\nbackbone S protein sequence, inferred by in silico mutational scanning using\nCoVFit. Variants with available DMS data (shown in (d)) were included in this\nanalysis.c Site-wise immune escape score for the ancestral D614G strain, BA.2, and\nXBB variants, estimated by mAb escape estimator37 based on Cao’s DMS data24.T h e\ntop 5 sites regarding the escape score are annotated.d Effect of F456L on the S\nprotein’s expression (stability) and ACE2-binding afﬁnity, extracted from publicly\navailable DMS data from Taylor and Starr36. The dot color indicates inferredﬁtness\ng a i ns h o w ni n(b). Higher values indicate enhanced higher expression and ACE2-\nbinding afﬁnity values. Source data are provided as a Source Dataﬁle.\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 7\nthat CoVFit tended to underestimate theﬁt n e s sv a l u e so fX B Bs u b -\nvariants in later cutoff dates (e.g., August 31, 2022), although it was still\nable to correctly rank their relativeﬁtness values (Fig. S4a). Collec-\ntively, this study provides comprehensive insights into both the utility\nand limitations of CoVFit.\nThe CoVFit model design is expected to be most effective in the\nmid-to-late stages of a pandemic, when sufﬁcient genome data has\nbeen accumulated, but surveillance is declining. As of 2024, with the\nSARS-CoV-2 pandemic persisting over a prolonged period of time, it\nhas become increasingly difﬁcult to sustain intensive viral genome\nsurveillance ( https://gisaid.org/hcov-19-variants-dashboard/). Con-\nventional methods estimateﬁtness based on the accumulation rate of\nvariant sequences. Therefore, to apply these methods effectively, a\nlarge number of viral genomes must be continuously sequenced and\nshared without delay. In contrast, CoVFit leverages past genomic\ninformation to directly predict ﬁtness from genotype, enabling\nimmediate predictions without waiting for new variant sequences to\naccumulate. Moreover, CoVFit’s predictions do not rely on variant\nclassiﬁcation, eliminating the need for the processes of variant iden-\ntiﬁcation, classiﬁcation, and naming, which require manual curation by\nexperts (https://github.com/cov-lineages/pango-designation). A CoV-\nFit model instance can be trained within 24 h using a single Nvidia A100\nGPU, making it feasible to regularly update the model with the latest\ngenome surveillance data. Thus, deploying the latest CoVFit model to\nmonitor viral genome databases presents a promising strategy for\nimproving the efﬁciency of high-risk variant surveillance, a task that\nremains essential even in a prolonged pandemic scenario. Moreover,\nbased on the reasons outlined above, CoVFit-like methods would also\nbe useful for monitoring pathogens already circulating in humans,\nsuch as Inﬂuenza, RSV, and common cold coronaviruses, where there’s\nsparse sequencing data covering a wider period of their evolution.\nIn this study, we developed a framework that combines CoVFit\nwith a phylogenetic approach to identify mutations that enhance viral\nﬁtness (Figs.4 and 5). Despite the common challenge of interpret-\nability in machine learning models, our framework is designed to\nassess not just the average effect of speciﬁc mutations but also their\ncontext-speciﬁc or epistatic effects. For instance, it can distinguish the\nvarying impacts of a particular mutation (e.g., F456L) across different\ncontexts (e.g., within the XBB lineage versus other lineages) (Fig.5).\nThis framework is highly versatile and can be applied in combination\nwith various phenotype prediction models beyond CoVFit. Compared\nto in silico DMS, this approach aims to retrospectively interpret\nobserved evolutionary steps and identify patterns in their occurrence.\nPrevious studies have reported that some mutations are con-\nvergently acquired through the SARS-CoV-2 evolution, probably\nbecause these convergent mutations confer a positive effect on viral\nﬁtness\n24,44. Indeed, some studies have inferred the importance of\nmutations for viralﬁtness according to how often these mutations are\nacquired convergently, under the assumption that these two features\nare correlated\n24,45. However, despite our prior investigations focusing\non a limited set of mutations11, the degree of association between a\nmutation’s acquisition frequency and its impact on ﬁtness has\nremained unclear. In this study, we comprehensively investigated this\nissue and found an association between these two features, with a\nparticularly strong correlation observed in mutations within the RBD\n(Fig. 4h). This result suggests, for accurate predictions of viral evolu-\ntion, it is effective to consider both the acquisition frequency of\nmutations and theirﬁtness effects. By steering future development\ntowards a machine learning model based on a phylodynamics\napproach integrating both factors, we could potentially achieve pre-\ncise predictions and simulations of viral evolution.\nDespite the utility of CoVFit, it still has several limitations in its\npresent form. First, as the objective variable, we utilized theﬁtness\n(relative R\ne) of a variant, which was estimated from viral genome sur-\nveillance data and inherently carries a degree of uncertainty and bias.\nThis bias arises partly because the surveillance does not employ ran-\ndom sampling. Often, samples from speciﬁc infection clusters are\ndisproportionately represented in the surveillance data, potentially\nleading to a biased estimation of theﬁtness of certain variants. Second,\nthe logistic model used to estimate variantﬁtness operates under a\nstrong assumption that the relativeﬁtness among variants remains\nconstant over time\n4,20–22. Although this model is widely used, this\nFig. 6 | CoVFit-based in silico DMS on the BA.2.86.1 lineage. aAssociation\nbetween theﬁtness gain [per site] score and the mutation frequency at each site in\nthe BA.2.86.1 lineage. Points represent amino acid sites, while dashed lines indicate\nthe 98th percentile (top 2%) for both theﬁtness gain score and mutation frequency.\nStatistical measures quantifying the degree of overlap between data points within\nthe top 2% for these two metrics are shown. Thep value was calculated using a two-\nsided Fisher’s exact test.b Temporal trend in mutation frequency at individual\namino acid sites within the BA.2.86.1 population. The genome surveillance data\nfrom October 1, 2023, to July 31, 2024, was used. Frequencies were calculated using\n7-day bins.c Temporal trends in viral lineage frequencies within the BA.2.86.1\npopulation. Each viral lineage category includes its descendant lineages unless\nthose descendant lineages are explicitly deﬁned as separate categories. Mutations\nin the S protein relative to BA.2.86.1 are indicated, with emphasis on those with\nhigher ﬁtness gain [per site] scores. Source data are provided as a Source Dataﬁle.\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 8\nassumption might not always hold true. In reality, the relativeﬁtness of\nvariants can vary in response to changes in the host population’s\nimmune status, inﬂuenced by factors such as natural infections and\nvaccinations2,3. For example, in 2024, when the majority of the popu-\nlation has some level of immunity to SARS-CoV-2, the impact of\nimmune escape onﬁtness is likely more pronounced compared to the\nearly stages of the COVID-19 pandemic in 2020. Similarly, although it is\nlikely that the effects of mutations onﬁtness may also change over\ntime, the method to identifyﬁtness-elevating mutations with CoVFit\ndoes not account for this temporal variation. Third, in ourﬁtness\nprediction task, we utilized sequences from real-world variants as\ntraining inputs. Mutations with a substantial negative impact onﬁtness\nmust be underrepresented in our training dataset since such muta-\ntions are usually eliminated through natural selection. Consequently,\nCoVFit is likely to underestimate the negative effects of certain\nmutations onﬁtness. Finally, because CoVFit requires a large amount\nof viral genome sequences for training, its utility would be limited in\nthe early stages of future viral outbreaks, before sufﬁcient genomic\ndata has been accumulated. In the early phases, methods like\nEVEscape\n41, which use expert-designed scoring systems to estimate\nimmune escape potential without requiring a training process, may be\nmore practical. Other technical limitations and their potential solu-\ntions are discussed in the“Room for improvement of CoVFit” section\nin the“Methods” section. Together, theﬁtness predictions made by\nour model should be carefully interpreted in the context of compli-\nmentary information.\nDespite the limitations mentioned, CoVFit holds the potential to\ndecipher theﬁtness landscape of viruses. Our approach is poised to\ncontribute to the development of innovative methods for the early\nprediction of future epidemic variants and for advancing viral evolu-\ntionary predictions. These advancements are critical for efﬁcient epi-\ndemic control, vaccine development, and drug discovery.\nFurthermore, the methodologies employed in CoVFit can be applied to\npredicting the ﬁtness of other viruses, including viral pathogens\ncausing future pandemics. In anticipation of the next pandemic, it is\nimperative to continually develop foundational bioinformatics meth-\nods that assist in epidemic control, leveraging the extensive genomic\ndata efforts of SARS-CoV-2 as an archetypical forerunner.\nMethods\nPreparation of genotype–ﬁtness dataset\nWe retrieved all SARS-CoV-2 genome sequences and their associated\nmetadata available as of November 2, 2023, fromGISAID.W et h e n\nassigned the most recent PANGO lineage classiﬁcation available at that\ntime to each sequence in our dataset using Nextclade v.2.14.046 with\nNextclade dataset version“2023-10-26T12:00:00Z.” Then we excluded\nlow-quality sequences based on the following criteria: (i) absence of\ncollection date information; (ii) samples derived from animals other\nthan humans; or (iii) more than 1% undetermined nucleotide\ncharacters.\nTo develop a classiﬁcation system for SARS-CoV-2 with a higher\nresolution than the PANGO lineage and based solely on the sequence\nof the S protein, we deﬁned the genotype of the S protein and utilized\nit as the virus classiﬁcation system in this study. The S protein geno-\ntypes refer to groups of viral sequences that share a unique set of\nmutations in the S protein. To achieve this, weﬁrst identiﬁed muta-\ntions in the S protein observed in more than 100 sequences. We then\nanalyzed the mutation patterns across each sequence, enabling us to\ncategorize sequences into genotypes based on these patterns. Only\ngenotypes represented by 20 or more sequences in any country were\nconsidered for our analysis. As a result, a total of 13,643 S protein\ngenotypes were included in our dataset. Each genotype was linked to\nthe Nextclade PANGO lineage, Nextclade clade, and a representative\ngenome sequence. This representative sequence was randomly chosen\nf r o mt h ec o l l e c t i o no fs e q u e n c e so ft h eg e n o t y p e .T h ee m e r g e n c ed a t e\nof a genotype was determined as the 1st percentile date of collection\nfor the viral isolates within the genotype. The viral genome sequences\ncontained within this dataset are summarized under the EPI_SET_ID:\nEPI_SET_240311ma, which can be accessed through the GISAID website\n(https://gisaid.org/).\nTo estimate the relativeR\ne value of each genotype in each country,\nwe began by tallying the daily count of each genotype within each\ncountry’s dataset. We applied a multinomial logistic model to the\ncount data of each country as previously described\n8.I nt h i sm o d e l ,\ntime (date) was used as the explanatory variable and the detection\nc o u n tf o re a c hv a r i a n ta st h ed e p e n d e n tv a r i a b l e .P a r a m e t e r si nt h e\nmodel were estimated using the maximum likelihood method with the\n“multinom” function in the“nnet” package v.7.3.18 in R v.4.2.1.\nIn estimating R\ne within the multinomial logistic model, it is\nnecessary to select one variant as the reference variant withRe =1 .\nIdeally, the reference variant should have the largest possible number\nof sequences. Additionally, a common reference variant must be\nchosen for all countries included in the analysis. To do this, weﬁrst\ncounted how many sequences of each variant were detected in each\ncountry. Then, we compared the detection counts across countries for\neach variant and calculated the minimum count for each variant across\ncountries. Finally, the variant with the highest minimum count was\nselected as the common reference variant for all countries. This\napproach allows us to choose a reference variant with the largest\nnumber of sequences registered across all countries, or at least in the\ncountry with the fewest sequences. Accordingly, the major genotype\nof the BA.5 lineage (equivalent to BA.5.2.1 in the PANGO lineage) was\nselected as the reference.\nWe then extracted the estimated growth rate (slope parameter) of\neach genotype relative to a reference genotype. The relativeR\ne of the\nviral lineage l,rl, was calculated according to the slope parameterβl of\nthe lineage asrl =e x pγβl\n/C0/C1\n,w h e r eγ is the average viral generation\ntime (2.1 days) ( http://sonorouschocolate.com/covid19/index.php?\ntitle=Estimating_Generation_Time_Of_Omicron)7.T h ee s t i m a t e dRe\nvalue for each genotype is summarized in Supplemental Data 1.\nEstimating relativeRe with the multinomial logistic regression\nmodel has certain limitations. Theﬁrst is that it can only estimate\nrelative Re values between variants; in other words, it cannot provide\nabsolute (non-relative) values ofRe. As a result, we cannot determine\nsolely based on these values whether an epidemic caused by a parti-\ncular variant will expand or subside. In this model, a variant’s dis-\nappearance from the viral population (its relative frequency becoming\nnegligible) is driven only by the expansion of other variants with a\nhigher R\ne. The second limitation of this model is the assumption that\nthe relativeRe between variants remains constant over time. In reality,\nthe relativeﬁt n e s so fv a r i a n t sc a nﬂuctuate in response to changes in\nthe host population’s immune status, inﬂuenced by factors such as\nnatural infections and vaccinations. In 2024, when most of the popu-\nlation has some immunity to SARS-CoV-2 due to vaccination or prior\ninfection, the impact of immune escape onﬁtness is likely more pro-\nnounced compared to the early stages of the COVID-19 pandemic in\n2020. The third limitation of this model is the assumption that the\naverage viral generation time remains constant across variants. This\nassumption does not always hold, as previous studies have estimated\ndifferences in generation time between the Delta and Omicron\nvariants\n47. Therefore, it is essential to interpret the estimated relative\nRe values with these limitations in mind.\nIn each viral clade, a small number of viral genotypes had emer-\ngence dates that were exceptionally earlier than the majority of other\ngenotypes. For instance, the earliest emergence date in clade 21 K\n(BA.1) is associated with hap_89965, which is recorded as January 1,\n2021. However, considering that BA.1 wasﬁrst identiﬁed in November\n2021, this date is likely erroneous. Additionally, in the analysis of pre-\ndiction performance for future variants described later, it is preferable\nfor the past–future cutoff dates (set at 1-month intervals) to align as\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 9\nclosely as possible with the actual emergence dates of the viral clades.\nTherefore, we excluded a small number of these earliest genotypes\nwith anomalously early emergence dates from the genotype–ﬁtness\ndataset. Speciﬁcally, genotypes with emergence dates earlier than\nNovember 30, 2021 for clade 21K (BA.1); December 31, 2021 for clade\n21L (BA.2); March 31, 2022 for clades 22A (BA.4) and 22B (BA.5); January\n31, 2022 for clade 22C (BA.12.1); May 31, 2022 for clade 22D (BA.2.75);\nAugust 31, 2022 for clades 22E (BQ.1) and 22F (XBB); November 30,\n2022 for clade 23A (XBB.1.5); February 28, 2023 for clade 23B\n(XBB.1.16); September 30, 2022 for clade 23C (CH.1.1); and May 31,\n2023 for clade 23F (EG.5.1) were removed from the dataset.\nPrior to the training step, we excluded S protein sequences con-\ntaining more than 5 ambiguous characters and more than 30 amino\nacid deletions from the dataset. Furthermore, we excluded viral gen-\notypes classiﬁed as Recombination clades (i.e., recombinant lineages,\nexcluding major recombinant lineages such as XBB) in the Nextclade\nclassiﬁcation. Also, we focused on countries where more than 300\ngenotypes were detected, which led to collecting data for 17 countries:\nAustralia, Belgium, Brazil, Canada, Denmark, France, Germany, India,\nItaly, Japan, Netherlands, South Korea, Spain, Sweden, Switzerland, the\nUK, and the USA. As a result of this additionalﬁltering, a total of 21,281\ngenotype–ﬁtness (relativeR\ne) data points, encompassing 12,817 gen-\notypes across 17 countries, were included in our genotype–ﬁtness\ndataset.\nThe estimatedﬁtness value was transformed using the natural\nlogarithm function, and then the data was scaled so that the 0.1 per-\ncentile and 99.9 percentile points fall between 0 and 1 before model\ntraining.\nPreparation of DMS data for mAbs evasion\nIn this study, we utilized DMS data on evasion from mAbs provided by\nCao et al.\n24. The processed DMS data, speciﬁcally the mutation-wise\nimmune escape score prepared for the antibody-escape estimator\ndeveloped by Greaney et al.\n37, was downloaded from the Bloom lab\nGitHub repository on April 11, 2023 (https://github.com/jbloomlab/\nSARS2_RBD_Ab_escape_maps/blob/main/processed_data/escape_data_\nmutation.csv). We applied speciﬁc exclusion criteria to the DMS data:\n(i) mAbs categorized as“SARS convalescents” and “WT-engineered”;\na n d( i i )m A b sw i t ha nI C\n50 value≥ 10, indicative of very weak binding\nafﬁnity, for the target virus. The escape score in this repository was\ncalculated using a DMS experiment using the ancestral D614G strain’s\nRBD. Following the methods of Greaney et al., we deﬁned a weighted\nescape score for each target virus (e.g., D614G and BA.2) from this\nescape score, following the method of Greaney et al. Speciﬁcally, the\nescape score was multiplied by the IC\n50 v a l u ef o rt h eSp r o t e i no ft h e\ntarget virus, followed by negative log transformation with a pseudo\ncount of 1. The weighted escape score was scaled so that the 0 and 95\npercentiles fell within the range 0–1, and values above 95 percentile\nwere clipped to 1. For the comprehensive training of CoVFit, the\nweighted escape values for D614G were employed. On the other hand,\nconsidering that variants predominantly circulating after early 2022\nare related to the BA.2 lineages, the weighted escape values for BA.2\nwere used in the training for CoVFit\nPast.\nDataset preparation for domain adaptation\nThe S protein sequences forCoronaviridae, except for SARS-CoV-2, were\ndownloaded from the NCBI Identical Protein Groups database (https://\nwww.ncbi.nlm.nih.gov/ipg) on July 3, 2023, using the following search\nquery: query:( “Alphacoronavirus”[Organism] OR “Betacoronavir-\nus”[Organism] OR“Gammacoronavirus”[Organism] OR coronavirus[All\nFields]) AND (spike[All Fields] OR S[All Fields] OR surface[All Fields])\nNOT (“Severe acute respiratory syndrome coronavirus 2”[Organism] OR\n(“Severe acute respiratory syndrome coronavirus 2 ”[Organism]\nOR (“Severe acute respiratory syndrome coronavirus 2”[Organism] OR\n(“Severe acute respiratory syndrome coronavirus 2”[Organism] OR\n(“Severe acute respiratory syndrome coronavirus 2”[Organism] OR\n(“Severe acute respiratory syndrome coronavirus 2 ”[Organism]\nOR (“Severe acute respiratory syndrome coronavirus 2”[Organism]\nOR (“Severe acute respiratory syndrome coronavirus 2”[Organism] OR\n(“Severe acute respiratory syndrome coronavirus 2 ”[Organism]\nOR (“Severe acute respiratory syndrome coronavirus 2”[Organism] OR\nSARS-CoV-2[All Fields])))))))))) NOT (“unidentiﬁed”[Organism] OR\n(“unidentiﬁed”[Organism] OR ( “unidentiﬁed”[Organism] OR ( “uni-\ndentiﬁed”[Organism] OR (“unidentiﬁed”[Organism] OR“Unknown”[All\nFields]))))) NOT “unidentiﬁed human coronavirus”[Organism] NOT\n(“synthetic construct”[Organism]) AND (“1000”[SLEN]: “1500”[SLEN]).\nThe metadata associated with thesesequences were also downloaded.\nThe S protein for the SARS-CoV-2 Wuhan-Hu-1 strain was downloaded\nusing NCBI Datasets Command-line tools v.15.6.1 (https://www.ncbi.nlm.\nnih.gov/datasets/docs/v2/download-and-install/) and subsequently\nincorporated into our dataset. Sequences with more than 5% uni-\ndentiﬁed amino acids wereﬁltered out. Next, we removed redundant\nsequences using CD-HIT v.4.8.148 with a clustering threshold of 99%\nsequence identity. However, even after the CD-HITﬁltering, a large\nnumber of sequences (i.e., 796 sequences) corresponding to the porcine\nepidemic diarrhea virus (PEDV) remained in the dataset. To reduce the\nredundancy of this virus group, we randomly selected 10 representative\nPEDV sequences to retain in our dataset. Consequently, 1392Cor-\nonaviridaesequences were included in our dataset.\nIn addition to theCoronaviridaeS protein dataset, we prepared a\ndataset for the SARS-CoV-2 S protein speciﬁcally for domain adapta-\ntion. Of the S protein genotypes we deﬁned in this study (see the\nsection “Preparation of genotype–ﬁtness dataset”), we eliminated\ngenotypes with an emergence date later than August 31, 2022, in order\nto prevent the model from accessing data beyond this cutoff date\nduring the domain adaptation process. Subsequently, we removed\nredundant sequences using CD-HIT with a clustering threshold of 99%,\nin accordance with the method described above. Consequently, 114 S\nprotein sequences of SARS-CoV-2 were retained in the dataset. Finally,\nwe combined theCoronaviridae and SARS-CoV-2 S protein datasets,\nresulting in 1506 sequences, for use in domain adaptation. The S\nprotein sequence information used in the domain adaptation step is\nsummarized in Supplemental Data 2.\nIntroduction of CoVFit\nWe developed CoVFit, aﬁtness prediction model based on S protein\nsequences, byﬁnetuning the ESM-2 protein language model (Fig.1a).\nTo enhance the model’s performance, we employed three key tech-\nniques: domain adaptation, multitask learning, and Low-Rank Adap-\ntation (LoRA)\n49. Domain adaptation is an additional pretraining phase\nusing a custom data collection. In this study, we performed domain\nadaptation using S protein sequences from various human and ani-\nmal coronaviruses (see the“Dataset preparation for domain adap-\ntation” section). This technique enabled the model to better learn the\ngeneral properties of these proteins (see the“Domain adaptation”\nsection). Multitask learning, a framework that trains a model on\ndifferent types of data simultaneously, was utilized to allow the\nmodel to capture critical information shared across tasks, thereby\nenhancing its generalization capabilities. In CoVFit, the model was\nﬁnetuned using a total of 1,565 regression tasks, including to predict\nﬁtness values for 17 countries and to predict relative binding afﬁnity\nfor 1548 mAbs (see the “Model architecture of CoVFit” section).\nFinally, LoRA is a technique toﬁne-tune large models efﬁciently that\nreduces the requirements for GPU memory resources without com-\npromising the model’s prediction performance. LoRA additionally\ncontributes to mitigating the model’s tendency to overﬁt (see the\n“Model ﬁnetuning and performance evaluation” section for further\ninformation).\nThe input for CoVFit consists of amino acid sequences of SARS-\nCoV-2 S proteins, aligned with the S protein of the Wuhan-Hu-1 strain.\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 10\nThese aligned sequences can be generated by Nextclade. CoVFit can\npredict theﬁtness (relativeRe) value across 17 countries and the ability\nto evade 1548 types of mAbs for a given S protein sequence (Fig. S1a).\nTraining of the CoVFit model completes within 24 h on a com-\nputational node with a single Nvidia A100 GPU (40GB) for each\ninstance. Consequently, the model can be updated routinely using the\nlatest genome surveillance data without intensive computational\nresource requirements.\nUtilizing a ﬁve-fold cross-validation scheme, we generatedﬁve\ninstances of the CoVFit model, which enabled us to estimate both the\naverage prediction value and its uncertainty across these models\n(Fig. 1b). This approach was chosen because the predicted values,\nespecially regarding theﬁtness of future variants, can vary among\ndifferent instances of the trained models (Fig.3).\nCoVFit implementation\nESM-2 models with various parameter sizes are available32 (https://\ngithub.com/facebookresearch/esm). Of these models, we used the\nversion with 650M parameters, prioritizing a balance between pre-\ndiction performance and computational cost. According to the ofﬁcial\nbenchmark using the unsupervised contact prediction task, this 650M\nparameter model achieves a performance 1.7 times superior compared\nto the 35M parameter model, which possesses 20 times fewer para-\nmeters. However, the performance gain when comparing the 650M\nmodel to the 15 billion (B) parameter model, which has 20 times more\nparameters, is relatively modest at only 1.08 times. Furthermore, a\nsystematic analysis presented in a recent preprint indicates that\nenlarging the parameter size of a protein language model does not\nnecessarily enhance prediction performance for tasks outside of pro-\ntein structure prediction\n50. Given this insight, we opted not to employ\nmodels larger than the 650M model, such as the 3B or 15B models, in\nour study.\nThe ESM-2 model has a maximum input sequence length (1024\namino acids) due to the computational demands of self-attention,\nwhich requires memory in proportion to the square of the sequence\nlength (O(L\n2)). Unfortunately, the S protein of the Wuhan-Hu-1 strain\nis composed of 1273 amino acids, exceeding the model’s limit.\nConsequently, amino acid sequences beyond the 1024th position\n(amino acids 1025–1273; the C-terminus of the S2 subunit) are\ntruncated and not utilized in the ESM-2 model. This constitutes a\ntechnical limitation of CoVFit. Nonetheless, this limitation is\nanticipated to minimally impact performance, considering that\nwhile mutations predominantly occur within the S1 subunit (amino\nacids 1–681), the S2 subunit (amino acids 682–1273) remains highly\nconserved and with fewer mutations.\nCoVFit was implemented using Python v.3.11.4, NVIDIA CUDA\nv.12.1.0, PyTorch v.2.1.0, Transformers v.4.31.0, and PEFT v.0.5.0. Fur-\nther information about the system requirements for CoVFit can be\nfound in the GitHub repository ( https://github.com/TheSatoLab/\nCoVFit). The computational codes were executed on a super-\ncomputer node equipped with a single NVIDIA A100 GPU with 40 GB\nRAM unless otherwise noted.\nDomain adaptation\nTo establish the ESM-2Coronaviridaemodel, domain adaptation was car-\nried out using the masked language learning scheme as described in\nDelvin et al.\n51. For domain adaptation, the S protein dataset prepared in\nthe “Dataset preparation for domain adaptation” section was used. For\nour model’s domain adaptation training, each input sequence had 15%\nof its positions masked randomly, with each instance of a position’s\nmasking having an 80% chance to be a <mask> token, a 10% chance to\nbe incorrect, and a 10% chance to be the original. Subsequently, amino\nacid or token types for these 15% of positions were predicted in bat-\nched training steps, and model weights were updated using a cross-\nentropy loss function.\nUsing the scheme above, we trained the 650M parameter ESM-2\nmodel with the provided MaskedLM layer, downloaded via functions\nimplemented in the Hugging Face Transformers library. The model\nwas trained for 30 epochs. The batch size was set at 5. A base learning\nrate of 2e/C0 5 was used with one epoch of warmup, and a cosine-based\nlearning rate scheduler was implemented to successively lower the\nlearning rate during training.\nTo compare the inference ability of the ESM-2\nCoronaviridaemodel to\nthe original ESM-2 model, we performed inference with both models\non masked SARS-CoV-2 S protein sequences. Since our dataset for\ndomain adaptation training includes the S proteins of genotypes that\nemerged up to August 31, 2022, we used genotypes with emergence\ndates later than September 1, 2022, for inference. The same masking\nparameters as in the training were used. The results on the test dataset\nwere converted to perplexity scores as the exponential of the cross-\nentropy loss value calculated during inference. Given as\nperplexity = e\n/C0\nP\nx PxðÞ logQðxÞ where PðxÞ is the true probability dis-\ntribution and QðxÞ is the probability distribution from the model’s\npredictions, the perplexity score represents how certain the model is\nin making its predictions, with lower values demonstrating higher\ncertainty. For our inference results, the original ESM-2 model pro-\nduced a perplexity score of 11.38, whereas the ESM-2\nCoronaviridaemodel\nachieved a low perplexity score of 1.17, demonstrating higher predic-\ntion certainty after domain adaptation training (Fig. S1c).\nTo assess the possibility of the domain adaptation negatively\nimpacting the model’s original ability to provide inference on a wide\nvariety of proteins, we again compared the original EMS-2 and ESM-\n2\nCoronaviridae models, this time with protein sequences sampled from\nthe UniRef50 released in March 2018. A subset consisting of\n29,950 sequences was randomly sampled from the full\n3,016,211 sequences and used for the evaluation. The perplexity values\nof the models were checked as above for the two models, with the\noriginal ESM-2 model’s perplexity score at 6.76 and the ESM-\n2\nCoronaviridaemodel’s perplexity score at 6.86, demonstrating that the\nmodel retains its certainty on general proteins after domain adaptation\n(Fig. S1c).\nWe conducted the domain adaptation training in Python v3.10.9\nwith CUDA v12.1.1 and torch v2.1.0.dev20230601 using the Hugging\nFace Transformers v4.34.1 library.\nThe computation was executed on a single NVIDIA RTX 6000 Ada\nGPU with 48 GB RAM. More detailed information on implementation is\navailable in the GitHub repository (https://github.com/TheSatoLab/\nCoVFit).\nModel architecture of CoVFit\nFor the multitask learning component, we engineered custom task-\nspeciﬁc regression heads for the ESM-2 model (Fig. S1a). On the\nembedding layer of ESM-2, a linear layer with dimensions equal to the\nnumber of tasks was set as task-speciﬁc heads. Additionally, an inter-\nmediate linear layer with 252 dimensions connecting the embedding\nlayer and the task-head layer was set.\nIn CoVFit, a single input sequence is linked to multiple target\nvariables due to the multitask learning framework. For example,\nregarding DMS data, a typical S protein mutant (input sequence) is\nlinked to relative binding afﬁnity values for >1000 mAbs (target vari-\nables). To boost computational efﬁciency, CoVFit utilizes an archi-\ntecture that processes a single input sequence alongside its multiple\ncorresponding target variables in parallel, rather than processing pairs\nof the same input sequence and one target variable sequentially\n(Fig. S1b). As a result, the loss values for multiple target variables\nassociated with a single input sequence are calculated simultaneously.\nHowever, the number of tasks linked to each input sequence can\ndiffer greatly, especially when comparing the variant S protein\nsequences used forﬁtness prediction (up to 17 tasks) against the\nmutant sequences used for DMS predictions (up to 1548 tasks).\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 11\nConsequently, the magnitude of the loss value for each dataset can\nvary signiﬁcantly based on the number of associated tasks, which can\nlead to training instability. To stabilize the training process, CoVFit\nutilized non-overlapping random sampling to create data chunks\nwhere a single input sequence is associated with target variables for a\nmaximum of 10 tasks. These generated sequence-variable chunks were\nthen used as the training inputs.\nFor the loss function, CoVFit utilizes a custom least squares\napproach weighted according to individual tasks. In principle, the\nweights were determined to be proportional to the reciprocals of the\ntask frequencies. One exception was implemented where, forﬁtness\nprediction tasks for genotypes that emerged after January 1, 2022, we\nadjusted the weights by doubling them.\nModel ﬁnetuning and performance evaluation\nIn CoVFit, weﬁnetuned the custom model based on ESM-2 using the\nLoRA technique implemented in the Hugging Face PEFT v.0.5.0. Low-\nrank adapters were injected into the weight matrices of the key, query,\nand value components, as well as those for the dense layers. Full\nﬁnetuning was applied to these adapters and the custom regression\nheads added onto ESM-2, while the other, original layers were kept\nfrozen in their pretrained state. A rank parameter ofr = 8 and a scale\nparameter of alpha = 16 were used. Consequently, out of the total\n659,741,475 parameters, the model has 7,768,974 trainable para-\nmeters, which constitutes ~1.18% of the total. The LoRA dropout rate\nwas set at 0.05.\nFor ﬁnetuning, the AdamW optimizer was used with a weight\ndecay parameter of 0.02. The maximum learning rate was set at 2.0E-4\nwith a linear learning rate scheduler, and the training was conducted\nover 20 epochs with a warmup ratio of 0.05. The batch size was set at 4\nwith gradient accumulation steps of 2.\nThe genotype–ﬁtness and DMS datasets were randomly divided\ninto training, evaluation, and test datasets in a 6:2:2 ratio. For the\ngenotype–ﬁtness dataset, we considered the combinations of country\nand Nextclade clade, ensuring that data representing each combina-\ntion were evenly distributed across the training-evaluation and test\ndatasets. Similarly, for the DMS dataset, the types of mAbs were con-\nsidered during the data splitting process. We conducted the data\nsplitting with aﬁve-fold cross-validation approach.\nIn our experiments aimed at assessing the model’s ability to pre-\ndict the performance of future variants, we began by dividing the\ngenotype–ﬁtness dataset into two: one for past variants and another\nfor future variants, based on their emergence dates. We generated\neight datasets using eight cutoff dates, spaced 1 month apart, from\nJanuary 31, 2022, to August 31, 2022 (Fig.3b). Training was done using\nthese datasets according to the scheme described above.\nIn our experiments designed to assess the importance of includ-\ning DMS data for immune evasion, we trained alternative instances\nwithout incorporating the DMS dataset for comparison. Likewise, in\nour experiments evaluating the signiﬁcance of the domain adaptation\nstep, we employed the original ESM-2 model rather than the version\nadapted to the coronaviral S protein dataset.\nCoVFit-CLI\nThe CoVFit-CLI tool packages CoVFitNov23 via pyinstaller 6.4.0 using\nPython v.3.10.9, torch v.2.1.2, transformers 4.37.1, and bio v.1.5.9 with\nCUDA v.12.3 on x86_64 Linux, kernel 5.15.0.\nDevelopment ofﬁtness prediction models based on non-deep\nlearning models\nWe constructedﬁtness prediction models based on LASSO, Random\nForest, and LightGBM to compare the prediction performance of\nCoVFit with those of these models. LASSO employs a linear regression\nframework enhanced with L1 regularization, offering a method to\ninclude penalty terms that reduce overﬁtting by shrinking some\ncoefﬁcients to zero. In contrast, Random Forest and LightGBM are\nadvanced, decision tree-based models known for their greater\nexpressive capability. These models aim to predict a variant’s ﬁtness\nvalue based on its amino acid mutation proﬁle in the S protein and the\ncountry of origin. Both the mutation proﬁle and the country data were\none-hot encoded to serve as input features for the models.\nWe trained these models and evaluated their performance using\nthe past–future variant datasets with eight cutoff dates, spaced\n1 month apart, from January 31, 2022, to August 31, 2022, and theﬁve-\nfold cross-validation scheme as described in the“Modelﬁnetuning and\nperformance evaluation” section. In the training dataset, we selected\n200 features to be used as inputs of the models according to the\nfeature importance estimated by Random Forest. We trained the\nmodels with hyperparameter-tuning using a Bayesian optimization\nmethod. In this process,R\n2 was used as the optimization metric, and\nthe number of iterations was set at 20. The parameter spaces searched\nin this step are described in detail in the GitHub repository (https://\ngithub.com/TheSatoLab/CoVFit).\nThe machine learning models above were reconstructed using\nPython v.3.9.13, pandas v.1.4.4, numpy v.1.21.5, lightgbm v.3.3.5, scikit-\nlearn v.1.0.2, and scikit-optimize v.0.9.0.\nPhylogenetic analysis\nWe created the dataset for phylogenetic analysis as a subset of the\ndataset of the representative viral genome sequences encoding\nrespective S protein genotypes (EPI_SET_ID: EPI_SET_240311ma;\nhttps://www.gisaid.org;s e e“Preparation of genotype–ﬁtness dataset”\nsection). We removed sequences matching the following criteria: (i)\nsequences with >3% ambiguous characters across positions 265 to\n29,673 (in alignment with the Wuhan-Hu-1 reference (GenBank acces-\nsion number: NC_045512.2 [https://www.ncbi.nlm.nih.gov/nuccore/\n1798174254])) and (ii) sequences classiﬁed as“recombinant” accord-\ning to Nextclade clade assignments. Additionally, we included the\nWuhan-Hu-1 reference genome sequence to our dataset. The dataset\nfor viral genome sequences used in the phylogenetic analysis, except\nfor the Wuhan-Hu-1 reference genome, is summarized under the\nEPI_SET_ID: EPI_SET_240311rk, which can be accessed through the\nGISAID website (https://gisaid.org/).\nThe nucleotide viral genome sequences were aligned to the\nreference sequence of Wuhan-Hu-1 using Minimap2 v.2.17\n52.T h i s\nalignment was then converted into a multiple sequence alignment\nfollowing the GISAID phylogenetic analysis pipeline (https://github.\ncom/roblanf/sarscov2phylo). Sites corresponding to positions 1–265\nand 29,674–29,903 in the reference genome were masked, that is,\nconverted to“NNN,” to exclude them from subsequent analyses. The\nmaximum likelihood phylogenetic tree was constructed using IQ-TREE\nv.2.1.4_beta, adopting the GTR+I+G nucleotide substitution model\n53.\nTo assess the reliability of the phylogenetic tree nodes, an ultrafast\nbootstrap analysis was performed with 1000 replicates. A time-\nresolved phylogenetic tree was inferred from the constructed tree\nusing TreeTime v.0.11.1, with the rerooting strategy set to“oldest”\n54,\nresulting in rerooting by the Wuhan-Hu-1 strain. The S protein\nsequences for ancestral nodes were also reconstructed using Time-\nTree with the default options.\nDetection of phylogenetic branches withﬁtness elevation\nusing CoVFit\nTo infer the impact of mutations onﬁtness through the observed\nevolution of SARS-CoV-2, we analyzed the increase in predictedﬁtness\nacross all branches of the SARS-CoV-2 phylogenetic tree, as outlined in\nthe “Phylogenetic analysis” section. We employed ﬁve CoVFitNov23\nmodels, developed via aﬁve-fold cross-validation, to predict theﬁtness\nvalues for both existing and reconstructed ancestral S protein\nsequences within the tree. Since CoVFit predictsﬁtness across multiple\ncountries, we averaged these predictions to obtain a single\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 12\nrepresentative ﬁtness value for each sequence, resulting in ﬁve\nrepresentativeﬁtness values per sequence. We compared these values\nbetween each node and its ancestral node, calculating the meanﬁtness\ngain for the branches connecting them. Statistical signiﬁcance ofﬁt-\nness changes was determined using a paired Welch’s t-test, with mul-\ntiple testing correction applied via the Benjamini–Hochberg method.\nBranches with an FDR less than 0.1 were considered statistically sig-\nniﬁcant. We also identiﬁed mutations in the S protein acquired along\neach branch by comparing the S protein sequences at both ends of the\nbranch. The detected ﬁtness elevation events are summarized in\nSupplemental Data 3.\nCharacterization of the F456L substitution using publicly avail-\nable DMS data\nPosition-wise scores for escape from humoral immunity were calcu-\nlated using escape estimator37 based on DMS data for the ability to\nevade mAbs presented in Cao et al.24 (https://github.com/jbloomlab/\nSARS2_RBD_Ab_escape_maps)( s h o w ni nF i g .5c). For the ACE2 binding\nand protein expression DMS data, we retrieved the per-site variant\nscore results presented by Taylor and Starr\n36 (https://github.com/\ntstarrlab/SARS-CoV-2-RBD_DMS_Omicron-XBB-BQ/blob/main/results/\nﬁnal_variant_scores/ﬁnal_variant_scores.csv). Weﬁltered for mutant L\non position 456 and retrieved the“delta_bind” and “delta_expr” values\npresenting the mean of values acrossr e p l i c a t e sm i n u st h em e a nf o rt h e\nreference residue for each variant target (shown in Fig.5d).\nCoVFit-based in silico (deep) mutational scanning analysis\nInstances of the CoVFitnonJN1 model, models trained on the dataset\nwithout the sequences of JN.1, were utilized to infer theﬁtness of S\nprotein mutants. First, the meanﬁtness value for each mutant was\ncalculated across different countries. Subsequently, these mean values\nwere averaged across allﬁve CoVFit\nnonJN1 model instances, yielding a\nsingular averageﬁtness value for each S protein mutant. This stream-\nlined ﬁtness value was then compared to theﬁtness of the original\nbackbone S protein sequence.\nEpidemic analysis on JN.1 subvariants\nWe retrieved all SARS-CoV-2 genome sequences and their associated\nmetadata available up to October 21, 2024, fromGISAID.T oe n s u r e\ndata quality, sequences were excluded from analysis based on the\nfollowing criteria: (i) absence of collection date; (ii) samples taken from\nanimals other than humans; (iii) more than 2% undetermined nucleo-\ntides; or (iv) samples collected during quarantine. We analyzed the\nBA.2.86 lineage collected between October 1, 2023, and July 31, 2024\n(EPI SET ID: EPI_SET_241126wq).\nWe calculated the proportion of viral sequences harboring\nmutations at speciﬁc sites within the BA.2.86 lineage. Each viral lineage\ncategory includes its descendant lineages unless those descendant\nlineages are explicitly deﬁned as separate categories. For the temporal\ntrends in mutation and variant detection frequencies, calculations\nwere performed at 7-day intervals for each geographic region within\nthe BA.2.86 population. Results from Africa and South America were\nexcluded due to the low total sequence count.\nMethodological discussion:room for improvement of CoVFit\nWe recognize the presence of multiple areas where CoVFit could\npotentially be improved with future development. First, since our\ncurrent model is solely trained on S protein sequences, it may be\npossible to improve its performance by including information on\nadditional viral proteins. Previous studies have identiﬁed mutations\nassociated with increasedﬁtness also in non-S proteins, particularly in\nthe nucleocapsid (N) protein, supporting the possible effectiveness of\nthis approach\n4. In the current setting, the effects of mutations in non-S\nproteins are absorbed into the effects of mutations in the S protein\nthat have linkage disequilibrium relationships with these mutations.\nHowever, it is certain that the S protein has a particularly strong impact\non ﬁtness compared to other viral proteins\n4. Therefore, it is unclear to\nwhat extent prediction accuracy would be improved by adding infor-\nmation from other viral proteins. There is even a possibility that gen-\neralizability could be decreased by including other viral proteins due\nto the decrease in signal-to-noise ratio. Similarly, although the amino\nacid sequences of the S protein beyond the 1024th position (amino\nacids 1025–1273; the C-terminus of the S2 subunit) are truncated and\nnot utilized in the ESM-2 model, it is unclear whether this limitation has\na negative effect on prediction performance, as the S2 subunit (amino\nacids 682–1273) remains highly conserved and has fewer mutations.\nSecond, it may also be possible to improve the performance by\nincluding various DMS data, such as those on other viral phenotypes.\nIn this study, we only used DMS data on the immune evasion ability\nagainst mAbs. However, given the signiﬁcant impact of the ACE2-\nbinding afﬁnity of the S protein onﬁtness, employing DMS data for this\ntrait could improve predictive performance. In our preliminary\nexperiments, however, we found that the convergence speed for DMS\ndata on binding afﬁnity to ACE2 was much slower compared to other\ntasks. Considering the difﬁculty of simultaneous learning, we decided\nnot to use this DMS data in this study. Similarly, while we used DMS\ndata based on the ancestral strain (D614G), incorporating DMS data\nobtained by experiments using S proteins of other variants (particu-\nlarly variants emerged recently) could potentially further improve\npredictive performance.\nThe third consideration is the scaling up of the model. It is gen-\nerally known that language models improve in performance as they\nincrease in size. Indeed, benchmark tests using ESM-2 have shown that\nchanging the model size from the 650M, used in this study, to 3B or 15B\ncan lead to slight improvements in performance regarding the pre-\ndiction of protein structures\n32. For our method, using larger models\nlike 3B or 15B models may also enhance performance. Recently\ndeveloped techniques, such as QLoRA, a quantization-based LoRA\n55,\nmake it possible to ﬁne-tune even 15B models in a limited GPU\nresource. However, we faced issues with incompatibility between\nCoVFit and QLoRA, leading us to abandon the development of a\nQLoRA-based model. It is also important to note that scaling up the\nmodel can signiﬁcantly increase training and inference times.\nThe fourth consideration is data augmentation forﬁtness data. In\nviral genome surveillance, there can be a delay of several weeks to\nmonths between the date of sample collection and the date of data\nsubmission to databases. Furthermore, in viral genome surveillance,\nthe number of viral genomes newly sequenced have gradually\ndecreased in recent years (https://gisaid.org/). Consequently, the most\nrecent genomic data tends to be under-sampled. However, this recent\ndata is considered to contain more critical information for predicting\nfuture variants compared to older data. Therefore, increasing the\nproportion of recent data in the training dataset or employing data\naugmentation techniques, which artiﬁcially expand the dataset, might\nenhance the model’s ability to generalize to future variants.\nLastly, since we have not conducted an exhaustive investigation of\nthe model’s hyperparameters, the model’s performance could be\nimproved by adjusting them. Adjustable hyperparameters include data\nnormalization methods, network architecture, task weight balance, the\noptimizer algorithm, learning rate, and maximum epoch numbers.\nReporting summary\nFurther information on research design is available in the Nature\nPortfolio Reporting Summary linked to this article.\nData availability\nSurveillance datasets of SARS-CoV-2 genomes are available from the\nGISAID database (https://www.gisaid.org; EPI_SET_240307pq; EPI_-\nSET_240311ma; EPI_SET_240311rk; EPI_SET_241126wq). The supple-\nmental table for each GISAID dataset is available in the GitHub\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 13\nrepository (https://github.com/TheSatoLab/CoVFit). Source data are\nprovided with this paper.\nCode availability\nThe computational codes used in this study are available in the GitHub\nrepository (https://github.com/TheSatoLab/CoVFit).\nReferences\n1. Pybus, O. G. & Rambaut, A. Evolutionary analysis of the dynamics of\nviral infectious disease.Nat. Rev. Genet.10,5 4 0–550 (2009).\n2. Carabelli, A. M. et al. SARS-CoV-2 variant biology: immune escape,\ntransmission andﬁtness. Nat. Rev. Microbiol.21,1 6 2–177 (2023).\n3. Markov, P. V. et al. The evolution of SARS-CoV-2.Nat. Rev. Microbiol.\n21,3 6 1–379 (2023).\n4. Obermeyer, F. et al. Analysis of 6.4 million SARS-CoV-2 genomes\nidentiﬁes mutations associated withﬁtness. Science 376,\n1327–1332 (2022).\n5. Zhou, P. et al. A pneumonia outbreak associated with a new cor-\nonavirus of probable bat origin.Nature 579,2 7 0–273 (2020).\n6. Chen, Y. et al. Broadly neutralizing antibodies to SARS-CoV-2 and\nother human coronaviruses.Nat. Rev. Immunol.23,1 8 9–199 (2023).\n7. Suzuki, R. et al. Attenuated fusogenicity and pathogenicity of SARS-\nCoV-2 Omicron variant.Nature 603,7 0 0–705 (2022).\n8. Yamasoba, D. et al. Virological characteristics of the SARS-CoV-2\nOmicron BA.2 spike.Cell 185,2 1 0 3–2115.e2119 (2022).\n9. Kimura, I. et al. Virological characteristics of the SARS-CoV-2 Omi-\ncron BA.2 subvariants, including BA.4 and BA.5.Cell 185,\n3992–4007.e3916 (2022).\n10. Saito, A. et al. Virological characteristics of the SARS-CoV-2 Omi-\ncron BA.2.75 variant.Cell Host Microbe30,1 5 4 0–1555.e1515 (2022).\n11. Ito, J. et al. Convergent evolution of SARS-CoV-2 Omicron sub-\nvariants leading to the emergence of BQ.1.1 variant.Nat. Commun.\n14, 2671 (2023).\n12. Tamura, T. et al. Virological characteristics of the SARS-CoV-2 XBB\nvariant derived from recombination of two Omicron subvariants.\nNat. Commun.14, 2800 (2023).\n13. Uriu, K. et al. Enhanced transmissibility, infectivity, and immune\nresistance of the SARS-CoV-2 omicron XBB.1.5 variant.Lancet\nInfect. Dis.23,2 8 0–281 (2023).\n14. Yamasoba, D. et al. Virological characteristics of the SARS-CoV-2\nomicron XBB.1.16 variant.Lancet Infect. Dis.23,6 5 5\n–656 (2023).\n15. Kaku, Y. et al. Antiviral efﬁcacy of the SARS-CoV-2 XBB break-\nthrough infection sera against omicron subvariants including EG.5.\nLancet Infect. Dis.23,e 3 9 5–e396 (2023).\n16. Uriu, K. et al. Transmissibility, infectivity, and immune evasion of the\nSARS-CoV-2 BA.2.86 variant.Lancet Infect. Dis.23,\ne460–e461 (2023).\n17. Kosugi, Y. et al. Characteristics of the SARS-CoV-2 omicron HK.3\nvariant harbouring the FLip substitution.Lancet Microbe5,\ne313 (2024).\n18. Tamura, T. et al. Virological characteristics of the SARS-CoV-2\nBA.2.86 variant.Cell Host Microbe32,1 7 0–180.e112 (2024).\n19. Kaku, Y. et al. Virological characteristics of the SARS-CoV-2 JN.1\nvariant.Lancet Infect. Dis.24, e82 (2024).\n20. Davies, N. G. et al. Estimated transmissibility and impact of SARS-\nCoV-2 lineage B.1.1.7 in England.Science 372, eabg3055 (2021).\n21. Vöhringer, H. S. et al. Genomic reconstruction of the SARS-CoV-2\nepidemic in England.Nature 600,5 0 6–511 (2021).\n22. Ito, K., Piantham, C. & Nishiura, H. Estimating relative generation\ntimes and reproduction numbers of Omicron BA.1 and BA.2 with\nrespect to Delta variant in Denmark.Math. Biosci. Eng.19,\n9005–9017 (2022).\n23. Yajima, H. et al. Molecular and structural insights into SARS-CoV-2\nevolution: from BA.2 to XBB subvariants.mBio 15, e0322023\n(2024).\n24. Cao, Y. et al. Imprinted SARS-CoV-2 humoral immunity induces\nconvergent Omicron RBD evolution.Nature 614,5 2 1–529 (2023).\n25. Planas, D. et al. Distinct evolution of SARS-CoV-2 Omicron XBB and\nBA.2.86/JN.1 lineages combining increasedﬁtness and antibody\nevasion.Nat. Commun.15, 2254 (2024).\n26. Khan, K. et al. Evolution and neutralization escape of the SARS-CoV-\n2B A . 2 . 8 6s u b v a r i a n t .Nat. Commun.14, 8078 (2023).\n27. Wang, Q. et al. Alarming antibody evasion properties of rising SARS-\nCoV-2 BQ and XBB subvariants.Cell 186,2 7 9–286.e278 (2023).\n28. Meng, B. et al. Altered TMPRSS2 usage by SARS-CoV-2 Omicron\nimpacts infectivity and fusogenicity.Nature 603,7 0 6–714 (2022).\n29. Tsujino, S. et al. Virological characteristics of the SARS-CoV-2\nOmicron EG.5.1 variant.Microbiol Immunol.68,3 0 5–330 (2024).\n30. Masuda, Y. et al. Characterization of the evolutionary and virological\naspects of mutations in the receptor binding motif of the SARS-\nCoV-2 spike protein.Front. Virol.3, 1328229 (2023).\n31. Bepler, T. & Berger, B. Learning the protein language: Evolution,\nstructure, and function.Cell Syst.12,6 5 4–669.e653 (2021).\n32. Lin, Z. et al. Evolutionary-scale prediction of atomic-level protein\nstructure with a language model.Science 379, 1123–1130 (2023).\n33. Starr, T. N. et al. Deep mutational scanning of SARS-CoV-2 receptor\nbinding domain reveals constraints on folding and ACE2 binding.\nCell 182,1 2 9 5–1310.e1220 (2020).\n34. Yajima, H. et al. Structural basis for receptor-binding domain\nmobility of the spike in SARS-CoV-2 BA.2.86 and JN.1.Nat. Com-\nmun. 15,8 5 7 4( 2 0 2 4 ) .\n35. Jackson, C. B., Farzan, M., Chen, B. & Choe, H. Mechanisms of SARS-\nCoV-2 entry into cells.Nat. Rev. Mol. Cell Biol.23,3 –20 (2022).\n36. Taylor, A. L. & Starr, T. N. Deep mutational scans of XBB.1.5 and\nBQ.1.1 reveal ongoing epistatic drift during SARS-CoV-2 evolution.\nPLoS Pathog.19, e1011901 (2023).\n3 7 . G r e a n e y ,A .J . ,S t a r r ,T .N .&B l o o m ,J .D .A na n t i b o d y - e s c a p ee s t i -\nmator for mutations to the SARS-CoV-2 receptor-binding domain.\nVirus Evol.8, veac021 (2022).\n38. Dadonaite, B. et al. Spike deep mutational scanning helps predict\nsuccess of SARS-CoV-2 clades.Nature 631,6 1 7–626 (2024).\n39. Chen, L. et al. Virological characteristics of the SARS-CoV-2 LP.8.1\nvariant.Lancet Infect. Dis.25, e193 (2025).\n40. Han, W. et al. Predicting the antigenic evolution of SARS-COV-2\nwith deep learning.Nat. Commun.14, 3478 (2023).\n41. Thadani, N. N. et al. Learning from prepandemic data to forecast\nviral escape.Nature 622,8 1 8–825 (2023).\n42. Hie, B., Zhong, E. D., Berger, B. & Bryson, B. Learning the language of\nviral evolution and escape.Science 371,2 8 4–288 (2021).\n43. Hie, B. L., Yang, K. K. & Kim, P. S. Evolutionary velocity with protein\nlanguage models predicts evolutionary dynamics of diverse pro-\nteins. Cell Syst.13,2 7 4–285.e276 (2022).\n44. Focosi, D., Quiroga, R., McConnell, S., Johnson, M. C. & Casadevall\nA. Convergent evolution in SARS-CoV-2 spike creates a variant soup\nfrom which new COVID-19 waves emerge.Int. J. Mol. Sci.24,\n2264 (2023).\n45. Bloom, J. D. & Neher, R. A. Fitness effects of mutations to SARS-\nCoV-2 proteins.Virus Evol.9, vead055 (2023).\n46. Hadﬁeld, J. et al. Nextstrain: real-time tracking of pathogen evolu-\ntion. Bioinformatics34,4 1 2 1–4123 (2018).\n47. Madewell, Z. J. et al. Rapid review and meta-analysis of serial\nintervals for SARS-CoV-2 Delta and Omicron variants.BMC Infect.\nDis. 23,4 2 9( 2 0 2 3 ) .\n48. Fu, L., Niu, B., Zhu, Z., Wu, S. & Li, W. CD-HIT: accelerated for\nclustering the next-generation sequencing data.Bioinformatics28,\n3150–3152 (2012).\n49. Hu, E. J. et al. LoRA: low-rank adaptation of large language mod-\nels. Preprint athttps://ui.adsabs.harvard.edu/abs/\n2021arXiv210609685H(2021).\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 14\n50. Li, F.-Z., Amini, A. P., Yue, Y., Yang, K. K. & Lu A. X. Feature reuse and\nscaling: understanding transfer learning with protein language\nmodels. bioRxiv, 2024.2002.2005.578959 (2024).\n51. Devlin, J., Chang, M.-W., Lee, K. & Toutanova K. BERT: pre-training of\ndeep bidirectional transformers forlanguage understanding. Preprint\nat https://ui.adsabs.harvard.edu/abs/2018arXiv181004805D(2018).\n52. Li, H. Minimap2: pairwise alignment for nucleotide sequences.\nBioinformatics34,3 0 9 4–3100 (2018).\n53. Minh, B. Q. et al. IQ-TREE 2: new models and efﬁcient methods for\nphylogenetic inference in the genomic era.Mol. Biol. Evol.37,\n1530–1534 (2020).\n5 4 . S a g u l e n k o ,P . ,P u l l e r ,V .&N eher, R. A. TreeTime: maximum-\nlikelihood phylodynamic analysis.Virus Evol.4,v e x 0 4 2( 2 0 1 8 ) .\n55. Dettmers, T., Pagnoni, A., Holtzman, A. & Zettlemoyer, L. QLoRA:\nefﬁcientﬁnetuning of quantized LLMs. Preprint athttps://ui.adsabs.\nharvard.edu/abs/2023arXiv230514314D(2023).\n56. Benton, D. J. et al. The effect of the D614G substitution on the\nstructure of the spike glycoprotein of SARS-CoV-2.Proc. Natl. Acad.\nSci. USA118, e2022586118 (2021).\n57. Meng, E. C. et al. UCSF ChimeraX: tools for structure building and\nanalysis.Protein Sci.32, e4792 (2023).\nAcknowledgements\nWe gratefully acknowledge all data contributors, i.e., the authors and their\noriginating laboratories responsiblefor obtaining the specimens, and their\nsubmitting laboratories for generating the genetic sequence and meta-\ndata and sharing via the GISAID Initiative, on which this research is based.\nWe would like to thank all members belonging to The Genotype to Phe-\nnotype Japan (G2P-Japan) Consortium. The super-computing resources\nwere provided by the Human Genome Center and the Information\nTechnology Center, the University of Tokyo. This study was supported in\npart by JST PRESTO (JPMJPR22R1, to J.I.); JSPS KAKENHI Grant-in-Aid for\nScientiﬁc Research B (25K00116, to J.I.); JSPS KAKENHI Grant-in-Aid for\nEarly-Career Scientists (23K14526, to J.I.); AMED SCARDA Japan Initiative\nfor World-leading Vaccine Research and Development Center“UTOPIA”\n(JP223fa627001, JP243fa627001h0003, and 253fa627001, to J.I.;\nJP223fa627001, JP243fa627001h0003, and 253fa627001 to K.S.); AMED\nS C A R D AP r o g r a mo nR & Do fn e wg e neration vaccine including new\nmodality application (253fa727002 to K.S.); SHIONOGI Infectious Disease\nResearch Promotion Foundation (to J.I.); AMED ASPIRE Program\n(25jf0126002, to G2P-Japan Consortium and K.S.); AMED Research Pro-\ngram on Emerging and Re-emerging Infectious Diseases (23fk0108583,\n24fk0108690, 24wm0225041, to K.S.); JSPS KAKENHI Fund for the Pro-\nmotion of Joint International Research (International Leading Research)\n(25wm022504 and 25fk0108690, to K.S.; 25wm022504 to J.I.); JSPS\nKAKENHI Grant-in-Aid for Scientiﬁc Research A (JP24H00607, to K.S.);\nMitsubishi UFJ Financial Group, Inc. Vaccine Development Grant (to J.I.\nand to K.S.); and The Cooperative Research Program (Joint Usage/\nResearch Center program) of Institute for Life and Medical Sciences,\nKyoto University (to K.S.); JSPS International Research Fellow (to G.J.).\nAuthor contributions\nJumpei Ito designed the study, the main conceptual ideas, and the proof\noutline. Adam Strange developed ESM-2Coronaviridaeand the CovFit-CLI\nstandalone command-line tool. WeiLiu constructed a series of non-deep\nlearning prediction methods. Gustav Joas collected and created the\nCoronaviridaedataset. Spyros Lytras performed a detailed analysis on\nthe F456L substitution. Jumpei Ito performed the other parts of CoVFit\ndevelopment and computational analyses. Jumpei Ito made theﬁgures\nand wrote the initial draft of the manuscript. Adam Strange and Spyros\nLytras provided editing. Kei Sato and The Genotype to Phenotype Japan\n(G2P-Japan) Consortium contributed to the project administration. All\nauthors reviewed and proofread the manuscript.\nCompeting interests\nJ.I. has consulting fees and honoraria for lectures from Takeda Phar-\nmaceutical Co. Ltd Spyros Lytras has consulting fees from EcoHealth\nAlliance. K.S. has consulting fees from Moderna Japan Co., Ltd and\nT a k e d aP h a r m a c e u t i c a lC o .L t d ,a n dhonoraria for lectures from Gilead\nSciences, Inc., Moderna Japan Co., Ltd, and Shionogi & Co., Ltd. The\nother authors declare no competing interests.\nAdditional information\nSupplementary informationThe online version contains\nsupplementary material available at\nhttps://doi.org/10.1038/s41467-025-59422-w.\nCorrespondenceand requests for materials should be addressed to\nJumpei Ito or Kei Sato.\nPeer review informationNature Communicationsthanks Amalio Telenti,\nand the other, anonymous, reviewer(s)for their contribution to the peer\nreview of this work. A peer reviewﬁle is available.\nReprints and permissions informationis available at\nhttp://www.nature.com/reprints\nPublisher’s noteSpringer Nature remains neutral with regard to jur-\nisdictional claims in published maps and institutional afﬁliations.\nOpen AccessThis article is licensed under a Creative Commons\nAttribution-NonCommercial-NoDerivatives 4.0 International License,\nwhich permits any non-commercial use, sharing, distribution and\nreproduction in any medium or format, as long as you give appropriate\ncredit to the original author(s) and the source, provide a link to the\nCreative Commons licence, and indicate if you modiﬁed the licensed\nmaterial. You do not have permission under this licence to share adapted\nmaterial derived from this article or parts of it. The images or other third\nparty material in this article are included in the article’s Creative\nCommons licence, unless indicatedotherwise in a credit line to the\nmaterial. If material is not included in the article’s Creative Commons\nlicence and your intended use is not permitted by statutory regulation or\nexceeds the permitted use, you will need to obtain permission directly\nfrom the copyright holder. To view a copy of this licence, visithttp://\ncreativecommons.org/licenses/by-nc-nd/4.0/.\n© The Author(s) 2025\nThe Genotype to Phenotype Japan (G2P-Japan) Consortium\nKeita Matsuno10, Naganori Nao10,H i r o f u m iS a w a10,K e i t aM i z u m a10, Isshu Kojima10,J i n g s h uL i10, Tomoya Tsubo10,\nShinya Tanaka10,M a s u m iT s u d a10,L e iW a n g10, Yoshikata Oda10, Zannatul Ferdous10, Kenji Shishido10, Takasuke Fukuhara10,\nTomokazu Tamura10,R i g e lS u z u k i10,S a o r iS u z u k i10, Shuhei Tsujino10, Hayato Ito10,Y uK a k u1,N a o k oM i s a w a1,\nArnon Plianchaisuk1,Z i y iG u o1,A l f r e d oA .H i n a yJ r .1,K a o r uU s u i1, Wilaiporn Saikruang1,K e i y aU r i u1, Yusuke Kosugi1,\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 15\nShigeru Fujita1, Jarel Elgin M.Tolentino1,L u oC h e n1,L i nP a n1,W e n y eL i1, Mai Suganami1,M i k aC h i b a1,R y oY o s h i m u r a1,\nKyoko Yasuda1,K e i k oI i d a1,N a o m iO h s u m i1, Shiho Tanaka1,K a h oO k u m u r a1, Kazuhisa Yoshimura11, Kenji Sadamas11,\nMami Nagashima11,H i r o y u k iA s a k u r a11, Isao Yoshida11, So Nakagawa12, Akifumi Takaori-Kondo13, Kotaro Shirakawa13,\nKayoko Nagata13,R y o s u k eN o m u r a13, Yoshihito Horisawa13, Yusuke Tashiro13,Y u g oK a w a i13,K a z u oT a k a y a m a13,\nRina Hashimoto13, Sayaka Deguchi13,Y u k i oW a t a n a b e13, Yoshitaka Nakata13,H i r o k iF u t a t s u s a k o14, Ayaka Sakamoto13,\nNaoko Yasuhara13,T a k a oH a s h i g u c h i13, Tateki Suzuki13, Kanako Kimura13, Jiei Sasaki13, Yukari Nakajima13, Hisano Yajima13,\nTakashi Irie14,R y o k oK a w a b a t a14, Kaori Sasaki-Tabata15,T e r u m a s aI k e d a16,H e s h a mN a s s e16, Ryo Shimizu16,\nMST Monira Begum16, Michael Jonathan16, Yuka Mugita16,S h a r e eL e o n g16,O t o w aT a k a h a s h i16, Kimiko Ichihara16,\nTakamasa Ueno16, Chihiro Motozono16, Mako Toyoda16, Akatsuki Saito17, Maya Shofa17, Yuki Shibatani17,\nTomoko Nishiuchi17,J i r iZ a h r a d n i18, Prokopios Andrikopoulos18, Miguel Padilla-Blanco18 & Aditi Konar18\n10Hokkaido University, Sapporo, Japan.11Tokyo Metropolitan Institute of Public Health, Tokyo, Japan.12Tokai University, Tokyo, Japan.13Kyoto University,\nKyoto, Japan.14Hiroshima University, Hiroshima, Japan.15Kyushu University, Fukuoka, Japan.16Kumamoto University, Kumamoto, Japan.17University of\nMiyazaki, Miyazaki, Japan.18Charles University, Prague, Czech Republic.\nArticle https://doi.org/10.1038/s41467-025-59422-w\nNature Communications|         (2025) 16:4236 16",
  "topic": "Fitness landscape",
  "concepts": [
    {
      "name": "Fitness landscape",
      "score": 0.4927380383014679
    },
    {
      "name": "Computational biology",
      "score": 0.4721132516860962
    },
    {
      "name": "Computer science",
      "score": 0.4279504120349884
    },
    {
      "name": "Virology",
      "score": 0.36113351583480835
    },
    {
      "name": "Biology",
      "score": 0.34903788566589355
    },
    {
      "name": "Medicine",
      "score": 0.22375628352165222
    },
    {
      "name": "Environmental health",
      "score": 0.09272313117980957
    },
    {
      "name": "Population",
      "score": 0.0
    }
  ]
}