{
    "title": "MathOdyssey: Benchmarking Mathematical Problem-Solving Skills in Large Language Models Using Odyssey Math Data",
    "url": "https://openalex.org/W4413054423",
    "year": 2025,
    "authors": [
        {
            "id": "https://openalex.org/A2152013896",
            "name": "Meng Fang",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2752716885",
            "name": "Xiangpeng Wan",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1990125466",
            "name": "Fei Lu",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A2115742468",
            "name": "Fei Xing",
            "affiliations": []
        },
        {
            "id": "https://openalex.org/A1993099458",
            "name": "Kai Zou",
            "affiliations": []
        }
    ],
    "references": [
        "https://openalex.org/W3134642945",
        "https://openalex.org/W4221143046",
        "https://openalex.org/W4385571689",
        "https://openalex.org/W4390940921",
        "https://openalex.org/W6849710474",
        "https://openalex.org/W4382463660",
        "https://openalex.org/W6602260078",
        "https://openalex.org/W4221161695",
        "https://openalex.org/W4281483047",
        "https://openalex.org/W4283768109",
        "https://openalex.org/W6857044596",
        "https://openalex.org/W6949378999"
    ],
    "abstract": "Abstract Large language models (LLMs) have significantly advanced natural language understanding and demonstrated strong problem-solving abilities. Despite these successes, most LLMs still struggle with solving mathematical problems due to the intricate reasoning required. To support rigorous evaluation of mathematical reasoning in LLMs, we introduce the “MathOdyssey” dataset - a curated collection of 387 expert-generated mathematical problems spanning high school, university, and Olympiad-level topics. Each problem is accompanied by a detailed solution and categorized by difficulty level, subject area, and answer type. The dataset was developed through a rigorous multi-stage process involving contributions from subject experts, peer review, and standardized formatting. We provide detailed metadata and a standardized schema to facilitate consistent use in downstream applications. To demonstrate the dataset’s utility, we evaluate several representative LLMs and report their performance across problem types. We release MathOdyssey as an open-access resource to enable reproducible and fine-grained assessment of mathematical capabilities in LLMs and to foster further research in mathematical reasoning and education.",
    "full_text": null
}