{
  "title": "High Efficiency Three Phase Transformer-LessMOSFET Inverter to Drive PMSM Motor",
  "url": "https://openalex.org/W4411313751",
  "year": 2015,
  "authors": [
    {
      "id": null,
      "name": "UG Scholar Department of Electronics & Communication Engineering Kongunadu college of Engineering and Technology, Thottiam",
      "affiliations": []
    },
    {
      "id": null,
      "name": "Ragulkumar M.",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2145325711",
    "https://openalex.org/W2144735315",
    "https://openalex.org/W2538917287",
    "https://openalex.org/W2063059194",
    "https://openalex.org/W2167106294",
    "https://openalex.org/W2097847386",
    "https://openalex.org/W2105059208"
  ],
  "abstract": null,
  "full_text": "GRD Journals- Global Research and Development Journal for Engineering | Volume 1 | Issue 3 | February 2016 \n  ISSN: 2455-5703 \n \n All rights reserved by www.grdjournals.com 1 \nHigh Efficiency Three Phase Transformer-Less \nMOSFET Inverter to Drive PMSM Motor  \n \nM.  Ragulkumar \nUG Scholar \nDepartment of Electronics & Communication Engineering \nKongunadu college of Engineering and Technology, Thottiam \n  \n   Abstract  \n \nA project proposed a new high efficiency three phase transformer-less photovoltaic (PV) inverter by using super-junction \nMOSFETs as main power switches. Here fifteen level topologies have been implemented by using H-Bridges.  Fundamental \nswitching scheme and Selective Harmonics Elimination were implemented to reduce the Total Harmonics Distortion (THD) value.  \nThe proposed inverter can also operate with high frequency by retaining high efficiency which enables reduced cooling system. \nTo reduce the power demands scarcities, to minimize the electromagnetic interferences and to increase the energy efficiency by \nreducing the number of switches and size of output filter. Multilevel inverters are used to extract the power from solar cells. It also \nsynthesizes the desired AC output waveforms from several dc sources. The simulation result shows the proposed system reduces \nthe power demand scarcity and increase the efficiency using MATLAB/Simulink.  \nKeywords- Three phase transformer, MOSFET, Multi-level inverters, Total Harmonic Distortion, PMSM motor, PV \narray\n  \n \nI. INTRODUCTION  \nNowadays a high quality power is needed for medical research and industrial applications, to bring being good quality results for \naccurate evaluation. Multilevel inverters continues to receives more and more attentions because of the high voltage operation \ncapabilities, low switching loss high efficiency and low outputs of electromagnetic interferences (EMI). The preferred output of a \nmultilevel inverter is synthesis by several sources of dc voltages. An attempts has been made up to improve the quality of powers. \nWith an increasing the number of dc voltage sources, the inverter voltage waveforms approach a nearly sinusoidal waveforms \nwhile a using low switching frequency scheme. This result causes a low switching loss, and because several dc sources are used to \nsynthesis the total output voltage, each experiences a lower dv/dt compared to a single level inverter. Consequently, the multilevel \ninverter technology is a promising technology for high power electric devices such as utility applications [1].  \nThe ac output voltage has obtained from inverters can be fed to a load directly or interconnects to the ac grid without \nvoltage balancing problem. The multilevel inverters offer several advantages as compared to hard-switched two level pulse width \nmodulation inverters, such as capabilities to operates at high voltage with lower dv/dt per switching high efficiency, low \nelectromagnetic interference system[2].  \nThe Asymmetrical configuration of Eleven level inverter based (ELI) multi String multi-level topology methods fed to \nthree phase induction motors drive performance is analyzed been compared with a conventional cascaded H- bridge multilevel \ninverter and the performance factors are obtained at both transient and steady state operating conditions with usage of minimum \nnumber of switches so that switching losses can be reduced effectively with multi string multilevel approach. Performance Analysis \nof Eleven Level Asymmetrical Multi String Multi Level Inverter fed Three Phase Induction Motor Drives [3], [4]. \nThe cascade multilevel inverter was first proposed in 1975 [5]. In recent years multi-level inverters has used high power \nvoltage applications. Multilevel inverter output voltage produces has staircase outputs waveform, this waveforms look like \nsinusoidal waveform. The multilevel inverter output voltage having a less number of harmonics compare to a conventional bipolar \ninverters output voltage. If multilevel inverters output increases to n level, the harmonics reduced to be output voltage values equal \nto zero [6], [7]. High efficiency over a wide range of load is achieved by using MOSFET ’s as main switches. The multilevel \ninverter has produces a common mode voltage, to reduce the stress of the motor.  \nII. C ASCADE MULTILEVEL INVERTER  \nCascaded multilevel inverters made up of series connected single full bridge inverters, each with their own isolated dc bus. This \nmultilevel inverter can generates almost sinusoidal waveforms voltage from several separates dc sources, which may be obtained \nfrom solar cells, fuel cells, battery, ultra capacitors, etc. This type of converters does not need any transformers or clamping diodes \nor flying capacitor. Each level can be generates five different voltage outputs +2Vdc, +vdc, 0, –2Vdc and negative vdc by \nconnecting their dc source to their ac outputs side by different combinations of their four switches. The output voltages of an M-\nlevel inverter are the sum of all individual inverter outputs. Each of their H-Bridges active devices switches only at the fundamental \nHigh Efficiency Three Phase Transformer-Less MOSFET Inverter to Drive PMSM Motor  \n(GRDJE/ Volume 1 / Issue 3 / 001) \n \n \n All rights reserved by www.grdjournals.com \n \n2 \nfrequencies, and each H-bridge units generates quasi- square waveforms by phase shifting its positive and negative phase legs \nswitching timings. Further, each switching devices always conducts from 180˚ (or half cycle)  regardless of these pulse width of \nthe quasi square wave, so that this switching methods results to equalize this current stress of each active device. The general block \ndiagram of cascade multilevel inverter is shown in fig.1.  \n \nFig. 1: General Block Diagram of Cascade Multilevel Inverter \nThese topology level inverters are suitable for high voltage and high power inversions because of its ability of synthesize \nwaveforms with better harmonics spread spectrum and low switching frequencies. Considering their simplicity of the circuits and \nadvantages, Cascaded H-bridge topology is chosen for their presented works. A multilevel inverter has been four main advantages \nover the conventional bipolar inverters. First, the voltage stress for each switch is decreased, due to series connections of the \nswitches. Therefore, the rated voltage and consequently the total power of the inverters could been safely increased. Second, the \nrate of change of voltage (dv/dt) is decreased due to the lower voltage swing of each switching cycles. Third, harmonic distortions \nare reduced due to the more output levels. Fourth, lower acoustic noise and electromagnetic level interference method (EMI) is \nobtained. \nIII. FIFTEEN LEVEL MULTILEVEL INVERTER TOPOLOGY  \nLastly, seven switching angles were calculated for 15-level CMLI for its 7 H-bridges using N-R method. In this case, more number \nof harmonic components (six) as compared to 7 and 11 level CMLIs THD contents in output voltage reduces appreciably. The \nharmonic components eliminated are 5th, 7th, 11th, 13th, 17th and 19th. It is to be noted here that among different solution sets of \nswitching angles computed as above, the THD is computed by using those switching angles which are producing minimum THD \n(this applies for the values of m where multiple solution exist).  \n\nHigh Efficiency Three Phase Transformer-Less MOSFET Inverter to Drive PMSM Motor  \n(GRDJE/ Volume 1 / Issue 3 / 001) \n \n \n All rights reserved by www.grdjournals.com \n \n3 \n \nFig. 2: Three phase cascade H bridge multilevel inverter \nThe THD level in output voltage is strictly satisfying IEEE-519 standard for normal working range of modulation indices. \nSome of calculated switching angles have been shown in Table III for reference. By bringing THD level below threshold value is \nvery significant as THD produces various losses and undesirable effects in electric power systems and equipments. The Fig.3 \nshows three phase fifteen level inverter circuit diagram.  \n \nFig. 3: Three phase fifteen level inverter \n\nHigh Efficiency Three Phase Transformer-Less MOSFET Inverter to Drive PMSM Motor  \n(GRDJE/ Volume 1 / Issue 3 / 001) \n \n \n All rights reserved by www.grdjournals.com \n \n4 \nThe range of modulation index for which solution for switching angles exist decreases with the increase in number of \nlevels but the occurrence of multiple solutions increase with the increase in number of level i.e. for 7-level inverter only two sets \nof solution exist, for 11-level four sets of solution exist and for 15-level nine sets of solution are obtained thereby making \ncomputation more complex with number of levels. It can be observed from this figure that the THD reduces with the increase in \nnumber of levels. \nTable 1: \n \nThe main three MLI configurations are neutral point converter, flying capacitor and cascaded H-bridge multilevel inverter. \nCHMI has more advantages than other two mentioned. Some phases of switching angles are mentioned in radians. \nIV. SELECTIVE HARMONIC DISTORTION  \nAn important key in designing an effective and efficient cascaded H-bridge multilevel inverter is to ensure that the total harmonic \ndistortion (THD) in the output voltage waveform is small enough. It is worth noting that in most of the works reported in the \ntechnical literature, the level of the dc sources was assumed to be equal and constant, which is probably not to be case in application \neven if the sources are nominally equal. The Selective Harmonic Elimination (SHE) has been intensively studied in order to achieve \nlow THD. \nThis technique is used to solve the harmonic elimination equations based on stepped waveform analysis in order to obtain \nthe optimal switching angles which in turn reduce the Total Harmonic Distortion (THD). Harmonics is an important concern in all \nutility sectors. However, the electric utilities are recently designed to monitor and analyze the existence and effects of distortion \non system and customer devices. The factors contribute the harmonic distortion on distribution systems are increased application \nof capacitors and nonlinear devices. In order to improve the power quality and to maintain stable power supply performance, an \ninverter control strategy with harmonic reduction techniques can be employed. Spectral analyses of the simple voltage and the \ncompound voltage, performed by MatLab /Simulink. According to the simulation results, fundamental of simple voltage is 309V \nand fundamental of compound voltage is 535.1V. The rate harmonic is then 10.35% for simple voltage and 9.75% for compound \nvoltage. \nV. SIMULATION RESULTS  \nMATLAB 13 version with Simulink is used for simulation purposes under windows 8 platform. A single-phase photovoltaic power \nsupply unit is designed. The distribution system in INDIA is three phase four wire 415 Volts, 50Hz ac supply. Bulk of the domestic \nloads operates from single phase 230V, 50 Hz ac system. The Fig.4 shows the simulation circuit diagram of the proposed system \n\nHigh Efficiency Three Phase Transformer-Less MOSFET Inverter to Drive PMSM Motor  \n(GRDJE/ Volume 1 / Issue 3 / 001) \n \n \n All rights reserved by www.grdjournals.com \n \n5 \n \n \nFig. 4: Simulation circuit diagram \nSo the output voltage of the proposed power supply is designed for 230 Volts ac supply for the grid. The peak output \nvoltage of the inverter is 400 volts. For a fifteen-level inverter, seven half-Bridge cells are connected in cascade. The dc bus voltage \nof individual half bridge cells is 54volts. The Fig.5 shows the simulation results. \n\nHigh Efficiency Three Phase Transformer-Less MOSFET Inverter to Drive PMSM Motor  \n(GRDJE/ Volume 1 / Issue 3 / 001) \n \n \n All rights reserved by www.grdjournals.com \n \n6 \n \nFig. 5: simulation Graph \nVI. C ONCLUSION  \nMultilevel inverters are very suitable for PV generation. H-bridge cell with PWM control is very promising solution. Not only for \nhaving medium and high voltages but also improving the quality of voltage by reducing the harmonics. The inverter is powered \nby various PV sources. It gives the amplitude of the fundamental and the value of harmonic distortion output voltages. The inverter \nhas two major tasks: to inject a sinusoidal current into the grid and to optimize the operating point of the PV modules, to capture \nthe maximum amount of energy. \nR EFERENCES  \n[1] R. Mechouma, B. Azoui, and M. Chaabane, \"Three-phase grid connected inverter for photovoltaic systems, a review,\" in First International Conference on \nRenewable Energies and Vehicular Technology (REVET),, 2012, pp. 37-42. \n[2] T. Kerekes, R. Teodorescu, and U. Borup, Transformerless photovoltaic inverters connected to the grid,\" in Twenty Second Annual IEEE Applied Power \nElectronics Conference (APEC) 2007, pp. 1733-1737. \n[3] S. Mekhilef, \"Dual vector control strategy for a three-stage hybrid cascaded multilevel inverter,\" Journal of Power Electronics, vol. 10, pp. 155-164, 2010. \n[4] D. Barater, G. Buticchi, A. S. Crinto, G. Franceschini, and E. Lorenzani, \"A new proposal for ground leakage current reduction in transformerless grid-\nconnected converters for photovoltaic plants,\" in 35th Annual Conference of IEEE Industrial Electronics (IECON '09). 2009, pp. 4531-4536. \n[5] M. Amjad, Z. Salam, M. Facta, and S. Mekhilef, \"Analysis and Implementation of Transformerless LCL Resonant Power Supply for Ozone Generation,\" \nIEEE Transactions on Power Electronics, vol. 28, pp. 650-660, 2013. \n[6] S. V. Araujo, P. Zacharias, and R. Mallwitz, \"Highly Efficient Single-Phase Transformerless Inverters for Grid-Connected Photovoltaic Systems,\" IEEE \nTransactions on Industrial Electronics, vol. 57, pp. 3118-3128, 2010. \n[7] S. Bremicker, F. Greizer, and M. Victor, \"Inverter, more specifically for photovoltaic plants,\" ed: Google Patents, 2010. \n[8] M. Victor, F. Greizer, S. Bremicker, and U. Hübler, \"Method of converting a direct current voltage from a source of direct current voltage, more specifically \nfrom a photovoltaic source of direct current voltage, into a alternating current voltage,\" ed: United States Patents, 2008. \n[9] T. Kerekes, R. Teodorescu, Rodri, x, P. guez, Va, et al., \"A New High-Efficiency Single-Phase Transformerless PV Inverter Topology,\" IEEE Transactions \non Industrial Electronics, vol. 58, pp. 184-191, 2011. \n[10] X. Huafeng, X. Shaojun, C. Yang, and H. Ruhai, \"An Optimized Transformerless Photovoltaic Grid-Connected Inverter,\" IEEE Transactions on Industrial \nElectronics, vol. 58, pp. 1887-1895, 2011.  \n",
  "topic": "Transformer",
  "concepts": [
    {
      "name": "Transformer",
      "score": 0.6900573372840881
    },
    {
      "name": "Inverter",
      "score": 0.6027968525886536
    },
    {
      "name": "Control theory (sociology)",
      "score": 0.47385385632514954
    },
    {
      "name": "Synchronous motor",
      "score": 0.455808162689209
    },
    {
      "name": "Three-phase",
      "score": 0.43201354146003723
    },
    {
      "name": "Automotive engineering",
      "score": 0.3733566999435425
    },
    {
      "name": "Computer science",
      "score": 0.3655093312263489
    },
    {
      "name": "Electrical engineering",
      "score": 0.34499621391296387
    },
    {
      "name": "Voltage",
      "score": 0.2331036627292633
    },
    {
      "name": "Engineering",
      "score": 0.22716933488845825
    },
    {
      "name": "Artificial intelligence",
      "score": 0.0
    },
    {
      "name": "Control (management)",
      "score": 0.0
    }
  ],
  "institutions": []
}