{
  "title": "An organizational theory for multi-agent interactions integrating human agents, LLMs, and specialized AI",
  "url": "https://openalex.org/W4412004157",
  "year": 2025,
  "authors": [
    {
      "id": "https://openalex.org/A5017126182",
      "name": "Uwe M. Borghoff",
      "affiliations": [
        null
      ]
    },
    {
      "id": "https://openalex.org/A5020960557",
      "name": "Paolo Bottoni",
      "affiliations": [
        null
      ]
    },
    {
      "id": "https://openalex.org/A5039062411",
      "name": "Remo Pareschi",
      "affiliations": [
        null
      ]
    }
  ],
  "references": [
    "https://openalex.org/W4404039218",
    "https://openalex.org/W4409706301",
    "https://openalex.org/W4410244386",
    "https://openalex.org/W6639619044",
    "https://openalex.org/W2174706414",
    "https://openalex.org/W4306377799",
    "https://openalex.org/W2011722399",
    "https://openalex.org/W4319150608",
    "https://openalex.org/W1996109622",
    "https://openalex.org/W4241212268",
    "https://openalex.org/W6737985389",
    "https://openalex.org/W4410571253",
    "https://openalex.org/W1514052250",
    "https://openalex.org/W2081623927",
    "https://openalex.org/W2913376619",
    "https://openalex.org/W2052037233",
    "https://openalex.org/W2799899844",
    "https://openalex.org/W2039048406",
    "https://openalex.org/W2048905609",
    "https://openalex.org/W2526576663",
    "https://openalex.org/W2559113132",
    "https://openalex.org/W4390439282",
    "https://openalex.org/W4296070442",
    "https://openalex.org/W2972802819",
    "https://openalex.org/W4400491795",
    "https://openalex.org/W4408121765",
    "https://openalex.org/W4399330990",
    "https://openalex.org/W2123713131",
    "https://openalex.org/W2955853369",
    "https://openalex.org/W4399698946",
    "https://openalex.org/W4304172392",
    "https://openalex.org/W4390621702",
    "https://openalex.org/W3143021555",
    "https://openalex.org/W2129466958",
    "https://openalex.org/W4312854033",
    "https://openalex.org/W4396941482",
    "https://openalex.org/W2145790759",
    "https://openalex.org/W1487158608",
    "https://openalex.org/W1603799276",
    "https://openalex.org/W4378942217"
  ],
  "abstract": "Abstract Purpose Recent advances in AI, especially in large language models, have created new opportunities to integrate human and artificial agents through shared linguistic capabilities. This paper presents a multi-agent organizational framework in which human agents, LLMs, and specialized agents (narrow AIs) collaborate via dynamic, topic-based group formation. Topic-driven interactions enable agents to coalesce around evolving interests, supported by threshold-based protocols for temporal adaptation, topic emergence, and participation. Methods Within our framework, human agents guide the overall system objectives, while consultant agents (LLMs) provide semantic analysis and mediation, and specialized agents perform focused domain tasks. By leveraging automated topic modeling, the approach eschews rigid ontologies and instead supports adaptive and interpretable content management. Mathematical properties ensure system coherence—across roles, tasks, and timescales—while allowing the natural evolution of interests and groups. Results We illustrate the framework’s versatility with example scenarios in emergency response, healthcare research, and financial decision-making, emphasizing how human decision-makers, LLM-based consultants, and specialized worker agents jointly fulfill complex goals through transparent topic alignment and threshold-driven coordination. This formalization advances human-computer interaction as a multi-agent phenomenon that integrates human insight with the strengths of next-generation AI models in a cohesive, evolving system.",
  "full_text": "RESEARCH Open Access\n© The Author(s) 2025. Open Access  This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, \nsharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the \nsource, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article \nare included in the article’s Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the \narticle’s Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to \nobtain permission directly from the copyright holder. To view a copy of this licence, visit  h t t p : / / c r e a t i v e c o m m o n s . o r g / l i c e n s e s / b y / 4 . 0 /     .    \nBorghoff et al. Discover Computing          (2025) 28:138 \nhttps://doi.org/10.1007/s10791-025-09667-2\n   †     P a o l o Bottoni and Remo \nPareschi have contributed \nequally to this work.\n*Correspondence:\nUwe M. Borghoff\nuwe.borghoff@unibw.de\n1Computer Science, University of \nthe Bundeswehr Munich, Werner-\nHeisenberg-Weg 39,  \n85577 Neubiberg, Germany\n2Computer Science, Sapienza \nUniversity of Rome, Viale Regina \nElena 295, 00161 Rome, Italy\n3Stake Lab, University of Molise, C. \nda Fonte Lappone,  \n86090 Pesche (IS), Italy\nAn organizational theory for multi-agent \ninteractions integrating human agents, LLMs, \nand specialized AI\nUwe M. Borghoff1*, Paolo Bottoni2† and Remo Pareschi3†\n 1 Introduction\nThe accelerating evolution of artificial intelligence (AI), particularly through Large \nLanguage Models  (LLMs), has enabled unprecedented collaboration between humans \nand machines. Yet the most transformative potential lies not in standalone agents, but \nin orchestrating heterogeneous collectives—human actors, LLM-based advisors, and \nDiscover Computing\nAbstract\nPurpose Recent advances in AI, especially in large language models, have created \nnew opportunities to integrate human and artificial agents through shared linguistic \ncapabilities. This paper presents a multi-agent organizational framework in which \nhuman agents, LLMs, and specialized agents (narrow AIs) collaborate via dynamic, \ntopic-based group formation. Topic-driven interactions enable agents to coalesce \naround evolving interests, supported by threshold-based protocols for temporal \nadaptation, topic emergence, and participation.\nMethods Within our framework, human agents guide the overall system objectives, \nwhile consultant agents (LLMs) provide semantic analysis and mediation, and \nspecialized agents perform focused domain tasks. By leveraging automated topic \nmodeling, the approach eschews rigid ontologies and instead supports adaptive \nand interpretable content management. Mathematical properties ensure system \ncoherence—across roles, tasks, and timescales—while allowing the natural evolution \nof interests and groups.\nResults We illustrate the framework’s versatility with example scenarios in emergency \nresponse, healthcare research, and financial decision-making, emphasizing how \nhuman decision-makers, LLM-based consultants, and specialized worker agents \njointly fulfill complex goals through transparent topic alignment and threshold-\ndriven coordination. This formalization advances human-computer interaction as a \nmulti-agent phenomenon that integrates human insight with the strengths of next-\ngeneration AI models in a cohesive, evolving system.\nKeywords Human-Computer Interaction, Large Language Models, Topic-Based Group \nFormation, Multi-Agent Systems, Natural Language Processing, Adaptive Interaction \nProtocols\n\nPage 2 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nspecialized AI workers—toward common objectives. This paper introduces a novel \nframework combining topic-based group formation with threshold-driven protocols, \nyielding a unified model for human-centered multi-agent coordination.\nExisting approaches confront three fundamental challenges, each with broad impli -\ncations across diverse domains. First, semantic fragmentation arises from incompat -\nible vocabularies, which hinder effective communication across agent types. This is \nparticularly detrimental in contexts such as emergency response, where dynamically \nformed teams must adapt in real time to the evolving nature of a crisis, and healthcare \nresearch, which demands interpretable topic discovery that bridges the gap between \nclinical expertise and AI systems. Second, static coordination remains a persistent \nobstacle. Fixed hierarchical structures reduce the responsiveness of systems, especially \nin domains like business operations or financial decision-making, where the ability to \nreconfigure workflows adaptively is essential for maintaining efficiency and competi -\ntiveness. Third, the issue of opaque decision-making looms large. Black-box AI models \nobscure the rationale behind choices, thereby undermining accountability—a critical \nconcern in high-stakes environments where transparency and trust are paramount.\nTo overcome these challenges, our proposed framework unifies symbolic and sub-\nsymbolic reasoning through the introduction of Topic-Based Communication-Space \nPetri Nets  (TB-CSPNs). This approach enables: (i) self-organization of agents into \ndynamic groups based on semantic proximity, (ii) interpretable coordination mecha -\nnisms via threshold-based activation, and (iii) executive traceability designed to support \nhuman or centauric supervision [1].\nOur approach is grounded in three foundational pillars that together define the archi -\ntecture of our system. First, we emphasize agent specialization, distinguishing between \nhuman or centauric supervisors, LLM consultants, and specialized AI workers—each \nwith distinct roles and capabilities. Second, we adopt a principle of topic-driven coor -\ndination, where the formation and dissolution of agent groups are governed by seman -\ntic thresholds, enabling context-aware, adaptive collaboration. Third, we formalize these \ndynamics through the lens of TB-CSPNs, providing mathematical guarantees for sys -\ntem structure, process flow, and emergent behavior. To demonstrate our framework, \nwe pursue two complementary tracks. The first focuses on formal use cases, presenting \ndetailed instantiations in domains such as emergency response, healthcare, and finance. \nThe second adopts a more pedagogical perspective, using hospital-based analogies in the \nAppendices to convey key intuitions and principles in an accessible manner.\nThis work contributes to the advancement of the design of collaborative and inter -\npretable Multi-Agent Systems (MAS). The following outlines the structure of the paper, \nhighlights the novelty of the TB-CSPN model, and explains the implementation details \nto demonstrate the broad applicability of our approach.\nSection  2 grounds the TB-CSPN framework in key concepts from MAS, topic mod -\neling, and Petri net theory. It introduces agentic AI and centauric agents, outlines the \nlayered roles of Supervisors, Consultants, and Workers, and explains how topic mod -\neling enables semantic coordination. Colored Petri nets provide the formal basis for \nmodeling concurrent, semantically driven interactions across agent types. Section  3 \nreviews key areas of related work to contextualize the TB-CSPN framework, including \nPetri net extensions, MAS coordination strategies, topic-driven interaction models, and \nthe emerging role of LLMs as agents. It highlights how TB-CSPN builds on and extends \nPage 3 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nthese foundations through formal semantics, dynamic topic modeling, and integrated \nhuman-AI collaboration. The discussion also contrasts TB-CSPN with existing imple -\nmentations, identifying gaps in semantic adaptability and coordination that TB-CSPN \naddresses, and relates it to complementary approaches focused on anomaly detection \nand ensemble learning. Section  4 presents the formalism of the TB-CSPN framework, \nwhich integrates topic modeling with multi-agent communication across layered Petri \nnets. Agents operate in Surface, Observation, and Computation layers and interact \nvia tokens that carry semantic content. Transitions process these tokens to support \nsemantic refinement and coordination. The framework enables dynamic group forma -\ntion based on topic thresholds and supports flexible implementation through modular \narchitectures. Section  5 outlines how TB-CSPN implements its three core agent types. \nSupervisor agents guide strategy and system interaction, often as human-AI hybrids. \nConsultant agents, typically LLM-based, manage semantic analysis and topic transfor -\nmation. Worker agents carry out reliable, domain-specific tasks. Each operates through \nrole-specific transitions aligned with the framework’s layered structure. Section  6 out-\nlines the dynamic features that support TB-CSPN’s adaptability and coherence. It details \nrole-based topic evolution, structured information flow, and threshold-driven group \nformation. The framework also enables validated topic emergence and uses weighted \nsimilarity measures to guide semantic alignment, ensuring both flexibility and coordi -\nnated system behavior. Section  7 outlines the parameters that govern TB-CSPN’s coor -\ndination logic, from transition thresholds to topic management and similarity weighting. \nThese parameters can be tailored to different application needs—whether prioritizing \nspeed, precision, or strategic balance—and support runtime adaptation. This flexibility \nreflects the framework’s ability to handle diverse operational contexts, as demonstrated \nacross the three application domains. Section  8 presents three illustrative scenarios—\nemergency response, healthcare research, and financial strategy—to demonstrate TB-\nCSPN’s versatility. Each example shows how Supervisor, Consultant, and Worker agents \ncollaborate using topic-tagged tokens, threshold-based transitions, and structured \ngroup formation. The cases highlight how TB-CSPN supports both rapid decision-mak -\ning and long-term coordination across diverse domains, using a unified, semantically \ngrounded architecture. Section  9 explains plans to extend TB-CSPN with features like \ndecider transitions, formal verification, and temporal logic. It also proposes a phased \nimplementation strategy—including middleware, agent interfaces, and domain-specific \nprototypes—to bridge theory and practice. All components will be open source to sup -\nport iterative refinement and real-world adoption. Section  10 concludes the paper. The \nappendices  A–E formally define the TB-CSPN framework, detailing its components, \nagent roles, and dynamic behaviors. It provides mathematical representations of Petri \nnet structures, token semantics, and agent transitions using real-world analogies. The \ndynamics of topic evolution, similarity measures, and group formation are rigorously \nspecified, alongside the parameter configurations that govern strategic, semantic, and \noperational behavior. Practical guidance is also given for tuning these parameters across \ndifferent domains and adapting them in real time to maintain system responsiveness and \ncoherence. An implementation that serves as a proof of concept is available in an exter -\nnal repository for others to learn from, experiment with, and build upon.\nPage 4 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \n2 Background and scope\nBefore presenting our formal framework, we establish here its conceptual foundations \nand position it within the broader landscape of MAS and semantic coordination. This \nsection introduces the key concepts and technologies underlying our approach and \nestablishes the terminology that will be used throughout the paper.\n2.1 Agentic AI and multi-agent coordination\nAlthough the term “agentic AI” has recently become popular, it is fundamentally \ngrounded in the study of MAS. While public discourse often portrays LLMs as stand -\nalone general-purpose intelligences, real-world applications more commonly rely on \ncoordinated networks of specialized agents. As noted in  [ 2, 3], multi-agent coordina -\ntion is essential for combining distinct cognitive and operational capabilities, regulating \nemergent dynamics in distributed systems, and ensuring that decisions remain account -\nable and auditable. Further, the integration of AI with human cognition—explored \nin [1]—blurs the line between purely human actors and AI-augmented ones. When AI \nsupport enhances human judgment without distorting its semantic integrity, we refer \nto such hybrids as monotonic centauric agents . These agents enforce monotonicity in \nhuman-AI collaboration, meaning AI augmentations can refine but never contradict \nexisting, human-defined semantics, such as emergency protocols or clinical guidelines. \nIn the TB-CSPN framework, topic evolution is preserved through the use of threshold \nguards and Supervisor oversight (see Sect.  4). Hence, these agents inherit human values \nand intentions while benefiting from computational enhancements.\nOur framework has two distinct organizational structures, as shown in Fig.  1. First, \nthere are the agents. Human and monotonic centauric agents fall under the Supervi-\nsor agent category and are supported by two types of agents: Consultant agents, which \nFig. 1 Organizational structures in TB-CSPN\n \nPage 5 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nare typically realized through LLM-based systems that provide semantic interpretation, \nabstraction, and linguistic synthesis, as well as Worker agents, which carry out narrow, \ndomain-specific tasks with deterministic behavior. Second are the communication lay -\ners for Surface, Observation, and Computation, which organize places in the TB-CSPN. \nEach transition belongs to exactly one layer. Although agents are typically associated \nwith specific categories of transitions (e.g., Supervisor agents with transitions in the \nSurface layer), an agent can control transitions distributed across various layers. This \nenables agents to primarily operate within their designated layer while maintaining \ninteraction capabilities throughout the system architecture.\nWhile each agent type has primary responsibilities in certain layers (Supervisor agents \nin Surface, Consultant agents in Observation, and Worker agents in Computation), the \nmatrix above demonstrates how all agent types can operate across multiple layers with \ndifferent roles. The Event Space highlights the interface between external stimuli and the \ninternal dynamics of the system. This flexible agent-layer architecture enables coherent \ncoordination while maintaining specialized responsibilities.\n2.2 Topic modeling as a semantic bridge\nTo integrate symbolic and sub-symbolic forms of intelligence, we adopt topic model -\ning as a mediating layer. Though relatively shallow as a learning method, topic modeling \nplays a key role as a semantic interface. It condenses large amounts of data into inter -\npretable topic vectors, enabling human or centauric agents to inspect, revise, or curate \nthe resulting topics. LLM-based Consultant agents can elaborate on or recombine these \ntopics to generate deeper insights, while Worker agents subscribe to the most relevant \ntopics to filter and act on task-specific information.\nCompared to opaque end-to-end deep learning systems, topic modeling enables \nexplicit alignment between human understanding and machine inference. Its rich his -\ntory in Natural Language Processing  (NLP) sees Latent Dirichlet Allocation  (LDA) by \nBlei et al. [ 4] as a foundational approach. LDA models documents as mixtures of latent \ntopics and models topics as distributions over words, creating an interpretable semantic \nstructure. Its various extensions (see, e.g., [ 5, 6]) include neural topic models that lever -\nage deep learning representations while maintaining interpretability.\nApplications of topic modeling span diverse domains, including discovering latent \nhypertexts [ 7] and developing financial indexes from social media analyses [ 8]. Our \nframework extends these applications specifically to multi-agent coordination, using \ntopic distributions as a universal semantic representation across agent types.\n2.3 Petri nets for process modeling\nPetri nets provide the formal foundation for our TB-CSPN framework, offering a math -\nematically rigorous approach to modeling concurrent and distributed systems [ 9, 10]. \nOriginally developed for process modeling, Petri nets employ a bipartite graph structure \nwith places (representing states or conditions) and transitions (representing events or \nactions), connected by directed arcs.\nWe build specifically upon colored Petri nets [ 11], which extend basic Petri nets by \nallowing tokens to carry data values (colors). This extension is essential to our approach \nbecause it enables tokens to carry complex topic distributions that influence transition \nbehavior throughout the network.\nPage 6 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nCompared to other modeling frameworks, Petri nets offer several distinct advantages \nwhen modeling complex agentic systems that involve heterogeneous human and artifi -\ncial agents, including LLMs and centauric supervisors. Graph-based agent models—such \nas those found in standard MAS frameworks [ 12, 13]—typically represent interactions \nvia state diagrams or message-passing graphs, but they often lack the formal semantics \nnecessary to model concurrency, token-based flow, or semantically enriched coordina -\ntion. Petri nets, by contrast, are expressly designed to model concurrent processes with \ncausal dependencies and asynchronous communication, which are core characteristics \nof modern agentic systems.\nUnlike purely mathematical approaches such as process algebras (e.g., π-calculus) [14, \n15], which excel in specifying communication patterns at a logical level, Petri nets offer \na more intuitive and implementation-ready representation of system state, data flow, \nand organizational structure. This makes them especially suited for agent orchestration \nin real-world, semantically layered environments such as those modeled by TB-CSPN. \nFurthermore, Petri nets support key formal properties—such as reachability, liveness, \nand boundedness—that enable both theoretical analysis and practical system verifica -\ntion. These features are essential for safety-critical domains, such as healthcare, financial \nsystems, emergency response, and military intelligence analysis [ 16], where TB-CSPN \napplications must ensure consistent, dependable, and traceable coordination. Finally, \nPetri nets support a natural integration of centauric human-AI collaboration: by asso -\nciating transitions with high-level supervisory decisions (strategic, ethical, contextual), \nwe can capture the effect of human judgment and its augmentation through AI—without \nneeding to fully model internal cognitive processes. This sets Petri nets apart from most \nMAS formalisms, which often treat human agents as external to the formal structure.\nIn summary, Petri nets provide an expressive and extensible framework that bridges \nsymbolic process modeling with sub-symbolic semantic processing, offering a uniquely \npowerful tool for modeling the hybrid, adaptive, and semantically rich dynamics of agen-\ntic human-AI systems.\n3 Related work\nHaving established the technological foundations of our approach, we now position our \nresearch within the broader landscape of related work, highlighting how our framework \nextends or complements existing approaches to multi-agent coordination, LLM agency, \nand human-AI integration.\n3.1 Related petri net extensions\nSeveral specialized Petri net extensions share conceptual similarities with aspects of \nour TB-CSPN framework and may inform future developments: Hierarchical Petri Nets \n[17] provide mechanisms for abstraction and modular design, with conceptual parallels \nto our communication layers. Petri Nets with Inhibitor Arcs  [18] allow transitions to be \nconditionally enabled or disabled based on token presence, similar to our threshold-\nbased activation mechanisms. Contextual Petri Nets  [ 19] enhance the formalism with \ncontext-dependent conditions for transition firing, which conceptually relates to our \ntopic-dependent activation.\nWhile our current TB-CSPN realization does not directly incorporate these exten -\nsions, they represent valuable directions for future refinement as discussed in Sect.  9.\nPage 7 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \n3.2 MAS and coordination\nMAS research provides essential concepts and methodologies for modeling distributed \ninteractions among heterogeneous computational entities. The field has a rich history of \naddressing coordination challenges through various mechanisms and protocols [ 12, 13, \n20]. We specifically build upon the comprehensive survey by Dorri et al. [21], which cov-\ners core MAS concepts, agent taxonomies, and coordination strategies.\nTraditional MAS research has explored various organizational structures for agent \ncoordination. Horling and Lesser [ 22] survey organizational paradigms including hier -\narchies, holarchies, coalitions, teams, and federations—concepts that inform our layered \napproach. While MAS frameworks offer valuable abstractions for agent behavior and \ninteraction, they often lack the formal machinery required for modeling detailed token-\nbased semantics or verifying cross-layer coordination at scale. In contrast, our TB-CSPN \nframework builds on the formal foundations of Petri nets to offer both a high-level view \nof agent roles and a rigorous execution model grounded in concurrency theory. More -\nover, by explicitly incorporating humans—and centauric agents—as formal participants, \nTB-CSPN extends traditional MAS concepts into the domain of human-agent integra -\ntion, positioning our work alongside recent efforts to reconceptualize human-computer \ninteraction as human-agent interaction [2, 3].\nFor formal modeling of agent interactions, we also draw from frameworks such \nas Concurrent Game Structures  and Alternating-Time Temporal Logic  [ 23–25]. Our \napproach complements these by integrating explicit topic-based semantics and layered \ncommunication across agent types within a formally verifiable structure.\n3.3 Topic-driven interaction systems\nTB-CSPN’s emphasis on topic-based coordination relates to emerging research on \ntopic-driven systems across various domains. Lu et al. [ 26] integrate multimodal emo -\ntion recognition with topic-aware models for social robotics, enabling context-sensitive \ninteractions. Similarly, Wang et al. [27] develop topic-driven knowledge selection mech -\nanisms for dialogue generation that improve the relevance of system responses.\nThe concept of implicit interactions based on shared topics has been explored by \nHanteer and Rossi [ 28], who analyzed how users in social networks cluster around the -\nmatic interests. Our approach extends this concept to explicit coordination among het -\nerogeneous agents, using topic distributions as the primary mechanism for dynamic \ngroup formation across human, LLM, and specialized AI agents.\n3.4 LLMs as agents\nThe emergence of LLMs as potential agents marks a significant development in AI \nresearch. Recent work by Singh et al. [ 29] explores the shift from linear interactions to \ndynamic, iterative workflows with LLMs, incorporating reflection, planning, and multi-\nagent collaboration.\nThe role of LLMs as semantic mediators is further explored by Ghisellini et al. [ 30], \nwho demonstrate how LLMs can integrate strategic frameworks with decision heuristics \nthrough semantic analysis. Their approach uses vector space representations and sim -\nilarity calculations to bridge previously separate knowledge traditions, similar to how \nour Consultant agents synthesize information across domains. Their work highlights \nthe potential of LLMs as bridges between formal analytical structures and experiential \nPage 8 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nknowledge, a function analogous to the role of our Consultant agents in connecting \nSupervisor strategic intent with Worker operational execution.\nOur use of LLMs as Consultant agents relates to emerging research on LLMs for plan -\nning and reasoning. Capitanelli and Mastrogiovanni [31] demonstrate LLMs’ capabilities \nin planning actions for human-robot interactions—conceptually aligned with our con -\nsultant agents’ role in bridging strategic intent and operational execution.\nFor the specific challenge of integrating symbolic and subsymbolic reasoning, we draw \nfrom Tenenbaum’s work [32] on bridging these approaches, which aligns with our use of \ntopic modeling as a mediating layer between agent types.\n3.5 Human-AI integration and collaboration\nIntegrating humans and AI systems constitutes a central concern of our framework. The \nconcept of centauric agents (human-AI hybrids) builds upon work in augmented intel -\nligence [1] and human-AI teaming [33].\nFor evaluation of human responses to AI systems, we acknowledge work by Giudici et \nal. [34], who analyze user reactions to AI within interactive contexts, and Kim and Im \n[35], who investigate attributions of human traits to AI systems. These human factors \ninfluence how our supervisor agents interact with the broader system.\nThe emotional and social dimensions of human–machine interaction are further \nexplored in Ahmadi and Haddadi’s survey on Artificial Emotional Intelligence [ 36], \nwhich aligns with our concern for effective communication across agent types.\nOur approach differs from many human-AI collaboration systems by treating humans \nas first-class agents within the formal model rather than external controllers or supervi -\nsors of an AI system. This perspective enables more natural integration of human deci -\nsion-making within the overall system dynamics, while preserving appropriate roles and \nresponsibilities across agent types. While TB-CSPN emphasizes semantic mediation and \ndynamic task orchestration, Zhang et al. [ 37] focus on multi-dimensional feature fusion \nand ensemble learning for robust and accurate anomaly detection, offering a comple -\nmentary perspective on intelligent system responsiveness.\n3.6 Agentic AI implementations and formal gaps\nSeveral recent frameworks incorporate aspects of agentic behavior, often within multi-\nagent configurations. While these systems provide practical utility, they generally lack \ncohesive semantic coordination and a formal foundation. As shown in Table  1, many of \nthese implementations capture parts of agentic coordination but do not reach the level \nof dynamic, semantically grounded interaction enabled by TB-CSPN.\nSystems like LangChain’s ReAct [ 38] and AutoGen MAD [ 39] use turn-based loops \nand procedural message passing to model multi-agent interaction, mimicking Surface \nand Consultant-Worker transitions, but lacking semantic thresholding or adaptive \nTable 1 Mapping Practical Implementations to TB-CSPN Components\nSystem TB-CSPN Analog Limitations\nLangChain ReAct Consultant-Worker interactions Procedural, lacks semantic modeling\nAutoGen MAD Multi-agent Surface transitions No layered semantics\nTogetherAI Orchestrator Supervisor-Worker split Static role assignment, no adaptation\nAgentic RAG Topic tokens as Surface signals Manual topic curation\nReWOO Sequential Worker flows Hardcoded logic, no dynamic roles\nPage 9 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \ncoordination. Frameworks such as TogetherAI’s Orchestrator [40] impose a fixed Super-\nvisor-Worker division that limits role flexibility and semantic mediation, whereas TB-\nCSPN enables fluid specialization across Supervisor, Consultant, and Worker roles. \nIn terms of semantic grounding, Agentic RAG [ 41] introduces topic-like tokens but \ndepends on manual curation and static structures, while TB-CSPN dynamically gener -\nates topic semantics through token flow and agent interaction. Finally, unlike rigid sys -\ntems such as ReWOO [ 42], which follow predefined agent flows, TB-CSPN supports \nreal-time adaptation through token-driven transitions and layered semantics. This \nallows for flexible and emergent process management.\nThese implementations collectively illustrate the growing demand for sophisticated \nagentic coordination. However, they reveal key limitations in semantic modeling, adapt -\nability, and structural formalism. TB-CSPN addresses these through a mathematically \ngrounded, multi-layered architecture that unifies Petri net dynamics with emergent \ntopic-based semantics.\n4 A framework for TB-CSPNs\nOur framework combines topic modeling with multi-agent communication to provide a \nstructured yet flexible way of representing interactions among diverse agent types. These \ninteractions are guided by dynamically evolving topics of interest, enabling context-\naware coordination and adaptation.\nAt its core, the TB-CSPN framework models a MAS as a structured network. In this \nnetwork, places (shown as circles) store topic-labeled tokens, while transitions (shown \nas rectangles) process these tokens, modifying their content and topic distributions. The \ntokens themselves carry both data and semantic topic distributions. Information flows \nthrough three distinct layers—Surface, Observation, and Computation—each support -\ning a different aspect of agent communication and coordination.\nThis structure creates a natural hierarchy that mirrors organizational roles. Supervi -\nsor agents—purely human or centauric (human-AI hybrids) [ 1, 3]—primarily operate in \nthe Surface layer, setting strategic direction. The centauric nature of these agents is par -\nticularly valuable when processing massive influxes of raw data (such as IoT broadcasts \nor real-time sensor networks) that would overwhelm purely human cognitive capabili -\nties. By augmenting human strategic thinking with AI-driven data processing, centau -\nric supervisor agents can effectively manage the Surface layer despite increasing data \ncomplexity. Consultant agents bridge the Surface and Observation layers, analyzing and \ntransforming topic distributions. Worker agents function mostly in the Computation \nlayer, performing specialized domain tasks.\nWe summarize these matrix-like interactions in Table  2, which shows typical agent \nfunctions across communication layers.\nTable 2 Mapping of agent functions across communication layers\nLAYER/ROLE Supervisor Consultant Worker\nSurface Strategic direction; external \nmediation\nOptional preprocessing (e.g., \nearly filtering)\nRare: direct interac-\ntion with raw data\nObservation Guidance of semantic interpretation Semantic analysis; topic refine-\nment; heuristic reasoning\nSupport for transla-\ntion into computation\nComputation Policy enforcement; value alignment Transformation into opera-\ntional tokens\nExecution of domain-\nspecific tasks\nPage 10 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \n4.1 Petri net constituents across layers\nIn TB-CSPN, agents are modeled as bound to transitions, though they may also own \nplaces or store tokens for private use. Places function as shared communication chan -\nnels that support asynchronous interaction via token flow. To increase expressiveness, \nthe framework distinguishes between two types of places: communication places, which \nare accessible to transitions from different agents and facilitate inter-agent coordination; \nand agent-owned places, which act as private memory areas accessible only by transi -\ntions of the owning agent. The interaction between layers in TB-CSPN is governed by \nthe type of transitions. Intra-layer transitions occur within a single communication layer, \nenabling coordination at the same semantic level. Cross-layer transitions allow for ver -\ntical semantic refinement by moving tokens between layers. These transitions are core \nmechanisms of computation and transformation. Agent cooperation is modeled through \nthe production and consumption of tokens.\nRegarding token semantics, TB-CSPN extends the principles of colored Petri nets: \ntokens are structured data objects with the following components:\n  • Payload: The primary content or data being processed (e.g., text, numerical values, or \nstructured records)\n  • Topic Distribution: A mapping from topics to weight values, representing the token’s \nsemantic characterization (e.g., {topic1 :0 .8, topic2 :0 .5, topic3 :0 .3})\n  • Metadata: Additional attributes such as timestamps, provenance information, or \nprocessing directives\nWhen a transition “refines” a token in TB-CSPN, it creates a new token instead of alter -\ning the original. Token flow across layers follows two main patterns: persistence via \ntransformation, where each step generates a semantically related token that retains part \nof the original payload while refining its topic distribution; and replacement, where \nthe new token contains entirely new information, altering both payload and topic. This \napproach maintains clarity and analytical rigor while enabling meaningful semantic evo -\nlution across the system.\n4.2 Communication layers and topic flow\nAs shown in Fig.  1, TB-CSPN divides the network into three communication layers, \neach corresponding to a distinct level of information processing. The Surface layer is \nthe interface between the system and external entities (users, sensors, or other systems). \nTokens entering here typically contain raw information without fully developed topic \ndistributions. Semantic analysis and transformation occur in the Observation layer. The \nConsultant agents operating at this level enrich tokens with topic distributions based \non content analysis, identifying patterns and relationships. In the Computation layer, \nWorker agents perform domain-specific operations based on well-structured topic \ninformation. Figure 2 shows some examples.\n4.3 Threshold-based dynamic group formation\nA significant feature of the TB-CSPN framework is its ability to dynamically form agent \ngroups based on shared topical interests. Individual agents maintain interest thresh -\nolds relative to specific topics. When a token surpasses an agent’s threshold for topic \nrelevance, the agent becomes a candidate for processing it. Groups organically emerge \nPage 11 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nfrom multiple agents sharing common topical interests, facilitating collaborative efforts \nwithout rigid hierarchies. Importantly, as the semantic content evolves over time, agent \nmemberships in these ad hoc groups adjust dynamically, ensuring fluidity and respon -\nsiveness to changing informational contexts.\nThe TB-CSPN formalism is adaptable to a range of implementation architectures, \nincluding message-passing systems and microservices. In practice, tokens are defined \nas semantically enriched messages with detailed metadata, while transitions are imple -\nmented as discrete computational services that handle token transformation, enrich -\nment, and routing. Subscription mechanisms enable agents to process only messages \nrelevant to their topic thresholds, and communication layers are structured as distinct \nprocessing layers to ensure clarity in information flow. For the full mathematical specifi -\ncation and additional formal details, see Appendix A.\n5 Agent implementations\nNow that the TB-CSPN framework has been defined, we turn to the practical implemen-\ntation of its different agent types.\n5.1 Supervisor agent\nSupervisor agents form the strategic core of the system. They orchestrate high-level \ndecision-making and mediate crucial interactions between external environments and \ninternal system processes. Their responsibilities are twofold. First, they provide strate -\ngic direction by establishing overarching objectives, authorizing the formation of agent \ngroups, and shaping the system’s long-term evolution. Second, they serve as mediators \nbetween the system and the outside world. They evaluate incoming information and \ndetermine how to semantically frame and introduce it into the token space. These func -\ntions are carried out through specialized processes that guide internal collaboration and \nsystem-environment interaction.\nIn contemporary implementations, supervisor agents increasingly operate as centau -\nric entities—human-AI hybrids—in response to the growing complexity and scale of \ninformation beyond the capabilities of the human mind alone. This hybrid approach is \nespecially effective in three key scenarios. First, when data volumes exceed human pro -\ncessing capacity, AI augmentation enables supervisors to manage high-throughput data \nstreams from sources such as IoT devices, multimodal inputs, and real-time telemetry. \nIn contexts where complex decision-making requires computational insight, AI sup -\nports intricate reasoning, optimization, and uncertainty analysis, while human oversight \nensures ethical coherence. Finally, in high-stakes environments where a rapid response \nis essential, such as in crisis response or financial markets, AI provides immediate ana -\nlytical support. This allows humans to focus on supervisory control and value alignment. \nFig. 2 Worker agent domain-specific operation examples\n \nPage 12 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nThis integration is consistent with the principle of monotonic centaurs [ 1], which aim \nto augment human cognition without compromising the semantic clarity or strategic \ncoherence of the decision-making process.\nWithin TB-CSPN, Supervisor agents fulfill their roles through purpose-built transi -\ntions. Initiative transitions create tokens that define new strategic directions and cata -\nlyze the formation of collaborative agent groups. Authorization transitions  evaluate \nproposals generated by Consultant agents and serve as control points for high-impact \nadaptations and structural changes. Through delegation transitions , Supervisor agents \nassign tasks to Consultant or Worker agents, orchestrating operational workflows that \nalign with strategic goals. Finally, external interface transitions  process inputs from the \nenvironment—whether originating from users, sensors, or external systems—and con -\nvert them into structured tokens with initial topic distributions. These transitions serve \nas the gateway through which the outside world enters the semantic fabric of the system. \nThrough these transitions, Supervisor agents provide top-down guidance while main -\ntaining a responsive, semantically grounded interface with both internal agent layers and \nexternal realities.\n5.2 Consultant agent\nThe crucial role of Consultant agents is to bridge the strategic intent set by Supervisor \nagents and the operational execution carried out by Worker agents. They specialize in \nsemantic analysis, topic modeling, and strategic recommendation, making them indis -\npensable within the TB-CSPN framework.\nConsultant agents play a pivotal role within the TB-CSPN architecture, operating \nprimarily in the Observation layer to mediate between surface-level interactions and \ndeeper semantic processes. Their responsibilities span several critical functions. They \nbegin with semantic analysis, transforming unstructured or loosely structured content \ninto rich topic distributions that capture underlying meaning. Through pattern recog -\nnition, they identify emerging trends and latent relationships across tokens, enabling \nthem to support strategic foresight and decision-making. These insights feed into strate -\ngic recommendations, where consultants advise on optimal group configurations, topic \nrefinements, and resource allocations. Finally, they undertake operational translation, \nbridging the gap between high-level directives issued by Supervisor agents and the con -\ncrete task representations needed by Worker agents. Thanks to their semantic fluency, \nConsultant agents are particularly well-suited for implementation using advanced LLMs. \nThe inherent capabilities of LLMs—contextual reasoning, natural language understand -\ning, and adaptive semantic processing—enable them to fulfill these roles with precision \nand flexibility.\nWithin a TB-CSPN, Consultant agents operate through specialized transitions, each \ndesigned to perform a distinct semantic function. Content enhancement transitions  \nenrich individual tokens by refining their semantic granularity without compromising \nthe integrity of their original payload. Topic aggregation transitions synthesize multiple \ninformation sources into high-level summary tokens, helping to distill strategic insights \nfrom distributed inputs. Memory and temporal analysis transitions ensure that historical \ncontext is preserved and leveraged, enabling the system to adapt to ongoing develop -\nments over time. Finally, group formation recommendation transitions  actively suggest \nPage 13 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \ncollaborative configurations by analyzing topical alignments and interaction patterns, \nthereby fostering responsive and relevant team dynamics.\nIncorporating LLMs into Consultant agents significantly enhances their capacity for \nsemantic precision. These models allow agents to extract implicit meaning from mul -\ntimodal inputs, discover subtle connections between different concepts, and generate \ncontext-sensitive, historically informed recommendations. LLMs also facilitate commu -\nnication across specialized technical vocabularies and general linguistic registers, effec -\ntively mediating heterogeneous agent environments.\nIn TB-CSPN, Consultant agents occupy a central intermediary position, orchestrat -\ning the flow of semantically enriched information across agent layers. At the Surface-\nObservation interface, they translate external stimuli into semantically structured \ntoken representations. Through the topic transformation pipeline, they refine these \ntokens iteratively for clarity and relevance. They communicate actionable insights back \nto supervisor agents via robust feedback mechanisms, thereby strengthening strategic \ndecision-making with grounded analytical input. They also play a key role in group coor-\ndination by aligning topical interests with organizational priorities to support dynamic, \ngoal-oriented collaboration.\n5.3 Worker agent\nWorker agents comprise the operational core of the TB-CSPN framework. They trans -\nlate high-level strategic objectives into precise, reliable, executable tasks within specific \ndomains. They serve as the backbone of TB-CSPN execution, primarily operating within \nthe Computation layer to deliver deterministic, domain-specific functionality. These \nagents are responsible for domain-specific execution and perform well-defined opera -\ntions within specialized fields—ranging from automated data processing to mechanical \ncontrol—with a high degree of reliability. Their behavior is characterized by determinis -\ntic processing, whereby consistent inputs yield reproducible outputs. This supports sys -\ntem predictability and formal verifiability. By doing so, Worker agents optimize resource \nefficiency while complying with strict performance constraints and minimizing com -\nputational overhead. They also contribute to higher-level reasoning layers by reporting \ntheir status and results. They transmit structured outputs and performance indicators to \ninform Supervisor and Consultant agents.\nWorker agents’ functionality is expressed through a set of domain-aligned transi -\ntions, each of which enables a specific class of operational behavior. Perceptual transi-\ntions handle the conversion of raw sensory data—such as visual streams, audio inputs, or \nenvironmental readings—into structured, actionable tokens. These transitions are often \nthe first stage in translating physical-world observations into computationally tractable \nforms. Analytical transitions  focus on interpretive tasks, such as statistical inference, \npattern recognition, and specialized classification routines based on the agent’s domain \nexpertise. Finally, action transitions are responsible for executing specific tasks, includ -\ning dispatching control signals, automating tasks, allocating resources dynamically, and \nmanaging workflows.\nThese transitions work together to provide the stable, localized functionality neces -\nsary to support the broader emergent behaviors of the TB-CSPN system. By ensuring \ndeterministic execution and tightly scoped operations, Worker agents contribute critical \nstructure and reliability to the overall architecture.\nPage 14 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nAppendix  B provides comprehensive mathematical and formal descriptions of these \ntransitions, along with their structural roles in TB-CSPN.\n6 Framework properties and dynamics\nWe now examine the dynamic properties that support the framework’s adaptability and \ncoherence. These properties influence how the system evolves, detects new topics, man -\nages information flow, and maintains semantic consistency. These properties also help \nTB-CSPN balance stability with responsiveness.\n6.1 Temporal evolution and interaction flow patterns\nTB-CSPN manages temporal dynamics through hierarchical topic evolution, structured \nby agent roles:\n  • Role-Based Evolution Rates: Supervisor transitions induce substantial topic changes, \nConsultant transitions introduce moderate semantic adjustments, and Worker \ntransitions produce minimal, precise refinements. This ranking of semantic influence \n(δS ≥ δC ≥ δW ) ensures ordered cascading of updates.\n  • Transition-Specific Patterns : Each agent type modifies token topics per its role—\nSupervisors drive strategic priorities, Consultants refine semantic clarity, and \nWorkers ensure operational fidelity.\n  • Organizational Stability : Ongoing Supervisor oversight and multi-layered topic \ninterest regulation maintain coherence and prevent semantic fragmentation.\n  • Interest Inertia : Newly introduced topics initially receive constrained weights, \npreventing abrupt semantic shifts and supporting stable adaptation.\nTB-CSPN supports structured information flows that reflect the organizational \narchitecture. Figure  3 illustrates the canonical processing pathway through all three \nFig. 3 Standard token flow in TB-CSPN showing the canonical pathway through Surface, Observation, and Com -\nputation layers. In this typical operational pattern, token processing follows the layered architecture, with each \nagent type operating primarily within its designated layer\n \nPage 15 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \ncommunication layers. This pattern is consistent with the notion of a Workflow Petri \nnet [43]. A Supervisor agent performs a transition fired by external input at the Surface \nlayer, thus establishing high-level goals for the system. A Consultant transition in the \nObservation layer models the analysis and refinement of the resulting tokens so they can \nbe mapped to semantically meaningful topics aligned with current objectives. One or \nmore available Worker agents then execute the required transition at the Computation \nlayer according to the analysis, realizing a domain-specific action that implements the \nstrategic intent. The token describing the result of this execution is then made available \nto fire a Consultant (complex) transition again at the Observation layer. Through this \ntransition, outcomes are interpreted, results are summarized, and possible relevant pat -\nterns or anomalies are identified. Finally, a Supervisor transition at the Surface layer is \ntriggered by the complex token that describes the result of this execution. This evalu -\nation may result in adjustments to strategic plans, which determine the next cycle of \ncoordinated action.1\n6.2 Group Formation and Threshold Dynamics\nWhile agents primarily operate within their designated layers as shown in Fig. 1, the TB-\nCSPN framework enables dynamic group formation that can span across layers when \ntopic distributions trigger interest across different agent types. This cross-layer group \nformation facilitates coordinated responses to topics requiring multi-faceted expertise. \nIt enables Supervisor, Consultant, and Worker agents to collaborate despite their differ -\nent operational contexts.\nDynamic group formation is a core feature of the TB-CSPN framework, governed by \ntopic-based thresholds. As Fig.  4 demonstrates, threshold mechanisms enable context-\nsensitive coordination:\n1 In the stylized representation of Fig.  3, we have collapsed possibly sophisticated activities into single transitions. \nThese transitions could be expanded into subnetworks using Hierarchical Petri nets  [17]. Additionally, we are not \nconsidering the specific assignment of Supervisors or Consultants to specific agents. While we assume that different \nWorker agents would perform the required tasks in different ways, this introduces a degree of non-determinism to \nthe actual workflow.\nFig. 4 Threshold-based group formation in TB-CSPN showing how varying topic weights trigger agent participa-\ntion. As tokens evolve across layers, different agents engage based on their threshold settings, creating emergent \ncollaboration patterns that adapt to changing semantic contexts\n \nPage 16 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \n  • Threshold-Based Activation : Agents join collaborative groups when token topic \nweights exceed their individual interest thresholds.\n  • Contextual Participation : As topic distributions evolve, group membership \ndynamically adjusts without requiring explicit reconfiguration.\n  • Hysteresis Effects : Small threshold margins ( ϵ values) prevent oscillatory group \nmembership, ensuring operational stability.\n  • Role-Appropriate Thresholds : Threshold values typically follow τS ≤ τC ≤ τW  to \nensure hierarchical activation aligned with organizational responsibilities.\nThis configuration ensures that strategic oversight is triggered early, while execution-\nlevel actions only occur when the topic has sufficient semantic strength. The threshold-\nbased approach enables flexible self-organization while maintaining coordinated system \nbehavior aligned with strategic objectives.\n6.3 Topic emergence and similarity measures\nThe TB-CSPN framework enables the dynamic emergence of new topics through a struc-\ntured, multi-stage validation process that respects the hierarchical roles of agents. For a \ntopic to be formally integrated into the system, it must first undergo cross-layer valida -\ntion: Supervisor agents must authorize its strategic relevance, Consultant agents must \nconfirm its semantic coherence, and Worker agents must verify its practical applicability. \nBeyond this layered approval, the topic must meet specific stability requirements, dem -\nonstrating persistence over time, coherence across semantic layers, and broad endorse -\nment from relevant agent types. Additionally, semantic differentiation is essential—new \ntopics must introduce conceptually distinct content that adds meaningful value to the \nsystem, avoiding overlap or redundancy with existing topics. After passing these checks, \nthe TB-CSPN framework incorporates a topic into the active semantic landscape. This \ninvolves updating key structural components, such as color functions, guard conditions, \ntoken patterns, and similarity matrices. This allows the system to adapt seamlessly to \nnew knowledge.\nFigure  5 illustrates a specific subprocess within our TB-CSPN framework focused \non the topic emergence and validation  workflow. Although most operations follow a \nFig. 5 Topic emergence and validation process showing the multi-stage evaluation of potential new topics across \nagent types. This specialized workflow illustrates one of several interaction patterns supported by the TB-CSPN \nframework, with direct connections representing its adaptive capabilities\n \nPage 17 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nstandard flow pattern, specialized processes such as topic emergence may involve direct \nconnections between different agent types when semantically appropriate.\nConsultant agents initiate the topic detection and analysis phases. Supervisor agents \nprovide strategic validation, and Worker agents confirm domain relevance. These direct \nconnections serve as exception paths for topic validation rather than typical operational \nflows. This flexibility enables specialized workflows while preserving the framework’s \narchitectural integrity.\nIn TB-CSPN, topic similarity is evaluated across different agent layers, each reflecting \ndistinct semantic priorities based on the agent’s role. At the Supervisor level, similarity is \nassessed using high-level topic co-occurrence patterns aligned with strategic objectives. \nConsultant agents use statistical modeling, NLP techniques, and domain-informed rea -\nsoning to compute similarity and capture nuanced semantic relationships. At the Worker \nlevel, similarity is evaluated using task-specific metrics, which are often based on execu -\ntion requirements or data compatibility. This ensures that operational actions align with \nthe relevant semantic context. With this layered approach, similarity assessments can be \nadapted to the needs and perspectives of each agent type. A weighted combination of \nthese layer-specific similarities—parameterized by (wS,w C,w W )—allows for the fine-\ntuning of system behavior to emphasize strategic alignment, semantic refinement, or \noperational execution.\nFormal definitions and update semantics are provided in Appendix C.\n7 Parameter configuration and tuning in TB-CSPN\nThe TB-CSPN framework relies on a set of configuration parameters that govern how \ntransitions, places, and tokens behave. These parameters determine how topics evolve, \nhow transitions are activated, and how the system adapts to changing semantic and \noperational contexts. Each parameter group plays a distinct role in shaping system \ndynamics. Supervisor agents are modeled as human or hybrid (centauric) actors, but the \nframework does not attempt to simulate internal human reasoning. Instead, Supervisor \ntransitions represent the production of strategic decisions—such as initiating groups, \nadjusting thresholds, or approving topics—while abstracting away the cognitive pro -\ncesses behind them. This design follows established practices in human-in-the-loop and \nbusiness process modeling, where human actions are formalized to maintain coherence \nin complex systems.\nFor centauric agents, which combine human judgment with AI capabilities, this \nabstraction is particularly well suited. It allows the system to encode collaborative out -\ncomes while preserving a clear, structured representation. In contrast, Worker and Con-\nsultant transitions are modeled as synthetic behaviors. Supervisor transitions serve as \nformal proxies for human or hybrid interventions, enabling the system to reflect strate -\ngic decision-making and coordinate activity across layers.\nTable 3 Summary of TB-CSPN Application Scenarios\nFeature Emergency Response Healthcare Research Financial Strategy\nKey Topics Evacuation, medical, logistics Genomic markers, drug trials AI stocks, market volatility\nTime Scale Seconds-minutes Weeks-months Hours-days\nThreshold Priority Speed (τS ≤ 0.5) Precision (τC ≥ 0.85) Balance (τW ≈ 0.9)\nGroup Dynamics Rapid formation/ dissolution Emergent topic validation Continuous portfolio updates\nAgent Focus Coordination Discovery Optimization\nPage 18 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \n7.1 Parameter categories and their roles\nThe parameters of TB-CSPN are organized into six major categories, each playing a dis -\ntinct role in determining how the system evolves:\nSupervisor Transition Parameters  orchestrate the system’s strategic behavior. These \ninclude the maximum variation rates ( δS), the initial influence of new topics introduced \nby Supervisor transitions (αS), and the thresholds that determine when these transitions \nbecome active ( τS). Together, they modulate how Supervisor nodes prioritize novelty \nand responsiveness: higher values of αS amplify the impact of emergent topics, while \nelevated τS values restrict Supervisor activation to situations of pronounced topic \nrelevance.\nConsultant Transition Parameters manage the analytical layer of the system. Governed \nby parameters such as δC, which restricts the rate of topic transformation, Consultant \ntransitions ensure that token modifications maintain semantic continuity while remain -\ning sensitive to contextual changes. This configuration promotes a balance between \nadaptability and analytical consistency.\nWorker Transition Parameters are tailored to operational stability. Here, parameters \nlike δW play a crucial role: by limiting topic weight variation during Worker transitions, \nthey preserve dependable behavior in task-specific contexts, minimizing fluctuations in \nthe system’s execution layer.\nGroup Formation Parameters —denoted by ϵS, ϵC, and ϵW—introduce hysteresis \neffects in transition enabling/disabling mechanisms. These parameters are designed to \nprevent erratic toggling caused by marginal fluctuations in topic relevance. By doing so, \nthey stabilize group memberships over time and contribute to a more coherent dynamic \norganization of the MAS.\nTopic Management Parameters  ( σmin, σmax, cstability) control how topics are kept, \nmerged, or removed during system operation. σmin and σmax set the bounds for topic \nsimilarity, while cstability defines how much evidence is needed to keep or update a topic. \nThese parameters ensure that the system remains semantically consistent while enabling \nthe emergence of new ideas.\nSimilarity Function Weights  ( wS,w C,w W ) adjust how much influence Supervisor, \nConsultant, and Worker agents have when measuring topic similarity. They let the sys -\ntem shift focus—for example, favoring Supervisor input in emergencies or Consultant \nanalysis during uncertain situations.\nFor a detailed table of all parameters, their ranges, and behavioral implications, please \nrefer to Appendix D.\n7.2 Threshold dynamics example\nTo illustrate how threshold parameters dynamically govern transition enabling and \ngroup formation, consider the following scenario derived from an emergency response \ndomain within the TB-CSPN model: \n1. Initial transition enabling:  At time k, a Worker transition associated with a rescue \nteam has an evacuation topic threshold of 0.7. A token with evacuation weight of 0.85 \narrives at the relevant place. Since 0.85 exceeds the activation threshold, the transition \nbecomes enabled and the rescue team joins the active response group.\n2. Topic weight decrease:  At time k +1 , a new token arrives, now with an evacuation \nweight of 0.65. Falling below the 0.7 threshold, this causes the transition to become \nPage 19 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \ndisabled, leading to the temporary exclusion of the rescue team from coordinated \naction.\n3. Consultant transition mediation:  The system reacts by activating a Consultant \ntransition, which diagnoses the context change and produces a token for Supervisor \nreview, highlighting the modification in group composition.\n4. Threshold adjustment by Supervisor: In response, the Supervisor transition recalibrates \nthe threshold, lowering it to 0.6. At time k +2 , the previously excluded transition \nbecomes active again, since the current topic weight (0.65) now exceeds the updated \nthreshold, restoring the rescue team’s participation.\nThis scenario illustrates how thresholds enable dynamic, context-sensitive regulation of \ngroup participation. Higher-level transitions monitor and adapt to fluctuations in topic \nrelevance.\n7.3 Parameter configuration for different domains\nThe TB-CSPN framework is built to adapt flexibly across a range of application domains \nby adjusting key parameters. To illustrate this adaptability, we propose example configu-\nrations for three representative contexts.\nIn emergency response scenarios, the system must prioritize speed and responsive -\nness. In this setting, parameters are adjusted to enable rapid topic integration, low acti -\nvation thresholds, and swift topic evolution. This allows for fast group formation and \ntimely action under urgent conditions.\n  • High αS( 0.7−0.8): fast integration of novel topics\n  • Low τC, τW( 0.5−0.6): minimal thresholds for analytical and operational activation\n  • Elevated δS, δC( 0.2−0.3): promotes swift topic evolution\n  • Low cstability( 0.4): accelerates topic emergence\n  • High wS( 0.5−0.6): prioritizes Supervisor perspective in similarity assessments\nIn collaborative research contexts, greater selectivity and topic stability are preferable.\n  • Moderate αS( 0.5−0.6): balanced topic introduction\n  • High τC, τW( 0.6−0.7): stronger evidence required for activation\n  • Low δS, δC( 0.1−0.2): supports semantic consistency\n  • Higher cstability( 0.5−0.6): ensures topic persistence\n  • Balanced weights wS, wC, wW( 0.4, 0.4, 0.2): maintains multiple viewpoints\nIn structured business and financial environments, a balance between operational reli -\nability and strategic responsiveness is critical:\n  • Moderate αS( 0.6), low αW( 0.2): prioritizes strategy without sacrificing stability\n  • Stratified thresholds: τS( 0.5), τC( 0.6), τW( 0.8): enforces role hierarchy\n  • Low δW( 0.05−0.1), moderate δC( 0.15−0.2): operational consistency with analytical \nflexibility\n  • Larger ϵW( 0.1): prevents frequent Worker deactivation\n  • σmin( 0.4), σmax( 0.8): maintains clear category boundaries\nPage 20 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \n7.4 Runtime parameter adaptation\nThe TB-CSPN framework includes built-in mechanisms that adapt key parameters at \nruntime. This maintains responsiveness in dynamic and evolving environments.\nThreshold learning adjusts the activation criteria for Supervisor transitions based \non performance feedback, enabling the system to optimize task allocation in real time. \nSimilarity weight adjustment shifts the influence of Supervisor, Consultant, or Worker \ntransitions depending on topic stability—emphasizing Consultant input during periods \nof uncertainty or Supervisor control during strategic shifts. Finally, interest evolution \nrate control dynamically tunes the δ parameters to match system activity, speeding up \ntopic evolution when rapid adaptation is needed and reinforcing stability during routine \noperations.\nIn summary, the TB-CSPN parameter system offers detailed and flexible control over \nthe coordination of multiple agents. By tuning parameters to specific domains and \nadjusting them at runtime, the framework strikes a balance between responsiveness and \ncoherence, as well as autonomy and structure.\n8 Examples of framework application\nTo illustrate TB-CSPN’s versatility, we present three domain examples where Supervisor, \nConsultant, and Worker agents collaborate through topic-labeled tokens and threshold-\nbased coordination. These demonstrate how the formal properties in Sect.  6 enable both \nrapid response and long-term collaboration.\nIt is important to note that the Emergency Response scenario provided is intended \nonly as a conceptual illustration of the dynamics and capabilities of the TB-CSPN frame-\nwork; it does not reflect any deployment in real-world emergency systems or operational \nenvironments. Similarly, the Healthcare Research scenario presented here is purely illus-\ntrative, designed to demonstrate the formal and operational properties of the TB-CSPN \nframework; it does not involve or report on any clinical trials, patient data, or empiri -\ncal medical studies. Also, the Financial Strategy scenario discussed is a hypothetical \nscenario designed to illustrate the adaptability of the TB-CSPN framework; it does not \nreflect any live trading systems or actual financial operations.2\n8.1 Emergency response coordination as TB-CSPN\nOur first example models an emergency response system using the TB-CSPN frame -\nwork. In this scenario, rapid group coordination is critical, requiring fast token flow, \nstrategic topic routing, and threshold-based enabling of transitions. Group formation \nis represented through the manipulation of structured tokens encoding group identity, \nmembership, and coordination scope.\nWe start with an initial TB-CSPN configuration.\n2 While the appendices use hospital management as an accessible analogy to explain key concepts, the real-world \nscenarios presented in the main text go further by demonstrating the full formalization of the TB-CSPN framework, \nincluding all system constraints. These scenarios also showcase the use of finely tuned operational parameters—\nbeyond the illustrative values used in the appendix—and validate system behavior through end-to-end token flows, \nproviding a more complete and realistic view of the model in action.\nPage 21 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nTE ={temergency_coordinator} (Supervisor Transitions)\nTC ={tsituation_analyst,t resource_coordinator} (Consultant Transitions)\nTW ={trescue_team1,t medical_team1,t logistics_team1,t weather_bot,t traﬃc_bot}\n(Worker Transitions)\nPsurf ={palerts,p directives,p status}\nPobs ={panalysis,p coordination,p resources}\nPcomp ={prescue_ops,p medical_ops,p logistics_ops,p weather_data,p traﬃc_data}\nPgroups ={pgroup_registry}\nT ={evacuation, medical_emergency, supply_chain, weather_alert,\ntraﬃc_condition}\nAt time k, the TB-CSPN system receives an emergency alert, which is introduced as a \ntoken in the place palerts. This token represents an initial, unstructured input—such as a \nmessage reporting a critical event—that will be processed and semantically enriched as \nit flows through the network. This marks the starting point for coordinated agent activa-\ntion and response based on the alert’s topic content.\nτalert =( “Severe ﬂooding reported in the downtown area, multiple injuries,\nroads blocked.”, {timestamp : k, source : “emergency_hotline”})\nThe token is processed by a Consultant transition tsituation_analyst that processes τalert and \nproduces:\nτanalyzed =( ..., {(evacuation, 0.85), (medical_emergency, 0.75),\n(traﬃc_condition, 0.70), (weather_alert, 0.60), (supply_chain, 0.45)},... )\nA recommendation token is produced:\nτrecommendation =( “Recommend immediate evacuation and medical response”,\n{(evacuation, 0.9), (medical_emergency, 0.8)},\n{timestamp : k, type : “recommendation”})\nIt is placed in pcoordination for review by the Supervisor. At time k, the group formation is \nencoded in a structured group token inserted into pgroup_registry:\nτgroup =( group_id = “ﬂood_response” ,\nmembers = {rescue_team1, medical_team1, traﬃc_bot},\ntopics = {(evacuation, 1.0), (medical_emergency, 0.8)},\nmetadata = {timestamp : k, priority : “high”})\nTransition guards consult this registry to check topic thresholds and group inclusion.\nenabled(trescue_team1,p rescue_ops)=\nis_member(trescue_team1, “ﬂood_response” ) ∧ topic[evacuation] ≥ 0.7\nenabled(tmedical_team1,p medical_ops)=\nis_member(tmedical_team1, “ﬂood_response” ) ∧ topic[medical_emergency] ≥ 0.7\nAt time k, topic proximity shapes routing and inference\nPage 22 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nsimE(evacuation, medical_emergency)=0 .85\nsimC(evacuation, medical_emergency,k )=0 .80\nsimW(evacuation, medical_emergency)=0 .75\nsim(·)=0 .82 with weightswE =0 .5,w C =0 .3,w W =0 .2\nThis example illustrates how TB-CSPN effectively supports emergency response coordi -\nnation by combining topic-driven semantics with structured agent interactions. Topic-\ntagged tokens are routed through transitions that are semantically relevant to their \ncontent, and transitions are enabled based on dynamic topic interest thresholds. Struc -\ntured tokens in a registry maintain persistent group configurations, while semantic and \nstructural guards coordinate activation across agent roles. In practice, the Supervisor \n(acting as the emergency coordinator) defines strategic directives and encodes them into \ngroup structures. Consultant agents, such as situation analysts, interpret incoming data \nand generate actionable recommendations. Worker agents—including rescue teams, \nmedical units, and traffic controllers—are activated based on group membership and \ntopic relevance, ensuring a rapid and organized response.\n8.2 Healthcare research collaboration in TB-CSPN\nThis example models research collaboration using the TB-CSPN framework, emphasiz -\ning longer-term interaction and emerging new topics.\nThe initial TB-CSPN Configuration is described as follows:\nTE ={tresearch_director} (Supervisor Transitions)\nTC ={tresearch_analyst,t domain_coordinator} (Consultant Transitions)\nTW ={tgenomics_analyzer,t clinical_trials_bot,t statistics_bot,\ntdrug_interaction_analyzer} (Worker Transitions)\nPsurf ={pﬁndings,p directives,p publications}\nPobs ={panalysis,p correlations,p research_topics}\nPcomp ={pgenomics_data,p clinical_data,p statistical_analysis,p drug_data}\nPgroups ={pgroup_registry}\nT ={rare_diseases, drug_trials, genomic_markers,\npatient_outcomes, statistical_analysis}\nAt time k, a research finding enters the system as a token in pﬁndings:\nτﬁnding =( “New correlation discovered between genetic marker XYZ\nand treatment response in rare autoimmune conditions.”,\n{}, {timestamp : k, source : “lab_report_128”})\nThe token is processed by a Consultant transition tresearch_analyst that produces:\nτanalyzed =( “New correlation discovered between genetic marker XYZ\nand treatment response in rare autoimmune conditions.” ,\n{(genomic_markers, 0.90), (rare_diseases, 0.85),\n(drug_trials, 0.65), (patient_outcomes, 0.60),\n(statistical_analysis, 0.55)},\n{timestamp : k, source : “lab_report_128”, analyzed_by :\n“research_analyst”})\nPage 23 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nThe analyzed token is placed in panalysis, where it enables Consultant transitions to pro-\ncess it further, i.e., tresearch_analyst produces a recommendation token\nτrecommendation =( “Recommend focused research on XYZ marker’s mechanism”,\n{(genomic_markers, 0.95), (rare_diseases, 0.90)},\n{timestamp : k, type : “research_direction”})\nThe recommendation token is placed in presearch_topics for Supervisor consideration. At \ntime k, as in the emergency coordination case, group formation is managed via colored \ntokens, storing group identity, membership, and associated topics, placed in the static \ngroup registry. Let transition tresearch_director process τrecommendation and produce:\nτgroup =( group_id = “autoimmune_study”,\nmembers = {research_analyst, genomics_analyzer,\ndrug_interaction_analyzer},\ntopics = {(genomic_markers, 1.0), (rare_diseases, 0.9)},\nmetadata = {timestamp : k, priority : “high”})\nThis token is inserted into pgroup_registry. Transition guards later check group member -\nship via this registry. After several firing sequences, a new potential topic emerges:\n(autoimmune_genetics, 0.75, {genomic_markers, rare_diseases}) ∈\nemerge({τ1,τ 2,...,τ n},k + 5)\nThis topic undergoes multi-level validation, and upon confirmation, is integrated into \nthe TB-CSPN structure.\nThis example illustrates how TB-CSPN enables collaborative research via topic-tagged \ntokens, static yet semantically dynamic group formation through structured group \ntokens, threshold-based transition enabling, and topic emergence mechanisms.\n8.3 Financial scenario in TB-CSPN\nOur third example introduces a financial decision-making scenario, modeling the strate-\ngic management of a media-sensitive investment portfolio. The system monitors infor -\nmation flows, assesses investment opportunities, and dynamically reallocates resources \nbased on topic-driven signals from the financial ecosystem.\nTS = {tmarket_director} (Supervisor Transitions)\nTC = {trisk_analyst,t opportunity_scanner} (Consultant Transitions)\nTW = {tsimulator,t forecast_engine,t portfolio_optimizer} (Worker Transitions)\nPsurf = {pnews,p directives,p signals}\nPobs = {panalysis,p strategies}\nPcomp = {psimulations,p metrics,p portfolios}\nT = {AI_stocks, climate_ﬁnance, market_volatility, regulation, publ_sentiment}\nA token from news feeds is inserted into pnews: τinput =( “Tech sector sees surge amid AI \nbreakthroughs” ,, {source: “Reuters” , timestamp: k}). The transition risk_analyst enriches \nit by τanalyzed =( ..., {(AI_stocks, 0.9), (market_volatility, 0.6)},...). A Supervisor transition \nthen issues the directive τdirective =( “Consider increased exposure to AI sector” , {(AI_\nstocks, 1.0)},...) which is placed into pdirectives and read by a Worker transitions tsimulator \nPage 24 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nthat generates projected outcomes based on AI market conditions, and tportfolio_optimizer \nproposes allocation changes across assets. Enabling is governed by thresholds, e.g.: \nguard(tportfolio_optimizer,p portfolios)=  AI_stocks ≥ 0.8. As in prior examples, topic simi -\nlarity is computed: sim(AI_stocks, market_volatility, k)=0 .72\nThis financial scenario illustrates how TB-CSPN enables responsive, data-driven port -\nfolio management through coordinated semantic processing. Consultant agents, such as \nLLM-based analysts, proactively intercept and analyze emerging topics from financial \nnews and market signals. Based on this analysis, Supervisors redirect strategy by issu -\ning new directives aligned with the most relevant topics. Worker agents then execute \nsimulations and optimize portfolio allocations accordingly. Together, these components \nenable real-time adjustments and strategic coherence in a complex, fast-moving finan -\ncial environment.\n9 Future work and implementation pathways\nWhile TB-CSPN offers a solid formal foundation for multi-agent coordination, there is \nstill room for further development. This section presents plans to refine the theory and \ncreate practical implementations connecting the formal model to real-world systems.\n9.1 Theoretical extensions\nAs hinted at in Sect.  3.1, we plan to explore possible refinements of the model, such as \nthose offered by Hierarchical Petri Nets [17], Petri Nets with Inhibitor Arcs [18], or Con-\ntextual Petri Nets [19], with a view to modeling sophisticated forms of control over task \nexecution and cooperative construction of results targeted at specific objectives, possi -\nbly under adversarial contextual conditions.\nOne specific extension we intend to develop is a TB-CSPN structure with so-called \ndecider transitions. Figure  6 shows how these transitions (represented by dashed lines) \nFig. 6 In addition to the standard token flow in TB-CSPN shown in Fig.  3, presenting a canonical path through \nthe Surface, Observation, and Computation layers, decider transitions (dashed lines) can bypass a layer to address \ntime-critical scenarios or obtain secondary validations\n \nPage 25 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \ncan bypass conventional layer progression. These decider transitions serve two impor -\ntant purposes:\n  • Real-time responsiveness: Accelerating decision processes when external constraints \ndemand rapid responses, allowing direct Supervisor-Worker interactions in time-\ncritical scenarios.\n  • Validation redundancy: Enabling secondary computations from additional Worker \nagents to verify results. This is particularly useful for reducing the effects of \nhallucinations or errors in LLM-based Consultant agents.\nTo minimize the risk of LLM hallucinations, we plan to integrate Retrieval-Augmented \nGeneration (RAG) into future versions of the TB-CSPN model [ 44, 45]. This will allow \nConsultant agents to base their results on external knowledge using decider transitions \nor other techniques. It will also allow for real-time validation between agents and sec -\nondary verification by Worker agents. These redundancies and controls will be imple -\nmented before LLM-generated content is officially integrated.\nFurther theoretical work includes designing formal verification methods tailored to \nTB-CSPN and integrating temporal logic to capture time-sensitive threshold behavior.\n9.2 Implementation strategy\nTranslating the TB-CSPN framework into practical systems requires a phased develop -\nment approach that balances theoretical integrity with integration feasibility.\n  • As a first step in implementation, we will develop a middleware platform that \nencodes the core semantics of TB-CSPN using modular, interoperable components. \nThis includes a token orchestration layer  that integrates message queues, such as \nKafka3 or RabbitMQ, 4 with a token state tracker, such as Neo4j 5 or RedisGraph. 6 \nThis integration enables asynchronous, semantically structured transitions between \nagents. A topic modeling service will support this layer by leveraging existing libraries \nlike Gensim 7 for LDA or HuggingFace 8 for neural models, with enhancements for \nonline learning and incremental updates. Finally, a threshold registry  will manage \nagent-specific activation conditions, offering potential interfaces for external control \nvia policy APIs or machine learning-based tuning mechanisms.\n  • Next, we will define a set of standardized interfaces for each agent type to ensure \nconsistent interaction across the system. Supervisor APIs  will support secure, \nauthenticated communication with human or centauric agents. Consultant \nconnectors will provide abstraction layers for integrating with various LLM \nbackends—including OpenAI, Anthropic, and open-source models—while enforcing \na consistent structure for prompts and responses. Worker wrappers will encapsulate \ndomain-specific microservices or toolchains, presenting them through a unified \ninterface. To facilitate interoperability across components, we will also integrate \n3 https://kafka.apache.org/documentation/\n4 https://www.rabbitmq.com/\n5 https://neo4j.com/\n6 https://github.com/RedisGraph.\n7 https://radimrehurek.com/gensim/\n8 https://huggingface.co/\nPage 26 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nschema adapters compatible with frameworks like LangChain [ 38] and AutoGen \n[39].\n  • Finally, we will develop use-case-specific prototypes to validate the TB-CSPN \nframework in real-world scenarios. These prototypes will include an emergency \nresponse coordination system  that integrates real-time data feeds, such as weather \nupdates, social media alerts, and logistics APIs; a healthcare research collaboration \nhub that connects clinicians with LLM-powered analytical tools; and a financial \ndecision support module  that enables dynamic portfolio adjustments and risk alerts \nbased on evolving market signals. These reference implementations will serve as \npractical testbeds to refine the framework and demonstrate its versatility across \ndomains.\nAll components will be released as open-source modules to enhance existing agentic \nframeworks with a formal coordination layer based on token semantics and topic-driven \nPetri nets. Feedback from implementation will help refine the theory, creating a two-way \nlink between practical design and formal modeling.\n10 Conclusion\nWe have proposed TB-CSPN as a comprehensive formal framework for agent orchestra-\ntion in the emerging era of agentic AI. Our contribution is significant in two fundamen -\ntal respects:\nFirst, we establish a mathematically rigorous model for integrating heterogeneous \nagent types—human, LLM-based, and specialized AI—within a unified coordination \nstructure. This formalization provides theoretical guarantees while supporting the prac -\ntical flexibility demanded by complex sociotechnical systems. By developing a formal \napproach to agent orchestration that accommodates both human and artificial partici -\npants, we create a foundation for systems that can evolve alongside advances in AI with -\nout losing coherence or human centrality.\nSecond, our work bridges two traditions with deep foundations in computer science \nthat have historically traveled separate paths: the theory of concurrent processes and \nnatural language processing. By integrating Petri nets (a classical formalism for model -\ning concurrent systems) with topic modeling and LLMs (key technologies in modern \nNLP), we create a synergy that addresses the fundamental coordination challenges of \nmixed-initiative systems. This integration enables semantic mediation across tradition -\nally siloed AI paradigms, offering a principled approach to the agent heterogeneity that \ncharacterizes effective real-world systems.\nThis bridging of traditions is particularly evident in how our framework builds upon \nour earlier work [2, 3]. In those models, the Surface layer mediated environmental inter-\naction, the Observation layer interpreted and routed content, and the Computation layer \nhoused logic and decision strategies—an approach particularly suited to interactive soft -\nware systems where computation concentrated in the Computation layer and observa -\ntion acted as a bridge to the surface.\nThe TB-CSPN framework evolves this foundation in two important respects:\nFirst, it explicitly introduces distinct agent types for each communication layer—\nSupervisors, Consultants, and Workers—rather than assuming that computation alone \naccounts for the system’s intelligence and coordination. This is more than a terminologi-\ncal refinement; it reflects a conceptual expansion. In this model, agents in the Surface \nPage 27 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nand Observation layers are not passive conduits but active participants in behavior, \ninterpretation, and strategic regulation.\nConsultant agents, typically instantiated as LLMs, exemplify this shift. While LLMs \nare popularly associated with chatbots, that is only one of their possible uses. In our \nframework, Consultant agents serve as proactive semantic mediators. They inter -\npret input tokens, refine topic distributions, detect latent structures, and recommend \nactions—behaviors enabled through API-based interactions rather than user-facing dia -\nlogs. As illustrated in our examples, these agents often exhibit foresight and top-down \ninfluence, intercepting and expanding topics in ways that contribute directly to organi -\nzational intelligence.\nSecond, the TB-CSPN framework distinguishes decision-making from computation. \nSupervisor agents, situated at the Surface layer, are responsible for strategic orientation \nand external mediation. While this may appear to contradict the earlier model, which \nhoused decision-making within computation, it reflects a broader understanding: deci -\nsion processes include not only algorithmic inference but also bounded rationality, con -\ntextual heuristics, and value-guided prioritization. These capacities align more naturally \nwith strategic oversight than with low-level logic.\nAlthough the examples in the paper focus on cross-layer interactions, the TB-CSPN \nframework can also handle intra-layer exchanges. For instance, it can accommodate \ninteractions among Supervisor agents at the Surface layer or among Worker agents at \nthe Computation layer. These lateral transitions can result in subnetworks that can be \nmodeled using hierarchical Petri nets or by explicitly defining peer-level arcs.\nOverall, the TB-CSPN framework offers a significant advance in formalizing multi-\nagent orchestration for the age of agentic AI. By combining Petri nets’ mathematical \nrigor with the semantic power of topic modeling and LLMs, we provide both theoreti -\ncal foundations and practical mechanisms for systems where human and artificial agents \ncollaborate effectively. This approach addresses the growing diversity of intelligent \nagents in real-world applications—human, symbolic, and neural—and establishes prin -\ncipled structures for their adaptive coordination across differentiated roles.\nA Formal Specification of TB-CSPN\nHow to Use This Appendix: This section provides the complete formal specification of the \nTB-CSPN framework. For readers seeking a more conceptual understanding, intuitive \nexplanations of key concepts are woven throughout the text, and the core formal require-\nments of the model are clearly identified. To help contextualize the formalism, we also \ninclude healthcare-based examples that illustrate how TB-CSPN components operate in \nreal-world scenarios. Before diving into the technical definitions, we begin with an illus -\ntrative case drawn from a hospital coordination system.\nIn this context, places represent communication channels—such as an emergency room \ndashboard or a lab results queue. Transitions correspond to processing units, includ -\ning roles like a triage nurse or an AI-based diagnostic agent. Meanwhile, tokens carry \npatient cases enriched with topic distributions, for example: [cardiac: 0.9, urgent: 0.7]. \nThis scenario provides an intuitive mapping between TB-CSPN components and real-\nworld healthcare operations, grounding the formalism in a concrete domain. To build an \nintuitive understanding, imagine a Petri net as a type of workflow system. In this system, \nplaces act like containers or queues that hold individual work items, while transitions rep-\nPage 28 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nresent the processing steps that consume those items and produce new ones. The tokens \nare the work items themselves, moving through the network as tasks are carried out. Arcs \ndefine the paths along which these tokens travel, connecting places to transitions and \nstructuring the flow of activity.\nFormally, a colored Petri net is defined as:\nN =( P,T,A ,Σ,color, guard,M 0)\nEach component of the Petri net maps to a concept relevant to real-world domains. P \nrepresents work queues—for example, a place labeled “Unprocessed X-rays” where \nincoming cases wait to be reviewed. T defines the processing units, such as an AI-pow -\nered radiology system that interprets imaging data. The function color specifies data \nformat rules, ensuring that tokens conform to standards like DICOM for medical imag -\ning.9 Finally, guard defines entry conditions for transitions—for instance, a rule that only \nchest X-rays may be processed by a particular diagnostic module.\nThe process begins when meaningful topics emerge within the system. For example, \nbased on incoming patient reports, the system may detect a topic such as cardiac_emer -\ngency. This triggers relevant agent activation and group formation. In response to \nthe detected topic, the system activates the appropriate agents to form a coordinated \nresponse. A human cardiologist joins the supervisory group, denoted as AGS, to provide \nstrategic oversight. An LLM-powered triage assistant is assigned to the consultant group, \nAGC, to support semantic interpretation and decision-making. Meanwhile, an ECG ana-\nlyzer is activated within the worker group, AGW, to perform specialized diagnostic tasks.\nFormally, this structure is described as follows:\nTP = {stroke, sepsis,... }\nAG = AGS ∪ AGC ∪ AGW\ndist(TP ) ∈ P(TP )\nConsider a sample token representing a patient case. The payload contains the main \nclinical information, such as “68-year-old male, chest pain. ” This is enriched with topic \nannotations that capture semantic relevance—for instance, cardiac: 0.9, male: 0.5—indi -\ncating a strong association with cardiac issues and moderate relevance to gender. The \ntoken also includes metadata, such as priority: high, source: EMT, which provides con -\ntextual details about the urgency of the case and its origin.\nBecause the weight of the topic cardiac has exceeded the 0.8 threshold, signaling high \nrelevance, agents respond selectively based on predefined thresholds. The cardiologist, \nwhose threshold for cardiac topics is 0.7, is activated and joins the group. The general \nMD, however, has a higher threshold of 0.9 and does not participate, as the topic weight \nfalls below the required level. Meanwhile, the ECG bot, with a lower threshold of 0.6, is \nalso activated, recognizing the topic’s significance and engaging accordingly.\nMathematically, the group formation process is captured by the function:\ng(t)= {a ∈ AG | ∃τ∈TP : interesta(τ, t) ≥ θa(τ )}\nThis defines a group g(t) at time t consisting of agents a whose interest in some topic τ  \nmeets or exceeds their individual threshold θa(τ).\n9 https://www.dicomstandard.org/\nPage 29 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nDifferent implementation strategies within TB-CSPN are suited to varying organiza -\ntional contexts. A centralized approach—such as a hospital command center—is effective \nfor small, tightly coordinated teams where oversight is concentrated. In contrast, a dis -\ntributed setup, like a telemedicine network, is better suited for cross-facility coordination \nwhere agents operate semi-autonomously across locations. For scenarios requiring both \nhigh-level coordination and local autonomy, a hybrid model—such as a regional trauma \nsystem—offers a balanced solution that can flexibly accommodate both centralized direc-\ntives and distributed execution.\nB Formal specification of agent transitions\nThis section presents the formal roles of Supervisor, Consultant, and Worker agents \nwithin the TB-CSPN framework, using parallels from hospital operations to clarify \nabstract computational mechanisms. These roles are introduced through practical analo-\ngies to familiar medical processes, while mathematical definitions ground their behavior \nwithin the system’s formal semantics.\nIn the context of a hospital, supervisors—such as chief medical officers or depart -\nment heads—are responsible for high-level decision-making, including the allocation \nof resources, the implementation of treatment protocols, and staff coordination. These \nreal-world roles closely mirror those of Supervisor agents in TB-CSPN, who provide \nstrategic oversight and guide the system’s overall structure. While these agents may be \nimplemented as humans or human-AI hybrids, the transitions they govern are formal \nrepresentations of strategic outcomes. Such transitions are not concerned with internal \ncognition but rather with external decisions that have structural implications for the sys-\ntem, including group formation and topic validation.\nThese abstract operations are directly relatable to administrative decisions in hospital \nmanagement. For example, opening a new ICU wing corresponds to the creation of a \nnew agent group; authorizing an experimental protocol reflects the validation of a new \ntopic; and assigning patients to specific teams maps to the delegation of tasks. Within \nTB-CSPN, such groups are formalized as structured tokens comprising a group identifier, \na list of agent members, associated semantic topics, and supplementary metadata. These \ntokens reside in a persistent registry and are queried by guard conditions, enabling transi-\ntions to dynamically reason about group composition and coordination context.\nThe Supervisor agent’s functionality is governed by a trio of transition functions. The \ninitiative function creates new group tokens; the authorization function determines \nwhether proposed changes are accepted; and the delegation function routes strategic \ntasks to appropriate Consultant or Worker agents. This is expressed as follows:\ninitiative : S × N × T → ℘(G)\nauthorize : S × G × N → BOOL\ndelegate : S × Task× N → C ∪ W\nFor instance, a transition tS may model an administrative workflow; changes to a guard \ncondition guard(tg) could represent updates to protocol approval criteria; and the cre -\nation of a token τout might correspond to a triage event assigning a patient to a new care \npathway.\nConsultant agents act as semantic intermediaries between strategic oversight and \noperational execution. Their real-world counterparts include medical AI systems that \nPage 30 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \ninterpret clinical data, recommend diagnostic procedures, or propose treatment options. \nWhen a diagnostic system outputs a confidence level above a given threshold, Consul -\ntant components are selectively activated. For example, a treatment recommender may \nengage immediately, while a second-opinion module might remain idle. A test selector \nmight also be triggered to suggest complementary diagnostics.\nThese activation decisions are driven by enhanced threshold logic and semantic simi -\nlarity assessments. The enhanced threshold θenhanced is derived from a combination of a \nbase diagnostic threshold and a context-dependent adjustment:\nθenhanced = combine(θ(d),θ C(d, t))\nSimilarly, the semantic similarity score used for activation blends global topic similarity \nwith a Consultant-specific evaluation:\nsimenhanced = λ · sim(t1,t 2,t )+( 1− λ) · simC(t1,t 2)\nThese blended functions allow Consultant agents to respond with nuance by adjusting \ntheir actions based on both global system knowledge and local task relevance.\nWorker agents perform specialized, deterministic tasks and are analogous to auto -\nmated clinical instruments like MRI machines or lab robots. These agents operate within \ntightly scoped domains, and their behavior is governed by three core guarantees. First, \ndomain containment ensures that each Worker interacts only with relevant places in the \nnet, captured formally as ∀p ∈ PDw. Second, deterministic processing guarantees consis-\ntency in output, expressed as colorw(τ, t)= colorw(τ, t′) for repeated invocations under \nidentical conditions. Third, execution timing is bounded within a performance window: \nµmin ≤ ﬁre_time ≤ µmax, which allows for predictable scheduling within the network’s \ncomputational fabric.\nA typical patient workflow illustrates the coordinated actions of the three agent types. \nA Supervisor admits a patient and creates a token for the new case. A Consultant agent \nanalyzes the intake report, identifies a likely cardiac issue, and assigns a high relevance \nscore to the topic. A Worker agent performs an ECG test, producing a structured token \nas output. The Consultant then reviews the result, refines the topic distribution, and sub-\nmits findings. Finally, the Supervisor evaluates the complete case and approves a course \nof treatment. This sequence demonstrates how TB-CSPN agents operate across strategic, \nsemantic, and operational layers in a coordinated loop.\nC Formal specification of dynamic properties\nNavigating Dynamic Properties:  This section explores how TB-CSPN handles temporal \nevolution, topic emergence, and role-specific interaction patterns. Conceptual explana -\ntions are interwoven with formal definitions, and real-world medical workflows are used \nto illustrate each concept.\nIn hospital operations, different roles adapt at different rates. Supervisors, such as \nadministrators, may revise policies on a quarterly basis. Consultants—diagnosticians \nand clinical advisors—tend to update methods more frequently, such as monthly. Worker \nagents, like lab instruments or automated systems, maintain consistent procedures over \nlonger periods.\nTo formalize this, each agent type is associated with a change bound that defines how \nquickly their behavior or topic distributions may evolve. Supervisors have a bound of \nPage 31 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nδS ≤ 0.3, reflecting the relatively slow pace of institutional policy change. Consultants \nare bounded by δC ≤ 0.2, modeling moderate adaptation, such as shifts in diagnostic \npractices. Workers are the most stable, with δW ≤ 0.1, indicating consistent execution of \nstandardized protocols. These constraints are encoded as:\n|topics(τ )[t] − topics(τ ′)[t]|≤ δS (Supervisor)\n|topics(τ )[t] − topics(τ ′)[t]|≤ δC (Consultant)\n|topics(τ )[t] − topics(τ ′)[t]|≤ δW (Worker)\nTopic emergence within TB-CSPN often mirrors how new medical protocols are intro -\nduced in clinical settings. For instance, the detection of an unusual cluster of patient \ncases may prompt a Supervisor—such as a chief physician—to validate a new topic. A \nConsultant then analyzes its correlation with existing topics, and if it passes similarity \nthresholds, Worker agents may be reconfigured or activated to address it. This process \nis governed by formal validation requirements, ensuring that newly surfaced topics are \nsemantically relevant and operationally actionable.\n∃tS ∈ TS : authorize(tS, topic,k )= TRUE\nsimC(topic, topic′,k ) >σ min\ntopic ∈D tW for relevanttW ∈ TW\nTo understand the interaction dynamics across agent roles, consider a typical patient \ndiagnosis flow. A Supervisor initiates the process by admitting the patient. A Consultant \nthen orders appropriate diagnostic tests. The Worker agent performs the lab analysis, \nafter which the Consultant interprets the results. Finally, the Supervisor reviews the out-\nput and approves a treatment plan. This sequence is formalized as:\nInitiative : tS → psurf\nAnalysis : psurf → tC → pobs\nExecution : pobs → tW → pcomp\nEach phase of this flow corresponds to a distinct layer of the TB-CSPN architecture: Sur-\nface, Observation, and Computation. This allows for clear separation of concerns and \nfacilitates traceable transitions.\nUnderpinning this entire process is a semantic similarity model that determines how \nagents align with topics and tasks. At the strategic level, simS captures alignment with \norganizational priorities. For Consultants, simC measures diagnostic correlation, often \ninformed by semantic models such as LLMs. For Worker agents, simW captures compat-\nibility with operational capabilities, such as whether a particular lab test is supported. \nThese components are integrated into a weighted similarity function:\nsim(t1,t 2,k )= wSsimS + wCsimC + wW simW\nwhere wS + wC + wW =1\nThis formulation ensures that alignment is context-sensitive and can be tuned based on \nthe relative importance of strategic, diagnostic, or operational considerations.\nPage 32 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nD Formal specification of parameter configuration\nHow to Navigate This Section: This section introduces key TB-CSPN parameters through \nanalogies to hospital management. Intuitive medical parallels are used to motivate each \nparameter, while essential mathematical rules formalize their behavior. Throughout, real-\nworld configurations and parameter effects are illustrated using representative process \nflows.\nBefore exploring formal definitions, consider several familiar hospital scenarios. The \nparameter δS reflects how frequently hospital policies are updated—quarterly in fast-\npaced environments, or annually in more stable ones. The threshold τC represents the \nminimum confidence required for a test result to support a diagnosis, such as 80%. The \nweight wS describes the influence of a chief physician relative to clinical specialists in \ntreatment decisions. Finally, ϵW can represent a short grace period before surgical equip-\nment is reassigned, ensuring operational stability.\nThese parameters can be grouped by the type of control they represent. Supervisor \nagents, similar to hospital administrators, manage strategic parameters such as policy \nchange frequency ( δS), the strength with which new protocols are initially introduced \n(αS), and urgency thresholds that trigger intervention (τS). Formally:\n|new_policy − current|≤ δS\ninit_weight(new_protocol) ≤ αS\napprove ⇐⇒ urgency ≥ τS\nIn this case, δS limits the pace of policy adjustments, αS bounds the initial influence of \nuntested protocols, and τS defines the urgency required for executive approval.\nOn the clinical side, parameters affect how quickly diagnostic and procedural standards \ncan evolve, and the confidence level required before decisions are made. For example, \nδC restricts how often Consultant agents update diagnostic guidelines and δW governs \nthe stability of Worker-level procedures. Thresholds like τC( for diagnoses) and τW( for \nequipment activation) ensure that actions are taken only when warranted by sufficient \nevidence. Parameters like ϵC add stability by requiring a grace period before a diagnostic \ndecision can be reversed, reducing volatility in borderline cases.\nConsider a case in which emergency room severity reaches 0.8. If the trauma team \nhas a threshold θ =0 .7, it activates immediately. Cardiology, with a higher threshold of \n0.85, does not engage. Meanwhile, the laboratory, operating under a relaxed threshold of \nθ =0 .6+ϵ W, also activates. This behavior is captured by the group activation rule:\nactivate(team) ⇐⇒ case_severity ≥ θteam −ϵtype\nTopic adoption follows a similar pattern. A new treatment protocol may emerge upon \ndetection of a number of similar cases. If it satisfies minimum similarity ( σmin =0 .4) \nand recurrence ( cstability =0 .5) requirements, and its similarity to existing treatments \nexceeds 0.7, the system integrates it into formal guidelines. These dynamics are gov -\nerned by:\nadopt ⇐⇒ sim(new, existing) ∈ [σmin,σ max]\npersist ⇐⇒ recurrence_rate ≥ cstability\nDifferent hospital types require different parameter configurations. In trauma centers, \nhigh responsiveness is essential; hence, a large δS =0 .3 and a low τW =0 .5. Research \nPage 33 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nhospitals balance supervisory and clinical decision-making, with weights such as \nwS =0 .4,w C =0 .4. In contrast, routine care clinics prioritize stability, with a low \nδS =0 .1 and a conservative diagnosis threshold of τC =0 .8.\nAt runtime, TB-CSPN supports continuous feedback-driven adaptation. For example, \nhospital systems monitor patient outcomes over time. Consultant agents analyze these \ntrends and suggest parameter changes. A Supervisor (a medical director) evaluates the \nsuggestions and authorizes updates. Once approved, new parameters are propagated to \nall relevant departments. This process is formalized through the following equations:\nnew_threshold = current + λ · (success_rate − target)\nupdate_rate = f(case_volume, urgency)\nHere, λ =0 .1 represents a conservative adjustment rate, preventing overreaction to \nshort-term fluctuations. The function f() modulates update frequency based on factors \nsuch as case volume and urgency, ensuring system adaptation to shifting conditions.\nE Proof of concept implementation\nTo support the practical viability of the TB-CSPN framework, we developed a lightweight \nproof of concept (PoC) implementation centered on the financial decision-making sce -\nnario in Sect.  8.3. The prototype demonstrates token propagation across the three com -\nmunication layers—Surface, Observation, and Computation—and models semantic coor-\ndination among three functional agents. A Consultant agent analyzes textual inputs (e.g., \nnews headlines) and enriches them with topic distributions. A Supervisor agent evaluates \nwhether the token content meets topic-specific thresholds and, if so, issues actionable \ndirectives. A Worker agent executes a domain-specific task (portfolio reallocation) in \nresponse to supervisor directives.\nThe implementation is written in Python, using modular components to allow easy \nextension or substitution of agents. For example, the Worker agent can be replaced by \na full-fledged optimization agent based on G-learning, as envisioned in ongoing thesis \nwork associated with this project. Each token is assigned a unique identifier and dynami-\ncally updated metadata indicating its position in the semantic coordination flow (e.g., \nlayer=observation). Execution traces provide transparency and reproducibility of the \nagent interactions. An excerpt from a typical run is shown below:\nPage 34 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nThe codebase is organized to facilitate the inclusion of real-world large language mod -\nels (LLMs) for topic analysis (e.g., OpenAI or HuggingFace), integration of asynchronous \nexecution pipelines, and persistent token logging.\nThis implementation confirms that TB-CSPN’s semantics-driven coordination logic, \nthreshold-based transitions, and modular agent architecture are not only theoretically \nsound but also practically executable in a minimal yet extensible system.\nAcknowledgements\nThe authors would like to acknowledge the use of DeepL TransLaTor, DeepL WriTe and ChaTGpT in the preparation of this \npaper. These tools assisted in enhancing the language quality and translating certain sections originally written in \nGerman or Italian. Naturally, the content remains a faithful reflection of the authors’ original research and intellectual \ncontributions.\nAuthor contributions\nAll authors listed have made equal, substantial, direct, and intellectual contributions to the work.\nFunding\nOpen Access funding enabled and organized by Projekt DEAL. Remo Pareschi has been funded by the European \nUnion—NextGenerationEU under the Italian Ministry of University and Research (MUR) National Innovation Ecosystem \ngrant ECS00000041-VITALITY—CUP E13C22001060006.\nData availability\nAll relevant data are included in the article. The sample datasets used in this study can be found in the attached \nAppendices A–D. A repository containing the proof-of-concept implementation described in Appendix E is available at \nhttps://github.com/Aribertus/tb-cspn-poc.\nMaterials availability\nNot applicable.\nCode availability\nNot applicable.\nDeclarations\nEthics approval and consent to participate\nNot applicable.\nConsent for publication\nAll authors have approved the article for publication.\nCompeting interests\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that \ncould be construed as a potential Conflict of interest.\nPage 35 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nReceived: 15 April 2025 / Accepted: 24 June 2025\nReferences\n1. Pareschi R. Beyond human and machine: an architecture and methodology guideline for centaurian design. Science. \n2024;6:71. https://doi.org/10.3390/sci6040071.\n2. Borghoff UM, Bottoni P , Pareschi R. A system-theoretical multi-agent approach to human-computer interaction In: Aren-\ncibia AQ, Affenzeller M, Moreno-Díaz R. editors Computer Aided Systems Theory - EUROCAST 2024 - 19th International \nConference, Las Palmas de Gran Canaria, Spain, February 25 - March 1, 2024, Revised Selected Papers, Part I, Vol. 15172 of \nLNCS 23–32, Springer, 2024. https://doi.org/10.1007/978-3-031-82949-9_3.\n3. Borghoff UM, Bottoni P , Pareschi R. Human-artificial interaction in the age of agentic AI: a system-theoretical approach. \nFront Hum Dyn. 2025;7:1579166. https://doi.org/10.3389/fhumd.2025.1579166.\n4. Blei DM, Ng AY, Jordan MI. Latent Dirichlet allocation. J Mach Learn Res. 2003;3:993–1022.\n5. Blei DM. Probabilistic topic models. Commun ACM. 2012;55:77–84. https://doi.org/10.1145/2133806.2133826.\n6. Abdelrazek A, Eid Y, Gawish E, Medhat W, Hassan A. Topic modeling algorithms and applications: a survey. Inf Syst. \n2023;112: 102131. https://doi.org/10.1016/j.is.2022.102131.\n7. Rossetti M, Pareschi R, Stella F, Fontana FA. Integrating concepts and knowledge in large content networks. New Gener \nComput. 2014;32:309–30. https://doi.org/10.1007/S00354-014-0407-4.\n8. Pinelli N, Pareschi R. Social news aggregations and the bitcoin: mapping their correlation through the three dimensions \nof content, sentiment and time In: Tonelli R, Ortu M. editors Proceedings of the 5th International Workshop on Emerging \nTrends in Software Engineering for Blockchain, WETSEB@ICSE 2022, Pittsburgh, Pennsylvania, 19 May 2022 33–38 (ACM, \n2022). https://doi.org/10.1145/3528226.3528379.\n9. Murata T. Petri nets: properties, analysis and applications. Proc IEEE. 1989;77:541–80. https://doi.org/10.1109/5.24143.\n10. Reisig W. Elements of distributed algorithms: modeling and analysis with Petri nets. Berlin: Springer; 2013.\n11. Jensen K. Coloured Petri Nets. Berlin: Springer; 1997.\n12. Wooldridge MJ. Introduction to multiagent systems. Hoboken: Wiley; 2002.\n13. Weiss G, editor. Multiagent Systems. 2nd ed. Cambridge: MIT Press; 2013.\n14. Milner R. Communicating and mobile systems - the Pi-calculus. Cambridge: Cambridge University Press; 1999.\n15. Sangiorgi D, Walker D. The Pi-Calculus: A Theory of Mobile Processes. Cambridge: Cambridge University Press; 2001. \nhttps://doi.org/10.1017/CBO9780511606432.\n16. Nitzl C, Cyran A, Krstanovic S, Borghoff UM. The use of artificial intelligence in military intelligence: An experimental inves-\ntigation of added value in the analysis process. Front Hum Dyn. 2025;7:1540450.  h t t p s : / / d o i . o r g / 1 0 . 3 3 8 9 / f h u m d . 2 0 2 5 . 1 5 4 0 \n4 5 0     .   \n17. Fehling, R. A concept of hierarchical petri nets with building blocks In: Rozenberg G. editors Advances in Petri Nets 1993, \nVol. 674 of LNCS 148–168, Springer, 1991. https://doi.org/10.1007/3-540-56689-9_43.\n18. Agerwala T, Flynn M. Comments on capabilities, limitations and “correctness’’ of petri nets. SIGARCH Comput Archit News. \n1973;2:81–6. https://doi.org/10.1145/633642.803973.\n19. Montanari U, Rossi F. Contextual nets. Acta Inf. 1995;32:545–96. https://doi.org/10.1007/BF01178907.\n20. Borghoff UM, Pareschi R, Fontana FA, Formato F. Constraint-based protocols for distributed problem solving. Sci Comput \nProgram. 1998;30:201–25.  h t t p s :  / / d o i  . o r g / 1  0 . 1 0  1 6 / S 0 1 6 7 - 6 4 2 3 ( 9 7 ) 0 0 0 1 1 - 7.\n21. Dorri A, Kanhere SS, Jurdak R. Multi-agent systems: a survey. IEEE Access. 2018;6:28573–93.  h t t p s : / / d o i . o r g / 1 0 . 1 1 0 9 / A C C E S \nS . 2 0 1 8 . 2 8 3 1 2 2 8     .   \n22. Horling B, Lesser V. A survey of multi-agent organizational paradigms. Knowl Eng Rev. 2004;19:281–316.\n23. Alur R, Henzinger T, Kupferman O. Alternating-time temporal logic. J ACM. 2002;49:672–713.  h t t p s : / / d o i . o r g / 1 0 . 1 1 4 5 / 5 8 5 2 \n6 5 . 5 8 5 2 7 0     .   \n24. Alechina N, Logan B, Nguyen HN, Raimondi F. Model-checking for resource-bounded ATL with production and consump-\ntion of resources. J Comput Syst Sci. 2017;88:126–44. https://doi.org/10.1016/J.JCSS.2017.03.008.\n25. Mogavero F, Murano A, Perelli G, Vardi M. Reasoning about strategies: on the satisfiability problem. Log. Meth. Comp. Sci. \n2017;13. https://doi.org/10.23638/LMCS-13(1:9)2017.\n26. Lu I, Huang J, Lee W. An emotion-driven and topic-aware dialogue framework for human-robot interaction. Adv Robotics. \n2024;38:267–81.  h t t p s :  / / d o i  . o r g / 1  0 . 1 0  8 0 / 0 1  6 9 1 8 6  4 . 2 0 2 3  . 2 2 9  7 9 0 2.\n27. Wang S, et al. TopicKS: Topic-driven knowledge selection for knowledge-grounded dialogue generation In: Ko H, Hansen \nJHL editors. 23rd Annual Conference of the International Speech Communication Association, Interspeech 2022, Incheon, \nKorea, September 18-22, 2022 1121–1125, ISCA, 2022.  h t t p s :  / / d o i  . o r g / 1  0 . 2 1  4 3 7 / I  N T E R S  P E E C H .  2 0 2 2  - 1 1 1 8 8.\n28. Hanteer O, Rossi L. An innovative way to model twitter topic-driven interactions using multiplex networks. Front Big Data. \n2019;2:9. https://doi.org/10.3389/FDATA.2019.00009.\n29. Singh A, Ehtesham A, Kumar S, Khoei TT. Enhancing AI systems with agentic workflows patterns in large language model \n(ed.aiiot2024.org) IEEE World AI IoT Congress, AIIoT 2024, Seattle, WA, USA, May 29-31, 2024 527–532, IEEE, 2024.  h t t p s :  / / d o \ni  . o r g / 1  0 . 1 1  0 9 / A I  I O T 6 1  7 8 9 . 2 0  2 4 . 1  0 5 7 8 9 9 0.\n30. Ghisellini R, Pareschi R, Pedroni M, Raggi GB. Recommending actionable strategies: A semantic approach to integrating \nanalytical frameworks with decision heuristics. Information 2025;16. https://www.mdpi.com/2078-2489/16/3/192.\n31. Capitanelli A, Mastrogiovanni F. A framework for neurosymbolic robot action planning using large language models. Front \nNeurorobot. 2024;18:1342786. https://doi.org/10.3389/FNBOT.2024.1342786.\n32. Tenenbaum JB, Kemp C, Griffiths TL, Goodman ND. How to grow a mind: statistics, structure, and abstraction. Science. \n2011;331:1279–85. https://doi.org/10.1126/science.1192788.\n33. Seeber I, et al. Machines as teammates: a research agenda on AI in team collaboration. Inf Manag. 2020;57: 103174. \nhttps://doi.org/10.1016/j.im.2019.103174.\n34. Giudici M, Liguori F, Tocchetti A, Brambilla M. Unveiling human-ai interaction and subjective perceptions about artificial \nintelligent agents In: Stefanidis K. et al. editors. Web Engineering - 24th International Conference, ICWE 2024, Tampere, \nPage 36 of 36\nBorghoff et al. Discover Computing          (2025) 28:138 \nFinland, June 17-20, 2024, Proceedings, Vol. 14629 of LNCS 414–418, Springer, 2024.  h t t p s : / / d o i . o r g / 1 0 . 1 0 0 7 / 9 7 8 - 3 - 0 3 1 - 6 2 \n3 6 2 - 2 _ 3 6     .   \n35. Kim J, Im I. Anthropomorphic response: understanding interactions between humans and artificial intelligence agents. \nComput Hum Behav. 2023;139: 107512. https://doi.org/10.1016/J.CHB.2022.107512.\n36. Ahmadi N, Hammond T. Recognizing and responding to human emotions: A survey of artificial emotional intelligence for \ncooperative social human-machine interactions. In: Hammond T, Hogan H. editors. IEEE Frontiers in Education Conference, \nFIE 2023, College Station, TX, USA, October 18-21, 2023 1–5 (IEEE, 2023).  h t t p s :  / / d o i  . o r g / 1  0 . 1 1  0 9 / F I  E 5 8 7 7  3 . 2 0 2 3  . 1 0 3  4 3 3 2 8.\n37. Zhang H, Li J, Liu X, Dong C. Multi-dimensional feature fusion and stacking ensemble mechanism for network intrusion \ndetection. Fut Generat Comput Syst. 2021;122:130–43. https://doi.org/10.1016/J.FUTURE.2021.03.024.\n38. LangChain. Langgraph. https://langchain-ai.github.io/langgraph/ (2025). Accessed: 2025-03-15.\n39. LangChain. Agentic rag.  h t t p s :  / / b l o  g . l a n g  c h a i  n . d e v  / a g e n  t i c - r a  g - w i  t h - l a n g g r a p h / 2023. Accessed: 2025-03-15.\n40. LangChain. Reflexion agent.  h t t p s :  / / b l o  g . l a n g  c h a i  n . d e v / r e fl   e c t i o n - a g e n t s / 2023. Accessed: 2025-03-15.\n41. Hu S, Lu C, Clune J. Automated design of agentic systems 2025. https://arxiv.org/abs/2408.08435. arXiv:2408.08435.\n42. Xu B et al. Rewoo: Decoupling reasoning from observations for efficient augmented language models. CoRR  2023. \narXiv:2305.18323.\n43. Van Der Aalst WMP . The application of petri nets to workflow management. J Circ Syst Comput. 1998;08:21–66.  h t t p s : / / d o i . \no r g / 1 0 . 1 1 4 2 / S 0 2 1 8 1 2 6 6 9 8 0 0 0 0 4 3     .   \n44. Ahn Y, Lee S, Shim J, Park J. Retrieval-augmented response generation for knowledge-grounded conversation in the wild. \nIEEE Access. 2022;10:131374–85. https://doi.org/10.1109/ACCESS.2022.3228964.\n45. Zhang R, et al. Interactive AI with retrieval-augmented generation for next generation networking. IEEE Netw. \n2024;38:414–24. https://doi.org/10.1109/MNET.2024.3401159.\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.",
  "topic": "Organizational theory",
  "concepts": [
    {
      "name": "Organizational theory",
      "score": 0.42288491129875183
    },
    {
      "name": "Knowledge management",
      "score": 0.4023208022117615
    },
    {
      "name": "Business",
      "score": 0.3507421016693115
    },
    {
      "name": "Computer science",
      "score": 0.3011474609375
    },
    {
      "name": "Economics",
      "score": 0.16171598434448242
    },
    {
      "name": "Management",
      "score": 0.14737820625305176
    }
  ],
  "institutions": [],
  "cited_by": 1
}