{
  "title": "INTELLIGENT AUTOMATION FOR FDI FACILITATION: Optimizing Tariff Exemption Processes with OCR And Large Language Models",
  "url": "https://openalex.org/W4411288217",
  "year": 2025,
  "authors": [
    {
      "id": "https://openalex.org/A5116903798",
      "name": "Muhammad Sukri Bin Ramli",
      "affiliations": [
        null
      ]
    }
  ],
  "references": [
    "https://openalex.org/W2044858486",
    "https://openalex.org/W2922903482",
    "https://openalex.org/W2891503716",
    "https://openalex.org/W6754143420",
    "https://openalex.org/W2098118776",
    "https://openalex.org/W2073038590",
    "https://openalex.org/W6760053112",
    "https://openalex.org/W1911711584",
    "https://openalex.org/W1821977771",
    "https://openalex.org/W6778883912",
    "https://openalex.org/W2907597507",
    "https://openalex.org/W2798739120",
    "https://openalex.org/W2971035958",
    "https://openalex.org/W2020155291",
    "https://openalex.org/W2988585267",
    "https://openalex.org/W2969625533",
    "https://openalex.org/W4330336443",
    "https://openalex.org/W2146948159",
    "https://openalex.org/W2020798731",
    "https://openalex.org/W6762198346",
    "https://openalex.org/W4230089648",
    "https://openalex.org/W6639651325",
    "https://openalex.org/W6748883668",
    "https://openalex.org/W3017961061",
    "https://openalex.org/W4411288217",
    "https://openalex.org/W2951995708",
    "https://openalex.org/W3083410900",
    "https://openalex.org/W1574137424",
    "https://openalex.org/W3000965188",
    "https://openalex.org/W2798812533",
    "https://openalex.org/W6765162019",
    "https://openalex.org/W6806844907",
    "https://openalex.org/W6719220242",
    "https://openalex.org/W6684868412",
    "https://openalex.org/W6987637430",
    "https://openalex.org/W6612623820",
    "https://openalex.org/W2670253439",
    "https://openalex.org/W2003845384",
    "https://openalex.org/W6680996436",
    "https://openalex.org/W2171422629",
    "https://openalex.org/W2132454116",
    "https://openalex.org/W2006038500",
    "https://openalex.org/W2123179704",
    "https://openalex.org/W6804543789",
    "https://openalex.org/W6635933776",
    "https://openalex.org/W6771043261",
    "https://openalex.org/W4412512538",
    "https://openalex.org/W2945976633",
    "https://openalex.org/W6650820226",
    "https://openalex.org/W2988934653",
    "https://openalex.org/W6684997154",
    "https://openalex.org/W2910023381",
    "https://openalex.org/W6631025977",
    "https://openalex.org/W1481908410",
    "https://openalex.org/W2912099040",
    "https://openalex.org/W3203392755",
    "https://openalex.org/W3121633574",
    "https://openalex.org/W2168808805",
    "https://openalex.org/W2925515791",
    "https://openalex.org/W2492215133"
  ],
  "abstract": "Tariff exemptions are fundamental to attracting Foreign Direct Investment (FDI) into the manufacturing sector, though the associated administrative processes present areas for optimization for both investing entities and the national tax authority. This paper proposes a conceptual framework to empower tax administration by leveraging a synergistic integration of Optical Character Recognition (OCR) and Large Language Model (LLM) technologies. The proposed system is designed to first utilize OCR for intelligent digitization, precisely extracting data from diverse application documents and key regulatory texts such as tariff orders. Subsequently, the LLM would enhance the capabilities of administrative officers by automating the critical and time-intensive task of verifying submitted HS Tariff Codes for machinery, equipment, and raw materials against official exemption lists. By enhancing the speed and precision of these initial assessments, this AI-driven approach systematically reduces potential for non-alignment and non-optimized exemption utilization, thereby streamlining the investment journey for FDI companies. For the national administration, the benefits include a significant boost in operational capacity, reduced administrative load, and a strengthened control environment, ultimately improving the ease of doing business and solidifying the nation's appeal as a premier destination for high-value manufacturing FDI.",
  "full_text": " \n1 \nINTELLIGENT AUTOMATION FOR FDI FACILITATION: Optimizing Tariff \nExemption Processes with OCR And Large Language Models \n \nMUHAMMAD SUKRI BIN RAMLI \nAsia School of Business \nKuala Lumpur, Malaysia \nEmail: m.binramli@sloan.mit.edu \n \nAbstract \n \nTariff exemptions are fundamental to attracting Foreign Direct Investment (FDI) into the manufacturing sector, though \nthe associated administrative processes present areas for optimization for both investing entities and the national tax authority. \nThis paper proposes a conceptual framework to empower tax administration by leveraging a synergistic integration of Optical \nCharacter Recognition (OCR) and Large Language Model (LLM) technologies. The proposed system is designed to first utilize \nOCR for intelligent digitization, precisely extracting data from diverse application documents and key regulatory texts such as \ntariff orders. Subsequently, the LLM would enhance the capabilities of administrative officers by automating the critical and  \ntime-intensive task of verifying submitted HS Tariff Codes for machinery, equipment, and raw materials against official \nexemption lists. By enhancing the speed and precision of these initial assessments, this AI -driven approach systematically \nreduces potential for non-alignment and non-optimized exemption utilization, thereby streamlining the investment journey for \nFDI companies. For the national administration, the benefits include a significant boost in operational capacity, reduced \nadministrative load, and a strengthened control environment, ultimately improving the ease of doing business and solidifying \nthe nation's appeal as a premier destination for high-value manufacturing FDI. \n. \n1. Introduction \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 1: Causal Loop Diagram Illustrating relationship between FDI, Tax Authority and LLM. \n \nThe causal loop diagram on figure 1 illustrates how integrating a Large Language Model like Gemini is designed to \ncultivate a predominantly positive feedback system, ultimately enhancing Foreign Direct Investment (FDI). The interplay of \nkey reinforcing and balancing loops  R1, B1, and B2  describes the mechanics of this transformation. The primary driver of \nenhancement is the reinforcing loop R1. This loop begins with Ge mini significantly boosting the \"Precision\" of the \"Tax \nAuthority,\" for instance, in verifying tariff exemptions. Simultaneously, Gemini positively influences the \"Human Factor\" by \nreducing administrative load and ensuring consistent application of rules. These enhancements strengthen the overall capacity \nand effectiveness of the \"Tax Authority\". This improved authority, in turn, leads to greater reliance on and further optimization \nof Gemini, creating a virtuous cycle that continuously reinforces \"Precisio n\" and human effectiveness. The direct outcomes \nare increased \"Process Agility\" in handling tax-related applications and improved \"Compliance\" with regulations. As the \"Tax \nAuthority\" becomes more efficient and the investment environment more predictable (due to R1), \"Foreign Direct Investment\" \nis encouraged. However, this growth introduces dynamic factors, represented by the balancing loop B1. Rising FDI can place \nincreased demands on the tax system, potentially influencing \"Process Agility\" and the mechan isms ensuring \"Compliance\". \nB1 highlights this aspect: for the system to maintain its attractiveness, the enhancements driven by R1 must effectively absorb \nthese pressures, ensuring the \"Tax Authority\" can scale its improved capabilities. The combined effe ct of enhanced \"Process \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \nAgility\" and \"Compliance,\" alongside a more effective \"Human Factor,\" directly contributes to an improved \"Ease of Doing \nBusiness\" (EoDB), a critical factor for attracting FDI. The balancing loop B2, shown directly on \"Ease of Doing  Business,\" \nintroduces a longer-term, nuanced dynamic. It suggests that as Gemini's integration successfully optimizes processes (like the \ntariff exemption task) and contributes to a highly satisfactory level of EoDB, the specific strategic demands on Gemini for that \nparticular task might achieve a stable optimization or see diminishing marginal returns from further intensive refinement.  \nFigure 2, titled \"Comparison of HS Code Checking Speed: Manual vs. LLM -Assisted,\" hypothetically presents a bar chart \nillustrating the disparity in processing time for 300 Harmonized System (HS) codes between manual verification and an LLM-\nassisted approach. The \"Manual Officer Check\" bar indicates a total processing duration of 450.0 minutes. Conversely, the \n\"LLM-Assisted Check\" bar demonstrates a substantially reduced processing time of 5.0 minutes for  the identical task. The \naccompanying note clarifies that these data points are derived from hypothetical user-provided figures, with the manual process \nestimated at 1 minute 30 seconds per code and the LLM-assisted process at 5 minutes for all 300 codes, thereby underscoring \nthe projected efficiency gains attainable through an LLM system in the context of Foreign Direct Investment (FDI) tariff \nexemption processing. \n \n \nFigure 2: Speed comparison between manual vs LLM-Assisted HS Code Checking \n \n1.1. Background: The Imperative of Manufacturing FDI for Malaysia's Economy \nMalaysia's economic advancement  relies on its national development blueprints, notably the New Industrial Master \nPlan 2030 (NIMP 2030). This plan, as emphasized by the Ministry of I nvestment, Trade and Industry (2023), strategically \nleverages Foreign Direct Investment (FDI) to achieve its ambitious targets, a point reinforced by studies from Abdullah and \nZolkornain (2021) and Athukorala (2019) highlighting FDI's critical role in the nation's economic growth. Within this \nframework, tariff exemptions act as a key fiscal incentive to attract and retain manufacturing FDI, thereby boosting industrial \nactivity and technological progress, with the effective administration of such incentives being paramount, as discussed in \nbroader tax administration analyses (Bird, 2015; Keen & Slemrod, 2017). Simultaneously, the nation is bolstering its \ntechnological infrastructure by investing in advanced Artificial Intell igence capabilities, including access to potent Large \nLanguage Models like Google's Gemini via platforms such as Google Suites. This dedication to AI adoption, as outlined in \nnational digital strategies, is fundamental to modernizing the public sector and improving service delivery, reflecting global \ntrends in public service AI adoption. Demonstrating this commitment, an \"AI at Work\" pilot program involved 270 public \nofficers in December 2024, which was significantly expanded by February 2025 under the \"AI at Work 2.0\" initiative to \npotentially include up to 445,000 officers. \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n3 \n \nFigure 3: Timeline ‘AI at Work’ initiative in Malaysia \n \n \n \n \n \nFigure 4: Number of Public Officers participate for ‘AI at Work’ \n \n \n \n \n \n \n \n \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 5: Relationship between Malaysia Real GDP and FDI Inflow (2008-2024) \n \nFrom 2008 to 2024, Malaysia's economic landscape, as depicted by its Real GDP and Foreign Direct Investment (FDI) \ninflow, showcases two distinct trends  sourced from the nation's Official Open Data Portal  (data.gov.my). Real GDP \nconsistently demonstrated a robust upward trajectory, reflecting sustained long-term economic growth over the seventeen-year \nperiod, effectively doubling its size by 2024. While temporary dips occurred due to global economic events in 2009 and 2020, \nGDP swiftly recovered and continued its expansion, albeit with a brief moderat ion in growth around 2020. In stark contrast, \nFDI inflow exhibited considerable short-term volatility, characterized by significant fluctuations, including pronounced peaks \nin 2016-2017 and a dramatic surge in 2022. However, this surge was followed by a sh arp contraction by 2024, indicating a \nless stable and predictable pattern compared to GDP. The most recent years highlight a notable divergence, where Real GDP \ncontinued its strong growth, reaching new highs, even as FDI inflows experienced a significant decrease from their exceptional \n2022 peak, suggesting a potential decoupling of these two indicators in Malaysia's recent economic performance. \n \n1.2. The Challenge: Navigating Tariff Exemption Complexity \nRecognizing the clear benefits of tariff exemptions  towards the volume of FDI, Malaysian tax administration bodies, \nparticularly the Royal Malaysian Customs Department (RMCD) and the Malaysian Investment Development Authority \n(MIDA), are dedicated to continuously improving the efficiency and accuracy of processing the substantial vol ume of \napplications for these exemptions. The complexity inherent in tariff classification, particularly ensuring Harmonized System \n(HS) codes align with national directives as detailed in various Customs Orders and Regulations, presents a persistent \nchallenge, a complexity noted in academic discussions on tariff classification uncertainty and its trade impact ( Felbermayr, \nTeti, & Yalcin, 2021; Waugh, 1997 ). These challenges in managing complex regulatory information are not uncommon in \npublic administration globally. However, the nation's existing strategic investment in AI, specifically the advanced capabilities \nof Google's Gemini LLM , presents a significant opportunity. This technological infrastru cture, as discussed in contexts of \nautomation and digital transformation (Acemoglu & Restrepo, 2019; Brynjolfsson & McAfee, 2017), can be leveraged to \naddress these administrative complexities, offering pathways to automate and augment the decision-making processes involved \nin tariff exemptions. \n \n1.3. Research Aim and Objectives \nThe central aim of this research is to investigate and propose a conceptual framework for an Optical Character \nRecognition (OCR) -powered system, thoughtfully integrated with Google's Gemini Large Language Model (LLM). This \nframework is primarily envisioned to  enhance the capabilities of the national tax authority in expediting, securing, and \noptimizing tariff exemption processes pertinent to manufacturing Foreign Direct Investment (FDI). This proposal, leveraging \nLLM and OCR for FDI, is considered exceptionally  high-impact due to its direct relevance to substantial investments. The \ntechnological core of this proposed framework lies in combining the historical development and modern applications of OCR \ntechnology for intelligent document processing with the advan ced reasoning and language understanding of Gemini. This \naligns seamlessly with broader public sector modernization efforts and the overarching goal of creating significant public value \nthrough smart technologies. To achieve this aim, the research  pursues several key objectives. Firstly, i t details current \nadministrative workflows and identify specific areas for optimization encountered in verifying FDI tariff exemptions, with a \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n5 \nparticular focus on the nuances of HS Code classification against offic ial national lists and regulations. Secondly, the study  \npinpoints specific operational considerations within these workflows where the advanced language understanding and \nreasoning capabilities of Gemini, synergistically combined with OCR for document processing, can directly assist officers in \ntheir verification tasks. This may involve adapting language models to the specific regulatory domain. Thirdly, the research \nexplores the specific functionalities of both OCR and Google's Gemini LLM, such as its multimodality and contextual \nunderstanding, that are most relevant to these complex verification tasks. Fourthly, a conceptual framework for this AI-driven \nsystem be proposed, tailored for effective use by these administrative bodies. Finally, the research analyzes how such a system \ncan improve administrative efficiency, enhance accuracy in decision-making while considering the importance of interpretable \nmodels in high-stakes decisions, strengthen control over potential exemption non -alignment, and consequently, reduce non -\ncompliance factors for FDI companies, thereby bolstering the overall investment climate and ensuring the system remains \ntrustworthy and human-centric. \n \n1.4. Research Questions  \nThis study is guided by key research questions designed to explore the potential of administrative empowerment \nthrough AI. Primarily, it seeks to determine how Optical Character Recognition (OCR) technology and Google's Gemini Large \nLanguage Model can be specifically and effectively integrated into the existing workflow of the national tax administration . \nThe objective is to understand how this integration can enhance the accuracy and efficiency of verifying HS Tariff Codes for \nFDI exemption applications against official Malaysian directives and regulatory texts, a field informed by surveys on deep \nlearning for legal analytics and LLMs in RegTech (Klanrit, Lee, & Kim, 2023). This involves considering models for human-\nAI interaction and guidelines for designing such collaborative systems (Parasuraman, Sheridan, & Wickens, 2000; Amershi et \nal., 2019). Furthermore, the research investigates the key features of a Gemini-powered system that would directly contribute \nto reducing officer fatigue and improving the consistency of decision -making in the complex process of granting tariff \nexemptions. This involves understanding how AI can support human decision-making as explored by Benbasat and Lim (2000) \nand Klein (2008), maintain officer situation awareness as theorized by Endsley (2017), and provide transparent, explainable \noutputs to ensure trust and consistency, drawing on insights from surveys on explainable AI and its role in decision -making \n(Guidotti et al., 2018; Wang et al., 2021). \n \n1.5. Scope and Delimitations \nThe scope of this research is intentionally focused to ensure depth and relevance. The primary area of investigation \nconcerns tariff exemptions specifically available to manufacturing Foreign Direct Investment (FDI) within the national context, \na sector highlighted as critical in national economic plans. Technologically, the study concentrates on the application of Optical \nCharacter Recognition (OCR) for digitizing relevant documentation and the capabilities of Google's Gemini Large Language \nModel. These technologies be examined primarily from the perspective of their use by, or direct support for, the national tax \nadministration bodies, aligning with national strategies for digital transformation and AI adoption in the public sector. The  \nresearch does not extend to a full technical implementation or the development of new algorithms but focus on the conceptual \nframework, operational integration strategies, and the anticipated administrative impact. \n \n1.6. Significance of the Study \nThe significance of this study is multifaceted, particularly for national tax administration. It proposes a tangible \npathway towards modernization by leveraging a government -acquired, advanced AI tool  Google's Gemini LLM. Such an \ninitiative promises to enhance administrative efficiency, improve the accuracy of complex tariff exemption decisions, and \nprovide greater control over the allocation of fiscal incentives. Ultimately, the successful integration of such a system is \nanticipated to contribute to the creation of demonstrable public value, a concept central to modern public management theories \n(Moore, 1995; Bryson, Crosby, & Bloomberg, 2014; Hartley, 2013), and aligns with best practices i n digital government \ntransformation that aim to enhance citizen services and overall governance (Twizeyimana & Andersson, 2019). By optimizing \na critical component of the FDI facilitation process, the research also holds implications for strengthening the nation's \nattractiveness as an investment destination, fostering a more transparent and predictable regulatory environment for businesses, \nthereby supporting national economic goals. \n \n \n \n \n \n \n \n \n \n \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \n2. Literature review \n \n2.1. FDI Incentives and Manufacturing Growth in Malaysia \nThe economic development trajectory of Malaysia has historically been intertwined with strategic efforts to attract \nForeign Direct Investment (FDI), particularly into its manufacturing sector. National blueprints, including the New Industrial \nMaster Plan 2030 (Ministry of Investment, Trade and Industry, 2023), continue to emphasize FDI as a catalyst for industrial \nupgrading, export growth, and job creation. Academic research, such as studies by Abdullah and Zolkornain (2021) and \nAthukorala (2019), provides empirical evidence on the positive impact of FDI on Malaysia's economic growth and \ndevelopment. In 2024, Malaysia's position in the IMD World Competitiveness Ranking is a key indicator of its attractiveness \nas an investment destination within ASEAN. While Malaysia ranked 34th overall among 67 countries in the IMD 2024 report, \nit stood behind Singapore (1st), Thailand (25th), and Indonesia (27th) among its Southeast Asian peers. The efficacy of fiscal \nincentives, prominently featuring tariff exemptions, play s a significant role in Malaysia's strategy to enhance its \ncompetitiveness as an investment destination (Malaysian Investment Development Authority, various years). The effectiveness \nof these incentives is crucial, as reflected in broader discussions on ta xation within the ASEAN region and its impact on \nbusiness decisions (Sawyer, 2018). \n \nFigure 6: Malaysia Ranking for IMD World Competitiveness 2024 among ASEAN Countries \n \n2.2. The Critical Role of Tax Administration in FDI Facilitation \n \nMetric Effective Tax Administration Ineffective Tax Administration \nFDI Attraction High (Attracts & Retains Capital) Low (Deters Investment) \nInvestor \nConfidence High (Predictable, Transparent) Low (Uncertainty, High Costs) \nOperational Costs Low (Smooth processing, incentives) High (Delays, classification \nissues) \nEconomic Growth Positive (Job creation, development) Negative (Missed opportunities) \nFigure 7: Tax administration effectiveness metrics \n \nEffective tax administration is a cornerstone of a favorable investment climate and plays a critical role in the successful \nfacilitation of Foreign Direct Investment. International experience, as reviewed by  scholars like Bird (2015) and Keen and \nSlemrod (2017) on optimal tax administration, demonstrates that efficient, transparent, and predictable tax systems are \nparamount for attracting and retaining foreign capital. For the tax authority, the processing of FDI-related incentives, such as \ntariff exemptions , such as tariff exemptions as outlined in their Customs Orders and Regulations, directly impacts the \noperational realities and financial viability of investing companies. Complexities  and uncertainties in areas like tariff \nclassification can introduce significant delays and costs, thereby potentially undermining the intended benefits of fiscal \nincentives, a point underscored by research on tariff -classification uncertainty and its effe cts on international trade \n(Felbermayr, Teti, & Yalcin, 2021). Modernization efforts within customs, often highlighted by bodies like the World Customs \nOrganization and discussed in the context of AI's role in trade facilitation (Corteva, 2023), are therefore essential for ensuring \nthat tax administration acts as an enabler, rather than an impediment, to FDI. \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n7 \n2.3. Manual Processes in Public Administration: Bottlenecks and Risks \nMany public administration systems globally continue to manage processes with inherent manual aspects, which can \npresent areas for optimization and introduce dynamic factors. The presence of such processes in critical functions, like the \nassessment of applications for fiscal incentives, can influence processing times, accuracy rates, and transparency (Bostrom & \nHeinen, 1977). The considerations associated with implementing and managing eGovernment solutions often ste m from the \nneed to evolve these established manual systems and manage factors highlighted in government IT project assessments. Optical \nCharacter Recognition (OCR) technology plays a pivotal role in bridging the gap between these traditional paper -based \nmethods and the push towards digitalization. By converting physical documents into editable and searchable digital data, OCR \nhelps eliminate the need for manual data entry, significantly reducing processing times and minimizing human error. While \nworkplace automation offers a pathway to mitigate these issues by taking over repetitive task, the failure to effectively integrate \ntechnology and redesign work processes can perpetuate existing problems or even introduce new ones. Effective socio -\ntechnical design, as explored by Mumford (2006), is crucial to ensure that the move away from manual systems genuinely \nenhances efficiency and reduces risks such as inconsistent decision-making or susceptibility to misuse. \n \n2.4. OCR Technology: From Document Digitization to Intelligent Data Capture \nOptical Character Recognition (OCR) technology has evolved significantly from its origins as a  tool for basic \ndocument digitization to a sophisticated component of intelligent data capture systems. The historical development of OCR, \nas chronicled by researchers like Mori, Suen, and Yamamoto (1992), laid the groundwork for modern engines such as \nTesseract, an open -source option whose overview was provided by Smith (2007), which are capable of converting various \ndocument types into machine -readable text with increasing accuracy. More recently, the field has advanced towards \n\"Intelligent Document Processing\" (IDP), where OCR is combined with AI and machine learning techniques to not only extract \ntext but also to understand its context, classify information, and validate data, as surveyed by Souza, Batista, and Silva (2021). \nThis capability is crucial fo r automating the initial stages of information processing in complex administrative workflows, \ntransforming unstructured or semi -structured data from scanned documents  such as application forms, supporting invoices, \nand technical specifications into structured data amenable to further digital analysis and processing. OCR thus serves as a key \nenabler for subsequent automation and the reinstatement of labor to new tasks (Acemoglu & Restrepo, 2019). \n \n2.5. Large Language Models (LLMs) in Regulatory Technology (RegTech): Focus on Google's Gemini \nLarge Language Models (LLMs) have emerged as transformative technologies with significant potential in Regulatory \nTechnology (RegTech). These models, built upon architectures like the Transformer (Wolf et al., 2020) and exemplified by \nfoundational models which showed few -shot learning capabilities (Brown et al., 2020) and more recent advancements like \nGoogle's Gemini, exhibit remarkable capabilities in understanding, generating, and reasoning with human language, as \ndiscussed in works on the opportunities and risks of such models (Bommasani et al., 2021) and comprehensive surveys of \nLLMs (Zhao et al., 2023). \nAs of early 2025, Google's Gemini is recognized for its advanced reasoning and contextual understanding strengths, \ndetails of which are regularly updated via Google AI and Google Research publications. Crucially for the application discussed \nherein, Gemini is selected not only for these general capabilities but specifically for its robust multimodal understanding. This \nis particularly advantageous for the Malaysian customs context, especially for Harmonized System (HS) Code recognition and \nclassification, where application dockets for tariff exemptions often comprise a mix of typed text, scanned official forms th at \nmay include seals or stamps, and potentially complex tables or diagrams within technical specifications. Gemini's capacity, as \ndetailed in contemporary reports from Google AI and Google Research, to holistically process and interpret such mixed-media \ndocuments offers a more comprehensive analytical starting point than LLMs primarily optimized for plain text, thereby \nenhancing the accuracy of data extraction and subsequent verification by systems like the proposed Gemini -Powered \nVerification Assistant (GPVA). Fu rthermore, if official Google sources by early 2025 indicate superior performance in \nhandling multilingual content relevant to Malaysia (such as Bahasa Malaysia, English, and other scripts encountered in trade \ndocumentation) or specific advancements in few -shot learning for regulatory interpretation, these would be significant \nadditional justifications for its selection, directly contributing to more precise HS code identification. \nThe potential deployment of Gemini via Google Suites and Google Cloud infra structure provides a scalable platform \nfor public sector applications, including in jurisdictions like Malaysia which may leverage such cloud services for public sector \nsolutions and data residency. The capacity of these LLMs to be adapted or fine-tuned for specific domains, a topic explored in \nsurveys on specialized LLMs (Liao et al., 2023), further enhances their utility, making them powerful tools for tasks previously \nconsidered too complex for automation and impacting specialized labor markets (Eloundou et al., 2023). \n \n \n \n \n \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \nThe application of advanced LLMs like Gemini extends naturally to compliance checking, the interpretation  of \ncomplex regulatory texts, and the provision of sophisticated support for expert decision -making. Surveys in the RegTech \ndomain (Zheng, Zhang, & Chen, 2021) and legal AI (Klanrit, Lee, & Kim, 2023; Zhong et al., 2020) highlight how LLMs can \nparse intric ate legal and regulatory documents, identify relevant clauses, and assist in ensuring adherence to multifaceted \ncompliance requirements. For instance, domain-specific models like LEGAL-BERT (Chalkidis et al., 2020) demonstrate the \nefficacy of fine-tuning LLMs for specialized legal language. In the context of customs tariff classification, AI's role in legal \ninterpretation is already being explored (Fedi, 2018). Specifically, LLMs like Gemini can process vast amounts of customs \nregulations and official guidelines, enabling them to compare identified HS Codes against pre -defined lists of eligible versus \nnon-eligible codes for specific tariff exemptions. This capability allows the system to flag potential discrepancies or confirm \neligibility, significantly easi ng the task of customs officers by providing automated pre -screening, enhancing classification \naccuracy, and ensuring consistency across assessments. LLMs can serve as intelligent decision support systems, augmenting \nhuman capabilities in line with research trends in this area (Eom, 2009; Benbasat & Lim, 2000), helping officers navigate vast \namounts of regulatory information and dedicate more focus to complex or ambiguous cases requiring human judgment. \nHowever, the challenge of capturing the \"tacit dimensi on\" of expert knowledge, as described by Polanyi (1966), remains a \nconsideration for LLM application. To be effective and trustworthy in such roles, particularly in high -stakes public \nadministration decisions, the explainability of these models is crucial,  a field actively being researched through surveys on \nXAI methods (Adadi & Berrada, 2018; Guidotti et al., 2018). \n \n2.6. AI Adoption in Global Customs and Tax Modernization: Trends and Case Studies \nThe adoption of Artificial Intelligence is an accelerating trend in the modernization efforts of customs and tax \nadministrations worldwide, as these organizations seek to enhance efficiency, improve risk management, and facilitate \nlegitimate trade and revenue collection. AI applications in public services are becoming increasingly common, with typologies \nof such applications being developed (Barcevičius, Cibaitė, & Codagnone, 2019), and international bodies like the OECD \n(2019) examining the societal and governmental implications of AI. While comprehensive, publicly documented case studies \nof advanced LLMs like Google's Gemini being fully deployed in customs operations for tasks such as nuanced tariff exemption \nprocessing were still emerging as of early 2025, the trajectory is clear. Existing literature points to AI, more broadly, as a game \nchanger for trade facilitation and compliance in customs (Corteva, 2023). Malaysia is actively pursuing AI integration across \nits public sector, including revenue and border agencies. This commitment is underscored by Malaysia's National Artificial \nIntelligence Roadmap 2021 -2025 (AI-Rmap) and the recent establishment of the National AI Office (N AIO) in December \n2024. These initiatives aim to accelerate AI adoption, foster innovation, and enable more sophisticated AI deployments in \ngovernment services, building upon earlier explorations of AI for citizen services . The World Customs Organiz ation (WCO \nNews, various years) often features discussions on technological advancements, and it is anticipated that successful AI \nimplementations, including those involving LLMs for complex text analysis and decision support in regulatory environments, \nbecome more widely reported as administrations gain experience and demonstrate tangible benefits. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n9 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 8: FDI tariff exemption verification flows with Intelligent Automation aid. \n \nFigure 8  flowchart visually outlines an automated system for processing Foreign Direct Investment (FDI) tariff \nexemption applications in Malaysia, leveraging intelligent automation with a feedback loop for corrections. The process begins \nwhen an FDI company submits the application, including an appendix with item descriptions and HS codes. This appendix, as \na scanned PDF, is uploaded, and an Intelligent Docum ent Processing Unit (IDPU) utilizing a Large Language Model (LLM) \nlike Gemini performs Optical Character Recognition (OCR) from the PDF and extracts relevant data such as item descriptions \nand submitted HS codes. This extracted information is then verified  by a Gemini -Powered Verification Assistant (GPVA) \nwhich cross-references it against an official Malaysian knowledge base of tariff orders and MIDA lists, performing semantic \nanalysis for accuracy. \nFollowing this verification, a decision is made: if the it em is verified and eligible, a \"Verified / Eligible\" finding is \nissued, the LLM provides links to relevant regulations, and a consolidated report is generated, leading to an expedited review \nand approval by the tax officer. However, if a discrepancy is fou nd, the LLM details the issue, generates explanations, and \nprovides contextual links/regulations. The tax officer then reviews these AI -generated findings, notifies the company, and \noffers specific, LLM-informed guidance for correction. The company revises  and resubmits its application, which re -enters \nthe verification flow, creating an iterative loop until compliance is achieved or a final decision is made. This system is designed \nto enhance precision, reduce the risk of non -compliance for FDI companies, expedite processing for compliant applications, \nand facilitate a clear correction pathway, ultimately aiming to improve Malaysia's ease of doing business in the manufacturing \nFDI sector. \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \n2.7. Research Gap \nThe preceding review of literature reveals several key  insights: Malaysia actively utilizes FDI incentives like tariff \nexemptions to drive manufacturing growth, a strategy underscored in national plans (Ministry of Investment, Trade and \nIndustry, 2023) and supported by economic analyses (Abdullah & Zolkornain , 2021); effective tax administration is vital for \nthis process, a principle established in public finance literature (Bird, 2015; Keen & Slemrod, 2017); yet, manual processes \nwithin public administration frequently present significant bottlenecks and risk s (Bostrom & Heinen, 1977; Heeks, 2006). \nWhile OCR offers mature solutions for intelligent data capture from documents (Souza, Batista, & Silva, 2021), and advanced \nLLMs like Google's Gemini present powerful capabilities for interpreting complex regulatory  texts and supporting decision-\nmaking within the RegTech space (Google AI, various publications; Zheng, Zhang, & Chen, 2021), a specific research gap \nexists. Current literature extensively covers these areas individually or in broader contexts, such as gen eral AI adoption in \npublic services (Al-Hashimi & Kim, 2021; Kuziemsky & Varpio, 2022) or global trends in customs modernization (Corteva, \n2023). However, there is a discernible lack of focused investigation into how these distinct technologies  OCR for initial \ndocument processing and a state -of-the-art, multimodal LLM like Google's Gemini (as understood in early 2025)  can be \nsynergistically integrated into a conceptual framework specifically designed to optimize the nuanced and critical process of \ntariff exemption verification for manufacturing FDI within the national tax administration. While national strategies call fo r \npublic sector modernization through AI, detailed conceptual models addressing this particular high -impact administrative \nconsideration by leveraging the unique strengths of Gemini are yet to be thoroughly explored and proposed. This research \naims to address this gap by proposing such a framework, thereby contributing a targeted solution to a significant administrative \nand economic facilitation objective. \n \n3. Methodology \n \n3.1. Research Paradigm and Approach \nThis study adopts a pragmatic research paradigm, focusing on practical application and outcomes by addressing a real-\nworld problem within Malaysian tax administration. Pragmatism is suitable as the research aims to develop a useful conceptual \nframework intended to guide the implementation of an AI -driven solution (Aarons, Hurlburt, & Horwitz, 2011). The overall \nresearch approach is qualitative, allowing for an in-depth exploration and understanding of the complexities surrounding tariff \nexemption processes, the potential of AI technologies, and the administrative context within which the proposed system would \noperate. This qualitative approach aligns with methodologies described by Creswell and Poth (2016) and Miles, Huberman, \nand Saldaña (2018), emphasizing rich description and interpretation derived from a variety of textual data sources. \n \n3.2. Research Design \nThe research design is centered on the development of a conceptual framework. This design involves a systematic \nsynthesis of existing knowledge, best practices, and technological capabilities to propose a novel system architecture tailored \nto the specific needs of Malaysian tax administration in managing FDI tariff exemptions. The process draws upon principles \nof framework development often seen in implementation science and information systems research, where understanding the \ncontext, components, and their interactions is crucial (Damschroder et al., 2009; Heeks, 2006). While not a full design science \nresearch project, it incorporates the design artifact creation aspect by proposing a detailed conceptual model. The design also \nimplicitly uses elements of a case study approach (Yin, 2017) by focusing intensively on the Malaysian context, specifically \nthe operations of RMCD and MIDA, as reflected in the analyzed documents and strategic plans. \n \n3.3. Data Sources and Collection \nThe primary data for this study is drawn from an extensive review of secondary sources, as comprehensively listed in \nthe provided references. Data collectio n involved a meticulous selection and analysis of peer -reviewed academic journals, \nconference proceedings, books, official government publications and reports (e.g., from MITI, MIDA, MAMPU, MOSTI, \nRMCD), whitepapers from technology providers (e.g., Google AI, Google Research, Amazon Web Services / Microsoft Azure \n/ Google Cloud), influential reports from international organizations (e.g., OECD, World Bank, WCO, UNCITRAL, UNDP), \nand frameworks from research institutes (e.g., The Alan Turing Institute, AI Now Institute, NIST). These documents provide \nfoundational knowledge on FDI in Malaysia (Abdullah & Zolkornain, 2021; Athukorala, 2019), tax administration practices \n(Bird, 2015; Keen & Slemrod, 2017), challenges in public administration, OCR technology (Souz a, Batista, & Silva, 2021), \nthe architecture and capabilities of Large Language Models including Google's Gemini (Google AI, various publications; \nBommasani et al., 2021; Zhao et al., 2023), AI in RegTech (Zheng, Zhang, & Chen, 2021), and AI adoption strat egies both \nglobally and within Malaysia. The collection focused on materials published up to early 2025 to ensure contemporary \nrelevance, particularly concerning technological capabilities and national strategic directions. \n \n \n \n \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n11 \n3.4. Data Analysis and Framework Development \nThe analytical process for developing the conceptual framework is iterative and synthetic, integrating insights from \nthe diverse data sources. The initial step involved a thematic analysis of the literature to delineate current administrative  \nworkflows for tariff exemptions in Malaysia, identify prevalent operational bottlenecks, and understand the risks associated \nwith manual or sub-optimal processes. Concurrently, an analysis of technical literature, particularly concerning OCR (Smith, \n2007; Souza, Batista, & Silva, 2021) and Google's Gemini LLM (Google AI, Google Research, various publications), was \nundertaken. This analysis specifically focused on Gemini's known strengths as of early 2025, such as its advanced reasoning, \nmultimodal understan ding (processing information from diverse document types that OCR would digitize), contextual \nawareness, extensive language support relevant to Malaysian documents, and its potential integration pathways via platforms \nlike Google Suites or Google Cloud. \nThe core of the framework development involved mapping these identified technological capabilities onto the \ndiagnosed administrative challenges. For instance, Gemini's advanced language understanding and reasoning capabilities were \nconsidered for their poten tial to interpret complex regulatory texts and official Malaysian directives related to HS Code \nclassification (Chalkidis et al., 2020; Klanrit, Lee, & Kim, 2023), thereby assisting officers in making more accurate and \nconsistent decisions. Its capacity to  process and summarize large volumes of information was evaluated for reducing officer \nfatigue and expediting review times. The analytical process also involved designing the interrelationships between the OCR \ncomponent (for data ingestion and digitization ), the Gemini LLM (for analysis, verification, and recommendation), existing \nadministrative databases, and the human customs/MIDA officers, conceptualizing an \"AI as a co -pilot\" interaction model \n(Amershi et al., 2019; Parasuraman, Sheridan, & Wickens, 200 0). The framework’s design explicitly aimed to enhance \nadministrative efficiency, accuracy in HS code verification, control over exemption misuse, and overall transparency, \ncontributing to an improved investment climate. This synthesis was guided by establ ished principles of information systems \ndesign and socio-technical systems thinking (Bostrom & Heinen, 1977; Mumford, 2006) to ensure the proposed framework is \nboth technologically sound and organizationally viable. \n \n3.5. Ensuring Rigor and Trustworthiness \nTo ensure the rigor and trustworthiness of the proposed conceptual framework, several measures were employed. The \nprimary strategy was triangulation, achieved by synthesizing information from a wide array of diverse sources, including \nacademic literature, governmental reports, technical documentation, and international best practices (Creswell & Poth, 2016). \nThis multifaceted review helped to validate findings and ensure a comprehensive understanding of the problem domain and \npotential solutions. The conceptual framework itself was developed systematically, with clear articulation of its components, \ntheir functions, and their interrelations, based on established theories and evidence from the literature. The explicit grounding \nof the framework's design in the documented capabilities of OCR and Google's Gemini (as of early 2025) further enhances its \ncredibility as a plausible and relevant solution. The limitations of the proposed framework and the underlying methodology \nare also clearly acknowledged to provide a balanced perspective. \n \n3.6. Ethical Considerations \nIn developing this framework, even though we're relying on secondary data and not directly interacting with people, \nwe've carefully considered the ethical implications for the proposed AI system. This includes data privacy and security , \nespecially for sensitive commercial and government data the system would handle. Our approach aligns with established data \ngovernance principles and, importantly, with Malaysia's own National Guidelines on AI Governance & Ethics (AIGE) , \nlaunched in September 2024.  The framework also inherently addresses the need for transparency and explainability  in AI-\nassisted decisions. This is crucial for ensuring accountability and maintaining human oversight by officers. We've also \nacknowledged the potential impact on the work force, such as changes in job roles and the need for upskilling, as a vital \nconsideration for future implementation. Ultimately, this study champions the responsible development and deployment of AI \nwithin the public sector, guided by Malaysia's commitment to ethical AI. \n \n3.7. Limitations of the Methodology \nThis study, while comprehensive in its review and synthesis, has inherent methodological considerations. Firstly, the \nreliance on publicly available secondary data means that insights into the nuanced, internal operational details of the nati onal \ntax administration might be less granular than if primary data collection methods like interviews or direct observation were \nemployed. Secondly, the proposed conceptual framework is, by nature, a theoretical construct. Its practical efficacy and \nimplementation success can only be fully ascertained through subsequent empirical validation, pilot testing, and iterative \nrefinement in a real-world setting. Thirdly, the depiction of Gemini's capabilities is based on information available up to early \n2025; the rapidly evolving nature of LLMs means that specific functionalities and performance characteristics may evolve \nover time, potentially influencing some aspects of the proposed framework. Finally, the study focuses primarily on the \ntechnical and administra tive aspects, and while ethical considerations are noted, a more extensive socio -economic impact \nassessment would be beneficial prior to full-scale deployment. \n \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \n4. The Current Landscape of Tariff Exemption Administration in the National Context \n \n4.1. Overview of Tariff Exemptions for Manufacturing FDI in Malaysia \nTariff exemptions represent a significant fiscal incentive utilized by Malaysia to attract and retain Foreign Direct \nInvestment (FDI), particularly within the  strategic manufacturing sector. As outlined in national economic agendas like the \nNew Industrial Master Plan 2030 (Ministry of Investment, Trade and Industry, 2023), these exemptions are designed to reduce \nthe initial investment costs and ongoing operatio nal expenses for companies, thereby enhancing Malaysia's competitiveness \nand fostering industrial development (Abdullah & Zolkornain, 2021; Athukorala, 2019). The effective and efficient \nadministration of these exemptions is therefore paramount, not only for delivering the intended economic benefits but also for \nmaintaining the integrity of the nation's fiscal regime and ensuring a transparent and predictable environment for investors.  \nThe Royal Malaysian Customs Department (RMCD) and the Malaysian Investme nt Development Authority (MIDA) are \ncentral to this administrative ecosystem, overseeing the application, verification, and approval processes for these critical  \nincentives. \n \n4.2. Key Administrative Bodies and Their Roles: RMCD and MIDA \nThe administration  of tariff exemptions for manufacturing FDI in Malaysia is primarily managed by two key \ngovernmental bodies: The Royal Malaysian Customs Department (RMCD) and the Malaysian Investment Development \nAuthority (MIDA). MIDA, as the principal national investment  promotion agency, often plays the initial role in facilitating \nFDI, providing information on available incentives, and guiding investors through the application process (Malaysian \nInvestment Development Authority, various years). They are typically involv ed in assessing the eligibility of projects and \ncompanies for various fiscal incentives, including tariff exemptions, based on criteria aligned with national development goals. \nSubsequently, the RMCD is responsible for the customs-specific aspects of these exemptions. This includes the critical tasks \nof verifying the classification of imported raw materials, components, and machinery against the Harmonized System (HS) \ncodes, ensuring compliance with the terms of the exemption, processing customs declarations, and conducting post-importation \naudits (Royal Malaysian Customs Department, various years). The collaboration and information exchange between MIDA \nand RMCD are crucial for a seamless exemption process, though inter -agency coordination can itself presen t challenges in \npublic administration. \n \n4.3. Current Workflow for Tariff Exemption Application and Verification \nWhile specific internal workflows can vary and evolve, the general process for obtaining and utilizing tariff exemptions \nfor manufacturing FDI involves several key stages, often characterized by substantial documentation and existing checks. \nTypically, an investing company submits an application detailing its project, the goods for which exemption is sought, their \nintended use, and estimated import values. This application is supported by a considerable volume of documentation, such as \nbusiness registration details, manufacturing licenses, lists of raw materials and machinery, technical specifications, invoices, \nand bills of lading. Officers then undertake a verification process. This involves scrutinizing the submitted documents for \ncompleteness and authenticity, assessing the eligibility of the investor and the specific goods against prevailing policies and \ncustoms regulations, and, crucially, verifying the correct HS Code classification for each item. This classification determin es \nthe applicable standard tariff rate and thus the value of the exemption. This stage often involves cross -referencing of product \ndescriptions with extensive tariff schedules, legal notes, and official customs directives. Approval, if granted, comes with \nconditions and reporting requirements that necessitate ongoing compliance monitoring. \n \n4.4. Identified Challenges and Bottlenecks in the Current System \nThe current system for administering tariff exemptions, while foundational, presents several significant areas for \noptimization and operational considerations that can influence efficiency, precision, and the overall experience for investors. \nThese considerations inherently set the stage for exploring how advanced AI capabilities, such as those offered by Google's \nGemini, could provide targeted solutions. A primary area for enhancement is the rigorous application of the General \nInterpretative Rules (GIRs) in a strict hierarchical order. For instance, GIR 1 dictates that classification is determined by  \nheading terms and relative Section/Chapter Notes, which frequently contain exclusionary clauses. Optimizing the identification \nand application of these Notes, or interpreting the scope of a heading, can lead to more precise classifications even before \nsubsequent GIRs are considered. The General Interpretative Rules (GIR) are a set of six principles used to ensure the uniform \nclassification of goods under the Harmonized System (HS) for tariff purposes. GIR 1 establishes the primary basis for \nclassification: the terms of the headings and any relative Section or Chapter Notes. If  classification cannot be determined by \nGIR 1, subsequent rules are applied sequentially. GIR 2(a) extends classification to incomplete/unfinished goods if they \npossess the essential character of the complete/finished article, and to unassembled/disassembl ed goods. GIR 2(b) addresses \nmixtures and combinations of substances, stating that they should be classified according to the principles of GIR 3 if they \nconsist of more than one material. GIR 3 provides a hierarchy for goods classifiable under multiple headings: GIR 3(a) directs \nto the most specific description; if that's not determinative, GIR 3(b) classifies based on the material or component that gi ves \nthe goods their essential character; and if neither (a) nor (b) applies, GIR 3(c) selects the heading that occurs last in numerical \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n13 \norder. Should these rules still not suffice, GIR 4 allows for classification under the heading of goods to which they are mos t \nakin. GIR 5 then specifically addresses the classification of cases, boxes, and similar containers (GIR 5(a)) and packing \nmaterials and containers (GIR 5(b)), generally classifying them with the goods they contain under certain conditions. Finally, \nGIR 6 mandates that the classification of goods in the subheadings of a heading shall be determined by the  terms of those \nsubheadings and any related Subheading Notes, applying GIRs 1 to 5, mutatis mutandis, on the understanding that only \nsubheadings at the same level are comparable. A primary consideration lies in the nuances of regulatory interpretation and HS \nCode classification. National Customs Orders and Regulations are extensive and subject to periodic updates, requiring officers \nto possess comprehensive and current knowledge. The linguistic intricacies of tariff nomenclature and the nuanced distinctions \nbetween HS codes make classification a cognitively intensive task, with potential for variability, an aspect broadly recognized \nin international trade. This dynamic is a key area where Gemini's advanced language understanding and reasoning could assist \nin interpreting regulatory texts and suggesting precise classifications. Secondly, the volume of documentation and data \ninvolved in applications is substantial. Officers actively review and extract relevant information from numerous, often lengthy \nand varied, document formats. Optimizing this data processing can enhance efficiency, redirect skilled officers to higher-value \nanalytical tasks, and mitigate the potential for data entry variations or oversights. OCR technology can address the digitization \naspect, and Gemini's multimodal capabilities and capacity to understand and summarize content from diverse documents could \nfurther streamline this data extraction and preliminary analysis. Thirdly, existing processes inherently present opportunitie s \nfor accelerating turnaround times and optimizing administrative flow. The time taken to thoroughly verify each application \ncan be a factor, influencing project timelines for FDI companies and potentially affecting investment attractiveness. Reducing \nadministrative load through intelligent assistance and expediting verification steps with AI are potential benefits that Gemini \ncould offer. Fourthly, the system presents opportunities for enhancing uniformity and managing potential non -alignment of \nexemptions. Variations in interpretation among officers or across different processing centers can influence rule application. \nMoreover, the volume and complexity of transactions offer an opportunity to enhance the detection of and deterrence against \nmisclassification or other forms of non-compliance with exemption conditions through intelligent auditing. An AI system like \nGemini could enhance uniformity by providing standardized interpretations and strengthen risk assessment by identifying \nanomalies or patterns indicative of potent ial non-alignment. Finally, data management and knowledge sharing within and \nbetween relevant administrative bodies present opportunities for optimization. Information within disparate systems or paper \nfiles can influence efficient cross-referencing and comprehensive oversight. An AI system could contribute by creating a more \nstructured and accessible knowledge base derived from processed applications and regulatory documents, facilitating better -\ninformed decision -making. These multifaceted considerations u nderscore the opportunity for strategic technological \nintervention to modernize tariff exemption administration. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 9: General Interpretative Rules for HS Code Classification \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \n \nReferring to figu re 9, t he General Interpretative Rules (GIR) are a set of six principles used to ensure the uniform \nclassification of goods under the Harmonized System (HS) for tariff purposes. GIR 1 estab lishes the primary basis for \nclassification: the terms of the headings and any relative Section or Chapter Notes. If classification cannot be determined b y \nGIR 1, subsequent rules are applied sequentially. GIR 2(a) extends classification to incomplete/unfi nished goods if they \npossess the essential character of the complete/finished article, and to unassembled/disassembled goods. GIR 2(b) addresses \nmixtures and combinations of substances, stating that they should be classified according to the principles of GIR 3 if they \nconsist of more than one material. GIR 3 provides a hierarchy for goods classifiable under multiple headings: GIR 3(a) directs \nto the most specific description; if that's not determinative, GIR 3(b) classifies based on the material or compone nt that gives \nthe goods their essential character; and if neither (a) nor (b) applies, GIR 3(c) selects the heading that occurs last in numerical \norder. Should these rules still not suffice, GIR 4 allows for classification under the heading of goods to whi ch they are most \nakin. GIR 5 then specifically addresses the classification of cases, boxes, and similar containers (GIR 5(a)) and packing \nmaterials and containers (GIR 5(b)), generally classifying them with the goods they contain under certain conditions. Finally, \nGIR 6 mandates that the classification of goods in the subheadings of a heading shall be determined by the terms of those \nsubheadings and any related Subheading Notes, applying GIRs 1 to 5, mutatis mutandis , on the understanding that only \nsubheadings at the same level are comparable. \n \n5. Conceptual OCR/Gemini LLM-Powered System for National Tax Administration \n \nThis chapter outlines a conceptual framework for an Optical Character Recognition (OCR) and Google Gemini \nLarge Language Model (LLM)-powered system. It's designed to support Malaysian tax administration, specifically the Royal \nMalaysian Customs Department (RMCD) and the Malaysian Investment Development Authority (MIDA), in managing tariff \nexemptions for Foreign Direct Investment (FDI). \n \n5.1. Design Philosophy: AI as a \"Co-pilot\" for National Tax Administration Officers \nThe core design philosophy for the proposed system is AI as a \"co -pilot,\" where technology augments and enhances \nthe capabilities of human officers rather than replacing them. This approach, drawing from guidelines for human-AI interaction \n(Amershi et al., 2019; Shneiderman, 2020), ensures that officers retain final decision-making authority while being empowered \nby the advanced analytical and information processing strengths of Google's Gemini LLM. The system aims to function as a \nsophisticated decision-support tool (Benbasat & Lim, 2000), helping officers navigate complexity, reduce cognitive load, and \nimprove the consistency and accuracy o f their work, thereby maintaining their situation awareness (Endsley, 2017). By \nleveraging Gemini's capabilities (as understood in early 2025, detailed in Google AI and Google Research publications) within \na human -centered design, the system intends to cre ate a collaborative synergy between human expertise and artificial \nintelligence, aligning with principles of joint cognitive systems (Hollnagel & Woods, 2005). This philosophy emphasizes trust, \ntransparency, and the ultimate goal of enabling officers to perform their duties more effectively and efficiently. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 10: Improvised APQC's (American Productivity & Quality Center) classic Knowledge Flow Process \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n15 \nFigure 10 illustrates a modernized APQC 9-step knowledge management cycle, depicted as a continuous circular flow, \nwhere each stage  from CREATE through to LEARN/IMPROVE  is significantly enhanced by embedded Digitalization and \nArtificial Intelligence (D&AI) technologies, particularly Optical Character Recognition (OCR) and Large Language Models \n(LLMs). As visualized for a context likely relevant to Malaysian trade or regulatory processes (e.g., involving \"HS/GIR\" tariff \nclassifications), these D&AI tools are shown to transform traditional knowledge activities by enabling automated data capture, \nintelligent analysis, semantic search, AI-assisted decision-making, and continuous process refinement, ultimately aiming for \na more efficient, accurate, and intelligent knowledge flow. \n \n \n \nFigure 11: Risk quadrant Matrix and corresponding human-AI interaction Models \n \nThe 4-quadrant risk matrix on figure 11, which plots the \"Severity of Outcome\" against the \"Likelihood of Outcome,\" \nis a tool used to categorize and prioritize potential scenarios. This matrix also helps in conceptualizing the appropriate level of \nhuman oversight when AI systems are employed, suggesting models like Human-out-of-the-Loop (HOOTL) for scenarios with \nlower impact/likelihood, Human -over-the-Loop (HOTL) for manageable ones, and crucial Human -in-the-Loop (HITL) for \nsignificant or critical outcomes. In the context of \"Intelligent Automation for Investment F acilitation,\" this matrix is highly \nrelevant because the tariff exemption process inherently involves potential scenarios such as \"non -optimized exemption \nutilization\" and \"non -compliance,\" which can lead to significant financial, legal, or reputational co nsiderations for both \ncompanies and the national tax administration. The proposed OCR -LLM system aims to \"enhance the precision of critical \nverification tasks\" and \"drastically reduce the potential for non -compliance,\" effectively lowering the likelihood o f these \noutcomes. Given the potential for high severity in tariff exemption outcomes, these considerations could fall within the upper, \nmore critical quadrants of the matrix. Therefore, the system's design, which empowers tax officers with AI as a \"co -pilot\" (a \nHuman-in-the-Loop approach), is particularly suitable for managing these high -stakes scenarios, aiming to shift potential \noutcomes from a higher likelihood/severity quadrant to a state where the likelihood is reduced while human oversight ensures \nthe higher severity potential is carefully managed. \n \n \n \n \n \n \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \n5.2. System Architecture and Core Modules \nThe proposed system comprises two primary interconnected modules designed to streamline the tariff exemption \nverification process from document ingestion to officer decision support. \n \nFigure 12: Flow-chart process of transformation of digitalization of LLM input data \n \nModule 1: Intelligent Document Processing Unit (IDPU) \nThe Intelligent Document Processing Unit (IDPU) serves as the initial gateway for all application-related documents. \nThis module is fundamentally OCR -based, employing advanced OCR technologies (Souza, Batista, & Silva, 2021; Smith, \n2007) to convert various forms of submitted documentation  such as application forms, invoices, bills of lading, technical \nspecifications, and certificates into machine-readable text and structured data. Beyond basic digitization, the IDPU incorporate \nintelligent features to classify document types, identify key information fields, and extract relevant data points (e.g., applicant \ndetails, item descriptions, claimed HS codes, quantities, values). This accurately extracted and structured data is crucial, as it \nforms the primary input for the subsequent analysis by the Gemini -powered module, ensuring that Gemini operates on clean \nand well-organized information. \n \n \nFigure 13: Conceptual knowledge base of the GPVA \n \nModule 2: Gemini-Powered Verification Assistant (GPVA) – For Officer Use \nThe Gemini-Powered Verification Assistant (GPVA) is the core analytical engine of the system, designed for direct \nuse by RMCD and MIDA officers. It leverages Google's Gemini LLM's advanced capabilities to provide comprehensive \nverification support. Its key functionalities include: \nAutomated cross-referencing and knowledge base querying: The GPVA take the structured data from the IDPU (e.g., \nitem descriptions, quantities, claimed HS codes) and automatically cross -reference it against an integrated knowledge base. \nThis knowledge base would comprise official Malaysian customs orders, tariff schedules, lists of eligible/ineligible items, \nMIDA's guidelines, and other relevant regulatory documents, which can be regularly updated. Gemini's analytical capabilities \n(Google AI, various publications; Zhao et al., 2023) be employed to perform complex queries and pattern matching within this \nextensive dataset, far exceeding the speed and scope of manual checks. \nPaper\n Scanner\n OCR\n LLM\nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n17 \nSemantic analysis for classification and eligibility: A critical function of the GPVA  be its Gemini -driven semantic \nanalysis. This involves using Gemini's sophisticated natural language understanding (NLU) and reasoning abilities (Brown et \nal., 2020; Hendrycks et al., 2021) to interpret the nuanced descriptions of imported goods. It compares these descriptions \nagainst the detailed specifications in the Harmonized System (HS) nomenclature and local Malaysian regulatory texts \n(Chalkidis et al., 2020; Klanrit, Lee, & Kim, 2023) to verify the appropriateness of the claimed H S code or suggest more \naccurate alternatives. Furthermore, it analyzes item eligibility based on the specific criteria for tariff exemptions, flagging \nitems that may not qualify. The model could be fine-tuned on Malaysian regulatory and customs language (Gururangan et al., \n2020) to enhance its domain-specific accuracy. \nDiscrepancy highlighting and explainable outputs: The GPVA  be designed to proactively highlight potential \ndiscrepancies, ambiguities, non-listed HS codes, or items deemed ineligible. Crucially, it provides officers with clear, concise \nexplanations for these flags, generated or supported by Gemini's reasoning capabilities (Adadi & Berrada, 2018; Guidotti et \nal., 2018; Miller, 2019). This aligns with the principles of explainable AI  (XAI), enabling officers to understand the basis of \nthe AI's suggestions and build trust in the system (Wang et al., 2021). The goal is not black -box decisioning but transparent \nassistance (Rai, 2020). \nContextualized information and regulatory linkage: Fo r items where verification is complex or requires deeper \nscrutiny, the GPVA provide officers with direct hyperlinks to the relevant sections of underlying laws, regulations, customs \nrulings, or official lists. Gemini can further enhance this by offering summaries or contextual explanations of these legal texts \n(Zheng, Zhang, & Chen, 2021), making it easier for officers to quickly grasp the pertinent rules and confirm their assessments. \nSemantic analysis for classification and eligibility : This involves using Gemini's NLU to interpret item descriptions \nagainst HS nomenclature, and critically, to apply the logic of the General Interpretative Rules (GIRs). For instance, when \nanalyzing an 'unassembled bicycle', Gemini could identify the applicability of GIR 2(a) and prompt for or verify its 'essential \ncharacter'. Similarly, for goods potentially classifiable under multiple headings, it could flag the need to apply GIR 3, perhaps \nsuggesting the most specific description (GIR 3(a)) or the component providing essential character (GIR 3(b)). A key strength \nwould be its ability to parse and apply exclusionary or inclusionary Section and Chapter Notes, such as those determining the \nclassification of a plastic toy away from Chapter 39 into Chapter 95. \n \n5.3. Operational Workflow: How Officers Interact with the Gemini-Powered GPVA \nThe operational workflow is designed to integrate the GPVA seamlessly into the daily tasks of administrative officers, \nenhancing their existing processes. Application Su bmission & Digitization: Applicants submit their tariff exemption \napplications and supporting documents (potentially through an online portal or as scanned documents). The IDPU \nautomatically processes these documents, extracts relevant data, and indicates any missing information. Case Assignment & \nInitial Review by GPVA: Digitized applications are assigned to an officer. The GPVA has already performed  a preliminary \nanalysis on the case, including the automated cross -referencing and semantic analysis. Officer Interaction with GPVA \nInterface: The officer accesses the case via a dedicated interface. This interface presents a consolidated view of the application, \nwith key data highlighted. The GPVA's findings  such as suggested HS code verifications, el igibility checks, highlighted \nconsiderations, and confidence score  be clearly displayed alongside the original document snippets. Guided Verification & \nDecision Making: Officers use the GPVA's outputs as a guide. They can review indicated items, expl ore the AI -generated \nexplanations, access linked regulatory texts (potentially summarized by Gemini), and examine the evidence. Officers can query \nthe GPVA for further clarification or to test alternative scenarios. The system supports naturalistic decision-making processes \nby providing information in an intuitive and actionable manner. Officer Adjudication & Audit Trail: The officer makes the \nfinal decision on each item and the overall application, with the ability to override AI suggestions by providing j ustification. \nAll interactions, AI suggestions, officer decisions, and justifications are logged, creating a comprehensive audit trail cruc ial \nfor transparency and accountability. Feedback Loop & Continuous Improvement: The system could incorporate a feedb ack \nmechanism where officers can rate the usefulness of AI suggestions, which, over time (and with appropriate safeguards and \naggregation), can be used to further refine the underlying models and the knowledge base. This workflow ensures that the \nofficer remains central to the process, using the GPVA as a powerful assistant to navigate complexity and enhance decision \nquality. \n \n5.4. Data Management, Security, and Ethical Considerations for using Gemini within Government \nThe deployment of an OCR/Gemini -powered system within Malaysian tax administration necessitates robust data \nmanagement, security protocols, and adherence to e thical AI principles. Data Management and Security: All data processed \nby the system, including sensitive commercial information from FDI applicants and official regulatory data, must be managed \nin accordance with Malaysian data governance laws and best p ractices (Puthucheary & Sivanathan, 2022; AlRyalat, Al -\nHawari, & Al -Omari, 2021). If leveraging Google Cloud infrastructure for hosting Gemini and associated services, data \nresidency options ensuring data remains within Malaysia (or approved jurisdictions)  must be utilized, as per cloud provider \ndocumentation (Amazon Web Services / Microsoft Azure / Google Cloud, various whitepapers). Strict access controls, role -\nbased permissions, encryption of data at rest and in transit, and regular security audits are paramount, aligning with frameworks \nlike the NIST AI Risk Management Framework (NIST, various years) and general cybersecurity principles for AI (Rowland \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \n& Podnar, 2021; Comiter, 2019). Comprehensive logging and monitoring  essential to detect and re spond to any security \nincidents or unauthorized access attempts. \nEthical Considerations and Responsible AI: The use of Gemini must align with established ethical guidelines for \ntrustworthy AI (European Commission's High -Level Expert Group on AI, 2019; Flo ridi et al., 2018; Dignum, 2019). This \nincludes ensuring fairness (Aggarwal, 2018, on biases), transparency in how the AI arrives at suggestions (as discussed with \nXAI), human oversight, and accountability for final decisions. The system should be designed  to avoid algorithmic bias that \ncould disproportionately affect certain types of applications or investors. Regular assessments for potential biases and \nperformance drift will be necessary. Specific attention must be paid to Malaysia's developing AI regula tory landscape and \nlegal perspectives on AI ethics (Ariffin & Ahmad, 2023; Jobin, Ienca, & Vayena, 2019). The system should not engage in \nmanipulative \"nudging\" (Susser, Roessler, & Nissenbaum, 2019) but rather provide clear, objective support. Considerati ons \nof digital sovereignty (Pohle & Thiel, 2020; Wagner, 2018) and the governance of algorithmic systems by global platforms \nwithin national contexts (Katzenbach & Ulbricht, 2019) will also inform policy and oversight. The overall design must uphold \nprinciples of value-sensitive design (van den Hoven, Vermaas, & van de Poel, 2015), ensuring the technology serves public \nvalue and maintains public trust. \n \n6. Benefits, Strategic Considerations, and Broader Implications \n \nThe proposed conceptual framework for an Optical Character Recognition (OCR) and Google Gemini Large Language \nModel (LLM)-powered system offers significant potential for transforming tariff exemption administration in Malaysia. This \nchapter explores the direct benefits for the Malaysian tax administration and Foreign Direct Investment (FDI) companies, its \nimpact on the national investment climate, and critically examines the implementation challenges and mitigation strategies \nassociated with deploying such an advanced AI solution. \n \n6.1. Direct Benefits for Malaysian Tax Administration (RMCD & MIDA) through Gemini Implementation \nThe integration of Google's Gemini LLM into the tariff exemption workflow promises substantial direct benefits for \nthe national tax administration. A primary advantage lies in enhanced operational efficiency . Gemini's capability for rapid, \nlarge-scale analysis of complex regulatory texts and application documents, as highlighted by Google AI and Google Research \npublications, can significantly reduce the time officers spend on manual verification and cross -referencing tasks. This \naccelerated processing, from document ingestion via OCR to AI -assisted verification, can lead to faster turnaround times for \napplications, thereby optimizing resource allocation within these agencies (De Witte & Geys, 2011; Kuziemsky & Varpio, \n2022). \nFurthermore, the system is anticipated to bring about a notable improvement in accuracy and consist ency. Gemini's \nadvanced language understanding and reasoning capabilities (as known in early 2025) can aid in the precise interpretation of \nintricate customs nomenclature and eligibility criteria, minimizing human errors that may arise from fatigue or subj ective \njudgment (Keen & Slemrod, 2017).  This heightened accuracy directly addresses the documented complexities in customs \nclassification, such as the consistent application of the six General Interpretative Rules, the correct interpretation of oft en \nnuanced Section and Chapter Notes (which can alter prima facie classifications), and ensuring uniformity in decisions that \ncould otherwise vary due to subjective interpretation of 'essential character' or 'specific description. By providing standardized \ninterpretations and flagging discrepancies with AI-generated explanations, the system can ensure more uniform application of \nrules across different officers and cases, contributing to fairer and more reliable outcomes. This increased accuracy also \ntranslates to enhanced control and risk management, as the system can potentially identify patterns or anomalies indicative of \nnon-compliance or misuse more effectively than purely manual reviews. Ultimately, the adoption of such a system signifies a \ncrucial step towards  the modernization of public administration  (Barcevičius, Cibaitė, & Codagnone, 2019; Mehr, 2017), \naligning with  broader digital transformation goals and improving the  quality of government services (El -Haddadeh, \nWeerakkody, & Osmani, 2019). \n \n6.2. Positive Outcomes for FDI Companies \nThe implementation of an efficient and accurate OCR/Gemini -powered system for tariff exemptions is expected to \nyield significant positive outcomes for FDI companies operating in or considering Malaysia. The most immediate benefit will \nbe reduced processing times for tariff exemption applications . Faster approvals mean companies can import necessary raw \nmaterials, components, and machinery more quickly, accelerating project timelines and enabling quicker commencement o f \nmanufacturing operations. This efficiency directly translates into potential cost savings and improved cash flow management \nfor businesses. \nMoreover, the system can lead to greater predictability and transparency  in the exemption process. Consistent \napplication of rules and clearer communication (potentially facilitated by AI -generated explanations or status updates) can \nreduce uncertainty for investors (Felbermayr, Teti, & Yalcin, 2021). A more streamlined and understandable process reduces \nthe administrative burden on companies, freeing up their resources to focus on core business activities rather than navigating \ncomplex bureaucratic procedures. This improved experience can enhance investor confidence and satisfaction, making \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n19 \nMalaysia a more attractive location for foreign investment, a key consideration often highlighted by international business \norganizations (International Chamber of Commerce, various publications). \n \n6.3. Impact on Malaysia's Investment Climate and Ease of Doing Business \nThe benefits accruing to tax administration and FDI companies will collectively contribute to a more positive impact \non Malaysia's overall investment climate and its ranking in global ease of doing business indices (World Bank, various years). \nAn efficient, transparent, and technologically advanced customs and tax administration system is a critical determinant of a \ncountry's attractiveness to foreign investors. By significantly improving a key aspect of the FDI facilitation process, Malaysia \ncan further enhance its re putation as a pro -business destination committed to leveraging cutting -edge technology for good \ngovernance. This modernization aligns with the strategic objectives of national plans like the New Industrial Master Plan 2030 \n(Ministry of Investment, Trade an d Industry, 2023) which aim to draw high -quality FDI by creating a conducive ecosystem. \nThe successful implementation of such an AI system can signal Malaysia's leadership in digital government within the region, \nfostering greater economic growth and devel opment (Abdullah & Zolkornain, 2021; Athukorala, 2019). This contributes \ndirectly to the creation of public value by making public services more responsive and supportive of economic activity (Moore, \n1995; Bryson, Crosby, & Bloomberg, 2014; Twizeyimana & Andersson, 2019). \n \n6.4. Implementation Challenges and Mitigation Strategies for a Gemini-based solution \nDespite the promising benefits, the implementation of a sophisticated AI solution like the proposed OCR/Gemini -\npowered system presents several challenges that require careful consideration and proactive mitigation strategies. \nFirst, customizing and fine-tuning Gemini for specific Malaysian regulatory language and customs nomenclature is a \ncritical hurdle. While powerful, general LLMs like Gemini may require significant adaptation to accurately interpret the highly \nspecialized, often nuanced, terminology found in Malaysian legal and customs documents. Mitigation involves employing \nadvanced fine-tuning techniques (Howard & Ruder, 2018; Gururangan et al., 2020), developing domain-specific prompts, and \ncurating comprehensive datasets of Malaysian regulations for adaptation (Liao et al., 2023). Collaboration with legal and \ncustoms experts will be essential in this iterative process, drawing upon existing research in Legal NLP (Chalkidis et al., 2020; \nKlanrit, Lee, & Kim, 2023). \nSecond, managing dependencies on Google's platform, including updates and API changes, poses a strategic challenge. \nRelying on a third-party platform introduces risks related to vendor lock-in, unexpected modifications to service offerings, or \nchanges in API functionalities that could impact the system's stability. To mitigate this, the Malaysian government should seek \nrobust Service Level Agreements (SLAs). Crucially, to further manage these dependencies, consideration should be given to \narchitectural best practices, such as developing an 'anti -corruption layer' or an abstraction layer within the system. This \nsoftware engineering approach would serve to decouple the core Malaysian administr ative system from direct, hard -coded \ndependencies on specific Google Gemini API structures. Such a layer would manage interactions with the LLM, making it \neasier to adapt to API updates from Google or, in the long term, even facilitate migration to alterna tive LLM solutions if \nstrategically necessary, thereby enhancing system resilience and future -proofing the investment against unforeseen platform \nshifts. The government should also maintain open communication with Google regarding their product roadmap and advocate \nfor long -term support  commitments. Understanding the broader dynamics of digital technology governance (Flyverbom, \nDeibert, & Matzner, 2019) is also pertinent. \nThird, ensuring robust data governance and security within the Google Cloud ecosystem, if utilized, is paramount. The \nsystem will handle sensitive government and commercial data, necessitating stringent adherence to Malaysian data protection \nlaws (Puthucheary & Sivanathan, 2022) and international best practices. Mitigation strategies, as outlined in Chapter 5, include \nstrong encryption, strict access controls, regular security audits, and leveraging Google Cloud's security features and data \nresidency options to ensure data sovereignty. Comprehensive data governance frameworks specific to this AI application will \nbe needed (AlRyalat, Al-Hawari, & Al-Omari, 2021; Janssen, van der Voort, & Wahyudi, 2017). \nFourth, the cost implications of scaled Gemini usage, even with potential government agreements, must be carefully \nmanaged. The computational resources required for sophisticated LLMs can lead to significant operational costs, particularly \nwith high volumes of complex queries. Mitigation involves negotiating favorable pricing, optimizing the design of queries and \nworkflows for efficiency, implementing robust usage monitoring and quota systems, and conducting a thorough, ongoing cost-\nbenefit analysis to ensure sustained value. \nFinally, the need for specialized training for officers on using Gemini-powered tools is crucial for successful adoption. \nOfficers must be trained not only on the technical operation of the system but also on how to interpret AI outputs critically , \nunderstand its limitations, and effectively collaborate with the AI \"co -pilot\" (Amershi et al., 2019). Comprehensiv e change \nmanagement programs (Fullan, 2006), user-friendly interface design, and continuous learning support will be essential to build \ntrust, ensure user acceptance (Venkatesh et al., 2003), and effectively integrate this new technology into established w ork \npractices (Nonaka, 1994; Shneiderman, 2020). This aligns with broader needs for upskilling the public sector workforce for \nthe digital age (OECD, various studies). \n \n \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \n7. Conclusion \n \nThis chapter concludes the research by recapitulating its core focus on leveraging Google's Gemini Large Language \nModel (LLM) as a catalyst for modernizing tax administration in the national context. It summarizes the key findings regarding \nthe transformative potential of integrating Optical Character Recognition (OCR) with Gemini for tariff verification, offers \nspecific recommendations for key stakeholders, acknowledges the study's considerations, and proposes avenues for future \nresearch. \n \n7.1. Recapitulation of Research: Google's LLM as a Catalyst for Modern Tax Administration in Malaysia \nThis research set out to address the nuances and opportunities for optimization inherent in the administration of tariff \nexemptions for Foreign Direct Investment (FDI) within national tax bodies. Recognizing the nation's strategic investment in \nadvanced AI capabilities, including access to Google's Gemini LLM, this study investigated how these technologies could be \nharnessed. The central aim was to propose a conceptual framework for an OCR -powered system, integrated with Gemini, \nspecifically designed to enhance the precisio n, efficiency, and transparency of verifying tariff exemption applications. By \nsynthesizing insights from literature on AI in public administration, tax and customs modernization, and the technical \ncapabilities of OCR and advanced LLMs like Gemini, this study has laid out a vision for a digitally augmented administrative \nprocess, aligning with national economic goals and digital transformation agenda. Mitigation involves curating comprehensive \ndatasets of national regulations for adaptation. This dataset sh ould ideally include not only formal tariff schedules and legal \nnotes but also practical examples and common considerations for HS classification. Fine -tuning Gemini on such practical \nexamples would equip it to better understand the application of rules, beyond just their literal text. \n \n7.2. Key Findings: The Transformative Potential of OCR Integrated with Gemini for Tariff Verification \nThe key finding of this research is the significant transformative potential that an integrated OCR and Google Gemini \nLLM system holds for the  national tariff verification process. The proposed conceptual framework demonstrates that such a \nsystem can move beyond simple automation to provide intelligent assistance to administrative officers. The OCR component \naddresses the initial opportunities f or optimization in data entry from diverse documentation. More profoundly, Google's \nGemini, with its advanced natural language understanding, reasoning, and (as of early 2025) multimodal capabilities, offers \nthe potential to significantly improve the precision of HS Code classification by interpreting complex regulatory texts and item \ndescriptions. It can expedite the verification process through rapid cross -referencing and analysis, enhance consistency in \ndecision-making by providing standardized interpretations, and improve officer productivity by acting as an AI \"co-pilot\". The \nability of Gemini to provide explainable outputs is crucial for maintaining officer oversight and building trust, thereby fostering \na collaborative human -AI environment. This syner gy promises not only to streamline administrative workflows but also to \nenhance the integrity and effectiveness of the tariff exemption scheme, contributing to a more efficient public service  (De \nWitte & Geys, 2011). \n \n7.3. Recommendations \nBased on the findings a nd the proposed conceptual framework, the following recommendations are offered to key \nstakeholders to translate this potential into tangible benefits. For the national tax authority, several actions are advised. Firstly, \nit is recommended that the tax authority collaboratively develop a strategic plan focused on leveraging existing government \naccess to Google's Gemini LLM for optimizing tariff exemption processing. This plan should align with national AI and public \nsector modernization strategies and must detail clear objectives, timelines, and performance metrics for AI integration. \nFollowing strategic planning, the initiation of focused pilot programs is cru cial. These programs should utilize Gemini for \nspecific tasks within the tariff verification workflow, particularly for HS Code verification and regulatory text interpretat ion, \nproviding valuable insights into practical considerations, system performance, and user acceptance in a controlled \nenvironment. To this end, it is recommended that pilot programs incorporate specific Key Performance Indicators (KPIs) to \nquantitatively assess the impact of the Gemini -powered system. These should include, but not be limited to: (i) average \npercentage reduction in processing time per tariff exemption application, particularly for HS Code verification tasks, aiming  \nfor targets suggested by preliminary estimates (e.g., the potential 5.0 minutes per 300 codes for LLM -assisted checks versus \n450.0 minutes manually); (ii) measurable improvement in the accuracy rate of initial HS code classifications compared to \nbaseline manual proces ses; (iii) reduction in the number of applications requiring secondary review or correction due to \nclassification errors; (iv) officer time saved on document review and information extraction, allowing reallocation to higher -\nvalue tasks; and (v) a reductio n in instances of non -compliance or misuse of exemptions identified through improved \nverification precision. Such assessments should follow principles of phased implementation (Aarons et al., 2011; Damschroder \net al., 2009). Furthermore, active collaborati on with Google, within the parameters of existing government agreements, is \nadvised to explore optimal configuration and potential fine -tuning of Gemini models for the specific nuances of Malaysian \ncustoms regulations, tariff nomenclature, and multilingual  documentation (Gururangan et al., 2020; Howard & Ruder, 2018; \nLiao et al., 2023), which will be crucial for maximizing accuracy and relevance. Lastly, a significant investment in \ncomprehensive training programs for officers is essential. This training should extend beyond basic AI tool usage to encompass \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n21 \neffective interaction with Gemini -powered systems, critical interpretation of AI -generated suggestions, understanding AI \nlimitations, and data ethics (Nonaka, 1994; OECD, various skills reports), as such p rograms are vital for fostering user \nacceptance and maximizing the \"co-pilot\" potential of the AI (Venkatesh et al., 2003). \nFor the broader Malaysian Government and policymakers, two key areas of focus are recommended. Firstly, ensuring \nthat the necessary supporting digital infrastructure, robust data governance policies, and cybersecurity frameworks are firmly \nin place is paramount to facilitate the effective, secure, and ethical use of advanced AI like Gemini across public services. This \nincludes address ing data residency, privacy, and cross -agency data sharing protocols (Puthucheary & Sivanathan, 2022; \nAlRyalat, Al-Hawari, & Al-Omari, 2021; NIST AI RMF), supported by national AI strategies (Ministry of Digital / MOSTI, \nMalaysia). Secondly, there should b e a systematic evaluation of the outcomes, benefits, and challenges from the initial \napplications of Gemini within tax administration. These evidence -based insights should then inform broader strategies for \ndeploying Gemini or similar LLMs across other pub lic service sectors where complex text analysis, decision support, and \nenhanced efficiency are required (Walker, Damanpour, & Devece, 2010), employing a system thinking approach to anticipate \nwider impacts (Meadows, 2008). \n \n7.4. Limitations of the Study \nThis study, while comprehensive in its review and synthesis, is subject to certain inherent considerations in its design \nand scope, as acknowledged in Chapter 3. Firstly, its findings are primarily based on a qualitative synthesis of existing literature \nand publicly available information, without the benefit of primary data collection from administrative officers or direct system \nprototyping. Secondly, the proposed framework is conceptual; its practical viability, precise performance metrics, and actual \nimpact can only be determined through empirical testing and real-world implementation. Thirdly, the capabilities of Google's \nGemini and other LLMs ar e rapidly evolving. While this study is based on knowledge available up to early 2025, future \nadvancements may offer new possibilities or influence some of the assumptions made regarding specific functionalities. \nFinally, the study provides a high-level consideration of strategic aspects and ethical implications, each of which would warrant \nmore in-depth investigation in subsequent phases of development and deployment. \n \n7.5. Avenues for Future Research \nThe conceptual framework and findings presented in this study open up several avenues for future research that would \nbe critical for advancing the practical application of Gemini in Malaysian tax administration and beyond. The most immediate \nneed is for empirical research to validate the proposed conceptual framework. This would involve developing a prototype of \nthe OCR/Gemini-powered system and conducti ng pilot studies within the tax authority to measure its impact on processing \ntimes, precision rates, officer productivity, and user satisfaction . Concurrently, future research should delve deeper into \nleveraging Gemini's multimodal capabilities, as detailed in Google AI publications and Bommasani et al. (2021) and noted for \nearly 2025. This could involve investigating its utility in analyzing scanned documents that include images, diagrams (e.g., \ntechnical specifications of machinery), or even potentially connecting to visual inspection data of goods, further enriching the \nverification process. To ensure optimal selection and deployment, comparative studies evaluating the performance, cost -\neffectiveness, and suitability of Gemini against other leading LLMs or alternative AI techniques for the specific tasks involved \nin tariff verification within the Malaysian context, considering their respective states of development as of early 2025, wou ld \nalso be beneficial. \nBeyond technical performance, it is crucial to undertake in-depth socio -technical studies examining the long -term \nimpact of such AI systems on the workforce, including changes in job roles, skill requirements, organizational culture, and the \nhuman-AI collaboration dynamics within administrative bodies. Complementing this, research into the development of robust \nethical auditing mechanisms specifically tailored for LLM-based systems in public administration is vital, focusing on ensuring \nfairness, accountability, transparency, and compliance with evolving AI regulations within the national context. Furthermore, \ninvestigating the integration of the Gemini-powered system with other existing or planned digital government platforms in the \nnation is essential to create a more seamless and data -driven public service ecosystem, potentially exp loring synergies with \ntechnologies like blockchain for enhanced supply chain and trade document verification. Finally, comprehensive cost-benefit \nanalyses for full -scale deployment are necessary. Future research into strategies for optimizing the scalabili ty and \ncomputational efficiency of the system to manage costs effectively while expanding its application should particularly explore \nnuanced operational models such as 'tiered LLM usage.' This would involve investigating the feasibility of employing a \nspectrum of LLM capabilities  potentially using less computationally intensive and therefore more resource -efficient LLM \nversions or models for initial, simpler tasks like basic data extraction confirmation from OCR outputs or routing \nstraightforward queries, while reserving the full power of the advanced Gemini model (especially its renowned multimodal \nunderstanding and deep reasoning capabilities as understood in early 2025) for the more complex semantic analysis, regulatory \ninterpretation, and resolution of considerations. Such a tiered approach could significantly optimize ongoing operational costs \nwithout compromising the effectiveness of critical verification stages, particularly when expanding its application. \n \n \n \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \n8. Reference \n \nAarons, G. A., Hurlburt, M., & Horwitz, S. M. (2011). Advancing a conceptual model of evidence -based practice \nimplementation in public service sectors. Administration and Policy in Mental Health and Mental Health Services Re search, \n38(1), 4-23. \nAbdullah, N., & Zolkornain, Z. (2021). The Impact of Foreign Direct Investment on Economic Growth: The Case of \nMalaysia. Journal of Asian Finance, Economics and Business, 8(3), 1075-1083. \nAcemoglu, D., & Restrepo, P. (2019). Automation  and new tasks: How technology displaces and reinstates labor. \nJournal of Economic Perspectives, 33(2), 3-30. \nAdadi, A., & Berrada, M. (2018). Peeking inside the black-box: A survey on explainable artificial intelligence (XAI). \nIEEE Access, 6, 52138-52160. \nAggarwal, C. C. (2018). Neural Networks and Deep Learning: A Textbook. Springer. \nAl-Hashimi, M., & Kim, D. J. (2021). Factors affecting the adoption of artificial intelligence in the public sector:  A \nsystematic literature review. Government Information Quarterly, 38(4), 101613. \nAlRyalat, M., Al -Hawari, M. A., & Al -Omari, M. K. (2021). Data governance in the era of big data: A systematic \nliterature review. Journal of Big Data, 8(1), 1-31. \nAlavi, M., & Leidner, D. E. (2001). Review: Knowledge management and knowledge management systems: \nConceptual foundations and research issues. MIS Quarterly, 25(1), 107-136. \nAlford, J., & Hughes, O. (2008). Public value pragmatism as the next phase of public manageme nt. The American \nReview of Public Administration, 38(2), 130-148. \nAllen, B., & Gichoya, D. (2020). Building AI capacity in African governments: A framework for action. AI and \nSociety, 35(4), 827-839. \nAmershi, S., Weld, D., Vorvoreanu, M., Fourney, A., Nushi, B., Collisson, P., ... & Teevan, J. (2019). Guidelines for \nhuman-AI interaction. Proceedings of the 2019 CHI conference on human factors in computing systems, 1-13. \nAriely, D. (2008). Predictably Irrational: The Hidden Forces That Shape Our Decisions. HarperCollins. \nAriffin, A. S., & Ahmad, F. (2023).  Regulating Artificial Intelligence in Malaysia: Legal and Ethical Challenges. \nJournal of Malaysian and Comparative Law, 50(2), 29-55. \nArun, S., & Heeks, R. (2019). Digital development: A research agenda. Information Technology for Development, \n25(1), 1-19. \nAthukorala, P. C. (2019). FDI and Development: The Case of Malaysia. Asian Development Review, 36(2), 93-119. \nAutor, D. H. (2015). Why are there still so many jobs? The history and future of workplace automation. Journal of \nEconomic Perspectives, 29(3), 3-30. \nBarcevičius, E., Cibaitė, G., & Codagnone, C. (2019). Exploring the Evolving Normal of AI in Public Services: A \nTypology of AI Applications. Publications Office of the European Union. \nBatura, O., & Lin, M. (2022). AI governance in ASEAN: Navigating between innovation, ethics, and geopolitics. The \nPacific Review, 35(5), 789-816. \nBenartzi, S., Beshears, J., Milkman, K. L., Sunstein, C. R., Thaler, R. H., Shankar, M., ... & Galing, S. (2017). Should \ngovernments invest more in nudging? Psychological Science, 28(8), 1041-1055. \nBenbasat, I., & Lim, J. (2000). Information technology support for decision making: From “what-is” to “what-should-\nbe”. In the Blackwell handbook of principles of organizational behavior (pp. 421-438). Blackwell. \nBird, R. M. (2015). Tax Administration and Tax Reform: Reflections on Thirty Years of International Experience. In \nJ. Alm & J. Martinez -Vazquez (Eds.), The Challenges of Tax  Reform in a Globalized World (pp. 29 -56). Emerald Group \nPublishing Limited. \nBommasani, R., Hudson, D. A., Adeli, E., Altman, R., Arora, S., von Arx, S., ... & Liang, P. (2021). On the \nopportunities and risks of foundation models. arXiv preprint arXiv:2108.07258. \nBostrom, R. P., & Heinen, J. S. (1977). MIS problems and failures: A socio-technical perspective. Part I: The causes. \nMIS Quarterly, 1(3), 17-32. \nBrown, T. B., Mann, B., Ryder, N., Subbiah, M., Kaplan, J., Dhariwal, P., ... & Amodei, D. (2020). Language models \nare few-shot learners. Advances in neural information processing systems, 33, 1877-1901. \nBrynjolfsson, E., & McAfee, A. (2017). Machine, Platform, Crowd: Harnessing Our Digital Future. W. W. Norton & \nCompany. \nBryson, J. M., Crosby, B. C., & Bloomberg, L. (2014).  Public value governance: A new paradigm for public \nmanagement. Public Administration Review, 74(4), 445-452. \nBuchanan, B. (2019). Th e Cybersecurity Dilemma: Hacking, Trust and Fear Between Nations. Oxford University \nPress. \nCabinet Office & Government Digital Service UK. (2023). A guide to using artificial intelligence in the public sector. \nChaisse, J. (2022). Artificial Intelligence and International Economic Law: A New Frontier for Theory and Practice. \nHart Publishing.  \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n23 \nChalkidis, I., Fergadiotis,  M., Malakasiotis, P., Aletras, N., & Androutsopoulos, I. (2020). LEGAL -BERT: The \nMuppets straight out of law school. arXiv preprint arXiv:2010.02559. \nChoudrie, J., Islam, M. S., Wahid, F., & Bass, J. M. (2020). Information and communication technologies for \ndevelopment (ICT4D) research: A comprehensive literature review. Information Technology for Development, 26(3), 417 -\n434. \nCoiera, E. (2004). Four rules for the new IT. BMJ, 328(7449), 1147-1148. \nComiter, M. (2019). Attacking Artificial Intelligence: AI's Security Vulnerability and What Policymakers Can Do \nAbout It. Belfer Center for Science and International Affairs, Harvard Kennedy School. \nCorteva, L. (2023). Artificial intelligence in customs: A game changer for trade facilitation and compliance? World \nCustoms Journal, 17(1), 55-68. \nCreswell, J. W., & Poth, C. N. (2016). Qualitative inquiry and research design: Choosing among five approaches. Sage \npublications. \nCriado, J. I., & Gil-Garcia, J. R. (2019). Creating public value through smart technologies and strategies: From digital \ngovernment to smart government and beyond. International Journal of Public Sector Management, 32(5), 438-450. \nDamschroder, L. J., Aron, D. C., Keith, R. E., Kirsh, S. R., Alexander, J. A., & Lowery, J. C. (2009). Fostering \nimplementation of health services research findings into practice: a consolidated framework for advancing implementation \nscience. Implementation Science, 4(1), 50. \nDawes, S. S. (2009). Governance in the age of digital government: A research agenda. Journal of Public Administration \nResearch and Theory, 19(1), 1-12. \nDe Witte, K., & Geys, B. (2011). Evaluating the efficiency of public service provision: A coherent and robust DEA -\nbased methodology. European Journal of Operational Research, 209(1), 92-101. \nDignum, V. (2019). Responsible Artificial Intelligence: How to Develop and Use AI in a Responsible Way. Springer.  \nDodge, J., Sap, M., Marasović, A., Agnew, W., Ilharco, G., Groeneveld, D., ... & Gardner, M. (2020). Documenting \nthe state of the art in language modeling. arXiv preprint arXiv:2010.00102. \nDoshi-Velez, F ., & Kim, B. (2017). Towards a rigorous science of interpretable machine learning. arXiv preprint \narXiv:1702.08608. \nDwivedi, Y. K., Hughes, L., Ismagilova, E., Aarts, G., Coombs, C., Crick, T., ... & Williams, M. D. (2021). Artificial \nIntelligence (AI): Multidisciplinary perspectives on emerging challenges, opportunities, and agenda for research, practice and \npolicy. International Journal of Information Management, 57, 101994. \nEl-Haddadeh, R., Weerakkody, V., & Osmani, M. (2019). The impact of digital government transformation on citizen \nservices: A systematic literature review. Information Polity, 24(2), 101-120. \nEloundou, T., Manning, S., Mishkin, P., & Rock, D. (2023). GPTs are GPTs: An Early Look at the Labor Market \nImpact Potential of Large Language Models. OpenAI.  \nEndsley, M. R. (2017). Toward a theory of situation awareness in dynamic systems. Human Factors, 37(1), 32-64.  \nEom, S. B. (2009). Decision support systems research: current state and trends. International Journal of Information \nand Decision Sciences, 1(3), 213-235.  \nEuropean Commission's High-Level Expert Group on AI. (2019). Ethics Guidelines for Trustworthy AI. \nFedi, L. (2018). Artificial intelligence and legal interpretation: a focus on customs tariff classification. Global Trade \nand Customs Journal, 13(7/8), 311-318. \nFelbermayr, G., Teti,  F., & Yalcin, E. (2021). On the complex relationship between tariff -classification uncertainty \nand international trade. European Economic Review, 131, 103602. \nFloridi, L. (2019). Establishing the rules for building trustworthy AI. Nature Machine Intelligence, 1(6), 261-262.  \nFloridi, L., Cowls, J., Beltramini, M., Saunders, D., & Vayena, E. (2018). An ethical framework for a good AI society: \nopportunities, risks, principles, and recommendations. AI and Society, 33(4), 689-707. \nFlyverbom, M., Deibert, R., & Matzner, T. (2019). The governance of digital technology: The contested Rrglobal \nlandscape. Global Policy, 10(4), 529-540. \nFrey, C. B., & Osborne, M. A. (2017).  The future of employment: How susceptible are jobs to computerization? \nTechnological Forecasting and Social Change, 114, 254-280. \nFullan, M. (2006). Change theory: A force for school improvement. Centre for Strategic Education. \nGrudin, J. (2009). AI and HCI: Two fields divided by a common focus. IEEE Intelligent systems, 24(5), 48-57. \nGuidotti, R., Monreale, A., Ruggieri, S., Turini, F., Giannotti, F., & Pedreschi, D. (2018). A survey of methods for \nexplaining black box models. ACM Computing Surveys (CSUR), 51(5), 1-42. \nGururangan, S., Marasović, A., Swayamdipta, S., Lo, K., Beltagy, I., Downey, D., & Smith, N. A. (2020). Don't stop \npretraining: Adapt language models to domains and tasks. Proceedings of the 58th Annual Meeting of the Association for \nComputational Linguistics, 8342-8360. \nHartley, J. (2013). The creation and capture of public value: A new research agenda for public management. \nInternational Journal of Public Sector Management, 26(1), 61-72. \nHeeks, R. (2006). Implementing and managing eGovernment: An international text. Sage Publications. \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \nHelbing, D. (2019). Societal, economic, ethical and legal challenges of the digital revolution: From big data to deep \nlearning, artificial intelligence, and manipulative technologies. In Towards digital enlightenment (pp. 47-72). Springer, Cham.  \nHendrycks, D., Burns, C., Kadavath, S., Arora, A., Basart, S., Tang, E., ... & Steinhardt, J. (2021). Measuring massive \nmultitask language understanding. Proceedings of the International Conference on Learning Representations (ICLR).  \nHollnagel, E., & Woods, D. D. (2005). Joint Cognitive Systems: Foundations of Cognitive Systems Engineering. CRC \nPress. \nHolzinger, A., Carrington, A., & Müller, H. (2020). Measuring the quality of explanations: The system causability \nscale (SCS). KI-Künstliche Intelligenz, 34, 193-198. \nHoward, J., & Ruder, S. (2018). Universal language model fine-tuning for text classification. Proceedings of the 56th \nAnnual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), 328-339. \nJanssen, M., van der Voort, H., & Wahyudi, A. (2017). Factors influencing data govern ance in the public sector. \nInformation Polity, 22(2-3), 143-158. \nJobin, A., Ienca, M., & Vayena, E. (2019). The global landscape of AI ethics guidelines. Nature Machine Intelligence, \n1(9), 389-399. \nKatzenbach, C., & Ulbricht, L. (2019). Algorithmic governance. Internet Policy Review, 8(4), 1-18. \nKeen, M., & Slemrod, J. (2017). Optimal Tax Administration. Journal of Public Economics, 152, 133-142. \nKlanrit, P., Lee, W. Y., & Kim, H. (2023). A Survey on Deep Learning for Legal Document Analytics. ACM \nComputing Surveys, 55(8), 1-38.  \nKlein, G. (2008). Naturalistic decision making. Human Factors, 50(3), 456-460. \nKlievink, B., Veeneman, W. W. (2018). Creating value with big data analytics in public administration: A framework \nfor aligning purposes, capabilities, and context. Government Information Quarterly, 35(3), 470-479. \nKoh, C. E., Ryan, S., & Prybutok, V. R. (2005). Creating value through managing knowledge in an e -government to \nconstituency (G2C) environment. Journal of Computer Information Systems, 45(4), 32-41.  \nKuziemsky, C. E., & Varpio, L. (2022). The Use of Artificial Intelligence in Public Administration: A Systematic \nLiterature Review. Government Information Quarterly, 39(3), 101693. \nLewis, M., Liu, Y., Goyal, N., Ghazvininejad, M., Mohamed, A., Levy, O., ... & Zettlemoyer, L. (2020). BART: \nDenoising sequence-to-sequence pre-training for natural language generation, translation, and comprehension. arXiv preprint \narXiv:1910.13461. \nLiang, P., Bommasani, R., Lee, T., Tsipras, D., Soylu, D., Yasunaga, M., ... & Koreeda, Y. (2022). Report on the 2021 \nWorkshop on Large Language Models: Invited Talks and Discussion Panels. Stanford University Human -Centered Artificial \nIntelligence (HAI). \nLiao, G., He, Q., Gao, M., Li, Z., & Chua, T. S. (2023). Specialized Large Language Models: A Survey. arXiv preprint \narXiv:2310.09188. \nMalaysian Administrative Modernisation and Management Planning Unit (MAMPU). (2021). Pelan Strategik \nPendigitalan Sektor Awam 2021-2025 (Public Sector Digitalisation Strategic Plan 2021-2025). \nMeadows, D. H. (2008). Thinking in Systems: A Primer. Chelsea Green Publishing. \nMedaglia, R., & Zheng, L. (2017). Public value creation by ICT in public sector: A research and practice agenda. \nGovernment Information Quarterly, 34(2), 167-171. \nMehr, H. (2017). Artificial Intelligence for Citizen Services and Government. Ash Center for Democratic Governance \nand Innovation, Harvard Kennedy School. \nMiles, M. B., Huberman, A. M., & Saldaña, J. (2018). Qualitative data analys is: A methods sourcebook. Sage \npublications. \nMiller, T. (2019). Explanation in artificial intelligence: Insights from the social sciences. Artificial Intelligence, 267, \n1-38.  \nMinistry of Investment, Trade and Industry (MITI). (2023). New Industrial Master Plan 2030 (NIMP 2030). MITI.  \nMoore, M. H. (1995). Creating Public Value: Strategic Management in Government. Harvard University Press.  \nMori, S., Suen, C. Y., & Yamamoto, K. (1992). Historical review of OCR research and development. Proceedings of \nthe IEEE, 80(7), 1029-1058. \nMumford, E. (2006). The story of socio -technical design: reflectio ns on its successes, failures and potential. \nInformation Systems Journal, 16(4), 317-342. \nNdung'u, B., & Waema, T. M. (2019). Digital Transformation of Public Services in Africa. Routledge.  \nNonaka, I. (1994). A dynamic theory of organizational knowledge creation. Organization Science, 5(1), 14-37.  \nO'Dell, C., & Hubert, C. (2011). The New Edge in Knowledge: How Knowledge Management is Changing the Way \nWe Do Business. John Wiley & Sons. \nOECD. (2019). Artificial Intelligence in Society. OECD Publishing. \nOpenAI. (2023). GPT-4 Technical Report. https://arxiv.org/abs/2303.08774 \nParasuraman, R., Sheridan, T. B., & Wickens, C. D. (2000). A model for types an d levels of human interaction with \nautomation. IEEE Transactions on systems, man, and cybernetics-Part A: Systems and Humans, 30(3), 286-297. \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n25 \nPauwelyn, J. (2020). The End of IIAs as We Know Them? How AI and Big Data are (Quietly) Reshaping International \nInvestment Law and Arbitration. Journal of International Economic Law, 23(3), 557-585. \nPiccinini, E., Hanelt, A., Gregory, R. W., & Kolbe, L. M. (2015). Transforming industrial business: the impact of \ndigital transformation on automotive manufacturers. In Proceedings of the International Conference on Information Systems \n(ICIS), Article 1. \nPohle, J., & Thiel, T. (2020). Digital sovereignty. Internet Policy Review, 9(4), 1-11. \nPolanyi, M. (1966). The Tacit Dimension. University of Chicago Press. \nPuthucheary, S. D., & Sivanathan, S. S. (2022). Data Governance in Malaysia: An Overview of the Legal Framework. \nAsian Journal of Law and Governance, 4(1), 1-14. \nRai, A. (2020). Explainable AI: from black box to glass box. Journal of the Academy of Marketing Science, 48(1), \n137-141.  \nRose, J., Persson, J. S., & Heeager, L. T. (2015). How ideal -types of IS projects impact project management. Project \nManagement Journal, 46(5), 46-59.  \nRowland, C., & Podnar, I. (Eds.). (2021). Cybersecurity for Artificial Intelligence. Springer.  \nRudin, C. (2019). Stop explaining black box machine learning models for high stakes decisions and u se interpretable \nmodels instead. Nature Machine Intelligence, 1(5), 206-215. \nRussell, S. J., & Norvig, P. (2020). Artificial Intelligence: A Modern Approach (4th ed.). Pearson. \nSawyer, A. J. (Ed.). (2018). Taxation in ASEAN and China: A Guide for the Tax Practitioner and Business Executive \n(5th ed.). CCH Asia Pte Ltd. \nShneiderman, B. (2020). Human-centered AI: Reliable, safe & trustworthy. International Journal of Human–Computer \nInteraction, 36(6), 495-504. \nSmith, R. (2007). An overview of the Tesseract OCR engine. Proceedings of the Ninth International Conference on \nDocument Analysis and Recognition (ICDAR 2007) (Vol. 2, pp. 629-633). IEEE. \nSouza, L. A., Batista, F., & Silva, T. P. (2021). Intelligent document processing: A systematic literature review. Expert \nSystems with Applications, 183, 115335. \nSterman, J. D. (2000). Business Dynamics: Systems Thinking and Modeling for a Complex World. Irwin/McGraw -\nHill. \nSunstein, C. R. (2016). The Ethics of Nudging. Yale University Press.  \nSusser, D., Roessler, B., & Nissenbaum, H. (2019). Online manipulation: Hidden influences in a digit al world. \nGeorgetown Law Technology Review, 4(1), 1-45. \nTaleb, N. N. (2012). Antifragile: Things That Gain from Disorder. Random House. \nThaler, R. H., & Sunstein, C. R. (2008). Nudge: Improving Decisions About Health, Wealth, and Happiness. Yale \nUniversity Press. \nTwizeyimana, J. D., & Andersson, A. (2019). The public value of E -Government – A literature review. Government \nInformation Quarterly, 36(2), 167-178. \nVeale, M., & Borgesius, F. Z. (2021). Demystifying the Draft EU Artificial Intelligence Act. Computer Law Review \nInternational, 22(4), 97-112. \nVenkatesh, V., Morris, M. G., Davis, G. B., & Davis, F. D. (2003). User acceptance of information technology: Toward \na unified view. MIS Quarterly, 27(3), 425-478. \nWagner, B. (2018). Digital sovereignty: The new frontier for state power. Carr Center for Hu man Rights Policy \nDiscussion Paper Series. Harvard Kennedy School. \nWalker, R. M., Damanpour, F., & Devece, C. A. (2010). Management innovation and organizational performance: \nThe mediating effect of performance management. Journal of Public Administration Research and Theory, 21(2), 367-386. \nWang, D., Govindarajulu, U. S., Kankanhalli, A., & Siau, K. L. (2021). Explainable AI in Human -AI Decision -\nMaking: A Moderated Mediation Model of Explanation Type, System Trust, and Task Complexity. Information Systems \nResearch, 32(4), 1221-1242.  \nWaugh, L. R. (1997). The linguistic structure of the Harmonized System. Terminology. International Journal of \nTheoretical and Applied Issues in Specialized Communication, 4(1), 47-68.  \nWolf, T., Debut, L., Sanh, V., Chaumond, J., Delangue, C., Moi, A., ... & Rush, A. M. (2020). Transformers: State-of-\nthe-art natural language processing. Proceedings of the 2020 Conference on  Empirical Methods in Natural Language \nProcessing: System Demonstrations, 38-45. \nYin, R. K. (2017). Case study research and applications: Design and methods. Sage publications. \nZhao, W. X., Zhou, K., Li, J., Tang, T., Wang, X., Hou, Y., ... & Wen, J. R. (2023). A survey of large language models. \narXiv preprint arXiv:2303.18223. \nZhong, H., Cui, L., Zhang, Y., Wang, C., & Huang, S. (2020). How does NLP benefit legal system: A summary of \nlegal artificial intelligence. arXiv preprint arXiv:2004.07031. \nvan den Hoven, J., Vermaas, P. E., & van de Poel, I. (Eds.). (2015). Handbook of ethics, values, and technological \ndesign. Springer. \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n  \n \n \n \n9. Appendix \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 14: Differentiation between tariff classification workflow \n \n \n \nFigure 15: Visual simulation of GPVA Classification Assistance \n \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0\n \n27 \n \n \n \n \n \n \nhttps://doi.org/10.33774/coe-2025-85185 ORCID: https://orcid.org/0009-0003-7206-7706 Content not peer-reviewed by Cambridge University Press. License: CC BY 4.0",
  "topic": "Automation",
  "concepts": [
    {
      "name": "Automation",
      "score": 0.7172667980194092
    },
    {
      "name": "Tariff",
      "score": 0.6945930123329163
    },
    {
      "name": "Facilitation",
      "score": 0.6322612762451172
    },
    {
      "name": "Trade facilitation",
      "score": 0.4881461560726166
    },
    {
      "name": "Computer science",
      "score": 0.4618804156780243
    },
    {
      "name": "Foreign direct investment",
      "score": 0.4360066056251526
    },
    {
      "name": "Business",
      "score": 0.416896790266037
    },
    {
      "name": "International economics",
      "score": 0.33704543113708496
    },
    {
      "name": "Industrial organization",
      "score": 0.3306596875190735
    },
    {
      "name": "Economics",
      "score": 0.28355738520622253
    },
    {
      "name": "International trade",
      "score": 0.27791792154312134
    },
    {
      "name": "Engineering",
      "score": 0.19478073716163635
    },
    {
      "name": "Macroeconomics",
      "score": 0.14841550588607788
    },
    {
      "name": "Management",
      "score": 0.10507586598396301
    },
    {
      "name": "Free trade",
      "score": 0.08647209405899048
    },
    {
      "name": "Mechanical engineering",
      "score": 0.0709030032157898
    }
  ],
  "institutions": [],
  "cited_by": 1
}