{
  "title": "Explaining solar forecasts with generative AI: A two-stage framework combining transformers and LLMs",
  "url": "https://openalex.org/W4414309867",
  "year": 2025,
  "authors": [
    {
      "id": "https://openalex.org/A1480452634",
      "name": "Ayesha Siddiqa",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2900907578",
      "name": "Nadim Rana",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2303364610",
      "name": "Wazir Zada Khan",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2896907112",
      "name": "Fathe Jeribi",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2162128161",
      "name": "Ali Tahir",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W3024158773",
    "https://openalex.org/W4392081637",
    "https://openalex.org/W4380630570",
    "https://openalex.org/W4283393523",
    "https://openalex.org/W4402634371",
    "https://openalex.org/W3194066278",
    "https://openalex.org/W4406739626",
    "https://openalex.org/W4318485255",
    "https://openalex.org/W2101105183",
    "https://openalex.org/W4403052297",
    "https://openalex.org/W2948715311",
    "https://openalex.org/W4307079201",
    "https://openalex.org/W4404238308",
    "https://openalex.org/W4288089799",
    "https://openalex.org/W4401839106"
  ],
  "abstract": "Accurate and interpretable solar power forecasting is critical for effectively integrating Photo-Voltaic (PV) systems into modern energy infrastructure. This paper introduces a novel two-stage hybrid framework that couples deep learning-based time series prediction with generative Large Language Models (LLMs) to enhance forecast accuracy and model interpretability. At its core, the proposed SolarTrans model leverages a lightweight Transformer-based encoder-decoder architecture tailored for short-term DC power prediction using multivariate inverter and weather data, including irradiance, ambient and module temperatures, and temporal features. Experiments conducted on publicly available datasets from two PV plants over 34 days demonstrate strong predictive performance. The SolarTrans model achieves a Mean Absolute Error (MAE) of 0.0782 and 0.1544, Root Mean Squared Error (RMSE) of 0.1760 and 0.4424, and R 2 scores of 0.9692 and 0.7956 on Plant 1 and Plant 2, respectively. On the combined dataset, the model yields an MAE of 0.1105, RMSE of 0.3189, and R 2 of 0.8967. To address the interpretability challenge, we fine-tuned the Flan-T5 model on structured prompts derived from domain-informed templates and forecast outputs. The resulting explanation module achieves ROUGE-1, ROUGE-2, ROUGE-L, and ROUGE-Lsum scores of 0.7889, 0.7211, 0.7759, and 0.7771, respectively, along with a BLEU score of 0.6558, indicating high-fidelity generation of domain-relevant natural language explanations.",
  "full_text": null,
  "topic": null,
  "concepts": [],
  "institutions": [
    {
      "id": "https://openalex.org/I192891849",
      "name": "University of Wah",
      "country": "PK"
    },
    {
      "id": "https://openalex.org/I91450128",
      "name": "Jazan University",
      "country": "SA"
    }
  ]
}