{
    "title": "Agentic AI in radiology: emerging potential and unresolved challenges",
    "url": "https://openalex.org/W4412626395",
    "year": 2025,
    "authors": [
        {
            "id": "https://openalex.org/A5116333716",
            "name": "Nicholas Dietrich",
            "affiliations": [
                "Canada Research Chairs",
                "University of New Brunswick",
                "University of Toronto"
            ]
        }
    ],
    "references": [
        "https://openalex.org/W4386222752",
        "https://openalex.org/W4410151922",
        "https://openalex.org/W4409269467",
        "https://openalex.org/W4406443929",
        "https://openalex.org/W4366548814",
        "https://openalex.org/W4394653911",
        "https://openalex.org/W6891944836",
        "https://openalex.org/W4387743770",
        "https://openalex.org/W4402227384",
        "https://openalex.org/W4323347338",
        "https://openalex.org/W4403683867",
        "https://openalex.org/W4407203427",
        "https://openalex.org/W4410563838",
        "https://openalex.org/W4407736602",
        "https://openalex.org/W4387405016"
    ],
    "abstract": "Abstract This commentary introduces agentic artificial intelligence (AI) as an emerging paradigm in radiology, marking a shift from passive, user-triggered tools to systems capable of autonomous workflow management, task planning, and clinical decision support. Agentic AI models may dynamically prioritize imaging studies, tailor recommendations based on patient history and scan context, and automate administrative follow-up tasks, offering potential gains in efficiency, triage accuracy, and cognitive support. While not yet widely implemented, early pilot studies and proof-of-concept applications highlight promising utility across high-volume and high-acuity settings. Key barriers, including limited clinical validation, evolving regulatory frameworks, and integration challenges, must be addressed to ensure safe, scalable deployment. Agentic AI represents a forward-looking evolution in radiology that warrants careful development and clinician-guided implementation.",
    "full_text": null
}