{
  "title": "Large language models-enabled digital twins for precision medicine in rare gynecological tumors",
  "url": "https://openalex.org/W4412152028",
  "year": 2025,
  "authors": [
    {
      "id": "https://openalex.org/A2636869516",
      "name": "Jacqueline Lammert",
      "affiliations": [
        "Klinikum rechts der Isar",
        "ERN GUARD-Heart",
        "Technical University of Munich"
      ]
    },
    {
      "id": "https://openalex.org/A338100905",
      "name": "Nicole Pfarr",
      "affiliations": [
        "Klinikum rechts der Isar",
        "Technical University of Munich"
      ]
    },
    {
      "id": "https://openalex.org/A5099047761",
      "name": "Leonid Kuligin",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A3216581146",
      "name": "Sonja Mathes",
      "affiliations": [
        "Klinikum rechts der Isar",
        "University Medical Center of the Johannes Gutenberg University Mainz",
        "Johannes Gutenberg University Mainz",
        "Technical University of Munich"
      ]
    },
    {
      "id": "https://openalex.org/A2550902521",
      "name": "Tobias Dreyer",
      "affiliations": [
        "Technical University of Munich",
        "Klinikum rechts der Isar"
      ]
    },
    {
      "id": "https://openalex.org/A2654762216",
      "name": "Luise Modersohn",
      "affiliations": [
        "Klinikum rechts der Isar"
      ]
    },
    {
      "id": "https://openalex.org/A2042618357",
      "name": "Patrick Metzger",
      "affiliations": [
        "University of Freiburg"
      ]
    },
    {
      "id": "https://openalex.org/A2789987764",
      "name": "Dyke Ferber",
      "affiliations": [
        "University Hospital Heidelberg",
        "National Center for Tumor Diseases",
        "Heidelberg University",
        "Fresenius (Germany)"
      ]
    },
    {
      "id": "https://openalex.org/A2056217728",
      "name": "Jakob Nikolas Kather",
      "affiliations": [
        "National Center for Tumor Diseases",
        "University Hospital Heidelberg",
        "Fresenius (Germany)",
        "Heidelberg University"
      ]
    },
    {
      "id": "https://openalex.org/A2029259259",
      "name": "Daniel Truhn",
      "affiliations": [
        "RWTH Aachen University"
      ]
    },
    {
      "id": "https://openalex.org/A2572220963",
      "name": "Lisa Christine Adams",
      "affiliations": [
        "Klinikum rechts der Isar",
        "Technical University of Munich"
      ]
    },
    {
      "id": "https://openalex.org/A3184818986",
      "name": "Keno Kyrill Bressem",
      "affiliations": [
        "Deutsches Herzzentrum München",
        "Technical University of Munich"
      ]
    },
    {
      "id": "https://openalex.org/A1986863758",
      "name": "Sebastian Lange",
      "affiliations": [
        "Klinikum rechts der Isar",
        "Technical University of Munich"
      ]
    },
    {
      "id": "https://openalex.org/A2167713520",
      "name": "Kristina Schwamborn",
      "affiliations": [
        "Klinikum rechts der Isar",
        "Technical University of Munich"
      ]
    },
    {
      "id": "https://openalex.org/A2054808036",
      "name": "Martin Boeker",
      "affiliations": [
        "Klinikum rechts der Isar"
      ]
    },
    {
      "id": "https://openalex.org/A2316823457",
      "name": "Marion Kiechle",
      "affiliations": [
        "Technical University of Munich",
        "Klinikum rechts der Isar"
      ]
    },
    {
      "id": "https://openalex.org/A2682033080",
      "name": "Ulrich A. Schatz",
      "affiliations": [
        "Technical University of Munich",
        "Klinikum rechts der Isar"
      ]
    },
    {
      "id": "https://openalex.org/A1904800063",
      "name": "Holger Bronger",
      "affiliations": [
        "Technical University of Munich",
        "Klinikum rechts der Isar"
      ]
    },
    {
      "id": "https://openalex.org/A3064577599",
      "name": "Maximilian Tschochohei",
      "affiliations": [
        "Klinikum rechts der Isar"
      ]
    },
    {
      "id": "https://openalex.org/A2636869516",
      "name": "Jacqueline Lammert",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A338100905",
      "name": "Nicole Pfarr",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A5099047761",
      "name": "Leonid Kuligin",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A3216581146",
      "name": "Sonja Mathes",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2550902521",
      "name": "Tobias Dreyer",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2654762216",
      "name": "Luise Modersohn",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2042618357",
      "name": "Patrick Metzger",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2789987764",
      "name": "Dyke Ferber",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2056217728",
      "name": "Jakob Nikolas Kather",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2029259259",
      "name": "Daniel Truhn",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2572220963",
      "name": "Lisa Christine Adams",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A3184818986",
      "name": "Keno Kyrill Bressem",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A1986863758",
      "name": "Sebastian Lange",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2167713520",
      "name": "Kristina Schwamborn",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2054808036",
      "name": "Martin Boeker",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2316823457",
      "name": "Marion Kiechle",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A2682033080",
      "name": "Ulrich A. Schatz",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A1904800063",
      "name": "Holger Bronger",
      "affiliations": []
    },
    {
      "id": "https://openalex.org/A3064577599",
      "name": "Maximilian Tschochohei",
      "affiliations": []
    }
  ],
  "references": [
    "https://openalex.org/W2126438085",
    "https://openalex.org/W3176019284",
    "https://openalex.org/W4401859502",
    "https://openalex.org/W3171689169",
    "https://openalex.org/W2345680184",
    "https://openalex.org/W4391757646",
    "https://openalex.org/W4387667876",
    "https://openalex.org/W4364377706",
    "https://openalex.org/W4295951577",
    "https://openalex.org/W3184569878",
    "https://openalex.org/W4313340213",
    "https://openalex.org/W4393094536",
    "https://openalex.org/W3003918648",
    "https://openalex.org/W3112521885",
    "https://openalex.org/W2986723004",
    "https://openalex.org/W4401066908",
    "https://openalex.org/W4361250443",
    "https://openalex.org/W4366748012",
    "https://openalex.org/W1973364140",
    "https://openalex.org/W4389608564",
    "https://openalex.org/W2058368636",
    "https://openalex.org/W4399812563",
    "https://openalex.org/W3039760251",
    "https://openalex.org/W4310980443",
    "https://openalex.org/W4220847549",
    "https://openalex.org/W4294001424",
    "https://openalex.org/W4390532493",
    "https://openalex.org/W4313439128",
    "https://openalex.org/W4379519973",
    "https://openalex.org/W4214573195",
    "https://openalex.org/W4400823526",
    "https://openalex.org/W3216666189",
    "https://openalex.org/W4292289324",
    "https://openalex.org/W2961191798",
    "https://openalex.org/W4210590001",
    "https://openalex.org/W2046476894",
    "https://openalex.org/W3203310487",
    "https://openalex.org/W4399116603",
    "https://openalex.org/W4385287778",
    "https://openalex.org/W4393988890",
    "https://openalex.org/W4280526636",
    "https://openalex.org/W2618374662",
    "https://openalex.org/W2154495753",
    "https://openalex.org/W3004452650",
    "https://openalex.org/W4379281614",
    "https://openalex.org/W4229028520",
    "https://openalex.org/W4220776646",
    "https://openalex.org/W4362522726",
    "https://openalex.org/W4226453474"
  ],
  "abstract": "Abstract Rare gynecological tumors (RGTs) present major clinical challenges due to their low incidence and heterogeneity. The lack of clear guidelines leads to suboptimal management and poor prognosis. Molecular tumor boards accelerate access to effective therapies by tailoring treatment based on biomarkers, beyond cancer type. Unstructured data that requires manual curation hinders efficient use of biomarker profiling for therapy matching. This study explores the use of large language models (LLMs) to construct digital twins for precision medicine in RGTs. Our proof-of-concept digital twin system integrates clinical and biomarker data from institutional and published cases ( n = 21) and literature-derived data ( n = 655 publications) to create tailored treatment plans for metastatic uterine carcinosarcoma, identifying options potentially missed by traditional, single-source analysis. LLM-enabled digital twins efficiently model individual patient trajectories. Shifting to a biology-based rather than organ-based tumor definition enables personalized care that could advance RGT management and thus enhance patient outcomes.",
  "full_text": "npj |digital medicine Article\nPublished in partnership with Seoul National University Bundang Hospital\nhttps://doi.org/10.1038/s41746-025-01810-z\nLarge language models-enabled digital\ntwins for precision medicine in rare\ngynecological tumors\nCheck for updates\nJacqueline Lammert1,2,3,4 ,N i c o l eP f a r r2,5, Leonid Kuligin6, Sonja Mathes7,8, Tobias Dreyer1,3,\nLuise Modersohn3, Patrick Metzger9,D y k eF e r b e r10,11, Jakob Nikolas Kather10,11,12, Daniel Truhn13,\nLisa Christine Adams14, Keno Kyrill Bressem15, Sebastian Lange2,16, Kristina Schwamborn2,5,\nMartin Boeker3, Marion Kiechle1, Ulrich A. Schatz1,2,H o l g e rB r o n g e r1 & Maximilian Tschochohei3,6\nRare gynecological tumors (RGTs) present major clinical challenges due to their low incidence and\nheterogeneity. The lack of clear guidelines leads to suboptimal management and poor prognosis.\nMolecular tumor boards accelerate access to effective therapies by tailoring treatment based on\nbiomarkers, beyond cancer type. Unstructured data that requires manual curation hinders efﬁcient use\nof biomarker proﬁling for therapy matching. This study explores the use of large language models\n(LLMs) to construct digital twins for precision medicine in RGTs. Our proof-of-concept digital twin\nsystem integrates clinical and biomarker data from institutional and published cases (n = 21) and\nliterature-derived data (n = 655 publications) to create tailored treatment plans for metastatic uterine\ncarcinosarcoma, identifying options potentially missed by traditional, single-source analysis. LLM-\nenabled digital twins efﬁciently model individual patient trajectories. Shifting to a biology-based rather\nthan organ-based tumor deﬁnition enables personalized care that could advance RGT management\nand thus enhance patient outcomes.\nRare Gynecological Tumors (RGTs), comprising over 30 distinct histolo-\ngical subtypes, such as sex cord stromal tumors, and uterine or ovarian\ncarcinosarcomas, account for more than 50% of gynecologic malignancies,\npresenting a major clinical challenge\n1. With an incidence rate below six per\n100,000 individuals, RGTs are difﬁcult to study through large-scale ran-\ndomized trials, leading to reliance on less standardized treatment approa-\nches such as retrospective studies, case reports, and expert opinions. This\nlack of robust clinical guidelines has contributed to persistently poor\nprognosis for patients with RGTs2.\nTechnological advancements in cancer diagnostics have enabled the\nidentiﬁcation of biomarkers as therapeutic targets. Biomarker-guided\ntreatments promise to accelerate the development of precision therapeutics\nacross tumor types, reducing the relevance of organ-based classiﬁcation3.\nThe prevailing organ-centric approach to clinical trial design hinders the\ndevelopment of effective treatments for rare cancers with shared\nbiomarkers\n4. This obstacle extends beyond rare cancers: The premature\ndismissal of olaparib in ovarian cancer and the seven to ten year delay in\naddressing Programmed Cell Death Ligand 1 (PD-L1) expressing breast and\ngynecological cancers with PD-L1 inhibition illustrate the need for\nbiomarker-driven stratiﬁcation for cancer treatment5,6.\nMolecular tumor boards (MTBs) are essential for interpreting bio-\nmarker proﬁle results and matching cancer patients with appropriate\ntherapies. This includes identifying suitable investigational drugs7.T h e\nmanual interpretation of multiple, co-occurring molecular alterations\nrequires an in-depth understanding oftheir functional implications and\ncorrelations with treatment sensitivity or resistance. The rapid growth of\nbiomedical literature and the fragmented nature of data sources make\nmanual curation a bottleneck in efﬁciently translating genomic data into\nactionable treatment strategies7.\nThe data produced by MTBs is often stored in unstructured formats\nwithin electronic health records (EHRs) or other repositories, hindering\ntheir reusability for similar patients. Evaluating the effectiveness of MTB-\nguided treatments requires extr acting follow-up data from EHRs.\nUnstructured text within EHRs, coupled with the lack of interoperability\nacross healthcare institutions— particularly when MTB patients receive\ntreatment at external facilities— renders the process labor-intensive, error-\nprone, and time-consuming\n8. Consequently, applying MTB insights to\nfuture patients is hindered.\nAdvances in data capture and analysis, alongside decreasing costs in\ngenome sequencing, are paving the wayfor innovative tools to manage rare\nA full list of afﬁliations appears at the end of the paper.e-mail: Jacqueline.Lammert@tum.de\nnpj Digital Medicine|           (2025) 8:420 1\n1234567890():,;\n1234567890():,;\nor refractory cancers more effectively9. Digital twin technology constructs\nvirtual representations of physical entities with dynamic, bidirectional\ninterfaces10. Initially applied in industrial engineering, digital twins can also\nrepresent the human body in healthcare. By modeling physiological pro-\ncesses and predicting biomarker-speciﬁc responses to treatments, digital\ntwins can address the challenges of patient variability and the limitations of\ntraditional one-size-ﬁts-all approaches\n11. In the case of RGT, the standard\ncarboplatin and paclitaxel regimen, followed by chemotherapy mono-\ntreatments for subsequent lines, may not be the most effective approach12.\nDigital twins could help stratify RGTpatients based on their unique bio-\nmarker proﬁles, enabling more tailored treatments and potentially\nimproving outcomes, even in heavily pretreated cases.\nDespite their potential, the adoption of digital twins in clinical practice\nis constrained by the challenges associated with integrating the diverse and\ncomplex data required for their development\n13. Unlike conventional com-\nputational models that often rely on static, population-level assumptions,\ndigital twins are dynamic and personalized— virtual representations of\nindividual patients that evolve in realtime with incoming clinical data. This\nadaptability offers potential for precision medicine, particularly in complex\nor rare diseases. However, building such models requires synthesizing\nheterogeneous, often unstructured, information. Traditional natural lan-\nguage processing (NLP) methods are limited in this regard. Recent advances\nin large language models (LLMs), such as transformer-based architectures,\nenable more context-aware, scalable, andﬂexible extraction of clinical\ninsights. Their in-context learning capabilities make them especially suited\nto support the creation of responsiveand individualized digital twins, as\nexplored in this study\n14.\nIn this study, we demonstrate the application of an LLM-enabled\nworkﬂow for constructing digital twins for patients with RGT, speciﬁcally\nmetastatic uterine carcinosarcoma (UCS).\nThe research question was inspired by a real-world UCS case pre-\nsented to a major German cancer center for evaluation of third-line\ntreatment options. According to a consensus statement by Bogani et al.,\nthird-line monotherapy in UCS typically results in a median progression-\nfree survival (PFS) of 1.8 months and a response rate of 5.5%, highlighting\nthe urgent need for novel therapeutic strategies\n12. The patient presented\nwith a proﬁcient mismatch repair (pMMR) carcinosarcoma with inter-\nmediate Tumor Mutational Burden (TMB) and high PD-L1 expression.\nAlthough PD-L1 positivity is common in UCS15,16 and has been suggested\nas an independent prognostic factor17, it has not been validated as a target\nfor immunotherapy12.\nGiven the potential therapeutic importance of PD-L1, we investi-\ngated outcomes in similar patients. We identiﬁed cases with high PD-L1\nexpression, pMMR status and low to intermediate TMB from the insti-\ntutional MTB database, including non-gynecological cancers, and to\nexpand the pool of UCS cases, from the literature. The unstructured\nnature of EHR and academic publications posed challenges for immediate\nanalysis. We utilized a local LLM to extract and structure data from EHRs\nand a cloud-based LLM for literature data. These datasets were integrated\ninto a uniﬁed local database, forming the foundation of an RGT Digital\nTwin system. This system enabled the generation of virtual representa-\ntions of individual patients, allowing for the simulation of personalized\ntreatment strategies.\nThe RGT Digital Twin system facilitated the identiﬁcation of addi-\ntional therapeutic options, which were subsequently evaluated by MTB\nmembers. By integrating data from institutional sources (including non-\ngynecological cancers) and literature sources (to expand the pool of UCS\ncases), this approach provided novel insights that were not apparent from\neither data source alone. This integration has the potential to guide more\neffective treatment strategies for RGTpatients and supports a shift towards a\nbiology-based rather than organ-based deﬁnition of tumors. LLM tech-\nnology enabled us to streamline the extraction, structuring, and analysis of\nEHR and web data, making it readily accessible for MTB evaluation. This is\nespecially valuable in resource-limited settings like MTBs, where results can\noccasionally arrive too late to guide timely treatment decisions\n18.\nResults\nPatient cohort\nA retrospective analysis of 1821 cases discussed at the institutional MTB\nbetween September 2017 and July 2024 was conducted. Among these, 132\ncases exhibited high PD-L1 expression (CPS≥ 40), encompassing 28 dif-\nferent tumor entities. The analysis was restricted to patients with TMB < 15\nmutations/megabase and pMMR status with either gynecological cancers or\ncarcinosarcoma/sarcomatoid carcinoma, resulting in a cohort of nine\npatients. Of these, seven patients received ICI therapy and were included in\nthe study. The cohort comprised six females and one male aged 32 to 83\nyears at MTB presentation. Given that the similarity analysis focused on\nbiomarker proﬁles and cancer morphology, the male patient’si n c l u s i o nw a s\nappropriate. His sarcomatoid carcinoma aligned with the other inclusion\ncriteria, regardless of his gender or cancer type.\nData extraction\n89 clinical reports were extracted for the patient cohort (median: 11, range: 9-\n21). Documents had a median of two pages and 4340 characters. Documents\ncontained 70 data points for the selected attributes. Experts reviewed all\nextractions in the sample. The local LLM achieved accuracy of 0.76, precision\nof 0.85, recall of 0.87 and F1 of 0.86. The highest accuracy was achieved for\n‘diagnosis’and ‘ICI treatment’(1.00). Low accuracy occurred in‘previous\ntreatment’(0.29) and‘PFS’(0.14), mainly due to parsing errors in order and\ndates of previous treatments. See Table1 for full results of the analysis.\nDocument analysis revealed that primary tumor sites included meta-\nstatic UCS (n = 1), metastatic cervical cancer (n = 4; three squamous cell\ncarcinoma, one adenocarcinoma), metastatic uterine serous carcinoma\n(n = 1), and metastatic, undifferentiated sarcomatoid carcinoma of the\npancreas (n = 1). Patients exhibited high PD-L1 expression with a median\nC P So f7 5( r a n g e :4 0–95) and a median TMB of 5.5 (range: 0–11). Median\nfollow-up duration was 48 months (range: 15–132 months). Detailed\nbaseline clinical characteristics are presented in Supplementary Table 3.\nThe LLM-based systematic literature research yielded a dataset of\n663 scientiﬁc documents. Files had a median of seven pages and 27,995\ncharacters, with a maximum of 934,513 characters. The LLM extracted 7956\nattributes from scientiﬁc documents. Attribute extraction was reviewed with\na random sample ofn = 352 (Z = 1.96,N = 7956, e = 0.05,P =0 . 5 ) . T h e\ncloud-based LLM achieved accuracy of 0.97, precision of 0.97, recall of 0.99,\nand F1 of 0.98. Lowest precision was observed in PFS (0.77).\nThe LLM system identiﬁed 15 studies reporting ICI treatment in UCS,\nencompassing a total of 215 patients. While seven of the studies did not\nexclusively enroll UCS patients, four provided stratiﬁed outcomes for UCS\ncases. Phase II studies that provided stratiﬁed analysis for UCS patients\nshowed objective response rates between 0 and 10% for ICI treatment. None of\nthe seven studies allowed for individual patient-level data extraction to create\ndigital twins (see details on these seven studies in Supplementary Table 4).\nPD-L1 status was reported in 10 of the 215 literature-derived UCS cases\ntreated with immunotherapy, with three cases exhibiting PD-L1 positivity.\nThis limited sample size precluded stratiﬁed analysis. Notably, two of the\nPD-L1-positive UCS patients harbored dMMR and one had a high TMB,\nboth of which are known to inﬂuence ICI treatment response.\nFurther analysis of the 15 identiﬁed studies yielded eight studies with\nindividual patient follow-up data, comprising a total of 14 cases. The median\nage of these literature-derived patients was 63 years (range: 55–68 years).\nTreatment response outcomes for 21 individual patients\nIn the institutional cohort, seven patients received ICI therapy:ﬁve with\npembrolizumab monotherapy, one with pembrolizumab plus lenvatinib,\nand one with ipilimumab plus nivolumab. ICI therapy was initiated on\naverage in the third line (range: 2–4). Median PFS was 6 months (range:\n1–48). One patient remained disease-free after 45 months, two continued to\nrespond, one received a subsequent treatment line, and three had died.\nTreatments in the 14 cases of the literature-derived cohort consisted of\npembrolizumab (n = 4), pembrolizumab plus lenvatinib (n =7 ) , p e m -\nbrolizumab plus lenvatinib plus letrozole ( n =1 ) , P D - 1 / C y t o t o x i c\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 2\nT-lymphocyte associated protein 4 inhibitors (n = 1), and avelumab plus\naxitinib (n = 1). ICI was typically given in the third line (range: 2–5). Median\nPFS was 4 months (range: 0.9–15), and median OS was 9.9 months (range:\n2.1–48). At data cut-off, six patients were alive, seven had died, and one had\nunknown status.\nTable2 provides a summary of ICI treatment response outcomes for all\n21 cases.\nRGT digital twins enable predictive modeling of individualized\npatient treatment strategies\nTo inform personalized treatment planning for the UCS patient (case 1),\ndigital twins were created based on 21 evaluable patients. Treatment out-\ncomes were predicted based on a database of additional 404,265 cases\nderived from scientiﬁcp a p e r s(n = 655). Potential treatment strategies were\npredicted for a patient with UCS with disease progression following third-\nline pembrolizumab monotherapy.\nSupplementary Figure 1 presents treatment-relevant biomarkers after\nprogression on standard-of-care combination treatment with carboplatin\nand paclitaxel identiﬁed by the digital twin system.\nThe digital twin system tailored treatment recommendations based on\nthe patient’s speciﬁc tumor characteristics, treatment history, and geo-\ngraphic location. Considering the patient’s ongoing pembrolizumab ther-\napy, the system suggested testing for Folate Receptor Alpha (FRα) to assess\npotential eligibility for an off-label treatment regimen currently under\nclinical investigation. This trial investigated the combination of\nmirvetuximab soravtansine and pembrolizumab in FRα-positive UCS, with\neligibility criteria including pMMRstatus and prior pembrolizumab pro-\ngression. However, the trial was no longer recruiting participants and was\nlimited to the United States\n19. Therefore, the digital twin system suggested\nconsidering off-label use of this regimen for the patient. A previous eva-\nluation (2021) identiﬁed HER2 ampliﬁcation in the patient’st u m o r ,a\nbiomarker linked to high objective response rates to trastuzumab\nderuxtecan\n20. Due to the potential for HER2 status to evolve, the system\nrecommended conﬁrming thisﬁnding through a new biopsy21. Addition-\nally, the digital twin system suggested evaluating Melanoma-Associated\nAntigen A4 (MAGE-A4) and Preferentially Expressed Antigen in Mela-\nnoma (PRAME), biomarkers frequently expressed in UCS\n22,23. Ongoing\nresearch explores targeted therapies for these markers. Three relevant\nclinical trials were accessible within the patient’sg e o g r a p h i ca r e a .T o\nmonitor disease progression, the system recommended continued tracking\nof serum Cancer Antigen-125 (CA-125) levels\n24 based on its established\ncorrelation with disease progression identiﬁed in the patient’s 2021\nEHR data.\nPotential treatment trajectories for treatment line four derived from the\nDigital Twin pipeline are demonstrated in Table3.\nQuantifying LLM throughput\nFor local patient data processed on a standard PC (Macbook Pro M4), LLM\nextraction took a total of 61 min, averaging 0.68 min (41 s) perﬁle. We\nestimate that this could be reduced to around 10 s perﬁle when using a\nTable 1 | Evaluation of LLM performance for EHR and literature record extraction\nSource File Data point Observations True\nPositive\nTrue\nNegative\nFalse\nPositive\nFalse\nNegative\nAccuracy Precision Recall F1\nPathology\nReport\nAge 1821 1821 0 0 0 1.00 1.00 1.00 1.00\nPathology\nReport\nDiagnosis 1821 1821 0 0 0 1.00 1.00 1.00 1.00\nPathology\nReport\nPD-L1 status (CPS,\nTPS, IC)\n1821 1811 0 7 10 0.99 1.00 0.99 1.00\nPathology\nReport\nTMB status 1821 1819 0 0 2 1.00 1.00 1.00 1.00\nPathology\nReport\nMicrosatellite status 1821 1811 0 2 8 0.99 1.00 1.00 1.00\nPathology\nReport\nTOTAL 9105 9083 0 9 20 1.00 1.00 1.00 1.00\nClinical Report Age 7 6 0 1 0 0.86 0.86 1.00 0.86\nClinical Report Gender 7 7 0 0 0 1.00 1.00 1.00 1.00\nClinical Report Race 7 7 0 0 0 1.00 1.00 1.00 1.00\nClinical Report Diagnosis 7 7 0 0 0 1.00 1.00 1.00 1.00\nClinical Report Biomarkers 7 4 0 3 0 0.57 0.57 1.00 0.73\nClinical Report Previous treatments 7 2 0 0 5 0.29 1.00 0.29 0.44\nClinical Report Study treatments 7 7 0 0 0 1.00 1.00 1.00 1.00\nClinical Report Study treatment\nresponse\n7 5 0 1 1 0.71 0.83 0.83 0.83\nClinical Report PFS [months] 7 1 0 6 0 0.14 0.14 1.00 0.25\nClinical Report OS [months] 7 7 0 0 0 1.00 1.00 1.00 1.00\nClinical Report TOTAL 70 53 0 9 8 0.76 0.83 0.90 0.86\nLiterature Sample size 32 29 3 0 0 1.00 1.00 1.00 1.00\nLiterature Age 32 29 3 0 0 1.00 1.00 1.00 1.00\nLiterature Gender 32 7 25 0 0 1.00 1.00 1.00 1.00\nLiterature Race 32 7 25 0 0 1.00 1.00 1.00 1.00\nLiterature Diagnosis 32 30 1 0 1 0.97 1.00 0.97 0.98\nLLM Large Language Model,EHR Electronic Health Record,PD-L1 Programmed Cell Death Ligand 1,TMB Tumor Mutational Burden,CPS Combined Positive Score,TPS Tumor Proportion Score,IC\nTumor-Inﬁltrating Immune Cells,PFS Progression-Free Survival,OS Overall Survival.\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 3\nTable 2 | ICI treatment outcomes in 7 institutional cases and 14 literature-derived cases\nID Reference Diagnosis Age 1 Race PD-L1\nStatus\nTMB\n(Mut/\nMb)\n2\nMMR Addtl. relevant\nbiomarkers (All.\nfrequency)\nTreatment\nLine\nICI treatment\n(mono/\ncombination)\nResponse PFS\n[months]\nOS [months]\n1 Institutional UCS 77 White CPS: 41,\nTPS: 3%,\nIC: 40%\n6.3 pMMR\n(3.6%)\nERα 0.8, PR 0.03, HER2-\npositive\n3 Radiotherapy +\npembrolizumab\n(off-label)\nPR >30\n(ongoing)\n>132 (ongoing)\n2 Institutional CESC 37 White CPS: 75,\nTPS: 70%,\nIC: 5%\n0 pMMR\n(1.11%)\nNone 3 Pembrolizumab\n(off-label)\nPR >49\n(ongoing)\n>79 (ongoing)\n3 Institutional CESC 32 White CPS: 40,\nTPS: 40%,\nIC : <1%\n3.1 pMMR\n(0%)\nPIK3CA (p.E545K, 0.26),\nCHEK2\n(p.T367Mfs*15, 0.79)\n2 Pembrolizumab\n(off-label)\nPD 1 15 (deceased)\n4 Institutional CESC 85 White CPS: 81,\nTPS: 80%,\nIC: 1%\n11 pMMR\n(4.6%)\nBRAF (p.D594N, 0.27),\nKMT2C\n(p.Q192Tfs*28, 0.29)\n4 Pembrolizumab\n(off-label)\nPR, PD 18 72 (deceased)\n5 Institutional CEAD 37 White CPS: 95,\nTPS: 90%,\nIC: 5%\n5.5 pMMR\n(4.6%)\nNone 2 Ipilimumab/\nnivolumab,\nnivolumab\nmaintenance\n(off-label)\nCR >45 >45 (ongoing)\n6 Institutional USC 61 White CPS: 40,\nTPS: 30%,\nIC: 8%\n13.4 pMMR\n(1.89%)\nPIK3CA (p.E545K, 0.06),\nPTEN (p.K128Rfs*6,\n0.13), PTEN\n(p.Y240delins*, 0.06),\nFRα: 0%, HER2: Score 0,\nTrop2: 100%\n3 Pembrolizumab +\nlenvatinib (in-label)\nPD 3 >69 (ongoing)\n7 Institutional Undifferentiated\nSarcomatoid\nCarcinoma of the\nPancreas\n60 White CPS: 85,\nTPS: 80%,\nIC: 4%\n3.2 pMMR\n(2.61%)\nKRAS (p.G12C; 0.38) 3 Pembrolizumab\n(off-label)\nPR, PD 6 19 (deceased)\n8 PMID:\n32620662\nUCS 65 Asian\n(Japanese)\npositive n/a dMMR/\nMSI-H\nNone 2 Radiotherapy +\npembrolizumab\nCR, PD 10 16 (deceased)\n9 PMID:\n34401435\nUCS n/a 3 n/a3 negative n/a pMMR 3 Pembrolizumab +\nlenvatinib\nPD 3.3 9.9 (deceased)\n10 PMID:\n34401435\nUCS n/a 3 n/a3 negative n/a pMMR 3 Pembrolizumab +\nlenvatinib\nPD 0.9 2.8 (deceased)\n11 PMID:\n34401435\nUCS n/a 3 n/a3 positive n/a dMMR/\nMSI-H\n3 Pembrolizumab +\nlenvatinib\nPD 1.6 2.4 (deceased)\n12 PMID:\n34401435\nUCS n/a 3 n/a3 negative n/a pMMR 3 Pembrolizumab +\nlenvatinib\nPD 2.6 2.8 (deceased)\n13 PMID:\n34401435\nUCS n/a 3 n/a3 negative n/a pMMR 5 Pembrolizumab +\nlenvatinib\nPD 1.9 2.1 (deceased)\n14 PMID:\n34401435\nUCS n/a 3 n/a3 negative n/a pMMR 4 Pembrolizumab +\nlenvatinib\nSD - (ongoing) 4.4 (alive at data cut-off)\n15 PMID:\n34401435\nUCS n/a 3 n/a3 negative n/a pMMR 3 Pembrolizumab +\nlenvatinib\nSD, PD 11.2 12.6 (alive at data\ncut-off)\n16 PMID:\n29386312\nUCS 55 n/a 1 + , low\npositive\n169 pMMR POLE-mutated 4 Pembrolizumab PR >12\n(ongoing)\n39 (alive at data cut-off)\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 4\nclustered computing environment. Manual review of the LLM output added\nan average of 8 min perﬁle, resulting in a total time of 8.69 min perﬁle for\nthe combined LLM-assisted and human-reviewed approach. In compar-\nison, manual extraction of the same data took an average of 55 min perﬁle,\nrepresenting a 6.3-fold reduction in time.\nWhen processing a larger volume of literature with a cloud-based LLM,\nextraction took 83 minutes, averaging 0.125 min (7.5 s) per document.\nManual validation added another 6 minutes per document, for a total of\n6.125 min per document. In contrast,manual extraction from literature\naveraged 17 min per document, resulting in a 2.8-fold time saving with the\nLLM-assisted method.\nDiscussion\nExtracting meaningful data from unstructured medical text is a prerequisite\nfor precision medicine. In this study, we implemented an LLM-based\nextraction pipeline to systematically retrieve, structure, and analyze data\nfrom real-world EHRs and online sources to support and evaluate diag-\nnostic and targeted therapeutic strategies for constructing patient-speciﬁc\ndigital twins for metastatic UCS.\nThe limited data for this rare cancer led us to strategically use in-\ncontext learning rather thanﬁne-tuning, which risks overﬁtting on small\ndatasets and poor generalization. In-context learning leverages the pre-\ntrained LLMs’broad knowledge through prompt examples for effective data\nextraction without extensive retraining.\nThe LLM-based extraction pipeline facilitated timely and accurate\nsynthesis of all relevant full-text scientiﬁc publications available through\ninstitutional access up to August 15, 2024.\nQuantifying LLM throughput highlights the considerable efﬁciency\ngains achieved through LLM-assisted data extraction, even when incor-\nporating necessary manual review. These improvements demonstrate the\npractical viability of integrating LLMs into clinical workﬂows, particularly\nfor accelerating data curation from unstructured sources.\nThe cloud-based LLM achieved precision of 0.97 on a complex corpus\nof medical literature, close to the0.96 observed by other researchers\n25.T h i s\nenabled the generation of evidence-based recommendations and predictive\ninsights grounded in the latest research. Key gaps were observed in\nextraction of complex data structures, with precision of‘PFS’(0.77) and‘OS’\n(0.94) below the overall precision of 0.97. This was due to the fragmented\nand unstructured way of reporting PFS and OS. Sentences such as“Patient\nsurvived for 14 months with the residual tumor post-relapse,”\n26 make it\nchallenging to accurately determine PFS, as it requires estimation based on\nprior treatments and the number of treatment cycles. However, estimated\nPFS may not be accurate if treatment cycles were prolonged. This highlights\nthe challenge of extracting precise outcome data when the primary source\nlacks comprehensive reporting. We strongly advocate for standards in\nreporting treatment outcomes, e.g., by clearly stating PFS in months and not\ndate ranges.\nIn institutional data, unstructured EHR impeded the extraction of key\nclinical information. This limitation delayed the integration of institutional\npatient data for informing the management of similar cases. Phase II trials\nneglecting biomarker-stratiﬁcation in patients with UCS yielded low\nobjective response rates to ICI therapy, ranging from only zero to ten\npercent\n27,28. For our UCS patient, this bottleneck might have precluded ICIs\nbased on high PD-L1 expression, despite the fact that pembrolizumab\nproved highly efﬁcacious with no adverse effectsi nt h i sp a t i e n t .T h el o c a l\nLLM system was able to extract structured follow-up data from EHRs across\na diverse and complex set of medical documents. While it achieved lower\nprecision than the cloud-based model at 0.85, this is in line with the per-\nformance of similar models on complex EHR\n29.N o t a b l y ,p r e c i s i o nf o r\nbiomarkers was rated the second-lowest at 0.57. The LLM achieved full\nrecall for all biomarkers given as examples for in-context learning, but did\nnot recognize biomarkers that were not explicitly mentioned (e.g.,BRAFfor\ncase ID 4). The LLM again achieved lowest precision for PFS at 0.14. This is\ndue to the highly unstructured and fragmented way of reporting PFS, often\nacross multiple documents.\nTable 2 (continued) | ICI treatment outcomes in 7 institutional cases and 14 literature-derived cases\nID Reference Diagnosis Age 1 Race PD-L1\nStatus\nTMB\n(Mut/\nMb)\n2\nMMR Addtl. relevant\nbiomarkers (All.\nfrequency)\nTreatment\nLine\nICI treatment\n(mono/\ncombination)\nResponse PFS\n[months]\nOS [months]\n17 PMID:\n38881561\nUCS 68 n/a n/a 6 pMMR PTEN K128T, ESR1-\nampliﬁed (8/8 exons, est.\n11 copies), ER positive\n2 Pembrolizumab +\nlenvatinib +letrozole\nPR >36\n(ongoing)\n45 (alive at data cut-off)\n18 PMID:\n30442730\nUCS 59 n/a n/a n/a n/a 2 Pembrolizumab MR 4 n/a\n19 PMID:\n33004543\nUCS 66 Asian\n(Japanese)\nn/a n/a dMMR Highly predisposing HLA\nhaplotype for narcolepsy\n3 Pembrolizumab PD 2 Deceased, 72 days post\npembrolizumab, OS n/a\n20 PMID:\n31149529\nUCS 68 n/a n/a n/a n/a 2 PD-1 antibody +\nCTLA-4 antibody\nPR >5\n(ongoing)\nN/a, alive\n21 PMID:\n35434237\nUCS 62 n/a n/a 14 pMMR Germline NBN mutation,\n(c.2117 C > G,\np.Ser706Ter) HER2-low\n(Score 1+ )\n3 Avelumab + axetinib PR >15\n(ongoing)\n48 (alive at data cut-off)\n1. Current age at data cut-off (publication).\n2. TMB: <5: low, 5–15: intermediate,≥15: high.\n3. Patients 9–15: Median age: 63 (range: 58–64), White: 3, Black: 4. Individual data for age & race not reported.\n4. PMID: PubMed-ID.\n5. Note:‘n/a’entries indicate data not available for the speciﬁc case.\nICI Immune Checkpoint Inhibitor,PD-L1 Programmed Cell Death Ligand 1,TMB Tumor Mutational Burden.Mut/Mb Mutations/Megabase, MMR Mismatch Repair,CPS Combined Positive Score,TPS Tumor Proportion Score,IC Tumor-Inﬁltrating Immune Cells,dMMR\ndeﬁcient Mismatch Repair,pMMR proﬁcient Mismatch Repair,MSI-H High Microsatellite Instability,Addtl. Additional,HLA Human Leukocyte Antigen,PFS Progression-Free Survival,OS Overall Survival,PMID PubMed ID,UCS Uterine Carcinosarcoma,n/a not available,\nEst. estimated, PD Progressive Disease,SD Stable Disease,PR Partial Response,MR Mixed Response.\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 5\nTable 3 | Digital twin pipeline provided the following individualized treatment targets for case 1\nBiomarker Prevalence in UCS Biomarker Result Treatment Expected treatment response Reference\nHER2 Expressed in 1/3 of UCS21,44 Positive (Histopathological report, January,\n2021: “HER2 is positive in some of the tumor cells\nwith an intermediate level of positivity and an\nincomplete level of circumferential positivity.”)\nTrastuzumab deruxtecan\nT-DM1\nThe phase II STATICE trial enrolled 22 HER2-\nhigh and 10 HER2-low patients with recurrent\nUCS. Objective response rates (ORRs) were\n54.5% and 70% in the HER2-high and HER2-\nlow groups, respectively. Median progression-\nfree survival (PFS) was 6.2 months for HER2-\nhigh patients and 13.3 months for HER2-low\npatients. Overall survival (OS) was 6.7 months\nfor HER2-high patients and not reached for\nHER2-low patients. Three patients in each\ngroup had received at least three prior lines of\ntherapy.\nT-DM1 demonstrated signiﬁcant antitumor\nactivity in HER2-overexpressing CS xenograft\nmodels, resulting in prolonged survival\ncompared to trastuzumab.\nPhase II study\n20:\nPreclinical evidence45:\nER-alpha Estrogen receptor: 20 –30%;\nprogestin receptor: 5–40%12\n80% Anithormonal treatment (e.g., anastrozole)\nPembrolizumab + lenvatinib + letrozole\nThe phase II PARAGON study enrolled seven\npatients with UCS and evaluated anastrozole\ntreatment. A clinical beneﬁt rate (CBR) of 43%\nwas observed at three months, with a median\nduration of clinical beneﬁt of 5.6 months. While\nstable disease was noted in three patients, no\nobjective responses were achieved. Median\nprogression-free survival was 2.7 months. 43%\nof the entire cohort (UCS and leiomyosarcoma)\nhad received prior chemotherapy.\nA patient with metastatic, pMMR, andESR1-\nampliﬁed UCS achieved a durable partial\nresponse of 36 months with third-line treatment\ncombining pembrolizumab, lenvatinib, and\nletrozole.\nPhase II study\n46:\nCase report47:\nFR-alpha Expressed in 1/3 of UCS48 Not determined. Mirvetuximab soravtansine +\npembrolizumab\nPatients with FR-alpha positive tumors may be\neligible for combination therapy with\nmirvetuximab soravtansine and\npembrolizumab. This approach is supported by\nresults from a phase II trial (NCT03835819)\ndemonstrating efﬁcacy in pMMR-positive\npatients, including those with prior\npembrolizumab treatment failure. Interim\nanalysis in endometrial cancers showed ORR of\n37.5%. No stratiﬁed analysis for UCS available.\nPhase II study\n49:\nHRD Unknown Not determined. Poly (ADP-Ribose) Polymerase\nInhibitor (PARPi)\nUCS cell lines exhibiting HRD signature\ndemonstrated signiﬁcantly increased sensitivity\nto olaparib compared to homologous\nrecombination proﬁcient UCS cell lines, both in\nvitro and in vivo.\nPreclinical evidence50:\nMAGE-A4 Expressed in 91% of\ncarcinosarcomas22\nNot determined. Bispeci ﬁc T Cell Engaging Receptor\nMolecule targeting MAGE-A4/8 expression\nPatients with MAGE-A4-positive UCS may be\neligible for participation in an ongoing clinical\ntrial located in Bavaria:\nA Phase Ia/Ib First-In-Human Clinical Trial to\nEvaluate the Safety, Tolerability and Initial Anti-\ntumor Activity of IMA401, a Bispeciﬁc T Cell\nEngaging Receptor Molecule (TCER®), in\nPatients With Recurrent and/or Refractory Solid\nTumors.\nhttps://clinicaltrials.\ngov/study/\nNCT05359445\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 6\nTable 3 (continued) | Digital twin pipeline provided the following individualized treatment targets for case 1\nBiomarker Prevalence in UCS Biomarker Result Treatment Expected treatment response Reference\nPRAME Expressed in 60% of UCS 23,51 Not determined. Bispeci ﬁc T Cell-Engaging Receptor\nMolecule targeting PRAME\nGenetically Modiﬁed Autologous T Cells\nExpressing a T Cell Engaging Receptor\nRecognizing PRAME as Monotherapy or in\nCombination with Nivolumab\nPatients with PRAME-positive UCS may be\neligible for participation in two ongoing clinical\ntrials located in Bavaria:\na) IMA402-101: A Phase I/II First-In-Human\nClinical Trial to Evaluate the Safety, Tolerability\nand Anti-Tumor Activity of IMA402, a Bispeciﬁc\nT Cell-Engaging Receptor Molecule (TCER)\nTargeting PRAME, in Patients With Recurrent\nand/or Refractory Solid Tumors.\nb) IMA203-101: Phase 1 Study Evaluating\nGenetically Modiﬁed Autologous T Cells\nExpressing a TCR Recognizing a Cancer/\nGermline Antigen as Monotherapy or in\nCombination With Nivolumab in Patients With\nRecurrent and/or Refractory Solid Tumors\na) https://clinicaltrials.\ngov/study/\nNCT05958121\nb) https://clinicaltrials.\ngov/study/\nNCT03686124\nTrop2 Expressed in\n1/3 of UCS52,53 Not determined. Sacituzumab govitecan Twenty-two patients with Trop2-positive\nrecurrent endometrial cancer were enrolled in a\nphase II study evaluating sacituzumab\ngovitecan. Of these, three patients had UCS.\nAmong the 20 response-evaluable patients, an\nobjective response rate of 35% was observed.\nMedian progression-free survival (PFS) and\noverall survival (OS) were 5.7 months and\n22.5 months, respectively. The median (range)\nnumber of prior anticancer regimens was 3\n(1–6).\nSacituzumab govitecan demonstrated\nsigniﬁcant tumor growth inhibition and\nimproved 90-day overall survival in Trop2-\npositive carcinosarcoma cell lines compared to\nTrop2-negative controls.\nPhase II study\n54:\nPreclinical evidence53:\nSerum CA-125 Elevated serum CA-125 levels in\n62% of UCS patients with FIGO\nstage III or IV24\nElevated at progression in 2021, normalized\nsince 2022 correlating with partial response.\nTreatment monitoring with Serum CA-125 Preoperative CA-125 elevation correlates with\nextrauterine disease and deep myometrial\ninvasion in patients with UCS. Postoperatively,\nelevated CA-125 is an independent prognostic\nindicator of poor survival. Theseﬁndings\nsuggest that CA-125 could serve as a valuable\nserum marker for managing UCS patients.\nRetrospective\nanalysis\n24:\nUCS Uterine Carcinosarcoma,T-DM1 Ado-trastuzumab emtansine,PD Progressive Disease,PFS Progression-Free Survival,OS Overall Survival,Yrs years, pMMR proﬁcient Mismatch Repair,dMMR deﬁcient Mismatch Repair,ER Estrogen Receptor,PR Progesterone\nReceptor, FRα Folate Receptor Alpha,HRD Homologous Recombination Deﬁciency, MAGE-A4 Melanoma-Associated Antigen A4,PD-L1 Programmed Cell Death Ligand 1,PRAME Preferentially Expressed Antigen in Melanoma,TMB Tumor Mutational Burden,Trop2\nHuman trophoblastic cell surface antigen 2,WGS Whole Genome Sequencing,FIGO International Federation of Gynecology and Obstetrics.\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 7\nError analysis of the LLM-based extraction highlighted two challenges:\nErrors were found in extracting PFS from literature and EHRs, likely due to\ninconsistent formats and the need for temporal reasoning across multiple\nparagraphs. Similarly, identifying the number and type of prior treatments\nfrom free-text clinical notes led to incorrect extractions. In contrast, the\nLLMs performed reliably when extracting clearly deﬁned and consistently\nreported data points. Notably, errors were either presented as missing or\nincomplete data points, rather than the fabrication of information. The use\nof in-context learning improved the model’s grounding for well-structured\ntasks but was less effective in addressing the ambiguities and contextual\ndependencies inherent in more complex extractions.The European Society\nfor Medical Oncology Precision Medicine Working Group recently estab-\nlished criteria for evaluating the tumor-agnostic potential of molecularly\nguided therapies, mandating an ORR of≥20% in at least one ofﬁve patients\nacross at least four investigated tumor types, with a minimum ofﬁve eva-\nluable patients per type\n3. Our institutional MTB database identiﬁed six\nanalogous cases involving four additional tumor types, most of which\nexhibited durable responses to ICIs.While the limited number of evaluable\npatients per tumor type in our single-institution cohort restricted the sta-\ntistical power, an LLM-driven literature review highlighted an under-\nreporting of PD-L1 expression in UCS in studies conducted to date, despite\nthe known high prevalence of PD-L1 positivity in this malignancy\n15,16.T h i s\nunderreporting impeded our ability toassess the predictive value of PD-L1\nto guide ICI treatment in UCS. Despite the limited sample size of our\ninstitutional cohort, the promising outcomes observed suggest that targeting\nPD-L1 expression in RGT may be a viable therapeutic strategy. The inclu-\nsion of diverse tumor types in our institutional cohort further strengthens\nthe role of PD-L1 inhibition in both gynecological and non-gynecological\ncancers, making it a potential tumor-agnostic marker.\nTo inform treatment strategies in the event of disease progression, we\nconstructed 21 individualized digital twins, including 7 from our institu-\ntional database and 14 from the literature, and queried an LLM-derived\ndatabase containing 404,265 patient cases. Although our systematic\nPubMed search was speciﬁcally limited to the terms“uterine carcino-\nsarcoma” and “endometrial carcinosarcoma,” the resulting sample also\nincluded other uterine and ovarian malignancies. This is because UCS is\nfrequently reported within the broadercontext of clinical trials involving\nmore common gynecologic cancers.\nThe RGT digital twin system generated individualized trajectory pre-\ndictions for various targeted therapies within a secure local environment\nthat respects patient data privacy, offering guidance on further diagnostics,\npotential treatment options and continued treatment monitoring with\nserum CA-125. Additionally, since our real-world cohort comprised only\nWhite patients, being able to extract data on patients of other races from a\nvast corpus of literature helped us validate the generalizability of our\ntreatment recommendations\n30.\nThis study successfully demonstrated the utility of RGT digital twins\nfor individualized treatment prediction and response modeling. The\ndigital twin not only provided generalized recommendations for addi-\ntional diagnostic testing but also incorporated speciﬁc clinical details from\nthe patient’s treatment history— such as prior pembrolizumab adminis-\ntration— to reﬁne eligibility assessments for targeted therapies. The\nextraction and analysis of follow-up data revealed that, following the MTB\nrecommendation, the patient received pembrolizumab due to high PD-L1\nexpression and exhibited a sustained partial response for over 30 months.\nSubsequent to pembrolizumab initiation, CA-125 levels normalized\nwithin three months and have remained stable in the context of ongoing\nstable disease.\nThis study had several limitations. Firstly, despite a large dataset, the\ncombination of stringent similarity criteria, a limited institutional cohort,\nand underreported PD-L1 status in published UCS cases prevented us from\nstratifying patients by PD-L1 status. Efﬁcacy of ICI treatment in PD-\nL1–positive UCS remains uncertain, and current trials lack PD-L1 as a\nstratiﬁcation factor. Bogani et al. listed nine clinical trials currently exploring\nICI treatment in UCS, many of which are nearing completion\n12.N o n eo f\nthese trials included PD-L1 expression as a stratiﬁcation factor. Ourﬁndings\ncould inform the design of future trials that speciﬁcally evaluate ICI efﬁcacy\nin pMMR UCS with high PD-L1 expression and low to intermediate TMB.\nSecondly, only somatic biomarkers were included, potentially under-\nestimating clinical actionability by excluding germline mutations, such as\nBRCA1/2, which are predictive of PARP inhibitor response\n31.T h i r d l y ,al o c a l\nLLM was used for data extraction, impacting extraction performance due to\nits smaller size and noﬁn e - t u n i n go nG e r m a nm e d i c a lt e x t s\n32.L a c ko fa\nGerman-language equivalent to the English-language MIMIC labeled\nmedical record dataset\n33 precludedﬁne-tuning our own model. Finally, the\nGerman Network for Personalized Medicine (DNPM) data model is under\nrevision\n34, necessitating the use of a custom data model for this study and\nhighlighting the importance of future validation for compatibility with\nDNPM v2.\nNational and international collaborative initiatives, such as the DNPM\nData Integration Platform\n35 and the Molecular Tumor Board Portal by\nCancer Core Europe36, aim to enhance MTB decision-making by standar-\ndizing and harmonizing data collection across institutions. These platforms\nstand to beneﬁts i g n iﬁcantly from the integration of LLM-based extraction\npipelines, which could facilitate the automated extraction of both baseline\nand follow-up data, thereby enablingthe real-time utilization of MTB data\nacross different healthcare systems. Once the DNPM database is fully\noperational, clinical narratives derived from EHR data could be transformed\ni n t oH L 7F a s tH e a l t h c a r eI n t e r o p e r a bility Resources (FHIR), streamlining\ninteroperability and reducing the biases and costs associated with manual\ndocumentation\n37. Such automation would enable the analysis of larger\npatient cohorts, thereby providing the statistical power necessary for\naccurate treatment predictions in rare cancers, a critical step towards\nadvancing personalized oncology. These outcome data offer a valuable\nresource forﬁne-tuning LLMs and for guiding both preclinical research and\nstratiﬁed clinical trial design.\nAt present, LLM knowledge synthesis forms the core of the system’s\npredictive capabilities. The future incorporation of auxiliary machine\nlearning models could offer complementary approaches for enhanced\npredictive analytics.\nBeyond the speciﬁc limitations of our study, the broader applicability of\ngenerating digital twins necessitatescareful consideration of local envir-\nonments and ethical implications. Our framework is designed to prioritize\nlocal data processing within institutional settings, ensuring sensitive patient\ndata remains secure, as reﬂected in our accompanying GitHub code. For the\n27b model used, local processing is feasible with standard computer hard-\nw a r e .T h i si sp a i r e dw i t hac l o u d - b ased approach for processing publicly\navailable literature, allowing us to leverage external resources while main-\ntaining local control over sensitiveinformation, thereby addressing key\nethical and privacy concerns. Future work should continue to explore\nstrategies for secure and ethical deployment across diverse institutional\ninfrastructures and data governance models.\nOur LLM-enabled precision oncology approach can inform more\neffective treatment strategies for RGTpatients and suggests the potential for\nincorporating biomarkers, such asPD-L1 expression, to broaden ther-\napeutic options and inform more personalized strategies that transcend\ntraditional organ-based boundaries, particularly in the context of cancers\nwith limited standard treatments.\nGiven the increasing volume and complexity of precision oncology\ndata from MTBs, and the limited availability of precision oncologists to\ntranslate this abundance of information into clinically meaningful actions\n7,\nthere is an urgent need for advanced digital tools to facilitate the extraction,\nstructuring, and analysis of large datasets18. Our proof-of-concept study\ndemonstrates the potential of LLMs to efﬁciently synthesize relevant\ninformation for MTB evaluation.\nWhile this study focused on RGTs, the LLM-enabled digital twin\napproach holds potential for a wide range of refractory cancers. By accu-\nrately predicting individual patient trajectories, these digital twins can\ninform personalized diagnostics and treatment strategies in a timely and\ncost-effective manner, potentially improving patient outcomes.\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 8\nMethods\nStudy setup\nWe employed an RGT Digital Twin system to create personalized treatment\nsuggestions for UCS. A real-world patient case, along with molecular pro-\nﬁling data, was analyzed using the RGT Digital Twin system. Theﬁndings\nwere then compared to analogous cases drawn from institutional and public\ndatabases. Treatment options werediscussed at the MTB to inform indi-\nvidualized care decisions. Post-treatment outcomes were documented in the\npatient’s EHR and updated for the individual RGT Digital Twin to improve\nfuture predictions. The RGT Digital Twin provided rationale for cost cov-\nerage requests and supported study inclusion decisions. Refer to Fig.1 for an\noverview of the study process.\nPatient description and research question\nThe patient is a 77-year-old woman with metastatic UCS, initially diag-\nnosed with FIGO IIIC2 UCS at age 66. Six years after surgery and adjuvant\nchemotherapy with carboplatin and paclitaxel, the patient experienced a\nrecurrence in the cervical lymph nodes and pelvis, which was also asso-\nciated with an increase in CA-125 levels. A cervical lymph node biopsy\nconﬁrmed the recurrence, and the patient underwent the same che-\nmotherapy regimen followed by MTB presentation in 2021 (see Supple-\nmentary Table 1 for detailed results). Genomic proﬁling was conducted\nusing the TruSight Oncology 500 (TSO 500) and TruSight Tumor 170\n(TST 170) panels. By analyzing a wide range of cancer-related genes, these\npanels facilitate the discovery of potential therapeutic targets. Molecular\nproﬁling revealed an intermediate TMB of 6.3 mutations/megabase, high\nPD-L1 expression (Combined Positive Score, CPS: 41), and a pMMR\nstatus. The patient’s high PD-L1 expression prompted us to investigate the\npotential efﬁcacy of PD-L1 inhibitors in metastatic tumors, regardless of\nprimary tumor site or regional drug approval status. To this end, we\nsearched our institutional MTB database for analogous cases, not\nrestricted to gynecological cancers, and expanded our cohort with addi-\ntional UCS cases identiﬁed in the literature.\nData collection\nEHR data obtained from Technical University of Munich (TUM) Uni-\nversity Hospital was the primary data source. Data downloaded from web-\nbased repositories through institutional access extended the dataset. These\nrepositories included PubMed, ClinicalTrials.gov, and clinical practice\nguidelines from the National Comprehensive Cancer Network (NCCN)\nand the German Cancer Society (DKG), which ensured adherence to up-to-\ndate clinical standards.\nA two-stage approach was employed for extracting structured,\nactionable data from sourceﬁles. First, a locally deployed LLM system\nextracted relevant data from institutional EHRs. Second, a cloud-based LLM\nsystem processed documents from web-based repositories. Afterwards, the\nextracted structured dataset was made available to clinicians and the locally\ndeployed LLM for further analysis. This process is shown in Fig.3.\nIdentiﬁcation of analogous institutional cases\nWe utilized a locally deployed large language model to systematically ana-\nlyze pathology reports from MTB cases discussed at TUM University\nHospital between September 2017 and July 2024. PD-L1 expression, TMB\nand MMR status were documented in a total of 1821 cases. Eligibility criteria\nincluded high PD-L1 expression (CPS≥ 40) and the availability of both\nMMR and TMB status. Patients with high TMB (≥ 15 mutations/mega-\nbase) or deﬁcient MMR were excluded to avoid bias, as these features are\nalready established FDA-approved biomarkers for Immune Checkpoint\nInhibitor (ICI) therapy responsiveness.\nThe LLM-assisted screening process applied predeﬁned inclusion\ncriteria and stratiﬁed cases based on similarity to the presented UCS patient.\nSimilarity was determined by either medical specialty (gynecological\noncology) or histopathological features, speciﬁcally carcinosarcoma or\nsarcomatoid carcinoma morphology, independent of gender or anatomical\norigin. This strategy was based on the recognized molecular overlap between\nUCS and high-grade serous ovarian or endometrial carcinomas\n12.G i v e nt h e\nlimited clinical value of distinguishing between carcinosarcoma and\nFig. 1 | Workﬂow from RGT patient to RGT digital twin.Rare Gynecological\nTumor (RGT) Digital Twin is a dynamic system that can integrate diverse data\nsources to predict individual patient trajectories. Molecular proﬁling identiﬁes\npatient biomarkers. Large Language Model (LLM) capabilities support clinical\ninterpretation of molecular proﬁles, patient matching to clinical trials, reasoning for\ncost-coverage requests, medical documentation, and data preparation for advanced\ncomputing. Advanced computing techniques such as classiﬁcation and regression\nalgorithms enable the creation and exploration of Digital Twin models. By adjusting\nparameters such as biomarker expression or previous treatment strategies, clinicians\ncan model potential patient outcomes and determine suitable treatment strategies.\nThe RGT Digital Twin then integrates outcome data back into the RGT Patient\nElectronic Health Record (EHR), supporting a continuous learning process. RGT\nRare Gynecological Tumor, DB Database, LLM Large Language Model Fig. 1 uses\nfree icons obtained from Flaticon.com, in accordance with their licensing terms.\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 9\nsarcomatoid carcinoma in practice, the institutional MTB members\ngrouped these under the uniﬁed category of“morphology.”\nAs visualized in the CONSORT diagram (Fig.2) ,9c a s e sm e ta l l\ninclusion criteria: CPS≥ 40, pMMR, TMB < 15 mutations/megabase, and\nconcordance with at least one similarity parameter. Of these, 7 patients\nreceived ICI treatment and were included in theﬁnal LLM-driven analysis,\nwhich focused on extracting clinical and treatment outcomes, and evalu-\nating case-level comparability to the index UCS patient.\nFigure 2 provides an exemplary execution of the system for institu-\ntional data enhanced with external literature due to the limited availability of\nanalogous digital twins in EHR.\nInstitutional patient data extraction pipeline\nEHR of selected patients were processed in a secure hospital environment.\nDocuments varied in format, from (handwritten) medical notes to obitu-\naries. Ten attributes were extracted from documents for each patient to form\nthe RGT Digital Twin. Supplementary Table 2 shows the full list of attri-\nbutes. Optical Character Recognition (OCR) was performed using\nTesseract\n38. Raw text was processed with a locally deployed version of pre-\ntrained LLMgemma-2-27b-it, chosen for its ability to run locally while\nmaintaining strong performance on medical texts39. This privacy-preserving\narchitecture ensured that patient data would not leave the local clinic\nenvironment. In-context learning was used to adapt the LLM to the task at\nhand. This involves providing the LLMswith extensive instructions in their\nprompts, including example input and output (e.g.,“age”: “63”, “gender”:\n“female”, “diagnosis”: “Uterine Carcinosarcoma”). The publicly available\nGitHub repository provides the full prompt templates and examples. This\nimproves their recall and precision40.\nLiterature extraction pipeline\nTo extend the limited sample of analogous digital twins available in insti-\ntutional EHR, a systematic literature search was conducted onPubMed\nusing the terms‘uterine carcinosarcoma’and‘endometrial carcinosarcoma’.\nStudies and case reports that included individual clinical follow-up data on\npatients with UCS treated with ICI were considered for inclusion in the\nanalysis. Potential alternative treatment options and therapeutic targets\nwere identiﬁed through a comprehensive review of national (DKG) and\ninternational (NCCN) oncological guidelines,PubMed-indexed publica-\ntions, as well as theClinicalTrials.govdatabase.\nData points were extracted in the structure shown in Supplementary\nTable 2. The sample size was captured as an additional data point. Addi-\ntionally, the LLM was instructed to extract the main treatment recom-\nmendation based on the patient proﬁle in the paper. General purpose LLM\nGoogle-Gemini-1.5-Prowas selected for this task due to its large context\nwindow, which enabled it to process allﬁles in the sample without splitting\nthem into smaller chunks\n41. Since no institutional patient data was processed\nin this step, use of public cloud resources was permitted. The LLM was\ninstructed to return results in the form of a JSON object. The LLM processed\nall documents sequentially, with each document processed in-context.\nOutputs were exported to a Pandas dataframe on the local machine in the\nsecure hospital environment for convenient analysis by clinicians.\nEthics statement\nPatients from the institutional MTB wereincluded in a clinical registry that\nallowed for retrospective analyses of clinical and molecular anonymized\ndata in accordance with the Declaration of Helsinki. The retrospective\nanalysis was approved by the Ethics committee of the Medical Faculty of the\nTechnical University of Munich(Reference No. 2023-486-S-SB).\nAll web-based research procedures were conducted exclusively on\npublicly accessible, anonymized patient data and in accordance with the\nDeclaration of Helsinki, maintaining all relevant ethical standards.\nConstruction of LLM-enabled digital twin system\nNext, extracted data points were stored in a database in the secure hospital\nenvironment that constituted the patient’s digital twin. Clinicians were able\nto model potential outcomes for their patients and determine suitable\ntreatment strategies by reviewing treatment outcomes from patients with\nsimilar biomarkers and treatment history. Additionally, they were able to\nemploy the local LLM to combine treatment strategies identiﬁed from web\nsources with the patient’s digital twin, creating personalized treatment\nrecommendations.\nThe digital twin system provided a comprehensive overview of all\npotential recommendations relevant to the patient’s digital representation.\nSuitable recommendations were determined based on matching similar\ncases based on disease, prior treatments and biomarkers extracted from\ninstitutional data, oncological guidelines, clinical trials and literature. If the\npatient had received a speciﬁc treatment before, it was not suggested by the\nsystem. If relevant biomarkers were not speciﬁed in the patient’s digital\nrepresentation, the digital twin system proactively suggested their analysis to\ninform treatment decisions. The recommendations represented the com-\nplete set of applicable and viable options for that consultation. As new\npatient follow-up data and relevant literature were added to the local\ndatabase, the LLM’s accessible knowledge base expanded. This growing\nrepository enabled the system to generate increasingly informed and\nupdated insights for subsequent patients, enhancing its ability to provide\npersonalized and temporally relevant recommendations.\nAfter selecting a treatment strategy, the database served as evidence for\nMTB evaluation, clinical trial matching, and creation of cost coverage\nrequests with health insurance providers.\nThe developed pipeline is illustrated in Fig.3.\nFig. 2 | CONSORTﬂow diagram for evaluation of\nimmune checkpoint inhibitor treatment in insti-\ntutional and literature-derived cases.Flow dia-\ngram depicting patient selection for analysis from\nthe institutional Molecular Tumor Board (MTB),\nincluding those eligible for and treated with immune\ncheckpoint inhibitors (ICI). Due to the limited\nnumber of analogous digital twins within the insti-\ntutional MTB cohort (n = 7), additional UCS cases\nreceiving ICI treatment were identiﬁed through a\ntargeted literature review and included to supple-\nment the Rare Gynecological Tumor (RGT) Digital\nTwin (DT) dataset. MTB Molecular Tumor Board,\nPD-L1 Programmed Cell Death-Ligand 1, MMR\nMismatch Repair, TMB Tumor Mutational Burden,\nCPS Combined Positive Score, pMMR proﬁcient\nMismatch Repair, Mut/Mb Mutations/Megabase,\nUCS Uterine Carcinosarcoma, RGT Rare Gyneco-\nlogical Tumor. DT Digital Twin.\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 10\nAnalysis\nClinical characteristics, treatment regimens, duration of therapy, treatment\nresponses, PFS, and overall survival (OS) were systematically collected from\npatient records and reports. Treatment response was captured from radi-\nology reports and categorized as complete response (CR), partial response\n(PR), stable disease (SD), mixed response (MR), or progressive disease (PD).\nFor additional treatment strategies, outcomes were summarized for each\ntherapeutic approach. Cases were sequentially numbered, starting with\nthose retrieved from the institutional MTB database, followed by cases\nidentiﬁed from the literature.\nFormal statistical analysis to evaluate the accuracy of LLM data\nretrieval was performed by experts. Due to the large amount of data pro-\ncessed by the Digital Twin pipeline, weadopted human-in-the-loop reviews,\nan important aspect of machine learning\n42. To ensure that no information\nwas missed during extraction, a sample-based review of LLM output was\nperformed according to machinelearning leading practice\n43. For institu-\ntional data, experts reviewed all attributes extracted from EHR by the LLM\nfor correctness. For public research data, experts reviewed a random sample\nof attributes extracted from scientiﬁc studies for correctness. Additionally,\nall attributes that were used by the LLM to construct the literature-derived\ndigital twins were manually reviewed. Afterwards, accuracy, precision,\nrecall, and F1 scores of LLM extraction were calculated. Finally, all treatment\nrecommendations generated by the LLM were manually reviewed and\ncorrected by human experts. The data extraction review panel included two\nbioinformaticians and two gynecological oncologists withﬁve and 16 years\nof clinical experience.\nAp a n e lo fﬁve MTB members, including three clinicians, one\npathologist, and one biologist, along with a senior gynecological oncologist,\nevaluated the personalized treatment recommendations generated by the\nRGT Digital Twin system.\nAll statistical analyses were conducted using Pandas and SciPy libraries\nin Python (Version 3.10.12). The full code and documentation is available\non GitHub.\nData availability\nThe datasets analysed during the study are not publicly available due to\ninstitutional patient privacy regulations and the inclusion of full EHR, but\nare available from the corresponding author on reasonable request and\npending appropriate ethical approval. All notebooks and prompts used in\nthis study are publicly available at GitHub (https://github.com/LammertJ/\nRGT-Digital-Twin/).\nCode availability\nThe underlying code for this study is available on GitHub and can be\naccessed viathis link.\nReceived: 29 August 2024; Accepted: 17 June 2025;\nReferences\n1. Gatta, G. et al. Rare cancers are not so rare: The rare cancer burden in\nEurope. Eur. J. Cancer47, 2493–2511 (2011).\n2. Lainé, A., Hanvic, B. & Ray-Coquard, I. Importance of guidelines and\nnetworking for the management of rare gynecological cancers.Curr.\nOpin. Oncol.33, 442–446 (2021).\n3. The ESMO Tumour-Agnostic Classiﬁer and Screener (ETAC-S): A tool\nfor assessing tumour-agnostic potential of molecularly guided\ntherapies and for steering drug development.Ann. Oncol. https://doi.\norg/10.1016/j.annonc.2024.07.730 (2024).\n4. Horak, P. et al. Comprehensive genomic and transcriptomic analysis\nfor guiding therapeutic decisions in patients with rare cancers.Cancer\nDiscov. 11, 2780–2795 (2021).\n5. Ledermann, J. A. PARP inhibitors in ovarian cancer.Ann. Oncol.27,\ni40–i44 (2016).\n6. André, F., Rassy, E., Marabelle, A., Michiels, S. & Besse, B. Forget\nlung, breast or prostate cancer: why tumour naming needs to change.\nFig. 3 | LLM-enabled RGT Digital Twin Pipeline.To obtain institutional patient\ndata and matching patient proﬁles from literature, weﬁrst ﬁltered institutional\nrecords and public data sources (e.g.,PubMed) by biomarker proﬁles and patient\ndisease. We then extracted structured patient data from EHR using a locally\ndeployed, privacy-preserving LLM, and extracted similar data from published lit-\nerature using a cloud-based LLM. By utilizing a broader patient population than\nwhat is available in institutional data, the RGT Digital Twin system generated\npersonalized treatment plans for MTB evaluation. This method revealed additional\ntreatment options that might have been missed when considering each data source\nalone. EHR Electronic Health Record, LLM Large Language Model. Figure 3 uses\nfree icons obtained from Flaticon.com, in accordance with their licensing terms.\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 11\nNature Publishing Group UKhttps://doi.org/10.1038/d41586-024-\n00216-3 (2024).\n7. Tsimberidou, A. M. et al. Molecular tumour boards - current and future\nconsiderations for precision oncology.Nat. Rev. Clin. Oncol.20,\n843–863 (2023).\n8. Botsis, T. et al. Precision Oncology Core Data Model to Support\nClinical Genomics Decision Making.JCO Clin. Cancer Inf.7,\ne2200108 (2023).\n9. Acosta, J. N., Falcone, G. J., Rajpurkar, P. & Topol, E. J. Multimodal\nbiomedical AI.Nat. Med.28, 1773–1784 (2022).\n10. Kamel Boulos, M. N. & Zhang, P. Digital twins: From personalised\nmedicine to precision public health.J. Pers. Med.11, 745 (2021).\n11. Food, U. S., Administration, D. & Others. Paving the way for\npersonalized medicine: FDA’s role in a new era of medical product\ndevelopment. Silver Spring, MD: US Food and Drug Administration.\n12. Bogani, G. et al. Endometrial carcinosarcoma.Int. J. Gynecol. Cancer\n33, 147–174 (2023).\n13. Katsoulakis, E. et al. Digital twins for health: A scoping review.NPJ\nDigit Med7, 77 (2024).\n14. Adams, L. C. et al. Leveraging GPT-4 for post hoc transformation of\nfree-text. Radiol. Rep. into Struct. Rep. A Multiling. Feasibility Study\nRadiol. 307, e230725 (2023).\n15. Hacking, S., Chavarria, H., Jin, C., Perry, A. & Nasim, M. Landscape of\nimmune checkpoint inhibition in carcinosarcoma (MMMT): Analysis of\nIDO-1, PD-L1 and PD-1.Pathol. Res. Pract.216, 152847 (2020).\n16. Jenkins, T. M., Cantrell, L. A., Stoler, M. H. & Mills, A. M. PD-L1 and\nmismatch repair status in uterine carcinosarcomas.Int. J. Gynecol.\nPathol. 40, 563–574 (2021).\n17. Kucukgoz Gulec, U. et al. Prognostic signiﬁcance of programmed\ndeath-1 (PD-1) and programmed death-ligand 1 (PD-L1) expression in\nuterine carcinosarcoma.Eur. J. Obstet. Gynecol. Reprod. Biol.244,\n51–55 (2020).\n18. The Lancet Oncology Incorporating whole-genome sequencing into\ncancer care.Lancet Oncol.25, 945 (2024).\n19. ClinicalTrials.Gov. https://clinicaltrials.gov/study/NCT03835819.\n20. Nishikawa, T. et al. Trastuzumab deruxtecan for human epidermal\ngrowth factor receptor 2-expressing advanced or recurrent uterine\ncarcinosarcoma (NCCH1615): The STATICE Trial.J. Clin. Oncol.41,\n2789–2799 (2023).\n21. Yoshida, H. et al. Discordances in expression of human epidermal\ngrowth factor receptor 2 between primary and metastatic uterine\ncarcinosarcoma: A proposal for HER2-targeted therapy specimen\nselection. Ann. Diagn. Pathol.65, 152150 (2023).\n22. Resnick, M. B. et al. Cancer-testis antigen expression in uterine\nmalignancies with an emphasis on carcinosarcomas and papillary\nserous carcinomas.Int. J. Cancer101, 190–195 (2002).\n23. Alrohaibani, A. et al. PReferentially expressed antigen in MElanoma\nexpression in uterine and ovarian carcinosarcomas.Int. J. Gynecol.\nPathol. 43, 284–289 (2024).\n24. Huang, G. S. et al. Serum CA125 predicts extrauterine disease and\nsurvival in uterine carcinosarcoma.Gynecol. Oncol.107, 513–517\n(2007).\n25. Konet, A. et al. Performance of two large language models for data\nextraction in evidence synthesis.Res. Synth. Methodshttps://doi.org/\n10.1002/jrsm.1732 (2024).\n26. Yano, M. et al. Pembrolizumab and radiotherapy for platinum-\nrefractory recurrent uterine carcinosarcoma with an abscopal effect: A\ncase report.Anticancer Res. 40, 4131–4135 (2020).\n27. Rubinstein, M. M. et al. Durvalumab with or without tremelimumab in\npatients with persistent or recurrent endometrial cancer or\nendometrial carcinosarcoma: A randomized open-label phase\n2 study.Gynecol. Oncol.169,6 4–69 (2023).\n28. Lheureux, S. et al. Translational randomized phase II trial of\ncabozantinib in combination with nivolumab in advanced, recurrent,\nor metastatic endometrial cancer.J. Immunother Cancer10, e004233\n(2022).\n29. Saab, K. et al. Capabilities of Gemini Models in Medicine.arXiv [cs.AI]\n(2024).\n30. Arora, K. et al. Genetic ancestry correlates with somatic differences in\na real-world clinical cancer sequencing cohort.Cancer Discov.12,\n2552–2565 (2022).\n31. Mendes Gomes, L. B. et al. Primary peritoneal carcinosarcoma in a\nbreast cancer patient harboring a germline BRCA2 pathogenic\nvariant: Case report.Case Rep. Oncol.17,1 –9 (2024).\n32. Han, T. et al. MedAlpaca - An open-source collection of medical\nconversational AI models and training data.arXiv [cs.CL](2023).\n33. Johnson, A. E. W. et al. MIMIC-IV, a freely accessible electronic health\nrecord dataset.Sci. Data10, 1 (2023).\n34. Siebrasse, B. MTB Kerndatensätze_V01 (öffentlich zugänglich) -\nDNPM AG - MedInf - IBMI-UT Conﬂuence. https://ibmi-ut.atlassian.\nnet/wiki/spaces/DAM/pages/2592722/MTB+Kerndatens+tze_\nV01+ffentlich+zug+nglich.\n35. Illert, A. L. et al. The German network for personalized medicine to\nenhance patient care and translational research.Nat. Med.29\n,\n1298–1301 (2023).\n36. Tamborero, D. et al. The Molecular Tumor Board Portal supports\nclinical decisions and automated reporting for precision oncology.\nNat. Cancer3, 251–261 (2022).\n37. Li, Y., Wang, H., Yerebakan, H. Z., Shinagawa, Y. & Luo, Y. FHIR-GPT\nenhances health interoperability with large language models.NEJM AI\n1, AIcs2300301 (2024).\n38. Hegghammer, T. OCR with Tesseract, Amazon Textract, and Google\nDocument AI: a benchmarking experiment.J. Computational Soc. Sci.\n5, 861–882 (2022).\n39. Gemma Team et al. Gemma 2: Improving Open Language Models at a\nPractical Size.arXiv [cs.CL](2024).\n40. Xie, S. M., Raghunathan, A., Liang, P. & Ma, T. An explanation of in-\ncontext learning as implicit Bayesian inference.arXiv [cs.CL](2021).\n41. Gemini Team et al. Gemini 1.5: Unlocking multimodal understanding\nacross millions of tokens of context.arXiv [cs.CL](2024).\n42. Mosqueira-Rey, E., Hernández-Pereira, E., Alonso-Ríos, D., Bobes-\nBascarán, J. & Fernández-Leal, Á Human-in-the-loop machine\nlearning: a state of the art.Artif. Intell. Rev.56, 3005–3054 (2023).\n43. Marshall, I. J. & Wallace, B. C. Toward systematic review automation:\na practical guide to using machine learning tools in research\nsynthesis. Syst. Rev.8, 163 (2019).\n44. Jenkins, T. M., Cantrell, L. A., Stoler, M. H. & Mills, A. M. HER2\noverexpression and ampliﬁcation in uterine carcinosarcomas with\nserous morphology.Am. J. Surg. Pathol.46, 435–442 (2022).\n45. Nicoletti, R. et al. T-DM1, a novel antibody-drug conjugate, is highly\neffective against uterine and ovarian carcinosarcomas\noverexpressing HER2.Clin. Exp. Metastasis32,2 9–38 (2015).\n46. Edmondson, R. J. et al. Phase 2 study of anastrozole in rare cohorts of\npatients with estrogen receptor/progesterone receptor positive\nleiomyosarcomas and carcinosarcomas of the uterine corpus: The\nPARAGON trial (ANZGOG 0903).Gynecol. Oncol.163, 524–530\n(2021).\n47. Soiffer, J. L. et al. Durable partial response to pembrolizumab,\nlenvatinib, and letrozole in a case of recurrent uterine carcinosarcoma\nwith ESR1 gene ampliﬁcation. Gynecol. Oncol. Rep.54, 101426\n(2024).\n48. Saito, A. et al. Folate receptor alpha is widely expressed and a\npotential therapeutic target in uterine and ovarian carcinosarcoma.\nGynecol. Oncol.176, 115–121 (2023).\n49. Porter, R. L. et al. Abstract CT008: A phase 2, two-stage study of\nmirvetuximab soravtansine (IMGN853) in combination with\npembrolizumab in patients with microsatellite stable (MSS) recurrent or\npersistent endometrial cancer.Cancer Res.84, CT008–CT008 (2024).\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 12\n50. Tymon-Rosario, J. R. et al. Homologous recombination deﬁciency\n(HRD) signature-3 in ovarian and uterine carcinosarcomas correlates\nwith preclinical sensitivity to Olaparib, a poly (adenosine diphosphate\n[ADP]- ribose) polymerase (PARP) inhibitor.Gynecol. Oncol.166,\n117–125 (2022).\n51. Roszik, J. et al. Overexpressed PRAME is a potential immunotherapy\ntarget in sarcoma subtypes.Clin. Sarcoma Res.7, 11 (2017).\n52. Raji, R. et al. Uterine and ovarian carcinosarcomas overexpressing\nTrop-2 are sensitive to hRS7, a humanized anti-Trop-2 antibody.J.\nExp. Clin. Cancer Res.30, 106 (2011).\n53. Lopez, S. et al. Preclinical activity of sacituzumab govitecan (IMMU-132)\nin uterine and ovarian carcinosarcomas.Oncotarget11, 560–570 (2020).\n54. Santin, A. et al. Preliminary results of a phase II trial with sacituzumab\ngovitecan-hziy in patients with recurrent endometrial carcinoma\noverexpressing Trop-2.J. Clin. Orthod.41, 5599–5599 (2023).\nAcknowledgements\nJ.L. acknowledges a 5000 USD funding in Google Cloud credits from\nGoogle's Gemma Academic Research Program. Figure1 and Figure3\ninclude free icons sourced from Flaticon.com. OpenAccess funding enabled\nand organized by Projekt DEAL.\nAuthor contributions\nConceptualisation: J.L., M.T.; project administration: J.L., M.T.; resources:\nJ.L., N.P., K.S. and S.L.; validation: J.L., N.P., L.K., K.S., S.L., U.S., H.B.,\nM.T.; writing— originaldraft preparation: J.L., M.T.; writing— review& editing:\nS.M., T.D., L.M., P.M., D.F., J.N.K., D.T., L.C.A., K.K.B., M.B., M.K., U.S.,\nH.B. All authors contributed scientiﬁc advice and approved theﬁnal version\nof the manuscript.\nFunding\nOpen Access funding enabled and organized by Projekt DEAL.\nCompeting interests\nJ.L. received honoraria from the Forum for Continuing Medical Education\n(FomF), AstraZeneca GmbH (Germany), and Novartis Pharma GmbH\n(Germany). J.N.K. declares consulting services for Owkin, France; DoMore\nDiagnostics, Norway; Panakeia, UK, and Scailyte, Basel, Switzerland;\nfurthermore J.N.K. holds shares in Kather Consulting, Dresden, Germany;\nand StratifAI GmbH, Dresden, Germany, and has received honoraria for\nlectures and advisory board participation by AstraZeneca, Bayer, Eisai,\nMSD, BMS, Roche, Pﬁzer and Fresenius. D.T. received honoraria for lectures\nby Bayer and holds shares in StratifAI GmbH, Germany. K.K.B. has received\nhonoraria for lectures by GE HealthCare and Canon Medical Systems\nCorporation. M.K. has received fees from Springer Press, Biermann Press,\nCelgene, AstraZeneca, Myriad Genetics, TEVA, Eli Lilly, GSK, Seagen,\nAllergoSan, FomF, Roche, BESINS, Bayer AG. M.K. has received honoraria\nfor consulting and advisory board participation by Myriad Genetics,\nBavarian KVB, DKMS Life, BLAEK, TEVA, Exeltis, Roche, BESINS, Bayer\nAG. M.K. holds shares in AIM GmbH, in-manas GmbH, Therawis Diagnostic\nGmbH. H.B. has received personal fees from Roche, AstraZeneca, Gilead,\nand GlaxoSmithKline outside the submitted work. The authors have no\nadditional ﬁnancial or non-ﬁnancial conﬂicts of interest to disclose.\nAdditional information\nSupplementary informationThe online version contains\nsupplementary material available at\nhttps://doi.org/10.1038/s41746-025-01810-z.\nCorrespondenceand requests for materials should be addressed to\nJacqueline Lammert.\nReprints and permissions informationis available at\nhttp://www.nature.com/reprints\nPublisher’s noteSpringer Nature remains neutral with regard to\njurisdictional claims in published maps and institutional afﬁliations.\nOpen AccessThis article is licensed under a Creative Commons\nAttribution 4.0 International License, which permits use, sharing,\nadaptation, distribution and reproduction in any medium or format, as long\nas you give appropriate credit to the original author(s) and the source,\nprovide a link to the Creative Commons licence, and indicate if changes\nwere made. The images or other third party material in this article are\nincluded in the article’s Creative Commons licence, unless indicated\notherwise in a credit line to the material. If material is not included in the\narticle’s Creative Commons licence and your intended use is not permitted\nby statutory regulation or exceeds the permitted use, you will need to\nobtain permission directly from the copyright holder. To view a copy of this\nlicence, visithttp://creativecommons.org/licenses/by/4.0/.\n© The Author(s) 2025\n1Department of Gynecology and Center for Hereditary BreastandOvarian Cancer, Technical University of Munich (TUM),School of Medicine andHealth,Klinikum rechts\nder Isar, TUM University Hospital, Munich, Germany.2Center for Personalized Medicine (ZPM), Technical University of Munich (TUM), School of Medicine and Health,\nKlinikum rechts der Isar, TUM University Hospital, Munich, Germany.3Institute of Artiﬁcial Intelligence in Medicine and Healthcare, Technical University of Munich (TUM),\nSchool of Medicine and Health, Klinikum rechts der Isar, TUM University Hospital, Munich, Germany.4EUropean Reference Network for RAre CANcers (EURACAN)\nInitiative, partner site Munich, Munich, Germany.5Institute of Pathology, Technical University of Munich (TUM), School of Medicine and Health, Munich, Germany.\n6Google Cloud, Munich, Germany.7Department of Dermatology and Allergy Biederstein, Technical University of Munich (TUM), School of Medicine and Health, Klinikum\nrechts der Isar, TUM University Hospital, Munich, Germany.8Institute for History, Theory and Ethics of Medicine, University of Mainz Medical Center, Mainz, Germany.\n9Institute of Medical Bioinformatics and Systems Medicine, Medical Center-University of Freiburg, Faculty of Medicine, University of Freiburg, Freiburg, Germany.10Else\nKroener Fresenius Center for Digital Health, Technical University Dresden, Dresden, Germany.11National Center for Tumor Diseases, Heidelberg University Hospital,\nHeidelberg, Germany; DepartmentofMedical Oncology,Heidelberg University Hospital, Heidelberg, Germany.12Departmentof Medicine I, University Hospital Dresden,\nDresden, Germany.13Department of Diagnostic and Interventional Radiology, University Hospital RWTH Aachen, Aachen, Germany.14Department of Diagnostic and\nInterventional Radiology, Technical University of Munich, School of Medicine and Health, Klinikum rechts der Isar, TUM University Hospital, Munich, Germany.\n15Department of Cardiovascular Radiology and Nuclear Medicine, Technical University of Munich, School of Medicine and Health, German Heart Center, TUMUniversity\nHospital, Munich, Germany.16Department of Medicine II, Technical University of Munich (TUM), School of Medicine and Health, Klinikum rechts der Isar, TUM University\nHospital, Munich, Germany. e-mail: Jacqueline.Lammert@tum.de\nhttps://doi.org/10.1038/s41746-025-01810-z Article\nnpj Digital Medicine|           (2025) 8:420 13",
  "topic": "Medicine",
  "concepts": [
    {
      "name": "Medicine",
      "score": 0.4447074830532074
    },
    {
      "name": "Computer science",
      "score": 0.38514813780784607
    }
  ]
}